{
    "articleURL": "/sport/football/article-12059331/Lionel-Messi-accepts-deal-join-Saudi-Arabian-club-Al-Hilal-PSG-Barcelona-snub.html",
    "content": [
        "Messi will concentrate on PSG for now and make a decision in the summerAl-Hilal of Saudi Arabia have tabled an offer worth £320million-a-season Barcelona and Inter Miami are also interested in signing the World Cup winner Lionel Messi is prepared to wait until the end of the season before deciding his next step.",
        "The Argentina captain has an offer from Al-Hilal in Saudi Arabia worth around £320million a year that has been on the table for over a month yet he is no rush to accept it.Instead Messi is concentrating on the season's finale with Paris Saint-Germain, despite his current two week suspension, and wants to end the campaign with the French league title.Messi's father Jorge has already informed PSG he does not wish to accept their offer for another year's contract as he remains unconvinced about their sporting project.Barcelona and Inter Miami hold strong interest but in Barca's case they have yet to clear the financial hurdles necessary to bring their former idol back to the Camp Nou.",
        "PSG are also looking to offload Neymar in an effort to reconnect with their fanbase and recruit young French players.They want a centre-back, holding midfielder, striker and two wingers this summer with Crystal Palace winger Michael Olise identified as one of them.Spanish outlet El Chiringuito reported Messi could be joined at Al-Hilal by his former Barcelona team-mate Sergio Busquets, who will accept a two-season deal, and potentially also Jordi Alba.Messi is already a tourism ambassador for the country, paid £25m-a-year to do so, and it was an unauthorised visit to Riyadh last week that hastened his exit from the Parc des Princes.",
        "Messi, wife Antonela Roccuzzo and children Ciro and Mateo were photographed enjoying attractions in the capital Riyadh and Diriyah during their visit.  PSG's players had a scheduled day off on the Monday but following their 3-1 defeat to Lorient the previous day, manager Christophe Galtier ordered them in for extra training.Messi, however, was already in transit to Saudi Arabia - a country where he could be playing his football next season - and wasn't able to turn back.Because the trip was not sanctioned by Galtier, nor by sporting director Luis Campos, PSG suspended Messi for 15 days and also docked some of his wages.On Friday, Messi apologised in a social media message to the club and his team-mates for missing the training session. 'I thought we were going to have a day off after the game as always,' Messi began in the 39-second clip shared onto his Instagram story.",
        "'I had this trip organised and I couldn't cancel it. I had already cancelled it before. I apologise to my team-mates and I'm waiting for what the club wants to do with me.'The apology was accepted and, after Messi missed PSG's 3-1 win over Troyes on Sunday, he returned to training with them on Monday. But despite coming back into the PSG fold early, Messi is set to move away this summer.",
        "Fans gathered outside the club headquarters on Wednesday to chant for the PSG board to resign, while they also called for Messi to leave the club, with the Argentinian also receiving jeers from supporters at recent matches.PSG have been trying to extend his contract over the last few months, but that is now up in the air after Monday's developments.If Messi's offer from Al-Hilal is worth £320m, it will exceed the £175m-a-year Ronaldo earns at Al-Nassr.Messi's mission will be to restore Al-Hilal to the top of the Saudi Pro League and re-establish them as a dominant force in Asian continental football.They are presently fourth in the domestic standings, seven points behind second-placed Al-Nassr and 10 off the leaders Al-Ittihad. ",
        "El Chiringuito report that former Spain defensive midfielder Busquets, 34, will also move to Al-Nassr after accepting their proposal.Busquets, who played alongside Messi for the majority of his career, is out of contract this summer and reportedly hasn't been impressed by Barcelona's 'very low' renewal offer.The cash-strapped Catalan side have massive financial issues which are limiting the wages they can offer players. Long-serving left-back Alba, 34, could also leave the Nou Camp and El Chiringuito say he too will go to Al-Hilal if he agrees to terminate his Barcelona contract, which has one year left to run. "
    ]
}