{
    "articleURL": "/news/article-12047125/Disabled-mans-wife-allegedly-enslaved-insists-happy-marriage.html",
    "content": [
        "Tom Somerset-How, 40, has cerebral palsy and was allegedly kept like a prisonerHis wife Sarah, 48, and carer George Webb, 50, said to have drained his financesThe wife of a disabled man who cheated on him with his carer today told a court her marriage had been 'strong and really good' but that she felt 'exhausted' when his health took a turn for the worse.",
        "Sarah Somerset-How and her lover George Webb allegedly 'enslaved' her husband Tom, barely keeping him alive as they spent his money while treating him 'like a piece of property'.While they bought themselves lingerie and DJ equipment with cash he had been given by relatives, the 40-year-old, who was an 'intelligent' history graduate with cerebral palsy, was left as a 'prisoner in his own home', a jury has been told.Mrs Somerset-How, 49, today told the court she 'literally didn't sleep for six weeks' after her husband's eyesight took a downturn and he had hip and eye surgery meaning he was unable to go out on his own.She and Webb, 50, are charged with holding a person in slavery and ill-treatment by a care worker at her husband's home in Chichester, West Sussex.",
        "Webb faces a charge of ABH against Mr Somerset-How after an incident where he is accused of hitting him with a shoe.Mrs Somerset-How also faces charges of fraud and theft, but similar charges against Webb were dropped for lack of evidence.Giving evidence, Mrs Somerset-How told jurors how she first met her husband and said romance blossomed as they 'clicked' and 'conversation flowed'.She said: 'Gina, a mutual friend, put us in touch. She asked me if she could pass my number to Tom. She told me he was in a wheelchair and had cerebral palsy. We texted for about a day and a half and then had a phone call.",
        "'We had Skype calls as well. We clicked. We were in contact for about two or three weeks before we met.'Tom encouraged me to ask questions, but I didn't ask. Tom was a person at the end of the day and had a personality, he wasn't just a man in a wheelchair.'We decided to meet and I drove down to Chichester. We had dinner, I can't remember the name but it was in a converted church in Chichester.'We laughed and the conversation flowed.'We wanted to spend more time together. I would drive down after work on a Friday and when I took annual leave. Before Tom, I would take luxury holidays, go on spa days, go to Cyprus - me time.'When asked if their relationship was romantic from the start, she said it 'developed over time'.",
        "She said: 'We were both attracted to each other but it developed over time. I moved in with him in 2010 and we didn't take this lightly. I didn't know anyone in Chichester apart from Tom.'When asked if moving in with Tom affected his benefits, she said he lost his housing benefit, council tax benefit and income support.She told the jury this meant she had to pay for their rent and council tax as well as £990 of arrears.",
        "The rent was £500 and the council tax was £120, she told the court, but Tom contributed to their bills.Mrs Somerset-How told the court she would do the two-hour drive to Oxfordshire every morning to her job at the non-profit agricultural company CABI when she first moved in.She said that although they were in love she did not want to become his full-time carer, telling the court: 'Our relationship was strong. It was good. It was really good. I was happy to help but I didn't want the full-time responsibility of it.'Mr Somerset-How had a hip operation and eye surgery in 2013, which his wife told the court 'took a toll' on their relationship and it became clear she needed help supporting her husband.She said: 'I couldn't sleep. It took its toll on us. Neither of us knew how to deal with it.'So we just had to manage the best we could. When Tom lost his sight he couldn't go out by himself.",
        "'I didn't know how to support Tom. One day he was fine the next he had no vision. Neither of us could believe it. It was awful. I literally didn't sleep for six weeks. I was exhausted.'I was still working at the time. I started sleeping in the living room so I wouldn't disturb Tom.",
        "'I had a friend from work who came down to help me. She was the only person.. There was nobody there for me, it just had to suck it up.'The court has heard Webb began working for the couple in 2016.They allegedly left wheelchair-bound Mr Somerset How - who is almost blind and needs 24-hour care - in bed for 90 per cent of the time, allowed him a shower once a week and went for a whole year without brushing his teeth.For food he would be left with only a packet of crisps and a sandwich, the court was told, while Somerset-How carried out a plan to 'ostracise' him from his family and use him as 'a cash cow'.The jury was told that eventually Mr Somerset-How managed to raise the alarm about how he was being treated with a friend who alerted his parents.They then staged a rescue with police and social services, 'an operation that had the marks of extracting someone as a hostage', the court heard.Sarah Somerset-How said that after Webb began working for them he would 'assist' her husband with 'fashion tips'.She said: 'Sometimes we would take Tom into town to get his hair cut.'Tom wanted a crew cut and George would assist with fashion tips and how to do his hair.'",
        "When asked about Tom's eating habits, she said: 'Tom's weight would go up and down, up and down.'No one ever raised concerns about his food intake and George was very mindful.'George would always be mindful and did research to make sure everything was full fat and trying to get calories into him. We never forced him to eat.'The pair deny the charges.The trial at Portsmouth Crown Court continues tomorrow."
    ]
}