{
    "articleURL": "/wires/pa/article-12059215/Star-studded-Coronation-Concert-draws-average-audience-10-million.html",
    "content": [
        "The Coronation Concert on Sunday night was watched by an average audience of 10.1 million, according to overnight figures from the BBC.",
        "The star-studded event at Windsor Castle, which saw performances from Lionel Richie, Katy Perry and Take That, had a peak viewership of 12.3 million, the broadcaster said.Kate Phillips, BBC Director of Unscripted, said: “Last night’s Coronation Concert was an unforgettable evening of spectacular performances that brought us all together in celebration.",
        "“Against the stunning backdrop of Windsor Castle, the concert reflected many of the King’s passions and highlighted the outstanding talent we have in the UK and beyond.Quoting a hit from the concert’s closing act, Take That, she added: “We hope that viewers ‘never forget’ it!”.Host Hugh Bonneville kicked off the celebrations and met Muppet star Miss Piggy, before the Prince of Wales took to the stage paying a touching tribute to his father and his late grandmother the Queen.",
        "Stars including Hugh Jackman, Pierce Brosnan, Dame Joan Collins, Bear Grylls OBE, Alan Titchmarsh, and Sir Tom Jones gave pre-recorded video messages in honour of the King throughout the concert.Top Gun star Tom Cruise also delivered a video message from his War Bird plane, saying: “Pilot to pilot. Your Majesty, you can be my wingman any time,” before saluting and banking away.Musical collaborations included opera stars Andrea Bocelli and Sir Bryn Terfel, who sang You’ll Never Walk Alone, and classical pianist Lang Lang and pop star Nicole Scherzinger, who performed Reflection from Mulan.",
        "More reflective moments included Stella McCartney’s address about the environment and a Winnie the Pooh skit which did not seem to elicit as much of a response as Paddington Bear’s appearance with Queen Elizabeth II during the late monarch’s Platinum Jubilee celebrations.The Platinum Jubilee concert, which took place in front of Buckingham Palace last June, was watched by an average of 13.1 million people on BBC One.In addition, the King’s coronation service at Westminster Abbey on Saturday was watched by more than 18 million viewers in the UK, provisional figures showed.",
        "The ceremony was broadcast simultaneously on a range of channels between about 11am and 1pm, including BBC One and Two, ITV and Sky News.An average of 18.8 million people watched across 11 channels and services, with audience figures peaking at 20.4 million when the King was crowned just after midday, according to overnight ratings released by the research organisation Barb.The figure is not quite as high as the ratings for the funeral service of the late Queen last September which was seen by 26.5 million people across more than 50 TV channels."
    ]
}