{
    "articleURL": "/wires/reuters/article-12050275/London-stocks-rebound-rate-pause-bets-energy-boost.html",
    "content": [
        "HSBC gains after defeating bank break-up bid",
        "British Airways parent IAG gains on upbeat forecastIHG falls as CEO set to step downFTSE 100 up 1.0% FTSE 250 adds 1.1%(Updates throughout to market close, adds comment, US jobs data and HSBC shares in paragraph 5 and 9)By Shristi Achar A and Amruta KhandekarMay 5 (Reuters) - Gains in financial and energy shares helped lift the UK's FTSE 100 on Friday, in a roller-coaster week marked by interest rate hikes from major central banks as well as renewed concerns about the U.S. banking system.The internationally focused index ended 1% higher, a day after hitting a one-month low.The oil and gas sector jumped 2.4%, tracking crude prices higher, while banks were also a big boost to the FTSE 100.Among major movers, HSBC gained 2.7% after soundly defeating a bid to break up the bank and potentially spin out its lucrative Asian business at its annual investor meeting.Despite Friday's gains, the blue-chip index logged weekly declines, with energy stocks among the top losers as the U.S. banking sector turmoil fanned recession jitters and took the shine off upbeat earnings and rate hike pause hopes.A strong U.S. monthlypayrolls reporton Friday has allayed some concerns about the economy, helping stocks move a leg higher, analysts said.",
        "\"The perception seems to be if (the jobs report) doesn't take the idea of recession off the table, it certainly pushes it back in terms of timing,\" said Steve Sosnick, chief strategist at Interactive Brokers.The U.S. Federal Reserve and the European Central Bank hiked interest rates by 25 basis points (bps) this week, with a decision from the Bank of England due next week.Markets in London will be closed on Monday on account of a bank holiday following the official coronation of King Charles over the weekend.The domestically focused FTSE 250 index rose 1.1% as the pound touched a near one-year high against the dollar in the run-up to the BoE's decision.IAG rose 2.3% after lifting its 2023 profit forecasts on strong travel demand.IHG Plc lost 1.9% after the Holiday Inn owner said its CEO Keith Barr would step down. (Reporting by Shristi Achar A and Amruta Khandekar in Bengaluru; Editing by Nivedita Bhattacharjee, Rashmi Aich and Anil D'Silva)"
    ]
}