{
    "articleURL": "/wires/reuters/article-12058873/First-time-voters-decisive-say-Turkish-election.html",
    "content": [
        "More than 6 mln people expected to vote for first time",
        "Many Turks have known only Erdogan as ruler, some want changeOne voter cites concerns over human rightsAnother plans to vote Erdogan, but wants policy changesBy Birsen Altayli and Ezgi ErkoyunISTANBUL, May 8 (Reuters) - Turkish university student Yunus Efe has known only one leader of his country - Tayyip Erdogan. As he prepares to vote for the first time in elections this month, the 22-year-old says it is time for change.Efe is one of more than 6 million first-time voters expected to cast ballots in the May 14 election. Roughly 10% of the electorate, their votes could prove critical in deciding whether Erdogan's rule continues into a third decade or comes to an end.A toddler when Erdogan came to power in 2003, Efe said his vote will go to the opposition's Kemal Kilicdaroglu, who he believes will strengthen rule of law, human rights and freedom of expression - which critics say have suffered under Erdogan.\"I am definitely concerned about freedom of expression. In fact, I experience this every day but we do not realize it because we got used to living this way,\" said Efe, describing how he thinks twice before liking or sharing social media posts.Human Rights Watch, in a 2022 report, said thousands of people have faced arrest and prosecution every year in Turkey for social media posts, typically charged with defamation, insulting the president, or spreading terrorist propaganda.",
        "Ankara says its measures are necessary to fight disinformation spreading on media and internet.Efe said he had been apathetic about the elections and politics \"like many young people\", but was now excited to vote and attracted by the promises of Kilicdaroglu and his Republican People's Party (CHP), one of six parties allied against Erdogan.\"I think that the rights can be restored and justice can be re-established,\" Efe said, speaking in central Istanbul.The sentiment points to the challenge facing Erdogan and his Islamist-rooted AK Party as they try to rally support for the presidential and parliamentary polls, with their popularity hit by a cost-of-living crisis and dizzying inflation.Sensing their best chance yet of unseating Erdogan, his opponents are promising to reverse many of his signature policies, including abolishing the all-powerful presidency seen by critics as a symbol of his drive to wield ever greater control.'ANGRY AND HOPELESS'Erdogan's share of the vote among young and first-time voters is forecast to be lower than among other age groups, said Erman Bakirci from pollster Konda Arastirma.Describing young voters as a \"very angry and hopeless\" segment of Turkey's 85 million people, Bakirci said they would be crucial to the result because they are such a large block.\"They see via internet and social media what their peers in Europe are doing and what opportunities they have,\" Bakirci said. \"They see that the difference between them widened ... They lack social, economic and legal security. They want to get out of this situation.\"",
        "Erdogan has championed the youth in his campaign while also criticising them for failing to appreciate how Turkey's economy has developed on his watch, harking back to more difficult times before the AK Party came to power.Erdogan, who oversaw an economic boom in his first several years in power, has traditionally drawn support from Turkey's conservative voters in Turkey's Anatolian Islamic heartlands.Research conducted by pollster Konda last year showed that 57% of the first-time voters described themselves as modern, 32% described themselves as traditional conservatives, and the remainder described themselves as religious conservatives.Emre Orgun, a 22-year-old who works in the information technology department of a textile company in Istanbul, said he would be voting for Erdogan because he did not think the opposition could manage Turkey as well as the veteran leader.\"Of course I want the current government to continue. We want them to continue with some changes in some officials and policies,\" Orgun said. He said his main problems are high prices and job opportunities.But a patternmaker working at the same Istanbul company said she would cast her vote for Kilicdaroglu.The patternmaker, who gave her name as Berivan, said she had been forced to give up on her dream of becoming a lawyer due to financial constraints. Criticising the state of the education system and the economy, she said you need friends in the right places to get anywhere.",
        "\"I believe the youth has the opportunity to change things. I think many young people think the same way. Education and the economy are in very bad condition,\" said Berivan, speaking from the company's sewing workshop.\"This situation can be changed by the person the youth chooses to trust,\" Berivan said. \"We have only one choice as a candidate and we have to trust him.\"(Reporting by Ezgi Erkoyun and Birsen Altayli; Editing by Tom Perry and Nick Macfie)"
    ]
}