{
    "articleURL": "/health/article-12042165/Teen-vaping-slashed-70-fruity-flavors-banned-study-finds.html",
    "content": [
        "Researchers at Ohio State University found bans could drive down vaping ratesThey said non-tobacco flavors were leading to youth interest in the productsREAD MORE: Nicotine in devices makes vapes WORSE than smoking, say expertsThe teenage vaping crisis could be nipped in the bud if fruit and menthol flavors were banned, a study suggests.",
        "Seventy percent of current vapers aged 14 to 21 said they would kick the habit if the devices tasted like normal cigarettes.Banning menthol would be critical, though. When asked if they would quit vapes entirely if only fruit flavors were banned, just 40 percent said 'yes'.America and the UK are in the midst of what some have dubbed a child vape epidemic, with growing reports of classrooms and playgrounds being turned to smoke clouds due to so many young people getting hooked.",
        " In the US, around one in five children - 2.55million - in middle and high schoole admit using the devices at least once a month.",
        "Evidence is increasingly emerging that the devices are no better than cigarettes and can put people at risk of lung disease and cancer. ",
        "Researchers at Ohio State University surveyed 1,400 vapers aged 14 to 21 years old from across the US who had vaped at least once in the previous 30 days — defined as regular use.  Participants said their favorite flavors were fruit (45 percent), which included pineapple lemonade and blue raspberry and fruit ice (30.5 percent), or fruit and menthol, such as juicy grape ice and banana ice.For comparison, only one in ten said menthol was their favorite while three percent said they preferred tobacco.",
        "They were all asked the hypothetical questions: 'Would you use your [e-cigarette] if it were only available in tobacco and menthol flavors?'And: 'Would you use your [e-cigarette] if it were only available in tobacco flavor?'Results showed that 549 teenagers (38.8 percent) said they would quit under a flavored e-cigarette ban.But if this was extended to menthol vapes too, then 1,001 (70.8 percent) said they would no longer puff on e-cigarettes.Researchers noted in their study that it was hypothetical and could not prove that youngsters would actually drop vaping should flavors be banned.But they added that flavors were clearly 'important for their interest in' and 'continued use' of e-cigarettes.",
        "Limitations of the study included that the participants were majority white and female, meaning the results could not be generalized to the child population.There was also a risk that children had misunderstood the question, researchers said, and thought that the bans would only apply to the specific vape device they used — rather than all flavors. The study was published in the Journal of Studies on Alcohol and Drugs. Four US states — Massachusetts, New Jersey, New York and Rhode Island — have already banned flavored e-cigarettes, while California has restricted their sale in stores.Studies have suggested, however, that when bans were brought in they raised the risk of youngsters switching to smoking instead of vaping.",
        "Vapes were once touted as being a healthy alternative to smoking and an excellent way to help people wean themselves off nicotine.But evidence is mounting that they pose a similar health risk as smoking and may be enticing an entirely new generation of nicotine users who would normally not take up cigarettes."
    ]
}