{
    "articleURL": "/femail/article-12051677/I-flew-American-Airlines-forced-change-clothes-flying.html",
    "content": [
        "Comedian and YouTuber Chrissie Mayr tweeted about the incident It happened when she was traveling with her friend from Las Vegas to Dallas Chrissie told DailyMail.com that 'it was such a mortifying situation' Two women have expressed their humiliation after claiming they were forced to change their outfits in front of other passengers before boarding a plane.",
        "Comedian and YouTuber Chrissie Mayr tweeted about the incident - which happened when she was traveling with her friend, Keanu Thompson, from Las Vegas to Dallas on American Airlines - and the post quickly garnered more than 200,000 views. In the tweet, she reveals the outfits she and Keanu were initially wearing. Hers consists of sheer sparkly flared pants and a matching cropped long-sleeve top, while Keanu poses in a long jungle-print skirt with slits running to the thigh and a matching bralette. ",
        "Bizarrely, the duo were told to change their pants at the gate, but the shorts they put on instead turned out to be more revealing. Chrissie exclaimed that 'THIS IS NO WAY TO TREAT A REWARDS MEMBER.'She told DailyMail.com that 'it was such a mortifying situation and I know this wouldn't have happened to us if we were trans, or obese or people of color.' Recounting the exact chain of events, she said: 'They didn't say what was wrong with our pants, the man at the gate just touched me on the arm and said: \"Come with me I need to speak with you… you have to change your pants.\"'It was such a panicked situation, I felt like I had to instantly do what he said or else we wouldn't be allowed to board the plane. We also had plans to do appearances in Austin the next day (we're comedians) so we didn't want to be delayed.",
        "'I wish he had said, \"ladies take a few minutes go to the bathroom and find something else to wear.\" But he didn't specify why it was inappropriate nor did he tell us what else would be okay to put on. So I just grabbed the first thing in my luggage which was a a couple of pairs of shorts. 'All our other luggage had been checked. Then the other gate attendant told me that then the bag I had needed to be checked as well because there was no more overhead space left. So we had no way to change into something else on the plane.' In a follow up to her initial tweet, Chrissie explained that they both had to change at the gate 'with no cover' in front of other passengers. ",
        "Keanu also took to Twitter to highlight the debacle, writing: 'I don't understand how my friend and I were forced to change clothes AT THE GATE IN FRONT OF EVERYONE, minutes before our flight took off… the outfits we had on were more than appropriate.'She added in the thread that she was 'forced to be butt naked from the waist down at the gate' and the whole situation was 'completely bizarre.'Many commenters sympathized with the women. ",
        "One person tweeted in response to their story: 'I think that's absolutely crazy and should be against the law. 'How could they possibly make you undress in front of everyone that is wrong, very wrong. Especially since neither one of you look remotely suspicious whatsoever.' And another Twitter user commented: 'Wow!! Wow!! You girls need to make a serious complaint and get compensation, it seems like you've been singled out and made a joke of as the pants you were made to take off happened to be more than appropriate for travel.'In response to both women's tweets, American Airlines issued an automatic reply reading: 'Your comments concern us. DM us with additional details and your record locator.' While DailyMail.com has reached out to American Airlines for comment, Chrissie said she did receive an apology from a customer relations employee, but nothing more. The letter, which was sent via email, read: 'Thank you for taking the time to speak with me today. 'While I am very sorry to learn you and Ms. Thompson didn't have the best experience traveling out of Las Vegas recently, I do greatly appreciate the opportunity to assist you with your concerns. 'As mentioned in our conversation, we take matters of customer service very seriously. 'I have thoroughly documented the details you shared with me so they can be reviewed by appropriate leadership. I can assure you the behavior you witnessed will be addressed.'",
        "Asked what she would like to see happen, Chrissie replied: 'I would like American Airlines to apologize for having a male employee make us feel like we had to get undressed at the gate in front of everyone. 'Couldn't a woman have told us this? I really don't want this to happen to another woman. These dress code rules seem so arbitrarily enforced it seems like we were singled out because we were alone... or how we looked.'"
    ]
}