{
    "articleURL": "/wires/pa/article-12053951/Heavy-rain-fails-dampen-crowd-s-enthusiasm.html",
    "content": [
        "Heavy rain failed to dampen the enthusiasm of well-wishers hoping to catch a glimpse of the King and Queen.",
        "Fans cheered Charles and Camilla as they travelled down the Mall, with many holding Union flag umbrellas and wearing waterproof ponchos.All procession viewing areas along the route were filled to capacity and those who could not get in were encouraged to make their way towards Hyde Park where the coronation was being screened.Martin Viney flew from Australia with his wife to watch the coronation and arrived on the Mall at 5am.",
        "He said: “Historical things like this only happen once in a while.“As soon as my wife and I heard the coronation was happening we booked flights.“It’s an eye-opening event. It’s so different to any other event.”People in a grandstand in front of Buckingham Palace erupted into cheers after an announcement that “coronation day is here”, at about 8.30am.The stand has about 3,800 seats for veterans, NHS staff, social care workers and representatives of charitable organisations with links to the royal family.Crowds standing on either side of the Mall burst into chants of “hip hip hooray”, and campers had been singing and chanting since Friday.A Mexican wave started half way down the road, and Charles-themed £1 million notes were handed out to the crowd.In Trafalgar Square, artist Gideon Summerfield, 28, was sketching the procession route. He was one of three alumni of the Royal Drawing School tasked with recording the event.",
        "Mr Summerfield, drawing with chalk and pastels, said his fellow artists were stationed at Buckingham Palace and Westminster Abbey.He said: “It is such a massive honour.“It’s incredibly lucky to be able to capture such an historic moment. It’s great for a young artist to be able to capture it.“I’m totally indebted to the Royal Drawing School for the opportunity.”He said the King had helped to establish the school about 20 years ago."
    ]
}