{
    "articleURL": "/tvshowbiz/article-12057407/TV-host-Larry-Emdur-slammed-anti-Prince-Harry-meme-Coronation.html",
    "content": [
        "An Australian TV presenter has angered Sussex 'stans' by posting a meme mocking Prince Harry's seating placement at the King's coronation on Saturday.",
        "Larry Emdur, 58, shared a photo on Instagram of the Duke of Sussex with his view blocked at the historic event by the Princess Royal's towering feather hat.The moment, which was featured during the global live feed of the coronation, has gone viral on social media, with some royal fans speculating it was a deliberate move by the Firm to snub the runaway prince.Playing into these online theories, Emdur captioned his post: 'Charles: How can we block out the naughty one? Anne: Leave it to me bro.'While most of his fans found the post amusing, others criticised Emdur for sticking the boot into Harry, who is often mocked on Australian television.",
        "'Such a deads**t Larry! Who watches you anyway these days?' one troll commented.Emdur responded by posting the nasty comment on his Instagram grid and telling the troll to click unfollow if his content bothers them so much.'So, two things: Firstly, I 100 per cent agree with you,' the Channel Seven star began.'Secondly, and I'm not a qualified doctor, but honestly you need to unfollow me IMMEDIATELY!!!! And go and follow people on Insta who make you happy, make you smile and bring you joy. All the best,' he added.",
        "Emdur was flooded with support for his classy response.",
        "'Larry, you are the most funniest person ever. Keep it up and forget the haters as they don't have anything better to do,' one fan commented below his post. Princess Anne's massive feather hat, blocking the view of Harry behind her, was one of the major talking points on social media during the King's Coronation. Many speculated whether it was a deliberate move to 'punish' the Duke of Sussex, who has been outspoken in his criticism of the Royal Family in his autobiography Spare and recent Netflix series.Others also compared it to the moment Harry's wife Meghan was obscured by a giant candle during the Queen's funeral last year.",
        "One tweeted: 'Princess Anne has played a blinder in that hat, from certain angles it completely obscures Harry. It's the Jubilee candle all over again, but more outrageously feathery.'Another wrote: 'It's HILARIOUS that Harry is stuck sitting behind Anne who is wearing a giant hat with a plume on it as part of her uniform. No view for Harry!'A third added: 'Princess Anne's hat with the tall feather is this year's candle.'The Duke was seated between Princess Eugenie's husband Jack Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for ten years.",
        "They were joined by Prince Andrew's daughters Eugenie, 33, and Beatrice, 34, and her husband Edoardo Mapelli Mozzi.Only the senior working royals had a front row seat to the historic ceremony, made up of Prince William and Princess Catherine of Wales, the Duke and Duchess of Edinburgh - Edward and Sophie - and their children Lady Louise and James the Earl of Wessex, as well as the ever-popular Anne and her husband Sir Tim Laurence.Also in attendance was young Prince Louis, the star of the Platinum Jubilee when he stole the nation's hearts with his cheeky antics on the balcony.",
        "It's been reported that an incredible 2.5 billion people globally tuned in to watch the Coronation of King Charles III on Saturday. Prince Harry is now back in California after spending just 28 hours and 42 minutes in the United Kingdom to witness his father, King Charles' coronation on Saturday.Following the ceremony, he slipped out of Westminster Abbey - accompanied by a Metropolitan police escort and four outriders - with only the briefest of goodbyes and headed straight for Heathrow Airport.He was back on the plane to California before his father and stepmother, the newly crowned queen, had even finished having their official portraits taken."
    ]
}