{
    "articleURL": "/wires/afp/article-12039347/US-envoy-urges-Brazil-Ukraine-bully-Russia.html",
    "content": [
        "A senior US envoy called Tuesday in Brazil for robust support for Ukraine against \"bully\" Russia, renewing concern over remarks by Brazil's leader who partly blamed the West for the war.",
        "Linda Thomas-Greenfield, the US ambassador to the United Nations, met Brazil's foreign minister and the wife of President Luiz Inacio Lula da Silva, although not the leftist leader himself.Speaking to international relations students at the University of Brasilia, the US envoy said that Ukraine's struggle was about defending democracy.\"They are fighting against a bully that thought that it was OK to invade a country, take their territory and kill their people and rape their women,\" she said.\"What's the next country -- what other bully will think that they can do the same thing?\"We can't let Russia win in Ukraine, because Ukraine is fighting for the rights of people all over the world,\" she said.Lula, who returned to power in January, on a visit last month to China said that the United States, which has sent billions of dollars in weapons to Ukraine, was \"encouraging the war.\"His remarks triggered condemnation from the White House, which had earlier cast Lula as a natural ally on democracy, climate change and other issues of importance to President Joe Biden.Thomas-Greenfield said she discussed Ukraine with Foreign Minister Mauro Vieira and \"expressed, as the government has heard before, our disappointment in the statements that were made.\"But she noted that Brazil has voted at the United Nations to condemn Russia's invasion of Russia, an implicit contrast with other developing world powers that have stayed neutral, notably India and South Africa.",
        "\"We encourage countries to engage on issues related to finding a solution to the war, but it is important that, as they do that, they have to engage with Ukraine,\" she told reporters at the foreign ministry.She voiced support for Lula's plan to send a longtime aide, Celso Amorim, to Ukraine. Brazil has not joined sanctions on Russia, whose foreign minister, Sergei Lavrov, recently visited Brasilia and offered gratitude for Lula's remarks.- 'Ambivalence' from Lula -Lula, a former trade unionist who sought to chart out a more independent foreign policy when he was last in power from 2003 to 2010, has clarified that he condemns Russia's invasion, while calling for talks to end the conflict.Bruna Santos, director of the Brazil Institute of the Wilson Center think tank, said there was a \"lot of ambivalence\" in Lula's foreign policy, with anti-Americanism running deep in the Brazilian left. The United States supported Brazil's military dictatorship during the Cold War.",
        "She said that Lula's Ukraine remarks \"may jeopardize Brazil's interests on the global stage,\" although she expected the broader relationship to endure with the United States.Parallels have long run deep between the Western Hemisphere's two most populous nations.On January 8, supporters of defeated right-wing president Jair Bolsonaro rampaged through Brasilia, almost exactly two years after a violent insurrection by Donald Trump's partisans against Congress as it formalized Biden's victory.",
        "Thomas-Greenfield told the students that on January 8 she spoke to a Brazilian diplomat \"and he said, 'You guys export so much to the world. We didn't want you to export January 6.'\"Lula's wife Rosangela da Silva showed Thomas-Greenfield around the Panalto Palace, where shattered windows have been replaced but some damaged artwork has been removed.The first lady, known by her nickname Janja, said that the presidential office still felt a void but had emerged as a \"symbol of democracy.\"Writing later on Twitter, Janja, a close advisor to her husband, said that she and Thomas-Greenfield discussed \"the importance of strengthening democracy\" and the need to combat hate speech."
    ]
}