{
    "articleURL": "/femail/article-12051135/It-feels-like-yesterday-Kate-reminisces-wedding-Coronation-walkabout.html",
    "content": [
        "Kate Middleton, 41, spoke about her wedding with royal fan during a walkabout Read more: For all the latest Royal news, pictures and video click here Kate Middleton reminisced about her wedding during a royal walkabout today, confessing the past 12 years have 'gone by in a flash.' ",
        "The King and the Prince and Princess of Wales thrilled royal fans at The Mall as they made a surprise appearance to greet well-wishers less than 24 hours before the coronation this afternoon.The royal mother-of-three looked elegant for the occasion, donning a smart white dress with a black hemline detailing and a pair of £490  Aquazzura heels.Kate appeared in high spirits as she stopped and chatted to one royal fan, who confessed she had also been on The Mall to watch Kate and William's wedding in 2011. The Princess appeared touched, saying: 'It only feels like a couple of days ago and now we're just - it's 12 years ago. It feels like it's gone by in such a flash.'",
        "Prince William and Kate tied the knot on April 29, 2011 at Westminster Abbey, in a service that was watched by 36.7 million people across the world. Kate and William celebrated the 12 years of marriage just days ago, sharing a heart-warming new photograph from a family day out in Sandringham.In the photo, the couple appeared more in love than ever in a sweet outdoorsy snap posted on their social media accounts.The portrait, taken by environmental photographer Matt Porteous, saw the royal couple riding bikes in the Norfolk countryside with their arms around each other.",
        "The image is believed to have been from a series that was shared on Mother's Day and Christmas 2022 - and is now the fourth image we have seen from this particular day.The Mother's Day photographs had captured Kate spending quality time with Prince George, Princess Charlotte and Prince Louis - with Prince William nowhere to be seen.But the future king makes an appearance in the recently unveiled photograph, smiling with his arm around his wife as the pair enjoy a quiet bike ride without the children.It was simply captioned '12 years' - with a red emoji heart.",
        "The road leading to Buckingham Palace was cleared and royal fans eagerly lined the route, having likely figured out that they may well catch a glimpse of the new King due to the security and media presence.People cheered and could be heard shouting 'God Save the King' as the senior figures of the monarchy arrived to shake hands with well-wishers.Royal superfans were left blown away by the visit, which came just hours after a downpour soaked thousands of people camped out at The Mall, with one person telling Sky News: 'This is the happiest moment in my life.'The King went to one side of The Mall while William and Kate went to another to greet well-wishers. One woman told Charles 'Love you Charlie' while others passed on their congratulations to him.",
        "Kate and William posed for selfies with fans, while Kate even appeared to join one person in a video call before also speaking on another fan's phone before handing it back.Earlier, the King took part a final coronation rehearsal at Westminster Abbey, where a 2,300-strong congregation, and a television audience likely to be in the tens of millions, will watch him being crowned on Saturday.As excitement ramps for Britain's first coronation in 70 years, Charles and Kate joined a lunch for VIPs at Buckingham Palace.",
        "His Majesty was joined by working royals at a special event for prime ministers and governors general at the Palace from midday, just after the heavens opened on London.The Prince and Princess of Wales, the Duke and Duchess of Edinburgh, the Princess Royal and Vice Admiral Sir Tim Laurence were at the event. Completing the royal contingent were the Duke and Duchess of Gloucester and the Duke of Kent. But there was no invite for Prince Andrew, who was seen driving around Windsor this lunchtime.There were 42 attendees in total, including UK Prime Minister Rishi Sunak, Australia's republican Prime Minister Anthony Albanese, and Prime Minister of New Zealand Chris Hipkins.Charles, Queen Consort Camilla and Prince William had been at Westminster Abbey this morning for final rehearsals ahead of the Coronation tomorrow, around the time Prince Harry may have landed in the UK.",
        "His Majesty and his wife waved to crowds as he was driven down The Mall to the church for further preparations, before a run of diplomatic duties including hosting a Buckingham Palace lunch for VIPs.But the monarch looked shocked by the heavy rain as he passed thousands of people who are camped out along the route from the Abbey to the Palace including the packed Mall, dubbed Chaztonbury due to the huge numbers camped out there."
    ]
}