{
    "articleURL": "/wires/reuters/article-12043901/Czech-PM-hits-central-bank-budget-criticism.html",
    "content": [
        "PRAGUE, May 3 (Reuters) - The Czech National Bank has responsibility for bringing decades-high inflation under control and should refrain from blaming the government for its budget spending, Prime Minister Petr Fiala was quoted as saying on Wednesday.",
        "Fiala's comments came after the central bank came close to raising interest rates further after it had paused a sharp tightening cycle in mid-2022, after Governor Ales Michl took the helm of the bank's board.Michl said on Wednesday - after the bank board voted by a narrow 4-3 to keep the key policy rate at 7.00% and surprised markets with growing backing for a hike - that fiscal policy was a main concern and pushing up inflation risks.It followed data on Tuesday showing the state budget deficit doubled year-on-year between January and April.The independent central bank has in the past refrained from clashes with governments over policy.Fiala, in an interview with broadcaster CNN Prima News cited by CTK news agency, said the two needed to work together.\"But if the governor is calling on the government to act, then I say it is acting, and I would ask if the central bank is acting enough,\" Fiala said.The government's five coalition parties are seeking this month to agree budget cuts and increased tax revenue worth tens of billions of crowns to reduce next year's deficit. It targets a 2023 deficit of 295 billion crowns ($13.87 billion), down from a record deficit above 400 billion in 2021.Michl said on Wednesday that \"if no long-term credible consolidation package is announced, then it will simply create pro-inflationary pressures in the future and we will probably have to raise interest rates.\"",
        "The bank's key rate is at a more than two-decade high now, while inflation was at 15.0% in March. The economy is climbing out of a mild recession, and with a tight labour market, wage growth is picking up.Markets had not priced in chances of a hike before Wednesday and have mainly focussed on the timing of rate cuts this year. ($1 = 21.2690 Czech crowns) (Reporting by Jason Hovet; editing by Jonathan Oatis)"
    ]
}