{
    "articleURL": "/tvshowbiz/article-12040561/Jesinta-Franklin-ditches-brunette-locks-brand-new-stunning-hair-transformation.html",
    "content": [
        "Jesinta Franklin has shown off her dramatic new hairdo.",
        "The AFL WAG, 31, took to Instagram on Tuesday to showcase her latest hair transformation after visiting celebrity favourite Koda Cutters in Bondi.Jesinta, who is currently in Sydney after recently splurging on Gold Coast mansion, shared a video of herself sitting in the salon chair while getting balayage on her locks. The model showed a before and after that transitioned from her brunette tresses to her freshly-bleached ends.She shared praise for hairstylist Diane Georgievski, writing, 'love you' alongside a photo of the final product.",
        "Earlier this year, the former Seafolly representative ditched the red hair and began getting a balayage hairstyle.It comes after she revealed her plans to make an impact on the AFL after becoming an accredited player agent in July.Jestina said she completed the AFL Players' Association's accreditation course last year so she could use her new skills when the time is right.",
        "'I haven't done anything with that at the moment. I probably won't do anything until the kids get to school,' the mother-of-two told the Herald Sun.'I did my accreditation to learn a bit more about the industry and broaden my understanding and get to know the landscape a little bit.'There are definitely plans with that, but nothing in the immediate future,' she added.Jesinta established the business FranklinFinch Management last year with her husband Lance 'Buddy' Franklin, 36, and his business manager Adam Finch.",
        "Last year The Daily Telegraph reported Jesinta and Buddy are considering founding a local version of rapper Jay Z's management company Roc Nation, which represents some of the world's most elite athletes.Roc Nation was established in 2008 and represents a mixture of sporting and musical talent including NBA star LaMelo Ball and R&amp;B singer Rihanna.The company, which has offices in Los Angles, New York and London, is reportedly worth a whopping USD $140 million (AUD $203 million).According to The Daily Telegraph Jesinta also wants a career outside modelling and the opportunity to become an entrepreneur is particularly attractive.",
        "According to reports Buddy once considered joining Miranda Kerr's talent firm IMG, whose sporting clients include Commonwealth Games gold medalist Cody Simpson and tennis champion Jelena Dokic.Sports management agencies have an enormous earnings potential if they can attract high-profile clients and one managed by powerhouse couple Buddy and Jesinta would be attractive to many athletes. Jesinta has long held an interest in sports, particularly the AFL, and has publicly aired her views about several issues affecting the game.The model welcomed her daughter Tullulah in 2020 and son Rocky, one, in 2021 with her husband Lance."
    ]
}