{
    "articleURL": "/news/article-12048999/Judicial-activist-directed-tens-thousands-dollars-fees-wife-Justice-Clarence-Thomas.html",
    "content": [
        "Leonard Leo arranged $80,000 in payments for Ginni Thomas, says reportMoney came from group that filed brief before the Supreme Court in same year Justices are already facing calls for a new ethics code to protect the court A conservative judicial activist arranged for the wife of Supreme Court Justice Clarence Thomas to be paid tens of thousands of dollars a decade ago with instructions that her name be kept off paperwork, according to a new report.",
        "In 2012, Leonard Leo asked Republican pollster Kellyanne Conway to bill a non-profit and use the money to pay Virginia 'Ginni' Thomas.'No mention of Ginni, of course,' he stressed at one point.In the same year, the non-profit, the Judicial Education Project, filed a brief in a major voting rights case.The details, published by the Washington Post, pose fresh questions about whether justices and their families are cashing in on their work at the Supreme Court.And it will heighten demands that new ethics standards are needed to protect public confidence in the court.",
        "It comes after it emerged that a billionaire Republican donor paid private school fees for a child that the Thomases treated like a son. And it was recently reported that the head of major law firm paid $1.825 for a tract of land co-owned by Neil Gorsuch, days the Senate confirmed him to the Supreme Court.The latest questions involve Leo, who is a key figure in a network of groups that support the nominations of conservative judges.Documents reviewed by the newspaper say he told Conway that he wanted her to 'give' Ginni Thomas 'another $25K.' Conway's firm sent the Judicial Education Project a $25,000 bill that day. And it described the purpose as 'supplement for constitution polling and opinion consulting.' ",
        "In all the Polling Company paid Thomas’s firm, Liberty Consulting, $80,000 in a one-year period.Leo said the work was legitimate and he was simply trying to respect the couple's privacy. 'Knowing how disrespectful, malicious and gossipy people can be, I have always tried to protect the privacy of Justice Thomas and Ginni,' he said.He insisted the work had no connection to the court.",
        "'It is no secret that Ginni Thomas has a long history of working on issues within the conservative movement, and part of that work has involved gauging public attitudes and sentiment,' he said. 'The work she did here did not involve anything connected with either the court’s business or with other legal issues,.'As an adviser to JEP I have long been supportive of its opinion research relating to limited government, and The Polling Company, along with Ginni Thomas's help, has been an invaluable resource for gauging public attitudes.Conway and the Thomases did not respond to requests for comments. Earlier it emerged that Billionaire Crow helped foot the tuition bill for a relative of Thomas whom the Supreme Court justice treated 'as a son,' according to the latest revelation about Thomas's relationship with the megadonor. News of Crow's most recent largesse benefitting the justice and his family comes in a report from ProPublica, which obtained a statement showing that Crow paid tuition for Mark Martin, Thomas's grand-nephew, who lived with him in his Washington, D.C. home.",
        "The statement showed a payment of $6,200 from July 2009 from Crow's company, Crow Holdings.The payment was to attend the private boarding school Hidden Lake Academy, and a former administrator told the publication that Crow 'picked up the tab' for other tuition payments as well, along with tuition at another school, Randolph-Macon Academy in Virginia. Tuition ran $6,000 per month.The total cost would have reached $150,000 to cover four years at both private schools.The latest revelation about the billionaire real estate developer comes days after a Senate Judiciary Committee hearing where chairman Sen. Richard Durbin fumed that the high court does not have a formal ethics code that other judges must follow.'Here's the problem: the Supreme Court does not consider itself bound by these rules,' Durbin said.",
        "The publication interviewed Martin and former classmates, leaving little doubt he attended both private institutions.A statement from Crow, a top donor to Republican causes who also footed the bill for private jet travel, a mega-yacht, and a trip to Indonesia for Thomas, didn't dispute the story but spoke about his general support for helping 'at-risk youth.''Harlan Crow has long been passionate about the importance of quality education and giving back to those less fortunate, especially at-risk youth,' he said, without explicitly mentioning Thomas's relative, who the justice would later adopt.",
        "'It's disappointing that those with partisan political interests would try to turn helping at-risk youth with tuition assistance into something nefarious or political.' Crow and his wife have 'supported many young Americans' at a 'variety of schools, including his alma mater,' which is  Randolph-Macon Academy, a private military style school in Virginia.Crow and Thomas met in the 1990s, a few years after Thomas joined the high court, and the two have had a close relationship ever since - Crow once reportedly provided $500,000 to Thomas's wife Ginni to found a Tea Party-related group. The 74-year-old billionaire real estate developer who has lavished gifts and trips on Thomas is the chairman of a highly successful private investment firm, Crow Holdings, with almost $29 billion in holdings, according to the Dallas Morning News. He has donated millions to Republican campaigns and conservative groups. He has also presented Thomas with a series of peculiar gifts such as an Abraham Lincoln bust and a $19,000 bible once belonging to Frederick Douglass.An earlier ProPublica report revealed that Thomas made use of luxury jets, a mega-yacht, and stunning retreats all owned by the same real estate magnate. Thomas in an earlier statement said : 'Harlan and Kathy Crow are among our dearest friends, and we have been friends for over twenty-five years.",
        "'As friends do, we have joined them on a number of family trips during the more than quarter century we have known them,' he continued. ",
        "'Early in my tenure at the Court, I sought guidance from my colleagues and others in the judiciary, and was advised that this sort of personal hospitality from close personal friends, who did not have business before the Court, was not reportable. I have endeavored to follow that counsel throughout my tenure, and have always sought to comply with the disclosure guidelines.'However it is not at all clear that such a hospitality exemption would apply to tuition payment. Justices are required to disclose income and gifts of value on the form. Federal tax laws also require the payment of taxes on gifts in excess of a federal gift tax limit, which was an annual $12,000 at the time. Thomas didn't report the payment on his annual financial disclosure, although he did report an 'education gift to Mark Martin' from another friend, Earl and Louise Dixon.Crow has not been a party in any Supreme Court litigation, but has been involved in two conservative groups involved in filing supporting briefs in cases that go before the Supreme Court. In addition to politics, Crow has taken a particular interest in history -- the backyard garden at his $24 million Dallas residence is dominated by old statues of dictators he has collected from fallen regimes, including Vladimir Lenin and Joseph Stalin, according to the New York Times. His library also contains Hitler memorabilia, including a signed copy of Mein Kampf."
    ]
}