{
    "articleURL": "/sport/football/article-12041251/Barcelona-transfer-chief-Mateu-Alemany-advanced-talks-senior-role-Aston-Villa.html",
    "content": [
        "Barcelona transfer chief Alemany will leave the club at the end of the seasonAlemany has an offer from Aston Villa and could work with boss Unai EmeryBarcelona transfer chief Mateu Alemany is in advanced talks to take on a senior position at Aston Villa.",
        "Alemany, 60, will leave the club at the end of the season, the club confirmed in a statement on Tuesday. Multiple reports in Spain had indicated Alemany had been offered a large salary increase to move to Villa Park and work alongside boss Unai Emery.According to Spanish sources, Barcelona knew they could not match the terms on offer from Villa for their director of football.A statement from the LaLiga leaders read: 'FC Barcelona Director of Football, Mateu Alemany, will end his time at the club on the 30th of June to begin a new professional project.",
        "'Despite having a contract until 2024, Mateu Alemany has informed the FC Barcelona president, Joan Laporta, of his intention to take a new path in his career, but at the same time assuring that he will complete the summer transfer market with the club. 'Therefore, despite formally leaving the Club on 1 July, thanks to an informal agreement, Mateu Alemany has committed himself to completing the first team's transfer business this summer, even if it should be at the final moments of the transfer window.'Asked about Villa's interest in March, Alemany said: 'This is a private matter of no great importance. What is certain is that I will stay at Barca.'Villa sporting director Johan Lange has been in place since summer 2020 and played a significant role in bringing players like Emiliano Martinez and Ollie Watkins to the club.",
        "When Emery was hired to replace Steven Gerrard last autumn, he was given carte blanche to shape the first-team picture as he saw fit. The arrival of Alemany, if ultimately confirmed, would be a major step in that direction."
    ]
}