{
    "articleURL": "/wires/reuters/article-12047017/J-Js-Kenvue-eyes-47-bln-valuation-biggest-US-IPO-2021.html",
    "content": [
        "May 4 (Reuters) - Johnson &amp;amp; Johnson's consumer health spinoff Kenvue Inc rose 16% and fetched a valuation of about $48 billion in its market debut on Thursday, marking the biggest U.S. initial public offering since 2021.",
        "Shares of the Listerine mouthwash maker debuted at $25.53 each, compared with their offer price of $22 apiece.J&amp;amp;J sold 172.8 million shares of the business in an upsized offering to raise $3.8 billion, and said it will continue to own a stake of about 91% in Kenvue.Kenvue's stellar debut comes as good news for hopefuls waiting for market conditions to improve before moving ahead with their listings, in an IPO market that has largely been frozen over the past year due to stock-market volatility and economic uncertainty.\"Investors are very valuation sensitive now, and Kenvue is easier to pin a value on than, say, a tech unicorn. It has mature brands ... consumers should continue to buy these brands even in a recession,\" Matt Kennedy, senior strategist at Renaissance Capital, said.Kenvue marks the largest offering to launch since electric-vehicle maker Rivian Automotive Inc listed its shares on the Nasdaq in late 2021.IPOs in the U.S., excluding SPACs, raised a record $154.07 billion in 2021, which fell to $8.63 billion last year as markets reeled under macroeconomic uncertainty, data from Dealogic showed.U.S. IPOs, excluding listings for SPACs, are down about 22% to a total of just $2.35 billion from the start of 2023 till May 3.J&amp;amp;J shares fell marginally to $162 after Kenvue, whose products have long been the face of the company, debuted.",
        "Kenvue's listing comes a year after J&amp;amp;J's British rival GSK also completed the spinoff of its consumer health business. Shares of the London-listed arm called Haleon have risen 9.4% from their closing price on debut day in July 2022. (Reporting by Manya Saini and Bhanvi Satija in Bengaluru; Editing by Shounak Dasgupta and Shinjini Ganguli)"
    ]
}