{
    "articleURL": "/wires/pa/article-12050889/Never-say-never--Lewis-Hamilton-prospect-F1-fifties.html",
    "content": [
        "Lewis Hamilton has raised the remarkable prospect of extending his Formula One career into his fifties on the eve of this weekend’s Miami Grand Prix.",
        "Hamilton has only six months to run on his current £40million-a-year deal at Mercedes, but both sides say a contract extension – which is set to carry the seven-time world champion beyond his 40th birthday – will be agreed.Hamilton, 38, is the second-oldest driver on the F1 grid behind Fernando Alonso. The Spaniard, 42 in July, is enjoying an upturn in his career with his rejuvenated Aston Martin team.",
        "Hamilton is also heavily involved in a new Hollywood F1 blockbuster starring Brad Pitt. The 59-year-old American actor will play the role of a former driver emerging from retirement.It emerged here in Miami that Pitt is set to drive an adapted Formula Two car during filming for the movie at the British Grand Prix in July.“You can never say never,” said Hamilton, when asked about his longevity and the possibility of competing against Alonso in his fifties.“Brad is going to be racing in the movie in his fifties, so I would be the third-oldest driver.“There are people out there like Tom Brady [who retired, aged 45]. There are different ways you can train, how you can eat, and your focus.“The technology in our bodies is shifting, and it is just about the mentality and whether or not you still have the drive to sacrifice the same as you did when you first started, and I do.",
        "“I cannot speak for Fernando but I am hoping for more great fights with him moving forward.”Juan Manuel Fangio is the oldest man to win a world championship. The Argentine captured his fifth title when he was 46 in 1957.Hamilton was then asked if the physical demands of the sport’s gruelling record-breaking calendar are impacting his recovery.But the Mercedes man replied: “It is not taking me longer to recover. It is better because I am more focused on recovery than I ever have been before.“When I was 22, I was not focused on recovery. I didn’t know anything about it. I was just going home having a pizza, and not knowing what I needed to do the next day.“I did not have any specialists around me to help me navigate that. I didn’t have the details of what to eat, how to replenish the liquids I lost, stretching, and all those different things.“I wasn’t doing that back then. I don’t know if the drivers back in the day were that fit. They probably fell off quicker than us because we train a lot more than they did.”Hamilton remains motivated to win a record eighth title. However, the British driver is on the longest losing streak of his F1 career.",
        "Red Bull have won 14 of the last 15 races with Hamilton already 45 points behind championship leader Max Verstappen after just four rounds.And Hamilton warned Red Bull’s dominance could last until 2026 if the current regulations – ironically introduced last year to make the racing closer – are not changed.“We need to do better as a sport,” said Hamilton. “They have tried to bring the teams closer but it never seems to work.“It is good that we are trying new things and evolving, but it is just unfortunate that we see the same kind of gaps between teams.“I don’t know what the solution is for the future but we have to continue to adapt the regulations otherwise it could be the same as it is now until 2026.”"
    ]
}