{
    "articleURL": "/wires/afp/article-12046201/No-winner-Sudan-war-exiled-Darfur-rebel-leader.html",
    "content": [
        "Sudanese exiled rebel leader Abdel Wahid Nur -- a veteran of decades of fighting in the troubled Darfur region -- says there can be \"no winner\" in the war now raging between two rival generals.",
        "\"The Sudanese people want neither of them,\" Nur, now based in neighbouring South Sudan, told AFP. \"They want a civilian government.\"Battles have flared for weeks between Sudan's army chief Abdel Fattah al-Burhan and his former deputy, Mohamed Hamdan Daglo, who commands the paramilitary Rapid Support Forces (RSF).\"What's happening in Sudan is a disaster,\" Nur, 55, said in an interview in Juba, the capital of South Sudan, where he lives after spending years in Paris.",
        "\"There is no winner in this war,\" said the leader of a faction of the Sudan Liberation Movement (SLM) whose members, he said, have not joined the fighting.The battles have turned Khartoum into a war zone and also killed scores in Darfur, which Nur said once more suffers \"war crimes and crimes against humanity\".Nur was a leader of the Darfur rebellion from 2003 when African minority groups rose up against Arab elites they accused of monopolising Sudan's political power and wealth.",
        "The Islamist-backed strongman then in power, Omar al-Bashir, unleashed the notorious Janjaweed militias, the forerunners of the RSF, whose atrocities shocked the world.The unrest killed at least 300,000 people and displaced 2.5 million, according to the UN. The bloodshed led to international charges of genocide, crimes against humanity and war crimes against Bashir and others.",
        "Although Darfur's conflict subsided over the years, the region remains awash with weapons and sporadic violence erupts, often over access to water, land and resources.- 'Hands of oppression' -",
        "Sudan's military ousted Bashir in April 2019 following mass pro-democracy protests, and Burhan has been the de facto leader since then.Daglo, from Darfur's pastoralist camel-herding Arab Rizeigat people, rose to prominence with the Janjaweed, which made up the bulk of the RSF formed in 2013.In October 2021, Burhan and his then number-two Daglo jointly staged another coup that upended the country's fragile transition to civilian rule.",
        "The two generals then engaged in a power struggle, most recently over the RSF's integration into the regular army, which has now flared into bloody violence.\"The two bodies fighting now once acted as Bashir's hands of oppression,\" said Nur.\"The army and Burhan personally supervised the making of the Janjaweed,\" he said, adding that his own movement opposes both and only fights \"oppression\".",
        "Nur described the conflict as the expected outcome of a \"political struggle that became militarised\".The current fighting has killed more than 550 people, wounded thousands and sent more than 100,000 fleeing abroad.In West Darfur state, the UN says, the hostilities \"have triggered intercommunal violence\", which have seen many deaths and accounts of rampant looting and burning of property.",
        "- Ambition to rule -",
        "Nur's SLM faction refused to sign a 2020 peace deal with Sudan's short-lived transitional government installed following Bashir's ouster.It charged that the accord, signed by other rebel groups, failed to address the root causes of Sudan's conflicts.Nur said his movement had however observed \"a unilateral ceasefire since Bashir's ouster and have since committed to it\" to give a chance to the planned transition to civilian rule.Nur belongs to the ethnic Fur tribe in Darfur, and analysts believe his faction still maintains considerable support.",
        "A report last year by UN experts said Nur's faction was among Darfuri armed groups \"receiving payments and logistical support\" in exchange for sending mercenaries to strife-torn Libya.The UN experts, in 2020, also said Nur's group had strengthened its miliary capability following the discovery of gold in its area.Nur rejects the allegations and says he does not support either side in the current war, stressing that his fighters play no role in it.Nur said the conflict reflects the two generals' ambitions to rule Sudan but is only \"increasing the suffering\" of the people, especially in Darfur.In a country with a history of military coups, Burhan and Daglo have each touted themselves as champions of democracy seeking to restore the transition to civilian rule.",
        "Nur, recalling the mass youth-led protests that led to Bashir's overthrow, said the Sudanese people reject both of them.\"I don't think they will ever accept military rule,\" he said."
    ]
}