{
    "articleURL": "/tvshowbiz/article-12059543/Louise-Thompson-shares-shocking-pictures-clearing-home.html",
    "content": [
        "Louise Thompson showed off shocking before and after pictures of her house clear-out on Sunday.   ",
        "The Made In Chelsea star, 33, shares a son, Leo-Hunter, 18 months, with her fiancé Ryan Libbey. She has been open and honest about her struggles with her health since she nearly died in childbirth, leaving her with PTSD. Louise showed she was having a very productive bank holiday weekend on Sunday as she attempted a full-scale clear-out of her bedroom, leading to some very dramatic results. She showed her 1.4 million followers an insight into the task ahead, filming a sneak peak of the 'before' challenge. ",
        "The bedroom was filled with piles of clothes and suitcases, completely swamping the floor.  Louise wrote on her Instagram story: 'Next challenge. Because LOL if you thought I was one of those 'influencers' with a boring pristine house. Ohhh noooooo.' After a five-hour gap between posts and undertaking the mammoth task all on her own, a victorious Louise shared an update.The new room looked unrecognisable, with a spotless carpet and freshly-made bed.The reality star said: 'Ok I'm just gonna say it. I feel like a total rockstar', giving the camera a thumbs up and making a fist pump. She added: 'Single-handedly in one day. Sore hands and feet but I will sleep like a baby tonight.' At the end of March Louise took to Instagram to give an emotional update about her health as she continues to battle with PTSD and postnatal anxiety.",
        "The star nearly died when she gave birth to son Leo in November 2021 and she has been struggling with her health ever since.",
        "Sharing a moving clip of both good and bad moments from the past few months, Louise gave fans an update on how she's coping, adding that something happened last weekend to cause a downward spiral. She wrote: 'Does anyone else feel like they’re in season 5 of their life and the writers are making ridiculous s**t happen to keep the script interesting?'I know Instagram is merely a snapshot of everyone’s life, but man my world has been mad. It’s just felt so messy. Medical issues have compounded every. single. month. and I’ve only just started processing the early stuff. 'Now that I’m going through the timeline with my trauma therapist things seem to be getting a bit harder again. Urgh. She did say that things might get a bit harder before they get better, but I didn’t think that would actually apply to me. I never thought any of these problems would apply to me. Referring to the video she posted on Instagram, Louise continued: 'In fact I even found looking over this reel a bit triggering. How can that be? It seems so silly. It’s hard to find the patience. ",
        "'To be honest if I were to create a REAL reel of the last 16 months it would be at least an hour long… there would be hospital appointments every single week, 50+ blood tests and it would be far too painful to make/watch. 'I’m just dipping my toe in to find some positive nuggets to hold close to my heart at this stage.'She continued: 'Re: therapy - it’s the same, we’re really just looking at an overview… starting to scratch the surface and focus on dates of significant events (there seem to be too many) and i’m finding it hard not to deep dive.",
        "'In terms of health… Gynaecology, gastroenterology, rheumatology, psychiatry, psychotherapy and now haematology appointments, what next? That is six different departments that I’m working with every month. It’s hard to step away from health with all this going on. 'The mad things is that I didn’t have any issues before all of this. Yes I suffered with mild inflammatory bowel disease but I didn’t need to medicate for 4 years and I’d never even got as far as steroids. Isn’t it crazy how your life can change overnight? 'I mean i’m only just realising how nuts it is that last July I was told it might be better to have my colon removed. One day I’m on holiday, the next day i’m in A&amp;E with that news. Gosh we so take our health for granted.",
        "'So here lies a short snapshot, and a reminder for ME that things HAVE got better, and for YOU, that things CAN get better too. (I had to change that from a WILL to a CAN because life can be uncertain). 'So I guess the overriding main message is, keep going!!! Keep plodding on. Good moments will outshine the bad. You will learn to cope.⁣ And ask for help! ❤️‍.' On working with a life coach and therapist, she wrote: 'When I started working with my life coach again (I worked with her during the first lockdown and then picked up with her again mid way through last year) she mentioned that she felt that I had lived many lives. That I was an old soul. I am quite spiritual, so I felt that. 'I believe that I am currently living the most challenging chapter of my life - It’s like i’ve logged onto the hard level… but hopefully, like the seasons, this level will pass. Everything always passes. 'These thoughts and feelings seem to be taking a damn long time to process… I’m actually very bored by how much time they are taking time to shift… but eventually they will diminish into something totally insignificant… like that stick diagram with the little man and the big circles that get smaller over the years. I’ll reference it on my stories. ",
        "'In fact some days I have are totally 100% normal. Like yesterday… and the day before. It’s only when I reflect back (like I do in therapy) that I realise that this is a HUGE improvement.'"
    ]
}