{
    "articleURL": "/health/article-12044123/Blockbuster-weight-loss-shots-spark-panic-diet-industry.html",
    "content": [
        "The advent of obesity medicines has upended the way Americans view dietingThey've eaten into the profits of major players Jenny Craig and Weight Watchers READ MORE: Dieting institution Jenny Craig crumbled under the weight of debt The rise of weight loss drugs such as Wegovy and Ozempic has sent legacy companies selling diet and fitness plans bust.",
        "Jenny Craig, a household name since its launch in the 1980s, announced last Tuesday it is shutting down due to its 'inability to secure additional financing.’ Meanwhile, Weight Watchers shares plunged by about 29 percent in the weeks following the Food and Drug Administration's approval of Wegovy for obesity, erasing about $625 million of the company’s market value in its greatest decline in several years.The New York-based company is now embracing the drugs to stay relevant. The companies that do not embrace the blockbuster obesity drugs, though, face the possibility of extinction. Dr Shauna Levy, an obesity medicine specialist at Tulane University in New Orleans, Louisiana, said: 'Unless they change to somehow incorporate medications, yes, I  think in the next few years we will see a lot of change in the diet industry including many businesses closing. ",
        "'The companies will persist as long as the gap in access to care for medications exists.'She added that diet companies only rose in the first place to fill a gap left by the medical industry in treating weight loss.‘These companies took over a need that doctors either didn't have the bandwidth to fill or the interest for a long, long time,' Dr Levy said.'Obesity has been sort of outsourced to these companies to take care of, and that's how this industry grew.’ ",
        "The staggering efficacy of the drugs, which can help obese people shed around 15 percent of their body weight over 68 weeks, has made them breakout stars.Their success is the culmination of decades-long research into treating obesity as a medical condition. Wegovy and Ozempic both use the active drug semaglutide and are GLP-1 receptors. This means they work by triggering the body's glucagon-like peptide-1 hormones, which tell the body to stop eating.By mimicking the activity of GLP-1, Wegovy and Ozempic can help reduce your appetite and lower the number of calories you consume.",
        "The 76-year-old has looked noticeably more svelte in recent weeks despite facing at least nine lawsuits.",
        "Mounjaro is similar to Wegovy and Ozempic but slightly different. Its active ingredient is called tirzepatide, and in addition to working on GLP-1 receptors, it works on the hormone glucose-dependent insulinotropic polypeptide (GIP).This double-impact makes it even more effective and has earned it the nickname 'King Kong' from some experts.Weight Watchers, now WW International, made a decision of self-preservation earlier this year when it bought up telehealth prescribing company Sequence for $106 million, opening the door to connecting its customers with the clinically proven medications. WW shares climbed eight percent that day. WW CEO Sima Sistani said of the move in March: ‘As science advances rapidly, we know there is a significant opportunity to improve outcomes for those using medications.",
        "‘Clinical interventions require better education, access, care management, community and the integration of a complementary lifestyle program for best results.’The acquisition caused WW shares to surge more than 70 percent, a saving grace after the company reported its subscriber count had plunged 15 percent in 2022The weight loss medication market is relatively new, but Novo Nordisk, the manufacturer of Wegovy and Ozempic, is proving the biggest winner so far, having seen its stock rise more than 25 percent this year. And the drugs have major star power backing them up with the likes of Elon Musk and Chelsea Handler (though she no longer uses the drug). WW was able to stay afloat by embracing obesity medication, but the rise of the injectable fat loss solutions proved a death knell for Jenny Craig, a diet industry mainstay since the 1980s. The now-shuttered company, with about 500 brick-and-mortar stores in the US and Canada, had been suffering under the weight of its own debt for years.Company leadership has indicated that it was willing to make some hefty changes to its business in order to stay relevant, but any moves forward are likely to have stalled indefinitely. Company CEO Mandy Dowson said: ‘Like many other companies, we’re currently transitioning from a brick-and-mortar retail business to a customer-friendly, e-commerce driven model. ",
        "'We will have more details to share in the coming weeks as our plans are solidified.’The company’s stock information is not publicly available and was purchased by a private investment firm in 2019, two years before the FDA approved Wegovy for obesity.",
        "The diet industry's bottom line had been tenuous at best for years, thanks in part to pandemic-era lockdowns that saw people confined to their homes and unable to visit support meetings in person. In fact, the pandemic cratered WW's business so profoundly that it had to cut 300 in-person meeting locations, about 29 percent of its footprint, mostly in large urban areas where facilities were leased on a month-to-month basis. Most mainstream diet plans are centered around cutting the number of calories consumed in a day without sacrificing nutrients. WW worked by allotting users 'points' that they would spend each time they ate food.The number of points a person had depended on their weight loss goals and current height and weight. Exercising would earn them more points.Every food had a point cost, though it was zero for some very healthy food such as fruits and vegetables. Unhealthy foods had higher point costs.The company said a person could lose one to two pounds per week using the system. ",
        "Jenny Craig offered in-person weight loss coaching and users low-calorie pre-packaged meals. This took away the burden of having to count calories and other macronutrients for themselves.But these diet plans often come with a hefty price tag. And many people find they cannot stick to the regimented plans. ",
        "Dr Levy added: ‘The industry preys on people's insecurities, this disease and the way that it works, sort of convincing people that this is going to be the thing that works for you, but you need to pay all this money.‘And now that we understand more and more about this disease and have a truly effective treatment, it’s sort of shining a light on the deceptive nature of so many of these diets in the industry.’The wider availability of Wegovy and its sister drug Ozempic has helped people realize that obesity is a medical condition, not a result of a major character flaw. That's great news, Dr Levy said, but not everyone who would benefit from it can get it. And much like flashy diet plans, the treatments can be prohibitively expensive.Without insurance coverage, Wegovy injections cost a little more than $1,300 per package, which breaks down to nearly $270 per week or about $16,190 per year.Whether a person needs to continue taking the medications for life in order to keep the weight off also remains unclear but many experts believe that people who use the drug may pile the pounds back on once they’ve stopped because it has not addressed the underlying issue causing them to over-eat.",
        "They also say that muscle loss triggered by the drug means someone who uses it cannot return to their old diet because it will lead to weight gain.While calorie-restrictive diets and exercise plans can prompt some weight loss, they are often not enough to make a major difference.Yet when someone touts their impressive weight loss due to obesity medication or weight loss surgery such as a lap band on social media, they are often met with attacks against their character for taking a ‘short cut.’ The general belief is that if I had to suffer to get my beach body, everyone should have to suffer for theirs, too.But that kind of thinking is part and parcel of society’s obsession with thickness and phobia of fatness.Dr Levy said: ‘I absolutely do not think that bariatric surgery, obesity medicine, are as people say, the easy way out. They worked hard to get here, but I do see it as a way out and a treatment for disease.‘And the other problem I have with the easy way out thing is who doesn't choose the easy way out? Why why do we make this such a negative thing when it comes to obesity? It goes back to discrimination against this population.’"
    ]
}