{
    "articleURL": "/money/podcast/article-12051975/How-build-homes-make-better-TiM-podcast.html",
    "content": [
        "A row over housebuilding has erupted again.",
        "Labour leader Keir Starmer has said he would bring back a 300,000 annual housebuilding target, after Rishi Sunak scrapped it.Meanwhile, some backbench Tory MPs are reportedly unhappy about their party ditching that target in the first place – with the number having featured in the 2019 Conservative Party manifesto.At the same time Michael Gove has been cheered in many quarters for blocking a development in Kent, as it was deemed to be poor quality and ugly, but Gove is now being taken to court by developer Berkeley Homes over the decision.So, what can we do about housebuilding and how do we get ourselves out of this mess – especially as the younger generation are squeezed out by high house prices and rents?On this podcast, Georgie Frost, Lee Boyce and Simon Lambert dig into the myriad problems with UK housebuilding and what can be done to build better homes that people want to buy and have near them.Is the answer just bringing back housebuilding targets or is it more complicated than that?Is not wanting housing developments Nimbyism if there’s a failure to build well and deliver infrastructure?How can we convince local communities to back new housing?All this and more come up for debate.Also on the podcast:",
        "If you are in the fortunate position of being able to buy a home but are worried about falling house prices and locking into high mortgage rates, what should you do?Sam North, of eToro, joins us for the latest market update, including the reaction to the Fed's latest rate rise.Will a new crackdown on scams finally stop the fraudsters?And finally, we said it was coming. The 5 per cent savings rate is back, but should you get one?",
        "We publish the podcast every Friday to the player on This is Money, above, and on Apple Podcasts (iTunes), the most popular, Spotify, Audioboom, and so many more.To download the Apple Podcasts app go to the App store. On Android devices, go to the Google Play store to download the podcast app of your choice. You can press play to listen to this week's full episode on the player above, and wherever you get your podcasts please subscribe and review us if you like the podcast.We're now available on YouTube and you can ask your smart device to 'play the This is Money podcast'. If you're not happy using apps, you can also listen to the latest episode and archive on the This is Money podcast page. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}