{
    "articleURL": "/wires/pa/article-12053821/Duke-York-booed-driven-The-Mall-coronation.html",
    "content": [
        "The Duke of York wore his Garter robes to the King’s coronation, reflecting an apparent softening of the royal family’s stance towards him.",
        "Andrew, who stepped back from royal duties after a controversial Newsnight interview and the furore over his friendship with paedophile financier Jeffrey Epstein, wore the ceremonial robes to Saturday’s service at Westminster Abbey.Last June, Andrew did not appear alongside senior members of the family at the annual Order of the Garter ceremony at Windsor Castle despite being a Knight of the Garter.His absence was notable at the time, but he again donned the robes to mark Saturday’s historic coronation.The Order of the Garter is the oldest and most senior order of chivalry in Britain.",
        "According to the royal family website, in medieval times King Edward III was so inspired by tales of King Arthur and the chivalry of the Knights of the Round Table that he set up his own group of honourable knights, called the Order of the Garter.Today, the order includes the King, who is Sovereign of the Garter, “several senior members of the royal family, and 24 knights chosen in recognition of their work”, according to the website.The Order of the Garter robes are made of dark blue velvet and can be accompanied by a cap.The robe has a white satin lining, white silk bows on the shoulders, an attached red velvet hood and tasselled cordons.",
        "Earlier, as the duke was driven down The Mall in a state car towards Westminster Abbey, of small group in the crowd in a grandstand in front of Buckingham Palace booed as he went past.The Palace had earlier said Andrew – and his nephew the Duke of Sussex – would have no formal role at the event as they are no longer working royals.Andrew stepped away from public life after the controversial Newsnight interview in November 2019 and the fallout from his friendship with Epstein.Virginia Giuffre also sued him for allegedly sexually assaulting her when she was 17 after she was trafficked by Epstein.Andrew denied the claims but paid millions in an out-of-court settlement in the US civil case."
    ]
}