{
    "articleURL": "/wires/ap/article-12051997/Murder-charges-filed-against-California-ex-college-student.html",
    "content": [
        "DAVIS, Calif. (AP) - A 21-year-old former university student on Friday pleaded not guilty to two counts of murder and one of attempted murder in connection with a series of stabbings in the college community of Davis.",
        "Yolo County Superior Court Judge Daniel Wolk also denied bail to Carlos Dominguez, citing the risk to public safety and the defendant's own flight risk given the seriousness of the alleged crimes.Dominguez remained expressionless as the judge read out the complaint filed by prosecutors Friday. He responded in the affirmative several times to questions from the judge but did not speak otherwise.Yolo County prosecutors said Dominguez is eligible for a life prison term without the possibility of parole or the death penalty, given the multiple murders. He is accused of fatally stabbing two people, including a fellow student, and stabbing a third victim who is now recovering.Dominguez was represented by Dan Hutchinson, a deputy public defender. Hutchinson did not immediately respond to a request for comment.He was picked up for questioning Wednesday near the city park where he was alleged to have killed his second victim and has been in jail since early Thursday.",
        "News of his arrest Thursday was a relief to students and residents shocked by the vicious stabbings, which Davis Police Chief Darren Pytel described as particularly brutal and brazen.Dominguez was a student at UC Davis until April 25 - two days before the first victim was found - when he was let go for academic reasons, the university said. He was a third-year student majoring in biological sciences.",
        "On Friday, students headed to class, in contrast to earlier in the week when the campus was practically deserted, some said.Talia Mickelsen, a third-year student studying animal sciences, said she lives across the street from the house in which Dominguez lived. She noticed him a few times, but never interacted with him, she said.Mickelsen said the last week has been scary, and she feels more secure now that he is arrested.\"It is very eye-opening, but I guess these things can happen anywhere,\" she said. \"Now, I just make sure I´m vigilant and cautious wherever I go.\"Coco Yan, a student also majoring in animal sciences, said she and a friend did not leave the house unless they went out together.\"I have no sympathy for the stabber,\" said Yan. \"A lot of people were stressed and scared because of it.\"Davis police and multiple law enforcement agencies fanned out to investigate after the body of David Breaux, 50, was discovered at a downtown park near the University of California, Davis campus April 27. The second victim, UC Davis senior Karim Abou Najm, 20, was found Saturday night at another city park.On Monday, Kimberlee Guillory was attacked while inside her tent but survived. Both Breaux and Guillory were homeless.",
        "Davis police have not provided a motive and it is unclear if he knew the victims.Pytel, the police chief, said 15 people called into the department Wednesday afternoon when they spotted someone matching the stabbing suspect's description at Sycamore Park, where Najm was found.Dominguez went voluntarily with police for more questioning, Pytel said. They found a large knife in his backpack.Davis is a city of 67,000, with an additional 13,000 students living on campus.His next court date is May 22."
    ]
}