{
    "articleURL": "/wires/pa/article-12039389/Erling-Haaland-better-warns-Manchester-City-boss-Pep-Guardiola.html",
    "content": [
        "Pep Guardiola has warned that Erling Haaland’s second season at Manchester City could be even better than his first.",
        "Haaland is on the brink of setting a new single-season Premier League goalscoring record after a sensational first campaign at the Etihad Stadium.The prolific Norwegian netted his 34th goal of the champions’ 2022-23 league programme – and his 50th overall – in Sunday’s victory at Fulham.That drew him level with joint competition record-holders Andy Cole and Alan Shearer and, with six games to play starting with Wednesday’s visit of West Ham, the 22-year-old looks certain to set a formidable new benchmark.Guardiola, however, believes his best could be yet to come.The City manager said: “Always I’ve said with Erling it will be tough when you look at what he has done – and if he doesn’t score the goals like he’s scoring now people will say, ‘Oh, he’s in a bad situation’ – but his game can improve a lot.“I wouldn’t say in the box but in the game itself, the movements. I think he has that feeling, ‘Is that enough?’, and I think he has the desire to get better as a player.“As long as he has that he can do it.”Guardiola believes Haaland, who joined City last summer after plundering 86 goals in 89 appearances for Borussia Dortmund, arrived with a determination to break records.",
        "He said: “Yes, I think so. I know him a bit and he is so competitive and positive in his mindset.“He has this incredible, positive self-confidence. It’s not arrogance.“It’s self-confidence to say I am going to score and to arrive in his first season and score 50 already and equal the record for two legends in Andy Cole and Alan Shearer.”Haaland’s remarkable record has raised the prospect he could even surpass the English record 63 goals for a top-flight player scored by Everton’s Dixie Dean in 1927-28.Comparisons have also been made with Lionel Messi, who scored 73 for Barcelona in 2011-12, but Guardiola says drawing parallels with one of the all-time greats is unfair.Messi’s former Barca boss said: “No-one can compare with Messi. It will not help Erling.",
        "“Messi is the most complete player I have seen in terms of vision, dribbles, passes, competitiveness, in many things that are difficult.“Hopefully Erling can be so close (to) Leo, that will be great for us and him, but I don’t help anyone to compare them with the Argentina player.”Haaland has established a potent partnership with playmaker Kevin De Bruyne, who is hoping to overcome a knock to feature against the Hammers.De Bruyne said: “He’s matched the record for the Premier League scoring 34 goals.",
        "“I am just trying to help him achieve that and he has been able to do it. I just try to create as many chances as I can and he is ready to pounce in the box. We work really well together and he has been great.”"
    ]
}