{
    "articleURL": "/sport/football/article-12055523/Aleksandar-Mitrovics-eight-game-ban-really-tough-striker-says-Marco-Silva.html",
    "content": [
        "Aleksandar Mitrovic was banned for eight games after pushing Chris KavanaghHe has still scored twice as many goals as any other Fulham player this season Marco Silva admitted the ban had been 'really tough' for the Serbian striker Fulham boss Marco Silva admits Aleksandar Mitrovic's spell out of the team due to a ban has been 'really tough' on the forward but is looking forward to welcoming him back after Monday's game against Leicester.",
        "Mitrovic was banned for eight games after pushing referee Chris Kavanagh in Fulham's FA Cup quarter-final defeat at Old Trafford in March.Fulham's game against Leicester on Monday will be the striker's final game out after his lengthy suspension, with the forward set to return to the squad for the following game against Southampton.And Silva, who was also sent off and handed a two-game touchline ban for his response towards the officials in Fulham's FA Cup defeat, says it has been a difficult period for the Serbian international.'It has been a tough period for him. He has been working hard, it has to be like that,' Silva explained.",
        "'The mood on some days is a little bit better than the others because he knew a month-and-a-half ago he was going to be out for eight games which is really tough for any player.'The way it has come for us, the way everything happened as well, and the treatment behind the whole scenario, it was really tough. Not just for Mitro, but for our football club. We felt something that was not good.'We are here to support Mitro and it is up to him to keep working hard, to be the best he can be from a physical point of view. It will be good to have him again.'",
        "Fulham host a Leicester team who are locked in a relegation battle, with the Foxes hoping to build on their point against Everton at the King Power Stadium last time out."
    ]
}