{
    "articleURL": "/femail/article-12054351/Rose-Hanbury-emulates-Princess-Wales-style-Coronation.html",
    "content": [
        "The Marchioness of Cholmondeley wore a black and white dress to the Coronation service today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Read more: King Charles Coronation LIVE - follow the latest updates from Westminster AbbeyRose Hanbury appeared to pay homage to the Princess of Wales' style at the Coronation today, wearing a similar outfit to the ensemble Kate wore on the eve of the historic event.  ",
        "Ms Hanbury, who is the Marchioness of Cholmondeley via her marriage to her aristocratic husband David Cholmondeley, wore a striking black and white ankle-length vintage dress by Ozzie Clark, similar to the smart white fitted dress and black belt that the Princess of Wales wore on The Mall yesterday afternoon.The 39-year-old aristocrat also donned a pair of towering black £490 Bow Tie Pump 105 Aquazzura heels. Kate, 41, wore the same shoe during yesterday's walkabout with Prince William and the King ahead of the Realm Governors General and Prime Ministers Lunch at Buckingham Palace.Clearly popular in royal circles and high society, the same bow tie heel was also often worn by the Duchess of Sussex during her time as a working royal. ",
        "When it came to the Marchioness of Cholmondeley's dress, although it was very similar in colour scheme to the smart white dress which Kate wore yesterday, the aristocrat opted for a very rare vintage designer frock.Ms Hanbury wore an Ossie Clark designer crepe wrap dress by Quorum, which dates back to 1970. The Cholmondeleys’ home is Houghton Hall, a stunning Palladian mansion built in the 1720s for Britain’s first Prime Minister, Sir Robert Walpole. The 106-room pile is in North Norfolk. ",
        "On Friday, Kate Middleton appeared to make a subtle nod to her sister-in-law the Duchess of Sussex as she stepped out in a pair of Meghan Markle's favourite heels.",
        "The Duchess wore the Bow Tie Pump 105 black heels, which feature a flirty bow, for her first ever solo royal engagement, as well as a number of other occasions.Meghan’s Aquazzura obsession began long before meeting her prince. Aquazzura, founded in 2012, was not a household name when Meghan started wearing the shoes. For her engagement photocall, she wore the label’s £490 suede Matilde heels, and white Aquazzuras for the evening reception at her wedding.And while it's not the first time the Princess of Wales has worn the brand, it's certainly the first time she has stepped out in the black Bow Tie Pump 105 heels, which Meghan wore a number of times during her time in the royal family. "
    ]
}