{
    "articleURL": "/news/article-12048399/White-House-pounces-Republican-new-Biden-criminal-scheme-bombshell.html",
    "content": [
        "Sen. Chuck Grassley and Rep. James Comer cited evidence of 'criminal scheme' They say whistleblower told them of FBI file with 'precise description' of itWH flagged statement by Grassley that he didn't know if it was true The White House on Thursday took on Iowa Sen. Charles Grassley for saying he didn't know whether sensational allegations he helped air about the president allegedly engaging in a 'criminal scheme' with a foreign national was accurate.",
        "Grassley, 89, came forward Wednesday along with House Oversight Committee Chairman Rep. James Comer to bring forward claims from a whistleblower that they described as a bribery scheme from when Biden was serving as vice president.'We believe the FBI possesses an unclassified internal document that includes very serious and detailed allegations implicating the current President of the United States,' Grassley said, as Comer subpoenaed the information.However when describing the effort in an interview on the conservative Newsmax outlet, Grassley also allowed that he couldn't vouch for its accuracy without seeing the information.The clip shows Grassley being interviewed by host Greta Van Susteren.",
        "'The letter is electrifying because it talks about exchange of money for policy decisions. It's a very serious allegation against the then-Vice President,' the host tells Grassley, who phoned in for the interview. 'It is a very serious allegation. I wish I could say that I knew it was true or untrue,' Grassley responded.'Wow. Says it all,' wrote White House spokesman for oversight and investigations Ian Sams, appending his comment to the clip.The pushback comes a day after Grassley, a senior Judiciary Committee member and a longtime advocate for whistleblower protections,  and Comer wrote AG Merrick Garland and FBI Director Christopher Wray about what the whistleblower told them.",
        "That letter also did not speak to the truth of the allegations, merely that the whistleblower was 'credible' and that the disclosures were 'legally protected.'",
        "They wanted to know 'what steps, if any' were taken to determine the 'truth and accuracy' of the information by the FBI. Grassley also didn't speak directly to the truth of the allegations in his statement Wednesday demanding to see the information.'We believe the FBI possesses an unclassified internal document that includes very serious and detailed allegations implicating the current President of the United States. What we don’t know is what, if anything, the FBI has done to verify these claims or investigate further. The FBI’s recent history of botching politically charged investigations demands close congressional oversight,' he said.Comer, who as chairman has subpoena power, demanded the document and all accompanying attachments. House Republicans set up a 'weaponization' committee after taking over the House to probe alleged FBI misconduct.Comer went further in his own statement, although he also hedged by saying the information raised 'concerns' and speaking only to 'alleged' bribery.'The information provided by a whistleblower raises concerns that then-Vice President Biden allegedly engaged in a bribery scheme with a foreign national,' Comer said.Grassley and Comer demanded an unclassified FD-1023 document detailing the “alleged criminal scheme involving then-Vice President Biden and a foreign national relating to the exchange of money for policy decisions.” ",
        "Such forms reflect information the FBI might obtain from sources that has not necessarily been firmly established.  Still, the move likely sets up a pitched battle over the documents – with lawmakers including Rep. Marjorie Taylor Greene (R-Ga.) already calling for Biden's impeachment. The Wray subpoena contains language saying the information 'will inform potential legislative solutions that the Committee is exploring' – language meant to establish a legislative purpose that is part of Congress' duties that could be important if there is a standoff and the matter ends up in court. Sen. Ted Cruz, R-Texas, floated the idea of impeachment on Fox News on Wednesday night. 'It doesn't have to be a high crime and misdemeanor,' he said, noting impeachment for bribery is 'explicitly noted in the Constitution.' 'The evidence of Joe Biden being complicit and profiting from this corruption is growing and growing,'  he claimed. Rep. Jamie Raskin of Maryland, ranking Democrat on the Oversight Committee, accused Republicans of 'recycling unsubstantiated claims' that could have come from Rudy Giuliani or Russian agents trying to sway the 2020 election. 'During this same time period, Rudy Giuliani and Russian agents, sanctioned by Trump's Treasury Department, were peddling disinformation aimed at interfering in the 2020 presidential election,' Raskin said. 'Given Chair Comer's commitment to 'dismantle' the FBI, it's no surprise that he would rely on these unverified tips to attack President Biden in one more baseless partisan stunt.'"
    ]
}