{
    "articleURL": "/wires/reuters/article-12041215/EMERGING-MARKETS-Stocks-ahead-Fed-decision-risk-mood.html",
    "content": [
        "Czech rates seen on hold before cut in Q3 - POLL",
        "HK stocks snap 4-day winning streak on US growth, bank worriesTurkish inflation slows to 43.7% in AprilMalaysia c.bank surprises by raising policy rate to 3%Egypt's current account moves into surplus in Oct-DecEM FX up 0.3%, stocks off 0.5%By Bansari Mayur KamdarMay 3 (Reuters) - Hong Kong stocks fell on Wednesday, tracking the broader risk-off mood in markets as investors fretted about U.S. banking sector risks and awaited the Federal Reserve's policy rate decision that will set the tone for markets globally.The Hang Seng Index dropped 1.4%, after four straight days of gains, as investors contended with signs of a softening U.S. economy and troubles in its banking sector ahead of a widely expected 25 basis points interest rate hike by the Fed at 1800 GMT.China's mainland financial markets were closed for the Labour Day holiday and will resume trading on May 4.The MSCI's index for stocks shed 0.5% by 0812 GMT.Supporting currencies in emerging markets, the dollar index, which measures the U.S. currency against six rivals, eased 0.3% with investors focused on how long the Fed will keep policy tight.In central and eastern Europe, investors awaited a rate decision by the Czech National Bank (CNB) at 1230 GMT. Analysts expect the central bank to keep key base rate unchanged at 7.00%.",
        "\"The Czech National Bank warned investors not to bet on premature rate cuts,\" said Natalia Gurushina, emerging markets fixed income economist at VanEck.\"Still, the latest activity gauges looked terrible, and the market thinks this will create room for easing within six months.\"The Czech crown inched 0.1% up against the euro.While economies have signalled weakness, with Czech manufacturing activity sharply contracting in April according to Tuesday's data, rates around central Europe remain elevated, but on hold.Hungary last week cut the top of its interest rate corridor, paving the way for rate cuts later. The forint edged 0.2% up and was down 6.8% this year.The South African rand gained 0.5% against the greenback, tracking broader market moves, while the Turkish lira was flat.Data showed Turkish annual consumer price inflation slowed to 43.68% in April, slightly below forecast, easing further ahead of presidential and parliamentary elections on May 14.Russia's rouble edged 0.1% higher against the dollar, extending gains for its fourth consecutive session.Malaysia's ringgit inched up after its central bank unexpectedly raised the benchmark interest rate by 25 basis points to 3.00%, with core inflation expected to remain elevated despite moderation in recent months.Egypt's current account turned a surplus for the first time in years in the October-to-December quarter as imports dropped and exports rose.",
        "The International Monetary Fund (IMF), however, said economic growth in the Middle East, North Africa and Central Asia regions will slow in 2023, underlining the need to accelerate structural reforms. (Reporting by Bansari Mayur Kamdar in Bengaluru; editing by Barbara Lewis)"
    ]
}