{
    "articleURL": "/news/article-12056649/Julie-Bishop-opens-attending-Coronation-King-Charles-III.html",
    "content": [
        "Julie Bishop was in the second row for King Charles' Coronation She was criticised for sharing a selfie with Lionel Ritchie Julie Bishop has revealed what the Coronation of King Charles III was really like from her prime position at the ceremony seated in the second row.",
        "The former Australian Foreign Minister on Saturday joined Anthony Albanese and other dignitaries from around the world at the historic event in London's at Westminster Abbey.But she was scalded by veteran entertainment reporter Peter Ford for being inappropriate for sharing a selfie from inside the abbey with her seatmate, 80s singer-songwriter Lionel Ritchie.'Do what you choose outside but not once you enter the sacred place,' Ford said.But Ms Bishop seemed unfazed by the criticism, saying she was flattered when the Dancing on the Ceiling singer re-shared her photo.",
        "'I have never been to anything like this.' she told 7News on Sunday.'I felt deeply privileged to be invited and to witness the pageantry and the beauty and the religious and historical significance of this service was deeply moving.'When you're actually there, there was a sense of excitement and anticipation.'Ms Bishop said she arrived about 2.5 hours before the actual service began and then the service was two hours long.'Everybody was feeling a little bit nervous... (But) everything moved perfectly and there were many moving parts and I had a fabulous spot.''I was in the second row, so just one row back from the aisle. so I was able to have a, a pretty unhindered view of all of the famous faces walking by. ",
        "'I was sitting next to Lionel Ritchie,' she said.She explained he is a global ambassador for the Prince's Trust and she chairs the Prince's Trust.She also revealed that the two were making comments to each other during the service. 'During the procession, we'd be whispering to each other... I'd say that's the Papua New Guineans and he'd tell me who somebody else was.'But then as he was singing a hymn, I was very quiet. I didn't want to have my voice heard. That's quite an experience in itself having Lionel Ritchie singing hymns next to you.'She added that she snapped the selfie of the pair long before the actual ceremony began. 'But, he (Ritchie) was very much in demand and he reposted my selfie. So that was probably as big a thrill as attending the coronation.' she joked.",
        "She added that she has met King Charles on a number of occasions and the pair had gotten along well.'In April of 2018, we traveled to Vanuatu together to inspect the cyclone damage after both Britain and Australia had provided aid.''So we had a trip over on the the royal Australian airline flight and back again and we got on exceedingly well, and I've had dinner with him on a number of occasions.'",
        "'He's very charming, very intelligent, exceedingly well briefed on Australian politics, the nuances of politics in this country.'Prime Minister Anthony Albanese on Sunday said it was an honour to represent Australia at the coronation, where he entered Westminster Abbey behind Governor-General David Hurley and the national flag-bearer, soccer star Sam Kerr.Mr Albanese, a self-proclaimed life-long republican, previously said the event was one of 'enormous significance' and it was entirely appropriate that he attend and pledge allegiance to the King.Republicans had called on the prime minister to stay silent during the oath.Mr Albanese's frontbench colleague, Treasurer Jim Chalmers, said it was the right call for the prime minister to join the pledge on behalf of Australians.'This was an important day and it's obviously crucial that the prime minister attend and pledge allegiance - I think that's what people expect,' Dr Chalmers said."
    ]
}