{
    "articleURL": "/wires/reuters/article-12061551/Twitter-beats-two-lawsuits-stemming-mass-layoffs-now.html",
    "content": [
        "By Daniel Wiessner",
        "May 8 (Reuters) - A California federal judge on Monday dismissed a proposed class action accusing Twitter Inc of targeting female employees for layoffs after Elon Musk acquired the company last year, but said plaintiffs would be allowed to amend the lawsuit to add more details.U.S. District Judge Jon Tigar in Oakland said the lawsuit filed in December was \"devoid of basic information,\" such as the plaintiffs' positions with Twitter and the identity of managers who decided which workers would be laid off.Tigar also said that allegedly sexist remarks made by Musk and cited by the plaintiffs were irrelevant because they came long before he acquired Twitter for $44 billion last year.The decision came after a different judge in the same court on Friday dismissed a separate lawsuit accusing Twitter of discriminating against workers with disabilities by requiring employees to report to the office and put in long hours working at high intensity after the layoffs in November.Both judges gave the plaintiffs three weeks to file amended lawsuits further detailing their claims.Shannon Liss-Riordan, a lawyer for the plaintiffs in both cases, said that she planned to file a revised complaint in each lawsuit adding new facts.Twitter did not immediately respond to a request for comment.",
        "The plaintiffs in the sex discrimination lawsuit say that Twitter laid off 57% of its female workers compared to 47% of men after Musk took over. The disparity was more stark for engineering roles, where 63% of women lost their jobs compared to 48% of men, according to the lawsuit.The disability bias case was filed in November by a former engineering manager and cancer survivor who claims that Twitter fired him when he refused to stop working remotely. Musk said in a memo to staff in November that employees should be prepared to work \"long hours at high intensity\" or quit.The lawsuits are among several Twitter is facing stemming from Musk's decision to lay off about half of the company's workforce.Twitter has denied wrongdoing in those cases, including ones claiming that the company failed to pay promised severance.Liss-Riordan also represents nearly 2,000 former Twitter employees who have filed legal claims against the company in arbitration. (Reporting by Daniel Wiessner in Albany, New York, Editing by Will Dunham, Alexia Garamfalvi and Jamie Freed)"
    ]
}