{
    "articleURL": "/wires/reuters/article-12057381/Kyle-Schwarber-breaks-help-Phillies-end-slide-vs-Red-Sox.html",
    "content": [
        "Kyle Schwarber broke out of a slump by collecting two hits to help the Philadelphia Phillies end a six-game losing streak by beating the visiting Boston Red Sox 6-1 Sunday.",
        "Schwarber had a two-run home run and an RBI single for the Phillies, who ended Boston's winning streak at eight games. His fourth-inning single ended an 0-for-21 drought and was Schwarber's first hit since he homered against the Dodgers last Monday.Taijuan Walker (3-2) went six innings to earn the win. Walker entered the game with a 6.91 ERA but held Boston to one run on three hits and struck out six without a walk. Matt Strahm struck out three in two scoreless innings to pick up his first save.Triston Casas hit his fourth home run of the season for the Red Sox, who scored at least five runs in each game during their eight-game winning streak.Boston starter Tanner Houck (3-2) took the loss after he allowed three runs on five hits in 5 2/3 innings. He struck out four and walked one.Schwarber's home run came against reliever Richard Bleier in the bottom of the sixth and extended Philadelphia's lead to 4-1. Schwarber was the first batter Bleier faced after Houck exited the mound.Schwarber batted fifth in the order Sunday after hitting leadoff for Philadelphia's previous four games. He was 0-for-19 with seven strikeouts in those four contests.The Phillies scored twice in the bottom of the fourth, when back-to-back singles and a walk loaded the bases. Bryson Stott gave Philadelphia a 1-0 lead when he scored from third on a fielder's choice, and then Bryce Harper doubled the lead when he scored from second on Schwarber's single.",
        "The Red Sox got on the scoreboard when Casas hit a solo home run to center in the top of the fifth.Philadelphia capped the scoring on J.T. Realmuto's two-run single in the eighth.Boston's Masataka Yoshida extended his hitting streak to 16 games with a single in the first. He had two of Boston's five hits.--Field Level Media"
    ]
}