{
    "articleURL": "/femail/article-12052073/Look-heir-mate-Hilarious-moment-man-storms-past-Prince-William-Kate-Middleton-Soho.html",
    "content": [
        "The viral TikTok video has amassed over 650,000 'likes' since this morningRead More:  How Kate overcame her nerves! Princess was 'stressed' during Buckingham Palace walkabout - but 'took control' with one move, expert claimsThis is the hilarious moment a member of the public unknowingly stormed past the Prince and Princess of Wales in Soho yesterday.",
        "The royal couple visited the Dog and Duck pub in Soho yesterday afternoon to learn about how the establishment is gearing up for King Charles' coronation this weekend.After greeting members of the public who had gathered on Bateman Street, Kate and William spoke with staff members outside of the pub.But as they prepared to step through the doors, an unamused member of the public somehow managed to get past the barriers and brush past the couple on his way back from the pharmacy.The hilarious video was captured by a TikTok user who had waited on the London street to catch a glimpse of the royal couple.",
        "They captioned the clip: 'No amount of security could stop this man from getting where he needed to go.'The video opens with the Prince and Princess listening intently to what a female member of staff was telling them as they stood in front of the entrance.Then, out of nowhere, the man appears behind them holding a paper pharmacy bag- seemingly unaware that he is in touching distance of royalty.As he strides down Frith Street, the member of the public only stops in his tracks when he spots the cameras on William and Kate.Trying not to ruin the photos, the oblivious man pauses for a moment before continuing down the street - as the crowd breaks out into laughter.",
        "After storming past Kate and William, a person who is thought to be a member of security then approaches the man to inspect his bag.Confident that he didn't pose a threat, the bodyguard directed the man in the direction of the barriers. Having spotted what was going on, curiosity got the better of Kate and the clip ends with the Princess smiling and looking down the road after the man.",
        "The video has amassed over 652,000 'likes' since it was uploaded to TikTok this morning - and viewers were in hysterics over the man's obliviousness.  One replied: 'Dude became famous and has not the slightest clue.' Another added: 'That man probably had no idea who he was passing and I love that for him.' A third wrote: 'He's like, \"I'm literally not thinking about them. I'm trying to get home.\"' 'I love that Kate checked on him though,' a fourth said. 'Kate wouldn't mind,' a fifth said. 'She's without a doubt the loveliest ambassador this country has right now.'",
        "During the engagement, Kate Middleton ripped up the royal rule book as she got very touchy feeling with wellwishers outside the pub.Among the crowd was secondary school English teacher Louis Stevenson - who praised the Princess' Early Years initiative. In a video shared on his Twitter, Louis told the Princess: 'You mean so much and are such an inspiration.'",
        "While discussing Louis' work, Kate admitted: 'I'm trying to get my kids to speak more French.'The Princess then went on to stress 'how important' it is to learn languages in childhood.",
        "As the conversation draws to a close, Louis asked: 'Can I get a selfie with you?' 'Of course,' the Princess replied. 'Thank you so much for my flowers. That's really sweet of you.'As they posed for the photo, Kate put her arm around Louis.'Keep up the hard work,' she said, after giving him a gentle squeeze on the shoulder. Sharing the footage with his followers, Louis wrote: 'Many have reached out, and asked what the Princess and I talked about. I’ll share this video with you. 'She most cheerfully lent an ear, was really interested in my job (I’m a teacher of English), and was genuine with everybody. Yesterday was a dream.'",
        "In response, one fan said: 'What a gentle soul she is! Everyone keeps saying the same thing natural sweet and authentic and that she really is pretty in real life.'Another added: 'Authentic. That’s so unique in today’s world and so appreciated.' Following their interaction with the Princess, the royal fan who runs the TikTok account 'The Kings Guard Official' shared a video of Kate posing for selfies on the street.",
        "The 70-second clip shows the Princess patiently posing for multiple photos with fans and saying: 'It's very nice to meet you.'After posing for a photo with a royal fan at the front of the crowd, a self-deprecating Kate admitted that she often questioned her approach to selfies.She said: 'I'm sorry, I always get really close. I'm like, \"what do I do?!\" She then took another selfie with a fan further down the crowd before asking them if they had travelled far to get to London that day. In the background, a member of the public called out in the background: 'Kate, can I get a selfie? I'm late for my meeting.' ",
        "Warning of the tourists of the potential risk of rain tomorrow, she added: 'I hope you enjoy it. But I was just saying, make sure you find yourself an umbrella! 'It might rain. It's the British way.'At this point, Kate then responds to the impatient man behind the group and leans in for a selfie with him.As he turned his back to her, she exclaimed: 'How are we going to do it?'Giving him a gentle tap on the shoulder, the Princess added: 'I look like I'm Photobombing you!' The video ends with Kate recording a video for a royal fan's family back home - telling them that it's 'very nice to meet you'."
    ]
}