{
    "articleURL": "/wires/reuters/article-12053139/Jays-end-skid-shutout-slumping-Pirates.html",
    "content": [
        "George Springer homered and Chris Bassitt pitched seven shutout innings as the visiting Toronto Blue Jays ended a five-game losing streak by beating the Pittsburgh Pirates 4-0 on Friday.",
        "Bassitt (4-2) gave up four hits and four walks while striking out five. He combined with Erik Swanson and Jordan Romano, who each threw one perfect inning, on a four-hit shutout.Vladimir Guerrero Jr. hit an RBI single and Daulton Varsho added an RBI double for the Blue Jays.The Pirates' losing streak reached five games.Pittsburgh starter Rich Hill (3-3) allowed four runs and eight hits in 5 1/3 innings, with five strikeouts and two walks.Pirates second baseman Ji Hwan Bae left after pulling up while running out a groundout in the eighth inning.In the first, Bo Bichette doubled to center with one out and scored on Guerrero's single to left to give Toronto a 1-0 lead.Pittsburgh hurt itself with some questionable baserunning decisions. The first came in the bottom of the first. Bae led off with a walk and stole second, his 14th steal in 15 attempts. However, with team leading hitter Bryan Reynolds at the plate, Bae took off again and was thrown out trying to steal third.In the second, the Pirates' Rodolfo Castro drew a two-out walk. Tucupita Marcano singled Castro to third, but Castro was thrown out trying to make it home on an errant pitch.The Blue Jays tacked on a run in the fourth. After Hill had retired nine in a row, Whit Merrifield doubled to left with two outs, then stole third. Merrifield scored on Varsho's double to the corner in right, making it 2-0.",
        "In the bottom of the fourth, Carlos Santana walked. Two outs later, Castro singled to left, but Santana tried to score from first and was thrown out at home.Santiago Espinal led off the fifth with a walk. Springer followed with his fourth homer, to center, to increase the Blue Jays' lead to 4-0.--Field Level Media"
    ]
}