{
    "articleURL": "/wires/ap/article-12060603/At-Westminster-King-Charles-spaniel-sort.html",
    "content": [
        "NEW YORK (AP) - At Westminster Abbey, Britain's King Charles III was crowned Saturday. At the Westminster Kennel Club dog show this week, a cavalier King Charles spaniel won't be as lucky.",
        "The affectionate toy dogs are having a moment amid the monarchical fanfare. Over 100 King Charles spaniels marched in a parade in London Saturday to celebrate the coronation, some sporting miniature crowns, perhaps politely signaling to Pembroke Welsh corgis to move over after decades of attention as the late Queen Elizabeth II's beloved pets.Across the pond in New York, Chester the cavalier won his breed, then got eliminated in the semifinals Monday at the Westminster show, the United States' premier canine event.Cavalier King Charles spaniels are named not for the current sovereign but for 17th-century predecessors Charles I and especially Charles II, who was known for his fondness for wee spaniels. (A similar breed, known in the U.S. as the English toy spaniel, comes in both \"Prince Charles\" and \"King Charles\" varieties; the difference is in the coat colors.)\"Cavs,\" as they often are called for short, are renowned for their soft-eyed, sweet expression and attachment to their people.\"They really do comfort you and look deep in your soul,\" says breeder Lynnette Bragg of Springfield, Georgia.",
        "She said her cavaliers \"saved our life\" after she and her husband lost two sons, 17-year-old Matthew in a 2001 car crash and 36-year-old Scott, who had multiple disabilities, in 2010.She was at Westminster on Monday to show one of her cavaliers, named Hope. The dog splits time between Bragg and her friend Lori Dasher, whose husband died of COVID-19 in 2021.",
        "\"I knew when Lori lost her husband, and those children lost their dad, they need a little Hope over there,\" Bragg said as she and Dasher awaited Hope's turn in the ring.\"She´s our little royal girl,\" Bragg said.___New York-based Associated Press journalist Jennifer Peltz has covered the Westminster dog show since 2013."
    ]
}