{
    "articleURL": "/news/article-12059643/Homeowner-hosting-two-Ukrainian-refugees-annexe-refused-mortgage-Halifax.html",
    "content": [
        "Dominik Kaum was refused a mortgage as he was hosting Ukrainian refugeesHalifax thought there was a 'significant risk' he would rent his annexe for money READ MORE: Panic as towns near Ukrainian nuclear power plant evacuatedA homeowner who is hosting two Ukrainian refugees in his annexe was refused a mortgage from Halifax after the bank said there was a 'risk' he would rent the room commercially. ",
        "A Ukrainian mother and her young daughter have been staying with Dominik Kaum and his family since July 2022.Mr Kaum applied for a mortgage with Halifax via a broker when his came up for renewal but it was rejected. The bank claimed that as an annexe attached to the property was being used to host the refugees, there was a 'significant risk' Mr Kaum would in future rent it out for commercial gain.Mr Kaum and his family told the BBC they were 'very surprised' as they had never rented out the annexe and had no intention of doing so. ",
        "The annexe, which Mr Kaum refers to as a small 'granny' flat, is a self-contained room complete with a kitchenette and bathroom. It also has its own front door.'When we contacted the Halifax through our broker they said they could not provide us with a mortgage because we were providing accommodation to a Ukrainian family and therefore there was a significant risk that we would rent out the room commercially in the future,' Mr Kaum said.Halifax has since apologised for the 'confusion' and offered Mr Kaum a mortgage deal.But Mr Kaum claims this was only after he approached BBC's Money Box - who opened an investigation.A Halifax spokesperson told MailOnline: 'We are very supportive of the Homes for Ukraine scheme and would never decline a mortgage application on that basis. ",
        "'As soon as we knew the borrower was taking part in the scheme, we issued the mortgage offer.'",
        "Mr Kaum last month slammed Halifax for refusing to grant the mortgage given the bank's 'emphatic' support of the Homes For Ukraine scheme on its website.On Twitter he wrote: 'It seems disingenuous at best and cynical at worst by @halifaxbank to publicly proclaim support for Homes for Ukraine on their website and communications, and treat your customers like that.'Halifax is emphatic in its support for #HomesforUkraine on its website. However, it has today refused our mortgage renewal, because we are providing accommodation to a Ukrainian family under the scheme.'",
        "According to official figures, 153,000 Ukrainian refugees have so far arrived in the UK and 'most' of them have stayed.It claimed the valuer did not consider the tenancy was of an informal nature when it suggested the annexe was being let.The mix-up has 'fortunately' not affected Mr Kaum's finances, but he says if the refusal hadn't been overturned, they 'would have moved from a fixed-term mortgage to a higher rate and cost us over £9,000 a year'.",
        "As many as 100,000 Ukrainians have been given somewhere to live under Britain's Homes for Ukraine scheme. The scheme was set up after Russia's war on Ukraine began last year, calling upon Brits to house those who had been displaced. Each household housing a refugee is offered £350 a month, tax-free - which will not affect benefit entitlement or council tax status.Sponsors are not expected to provide food and living expenses but can choose to offer this and accommodation has to be provided for a minimum of six months.Ukrainians arriving in the UK also have access to the full range of public services, doctors and schools for up to three years.Anyone who has lived in the UK legally for at least six months can apply to take in a refugee. The hosts do not have to be British citizens.Sponsors will need to undergo criminal record vetting before accepting refugees.Prospective sponsors should register here."
    ]
}