{
    "articleURL": "/tvshowbiz/article-12047733/Michelle-Keegan-opens-spending-months-away-husband-Mark-Wright-filming-Oz.html",
    "content": [
        "Michelle Keegan has opened up about the daunting task of spending months away from home and husband Mark Wright as she filmed new series Ten Pound Poms in Australia. ",
        "The actress, 35, who wed the reality star in 2015, described travelling alone as 'quite scary' as she left behind her life and loved ones in the UK, as filming took place throughout last summer. Michelle plays nurse Kate Thorne in the upcoming BBC show that dramatises the famous Assisted Passage Migration Scheme, which brought more than a million people to Australia after World War II.Recalling the production process she said: 'I absolutely loved filming in Australia. I mean, when I first got there the weather wasn't great, I'm not going to lie, but as a country I really enjoyed it.'In fact, in a way my journey to Australia has parallels with Kate's. It was my first time too and I didn't know what to expect, I came on my own which was quite scary, but it's been such an incredible experience.'The Stan Original Series, Ten Pound Poms premieres May 15 only on Stan. ",
        "Mark did manage to make trips to visit his wife down under and the pair shared snaps of their romantic reunions on social media last year. Back in July discussing their 'tough' long distance relationship, Mark told MailOnline: 'If you're in love and in a happy relationship you will be happy to see each other'.'You have to learn that you've been together for a long time and not seen each other in three weeks so it's exciting at first but then it goes back to being a 10 year relationship.",
        "'The longer you go, the more pressure there is because the longer it's been. But I was in LA and had a dinner with Piers Morgan and I told him it was hard. He said: 'I had this with my wife and we have a 3 weeks rule so don't let it go past 3 weeks.'Before going on say: 'It's tough though with Australia, it's a lot of flying.'Michelle also discussed what she loved about the country ahead of the show's upcoming premiere.Gushing: 'The Australian actors are so brilliant and they bring a different energy to the set'. 'The thing I miss most about Australia is the people. I know it's such a clichéd thing to say, but everyone out there is so lovely, friendly and welcoming. The crew really got on and it was such a nice working environment - and of course I miss the cast'.",
        "Discussing the show's difficult subject matter she said: 'Ten Pound Poms will definitely take the audience on a journey'. 'I think for me and for the viewers, the script is like a history lesson. I didn't know a lot about the Ten Pound Poms before being part of this project but I did a lot of research into it'. Before adding: Now I've talked to lots of people who say: 'Yeah, my grandmother was a Ten Pound Pom and I have family in Australia' and that all stemmed from what happened in the 1950s.",
        "Earlier this week the show's trailer debuted, featuring actors Faye Marsay (Game of Thrones) and Warren Brown (Luther). They play a married couple, The Roberts, who come to Australia in 1956 after paying just £10 for their passage out.The Australian government promise them a better house, better job prospects and a better quality of life Down Under, far away from dreary post-war England.But the family soon discover the grim reality of migrant life as they battle the poor living conditions in a hostel for 'New Australians', as well as prejudice.The trailer begins as Annie (Marsay) and Terry (Brown) arrive in Sydney.But instead of enjoying the glamour of their new city, authorities send them out into the bush.The couple is housed with other recent arrivals in primitive conditions in a migrant hostel.",
        "Even though Terry is a qualified builder, the only work he can get is digging ditches. He soon finds himself in a fist fight with a local tough guy, played by David Field.At one point, Terry appears ready to return to England, but Annie is starting to fall in love with her new country. 'I've never felt so alive in years,' she tells him.Other scenes show Terry finding friendship with Ron (Rob Collins), an Indigenous Australian war veteran, who is struggling to fit into white society.",
        "The series will premiere Sunday May 14 at 9pm on BBC1"
    ]
}