{
    "articleURL": "/wires/reuters/article-12058395/Encouraged-New-Zealand-leave-Pakistan-high.html",
    "content": [
        "May 8 (Reuters) - A whirlwind white ball tour of Pakistan offering little at stake proved an unexpected blessing for a depleted New Zealand squad as fringe players stepped up in the absence of the team's Indian Premier League A-listers.",
        "The Tom Latham-captained Black Caps captured a 47-run consolation win in the fifth and final One Day International in Karachi on Sunday to avoid a series whitewash and knock Pakistan off their world number one ranking in the format.The 4-1 result was a fair reflection of the gulf between the full-strength hosts and a New Zealand squad lacking the services of Kane Williamson, Tim Southee and other top players.Yet Black Caps staff will be encouraged by the resolve of a group which held Babar Azam's side to a 2-2 draw in the T20 series and landed a few blows in the ODI component ahead of the World Cup in India in October-November.\"It was nice to - probably not put a complete performance together - but to get over the line and leave with a smile on our face,\" said rookie paceman Henry Shipley.\"It's been a pretty tough place to come over here and bowl seam. We learnt a lot in the process.\"Shipley, who made his T20 International debut last month, is among a few Kiwi players to leave Pakistan with an elevated standing after taking a miserly 3-34 in the final ODI to be named Player of the Match.Mark Chapman did his hopes of breaking into New Zealand's World Cup squad no harm by smashing 290 runs in a record for a five-match series in the T20 format.",
        "Chapman's fellow all-rounder Cole McConchie shone in a losing cause with an unbeaten half-century on his ODI debut in the third match of the series in Karachi.Opener Will Young also finished on a high, leaving his poor T20 form behind to bookend the ODI series with half-centuries in Rawalpindi and Karachi against a world class attack.\"It's great to come over here and compete,\" said Shipley.\"We come away with a lot of knowledge and skills which will be useful in the future, hopefully.\"(Reporting by Ian Ransom in Melbourne; Editing by Peter Rutherford)"
    ]
}