{
    "articleURL": "/wires/ap/article-12054897/Prince-Harry-odd-man-fathers-coronation-spectacle.html",
    "content": [
        "LONDON (AP) - In the fairy-tale ending to the ancient pageantry in which King Charles III was crowned monarch, he stepped into a gilded horse-drawn carriage with his queen and rode off to his palace.",
        "Following closely behind was Prince William, his eldest son and heir, along with his family, including 9-year-old Prince George who is second in line to the throne.The king's youngest son was nowhere to be seen. On his father's biggest day, Prince Harry arrived at Westminster Abbey alone and he left alone. The disgruntled Duke of Sussex was assigned to sit two rows behind his brother.His isolation was likely the result of him quitting his royal duties and, thus, no longer ranking as a senior family member - as well as alienating himself from his father and brother by airing grievances and telling palace secrets in his explosive best-selling memoir, \"Spare.\"If anyone was hoping the coronation would help break the ice between Harry and his brother, who were once so close, they are sure to have been disappointed. The siblings were not seen speaking or even acknowledging each other during the ceremony.After months of speculation about whether he would attend, it was announced about three weeks ago that Harry would come alone, leaving behind his wife, Meghan, and their two young children at their Southern California home.",
        "Harry and Meghan, who is biracial, left royal life and moved to the U.S. in 2020 after complaining about intense scrutiny and racist attitudes from the British press.",
        "In a six-part Netflix series, they lobbed other criticisms at the royal family, alleging racial bias. In January, Harry dropped his bombshell book dishing family dirt along with intimate details about losing his virginity behind a pub at 17, taking drugs and killing enemies in Afghanistan.The book was particularly unflattering toward his stepmother, Camilla, who was once blamed for wrecking his father's marriage to his mother, the late Princess Diana. He accused Camilla of leaking private conversations to the media to rehabilitate her own image after marrying Charles.Buckingham Palace had announced before the coronation that Harry and the king´s brother, Prince Andrew, would not have any role in the service.Andrew, the Duke of York, relinquished royal duties after revelations about his friendship with convicted sex offender Jeffrey Epstein. He was later stripped of his honorary military titles and patronages and settled a lawsuit with a woman who said she was forced to have sex with him when she was a teenager.William played a prominent role, kneeling at his father's feet, pledging his loyalty and then kissing him on the cheek. George served as page boy, helping to carry the train of his grandfather's robes.Harry entered the cavernous church in a black custom Dior three-piece suit with coattails. An honorary cross hung around his neck and military medals were pinned to the left side of his chest. He nodded, waved and spoke a few words to clergy and several guests already seated.",
        "He proceeded along behind his cousin, Princess Eugenie and her husband, Jack Brooksbank, who followed her father, Andrew. They all sat in the same row.During the two-hour spectacle, keen attention was focused on Harry by the media and royal watchers. He appeared to join the congregation in one of many refrains of \"God save the king\" during the pomp- and music-filled ceremony.Some British tabloids even consulted professional lip-readers to interpret what Harry was saying.The Daily Mirror revealed that it appeared he said, \"hello,\" \"morning\" and \"nice to see you\" when he entered the church.Harry has vowed to make media reform part of his mission in life. He has filed several lawsuits against the publishers of British tabloids for a phone-hacking scandal dating back more than a decade.His trial against the publisher of the Mirror begins Wednesday in the High Court. Harry is expected to testify in June.After the carriages departed from the church, Harry was seen waiting for a car. He was later seen at Heathrow Airport. His son, Archie, turned 4 on Saturday and it was said he was headed back for his birthday.A short while later, King Charles III and Queen Camilla stepped out onto the balcony of Buckingham Palace to wave to the crowd gathered below. They were joined by William, his wife, Kate, three children and other senior royals."
    ]
}