{
    "articleURL": "/tvshowbiz/article-12059109/Oppenheimer-trailer-stars-Cillian-Murphy-Emily-Blunt-Florence-Pugh-Matt-Damon.html",
    "content": [
        "A new trailer has been released for Christopher Nolan's epic thriller Oppenheimer - and it stars some of the most famous faces in showbiz. ",
        "The film features Peaky Blinders' Cillian Murphy, 46, as J. Robert Oppenheimer and Emily Blunt, 40, as his wife, biologist and botanist Katherine 'Kitty' Oppenheimer. Meanwhile, Little Women star Florence Pugh, 27, dons a chic brunette choppy bob hairstyle as she plays psychiatrist Jean Tatlock - while Matt Damon portrays General Leslie Groves Jr, director of the Manhattan Project. Written and directed by Christopher Nolan, epic thriller Oppenheimer thrusts audiences into the pulse-pounding paradox of the enigmatic man who must risk destroying the world in order to save it.The IMAX-shot film will hit cinemas from July 21.  ",
        "The film centres on the life of American theoretical physicist J. Robert Oppenheimer, who was director of the Los Alamos Laboratory responsible for the creation of the first atomic bomb in the Manhattan Project. In August 1945 the bombs were detonated on the Japanese cities of Hiroshima and Nagasaki - the only use of nuclear weapons in war to date - to end the Second World War.  It is based on the Pulitzer Prize-winning book American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer by Kai Bird and the late Martin J. Sherwin. The three-minute long new trailer is tense, showing the race against time to develop the bomb and the moral dilemmas that come alongside it.",
        "Other famous faces include Robert Downey, Jr who plays Lewis Strauss, a founding commissioner of the US Atomic Energy Commission.Benny Safdie plays theoretical physicist Edward Teller, Michael Angarano plays Robert Serber and Josh Hartnett plays pioneering American nuclear scientist Ernest Lawrence.Oppenheimer stars Rami Malek and reunites Nolan with eight-time Oscar nominated actor, writer and filmmaker Kenneth Branagh.The cast also includes Dane DeHaan (Valerian and the City of a Thousand Planets), Dylan Arnold (Halloween franchise), David Krumholtz (The Ballad of Buster Scruggs), Alden Ehrenreich (Solo: A Star Wars Story) and Matthew Modine (The Dark Knight Rises).",
        "It comes after Cillian Murphy said he was 'desperate' to land lead role in Christopher Nolan's upcoming Oppenheimer after five films as a supporting actor.'I have always said publicly and privately, to Chris, that if I'm available and you want me to be in a movie, I'm there,' he said.'I don't really care about the size of the part,' Murphy revealed in an interview with the Associated Press. 'But deep down, secretly, I was desperate to play a lead for him.' It turns out Murphy didn't have a clue about getting the lead role in Oppenheimer until Nolan called him up out of the blue and offered him the part.'He's so understated and self-deprecating and, in his very English manner, just said, \"Listen, I've written this script, it's about Oppenheimer. I’d like you to be my Oppenheimer,\"' Murphy recalled, before adding, 'It was a great day.'",
        "Instead of focusing on the science of the atom bomb and what it entails, Murphy decided to focus his pre-shoot preps on learning more about J. Robert Oppenheimer and what inventing the atomic bomb does to the individual, the actor told The Guardian last year.'You realise this is a huge responsibility. He was complicated and contradictory and so iconic,' Murphy said of Oppenheimer the man, adding, 'But you know you're with one of the great directors of all time. 'I felt confident going into it with Chris. He’s had a profound impact on my life, creatively and professionally. He’s offered me very interesting roles and I’ve found all of them really challenging. And I just love being on his sets.'",
        "Nolan wrote and directed Oppenheimer with a budget of at least $100 million, according to Screen Rant.And like his previous works, the London, England native extensively used practical effects and minimal computer-generated imagery.'I think people will be very surprised and wowed by what he does. Anything I say will just seem a bit lame as compared to seeing this in an IMAX theater,' Murphy said of Nolan.The film is produced by Emma Thomas, Atlas Entertainment's Charles Roven and Christopher Nolan.Oppenheimer will hit cinemas from July 21."
    ]
}