{
    "articleURL": "/sport/ufc/article-12056737/UFC-Tony-Ferguson-arrested-suspicion-drunk-driving-crashing-truck-two-cars.html",
    "content": [
        "Police claimed the 39-year-old was 'uncooperative' and his breath reeked booze Ferguson apparently hit the Mercedes of rapper Cash Gotti, according to TMZDailyMail.com provides all the latest international sports news UFC fighter Tony Ferguson was taken into custody after allegedly crashing his truck into two parked cars before it flipped over during the early hours of Sunday morning.",
        "Street footage from L.A. shows the 39-year-old's vehicle capsized to its left side at around 2 a.m. near a club in Hollywood. The former interim UFC Lightweight champ' is believed to not have suffered any injuries, L.A.P.D. confirmed to DailyMail.com.Nobody else was hurt in the car crash. What's more is that Ferguson apparently refused to take a breathalyzer test and was said 'to be uncooperative' with police. He was suspected to be drunk behind the wheel after officials noticed his breath reeking of alcohol and his eyes being bloodshot. ",
        "The mixed martial art's veteran was arrested at the scene and could be slapped with a misdemeanor DUI, as well as a license suspension for refusing the order of taking a field sobriety test. Rapper Cash Gotti told TMZ that he found his Mercedes all wrecked up after coming out of the club. His luxury car was one of the two vehicles allegedly hit by Ferguson.Sunday's car crash comes nearly eight months after Ferguson came out of a fight against Nate Diaz with a gruesome leg gash.The California-native replaced Khamza Chimaev at the last minute to take on Diaz in September 2022, due to the Russian-born Swede not meeting the requirement of weighing at least 186-pounds. ",
        "In 2019, Ferguson's wife, Christina, filed a restraining order against him, alleging 'uncharacteristic behavior' such as intense paranoia, sleep deprivation and that he tore the fireplace at their home. ",
        "She added that the UFC fighter believed a tracking chip was inserted into his leg during reconstructive knee surgery, though she didn't allege physical abuse and mainly filed the restraining order so that her husband could better his mental health.In April, Ferguson' wife withdrew the order. Ferguson started his mixed martial art's career in 2008 and has been with the UFC since winning the Ultimate Fight 13 against Ramsey Nijem in 2011. He won 25 of his 33 fights -- 12 of them by knockout, eight by submission and five by decision."
    ]
}