{
    "articleURL": "/wires/reuters/article-12054889/Arsenal-aim-stay-title-contention-visit-Newcastle-United.html",
    "content": [
        "Arsenal look to keep their Premier League title hopes alive Sunday when they visit a Newcastle United side focused on sealing a return to the UEFA Champions League.",
        "After Manchester City's 2-1 win over Leeds United on Saturday, Arsenal (24-4-6, 78 points) enter Sunday four points back of City for the league lead with four matches to play for both teams.Anything short of a victory would put Manchester City in firm control of their own fate. But Arsenal manager Mikel Arteta -- once an assistant on City manager Pep Guardiola's staff -- knows a victory at St. James' Park would at least keep pressure on the leaders.\"I don't know what's going to happen,\" Arteta said. \"They have won a lot of games in the last few months, and if they continue to do so they will deserve to win the league. If they don't then we have to be ready, winning our games, to be there.\"That hasn't been a given since the beginning of April. Arsenal's 3-1 home win over Chelsea on Tuesday snapped a season-worst four-match league winless run (0-1-3).Martin Odegaard scored his 13th and 14th goals of the season and Gabriel Jesus added his 10th all before halftime as the Gunners completed the season sweep over their London rivals. But Noni Madueke's second-half consolation tally extended Arsenal's run to seven games without keeping a clean sheet.Meanwhile, Newcastle (18-4-11, 65 points) have been the Premier League's best defensive team, conceding only 27 times as they seek out their first Champions League group stage appearance since the 2002-03 tournament.",
        "In some ways, maybe that defensive focus had limited the Magpies, however. More recently, they've allowed goals in 12 of their past 13 games, but they are in a stretch where they've won eight of nine in the league.A major force driving that recent form is the improved striker play of Alexander Isak and Callum Wilson. After injuries limited Isak for the first half of the season, he's scored seven of his 10 league goals since March began. And Wilson has eight of his team-leading 15 during Newcastle's winning run.A home victory would keep Newcastle in third above Manchester United after the weekend, and with at least a six-point cushion of safety on a top-four finish and a UCL berth.The Magpies have posted a 1-1-3 record in their five previous games against their top four opponents.\"We're competing against elite teams who will fight to the end and we have to do the same,\" Newcastle manager Eddie Howe said. \"In our five games (remaining) we need to give our best preparation and focus because the fight we're in could go right to the end of the season.\"--Field Level Media"
    ]
}