{
    "articleURL": "/sport/nhl/article-12055221/Rangers-coach-Gerard-Gallant-mutually-agree-ways.html",
    "content": [
        "Recently Gallant had criticized questions about his job security from reportersThe Rangers held a 2-0 first-round lead over the Devils before losing the series DailyMail.com provides all the latest international sports news The New York Rangers have announced the departure of head coach Gerard Gallant, calling the move a 'mutual' decision only days after he bristled at the notion that his job was in jeopardy. ",
        "The team finished third in the Metropolitan Division at 47-22-13, but failed to capitalize on deadline acquisitions of stars such as Patrick Kane and Vladimir Tarasenko. Ultimately the Rangers blew a 2-0 series lead in a first-round loss to the rival New Jersey Devils.Tarasenko had three goals and an assist and Kane added a goal and five assists and against the Devils, but the energetic third line of youngsters Kaapo Kakko, Filip Chytil and Alexis Lafrenière combined for only two goals and four assists in the series. Until recently, Gallant had been miffed about reports suggesting the Rangers were mulling a coaching change after their playoff disappointment.'This year we lost in the first round,' Gallant told reporters. 'So did I have a tough two weeks, did we have a tough two weeks? Yeah. But besides that, I can't believe I have to answer some of these questions about me getting let go or getting fired.'",
        "Gallant was fired by Florida 22 games into the 2016-17 season, months after leading the Panthers to an Atlantic Division title and a first-round exit in the playoffs. He guided expansion Vegas to the Stanley Cup Final in its inaugural season and a first-round exit the following year before he was let go 49 games into the 2019-20 season.",
        "Once again, despite some initial success in New York, the former Detroit Red Wings forward is looking for another head-coaching position.  'I want to first thank Gerard for his work and commitment to the Rangers during his time as head coach,' Rangers President and General Manager Chris Drury said in a statement. 'I have a ton of respect for Gerard as both a coach and person and truly appreciate everything he did for us on and off the ice these last two seasons. After my evaluation of the season and discussions with Gerard, we mutually came to the conclusion that a change would be beneficial for both parties. I wish he and his family all the best in the future. Our search for a new head coach will begin right away.'Gallant offered a similar statement, thanking the team, owner James Dolan, and Drury.",
        "'The experience of coaching an Original Six franchise with such rich history and an incredibly passionate fanbase is something I will never forget,' said Gallant. 'After conversations with my family and Chris, it became clear that this was the right decision for both myself and the Rangers at this time.'The Rangers have five unrestricted free agents - led by midseason acquisitions Kane (five goals, seven assists in 19 games in New York), Tarasenko (eight goals 13 assists in 31 games), Tyler Motte (five goals, five assists in 24 games) and defenseman Niko Mikkola. Backup goalie Jaroslav Halak is also on the list after going 10-9-5 with a 2.72 GAA behind Shesterkin.",
        "The 34-year-old Kane is unsure of his status for next season, though he revealed he had an injury that might need offseason surgery. Tarasenko wants to return and Motte - acquired at the deadline in each of the last two seasons - also hopes to stick around this time.Also, Lafrenière (16 goals and career-highs of 23 assists and 39 points) and defenseman K'Andre Miller are key restricted free agents."
    ]
}