{
    "articleURL": "/sport/golf/article-12047623/McIlroy-action-34th-birthday-break-mental-emotional-being.html",
    "content": [
        "McIlroy revealed he needed a break for his 'mental and emotional well-being' World No 3 criticised for withdrawing from RBC Heritage after Masters setback He pointed to the strains of his involvement in golf's civil war across past yearAfter the turmoil and traumas of recent weeks, Rory McIlroy marked his 34th birthday with some promising form on his return to action at the Wells Fargo Championship on Thursday.",
        "Having taken an unscheduled break for the sake of his emotional well-being in the wake of missing the cut at the Masters last month, McIlroy looked solid in an opening 68 at Quail Hollow.It is a tournament he has won three times before, so there was a degree of comfort attached to McIlroy's decision to return to Charlotte and his response was a loop of four birdies and a single bogey. The three-under round left him two behind the early clubhouse leaders Kevin Streelman, KH Lee and Taylor Moore.'It was nice to get off to a good start,' McIlroy said. 'Nice to feel like I played well. I didn't want to spend my birthday afternoon grinding on the range, so it was nice to play OK.' ",
        "Despite some wayward driving - McIlroy hit only five of 14 fairways - the world No 3 reached the turn in two under after starting on the 10th.Two further bogeys followed on the way in, with his solitary dropped shot brought about with a lost ball off the tee on the seventh.McIlroy had put his absence down to a need to 'refresh' following the exhaustion of his role in reshaping the PGA Tour during golf's civil war with LIV. That wider conflict extended this week when Lee Westwood, Ian Poulter and Sergio Garcia resigned their membership of the DP World Tour, meaning they will no longer be eligible for involvement in the Ryder Cup.",
        "McIlroy said: 'I think it's a shame that you've got the highest points score ever in the Ryder Cup (Garcia) and two guys that when they look back on their career, that (the Ryder Cup) is probably going to be at least a big chunk of their legacy. For those three guys to not captain Europe one day, it's a shame.'But as the DP World Tour said in their statement, that was their choice and they knew these were potentially going to be the consequences of those choices.' Matt Fitzpatrick shot a 69."
    ]
}