{
    "articleURL": "/wires/reuters/article-12044559/Tyre-Nichols-legal-alcohol-blood-beaten-Memphis-police-ABC.html",
    "content": [
        "By Daniel Trotta",
        "May 3 (Reuters) - An autopsy showed Tyre Nichols had a legal amount of alcohol and a trace amount of marijuana in his blood when Memphis police beat the Black man to death after a traffic stop in January, ABC News reported on Wednesday, undermining police claims that Nichols was high.Nichols' death provoked widespread outrage after police video showed officers beating and kicking Nichols, 29, as he cried out for his mother near his family home in Tennessee. Five police officers, all Black, have been charged with second-degree murder.The autopsy also found Nichols \"died from blunt force trauma and the manner of death was homicide,\" according to a statement from the Nichols family attorneys, Ben Crump and Antonio Romanucci, sent to Reuters.The Shelby County District Attorney's Office, which is prosecuting the five police officers, shared the report with the family before it became public, ABC said, citing one of the network's journalists who was in the room with the family at the time.Nichols' blood alcohol level was .049%, well below the .08% legal limit in Tennessee, and he had trace amounts of marijuana in his system, ABC reported.Police body camera video of events after the beating captured officers claiming Nichols was high and expressing disbelief when no contraband was found in his car.",
        "The video showed the first emergency medical technician to treat Nichols first asked him, \"What'd you have? We're trying to get you straight. What'd you have?\"At the time Nichols was mortally wounded, seated against a patrol car and with his hands cuffed behind his back. His response was unintelligible. He died in a hospital three days later.Crump and Romanucci are representing Nichols' family in a $550 million federal lawsuit against the city of Memphis.The official report is \"highly consistent with our own reporting back in January of this year. We know now what we knew then,\" the lawyers' statement said, referring to an independent medical examiner's autopsy conducted in January.\"The official autopsy report further propels our commitment to seeking justice for this senseless tragedy,\" the statement said.The Shelby County District Attorney's Office did not immediately respond to request for comment.The Shelby County Medical Examiner has told reporters the autopsy report will be available on request via U.S. Mail and sent without any advance notice. (Reporting by Daniel Trotta; additional reporting by Tyler Clifford; Editing by Donna Bryson and Leslie Adler)"
    ]
}