{
    "articleURL": "/wires/ap/article-12054509/2-Florida-men-sentenced-armed-robbery-postal-worker.html",
    "content": [
        "TAMPA, Fla. (AP) - Two Florida men have been sentenced to federal prison for the armed robbery of a postal worker.",
        "Omar Rochester Miller Jr., 23, and Christopher Diaz, 27, were sentenced Thursday in Tampa federal court, according to court records. Miller received nine years and two months, and Diaz received eight years. Both pleaded guilty in January to armed robbery of a postal mail carrier and theft of postal keys. Miller also pleaded guilty to brandishing a firearm during the commission of the robbery.\"Employee safety is a top priority for the U.S. Postal Inspection Service,\" said Miami Division Inspector in Charge Juan Vargas said in as statement. \"These convictions and sentences demonstrate the commitment of the Inspection Service, as well as our partners at the Hillsborough County Sheriff´s Office and the U.S. Attorney´s Office, to bring justice to anyone who would endanger the public servants of the Postal Service.\"Miller robbed a letter carrier at gunpoint while she was delivering mail at a Tampa apartment complex and stole her postal keys, according to court records. The keys can be used to steal checks and other valuables sent through the mail.After pushing the mail carrier to the ground, Miller ran to a waiting getaway car, driven by Edwin Betancourt Vega, prosecutors said. The robbery was organized through phone calls and text messages between Betancourt Vega and Diaz, to coordinate the robbery and sale of the postal keys in exchange for cash, investigator said.",
        "Law enforcement recovered the postal keys, as well as proceeds from the sale of the key from both Miller and Betancourt Vega, officials said. They also recovered the firearm used in the robbery, which contained Miller´s DNA, prosecutors said.Betancourt Vega was previously sentenced to four years and three months in federal prison for his role in the robbery."
    ]
}