{
    "articleURL": "/wires/pa/article-12046443/Dogs-flock-polling-stations-Star-Wars-outfits-photo-ID.html",
    "content": [
        "A poodle dressed as a Star Wars character and a golden retriever with her own photo ID have joined an election tradition as dogs gathered at polling stations across the UK on Thursday.",
        "The hashtag #dogsatpollingstations has become a highlight of election days for many animal lovers on social media, as people share photos of themselves exercising their pets and democratic rights at the same time.This year’s local elections are the first major electoral test for Prime Minister Rishi Sunak, but they also fall on May 4 – also known as Star Wars Day – which inspired Helen Jakes to mark the occasion with her canine companion in costume.The 31-year-old dressed up as Princess Leia and had her poodle cross Pekoe don an Ewok outfit for their trip to a polling station in Batley, West Yorkshire.",
        "“I’ve always been a big fan of Star Wars and General Leia, who would definitely exercise her right to vote, so the stars just aligned,” Ms Jakes, who works in communications, told the PA news agency.Among others sharing tweets for the trending hashtag were those reminding voters to bring photo identification as this is the first election where ID is compulsory.Annette Hill, from Weston-super-Mare, made her dog Ruby her own photo ID, complete with name, photo, and an “authorised signature” of a paw print.The 58-year-old, who works in learning and development HR, said her two-year-old golden retriever was making her first trip to the polling station.",
        "“I discovered the #dogsatpollingstations a few years ago and always took our old dog – it’s the best thing on Twitter,” she told PA.“It’s become a fun tradition for us to take our dog and bring a smile when doing something that can be quite dry.”Paula Langford, from Suffolk, posted a picture of her rescue dog Bessie and also took the opportunity to remind people to bring their ID.“I thought sharing a quick pic might help to remind people to take their photo ID when they go to vote,” said the 53-year-old communications officer for Mid Suffolk District Council.Zara Farrar, who shared a picture of her labradoodles Blyton and Bronte in Oxfordshire, said she took her dogs along to vote because “everyone loves dogs at polling stations”.",
        "The 34-year-old civil servant also accompanied her tweet with a reminder that read: “Blyton and Bronte would like to remind you that you now need photo ID to vote.“Our polling station is at the end of one of our usual walks so it was a great opportunity to kill two birds with one stone, walk the dogs and exercise our democratic rights.”Some voters bucked the canine trend by taking their cats along to the polling station, such as Nicole Pretorius, who posted a picture of her cat tagged #catsatpollingstations",
        "The 48-year-old was followed by her cat Bertie, aged eight, when she left the house to vote in North Leeds. Ms Pretorius, who works in social media management, described her cat as a “political cativist” and said he was “insistent” on following her to vote. Bertie celebrated exercising his democratic rights with “some catnip and a snooze on the front lawn”."
    ]
}