{
    "articleURL": "/tvshowbiz/article-12057795/Robert-Irwin-reunites-glamorous-rumoured-ex-Emmy-Perry-Steve-Irwin-gala-Los-Angeles.html",
    "content": [
        "He is smitten with his new girlfriend Rorie Buckley.",
        "But Robert Irwin’s ladylove sadly missed the annual Steve Irwin Gala Dinner in Los Angeles over the weekend.The son of the late 'Crocodile Hunter' did however reunite with his rumoured ex flame, actress and video gaming heiress Emmy Perry.The pair cuddled up on the red carpet as they celebrated the legacy of Steve and raised much-needed funds to continue his conservation work worldwide.Emmy, 18, proudly posted several pictures of herself catching up with the entire Irwin clan on her Instagram page.",
        "‘So great to be back this year celebrating the life, love, passion and commitment Steve Irwin graced our beautiful world with. And what an honor to get to celebrate the ultimate wildlife warrior with his amazing family, who I am blessed to call my dear friends  - Terri @bindisueirwin @robertirwinphotography @chandlerpowell’ she wrote in the caption.It follows reports back in 2022 that Emmy's long-time friendship with Robert, 19, had blossomed into a romance.",
        "In addition to her acting career, Emmy is an animal welfare advocate and heiress to a video game fortune worth an estimated $380million.The star jetted to Queensland in July last year in order to spend time with Robert, who she has known since 2019.At the time she was sharing photos on Instagram of the pair at Australia Zoo, and also posted a video of them returning a turtle to its natural habitat.",
        "They were first pictured together at Disneyland back in 2019, after meeting earlier that year at the Steve Irwin Gala Dinner in Los Angeles.There was nothing in Emmy's social media posts to suggest they were more than friends, but Woman's Day at the time reported they may be romantically involved.Emmy, who hails from Newport Beach, California, is the daughter of Northern Irish video game developer David Perry.Perry is best known for creating various hit games for 16-bit consoles in the 1990s, including Earthworm Jim and Disney's Aladdin.",
        "He later sold his cloud-based games service Gaikai to Sony Computer Entertainment in 2012 in a deal worth a reported $380million.Meanwhile, Robert is enjoying a blossoming romance with Rorie Buckley, the niece of late Heath Ledger.Robert and Rorie, 18, were first spotted together on a romantic beachside date in Queensland on November 18, 2022.",
        "The couple have plenty in common; both grew up in the public eye after suffering the devastating loss of a family member.Rorie's uncle Heath Ledger was at the peak of his Hollywood career when he was found dead in January 2008 following an accidental prescription drug overdose.Robert's father Steve Irwin, known around the world as 'the Crocodile Hunter', died aged 44 on September 4, 2006, after being pierced in the chest by a stingray.",
        "Steve is survived by his wife Terri, daughter Bindi and son Robert - who was just three years old when his father passed away."
    ]
}