{
    "articleURL": "/sport/football/article-12054009/Man-City-open-talks-25m-rated-James-McAtee-extending-contract.html",
    "content": [
        "Manchester City have begun fresh talks with James McAtee over a new contractThe midfielder has spent the current season on-loan at Sheffield UnitedMcAtee wants to try and cement his place in the Man City first-team set-upManchester City are ready to open talks over a new contract for £25million-rated midfielder James McAtee following his successful loan spell with Sheffield United.",
        "McAtee was instrumental in the Blades' promotion campaign despite a difficult early transition period as he adjusted to the physical rigours of the Championship. Ultimately, he had such an impact that he was named the club's young player of the year.Indeed, manager Paul Heckingbottom would be keen to take the 20-year old McAtee back again but faces growing competition from Premier League rivals.Brighton, Burnley, Leicester City, Aston Villa, Bournemouth, Brentford, Wolves and Leeds United have all expressed an interest in the England U21 international should he become available.Primarily though, McAtee wants to stake a claim for a first team place at Manchester City and has been encouraged by Pep Guardiola's praise for his performances this season.",
        "City plan to open talks over a new contract for the midfielder and he is keen to sign.For all the interest in his services, McAtee, nicknamed the 'the Salford Silva' for his likeness in style to City's former Spanish midfielder David, is determined to prove himself worthy of a place alongside Guardiola's array of stars - regardless of who they may bring in this summer.City had hoped to add Jude Bellingham from Borussia Dortmund but he is leaning towards a move to Real Madrid while Chelsea's Mateo Kovacic is also on their list as is Gabri Veiga from Celta Vigo.",
        "Ilkay Gundogan has an offer to extend at City but also has an offer from Barcelona. The Germany international, however, is still to be assured that the Spanish champions elect can make the necessary financial cuts to register his signing."
    ]
}