{
    "articleURL": "/wires/ap/article-12040425/Gone-20-years-Old-Man-Mountain-lives-NH.html",
    "content": [
        "CONCORD, N.H. (AP) - Two decades after New Hampshire´s famous Old Man of the Mountain crumbled to pieces, the state is paying tribute to the granite profile that symbolizes its independence with new geological research, poetry, a song, and a scavenger hunt.",
        "The 40-foot-tall (12-meter-tall) natural rock formation - a series of ledges that resembled an old man's facial profile - was suspended 1,200 feet (366 meters) above Franconia Notch, held in place by turnbuckles and rods to fight erosion. It collapsed, and the rubble was discovered the morning of May 3, 2003.\"When he was up there, he represented a kind of reliantly steady, reassuring presence in a world that was otherwise changing really rapidly,\" said Brian Fowler, a geologist and president of the Old Man of the Mountain Legacy Fund that led an online tribute Wednesday, with shared stories, poetry, and a new song. His departure was a stunning and shocking event, Fowler said.Among the people who memorialized him were elementary-school children, born long after the Old Man fell.\"This landmark was a great loss, he was New Hampshire's greatest boss,\" began a poem by one girl who read it during the ceremony.The Old Man was created by a series of geological events going back millions of years. It's not clear how old it was; New Hampshire historical records mention it as early as 1805. Geologists believe it formed sometime after the end of the Ice Age, perhaps as long as 12,000 years ago.",
        "Today, there's a better sense of the volume and mass of rock that was lost when the Old Man fell from Cannon Mountain. It couldn't be calculated before. A research project led by Dartmouth College graduate student Matthew Maclay estimates it was 750 cubic meters - \"more volume than five school buses,\" he said.",
        "Maclay, who is studying soil and rock samples from the mountain, created an online interactive 3D model of the Old Man as it was. He was assisted by Dartmouth collaborators who used a drone to do aerial surveys. He also used original film negatives taken between 1958 and 1976 that documented the formation and area. Viewers can see the model up close and at different angles.\"The Old Man of the Mountain may have weighed nearly 2,000 tons when it collapsed,\" said Maclay, who spoke about his research Wednesday. \"While 3-inch turnbuckles had been bolted into the Old Man to try and prevent it from falling, the actual strength of the granite was degraded over centuries, and that´s probably why it collapsed.\"Through the years, the profile became the subject of paintings and literature. Novelist Nathaniel Hawthorne wrote about \"The Great Stone Face.\" Statesman Daniel Webster said, \"Shoe makers hang out a gigantic shoe; jewelers a monster watch, and the dentist hangs out a gold tooth; but up in the Mountains of New Hampshire, God Almighty has hung out a sign to show that there he makes men.\"\"When the Old Man was written about, he was given the characteristics of what could generally be thought of as New Hampshire qualities and values - rugged individualism, stoic, steadfast, able to weather anything,\" said Inez McDermott, curator of an upcoming exhibit at the Museum of the White Mountains at Plymouth State University.",
        "Efforts to save the Old Man and 6,000-acre (2,340-hectare) Franconia Notch began in the 1920s, when the land was for sale. The Society for the Protection of New Hampshire Forests began a successful fundraising campaign to save the notch, \"selling\" its trees in exchange for a certificate of purchase for every tree protected. Further concern about the Old Man's future was expressed beginning in the late 1950s, when the state recommended extending Interstate 93 through Franconia Notch.The Old Man became the state's most recognizable symbol - the Legislature adopted it as the state emblem in 1945, and it still appears on the state quarter, highway signs, license plates and souvenirs. The Legislature passed a bill this session that would remember the Old Man with an annual proclamation on May 3. Gov. Chris Sununu signed it into law Wednesday.Fundraising began for a memorial soon after the Old Man tumbled. Today, visitors to Franconia Notch State Park can \"see\" the Old Man's profile through a series of steel rods driven into a granite base that hang over a lake and point toward the cliff. Each has a series of irregular shapes on the side. When visitors position themselves correctly with the shapes, they can view an outline of the profile of a face.",
        "A plaza has granite paving stones with donors' names and messages. A scavenger hunt with prizes is planned this summer. People from all over the world have shared their memories on the website, Fowler said.McDermott notes that Sununu's latest election campaign featured the Old Man's profile on his signs, and a transgender rights protester held a sign with the profile at a Statehouse rally in March.\"When I mention I am working on this exhibition, people want to tell me either how they felt the first time they saw it, or where they were when they learned it fell. There are a few exceptions - but most people tell me they feel something of a loss and like to discuss why that is,\" McDermott said.___This story has been corrected to show that the current governor's first name is Chris, not John."
    ]
}