{
    "articleURL": "/sport/football/article-12047347/Man-United-FINED-7-500-failing-control-provocative-behaviour-18s.html",
    "content": [
        "Manchester United were knocked out the FA Youth Cup by Stoke City in JanuaryThere were controversial scenes following the 1-0 defeat in the fourth round tieUnited have been fined for failing to control their side's 'provocative behaviour' The FA have fined Manchester United £7,500 after failing to control the 'provocative behaviour' displayed by their Under 18 side following a defeat to Stoke in the FA Youth Cup.",
        "United - who have won the competition a record 11 times - lost 1-0 to the Potters in the fourth round back in January in a shock result.It was a scrappy contest with Josh Bickerton scoring the decisive goal through his deflected free kick. However, there were controversial scenes following the game with the FA claiming in a report that United failed to ensure their 'players conducted themselves in an orderly fashion and/or refrained from provocative behaviour'. The club admitted to the charge and were subsequently fined £7,500, according to The I.",
        "The Red Devils were unfortunate not to win the clash, as they came close on several occasions which included an effort cleared off the line.United staff members reportedly became unhappy with the officials towards the end of the match, before the unfortunate full time scenes.Following the game, the club's report on its official website focused on the game and failed to mention the 'provocative behaviour' that took place once the 90 minutes were up.Stoke went on to lose 4-1 to West Ham in the next round of the competition with the Hammers eventually winning the FA Youth Cup courtesy of a 5-1 win against Arsenal at the Emirates last month in the final.United's history in the competition meant this year's performance was a significant upset.",
        "They were the reigning champions having won the tournament last year, with now first team star Alejandro Garnacho - who recently signed a new long-term deal at the club - scoring seven times on their way to the triumph. "
    ]
}