{
    "articleURL": "/wires/aap/article-12040651/Australia-Council-arts-briefing-comes-APY-warning.html",
    "content": [
        "The Australia Council's director of first nations arts and culture has expressed concern for Aboriginal artists in light of allegations about the APY Art Centre.",
        "In April, The Australian newspaper alleged non-Indigenous arts workers at the APY (Anangu Pitjantjatjara Yankunytjatjara) Art Centre Collective in South Australia had painted parts of works by Aboriginal artists.The APY Art Centre Collective has strenuously denied allegations that any of their artists were compromised.In a briefing about the first nations pillar of the federal government's national cultural policy on Wednesday, executive director Franchesca Cubillo said questions of authenticity and self determination must be taken seriously and investigated.\"Any investigation in this matter should be independent and ensure that a safe space is created for others to bring forward and speak openly about their concerns,\" she said.As part of the national cultural policy, the Australia Council will be re-named Creative Australia from July 2023, with a first nations board to be appointed by July 2024.The board will develop plans for a first nations arts workforce and promote cultural protocols and cultural safety training.It will also invest in large-scale artworks and cultural projects, with candidates to be assessed by first nations leaders.The measures have been allocated $35.5 million in federal funding over four years and Cubillo said it was an amazing time.\"First Nations agency and self determination will be engaged at a very high level at Creative Australia,\" Cubillo said.",
        "\"We are very excited about this this wonderful investment and this wonderful approach.\"The Australia Council's current first nations strategy panel is made up of nine members, but it's not certain how big the new board might be.Consultation will start in July and run until October, with meetings in all states and territories linked to big events such as art fairs, and five online forums.Yet the talk of consultation must have sounded familiar to one participant, who asked if it was another process for a national indigenous arts and culture authority.The conversation around such an authority has been around for decades, Cubillo explained, but the Creative Australia process would be entirely separate.The new cultural policy comes with a slate of funding measures, including $11 million to establish an Indigenous languages policy partnership.The federal government's interim budget last October allocated $80 million to establish a national Aboriginal Art Gallery in Alice Springs and $50 million to Perth's Aboriginal Cultural Centre.New laws to protect traditional knowledge and cultural expression and stamp out fake art have also been promised."
    ]
}