{
    "articleURL": "/money/bills/article-12051723/What-inflation-rate-Work-price-rises-hit-you.html",
    "content": [
        "Families can pay inflation of up to 18 per cent, falling to 7 per cent for newlywedsThe difference shows how consumers bear the brunt of rising prices differentlyNow a new tool from the ONS lets you work out your own personal inflation level The cost of living crisis is hitting some households far harder than others - with families paying price hikes of up to double that of their neighbours.",
        "The UK is currently weathering a storm of rising prices, something which is officially measured by a single metric: inflation.Recorded by the Office for National Statistics, consumer prices index inflation is a staggering 10.1 per cent - five times higher than the Bank of England's 2 per cent official target. Food inflation is even higher at 19.1 per cent, but figures reveal some individual items are seeing prices rocket even more than that.And that means that inflation affects everyone differently, as consumers face varying price hikes depending on what they spend their money on. Someone buying olive oil today will spend 49 per cent more than they did in 2022, for example, whereas for potatoes the average cost is 27 per cent extra.The ONS has published an online tool that lets lets households work out their personal inflation figure for a basket of 450 goods and services.",
        "To show how inflation hits consumers differently we have crunched the numbers for weekly spending habits for four different sorts of households - a single person renting and on the breadline, newly-weds with a newborn, a nuclear family of two adults, two children and a dog, and an elderly couple.Our example single person spent £110.22 in the week (up 16 per cent in a year), while our nuclear family spent £319.94 (up 7 per cent), our newlyweds £172.25 (up 18 per cent) and our elderly couple £516.56 (up 11 per cent).",
        "But bear in mind that in real life they will spend more, that's because the ONS tool takes average prices for items, and only for things such as food, clothing, professional services like cleaners, healthcare costs and furniture. It excludes some big payments such as energy bills, commuting costs, rent and mortgage repayments.You can work out your own personal inflation using the ONS tool here.One person on a budgetWeekly spend: £110.22 (up 16 per cent in a year)This person is perhaps in their twenties or early thirties, earning around £22,000 a year and is renting a flat. Like many people in this bracket they like to socialise, perhaps with an evening in the pub, but also have to watch the pennies closely.Their weekly expenses include a basket of 22 basic items such as sliced white bread, beef mince, jam, pasta and cheap vegetables and instant coffee - as well as a few household items such as soap and bin liners and a box of budget lager.That alone adds up to £59.04 - 18 per cent more than last year. The biggest price hike was for a block of cheddar cheese, which has risen by 42 per cent.But this person also saw steep price hikes for a can of baked beans (up 39 per cent to £1.05), iceberg lettuce (up 39 per cent to 77p), frozen chicken nuggets (up 35 per cent to £2.41) and a packet of plain biscuits (up 26 per cent to £1.24).",
        "They also treat themselves to an evening in the pub, buying three pints and maybe a packet of cigarettes.The night out costs £24.51 - £12.72 for three pints of lager (up 7 per cent in a year) and another £11.79 for 20 cigarettes (a rise of 6 per cent).However, there is a small bit off good inflation news. They had an unexpected saving when buying a pair of canvas trainers, as these cost the same as last year - £27.27.",
        "Two adults, two children and a dog Weekly spend: £319.94 (up 7 per cent in a year)This example family are two parents in their forties, with two children in their early teens - as well as a dog.They are comfortably well off, with a household income of around £90,000, and so do not need to scrimp and save - but don't want to overspend either.Their weekly food shop of 41 items comes to £147.45, a rise of 18 per cent, or £20.66.This includes luxury items such as parmesan cheese, fresh salmon and nice cereal, plus staples such as milk, plenty of vegetables, and some soft drinks, booze, a few treats, such as crisps and snacks, plus everything for a Sunday roast - with all the trimmings.The biggest food price increase was for a bottle of olive oil, which cost them £5.78, or 49 per cent more than the same period of last year.",
        "But other major price hikes include semi-skimmed milk, costing £1.33 - up 39 per cent in a year, as well as two heads of broccoli, setting them back £2.27, or a rise of 34 per cent.Their weekly spend also includes new trousers and jackets for both children, coming to £64.65 - up 12.5 per cent on what it would have cost a year ago. (Obviously, this wouldn't be an every week spend).Their dog gets seven cans of dog food, costing £5.05, and a booster injection - another £53.22. Altogether, man's best friend added £58.27 to their weekly bills, 26 per cent more than last year.They also spend £16.69 on getting the windows cleaned, which cost them 4 per cent more than in 2022, as well as £20.92 on a family trip to a leisure centre (up 5 per cent) and £17.01 on a haircut for the father - costing 7 per cent extra.",
        "Newlyweds with a baby Weekly spend: £172.25 (up 18 per cent in a year)We have also taken the example of two newlyweds in their thirties, with a newborn baby.Their weekly food shopping basket of 27 items costs them £91.43, an increase of 19 per cent - the biggest increase of any household on our list.They bore the brunt of major food price hikes on items such as a bag of potatoes, up 27 per cent to 71p, a chicken costing £3.73 (up 22 per cent) and a tub of yoghurt (up 28 per cent to 82p). A jar of mayonnaise cost them £1.96, or an increase of 32 per cent.",
        "They also decide to indulge the Millennial stereotype and buy an avocado, costing 96p - a rise of 9 per cent.To celebrate their newborn they invite a couple of friends over for a small party, where they spend £62.72 on two bottles of champagne (up 5 per cent) and £4.98 on two sponge cakes (an increase of 25 per cent).One evening the sleep-deprived parents get an Indian takeaway rather than cooking, which sets them back £18.10, a rise of 10 per cent.Elderly coupleWeekly spend: £516.56 (up 11 per cent in a year)This couple are a man and a woman in their seventies, with a good pension income and traditional tastes.Their weekly shopping basket of 28 items includes salt-of-the-earth foodstuffs such as a bag of baking potatoes, a gammon joint, a meat pie, eggs, cheese, jam and apples.In total their food and drink cost them £123.94, or an increase of 17 per cent on 2022. Notable increases are on cheddar cheese (up 42 per cent), milk (up 39 per cent) and crumpets (up 27 per cent).The man also opts for a bottle of whisky as a treat, while his wife picks a bottle of sherry.He ends up footing a far larger booze bill, as his whisky costs £15.88 (up 7 per cent), while her sherry is £9.79 - a rise of 3 per cent.",
        "The man, a keen gardener, also heads to the garden centre for some compost, plant seeds and plant food, costing him £13.67 in total, up 18 per cent on last year.But the plant seeds cost him 3 per cent less than last year - the only item on our list than fell in price over the year.They make two new wills, costing them £550.48 in total, or an increase of 10 per cent. (Again, not an every week spend.)Then to take their minds off things, they head out to a local pub for lunch, costing them £28.80 for two mains and £12.92 for two desserts - rises of 12 and 10 per cent, respectively.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}