{
    "articleURL": "/tvshowbiz/article-12044187/Taylor-Swift-met-Matty-Healys-mum-Star-posed-Denise-Welch-1975-concert.html",
    "content": [
        "Taylor Swift posed for a photo with Matty Healy's mother Denise Welch months before she reportedly began dating him.",
        "The singer, 33, is 'madly in love' with The 1975 frontman Matty and the two are ready to go public with their romance at her concert in Nashville, Tennessee this Friday, according to The Sun. Taylor has already crossed paths with Matty's mother as the pair met in January while backstage at a 1975 concert at The O2 in London.The Bad Blood hitmaker appeared on stage with the band as a special guest and then posed for a snap with Denise backstage, which the Loose Women star shared to her Instagram.Denise was inundated with comments on the post, including from Hollyoaks star Nadine Mulkerrin who said: 'You're such a legend hanging out with Taylor'. ",
        "Former X Factor presenter Kate Thornton added: 'Please tell me you and Taylor are now friends? X'.The news of Taylor's new romance comes soon after she split from her longtime boyfriend Joe Alwyn.A source told the publication: 'She and Matty are madly in love.'It's super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn’t work out.'As news of Taylor and Joe's split hit last month, the source wanted to make clear that there was no crossover for the A-lister between the two British hunks.The insider said: 'Taylor and Joe actually split up back in February, so there was absolutely no crossover.'",
        "Taylor is currently in the middle of the US leg of her The Eras Tour while The 1975 are on their At Their Very Best concert tour so they have both been busy but are doing all they can to stay in constant communication.The source said: 'Both Matty and Taylor have been touring over the past few weeks, so it’s been a lot of Face-Timing and texting but she cannot wait to see him again.",
        "'But as two international megastars, they understand the pressures of one another’s jobs better than anyone, and are incredibly supportive of their respective careers.'As Taylor was notoriously private regarding her longtime relationship with Joe - other than many of her songs - the insider claims that Taylor is aiming to be more transparent about her lovelife with Matty.The source explained: 'They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to ‘own’ this romance, and not hide it away.'Taylor just wants to live her life, and be happy. She’s told pals Matty is flying to Nashville over the weekend to support her on the next leg of her tour.'Taylor certainly seems to have a thing for British men as along with Joe and being linked to Matty, her famous exes include Harry Styles, Calvin Harris, and Tom Hiddleston. "
    ]
}