{
    "articleURL": "/wires/ap/article-12047667/Shipping-company-pay-2-25M-environmental-infractions.html",
    "content": [
        "PROVIDENCE, R.I. (AP) - A Greek shipping company has pleaded guilty and agreed to pay $2.25 million for violations of environmental laws that were carried out by the captain and chief engineer of one of its oil tankers, federal prosecutors said.",
        "The Galissas, owned by Zeus Lines Management S.A., discharged nearly 10,000 gallons (about 37,000 liters) of oily bilge water directly into the ocean and failed to report a hazardous condition in the vessel´s cargo tanks to the U.S. Coast Guard last year, according to the U.S. Attorney's Office in Providence announced Wednesday.The violations took place when the tanker was transporting a cargo of diesel from Rotterdam, the Netherlands, to Rhode Island, prosecutors said.The vessel´s captain pleaded guilty to failing to report a hazardous condition in the vessel´s cargo tanks to the Coast Guard prior to the tanker entering the port of Newport, Rhode Island.The vessel´s chief engineer pleaded guilty to knowingly discharging untreated oily bilge water directly from the tanker into the sea during the voyage.Under the terms of the plea agreement, Zeus' $2.25 million penalty includes a fine of $1,687,500 and $562,500 for the National Fish and Wildlife Foundation to fund projects that benefit marine and coastal natural resources in Rhode Island.Zeus will also be required to implement a robust environmental compliance plan when any of its vessels enter a U.S. port.\"This prosecution demonstrates our commitment to ensuring the health and safety of the marine environment,\" Assistant Attorney General Todd Kim of the Justice Department´s Environment and Natural Resources Division said in a statement. \"The reckless actions of these defendants not only threatened the marine environment, but also the safety of this coastal community.\"",
        "Sentencing is scheduled for Aug. 8."
    ]
}