{
    "articleURL": "/tvshowbiz/article-12039835/Countdown-host-Colin-Murray-reveals-atmosphere-changed-Anne-Robinsons-exit.html",
    "content": [
        "Countdown host Colin Murray has shared his thoughts on Anne Robinson's alleged feud with Rachel Riley.",
        "The Northern Irish presenter, 46, officially took over hosting duties from the former Weakest Link star, 78, earlier this year after she quit after just a year amid tensions with her co-stars. And briefly addressing the much-published feud, Colin hinted that there were some tensions but they've now disappeared following Anne's departure.He diplomatically said to The Mirror: 'The atmosphere has changed and that’s huge.'Colin's fair response may be due to the fact that he's not actually met Anne in person.",
        "Elsewhere, Colin opened up about his joy at landing his dream job, admitting he initially turned down the role as he didn't want to be a stop-gap again.The radio star's hopes were initially dashed after Anne was given the top job following Nick Hewer's departure as host. So when Anne quit and Channel 4 producers came knocking, Colin revealed that he'd issued an ultimatum to ensure his longevity on the show.He said: 'I said, no. I couldn’t bear the thought of just being a one-night stand again. It would have been professionally heartbreaking. I think my words were, \"You’ve got to give me a run of three months\".'Colin added that he'd previously felt 'down' while filling in on the show following Anne's exit, ahead of him bagging the permanent position this year.",
        "He said: 'I was so down when we recorded the first episodes of series 87. “I thought, if they haven’t given it to me now, they’re not going to.\"It comes after Colin reportedly split from his wife of over ten years Carly Paradis.The host is said to have parted ways with his composer wife after struggling to juggle their busy work schedules. ",
        "He stepped in for former presenter Anne Robinson last year, while Carly has worked on the music for popular shows such as Line Of Duty.According to The Sun, sources shared that the pair split last year, shortly after Colin took on hosting duties on Countdown. Also hosting a BBC Radio 5 Live show, sources claimed that the duo were 'pushed apart' by work commitments.'Colin and Carly have been open with their friends and family about their break-up and are trying to move on as best they can,' alleged the source.While the host appeared to confirm that he was living alone during a chat with Radio Times magazine, as they asked who controlled the television remote in his house, and he replied: 'It’s just me, so me. I’m master of my domain.' "
    ]
}