{
    "articleURL": "/femail/article-12047665/The-rise-mum-rage-Motherhood-furious.html",
    "content": [
        "Four mothers shared their stories with FEMAIL for Maternal Mental Health WeekREAD MORE:  UK's most premature twins are going from 'strength to strength' Most new parents expect not to get much sleep in the early days or weeks of giving birth. ",
        "Wellwishers often jokingly scrawl ‘no sleep until the baby turns 18!’ in congratulatory cards.  But when ‘less sleep’ turns into ‘no sleep’, it’s no laughing matter; the effects can be devastating. Sleep deprivation can lead to impaired memory, concentration and decision making abilities and has also been linked to postnatal depression and postpartum psychosis. And there’s another side to sleep deprivation that remains largely taboo – maternal rage.As part of this week’s Maternal Mental Health Awareness Week (1-7 May), four brave women share their stories with FEMAIL - including one mother who broke her hand in a fit of fury.",
        "I had to go to marriage counselling and anger management because I was only getting three hours of sleep a night Nicole Ratcliffe, 41, from Manchester is mother to two daughters Sofia, seven and Alyssia, three and is a baby and child sleep specialist.She attended marriage guidance and an anger management course after becoming enraged that her seven-year-old would not sleep. After experiencing severe sleep deprivation, Nicole set up a sleep consultancy business helping other families transition from pregnancy to parenthood.She says: 'I had a traumatic birth with Sofia, who was born via emergency c-section. I couldn’t establish breastfeeding, I was in terrible pain and Sofia had an infection – we were on the back foot from the beginning.‘Sofia cried a lot at night time and was a terrible sleeper from the off. I had thought newborns slept all the time, but Sofia didn’t. I was only getting about three broken hours a night.",
        "‘Lack of sleep caused my physical and mental health to take a dive. I was falling asleep on the motorway driving. My husband and I had to go to marriage guidance counselling because we were so lost and frustrated with each other.’‘When Sofia was eight-months-old, I hired a sleep nanny and things dramatically improved. I was astonished by the change and when Sofia was 18 months old, I took a loan out, studied sleep training and set up my own sleep consultancy business Baby2Sleep.co.uk.",
        "‘Then Sofia’s sleep became problematic again and I began to experience mum rage.‘I was teaching other people how to get their children to sleep- yet my own child didn't sleep.‘I was so angry at myself and at her. I was shouting, going crazy and so frustrated. Rage would bubble up inside me and I’d explode. I felt like I was failing. Why couldn’t I be the mum I had envisaged? I ended up going to anger management classes to learn how to control my anger.‘Anger and sleep deprivation is a taboo subject but it shouldn’t be – this needs to be normalised. There are lots of angry and desperate mums out there and we need to be talking about this. 'PND and postpartum psychosis have both been linked to sleep deprivation and I don’t believe sleep deprivation is covered enough in antenatal classes.",
        "‘Vital support is missing. I want to fill this gap. After Covid hit, and my second daughter Alyssia was six days old, I set up a Facebook group, which now has 6,000 members, to offer support to parents when there was none and I run a YouTube channel offering free advice.’I broke my hand hitting a wall in a sleep-deprived rage ",
        "Jane Scott, 41, a sports development professional from Stirling, Scotland is mum to Megan, five and Luka, 19 months and is having counselling for her sleep-deprivation rage.She says: ‘Megan needed resuscitation at birth and went to ICU. She was two days old when a neonatal nurse first remarked that she was hard to get to sleep and things never improved.‘I spent hours in a darkened room, going for 5km walks and 50 minute car drives in the middle of the night.‘When Luka was born he slept a lot and I thought things would be different. But at four months old he stopped sleeping and I experienced sleep deprivation for the second time, averaging four hours sleep a night.‘It’s soul destroying. The rage erupts out of nowhere. I can hit things, throw things, head butt doors because I can’t control the anger. 'The rage builds up and I lose it. I can feel the heat rise but don’t realise how bad it is till it happens. I’ve broken my hand hitting a wall. I keep thinking something is wrong with me.",
        "‘I’ve experienced mum-shaming and judgement - tried to talk to friends but I ended up feeling even more isolated and alone. I discovered they were talking about me behind my back. I’ve now withdrawn from the group.‘I really do think we need to be talking about sleep deprivation and the rage that comes with it. Postnatal depression is now accepted and normalised but anger linked to sleep deprivation is taboo. This is so wrong.‘I am now getting counselling to help me cope with the anger I feel when Luka won’t sleep. 'I’ve also undertaken a course on matrescence (the transition to and through motherhood) which has helped me understand the mum rage better. 'I hope to set up my own business supporting mums through matrescence, helping them understand the changes that happen when you become a mum - when you are no longer who you used to be, but you are not yet sure who you are. 'The transition to motherhood is huge and I want to help others.’I flew into a rage at my partner over tea bags ",
        "- Around 1 in 5 women experience a perinatal mental health problem during pregnancy or within the early postnatal years- 70 per cent will hide or underplay their illness- Suicide is the leading cause of direct maternal death within a year of having a baby",
        "Melissa Woods, 33 from East Sussex is a teacher and writer. She is married to David and is mum to Clark, four-and-a half and Oliver, two. She experienced severe sleep deprivation just before Clark’s first birthday.She says: ‘Clark breastfed to sleep, wouldn’t take a dummy or a bottle and slept in our bed even though I never wanted to co-sleep. 'I spent a fortune on bassinets and side sleepers but nothing worked. I was only getting a couple of hours sleep at best.‘Sleep deprivation became this enormous issue. I’d feel so angry he wasn’t sleeping. I’d plead: \"just go to sleep!\" even though I knew he wasn’t doing it on purpose. 'If I was sitting on the sofa and Clark asked me to play with him, I’d burst into tears. I became this crazy person, I was angry all the time, I felt trapped and overwhelmed. I exploded if my partner left a teabag in the sink!‘I spent hours lying next to Clark, then when he was finally asleep I’d get up and he’d start crying. Waves of anger washed over me, a red mist descended and I was so cross I couldn’t think straight - I’d have to leave the room.‘My mental health spiralled and I felt mum guilt for being so angry. I hated myself. I kept thinking: \"What’s wrong with me?\"",
        "'I tried to reach out to other mums but I was the only one getting no sleep and I ended up feeling very alone. I had impostor syndrome, I thought: ‘Maybe I’m not meant to be a mum.’‘Every time I spoke about the sleep deprivation I always prefaced with: \"Obviously I love him very much\"…- but we shouldn’t have to justify being upset and being exhausted.‘Sleep deprivation is literally a form of torture and it’s very dangerous – because you are unable to function or care for your baby properly and it’s linked to post-natal depression and postpartum psychosis. 'If you are not getting any sleep you could end up hurting your baby either on purpose or accidentally. I’d be sitting in a chair with Clark lying in my arms and I’d start falling asleep – it really scared me.‘The stigma surrounding this needs to go away, midwives need to talk about sleep deprivation more. There is a big difference between not getting enough sleep with a newborn and being sleep deprived. 'When you picture yourself as a mum, you imagine gentle parenting, having loads of patience and motherhood being serene and lovely. 'But the lack of sleep showed me a more primal, animalistic side of myself which was scary because it was side to me I didn’t know I had.’I was a volcano and started hitting myself in the head as I struggled to cope with sleep deprivation ",
        "Mum of two Alexis Hallie-Reade, 38 from South Manchester is married to Tom and is mum to Orson, four and Ottilie, 1.Her dad Malcolm died suddenly from acute myeloid leukaemia six weeks before Orson’s birth, so Alexis was grieving for her father while transitioning to motherhood.She says: ‘I was heavily pregnant when my dad died – three and a half weeks after being told he wasn’t going to live. It was a huge shock but I wouldn’t allow myself to cry in case I stressed my baby.‘I tried to continue with the façade but everything started to build up. I hit breaking point when Orson was about four-and-a-half months. My partner Tom had gone to India with work and I was alone with a child that would not sleep.‘He’d wake up every 45 minutes and I turned into this crazy person, I was so angry with my baby thinking: \"Why are you awake again? I can’t do this…\"‘The rage would build inside me and I started hitting myself in the head in frustration. I was so exhausted I felt like I was going insane. I was like a volcano literally erupting with rage.’’",
        "‘I’d been through huge emotional trauma before the life changing event of becoming a mum and the sleep deprivation tipped me over the edge.‘I was putting so much pressure on myself and I felt like I was getting everything wrong. I literally fell apart at the seams.‘I felt so much guilt whenever I shouted and googled: ‘Have I ruined my child’s life?’ and ‘What is going to happen now I’ve shouted?’ Mum guilt is horrendous, we blame ourselves for not being perfect.‘More information about sleep deprivation needs to be available. Of course you know there is going to be a lack of sleep when you have a new baby but there is not enough information to show what is ‘normal’ – some babies sleep through the night from very early on, others like Orson, wake every half hour or so, but this isn’t really explained.‘There is a lot of information available about gentle parenting and how to raise a well-rounded human, but it adds pressure on parents. Shouting is frowned upon.‘I want mums to know there is hope – I started therapy and CBT to help me cope in intense moments of stress and I made contact with sleep-consultant Nicole. Within two weeks things improved.‘It was my birthday present to myself and at first I felt embarrassed about using a sleep consultant so it was a secret. Now I tell everyone I meet to go to a sleep consultant. I urge anyone experiencing this rage to get help.’Chartered psychologist Catherine Hallissey (catherinehallissey.com) says many mums are suffering in silence due to society’s rose-tinted view of motherhood.",
        "Journalling can be really useful. Write down what triggers you and how you feel - it could help you see why and then how you can minimise your rageTake some time out. Make time for you, without the children. This can be tricky, but even just a 30 minute walk alone after they have gone to bed can make all the differenceExercise - preferably without the kids in tow, but all exercise boosts mood &amp; can help you sleep betterSeek help. If your child isn't sleeping at night, seek help, there is no shame in asking. Same goes for if you are juggling too much. Who can help you? What can you do to make things easier - which balls can you drop?Eat right. Hard to do when you are knackered, but try and switch caffeine for decaf and keep sugar to a minimum.Talk to someone. If you don't want to chat with your doctor or a therapist, is there a friend you can lean on?",
        "‘Mum rage is one of the taboos of parenting with the result that many mothers suffer in silence due to fear of judgment which greatly increases the isolation and loneliness,’ says Catherine.‘While sleep deprivation is seen as part and parcel of new motherhood, there is little said about how it can impact a mother’s ability to regulate her emotions, leading to irritability and frustration, increasing the likelihood of experiencing mum rage.‘Not getting enough sleep is linked with impaired cognitive abilities, negatively impacting memory, concentration and decision making abilities.‘When a mother’s sleep is constantly disrupted, night after night, it’s much more difficult to cope with the demands of parenting, which, in turn, increases feelings of stress and overwhelm, increasing the risk of maternal rage.‘The interruptions to sleep increase cortisol levels which make it harder to regulate emotions and increase the likelihood of anger and rage. While sleep deprivation is widely accepted, the resulting mum rage tends to be hidden as it does not tally with the rose tinted view of motherhood that abounds in popular culture.‘The common advice to “enjoy every minute” can compound the guilt and shame felt by mothers who are struggling to regulate the intense feelings of anger, which make it harder to reach out for support.’Kirsty Ketley - @kirstykparentingspecialist on Instagram - is a qualified early years and parenting consultant.She says: ‘Sleep deprivation affects how we think, it causes brain fog, making it harder for us to make decisions and concentrate and it can affect our mood. This makes for unhappy relationships with our partners - we've all played the 'who is more tired' game with our partners at some part, and also with our children.‘Because of the rise in using the gentle parenting method, I think mums feel embarrassed to admit that they snap at their kids and do shout. Scrolling on social media makes many feeling like they are failing and while it is ok to let everyone know how hard you find parenting, it is becoming less acceptable to admit that you have shouted at your kids.‘Nobody wants to be the shouty mum, but I think it is naive to think that you will never shout or lose patience with your children. With mum rage, that turns up a notch or two and it is very real affecting many, so why not talk about it?‘"
    ]
}