{
    "articleURL": "/sciencetech/article-12050463/How-improve-MEMORY-weirdest-scientifically-proven-methods.html",
    "content": [
        "Academics are looking for 'super memorisers' - those with exceptional memoriesStudies have shown there are things you can do to help you remember moreThese include walking backwards, regular sex and listening to MozartAcademics from the University of Cambridge have revealed that they are on the hunt for 'super memorisers'.",
        "These are people with exceptional memories, and are wanted to take part in a study which could uncover why some are much better at remembering than others.But it may not just be down to natural born ability, as there are some things you can do that have been scientifically proven to help improve your memory.As well as doing brain teasers, there are some less conventional ways, including eating chocolate, walking backwards and spending time in the sunshine. MailOnline takes a look at the strangest techniques scientists have discovered that could turn you into a super memoriser.",
        "Dark chocolate ",
        "Simply put, memory is the mental activity of recalling information that you have learned or experienced. A memory is stored as a result of complex electrical signals which cause a change in the physical structure of the brain. Whether a memory is stored as a short or longterm one depends on exactly how the event is received by the brain.",
        "Good news, chocolate lovers, it turns out that a compound in cocoa can help boost your memory.A 2021 study found that flavanols - plant chemicals that are abundant in cocoa beans - improved performance in a list-learning task for people aged between 50 and 75.They belong to a group of compounds called polyphenols, which are also abundant in red wine, tea, olive oil, onions, leeks, broccoli and blueberries. ",
        "Flavanols are 'bioactive food constituents' that protect against cognitive ageing, enhance cognitive performance and boost blood flow to the brain, studies suggest. The researchers recruited people aged between 50 and 75, who were given supplement containing different levels of cocoa flavanols to take every day for 12 weeks.At the start and end of the study, participants undertook a series of cognitive tests to assess their thinking and memory, and a subset of the participants were given a magnetic resonance imaging (MRI) scan to measure blood flow in the brain. The diet supplemented with cocoa flavanols seemed to improve performance only on a memory task specific to learning a list, the team found. There was no effect on blood flow to the dentate gyrus - a region of the hippocampus thought to play a major role in episodic memory formation.The findings suggest cocoa helps older people to recall information in their short-term memory, but less so for quickly identifying visual similarities between objects and patterns.",
        "Certain areas of the brain are especially important in the formation and retention of memory: The hippocampus (so- called because it's shape resembles a seahorse) is a structure in the brain that has the main role in processing information as long-term memory. The amygdala, an area near the hippocampus, processes emotion and helps to imprint emotive memories in the brain. The cerebral cortex, the outer layer of the brain, stores most longterm memory in different zones, depending on what kind of processing the information involves: speech, sensory input, problem-solving, etc. Memory also involves communication among the brain's network of neurons, which are millions of cells activated by brain chemicals called neurotransmitters.",
        "But popular commercially-available chocolate brands like Mars bars are 'not a reliable source' of flavanols, according to one expert, although flavanols do tend to be abundant in dark chocolate. Other research has also linked higher dietary intakes of the compounds with reduced risk of developing dementia – the ongoing decline of brain functioning. ",
        "A 2012 study found that when dark chocolate was given to the pond snail, the flavonoid actually improved the length and strength of their memories. SunshineSpending more time in the sunshine can help boost your short term memory, research has shown.In 2021, experts at the University of Bradford looked at how rats performed in memory tests when exposed to long and short 'photoperiods', or periods of exposure to light.They found a 'significant' link between poor memory and short day length, akin to what humans experience during the winter season. It's possible that the results could be applicable to humans, the team say, suggesting we're more prone to forgetfulness during long winters.In mammals, there's a natural explanation for the loss of short-term memory during short daylight periods, according to the experts. 'In summer, seasonal animals tend to put on more weight, which aids with things like reproduction and preparing for winter,' said study author Dr Gisela Helfer.'But during winter, when there are fewer resources around like food and also less light, the body shuts down all sorts of functions.' For example, cognitive processes – in particular learning and memory – can be quite energy-intensive. ",
        "SexSet aside your sudoku books and brain training apps, as research has shown that having sex can boost your long-term memory.",
        "A 2014 study from the University of Maryland found that middle-aged rats made more new brain cells, or neurons, after mating.These neurons were located in the hippocampus, where long-term memories are made.This stimulation of adult neurogenesis - or the development of neurons - is thought to restore cognitive function.However the scientists found that after sexual activity was stopped, the improvements in brain power were lost.",
        "These results were backed up by a separate study from McGill University in Montreal, Canada in 2016.Researchers recruited 78 young women aged 18 to 29, quizzed them on their sex lives and asked them to perform a series of memory tests.The results revealed that those who enjoyed the most frequent sex registered the highest scores, so had the best memories.But the effect was much more noticeable when it came to remembering words rather than faces, the researchers said.This was probably because word recall is largely handled by the hippocampus, while other brain regions control facial memory.It's not just young women who benefit from the post-coital brainpower boost.In 2016, experts at Coventry University found men and women in their fifties, sixties and seventies who had an active love life had a lower risk of dementia.The study of nearly 7,000 older people showed women who had regular sex scored up to 14 per cent higher marks in word challenges, while the most sexually-active men scored 23 per cent more than their rivals.",
        "There are three stages the brain goes through to make memories: 1. Acquiring new memories All day long new information enters your brain along pathways between your neurons (nerve cells). But if you don't stop to concentrate, the data might as well go in one ear and out the other. If you focus intently, whatever you are trying to remember is encoded in the brain, the first step to memory-making. 2. Storing away the words, numbers and pictures If you've concentrated hard enough to encode something, your hippocampus sends a signal to store the information for the long-term. This is easier if it's related to something you already know, or provokes an emotional reaction from you.3. Retrieving the information Every time you need to recall a memory, your brain has toactivate the exact same pattern of nerve cells that it used to storeit. The more frequently you think about the information, the easier itis to retrieve.",
        "Walking backwardsA strange study from 2018 found that people who walk backwards perform better in a memory test than those who stand still or walk forward.Researchers from the University of Roehampton asked 114 volunteers to watch a video and then answer a questionnaire about what they could recall.After watching the video, participants were split into groups - one was told to walk forwards or backwards 30 feet (10m) while a control group stood in one place.",
        "It was found that the backward-walking group got two more questionnaire answers correct on average than the forward-walkers and the non-walkers.The team deemed this as an indication that a link between the concepts of 'time' and 'space' is essential to the way our minds form memories.'It's a partial vindication of this idea that time is really expressed via space,' says Dr Aksentijevic Aksentijevic, who led the study.It is still not clear why motion, real or imagined, should improve our access to memories but Dr Aksentijevic hopes further research will shed light on as well as how to use it to our advantage.CeleryA taste for celery is one that many people never acquire, but eating it may be worthwhile as scientists have found it contains a memory-boosting compound.The team from the University of Illinois studied the effects of luteolin, which is also found in peppers, on the brains and behaviour of mice in 2010.They fed them a controlled diet or a luteolin-supplemented diet for four weeks, and then set them learning and memory tasks.It was found that the older mice on the luteolin-supplemented diet performed better than their peers.Normally older mice have higher levels of brain inflammation and fare less well in memory tests than younger adult mice.But after consuming the luteolin during the experiment, their levels of brain inflammation matched those of the younger adult mice.Professor Rodney Johnson, who led the research, said: ‘The data suggests that consuming a healthy diet has the potential to reduce age-associated inflammation in the brain, which can result in better cognitive health.’ ",
        "MozartClassical music has been found to have numerous health benefits, including lowering blood pressure and helping fight infections.But studies have shown that the works of Mozart specifically have a unique effect on the brain and memory. Researchers from the Sapienza University of Rome used EEG machines to record the electrical activity of participants' brains.Recordings were made before and after they listened to 'L'allegro con spirito' from the Sonata for Two Pianos in D Major K448 by Mozart, and before and after they listened to 'Fur Elise' by Beethoven.They found that, after listening to Mozart, the participants showed an increase in brain wave activity linked to memory, understanding and problem-solving.",
        "However, no such increases were found after the group listened to Beethoven, suggesting there is something specific about the effect of Mozart's music on our minds.The researchers suggested that the rational and highly organised arrangement of the sonata may 'echo the organisation of the cerebral cortex' (the part of the brain responsible for high-level mental functions). Another study, from Anglia Ruskin University, achieved a similar result after the participants listened to the composer.Researchers played three pieces of music to get volunteers in one of three moods - sad, happy or neutral.Mozart's 'Requiem' was played for sadness; the jaunty theme from 1980s TV show 'The A-Team' for happiness; and the theme from the 1990 film 'The Hunt For Red October' for a neutral mood.",
        "Depending on which group they were in, the volunteers were then asked to think of either the saddest or happiest moments in their lives, or their journey home if they were neutral.They then had to complete a memory test which involved picking out 32 faces they had previously been shown from a group of 64.The sad volunteers who listened to Mozart gave the most accurate response, while the happy students were the least accurate.However, the study paired their improved memory to the feeling of sadness rather than the composer himself, but the result was surprising.'I was surprised. Sad mood is usually associated with poorer performance in cognitive tasks,' Dr Peter Hills, an author of the study, told LiveScience.'It is possible that sad people may be more susceptible to social cues.'",
        "Lots of us are bad with remembering names, but can still pick out a past colleague or old flame when they pop up on social media.However, a new study from Harvard University has found that up to 5.42 per cent of people struggle with the opposite problem.'Prosopagnosia', or face blindness, is a disorder that makes you unable to recognise faces you've seen before, including those of friends and family.It can also result in you being unable to identify yourself in pictures or the mirror, or feeling like you know complete strangers.Diagnostic criteria for face blindness vary, but researchers from King's College London have created a questionnaire for people who suspect they have it.Take the quiz here"
    ]
}