{
    "articleURL": "/travel/article-12050501/The-home-office-wheels-rolls-forth-tracks-feeling-commute.html",
    "content": [
        "A control panel inside the office - from an old locomotive - controls its movementThe office resembles a traditional railway wagon called a caboose READ MORE: The amazing 'JetCar' that's a cross between a jet ski and a CorvetteMost workers commute to the office – but one worker in the U.S commutes in his office.",
        "These pictures show an incredible wheeled home studio mounted on 110ft- (33.5m) long railroad tracks that can be moved between the owner's house and a forest nearby – to give him the feeling of 'commuting'.The cartoonishly imaginative set-up in Washington State was created by Seattle-based Olson Kundig Architects, who in coming up with the design 'talked about the importance of leaving the main house and having a commute as part of the experience'.From there, they dreamt up the idea of deploying the homeowner 'out into the forest', wondering: 'How cool would it be to take his office and put it on tracks?'Inspiration for the wacky two-storey office also came from railroad track remnants found in the grounds of the house during excavation work, with the short section of extra-wide 15ft- (4.5m) gauge track that the studio sits on formed from repurposed Great Northern Railway track.",
        "The office was created for Lou Maxon, who runs his 'Maxon' branding agency from his home just outside the small city of Carnation.Lou can propel his studio backwards and forwards for his 'commute' using an adapted control panel inside it that was formerly installed in a locomotive made by late 20th-century railway firm Burlington Northern.And a stabilising bar on the track 'informed by Japanese high-speed railways… prevents the tower from tipping during an earthquake'.",
        "The office has been designed to resemble a traditional railway wagon with accommodation for the crew called a caboose, with further individual design elements also paying homage to the world of railways.The bright yellow studio door matches the original paint colour of the striping on Great Northern trains, while plywood was chosen as interior wall cladding due to its widespread use in railcars.",
        "The lower level serves as the main working space, with a built-in desk and shelves for storage and display.The upper level is accessible via a steel ladder, with a small dumbwaiter to transport heavy or bulky items.'Envisioned as a calmer zone for creative exploration and restoration, this level functions much like a cupola on a train's caboose, a high vantage point to look out across the landscape,' the designers say.",
        "Sharing his thoughts on the design, Lou says: 'I remember a teacher yelling at me in elementary school and saying, \"Get your head out of the clouds.\" In the studio, like a caboose, the downstairs is the working area, and the upstairs is sort of big picture, more in the clouds. 'Now every day when I'm there, I'm thinking, \"This is perfect.\" I'm literally living in the clouds.'Olson Kundig Architects' Tom Kundig weighs in: 'When we started designing a studio for Lou, we talked about the importance of leaving the main house and having a commute as part of the experience. ",
        "'I said, somewhat jokingly, \"Could we deploy Lou out into the forest? How cool would it be to take his office and put it on tracks?\" It started as an offhand comment, but we quickly realized we all wanted to figure out how to make it happen.'He continues: 'Seeing the studio for the first time after construction, I was blown away. It's a beautiful object, beautifully fabricated, but moving it along the track is another experience entirely.'Though this was a bespoke project for the client, Kundig says that he 'could envision creating something similar in the future, once it was responsive to a specific client need or desire'."
    ]
}