{
    "articleURL": "/sport/football/article-12052453/MATT-BARLOW-Frank-Lampard-no-regrets-Chelsea-return.html",
    "content": [
        "Frank Lampard's overseen six games so far following his return and lost them allChelsea are currently wedged in the mire following a disastrous campaignThe club legend said he did not have any regrets over returning to the club One month immersed in the chaos. Six straight defeats piled on top of four in a row at the fag end of his Everton reign. Luxury players everywhere, yet no one to score him a goal and no cohesion at the back to keep them out.",
        "Frank Lampard may be Chelsea royalty but this peculiar second coming has been neither happy nor glorious. And it could get worse.Defeat on Saturday at Bournemouth would deliver an unwanted accolade, an 11th successive defeat to equal the record for a Premier League manager in a single season, set by Daniel Farke at Norwich.Chris Sutton told Mail Sport after Tuesday’s defeat at Arsenal that he feared Lampard was incurring reputational damage by answering the call to help at Stamford Bridge.What at first glance looked to be a no-lose opportunity is turning out to be no-win in every sense. Still, no regrets. ",
        "‘If I went into jobs thinking about my reputational balance, the world is so connected now people will talk about you in every way, shape or form, no matter what so you can’t do that and try to jump into the future,’ said Lampard on Friday. ‘You have to take things on your gut instinct. My instinct was to come here and try to help not just a team but a club in a difficult moment, so you have to accept that might not be a very easy ride.’Premier League defeats at the hands of Arsenal, Brentford, Brighton and Wolves came with two in the Champions League against Real Madrid. ",
        "After Bournemouth come home games with Nottingham Forest and Newcastle either side of two away games inside five days against the two Manchester clubs.‘I was very aware of our run-in,’ said Lampard. ‘I’m aware of what our run-in is in the last three games of the season so, coming in here, did I expect us to fly up the league? No.‘Did I think I could hopefully make some change that might be lasting change? Yes. At the minute the results are not saying that. That’s fine, that’s football, you can’t control that, but I haven’t got regrets. I’m very happy to be here working and will work until the last point to do anything I can to help.’Instinct may not be serving Lampard well. His competitive courage and thirst for a challenge is unquestionable, though with the benefit of hindsight his job selection has a hint of hasty and emotional.After a promising debut season at Derby, losing against Aston Villa in the Championship playoff final, he could not resist Chelsea, even when more experienced managers were avoiding the job because the club were serving a transfer ban and about to sell their best player, Eden Hazard.‘I had confidence in myself,’ said Lampard. ‘And in the first year wehad a big success in terms of making the Champions League with a young team and having lost Eden.’",
        "Chelsea also made it to the FA Cup final in an unprecedented campaign interrupted by the Covid pandemic.‘I went to Derby with my first job and we had Financial Fair Play difficulties,’ said Lampard. ‘We had to lose Matej Vydra, the top scorer. We managed to have a positive season. ",
        "‘It was a great first year for me in terms of cutting my teeth and we nearly got where we wanted to be. I came out of it a much better coach. Then coming to Chelsea was a challenging moment but I knew it. Everton was challenging as well.’It is easy to forget he made such a positive start to his managerial career, especially that first year at Chelsea in difficult circumstances when he restored identity and bonds with fans lost during Maurizio Sarri’s tenure.Communication has always been and remains one of his strengths, and should count for something. He put his faith in young players and they responded  responded. Equally, things did sour in the second season.He lost the trust of key senior players and some critics thought he needed more in-game tactical acumen and managerial experience experience in his backroom staff, but he has been reluctant to appoint anyone from outside a tight circle of former colleagues, including Ashley Cole, Joe Edwards and Chris Jones.",
        "To make matters worse, Thomas Tuchel swept in to replace him and won the Champions League.‘I’ve probably taken on three jobs that have been big challenges and where I think I had success,’ said Lampard. ‘And two of those jobs I moved on from not of my own accord. That’s probably the life of a manager.‘When I came here, I took it on with a lot of heart and understanding it was short term but I don’t want to be an interim manager in my next job.‘I’d like to be able to work in something that feels like it has an opportunity to go the way I want it to go and I’m very aware of what that way is. It’s trying to find a project, a club aligned with where you want to take the team and style and the club.‘I’ve managed Chelsea twice, albeit as an interim now. Everton are a huge club, Derby are a huge club. I have no regrets on that side. But maybe I will think in a different way when I move on.’Lampard stresses he does not want to sound like he is being ‘picky’. ‘That would be a discredit to all the other managers working under big challenges,’ he said.",
        "To be clear, he ventured into this territory as part of an answer to a question about his next move, because it is difficult to envisage him being showered with offers from the Premier League after the season he has endured.Lampard, Steven Gerrard and Scott Parker, England internationals from a goldenn generation of footballing talent, all started this season in charge of top-flight clubs and the reputations of all three have been burned by the brutality of the occupation. Gerrard suffered because of a steep uptick at Villa under Unai Emery. Parker because Bournemouth escaped relegation without him and a move to Club Bruges in Belgium proved brief and unsuccessful. All three will be aware there are times in football when you simply must ride the storm and Lampard at least sounds adamant this will not be his last stand in management.",
        "‘These moments are there, we have them in all walks of life,’ he said, warming to the notion of adversity making you stronger.‘It’s a good time for the players to hear that. I’m 44 and some of them are 22, and they need to understand they have a lot ahead in their careers.‘That counts for being a manager as well. Every manager will have their version of the story, of great success and then moments where it didn’t go so well. It’s not possible to have a straight line that goes upwards in management.",
        "‘You have to have your own version of that. You have to be able to handle the pressure of that as well.’"
    ]
}