{
    "articleURL": "/tvshowbiz/article-12049219/Colin-Fassnidge-keeps-low-profile-hes-seen-time-Jock-Zonfrillos-death.html",
    "content": [
        "For confidential support call the Lifeline 24-hour crisis support on 13 11 14 Colin Fassnidge has been spotted for the first time since his good friend Jock Zonfrillo's shock death was announced earlier this week. ",
        "The celebrity chef and My Kitchen Rules star, 48, who admitted that he's struggling to come to terms with the news, was seen keeping a low profile as he made his way around Sydney Airport. Colin kept things casual in a white T-shirt and jeans, and covered up his face wearing a pair of sunglasses and a hat. The Irish-born chef had been friends with MasterChef star Zonfrillo for 20 years. He told Daily Mail Australia earlier this week that he and the 'entire community' are struggling to process the tragic news. Zonfrillo's heartbroken family announced his death in a statement on Monday. A Victoria Police spokesperson told Daily Mail Australia they found Zonfrillo's body at about 2am on Monday after they were called to a hotel on Lygon Street in Carlton for a welfare check.",
        "No cause of death has been disclosed, but police say his death is not being treated as suspicious.On Tuesday, during a break from filming the upcoming season of their show My Kitchen Rules this week, Colin and Manu Feildel enjoyed a shot of whiskey in honour of MasterChef judge Jock, who died at the age of 46. 'Late night filming having a whiskey for our late but forever friend. Love from our My Kitchen Rules team to our MasterChef team,' Colin captioned his Instagram post, alongside a heartbroken emoji. ",
        "Colin previously said about Jock's death: 'It's so shocking. I'm sitting on a rock right now trying to take it in, I don't know what to say. I'm floored.'He said there was no indication anything was wrong for Zonfrillo, and the news was a complete surprise.The pair would speak to each other regularly, but their last in-depth conversation was six months ago.",
        "'He was flying, he was doing a great job, he had a great show, he was on top of the world,' Colin explained.'Jock was normal, he was healthy and he was living a good life. I just feel so sorry for his other half.''With completely shattered hearts and without knowing how we can possibly move through life without him, we are devastated to share that Jock passed away yesterday,' his family said in a statement on Monday. ",
        "'So many words can describe him, so many stories can be told, but at this time we're too overwhelmed to put them into words.'For those who crossed his path, became his mate, or were lucky enough to be his family, keep this proud Scot in your hearts when you have your next whisky.'They continued: 'We implore you to please let us grieve privately as we find a way to navigate through this, and find space on the other side to celebrate our irreplaceable husband, father, brother, son and friend.'",
        "The Scottish-Australian chef and restaurateur became a host of the popular Channel 10 cooking show in 2019 alongside Andy Allen and Melissa Leong.Zonfrillo is survived by his third wife, Lauren Fried, and his four children: Ava and Sophia, from his first two marriages, and Alfie and Isla, with Fried. "
    ]
}