{
    "articleURL": "/wires/reuters/article-12039321/US-STOCKS-Indexes-fall-1-regional-banks-tumble-investors-fret-Fed.html",
    "content": [
        "U.S. debt ceiling worries come to the fore",
        "Chegg slumps as ChatGPT drags on resultsIndexes: Dow down 1.1%, S&amp;amp;P 500 down 1.2%, Nasdaq down 1.1%(Updates close with volume, Starbucks down after the bell)By Caroline ValetkevitchNEW YORK, May 2 (Reuters) -Major U.S. stock indexes fell more than 1% each on Tuesday as regional bank shares tumbled on renewed fears over the financial system and as investors tried to gauge how much longer the Federal Reserve may need to hike interest rates.The Fed is expected to announce Wednesday it will raise rates 25 basis points, and investors are anxious for any signals from the central bank on whether it will be the last hike for now, or if further increases are possible if inflation remains high.The KBW regional banking index fell 5.5% in its biggest daily percentage drop since March 13. During the session, it hit the lowest level since November 2020.Energy shares dropped along with oil prices as investors worried about a potential U.S. debt default.Treasury Secretary Janet Yellen said the federal government could be unable by June 1 to meet all of its payment obligations without legislation to raise Washington's borrowing limit.The S&amp;amp;P 500 energy sector dropped 4.3%, the most of any major sector, followed by S&amp;amp;P financials, which fell 2.3%.",
        "U.S. regional banks extended losses from Monday after the seizure and auction of First Republic Bank. Most of its assets were bought by JPMorgan Chase &amp;amp; Co in a deal brokered by the Federal Deposit Insurance Corp.Two other U.S. regional banks collapsed in March.\"There are concerns that this is not over, and that rates are going to (continue to) go up, and it could be a catalyst for more problems,\" said Quincy Krosby, chief global strategist at LPL Financial in Charlotte, North Carolina.\"There's more and more talk about problems with commercial real estate,\" an area associated with regional banks, she added.Higher borrowing costs tend to hurt both consumers and businesses.The Dow Jones Industrial Average fell 367.17 points, or 1.08%, to 33,684.53; the S&amp;amp;P 500 lost 48.29 points, or 1.16%, at 4,119.58; and the Nasdaq Composite dropped 132.09 points, or 1.08%, to 12,080.51.The Cboe Volatility index closed at nearly a one-week high.Among bank stocks with the biggest declines, PacWest Bancorp tumbled 27.8%, while Western Alliance Bancorp fell 15.1% and Comerica Inc dropped 12.4%.Educational services company Chegg tanked 48.4% on a downbeat second-quarter revenue forecast as competition from ChatGPT grew.After the closing bell, shares of Starbucks fell 2% following the release of its quarterly results. The stock ended the regular session down 0.1%.",
        "While investors worry that the Fed's aggressive rate hikes will tip the U.S. economy into recession, discussions on recent quarterly conference calls may be hinting that corporations and analysts have become a bit less concerned.With first-quarter reports over halfway through, analysts see aggregate earnings for S&amp;amp;P 500 companies declining 1.4% year over year, according to IBES data from Refinitiv Tuesday. Before companies began to report at the start of April, Wall Street had been bracing for a 5.1% drop.Volume on U.S. exchanges was 12.33 billion shares, compared with the 10.44 billion average for the full session over the last 20 trading days.Declining issues outnumbered advancers on the NYSE by a 3.55-to-1 ratio; on Nasdaq, a 2.46-to-1 ratio favored decliners.The S&amp;amp;P 500 posted 17 new 52-week highs and 13 new lows; the Nasdaq Composite recorded 46 new highs and 407 new lows.(Additional reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Editing by Sriraj Kalluvila, Vinay Dwivedi, Anil D'Silva, Subhranshu Sahu and Richard Chang)"
    ]
}