{
    "articleURL": "/tvshowbiz/article-12051553/Ricki-Lee-Coulter-reveals-lavish-backstage-rider.html",
    "content": [
        "Pop star Ricki-Lee Coulter is back in the music game and she is reaping the benefits. ",
        "The Aussie chart-topper, 37, posted to Instagram on Friday to reveal what she demands backstage. Ricki-Lee posed with her head between two bottles of pricey Veuve Clicquot Champagne, valued at around $99 each. Proving she's just a down to earth girl at heart, the singer also had a very large tray of classic ham and cheese sandwiches on white bread. The former Australian Idol star wrote in her caption: 'When people ask what’s on my rider…' ",
        "Ricki-Lee released her latest single On My Own via streaming platforms last month.She posted the cover artwork on Instagram before the uplifting track rocketed up to number two on the Australian iTunes Singles Chart as of Saturday evening. Ricki-Lee told her fans the track had taken 'her whole life' to tell as she introduced them to the deeply personal song in a touching Instagram post. 'I have been trying to write this song for my whole life, it’s everything I’ve ever wanted to say in a song,' she said.",
        "'Everybody has been through hard times, but they make you so much stronger and that’s what this song is all about… celebrating making it through the things you thought might break you,' she added. Coulter joined her friends and Nova colleagues Tim Blackwell and Joel Creasey for a listening party on Friday. ",
        "The trio wrote on their joint Instagram account: 'We LOVE On My Own. Stream it now. Link in bio.' In a short clip shared to social media, the crew were huddled around a television while they listened to the new single with great excitement. They could all be seen cheering as the track began while Ricki-Lee squealed and screamed.",
        "The 37-year-old recently told The Daily Telegraph that she is 'very proud' of herself after almost 20 years in the music industry.'I am really proud that I have sustained a career for almost 20 years and had all of the crazy, wild amazing success that I've had, but I've worked my a** off for it,' she said.Speaking about her new single, she said: 'Whatever I have been through in my life, personal or in my career, the ups and downs, I know that I will always figure it out.''And when I say this song is about my life and that is what I mean.'Ricki-Lee rose to fame after she made it to the top 10 on Australian Idol back in 2004."
    ]
}