{
    "articleURL": "/news/article-12054043/Subway-chokehold-victim-Jordan-Neely-self-medicating-K2-death.html",
    "content": [
        "Jordan Neely, 30, was choked to death on a northbound F train on MondayHis uncle Christopher Neely, 44, revealed that he was using the synthetic drug K2 to treat his depression in the wake of his mother's murder Neely reportedly started acting erratically on the train before being restrained and choked to death by Daniel Penny, a marine who was on the trainJordan Neely was self-medicating with K2 to treat his depression in the wake of his mother's passing when he was choked to death on a New York City subway, his uncle claimed as he called on officials to make an arrest.",
        "Christopher Neely, 44, revealed his nephew's reliance on the synthetic weed known as Spice, as he slammed New York City law enforcement for releasing Daniel Penny. Penny, 24, is the US Marine veteran who was identified as the person who fatally choked Neely in the incident on Monday. He joined public officials and civil rights activists calling for the arrests of at least three people for what he called a 'gang killing' of his nephew, who he said would only get help when people called the police on him. Daniel Penny, 24, has not been charged with a crime in relation to Neely's death, but broke his silence Friday claiming he acted in self defense and that he 'never intended to harm' the former Michael Jackson impersonator.Multiple reports suggest that Manhattan DA Alvin Bragg may convene a grand jury and pursue criminal charges as early as next week. ",
        "The release of Penny has outraged many, including Neely's uncle who told The New York Post that the drugs were a way of dealing with his grief. 'When he lost his mother, my sister, it was heartbreaking for him,' he said 'He got into K2 and drugs, which was his way of healing himself.' Neely said he did not know if his nephew was on any other drugs besides K2. ",
        "'He was back and forth on the medication. Jordan was really out on the streets — he didn't want no help. The only time he'd get help is when people would call the police on him. The mental health system is horrible.'Witnesses said that around 2:30 p.m. on Monday, Neely, who relatives have said he was schizophrenic, was behaving erratically, throwing garbage and screaming that he wanted to 'die' or 'go to jail' because he was fed up about having no food. Video footage shows Penny with Neely in the chokehold. For two minutes and five seconds, Neely struggled on the floor, flailing his feet. He went limp after two minutes and six seconds.Police took Penny into custody. But he was later released and has not been charged.'Why would you release somebody who just choked someone to death?' he told The Post on Friday.'The Marine should never have been released at all,' he added. 'That was a stab in the face to all of Jordan's family and loved ones.'The good Samaritan laws shouldn't be a license to kill the homeless.'",
        "But Neely said Penny is not the only one who should be arrested. He also called for the arrests of the two other people see in the video footage.  ",
        "'Three men killed Jordan, not just the Marine. It was a gang killing — period,' Neely said, adding that his nephew 'got jumped by three hoodlums.''The Marine choked Jordan to death but the other two men held my nephew's hands while he was trying to break free from the chokehold,' he continued. 'They were all assailants in this murder and should all be charged.'In the statement, Penny's lawyers say that the Long Island-native 'could not have foreseen [Neely's] untimely death.' It also said that Penny was merely trying to restrain Neely, who was accused of being disruptive on board an F train, until the police arrived. Neely's attorneys also took aim at 'elected officials' calling on them to 'address the mental health crisis on our streets on subways.'   Penny's attorney is former Republican Manhattan District Attorney candidate Thomas Kenniff, who unsuccessfully ran against Bragg in 2021. Left wing Democratic Congresswoman Alexandria Ocasio-Cortez called Neely's death a 'murder' earlier this week.'Earlier this week Daniel Penny was involved in a tragic incident on the NYC Subway, which ended in the death of Jordan Neely. We would first like to express, on behalf of Daniel Penny, our condolences to those close to Mr. Neely,' the press release begins.'Mr Neely had a documented history of violent and erratic behavior, the apparent result of ongoing and untreated mental illness. When Mr Neely began aggressively threatening Daniel Penny and the other passengers, Daniel, with the help of others, acted to protect themselves, until help arrived. Daniel never intended to harm Mr Neely and could not have foreseen his untimely death.'",
        "'For too long, those suffering from mental illness have been treated with indifference. We hope that out of this awful tragedy will come a new commitment by our elected officials to address the mental health crisis on our streets and subways,' it concluded. The statement was issued through the law firm Raiser and Kenniff on Friday evening. Neely's death occurred on Monday. ",
        "It is not known when the grand jury would be convened nor what charges District Attorney Alvin Bragg is likely to pursue.According to a separate report from ABC New York, the case is likely to be heard as early as next week. The man who put Neely in the chokehold was earlier named as Penny, 24, of Long Island, New York. The ABC report notes that it is 'typical' for prosecutors to take their time in complex cases before impaneling the jury. Detectives in the case have spoken to around six witnesses who saw the disturbance and are seeking to talk with around four or five more. Penny has been questioned by police and released. According to reports, he said that he did not intend to kill Neely and had been trying to restrain him until the police arrived. "
    ]
}