{
    "articleURL": "/news/article-12057851/Why-shoppers-told-steal-Woolworths.html",
    "content": [
        "Comedian Fergus Neal urges Aussies to steal lettuceNeal said Woolworths using inflation as 'smoke screen'He claimed corporate profit is driving inflation  An Australian comedian is urging shoppers to do their national duty and steal from Woolworths in a bizarre response to soaring prices and inflation.",
        "Melbourne comedian Fergus Neal encouraged fellow Aussies to steal a 'god damn' head of lettuce from the supermarket giant as a means to combat the rising cost of living.Fergus, who is in his 20s, made the petition in a video shared to social media on Thursday and claimed inflation is being used as a 'smoke screen' by Woolworths as an excuse to drive up prices.'Next time you're at Woolworths, do your Australian duty and steal a god damn lettuce,' Fergus said.'Because Woolworths knows, like the European banks uncovered, that it's not wage increases driving inflation, it is the increases in corporate profit.'",
        "Fergus claims increased costs from supply chain issues and energy prices are being passed onto the consumer despite big corporations making record profits. 'Inflation is being used as a smoke screen so that Woolworths can add to their 2 billion a year profit margins instead of easily absorbing costs associated with supply chain issues and energy prices,' Fergus said.'The reserve bank knows that corporations are doing this and their solution is to curb your spending power by demanding wages fail to increase while interest rates do.'Your buying power is being affected so that the buying power of corporate CEOs is not.'Fergus' video received more than 37,000 views and more than 150 comments, with many Aussies sharing their disdain for big supermarket chains. ",
        "'I’ve completely stopped shopping at Woolworths (or any large corporations) they can f right off,' one person commented. 'And people try to say corporate greed isn’t real so many people literally defend the government and big corporations bending everyone over,' another person wrote. 'I'm seriously just so pissed off at all these companies who were crying about losing profits due to Covid but IN TURN MADE RECORD PROFITS,' a third chimed. 'If no staffed checkouts are open and I have to do the work myself I take something for the effort.' Daily Mail Australia has contacted Woolworths for comment. Daily Mail Australia does not condone Mr Neal's call for Australians to steal from Woolworths or any other supermarket chain. Theft is a criminal offence and can carry a penalty of up to five years imprisonment.Minor incidences of shoplifting (involving goods valued at less than $150) are dealt with by the police, with offenders issued an on-the-spot theft infringement notice. ",
        "Fergus' call comes after the Reserve Bank of Australia hiked interest rates for an 11th time in the past 12 months in an attempt to combat inflation. The Reserve Bank of Australia raised interest rates by 0.25 percentage points on May 2 taking the cash rate to an 11-year high of 3.85 per cent.",
        "The move flies in the face of the financial markets, which had almost unanimously predicted the RBA would leave rates on hold.The RBA has also left open the possibility of further rate increases, with Reserve Bank Governor Philip Lowe describing inflation as still too high at 7 per cent in March. Despite the rising interest rates and the surging cost of living, big supermarket stores have posted record profits.  In February, Woolworths posted a $907 million profit for the first half of the 2022 to 2023 financial year - a 14 per cent increase from the previous year. Woolworths CEO Brad Banducci said despite continued supply chain challenges most customer metrics improved during the first half of the financial year. 'Our first half result benefitted from a focus on improving our customer shopping experience, restoring our operating rhythm, the non-recurrence of material COVID costs in the prior year and strong seasonal trading,' Mr Banducci said. 'Cost-of-living pressures are being felt by our customers due to industry-wide inflation and helping all our customers get their Woolies worth remains our number one priority.' ",
        "Fellow grocery juggernaut Coles posted a half-yearly results revealed a $20.8 billion in total revenue and a profit of $616 million - up 17.1 per cent. The supermarket's total revenue was $12.4 million less than its competitor, with Woolworths reeling in $291 million more in profit. ",
        "Qantas also recorded a $1.4 billion profit, while the Commonwealth Bank of Australia reported a whopping $5.15 billion in profit – up by 9 per cent. Research conducted by the Australia Institute revealed excessive corporate profits – and not Australian wages – were behind the skyrocketing cost of living. The thinktank argued big business earnings account for 69 per cent of the inflation that is above the reserve bank's target range of two to three per cent.Australia Institute economist Dr Jim Stanford claimed without excessive corporate price rises and profits, the RBA's nine consecutive interest rate rises would have been unlikely.The Australian Council of Trade Unions Secretary Sally McManus said what was occurring was a 'greed-price spiral'. ",
        "'Inflation is being fed by these companies putting up prices far more than they need to,' Ms McManus said. 'Wage growth is clearly not contributing to inflation. Any wage rises in 2022 and early 2023 have been eaten up by price rises and interest rate rises. 'Supermarkets and big business are putting prices up more than they need to, and workers are feeling the pain.'Big companies know people have no choice other than to pay the prices they set for essentials such as groceries and energy, and business is making record profits and driving up inflation.'"
    ]
}