{
    "articleURL": "/sport/football/article-12051161/Sam-Allardyce-insists-absolutely-challenging-TREBLE-Man-City-boss.html",
    "content": [
        "The 68-year-old has just taken the helm at Leeds after Javi Gracia was sackedLeeds have a mountain to climb against ruthlessly in-form City on Saturday Pep Guardiola has hinted at squad rotation ahead of clash with Real MadridSam Allardyce has claimed that he would 'absolutely' be able to challenge for a historic treble with Manchester City if he was in charge at the Etihad. ",
        "This weekend the newly-appointed Leeds boss faces a City side in the midst of a formidable run that has seen them win their last 15 games. By contrast, Allardyce's appointment at Elland Road comes in the desperate hope that the relegation specialist – who has only been sent down once during his storied coaching career – will save the Yorkshire club from playing Championship football next season. Leeds' hierarchy sacked Javi Gracia on Monday with just four games to go until the end of the season. They are currently hovering above the relegation places by the virtue of a stronger goal difference than Nottingham Forest in 18th. ",
        "But whilst Allardyce's remark about taking over from Guardiola and pursuing the treble with City at first feels disarming, the former Bolton Wanderers manager admits it is largely down to the strength of City's squad. 'Absolutely,' Allardyce said when asked if he could fight on three fronts with the Manchester club. 'Because the players make you a really good manager and a good coach and your job is to be able to communicate with those players, of course.'We all have our own pressures but to deal with high quality players that they have is a dream come true for you as a coach.'Although the English coach has burnished a reputation for avoiding the drop with Bolton, Sunderland, Crystal Palace, and Blackburn, Allardyce has never won a major trophy during his 32-year managerial career. ",
        "By contrast, Guardiola is one of the most decorated managers to have set foot in the Premier League, with his return of 32 career trophies second only to Sir Alex Ferguson's eye-popping 48.Despite this, Allardyce sensationally claimed earlier this week that he is as good a manager as the Spaniard and other leading top-flight bosses.‘I might be 68 and look old but there's nobody ahead of me in football terms,' he said at his Leeds unveiling. 'Not Pep, not [Jurgen] Klopp, not [Mikel] Arteta. It's all there with me.'And Guardiola conceded after City's win over West Ham on Wednesday night: ‘He is right. Look at Neil Warnock at Huddersfield, these incredible managers. ",
        "'It looks like the young managers know the tactics and whatever, but they are really good. They help us be who we are. We created football? No. It was already created.’ At City, Guardiola undoubtedly has one of the most talented squads assembled in Premier League history. His target man, Erling Haaland, broke the Premier League record for most goals scored in a single season when City faced West Ham on Wednesday evening and his astonishing form has turbo-charged their title chase in recent months. Beyond the Norwegian behemoth, City have a staggering amount of both quality and depth in their squad, sharpening the threat that they might match the peerless achievement of crosstown rivals Manchester United's 1998-99 season. ",
        "Ahead of facing Allardyce's Leeds on Saturday, Guardiola said that all of his players were 'ready' thanks to the tireless work of his backroom staff, but hinted that he might rotate players due to tiredness amidst a cluttered fixture list. 'I saw the team was really tired after the demands against Fulham and West Ham were so big,' Guardiola said on Friday. 'It's a lot of games.'  "
    ]
}