{
    "articleURL": "/wires/ap/article-12049437/8-fatally-shot-Serbian-town-day-9-killed-school.html",
    "content": [
        "BELGRADE, Serbia (AP) - The first shooting left Serbia weeping. The second set off waves of soul-searching in a deeply divided nation, awash in weaponry, where war criminals are glorified and memories run deep of years of civil war.",
        "Two mass killings in two days. Seventeen people dead and 21 injured.\"We walked around like zombies for 24 hours, not believing what has happened and looking for reasons,\" President Aleksandar Vucic, a populist authoritarian who began his political career as a far-right Serbian nationalist during the Yugoslav civil wars, said Friday in a nationwide TV address.The back-to-back bloodshed sent shockwaves through a Balkan nation scarred by wars, but unused to mass murders. Though Serbia is full of weapons left over from the conflicts of the 1990s, the last mass shooting before this week was in 2013, when a war veteran killed 13 people in a central Serbian village.In Thursday's attack, a 20-year-old gunman apparently firing at random killed eight people and wounded 14 in two Serbian villages, authorities said, shaking a nation still grieving over another mass shooting one day earlier. Police arrested a suspect Friday after an all-night search.Vucic called the shootings an attack on the whole nation - and said that while the man arrested wore a T-shirt with a pro-Nazi slogan, the motive remained unclear.",
        "The slayings came a day after a 13-year-old boy used his father´s guns to kill eight fellow students and a guard at a school in Belgrade, the capital.Public figures, politicians and experts appeared successively on TV Friday, desperately trying to explain the tragedies.",
        "\"This is a moment when a nation decides whether it will go along a healing path,\" actor Srdjan Timarov said on N1 television. \"The only other way is to declare capitulation.\"As a nationwide period of mourning began, TV screens were filled with people wearing black and music was banned from the airwaves as well as in cafes and restaurants. People lined up in Belgrade to donate blood, responding to an appeal for supplies needed to treat the wounded.The assailant in Thursday's attack shot people in two villages near Mladenovac, a municipality located about 50 kilometers (30 miles) south of the capital, police said. Vucic said the gunman targeted people \"wherever they were.\"In the village of Dubona, blood stained a schoolyard where shots had been fired and also the ground near a bench where residents often sit to share a beer and chat.\"I heard some tak-tak-tak sounds,\" recalled Milan Prokic, a Dubona resident. Prokic said he first thought people were shooting to celebrate a birth, as is tradition in Serbia.\"But it wasn´t that. Shame, great shame,\" Prokic added.Police said the suspect, identified by the initials U.B., was arrested in Vinjiste, a village 150 kilometers (90 miles) south of Belgrade. Officers searching a relative's home found a large stash of illegal weapons and ammunition, state broadcaster RTS reported.",
        "Authorities released a photo showing a young man in a police car in a blue T-shirt with the slogan \"Generation 88\" on it. The double eights are often used as shorthand for \"Heil Hitler\" since H is the eighth letter of the alphabet.Vucic said the suspect repeated the word \"disparagement\" but it wasn't clear what he meant.The president vowed in an address to the nation that the suspect \"will never again see the light of the day.\" He also announced tougher gun-control measures, in addition to those proposed by the government a day earlier.He called for a moratorium on new gun licenses for the next two years, a review of all current licenses, longer prison sentences for those who break the rules and \"fierce\" punishment for anyone caught with illegal weapons. But first, police will offer an amnesty to encourage people to hand over illegal guns - an action that has had limited success in the past.\"We will disarm Serbia,\" Vucic promised, saying the government would outline the new rules later Friday.Health Minister Danica Grujicic said the wounded included a teenage girl who was hit in the head and another teen who had to have a kidney removed.\"We haven´t seen this since the 1990s (war era),\" the minister said.",
        "While the Serbian government sought to crack down on guns and police raced to investigate the fresh violence, the nation started to ask what social factors may have contributed to the mass shootings. Serbia has one of the highest number of firearms per capita in the world, and guns are frequently fired into the air to mark special occasions.Experts have repeatedly warned of the danger posed by those weapons coupled with decades of instability stemming from the conflicts of the 1990s, as well as ongoing economic hardship. Belgrade University psychology professor Dragan Popadic pointed to the violence coursing through society, including harassment of political opponents by ruling populists and aggressive sports hooligans.\"People suddenly have been shaken into reality and the ocean of violence that we live in, how it has grown over time and how much our society has been neglected for decades,\" Popadic said after the first shooting. \"It is as if flashlights have been lit over our lives and we can no longer just mind our own business.\"Opposition parties called for a march against violence on Monday, urged the government to control media content and demanded the resignations of three ministers.\"Serbia is not a powder keg. Serbia has exploded,\" said Marinika Tepic, the vice president of an opposition party.",
        "Serbia was already reeling after the first shooting. Students, many wearing black and carrying flowers, filled streets around the school in central Belgrade as they paid silent homage Thursday to slain peers. Serbian teachers´ unions announced protests and strikes to warn about a crisis in the school system and demand changes.The school attack also left seven people hospitalized, six children and a teacher. One girl who was shot in the head remains in life-threatening condition, and a boy is in serious condition with spinal injuries, Grujicic said Friday.Authorities have said the suspected shooter, Kosta Kecmanovic, is too young to be charged and tried. He has been placed in a mental hospital, and his father has been detained on suspicion of endangering public security.___This story was first published on May 5, 2023. It was updated on May 10, 2023, to correct the number of people killed in back-to-back shootings in Serbia. It was 17, not 19.___Associated Press journalist Sabina Niksic in Sarajevo, Bosnia-Herzegovina, contributed to this report."
    ]
}