{
    "articleURL": "/wires/ap/article-12042769/Apple-TV-s-Silo-look-future-life-underground.html",
    "content": [
        "NEW YORK (AP) - Dystopian storytelling goes underground this month with the arrival of Apple TV+'s \"Silo,\" a gripping, ambitious tale of Earth's last population living far below the surface.",
        "Something terrible has happened to make the environment toxic so 10,000 people are hiding out in a massive, mile-deep underground silo until it's safe to come out. They grow food, maintain a huge generator for power and recycle everything.But there's also a sense of dread down here, too, and secrets, mysteries and suspicious murders. What exactly happened to the Earth? What is this talk about a rebellion 140 years ago? Where are all the books? Can we trust what the government is saying?\"Life in the silo in many ways is pretty good. They´re part of this cause, which is basically just to stay alive until the day that it is safe to go outside. So they feel that they´ve got this common mission,\" says creator and showrunner Graham Yost.\"Bu you just get a sense that there´s been a slight eugenic program to try and breed out curiosity, independence, obstreperousness - all those nasty human things. And you also get the sense that that´s not going to succeed.\"One of those rebelling is the 10-part series' heroine, a woman named Juliette, an engineer with a tragic childhood who seeks answers about the silo. She's played by Rebecca Ferguson, who says she was drawn to the work by its complexity.",
        "\"If you and I right now have to be stuck in a silo and we have to evolve and survive, what would happen? It's sort of `Lord of the Flies´-meets-Greta Thunberg-meets-the people who question the status quo. It´ll be chaos,\" says the actor, know for \"Dune\" and the \"Mission: Impossible\" films.Based on Hugh Howey´s bestselling trilogy, \"Silo\" also stars Tim Robbins, Common, David Oyelowo, Rashida Jones and Will Patton. The first two episodes drop Friday.This is world-building that slowly reveals itself. There are familiar things - tattoo artists, cops complaining about paperwork and ice trays - but also some different notes. Coins are square, suicide is a crime, and no one knows what a Pez dispenser is - a so-called relic of the before times and so illegal to own.The series contains two opposite philosophic ideas - that mankind is good and it is society that makes it bad, and that men and women are born fundamentally bad and society tames them.The people inside the silo are told that outside has become a wasteland and so they´ve formed a system of government that can charitably called a soft dictatorship, like East Germany in the 1980s. Anyone questioning the system is expelled - sent out into what seems to be a wasteland where everyone inside watches them crumple and die within minutes. Or do they?",
        "\"While life in the silo isn´t terrible, it´s not great. There´s something wrong and that battle between the truth and order is something that will play out over the whole series,\" says Yost.There have been previous attempts to get Howey´s books onto the big screen, but Yost thinks a 10-hour TV series is the best, including echoing the book by having Juliette only show up in the last few minutes of the first episode and take over.\"It´s bold. It makes sense,\" says Ferguson. \"It's a story being built up around a world where you don´t have to automatically see it through the lens of the character who´s going to pull you through it. I love that in storytelling.\"The look of life in the silo is carefully made, with most items made of metal and plastic, since growing trees for wood underground is hard. There is a grit and dirt, dim lighting and a grand curling staircase that connects the 144 concrete levels, with farming in the middle and working-class laborers in the bottom.When audiences first meet Juliette, she is the chief engineer at the bottom keeping the generator running - \"She pretty much keeps everyone in the silo alive,\" an admirer says - and then events send her up to the top of the structure, where the bureaucrats and leaders are.",
        "\"We love the idea of the reluctant hero,\" says Yost . \"She didn´t set out to be a hero. It was thrust upon her begrudgingly. And that´s the kind of hero we like to write about.\"He hopes to be rewarded with a second, third and fourth season to flush out this underground world. He hopes fans will also turn to the books it is based on - with one request.\"As I told Hugh, I said, `I just want everyone who watches this show to read the books AFTER they finish watching the show.´\"___Mark Kennedy is at http://twitter.com/KennedyTwits"
    ]
}