{
    "articleURL": "/sport/football/article-12052975/THE-EURO-FILES-Barcelona-offer-Lionel-Messi-money.html",
    "content": [
        "The Argentine has been suspended by Paris Saint-Germain for Saudi Arabia tripLionel Messi will leave PSG this summer - though it is not clear where he will goSorry episode carries similarities to end of Cristiano Ronaldo's European careerLionel Messi's Paris sojourn was not meant to end like this — with 400 or so Paris Saint-Germain ultras turning up at the French club’s headquarters to sing abusive songs about him.",
        "It could have been worse — they then went to Neymar’s home to abuse him from the other side of his security fence.After PSG suspended Messi, docking his pay and banning him from the training ground for two weeks, it seemed unlikely he would play for them again. It remains to be seen if his video apology was heartfelt and will lead to a U-turn or if it is designed to make the club the bad guys.It may also have been a sign that Messi needs the Paris option as an alternative. If he leaves there are only two ways out: Barcelona, who can offer him everything except money, and Saudi Arabia who can offer him only money. It is a sad end to his club career and there are some parallels with Cristiano Ronaldo, whom he will join in Riyadh if he takes up Al-Hilal on their offer of an estimated £350million a season. ",
        "He has already taken the Saudi riyal, but it’s one thing to turn up for a photoshoot to promote tourism, it’s another to take his family there for 12 months.It was one of those photoshoots that got him in trouble this week. He had timed his latest trip to the kingdom to coincide with a day off at PSG. But then the French side lost at home to mid-table Lorient last weekend and coach Christophe Galtier called the players in as punishment.",
        "Suspending Messi for ‘not turning up to training’ was opportunistic from PSG. It made him the bad guy and took the heat off those who are proving again this season that buying the most famous players on the planet doesn’t win you the Champions League or even guarantee you the Ligue 1 title. They go to Troyes on Sunday with their advantage over Marseille back to five points with five games to go.Messi’s camp have since said he didn’t want to stay for another season anyway and had told the club as much a month ago. Paris certainly wasn’t his preference but could still be an acceptable backup if Barcelona fail to sign him. He wants to keep playing in Europe so he can play next year’s Copa America. Barca need to lose €250m (£218m) from their wage bill (or bring that in in new revenue) to register new players without LaLiga restrictions. If they can’t, and therefore remain outside their permitted squad spend, they are subject to the ‘40 per cent rule’ which means to spend £40m they must first recoup £100m.It is a financial puzzle that is no longer Mateu Alemany’s problem. The club’s director of football left for Aston Villa this week. The hugely respected 60-year-old is the architect of the squad that currently needs just two more points to win LaLiga. ",
        "His departure seems rooted in an exasperation at club president Joan Laporta listening more to agents Jorge Mendes and Pini Zahavi than to him, and to a sense that LaLiga are not about to loosen any of the straps on Barcelona’s financial straitjacket. Sources close to Messi have suggested he is prepared to play for a token salary just to be able to bring his family back to the place they call home. But LaLiga have told Barcelona that regardless of what they pay him, in all ‘40 per cent’ calculations they will still oblige the club to register his salary with them at the market rate of about €25m (£22m) a season. ",
        "Barcelona begin their pre-season tour of the US on July 19 and want the deal done by then for the obvious financial benefits. The club’s response to Alemany’s departure this week was to suggest he might finish his outstanding projects this summer despite the Villa move, or that Deco (agent to Raphinha) might take over from him. It was hard to say which idea sounded dafter.Messi is expected to spend at least some of the next two weeks in Barcelona — not quite parked outside the Camp Nou in the way that Peter Odemwingie parked outside Loftus Road in 2013 hoping his move from West Brom to QPR would go through, but with similar expectant optimism.",
        "Back in Paris, PSG should win Ligue 1 without him but the city won’t light up Naples-style with a joyous firework display to greet the title. A damp sparkler will be more apt. The end of Messi’s club career in European football is starting to have a similar feel."
    ]
}