{
    "articleURL": "/money/markets/article-12054079/Fears-finances-200-banks.html",
    "content": [
        "Surge in interest rates caught banks on hop and left many nursing huge lossesOfficials also concerned about speed of bank runs, fuelled by social media Three of the four biggest bank failures in US history occurred in last two monthsMore American banks were teetering on the brink of collapse this weekend as a leading US think-tank raised fears over the financial strength of almost 200 lenders.",
        "The Bank of England, meanwhile, is preparing to lift the cost of borrowing for the 12th time in a row as it tries to tame double-digit inflation. This follows further rate increases in the US and Europe.Experts at the Hoover Institution think-tank say the global surge in interest rates has caught banks on the hop and left many of them nursing huge losses on some of their investments.Officials are also concerned about the speed of recent bank runs, fuelled by social media. Three of the four biggest bank failures in US history have occurred in the last two months.First Republic was seized by officials last week and most of its business was sold to banking giant JP Morgan. Its collapse followed the sudden demise of tech lender Silicon Valley Bank and also Signature, a smaller bank.",
        "The future of three other regional banks – California-based PacWest, Arizona's Western Alliance and Memphis-based First Horizon – hang in the balance after their share prices tanked, dashing hopes that the crisis was over despite rallying on Friday.Savings are guaranteed up to £200,000 in the US – far higher than the UK's £85,000 limit.But uninsured American depositors worried that their money is not safe have been withdrawing their cash in droves as they seek higher returns elsewhere, causing bank runs.",
        "Hoover's analysis found that if half of uninsured savers withdrew their cash, then 186 US banks with total assets of £240billion would be at 'potential risk of impairment'. That means the banks in question would technically be in breach of regulators' rules on capital.If they became insolvent, the US government would have to guarantee savers' money – leaving taxpayers on the hook – or find buyers for failed banks, as has happened recently.'There are several potentially insolvent banks lurking in the system,' warned Amit Seru, finance professor at Stanford University and one of the Hoover report's authors.While most of the bank runs have been in the US, there are fears that panic could spread.SVB's UK arm collapsed after £3billion – 30 per cent of its deposit base – disappeared in a day before it was rescued by HSBC. That prompted Chancellor Jeremy Hunt to order an urgent review of protection rules.British households withdrew a record £4.8billion from banks and building societies in March following SVB's implosion.'The review suggests that UK regulators are somewhat worried that we have not fully escaped the risk of a crisis,' said Costas Milas, finance professor at Liverpool University.The Hoover report also estimates that US banks are sitting on losses of more than £1.6trillion after the value of their loan portfolios fell by an average of 10 per cent.",
        "These investments include supposedly-safe government bonds, whose value has plunged over the last year as interest rates soared.Losses on these bonds would be realised if banks had to sell them in a hurry to repay savers demanding their cash.Traders expect the Bank of England to sanction another quarter point hike on Thursday, bringing interest rates to 4.5 per cent – their highest level since the financial crisis 15 years ago.The move will heap more pain on around 1.4 million homeowners coming off of cheaper fixed-rate mortgages this year.It also means a typical borrower on a default standard variable rate will pay an extra £390 a year in interest on a £200,000 mortgage, according to financial experts Moneyfacts.Another rate hike will also pile more pressure on heavily-indebted firms and on households struggling to cope with soaring food and energy bills.The consumer price index stands at 10.1 per cent – way above the Bank's 2 per cent target. At least one more rate rise is on the cards this year, with a peak of 5 per cent possible, according to market forecasts.But further ructions in the banking sector could force the Bank to change tack.Milas added: 'If a considerable rise in financial stress occurs, interest rates could be cut before the end of the year.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}