{
    "articleURL": "/news/article-12058671/Meltdown-panic-grows-Putin-evacuates-towns-near-Ukrainian-nuclear-power-plant.html",
    "content": [
        "Russia has evacuated 1,680 citizens from the surrounding region ahead of Ukraine's much-anticipated counteroffensive to take back Russian-occupied UN watchdog has warned that clashes around the plant risk nuclear catastropheFears of a nuclear meltdown are growing in Ukraine as Vladimir Putin evacuates towns near Europe's largest nuclear power plant, amid warnings that his troops have placed explosives and artillery at the site.",
        "Moscow has evacuated 1,680 citizens, including 660 children, from areas around the Zaporizhzhia nuclear plant ahead of Kyiv's much-anticipated counteroffensive to drive the Russian president's troops back.More than a dozen towns and villages have been evacuated near the front line in southern Ukraine, including the town of Enerhodar, which is home to the plant's workers and their families. It was seized in the early days of Putin's invasion.Experts have warned that by placing weapons at the site, Russia is risking the plant being struck by Ukrainian artillery - and thus risking a nuclear meltdown.Rafael Grossi, director general of the UN's International Atomic Energy Agency, said: 'We must act now to prevent the threat of a severe nuclear accident and its associated consequences for the population and the environment.'This major nuclear facility must be protected,' he said.",
        "The warning from the UN came as Moscow launched a fresh wave of drone, missile and air strikes across Ukraine, hitting Kyiv and other key cities on Monday.",
        "Moscow appears to be stepping up attacks while preparing for its cherished Victory Day holiday celebrating the defeat of Nazi Germany in 1945.As many as 16 missile strikes had targeted the cities of Kharkiv, Kherson, Mykolaiv and Odesa regions, in addition to 61 airstrikes and 52 rocket salvos on Ukrainian positions and populated areas, the General Staff of Ukraine's armed forces said in its morning update on the fighting.",
        "Ukrainian air defences destroyed all 35 Iranian-made Shahed drones Russia had launched, the military said.Kyiv's mayor said at least five people were wounded in the capital amid damage to a fuel depot, cars, buildings and infrastructure.'Unfortunately, there are dead and wounded civilians, high-rise buildings, private homes and other civilian infrastructure were damaged,' the military said.A food warehouse was set ablaze in the Black Sea city of Odesa.As air-raid sirens sounded across the country on Monday, Dr Patricia Lewis – a nuclear physicist who leads the international security program at Chatham House - also issued a warning about the situation at the Zaporizhzhia power plant.She said that there are concerns that Russia could attack Ukrainian positions from around the plant, prompting Kyiv's forces to fire back.'The IAEA – the director general – reported just a few days ago that they've been seeing weapons and artillery and explosives being moved into the power plant,' she said, speaking to BBC Radio 4's Today Programme.'This is the real worry that we have - that they will fire from the power plant and then what will the Ukrainians do? Because they do not want to fire at the power plant.'The IAEA said earlier that such clashes around the plant threaten catastrophe.",
        "Dr Lewis explained that if power to the plant is cut for example if power line to the plant is struck by a shell, this risks a nuclear meltdown.The plant has back-up power sources, including diesel generators, which have kicked into gear on previous occasions when the site lost power.However, these can only last so long. In the event that they run out of fuel and the plant is left without any source of power, a disaster could occur.'There is a lot of equipment [the mitigate this risk of disaster]. Some of it can be done automatically but of course making decision in the heat of battle is the critical thing,' Dr Lewis said. 'You only have a limited supply of diesel. You'd have to make sure that you were able to bring in more diesel which you might not be able to,' she told the programme.'So the big worry then is that the power supply would fail. And according to [Petro Kotin] who is the head of the Ukrainian atomic energy establishment – he said it would take a few hours to a day for things to get really serious and possibly have some melting in the reactor. Before we have a Fukishima.''This is really irresponsible of Russia to do this,' she added.",
        "For months, both sides fought tirelessly around Europe's largest power station, which remained staffed by Ukrainian employees under Russian control until September.The plant at Zaporizhzhia is one of the ten biggest in the world and was responsible for nearly half the nuclear output of Ukraine's four reactors. Ukrainian forces had little luck trying to recover the plant after the initial invasion, with rockets from both sides coming dangerously close to hitting the station.Ukraine has warned since that damage to the structure risks a 'Chernobyl-style' catastrophe.In September, the IAEA were able to inspect the integrity of the plant. Both Russia and Ukraine accused each other of trying to sabotage the IAEA mission.Mr Grossi, who has continued to visit the site for Russian-organised inspections, has said the 'plant and physical integrity of the plant' had been 'violated several times'.In April, it was reported that dissenting plant workers - who refused to keep the plant active for Russian forces - had been the victims of torture during the occupation.Ukrainian President Zelensky last week called for Putin to be tried in the Hague for 'criminal acts'. The news comes as Ukraine gears up for a spring counter-offensive, breaking the winter deadlock with a push into occupied regions in the south and east. ",
        "Writing earlier this morning, Mr Fedorov said that 'Under the guise of a contrived 'evacuation', the occupiers are preparing real provocations. 'The humanitarian catastrophe caused by the sick fantasy of the Rashists ['Russian fascists'] is no less real.'",
        "He added later that 'the occupiers promise the residents of the front-line territories golden mountains - comfortable accommodation at the captured recreation centres of Kyrylivka and Berdyansk.'MailOnline was unable to verify the evacuation of Ukrainian refugees to the seaside beach-facing settlements - though eyewitnesses have echoed the reports.LB.ua reported Saturday that locals were hiding their children as Russian occupants tried to evacuate them, in some cases without their parents, to recreation centres in Kyrylivka and Berdyansk.The independent Ukrainian outlet said law enforcement agencies had confirmed the claims.Mr Fedorov added: 'In fact, only [some] of the evacuees are brought to the coast - they are settled among the collaborators and the military. Others are taken to continental Russia.'He said that Ukrainians evacuated from Kherson last year had found themselves later unable to return to Ukraine.Russian state media confirmed the evacuation of the 18 occupied regions on Friday.Ukraine is expected to launch a counteroffensive this spring to break to winter stalemate.In April, Pentagon leaks revealed American officials doubted the ability of Ukraine to wage an effective assault.",
        "But in recent days, Russian confidence has looked more exposed as Wagner Group threatened to withdraw from the contested city of Bakhmut in the east.Russia has said it is ready to replace Wagner Group forces with Akhmat special forces from Chechnya in recent days - though experts warn the effectiveness is likely overstated.",
        "The fresh attacks come as Moscow prepares for Tuesday's Victory Day parade, a key event for President Vladimir Putin who has evoked the spirit of the Soviet triumph over Nazi Germany, having accused Ukraine of being in the grip of a new kind of fascism.Ukraine and its allies say the accusation was a baseless pretext for Russia's unprovoked invasion in February, 2022, which resulted in the biggest conflict in Europe since World War Two, killing thousands and forcing millions to flee the country.'We must always be prepared for enemy treachery and defence,' Ukrainian deputy defence minister Hanna Malyar said in a post on the Telegram messaging app.Russia stepped up shelling of Bakhmut, hoping to take it by Tuesday, Ukraine's top general leading the besieged city's defence said, after Russia's Wagner mercenary group appeared to ditch plans to withdraw from it.Three people were injured in blasts in Kyiv's Solomyanskyi district and two when drone wreckage fell in the Sviatoshyn district, both west of the capital's centre, Mayor Vitali Klitschko said on Telegram.Kyiv's military administration said drone wreckage fell on a runway at Zhuliany airport, one of the capital's two passenger airports, drawing emergency services there, although there was no fire.Drone debris seemed to have hit a two-storey building in the central district of Shevchenkivskyi, causing damage, it added.Reuters witnesses said they heard numerous explosions in Kyiv, with local officials saying air defence systems were repelling the attacks.Flames had completely engulfed a large structure identified as a food warehouse in pictures posted on Telegram by Serhiy Bratchuk, spokesperson for the Odesa military administration, after what he said was a Russian attack.After air raid alerts blared for hours over roughly two-thirds of Ukraine, media said explosions sounded in the southern region of Kherson and southeastern Zaporizhzhia.",
        "Vladimir Rogov, a Russian-installed official in Zaporizhzhia, said Russian forces hit a warehouse and Ukrainian troops' position in the small city of Orikhiv. Reuters was unable to independently verify the report.Separately, Russian forces shelled eight spots in Sumy in northeastern Ukraine on Sunday, the regional military administration said in a Facebook post.Strikes have also intensified in the past two weeks on Russian-held targets, especially in Crimea.Ukraine has not confirmed any role in those attacks but it says destroying enemy infrastructure is preparation for its long-awaited ground assault."
    ]
}