{
    "articleURL": "/tvshowbiz/article-12041951/Kendall-Jenner-looks-chic-brown-leather-jacket-steps-boyfriend-Bad-Bunny-NYC.html",
    "content": [
        "Kendall Jenner was pictured out with her boyfriend Bad Bunny on Tuesday night, after enjoying a romantic dinner date in New York City.",
        "The supermodel, 27, looked chic in a brown leather jacket and a grey crop top, which she teamed up with cream trousers and leather shoes.She accessorised with a camouflage-print baseball cap and a cream handbag while entering a swanky hotel via the back door.Bad Bunny - real name Benito Ocasio - wrapped up in a black coat while keeping things casual in faded jeans.The rapper, 29, looked trendy in an orange hat as he hopped out of a luxury car and followed closely behind his new love interest. ",
        "Kendall and Bad Bunny were both seen arriving at the Mark Hotel in New York City on Monday ahead of their anticipated arrival at the Met Gala later in the evening.It was previously reported by some outlets that Anna Wintour was cracking down on the guest list at this year's Met Gala, following criticism of last year's event for featuring too many influencers and lower-tier celebrities.Initially though to be on the chopping block were the Kardashian–Jenner clan, though Page Six later reported that Kim Kardashian would be attending, and her sister Kendall and her boyfriend Bad Bunny are gearing up for appearances as well.The 2022 event marked the first time that Bad Bunny had attended the fundraising event.",
        "He stood out in a custom suit designed by Burberry’s Riccardo Tisci. 'I researched what was going on during the Gilded Age in my country, in Puerto Rico,' Bad Bunny told Vogue while describing his preparation. He also described how he and Tisci looked back at classic styles for men and women on the island, noting that men were often styled in tailored suits, while many women's outfits included puffy collars.'We mixed the men’s looks with women’s [for my look],' he said.",
        "The final tan suit featured voluminous, disjoined shoulder pads and a puffed up chest, along with a skirt that reached to the ground.He's likely to have something similar eye-catching when he hits the red carpet with Kendall.On Monday, a source told People that Bad Bunny and his new love had been 'getting more serious.''They are very cute together. Kendall is happy,' they said. 'He is a fun guy. Very much a gentleman and charming. She likes his vibe. He is very chill.'Although the two took their time with a 'slow start,' they now 'spend almost every day together.''He hangs out with her friends and she hangs out with his. It's more of a relationship now,' they continued. 'Kendall is not seeing anyone else. She really likes him.'",
        "The lovebirds were recently seen on a double date with Kendall's friend Hailey Bieber and her husband Justin."
    ]
}