{
    "articleURL": "/femail/article-12056989/Are-suffering-shame-flammation.html",
    "content": [
        "Hollywood health starlet Gwyneth Paltrow's guru shares his tips for your gut READ MORE: I am Gwyneth Paltrow's doctor. I have the antidote for bloating in womenGut feelings. Is there anything else more important than these guiding pings from our deepest intuition? 'Trust your gut' and 'gut instinct' are sentiments with ancient origins.",
        "If you have ever got that quick thrill of butterflies on a first date or felt the ache of your stomach dropping when you received bad news, you've already experienced the gut-feeling connection in real life.There's no way around it: the relationship between your gut and feelings is intimately at play every day of your life.I'm a functional medicine doctor and a bestselling author based in Pittsburgh, Pennsylvania, whose clients include many A-list actors and celebrities — among them Gwyneth Paltrow (below), the queen of wellness, who publicly credits the work we do together for changing her life and health.With all my patients, I talk a lot about how the gut is the centre of human health. It controls not just our digestion but also our immune system, metabolism and mood — and it does all this through your gut-feeling connection. The process is two-way: your gut can affect your mood, and your mood — especially stress, embarrassment, fear and shame — can cause gut inflammation, which sabotages your health.",
        "It can stop you losing weight, too. In my practice, I've seen patients try every diet that exists but continue to hold on to weight because their body is in a state of permanent 'fight or flight' from past trauma. I see the emotions affecting physical health so often, I gave the phenomenon its own name: Shameflammation.",
        "When working properly, inflammation is a lifesaving biological process designed to combat viruses or bacteria with inflammatory cells sent from your immune system. But chronic inflammation can also arise as a result of too much sugar in a diet, a sedentary lifestyle — and, yes, from difficult emotional experiences.Curing Shameflammation requires us to get our gut-feeling connection back in sync — by focusing not only on the foods that are kind to our gut but also on the practices that are friendly to our mind.In my new book, I've turned this unique twin-track approach into a Gut-Feeling Lifestyle Plan to help you achieve balanced eating and better mental health. Ideally, you would follow it for 21 days. Here's an exclusive seven-day taster . . .DAY 1 FIND YOUR FOUNDATIONGut: Identify One Food That Makes You Feel BadInstead of overhauling your entire lifestyle — which can make us feel discombobulated and even anxious — today take a few minutes to reflect and identify one food or food group that you already know doesn't mesh with your body but is still part of your regular routine.This could be wheat that leaves you tired and cranky, or caffeine, which you know sabotages your sleep, or beans that make you bloated. Then ask yourself: Why is it still part of your routine? Is there something you enjoy you could eat or drink instead? This isn't an order to eliminate the item entirely from your diet (although you can go ahead and do that if it feels right!). Instead, it's more of an awareness exercise to become more conscious of what makes you feel good and what doesn't.",
        "Feeling: Walk On The Bright SideThink about a lifestyle practice that makes you feel great — maybe it's ten minutes of writing in a journal or a quick walk without your phone — and do it! Afterwards, let the positive feeling sink in to help overcome the brain's negativity bias.",
        "DAY 2 TAKE A PAUSEGut: Give Your Gut A RestWe often turn to food, especially the sweet or salty kind, to distract us from how we're really feeling. So ask yourself if your snacking habits are serving you. I'm not asking you to eat less. If you're not eating enough at mealtimes to stay satiated for at least three to four hours, then your meals might not be big enough.Today, consider making your meals more filling and try to minimise snacking as much as possible.Feeling: Recognise Your RainbowWhen you slow down and start to live in the present moment, allowing your emotions to come to the surface, you might struggle to articulate what you are feeling. Emotions aren't as simple as 'happy', 'sad', 'excited' or 'angry.' We humans are complex beings. When you're 'sad', you might be feeling guilty, empty, ash-amed, victimised or powerless. When you're 'angry', you might be jealous, indignant, numb or resentful. Spend time reflecting on what it is that you're feeling. The vast array of emotions you feel every single day might surprise you.",
        "DAY 3 LET'S TALK ABOUT SUGARGut: Do A Sugar AuditIf one food contributes to Shameflammation more than any other, it's sugar. Too much can throw off the process for releasing cortisol, your stress hormone, meaning your body never gets a chance to calm down. Reflect on your sugar intake — and which sources bring you most joy.Maybe you love getting ice cream, which you should enjoy without regret. But could you replace that fizzy drink with sparkling water? See if there are opportunities to reduce how much sugar you consume every day without making you feel like you're missing out.Feeling: Fight Cravings With A Metaphysical MealSugar can temporarily calm our nerves, which means it can become a way of regulating our stress response. What is most helpful for sugar cravings is what I call a metaphysical meal, as another way of nourishing yourself. So, take 15 minutes to embrace:1. Stillness: For five minutes, take time to check in with your body and the thoughts or emotions you might be holding on to.2. Sweetening Judgment: For the next five minutes, feel compassion for yourself, your loved ones and the world; extend it to those you have found difficult to love or forgive and picture them as a child.",
        "3. Set an intention: This could be for the day, for your life, or for others. Perhaps: today I will do one healthy activity I love, or this week, I will phone my friend for a catch-up. Write it down to make it feel more concrete.4. Seal Your Meal: Finish with a moment of gratitude to the universe, a deity, the source of life, or your higher self — anything that makes you feel connected to something greater.DAY 4 FIND EXTRA NOURISHMENTGut: Lean On SoupsSoups are easy on your gut, and warm, comforting and nourishing. If you left this plan with no other tips, making soup and eating it for a meal a day would be a huge win. Aim for having one to three cups of soup or broth a day as your meal or with your meals.Feeling: Get CosyYou can also nourish yourself from the outside by optimising your environment. So, light a scented candle, enjoy the warmth of a hot drink or cuddle up under a soft blanket and read a book. In this way, the cosiness that brings a feeling of contentment or well-being can be used to calm the fight-or-flight system, helping to combat Shameflammation.DAY 5 NURTURE YOUR NERVOUS SYSTEM",
        "Gut: Find Your Favourite FatsSalmon, avocado, extra-virgin olive oil, grass-fed beef, eggs, walnuts and chia seeds all contain fatty acids, the building blocks of our nervous system and our cells.Think about the meals you can eat that incorporate one of these healthy fats. Making lasting lifestyle changes isn't about setting endless goals — it's about figuring out how you're going to get there.Feeling: Get ChillyWhile chronic psychological stress is hugely bad for our health, certain types of stress can help make our bodies more resilient.One great way is through cold exposure, which studies show may help reduce depression and anxiety by stimulating the vagus nerve — one of the main connectors of the brain and gut.Take a shower, turn the water to cold and let it run until you start to shiver. Try to stay under for at least 60 seconds and repeat the cycle a few times.DAY 6 TEND TO YOUR GUTGut: Feed Your Gut's GardenJust a few mouthfuls of sauerkraut, a bacteria-rich coconut yoghurt or the fermented drink kombucha can inoculate your gut with tasty bacteria. Today, give one a try, then eat some of it every day until you use it up. Also: look for a probiotic with at least 50 billion CFUs (colony-forming units).Feeling: Breathe Into Your BellyInhale deeply then hold your breath. Did your shoulders move up or your chest expand? If so, sit with your back straight and your shoulders relaxed. Now when you breathe in, send the air down to your belly and allow it to expand. Then pull your belly in toward your spine. That is how you are supposed to breathe. Repeat five times for a relaxed body and mind.DAY 7 DON'T FORGET YOUR H2OGut: Track Your Water IntakeWe hear all the time about drinking eight glasses of water a day and many of us think: what I'm doing is close to that . . . at least I think it is! But try to be a little more accurate than that.Keep a water journal for a few days to see if you're actually drinking as much as you think you are. Start your day with a big glass of water and add a squeeze of fresh lemon for an invigorating boost for your cells and senses.Feeling: Unwind In WaterPut away all technology, turn down the lights and create a bath-time ritual that is truly restorative.Go beyond just soap and water by adding Epsom salts, which are magnesium sulphate and provide many of the same benefits as magnesium, which is often referred to as the 'relaxation mineral' or 'nature's chill pill'.Adapted from Gut Feelings: Healing The Shame-Fuelled Relationship Between What You Eat And How You Feel by Dr Will Cole, published by Yellow Kite at £20. © Dr Will Cole 2023. To order a copy for £18 (offer valid until May 22, 2023; UK P&amp;P free on orders over £25), visit mailshop.co.uk/books or call 020 3176 2937.",
        "Chocolate pudding with coconut whipped cream",
        "Serves 62 x 15oz cans full-fat coconut milk4oz unsweetened dark chocolate, chopped¼ cup agavePinch of fine sea saltUnsweetened cocoa powder (optional)Pour one can of coconut milk into a saucepan and warm over medium heat (put the other can in the fridge). When the milk begins to steam, remove from heat and add the chopped chocolate, agave and salt. Let it stand for five minutes to melt the chocolate, then whisk until smooth and divide evenly among six ramekins or bowls. Cover and refrigerate until set, at least two hours. Before serving, scrape the solidified cream from the can of chilled coconut milk and beat on medium-high speed in a food processor until soft peaks form. Spoon a small amount on top of each pudding and sprinkle with cocoa powder, if desired.Filled dates",
        "Serves 48 whole almonds8 dried apricots, halved8 soft Medjool dates, pitted½ cup almond butter½ cup unsweetened desiccated coconutStuff an almond and dried apricot piece inside the cavity of each pitted date. Spread two teaspoons of the almond butter inside each date.Spinkle the coconut on a small plate. Roll the cut side of each date in the coconut to coat. These can be stored in an airtight container at room temperature for up to three days."
    ]
}