{
    "articleURL": "/sport/football/article-12046407/The-incredible-midfield-Real-Madrid-call-season-Jude-Bellingham-joins.html",
    "content": [
        "England star Jude Bellingham is closing on a sensational move to Real Madrid Real have fought off intense competition from Europe's top clubs for BellinghamIf he joins the Spanish giants, they will have several incredible midfield options For the third year in a row Real Madrid look to have done it again.",
        "In 2021 it was Eduardo Camavinga, in 2022 it was Aurelien Tchouameni and in 2023, it could well be Jude Bellingham.It seems as if Los Blancos have yet again fought off competition from Europe's top clubs to sign the most coveted young midfielder on the continent, putting the wheels in motion for another decade of dominance after winning the Champions League in five of the past nine seasons. Mail Sport reported on Wednesday how Real were closing in on a deal to sign Bellingham for £130m from Borussia Dortmund this summer. Bellingham has risen to the top of every elite club's shopping list for the summer following his outstanding performances both for Dortmund and then England at the World Cup. ",
        "Liverpool, long considered favourites for his signature, declared they were out of the race last month citing escalating costs of the proposed transfer with the Anfield club unwilling to spend so much of their budget on one player - allowing Madrid to swoop in.Madrid's hugely influential chief scout Juni Calafat, who is understood to have met Bellingham's father Mark at the Chelsea Harbour Hotel in London last month, wants the Englishman to lead the club into a new era and form a formidable midfield alongside Tchouameni and Camavinga that could see the club set for the next 10 years.",
        "Toni Kroos has also extended his contract for another year and coach Carlo Ancelotti wants Luka Modric to stay for 12 more months to aid the transition further.Their midfield stocks are already the envy of many clubs across the world, but just how good could it be looking for the Spanish giants next season if they were to complete a deal for the Englishman.When teams put a succession plan in place following an outstanding period in their history, there are several examples of things not going to plan.",
        "This has been evident with Liverpool this year, where their midfield is stuck between a group of extremely promising youngsters such as Harvey Elliott, Stefan Bajcetic and Curtis Jones who are not quite ready to fill the void of a declining Fabinho, Jordan Henderson and Thiago Alcantara. With nine Champions League titles between them over the past decade, it is perhaps surprising that the futures of Luka Modric and Toni Kroos weren't sorted earlier.The pair are etched into the history books at Real as two of the greatest midfielders in their history, and there is an increasing likelihood they will both be there next season.Kroos, 33, and Modric, 37, are the remaining parts of the iconic midfield at the club that also included Casemiro before he moved onto Manchester United last summer.",
        "Together, they have also helped to blood in younger stars over recent seasons and would likely do the same with Bellingham. At the other end of the age spectrum are Tchouameni, 23, Valverde, 24, and Camavinga, 20 - three of the best young midfielders in the world.They've already shown their talents at club level, but Tchouameni was also instrumental in France's run to the World Cup final in Qatar last year.",
        "He has failed to start any of their Champions League knockout games this season so far, but has been a regular presence in LaLiga - fulfilling Casemiro's former role as the deepest-lying midfielder.Camavinga has also enjoyed an impressive season, playing 51 times in all competitions, although he has made 14 of these appearances in an unfamiliar left back role.Nevertheless, the 20-year-old has impressed, often tucking into midfield and it will surely be just a matter of time until he moves more regularly to his favoured position.Elsewhere, Federico Valverde has shone in recent years and is enjoying a breakout season in front of goal this campaign, scoring 12 of his 18 career goals for the club.During big Champions League clashes last season, the Uruguayan was often pushed out to the right wing to provide increased solidity for Ancelotti's side with the Italian preferring a midfield trio of Modric, Kroos and Casemiro.",
        "He has again switched between the two positions this season and it is something Ancelotti may call upon again if Bellingham does arrive at the Bernabeu.Elsewhere, former Arsenal loanee Dani Ceballos is also an option, with the 26-year-old having resurrected his Real career this year.In total, he has made 40 appearances during the current campaign and the midfielder is reportedly in talks over extending his contract. ",
        "Laurie Cunningham (1979-84)Real signed the winger from West Bromwich for £950,000 and he did the league and cup double in his first season.Steve McManaman (1999-2003)Won two league titles and two Champions Leagues during four years in Madrid after signing from Liverpool.David Beckham (2003-07)Signed for £25m from Manchester United and won La Liga title in his final season with the club.Michael Owen (2004-05)Joined for £8m from Liverpool, but was often overlooked for Ronaldo and Raul and moved to Newcastle a year later.Jonathan Woodgate (2004-07)The £13m capture from Newcastle arrived injured, then scored an own goal and was sent off on his debut. Voted Madrid’s worst signing of the 21st century by fans.BIGGEST TRANSFER FEES PAID BY BRITISH CLUBS Enzo Fernandez £107m (Benfica to Chelsea)Jack Grealish £100m (Aston Villa to Man City)Romelu Lukaku £97.5m (Inter Milan to Chelsea)Paul Pogba £89m (Juventus to Man Utd)Mykhailo Mudryk £88.5m (Shakhtar Donetsk to Chelsea)",
        "Although the futures of Modric and Ceballos - who has even worked his way back into the Spain team - are uncertain, Bellingham's arrival would make it seven top class options if they were to stay.The Englishman has infamously gone by the No. 22 shirt in his career - reflective of his ability to play as a No. 4, No. 8 and No. 10 in a team - meaning he could fit into Los Blancos' starting XI in many different ways.If Modric extends his time at the club, Real would most likely line up with either him or Kross alongside Bellingham in midfield, and Tchouameni or Camavinga sitting slightly deeper.But they could also lay claim to having the most exciting midfield in the world if three of Bellingham, Valverde, Tchouameni and Camavinga played together.The former Birmingham youngster will turn 20 over the summer, but given the sensational start to his career, will likely have at least 10 years of dominance at the highest level to come.Whatever happens, Ancelotti, or whoever is in the Real hotseat, will have a mouth-watering set of international stars to pick from in midfield next year as the Spanish giants look to move into another era of dominance."
    ]
}