{
    "articleURL": "/wires/ap/article-12050959/Crunch-time-Madrid-Copa-final-City-game.html",
    "content": [
        "BARCELONA, Spain (AP) - It´s time for Real Madrid to switch into championship mode for the last part of an inconsistent season.",
        "Madrid will play Osasuna in the Copa del Rey final on Saturday following a stretch of poor showings in the Spanish league, where the title has long been out of reach.Carlo Ancelotti´s players have been playing far from their best with their focus clearly on the game in Seville against Osasuna - and on what´s to come just after.Three days later, Madrid will play the first leg of its highly anticipated Champions league semifinal rematch against Manchester City. The second leg in England will be on May 17.While Madrid´s top priority is to defend its continental title and lift a record-extending 15th European Cup, a victory over Osasuna would secure its first Spanish cup in nearly a decade and give it the chance for a pair of titles this campaign.\"Being honest, our season will be decided in the coming two weeks,\" Madrid defender Dani Carvajal said on Friday. \"The league has gotten away from us, and our first big test is tomorrow. It is a final against a difficult rival and we want to win the title. Once that is over, we will think about our next rival, but our focus is now on Osasuna.\"",
        "Madrid has produced convincing wins over Liverpool and Chelsea in the Champions League knockout rounds, but it has lost four of its last eight Spanish league games. Its 2-0 defeat at Real Sociedad this week let Atlético Madrid move ahead of its crosstown rival and into second place behind runaway leader Barcelona.",
        "Karim Benzema sat out the Sociedad game, while attack partner Vinícius Júnior was suspended for an accumulation of yellow cards. So both should be rested for the critical week ahead.Madrid is trying to win its first Copa since 2014, when Gareth Bale scored a late winner to beat Barcelona 2-1. It has won the cup 19 times, third most behind Barcelona (31) and Athletic Bilbao (23).But when it comes to pure motivation, Osasuna most likely has the advantage over its star-studded opponent.The modest club based in Pamplona has been waiting almost two decades for another shot at winning its first major trophy.This will be just the second Copa final in Osasuna´s history. It reached the 2005 final, only to lose to Real Betis 2-1 in extra time.\"Playing this game means everything for me,\" said Osasuna defender David García, who debuted for Spain in March at the age of 29. \"This is the most important game in my career of 20 years with this club. All my teammates have made a huge effort to get here. We fully believe that we can win it.\"Ancelotti should have all his first-choice players available after Luka Modric returned to practice recently after having injured his left thigh.The main question is whether Eduardo Camavinga could play at left back or in midfield instead of France teammate Aurélien Tchouaméni. The other choice for Ancelotti could be whether he starts Rodrygo or Federico Valverde up front.",
        "In his four seasons with Osasuna, coach Jagoba Arrasate has forged a team that few like to play against. Its up-tempo pace and bruising defending have led it past Betis, Sevilla and Athletic Bilbao to reach the final, while also keeping it in the top half of the league.Osasuna´s defense is anchored by García and fellow center back Aridane Hernández. Forwards Chimy Ávila and Abde Ezzalzouli are fast one-on-one threats on the break; Moi Gómez has emerged as one of the league´s top midfielders; and Sergio Herrera can have inspired nights in goal.In the league, Osasuna drew 1-1 at the Santiago Bernabeu in October and lost 2-0 at home to Madrid in February.The final will be played in La Cartuja Stadium in Seville, a municipal venue that has been used by Spain and hosted group games for the last European Championship.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sport"
    ]
}