{
    "articleURL": "/wires/ap/article-12055899/Bruins-late-goal-gives-Austin-2-2-draw-Portland.html",
    "content": [
        "PORTLAND, Ore. (AP) - Will Bruin scored in stoppage time to pull Austin into a 2-2 draw with the Portland Timbers on Saturday night.",
        "Jon Gallagher also scored for struggling Austin (2-4-4), which hasn´t won a game since March 11. The draw snapped a three-game Portland winning streak in the series.Claudio Bravo and Dario Zuparic scored for Portland (3-5-3).Zuparic scored his first goal of the season in the 33rd minute. His header off a long cross from Evander bounced into the goal, evading Austin goalkeeper Brad Stuver. Evander nearly scored himself in the final moments of the first half but his header was just wide.Gallagher, who leads Austin with four goals this season, scored in the 59th from the far post off a cross from Emiliano Rigoni. It was the team´s first goal at Providence Park since joining the league in 2021.Bravo's goal in the 71st was also his first of the season. Portland has scored 15 goals in 11 matches this season. Twelve different players have scored for the Timbers.Bruin, signed by Austin in February as a free agent, scored on a header some two minutes into stoppage time.\"Big positives on the night for us. Obviously disappointed only to get a tie, I think we deserved three points, we came from behind twice, which I think shows our group´s grit and resiliency,\" Austin coach Josh Wolff said.The Timbers were coming off a 2-1 win on the road against St. Louis City, but Argentine midfielder David Ayala tore an ACL during the match and will miss the rest of the season.",
        "Austin played to a 2-2 draw last week with San Jose. Rigoni and Sebastián Driussi scored to end a three-game scoreless streak.Driussi did not play against Portland. Wolff said he picked up a groin injury in training.\"We´ve been pragmatic in the way we have been playing but unfortunately today we allowed that moment to come in, and now it feels like a loss instead of something more, because of what we did and the way we finished,\" Timbers coach Giovanni Savarese said. \"So we have to continue to work.\"___AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}