{
    "articleURL": "/news/article-12043535/Nato-fears-Russia-laid-mines-critical-European-undersea-infrastructure-points.html",
    "content": [
        "NATO's intelligence chief warned Russia may seek to sabotage western nationsExplosions devastated the Nord Stream gas pipelines in September last yearIt comes as Russia today accused Ukraine of trying to assassinate Vladimir Putin Russia may have already mined Europe's critical underwater infrastructure, NATO representatives fear, as its intelligence chief warned on Wednesday Russia may sabotage them to punish Western nations for supporting Ukraine.",
        "The alliance is seeking to boost efforts to protect undersea pipes and cables following attacks on the Nord Stream pipeline in September last year, which saw three of the four main lines which transports gas from Russia to Germany damaged.Threats to undersea cables and pipelines have become a focus of public attention since the as-yet unexplained explosions crippled the Nord Stream pipelines in the Baltic Sea.The alliance is so concerned by the threat of energy disruption it set up the Critical Undersea Infrastructure Coordination Cell in February, which seeks to monitor Russian espionage under the command of Lieutenant General Hans-Werner Wiermann, a retired German military officer.The warning came as tensions rose further today after Russia accused Ukraine of a botched assassination attempt on Vladimir Putin - which Ukraine has strongly denied.",
        "Intelligence chief David Cattler said on Wednesday: 'There are heightened concerns that Russia may target undersea cables and other critical infrastructure in an effort to disrupt Western life, to gain leverage against those nations that are providing security to Ukraine.'The Russians are more active than we have seen them in years in this domain.' He added: 'Russia is actively mapping allied critical infrastructure both on land and on the seabed.'Mr Cattler said NATO vessels are patrolling more throughout the Atlantic than in recent years and have also stepped up activities in the North and Baltic seas.",
        "'Altogether, they carry an estimated 10 trillion US dollars worth of financial transactions every day, so these cables really are an economic linchpin.' He warned NATO's adversaries were realising the huge strategic advantage of being able to threaten the security of Western internet, energy and financial systems.It is understood authorities are now alerted by companies to suspicious activity such as the unauthorised presence of ships and 'tapping' registered by sensors. Asked if there were suspicions that Russia had already mined undersea infrastructure, a NATO official told The Times: 'Yes, I think [so]. I would use [the] word suspicions. Strong suspicions.'I don't think we have anything — maybe individual companies have their own very classified information. I think it's more we have a lot of suspicions... and we think there might be something there. But obviously actually sending someone down, something or someone down, is quite an expensive thing and we don't always do it.'Underwater pipes could be particularly threatened due to the economic and social impacts disruption to power supply may have, as well as the fact it is far more difficult to investigate any attack.Although there are signs pointing towards Russia as behind last year's attacks on the Nord Stream pipelines, no cause of the damage has been officially established.",
        "It was recently reported that a convoy of six Russian vessels was spotted near to the pipeline just days before the damage appeared. ",
        "It is thought hundreds of kilograms of explosives and equipment would have been required to pull off the scale of the damage seen last September, which occurred 80m below sea level.But it has now been claimed that a Swedish warship may have spotted the Russian convoy and tracked it in the days up to the attack.Several weeks later a Danish paper reported a Russian submarine rescue ship SS-750 was photographed in the Baltic Sea four days before the still-unexplained explosions.The SS-750 has its own mini-submarine, called the AS-26, which can reach depths of 262 feet (80 metres) and carry loads of up to 50kg. As concerns grow over the security of cables, Western countries are setting out to turn the North Sea into a green power engine, planning a spate of new wind parks that will be linked to the mainland by cables.Other undersea cables transport some 95 percent of internet traffic around the world at speeds of about 200 terabytes per second, with 200 of these 400 cables deemed critical, according to NATO.",
        "Possible future targets for Russia could include offshore wind farming and even Norway's Troll platform, which produces ten percent of all of Europe's gas.",
        "It's feared any interference with the platform could seriously damage European energy supply. However, NATO allies are closely monitoring Russian vessels equipped with sensors that can collect electronic or acoustic information from the seabed, and the spy ships can be identified by their antennae or unusual activity near critical areas.NATO significantly increased the number of ships patrolling the North and Baltic seas after the Nord Stream blasts, and established a Critical Undersea Infrastructure Protection Cell to improve cooperation with industry, capitals and experts.'The threat is real, and NATO is stepping up,' said German Lieutenant General Hans-Werner Wiermann who has been in charge of the new NATO cell since February.Asked what industry can do to make new wind parks more resilient to attacks, he suggested linking them to the mainland with several cables instead just one.The warning came as Russia claimed Ukraine had launched a botched assassination attempt of Putin in the early hours of Wednesday.Moscow claimed a pair of Ukrainian kamikaze drones exploded over Putin's Kremlin residence in the early hours. Russia said it had foiled the attempt and called it a 'planned terrorist act and an attempt to take the life of the President of the Russian Federation'. It has prompted demands from Russian lawmakers for the Kyiv government to be 'destroyed'.",
        "Ukraine quickly responded to the claim, the most dramatic Russia has levelled against Kyiv since invading its neighbour more than 14 months ago, saying it had 'nothing to do' with the alleged attack.Britain's response includes a P8 Poseidon maritime reconnaissance aircraft from RAF Lossiemouth, as well as a specialised undersea protection surface vessel, the Times reports. The new vessel, costing £65 million, is understood to be the first of two Royal Navy 'multi-role ocean surveillance ships'."
    ]
}