{
    "articleURL": "/wires/reuters/article-12045375/Despite-ailments-Braves-look-sweep-Marlins.html",
    "content": [
        "The Atlanta Braves have won seven of their past nine games and are going for a sweep of the host Miami Marlins on Thursday afternoon, but that doesn't mean they don't have reasons to worry.",
        "Right-handed starter Kyle Wright could not finish the third inning on Wednesday, leaving Atlanta's 14-6 win over Miami due to soreness in his throwing shoulder.\"I didn't feel good enough to keep going,\" said Wright. He is going to be placed on the injured list, manager Brian Snitker said after the game.Wright wanted to stay in the game, but he said he credits Braves pitching coach Rick Kranitz for \"protecting myself against myself.\"After leading the majors last year with a 21-5 record, Wright is obviously a key to Atlanta's rotation.But the same can be said about lefty Max Fried, who has not allowed a run in three straight starts -- totaling 16 2/3 innings.Fried was set to start on Thursday afternoon in the finale of the three-game series in Miami, but he was moved back one day as a precaution.In addition, Braves center fielder Michael Harris II left Wednesday's game after taking an awkward step while running to first base. The team said later Wednesday in a tweet that Harris \"was removed from tonight's game as a precaution after jamming his right knee.\"The Braves are expected to call up rookie Dylan Dodd (1-1, 7.71 ERA) to fill the void left by Fried on Thursday. Dodd, a left-hander, made his major league debut this season and has made two starts with the Braves.",
        "His most recent outing, April 9 against San Diego, was a rough one (seven runs on 10 hits over 4 1/3 innings). But the way the Braves are hitting the ball at the moment, Dodd may have plenty of margin for error.Braves right fielder Ronald Acuna Jr. hit .352 in March/April with a robust .986 OPS. He also led the majors in April with 13 steals.But it's not just Acuna. The Braves on Wednesday got 18 hits, including six homers.In fact, the only thing that slowed down the Braves on Wednesday was Marlins catcher Jacob Stallings, who pitched a scoreless ninth inning. Stallings ended the inning by striking out Acuna, who looked at an 85 mph fastball.\"It's tough to laugh when you're getting your butt kicked, but there are human moments,\" Marlins manager Skip Schumaker said.\"I never want to throw position players. But that was a cool moment (for Stallings). I'm sure he will keep that ball, have it autographed.\"Miami, which entered this series on a four-game win streak, is 1-5 against the Braves this season.The Marlins are hoping for a strong start on Thursday by lefty Jesus Luzardo (2-1, 3.48).Luzardo is 2-2 with a 4.26 ERA in four career starts against Atlanta.",
        "The Marlins are 5-1 when Luzardo starts this season, and he has three quality starts. He didn't get his third quality start last year until Aug. 7.Offensively, the Marlins have placed two starters on the injured list over the past two days -- outfielder Avisail Garcia (back) and Garrett Cooper (ear infection).They joined three other key Marlins on the injured list: starting pitchers Trevor Rogers and Johnny Cueto and shortstop Joey Wendle.With all of those injuries, there was an opportunity on Wednesday for Marlins rookie infielder Xavier Edwards, who responded with his first major league hit, a single.\"That never gets lost,\" Schumaker said. \"That hit is something he's probably been dreaming about since he was 5 years old. We could hear his family behind us, screaming.\"--Field Level Media"
    ]
}