{
    "articleURL": "/wires/afp/article-12054365/Aftershocks-shake-Japan-quake-kills-one-destroys-homes.html",
    "content": [
        "Aftershocks shook Japan a day after a powerful earthquake left at least one person dead, with officials assessing damage Saturday from the jolt that destroyed several buildings.",
        "The 6.5 magnitude quake hit the central Ishikawa region mid-afternoon on Friday at a depth of 12 kilometres (seven miles), according to the Japan Meteorological Agency.More than 50 aftershocks, some of them strong, had occurred by Saturday morning, the agency said, as it warned that heavy rain could trigger landslides in the area.At least 29 people had been injured, Japan's disaster management agency said.\"Our staff are out checking damage from the quake,\" an official from Suzu in Ishikawa prefecture, the hardest-hit city, told AFP.Two people trapped inside destroyed buildings were rescued, he said.An evacuation order was issued for 1,630 residents of Suzu, with about 250 taking shelter in evacuation centres, Jiji news agency reported late Saturday.More than 100 households were without running water as of Saturday afternoon, and roads were closed in many areas, the agency added.The city had provided temporary public supplies after running water had turned brown in parts of the region, officials said earlier.TV footage showed a grocery shop strewn with broken wine bottles and other products that had fallen from shelves.Some residents were seen clearing rubble in the rain after their wooden houses were partially destroyed.\"I asked a carpenter for a makeshift fix of the house, and the house is now covered with a blue tarp to protect it from rainwater,\" one man told public broadcaster NHK.",
        "Earthquakes are common in Japan, which sits on the Pacific \"Ring of Fire\", an arc of intense seismic activity that stretches through Southeast Asia and across the Pacific basin.The country has strict construction regulations intended to ensure buildings can withstand strong quakes and routinely holds emergency drills to prepare for a major jolt.A 6.9 magnitude quake struck a fishing village in the same region in 2007, injuring hundreds and damaging more than 200 buildings on the Noto peninsula -- a scenic area on the Sea of Japan coast.\"I express my heartfelt condolences to the person who died and offer my sympathies to those who were hit by the disaster,\" Prime Minister Fumio Kishida, who had returned from a tour to four African nations and Singapore, said Friday.\"The government will continue taking measures with a sense of urgency while closely communicating with (officials) at the scene,\" Kishida told reporters.Japan is haunted by the memory of a massive 9.0 magnitude undersea quake off its northeast in March 2011, which triggered a tsunami that left around 18,500 people dead or missing."
    ]
}