{
    "articleURL": "/wires/reuters/article-12052163/FACTBOX-What-changes-Britain-seen-King-Charles.html",
    "content": [
        "LONDON, May 5 (Reuters) - From a new face on the country's stamps and coins to a change of words for the national anthem, Britain has seen a number of alterations since the death of Queen Elizabeth in September and the accession of her son Charles to the throne. Ahead of his coronation on Saturday, here are some aspects of British daily life that are different since Charles became king:",
        "NATIONAL ANTHEMThe words of the British national anthem, which in its present form dates back to the 18th century, have changed from \"God Save the Queen\" to \"God Save the King\". The queen had been on the throne for 70 years, and almost eight months after her death, sports teams are getting used to the change.According to the royal family's website, the anthem came to prominence amid the patriotic fervour that followed the 1745 victory over Prince Charles Edward Stuart by King George II's army in Scotland, and was sung in London theatres.Since September, the first verse has been: \"God save our gracious King! Long live our noble King! God save the King! Send him victorious, Happy and glorious, Long to reign over us, God save the King.\"COINS AND STAMPSThe monarch's image is shown on British currency. Newly minted 50 pence coins featuring the portrait of King Charles III entered circulation in December, but his image won't appear on new bank notes until mid-2024, the Bank of England has said.Coins and banknotes featuring Queen Elizabeth are still in circulation and will be gradually replaced over time.Since the monarchy was restored in 1660 after the 10-year republic of Oliver Cromwell, it has become traditional for the monarch to face in the opposite direction to their predecessor.",
        "As Queen Elizabeth faced right, Charles is pictured facing left. Postage stamps are likewise being updated to feature the king's portrait, although those with the queen are still in use.In Australia, where the British monarch is also head of state, the country has decided not to have the image of King Charles on its new $5 note.ROYAL CYPHERThe Royal Cypher is the monogram used by the monarch. It appears on red mail pillar boxes, government buildings, state documents and police and military uniforms.Charles' cypher features his initial, title, Rex - Latin for King, and III, alongside a representation of the crown.In accordance with tradition, both the cypher and the royal coat of arms changed when he became king, but are appearing only gradually.Replacing cyphers is at the discretion of individual organisations, according to the royal family's website, and the military, for instance, will continue to wear uniforms with the late queen's cypher until stocks run out.Cyphers on pillar boxes will only appear on new boxes and so the queen's cypher will stay on thousands across the country, just as many remain from previous monarchs on those that were installed before her reign.Royal Mail said there were no CRIII pillar boxes installed yet and it was using up its supply of those marked EIIR first.",
        "LEGAL CHANGESSenior lawyers are now known as King's Counsel (KC) rather than Queen's Counsel (QC).(Reporting by Michael Holden and Sarah Young Editing by Frances Kerry)"
    ]
}