{
    "articleURL": "/wires/reuters/article-12041907/Sterling-gains-versus-dollar-ahead-Fed-rate-decision.html",
    "content": [
        "LONDON, May 3 (Reuters) - The pound gained versus the dollar and held steady against the euro on Wednesday ahead of an expected U.S. Federal Reserve rate hike later in the day and Thursday's European Central Bank meeting.",
        "The Bank of England's Monetary Policy Committee meets next week.The pound rose 0.37% to $1.2515, not far from last week's 10-month peak of $1.25835 as markets waited for the Fed to wrap up its latest policy meeting.The dollar traded lower against most major currencies as a combination of gloomy U.S. jobs data, a standoff in Washington over the debt ceiling and nervousness following banking collapses made investors jittery and supported market pricing that Wednesday's expected 25 basis point Fed rate hike will be the last in its current tightening cycle.Market pricing for the Bank of England in contrast indicates a rate hike next week and a reasonable chance of one more increase in June.\"Stronger data support the hiking cause,\" said Nomura in a note. The bank expects the BoE to hike rates by 25 bps in both May and June.\"Most notable releases include the upside surprise to March core inflation, a strong pick-up in underlying wage momentum, generally ongoing strength in labour market activity, a rise in consumer confidence, and a more resilient looking housing market.\"European Central Bank rate setters take centre stage on Thursday and money markets show a roughly 85% chance they will also raise rates by 25 bps, with a 15% chance of a 50 bp move, with more hikes in the months to come.",
        "The pound was a touch firmer against the euro with the single currency down 0.07% at 88.15 pence.The pound has performed particularly strongly against the Australian dollar and Japanese yen in recent weeks, though it dipped 0.37% against the Japanese currency on Wednesday to 169.7 yen, moving away from its seven-year top of 172.08 hit in the previous session.The pound firmed 0.33% against the Aussie dollar to A$1.8766, heading back towards Friday's one year high of A$1.9035.(Reporting by Alun John)"
    ]
}