{
    "articleURL": "/tvshowbiz/article-12039409/Im-Celeb-South-Africa-Campmates-set-torn-apart-theyre-forced-head-head.html",
    "content": [
        "The I'm A Celebrity South Africa camp is set to be 'torn apart' in Wednesday's show as the campmates are divided once again.",
        "In a teaser for the next episode of the ITV show, Ant and Dec tease that the celebrities will be split into two groups, as they share a glimpse of a terrifying new bushtucker trial.And it appears that things will get tense between the newly-formed rival camps as they're forced to go head-to-head, with Ant and Dec declaring: 'Let the battle commence!'A preview video showed the moment new campmates Joe Swash and Dean Gaffney - who earlier took part in a disgusting drinking trial - arrived into camp to greet their fellow celebrities.But the union was short-lived as it was then teased that the stars would be divided into separate groups.",
        "A text on screen read: 'a camp united', followed by 'then torn apart'.With the presenters then confirming: 'The camp is now set to be split into two groups. Let the battle commence.'The camp was previously split when Shaun Ryder, Andy Whyment and Phil Tufnell had to slum it in the Savannah Scrub home before finally being allowed back into main camp.It comes as Amir Khan became the third person to be evicted from the I'm A Celeb South Africa jungle on Tuesday following a secret ballot from his campmates.In Monday's episode, the campmates learned that, in a dramatic first for the series, they'd be choosing who was voted out of camp next.",
        "And it was the former boxer, 36, who ended up losing his place in the camp after getting the most votes from his campmates.",
        "Speaking to hosts Ant and Dec after he left the camp, Amir told how he was proud of himself after overcoming his fears, noting how he'd handled a snake in his last trial. He also gushed over his second stint on the ITV show, remarking that it was one of the 'best experiences I've ever had',  adding that it was 'even better than Australia'.Elsewhere, Carol Vorderman left viewers in hysterics as she claimed she has 'Britain's most buoyant bottom'. The former Countdown star, 62, was taking part in a terrifying underwater challenge 'Tanks of Torment' that saw her swim through sea creatures to gain stars and meals for the camp. ",
        "She was joined by Olympic athlete Fatima Whitbread, also 62, who showed off her almighty strength by using a lever to raise up trapdoors for Carol to swim through. Before starting the challenge, Carol confessed that an unusual problem could likely impair her in the task. She told a very amused Ant and Dec: 'The only problem I really have is, right, my bottom always floats to the top. 'It's the most buoyant thing in Britain!' I'm A Celebrity...South Africa continues tomorrow at 9pm on ITV1 and ITVX. "
    ]
}