{
    "articleURL": "/wires/reuters/article-12049771/Holiday-Inn-owner-IHGs-CEO-Barr-step-down.html",
    "content": [
        "Barr to be succeeded by Americas head Elie Maalouf",
        "Group Q1 RevPAR up 33% year on year; up 6.8% vs 2019Greater China RevPAR jumps 75% y-o-y after COVID curbs lifted(Adds details on CEO succession, shares in paragraphs 1 and 3, analyst in paragraph 5, CEO comments in paragraphs 13 and 15, graphic)By Eva Mathews and Radhika AnilkumarMay 5 (Reuters) - IHG Plc Chief Executive Keith Barr will step down next month after six years at the helm, the Holiday Inn-owner said on Friday, sending its shares down despite strong first-quarter results driven by a rebound in Chinese demand.The 52 year-old American plans to return to his family in the United States, IHG said, adding he would be succeeded by Americas head Elie Maalouf.IHG stock was down 2.8% to 5,364 pence at 0840 GMT.Barr ran the company's Chinese business for several years and became CEO in 2017 at a time when online rental companies such as Airbnb had started to capture market share.\"Keith had done a strong job invigorating the brand portfolio and improving the loyalty and digital offering,\" Bernstein analysts said.Shares in the Crowne Plaza-owner IHG have risen about 29% under Barr's leadership.Maalouf, 59, will take over a business returning towards pre-pandemic levels of growth, but with an uncertain economic outlook weighing on consumer-focused industries.",
        "Some relief was seen in early 2023, however, after China lifted its COVID curbs in December.IHG said first-quarter revenue per available room (RevPAR) - a key measure of the industry's top-line performance - jumped 33%, fuelled by a 75% increase in the Greater China region.U.S. peers Hilton and Marriott International Inc have also benefited from China's rebound and pent-up travel demand.Still, when compared to 2019, IHG's group RevPAR for the quarter rose 6.8%, while Chinese RevPAR was down 9%.Through the year, travel demand from small and medium businesses and during summer will drive growth, Barr said in an interview.Airlines across the world are also seeing strong ticket sales for summer travel, with consumers prioritising travel spend despite high inflation.On a slowdown in commercial real estate lending, Barr said IHG expected it would \"normalise over time.\"(Reporting by Radhika Anilkumar and Eva Mathews in Bengaluru; Editing by Conor Humphries and Mark Potter)"
    ]
}