{
    "articleURL": "/wires/reuters/article-12039947/Mexico-president-sees-14-bln-investment-Mexico-Pacific-pipeline-liquefaction-plant.html",
    "content": [
        "By Kylie Madry",
        "MEXICO CITY, May 2 (Reuters) - Mexico Pacific is set to build a natural gas pipeline and liquefaction plant in the northern state of Sonora for an investment of up to $14 billion, Mexican President Andres Manuel Lopez Obrador and his office said on Tuesday.Lopez Obrador first identified the company as Pacific Limited on Twitter, though his office later told Reuters the company's full name was Mexico Pacific Limited.A representative for the Houston, Texas-based company did not immediately respond to a request for comment.Mexican Foreign Minister Marcelo Ebrard had told journalists earlier in the day they had met with Mexico Pacific to discuss \"a considerable investment in liquefied natural gas.\"The company plans to ship \"out of the Pacific, because its main market is in Asia,\" Ebrard added.According to its website, Mexico Pacific is already constructing a 14.1 million tonnes per annum liquefied natural gas (LNG) export terminal in Puerto Libertad, Sonora.Lopez Obrador also said on Tuesday that \"cooperation agreements\" had been reached with recently merged rail operator Canadian Pacific Kansas City (CPKC) regarding rail projects in Mexico's south.\"The president would like (CPKC's rail network) to connect with the south of the country,\" Ebrard said.CPKC's network currently extends through Canada and the United States down through central Mexico, with stops on the county's Pacific and Gulf coasts.",
        "CPKC \"agreed to work together exploring how we can support the administration's initiatives, including sharing our experience, best practices and technology for\" two train lines being constructed by the government, the firm told Reuters.It did not detail plans to connect to the rail lines already in progress in Mexico's southern region.However, CPKC also told Reuters it had committed to study requirements for a proposed passenger service between capital Mexico City and Queretaro, some 114 miles (183.5 km) northwest. (Reporting by Kylie Madry; Additional reporting by Dave Graham; Editing by Brendan O'Boyle and Jacqueline Wong)"
    ]
}