{
    "articleURL": "/tvshowbiz/article-12054915/Hailey-Bieber-bares-sculpted-midriff-endless-legs-bikini-plugs-Rhode-Skin.html",
    "content": [
        "Hailey Bieber showcased her sculpted midriff and her vertiginous legs in a jaw-dropping Instagram album over the weekend.",
        "The 26-year-old wife of Justin Bieber was promoting her Rhode Skin line, which takes its title from her middle name.One of her pictures saw her posing up a storm in a barely there white bikini, wearing plenty of her product to bring out her unmistakable features.She made sure to include a video that served up a generous close-up of her face so that her fans could get a good look at the results of Rhode Skin.Over the course of the album Hailey — whose uncle happens to be Alec Baldwin — also let her public in on a few glimpses of the diet she relies on to retain her svelte frame.",
        "Some of her culinary delights included a croissant as well as smoothies from Erewhon, an upscale health food chain that has proven to be flypaper for celebs. Her latest post comes days after she and Justin strikingly missed Monday's Met Gala, the glittering annual bash known as 'fashion's night out.'Held in memory of the waspish designer Karl Lagerfeld, this year's fete marked the first time Hailey skipped the Met Gala in eight years.Although she has refrained addressing her absence in public, her decision comes after rumors of a feud with her husband's ex Selena Gomez.When Justin and Hailey attended the Americana-themed Met Gala together in September 2021, onlookers chanted: 'Selena!' at them.",
        "This past October, Selena and Hailey cuddled up to one another for the cameras at the Academy Museum gala, suggesting they had buried the hatchet.By this February however Hailey found herself denying claims that she had taken a swipe at Selena on TikTok, and speculation exploded that the pair were on the outs.Then last month Selena wrote on social media: 'Hailey Bieber reached out to me and let me know that she has been receiving death threats and such hateful negativity.'She declared: 'This isn't what I stand for. No one should have to experience hate or bullying. I've always advocated for kindness and really want this all to stop.' ",
        "Hailey responded in kind, writing on her Insta Stories: 'I want to thank Selena for speaking out, as her and I have been discussing the last few weeks how to move past this ongoing narrative between her and I.'Meanwhile Justin's latest sighting comes about two months after he canceled all of his 2023 tour dates following a string of postponements.When he previously delayed the performances in 2021, he revealed that the move was necessitated by his battle with Ramsay Hunt syndrome.The condition has caused Justin to experience facial paralysis, which he went viral for showing his fans on social media. "
    ]
}