{
    "articleURL": "/wires/reuters/article-12046269/Global-ammunition-race-decide-Ukraine-war-Peter-Apps.html",
    "content": [
        "By Peter Apps",
        "LONDON, May 4 (Reuters) - At the U.S. Army Ammunition Plant in President Joe Biden´s hometown of Scranton, Pennsylvania, production lines are running day and night through the working week to deliver artillery shells.The ramp-up comes amid a worldwide military supply battle on a scale not seen since the 1950-53 Korean War - and which may well decide the outcome in Ukraine.What Britain´s Royal United Services Institute calls the \"return of industrialised warfare\" is also now shaping global geopolitics. The million-dollar question is whether China will prove willing to throw its industry into the fight on Russia's side, a move the United States, Ukraine and NATO allies are all expending considerable diplomatic effort to prevent.The Kremlin may use its claims of a U.S.-Ukrainian effort to assassinate President Vladimir Putin by drone to push Beijing harder on that point. The Kyiv government, meanwhile, will argue that the greater the Russian threat, the more desperate its need for arms.Both sides face shortages of multiple other weapons systems - including anti-tank, anti-aircraft and long-range rockets, as well as drones - but it is the shell shortage that will likely be most decisive on the battlefield.U.S. officials said in February they knew China was considering supplying the Kremlin with lethal arms including shells, but there has been no confirmation that it has done so - although Ukrainian officials say more Chinese components are now being found Russian drones and missiles. China said in April it would not sell weapons to either side.",
        "Iran, meanwhile, is said to have shipped some 300,000 shells to Russia in recent months, while North Korea with its enormous ammunition stocks is also touted as a potential further source.Officials in Kyiv say Russia has often fired 10 times as many shells as Ukraine, a measure of the vast stocks the Kremlin built up during the Cold War and since. In December, a U.S. defence official told Reuters some rounds used by Russia were up to 40 years old - bringing risks of failure or premature explosion, and a sign that even its gargantuan stockpiles were running down.Western arsenals have also been emptied, hitting capability for any future conflict.\"So far, most of the ammunition that has been delivered to Ukraine has come from reducing our stocks,\" NATO Secretary General Jens Stoltenberg told reporters last month. \"In the long run, that doesn't work for us - so now, we are also ramping up production.\"At the start of March, Ukraine was reportedly firing 110,000 artillery shells a month, and requested allies to supply enough to bring that number up to 250,000. According to British analysts, Ukraine´s artillery usage would exhaust the entire UK stockpile in eight days.The United States, the NATO nation with by far the largest stocks, has already sent a million shells and is looking to increase production capability to six times its current level. The European Union has pledged another million, a significant milestone in the bloc´s involvement in the conflict - but not enough for many Eastern European members.",
        "UNCHARTED TERRITORY\"After the last few months of reviewing the battlefield in Ukraine, we and our allies have almost full knowledge of how much ammunition is being used daily, weekly and monthly,\" said Polish Prime Minister Mateusz Morawiecki in March. \"These are quantities many times greater than those available to most NATO countries today.\"For the West, this is uncharted territory.Even in the Cold War, U.S. and NATO military planners believed they needed no more than 30 days of artillery stocks in Europe, as any conflict was likely to either end within that timeframe or escalate into a global atomic war. Few of its European allies ever made enough shells to reach that level, and all Western states have dramatically reduced that effort since.In March, Democratic New Jersey Congressman Donald Norcross, chair of the House Tactical Air and Land Forces Subcommittee, warned that existing facilities were \"shocking\".\"The production process, the tooling facilities are all operating much like they did during the Second World War,\" he said.U.S. officials say they hope soon to be producing 20,000 shells per month from U.S. plants, rising to 40,000 within two years - a programme that requires new factories, new machine tools and a desperate search for staff in an environment where arms firms find vacancies difficult to fill.",
        "It would not be the first time. In 1915, during World War One, a similar - but much larger - \"shell crisis\" cost British military lives and prompted the fall of Prime Minister Herbert Asquith. New Prime Minister David Lloyd George ordered a massive expansion of factories, many staffed by women. (The change also upended British society and helped deliver votes for women.)Another complication is Ukraine´s mixture of weapons systems. Most of the West´s defence industry is configured to produce ammunition of the calibre used by NATO - primarily 155 mm for artillery. Western states have gifted Ukraine dozens of their own artillery pieces of that calibre, and they remain better supplied.The majority of Ukraine´s artillery, however, remains Soviet-built - and the 152-mm shells have been harder for its Western allies to find.REDUCING FRONTLINE FIRINGThe result, reports from the frontline suggest, is that some Ukrainian units equipped with Soviet-calibre artillery have been restricted in recent weeks and months to firing only once or twice a day. Late last year, Ukraine began manufacturing some of its own 152-mm shells, but it is unclear how many have been produced, leaving Kyiv and the West looking for supplies elsewhere.In August 2022, open-source researchers noted multiple flights by British RAF C-17 transport aircraft from Pakistan to Cyprus, reported in the Indian press to be part of a wider Western effort buying Pakistan´s mostly Chinese-made artillery shells for Ukraine.",
        "NATO member Bulgaria - which has one of Europe´s largest armaments industries as well as stockpiles of Soviet-calibre arms - has also been important. Pro-European Prime Minister Kiril Petkov said his government provided approximately one third of Ukraine's ammunition in the first months of the war.Since Petkov´s government fell in August 2022, pro-Russian President Rumen Radev has ruled out further arms sales to Ukraine, although some diplomats say transfers may still take place behind the scenes, potentially through purchases by other nations for onward transport.Inevitably, that leaves the United States holding much of the burden. In April, a South Korean newspaper reported that the government in Seoul was reluctant to involve itself deeper in the war and so was considering \"loaning\" another 500,000 shells to the U.S. on top of 100,000 already sold, allowing Washington to restock its arsenals while sending more shells to Ukraine.After leaked U.S. documents showed South Korean worries over getting pulled further into the war, the topic is likely to have been a major theme behind the scenes as South Korean President Yoon Suk Yeol visited Washington last week, receiving new defence pledges from the White House.In April, as German Foreign Minister Annalena Baerbock visited Beijing, Chinese Foreign Minister Qin Gang pledged that China would not sell weapons to either side in Ukraine. Whether Beijing keeps that pledge in the coming year may decide not just the outcome in the current war, but the trajectory of much wider world events.",
        "* Peter Apps is a Reuters columnist writing on defence and security issues. He joined Reuters in 2003, reporting from southern Africa and Sri Lanka and on global defence issues. He has been a columnist since 2016. He is also the founder of a think tank, the Project for Study of the 21st Century, and, since 2016, has been a Labour Party activist and British Army reservist. (Editing by Nick Macfie)"
    ]
}