{
    "articleURL": "/sport/football/article-12041101/Rio-Ferdinand-player-inducted-Premier-League-Hall-Fame-2023.html",
    "content": [
        "Rio Ferdinand is the 17th player inducted into the Premier League Hall of Fame The legendary defender won six top flight titles and made 504 appearances Ferdinand represented Manchester United, Leeds United, West Ham and QPR Manchester United legend Rio Ferdinand has been inducted into the Premier League Hall of Fame.",
        "The former centre-back - who also represented West Ham, Leeds United and QPR in his career - was selected after a vote by fans across the world from a 15 person shortlist.Ferdinand becomes the 17th player to join the Hall of Fame after eight legendary stars were inducted in both 2021 and 2022.He joins Sir Alex Ferguson and Arsene Wenger in the 'Class of 2023', with the two Premier League icons the first managers to be inducted. Ferdinand is one of the greatest top flight defenders of all time, winning six Premier League titles and racking up 504 appearances.",
        "After breaking through at West Ham where he made his debut aged 17, he became the world's most expensive defender when he joined Leeds in 2000 for £18m.After excelling at Elland Road, he broke his own record two years later when he moved to Manchester United for £30m. On both occasions, he also broke the British transfer record.Known as one of the greatest ball-playing central defenders of his era, it was this that set him apart from his peers, along with his natural pace and flexibility and his burning desire to win.He was a key cog for Sir Alex Ferguson's legendary United team and helped the Red Devils to win three successive Premier League titles between 2006-09. ",
        "Across his 504 top flight games, he helped to keep 189 clean sheets - which is the third most in Premier League history of any defender - and only behind John Terry and Jamie CarragherAfter ending his 12-year spell at Old Trafford in 2014, he finished his career with a season at QPR.Ferdinand - who also won 81 caps for England - has since gone on to become one of the most prominent pundits in the game.Reflecting on his achievement, a delighted Ferdinand told the Premier League: 'As a defender, I'm not used to celebrating personal glory - we leave that to the midfielders and strikers! 'When you start your career, you never dream of how well things could turn out.'I remember all those long journeys on trains and tubes; all the training, cleaning players’ boots and taking care of the kit. 'I remember going back to my estate and seeing my friends who were all desperate to know what it was like.'",
        "Looking back at his legacy as one of the most graceful defenders of the modern era, Ferdinand added: 'The only thing I can think of, without patting myself on the back too much, would be the way I played my position which was probably something that set me apart. ",
        "'At that time, a centre-half who’s comfortable running out with the ball and taking the ball under pressure, wasn’t really what the position’s identity was about but that was my identity.'You look at the players now, that’s a massive part of the way young centre-backs play because those are the demands put on players. I’d love to have played today!'He continued: 'It’s a great feeling to be recognised by my peers as well as the fans.",
        "'To be inducted into the Premier League Hall of Fame alongside such a high calibre of players and managers is a tip of the cap to say the career is what you wanted and what you dreamed of as a kid. To be able to say that I achieved my dream is special. 'The Premier League is the holy grail, and I just can’t believe I made it.'The Hall of Fame launched in 2021, with inaugural inductees including David Beckham, Dennis Bergkamp, Eric Cantona, Thierry Henry, Roy Keane, Frank Lampard, Steven Gerrard and Alan Shearer.In 2022, Sergio Aguero, Didier Drogba, Vincent Kompany, Wayne Rooney, Peter Schmeichel, Paul Scholes, Patrick Vieira and Ian Wright, were the next group to be inducted into the Hall of Fame.Sir Alex Ferguson, Arsene Wenger and Ferdinand are the first three individuals to be added in 2023. ",
        "To be eligible for the Premier League Hall of Fame, individuals must have been retired as of 1 January 2023, and only their Premier League career is considered in their candidacy. It recognises and celebrates individuals who have an exceptional record of success and have made a significant contribution to the Premier League since its inception in 1992. It is the highest individual honour awarded by the league. The 15 person shortlist for 2023 was: Tony Adams, Ashley Cole, Gary Neville, Sol Campbell, Jermain Defoe, Michael Owen, Michael Carrick, Les Ferdinand, John Terry, Petr Cech, Rio Ferdinand, Yaya Toure, Andrew Cole, Robbie Fowler and Nemanja Vidic.Two more players will be revealed to be joining Ferdinand in the Hall of Fame later today, with an event celebrating the 'Class of 23' to be held in London this evening. ",
        "1. Alan Shearer2. Thierry Henry3. Eric Cantona4. Roy Keane5. Frank Lampard6. Dennis Bergkamp7. Steven Gerrard8. David Beckham 9. Patrick Vieira 10. Wayne Rooney11. Paul Scholes12. Didier Drogba13. Peter Schmeichel14. Sergio Aguero15. Vincent Kompany16. Ian Wright17. Sir Alex Ferguson18. Arsene Wenger "
    ]
}