{
    "articleURL": "/femail/real-life/article-12057715/Australia-rental-crisis-Renter-shows-unimpressive-500-week-unit-Sydney.html",
    "content": [
        "Emily pays $500per-week for a studio apartment in Sydney She listed everything that's wrong with it despite the high price  A young woman has revealed the grim reality of Sydney's rental crisis by offering a tour of her 'very unimpressive' $500-per-week studio apartment. ",
        "Emily didn't shy away from the details including the fact her roof is being 'held up with tape' and her wardrobe won't stay open. She says she 'needs to laugh so she doesn't cry' about her current living situation. In a stinging video filled with satire, Emily wrote: 'Things about my apartment that just make sense' - then proceeded to show all the points of concern.Scroll down for video ",
        "To make use of the small space, Emily stacked her miniature fridge on the dryer and also placed her washing machine in the kitchen.She claims 'tape holds the roof together' and 'roots are growing out of the gutter'.  In the clip, she also claims the kitchen bench is broken and can see into the neighbour's backyard.The kitchen bench is also designed with a tilt, so she holds the sink up with a handy tin of Keen's curry powder.   Her wardrobe opposite the bed refuses to stay open because the unit was 'built on a lean', she claims. As for the bathroom, Emily had to glue a tiny square mirror onto the window and 'sits sideways' on the toilet for extra leg room.",
        "In the video, Emily claims:- Roots are growing out of the gutter- 'Tape is holding the roof together'- The kitchen bench is broken- Tin of curry powder holds up the sink- She can see into the neighbour's yard- Bathroom mirror glued onto window- Wardrobe door won't stay open because the apartment was 'built on a lean'- She has to 'sit sideways' on the toilet for extra leg room",
        "Within 48 hours the clip was watched over 243,000 times and many were in shock over the living conditions.'The rental crisis is so real,' one commented, another asked: 'Oh darl, are you okay?' 'Australian government be like well your breathing aren't ya?' a third joked.Another added how it's better financially - but perhaps not emotionally - to live in a share house with others.Some joked: 'Babe just be born into a family with money and have everything handed to you then buy a house and tell everyone you worked for it. Hope this helps.''Landlords and real estate (agents) have so much to answer for,' another added."
    ]
}