{
    "articleURL": "/wires/ap/article-12048503/Churchill-Downs-horse-deaths-probed-2-loose.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - Churchill Downs suspended trainer Saffie Joseph Jr. indefinitely and Lord Miles, who is trained by Joseph, was scratched from the Kentucky Derby on Thursday, days after the sudden death of two of his horses at the track.",
        "The suspension prohibits Joseph, or any trainer directly or indirectly employed by him, from entering horses in races or applying for stalls at all Churchill Downs Inc.-owned tracks.The decision comes after the deaths of Parents Pride on Saturday and Chasing Artie on Tuesday. Both collapsed on the track and died after races.\"Given the unexplained sudden deaths, we have reasonable concerns about the condition of his horses, and decided to suspend him indefinitely until details are analyzed and understood,\" Bill Mudd, CDI president and chief operating officer, said in a statement. \"The safety of our equine and human athletes and integrity of our sport is our highest priority. We feel these measures are our duty and responsibility.\"Investigators have yet to find any cause in the deaths of Joseph's two horses in a 72-hour span, along with two others over the past week, which has cast a pall over Churchill Downs in the final preparations for the Kentucky Derby on Saturday.\"This is the worst part of the game,\" said Mike Repole, co-owner of early Derby favorite Forte. \"It´s very sad.\"",
        "Joseph said earlier Thursday he was questioned by investigators from the Kentucky Horse Racing Commission and Churchill Downs.\"They found no wrongdoing on our part,\" he said.Joseph received permission from the KHRC to scratch five horses from races on Thursday, Friday and Saturday, according to the Daily Racing Form. He already had scratched one on Wednesday. He told reporters earlier in the day that he scratched any horse that had been in contact with the two that died out of an abundance of caution.",
        "Despite the deaths, Joseph had planned to run Lord Miles in the Derby. The colt arrived from Florida; the two dead horses had been at Keeneland in Lexington.Joseph, a 36-year-old third-generation trainer, said earlier Thursday that investigators examined his barn, checked the horses' veterinary records and took blood samples from each of his horses, which showed nothing abnormal. The feed, hay, straw and supplements used by the horses were checked, too.The deaths are the first for Joseph, who came to Florida in 2011 after training in his native Barbados.\"It crushes you. It knocks your confidence, it makes you doubt everything,\" he said.At the same time, he added, \"There´s two ways: You can run away from it and pretend it didn´t happen or you could face it and find out what we can do.\"Meanwhile, two horses dumped their exercise riders during on-track training Thursday, including Derby entrant Verifying. Neither rider was injured.Besides Joseph's horses, Derby long shot Wild On Ice and 3-year-old filly Take Charge Briana broke down with musculoskeletal injuries during training or racing at Churchill Downs. Both were euthanized.Joseph said the first necropsy done on his horse didn't reveal a cause of death.\"We're living on unknown terms right now, so that's the uneasy part,\" he said.",
        "Spectators at morning training were startled when Verifying, one of trainer Brad Cox's four Derby runners, got loose on the track, triggering a warning siren. The colt was caught by an outrider and turned over to Cox, who led him back to the barn. The exercise rider dislocated his right shoulder.\"He was galloping by and looked great. Next thing I know the rider was on the ground,\" Cox said. \"We got lucky, we dodged a bullet.\"Cox said he had \"no concern\" about any issues with the track as a result of the horse deaths.Not long after, And Tell Me Nolies reared and dumped her rider before tearing off the track at full speed and rampaging through the stable area in search of her barn. Trainer Peter Miller said the filly appeared to be fine and is scheduled to start in the Kentucky Oaks on Friday.\"Luckily, she didn´t go down or anything, so she´s OK,\" he said.Repole believes it would help if the sport did more to reassure the public how seriously it takes safety.\"People will understand injuries,\" he said. \"People won´t understand injuries with death.\"The industry was rocked in 2019, when more than 40 horses died at Santa Anita in California. As a result, a raft of safety reforms were enacted that have spread around the country.",
        "\"The horses get great care and we do our best to prevent these kind of things, but they still happen,\" Joseph said. \"A lot of times in those sudden deaths you never get answers.\"___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}