{
    "articleURL": "/travel/article-12052585/I-camera-suitcase-REALLY-happens-luggage-flight.html",
    "content": [
        "Thomas Miller gave the web a sneak peek at the baggage process He put a camera on his suitcase before checking it in The frequent flyer went viral for the clip, garnering over 16.1 million viewsA frequent flyer has given the web an inside look at what happens after you check-in your bag at airport security. ",
        "Content creator Thomas Miller, who is based in the UK, went viral after posting a video that showed what happens to your suitcase during the baggage process. In the video, which amassed over 16.1 million views, Thomas places a camera on his bag before checking it in. Captioning the clip, 'Time to find out what the airport does with my bag,' he shared footage of the bag's journey. ",
        "Watching from the luggage's point of view, viewers saw the suitcase go through a conveyer belt, and make a few twists and turns along the way. Then, the bag quickly goes past a crew member. Finally, the suitcase gets placed with the other suitcases, ready to be put on the plane and carried away to its destination. Over 100,000 suitcases go through airports every day, and although many passengers simply hand their luggage over without even giving it a second thought, now, Thomas has lifted the lid on the baggage process. Alternative Airlines - a site that helps you book flights from anywhere in the world - confirmed the accuracy of Thomas's footage by detailing what happens after you drop your suitcase off. After check-in, your suitcase will be placed on a conveyor belt. Depending on the airport you are departing from, it will then make its way to the sorting office, where 'robots or staff' will organize them into the correct aircraft. ",
        "During your bag's travel journey, it will be screened at a security checkpoint - similar to the process that sees your carry-on being scanned by an X-Ray machine - to determine if there are any suspicious items inside.  After going through security, it will be moved to the plane where airport ramp agents will ensure your bag gets on the right aircraft. After you land at your destination, your suitcase will be unloaded from the plane and moved to a terminal and then to the 'baggage reclaim conveyor belts', where you can grab them, according to Alternative Airlines. ",
        "People on social media were shocked to be given a sneak peek at the baggage process, however, some said they were 'expecting more.' One person said: 'I don't know what I was expecting but I know I was expecting more.' Another person added: 'Finally content we actually need lol.' 'I knew what to expect, yet I wanted more drama,' 'Me saying weee! in my head the whole time,' joked another user.Someone else wrote: 'That was shocking and revealing!'Another user said: 'That was such a fun adventure.' Some viewers questioned if it was illegal to place a camera on your bag and record the baggage process. However, according to Flyertalk.com, surveillance cameras to protect your own property are not illegal in the US. "
    ]
}