{
    "articleURL": "/tvshowbiz/article-12053267/Chrissy-Teigen-shows-abs-tiny-crop-jeans-blazer-enjoying-shopping-outing.html",
    "content": [
        "Chrissy Teigen and husband John Legend were the picture of marital bliss when they were seen out in the middle of a day of retail therapy.",
        "The couple, who have been married for nearly 10 years, were all smiles after stopping by to pick up a few items at the Bottega Veneta store, which specializes in high-end Italian leather handbags and ready-to-wear women's and men's fashion.The former Sports Illustrated Swimsuit Issue model flashed her flat midriff three months after giving birth to daughter Esti.Teigen appeared to be wearing a tiny crop top underneath a stylish black blazer, along with baggy blue jeans and a pair of furry white, open-toe sandals.Their afternoon of shopping along on Rodeo Drive comes amid the announcement that fans of Teigen's will soon be able to get a taste of her bakery creations at a pop-up bakery in Downtown Los Angeles.Scroll down to video ",
        "While making the walk from the Bottega Veneta store, Legend (born John Roger Stephens) carried many of their newly-purchased items in a large green bag.The All Of Me musician, 44, opted to go with a white and white-patterned sweater and fitted black pants.He also sported a pair of black sneakers and kept his dark hair and full beard and mustache well manicured for the trip to the famed upscale shopping district of Beverly Hills.Teigen, 37, also carried a much smaller green bag from the shop over her shoulder while she also carried her stylish purse.",
        "Being that the Southern California sun was glaring down for their stroll back to their parked vehicle, the former Lip Sync Battle co-host slipped on a pair of cool dark sunglasses, all while her long tresses were pulled back into a ponytail.As for fans eager to get a taste of Teigen's sweet treats: her pop-up bakery is opening up at the Row DTLA, and will be operating out of the Shopify space, according to Eater Los Angeles, according to Eater Los Angeles.The bakery opens next Friday, May 12 to May 14, and then again from May 18 through May 21, with hours running from 11 a.m. to 5 p.m.She will be selling products made using her Cravings by Chrissy Teigen bakery mixes. That includes the brand's buttermilk mochi pancakes and waffles, banana bread, and macadamia and chocolate chunk cookies. ",
        "'I know u guys have been loving our baking mixes – they've sold out multiple times on the site, you guys loved our food truck, and I thought what else can we do?? uh, bakery of course,' the Delta, Utah native wrote in an Instagram post announcing the bakery on Friday morning.The promotional post also included a fun video where the television personality stopped her husband from eating one of her cookies that was on a baking tray.",
        "'Save It for the bakery,' she says while scolding the EGOT (Emmy,, Grammy, Oscar and Tony) winner in the clip. She also pulled off the stunt with a young lady who could be seen grabbing one of the cookies off the tray on a counter.'Don't make me do what I did to John,' she adds, all while grabbing the cookie out of her hands and putting back on the tray.'Cravings bakery &amp; pop-up is coming to Shopify LA,' it reads in a caption near the top of the screen. ",
        "In order to gain access to the bakery, people need to RSVP by picking up $5 tickets, which will go towards any product purchase inside the store (excluding baked goods), through Shopify X The Cravings Experience website.Tickets to the bakery are limited, so interested fans and customers will want to act fast.Teigen and Legend only just welcomed daughter Esti on January 13.The happy couple, who will celebrate their 10th wedding anniversary in September, are also the proud parents of daughter Luna, seven and son Miles, four.For those who can't make it to the Cravings x Shopify pop-up, the Cravings baking mixes are available for sale at Bristol Farms starting on May 9."
    ]
}