{
    "articleURL": "/wires/ap/article-12041881/EU-wants-ramp-ammunition-production-help-Ukraine.html",
    "content": [
        "BRUSSELS (AP) - The European Union announced fresh plans to ramp up the large-scale production of ammunition, seeking to both benefit Ukraine while the country is at war with Russia and to improve the bloc´s geopolitical credentials.",
        "Ukraine is poised to launch a planned spring counteroffensive to recover Russian-occupied territory, but the country has burned through ammunition at a furious rate, according to analysts. Western allies have provided ammunition, and the government in Kyiv has asked them to supply much more.\"Let´s give first, let´s deliver first, what Ukraine needs immediately. Because again, we know exactly what´s happening on the ground,\" Thierry Breton, the EU's internal market commissioner, said.He wants to use at least 1 billion euros ($1.1 billion) to fund the Act in Support of Ammunition Production, or ASAP, with the goal of providing Ukraine with ammunition and replenishing the stocks in member countries. EU funds would provide half of the money, with the rest co-financed by member states.European Union nations, lulled into complacency by decades of peace and military protection from the United States through NATO, have badly under-invested in ammunition production. The 27-nation block now wants to make ammunition at a record pace as war is waged on its doorstep.Breton said the EU still has a large potential production base, especially in the bloc's east, that could be put to use with a concerted focus.",
        "\"I am confident that we could be able to upskill our industrial base to be able to produce at least 1 million (rounds of) ammunition in Europe for Ukraine\" over the next year, he said.",
        "Beyond Wednesday´s commitments to ramp up production, the EU has already funded the delivery of ammunition to Kyiv from the stocks of member states to the tune of 1 billion euros and committed as such to boost joint procurement.The EU has long been criticized for failing to back up its economic clout with enough military hardware. Its lack of military stockpiles and limited and slow production capacity undermined its international standing.With ASAP, the EU seeks to change that.\"This is a critical part of Europe`s strategic capacity to defend its interests and values, and help maintain peace on our continent,\" European Commission President Ursula von der Leyen said.Besides ammunition, NATO allies and partner countries have delivered more than 98% of the combat vehicles promised to Ukraine during Russia´s invasion and war.Along with more than 1,550 armored vehicles, 230 tanks and other equipment, Ukraine´s allies have sent \"vast amounts of ammunition\" and also trained and equipped more than nine new Ukrainian brigades, NATO Secretary-General Jens Stoltenberg said last week.Stoltenberg said the 31 NATO allies, which include most EU nations, were committed to shoring up Ukraine´s military, adding that taking back land the Kremlin´s forces occupied would give Kyiv a stronger negotiating position if peace talks occur.The U.S. is sending Ukraine about $300 million in additional military aid, including an enormous amount of artillery rounds, howitzers, air-to-ground rockets and ammunition as the launch of Ukraine's planned spring counteroffensive approaches, U.S. officials said Tuesday.",
        "___Follow AP's coverage of the war in Ukraine: https://apnews.com/hub/russia-ukraine"
    ]
}