{
    "articleURL": "/sport/tyson_fury/article-12038473/Deontay-Wilder-ARRESTED-police-gun-drugs-Rolls-Royce.html",
    "content": [
        "Deontay Wilder was arrested on a charge of possession of a concealed weaponAmerican boxer was held in custody before posting whopping $35,000 bondWilder and Joshua seemed set to face off in December amid reported talks Deontay Wilder was arrested and jailed in the early hours of Tuesday morning after police found a gun.",
        "The former world heavyweight boxing champion was held in custody before posting a whopping $35,000 bond, the Los Angeles Police Department (LAPD) confirmed to DailyMail.com.Cops also confirmed he was booked on a charge of possession of a concealed weapon.  Wilder, who's fought 46 times with 43 wins, two losses and a draw, had been driving his Rolls Royce at 1.15am on Tuesday in the Hollywood area of the City of Angels, according to TMZ.Officers booked Wilder behind bars after reportedly discovering a 9mm pistol in the car of the former WBC heavyweight champion (from 2015 to 2020). Just hours after his release, Wilder shared a cryptic message on social media, posting on Twitter: 'I'd rather be safe than sorry. The End.'",
        "Wilder, who's lavish car also reeked burnt marijuana, was reportedly 'cooperative and nice' during his arrest when taken into custody, reports TMZ. He also reportedly had illegally tinted windows and an obstructed number plate. The Alabama-born boxer will now go to an LA court on May 23.Wilder was booked into custody at 3.13am, meaning he spent just over three hours behind bars before his rather expensive release.He could face a felony charge and be fined up to just over $10,000 after his trial in just a few weeks' time.",
        "It's also unclear if Wilder had a license to carry the concealed weapon found in his vehicle, police told DailyMail.com. Wilder's boxing career has yet to be impacted by his recent arrest.",
        "The Bronze Bomber is set to face Anthony Joshua in December in a heavyweight bout for the ages, but that could now be up in the air following the arrest.The two camps have reportedly been in negotiations over a bout, but that may be scrapped if Wilder is guilty of a potential felony charge in court later this month.The six-foot-seven, 214-pound boxer, who fights in an orthodox stance, lost twice to Tyson Fury in a recent fight as he lost his world title, before bouncing back with a win against Robert Helenius in October.It has been suggested he could face Fury again in an attempt to regain his WBC title, but that looks unlikely."
    ]
}