{
    "articleURL": "/wires/pa/article-12042809/Scottish-Tory-leader-condemns-SNP-secrecy-spin-cover-ups.html",
    "content": [
        "First Minister Humza Yousaf has come under fire after failing to attend Holyrood for a debate on transparency within the SNP.",
        "Scottish Conservative leader Douglas Ross accused the SNP, which has been in power for 16 years in Scotland, of “secrecy, spin and cover ups”.He said while Mr Yousaf has been “happy” to answer questions from the press, he is unwilling to give a statement to MSPs about the turmoil within Scotland’s governing party.With a police investigation into the SNP finances ongoing and following the resignation of senior figures in the party after the media was misled about membership numbers, the Tories brought forward a debate in Holyrood calling on the First Minister to make a statement about SNP governance.Mr Ross said such matters are in the “public interest and should be properly scrutinised and debated in the national Parliament”.Insisting there are still “crucial questions” to be answered “weeks into this sorry saga”, the Scottish Tory leader said Mr Yousaf should answer questions from fellow MSPs.",
        "Mr Ross said: “The First Minister seems quite happy to answer these questions outside the chamber. He always stops to speak to the press to give his views on a whole host of issues.“If the First Minister is happy to give those answers to the press just a few metres from this chamber, why is he not happy to come in here to answer those questions?",
        "“Not just is he unwilling to answer questions in this chamber, he is unwilling to even attend today to respond to these points.“Today marks 16 years since the SNP were elected into Government.“During that time we have seen secrecy, spin and cover ups from the heart of Government.“Today is an opportunity for SNP members to say enough is enough.”With Mr Yousaf absent from the chamber, parliamentary business minister George Adam spoke for the Government.He made clear that “transparency and scrutiny of this Government is important”, and he hit out at the Tories over their own refusal to reveal their current membership figures – saying Mr Ross’s party “won’t practice what they are trying to preach”.Mr Adam added: “The absolute hypocrisy from the Conservatives is almost laughable. You just cannot take the Tories seriously on this issue  George Adam, parliamentary business minister  “You have to admire someone who has that level of brass neck, to complain about a lack of transparency when you lead the Scottish Conservative Party.”He recalled how the Conservatives at Westminster had “illegally prorogued the UK Parliament to avoid debate and scrutiny”, and he said that at the Scottish Conservative conference last weekend Prime Minister Rishi Sunak would “only agree to speak to the Scottish press if he could handpick the media”.",
        "Mr Adam continued: “The Tories come to us here in the Scottish Parliament and they talk about our integrity.“This party, the Conservatives, have received hundreds of thousands of pounds from unincorporated associations that do not reveal their origin of funding, and they question the integrity of others.“You just cannot take the Tories seriously on this issue.”He also noted that “within days” of being elected SNP leader, Mr Yousaf had announced a review of governance within the party.The minister told MSPs: “I am not going to stand here and claim that there are not issues in the SNP which need to be addressed.“But I can stand here and say these issues are going to be addressed.”"
    ]
}