{
    "articleURL": "/sport/football/article-12051443/Jack-Grealish-names-Man-Citys-best-worst-dressed-players-whos-longest-shower.html",
    "content": [
        "The winger has developed into a key player for City after his £100million moveGrealish is in sensational form this season with five goals and seven assistsThe 27-year-old has revealed some controversial opinions on his City teammatesJack Grealish has named Manchester City's best and worst dressed players and dancers - and even who takes the longest in the shower. ",
        "The winger has developed into a key player for City after making a £100million move from Aston Villa in 2021.Grealish, who has 31 England caps, is in sensational form this season with five goals and seven assists in 45 appearances.With a mischievous smile and twinkle in his eye, the 27-year-old has now exclusively revealed to Mail Sport some controversial opinions on his City teammates.During a series of quick-fire questions, Grealish was asked who is the most laid-back in training.",
        "Best trainer?Phil Foden.Most laid back trainer?  Kev. But he's just like, you know, because of how good he is on a match day. He's just chilled in training.Best dressed?Kyle Walker.Worst dressed? Rodri. He's awful, awful.Best dancer?John Stones.Worst dancer?Me.Best music?Me. Multigenre DJ.Worst music?Rodri.  Best skills?Phil Foden. Longest in shower?Erling. Longest in the gym? Ruben Dias.",
        "He replied: 'Kev. But he's just like, you know, because of how good he is on a match day. He's just chilled in training.'The forward described right-back Kyle Walker as the 'best dressed', while defensive midfielder Rodri was the worst.The Spanish footballer, 26, was also criticised for his taste in music as centre-back John Stones was rated the best dancer. Grealish said he was by far the worst dancer in the squad, but claimed to be a 'multigenre DJ'.",
        "Attacker Phil Foden was the best trainer and named as having mind-blowing tekkers.Record-breaker Erling Haaland, who is known for having some unusual habits, takes the longest in the shower and centre-back Ruben Dias spends the most time in the gym.It comes as City look to use Saturday's fixture against Leeds United to go four points clear of Arsenal at the top of the table.City will come up against Sam Allardyce as the 68-year-old takes charge of Leeds for the first time, having been brought in to try and save their Premier League status. 'Always there is an impact of a new manager on the players for the first one or two games,' Pep Guardiola said. 'Every team is playing for important things. Of course for Leeds to stay here, the impact is always huge.'I don't know how they play, we don't have any info, we will have to adapt quick after five, 10 minutes. We can imagine what he tries to do. It's a massive, important game for us.'When you don't have information on the opponent, you don't focus much on them. Focus more on you. You have to think about your team. We analyse the West Ham game to help us with the next game.'"
    ]
}