{
    "articleURL": "/femail/article-12059469/Ivanka-Trump-puts-stylish-display-Formula-1-grand-prix-Miami.html",
    "content": [
        "The former First Daughter looked effortlessly chic in a neutral-toned ensembleShe slipped into a pair of white linen trousers and a tailored beige waistcoatIvanka, 41, posed up a storm from her position overlooking the starting grid Ivanka Trump put on a very stylish display at the Miami Formula 1 Grand Prix on Sunday.",
        "The former First Daughter looked effortlessly chic on race day as she opted for an ensemble of neutral tones. She slipped into a pair of white linen trousers and a tailored beige waistcoat before accessorizing with a pair of statement gold earrings and tortoise-shell sunglasses.Ivanka, 41, initially wore her long blonde hair in a low bun before letting her locks cascade down in later snaps.",
        "Ivanka took to Instagram to share a slew of photos and videos from the Grand Prix on Sunday.She posed up a storm from her position overlooking the starting grid before also sharing an image alongside 42-year-old husband Jared Kushner as well as an aerial shot of the track.And it seems that the couple have had quite the whirlwind weekend.The pair were among the A-listers who went to Carbone Beach - an extravagant four-night supper club built to celebrate Miami's racing week - on Saturday evening.It was there that they rubbed shoulders with the likes of billionaire Amazon founder Jeff Bezos, 59, and girlfriend Lauren Sanchez, 53.The attendees, who forked out $3,000-a-night on reservations, were treated to cuisine from Italian restaurant Carbone in an ambiance that has been described as something out of The Great Gatsby. Ahead of the event, the creators of the special F1 pop-up vowed that the exclusive experience would be even more opulent and crazy than 2022 - with a cocktail hour that led into a seated dinner.",
        "Mario Carbone, managing partner of Major Food Group, said of the occasion: 'Hosting Carbone Beach during Formula 1 in Miami is the ultimate merger of adrenaline, luxury, and hospitality.",
        "'It's a spectacle that brings together unparalleled energy and glamour.'This year will be even bigger and more lavish than our inaugural year.'We expect to surpass that level of excitement and decadence, creating an unforgettable experience with new performances and indulgences that are truly over-the-top.'Ivanka brought color to the event - wearing an off-the-shoulder beaded swirl-patterned mini dress, a clutch bag, and red shoes. But Kushner kept it simple yet stylsih in blue jeans and a crew neck jumper which he later removed to expose a plain white tee. Ivanka was able to claim a front row spot at an intimate Jonas Brothers concert following the dinner.The mother-of-three shared a video of Nick Jonas singing a rendition of Jealous.It comes after Lara Trump insisted that there was no bad blood between sister-in-law Ivanka and the rest of the family following the news that the former First Daughter had dropped her brothers' lawyers in a $250 million fraud lawsuit against the Trumps.",
        "It was revealed last month that Ivanka had fired the attorneys who were representing her and her siblings Eric and Don Jr. in Letitia James' fraud suit against her family.",
        "Some suggested that the move might be an indication that there is a froideur between Trump's eldest daughter and her siblings. But Lara, 40, has since addressed those rumors head-on, telling DailyMail.com exclusively at the Rescue Dogs Rock NYC Cocktails For Canines event last week that everything is all good between them.'I think people are trying to make that a bigger deal than it really is,' she explained, while discussing Ivanka's decision to switch legal representation. 'It's not common to have to go through all this stuff that my husband and his siblings go through. 'They've had a series of different attorneys throughout this entire process and it just so happened that Ivanka felt closer to one, gravitated towards that [one].'She [may have] said, \"I'm going to have this person directly for me,\" but [the attorneys] all work as a team. I think that got lost in the story.' New York Attorney General Letitia filed a suit against former President Donald Trump last month, alleging that he, his three eldest children, his real estate firm, and its top executives falsely inflated property values to obtain cheaper loans.She is seeking $250 million – and is asking a judge to 'permanently' bar Donald and his adult children from doing business in the state. The Trumps have denied the claims."
    ]
}