{
    "articleURL": "/sport/football/article-12038077/OLIVER-HOLT-Gambling-Big-Sam-isnt-crazy-hell-bring-Leeds-clarity-style.html",
    "content": [
        "Sam Allardyce made a shock return to management by joining Leeds on TuesdayAllardyce could not appear more different in style to their ex-boss Marcelo BielsaLIVE: Follow updates as Sam Allardyce agrees to take charge at Leeds United When things get crazy, there is a bible for delusions. Hunter S. Thompson's novel, Fear and Loathing in Las Vegas, begins like this: ‘We were somewhere around Barstow on the edge of the desert when the drugs began to take hold.’",
        "If you want to get better acquainted with a bad trip, a host of Premier League clubs are somewhere around Barstow right now, too, high on cash and panic and heading for the casinos. And Sam Allardyce is at the wheel.It might seem like a hallucinogenic journey through half-forgotten backwaters of English football culture but it isn’t. Big Sam really is back, disinterred from a life on the fringes of the game and his part in a podcast called ‘No Tippy Tappy Football’ and catapulted into the mainstream.‘Give it to Big Sam,’ had become a phrase football supporters repeated to get a laugh. But Leeds United just did it. They really did it. They gave it to Big Sam. They made him their manager and entrusted him with saving their club. And their investment.",
        "The previous incumbent, Javi Gracia, had only been in the job for 70 days but Leeds conceded 23 goals in April, a Premier League record for a calendar month, have lost four of their last five matches, face Manchester City on Saturday and are separated from the relegation zone only by goal difference.Leeds have four games left – against City away, Newcastle at home, West Ham away and Spurs at home – and so they are going to have one last spin of the wheel and put it all on Allardyce.",
        "We live in a football world now of interims and interim interims, a world of ‘flexible contracts’ like the one Gracia signed, a world when lasting an entire season at one club counts for longevity.If you lose a couple of games, you shoot the sheriff and you appoint another one. And repeat. And repeat. In that world, maybe gambling on Big Sam isn’t as outlandish as it seems.Maybe Leeds had nothing left to lose. The appointment seemed strange from the start and the relationship between Gracia and the Leeds fans had broken down. He had already become an object of derision and spite.",
        "In the footage of the Leeds players trudging to the team coach before the weekend defeat to Bournemouth, ignoring supporters along the way, they looked like the living dead. It was hard to see them getting another point under Gracia. It is sad to see Leeds plunged into this kind of chaos. It is not so long ago that they were the best ticket in the league. Watching them play under Marcelo Bielsa was a joy, a blur of passing and movement and breathtakingly constructed goals. They were fragile, too, of course but that only added to the magic.Leeds are still trying to shake off the hangover of Bielsa’s departure. They had an identity under him, a stronger identity than any other team in the league but that identity has ebbed away and now no one knows what Leeds stand for on the pitch. The players don’t know, either.",
        "Bielsa’s nickname was El Loco and there was a quality of madness about him but it was a benevolent lunacy compared to the confusion that has taken hold at Elland Road now. Allardyce, 68, will bring an identity, too, but it is also reflective of the lack of planning and continuity endemic at clubs that the style of football he encourages is the polar opposite of Bielsa’s high-octane brand of play.",
        "Allardyce is a better coach than some would have you believe and he used wonderfully skilful players like Youri Djorkaeff and Jay-Jay Okocha in his years at Bolton Wanderers but there is still a world of difference between his more laboured style of play, which veers towards a dependency on long balls and a target man, to the bewitching fluidity that was the hallmark of Bielsa’s side.At least it will be a certainty of sorts. At least there will be a clarity of style. At this late, late stage of the season, perhaps that is all Leeds need.It does not change the fact that Allardyce’s appointment is part of a wider context of startling mismanagement by Premier League clubs. Spurs’ handling of the aftermath of Antonio Conte’s departure has been a joke which has cost them Champions League football next season. The same applies to Chelsea’s lack of planning for the succession to Graham Potter.",
        "Why were they so unprepared? Why were they caught like rabbits in the headlights? Why did Leeds fire Jesse Marsch and turn to a man who had been sacked by Watford, lasted nine months with Valencia and whose last job was with Al Sadd in Qatar?",
        "As English top flight clubs continue to be dominated by foreign managers, it is striking that in their moments of crisis, many have wrapped themselves in the comfort blankets of English coaches.Ryan Mason at Spurs, Frank Lampard at Chelsea, Roy Hodgson at Crystal Palace, Dean Smith at Leicester, Sean Dyche at Everton and now Allardyce at Leeds. Perhaps it is just that they are more readily available. Perhaps they are more malleable. Perhaps it is just that there is comfort in familiarity.Whatever it is, Leeds are playing for high stakes with Big Sam. Last seen failing to save West Brom from relegation two years ago, he has been entrusted with safeguarding Leeds’ golden ticket in the Premier LeagueIf Leeds go down, it may put their £400m sale to 49ers Enterprises, the investment arm of the San Francisco 49ers, in jeopardy. At the very least, it will force Leeds’ current owner Andrea Radrizzani, to take a big hit on the price. If Allardyce can save them from that, the craziness of putting him in charge for four games won’t seem like a bad trip after all."
    ]
}