{
    "articleURL": "/wires/ap/article-12055929/To-improve-kids-mental-health-schools-start-later.html",
    "content": [
        "DREXEL HILL, Pa. (AP) - In the hours before he's due at Upper Darby High School, senior Khalid Doulat has time to say prayers, help his mother or prepare for track practice.",
        "It's a welcome shift from last year for him and thousands of students at the school, which pushed its start time back by more than two hours - from a 7:30 a.m. start time to 9:45 a.m. One goal for the change: to ease strains on students that were more visible than ever coming out of the COVID-19 pandemic.\"I´ll be honest, I´ve been much happier in the mornings,\" Doulat said. \"I´ve been more positive, and I´ve come to school smiling more rather than, you know, grudging out of bed and stuff like that at 7:30.\"The idea of later school start times, pushed by many over the years as a way to help adolescents get more sleep, is getting a new look as a way to address the mental health crisis affecting teens across the U.S.For some schools, the pandemic allowed experimentation to try new schedules. Upper Darby, for one, initially considered later start times in 2019. Ultimately, it found a way to do it this year by using distance learning as a component of the school day.As students first came back to in-person learning, many dealt with mental health struggles and behavioral issues, Upper Darby Superintendent Daniel McGarry said. Officials saw a breakdown in students respecting the authority of teachers in the classroom.",
        "\"We had a lot of those things that we were facing and we´re still working our way through it; we´re in a much better place,\" McGarry said. \"I think our kids feel better. They´re not 100% better.\" But, he said, much of the social anxiety students felt after being in online school has dissipated.During the pandemic, soaring numbers of high school students expressed persistent feelings of sadness or hopelessness, with girls and LGBTQ+ youth reporting the highest levels of poor mental health and suicide attempts. It doesn't help that research suggests middle and high school students aren't getting enough sleep.\"These mental health challenges are already going to happen and then, with the absence of sleep, are much worse,\" said Orfeu Buxton, director of the Sleep, Health &amp; Society Collaboratory at Penn State University. \"The same with decision making, suicidal ideation, those kinds of things.\"The reasons why high schools start as early as they do - many begin their day before 7:30 a.m. - are \"lost to the sands of history,\" Buxton said. But now, he said, \"everything is baked into that: traffic light patterns, bus schedules and adults´ work.\"Nationally, at least nine states are considering legislation related to school start times, up from four the previous year, according to the National Conference on State Legislatures. California in 2019 became the first and only state to dictate school start times.",
        "Large school systems including Denver, Philadelphia and Anchorage, Alaska, have been looking into later start times.It can require innovation to forge a new schedule.At Upper Darby High, the school day technically still begins at 7:30 a.m., with students assigned coursework to be done remotely that ties into their lessons for the day. But they can use the early morning hours as they see fit - they can meet with teachers during office hours, sleep in or finish other homework. Ultimately, the work assigned for the early morning needs to be done, but when is up to students.\"I think getting more sleep is definitely helping,\" Elise Olmstead, a junior. \"I would be more irritable throughout the day, especially later, because I have a lot of after-school things. I would just have a harder time getting through the day.\"The school day still ends by 3 p.m.Fatima Afrani, a freshman, said that when she gets home, she´ll usually relax, then help her mom or do homework.\"If I´m tired I go to sleep, which was not something I was able to do last year. Last year I just had to get my homework done because there wasn´t an option of being able to do it later,\" she said. \"And so I liked that if I was tired, I could listen to my body and just let myself sleep.\"",
        "Principal Matthew Alloway said educators have noticed fewer students sleeping in class. The new schedule also has allowed \"kids to go to school for exactly what they need,\" he said. About 400 of the school´s 4,250 students attend only through virtual learning - an option it offered to compete with online schools.Critics have argued students have less instruction time in the new schedule. The original 80-minute periods have been shortened, but Alloway said that it´s not as if lectures always took up the full 80 minutes.\"It was sometimes a 60-minute concentrated instructional time. But then there was time to write. There was time to read. There was time to view a video,\" he said.Other challenges wrought by the pandemic - teacher shortages, for one - have also benefitted from the schedule change, administrators said. Teachers can take care of themselves and their families in the morning. Administrators have more time to replace staffers who call out sick.Doulat, the Upper Darby senior, said that even if students can´t see the effects every day, there´s been a big positive impact.\"It´s such little changes in our daily lives that we don´t notice it,\" he added. \"But they slowly start building up, and we actually see the difference within our own lives.\"",
        "___Brooke Schultz is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.___The Associated Press education team receives support from the Carnegie Corporation of New York. The AP is solely responsible for all content."
    ]
}