{
    "articleURL": "/news/article-12055963/Charles-Stanleys-grandson-grandfather-personal-belongings-RETURNED-sold-eBay.html",
    "content": [
        "Personal belongings of the late pastor Charles Stanley, which his grandson had attempted to sell on eBay, have been returned to the Stanley family Matt Brodersen, 29, faced backlash after trying to auction off his grandfather's engraved pocket watch, bearing the initials 'CFS' for 'Charles Frazier Stanley'An anonymous buyer purchased the items that included a framed portrait of the pastor and some coins only to return them to the family An anonymous buyer has returned the late pastor Charles Stanley's personal items to his family after his grandson, Matt Brodersen, attempted to sell them on eBay. ",
        "The auction included Stanley's engraved pocket watch, inscribed with 'CFS' (Charles Frazier Stanley), a framed portrait of the late pastor, and a collection of coins.The sale of the engraved pocket watch resulted in a winning bid of $2,375 after 63 bids - while a framed 13x13 painting received a final bid of $3,650 following 40 bids.Matt Brodersen, the 29-year-old son of Stanley's daughter, Becky, faced a major backlash after auctioning off the items just weeks following the death of the renowned pastor, author, and the founder of In Touch Ministries at the age of 90. Brodersen posted to YouTube how an anonymous buyer had purchased the pocket watch and returned it to the Stanley family. The buyer also called Brodersen to explain why it was important to keep such sentimental items within the family.",
        "'Apparently when he was younger and his grandfather died... his brother and cousin... immediately auctioned off his grandpa's things, which he did not like. So, he expressed, \"I wish my family had not auctioned off my grandpa's stuff. I would have liked to keep some of those things. I'm so glad I got to buy them and send them back to your family for you.\"''So that is when it really all sank in about how creepy or weird that was of me to do that,' he said on YouTube. ",
        "'When he told me his story, I just died inside,' he said. 'And I realized how selfish I was being, so I canceled the other eBay auction for the picture frame and the coin collection and I have mailed those back to my uncle. So technically, nothing has gotten sold on eBay. Everything is going back to its right property owners.' The conversation made Brodersen, who is an aspiring YouTuber, realize just how inappropriate his actions were. His account only has 6,000 followers.Brodersen's grandfather, Charles Stanley, built a large religious following during a 50-year career preaching from his Atlanta megachurch, while also publishing numerous books and lecturing on television and radio. Admitting that trawling through his grandfather's items was 'a little weird', Brodersen said he was holding on to a few items, including a 'cherished' passport. ",
        "Brodersen said he decided to remove the remainder of the items from the sale after speaking with the buyer of the pocket watch.Upon hearing the buyer's story, Brodersen said he felt a deep sense of remorse and canceled the eBay auction for the picture frame and coin collection returning them instead to his uncle.Brodersen revealed how following his grandfather's death, his mother had given him permission to take some of Stanley's belongings, but she had been referring to pictures on the wall. ",
        "Driven by financial desperation, he instead picked out items he could immediately sell on eBay when he went through his grandfather's desk.'I went to his desk with the intention of looking for things that I could specifically immediately sell on eBay because I was desperate for money,' he shared on YouTube. One of the items Brodersen tried to sell was a signed portrait of Stanley - which he said was something he would 'love for one of his fans to have', and that he would add a few 'bonus' possessions to whoever made the highest bid. ",
        "The extra items included Stanley's coin collection adorned with Jesus, George W. Bush and Donald Trump. The second item he decided to cash in on was an engraved pocket watch found inside Stanley's desk.'If you win this one, then I'm going to send you the rest of the watches I found in his desk,' added Brodersen, as he flashed several gold watches before the camera. 'These are not very nice watches, and there's nothing that special about them,' he admitted. 'But they were in his desk, and that's why I'm going to include them as bonus gifts.' He appeared fond of the time he got to share with his grandfather stating how he would provide words of encouragement, prayers, and constant support at his lowest moments.",
        "Brodersen apologized acknowledging his own mental health struggles and disconnect from reality. He also noted how he had trouble finding a job after becoming addicted to Adderall which had led to several firings.'I would like to apologize,' he said. 'This is just how crazy and a whack job I am. I did not even realize that this was going to make people upset. I have some issues, some mental health problems; I'm a little disconnected from reality.' In an earlier YouTube video, Brodersen opened up about his turbulent past, revealing his struggles with drug and alcohol addiction, as well as how he squandered his inheritance money. He highlighted the significant role his grandfather played in his life, providing words of encouragement, prayers, and constant support during his lowest moments.Brodersen sparked widespread outrage after posting the video, with many slamming his 'disrespectful' attempt at profiting off his grandfather's death. 'This is unreal. Wow. It’s called respect. Privacy. Integrity. And so much more,' said one fan.",
        "'After listening to Dr. Charles Stanley in person and through many other sources over 40 years he became my/our Pastor. Like a family member. In all the years listening to sermons and messages by him I don’t think he would be proud of what is happening right now.'",
        "'I couldn't even finish watching,' added another. 'The disrespect is a disgrace, not only to your family, but to our Heavenly Father!! So sad!'A third said: 'Very disturbing! I saw your grandfather as an anointed man of God who surrendered his life to God to do his will. 'I don't see him as a celebrity, I see him as my pastor and teacher. It sickens me to see this being done with his personal things and the selling point of it being in the room that he died is just disgusting.' Addressing the backlash to his eBay sale, Brodersen said: 'I promise you, I have a bunch of my grandpa's stuff that you don't see that I'm going to keep.''Why not let my grandpa's fans have a chance at winning two of his items that were in his office? The very office that he was sleeping in when he passed away.'I'm a human being with bills to pay, and you know how the economy is,' he added. 'So no, I don't really have shame in selling his stuff... and whoever wins is going to help me pay my bills, which I desperately need right now.' Brodersen again defended his decision on the eBay listing for the possessions, where he noted on the portrait painting: 'We got to go through his things and everybody got a bunch of his stuff.",
        "'I know that sounds awkward, but it's just what happens when people die. '(The painting) was hanging in the office of his home before he passed away, the office where he wrote all of his sermons and studied the Scripture. How long was it on that wall? I don't know. A treasure for a true fan out there that wants to celebrate his passing and have a signed picture of the holy pastor on their wall at home.'"
    ]
}