{
    "articleURL": "/tvshowbiz/article-12054149/Tamara-Ecclestone-daughter-Serena-two-joined-Paddington-bear-Coronation-party.html",
    "content": [
        "Tamara Ecclestone and her adorable daughter Serena were joined by a special guest as they threw a party to celebrate to Coronation of King Charles on Saturday. ",
        "The socialite, 38, held her the toddler, two, in her arms as they posed for a photo with Paddington bear at the bash. Sharing another snap to her Instagram Story, Serena could be seen flashing a smile as she showed off her cute Coronation-themed outfit, complete with a sequinned skirt. Tamara gave an insight into their fun day as they enjoyed Royal emblazoned cupcakes, a 'Long Live The King' sponge cake and bounced on a trampoline.She went makeup free for the party, pulling her dark hair back into a low pony tail to show off her flawless complexion. ",
        "The model opted for a casual outfit, wearing a pale blue sweater with a pair of distressed baggy jeans. Tamara shares Serena with her husband Jay Rutland, 42, as well as eldest daughter Sophia, nine. Sophia appeared to be having the time of hr life as she jumped on the trampoline, despite the rain. It comes after Tamara and her sister Petra shared a rare insight into their family life this week as they posted snaps from Sam Palmer's 40th birthday celebration.The family got together for a special meal to commemorate the milestone and later documented the dinner on their Instagram pages earlier this week.While some key members of the family were missing from the snap, many of the Ecclestone/Palmer clan gathered to celebrate Sam's big day.",
        "The family snap showed the group stood around Sam as he posed with his huge birthday cake, which featured an iced figurine of WWE wrestler The Undertaker.The cake was covered in family Polaroids and also hinted at Sam's favourite hobbie, which included football and golf. ",
        "Guests at the dinner included Tamara and her daughter Serena, who she held in her arms. However her husband Jay Rutland, 42, and their eldest daughter Sophia appeared to be absent.Meanwhile, Petra, 34, and Sam, 38, were joined by their daughter Minnie, three. Petra's children Lavinia, 10, and her twin boys Andrew and James, seven, from her marriage to James Stunt were also at the bash.Sat beside Sam was his smiling mother Sue, while his sister Louise also attended with her children.The family didn't hold back in their celebrations, as Sam revealed one of the rooms in his mansion had been lined with gold, silver and blue balloons."
    ]
}