{
    "articleURL": "/wires/ap/article-12053085/Jan-6-prosecutors-seek-25-years-Oath-Keepers-Rhodes.html",
    "content": [
        "The Justice Department is seeking 25 years in prison for Stewart Rhodes, the Oath Keepers founder convicted of seditious conspiracy for what prosecutors described as a violent plot to keep President Joe Biden out of the White House, prosecutors said in court papers filed Friday.",
        "A Washington, D.C., jury convicted Rhodes in November in one of the most consequential cases brought in the Jan. 6, 2021, attack on the U.S. Capitol, when a mob of then-President Donald Trump's supporters assaulted police officers, smashed windows and temporarily halted Congress´ certification of Biden´s victory.Prosecutors described the Oath Keepers' actions as \"terrorism,\" and told the judge that a harsh sentence is critical to deter future political violence. They wrote that Rhodes believes he has done nothing wrong and \"still presents a threat to American democracy and lives.\"\"Rhodes used his powers of persuasion and his platform as leader of the Oath Keepers to radicalize more than 20 other American citizens to oppose by force the authority of the government of the United States,\" prosecutors wrote in the nearly 200-page court filing. \"Those who have studied Rhodes and who know him best suggest that such behavior is completely in character and unlikely to change.\"Jurors found that Rhodes, of Granbury, Texas, plotted an armed rebellion with members of his far-right extremist group to stop the transfer of presidential power from Trump to Biden. In addition to seditious conspiracy, Rhodes was convicted of obstructing Congress´ certification of Biden´s victory. Both charges calls for up to 20 years in prison.Prosecutors asked the judge to go above the standard sentencing guidelines, arguing the crimes deserve a longer sentence for terrorism because the goal was to influence the government through intimidation or coercion.",
        "Prosecutors wrote that Rhodes, in media interviews behind bars, portrays himself as a victim of a politically motivated prosecution and \"continues to invoke the words and deeds of the Founding Fathers in not-so-veiled calls for violent opposition to the government.\"Rhodes is scheduled to be sentenced on May 25. As of Friday evening, Rhodes´ attorneys hadn´t yet filed papers indicating how much time they will ask the judge to impose. They have vowed to appeal his conviction.Prosecutors are seeking prison sentences ranging from 10 to 21 years for eight other Oath Keepers defendants convicted at trials. The Justice Department asked for 21 years behind bars for Kelly Meggs, the Florida chapter leader convicted of the sedition charge alongside Rhodes.Meggs' attorney urged the judge in court papers filed late Friday to sentence him to no more than 28 months, saying his client did not participate in any violence or destruction at the Capitol. Meggs' lawyer called what happened of Jan. 6 \"abhorrent,\" but said the events that day \"do not reflect Mr. Meggs´s true character, nor his respect for the law.\"\"Mr. Meggs undoubtedly accepts responsibility for his actions and has spent every day while detained regretting any involvement he had with the Oath Keepers and the events of January 6,\" his attorney wrote.",
        "The sentencing recommendations come a day after jurors in a different case convicted four leaders of another extremist group, the Proud Boys - including former national chairman Enrique Tarrio - of seditious conspiracy. The Proud Boys were accused of a separate plot to forcibly keep Trump in power after he lost the 2020 election.Rhodes, a Yale Law School graduate and former Army paratrooper, didn´t go inside the Capitol. Taking the witness stand at trial, he insisted there was no plan to attack the Capitol and said the Oath Keepers who did acted on their own. Rhodes said the Oath Keepers´ only mission that day was to provide security for Trump ally Roger Stone and other figures at events before the riot.Prosecutors built their case around dozens of encrypted messages and other communications in the weeks leading up to Jan. 6 that showed Rhodes rallying his followers to fight to defend Trump and warning they might need to \"rise up in insurrection\" to defeat Biden if Trump didn´t act.Hundreds of people have been convicted in the riot, but Rhodes and Meggs were the first Jan. 6 defendants convicted at trial of seditious conspiracy. Three other defendants on trial with them were acquitted of seditious conspiracy, but convicted of obstructing Congress. Another four Oath Keepers were convicted of the sedition charge during a second trial.",
        "\"These defendants were prepared to fight. Not for their country, but against it. In their own words, they were `willing to die´ in a `guerilla war´ to achieve their goal of halting the transfer of power after the 2020 Presidential Election,\" prosecutors wrote.Jurors in Rhodes´ case saw video of his followers wearing combat gear and shouldering their way through the crowd in military-style stack formation before forcing their way into the Capitol.Rhodes spent thousands of dollars on an AR-platform rifle, magazines, mounts, sights and other equipment on his way to Washington ahead of the riot, prosecutors told jurors. Prosecutors said Oath Keepers stashed weapons for \"quick reaction force\" teams prosecutors said were ready to get weapons into the city quickly if they were needed. The weapons were never deployed.The trial revealed new details about Rhodes´ efforts to pressure Trump to fight to stay in the White House in the weeks leading up to Jan. 6. Shortly after the election, in a group chat that included Stone, Rhodes wrote, \"So will you step up and push Trump to FINALLY take decisive action?\"Another man testified that after the riot, Rhodes tried to persuade him to pass along a message to Trump that urged the president not to give up his fight to hold onto power. The intermediary - a man who told jurors he had an indirect way to reach the president - recorded his meeting with Rhodes and went to the FBI instead of giving the message to Trump. During that meeting, Rhodes said they \"should have brought rifles\" on Jan. 6.",
        "____Associated Press reporter Michael Kunzelman in Washington contributed."
    ]
}