{
    "articleURL": "/news/article-12053441/Three-Nigerian-men-charged-Michigan-sextortion-plot-led-teen-Jordan-DeMays-death.html",
    "content": [
        "Jordan DeMay, a star Michigan high school athlete, committed suicide hours after a girl he had been communicating with online was revealed to be a fraudProsecutors say that three Nigerian scammers attempted extort DeMay of $1,000, promising to release nude images of him if he didn't comply Those experiencing suicidal thoughts can call the National Suicide Hotline: 1-800-273-8255 Three Nigerian men took part in a sextortion plot involving 17-year-old star athlete Jordan DeMay which resulted in the Michigan teenager taking his own life in 2022. ",
        "According to federal prosecutors, the scammers posed as a teenage girl on Instagram and convinced DeMay to send them sexually suggestive photos. They then compiled information on him and promised to release the pictures to his friends and family unless he paid them $1,000.Hours after the threat was made, DeMay, a student at Marquette Senior High School, died of a self-inflicted gunshot wound. Samuel Ogoshi, 22, Samson Ogoshi, 20, and Ezekiel Ejehem Robert, 19, all of Lagos, Nigeria, were charged this week in relation to DeMay's death. The tragedy prompted a major investigation involving authorities in Michigan and the FBI. 'All you’ve to do is to cooperate with me and I won’t expose you,' Ogoshi wrote to DeMay, the feds say. Despite forking over $300, the threats continued.",
        "The trio gained access to the hacked Instagram account of a woman named Dani.Roberts and used it to make contact with DeMay.  'I’m kms rn [kill myself right now]. Bc of you,' DeMay replied in one of the message.'Good. Do that fast. Or I'll make you do it. I swear to God,' the reply said. For his alleged direct role in contacting DeMay, Ogoshi is charged with sexual exploitation and attempted sexual exploitation of a minor resulting in death.If found guilty, he could face life in prison. ",
        "All three are charged with conspiracy to sexually exploit minors, conspiracy to distribute child pornography, and conspiracy to commit stalking through the internet.Those offenses carry a penalties of up to 30 years in prison.  In a statement following the announcement of the charges, DeMay's mother, Jennifer Buta, said: 'As parents, we cannot begin to imagine what Jordan went through that night and how scared he was because of this senseless act.'US Attorney for the Western District of Michigan Mark Totten said that more than 100 young men across the country had been targeted by the Nigerian gang. ",
        "Totten said that the three men are in the process of being extradited from Nigeria with the co-operation of local authorities. The investigation is continuing, the prosecutor said. A GoFundMe page has been set up in order to help to support the DeMay family. At the time of writing, the page has raised nearly $25,000. 'They told him they had all of his Facebook contacts, and more from other social media, as well as his nude photo,' Marquette County Sheriff Greg Zyburt told The Sun in March 2022.'Then they said they'd start to send the picture out. Jordan said he couldn't pay them any more money.'He said you win, and that he was going to kill himself, and they said go for it,' Sheriff Zyburt added.",
        "DeMay killed himself soon after the message was sent on 25 March.Zyburt, speaking about how the tragic suicide occurred just six hours after the blackmailers first contacted DeMay, said: 'The Twitter profile showed a beautiful picture of a girl.'Soon she sent Jordan a nude picture, then he sent a compromising picture back to her, then the conversation quickly changed, it became a situation of blackmail.'Zyburt said they had treated DeMay's death as a 'teenage suicide' at first but they soon changed their focus after one of the teenager's friends told police the blackmailers had contacted her as well and demanded money.'She told them he killed himself. They said GOOD, then she hung up and called the police,' Zyburt said.Following DeMay's tragic death, the FBI warned parents and caregivers of increasing incidents of sextortion among young children and teenagers.",
        "'Sextortion begins when an adult contacts a minor over any online platform used to meet and communicate, such as a game, app, or social media account,' the FBI said.'In a scheme that has recently become more prevalent, the predator (posing as a young girl) uses deception and manipulation to convince a young male, usually 14 to 17 years old, to engage in explicit activity over video, which is then secretly recorded by the predator.'",
        "'The predator then reveals that they have made the recordings and attempts to extort the victim for money to prevent them from being posted online.'An obituary dedicated to the teenager has described DeMay as someone who loved athletics and sports including baseball, football and basketball.'Jordan was a compassionate, mature, and team oriented player who once described his goal to \"be the best I can be as a person on and off the field\", the obit read.'He was a determined young man, who after being sidelined for a year with a serious knee injury, made a decision to rehab himself and made plans to attend college.'The teenager, who leaves behind four sisters, his parents and his grandparents, was planning to study Athletic Training at college.'Jordan possessed a great personality, loved and was very devoted to his family, especially his sisters who simply adored him,' the obituary read.'He enjoyed going to the beach, being in, on, or near the water, and was talented to the point of doing well on many of the things he attempted. He will be remembered for his great smile, fluffy hair, great personality, and ability to inspire others.'For confidential help, call the National Suicide Prevention Lifeline at 1-800-273-8255 or click here. "
    ]
}