{
    "articleURL": "/sport/football/article-12056553/Sheffield-Wednesday-1-0-Derby-Hosts-clinch-place-League-One-final-day-season.html",
    "content": [
        "Sheffield Wednesday have beaten Derby County on the final day of the seasonThe hosts went ahead on the stroke of half-time through Michael Smith's penaltyDerby played the second-half with 10 men after Curtis Davies was sent offCurtis Davies's first-half error cost Derby a play-off place on a heart-breaking final day that may have also seen his Rams career end in disappointing fashion.",
        "The last act of the 38-year-old's six seasons with the club may well prove to be his 40th-minute double blunder — conceding a penalty and collecting a red card — that gifted Wednesday Michael Smith's match-winning penalty.Defeat saw Paul Warne's side overtaken by Peterborough, winners a few miles away at Barnsley, when a draw would have been enough to clinch sixth.The manager said: 'Understandably Curtis is heartbroken. I haven't seen his face, he's been sat with his head in his hands since the end. 'He's been a brilliant player for this club, put his body on the line and you don't want this to happen to anyone, but certainly not your captain.",
        "Sheffield Wednesday (3-5-2): Dawson 7; Iorfa 7, Flint 7, Brown 6; Palmer 7 (Hunt 78, 5), Dele-Bashiru 7 (Durrant 84), Vaulks 6, Bannan 8 (Bakinson 78, 5), Johnson 6; M Smith 7 (Windass 64, 6), Paterson 6. Substitutes not used: Glover, Stockdale, James. Scorer: Smith pen 43Booked: Brown, Palmer, Johnson Derby County (3-4-2-1): Wildsmith 6; Forsyth 6, Davies 4, Cashin 6; Knight 6 (White 74, 5), Bird 5 (Dobbin 69, 5), Hourihane 7 (Collins 74, 5), Roberts 7; Mendez-Laing 6 (Barkhuizen 69, 5), Sibley 5 (K Smith 44, 5); McGoldrick 8. Substitutes not used: McGee, Rooney.Sent off: Davies 41Booked: Roberts, Smith Referee: L Doughty 7Attendance: 33,413 ",
        "'His future is a decision for me and him, but I feel for him as he's been brilliant since I came.'The key moment came on 40 minutes when Davies under-hit a backpass that was pounced on by Callum Paterson. Keeper Joe Wildsmith managed to snuff out that threat only for the ball to break to Marvin Johnson, who was promptly pushed over by Davies. To make matters worse, referee Lee Doughty showed Davies a straight red card for denying a goal-scoring chance, although Warne argued his case.He said: 'I thought the red was harsh because we had a player on the line and our keeper was the right side of it.'But, after Derby's Haydon Roberts was booked for throwing a water bottle to his keeper while Smith was waiting to take the penalty, the Wednesday striker cooly converted.Derby had made a strong start. David McGoldrick forced Cameron Dawson into a fine flying stop after 12 minutes and, moments after going behind, the same player almost lobbed Dawson, only for the keeper to make another fingertip stop.There was even a glimmer of hope on the hour when a rare Derby attack ended in Nathaniel Mendez-Laing squaring for Max Bird, but his shot lacked power and was cleared off the line by Aden Flint.",
        "Warne added: 'Seeing Sheffield Wednesday versus Peterborough on the scoreboard for the play-offs is hard to take. There are a lot of tears in the dressing room.'",
        "After 34 games, a 23-match unbeaten run saw Wednesday top of the table, three points clear of second-placed Plymouth with two games in hand.But a disastrous run of six without a win saw them passed by Argyle and Ipswich.Owls boss Darren Moore said: 'People were talking about resting players today but the focus was to drive on and keep the mentality.'"
    ]
}