{
    "articleURL": "/sport/afl/article-12061289/Truth-revealed-AFL-Gold-Coast-Suns-star-Matt-Rowells-bizarre-pre-game-grass-eating-habit.html",
    "content": [
        " Suns star eats grass before every AFL match AFL legend is surprised Rowell hasn't become ill Suns club is unhappy the clip has gone viralCameras caught Gold Coast Suns star Matt Rowell eating stadium grass in a bizarre pre-game ritual over the weekend - and the club isn't impressed that the strange clip has gone viral.",
        "Footage captured before the Suns match against the Demons showed the star midfielder get down on his haunches, grab a handful of the Heritage Bank Stadium turf and eat it.The moment made headlines around the country - and sports journalist Caroline Wilson has now revealed that it's far from a one-off for Rowell.'He does this at every single game, at every single ground across Australia,' she said on Nine's Footy Classified on Monday night.'So we think he's probably eaten grass at about 18 venues now. I'm not joking, that's his pre-game routine - he eats grass. It's an extraordinary thing.'",
        "'And I think the club is a bit disappointed that the vision came out - they were hoping it wasn't going to be released.'Former Port Adelaide star Kane Cornes said he was surprised that the Suns thought the footage could be kept quiet.'I feel like there's the potential to pile on and call it weird,' he said.'But for them to think that footage isn't going to come out, if he does it every game then that's a bit odd.'Essendon legend Matthew Lloyd admitted to having a few odd pre-game rituals himself - but he never snacked on turf.'It's very strange,' he said.'I'm surprised he hasn't got sick from it by now.'",
        "Footy fans on social media had a field day with the video as they commented on Rowell's weird habit.",
        "'Scientific fact that GOATs eat grass,' said one Reddit user, referring to the acronym for greatest of all time.'We already know the bloke lives and breathes footy, only makes sense he eats it too,' replied another.'Some eat grass, some smoke it. I'm not here to judge,' joked a third."
    ]
}