{
    "articleURL": "/wires/reuters/article-12044661/Biden-administration-OKs-boost-Chinese-airline-flights-US.html",
    "content": [
        "By David Shepardson",
        "WASHINGTON, May 3 (Reuters) - The United States will allow Chinese airlines to increase U.S. passenger services to 12 weekly round-trips, the Transportation Department (USDOT) said on Wednesday, equal to the number of flights Beijing has permitted for American carriers.It is a boost from the eight weekly round-trip flights currently allowed by Chinese carriers and matches what Beijing has permitted for U.S. carriers, but a small fraction of the more than 150 round-trip flights allowed by each side before restrictions were imposed in early 2020 due to the COVID-19 pandemic.USDOT's order said its goal was \"a gradual, broader reopening of the U.S.-China air services market.\" China in March reopened its borders to foreign tourists for the first time in the three years after abandoning COVID-related border controls for its own citizens in January.U.S. carriers American Airlines, Delta Air Lines , and United Airlines operate scheduled passenger services between the countries, as do Chinese operators Xiamen Airlines, Air China, China Southern Airlines and China Eastern Airlines.USDOT noted American began operating two additional roundtrip weekly flights to Shanghai from Texas in March after Chinese pandemic restrictions were dropped.USDOT said in its order that Chinese restrictions on air travel \"had, and continue to have, a devastating effect on the U.S.-China air transport market.\"",
        "U.S. airlines and other foreign carriers are barred from flying over Russia in retaliation for the United States banning Russia from flights over the U.S. in March 2022 after its invasion of Ukraine.In February, two key senators issued a letter urging the Biden administration to halt Chinese airlines and other non-American carriers from flying over Russia on U.S. routes, which gives them an advantage in fuel burn and flying time.Airlines for America, which represents major U.S. carriers, in February praised the senators' letter, noting it underscored longstanding industry concerns regarding Russian overflights that had disadvantaged American passenger and cargo carriers. (Reporting by David Shepardson; Editing by Sandra Maler and Jamie Freed)"
    ]
}