{
    "articleURL": "/news/article-12047641/Heart-stopping-moment-soldier-deploys-emergency-parachute-jump.html",
    "content": [
        "The US army recruit identified only as Josh from Airborne Division in Alaska The faulty parachute forced the young soldier to deploy a reserve parachute The terrifying moment happened in March during a parachute training exercise  This is the terrifying moment an Army recruit is forced to pull emergency back-up parachute after faulty gear refused to open hundreds of feet in the air during training in Alaska.",
        "The recruit identified only as Josh was in the midst of a parachute training exercise with fellow troops in the Airborne Division in Alaska in March when his parachute failed him.Footage shows dozens of soldiers gasping in horror from the sidelines as the recruit  struggles to open his parachute while in mid-air. 'Oh s**t you see that guy right there,' said one soldier.  Another panicked recruit placing his arms over his head said: 'OMG!' The heart stopping incident went on for seconds until loud cheers suddenly broke  out as the young soldier is seen landing safely on the ground.",
        "It was a close call for the rookie as he had to free fall until he was able to deploy his reserve parachute moments before hitting the ground that fortunately had a good outcome.On April 27, two military helicopters crashed in Alaska near Fairbanks where three soldiers were killed in the mid-air collision. The fourth soldier survived, according to John Pennell, a spokesperson for the US Army Alaska.The tragedy happened when two AH-64 Apache aircrafts were returning to Fort Wainwright from an aerial gunnery rang in the Donnelly Training Area southeast of Fairbanks.The helicopers were over rugged mountainous terrain that was steep and heavily wooded and deep in snow, Pennell said.",
        "The accident happened about 50 miles east of Healy, Alaska. The cause of the crash remains unknown and is under investigation.The spokesperson said the helicopters were flying at about 6,000 feet Mean Sea Level and there were no weather or visual constraints known at the time of the collision. The soldiers killed were Chief Warrant Officer 3 Christopher Robert Eramo, 39, of Oneonta, New York; Chief Warrant Officer 2 Kyle D. McKenna, 28, of Colorado Springs, Colorado; and Warrant Officer 1 Stewart Duane Wayment, 32, of North Logan, Utah.",
        "The fourth soldier survived the crash and was listed in stable condition, according to the spokesperson.On Monday, the aircrafts black boxes and other sensitive items were recovered by a team of investigators from the Army Combat Readiness Center, Fort Novosel, Alabama. The recovered items were returned to Fort Wainwright for further investigation, as per a report.'The battalion is devastated and mourning the loss of three of our best,' said Lt. Col. Matthew C. Carlsen, the 1-25th AB commander, Fox News reported. 'Our loss, however, cannot be compared to the suffering and loss which the family members of Chief Warrant Officer 3 Chris Eramo, Chief Warrant Officer 2 Kyle McKenna and Warrant Officer 1 Stewart 'Stew' Wayment are experiencing.'A private memorial ceremony for the soldiers and their families took place on Thursday at Fort Wainwright.  "
    ]
}