{
    "articleURL": "/wires/reuters/article-12042131/Baghdad-KRG-reach-deal-resume-oil-exports-Iraqi-oil-minister.html",
    "content": [
        "Iraq-Turkey pipeline has been shut for 40 days",
        "Iraq expects agreement with the KRG within two weeks -ministerAgreement faces setbacks related to a bank account, sources sayTraders have received SOMO contracts, sources sayBy Amina Ismail, Rowena Edwards and Julia PayneMay 3 (Reuters) - Iraq expects to reach an agreement with the Kurdistan Regional Government (KRG) to restart oil export flows from the country's semi-autonomous Kurdistan region within two weeks, Oil Minister Hayan Abdel-Ghani said at a conference in Baghdad on Wednesday.Turkey halted Iraq's 450,000 barrels per day (bpd) of northern exports through the Iraq-Turkey pipeline on March 25 after an arbitration ruling by the International Chamber of Commerce (ICC). The 40 days of stoppage are estimated to have cost the KRG more than $1 billion.The ICC ordered Turkey to pay Baghdad damages of $1.5 billion for unauthorised exports by the KRG between 2014 and 2018. The Iraq-Turkey pipeline had been exporting about 75,000 bpd of federal crude, with the remainder from the KRG.Baghdad and the KRG signed a temporary agreement on April 4 to restart northern oil exports.But efforts to restart flows face further setbacks as the two governments iron out several aspects of the deal.\"We haven't reached an agreement with the Kurdish side,\" the Iraqi minister said on Wednesday.",
        "The KRG had agreed for Iraq's state-owned crude marketing company SOMO to market its crude and, under the agreement on April 4, KRG oil revenues will be deposited in a bank account under control of the KRG, which Baghdad can access to audit, sources previously said.Disagreements persist surrounding the logistics of the bank account.Iraq's central bank has approved use of a KRG bank account with Citi in the United Arab Emirates for the SOMO oil sales, as well as sale of KRG oil, three sources familiar with the matter told Reuters.However, politicians in Baghdad are raising questions about the account, whose location has drawn opposition from some members of the Coordination Framework, an alliance of Iran-aligned factions, one of those sources - and two others - said.No bank account has been opened, Abdel-Ghani said on Wednesday.Citi did not immediately respond to a request for comment.\"The issue (of reaching an agreement) is not technical it's political,\" an industry source said.Iraq and the KRG have made progress in other areas.Traders buying crude from the Kurdistan region have received contracts from SOMO for a proposed period of up to three months, according to two industry sources with direct knowledge of the matter.But the mechanism to repay trader debts has yet to be resolved, those sources added.",
        "The KRG did not immediately respond to a request for comment.There is further uncertainty surrounding the reaction of the Turkish government, which needs to open its side of the pipeline in order for Iraq's exports to resume.Previously, sources told Reuters Turkey was seeking in-person negotiations with Baghdad relating to damages it was ordered to pay in the arbitration case.Turkey also wants to resolve a second arbitration case regarding unauthorised flows since 2018 before it restarts them, the sources said. Turkey's presidential elections on May 14 may cause further delays, two sources said on Wednesday.The Turkish Energy Ministry did not immediately respond to a comment request.Lost revenue from the halt for the KRG stands at over $1 billion, according to Reuters estimates based on exports of 375,000 barrels per day, the KRG's historic discount against Brent crude and 40 days of outages.\"The loss of this critical source of income is inflicting immeasurable damage on the Kurdistan economy and its oil and gas industry,\" the Association of the Petroleum Industry of Kurdistan (APIKUR) said in a statement on Wednesday.APIKUR's members include international oil and gas companies that have a direct or indirect interest in upstream oil or gas contracts in Iraq's Kurdistan region.Many of these firms have been forced to stop production in the region as a result of the pipeline closure. (Reporting by Amina Ismail and Timour Azhari in Baghdad, Rowena Edwards in London, Julia Payne in Brussels, and Maha El Dahan in Dubai Additional reporting by Can Sezer in Istanbul Editing by Kirsten Donovan, David Gregorio and Mark Potter)"
    ]
}