{
    "articleURL": "/wires/ap/article-12046177/Rangers-dealing-disappointment-heading-offseason.html",
    "content": [
        "The New York Rangers are still dealing with disappointment as they head into the offseason after a first-round exit from the playoffs.",
        "After a run to the Eastern Conference final last year, there were high expectations coming into this season. The Rangers finished third in the Metropolitan Division after topping 100 points for the second straight year.They won the first two games on the road against New Jersey before losing three straight to fall to the brink of elimination before winning Game 6 at home to extend the series. A 4-0 loss in Game 7 - the second shutout in three games - ended the season.\"It stings. (An) empty feeling, a little bit disbelief still,\" forward Chris Kreider said at the team's practice facility in Tarrytown, New York. \"We went as far as we possibly could last year. We were on our last legs when we lost in Game 6 to Tampa (Bay), we had a lot of injuries. We poured everything out. Just felt like we had more hockey in us this year. ...\"It´s up to us to take it and use it as fuel and come back and be a lot better next year.\"The Rangers were built to win now, especially after midseason trades that saw them add veteran forwards Patrick Kane and Vladimir Tarasenko, as well as fourth-liner Travis Motte. However, Tarasenko had three goals and an assist, Kane added a goal and five assists and Motte was scoreless against the Devils. The energetic third line of youngsters Kaapo Kakko, Filip Chytil and Alexis Lafrenière, which provided a big scoring boost in last year's run, combined for only two goals and four assists.",
        "Kreider led the way with six goals - including five on the power play - and three assists. He and Tarasenko were the only two to score more than one goal. Mika Zibanejad followed up career-high 91 point season (39 goals, 52 assists) with one goal and three assists in the series. Leading scorer Artemi Panarin (92 points) was held to two assists.\"I think we learned a lot last year, and I think we definitely will learn a lot from this year,\" Zibanejad said. \"It´s just when the expectations are what they are, and I´m not even talking about media or everyone else around us, but in terms of the guys here in the locker room and what we feel like what we had and not being able to meet that, this one stinks.\"The Rangers scored five goals in each of their three wins against the Devils, but combined for four goals in their four losses.Goalie Igor Shesterkin had a strong follow-up to his Vezina Trophy-winning season a year ago, going 37-13-8 with three shutouts, a 2.48 goals-against average and .916 save-percentage. He was even better in the series against New Jersey, finishing with a 1.96 GAA and .931 save-percentage.The Rangers now head into the summer with questions about the team makeup, decisions on free agents, and possibly the status of coach Gerard Gallant.",
        "GALLANT'S JOB SECURITYThe coach was miffed about reports suggesting the Rangers were mulling a coaching change after their playoff performance.The Rangers finished with 110 points last season to finish second in the Metropolitan, and followed that up with 107 points this season.\"We had a great first season, we lost to the Stanley Cup defending champions in the semifinals,\" Gallant said. \"This year we lost in the first round. So did I have a tough two weeks, did we have a tough two weeks? Yeah. But besides that, I can´t believe I have to answer some of these questions about me getting let go or getting fired.\"Gallant was fired by Florida 22 games into the 2016-17 season, months after leading the Panthers to an Atlantic Division title and a first-round exit in the playoffs. He guided expansion Vegas to the Stanley Cup Final in its inaugural season and a first-round exit the following year before he was let go 49 games into the 2019-20 season.FREE AGENTSThe Rangers have five unrestricted free agents - led by midseason acquisitions Kane (five goals, seven assists in 19 games in New York), Tarasenko (eight goals 13 assists in 31 games), Motte (five goals, five assists in 24 games) and defenseman Niko Mikkola. Backup goalie Jaroslav Halak is also on the list after going 10-9-5 with a 2.72 GAA behind Shesterkin.",
        "The 34-year-old Kane is unsure of his status for next season, though he revealed he had an injury that might need offseason surgery. Tarasenko wants to return and Motte - acquired at the deadline in each of the last two seasons - also hopes to stick around this time.Also, Lafrenière (16 goals and career-highs of 23 assists and 39 points) and defenseman K'Andre Miller are key restricted free agents.___Follow Vin Cherwoo at http://www.twitter.com/VinCherwooAP___AP NHL: https://apnews.com/hub/NHL and https://twitter.com/AP_Sports"
    ]
}