{
    "articleURL": "/sport/football/article-12041277/Chelseas-rabble-no-obvious-structure-Mikel-Arteta-faces-defensive-dilemma-Arsenal.html",
    "content": [
        "Arsenal dismantled a rabble of a Chelsea side 3-1 on Tuesday evening Gunners pattern of play is formulaic but shambolic Blues did not learn lessonContrast in consistency of selection for Arsenal and Chelsea is also stark  It says everything about the current state of both Chelsea and Arsenal that the first two goals on Tuesday night were virtually identical. ",
        "Neat interplay down Arsenal’s left led to Granit Xhaka firing a low ball across the box. All the way to Martin Odegaard, who was waiting to sweep it home.Borderline comical. But perhaps unsurprising. Arsenal’s patterns of build-up play have become so formulaic and defined that they often score similar goals.Chelsea, meanwhile, have become so shambolic that is it any wonder they failed to learn their lessons?Some people wondered aloud at the end of this game whether there is currently a worse team in the Premier League. Certainly bottom side Southampton looked a more cohesive, dangerous side as they drew at the Emirates last month.",
        "A scout from another leading Premier League side could see the contrast of this London derby coming a mile off.He was on his way to watch Arsenal and had been struck by their clear identity.He had just watched Chelsea and seen 11 individuals playing off the cuff with no discernible structure or patterns.That was particularly evident in the first half against Arsenal, when time and again, promising Chelsea moves broke down because of crossed wires.Thiago Silva looked ready to pop, so frustrated was he with the lack of cohesion between Chelsea’s back four. Can you blame him? At one point, Gabriel Jesus was allowed to chest the ball down near Chelsea’s six-yard box. ",
        "A few minutes earlier, Raheem Sterling had simply allowed Odegaard to run off him for Arsenal’s second goal.It was sobering to see how a collection of fine players, so expensively assembled, can be reduced to such a rabble.",
        "Mr. Consistency Arteta may need to shuffle the pack No Premier League team has made more starting XI changes this season than Chelsea (118). No one has made fewer than Arsenal.Almost all of their 34 changes have been injury-enforced. Only once before has Mikel Arteta made three for the same game, all out of choice.This was win or bust for their title hopes, the manager later admitted. But, still, there were no few raised eyebrows when the teamsheets landed. Jakub Kiwior came in for his first Premier League start in place of Rob Holding, Thomas Partey dropped out as Jorginho anchored midfield and Leandro Trossard was preferred to Gabriel Martinelli.By the end, however, all three new faces had given Arteta something to ponder ahead of Sunday’s huge trip to Newcastle. Trossard, as he has since arriving from Brighton, slotted straight in, offering guile and invention across the front line.",
        "Partey’s drop-off has been stark in recent weeks and this performance – of control and calmness and intelligence – was one of Jorginho’s best since joining Arsenal. Kiwior, meanwhile, looked raw – and rash at times – but he kept Pierre-Emerick Aubameyang out of the game and played his role in a vital victory.",
        "It will be fascinating to see how Arteta now approaches selection for St James’ Park. The manager has been fiercely loyal to the players who have dragged Arsenal here. So history suggests that both Martinelli and Partey will certainly come back in.But should circumstance force a change of tack? Does this performance, and the displays of recent weeks, suggest Arsenal need to shuffle their pack?The Gunners' defensive dilemma By full-time at the Emirates, Arsenal’s back four - from right to left – looked like this: Ben White, Kiwior, Holding, Kieran Tierney.William Saliba was standing on the sidelines, waiting to greet his team-mates, while Gabriel had been forced off following several injury scares.Both are now doubts for Sunday’s trip to Newcastle. Saliba and Gabriel started every one of Arsenal’s Premier League matches until the Frenchman tweaked his back against Sporting.Gabriel has started every game since, too.Now, though, Arteta faces his first real defensive dilemma. Should both first-choice centre-backs miss out, and with Arsenal’s titles hopes resting on the result at St James’ Park, what are his options?",
        "Normally, the manager prefers to make as few positional changes as possible, which would suggest White and Oleksandr Zinchenko will remain at full back.But that leaves a centre back partnership of Holding and Kiwior. Holding deputised well until he met Erling Haaland at the Etihad, while Poland international Kiwior has not looked convincing since joining in January. ",
        "There is already a feeling within Arsenal’s defensive unit that they are conceding too many goals.Perhaps now, then, is the time to move White back inside. The injury to Takehiro Tomiyasu is surely one reason why Arteta has resisted this move already.But without either Gabriel or Saliba, his hand might be forced.Partey was given a brief stint at right back against Crystal Palace. The Ghanaian has played there before, too. He might have to do so again at St James’."
    ]
}