{
    "articleURL": "/wires/ap/article-12046517/Waymo-robotaxis-make-inroads-Phoenix-San-Francisco.html",
    "content": [
        "Self-driving car pioneer Waymo announced Thursday that its robotaxis will be able to carry passengers through most of the Phoenix area for the first time.",
        "The company's cars will also start to pick up more volunteers for testing the autonomous vehicles traversing the more challenging conditions in San Francisco.The expansion marks the next leg in an ambitious journey aimed at creating a safer and cheaper alternative to ride-hailing services that depend on humans.The increased territory in the Phoenix area means Waymo's robotaxis will now pick up and drop off fare-paying passengers in an area spanning 180 square miles (466 square kilometers), doubling in size since late last year. Waymo's robotaxis now cover four times more territory than when they began giving rides to fare-paying passengers in the Phoenix area in late 2020.\"We are feeling tremendous wind at our backs,\" Saswat Panigrahi, Waymo's chief product officer, said in a briefing with reporters.Waymo, which began as a secret project within Google more than a decade ago, is now hoping to carry that momentum into San Francisco, one of the most densely populated cities U.S. that is also renowned for hilly roads and frequent fog that can flummox driverless vehicles.",
        "Although Waymo has encountered problems both with San Francisco's weather and unexpected stops that have blocked traffic, it's continuing to test its robotaxis throughout the city at all times of the day by providing free rides to its employees and volunteers selected from a waiting list to try the service.",
        "\"There are clearly additional learnings that we are responding to,\" Panigrahi said of the various problems that Waymo has encountered in San Francisco.The Mountain View, California, company is seeking approval from California regulators so its robotaxis can start charging fares for rides - something Cruise, a rival driverless service owned by General Motors, has been doing since last June, but only in parts of San Francisco during nighttime hours.Cruise also recently began giving free rides through most of San Francisco around the clock to volunteer passengers while waiting for state regulators to approve its application to collect fares for service anywhere in the city.If and when Waymo and Cruise get regulatory approval, San Francisco will become the first U.S. city with two commercial robotaxi services competing against ride-hailing pioneers Uber and Lyft, as well as traditional taxis with humans behind the wheel.As part of Thursday's announcement, Waymo said its robotaxis are providing an average of 10,000 weekly rides with no humans inside the vehicles other than passengers. Panigrahi said he expects Waymo's robotaxi fleet to be giving 100,000 weekly rides by the summer of 2024."
    ]
}