{
    "articleURL": "/wires/ap/article-12043025/Going-green-Nel-Hydrogen-build-Michigan-work-GM.html",
    "content": [
        "The green hydrogen company Nel announced plans Wednesday to build a massive new plant in Michigan as it works with General Motors to drive down the cost of hydrogen.",
        "The Norwegian company makes devices that take water and split it into hydrogen and oxygen, known as electrolyzers, as well as fueling stations. CEO Håkon Volldal said the company will make electrolyzers in the Detroit area to supply up to 4 gigawatts´ worth of hydrogen each year, making it among the largest such factories in the world.Nel looked at every state, but picked the longtime home of the American automotive industry for its new \"gigafactory\" to be near General Motors. Michigan also offered attractive financial incentives, partnerships with universities and training programs, and strong support from the governor´s office, Volldal said. Getting the plant up and running will take an estimated $350 million.Michigan Gov. Gretchen Whitmer called the new Nel plant a \"phenomenal opportunity.\" She said cleaner, alternative sources of energy improve the quality of people's lives and create good-paying jobs.Nel, which was founded nearly a century ago, is also doubling its manufacturing plant in Herøya, Norway, from 500 megawatts to 1 gigawatt, and expanding the one in Wallingford, Connecticut from 50 megawatts to 500. It's getting large orders from the United States and Volldal expects more. The Inflation Reduction Act offers a sizeable tax credit for producing green hydrogen, as an incentive to replace fossil fuels in heavy manufacturing. There are also plans to use hydrogen in power generation and transport to reduce carbon dioxide emissions.",
        "\"Hydrogen is not just hope anymore. It´s reality,\" Volldal said. \"And I think we, as an industry, are being seen as part of the solution, not just some kind of funky laboratory technology.\"",
        "Nel and General Motors announced in November that they would work together to make electrolyzers more efficient and less expensive. One problem with trying to drop in clean hydrogen as a substitute fuel is the vast amounts of renewable electricity it takes to split the water. The idea is that if they can drive down these costs, Nel can grow its business, and GM and its customers will have the green hydrogen they need. GM is developing and commercializing hydrogen fuel cells for large vehicles and for power generation. Fuel cell vehicles are electric vehicles that instead of relying on lithium ion batteries, depend on the chemical energy of hydrogen.Charles Freese V, executive director of General Motors' Hydrotec business, said having Nel nearby will make it easier to share technology, people and resources, which should mean fewer challenges and faster progress.Hydrogen that is produced using electricity from a grid powered by renewable energy, such as wind and solar, can cost about $5 per kilogram, according to the U.S. Department of Energy. That's driven largely by the cost of electricity so it can vary widely by location. Most hydrogen today is not this type and does contribute to climate change because it is made from natural gas. It costs far less, about $1 to $2 per kilogram to produce. The DOE set a goal to reduce the cost of clean hydrogen to $1 per kilogram in a decade.",
        "Energy Secretary Jennifer Granholm said her agency has advanced the technology at the heart of Nel for nearly two decades. The DOE awarded over $35 million to an electrolyzer developer in Wallingford that was acquired by Nel in 2017. The grants paid for research, innovation and demonstration projects to take the technology from the laboratory to megawatt-scale.\"We are proud to see the impact in manufacturing, job creation and clean energy on the grid with products stamped `Made in the U.S.A.´, and in this case, `Made in Michigan,´\" Granholm said in a statement Wednesday.Whitmer visited Norway in January to meet with Nel executives. Michigan is working with neighboring states to be part of a federal plan that will create regional networks, or \"hubs,\" of hydrogen producers, consumers and infrastructure. It has also become a top state for electric vehicle and battery investments.\"We understand how crucial innovation is when it comes to energy independence and clean energy, in particular with all the climate pressures the globe is confronting,\" Whitmer said in an interview. \"We want to focus on solving the world´s problems.\"Volldal expects to create more than 500 jobs in Michigan, depending on the level of automation, as the plant is built in phases. The one in Norway is fully automated. Manufacturing could begin in 2025 or 2026.",
        "____Associated Press climate and environmental coverage receives support from several private foundations. See more about AP´s climate initiative here. The AP is solely responsible for all content."
    ]
}