{
    "articleURL": "/wires/ap/article-12040787/German-police-clamp-Italian-mob-raids-arrests.html",
    "content": [
        "BERLIN (AP) - Police across Europe arrested dozens of people, raided homes and seized millions of euros in assets on Wednesday, in a coordinated crackdown on Italy´s ´ndrangheta organized crime syndicate, one of the world´s most powerful, extensive and wealthy drug-trafficking groups.",
        "The operation, coordinated by European Union judicial cooperation agency Eurojust, aimed to dismantle a network that includes the n'drangheta, Colombian drug producers and paramilitary groups, and moves tons of cocaine to Europe and Australia each year.The investigation uncovered how these networks used ports in Ecuador, Panama and Brazil to ship the Colombian drugs to northern European ports while also dealing in weapons. The drug proceeds were then laundered through restaurants, ice cream shops and car washes, and money sent back to Colombian drug producers via a Chinese wire transfer service, according to Italian officials and a Carabinieri press release.\"With today´s coordinated measures across Europe, law enforcement authorities have dealt a serious blow to the ´ndrangheta,\" German Interior Minister Nancy Faeser said. \"Today´s raids are one of the largest operations to date in the fight against Italian organized crime.\"In Italy, Carabinieri police backed by helicopters said arrest warrants were served on 108 people, who were accused of mafia association; possession, production, and trafficking of drugs and weapons; money laundering; and other crimes.One of the key figures in the network was a former powerful boss, Rocco Morabito, who was arrested in 2021 in Brazil after nearly 20 years as a fugitive. The investigation also confirmed the enduring strength of a handful of well-known ´ndrangheta clans that operate in the Calabrian town of San Luca.",
        "In Germany, more than 1,000 officers searched dozens of homes, offices and stores in the states of Bavaria, North Rhine-Westphalia, Rhineland-Palatinate and Thuringia, prosecutors said in a joint statement. Over 30 suspects who had outstanding warrants were arrested.In addition to Italy and Germany, arrest warrants were also served in Belgium, France, Portugal, Romania and Spain, while raids were also conducted in Slovenia.Portugal´s Judiciary Police said its officers had arrested a 62-year-old Italian man on charges of criminal association, money laundering, and drug trafficking as part of the European operation, which was dubbed \"Eureka.\" They also seized about half a million euros and various documents, among other confiscated items.European authorities have been waging a campaign against the Calabria-based ´ndrangheta in recent years, as the group has eclipsed the Sicilian Mafia as the key mover of tens of billion euros in cocaine in recent decades moving from South America to Europe.At a press conference in the Calabrian capital Reggio Calabria, officials estimated the operation had resulted in the seizure of 23 tons of cocaine over years of investigation, which deprived the ´ndrangheta of some 2.5 billion euros ($2.8 billion) in drug revenue. In addition, they announced that assets worth 25 million euros were seized.Margaritis Schinas, vice president of the EU's executive commission, said the operation \"delivered a lightning strike, as was the name of the operation, against the ´ndrangheta organized crime syndicate ... with over 100 arrests.\"",
        "In Germany, the main focus of the operation was in North Rhine-Westphalia and Rhineland-Palatinate, with around 500 officers deployed in each state. In North Rhine-Westphalia, 51 houses, apartments, offices and business premises were searched and 15 suspects were arrested.The ´ndrangheta has been firmly established in Germany since the 1970s. It is considered the strongest of the Italian organized crime groups in the country, and is mainly focused on international narcotics trafficking, according to the German Federal Office of Criminal Investigation."
    ]
}