{
    "articleURL": "/wires/ap/article-12047449/Bud-Light-boosts-spending-US-counter-sales-declines.html",
    "content": [
        "Bud Light's parent company said Thursday it will triple its marketing spending in the U.S. this summer as it tries to boost sales that plummeted after the brand partnered with a transgender influencer.",
        "But Anheuser-Busch InBev CEO Michel Doukeris also downplayed the impact of the backlash, saying Bud Light's U.S. sales declines in the first three weeks of April represented only 1% of InBev's global volumes. Doukeris also said the company sees signs that Bud Light demand is stabilizing.\"We believe we have the experience, the resources and the partners to manage this,\" Doukeris said during a conference call with investors Thursday.On April 1, transgender influencer Dylan Mulvaney posted a video of herself cracking open a Bud Light on her Instagram page. She showed off a can with her face on it that Bud Light sent her - one of many corporate freebies she gets and shares with her millions of followers.Three days after Mulvaney´s post, Kid Rock posted a video of himself shooting cases of Bud Light. InBev shares temporarily plunged. Within weeks, two marketing executives at Anheuser-Busch __ InBev´s U.S. subsidiary - took a leave of absence.It is unclear if those executives have returned. A message seeking comment from Anheuser-Busch was left Thursday.",
        "Doukeris didn't reveal updated sales figures Thursday. But in the week ending April 22, Bud Light´s U.S. sales dropped 21% compared to the same week a year ago, with rivals Miller Lite and Coors Lite appearing to pick up those sales, according to Bump Williams Consulting. Bud Light's U.S. sales are down 3% so far this year.",
        "Doukeris didn't mention Mulvaney on Thursday's investor call but decried misinformation about the promotion. Cans featuring Mulvaney weren't made to be sold to the general public, for example.\"This was one can, one influencer, one post and not a campaign,\" he said.After several weeks of silence on social media, Mulvaney posted a video to her Instagram page this week thanking supporters but also not mentioning Bud Light by name.\"What I'm struggling to understand is the need to dehumanize and to be cruel. I don't think that's right,\" she said. \"I'm just going to go ahead and trust that the people who know me and my heart won't listen to that noise.\"Doukeris said InBev is providing financial support to delivery drivers, sales representatives, wholesalers and others who are struggling with Bud Light's sales declines. He didn't say how much the company is spending.InBev said Thursday its revenue increased 13% to $14 billion in the first quarter of this year. Global sales volumes were up 1% thanks to strong demand in Asia.While those sales beat analysts' forecasts, the Belgium-based company didn't upgrade its full-year earnings, saying it's too early to predict the ups and downs in various markets this year.Doukeris said InBev will reallocate resources from other markets to support U.S. marketing this summer, with a focus on sports and music festivals. He noted that Bud Light was a sponsor of the recent NFL Draft.",
        "\"\"Everything we do should be about beer and should promote beer. It is an essential part of life´s meaningful moments, whether in sports, music or celebrations,\" he said.Doukeris said the company needs to better understand the social media landscape and how big brands that want to reach a lot of different kinds of customers might face situations like this one.\"We will always be at the table when important topics are debated, but the beer itself should not be the focus of the debate,\" he said."
    ]
}