{
    "articleURL": "/wires/pa/article-12059869/Dave-Challinor-urges-Stockport-embrace-play-offs.html",
    "content": [
        "Manager Dave Challinor has challenged Stockport to take their impressive form into the play-offs after missing out on an automatic promotion spot with a 1-1 draw against Hartlepool.",
        "County needed to win and hope Northampton didn’t if they were to overtake them but they will now have to face Salford in the post-season.Callum Cooke’s second-half strike cancelled out Callum Camps’ penalty to give relegated Hartlepool a point, with the latter also having a stoppage-time spot-kick saved by Ben Killip.Challinor, whose side are unbeaten since February, said: “In terms of the amount of chances we created and the amount of shots we had on goal, that’s probably the most we’ve had all season, which is really positive.“We’ve not played that well but still created plenty of chances and that will be important going into the play-offs where those moments are few and far between.“What I can’t complain about is how much we’ve hit the target, their keeper has made some brilliant saves and got them a point.",
        "“We’re on a brilliant run, we have to make sure that continues into the play-offs. If we do we’ll have a really good chance of progressing.“But the four teams are really well matched, four really good teams who are there on merit – it’s the toss of a coin how it will turn out.“The play-offs are certainly the best way to go up but they’re also the worst way for your season to end. The jeopardy throughout a league season is always there, in the play-offs it’s enhanced tenfold.",
        "“I’m looking forward to it because they’re moments you want to be involved in, we have to embrace it.“We’ve got to win three football matches to get out of this division and if we’d been offered that at the start we’d have taken it.”Hartlepool’s relegation had already been sealed but, thanks to Killip in his first game since January, they at least finished with a draw.Killip couldn’t save Camps’ first-half penalty but his string of fine saves was completed by a stop from the midfielder’s second spot-kick of the afternoon deep into stoppage time.Manager John Askey’s thought are already on rebuilding the Pools squad for a tilt at the National League title he won as Macclesfield boss in 2018.He said: “As daft as it sounds because we’ve gone down, I’m pleased we’ve come here and got a point.“Coming here we knew the situation and I was hoping the players would put on a performance for the supporters – and they did that. I couldn’t ask any more of them in a difficult situation to be in.“It wasn’t easy for Ben to come in and play like that but you couldn’t ask any more from a goalkeeper, he made some tremendous saves, he’s shown what a good goalkeeper he is.",
        "“Obviously it was still a little bit flat but we’ve got to forget this season and move on to the next one.“It’s an important time for us now, we need to recruit well and get players in that will suit the way we want to play. There are one or two going, one or two who we’ll try to move on as well.“We need more athleticism in the team, we need more pace and it’s up to us to try to get those players.“We can’t have a massive overhaul but where we can we’ll try to bring in better players and I’ll be doing my best to try to get a winning team together.”"
    ]
}