{
    "articleURL": "/wires/reuters/article-12050557/Hong-Kong-police-seize-statue-incitement-subversion-probe.html",
    "content": [
        "By Jessie Pang",
        "HONG KONG, May 5 (Reuters) - Hong Kong police seized an exhibit on Friday in connection with what they said was an attempt to incite subversion, with media reporting it was a statue commemorating Beijing's Tiananmen Square crackdown on democracy protesters in 1989.Media reported the exhibit was the Pillar of Shame, an eight-metre tall statue depicting dozens of torn and twisted bodies that commemorates protesters killed in the crackdown in and around Tiananmen Square more than three decades ago.Police did not give details of the exhibit that they said they had seized in the Yuen Long district of the former British colony.\"The National Security Department ... conducted searches with a warrant this morning. An exhibit related to an 'incitement to subversion' case was seized,\" police said in a statement.They did not say who was suspected of wanting to use the statue, which was being kept in storage, to incite subversion.The seizure comes weeks ahead of the June 4 anniversary of the Tiananmen Square crackdown.Hong Kong had traditionally held the largest annual vigils in the world to commemorate the crackdown.The crackdown is taboo in the rest of China and Hong Kong's vigil, traditionally in a city park, was banned beginning in 2020, ostensibly because of coronavirus restrictions.",
        "The two-tonne copper Pillar of Shame was first exhibited at a Tiananmen Square commemoration in Hong Kong in 1997, the same year Britain handed the city back to China.In 2021, the University of Hong Kong dismantled and removed the statue \"based on external legal advice and risk assessment for the best interest of the university\". It has since been kept in a cargo container on university-owned land.Danish sculptor Jens Galschiot, who created the work, said he had not been informed about its seizure by police.\"This is outrageous. This is my sculpture and nobody has consulted or informed me about anything,\" he said in email response to Reuters.It is not clear if the Tiananmen Square vigil will take place this year.The city government said this week sections of Victoria Park, where the rally is usually held, would be closed for maintenance.The vigil organiser, the Hong Kong Alliance, was disbanded in 2021 after its leaders were arrested and charged with inciting subversion under a national security law imposed by China in 2020 after anti-government protests.Authorities have been using the law to clamp down on pro-democracy activity in Hong Kong and about 250 people, including opposition politicians, lawyers and journalists, have been arrested for suspected national security offences.",
        "Authorities say they are maintaining order necessary for the financial hub's prosperity. (Reporting by Jessie Pang; Editing by Anne Marie Roantree and Robert Birsel)"
    ]
}