{
    "articleURL": "/wires/reuters/article-12048651/Soccer-Late-MacAllister-penalty-gives-Brighton-1-0-win-Manchester-United.html",
    "content": [
        "BRIGHTON, England, May 4 (Reuters) - Brighton &amp;amp; Hove Albion midfielder Alexis MacAllister fired the winner from the penalty spot deep into stoppage time to snatch a 1-0 win for his side over Manchester United in a pulsating Premier League clash on Thursday.",
        "The defeat leaves Erik ten Hag's side in fourth place on 63 points, four ahead of fifth-placed Liverpool but with a game in hand over their Merseyside rivals, while Brighton move up to sixth on 55 points.The victory was some measure of revenge for Brighton, who lost to Manchester United on penalties in their FA Cup semi-final 11 days ago.The home side dominated possession and could have gone ahead as early as the fourth minute when Japanese winger Kaoru Mitoma snapped up a loose pass from Victor Lindelof, but he fired his shot straight into the face of David De Gea.Mitoma was a threat throughout, creating several chances for himself before teeing up Danny Welbeck to fire high and wide from the edge of the box early in the second half as United struggled to pass the ball out of defence.After getting booked in the first half, United midfielder Casemiro was lucky not to pick up his second yellow card as he hacked down MacAllister on the edge of the box in the in the second half.Tempers flared in the 68th minute as United winger Antony, angry at not being awarded a free kick, was penalised for a tackle on MacAllister before getting into a confrontation with Lewis Dunk that earned both players a yellow card.",
        "Brighton continued to press forward looking for a winner, with substitute Solly March and MacAllister both forcing superb saves from De Gea as the clock ticked towards 90 minutes.United looked set to secure a draw, but there was late drama when Luke Shaw was found to have handled the ball in the box after a VAR review, and MacAllister blasted home the spot kick nine minutes into stoppage time to secure the win.\"Really happy and delighted for the performance and result,\" Brighton coach Roberto de Zerbi told Sky Sports. \"There is a God of football - we deserved to win the (FA Cup) semi-final but lost on penalties, but today we won with a penalty.\"United defender Shaw took responsilibity for his mistake, calling it a \"silly error that cost us a point\", but said his side were still on course to qualify for next season's Champions League.\"Teams around us are picking up points, (but) we still have a game in hand and it is in our hands,\" he told Sky Sports.(Reporting by Philip O'Connor, editing by Pritha Sarkar)"
    ]
}