{
    "articleURL": "/femail/article-12054405/Clare-Balding-makes-accidentally-rude-remark-Princess-Anne.html",
    "content": [
        "The presenter raised eyebrows with her commentary of Westminster ceremony CORONATION LIVEBLOG: Click here to follow live updates throughout todayClare Balding raised eyebrows with a very unfortunate turn of phrase while speaking about Princess Anne during today's coronation ceremony. ",
        "The presenter was part of the BBCs running commentary of the momentous event which saw King Charles crowned at Westminster Abbey. Yet, the historical moment turned to hilarity when Clare uttered an awkward comment about the Monarch's sister, The Princess Royal, 72. As the royal exited the Abbey via a side door to get on her horse to ride behind the newly-crowned King and Queen, the presenter said: 'Very quick change and leg up for HRH Princess Royal, because you saw her leaving through a side door, and in a matter of minutes she is now mounted, and she is not far behind her brother the King.'The unfortunate choice of words left viewers in fits of laugher, with some noting that the remark held a very rude double meaning.   ",
        "Princess Anne, who was wearing her military uniform and regalia, left her seat, where she had watched the ceremony with the rest of the royal family, and left first by a side door. This was to give her the time to get ready to ride her horse behind the Gold State Coach.Explaining this in the running commentary of the event, Clare said the royal was 'quickly mounted,' with viewers jumping at the opportunity of making innuendos online.  'Another classic from Clare Balding: 'You may have noticed Princess Anne she slipped out through a side door and is now mounted. You just couldn't make this s*** up,' one fan said. ",
        "'Clare Balding: “The Princess Royal left by a side door and in a matter of minutes she was mounted…”, another quoted. 'Did Clare Balding really just say that Princess Anne has been mounted,' one asked. 'My eyebrows raised when Clare Balding said that Anne had just been mounted. Got to admire the woman’s energy,' one quipped.'\"The Princess Royal is mounted\" - Clare Balding. The Coronation just got interesting,' one said. Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head. ",
        "The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen' and 'thank you William'.The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.",
        "Minutes later Camilla was crowned. As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.The newly-crowned King and Queen later appeared on the Buckingham Palace balcony with a select group of senior royals as The Mall was swamped by tens of thousands of cheering patriots.The royal couple waved to gargantuan crowds before a RAF flypast, which had to be scaled back to just just helicopters and the Red Arrows because of the heavy rain in London.",
        "The Mall was a sea of people, many of whom sprinted to get close to the Palace and catch a glimpse of the King and Queen following their historic coronation watched by 100million people on TV worldwide.Charles and Camilla were joined by the Prince and Princess of Wales, their children, the Duke and Duchess of Edinburgh and Princess Anne. Once again Prince Louis and Princess Charlotte stole the show with some enthusiastic waving and pointing as the jets flew over the Palace to roars.But their uncle Prince Harry decided to dodge the event amid reports he planned to jet home after a 24-hour stay in the UK to get back to California on his son Archie's fourth birthday today. His limousine was spotted at Heathrow this afternoon, less than two hours after the Coronation service ended."
    ]
}