{
    "articleURL": "/wires/pa/article-12042651/Q-A-What-gone-wrong-Chelsea-hope-future.html",
    "content": [
        "Chelsea’s season plumbed new depths in Tuesday’s 3-1 loss to Arsenal, not just in that it was the sixth defeat of Frank Lampard’s six-game reign but also the manner in which the team seemed to disintegrate in the first half.",
        "It is difficult to see where the team’s next win is coming from, and with three of the top four still to play as well as a trip to buoyant Bournemouth on Saturday, it may not come until August.Here, the PA news agency looks at what has gone wrong and what hope this team have for the future.How much worse can it get?",
        "Materially, the answer appears to be ‘not much’. The team are not going to be relegated, though on current form that might be certain only because the season will run out of games before Chelsea run out of points.The concern now is about what damage is being done to the players, staff and supporters psychologically on this desperately poor run-in, and how much time it will take to repair.For a team this expensively assembled to lose six in a row – part of a winless run of eight during which only two goals have been scored – speaks to something more serious than a side lacking confidence and form.Chelsea played like strangers in losing to Arsenal, world-class players seemingly unable to perform. The squad seem in a state of shock. The road back will not be straightforward.What can be done in the short term?",
        "The club appear to be damned whichever direction they move in.Nobody could have predicted the speed or extent to which Lampard has looked out of his depth, but making yet another change barely a month after the latest one would not reflect well on the club.",
        "Equally, putting the next permanent manager in the dugout now rather than letting him start with the spotlight off during the close-season could short-circuit the reboot at its inception.Is there any good news?",
        "Yes – the season is only five games from being over, but that could also be the bad news if losses keep piling up.Yet for all the criticism of the way Todd Boehly has gone about Chelsea’s business, he has in an albeit wasteful and roundabout way assembled many of the parts that the club need in order to be a force again.In Enzo Fernandez they have a genuine star of world football around whom a truly great team can be built, while Joao Felix – if he stays – is a game-changing talent with limitless potential.Benoit Badiashile and Mykhailo Mudryk are fine young players starting to show signs of acclimatisation, and Wesley Fofana has hinted in flashes at why he was so highly regarded during his time at Leicester.Scoring goals is a problem, and Christopher Nkunku – when he arrives from RB Leipzig in the summer – could be part of the solution.Yet there remains the absence of a clinical, proven goalscorer and it is hard to see this team competing next season without one.Could Pochettino be the man to turn things around?",
        "This is another reason for supporters not to abandon hope. Mauricio Pochettino looks a decent fit for the urgent work that needs doing, with a proven record of transforming a squad of callow hopefuls into performers on the very biggest stage.",
        "He ticks a lot of the boxes: tactical nous; good with young players; able to handle mature stars and their not-so-mature egos; charismatic.Yet there is an almost unprecedented rebuild required at the club, and what success he has enjoyed in the past will not be a guarantee of anything.If he is to turn things around, it will not happen overnight. But if anybody is going to get the club back on track, Pochettino looks as good a bet as anybody on the market."
    ]
}