{
    "articleURL": "/wires/reuters/article-12053091/Scope-Ratings-places-US-credit-ratings-review-downgrade.html",
    "content": [
        "May 5 (Reuters) - Scope Ratings on Friday placed the United States of America's AA long-term issuer and senior unsecured debt ratings in local and foreign currency under review for a possible downgrade due to longer run risks associated with the misuse of the debt ceiling instrument.",
        "Scope, which is seen as the leading European credit rating agency, said that recurrent debt-ceiling crises have resulted in phases of debt repayment distress for the U.S government, adding that the government is dependent on last-minute congressional action to ensure repayment of its debt in full and on time.A rise in political polarisation, divided government since November 2022 congressional elections and more elevated federal deficits over the forthcoming years are the other reasons Scope cited for the ratings review.The U.S. governmenthitits $31.4 trillion borrowing limit in January, amid a standoff between the Republican-controlled House of Representatives and President Joe Biden's Democrats.The United States could run out of money to pay its bills as soon as June 1 if Congress does not raise the debt ceiling, according to Treasury Secretary Janet Yellen.Last week, the Republican-led U.S. House of Representatives passed a bill that pairs $4.8 trillion of spending cuts with an increase in the ceiling. But Biden and his fellow Democrats insist Congress should raise the cap without conditions.Scope also placed United States' S-1+ short-term issuer ratings in local and foreign currency under review for downgrade.Rating agencies Moody's and Fitch both have a triple-A rating for the United States - the highest credit quality status they can assign to a borrower.",
        "S&amp;amp;P Global's sovereign rating for the United States is 'AA+', the second highest rating by the agency. In its published report from March last, S&amp;amp;P expected Congress to continue to raise or suspend the debt ceiling, despite \"political brinkmanship\" between the executive and legislative branches of government.Scope Ratings has been in talks with the European Central Bank to become one of its recognized agencies, joining Standard and Poor's, Moody's, Fitch and DBRS.(Reporting by Jose Joseph in Bengaluru; Editing by Sandra Maler and Kim Coghill)"
    ]
}