{
    "articleURL": "/wires/ap/article-12052433/Opinions-vary-qualities-St-Louis-prosecutor.html",
    "content": [
        "ST. LOUIS (AP) - Now that Kim Gardner is stepping down as the chief prosecutor in St. Louis, Missouri's governor is getting plenty of advice about the qualifications Gardner's replacement should bring to the table.",
        "Activists and Democrats want someone who will continue her progressive policies, even if many concede that Gardner's replacement must restore confidence in the St. Louis Circuit Attorney's Office. Republicans cite a need to crack down on crime and work more cohesively with police.Gardner, who has been at odds with Republicans for most of her six-and-a-half years in office, announced Thursday that she would resign effective June 1. She was among several big-city Democratic prosecutors across the country who have faced criticism and ouster efforts in recent months.\"Since day one of my tenure as Circuit Attorney, I have experienced attacks on my reforms, on my judgment, on my integrity, on my prosecutorial discretion, on my responsibility to direct the limited resources of this office and more,\" Gardner said in her resignation letter, adding that the attacks were \"at the expense of public safety.\"Republican Missouri Attorney General Andrew Bailey has been seeking Gardner's removal, saying too many crimes go unpunished, the prosecutorial staff has dwindled to a dangerously low number and the office is too slow in taking on cases brought by police.Meanwhile, the GOP-led Missouri House weighed a bill that would allow Republican Gov. Mike Parson to appoint a special prosecutor in St. Louis to handle violent crimes, effectively removing the bulk of Gardner's responsibilities.",
        "Parson, a former sheriff, is tasked with appointing Gardner´s replacement. His office declined an interview request, but Parson said in a statement on Thursday that he is \"committed to finding a candidate who represents the community, values public safety, and can help restore faith in the City´s criminal justice system.\"The Rev. Darryl Gray, a leading racial justice activist in St. Louis, knows that the next circuit attorney won't be a so-called progressive prosecutor like Gardner. But he urged Parson to appoint someone who will continue to consider diversion over incarceration, avoid seeking the death penalty and generally treat defendants with compassion.\"Non-violent criminals for many cases don´t need that mark on them that can haunt them for the rest of their lives,\" Gray said. \"These things are important for criminal justice reform.\"Many others want the next circuit attorney to be laser-focused on prosecuting criminals.\"Because of Kim Gardner´s incompetence violent criminals in St. Louis weren´t prosecuted while victims waited too long for justice,\" Republican U.S. Sen. Eric Schmitt said in a tweet. \"St. Louis is better off without Kim Gardner. It´s my hope the next Circuit Attorney will aggressively prosecute crime and people can feel safe again.\"Michael Wolff, former chief justice of the Missouri Supreme Court and now professor emeritus at St. Louis University School of Law, said whoever takes over faces a tall task. Some St. Louis prosecutors are juggling hundreds of cases.",
        "\"They have to basically rebuild the office, and they´re going to have to probably collaborate with some prosecutors around the region to get the help that they need immediately,\" Wolff said.Gardner first drew the ire of Republicans in 2018 when she charged then-Gov. Eric Greitens with felony invasion of privacy, but the charge was eventually dropped. The Republican resigned June 1, 2018. Gardner's resignation will be five years to the day after Greitens'.The Greitens case drew scrutiny that led to the conviction of Gardner´s investigator. Gardner received a written reprimand for failing to produce documents and mistakenly maintaining that all documents had been provided to Greitens´ lawyers.In 2019, Gardner announced an \"exclusion list\" of city police officers prohibited from bringing cases to her office. The list included nearly 60 officers accused of posting racist and anti-Muslim comments on social media.Despite her critics, Gardner easily won reelection in 2020. But even some of her supporters flipped as the backlog of criminal cases began to mount.A pivotal turning point came in February after 17-year-old Janae Edmondson, a volleyball standout from Tennessee, was struck by a speeding car after a tournament game in downtown St. Louis. She lost both legs.The driver, 21-year-old Daniel Riley, was out on bond on a robbery charge despite nearly 100 bond violations that included letting his GPS monitor die and breaking the terms of his house arrest. Critics questioned why Riley was free despite so many bond violations.",
        "Gardner isn't the lone prosecutor under GOP scrutiny.Georgia Gov. Brian Kemp was expected to sign a bill Friday creating a new commission to discipline and remove prosecutors if they \"categorically (refuse) to prosecute any offense or offenses of which he or she is required by law to prosecute.\"In Pennsylvania, state House Republicans voted in November to impeach Philadelphia District Attorney Larry Krasner for reasons including his failure to prosecute some minor crimes, his bail policies and management. Krasner sued and a divided state court ruled that impeachment articles didn´t reach the needed legal threshold.In San Francisco, it was voters who decided to oust the chief prosecutor. District Attorney Chesa Boudin was removed last June in a recall election fueled by frustration over public safety in the deeply Democratic city. Viral video footage of people shoplifting and attacking seniors, particularly Asian Americans, rattled residents.___AP reporter Summer Ballentine contributed to this report from Jefferson City, Missouri."
    ]
}