{
    "articleURL": "/news/article-12060165/Ron-DeSantis-war-Chinas-influence-Florida.html",
    "content": [
        "'Today Florida makes it very clear: we don't want the CCP in the Sunshine State,' Gov. Ron DeSantis saidLaws make forbid Chinese ownership of land, bans TikTok and prohibits universities from accepting money from ChinaThat includes exchange programs and dual degrees Florida Gov. Ron DeSantis signed a series of bills into law on Monday that crackdown on China, blocking it from buying land in the state, prohibiting universities from accepting funding from China, and forbidding Tiktok on government issued-devices. ",
        "'Florida really is leading the nation in terms of what we're doing to stop the influence of the Chinese Communist Party,' he said during a bill signing event in Hernando County.'Today Florida makes it very clear: we don't want the CCP in the Sunshine State. We want to make maintain this as the Free State of Florida. And that's exactly what these bills are,' he noted.DeSantis' tough stance comes amid speculation he will soon announce a bid for the Republican presidential nomination. ",
        "The new laws forbid Chinese citizens from purchasing land in Florida unless they are also a U.S. citizen or permanent resident. DeSantis accused China of having a 'concerted effort to acquire farmland throughout the United States,' including in Florida, and argued Beijing is going after the food supply.'Our food security is also national security. And so we don't want the CCP in charge of any of the food production,' he said.Additionally, Chinese citizens can't buy land within 10 miles of any military installation or any type of critical infrastructure in the state.Citizens of Russia, Iran, Syria, North Korea, Cuba and Venezuela also can't buy land near military bases and critical infrastructure like airports. But only residents of China would be banned from owning land anywhere in Florida. ",
        "China owned 352,140 acres of U.S. land in 2020, according to the Department of Agriculture, which is about 1 percent of foreign-owned land. Canada is the biggest foreign investor in American land, owning 12.4 million acres.About 100 Chinese holders of H-1B visas, including university professors and businesspeople, testified against the bill. Many of them work in Florida and noted they would not be able to buy a home. The new laws also ban the use of TikTok and other Chinese apps on school and government servers and stop state universities from accepting funding from China. That ban includes student and faculty exchange programs and dual-degree programs. The ban could be waived by the university system Board of Governors. 'We're really recognizing the threat, and we're taking action,' DeSantis said. ",
        "There is speculation he will announce a bid for the presidency in the next few months. He recently completed a book tour of important early voting states that many saw a precursor to a presidential campaign. The Florida governor also just returned from a trip to Japan, South Korea, Israel and Britain meant to bevy up his foreign policy credentials. On that trip, DeSantis portrayed China as a new Cold War and pushed for an American military response - a vision he repeated on Monday.",
        "'Our economy is dependent on China for and it's given them more leverage and more power as a result. So we do need to assert our economic sovereignty. Part of that is bringing supply chains home and getting more stuff here as we build up our military which you know, I know this president won't do but but we need to do,' he said."
    ]
}