{
    "articleURL": "/tvshowbiz/article-12047583/Paul-OGradys-bit-filming-revealed-iconic-BBC-wasnt-fan-of.html",
    "content": [
        "Paul O'Grady's 'last bit of filming' before his death has been revealed.",
        "The presenter and comedian passed away 'unexpectedly but peacefully' in March, aged 67. And ahead of his death, Paul filmed a segment for a Eurovision documentary, though the star 'wasn't a fan' of the annual song contest, it's been said.Paul's friend and producer Malcolm Prince shared the information via Paul's manager Joan on Wednesday, revealing that his TV appearance will be shown next week.And while fans were quick to thank Malcolm for passing on the information, many commented on the 'irony' of him filming something he didn't like. ",
        "Malcolm's tweet read: 'There will be a brief clip of Paul in the opening titles of the Eurovision programme at 8.00p.m. on Tues 9th May on BBC One…'Paul wasn't a fan of Eurovision as I am sure you all know, but it turned out to be the last bit of filming he did.'Commenting on the post, one person wrote: 'I remember going in to radio two to talk to Maria Mc one Eurovision weekend. Paul was clucking about moaning about it all!'To which Malcolm replied: 'He was never a fan of it, bless him.'Another person tweeted: 'I'm sure I can hear his rAAAnt... of alllll the things to be my last recording, it had to be about Eurovision!!!'",
        "With an additional fan humorously adding: 'Oh the irony. sure he's looking down going, bah humbug.'While the Eurovision documentary was the last thing the Lily Savage star filmed, Paul is still set to feature on another upcoming programme of which he filmed late last year.",
        "When one person asked: 'I thought the last bit of filming Paul did was in Thailand filming with animals for a series that was supposed to be broadcast either later this year or early next year for itv?'Malcolm confirmed that this was still to come and had been filmed previously, replying: 'He completed that series in December and it will air soon on itv.' It comes after Paul's fans were brought to tears last month as the late star returned to TV screens for the final season of For The Love Of Dogs. The comedian, who died last month at the age of 67, filmed the last season late last year. Paul was widely known as a big dog lover, having already given a home to Chihuahua-Jack Russell cross Eddie, Shih Tzu Boycie, Maltese Conchita, mongrels Arfur and Nancy, and a dachshund called Sausage, from Battersea Dogs &amp; Cats Home where the series is filmed.In his ITV documentary series, which has been running since 2012, Paul visited animals at the home to find out about their backgrounds. ",
        "Upon witnessing the return of the beloved TV star and seeing his affectionate personality once again, fans became emotional when watching the show and many couldn't hold back their tears. One said: 'Peggy the Newfoundland, I may have a bit of grit in my eye. This series is gonna be a difficult watch, we'll sure miss Paul O'Grady, one of the good guys.'Another TV watcher was also brought to tears saying: 'Still tears in my eyes watching Paul O'Grady but so enjoy the Programme,' while a third added: 'Paul O'Grady absolutely crying.'Another Twitter user added: 'I just finished watching the first episode of For The Love Of Dogs with the late great Paul O'Grady. In March Paul's partner Andre Portasio shared that he had passed away 'unexpectedly but peacefully'.  ",
        "Portasio said: 'It is with great sadness that I inform you that Paul has passed away unexpectedly but peacefully yesterday evening.'We ask, at this difficult time, that whilst you celebrate his life you also respect our privacy as we come to terms with this loss.'He will be greatly missed by his loved ones, friends, family, animals and all those who enjoyed his humour, wit and compassion.'I know that he would want me to thank you for all the love you have shown him over the years.'     ",
        "O'Grady and Portasio were married during a low-key wedding ceremony in 2017 .During his career, he hosted The Paul O'Grady Show, Blind Date and Blankety Blank, as well as ITV's multi-award-winning For The Love Of Dogs. He also hosted ITV celebrity game show, Paul O'Grady's Saturday Night Line Up."
    ]
}