{
    "articleURL": "/news/article-12038149/Scouse-commentator-selected-alternative-narrator-Eurovision-final-Liverpool.html",
    "content": [
        "Paul Quinn, 32, will provide an alternative commentary to the Eurovision finalsHe will host the song contest finale alongside Brookside actress Claire Sweeney The BBC has picked a 32 year old man from Liverpool to provide an alternative Scouse commentary to the Eurovision finals. ",
        "Paul Quinn, 32, from the Dingle area of Liverpool, will co-present the song contest finale alongside Brookside actress Claire Sweeney, 52, on Saturday May 13.The BBC said it will be the first time contest audiences will have the option of listening to an alternative commentary in the host city's regional accent.The Liverpudlian was selected after a seven-week search by BBC Radio Merseyside that featured nearly 500 auditions.The BBC radio station toured shopping centres in Liverpool and Merseyside, asking members of the public to record a 40-second demo tape.",
        "Liverpool singer Sonia, who represented the UK at the contest in 1993, judged the entries on an expert panel. The panel praised were particularly impressed that Mr Quinn 'talked passionately about Ukraine and his connections with the country.' In his audition, the expert panel also praised the 32 year old Liverpudlian's 'sense of Scouse'. Mr Quinn said: 'It's brilliant and to have it here in Liverpool is a once-in-a-lifetime opportunity. And who knows when it's going to come back?' 'To think I can look back and say it was in Liverpool and I was the voice of it for BBC Radio Merseyside.' ",
        "'People will think back and say \"Remember when Paul Quinn was the voice of Eurovision?\" It's brilliant.' Liverpool native Ms Sweeney, who played Lindsey Corkhill in long-running soap Brookside, said: 'I am thrilled to be involved with Eurovision this year in Liverpool.",
        "'I am looking forward to working alongside the new voice of Eurovision for BBC Radio Merseyside.'The Scouse alternative commentary is going to be a fabulous addition to the show. It's going be such fun. I can't wait.'Scouse actress Ms Sweeney went to theatre school in Liverpool while working weekends at her father's Toxteth butchers shop. Listeners will have the option to tune into the Scouse alternative commentary on Saturday May 13 from 8pm via BBC Radio Merseyside, BBC Sounds and the iPlayer."
    ]
}