{
    "articleURL": "/wires/pa/article-12044039/Erik-ten-Hag-unsure-funds-available-strengthen-Man-Utd-s-squad.html",
    "content": [
        "Erik ten Hag is in the dark over Manchester United’s summer spending power as the takeover saga rumbles on.",
        "The Old Trafford giants announced in November that the board was exploring strategic alternatives to enhance the club’s growth, with a full sale one option being considered.Friday was the third, and what is expected to be final, deadline for parties to make offers to buy the club, with Sheikh Jassim and Sir Jim Ratcliffe both submitting bids.",
        "Now the the Glazer family must decide how they want to proceed – a process that threatens to damage the progress made during Ten Hag’s first season in charge.United are on course for a top-four finish and have the chance to add the FA Cup to the Carabao Cup, but the financial backing for improvements is unclear even to the manager.Asked if he has been told he has the funds to do what he wants to this summer irrespective of how the takeover process pans out, Ten Hag said: “No, I don’t have. I don’t have influence on that, I don’t have… also I don’t know.“The only thing what I know is that Man United is one of the biggest clubs and I think it’s among maybe (the) two biggest clubs in the world from a fanbase perspective.",
        "“So, I think this club has to compete for the highest in the world, so Champions League, Premier League.",
        "“But in football you need funds to construct squads because in the end of the day the level from your players makes if you are successful or not.”Ten Hag says “everyone knows you need funds to construct a squad” and that “high level players cost a lot of money” in elite football.“I, we see this as a project,” the United boss said. “In a project also it belongs that you are in windows, that you strengthen your squad needs or to make refreshments, so that you get more balance, definitely, and you bring young players in.",
        "“But I think we already have shown and proved that we can beat the best teams in the world, so, yeah, I think we can compete in the Champions League.“But at the end of the day we want to be in the winter also in the Champions League and we want to compete, and knock them all out, so then we have a way to go.”United are preparing to take on Brighton in the Premier League on Thursday after beating Aston Villa 1-0 to a backdrop of protests against the Glazers on Sunday.Ten Hag was seen after the match at Old Trafford picking up a green and gold scarf as he headed down the tunnel game, holding it up before throwing it back to fans.",
        "When asked if it was an act of solidarity with the fans, the United boss said: “No, it was just polite.",
        "“But I know what’s going around, what the symbol of it is, but this matter was just polite.”Ten Hag, understandably, refrained from publicly criticising his employers at this stage of the season but his desire for clarity on the club’s future is palpable.Asked how important it is to get the takeover process resolved as soon as possible, Ten Hag said: “Yeah, I think it’s clear what I want but it’s not up to me.“It’s about others in this club, finally there are the owners and they make the decisions, so it’s not up to me.“So, I do everything I can and I influence the processes I’m in charge of.”"
    ]
}