{
    "articleURL": "/sport/football/article-12055171/Frank-Lampard-calls-unity-Chelsea-fans-3-1-win-Bournemouth-Saturday.html",
    "content": [
        "Chelsea won their first game since Frank Lampard's return on SaturdayThey beat Bournemouth 3-1 after late goals for Benoit Badiashile and Joao FelixLampard urged fans to stick with their team after the drought-ending win Frank Lampard commended Chelsea fans on Saturday night but urged them to stick with Raheem Sterling and Hakim Ziyech after the two substitutes were booed when they came on in the victory over Bournemouth.",
        "Chelsea fans also aimed expletives at current owner Todd Boehly and chanted their support for former owner Roman Abramovich, as Ziyech and Sterling both proved decisive, setting up late goals for Benoit Badiashile and Joao Felix to end a run of six successive defeats and record Chelsea’s first win for almost two months.The Chelsea fans and players reconciled at the end with mutual applause after the victory and Lampard said: ‘Our fans were fantastic today. I appreciate their support.‘We had a meeting at the end of the game on the pitch where everyone feels good for a day. This is Chelsea Football Club. Fans have been used to a lot of success and they want a lot of success.‘I am not going to comment on any of the stuff you are talking about but I know the fans will stick with this club and they are a fantastic group. I do know there are a lot of intentions to get this club where it needs to be and there isn’t a club out there of our size that hasn’t had transitional periods and wouldn’t give their left arm to be where we have been.",
        "‘If everyone sticks together, I’m sure we will. It’s important to feel the connection between the players and fans.",
        "‘In terms of the subs they made all made impact.‘Ruben Loftus-Cheek gave us physical presence and Raheem was involved in the goal. Cesar Azpilicueta came on and gave us leadership. Hakim gave us an assist and played really.‘Opinion can always change in a period but they [Sterling and Ziyech] are two players that want to do well and have big talent, both of them.‘Sometimes, if it’s form, there has been a lot of under-performance this year, that is temporary. And I think their class is permanent and it showed when they came on. Today was a nice small step forward.’"
    ]
}