{
    "articleURL": "/wires/pa/article-12047453/Pizzeria-creates-coronation-special-depicting-King-s-face-chip-crown.html",
    "content": [
        "A pizzeria has gone viral on social media after it created a pizza in the shape of the King’s face, complete with Italian sausage nostrils and a crown made out of chips.",
        "Gerry Sweeney, owner of Villaggio Pizza in Eaglesham near Glasgow, is the creator behind what is being dubbed online as the “coronation pizza”, and he said the food item is “silly” but has brought a smile to many in the local community.The 14-inch pizza, which has more than 4,000 upvotes on Reddit, is made with two balls of dough to create the face and ears, topped with tomato sauce, fresh mozzarella for the eyes, nose and mouth, and Italian sausage for the nostrils.With the coronation taking place on Saturday, the 54-year-old said he felt he had to mark the historic event and create something special.He told the PA news agency: “I thought we had to do something… we normally do a special every week and I was thinking about coronation chicken, chicken burgers or coronation chicken salads or pizzas.",
        "“I’ve made funny-face pizzas before for people’s birthdays… just silly stuff and this one is a bit of fun.”He said the pizza is “a wee bit of work” as it is twice cooked and takes five times longer to create than his regular pizzas.“It takes 10 or 15 minutes to make that pizza, whereas if you walk in, three minutes you’ll get a pizza in a box,” he said.",
        "“It takes a wee bit of work and there’s more dough. Two dough balls – one for the face and another for the ears.“It’s in the oven twice rather than once.”The coronation pizza is also made using red onions to replicate Charles’s hair as well as chips to build the crown.Red peppers and green jalapenos are added to form the jewels of the crown.",
        "Mr Sweeney, who has owned Villaggio Pizza for more than three years, created the large coronation pizza last Friday and put it on display for customers to admire.“All the customers were talking about it,” he said.“They were all laughing and taking photographs.”He added that many could not wait to send a picture of the pizza to their friends, with one customer saying “wait until my sister sees this”.While the pizzas are not for sale, Mr Sweeney said he may “make a few” for those who order for Saturday’s coronation day, but admits that the large creation “takes too long to make”."
    ]
}