{
    "articleURL": "/wires/pa/article-12049215/Tommy-Fleetwood-sets-early-pace-Rory-McIlroy-makes-solid-return.html",
    "content": [
        "Birdies on the closing two holes gave Tommy Fleetwood the first round lead in the Wells Fargo Championship as Rory McIlroy made solid return to action.",
        "Fleetwood shot a bogey-free 65 as he continued his pursuit of a first PGA Tour title, one better than a group on five under – Xander Schauffele, Kevin Streelman, Taylor Moore, KH Lee and Ryan Palmer.McIlroy, playing for the first time since missing the cut at the US Masters, is three strokes behind after an opening 68 on his 34th birthday at Quail Hollow.Fleetwood has won six times on the DP World Tour, but the Englishman is still chasing a first title in the US.“I just have to keep going and wait for those really big results and hopefully start contending again up at the top of the leaderboard,” said Fleetwood. “We’ll see what we can do from there.”McIlroy has won three times at Quail Hollow with nine top 10 finishes in 11 starts, but he admitted not touching his clubs for more than two weeks after the disappointment at the Masters.“I feel relaxed here,” he said. “It’s just a level of comfort at this golf course and at this club that I probably don’t have any other venue.“I’ve played here so many times I know where to miss it. I missed a few greens but I didn’t feel like I hit the ball that badly.",
        "“It was just really nice to be out there again… nice to feel like I played well. I didn’t want to spend my birthday afternoon grinding on the range.”Schaufelle had looked on course to set the early pace, but two bogeys in Quail Hollow’s notorious closing three holes – dubbed the “Green Mile” – left him one off the lead.US Open champion Matt Fitzpatrick finished a stroke behind playing partners McIlroy and Justin Thomas, his 69 matched by fellow Englishman Tyrell Hatton with defending champion Max Homa opening with a 70.English trio Matt Wallace, Callum Tarren and Harry Hall also opened with one-under-par 70s while Tony Finau, winner in Mexico last week, shot a 71."
    ]
}