{
    "articleURL": "/home/books/article-12048751/RETRO.html",
    "content": [
        "LADDER OF YEARSby Anne Tyler",
        "(Vintage £9.99, 448pp)The opening lines of Anne Tyler’s superb story of 40-year-old Delia, who walks away, unnoticed, from her husband and three grown children while on a beach holiday, perfectly illustrates her economy of style.Missing Delia is described to the police by her bemused family as being ‘5’ 2” or possibly 5’ 5” and weighs either 90 or 110 pounds’. And it is this feeling of being invisible and superfluous that leads Delia to set up a new life as a single woman in a small town where she doesn’t know a single soul. But can she sustain this existence?No one evokes the frustrations of marriage, family life and independence with such pin-point accuracy as Tyler — and this is just one in a series of welcome reissues of her award-winning novels.ITby Stephen King",
        "(Hodder £12.99, 1064pp)Another author enjoying reissues — although completely different in subject and style — is Stephen King.This 1987 blockbuster horror story is memorably chilling, not least because it introduces us to that monster of monsters, Pennywise the Dancing Clown. Lurking in the sewers, the shapeshifting devil rises every 27 years to feed off (mainly) children in Derry, Maine.The book opens with a flashback to the gruesome death of six-year-old George, younger brother of Bill — a member of The Loser’s Club of seven bullied misfits. They all encountered Pennywise in fearful forms and vow to return as adults if he rises again. It’s not a quick read, but you won’t get certain images out of your head.",
        "MISUNDERSTANDING IN MOSCOWby Simone de Beauvoir",
        "(Vintage £9.99, 128pp)This novella by one of the 20th century’s leading thinkers and feminists — and previously unpublished in the UK — tackles themes of miscommunication, ageing and loneliness.Retired French couple Nicole and Andre are visiting Macha, Andre’s adult daughter from a previous relationship, in Russia in 1966. While Andre and Macha discuss East-West tensionst, nationalism and socialism, 60-year-old Nicole feels increasingly ignored, alone, old and misunderstood.Their marriage has been happy but, like many in long relationships, they make assumptions, and one of the strengths of the book is the way in which each character’s internal dialogue mirrors the other’s fears.It’s touching and a slow burn — although, interestingly, we wouldn’t think 60 to be old these days."
    ]
}