{
    "articleURL": "/news/article-12040365/Nordstrom-shuts-stores-San-Francisco-bosses-blame-changing-city-dynamics.html",
    "content": [
        "Nordstrom announced it would close its downtown San Francisco locationsIts mall location will close by the end of August, and its Rack will close by July 1READ MORE: Iconic discount store Century 21 to reopen flagship locationNordstrom has announced it is closing all of its San Francisco stores, blaming the 'changed dynamics' of the city which has seen numerous major chains turn-tail in the face of soaring crime.",
        "The retailer told employees it would not be renewing its leases at the Westfield Mall or at the Nordstrom Rack across the street. The mall location will shutter at the end of August, and the Rack store will remain open until July 1, according to the Washington Post.Nordstrom chief stores officer Jamie Nordstrom blamed the state of San Francisco in recent years for reducing foot traffic 'and our ability to operate successfully.'Westfield Mall said in a statement to the Washington Post that the move was brought on by the 'deteriorating situation in downtown San Francisco' which has left customers and staff unsafe.Rampant crime in downtown San Francisco has left numerous retailers throwing up their hands and moving out. In April, Whole Foods announced it was closing its locations, while Anthropologie and Office Depot have also left. Remaining stores like Target have been reduced to locking up their entire stock behind glass to deter shoplifters.",
        "'Decisions like this are never easy, and this one has been especially difficult,' wrote Nordstrom in his email. 'But as many of you know, the dynamics of the downtown San Francisco market have changed dramatically over the past several years, impacting customer foot traffic to our stores and our ability to operate successfully.'Westfield Mall was much more blunt in its statement to the Washington Post, pointing directly to rising crime running business out of town, which it referred to as 'unsafe conditions for customers, retailers, and employees.'",
        "The mall said 'these significant issues are preventing an economic recovery of the area.'Nordstrom joins the growing list of stores that have abandoned the the coastal city, including H&amp;M, Marshall's, Gap, and Banana Republic, among others.Despite official reports that San Francisco's crime rate is on the way down, one former prosecutor said this month that the city's liberal district attorney's decision not to prosecute many crimes skewed those numbers.   Gap was the first to announce its departure in August 2020, shortly followed by H&amp;M and Marshall's. As the years went on, more stores slowly pulled out. The Market Street Anthropologie will be closing its doors on May 13, according to the San Francisco Chronicle. As a result, the brand will no longer have a location in the city. Office Depot, located on Third Street, will also be shuttered, but the exact closing date is unknown. The brand has a bigger store on Geary Boulevard, which will not close. ",
        "Downtown San Francisco has had a hard time bouncing back after the pandemic as shoppers have failed to flock back to the once-popular shopping location. The city as a whole has struggled to recover as the city's residents continue to battle a crime epidemic, brought into sharp focus recently with the murder of Cash App CEO Bob Lee and the brutal broad daylight attack on the city's former fire commissioner.",
        "Although crime is down nearly eight percent, compared to the same time last year, stores have begun locking up merchandise. A Target store in San Francisco has locked up its entire product range. A video posted on TikTok on April 20 shows all of the items secured behind glass.According to geotagged imagery, some products at the store on Folsom Street were secured by lock and key since at least October of last year, WNCT reported. ",
        "Organic food giant Whole Foods opened a new 'flagship' location at Trinity Place in the city's Tenderloin District in March 2022, hoping to revitalize footfall after two years of draconian COVID-19 restrictions severely impacted businesses in the area.But a Whole Foods spokesperson declared the store closed down due to safety concerns for its staff. 'We are closing our Trinity location only for the time being,' the spokesperson said in a statement. 'If we feel we can ensure the safety of our team members in the store, we will evaluate a reopening of our Trinity location.' T he company cited deteriorating street conditions around drug use and crime near the store as the driving factors behind the closure.Industry groups have noted that there is an issue with theft, with the National Retail Federation saying that organized retail crime is setting stores back around $100 billion a year, according to a 2022 survey.",
        "In 2021, retailers saw a 27 per cent increase in theft carried out by organized criminal rings, the survey found. To tackle the issue, they invested more money in safety and security measures to protect employees, customers and merchandise."
    ]
}