{
    "articleURL": "/wires/ap/article-12042793/Lawsuit-begins-patrol-tactic-known-Kansas-two-step.html",
    "content": [
        "KANSAS CITY, Kan. (AP) - The Kansas Highway Patrol uses a tactic dubbed the \"Kansas two step\" to search vehicles - often from other states - when there is often no legitimate cause for the search, according to a lawsuit being heard this week in federal court.",
        "Shawna Maloney of Colorado recalled her fear after troopers used the tactic to search her family's RV as they were on a cross-country vacation in March 2018. The predawn search on Interstate 70 turned up nothing illegal.\"I don´t feel safe driving through Kansas anymore,\" Maloney testified Monday in sometimes emotional testimony, the Kansas City Star reported.The lawsuit naming patrol Superintendent Col. Herman Jones seeks an order to stop the \"two step,\" which allegedly works like this: Troopers find a reason to make a traffic stop. As the trooper heads back to the patrol car, the trooper takes a couple of steps and then returns to again interact with the driver.The procedure buys time to continue seeking incriminating information and to get a drug-sniffing dog to the location - even if the trooper lacks reasonable suspicion, the lawsuit contends. The ACLU of Kansas says troopers target out-of-state motorists coming from places where marijuana is legal. Kansas is among the few states with no legalized form of marijuana.The bench trial, which means the judge will issue a verdict without a jury, is scheduled to last eight days.The trial is the third in recent weeks over how Kansas troopers conduct stops. Federal juries have twice found that individual troopers violated constitutional rights.",
        "Jones, a former county sheriff, was appointed by Democratic Gov. Laura Kelley in 2019. In a separate lawsuit, Jones was sued by five female current or former patrol employees who allege a hostile work environment, a culture of sexual harassment and gender discrimination under his leadership.Republican lawmakers have pressured Kelly to force him out. Jones is stepping down effective July 1 but has said he wasn't asked to leave.Arthur Chalmers, an assistant state attorney general representing Jones, said in court documents that patrol training \"strives to engage in best law enforcement practices,\" including formal instruction on Fourth Amendment issues arising from traffic stops.\"The constitutional right to travel is not infringed even if, as the Plaintiffs allege, out-of-state motorists are disproportionately stopped and detained after a traffic stop relative to Kansas motorists,\" Chalmers said in a court filing.Maloney's RV was pulled over for crossing the white line. The trooper gave Maloney a warning, then took a few steps back toward his vehicle before returning with more questions, dashcam video shown in court indicated.Eventually, the trooper said the family was being detained. A dog sniffed the RV's exterior, and three troopers searched the interior. Nothing was found and after about 40 minutes, the family was allowed to leave.",
        "Maloney said troopers damaged the toilet, dumped out clothes and left the bathroom door hanging off its frame, among other damage.\"I felt violated because this was our home while we were on the road,\" Maloney said."
    ]
}