{
    "articleURL": "/news/article-12061583/Interface-Constructions-Victoria-Pty-collapses-Construction-company-latest-fold.html",
    "content": [
        "Builder Interface Constructions Victoria has collapsedIt's the latest building company to fold in recent months A builder that specialises in commercial builds and educational facility upgrades has collapsed, becoming the latest casualty of Australia's building crisis.",
        "Melbourne-based company Interface Constructions Victoria Pty Ltd has entered administration following a number of credit inquiries since last month.Richard Lawrence and Richard Albarran from accounting group Hall Chadwick have been appointed as the administrators for the company, according to a notice on the ASIC website listed last Thursday.A virtual meeting with the creditors of the company is scheduled for this Friday.The aim of the meeting is to determine whether a committee of inspection should be appointed and who would be the members on that committee.",
        "Interface Constructions Victoria has completed builds and upgrades to educational facilities, childcare centres, commercial builds, hospitality facilities and residentials.One of the company's most recent projects was the construction of a performing arts centre at Narre Warren South P-12 College in May 2021. The builder constructed new facilities and refurbished an administration building at Seaford Primary School.They also completed builds at Kambrya College in Berwick, Bentleigh Primary School and Craigieburn Childcare Centre.Interface Constructions was not involved in any current projects that involve building any new government school at the time of its collapse, the Herald Sun reported. 'The department is assessing the impact of Interface Constructions Victoria Pty Ltd entering administration on the small number of government school building upgrade and modernisation projects that the company was involved in,' a government spokesperson said. ",
        "It comes as a number of contractors have slammed the company with negative reviews online, claiming they have not been paid for their work. 'Haven't paid contract painter for job completed in February. Non responsive to any communication. Notice of demand sent with no reply,' wrote one.'A disgrace to the Industry.''We have been trying to call to get payment for a job we did for them. The office does not respond any phone calls or give any update for payments,' said another. ",
        "Interface Constrictions is the latest in a long line of firms that have collapsed as the construction industry struggles against soaring prices for materials, rising inflation and labour costs.Victoria-based construction companies Porter Davis, Mahercor, The Lloyd Group, along with Gold Coast-based builder Qld Cedar Constructions, have all folded over the past month.Construction firms are still reeling from the impacts of the Covid pandemic and the global lack of timber and building materials due to choked supply chains impacted by the Russia-Ukraine conflict.This has led to the cost of materials rising by more than 20 per cent since the start of 2022, with some items surging by even more.Pine more than doubled in price, while reinforcing steel, glass, plasterboard, fibre cement and other materials also rose.",
        "Such price rises meant many fixed contract building projects were no longer viable.Across Australia, hundreds of millions of dollars are owed by failed companies to subcontractors, tradesmen, clients and the tax office."
    ]
}