{
    "articleURL": "/tvshowbiz/article-12041659/Fatima-Whitbread-breaks-tears-recalls-living-childrens-home.html",
    "content": [
        "Fatima Whitbread breaks down in tears during a conversation about living in a children's home in I'm A Celebrity South Africa scenes set to air on Wednesday. ",
        "The sportswoman, 62, recalled living in a children's home during a conversation with campmates Carol Vorderman, also 62, and Helen Flanagan, 32.She said: 'In the children's home when we were kids, we always had assigned jobs and we were always in that routine, You had to be, there were so many of us. 'The only way you would get your pocket money was to make sure your jobs were done throughout the week. 'I had two people in my life, Corrie and Aunty Ray. And Aunty Ray was an East End girl. She only lived down the road from me. ",
        "'I'd look out this little port window and watch when she went home because I would be really sad when she went off-duty.'She continued: 'And this one day I decided to pick all the daffodils and I hid them behind my back and I knocked on the door and when she opened the door, I said \"Will you be my mum?\"Getting emotional, she said: 'She told me, \"Fats, I've got to be mum to all you kids, so I can't always be here\"'Fatima struggles to contain her emotions and said: 'Sorry, I shouldn't have started that conversation.'What I am trying to say is that she taught me a lot about looking after the other kids and how you give and you receive - I think I have been in here too long, this is why I am getting upset...'",
        "Hugging her campmates, she added: 'I think you have to have a star in every child's life.' Talking to the camera later on, she said: 'There's been a lot of history that I've forgotten about in my life and when I spoke about it, it brought it to the surface again.'Back in 2011, Fatima spoke to the Daily Mail about her childhood. ",
        "She said her birth ‘mother’ — who she refers to as ‘that woman’ — was Turkish Cypriot; her biological father came from the Greek community of that bitterly divided island. Born in north London, Fatima was an unwelcome accident, which brought social disgrace. But for neighbours’ vigilance, she would have died of starvation while still a baby.Her mother abandoned her in a flat, and it was only days later that someone, alerted by the child’s cries, called the police.Fatima spent four months in hospital recovering from malnutrition, and her first 14 years in a series of children’s homes.Occasionally, distressingly, her biological mother would re-enter her life. The first time they met was deeply shocking, not least because young Fatima had not been warned that the woman was even alive.The pair were put in a car and driven to another children’s home, where Fatima’s half-brother and sister by her mother lived, and where little Fatima was to be moved. During the journey her mother barely spoke to her.",
        "Fatima later recalled: ‘When we arrived, a house-parent told me: “Go into the garden and meet your brother and sister.” As I wandered into the garden, my mother grabbed me and said: “This is your sister, and if you don’t look after her I cut your throat.”",
        "'This was my introduction to my biological mother, and from there things got worse.’When she approached her tenth birthday, social services decided Fatima should start visiting her mother in preparation for a permanent reunion.‘She turned up one day with some guys who were more or less pimps — they were there to take a look at me because by that time I was a big girl,’ she later recalled. ‘It was horrible.’When she visited her mother’s flat, she was made to do the housework. Later, when she was 13 and on another visit, her mother’s drunken boyfriend raped her. Fatima screamed, but all her mother did was hold a knife to her throat and tell her to shut up.The boyfriend came looking for her again and she had to hide in her half-brother’s bedroom, where he was having sex with his girlfriend.Profoundly disturbed by these events, Fatima was often in trouble at school. It was a ‘nightmare of a childhood’, but one which was about to change profoundly for the better.",
        "She met ‘my true mother’, Margaret Whitbread, during a school netball match, shortly before her 14th birthday. Mrs Whitbread was refereeing and took Fatima to task for arguing with her decisions.Shortly afterwards, Fatima took up javelin at the local athletics club. The coach turned out to be the netball referee, who said: ‘Oh no, not you! If you behave like you did on the netball court, there’s no chance!’But Fatima had no intention of misbehaving — she had found a woman she trusted and respected, and who showed her warmth and encouragement in return.Such was the strength of the bond that quickly grew between them that Fatima was soon afterwards adopted by Mrs Whitbread and her husband, who had two sons of their own.Under her adoptive mother’s guidance, Fatima won a bronze medal at the 1984 Olympics and a silver four years later.Her greatest glory came in the European Championships in Stuttgart in 1986, when she smashed the javelin world record, and a year later she was crowned world champion in Rome.Snide remarks about her muscular physique and rumours linking her with performance-enhancing drugs dogged her career. She addressed these directly after she had retired. Her strength, she said, came from ‘incredibly hard work and amazingly hard eating’.",
        "She explained: ‘I’m 5ft 5in and I was competing against girls of up to 6ft with a range of movement far greater than mine. To beat bodies like that, I had to make myself stronger, faster and more powerful than them.‘I had to force-feed myself on a daily basis; large meals, then a high-protein drink with three eggs, bananas, ice cream and milk. A pint of that twice a day. I know it did strange things to me. My body didn’t function like a normal woman.‘My breasts just disappeared beneath the muscle. I didn’t have periods for seven or eight years. I was told I couldn’t have carried a child because the lining of the womb had become too thin. Sure, it was strange. But it had to be done.’Whitbread last competed in 1989. She was still only 27 and should have had her best years ahead of her. An Olympic gold medal was surely within her reach.But a persistent shoulder injury dogged her for almost three years before she decided to quit for good. That moment came in 1992 when she tried a few simple exercises prior to seeing yet another specialist for help. Almost immediately her shoulder dislocated, as it had done previously.Her coach — and adoptive mother — Margaret, was at her side. Neither said a word; their remarkable sporting odyssey had drawn to a close.",
        "By that stage, another hugely influential, quasi-parental figure had entered her life.Eighteen years Fatima’s senior, Andrew Norman was a former policeman who, by the Eighties, had become the most powerful figure in British athletics.As promoter and agent, he dominated the sport’s move from the ‘shamateurism’ of under-the-table payments to open, full-time professionalism.Norman’s abrasive style and monopolistic influence made him as many enemies as it did important contacts and clients.One of those he took under his wing was Fatima. The pair eventually became lovers. Whitbread’s increasingly close relationship with Norman was said to have contributed to the promoter’s estrangement from British Olympic middle-distance champion Steve Ovett, whom he’d mentored since his teens.When Norman was invited by Ovett to the runner’s home, he turned up with Whitbread on his arm, rather than his Norwegian wife, from whom he was later divorced. Ovett was not impressed. It was not until Whitbread’s professional career had ended that her relationship with Norman was made public, and even then only after they became engaged in 1992.Two years later, her fiancé was fired from his job as promotions officer of the British Athletics Federation, after a coroner said that allegations of a sexual nature Norman had made against a sports writer who had been a persistent critic of his in the media had contributed to the journalist’s suicide.By then, with Norman’s considerable assistance, Whitbread had swapped her throwing vest for a new role as president of a sports marketing firm. It attracted the cream of British athletics as clients. Most, if not all, were also represented by her husband.The pair had married in 1997 and — her body having returned to functioning normally after her retirement — had a son, Ryan, who is now 25. Their £1 million home in the Essex commuter belt was a world away from Fatima’s own childhood circumstances. But their personal relationship soon faltered. Norman’s work increasingly took him to South Africa, where he wanted the family to make their home. But Fatima had little interest in moving.In 2005, she announced that they were separating amid rumours that her husband’s romantic attentions had become focused on an East European runner. Norman laughed off the stories, but the couple were still estranged when he died suddenly, two years later, aged 64.The impact of this latest of many cruel twists in Fatima's life was revealed in a public court in 2009 after she was caught for speeding, having driven at 116mph to get back to her Essex home.She broke down as she told magistrates that the recent deaths of her husband and her father-in-law had left her both an impoverished single parent and the main carer to Norman’s severely disabled mother.I'm A Celebrity... South Africa airs tonight at 9pm on ITV1 and ITVX "
    ]
}