{
    "articleURL": "/wires/reuters/article-12055537/Tyler-Reddick-expects-early-tests-serve-playoffs.html",
    "content": [
        "KANSAS CITY, Kansas -- Almost assuredly, Tyler Reddick will qualify for the NASCAR Cup Series Playoffs, thanks to his March 26 victory on the road course at Circuit of the Americas in Austin, Texas.",
        "But the driver of the No. 45 23XI Racing Toyota hasn't adjusted seamlessly to the transition to his new Toyota team. In fact, after moving from Richard Childress Racing to 23XI to start the 2023 season, Reddick has suffered through some spotty results on paved oval tracks.\"Honestly, I like to look at the `What ifs' to a degree,\" Reddick said. \"We've had a lot of other good races that have kind of gotten away from us. But this is a new venture for me -- my first year with Toyota, first year with this team and just trying to get to know everybody.\"I think, from that standpoint, we're doing a really good job of that. It's really great that we have that win, but we're just building on all the important things that matter when the playoffs come around.\"The numbers, while we'd certainly like to have a few more here or there in certain columns, it's just about going through these experiences and learning together, so when it comes time to get down to business in the playoffs, we've gone through all those trials and we're ready.\"Reddick comes to Kansas Speedway with extra motivation. The No. 45 Camry he drives swept last year's two races at the 1.5-mile track -- with two different drivers behind the wheel.",
        "Kurt Busch won the spring race, and after Busch was sidelined with concussion-like symptoms, Bubba Wallace moved from his customary No. 23 to the No. 45 and won the playoff race at Kansas last September.With the start of the new season, the No. 45 went to Reddick, who has a chance at Sunday's AdventHealth 400 to be the third straight different 23XI driver to win a race at Kansas.\"This is a track where I had a lot of speed last year in both events (in the No. 8 RCR Chevrolet) but just couldn't quite put the whole race together,\" said Reddick, who finished 30th at the May 15 race, and 35th at the Sept. 11, 2022 event.\"I'm really excited to get back here, obviously. I had to race against 23XI here last year, and it was really cool to see all the speed they had, knowing that I was going to be going there at some point.\"--By NASCAR Wire Service, Special to Field Level Media"
    ]
}