{
    "articleURL": "/news/article-12046523/Boyfriend-aspiring-model-plunged-death-confessed-remembered-punching-her.html",
    "content": [
        "Dezirae Andersen, 20, fell to her death after a violent row with her boyfriend on Tuesday nightShe had been staying with her boyfriend Tyler Griffen, 24, at the hotel after traveling from ColoradoGriffen has now appeared in court to be arraigned on charges of assault, reckless endangerment and acting in a manner injurious to a child under 17The boyfriend of an aspiring model who plunged to her death from the top of a Times Square hotel has confessed to cops that he 'remembered punching her' moments before.",
        "Dezirae Andersen, 20, was found dead after falling from the roof of the OYO Times Square hotel on West 47th Street around 10.30pm on Tuesday.Andersen and her boyfriend Tyler Griffen, 24, had been staying in the hotel with their eight-month-old baby girl after traveling from Littleton, Colorado.Hours before her death, Andersen - who also had ambitions to be an actress - posted a video of Times Square on her social media, with her friends since paying tribute to the 'beautiful soul'. ",
        "Griffen allegedly punched Andersen repeatedly during the incident that started on the 10th floor and spilled out into the hallway, police have said. He is also accused of yanking Anderson's infant's arm so forcefully that the eight-month-old child tumbled down a flight of stairs.A hotel guest caught the infant, who miraculously did not sustain any injuries in the fall, but was hospitalized for an evaluation.Authorities say that Andersen then made her way to the roof before jumping to her death. Police responded to a 911 call reporting an assault.When officers arrived, they discovered the young woman on the second-floor scaffolding outside of the hotel, unconscious and unresponsive.On Wednesday at the Manhattan Criminal Court, Judge Paul McDonell released Griffin, who has no criminal record, following the arraignment.",
        "According to the New York Post, Griffen told police in a recorded statement: 'I remember punching my girlfriend.'    A GoFundMe has been set up for the young mother to help her family return her body to Colorado.",
        "Friends and family have paid tribute to Andersen, writing that she was a 'great mama' and that her 'name will live on in your daughter.'One said: 'My heart hurts in disbelief got me ballin my eyes out!! You were such a beautiful young soul &amp; a great mama.'You didn't deserve this at all mann!! imma miss you girlie fly high beautiful.'Another said: 'Bro my heart hurts so much. I loved you so much, I'll make sure your name lives on and your baby is taken care of.'You were turning 21 this month and we had so many plans to travel. You were my sister. I can't believe you're gone,' one mourner wrote.",
        "An NYPD spokesperson previously told DailyMail.com that 'further investigation determined that a female and 24-year-old male had an altercation at the hotel room at location where an eight-month-old female child was present.'Griffen was taken into custody on Tuesday and arrested on charges of assault, reckless endangerment and acting in a manner injurious to a child under 17.He was described as being in an emotionally disturbed state and had to be shocked with a stun gun in the lobby of the hotel as they took him into custody.",
        "The city's Medical Examiner's office has not yet determined the manner and cause of death. Police said the eight-month-old baby will be under the care of The city's Administration for Children's Services. "
    ]
}