{
    "articleURL": "/wires/ap/article-12052227/Expelled-GOP-lawmaker-fails-regain-Arizona-House-seat.html",
    "content": [
        "PHOENIX (AP) - Republican lawmaker Liz Harris who was previously expelled will not be sent back to the Arizona House of Representatives, Maricopa County officials announced Friday.",
        "The county's Board of Supervisors instead selected Republican Julie Willoughby to replace her, despite Republican precinct committee members in her legislative district giving Harris the most votes.\"In my discussions with Ms. Harris, she firmly believes her removal was improper and unlawful,\" said Supervisor Jack Sellers, who represents an area that includes the legislative district. \"This board was not a party to that process but must give weight to an action that over two-thirds of the House members voted in favor of.\"Willoughby, an emergency room trauma nurse, teamed up with Harris in campaign ads and events during last year's election. They had hoped to win both district seats, but Harris and Democratic Rep. Jennifer Pawlik emerged as the top two vote-getters.Harris was kicked out last month in a bipartisan vote for organizing a presentation where an Arizona insurance agent made unsubstantiated accusations that a wide range of politicians, judges and public officials of both parties took bribes from a Mexican drug cartel.A prominent supporter of discredited election conspiracies, she was also found by the House Ethics Committee to have engaged in \"disorderly behavior\" in violation of the chamber´s rules.",
        "The committee´s report said Harris knew that the person she invited to the legislative hearing in February would accuse her colleagues of criminal activity, that she took steps to hide it from House leaders ahead of time and then misled the committee investigating her actions.",
        "Her removal came less than a week after Tennessee Republicans voted to expel two Black Democrats, a decision that made that state a new front in the battle for the future of American democracy. But the Arizona vote did not carry the same partisan and racial overtones. Instead, there was widespread and bipartisan condemnation for Harris´ actions.Tennessee Reps. Justin Pearson and Justin Jones were reappointed by local officials to return to the Legislature."
    ]
}