{
    "articleURL": "/news/article-12054981/Incredible-footage-inside-red-arrow-jets-soar-cloudy-London.html",
    "content": [
        "Red Arrows display trailed red, white and blue smoke as they flew over The MallIn stunning footage the famous formation appears almost in touching distanceSkimming below the potent cloud cover, the incredible jets hold a steady pathThis is the stunning footage from inside the cockpit of a Red Arrow - as it soared over cloudy London.",
        "Looking down the nose of the scarlet jet, streets and skyscrapers unfold as the plane speeds towards its destination.And from either side of the cockpit, the formation appears almost in touching distance - with white plumes already stretching out behind them.As they follow the river West into London, these soon transform into the iconic red, white and blue the display team are known for.Skimming below the potent cloud cover, the incredible jets hold a steady path towards Buckingham Palace.",
        "As Hyde Park and the Serpentine - just by the Palace - appears below them, the pilot turns the camera towards himself and gives a confident thumbs up. Fly-past complete, the nine Hawk T1As banked elegantly to the right on their way out of the capital.At the end of the day 'unsuitable weather conditions' meant the planned flypast was curtailed to just the Red Arrows and a helicopter display which still enthralled the royals, who included the Princess Royal, Duke and Duchess of Edinburgh and their children and the King and Queen's pages of honour. The RAF's Red Arrows display team trailed red, white and blue smoke as their jets flew over the crowds gathered on The Mall and outside the palace. More than 60 aircraft from the Royal Navy, British Army and Royal Air Force had been due to take part in the flypast, but 'unsuitable weather conditions' meant that plan had to be abandoned.",
        "Instead, helicopters from the three services and the Red Arrows took part in the display which lasted for around two-and-a-half minutes. The King and Queen smiled and waved to the crowds as the aircraft flew overhead. The RAF acknowledged it was 'disappointing that the poor weather prevented all of our aircraft participating in the flypast'. In a social media post, the RAF said: 'The safety of spectators and our pilots and crew always comes first and the conditions weren't right for the other planned aircraft to join the flypast today.",
        "'We are hoping for clear blue skies in June for The King's birthday flypast.' Footage from Royal Navy helicopters showed how poor the weather was in the skies above London. Rain streaked the windshields of the aircraft as they flew low over the heart of the capital. The flypast involved 16 Juno, Wildcat, Merlin, Apache, Chinook and Puma helicopters and nine Red Arrow Hawks.The King and Queen set the seal on their coronation day by twice appearing on Buckingham Palace's balcony to acknowledge the nation. Charles and Camilla, in lavish robes and wearing their crowns, returned with a wave the cheers of the crowds who braved downpours during a ceremonial military celebration not seen for 70 years. The Prince and Princess of Wales and their children, Prince George, Princess Charlotte and Prince Louis, joined the monarch and his wife and then well-wishers were treated to an encore with just the King and Queen. ",
        "Making their first balcony appearance of the King's reign, the couple looked relaxed after the momentous coronation, watched around the globe. ",
        "It was the fulfilment of Charles' destiny, but followed the death of his mother, Queen Elizabeth II, after a 70-year reign. The event brought together around 100 heads of state, kings and queens from across the globe, celebrities, everyday heroes and family and friends of the couple. Global popstars Lionel Riche and Katy Perry were part of the 2,300-strong congregation, as was French President Emmanuel Macron, actresses Dame Judi Dench and Oscar-winner Dame Emma Thompson, presenters Ant and Dec and King Willem-Alexander and Queen Maxima of the Netherlands. Pomp and pageantry were to the fore, with the Armed Forces staging the biggest ceremonial military operation since Queen Elizabeth's 1953 coronation, culminating in a 4,000-strong coronation procession of servicemen and women from across the globe that wound its way through the heart of the capital. Charles' grandson Louis, who turned five a few weeks ago, lighted the mood as he yawned and fidgeted during the ceremony, while big brother George was a page of honour helping to hold the long train of the King's robe. The historic moment came a few minutes past midday, when the Archbishop of Canterbury Justin Welby placed St Edward's Crown on Charles' head and he became the 40th reigning sovereign to be crowned at Westminster Abbey, the nation's coronation church since 1066. ",
        "The coronation was a spiritual and deeply personal event for the King, a 'committed Anglican Christian', who was anointed, seen kneeling at the abbey's high altar and received homage from his son and heir, the Prince of Wales. William's interaction with his father, where he touched St Edward's Crown then kissed the King on the right cheek, appeared a poignant moment for the head of state. As William knelt before Charles, who held his son's hand between his palms, the future monarch said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.'",
        "The King's estranged son the Duke of Sussex was among the congregation, sitting two rows behind his brother with the Duke of York's family, and he was seen intently watching the crowning. And when a few minutes later the congregation was invited pay homage to the new monarch, Harry spoke, along with the other royals around him, the words: 'God save King Charles. Long live King Charles. May the King live forever.' Charles delivered a King's Prayer, the first time a monarch has spoken words to God aloud during a coronation, and he prayed to be a 'blessing' to people of 'every faith and conviction'. ",
        "In his sermon the archbishop told the nation's new monarch 'we crown a King to serve'. Mr Welby spoke of how 'Jesus Christ was anointed not to be served, but to serve' - adding: 'The weight of the task given you today, Your Majesties, is only bearable by the spirit of God.' The ceremony had five main elements: the Recognition; the Oath; the Anointing; the Investiture and Crowning; and the Enthronement and Homage, as well as the Queen's coronation. Tracing it roots back to the medieval period the Christian ceremony, not witnessed for 70 years when Queen Elizabeth was crowned, saw the King dressed in a series of garments signifying a symbolic journey which concluded with him anointed with holy oil during its most sacred moment and crowned. It reflected the diversity of the of UK, with representatives from the nation's faith communities playing an active role in the coronation of a monarch for the first in history. But in a change, the controversial 'Homage of the People' element of the service was toned down after there was widespread criticism. ",
        "Mr Welby 'invited' a show of support from the congregation rather than a 'call' to those in the abbey and elsewhere to swear allegiance to the King. Charles who wore the Imperial State Crown and Camilla Queen Mary's Crown, were among the last to leave the balcony during an appearance which lasted almost 10 minutes and saw the crowd sing along when the national anthem was played. ",
        "But they were back a few minutes later by themselves and received a cheer from the crowds as they waved. Away from the pageantry the Met Police were heavily criticised over the 'incredibly alarming' arrests of Republican protesters ahead of the coronation. Campaign groups said Saturday's arrests, including that of the chief executive of anti-monarchy group Republic, were 'something you would expect to see in Moscow, not London'. It said 52 people had been arrested for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance around the coronation.Metropolitan Police Commander Karen Findlay acknowledged concerns about the arrest of protesters but defended Scotland Yard's actions, saying: 'Our duty is to do so in a proportionate manner in line with relevant legislation.'"
    ]
}