{
    "articleURL": "/wires/reuters/article-12048563/Apple-iPhone-sales-rise-pushing-results-estimates.html",
    "content": [
        "By Stephen Nellis",
        "May 4 (Reuters) - Apple Inc executives on Thursday forecast gross margins above Wall Street expectations despite predicting a slight fall in revenue in the company's current fiscal third quarter.The forecast came after Apple reported fiscal second-quarter revenue and profit above Wall Street's expectations, with iPhone sales rising and wearables sales slipping less than analysts had feared despite a continuing slump in the consumer electronics market and a cloudy economic outlook.Apple said sales for its fiscal second quarter ended April 1 fell 2.5% to $94.84 billion, better than analyst expectations of a 4.4% decline to $93 billion, according to data from Refinitiv. Profit was flat at $1.52 per share, compared with estimates of a 5.7% fall to $1.43 per share, according to Refinitiv data.Chief Financial Officer Luca Maestri said Apple's gross margin will be between 44% and 44.5%, above estimates of 43.7%, according to Refinitiv data. But he also said Apple's revenue will likely decline slightly. Analysts were expecting a 2.1% increase to $84.7 billion for the company's fiscal third quarter that ends in June.For the moment investors seemed satisfied, with shares rising about 2% in after-hours trading after the forecast.A 1.5% rise in Apple's iPhone revenue contrasted with the broader consumer electronics industry, which is grappling with a decline in sales of smartphones, tablets and PCs as consumers and businesses who scooped up electronics during the pandemic tighten spending amid rising interest rates and economic uncertainty. The company also held its dividend and stock buyback programs roughly in line with its last update to them a year ago, approving $90 billion in additional buybacks.",
        "Apple's stock has outperformed most of Wall Street in 2023, up 28% year-to-date, with investors seeing the world's most valuable company as a defensive play during a time of economic uncertainty.Apple CEO Tim Cook told Reuters in an interview on Thursday that the company set a fiscal second-quarter record for iPhone sales, thanks in part to picking up new users in markets such as India, where Cook recently traveled for the opening of the company's first retail stores in the country.\"We were thrilled by our performance in emerging markets,\" Cook said. \"We set records for the iPhone installed base in every geographic segment, and we had very strong 'new to' (sales in) emerging markets, particularly in Brazil, India and Mexico.\"Cook also said supply-chain snarls have vanished.\"We had no material shortages at all during the quarter across any of the products,\" he said.But not all of Apple's business lines were immune to the electronics slump, with sales of Macs falling sharply while iPad revenue slipped. Sales in China also dropped 2.9% to $17.8 billion, a slightly larger drop than overall revenue.\"Apple still needs China on a near-term basis to drive sales and profits,\" said Tom Forte of D.A. Davidson. \"Long-term, emerging markets are important, especially India from a supply chain and sales standpoint.\"",
        "Other firms in the industry have predicted a rebound in the second half of the year, and Wall Street expects Apple to recover faster and show modest year-over-year revenue growth during its fiscal third quarter ending in June.Apple has in recent weeks announced new service businesses such as a high-yield savings account, but investors are still waiting to see the company's next major hardware product. Bloomberg has reported the iPhone maker could unveil a mixed-reality headset as soon as next month, when it holds its annual software developer conference.IPhone sales rose 1.5% to $51.33 billion, compared with analyst expectations of a 3.3% decline to $48.9 billion, according to Refinitiv. Those results occurred against the backdrop of a 13% decline in global smartphone shipments during the first three months of 2023, during which the research firm Canalys said Apple gained market share against Android rivals.Mac sales fell more than 30% to $7.17 billion compared with analyst estimates of a 25% decline to $7.8 billion, according to Refinitiv. Apple's sales fared only slightly better than PC unit shipments in the market, which fell 33% in the calendar first quarter, according to Canalys data.Sales in Apple's wearables business, which includes devices like AirPods and the Apple Watch, fell less than 1% to $8.76 billion, compared with estimates of a 4.4% drop to $8.4 billion.",
        "Apple's biggest growth segment was its services business, which includes products like iCloud and Apple Pay, which grew 5.5% to $20.9 billion, in line with analyst expectations. Cook said Apple now has 975 million subscribers on its platform, which includes both Apple services and third-party apps, up from 935 million last quarter and an increase of 150 million from a year ago.Apple said its board of directors authorized a 24 cents-per- share dividend in addition to share repurchases. Both were roughly the same as the 23 cents-per-share dividend and previous $90 billion share repurchase increase the company announced a year ago.(Reporting by Stephen Nellis in San Francisco and Yuvraj Malik in Bengaluru Additional reporting by Noel Randewich in Oakland, California Editing by Peter Henderson and Matthew Lewis)"
    ]
}