{
    "articleURL": "/news/article-12042421/Colorado-woman-20-plunges-death-Times-Square-hotel-Man-24-arrested.html",
    "content": [
        "The male identified as Tyler Griffin of Littleton, Colorado, was taken into custody He was arrested on charges of assault, reckless endangerment and acting in a manner injurious to a child under 17, an NYPD spokesperson told DailyMail.comThe 20-year-old women died; her identity has not been released until her family is notified. Her 8-month-old baby girl was unharmedA 20-year-old Colorado woman plunged to her death from a swanky boutique hotel in midtown Manhattan leaving behind her eight-month-old daughter after she got into a heated argument with her 24-year-old boyfriend, who was later arrested. ",
        "Police responded to a 911 call of an assault in progress at the Oyo Hotel in Times Square at 157 West 47th Street on Tuesday night. When officers arrived around 10:27pm they discovered the young woman on the second floor scaffolding outside of the hotel unconscious and unresponsive. She was later pronounced dead. An NYPD spokesperson told DailyMail.com that 'further investigation determined that a female and 24-year-old male had an altercation at the hotel room and location where an 8-month-old female child was present.'The woman's boyfriend Tyler Griffin of Littleton, Colorado was described by the authoritiesBedf as being in an emotionally disturbed state and had to be shocked with a stun gun in the lobby of the hotel as they took him into custody, as per NBC4 News.The young mother's identity has not been released until next of kin is notified.",
        "Griffin was arrested on charges of assault, reckless endangerment and acting in a manner injurious to a child under 17, the spokesperson said. He was transported to Bellevue Hospital for evaluation.Tuesday evening police received multiple calls regarding a disturbance in a room on the 10th floor of the Times Square hotel and then a call regarding a roof jump, according to the news outlet.When police arrived they found Griffin in the room where the 20-year-old woman had been staying. The room had been trashed, as if there had been some type of altercation, as per the authorities.",
        "A source told The New York Post, 'all hell broke loose in the room.'The fight later spilled out into the hallway. During the argument, the woman's boyfriend allegedly yanked the baby's arm 'in a forceful manner.' The baby then tumbled down the stairs to the ninth floor, police and sources said, according to the news outlet. A hotel guest caught the infant, who miraculously did not sustain any injuries in the fall, but was hospitalized for an evaluation, police said. Police said the young woman was allegedly punched 'repeatedly,' by Griffin, leaving her bruised. It is unclear if Griffin was the baby's father.",
        "After the harrowing scene, witnesses had lost track of the couple's whereabouts, but police and sources believe the young mother made her way to the roof of the hotel building and jumped.The authorities said they do not believe the young mother was thrown by Griffin, though it is unclear if the young man attempted to harm the child when the couple had a fight.Authorities said they do not believe at this point that Griffin threw the young woman or pushed her off the building, according to NBC4 News.An NYPD spokesperson told DailyMail.com on Wednesday that a preliminary investigation had determined that the woman's injuries are indicative of a fall from an elevated position. ",
        "The city's Medical Examiner's office has not yet determined the manner and cause of death. Griffin's arraignment was scheduled for Wednesday.Police said the city’s Administration for Children’s Services will be taking the baby under their care."
    ]
}