{
    "articleURL": "/tvshowbiz/lewis-capaldi/article-12042087/The-parents-Lewis-Capaldi-grounded-look-Scottish-singers-family.html",
    "content": [
        "Lewis Capaldi fans got a closer look at his life away from the camera in his new Netflix documentary, How I'm Feeling Now, with his mother and father appearing throughout.",
        "The singer, 26, who has two brothers and a sister, has a close relationship with both his parents and moved back home with them during the pandemic.He even introduced them to new girlfriend Ellie MacDowall during a trip to Hollywood this week.Lewis' mum Carol Capaldi is a nurse while his father Mark is a fishmonger, who reside in Bathgate.The pair were shown supporting Lewis at his concerts and through his struggle with Tourette's in the documentary, but they came under fire for being 'too harsh' to the singer.",
        "In one scene, Lewis plays a new song he is working on to his parents. After he is finished, his father said: 'It's sh***. Is that it?'Lewis' mother revealed just how close their relationship truly is as she said: 'You've still got a lot of growing up to do. You need to phone your mother to come and pick you up from your one-night stand, because you're having a panic attack.' In another clip, Lewis is struggling with a shoulder twitch and Mark is very insistent that he gets help, saying: 'I thought you were going to do something about it. How do you get rid of it?'It is clear the comments were made out of worry for their son Lewis - which TikTok viewers soon picked up on, praising Carol and Mark for being so 'down to earth'.",
        "One said: 'Thought your mum &amp; dad were amazing, so supportive of Lewis &amp; everything he does!'Another commented: 'I think your mum and dad were amazing. amazing support for an amazing guy. They don't understand scottish banter clearly.Meanwhile a third said: 'I actually love the fact Lewis comes from a normal down to earth typical Scottish family. that's the first thing I said when I saw your parents! X'Lewis is the youngest of four and admitted he was inspired by his older brother to get involved in music when they were kids.His sister Danielle recently hit back at trolls who have taken aim at their parents, following the release of the singer's emotional Netflix documentary.In the film, How I'm Feeling Now, the musician, 26, travels back to his family home in Scotland following the success of his first album, Divinely Uninspired to a Hellish Extent, and begins to write his second.It also explores the singer's journey with Tourette's syndrome, after doctors picked up on his uncontrollable shoulder twitch.But trolls have taken aim at Lewis' parents Mark and Carol following the release of the film on April 5, saying that they came across as 'harsh'.",
        "The Somebody You Love hitmaker's big sister took to TikTok on Tuesday to shut down the negative comments directed at their parents, saying that the trolls haven't understood their 'Scottish patter'.",
        "Danielle, 30, showed she shared her brother's famous dry humour, posting a picture where they both showed their middle fingers to the camera in a gesture aimed at trolls.She captioned it: 'when reading negative comments on parents.'Danielle, who is a teacher, said: 'Lewis' documentary has had a lot of positive responses but unfortunately there will always be people who have to look for problems where there arent any.'If you dont get scottish patter or parents who were worried about their son, dont comment.'Replying to a comment saying their Dad comes across as 'harsh', she added: 'We didn't know he had Tourette's at this point.'He went through me having MH issues that looked nothing like Lewis' tics. He wanted him to get help.'Danielle was referring to Mark's blunt comments throughout the documentary.However, Mark also shared many sweet memories of Lewis. for example, he recalled in the documentary how Lewis would perform for the whole family: 'Lewis would always go in his room, just sit for hours practicing and then he'd come down and we'd all be excited, go in the kitchen and he'd say, 'I've learnt this.'Lewis suffered from uncontrollable tics while performing his song Fade at his first ever show in Wembley in 2020.",
        "He was then diagnosed with Tourette's after doctors picked up on his uncontrollable shoulder twitch.Tourette's is a neurological condition that causes you to make involuntary movements and sounds called tics.The diagnosis provided some peace of mind for the singer as it made 'complete sense'.As for his anxiety, Lewis has been told with medication, exercise and a change in diet he could see a drastic improvement.New release: How I'm Feeling Now started streaming on April 5He thinks he may even have to quit his music career if things continue to get worse for him.Musician Lewis told The Sun : 'You can probably see it now — I'm twitching a lot ahead of this record. It's weird because I wasn't doing it as much on the first album, but I wasn't as stressed.",
        "'There's a lot more going on in my life now. The biggest thing undoubtedly is second record pressure. It's triggered by stress, anxiety, and excitement. Basically, any strong emotion, you're f**ked.'The singer shot to fame in 2019 after his hit single Somebody You Loved topped the UK Singles Chart for six weeks - and which recently became the UK's most streamed song of all time.He has now achieved four number ones and his debut album, Divinely Uninspired To A Hellish Extent, sold over 10 million copies worldwide",
        "His second album Broken By Desire To Be Heavenly Sent will be released in May, before he performs at Glastonbury Festival in the summer.",
        " Tourette's syndrome is a neurological condition characterised by a combination of involuntary noises and movements called tics.It usually starts during childhood and continues into adulthood. Tics can be either be vocal or physical.In many cases Tourette's syndrome runs in families and it's often associated with obsessive compulsive disorder (OCD) or attention deficit hyperactivity disorder (ADHD).Tourette's syndrome is named after the French doctor, Georges Gilles de la Tourette, who first described the syndrome and its symptoms in the 19th century. There's no cure for Tourette's syndrome, but treatment can help to control the symptoms. Source: NHS Choices"
    ]
}