{
    "articleURL": "/tvshowbiz/article-12051791/Frozen-actor-Jonathan-Groff-lands-mystery-role-Doctor-Jinkx-Monsoon-added-cast.html",
    "content": [
        "Frozen actor Jonathan Groff has landed a mystery role on the iconic British sci-fi series Doctor Who, it emerged this week.",
        "The show, which began in its first incarnation in 1963, follows the exploits of a 'Time-Lord' called the Doctor who travels through various historical eras.A string of actors including David Tennant and Matt Smith have played the Doctor, who periodically 'regenerates' and assumes a new body.  Rwandan-born thespian Ncuti Gatwa is taking on the role for the first time in the upcoming season, which is slated to premiere in 2024.Now the BBC has told Deadline that Jonathan will enter the cast in a 'mysterious guest' capacity and 'jump aboard the TARDIS.'",
        "The TARDIS, which is able to travel through both space and time, is the Doctor's mode of transport and is famously disguised as a telephone box.Russell T Davies, the program's showrunner, crowed: 'This is an incredible coup, and a great honour, to get such a huge star striding on to our set. So strap on your space boots, this is going to be a blast!' Jonathan will be part of a cast that includes Coronation Street alumna Millie Gibson, 18, as the Doctor's 'companion,' aka his human sidekick. The current revival of the show was kickstarted by Russell in 2005 after the legendary program had been dormant for 16 years.He left the show in 2010 to make way for Steven Moffat, who was ultimately succeeded by Chris Chibnall until last year, when Russell returned.",
        "During his time away from Doctor Who, Russell wrote such programs as A Very English Scandal about the Thorpe Affair and It's A Sin about the AIDS crisis. Jonathan first shot to fame on Broadway in the 2006 musical Spring Awakening opposite rising starlet Lea Michele.Lea and Jonathan reunited when he achieved TV notoriety during his recurring guest run on Glee, where she was part of the principal cast.",
        "Since then he has made his presence felt in a number of high-profile projects including the Disney film Frozen and the original Broadway cast of Hamilton.News of his casting on Doctor Who comes on the heels of first look images showing RuPaul's Drag Race winner Jinkx Monsoon in a villainous role.Wrapped in robes designed with a piano motif, Jinkx' character was festooned in jewelry and could be seen shooting the camera a sinister grin. ''Here is your first look at @JinkxMonsoon in character… as the Doctor’s most powerful enemy yet! #DoctorWho,' wrote the show's official Twitter account."
    ]
}