{
    "articleURL": "/wires/ap/article-12052895/Hockey-helped-Packers-Van-Ness-develop-1st-round-pick.html",
    "content": [
        "GREEN BAY, Wis. (AP) - The Green Bay Packers hope first-round pick Lukas Van Ness terrorizes quarterbacks the same way he used to intimidate opponents on the hockey rink.",
        "Van Ness gravitated to hockey as a child growing up in the Chicago suburb of Barrington, Illinois. Even after football became his primary sport, Van Ness continued playing hockey through his senior year of high school.\"Hockey was just a secondary love that I continued to play, again, just because I loved it and I loved the conditioning and the violence and the physicality of the sport,\" Van Ness said Friday from the Packers' rookie minicamp.Van Ness, a lifelong Chicago Blackhawks fan, believes his hockey background made him a better football player.\"Hockey is a very fast-paced sport,\" Van Ness said. \"I´m stick-handling with the puck. I´m looking to make different plays and passes down the ice. It taught me to use my eyes, use my vision, trust in what I´m seeing. My motor.\"I have size-17 feet. I was carrying some boats around as my skates. It was almost like I had five-pound weights skating around, getting good conditioning. So my motor, my effort, physicality, all that I believe came from hockey.\"",
        "The Packers believe the physical skills that were evident on the ice and on the field made Van Ness worth taking with the 13th overall pick.This marked only the second time in the last 14 drafts the Packers had a top-15 overall selection. The other time came in 2019, when the Packers chose pass rusher Rashan Gary at No. 12. Gary played in fewer than 25% of the Packers´ defensive snaps his rookie season but has totaled 15 1/2 sacks over his last 25 games.",
        "\"I plan to take notes behind his back when he´s not even watching and just learn as much as possible,\" Van Ness said.Gary is recovering from a torn anterior cruciate ligament suffered last November, so the Packers may need Van Ness to contribute right away.Van Ness showed in college he can develop in a hurry. After arriving at Iowa as a three-star prospect and redshirting during the pandemic-shortened 2020 season, Van Ness totaled 13 1/2 sacks and 20 tackles for loss from 2021-22.\"The tackles in this league and the guards in this league are very, very good, so at some point you have to have some kind of physical trait to beat a guy,\" general manager Brian Gutekunst said last week. \"Just like Rashan, Lukas has those.\"The Packers should know Van Ness pretty well already.Iowa defensive line coach Kelvin Bell and Packers defensive line coach Jerry Montgomery are former Iowa teammates. Montgomery´s son Jayden is a linebacker at Iowa.\"Jerry´s been down for spring practices just during the recruitment of Jayden, so Jerry has seen Lukas from way before he was a Packer,\" Bell said. \"It´s just a really good situation for Lukas because of that familiarity.\"Bell says Van Ness´ versatility makes him intriguing. Although the Packers plan to use Van Ness as an outside linebacker, he was a college defensive end who also had the ability to play inside.",
        "\"I really believe if Lukas attacks the X´s and O´s the way he did at Iowa, I can see Lukas being used up and down the line of scrimmage like the keys on a piano, not just being at one spot,\" Bell said. \"He´s a sharp kid with big, long arms, has got some physical gifts where he can play up and down the line of scrimmage. He doesn´t need to be just a left shoe or a right shoe. He can play a lot of different spots.\"Just don´t expect him to be playing on any nearby rinks. Van Ness said he hasn´t so much as worn a pair of skates since beginning his college football career.\"I doubt they would fit anymore,\" the 6-foot-5 Van Ness said. \"I was 220 pounds coming out as a senior and I´m about 270 now. I would be interested to see if they would fit.\"___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}