{
    "articleURL": "/news/article-12040455/Kevin-Costners-net-worth-said-upwards-250-million.html",
    "content": [
        "Oscar-winner Kevin Costner is among the most wealthy stars in Hollywood with a range of financial interestsThe actor was one of the best paid in the 1990s and now earns a reported $1.5 million per episode for YellowstoneIn 2011, Costner sold $52 million worth of equipment to BP through his environmental clean-up company In 1994, Kevin Costner divorced his college sweetheart and mother of his three children with the split costing him a reported $80 million. ",
        "Following the news that Costner is to split from his current wife of 19 years, Christine Baumgartner, it has also been reported that the Dances With Wolves star has a pre-nuptial agreement. It remains to be seen what Christine will receive as part of the divorce. Both have filed for joint custody of their three children. The family's primary residence was in Ventura, California, 30 miles south of Santa Barbara. That's in addition to the 160-acre estate that Costner owns in Aspen, where the couple married in 2004. Online records show that Costner has a number of other real estate investments, including apartments in Los Angeles. Costner is said to have a net worth of around $250 million. The actor currently collects a reported $1.5 million per episode of his hit show Yellowstone. In 2022, the actor became the best paid actor on TV when his salary hit $1.5 million per episode, reports Variety. ",
        "During the 1990s, Costner became one of the best paid stars in Hollywood when he received $14 million for his role in Waterworld. In 1990, Costner was paid $3 million for his part in Dances With Wolves, a year later he earned over $40 million for his role in Robin Hood: Prince of Thieves, thanks to a deal that saw him take a share of the profits. ",
        "In 2014, he settled a lawsuit with the movie's producers for an undisclosed amount claiming he hadn't been paid the full 15 percent of the movie's profits. Costner is the owner of Ocean Therapy Solutions, a company that works with other businesses in environmental clean-up. The company sold equipment to BP in 2010 in the wake of the Gulf of Mexico oil spill for around $52 million.  In January, it emerged that Costner was renting out his 160-acre Aspen estate in Colorado for a whopping $36,000 per night.",
        "The property, known as the Dunbar Ranch, named in honor of his Dances With Wolves character, Lieutenant John Dunbar, and is described as 'the ultimate luxury retreat' and is located just minutes from downtown Aspen.The mansion features 12 bedrooms, eight bathrooms with views of Independence Pass and Aspen Mountain. If there are any problems, round the clock caretakers are also on-site.Outdoors the venue boasts a baseball field, a sledding hill, and the ability to comfortably sleep up to 27 people spread across three buildings consisting of a main house, a lake house, and a river house.For the winter months, the ranch features a private ice rink, tubing track, and dog sledding while horseback riding, hiking, fishing, and other activities are possible during the warmer months. The estate also incorporates a lake on which kayaks and paddleboards can be sailed.",
        "Costner purchased the land in 2000 before transforming into a picturesque paradise. ",
        "In 2017, Costner attempted to sell his sprawling Montecito property for $60million. He bought the home in 2007 for around $30 million. The home's listing was removed without being sold sometime later in 2017. The home comes with 500 feet of private beach, surrounded by cliffs. In 2022, the house next to Costner's was listed for $109 million. 'I could live a lot of places — I choose to live here. It’s the perfect earth pushed right up against the mountain shoved against the ocean — it’s just smashed right in here and it’s our little paradise. The town has never outgrown itself. There’s still a charm to Ventura. When you look at the hills, they’ve really held back development and I hope they continue to do that,' Costner told Visit Ventura  in 2017. In the same interview, Costner spoke about wanting to build on the land. Costner and Baumgartner first began dating in 1998, having met around 1996 while Costner was filming his movie Tin Cup. The Bodyguard star said that at the time he first met her, he wasn't ready to fall in love again. Both are graduates of California State University - Fullerton. Baumgartner graduated with a degree in business. ",
        "They married in 2004 in Aspen, Colorado.The reason for the long courtship was because Costner was not sure if wanted more kids. The uncertainty even led them to break up for a period prior to their engagement. 'Fear kept me from marrying Christine. [She] wanted a child, but I was afraid I couldn’t be an effective father.''I woke up and thought, ‘Am I going to lose a beautiful woman who is willing to be with me to my very last breath because I am afraid to say yes to a child?' That’s all it took. Sometimes you learn the thing you’re most afraid of will save your life,' he told Closer Weekly in 2018. ",
        "Yellowstone star Kevin Costner made headlines once again on Tuesday, with news that his wife of 18 years - Christine Baumgartner - has filed for divorce.While the 68-year-old actor is dealing with the divorce from his 49-year-old wife - who share children Cayden, 15, Hayes, 14, and Grace, 12 together - his iconic role as John Dutton on Paramount Network's Yellowstone is also seemingly in danger.There have been reports for months that Yellowstone will be ending after wrapping up the back half of its fifth season.While the back half of Season 5 was originally slated for this summer, it's unclear when filming will actually happen now amid all this drama. Here we break down all of the Yellowstone drama over the past few months, and what it may mean for the future of the hit series.",
        "Yellowstone Ending After Season 5? Reports Swirl that Costner Will Only Film for ONE WEEKThe first reports of drama on Yellowstone came in early February, when Deadline reported that Yellowstone creator Taylor Sheridan and Paramount were plotting the end of the show.The report claimed Sheridan and Paramount were in talks for a new spin-off starring Matthew McConaughey, and that Costner and Sheridan were at odds over his shooting schedule on the back half of Yellowstone Season 5. While Costner originally committed to filming 65 days for Season 5, he only wanted to shoot 50 days for the first half of the season, which wrapped up with the mid-season finale that aired January 1.He then reportedly only wanted to film for one week for the second half of the season, since he's currently directing and starring in his Western epic Horizon for Warner Bros., his first directorial gig in 20 years.Paramount reportedly turned down Costner's proposal and was reportedly moving forward with the McConaughey spin-off in its stead. ",
        "Kevin's Lawyer Denies The ReportCostner's high-powered attorney Marty Singer told Puck News just days after the original report that it was, 'an absolute lie.''The idea that Kevin was only willing to work one week on the second half of season 5 of Yellowstone is an absolute lie,' he said. 'It's ridiculous — and anyone suggesting it shouldn't be believed for one second,' Singer added.'As everyone who knows anything about Kevin is well aware, he is incredibly passionate about the show and has always gone way above and beyond to ensure its success.'A Paramount representative also referred to Costner as an integral part of the show's success when speaking with the outlet. 'As we previously stated, Kevin has been a key component of the success of our Yellowstone series, and we hope that continues from here on out,' they said.That report also revealed the final episodes of Season 5 had not been shot yet, and the network hoped to start filming this summer for a November debut on Paramount Network.",
        "Kevin's Co-Stars Deny Any Trouble on the Set with CostnerYellowstone star Wes Bentley put in an appearance at the SCAD TV Fest in late February, where he brushed off the reports about Costner.'I know that they're still working on… working things out with everyone, to make sure we shoot,' Bentley said.'And I'm confident we will,' he asserted. 'We always have before. I think it's probably a bit of drama over nothing.' Piper Perabo and Lainey Wilson also chimed in on the supposed drama at the Billboard Music Awards in March.' I mean, there's always a lot of drama when it comes to Yellowstone, don't believe everything you hear,' Perabo, who plays environmental activist Summer Higgins, told Entertainment Tonight.Taylor Sheridan knows to play it really close to the vest, and I know better than to speak outside the ranch, but I'm excited to see what happens next,' Perabo, who is married to Yellowstone director Stephen Kay, added.And Wilson, who plays musician Abby on the show, said, 'You know what, I don't know much, but I have a feeling they're going to end it the right way, and there's gonna be more of it,' Wilson said. 'And I'm hoping I'm gonna be back in it!'",
        "Rumors Claim Yellowstone is Ending After Season 5 Due to Disputes Between Costner and Taylor Sheridan Another report from The New York Post in mid-April claimed that the show was coming to an end after Season 5 due to Costner and Sheridan clashing.'It's the same as with any show runner and big star — there's respect, but there's friction,' a source described as 'well-placed' within the production said.Another 'highly placed Hollywood' source suggested that some of the blame for the 'friction' on set lies with its creator. 'Taylor is the star of his show. He's the most important person on all of his shows,' they said.However, the production source said: 'We're hoping it will be worked out. It's too big a show for things not to be worked out.'Hopefully Kevin will return for the remaining episodes, if everyone works together, but it looks like Yellowstone will end after this season.'",
        "R.I.P. John Dutton? Rumors Swirl that Costner's Character May Be Killed Off in a Surprising Fashion Like Succession's Logan RoyJust days after Yellowstone star Dawn Olivieri told DailyMail.com that Costner's John Dutton could be killed off, another report seemed to lend credence to that.A report from Showbiz 411 claimed John Dutton will, 'meet a similar fate' than Brian Cox's character Logan Roy from the hit HBO series Succession.Logan was surprisingly killed off in the third episode of the show's final season, while on board one of his private planes. As for Dutton's apparent swan song, the source claimed Sheridan was working on how to say goodbye to the Dutton family patriarch.'The whole team is down in Texas now meeting, and trying to figure out how to do it. I'm sure Taylor Sheridan has it worked out more or less,' a source claims, adding, 'We all knew Kevin would leave eventually,' the source said.'I think the main show will go on for at least one more season after, they'll have to see how it goes. Remember, this isn't until 2024. A lot can happen,' the source added.",
        "Taylor Sheridan's 'God Complex' Caused Friction Between Him and CostnerJust weeks ago sources told DailyMail.com that Yellowstone creator Taylor Sheridan had developed a 'God complex' that was at the heart of his conflict with Kevin Costner.'Certain people in charge of the production developed a God complex,' an insider revealed.Costner was reportedly left frustrated that his concerns over the show's direction were dismissed by Sheridan. Costner - who also serves as an executive producer on Yellowstone - was reportedly told by Sheridan to, 'stick to acting' when questioning the direction of the popular series.'Kevin will forever be proud of and grateful for Yellowstone and the cast is like family to him,' the source said of Costner, who recently nabbed a Golden Globe Award for best actor for his portrayal of John Dutton.'He just felt like Yellowstone is headed in a direction that was not in line with their initial vision and he was met with criticism, including that he should just stick to acting.'",
        "And Now... a Writer's Strike...Adding to uncertainty swirling around the fate of the back half of Yellowstone Season 5 is the Writers Guild of America strike that went into effect on Tuesday.All movie and TV writers who are part of the Guild must stop all work for any companies represented by the Alliance of Motion Picture and Television Producers (AMPTP), which is essentially every major movie studio, TV network, TV production company and streaming service.The last time the Writers Guild of America went on strike was in November 2007 - a stand-off that lasted 100 days, setting a new precedent for writers being paid for their work being used in 'new media' such as the streaming services that are now ubiquitous.As for Yellowstone, since it's unclear how far Sheridan is in the writing process, it's unknown how the strike will impact the back half of Season 5. With a strike in place, it's possible for production to take place on Yellowstone if the scripts have been completed... but it would bar any further writing on any of the scripts from Tuesday until the strike comes to an end. "
    ]
}