{
    "articleURL": "/wires/reuters/article-12049275/Australia-Thailand-Sweden-start-strong-International-Crown.html",
    "content": [
        "Australia pulled off two victories against defending champion South Korea, and Sweden and Thailand also turned in 2-0 performances to kick off the Hanwha LifePlus International Crown on Thursday in San Francisco.",
        "The only matchup of the day that didn't result in a sweep was the top-seeded United States splitting its two matches with No. 8 China at TPC Harding Park.The International Crown is being played for the first time since 2018 due to the COVID-19 pandemic. The top eight countries in women's golf were determined by last year's Rolex Rankings and each country sent four of its top players to the unique team event.The countries were seeded and split into two pools, with teams competing in four ball (best ball) in a single round-robin format from Thursday to Saturday. One point will be awarded for a win and a half-point for a tie, with the top two countries advancing from each pool.Two semifinal matches will be played Sunday morning, each consisting of two singles matches and one foursomes (alternate-shot) match. The winning semifinal countries will compete in the final match on Sunday afternoon in the same format.Seventh-seeded Australia faced a tall first task Thursday, with three of South Korea's four players ranked inside the top 12 in the world. But Minjee Lee and Stephanie Kyriacou surprised Hye Jin Choi and In Gee Chun 2 up -- taking the lead with a birdie on the first hole and never trailing in the match.",
        "Hannah Green and Sarah Kemp followed by beating Jin Young Ko and Hyo Joo Kim 2 and 1.Joining Australia atop Pool B was sixth-seeded Thailand, which swept Japan. The all-star team of Patty Tavatanakit and Atthaya Thitikul defeated Japan's Yuka Saso and Ayaka Furue 1 up with a birdie at the par-5 18th. Sisters Moriya and Ariya Jutanugarn then beat Nasa Hataoka and Hinako Shibuno 2 up.\"I feel like we're pretty comfortable with each other because we played a lot in junior golf together,\" Tavatanakit said, \"and then the sisters are obviously comfortable together.\"We don't know the strategy yet. We'll come back and sit down and talk if we want some changes, but I think we had a good group. Like I said, good vibes, so everyone will cheer each other on.\"In Pool A, fourth-seeded Sweden dominated its two matches against fifth-seeded England, which had two top players -- Georgia Hall and Charley Hull -- withdraw earlier this week due to injury and illness. Anna Nordqvist and Caroline Hedwall upended Bronte Law and Jodi Ewart Shadoff 4 and 3, and Madelene Sagstrom and Maja Stark routed Liz Young and Alice Hewson 5 and 4.\"It was a really good matchup. We played really well together,\" Sagstrom said of herself and Stark. \"Our games are fairly similar, so it's fun. We've never played team events before because I'm a lot older than her, so it's cool. It's awesome. But I think at the same time my experience also kind of helps me being out there.\"",
        "Recent Chevron Championship winner Lilia Vu teamed up with star Nelly Korda to beat China's Ruoning Yin and Xiyu Lin 2 and 1. But China's Ruixin Liu and Yu Liu grabbed an early lead against Danielle Kang and Lexi Thompson and never relented, holding on for the final six holes to win 1 up.The tournament continues Friday with the following matchups:Friday Pool ANo. 1 United States vs. No. 5 EnglandNo. 4 Sweden vs. No. 8 ChinaFriday Pool BNo. 2 South Korea vs. No. 6 ThailandNo. 3 Japan vs. No. 7 Australia--Field Level Media"
    ]
}