{
    "articleURL": "/wires/pa/article-12041765/If-don-t-believe-no-point-playing--Arsenal-s-Oleksandr-Zinchenko.html",
    "content": [
        "Oleksandr Zinchenko insists there would be “no point” continuing the season if he did not retain belief that Arsenal can win the Premier League title.",
        "The Gunners ended a four-match winless run with a comfortable 3-1 victory over Chelsea on Tuesday night to breathe fresh life into their title bid.Captain Martin Odegaard struck twice before Gabriel Jesus wrapped up the points in the first half, with a first league goal for Noni Madueke providing scant consolation for the Blues.Despite the win, Manchester City remain firm favourites to claim a fifth crown in six years.Zinchenko won four league titles at City before joining Arsenal last summer and on arriving at the Emirates Stadium declared Mikel Arteta’s side should be challenging for the trophy rather than aiming for Champions League qualification.Now the Ukraine full-back maintains that stance heading into the final few weeks of the campaign.“If you don’t believe, there is no point playing,” he said.“So of course I do. When I had just arrived I said the quality everyone has here is incredible, the energy as well.“I said everything is possible in this life if we’re going to work so hard. And that’s what we’re trying to do. If you don’t believe, there is no point playing  Oleksandr Zinchenko  “It was an important three points for us obviously. In terms of our reaction, we bounced back quite good after the last couple of games where we dropped a lot of points.",
        "“The win is so important for us to be back in a routine, for the mood in the dressing room and in terms also for our league position. So, let’s keep going.“Unfortunately it is not in our hands, but you never know what can happen in this league. From us, we need to be focused on our performances. That’s it.“We need to keep fighting, because we worked so hard during this season.”",
        "Zinchenko was caught out for Chelsea’s goal on Tuesday night, with Arsenal’s defence once again unable to shut out the opposition.Arteta’s side have kept just one clean sheet in their last nine league outings and Zinchenko admits that is not good enough.“The manager has already said to us a couple of things we’ve done badly, what we’ve done good,” he added.“Of course it’s not acceptable at this level to concede so many goals and we need to improve on that.“But we’re human beings, we’re still learning and we’re such a young team as well, so I hope for the future we’re going to do much better.”",
        "Defeat for Chelsea means they have now lost all six games under interim boss Frank Lampard and languish in the bottom-half of the table.“We’re hurt and angry, every negative emotion you could think of,” left-back Ben Chilwell told the club’s official website.",
        "“It was very poor. We knew that if we came here and played like that we would have to expect to concede three goals.“We’re probably quite a nice team to play against, which has been the story of the whole season to be honest.“It seems to be every team that plays against us has a good game. That’s not a coincidence. A lot of the performances recently have been below the standard we set. The first half was another example of that. We have to look at ourselves.”Meanwhile, Arsenal have condemned the shining of a laser into the face of Chelsea forward Mykhailo Mudryk as a fan was arrested over the incident.Television cameras picked up a light being beamed in the direction of the Ukraine international, who had been jeered after coming on as a second-half substitute for the visitors.Mudryk had been close to joining the Gunners in January before instead signing for their London rivals and was targeted with the laser during game.",
        "An Arsenal statement on Wednesday morning read: “An arrest has been made following the use of a laser during last night’s match.“This behaviour is dangerous and totally unacceptable, and we will fully support the police with their enquiries. We will obviously take the strongest possible action.”",
        "The PA news agency understands the Football Association will be investigating the matter and that the Metropolitan Police made a further three arrests at the game for ticket touting."
    ]
}