{
    "articleURL": "/sport/football/article-12048053/Huddersfield-1-0-Sheffield-United-Danny-Ward-goal-sees-Neil-Warnocks-STAY-UP.html",
    "content": [
        "Huddersfield have avoided relegation with a 1-0 win against Sheffield United Danny Ward scored the only goal of the game at the John Smith's Stadium The result sees the Terriers stay up but Reading are relegated to League One'One more year Warnock, one more year.' pleaded the Huddersfield fans to Neil Warnock. ",
        "'If I manage your team for another 12 months, I won't be here,' Warnock responded.When the 74-year-old came out of retirement and arrived in West Yorkshire in February - 30 years after first managing the Terriers - Huddersfield were 23rd and just one point off the bottom.With victory against promoted Sheffield United and Warnock's boyhood club, Huddersfield secured their Championship status and sent Reading down to League One for the first time since 2002.Daniel Jebbison missed two golden chances for the visitors in the first half.",
        "But the home side were rewarded for their intent after the break, when Danny Ward curled one in from outside the box with his left foot.'I've loved every minute here. It's been bloody hard work,' said Warnock. 'It's been an amazing rollercoaster ride.'Pre-match, he said it would be his biggest achievement when asked where avoiding relegation would rank in a 43-year managerial career that has spanned more than 1600 games and included a record-breaking eight promotions.With six wins and four draws in 14 games since taking over, he has pulled it off. The Great Escape completed, and with a game to spare.'This one ranks right at the top,' Warnock insisted. 'I've not had anything more difficult than this.'",
        "Monday's clash against Reading will be a party for the Terriers rather than a final-day shootout to avoid relegation.",
        "Huddersfield (4-2-3-1): Nicholls 7; Pearson 6, Lees 6, Helik 6, Edmonds-Green 6 (Ruffels 72, 5); Hogg 6, Rudoni 6; Koroma 6 (Hungbo 90+4), Kasumu 6, Headley 6; Ward 7 (Harratt 89).Subs not used: Vaclik; Jackson, Diarra, Rhodes.Goals: Ward 59.Yellow cards: Rudoni 85.Manager: Neil Warnock 7.Sheffield United (3-4-2-1): Foderingham 6; Basham 6, Egan 6, Robinson 6; Baldock 6, Berge 7, Norwood 6 (Doyle 67, 5), Lowe 5 (Stevens 8, 5 (Fleck 67, 5)); Ndiaye 5 (Sharp 52, 5), McAtee 6; Jebbison 5 (McBurnie 52, 6).Subs not used: Davies; Coulibaly.Yellow cards: Egan 22, Doyle 90+1.Manager: Paul Heckingbottom.Referee: John Busby 6. "
    ]
}