{
    "articleURL": "/femail/article-12060139/Ladies-white-Kate-Middleton-dons-custom-Alexander-McQueen-Coronation-portrait.html",
    "content": [
        "Princess of Wales, 41, donned a stunning custom Alexander McQueen gownRead more: Louis joins Kate and Will for a day of volunteering for CoronationThe first official portraits from King Charles and Queen Camilla's Coronation were unveiled last night, giving a glimpse at the new 'slimmed down' monarchy.",
        "In the photographs senior royals including Princess Anne, Prince Edward and the heir to the throne Prince William surrounded the newly crowned King and Queen, as Charles expressed his utmost gratitude for the public's support throughout the historic weekend.The King was captured in his full regalia, wearing the Imperial State Crown, holding the Orb and Sceptre with Cross.But there were several hidden details eagle-eyed royal fans were quick to notice, particularly concerning the Princess of Wales' outfit as she stood alongside her husband and father-in-law.In a touching tribute to Queen Elizabeth, Kate, 41, added one of the late monarch's necklaces to compliment her stunning ivory silk crepe dress, made by her favourite designer Alexander McQueen.",
        "The Princess of Wales wore Queen Elizabeth's George VI Festoon Necklace, which had belonged to the late Queen and was one of the monarch’s favourites in her lifetime. It was made from 105 loose diamonds that were kept in reserve at Garrard, stored in pouches marked ‘C’ for Crown, in case a monarch wanted to extend a necklace or improve a tiara.Queen Mary, the Queen’s grandmother, was said to have made regular use of the service.The resulting triple strand necklace has rows of graduated stones, suspended between two diamond triangles.It was also the Queen’s preferred necklace for wearing without a tiara.",
        "During the Coronation ceremony at Westminster Abbey on Saturday morning, many expected Kate to be wearing the necklace but it appeared to be missing on the day.No reason as to why the jewellery was missing throughout the service was given, however, it may have been removed to not cause damage to her Royal Victorian Order mantle that was clasped together with a silver bullion.It comes amid speculation that Kate also may have worn two gowns for the Coronation - as the new royal portraits show a gown with a different neckline to her stunning ivory silk crepe dress by Alexander McQueen, which she wore to the ceremony on Saturday.",
        "Fans of the Princess of Wales noticed how she had worn a sported a scoop-necked piece for the Westminster Abbey festivities over the weekend, newly released photographs taken on the same day show the King's daughter-in-law in a more V-necked design.Instagram fan account @middletonmaven said that the photos show the mother-of-three 'wearing a new Alexander McQueen gown for the official photos', and other observers chipped in to voice their agreement.'The neckline is different to the dress she was wearing under her mantle,' one agreed. 'Did she have two dresses?' Another remarked that the neckline wasn't the only tell. ",
        "'Yes, the embroidery at the bottom of the dress is different too,' they wrote. 'Both gorgeous and the necklace completed the magnificent look.'However, closer look at the hemline suggests that the floral designs along the skirt are strikingly similar if not identical.The dress in the portrait also showed off gorgeous embroidery among the sleeves, harking a similar floral design. 'I wonder why she had two made,' a third asked. However, not everyone was convinced that a second gown was a definite possibility - as one questioned whether the Princess may have been wearing a cape during the ceremony.On Saturday, Kate was elegant in the stunning ivory silk crepe gown by Alexander McQueen, which featured silver bullion and thread work embroidery featuring rose, thistle, daffodil and shamrock motifs to represent each of the four nations.Instead of a tiara, the royal mother-of-three wore a matching Jess Collett x Alexander McQueen Headpiece with silver bullion, crystal and silver thread work three-dimensional leaf embroidery.And in a touching nod to her late mother-in-law, the Princess wore a set of Diana’s pearl and diamond earrings for the occasion. Meanwhile she also paid tribute to the late Queen by wearing The George VI Festoon Necklace, which was a gift from King George VI for his daughter, then Princess Elizabeth. ",
        "The Princess’ has long chosen to wear Alexander McQueen for significant moments in her life.She has worn Alexander McQueen – one of her favourite fashion brands – on numerous occasions, most notably choosing its creative director Sarah Burton to design her wedding dress.The four flowers of the home nations - English rose, Scottish thistle, Welsh daffodil and Irish shamrock - were embroidered onto the dress.Kate donned pearl earrings that were gifted to Diana before her wedding to Prince Charles in 1981.The mother-of-three previously wore the jewellery, left to William and Harry, at the BAFTAs in 2019. They feature a double curve of various cuts of diamond, with a hanging pearl.Diana wore the earrings on various occasions, including at a banquet for the Japanese Emperor Akihito in 1990 - and at a gala at the Palace of Versailles in 1994.Meanwhile Queen Camilla also paid tribute to her loved ones - by having some secret names embroidered onto her Coronation dress, including a heartwarming homage to her rescue dogs.The royal looked elegant in her Bruce Oldfield couture gown as she was stood alongside King Charles in the Coronation portraits.",
        "Camilla's ivory dress which was designed by Couturier and close friend Bruce Oldfield, who also worked closely with Diana during her time as a working Royal, was made from Peau de Soie, a silk fabric.",
        "The gown was embellished with silver embroidery which was woven by Stephen Walters in Suffolk.With an ivory, silver and gold colour palette, bracelet length sleeves, a strong shoulder and a wide V-neck neckline, the gown was in Camilla’s signature silhouette, a modest neckline, and an elongated waist.The mother-of-two accessorised the gown with matching shoes made by British designer Elliot Zed, and the same necklace that Queen Elizabeth wore to her coronation back in 1953.Eagle-eyed royal fans noticed that Camilla had also paid a subtle tribute to her loved ones on her show-stopping gown.",
        "She had the names of her children and grandchildren discreetly embroidered near the bottom of her skirt. Sharing close up snaps of the gown on Twitter royal expert Victoria Howard spotted that the bespoke dress appeared to reveal the names of her two children, Tom and Laura, along with those of her grandchildren, Gus, Freddy, Louis, Eliza and Lola.People also noticed two gold terrier pups embroidered onto the gown to represent Charles and Camilla's rescue dogs Beth and Bluebell.The royals rescued the pooches from Battersea Dogs' and Cats' Home in 2017. The two adorable dogs have even made Buckingham Palace their new home.Meanwhile her grandsons were pages of honour during the ceremony and her granddaughter was present on the day.",
        "The son of food writer Tom Parker Bowles, Freddy, 13, was a page of honour during the ceremony. While Camilla's daughter Laura Lopes, children Louis Lopes, 12, and the twin brother of Gus also had a role to play and were seen on Buckingham Palace balcony after the coronation ceremony. Meanwhile Sophie, 58, donned a regal white Suzannah couture floor-length embroidered gown with a Jane Taylor headpiece and Royal Victorian Order Mantle for the historic portrait. The images were among the first official photographs of King Charles III taken on the day of his Coronation.The King and Queen set the seal on their historic coronation day with a double Buckingham Palace balcony appearance to acknowledge the nation.Charles and Camilla in lavish robes and wearing their crowns returned with a wave the cheers of the crowds, who filled The Mall after braving downpours to see a colourful ceremonial military procession not seen for 70 years.The Prince and Princess of Wales and their children Prince George, Princess Charlotte and Prince Louis joined the monarch, as did the pages of honour and other royals - and then wellwishers were treated to an encore with just the King and Queen. "
    ]
}