{
    "articleURL": "/wires/pa/article-12049807/British-Airways-parent-company-records-quarter-operating-profit.html",
    "content": [
        "British Airways’ parent company returned to an operating profit between January and March for the first time since before the pandemic, the company has announced.",
        "International Consolidated Airlines Group (IAG) said its first quarter operating profit reached nine million euros (£7.9 million), up from a loss of 718 million euros (£629 million) in the same period last year.Revenue reached 5.9 billion euros (£5.2 billion), an increase of more than 71% year-on-year. IAG has delivered a strong first quarter financial performance  Luis Gallego, IAG  Fares were up by 10%, but fuel prices increased by around 35%.IAG attributed the financial results to “ongoing strong customer demand across all our airlines”, which consist of Aer Lingus, British Airways, Iberia, Level and Vueling.Chief executive Luis Gallego said: “IAG has delivered a strong first quarter financial performance as group airlines recovered capacity to close to pre-pandemic levels.",
        "“Iberia contributed a record first-quarter profit and all our airlines performed above expectations, benefiting from robust demand and a lower fuel price in the quarter.”“We are seeing healthy forward bookings, with leisure demand particularly strong, while business travel continues to recover more slowly.”Mr Gallego insisted IAG’s airlines have enough staff to cope with demand over the coming months, but expressed anxiety over recruitment levels at Heathrow airport.He said: “We are a little concerned about Heathrow … because usually the forecast we have about the passengers we are going to fly during the summer is higher than what they think, so we are a little worried about that.",
        "“We hope they have the resources.”He added that he is “very worried” about further French air traffic control strikes, which affect many routes including a number going to and from Heathrow."
    ]
}