{
    "articleURL": "/wires/aap/article-12038609/Force-marvel-ridiculous-form-winger-Kibirige.html",
    "content": [
        "Western Force centre Sam Spink has praised Zach Kibirige for his \"ridiculous\" hot form, but says wins rather than individual accolades will be the focus for the team.",
        "Kibirige has been a revelation in his first season at the Force, scoring eight tries to sit second on the Super Rugby Pacific try-scoring table.Chiefs star Shaun Stevenson sits on top of the leaderboard with nine tries, but the race to finish on top of the tries table doesn't interest the 10th-placed Force, who are battling to stay in the finals race.\"He (Kibirige) doesn't really care if he's top of the leaderboard unless his tries are winning us games,\" Spink said ahead of Saturday's clash with the Crusaders in Christchurch.\"If he's picking up two, three tries a week and we're still losing, it's sort of null and void.\"Spink played previously with Kibirige at English outfit Wasps and has been blown away by the winger's hot form.\"It's ridiculous to be honest,\" Spink said.\"Some of the tries he's scored have been finishes I haven't seen from many people in world rugby really.\"When he turned up to Wasps a few seasons ago he had a similar stint of form. He started scoring tries for fun.\"We've put him in a bit of space and he's just taken it upon itself to take it to the next level.\"Spink and Kibirige didn't get to play together much at Wasps due to injury and selection, but the Englishmen are thriving at the Force.",
        "\"It (our relationship) has become stronger as we've come over here,\" Spink said.\"A lot of similarities - both being English, avoiding all that Aussie banter. Sometimes we had to stick together to get through it.\"He's very loud with how he communicates, so it's great to have him outside of me.\"He knows what I want to do and what I'm good at and I know if I can get the ball to him in a bit of space, he can create some magic.\"The Force will be without five-eighth Bryce Hegarty (knee), fellow back Bayley Kuenzle (hamstring) and flanker Tim Anstee (concussion) against the Crusaders, but new signing Isi Naisarani will be unleashed."
    ]
}