{
    "articleURL": "/wires/reuters/article-12053035/Struggling-Rapids-Galaxy-meet-L-A.html",
    "content": [
        "A pair of one-win teams who have seen far better days will meet Saturday when the Los Angeles Galaxy play host to the Colorado Rapids in Carson, Calif.",
        "The Rapids (1-3-6, 9 points) hit the road again, having won once in six away games. They arrive in Los Angeles with points in six consecutive games (1-0-5) following a trio of ties -- the most recent a scoreless duel at Vancouver on April 29.It was one of three scoreless ties for the Rapids this season, including one to begin April at home against defending champion Los Angeles FC.Rapids goalkeeper William Yarbrough had five saves on Saturday in his fourth shutout of the season and his 30th with the Rapids to set a club record.\"I was really proud of the effort of the group,\" Rapids coach Robin Fraser said. \"Vancouver asked a lot of interesting questions in the way they play. I thought our guys adapted quite well and really fought, and the big thing on the road is you want to make sure you give yourself a chance to win games.\"Michael Barrios has two goals this season to lead Colorado.The Galaxy (1-5-3, 6 points) head into the weekend as the second-worst team in MLS, ahead of only Sporting Kansas City (0-7-3, 3 points).The Galaxy enter off a 2-0 defeat at Orlando City SC last weekend, but they did earn a 2-0 victory over Austin FC the last time they played at home on April 22.",
        "\"We knew coming across the country for a game was going to be a grind, and it was,\" Galaxy coach Greg Vanney said after the Orlando loss. \"We needed to be more efficient, specifically on the defending side and keeping possession. ... We made some mistakes that cost us and that becomes the game.\"Seven different players have scored a single goal for Los Angeles, with last season's leading goal scorer Javier \"Chicharito\" Hernandez scoring his lone goal in four games (three starts) after opening the season with a hamstring injury.Former Galaxy forward Kevin Cabral is in his first season with the Rapids, while Fraser helped the Galaxy to the 1998 Supporters Shield as a player.--Field Level Media"
    ]
}