{
    "articleURL": "/wires/reuters/article-12048163/Alex-Calls-walk-blast-lifts-Nationals-Cubs.html",
    "content": [
        "Alex Call led off the bottom of the ninth inning with a home run on the first pitch to give the Washington Nationals a 4-3 victory against the visiting Chicago Cubs in the finale of a four-game series Thursday afternoon.",
        "It was a dramatic ending after a splendid pitching performance from Washington starter Patrick Corbin nearly went for naught.Call hit the only pitch thrown by Brad Boxberger (0-1).Lane Thomas hit a three-run home in the second inning for the Nationals, who have their first three-game winning streak of the season by winning the final three games of the four-game series.Cody Bellinger's infield single in the second inning was the only hit off Corbin through seven innings. Corbin struck out six without a walk and was charged with two runs and three hits in seven-plus innings.The Cubs were in position to take the lead in the top off the ninth off eventual winning pitcher Kyle Finnegan (1-1). Ian Happ walked and Seiya Suzuki doubled to put runners on second and third with no outs. Finnegan struck out Bellinger and Patrick Wisdom before Trey Mancini's flyout.An inning earlier, Corbin gave up singles to Bellinger and Wisdom to begin the eighth and was replaced by Hunter Harvey. Mancini greeted him with a run-scoring double.Miguel Amaya, playing in his first game in the major leagues, made it 3-2 with a sacrifice fly before Nico Horner 's two-out single tied it.The Nationals struck quickly in the second inning. Joey Meneses and Dominic Smith had singles before Thomas launched his second homer of the year before an out was recorded.",
        "Thomas had the game's only extra-base hit Wednesday night when he tripled and scored the winning run in the seventh inning.Javier Assad gave the Cubs five shutout innings from the bullpen. Starting pitcher Jameson Taillon worked three innings and gave up three runs on three hits in his first outing in more than two weeks as he came off the injured list.--Field Level Media"
    ]
}