{
    "articleURL": "/news/article-12059061/Ex-Army-chief-says-hes-uncomfortable-Government-plans-send-migrants-Rwanda.html",
    "content": [
        "Crossbench peer questions 'unpopular' scheme to send asylum seekers to AfricaThe former head of the British Army has revealed he is 'uncomfortable' with the Government's plans to send asylum seekers to Rwanda.",
        "General Lord Richard Dannatt warned of the African country's 'pretty dark history' and said the 'shadow of genocide' hangs over the nation.The ex-military chief claimed the Tory proposals to send migrants to Rwanda was an 'unpopular policy'.He also questioned why Prime Minister Rishi Sunak was allowing the 'political capital' of his Government to be depleted by the scheme.Lord Dannatt's intervention comes ahead of the return of the Illegal Migration Bill to the House of Lords this week.Mr Sunak has faced warnings peers are poised to block his legislation aimed at easing the Channel migrant crisis.",
        "The Government has consistently pointed to its £120million migration scheme with Rwanda as a means of cracking down on the small boat crossings.But plans to fly asylum seekers to Africa have been blocked by legal rows, including an 11th-hour intervention by the European Court of Human Rights last summer.Speaking to the Independent, Lord Dannatt said the Government was 'entitled to bear down on people coming on small boats who are simply seeking a better life'.But the crossbench peer added: 'Whether sending people to Rwanda is the right policy, I have my doubts. 'It seems to be aimed at deterring others from coming, because there is a strong sanction against them. I'm uncomfortable with it.'",
        "Lord Dannatt is a member of the All-Party Parliamentary Group on War Crimes, which looks into matters related to the presence of alleged Rwandan war criminals in the UK.The group also considers the prosecution of those who participated in the Rwandan genocide against the Tutsis in 1994.'I've been to Rwanda, and the shadow of the genocide there in the 1990s hangs over that country,' Lord Dannatt said.He described the country as being 'ruled with a very firm hand' by Paul Kagame, the former military officer who has been the Rwandan President since 2000.The peer added: 'It’s got a pretty dark history, and it’s not the sort of environment I would put people from Syria and elsewhere in the world into.'Home Secretary Suella Braverman met Mr Kagame during a visit to Rwandan capital Kigali in March, as she held further talks over the migration scheme. 'It’s somewhat surprising Suella Braverman is persisting with an unpopular policy,' Lord Dannatt said. 'I fail to understand why the Home Secretary is continuing to run down the remaining political capital of Rishi Sunak's Government.'Opinion polling last month found almost half of Britons support plans to deport asylum seekers to Rwanda - although most don't believe it will end the Channel migrant crisis.",
        "A survey by the More In Common think tank, carried out between April 6 to 11, found that 46 per cent of people still support the Rwanda scheme. This compared to 28 per cent who oppose it and 27 per cent who said they were apathetic or had not made up their mind.It also showedalmost half (48 per cent) believed the policy would not make a difference to the number of people crossing the Channel in small boats.A further 3 per cent said it would lead to more migrants entering the UK illegally.This compared to only a third (34 per cent) who thought the Rwanda scheme would reduce the number of Channel migrant crossings, while 14 per cent said they did not know whether the plan would work."
    ]
}