{
    "articleURL": "/news/article-12056587/First-Lady-Jill-Biden-joins-Rishi-Sunak-Downing-Street-Big-Lunch-mark-Kings-Coronation.html",
    "content": [
        "Jill Biden seemingly inspected her cheese and pickle sandwich at Rishi Sunak's coronation lunch todayFollow our live blog for all the latest updates on the historic Coronation of King Charles and Queen Camilla The beloved cheese and pickle sandwich is a core staple amongst many British picnics - and is bound to have played a starring role in the thousands of street parties that took place across the country today to celebrate King Charles' coronation.",
        "But it seems Jill Biden was not won over by the quintessential tea party essential as she dined at Downing Street's Big Lunch coronation street party earlier today.The US First Lady was caught on camera holding the popular lunchbox favourite aloft and inspecting it very carefully, having been personally served it by the Prime Minister Rishi Sunak.The celebration at No 10 is among the thousands of street parties being held across the country today as people gather together for the Coronation Big Lunch.The Sunaks laid out Emma Bridgewater crockery for the First Lady and their other guests. The sets, which had been donated by the British brand, would have cost approximately £3,000 if bought. Mr Sunak's wife, Akshata Murty, the heiress of an Indian billionaire, has an apparent fondness of luxury pottery. Last summer during the leadership race she served tea to waiting press in mugs sold for £38 each.",
        "As the festivities continued this weekend to mark Charles' reign, Buckingham Palace revealed the King and Queen were 'deeply touched' by the nation's celebration of their historic coronation.The Palace said newly-crowned Charles and Camilla are 'profoundly grateful' to those who helped make it such a 'glorious occasion'.Mrs Biden, wearing a long white embroidered coat, and her granddaughter Finnegan Biden were greeted by the Prime Minister's wife, Akshata Murty. ",
        "The First Lady and Prime Minister were seen laughing and joking as they greeted each other, giving each other a kiss on both cheeks. They spent a few moments chatting before Ms Murty guided Mrs Biden towards the tables, where they began meeting guests.Laura Ashurst, a breast cancer campaigner from Stokesley in North Yorkshire, was sitting opposite Mrs Biden at the Big Lunch.She said: 'It's been absolutely amazing. We've met some amazing people from all over the country. There's so many people doing so much admirable and amazing work in their communities and for charity.'Mrs Ashurst and the First Lady discussed the work Mrs Biden has been doing with people with breast cancer, and exchanged some stories.She added: 'It's an absolute privilege to be here.'",
        "Cheese and pickle sandwiches are a beloved British staple, being a key part of a traditional Ploughman's lunch.They are extremely easy to make: all you need is two slices of bread, a hard cheese, such as cheddar and, of course, Branston Pickle.Branston Pickle is a preservative made with a range of different vegetables, including carrot, onion and cauliflower.It is then pickled in a sauce made out of vinegar, tomato, apple pulp and different spices, making a sweet and tangy chutney. According to Branston Pickle the best way to make your sandwich is by slicing up white Farmhouse bread.Some may choose to spread a thin layer of butter or mayonnaise before adding a generous amount of the pickle mixture.Then take your mature cheddar cheese slices, add to your sandwich, close and enjoy. ",
        "Mr Sunak arrived shortly before Mrs Biden, walking out of the famous Number 10 door with his family. He said: 'Hello, how are you?' to the gathered guests before starting to mingle.Recipients of the Points of Light Award, given to ordinary people doing extraordinary things for their community, were among the invitees along with Ukrainians who have come to the UK under the Homes for Ukraine scheme after Russia invaded their country, as well as their UK sponsors.Other guests include young people from UK Youth and the National Association of Boys and Girls Clubs. Also present at the event were Mr Sunak's two daughters and the family dog, Nova.Many of the invited guests took photos before taking seats right in front of the Number 10 door. The outside event saw two long tables covered in white linen, with vases of tulips and mugs saying King Charles III set up in front of the famous black No 10 door. The street was bedecked in union flag bunting with music played by the RAF Northolt brass quintet.Guests were tucking into dishes including coronation quiches, coronation chicken, sausage rolls and smoked salmon. The food has been sourced from across the UK, including beef from Gloucestershire, which is being served in Yorkshire puddings, Scottish Loch Duart salmon, Northern Irish soda bread and ice cream from Wales.",
        "The crockery has been donated by Emma Bridgewater, a pottery with strong royal connections where a teapot retails for £50, mugs cost £17 each and plates go for £15 a piece.Street parties are taking place across the UK today as Britons are encouraged to come together to mark the coronation.The Prince and Princess of Wales surprised fans in Windsor with a walkabout as a Coronation Big Lunch was underway.William and Kate made the unannounced appearance ahead of the star-studded coronation concert at Windsor Castle at 8pm tonight.The Duke and Duchess of Edinburgh will attend a Big Lunch in Cranleigh, Surrey, the Princess Royal and Vice Admiral Sir Tim Laurence will be guests at a community street party in Swindon, Wiltshire, and Princesses Beatrice and Eugenie will visit a Big Lunch in Windsor.The celebrations come after tens of thousands of people turned out in central London yesterday to see the pomp and pageantry of the coronation, with Charles and Camilla processing through the streets in the Gold State Coach and taking to the Palace balcony in their glittering crowns.",
        "More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen's funeral in September.A Palace spokesman said: 'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield.'",
        "Camilla meanwhile asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.The simple posy, including auriculas, the late Queen's favourite lily of the valley, and one of Charles's favourites hellebores, by the King and Queen's go-to florist, Shane Connolly, was laid at the memorial. Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother. Camilla did not carry the flowers on Saturday as it was a wedding not a coronation, the Palace said. In Windsor, royal fans - some draped in Union flags or wearing Union flag dresses - started arriving hours before the concert was due to begin at 8pm.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, will see Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls and singer Sir Tom Jones appear via video message.The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.",
        "There will also be performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls.",
        " Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will perform too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Meanwhile, as part of the Coronation Concert, choreographed lasers, projections and drone displays will radiate over historic bridges and buildings. ",
        "Seven of the 10 locations involved in the event, Lighting Up The Nation, have been disclosed so far, including Blackpool seafront in Lancashire, where people can join a viewing party from Blackpool Tower.Sheffield Town Hall will showcase a display in the Peace Gardens, while Newcastle's Tyne Bridge and Gateshead's Millennium Bridge lights will cast riverside reflections for an audience stretching between the quays.A drone show will light up the sky above the Eden Project in Cornwall, and its biomes will become multicoloured for spectators invited from the local volunteer community.Light shows will also brighten up Belfast, Edinburgh and Cardiff at various locations. The remaining three locations will be revealed during the concert."
    ]
}