{
    "articleURL": "/tvshowbiz/article-12040011/Lizzo-keeps-low-profile-oversized-hoodie-sweatpants-dazzling-Met-Gala.html",
    "content": [
        "Lizzo kept a low profile while checking out of her hotel in New York City on Tuesday.",
        "The 35-year-old singer and rapper sported a black sweatsuit from her Yitty clothing brand with the hood pulled over her face and a pair of dark sunglasses shielding her eyes as she stepped out.The Special hitmaker — who dazzled in a silver bodysuit during her surprise performance at the 2023 Met Gala the day before — carried an all-black, miniature duffel bag from Louis Vuitton.She dressed comfortably in a pair of black-and-white sneakers for a casual yet chic look.The four-time Grammy winner appeared to be still sporting the platinum blonde wig with a stunning, silver gown that she wore for the star-studded after-party.",
        "The multi-hyphenate artist appeared to have opted for a makeup-free look to showcase her natural beauty.The evening before, the Hustlers actress hit the stage at fashion's biggest night held at the Metropolitan Museum of Art.At the Met Gala, Lizzo was the surprise performer and sang two of her hit singles — Juice and About Damn Time — for all of the A-list celebrity guests.She donned a stunning one-sleeved, rhinestone-encrusted bodysuit from her brand Yitty teamed with chrome, knee-high boots from Piferi.After giving a breathtaking performance, she was photographed dancing and twerking with supermodel Gigi Hadid. Following the lavish and exclusive event, Lizzo donned a shimmering, silver dress and a platinum blonde wig with voluptuous curls.",
        "She also sported a pair of gold platform heels and oversized hoop earrings.For the after-party, she looked glamorous in a dramatic smokey eye look and a deep red, glossy lip combo.",
        "When making her grand entrance on the red carpet of the Met Gala — an annual event she has attended every year since 2021, she rocked a sleeveless black gown with a thigh-high slit.The stunning dress featured a floor-sweeping train and was embellished in pearls.She accessorized with layers of beaded bracelets and large, dangling pearl earrings.The pop star also styled her raven black tresses in tight ringlets and a voluminous bun at the crown of her head."
    ]
}