{
    "articleURL": "/wires/ap/article-12039473/Royals-add-prospect-Garcia-series-against-Orioles.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - The Kansas City Royals recalled infielder Maikel Garcia, one of the organization's top prospects, along with catcher Freddy Fermin on Tuesday before opening a three-game series against the Baltimore Orioles.",
        "Franmil Reyes was optioned to Triple-A Omaha and infielder Nicky Lopez was placed on the 10-day injured list.The 23-year-old Garcia appeared in nine games with the Royals last season and had a solid spring but began the year at Omaha, where he was hitting .242 with a homer and 17 RBIs in 24 games. He is primarily a shortstop but has played his last six games at third base, and there's where he will mostly play with the Royals.\"The impression I had in spring training was tremendous,\" Royals manager Matt Quatraro said. \"Great athlete. Moved all over the field, looked natural wherever he was. He came off a really good winter ball. All of those things were extremely positive.\"Fermin, who had his first big league hit April 23 against the Angels, was hitting .304 with five homers through 14 games at Omaha. He will serve as the primary backup to catcher Salvador Perez, which in turn allows young catcher-turned-outfielder MJ Melendez to concentrate on playing right field and working his way out of a hitting funk.Melendez was hitting .172 with two homers and 10 RBIs entering Tuesday night.\"We´re just trying to free him up mentally, physically, you know, let him concentrate on one position,\" Quatraro said. \"Then, you know, he´s not worried about game planning or going to the pitcher-catcher meetings.\"",
        "Reyes, who once hit 30 homers in a season for Cleveland, was being counted upon to provide some power to a young Royals lineup lacking much punch. But he was hitting .186 with two homers and seven RBIs as the primary designated hitter.The Royals hope Lopez can begin a rehab assignment in about two weeks after he went to the hospital Saturday night for an appendectomy. He was at the ballpark before Tuesday night's game and said he was feeling good.In other news, Royals left-hander Daniel Lynch allowed two runs on four hits and a walk over 2 1/3 innings in his first rehab outing for Double-A Northwest Arkansas. He went on the 14-day IL on March 30 with a rotator cuff strain.Outfield prospect Drew Waters, who was the frontrunner to start on opening day, suffered a setback in his recovery from an oblique injury that landed him on the IL in spring training. He was taking a swing when he felt tightness in his lower back.\"We're going to give him a couple of days and reevaluate and see what we can figure out,\" Quatraro said.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}