{
    "articleURL": "/tvshowbiz/article-12059737/Matt-Willis-says-battle-drugs-alcohol-conniving-manipulative.html",
    "content": [
        "Matt Willis opened up about his 'really sad' battle with drugs and alcohol in a new interview.  ",
        "The Busted star, 40, struggled to stay sober for most of his adult life after being launched to fame at just 19 years old. He entered rehab three times before he turned 25 - including once shortly before he married his The Voice presenter wife, Emma, 47, in 2008. Though he is now sober, Matt relapsed once more in 2017 while on the Busted reunion tour when his youngest daughter Trixie was just ten months old. Speaking to Radio Times about his addiction, he admitted: 'Addicts are very good at hiding everything. I’m yet to meet a stupid addict. They’re conniving and manipulative.",
        "'It’s not rock ‘n’ roll. It wasn’t glamorous, it was really sad.'In his early 20s the singer said couldn't get to lunchtime without drugs or alcohol.  Later, on the 2017 tour, he 'was doing six grams (of cocaine) on my own every day and not coming home until three in the morning' - a month after he started taking the drug again.Matt has made a documentary Fighting Addiction with the BBC, due to be released on May 17. He said that making the documentary had made him realise the impact his addiction was having on Emma, who would often break down in tears over fears he could relapse.   ",
        "'It was hard for me to see how much that fear was still prevalent for her,' Willis says, before adding that the documentary made the couple 'realise that we still had some talking to do'.  Matt previously shared some of the harsh realities from his drug addiction battle and the toll it took on his relationship with his wife.The star candidly admitted he would 'gaslight' Emma into thinking she was crazy during the height of his addiction struggles.",
        "During heavy binges Matt revealed he even left notes saying he was 'sorry' to his now wife, when he was convinced he wouldn't wake up the next day.In an interview with The Guardian, Matt spoke about the 'nights when he thought he'd gone too far, that he'd drunk too much and taken too many drugs'.",
        "Matt said he would leave notes for his wife, in case he didn't wake up. 'Saying sorry,' he says. In the morning, he'd find the note before she did and throw it away.The documentary touches on how Matt's addiction affected Emma, who is a popular TV presenter and the mother of his three children.Emma began keeping track of Matt's drinking and drug-taking by writing a diary, admitting she was scared that he would eventually take his life.",
        "Reflecting on how it damaged their relationship he says: '[Part of the recovery process] is you make amends to people you've hurt. I never did that with Emma; I don't think I ever can. I think the way I choose to do it is to be this guy, every day.'When she notices something, I take it on board and listen, and I don't argue. I go: \"You feel that way; that means that I am doing something, that's not in your head.\" Because I was the mastermind at gaslighting, making her think she was crazy. I'm so ashamed of that, and I never want her to feel like that again.'Earlier this year in an interview with Giovanna Fletcher on her Happy Mum Happy Baby podcast, Matt broke down as he revealed his battle with alcoholism caused him to miss his daughter's first crawl.He opened up on how missing the milestone had been a 'turning point' in his addiction and motivated him to get better.",
        "Matt and Emma have three children - Isabelle, 13, Ace, 11, and Trixie, six.Speaking to Giovanna Fletcher on her Happy Mum Happy Baby podcast, he became emotional as he recalled hitting 'rock bottom'.He said: 'When Isabelle was born, I stayed clean for a while, and then I relapsed again when she was about six months old.",
        "'I kind of, I missed Emma's birthday. She was in Birmingham and I was at, I was doing a TV show at the time.'It was the wrap party and I had a glass of champagne and I was off to the races that night; I turned up at her parent's house at four in the morning like it was nothing, off my head.'Fighting back tears, he continued: 'It was the worst. The next morning, I knew what I'd done. Emma told me that I missed Isabelle crawling.  'You know, she kind of bum shuffled and stuff. But I never, she never crawled - and she crawled that night for the first time, and I was in a pub with strangers.'You know, I missed that, and it really dawned on me that I was a terrible father.'It kind of - it really hit me. I saw everything, that cycle of s**t repeating, and it hit me like a tonne of bricks.'"
    ]
}