{
    "articleURL": "/wires/pa/article-12051293/Manchester-City-expected-welcome-Kevin-De-Bruyne-Leeds-clash.html",
    "content": [
        "Kevin De Bruyne could come straight back into the Manchester City side for Saturday’s Premier League match against Leeds.",
        "De Bruyne missed the wins over Fulham and West Ham after taking a knock late in City’s 4-1 win over Arsenal on April 26.Now, as City look to use Saturday’s fixture to go four points clear of the Gunners at the top of the table, the Belgian could be back after returning to training on Thursday.",
        "“He trained yesterday, trained good. Today we train and we decide after training,” Guardiola said.“Losing or missing just one week or 10 days in this stage of the season is not a problem. The same happened with Nathan (Ake). If he’s fit, he can play.”Tuesday’s first leg of the Champions League semi-final away to Real Madrid is already looming, but Guardiola insisted that game would not come into his thinking when deciding how to manage De Bruyne’s return, or his team selection as a whole.“There’s a lot of games and a lot of tension,” Guardiola said. “I see the team really tired after the demands from West Ham and Fulham. I have to see how the players recover, just three days from the previous game.“I will be focussed on how they are physically and mentally for this game. After, Madrid. The Premier League is so nice, it’s important to go four points in front of Arsenal, really important. All focus is on the game tomorrow.”",
        "City will come up against Sam Allardyce on Saturday as the 68-year-old takes charge of Leeds for the first time, having been brought in to try and save their Premier League status.“Always there is an impact of a new manager on the players for the first one or two games,” Guardiola said. “Every team is playing for important things. Of course for Leeds to stay here, the impact is always huge.",
        "“I don’t know how they play, we don’t have any info, we will have to adapt quick after five, 10 minutes. We can imagine what he tries to do. It’s a massive, important game for us…“When you don’t have information on the opponent, you don’t focus much on them. Focus more on you. You have to think about your team. We analyse the West Ham game to help us with the next game.”A meeting with Leeds will once again bring into focus Kalvin Phillips’ struggle for playing time at City.The £42million summer signing has made only eight appearances in the Premier League, all as a substitute, having suffered an early setback in his City career when he needed shoulder surgery in September.",
        "Displacing Rodri has proved all but impossible for the England man, who had to see the funny side when he was ushered off the bench in the 87th minute against West Ham on Wednesday, but had to wait until the start of stoppage time to get on – even with Guardiola urging his players to kick the ball out.",
        "Asked if Phillips still had an important role to play in the rest of the season, Guardiola said: “I’m sure he will be ready, always ready, every player is ready. The doctors, physios make an incredible job to have the players fit. We arrive with all the players ready, it’s really important.“Everyone has to be ready. I’m sure everyone will be important, a lot of minutes or a few minutes.”"
    ]
}