{
    "articleURL": "/health/article-12051021/Regions-England-vulnerable-measles-parents-urged-book-MMR-jabs-children.html",
    "content": [
        "In one London borough, almost half of children have not got the routine MMR jabRead more: Health chiefs urge parents to book MMR jabs after measles surgeEngland's most vulnerable areas for a potential measles outbreak have been revealed in a MailOnline map amid a 'concerning' spike in cases.",
        "The UK Health Security Agency (UKHSA) yesterday confirmed that it has detected 49 cases so far this year — which nearly manages the total spotted throughout all of 2022.Health chiefs warned that 15 per cent of five-year-olds in England have not had their measles, mumps and rubella (MMR) vaccine, which is the best way to prevent it.But local authority data shows that only half of youngsters are protected against measles in parts of England, with the lowest uptake in parts of London.Officials at the UKHSA have urged the parents of un-jabbed children to book an appointment with their GP to prevent further outbreaks. ",
        "UKHSA data revealed that, by December, less than three-quarters of five-year-olds in London had received both doses of the MMR jab — the worst regional uptake in the country. So far, London has been worst hit by measles outbreaks, with 33 cases this year.And only around half (55.2 per cent) of five-year-olds in Hackney, London had both dosses of the MMR jab — the lowest out of all authorities in England. Hackney was also a low performer in the first MMR jab, with one third of children in the borough missing out by their second birthday.The vaccine, which has been dished out since the 80s, is delivered as two doses, one around a child's first birthday and again after they turn three. ",
        "After the capital, West Midlands was the next worse region with only 84.5 per cent uptake. ",
        "Vaccinations for various unpleasant and deadly diseases are given free on the NHS to children and teenagers.Here is a list of all the jabs someone should have by the age of 18 to make sure they and others across the country are protected:Eight weeks old6-in-1 vaccine for diphtheria, tetanus, whooping cough, polio, Haemophilus influenzae type b (Hib), and hepatitis B.Pneumococcal (PCV)RotavirusMeningitis B 12 weeks oldSecond doses of 6-in-1 and Rotavirus 16 weeks oldThird dose of 6-in-1Second doses of PCV and men. B One year old Hib/meningitis CMeasles, mumps and rubella (MMR)Third dose of PCV and meningitis B Two to eight years oldAnnual children's flu vaccineThree years, four months oldSecond dose of MMR4-in-1 pre-school booster for diphtheria, tetanus, polio and whooping cough12-13 years old (girls)HPV (two doses within a year)14 years old3-in-1 teenage booster for diphtheria, tetanus and polioMenACWY   Source: NHS Choices",
        "This was followed by the North West and East Midlands where only 86.4 and 86.6 per cent of five -year-olds were jabbed.The East of England and South East performed better, with 88.5 and 87.6 per cent of their kids getting the vaccine.But the best performing regions were at the opposite ends of the nation, with the South West coming in at 90.7 per cent and the North East with 91.3 per cent.Local government figures, however, reveal some areas have startlingly low uptake, the vast majority in London. After Hackney, the second lowest performer for second MMR dose was Camden with only 63.2 per cent of five-year-olds vaccinated.This was followed by Islington (64.5 per cent), Kensington and Chelsea (64.6 per cent) and Enfield (65.3 per cent).",
        "In terms of first dose for two-year-olds, the lowest performer in England was the Isles of Scilly, off the Cornish coast, where only 66.7 per cent of toddlers had been jabbed.Overall levels of vaccination across England are far below the 95 per cent measles vaccination target set by the World Health Organization, a level which helps prevent isolated cases spilling out into an outbreak.Only one area in the whole country managed to meet this target: Northumberland in the North East. Health chiefs are currently embarking on a campaign to boost MMR uptake ahead of the summer season when global travel and crowded festival events can make it easier for measles to spread.Dr Vanessa Saliba, consultant epidemiologist at UKHSA, said: 'We are calling on all parents and guardians to make sure their children are up to date with their 2 MMR doses.'It's never too late to catch up, and you can get the MMR vaccine for free on the NHS whatever your age.'She warned while measles is usually mild, there was always the risk of a fatal outcome.  'Measles spreads very easily and can lead to complications that require a stay in hospital and on rare occasions can cause lifelong disability or death, so it is very concerning to see cases starting to pick up this year,' she said. ",
        "Cold-like symptoms, including a high temperature, a runny or blocked nose, sneezing, a cough and red, sore and watery eyes, are usually the first signs of a measles infection.A few days later, small white spots may appear inside the cheeks and on the back of the lips.A rash, made up of raised red blotchy patches that join together, usually appears on the face and behind the ears before spreading to the rest of the body. Symptoms usually improve within a few weeks and be managed by drinking plenty of fluids and taking paracetamol or ibuprofen to relieve a fever.",
        "However, if measles spread to the lungs or brain, it can cause pneumonia, meningitis, blindness and seizures. Experts said the spike in England is being echoed on a global level after childhood immunisations programmes were disrupted by the Covid pandemic.This has resulted in some cases being imported to Britain, with a quarter of the cases detected this year being imported from other countries, according to the UKHSA. It said the remainder were a result of community transmission within England itself, including a cluster of cases related to a school outbreak.Nationally, 40 per cent of cases detected so far in 2023 are among children aged under five. Professor Helen Bedford, an expert in child public health at University College London, has said the rises in cases was 'worrying but not surprising'. ",
        "She said: 'Unfortunately, we have seen a decline in MMR vaccine uptake in recent years. MMR vaccine uptake is now less than 90 per cent.'Measles is so highly infectious that even a small decline in uptake can result in outbreaks – we need to maintain uptake of 95 per cent of two doses of MMR vaccine to prevent such outbreaks.'Professor Bedford said Covid making measles seem like less of a threat, a rise in vaccine hesitancy and GP pressures could be blame for the decline in uptake. She said: 'There may be some vaccine hesitancy, though surveys by UKHSA and others suggest this isn't a major reason in the UK. However, such surveys often do not capture everyone's, particularly those with more extreme, anti vaccine, views. 'Fewer health visitors and pressure on general practice, are both likely contributing to lower vaccine uptake.'Health chiefs are urging parents of young children, teenagers, as well as adults themselves, to check they are up to date on the MMR vaccination.Data suggests that 20million measles cases and 4,500 deaths in the UK have been prevented since the first vaccine that targeted the virus was deployed in 1968.  Parents can check their children's MMR vaccinations by checking their vaccine record in their Red Book.",
        "Anyone who has not had two doses of the MMR vaccine can contact their GP surgery to book an appointment.Symptoms of measles include a high fever, sore red watery eyes and a blotchy red brown rash.While usually mild it can require a stay in hospital in some cases.Serious cases of measles can lead to pneumonia, meningitis, and even long-term disability or death.So far this year the West Midlands and Yorkshire and the Humber are only regions to have been spared any measles this year.  "
    ]
}