{
    "articleURL": "/wires/reuters/article-12057835/Sporting-KCs-win-comes-against-place-Sounders.html",
    "content": [
        "Alan Pulido scored his first goal since August 2021 and visiting Sporting Kansas City finally snapped their witness start to the season with a 2-1 victory over the Seattle Sounders on Sunday.",
        "Erik Thommy scored an early opener and then assisted Pulido for Kansas City (1-7-3, 6 points), which became the last MLS team to win its first game against a Sounders team that remains atop the Western Conference standings.Pulido's goal later in the first half stood as the matchwinner for the visitors in the Mexican striker's sixth appearance of 2023 after missing all of 2022 while recovering from knee surgery.Nicolas Lodeiro scored from the penalty spot for his first goal of the season for the Sounders, who were previously unbeaten at home.Seattle (6-3-2, 20 points) also conceded at home for the first time this season on a day the Sounders missed starters Cristian Roldan, Raul Ruidiaz and Nouhou to injury, and Joao Paulo to a yellow card suspension.Sporting came to Seattle with only one goal scored away from home all season, but took the lead in just the fourth minute.Thommy began the move with a pass down the right to Daniel Salloi, who then dragged a cross back toward the penalty spot. Gadi Kinda met it first with a gentle touch to set up the shot for the on-rushing Thommy, who hammered a first-time effort into the bottom left corner.Pulido doubled the visitors' advantage 27 minutes later. Thommy was again the creator when he took a pass from Jacob Davis on the right flank and cut left toward the area just beyond the penalty arc.",
        "Thommy spotted Pulido making a run and then cut a slick pass to his right through a couple of defenders. Pulido ran onto it and cut a low shot from a narrow angle past Stefan Frei and inside the left post.Lodeiro cut Seattle's deficit in half in the 66th minute after substitute Fredy Montero won a penalty kick by darting into the edge of the area and seducing Logan Ndenbe into a late challenge.Kansas City goalkeeper Tim Melia has saved roughly 40 percent of the penalties he has faced since 2016, but was easily beaten by Lodeiro's low finish.--Field Level Media"
    ]
}