{
    "articleURL": "/wires/pa/article-12053865/Chinese-vice-president-dignitaries-invited-Westminster-Abbey.html",
    "content": [
        "Chinese vice-president Han Zheng, who presided over a crackdown on civil rights in Hong Kong, is among the dignitaries from around the world invited to Westminster Abbey for the coronation.",
        "The presence of Beijing’s representative is highly controversial due to his role in the former British territory, but the UK Government has made clear that it wants to maintain engagement with the Asian superpower despite political differences.The decision to invite Mr Han to the King’s coronation has been strongly criticised by China hawks on the Tory benches and Lord Patten, the last British governor of Hong Kong.The Foreign Office said 90 heads of state attended.French President Emmanuel Macron and his wife Brigitte, Israeli President Isaac Herzog and wife Michal were also among the guests in the abbey.",
        "US President Joe Biden was absent, but first lady Jill Biden and her granddaughter Finnegan Biden were at the event.Mr Biden said: “The enduring friendship between the US and the UK is a source of strength for both our peoples.“I am proud the first lady is representing the United States for this historic occasion.”Ukraine’s first lady Olena Zelenska and Prime Minister Denys Shmyhal represented the war-torn nation, with Mr Shmyhal saying the King had offered “unwavering support” for the people of his country as it resisted the Russian invasion.",
        "Russia was not represented at the abbey, nor was its ally Belarus.Other countries not invited to send representatives to the ceremony include Iran, Myanmar, Afghanistan, Syria and Venezuela.",
        "Protocol for the event, which will see world leaders and dignitaries descend on London, sees invites issued to almost every head of state with whom the UK enjoys full diplomatic relations.Invitations to North Korea and Nicaragua followed the same approach as those to the funeral of the Queen, with heads of mission offered the chance to attend."
    ]
}