{
    "articleURL": "/news/article-12060943/Republicans-border-wall-withstand-WIND-Karine-Jean-Pierre-says.html",
    "content": [
        "Jean-Pierre referenced an incident when wind blew down an incomplete sectionShe attacked the House GOP budget before bipartisan talksTitle 42 authority ends Thursday amid expected immigration crunch White House Press Secretary Karine Jean-Pierre tried her hand Monday at attacking the House Republican and former President Trump's border wall – on a day when the feds are preparing for an even greater crush of migrants at the southern border.",
        "Jean-Pierre tied together White House attacks on the House GOP budget, on the eve of President Joe Biden's meeting with Republican leaders and a looming debt ceiling deadline that has raised the specter of default.With that potential crisis looming, she recycled earlier White House Office of Management Budget warnings that the House GOP budget would lead to cuts in U.S. Border Patrol agents.'Earlier this month, House Republicans voted to fire 2000 Border Patrol patrol agents, and this week, they're taking up a bill that would once again demonstrate that House Republicans are more interested in campaigning on immigration, that's actually solving it,' she said.",
        "Biden is set to sit down with congressional leaders about the budget on Tuesday at 4 pm, just as financial markets close –  with few signs that the two sides are moving any closer together.Jean-Pierre was referring to H.R. 2, which would among other things, force the Biden administration to resume border wall construction.   'The bill, H.R. 2, would be a disaster for border security and a Christmas morning gift for human smugglers,' she said. 'It would lead to more unlawful migration by blocking off lawful pathways to protection it would trample on our nation's core values and international obligations and a boon to dictators around the world. And instead of providing the needed resources for more border security technology, and asylum officers and judges, it would waste taxpayer dollars on an ineffective wall.'",
        "Then she tore into the wall some more. 'Again, an ineffective wall that can't even withstand heavy winds, let alone sophisticated criminal smuggling networks. If the President presented with HR to he would veto it,' she said.Jean-Pierre appeared to be referring to an incident from January 2020, when a section of border wall fell onto some trees along the U.S.-Mexico border.  There were no injuries, and it is believed the section fell amid 30 mile per hour gusts while concrete was still setting. The White House OMB also trashed the GOP bill in a new Statement of Administration Position, saying it 'makes elements of our immigration system worse.' ",
        "House conservatives have hit back at White House characterizations of the budget, withe House Freedom Caucus chair Rep. Scott Perry (R-Pa.) accusing the White House of 'smear and fear.' The tussling came just before another Trump Administration aspect of border policy – Title 42 restrictions – was set to fall. With Title 42 gone, the new watchword will be Title 8 of the Immigration and Nationality Act. It gives those seeking asylum the ability to participate in a 'credible fear' interview with an officer or judge.If they fail it, they could soon be back on a plane to their home country or Mexico through expedited removal proceedings. Otherwise, they can begin the lengthy process of seeking asylum."
    ]
}