{
    "articleURL": "/wires/reuters/article-12044313/Panthers-eye-commanding-2-0-series-lead-Toronto.html",
    "content": [
        "The visiting Florida Panthers will be in a no-lose situation Thursday night against the Toronto Maple Leafs in Game 2 of their Eastern Conference second-round playoff series.",
        "After defeating the Maple Leafs 4-2 in the opener of the best-of-seven series Tuesday, they are assured of at least a split on the road to open the series.A victory, however, would give them control of the series at 2-0 with the next two games at home.The Panthers also enjoy the realization that they were not expected to go this deep into the playoffs. They were not supposed to defeat the No. 1 seed Boston Bruins, who had a record-setting regular season with 65 wins and 135 points.Yet, despite being down 3-1, the Panthers won the next three games, including Game 7 in overtime in Boston on Sunday.They will be going for their fifth straight win on Thursday.Despite having only one day between games, the Panthers had more jump than the Maple Leafs, who had clinched their series with the Tampa Bay Lightning on Saturday.The Panthers pounced on Maple Leafs' mistakes to take a 2-0 lead and responded after the game was tied 2-2.The key was a breakaway goal by Carter Verhaeghe at 17:47 of the second period that made the score 3-2.\"There's some real high-end skill throughout their lineup that can make a lot of plays at a high pace,\" Maple Leafs coach Sheldon Keefe said. \"When you make a mistake, the recovery time is not really there, because they're making the play and they attack the net with a lot of urgency.",
        "\"It was a step quicker than it was in the previous series, and that caught us. We made some mistakes that we didn't necessarily make (against the Lightning). Credit to Florida, they played a great game. But it's a long series and we'll make some adjustments.\"Matthew Tkachuk had three assists and a game-high nine hits for Florida.\"I thought we were good tonight. I didn't think we were great,\" Panthers coach Paul Maurice said. \"We went from such an extreme series in terms of physicality that I`d say it was under-physical from what we were used to. They had a good pushback halfway through the game. We kind of got a little away from what we're good at, and they got closer to what they're good at. That'll be the battle in this series.\"Panthers goaltender Sergei Bobrovsky made 34 saves.\"The back half of that game, he was brilliant,\" Maurice said, \"and we required him to be.\"\"We've got to get more in front of him,\" Keefe said. \"One of the big differences in our scoring chances that we had here tonight -- whether you look at the power-play chances or five-on-five, or six-on-five -- we had a lot more tonight in closer to the net than we've had maybe in the previous series. We've just got to make good on those.\"",
        "Panthers defenseman Brandon Montour, who scored in the third period, said he likes the way Florida is playing now.\"Playoffs, anything can happen,\" Montour said. \"You say run, but everyone's on a run right now. We've still got a lot of hockey left. We're obviously happy with that win. That's one, but we need to get three more.\"--Field Level Media"
    ]
}