{
    "articleURL": "/sciencetech/article-12047111/Worlds-Smart-Glock-facial-recognition-fingerprint-unlock-launch-1-500.html",
    "content": [
        "Colorado-based Biofire hopes to stem the rising tide of gun violence in America with fingerprint sensors and 3D infrared facial recognitionStart-up began as a high school science fair project, inspired by founder Kai Kloepfer's worry after the July 2012 Aurora movie theater massacre   Pre-orders for the 9mm handgun are now available online, with the first shipment of guns said to arrive in early 2024Americans can now pre-order a 'Smart Gun' that requires facial recognition and fingerprint technology to fire.",
        "Start-up firearms manufacturer Biofire is selling the futuristic-looking 9mm handgun for $1,500 with orders due to ship in 2024. The smart gun scans two forms of biometric ID, an optical fingerprint sensor and 3D infrared facial recognition, to ensure that only the gun's true owner can activate the firearm – cutting down on accidents and misused stolen weapons.The Broomfield, Colorado-based company hopes its pistol will put a dent in America's cycle of gun violence.More than 13,900 people have already been killed by guns in the U.S. in the first four months of 2023 alone, according to the nonprofit Gun Violence Archive.",
        "Biofire's marketing statements estimate that its smart smart gun could avert the roughly two thirds of gun deaths attributed to suicide in the US each year, an estimate that would have amounted to 22,000 lives saved in 2018.But Biofire's estimate has been accused of being inflated.An analysis by Engineering &amp; Technology (E&amp;T), the in-house publication for the not-for-profit Institution of Engineering and Technology in the UK, estimated that only about 6,109 annual gun deaths would likely be prevented. E&amp;T based its findings on US Center for Disease Control data and other research reports.In either case, of course, that's only if the high-tech firearm makes it to market, on time, as planned.",
        "'Our goal is not just to start collecting orders, but to get this into full production and produce as many of these as people want to buy,' Biofire's 26-year-old founder and CEO Kai Kloepfer told the Denver Business Journal, 'because it's a great concept and one that I think is going to be a good thing for the world.''It has the ability to have an incremental, immediate impact that sidesteps a lot of the gridlock politically,' Kloepfer believes.As a high schooler in 2012, Kloepfer lived about a half-hour drive from the Denver-suburb of Aurora, where a gunman killed 12 people and wounded many more at a midnight screening of Batman sequel The Dark Knight Rises.The Gen Z entrepreneur immediately began toying with the idea of a biometric lock system that could make firearms safer from abuse, accidents and theft.Soon, his concept for a fingerprint-scanning handgun went from science fair project to landing him a spot on Forbes 30 Under 30 list.He then caught the attention of libertarian VC Peter Thiel's Founders Fund, which helped him raise more than $30 million for the start-up.",
        "Biofire, alongside its competitors in the 'smart gun' space, such as LodeStar Works and SmartGunz, have boasted  for years that their products are nearly ready for market with launch dates still shimmering on the horizon. ",
        "Last year, the senior vice president of firearms industry trade association the National Shooting Sports Foundation (NSSF), Lawrence Keane, expressed skepticism last year over these firms repeated promises.'If I had a nickel for every time in my career I heard somebody say they're about to bring us a so-called smart gun on the market,' Keane said, 'I'd probably be retired now.'Nevertheless, U.S. customers ready for their pre-order can pay a $149 deposit, about one-tenth of the smart gun's $1,499 price tag, to reserve their weapon via Biofire's website. "
    ]
}