{
    "articleURL": "/wires/pa/article-12057073/Callum-McGregor-feels-come-dominant-champions-Celtic.html",
    "content": [
        "Celtic captain Callum McGregor believes his team can continue to improve after retaining the cinch Premiership title in style.",
        "The Hoops wrapped up their 11th title in 12 years with four games remaining thanks to a 2-0 victory over Hearts at Tynecastle.The champions have only lost once in the league, against St Mirren in September, and can set a top-flight points record of 107 if they win their remaining matches.Midfielder McGregor told Sky Sports: “I think there’s the makings of a really special team.“You see when the going gets tough you have to fight the game out a little bit, like we had to do first half. So we have got that side of it, which you need to have if you want to be champions.“And you see at the end there with the quality we could probably score another two or three goals.”",
        "When asked if they could get even better, the 29-year-old said: “We are certainly on the right track but we have to keep on working.“You can see it, you can see it – a lot of young players. You get over the line and you get more experience. You want to do it again the following season and you want to do it in a better style.“I believe we have done that this season and there is always more to come.”",
        "McGregor has won four out of five domestic trophies so far as skipper and can lead the team to the treble when they face Championship side Inverness in the Scottish Cup final on June 3.“It’s a dream come true for me, it’s such a privilege, every day that I come into my work and represent this club, represent these guys,” he said. “It’s an absolute pleasure.“At the start of the season this is always what the club wants, it demands success. Over a period of 38 games you have to be the best team and the best team will win the league.“I’m so happy for the players, the staff, the supporters, everybody connected with the club. A really special day again.”"
    ]
}