{
    "articleURL": "/tvshowbiz/article-12041785/Jessica-Ennis-Hill-reveals-never-talk-period-male-dominated-environment.html",
    "content": [
        "Jessica Ennis-Hill has revealed that, throughout her career, she felt unable to talk to her coaches or teammates about her periods because it is such a 'male dominated' environment.",
        "The track and field athlete, 37, admitted that she felt too 'uncomfortable' to speak to male coaches and athletes within Team GB about her hormones and menstrual cycle. It is only after retiring however, that she has come to realise how important the topic is - insisting: 'There needs to be more done'.The star - who won gold in the women's heptathlon on Super Saturday at London 2012 - said as women go through different phases in the month they can feel stronger, more confident, or more fatigued or bloated. She told the Mid Point podcast: 'It still blows my mind that actually there's such little research and time and investment spent in understanding these massive phases that we go through as women.",
        "'There needs to be more done.'Ennis-Hill revealed that during her career she had no idea her physical condition and strength could be affected by the menstrual cycle.She said: 'That was the thing that stood out to me the most, that when I look back on my career we were so focused on psychology and sleep and nutrition and all these important elements.'But actually, the whole hormonal side - which was a constant for every woman, it's happening whether you like it or not - was never really looked at in any great depth.",
        "'I look back and think part of that was because I was in a very male-dominated environment and I felt uncomfortable having those conversations with a male coach and a male team.'But also, there's just a lack of energy and funds and time being given to research how we are affected by these fluctuations and hormones throughout the month.'It's so under-researched but we as women know that you can stop any woman in the street and she'll be able to say \"I feel different at this time of the month\" or \"I have these range of symptoms\".'We feel that we have to just get on with it and it's just what we feel monthly - but actually there's a way of understanding our hormones better and using them to our advantage.'",
        "Jessica's statements come after she cut a glamorous figure as she attended the BBC Sports Personality Of The Year Awards at MediaCityUK, Salford in December.She ensured all eyes were on her as she walked the red carpet alongside her husband Andy Hill.The Olympic champion donned a light blue midi dress with an off the shoulder detail and cinched her waist with a silver belt.Adding height to her frame with a pair of peach heels, Jessica styled her locks into loose waves for the evening.",
        "Her partner Andy looked dapper in a navy suit which he paired with a white shirt and light blue tie.The couple tied the knot back in 2013 and are parents to eight-year-old Reggie and four-year-old Olivia."
    ]
}