{
    "articleURL": "/columnists/article-12049089/Why-heads-roll-husbands-royalist-youre-republican.html",
    "content": [
        "TANYA SAYS...I was in London when the Queen died, and my husband was at home in Cornwall. I texted him with the news. He replied simply: ‘God save the King!’ I can’t be sure, but I suspect he was standing when he typed it. I showed it to my friend, the son of a Tory peer, and even he said: ‘Your husband’s such a Tory!’",
        "The following week my husband performed many rituals. He went to church to pray for Elizabeth II’s soul. He instructed our son to lay a rose for her in his Cubs uniform at a church service, and taught him how to bow sternly, with no flourishes. He wore a black tie and would have worn a black armband, if he hadn’t thought it was showing off. He mourned.He, clearly, is a monarchist. But I am not, and tomorrow’s Coronation has created an undoubted, if temporary, tension in our home. I suspect this dynamic is being played out all over Britain, particularly between the younger generation and their parents, because in general the older you get, the more you like the monarchy, and vice versa.My trajectory has been different. I was on the fence when I was younger — monarchy seemed neither good nor bad to me — but Prince Harry having to walk behind Diana’s coffin aged 12 shocked me. I think much of what the Royal Family go through is cruel. I cried when I saw Elizabeth II’s coffin travelling down the A40 in September, but I cried for the woman, not the Queen.She could have had a life of her own; instead, she spent her time eye-balling infrastructure and being curtseyed to by men who lost their wits in her presence.",
        "The older I get, the more anti-monarchy I am. I go to republican lectures and conferences. I would be at anti-monarchy protests in Trafalgar Square tomorrow, if only I could bear the crowds.Monarchy protects the class system, which isn’t going anywhere — I see its impact here in west Cornwall, one of the poorest parts of western Europe — and prevents us from having a serious and engaged political life, which we badly need.I think the late Queen gave us the illusion of protecting us from ourselves and it’s time to grow up. I always think of W. H. Auden’s line when I think about monarchy: ‘Who can live for long in a euphoric dream?’My husband thinks the opposite, and this is typical of his upbringing and class. He was born into an ancient farming family in a Wiltshire village, and he is a Tory romantic who yearns for the time when the squire, the vicar and the doctor kept the village safe from harm. But who kept the village safe from them?I am a social democrat who grew up in the suburbs of London. He thinks Christ is his redeemer; I am an irreligious Jew who doesn’t believe a man can be resurrected or that a burning bush can talk — or, if it could, what are the chances that some biblical era journalist was there to write it down?",
        "How do we bear the chasm between us? Perhaps it is because I don’t listen — that’s what he would say. Or perhaps I like the drama of difference: marriage is a life sentence after all.But there are flashpoints. Royal events can be particularly fraught. For the first one in our marriage — Prince William’s wedding to Kate Middleton — I managed to be out of the country. I went to Russia to write a piece about ballet dancers and found that former communists congratulated me, very formally, on the royal nuptials, which depressed me.I managed to duck the Golden and Diamond Jubilees, though my husband raised a glass to Her Majesty.",
        "He did trap me once: we found the then Prince of Wales standing in the farmers’ market in Penzance. People were handing out flags to wave at him.My husband took a flag for himself and one for our son — who was too young, at three, to be told that constitutional monarchy is a fragile political system with innate contradictions that may one day overwhelm it, so I let it go — and I took one out of cowardice, too, though I didn’t wave it enthusiastically.I’m not worried about the impact of his politics on our son, now nine, by the way. If parents are politically different, children tend to follow their mother’s politics. My husband told me that.",
        "He will bake a coronation quiche this weekend, because he thinks it is his duty. (Of course, he would prefer ham and cheese to summer vegetables and cheese, but he won’t say so, out of loyalty to the Crown. The King knows which quiche is best!)He will stand and say the Oath of Allegiance on Saturday as we watch it on TV — me for the spectacle, and him for the sacred ritual that he believes preserves our country.He will attend a street party on Sunday, and he will wave a Union Jack at other monarchists. I love my neighbours, but I am already scowling at their bunting.He made me apply for Sunday’s Coronation Concert in Windsor. When I got an email to say we were on the reserve list and could click for a ticket, I ‘forgot’ to click on it. I couldn’t face it: I don’t like sycophancy, or crowds, or crowds of sycophants.The strange thing is, I am more obsessed with the minutiae of royalty than he is. I read every book and I watch every documentary, film and TV series.He won’t touch Prince Harry’s Spare, he can’t be talked into watching Channel 4’s satire The Windsors, and he hasn’t even seen the (brilliant) first season of The Crown. I tell him some amazing piece of royal gossip — Prince Charles proposed to Diana Spencer in Camilla’s garden (Tina Brown’s The Palace Papers) or Prince William and the Van Cutsem brothers chased Harry with shotguns (Spare) expecting him to be electrified. He looks at me as if I am boring him.",
        "He isn’t interested in their personalities at all — it’s not what they do, but who they are, he says — though he does have a book called God Save The Queen: The Spiritual Dimension Of Monarchy, which he reads sometimes while looking deeply content.If his royalism is absolute, I wonder if it is partly atonement. Because there is a smoking gun. His paternal grandmother was a Ludlow of Wiltshire, and another Wiltshire Ludlow — Edmund — was one of the men who tried Charles I and signed his execution warrant.So, while I am just a snarky social democrat dreaming of an elected head of state and a written constitution, he is possibly related to a regicide. I saw an engraving of Edmund Ludlow, who died in exile, and he really does look like him.It’s uncanny, actually: they have the same nose. Perhaps his monarchism is the opposite of exile, the thing that anchors him to this world. But me? I’m innocent.ANDREW SAYS... Tanya always says that monarchists should ‘grow up’, as if we’re children who aren’t ready for politics. She would interrupt our son’s bedtime stories to editorialise: not all princes are charming, and wouldn’t it be a really happy ending if the king and queen abdicated and executive power came from the ballot box?",
        "Happily, he ignores this, like he ignored the teddy bear she proudly brought back from one of her republican conferences with ‘When I grow up, I want to be president’ written across his tummy. (‘Seventy people, Andrew! The biggest conference yet!’)What she doesn’t realise, of course, is that constantly demanding people ‘grow up’ is just the whining of a teenager, desperately trying to show that you are more sophisticated than some little kid two years younger. One’s reaction is to ruffle her hair and tactfully wait for her to turn 16. She’ll get it out of her system eventually.It’s not just the propaganda of fairy stories — or, as they grow older, adventure stories about dashing kings and heroic princes. I took my son to my favourite battlefield, near where I grew up in Devizes — Roundway Down was the scene of a stunning victory in the Civil War. (Or, as Tanya would say, a horrible defeat.)I used to love this when I was a child, mainly because the battle ended with the brave Royalist commander Prince Maurice driving the Roundheads, who were loitering within tents on Oliver’s Camp, into a gully still known as Bloody Ditch. (You could use the word ‘bloody’ and grown-ups couldn’t touch you for it!) I could see my son finding it as thrilling as I did, waving a goodly stick at unseen Parliamentarians. All I needed to do was mention that one side wanted to ban Christmas.",
        "Monarchy gives us an identity in the world, a sense of who we are and where we have come from. We all need this; and people who say they don’t merely transfer it on to something else.You see this in America, where people imbue particular parties or particular issues or particular clauses of the Constitution with the loyalty that we give to a king who has promised to serve us.You see it in fascist dictatorships, where the sort of people who, in this country, wave Union Jacks outside royal visits are attending rallies to hear a demagogue speak.And you see it in Tanya, banging on about the Liberal Democrats when I’m trying to cook supper.Tanya gets disgusted by politicians receiving gongs — it’s odd that she can believe that the honours system is a pointless anachronism, but also that it’s an abuse when a former Cabinet minister gets a knighthood. But I like the fact that it’s the most a politician can acquire.In other political systems, knowing where all the bodies are buried will get you the presidency, an ambassadorship or, best-case scenario, a privatised utility. Here, the most you can hope for is to call yourself Sir Gavin on your letterhead.Keeping a space at the head of the nation free from politicians is absolutely vital for our democracy; and keeping headspace free from politicians is vital for our sense of belonging.Tanya doesn’t believe me when I say my earliest memory was the Silver Jubilee — I would only have been two — but I can still remember eating tea in the street in front of our house, knowing only that something significant was happening. (Tea parties are always significant when you’re two, so this obviously struck me on a more profound level.)My mother — whose first memory was going up to London to watch the Coronation procession 25 years earlier — kept a box of significant things under her bed, always meaning to put them into a scrapbook but never quite getting round to it. I only found it after she died.Half of the Significant Things were from our family — my childhood paintings, including one that was ‘Highly Commended’ in a school art competition, an article in the Wiltshire Gazette and Herald about my sister’s netball team — and the other half were from the Royal Family, souvenir editions of newspapers and orders of service from royal weddings.Not that she divided them in half; they were all thrown together hugger-mugger, as if there was no real difference between the family I grew up in and the family at the centre of British life. Perhaps there isn’t.No space for them in our home, Tanya said, as she binned them. I tried to object to seeing my childhood being thrown away, but our house, it turns out, is an absolute monarchy."
    ]
}