{
    "articleURL": "/wires/reuters/article-12057335/Tennis-Alcaraz-beats-Struff-clinch-Madrid-titles.html",
    "content": [
        "By Fernando Kallas",
        "MADRID, May 7 (Reuters) - World number two Carlos Alcaraz beat lucky loser Jan-Lennard Struff 6-4 3-6 6-3 in the Madrid Open final on Sunday to defend last year's title and win his fourth ATP Tour trophy of the year and his tenth overall.Alcaraz, who had an injury-plagued start to the season, came back in top form last month to win the Barcelona Open for the second consecutive year.The victory was the fourth ATP Masters 1000 trophy for Alcaraz, who became the youngest world number one last September when he won the U.S. Open and held that spot for 20 weeks until Novak Djokovic took it back in January.He could reclaim the world number one spot from Djokovic if he shows up to play in Rome later this week, as he has no points to defend and the Serbian would be defending his crown and 1000 points in Italy.In Madrid, the 20-year-old Spaniard had to play his best tennis to beat a relentless Struff in three sets in a packed Caja Magica.Lucky loser Struff's run to the final was part of a remarkable turnaround in fortune for the German, who dropped outside the top 100 last year but is back up to 65th after reaching the quarter-finals of last month's Monte Carlo Masters.",
        "Alcaraz enjoyed a dream start to the match, breaking Struff´s serve in the first game.The German fought back to return the favour, making things uncomfortable for the world number two with his aggressive tactics and relentlessly attacking Alcaraz´s serve.Struff nailed every return to break serve in the fourth game but the Spaniard produced another break and closed the set 6-4.Struff rushed to a 3-0 lead in the second set, which he took 6-3, but Alcaraz woke up in the third, breaking to lead 3-1 and taking the set 6-3.\"I have suffered more than I have enjoyed today but the finals are like that,\" Alcaraz said.\"There are times when your nerves get the better of you, your legs are heavy and it's difficult even though you want to play well.\"You have to be there all the time, Struff is very aggressive. I knew I was going to get bombs and I had to be prepared for it.\" (Reporting by Fernando Kallas; editing by Clare Fallon)"
    ]
}