{
    "articleURL": "/wires/pa/article-12039061/Wrexham-fans-What-Ryan-Reynolds-Rob-McElhenney-means-everything.html",
    "content": [
        "Wrexham FC fans have said what Ryan Reynolds and Rob McElhenney have done for their club “means everything” as they celebrated promotion to the English Football League.",
        "There were jubilant scenes in the Welsh city on Tuesday as the team returned for an open top bus parade, which the Hollywood stars attended.Wrexham sealed their promotion to League Two after a 15-year absence with a 3-1 win over Boreham Wood on April 22.",
        "Long-time supporter Jason Jones told the PA news agency that the work of the two “big names” was “surreal”.“Fifteen years of non-league football that at times has been really depressing, it’s been dreadful,” he said.“But the two big names came in, they bought us and this is what they’ve done … it’s surreal, to be honest.“It’s a once-in-a-lifetime (thing) – for A-list celebrities to come in and do this. It just wouldn’t work with anybody else, would it?",
        "“When these guys came in we knew something special was going to happen, and it has.”Thousands of Wrexham fans of all ages lined the streets, chanting and waving flags and scarves, as the three buses made their way through the city on a loop that started and finished outside the Racecourse Ground, cutting through a fog of red smoke from the ubiquitous flares.But it was not just locals celebrating, with some US fans making the trip to Wales to share in the victory celebrations.",
        "Robin Beattie, from Southbury, Connecticut, said she and her husband “fell in love” with the “Cinderella story” of the team.",
        "Having been on a recent holiday to Dublin, they decided to come to Wales to watch the team and their famous owners celebrate promotion.“We love Ryan Reynolds and Rob and it just went from there, we followed it all the way through,” she told PA.“It’s a Cinderella story, we love it – we’re very happy to see the excitement in the town and be part of it.”Reynolds and McElhenney were at the Racecourse Ground for the victory over Boreham Wood last month, joining in with the post-match celebrations among joyous fans on the pitch.",
        "Both were pictured beside the women’s team on the second of the three buses on Tuesday.The pair previously said there was “seriousness” to their offer, broadcast on Twitter, for Gareth Bale to come out of retirement and play for Wrexham after the team’s promotion.The former Wales captain announced his retirement at the age of 33 in January after leading Wales to their first World Cup finals appearance since 1958.Reynolds also said bringing the trophy home was “probably at least the top one experiences of my life” and that he is now “emotionally connected” to every single player in the club.",
        "“I don’t know that I’ll ever be quite the same again,” he said, during an interview with S4C on Tuesday.“I live in a sort of constant, slightly perpetual state of elation and I don’t want to come back down from this cloud.“I realise that this isn’t a sport for the soft-hearted, but to experience that moment and to bring that trophy home to Wrexham was probably at least the top one experiences of my life.”“And I am aware that I have children,” he joked."
    ]
}