{
    "articleURL": "/wires/ap/article-12041237/Palace-weapons-arrest-comes-amid-coronations-security-push.html",
    "content": [
        "LONDON (AP) - The coronation of King Charles III involves one of the most important and complex security operations in U.K. history, Britain´s security minister said Wednesday, as rights groups accused the authorities of stifling civil liberties in their attempt to ensure events run smoothly.",
        "Security Minister Tom Tugendhat said the coronation involves \"one of the most important security operations that the country has put into plan,\" with scores of foreign royals, dignitaries and heads of state expected to attend Saturday's Westminster Abbey service.\"This is an enormously important moment for the country,\" Tugendhat told Times Radio. \"The police are, to put it mildly, all over it, and our intelligence and other security forces are extremely aware of the challenges that we face and ready to deal with them - as the police did quite brilliantly yesterday.\"As thousands of police began to be deployed across London, officers arrested a man and blew up a suspicious bag outside Buckingham Palace.London's Metropolitan Police force said the man approached the palace gates on Tuesday night and asked to speak to a soldier. When he was refused, he began to throw shotgun cartridges into the palace grounds, the force said.Deputy Assistant Commissioner Ade Adelekan said the man was searched and a lock knife was found. He was arrested on suspicion of possession of a knife and ammunition.",
        "Video footage showed officers walking a man backward away from the palace gates.Adelekan said the man's knapsack was blown up in a controlled explosion after the suspect told officers to handle it with care.",
        "Police said the run-in was not being treated as terrorism-related. No shots were fired, and no one was injured.Charles and Camilla, the queen consort, were not at Buckingham Palace at the time.Buckingham Palace has seen a flurry of activity as tourists and international media begin to descend for the coronation - the first to take place in the country since Queen Elizabeth II was crowned in 1953.More than 9,000 police officers are expected to patrol London on coronation day, along with 2,500 law specialist members of law enforcement, including marine police, explosives experts and surveillance officers.The Metropolitan Police also said it would use facial recognition technology in central London to spot wanted criminals among the crowds - a move the privacy campaign group Big Brother Watch called \"Orwellian.\"British police have previously conducted limited trials of facial recognition, sparking debate about its intrusiveness and its accuracy.\"The hundreds of thousands of innocent people attending this historic event must not be treated like suspects in a lineup and subjected to biometric police identity checks,\" said Madeleine Stone, legal and policy officer for Big Brother Watch.Tugendhat said the presence of so many foreign dignitaries - and potentially myriad protesters - made maintaining security for the coronation \"a very complex policing operation, a very complex intelligence operation.\"",
        "Hundreds of anti-monarchist protesters plan to chant \"Not my king\" during the procession, and police say environmental activists could also try to disrupt the day's events.Authorities sent mixed signals to coronation dissenters. Prime Minister Rishi Sunak´s spokesman said that the \"right to protest is fundamental,\" but the police force said its \"tolerance for any disruption, whether through protest or otherwise, will be low.\"Activists accused authorities of trying to intimidate protesters with a government letter reminding them of new police powers to curb disruptive demonstrations.New measures in the Public Order Act, introduced in response to civil disobedience by environmental groups, allow police to search demonstrators for items including locks and glue and imposes penalties of up to 12 months in prison for protesters who block roads or interfere with \"national infrastructure.\"Graham Smith of anti-monarchist group Republic described the letter as \"intimidatory.\" He said the group would protest as planned on coronation day."
    ]
}