{
    "articleURL": "/sport/football/article-12056183/Wrexham-stars-spotted-drinking-smoking-cigars-latest-Las-Vegas-pool-party.html",
    "content": [
        "Joyful Wrexham players continue to party in Las Vegas after winning promotion The stars are on a four-day trip to the US paid for by the club's Hollywood ownersPlayers were seen drinking and smoking cigars at the latest pool party in Sin CityWrexham players have continued to enjoy the celebrations in Las Vegas with another pool party.",
        "The Welsh club were promoted from the fifth-tier National League after securing an incredible 111 points.Wrexham's owners, Hollywood actors Ryan Reynolds and Rob McElhenney, have put on a four-day all-expenses-paid trip to the USA as reward for their efforts this season.Stars have already hit the dancefloor at plush nightclub Hakkasan, swum in the giant pool at the MGM Grand Hotel and eaten dinner at the Bellagio.And players were spotted drinking, smoking cigars, chatting to bikini-clad girls and enjoying themselves at their latest pool party in Sin City.",
        "Stars frolicked in the pool with drinks in their hands, with others joking with team-mates and veteran goalkeeper Ben Foster soaking in the atmosphere and many dancing along to the music or chatting to fellow party-goers in Nevada. The Marquee Dayclub at luxury Las Vegas hotel The Cosmopolitan played host to the players, with the cheapest ticket at the DJ Pauly D event having a $1,500 (£1,200) minimum spend. A 'Grand Cabana' slot - which appears to be the one used by Wrexham players - has a $10,000 (£7,900) minimum spend. ",
        "Wrexham stars were living it up at the Marquee Dayclub at the luxury Las Vegas hotel The Cosmopolitan.The event was described online as 'offering a hedonistic adults-only atmosphere, (where) party-goers can soak up the sun in one of the two pools, lounging on day beds or taking in the scene from VIP cabanas boasting infinity-edge dipping pools'.The cheapest ticket at the DJ Pauly D event has a $1,500 (£1,200) minimum spend.A 'Grand Cabana' slot - which appears to be the one used by Wrexham players - has a $10,000 (£7,900) minimum spend. ",
        "The event was described online as 'offering a hedonistic adults-only atmosphere, (where) party-goers can soak up the sun in one of the two pools, lounging on day beds or taking in the scene from VIP cabanas boasting infinity-edge dipping pools'. The National League champions were told a 'monster' party lay in wait if they won the league, something they managed in style with a record 111 points to fire them back into League Two. Hollywood pair Reynolds and McElhenney, true to their word, have sorted a luxury four-day trip to Las Vegas, with a packed itinerary awaiting the footballers. It is set to be the trip of a lifetime and best of all, the players are not picking up the tab. 'It became a thing where if we won the league, we'd get a holiday. So we're off to Vegas,' star striker Paul Mullin, who bagged 47 goals this season, told GQ.'Ryan and Rob told us to leave our cards at home, they're sorting the lot. They sent us a full itinerary just now. Part of me doesn't want to go, I might be dead by the end of it! But I'd never go to Vegas by my own accord, so I'm buzzing for it.'Three days after celebrating the club's move up to the fourth tier with an open-top bus parade, the promotion winners got a first taste of the high life in Las Vegas.",
        "After jetting off to Sin City on Thursday, the festivities well and truly began with videos emerging of players on the dancefloor of a popular nightclub on the Vegas strip.   The players started their evening at Hakkasan, a modern Chinese restaurant at the MGM Grand hotel, where prices for the signature Phoenix menu start at $148. Bottles of champagne, no doubt ordered to toast their successes, cost upwards of $200. ",
        "After dining well, the National League-topping side moved onto Hakkasan nightclub where they were greeted by an enormous presentation commemorating their successes. Huge Welsh flags were waved and the club's name was spelled out in neon lights as the champions were welcomed into town. On Friday, players attempted to cure their hangovers by chilling at the pool that is part of a lavish hotel on the Las Vegas strip, before hitting the town once more in the evening.The team's entire squad posted for a group picture while holding cardboard signs of the club's letters and logo on a sunny, warm day in gorgeous weather.And the extravaganza continued on another fun-filled day over the weekend, with McElhenney the first of the club's two Hollywood owners spotted taking part in the players' festivities.McElhenney joined his side for dinner at famed Las Vegas eatery Spago on Friday night.",
        "They had earlier spent an afternoon spent partying poolside at the Wet Republic Ultra Pool at the MGM Grand with the players keen on letting their hair down after their triumphant campaign. After dinner, the players moved onto OMNIA nightclub where they were greeted in bombastic style.",
        "The full house in the cavernous nightclub jumped up and down waving sparklers and enormous Welsh flags were waved in a tribute to the team's achievements. Legendary DJ Steve Aoki was on the decks, which Ben Tozer later snuck behind to watch the revellers from a good vantage point, and the players led the partygoers in a round of chanting in honour of their star targetman Mullin. Reynolds is yet to make an appearance alongside his team but with the revelry far from over, the A-List star may yet turn up in the US party capital.Wrexham's increasing popularity in the US, first sparked by their Hollywood owners and sent through the roof with the launch of Disney+ docu-series 'Welcome to Wrexham', means the champions have received a heroes' reception on American soil. The side will be back Stateside in July for a string of friendlies against Chelsea, Manchester United, LA Galaxy II and one more team yet to be confirmed.   "
    ]
}