{
    "articleURL": "/wires/reuters/article-12041341/Economic-risks-buoy-gold-2-000-Fed-verdict-nears.html",
    "content": [
        "Fed rate decision due at 1800 GMT",
        "U.S. debt ceiling jitters could support gold - analystPalladium up more than 1%(Updates prices, adds details on U.S. stock futures)By Arundhati SarkarMay 3 (Reuters) - Gold firmed well above the $2,000 level on Wednesday, buoyed by uncertainty surrounding the U.S. debt ceiling and other economic headwinds, while investors braced themselves for the Federal Reserve's monetary policy decision.Spot gold was little changed fell 0.06 % to $2,014.97 per ounce by 1135 GMT, after rising more than 1% on Tuesday.U.S. gold futures rose 0.1% to $2,025.40.The Fed's rate decision is expected at 1800 GMT, with an 88.7% chance of a 25 basis point rate hike.The central bank is also expected to signal a pause in its tightening cycle, as policymakers balance the need to slow inflation against risks ranging from bank failures to the possibility of a U.S. debt default as soon as next month.Gold is caught between growing anxiety over the U.S. banking crisis, which has fuelled demand for safe-haven assets, and uncertainty over the Fed's stance, which is capping the upside, ActivTrades senior analyst Ricardo Evangelista said.Bullion, known as a hedge against inflation and economic turbulence, gained over 1% in April amid the banking crisis. But higher rates tend to dent the zero-yield asset's appeal.",
        "\"If the Fed were to surprise with a pause, this would suggest a deepening banking crisis and would likely send gold higher,\" said Clifford Bennett, chief economist at ACY Securities.U.S. stock futures meanwhile rose in fragile markets with traders on tenterhooks for any clues from the Fed statement that rate hikes might peak and the soft landing that central banks have been angling for is in sight.However, difficulties surrounding a bipartisan agreement over the debt ceiling has the potential to offer further support to gold, Evangelista added.Spot silver fell 0.5% to $25.25, while platinum rose 0.2% to $1,067.18.Palladium rose 1.3% to $1,447.57. (Reporting by Arundhati Sarkar in Bengaluru; Editing by Varun H K and Sonia Cheema)"
    ]
}