{
    "articleURL": "/wires/reuters/article-12056111/Urawas-Hoibraten-eyes-J-League-title-challenge-Asian-success.html",
    "content": [
        "By Michael Church",
        "SAITAMA, Japan, May 7 (Reuters) - Urawa Red Diamonds defender Marius Hoibraten has backed his team mates to sustain their bid for the club's first J.League title in 17 years after helping the Japanese outfit claim the Asian Champions League crown on Saturday with a victory over Al-Hilal.Reds secured a 2-1 aggregate win and a third Asian title for the country's best-supported team with a 1-0 victory over the defending champions from Saudi Arabia at Saitama Stadium, courtesy of an own goal by Al-Hilal's Andre Carrillo.Urawa's record in continental competition stands in contrast to their achievements at domestic level, however, with the club having only won the J.League once - in 2006 - in the 30-year history of the competition.Hoibraten believes Maciej Skorza's team can be among the challengers for this season's title after the morale-boosting victory over their Riyadh-based opponents.\"We can enjoy this win today and tomorrow and then it's back to work,\" said the Norwegian defender.\"In the two games against Al-Hilal we showed that we're a solid team, but we have a lot of qualities. We have to take one game at a time but if we can keep staying solid we can get there.\"Despite losing their first two games of the league season, Urawa are currently nine points behind leaders Vissel Kobe in the standings having played three games fewer due to their commitments in the Asian Champions League.",
        "Hoibraten and his colleagues will be forced to curtail their celebrations to prepare for their next game, which sees Reds host Sagan Tosu on Wednesday.Urawa won the Asian title despite Al-Hilal dominating across both legs of the final and, while Hoibraten was delighted to celebrate the successful outcome, the centre-half expects further improvements in the coming weeks.\"I think we're not playing a fantastic game but it's a final,\" he said.\"You cannot settle for this, we have to reach for the stars. There's always details that we have to do better.\"In the beginning it was not good enough. It was difficult, but we have to stay hungry every day.\" (Reporting by Michael Church; Editing by Muralikumar Anantharaman)"
    ]
}