{
    "articleURL": "/wires/reuters/article-12060849/Fed-says-banking-sector-looks-set-weather-recent-turmoil.html",
    "content": [
        "WASHINGTON, May 8 (Reuters) - The U.S. banking sector overall appears well-positioned to weather recent industry turmoil, but the experience could still weigh on credit conditions in the future, the Federal Reserve said on Monday.",
        "In its semi-annual report on financial stability, the U.S. central bank said overall funding risks for banks remained low and firms still have ample liquidity. Furthermore, additional policy efforts by U.S. bank regulators following the abrupt collapses of Silicon Valley Bank and Signature Bank in March should continue to backstop the system if further stresses arise, the Fed said.\"The Federal Reserve is prepared to address any liquidity pressures that may arise and is committed to ensuring that the U.S. banking system continues to perform its vital roles,\" the Fed said.While the central bank noted there were spillover concerns following the failures of Santa Clara, California-based SVB and New York-based Signature, it maintained that the issues that sank those regional banks do not appear broadly across the banking sector, calling them \"outliers\" in terms of heavy reliance on uninsured deposits.Those firms, as well as First Republic Bank, which was closed by regulators earlier this month and sold to JP Morgan Chase, also were grappling with large amounts of unrealized losses spurred by rapidly rising interest rates. Depositors fled SVB within days after it appeared the firm was in trouble, precipitating its abrupt closure.The Fed noted in its report on Monday that more than 45% of bank assets reprice or mature within a year, suggesting there is not heavy exposure to less valuable securities for long periods of time. But while the amount of uninsured deposits at banks is declining, they still remain above historical averages after an influx of deposits spurred by the COVID-19 pandemic. In aggregate, it said banks remain well-capitalized.",
        "DEBT LIMIT CONCERNSThe Fed released the report shortly after a separate central bank survey found banks were tightening credit standards amid weaker loan demand.Beyond banks, the Fed said pressures on various market sectors remained within historical norms. However, it noted that valuations on commercial real estate remain high, which suggests there could be a \"sizable\" correction in property values should telework trends remain strong. The Fed found that banks hold about 60% of commercial real estate loans, with two-thirds of those at smaller lenders with less than $100 billion in assets.The Fed's report also found that nearly half of its respondents identified the U.S. debt limit as a salient risk, after not appearing as a top concern in the previous report in November. U.S. Treasury Secretary Janet Yellen said the limit could be reached in June, but Democrats and Republicans are still sparring over what conditions, if any, should be attached to an increase.Banking sector stresses were identified as a risk by more than half of respondents, up from 12% in the November report.Other issues identified as top potential risks by respondents included persistently high inflation and monetary tightening, U.S.-China tensions, and the Russia-Ukraine war. (Reporting by Pete Schroeder; Editing by Paul Simao)"
    ]
}