{
    "articleURL": "/sport/football/article-12048071/Leeds-United-Sam-Allardyces-reign-begins-focus-motivation-passion-defending.html",
    "content": [
        "New Leeds United manager Sam Allardyce has already re-invigorated the squad'Big Sam' has brought positivity and confidence to a team sorely lacking in bothThe boss hopes a focus on passion and defending will save them from relegationFor anyone questioning Sam Allardyce's appetite for a relegation battle at the age of 68, consider this.",
        "He reported for his first day as Leeds United manager at around 7am on Wednesday. He left their Thorp Arch training centre at around 7.30pm. Long day.What Allardyce doesn't know about escaping relegation isn't worth knowing. If Leeds had shown the same level of desire all season, they might not be in this mess.Allardyce's appointment as Javi Gracia's successor was an open secret by the time he arrived at Leeds' HQ with assistant coach Karl Robinson by his side, to start a survival mission on Wednesday.Allardyce, in his own indomitable manner, came bouncing in; positive and upbeat. His body language exuded exactly what has been sorely lacking at Leeds: confidence and spirit. ",
        "He was gracious as he firmly shook hands with the staff who had arrived at work before him. His greetings were accompanied with the broadest of smiles. There's not been much of that at Leeds recently.Marcelo Bielsa was loved — and is still loved — but he was insular, only really engaging during team meetings. Jesse Marsch was the polar opposite. He loved interacting with his colleagues, asking them about their families and personal lives. Marsch was exuberant but there was always a sense that he wasn't particularly sincere.The improvement in mood during Allardyce's first 48 hours in charge is said to be in stark contrast to the final days of Gracia's reign that was brought to an end during talks with Andrea Radrizzani on Monday. Gracia is friendly, kind and courteous. But much like Bielsa, he was detached during his time at Leeds.",
        "'There was a spring in Sam's step, a presence about him. It's something we've been missing for a while,' said a source.Allardyce had been due to manage a legends team against a Peter Reid-led celebrities XI in a charity match at Oldham on Sunday, to raise funds for those affected by the Manchester Arena bombing.It was a long-standing arrangement and one close to Allardyce's heart, but he has had to pull out and his place will be filled by Joe Royle.As he said his hellos, Allardyce was still hoping to appoint long-term aide Sammy Lee to his staff — but by around 9am it became clear his trusted No 2 could not excuse himself from jury service.",
        "But Allardyce had a back-up plan: Robbie Keane. The two had struck up a good relationship from working together for the football charity Soccer Aid.Keane already has coaching experience with the Republic of Ireland and Middlesbrough but, importantly, has an affinity with Leeds having spent 18 months at Elland Road as a player. Chief executive Angus Kinnear made first contact with Keane at around 9.45am on Wednesday, calling the Irishman with an offer.It was a short conversation, Keane making clear it wasn't about the money — he just wanted the opportunity. Keane caught a noon flight from Dublin. He landed in Leeds for 1pm, arrived at the training ground for 2pm and signed his contract by 2.30pm.",
        "As Keane made his way across the Irish Sea, Allardyce was getting straight down to business. His first meeting was with club secretary Hannah Cox and Kinnear to tie up the formalities attached to his four-game contract.The next assignment was to introduce himself to the club's analysis department, who compile and present football-related statistics to the coaching staff, in which he relayed how they could adapt their reports to his methods. Next he met members of the existing coaching team, including first-team coach Michael Skubala and head of medicine and performance Rob Price. That was the longest meeting of the day.By this point, players had started to arrive. He greeted as many of them as he could before calling a meeting of all departments. His speech was inspiring, by all accounts. He told his new colleagues he would value everyone's input, making clear that his door was always open.He regaled his new colleagues with tales of West Bromwich's draw at Anfield during his first away game in charge of the Midlands club and reminded them of when his Sunderland side beat all-conquering Chelsea as he tried to convince everyone in the room that getting a result against Manchester City tomorrow isn't beyond the realms of possibility.",
        "'He made a really good first impression,' added another source. 'He's just been fun. He has been a breath of fresh air. It's like a cloud has been lifted. He was sharp with the players, telling them things have got to improve. ",
        "'But he was motivational and telling them, \"We can do this\". It's like he has a map and is saying, \"I'll show you how to get out of this\". He has a clear vision and a clear plan. We have gone home thinking, \"We can do this — this fella knows how to get us out of this\".'Allardyce believes. He wants his new players to believe too. Allardyce spoke of Leeds' rich traditions, making it one of the easiest decisions of his life to answer their SOS. The message was abundantly clear: we're in this together, let's do it together.Allardyce continued his motivational drive in the training-ground canteen as the squad ate their pre-training meals. He worked the room, making sure he spent ample time with as many people as he could. He also sought out the club's sports psychologist.Allardyce has seen the benefits of positive thinking in the past. He believes it could be the key to unlocking an inner belief within his squad that has been lacking.Before his first training session, Allardyce addressed his players once more during which he stressed the importance of attitude. He believes he has a squad good enough to save Leeds from relegation, a view he reinforced to them collectively before training.",
        "He told them, provided they buy into his methods, he will get the best out of them for the remaining four games. But above all else, Allardyce made clear that they needed to improve defensively.Antoine Semenyo's stoppage-time strike for Bournemouth in their 4-1 win on Sunday was the 23rd goal Leeds conceded in April, breaking their own record for the amount of goals leaked by a Premier League side in a calendar month.",
        "To that end, Allardyce's main focus on the training pitch has been on defending. 'He is trying to make us harder to play against, tougher to break down,' said the source. Given their recent record, that shouldn't be hard.Before the players took to the grass at around 1.45pm, Allardyce held a separate summit with the squad's leadership group, led by captain Liam Cooper and defender Luke Ayling. Allardyce knows his senior players will be key in the final weeks of the season. He has put the onus on them to dig the club out of the relegation-shaped hole they find themselves. The veteran coach ran a session with the defenders in which he drilled them on remaining as a unit. Robinson ran a separate session with the attackers amid hope that he can unlock the best of striker Patrick Bamford, with whom the coach worked at MK Dons between 2012 and 2014. By the time the session was over, Keane had arrived to start planning ahead of Thursday's session.",
        "So 48 hours under Allardyce: big on motivation, big on passion, big on defending. Big Sam. This is surely the biggest challenge of Allardyce's career. Leeds are free-falling back to the Championship following a run of four points from a possible 21.Up next: a trip to the Etihad. Not that Allardyce sounds daunted by facing Pep Guardiola. Prior to Allardyce's arrival, Leeds, rather understandably, had taken a defeatist attitude towards their trip to City.Allardyce's take is refreshingly different. He believes leaving Manchester with something is possible. Allardyce believes lifting spirits among a workforce that have been at such a low ebb for so long will help results.There are many doubters. With just four games left — two of which are against City and Newcastle — the scepticism is, of course, understandable. But if there's anyone who can extinguish the fire, it's Fireman Sam.",
        "Gracia: I did the job Leeds hired me to do - and then I was sacked on my birthday!Javi Gracia has insisted he did a good job at Leeds after being sacked just 71 days into the role and replaced by Sam Allardyce.Gracia, who turned 53 on Monday, revealed he was given his marching orders by owner Andrea Radrizzani on his birthday after Leeds conceded a record 23 goals in April. The former Watford boss took over on February 21 when Leeds were 19th and took them to 17th. 'We got 11 points in 11 matches,' Gracia told The Athletic. 'Everton got eight points, Leicester and Southampton took six and Nottingham Forest five.'We could have done things better, of course, but we arrived in a difficult position with 10 matches without a win. We left the team outside the drop zone.'Director of football Victor Orta was also fired having disagreed with the decision to sack Gracia, who said: 'It hurt me a lot to lose my job, but I have to say Victor's exit is just as difficult for me, if not more.'"
    ]
}