{
    "articleURL": "/sport/football/article-12059345/Socceroos-talks-rematch-World-Cup-winners-Argentina-stunning-Qatar.html",
    "content": [
        "Australia could take on the reigning world champions in a friendly in ChinaArgentina beat the Socceroos in the Round of 16 of the World Cup last yearThe fixture could be officially confirmed as early as this week  Australia are in talks to hold a glamorous friendly against Argentina just six months after losing to the South Americans in the knockout stages of the World Cup.",
        "Lionel Messi and Julian Alvarez scored as Argentina beat the Socceroos 2-1 in the Round of 16, before Emiliano Martinez denied Garang Kuol a last-minute equaliser that would have taken the game into extra-time.Fans hoping to see the world champions in action in Australia, however, are set to be disappointed as the fixture is expected to take place in China.The proposal was first reported by the New York Times last week, which revealed an independent promoter had approached Football Australia and the AFA - Argentina's football federation.According to the report, Argentina have become the most in-demand opponent in international football after their World Cup triumph.",
        "Facing La Albiceleste, however, comes with hefty financial costs. Along with a share of ticket sales, TV  rights and commercial revenue from the games, AFA is also reportedly demanding a lucrative appearance fee. The New York Times reported the starting price for the appearance fee is thought to be in the region of $5million (AUD$ 7.4million). Argentina will play two friendlies in June in the international window between June 12 and June 20, but the identity of the teams remains unknown. It is understood the first game will be played in Beijing, with the second in Indonesia. A spokesperson for Football Australia confirmed the Socceroos were looking to play against a 'high-profile' opponent during the international window.",
        "'Among the various options under consideration is the prospect of facing a high-profile opponent overseas, such as in Beijing,' the spokesperson told the Sydney Morning Herald. According to the Sydney Morning Herald, while nothing has been signed yet, an official confirmation could come as early as this week. ",
        "Ahead of a potential friendly against Argentina, Australia will focus on the draw for the Asian Cup, which takes place on Thursday in Doha.Qatar will host the tournament in January with the Socceroos hopeful of banishing the disappointment of four years ago, when they lost 1-0 to the United Arab Emirates in the quarter-finals. The Socceroos arrived at the World Cup last year as rank outsiders, but won two games at the World Cup for the first time in their history and reached the Round of 16 for only the second time.Despite the historic feat and the fact they came within a whisker from forcing the tie against Argentina into extra time, coach Graham Arnold revealed he felt his side had failed.",
        "'It’s the way I am,' he said after Australia were knocked out.'Even though we’ve succeeded and been successful, I feel like we’ve failed.'I just wanted to win so badly for the nation and the fans. Making the last 16 for me wasn’t enough [...] ",
        "'That’s just me. I know a lot of other people might be happy with it but that’s just the way I am.' "
    ]
}