{
    "articleURL": "/wires/reuters/article-12056437/World-Food-Programme-suspend-aid-Palestinians-funding-shortage.html",
    "content": [
        "By Nidal al-Mughrabi",
        "GAZA, May 7 (Reuters) - The World Food Programme (WFP) will suspend food aid to over 200,000 Palestinians from next month due to a \"severe\" shortage of funds, the group's senior official for the Palestinian territories said on Sunday.\"In light of the severe funding shortages, WFP is forced to make painful choices to stretch the limited resources,\" Samer Abdeljaber, the WFP's country director, he told Reuters by phone from Jerusalem.\"WFP would have to start suspending assistance to over 200,000 people, which is 60 percent of its current case load, from June.\"The most impacted families are in Gaza, where food insecurity and poverty are the highest, and in the West Bank.The United Nations agency offers impoverished Palestinians both monthly vouchers with a value of $10.30 per person and food baskets. Both programs will be affected.Gaza, which has been run by the Islamist Hamas group since 2007, is home to 2.3 million people, of which 45 percent are unemployed and 80 percent depend on international aid, according to Palestinian and U.N. records.\"WFP understands the implications of this unavoidable and hard decision on hundreds of thousands of people who also depend on food assistance for their most basic needs,\" said Abdeljaber.Citing security concerns with the enclave's Hamas rulers, Israel has led a blockade together with Egypt that has put restrictions on the movement of people and goods for years.",
        "The U.N. agency will continue its aid to 140,000 people in Gaza and the West Bank, said Abdeljaber, who added the suspension decision was taken to save those who are at the highest risk of not being able to afford their food.Unless funding is received, WFP will be forced to suspend food and cash assistance entirely by August, he said.Chanting \"No to Hunger\" dozens of Palestinians staged a protest outside the WFP offices in Gaza City to protest the decision.\"The voucher is life, the message they sent us equals death since there is no other source of income,\" said Faraj Al-Masri, a father of two, whose family gets vouchers worth $41.20 per month.In Jabalia, in the northern Gaza Strip, Jamalat El-Dabour, whose family receives $164.80 worth of vouchers per month, said they will \"starve to death\" as her husband was sick and unemployed. (Reporting and writing by Nidal Almughrabi; Editing by Mike Harrison)"
    ]
}