{
    "articleURL": "/news/article-12056431/Fashion-brand-experts-react-Prince-Harry-wearing-Dior-suit-Coronation.html",
    "content": [
        "Duke of Sussex wore bespoke three-piece suit to Westminster Abbey ceremonyBut fashion expert Miranda Holder says choice of French brand was significant Prince Harry's Dior suit he wore for the Coronation could have been a rebellious move as he and Meghan Markle make a deal with the brand, experts claimed today.",
        "The Duke of Sussex looked smart in the bespoke three-piece suit designed by Dior's artistic director Kim Jones especially for his appearance at Westminster Abbey.But royal fashion expert and celebrity stylist Miranda Holder said Harry's choice of a French brand showed he 'did not get the fashion memo or was in a petulant mood' as most other guests wore British labels, adding that his decision 'spoke volumes'.Harry and his wife Meghan have previously worn various outfits by Dior which has prompted claims that they could be working on a partnership with the brand.Brand and culture expert Nick Ede added that now the Sussexes are no longer working royals, they can 'have an arrangement with one of the biggest fashion houses in the world' and Dior would have 'jumped at the chance' to work with them.Royal commentators had speculated about whether Harry would wear a military uniform after he did not wear one for the late Queen's funeral last September.And yesterday he opted for the three-piece suit which consisted of a morning coat and a black vest, which Harry wore with a crisp white shirt and a pearl grey tie.Harry's late mother Princess Diana was also a fan of Dior and wore their outfits in the months before her death aged 36 - including, famously, at the Met Gala in 1996.",
        "At that event in New York, Diana wore a Dior silk slip dress and carried a Dior handbag initially known as 'Chouchou' which was later renamed Lady Dior in her honour. The handbag remains one of the brand's most well-known items today.",
        "Ms Holder told MailOnline today: 'Harry's brief appearance at the Coronation was always going to be controversial, every second that he was under the watchful eye of the many cameras, every move he made would be ruthlessly scrutinised, and due to him not wearing any sort of ceremonial uniform, his style choices would be at the top of the list.'She said most guests appeared to have 'got the memo to support the best of British brands at such a uniquely patriotic occasion'.Ms Holder spoke of the 'sea of exquisite British couture' from the Alexander McQueen that 'graced' Kate Middleton and Charlotte, to the poppy red Emilia Wickstead coat worn by actress Emma Thompson which she decorated with her MBE.But she continued: 'It seemed however that Harry did not get the fashion memo - either that, or he was in a petulant mood.'The Prince turned up looking smart if somewhat apprehensive in an immaculate Dior suit, a potentially rebellious move on his behalf. Harry would have been well-versed in the protocol of supporting domestic businesses, and the message doing so would convey.",
        "'In true royal family style, Harry, like his late grandmother, is a true expert in visual representation, and his decision to wear a French designer to this historic occasion spoke volumes.'The message was clearly, 'I'm here, but I'm doing this my own way', a firm assertion that his newfound independence was not going to change, that he would run alongside the royal pack rather than within it.'",
        "Ms Holder, who posts on TikTok as @TheMirandaHolder, also talked about Meghan opted for Dior on several royal occasions while still in Britain.She said: 'Unlike the quiet luxury of the British designer's aesthetic, Dior feels a little bit more shouty, and a little bit more 'look at me' - feeling slightly more Elizabeth Taylor ratchet than Queen Elizabeth, but Meghan could never have understood our subtle British sensibilities when it comes to these nuances.",
        "'The fact the couple are favouring Dior so much points strongly towards more than just an appreciation for the couturier. It is highly likely that a brand partnership is in negotiation between the parties.'It would not be the first time a member of the Royal family has worked with a fashion brand in this way, and I'm sure the Sussexes would be grateful for the additional income, as would Dior for the extra exposure.'",
        "Meanwhile Mr Ede also spoke today about the importance of Harry and Meghan's tie-up with Dior.He told MailOnline: 'Fashion brands know that celebrity is a brilliant way to sell and create strong credentials. A brand like Dior who have a long history and heritage have jumped at the chance to work with Harry and Meghan.'The royal family traditionally are unable to endorse brands but now that the pair are not officially part of the family they are able to have an arrangement with one of the biggest fashion houses in the world.'Dior are promoting that they created the suit for Harry and this will help build his brand equity and I think we will see him and Meghan working closely with fashion houses and lifestyle brands to make money and also endorse.'This kind of arrangement will be a financial one so they will either have signed an exclusive contract with the fashion house or they will receive a payment if they wear the brand.'Yesterday, Dior posted a picture of Harry in the suit on Instagram, saying: 'Tailoring fit for royalty. Dior is honoured to have dressed Prince Harry, Duke of Sussex, for the coronation of King Charles III in a custom design by Kim Jones. Seen arriving at Westminster Abbey, gain an insight into the savoir-faire of his three-piece suit next.'",
        "The fashion house then posted more photographs of the suit during its manufacture, revealing the 'temporary basting stitches and the canvasing that shapes the lapels, before the balance and fit of each piece are perfected and the finished pieces emerge'.",
        "Dior then also issued a picture of Harry smiling inside the Abbey, and said he was 'elegantly clad in his bespoke Dior by @MrKimJones black wool and mohair suit'.Harry is understood to have worn what he was asked to wear to the ceremony yesterday, and had his Afghanistan and Jubilee medals pinned to his suit jacket, and a Royal Victorian Order star and neck decoration.Speaking ahead of the Coronation, military historian Dr Peter Johnston told True Royalty TV's The Royal Beat in April that Harry may be allowed to display a different tribute to his service despite serving two tours in Afghanistan.'I imagine Harry won't wear uniform [at the Coronation],' he said. Even as a veteran who did two tours in Afghanistan, he won't wear uniform.'I imagine he'll wear his medals but quite where he fits within the procession and where he comes, I think will be probably reasonably similar to where he was at the funeral as well.'Harry returned to California after catching a British Airways flight within hours of his father's coronation.",
        "He arrived at Los Angeles International Airport at around 6.30pm local time to reunite with his son on his birthday.Archie turned four yesterday and spent the day with his mother, the Duchess of Sussex, at their US home.British Airways flight attendants confirmed that Harry had been on the flight but said they were not permitted to discuss the details of his trip.Harry's appearance at the coronation marked his first public appearance alongside the royals since he lambasted his family in his controversial memoir Spare.",
        "He was seated in the third row for the crowning of Charles and the duke's stepmother the Queen, and was placed two rows behind his brother the Prince of Wales.Harry chatted to his cousin Princess Beatrice and her husband Edoardo Mapelli Mozzi as he entered the church on Saturday in the drizzling rain.He also nodded and smiled to guests as he processed behind them, walking down the nave of the abbey alone.During the service, as the congregation paid homage to the King, Harry was seen, along with the other royals around him, speaking the words: 'God save King Charles. Long live King Charles. May the King live forever.'His abrupt return to the US meant he did not appear on the Buckingham Palace balcony for the finale of the day, with the Palace confirming earlier that he had no formal role at the event."
    ]
}