{
    "articleURL": "/wires/afp/article-12051479/Flags-fireworks-Cambodia-kicks-SEA-Games.html",
    "content": [
        "Cambodia kicked off its first ever hosting of the Southeast Asian Games on Friday, in a historical ballyhoo of singing, dancing, flag-waving and fireworks.",
        "The evening's festivities welcomed athletes from across the region to the biennial multi-sport event while trumpeting the country's rich history and thanking its long-ruling leader for recent modernisation.Prime Minister Hun Sen's ruling Cambodian People's Party is keen to build excitement and patriotic fervour around the SEA Games, with a successful event and good medals haul likely to boost national sentiment two months ahead of parliamentary elections which the CPP will almost certainly win.\"For me, this event is very wonderful. We have been waiting for this for 64 years,\" said Seng Meng Hong, a 24-year-old attendee.The SEA Games were first held in Bangkok in 1959.\"I'm so happy that the government could organise such an event so the Cambodian people can come and support the national athletes,\" Meng Hong added.Tickets to the Games have been given away for free -- and demand has been high.Inside the Morodok Techo National Stadium on Friday, a clear and balmy evening, all of the venue's 60,000 seats were packed.Built and paid for by China, the stadium looms over the open, wooded parts of Phnom Penh's far outskirts like a crash-landed spaceship.But its two dramatically cresting pylons also evoke the keel and stern of Chinese trading junks which plied the capital city's waterways hundreds of years ago.",
        "Almost all in attendance wafted themselves with handheld fans or brandished Cambodian flags -- when not participating in an impeccably observed Mexican wave.All stood for the national anthem when soldiers in ceremonial uniform performed a flag-raising ceremony.The main production -- a riot of golden finery, elegant costumes and spear-toting warriors -- told the story of the kingdom, from its founding myths through the Angkor period. Athletes demonstrated Kun Bokator, the national martial art making its debut at this year's Games.Skipping ahead to mention a bleaker period, a speaker noted only the end of \"the dark era of the genocidal Pol Pot\" in 1978 and thanked Cambodian leaders since then for \"prosperity and peace\".The most senior of those leaders were in attendance.Along with dignitaries including the prime minister of Vietnam and the president of Laos, Hun Sen entered the stadium to great applause.The prime minister spoke briefly, expressing his gratitude for peace in the country under his leadership and declaring the opening of the Games.Critics say Hun Sen, one of the world's longest-ruling leaders, has wound back democratic freedoms in the country as he prepares for the general election in July and has used the courts to stifle opposition.Several events of the SEA Games have already been played out, and the hosts are top of the medals table for now, with five golds.",
        "Events kick into full gear Saturday, with the Games running to May 17, before the Para Games in early June."
    ]
}