{
    "articleURL": "/wires/pa/article-12045775/Later-life-challenges-changed-coronation-says-pension-provider.html",
    "content": [
        "The number of people receiving the state pension has more than doubled since the last coronation, according to a pensions and savings provider.",
        "And despite female employment levels having surged over the decades, a pensions gender gap remains, according to the research from Scottish Widows.Ahead of the coronation of King Charles, Scottish Widows compared the UK’s retirement savings landscape with that in the era of the previous coronation in 1953.It said the state pension in 1953 was £1 and 12 shillings per week – or around £37.39 in today’s money. The full new state pension is currently £203.85 per week.Fewer than five million people received the state pension in 1953, compared with 12.6 million in August 2022, Scottish Widows said.",
        "1953 - £1 and 12 shillings2023 - £203.85 (Scottish Widows)",
        "With people living for longer, their pensions will also need to sustain them for a longer period.",
        "There were around 15,120 centenarians (people aged 100 years and over) across the UK in 2020, according to Office for National Statistics (ONS) figures.Following the Second World War, there was a sharp increase in the number of births in the year mid-1919 to mid-1920.While female employment rates have risen over the decades, women today are still retiring with an average of £123,000 less in their pension than men, Scottish Widows said.Robert Cochran, senior retirement specialist at Scottish Widows said: “Since the last coronation, the landscape has monumentally changed.",
        " Over-65s are a much greater proportion of the population, therefore playing a far more active role in modern society  Robert Cochran, Scottish Widows  “In 1953 we had a young Queen, whereas now we have a ‘pensioner king’ and over-65s are a much greater proportion of the population, therefore playing a far more active role in modern society.“Today’s pension challenges would have been unimaginable during the last coronation, where back then it was something that happened when you reached a certain age – now we have to take action and make choices decades before we retire.“Although the number of people receiving the state pension has more than doubled in the last 70 years and the state pension has significantly jumped in terms of pounds and pence in line with high inflation, it will not alone provide a retirement fit for a king.“It’s a wake-up call on the importance of saving into your workplace pension.“Keeping track of different pension pots would also have been an alien concept to working people 70 years ago.“Those days, many stayed in the same job for life, whereas the average worker today changes jobs 11 times.”Scottish Widows used various sources for its research, including ONS and Government figures and its own data."
    ]
}