{
    "articleURL": "/wires/ap/article-12048447/Lyft-suffers-letdown-1Q-amid-post-pandemic-woes.html",
    "content": [
        "Lyft began the year mired in the same ditch it ended in last year, with its ride-hailing service struggling to recover from a pandemic-driven downturn that triggered a change in leadership and layoffs that wiped out a quarter of its workforce.",
        "The San Francisco company on Thursday unveiled a January-March loss that was even larger than investors had feared, underscoring the daunting challenges facing its new CEO, David Risher, who took the reins from Lyft co-founder Logan Green after quarter ended.Lyft lost $187.6 million, or 50 cents per share, during the first quarter, slightly less than its loss a year ago but significantly more than the 10 cents per share anticipated by analysts surveyed by FactSet Research. Revenue for the period came in slightly above analysts' projections at $1 billion, a 14% increase from a year ago.Perhaps even more disappointing for investors who already have been bailing out of Lyft's stock, management's financial guidance for the current quarter came in below analysts' forecasts.Lyft's stock price fell by more than 15% in extended trading after the numbers came out, deepening a downturn that has seen the San Francisco company's shares lose more than half of their value during the past year.\"I am very aware our current levels of growth and profitability are not acceptable,\" Risher assured analysts during a conference call in which he repeatedly vowed to get Lyft heading in a better direction as the year progresses.",
        "The first-quarter performance represented a dramatic contrast to the numbers announced earlier this week by Uber, the ride-hailing leader.",
        "Uber´s revenue during the same period surged by 33% from a year ago and it also posted huge gains under a closely watched financial metric known as \"adjusted earnings before interest, taxes, depreciation and amortization.\" Lyft posted a $22.7 million profit under this unconventional yardstick in the first quarter, a 59% decline from the same time last year.Risher, a Lyft board member and former Amazon executive, has already taken drastic steps in an attempt to turn things around. Last week, he announced that nearly 1,100 employees would be losing jobs so he could plow the money pruned from the company´s payroll into lower passenger fares and higher pay for Lyft drivers who work as independent contractors.The layoffs and other cost cutting are expected to result in annual savings of $330 million.\"David has hit the ground running,\" said Green, who is Lyft's chairman. \"His customer obsession is vital in positioning Lyft to capture long-term opportunities.\"Lyft´s woes are a vestige of a pandemic that prevented or discouraged people from traveling as much as they did before the spread of COVID-19 disrupted society. Ride-hailing demand shriveled amid the upheaval, but Uber softened the blow with an expansion into food delivery that kept people using its app even while they were stuck at home.",
        "That habit helped Uber rebound more quickly as the pandemic eased last year, along with prices that were frequently lower than Lyft´s for the same trips. But recent adjustments have enabled Lyft to match Uber's rates for the past 10 weeks, according to information released by the company Thursday.With the pandemic now in the rearview mirror, Lyft \"can think big again,\" Risher said."
    ]
}