{
    "articleURL": "/wires/reuters/article-12042385/UPDATE-5-Indias-Go-First-touts-owner-govt-backing-bankruptcy-filing.html",
    "content": [
        "No question of Wadia Group exit -CEO",
        "India govt keen \"we should not fail\" -CEORival airlines' shares surge, lenders dropBy Tanvi Mehta, Dhanya Skariachan and Chris ThomasBENGALURU, May 3 (Reuters) - The owner of Go Airlines (India) has no plans to exit the budget carrier after engine troubles forced it into bankruptcy, the airline's CEO told Reuters on Wednesday, as frustrated flyers complained of abrupt flight cancellations.India's third-largest airline, which recently rebranded as Go First, filed for bankruptcy on Tuesday, blaming Pratt &amp;amp; Whitney's \"faulty\" engines, which it uses on its Airbus 320 neo aircraft.The collapse of the first Indian airline since Jet Airways in 2019 comes amid fierce competition in the sector led by its largest rival IndiGo and Tata Group-owned Air India, as passenger traffic roars back after the pandemic.\"The Wadia group, in particular Nusli Wadia, has always tried to see that the company and the airline operations go on, on a normal basis, in spite of the fact that we are completely disabled to that extent by Pratt &amp;amp; Whitney,\" CEO Kaushik Khona said.\"There is no question of Wadia group having any intention to exit or move out.\"Wadia group, which owns 100% of Go First, pumped 2.90 billion rupees ($35.46 million) into the airline in April alone, bringing the group's total investment in Go First to 65 billion rupees.",
        "\"The Indian government is very keen we should not fail,\" Khona said.The abrupt flight cancellations after the bankruptcy filing also upset travellers and Khona said the airline was not selling tickets until at least May 15.\"I had to shell out more than double of what I originally paid for a ticket on another flight,\" said Mumbai-based advertising executive Timir Roychoudhury, whose Goa-Mumbai flight was cancelled.ENGINE WOESIn its bankruptcy filing, Go First claimed its failure followed a refusal by the U.S. company to abide by an arbitration order to release spare leased engines, that would have allowed it to return to full operations. Go First argued in the case that Pratt &amp;amp; Whitney engines had a \"serious design flaw\" that caused shutdowns and premature failure, which led to the grounding of 28 of its aircraft as of this week.Pratt said in the arbitration case that Go First's arguments relied on \"fabricated obligations\".The engine maker, owned by Raytheon, also asked why Go First bought another 156 engines in 2019, three years after it began operating them, if they were defective from the start.Pratt said Go First could not show it was the \"sole or exclusive cause - or any cause at all - of its poor financial condition\".",
        "The Pratt engine has faced problems with durability in hot and dusty climates including India, requiring more frequent maintenance. Gaps in availability have been compounded by a shortage of repair capacity.In 2019, IndiGo dropped Pratt as a supplier and placed a $20 billion order for CFM International's LEAP engines for its fleet expansion following some plane groundings.REVIVE, NOT SELLThe insolvency proceedings were aimed at reviving the airline and not selling it, CEO Khona said, confirming it had made all required payments to Pratt.Go First's market share in India dropped to 7% in October 2022 while its weekly departures fell 39% by March, from their 2021 levels.On Wednesday, the airline's CEO said it was looking to dissuade lessors from taking action and confirmed some parties had expressed an interest in taking a stake in the airline.Pilots have been receiving their salaries with a delay for the past few months, and are already considering moving to bigger rivals, according to three pilots who did not wish to be named.Go First's lenders will most likely meet on Wednesday to discuss what to do next after the bankruptcy filing, two bankers aware of the development told Reuters.The airline owed financial creditors 65.21 billion rupees ($797 million), its bankruptcy filing showed. As of April 30, Go First had not defaulted on any of those loans, it said in the filing seen by Reuters.",
        "Shares of Go First lenders Central Bank of India, Bank of Baroda and IDBI Bank fell on Wednesday, while stocks of the airline's rivals surged. ($1 = 81.7840 Indian rupees)(Reporting by Tanvi Mehta in New Delhi, Chris Thomas and Dhanya Skariachan in Bengaluru; Additional reporting by Siddhi Nayak and Sudipto Ganguly in Mumbai, Arpan Chaturvedi in New Delhi, Tim Hepher in Paris and Kevin Krolicki in Singapore ; Editing by Dhanya Ann Thoppil, Savio D'Souza, Gerry Doyle and Sharon Singleton)"
    ]
}