{
    "articleURL": "/wires/reuters/article-12043879/Horse-deaths-hover-pall-Derby-week.html",
    "content": [
        "Four horses died in five days in Louisville and two Kentucky Derby contenders could be scratched as one stable copes with the sudden loss.",
        "Derby entry Wild on Ice suffered a fatal hind leg injury and two horses died Tuesday after collapsing as part of the same race card: Take Charge Briana, trained by D. Wayne Lukas, and Chasing Artie. Parents Pride had a leg injury and was euthanized on Saturday.Trainer Saffie Joseph said he is weighing how to proceed this week at Churchill Downs, where he has entered Wood Memorial Stakes winner Lord Miles and could have seven horses on the loaded card for the weekend.Churchill Downs ordered full necropsies of the deceased horses and said Joseph's horses died suddenly of unknown causes while the other two died as the result of \"musculoskeletal injuries from which they could not recover.\" The track called the deaths \"unusual and unacceptable.\"\"We take this very seriously and acknowledge that these troubling incidents are alarming and must be addressed,\" a statement from Churchill Downs said. \"We feel a tremendous responsibility to our fans, the participants in our sport and the entire industry to be a leader in safety and continue to make significant investments to eliminate risk to our athletes. We have full confidence in our racing surfaces and have been assured by our riders and horsemen that they do as well.\"Joseph had an one horse entered in Wednesday's \"Champions Day\" at Churchill Downs. But 3-year-old filly Accomplished Girl was scratched from the 10th race.",
        "Joseph was struggling to focus on the long view this week.\"It shatters me,\" Joseph said of the loss of his two horses this week. \"We don't have the answer. And that's what -- that's what we need to get the answer. We've had them get hurt. That's different. I've never had a horse like this, of something internally in race? No. Basically it's mind-boggling. I mean, in a race, twice in three days and the first two runners, like, I mean, the same owner? It's mind-boggling.\"Joseph said he's uneasy not knowing the cause of the tragedies this week.\"We're going to have to figure out. `What's the reason?'\" Joseph said. \"I don't think it's bad fortune.\"Joseph appealed a 15-day suspension issued by the Pennsylvania State Horseracing Commission that included $500 fine for a positive test for Gabapentin in one of his fillies, Artie's Princess. Gabapentin is an anticonvulsant and nerve pain medication that treats musculoskeletal pain.Jockey Club data revealed 7,200 horse deaths from 2009-21.--Field Level Media"
    ]
}