{
    "articleURL": "/wires/pa/article-12042573/Fines-totalling-37-000-recommended-players-charged-Yorkshire-racism-case.html",
    "content": [
        "The England and Wales Cricket Board has recommended fines totalling £37,000 for the players charged in the Yorkshire racism scandal.",
        "Former England international Gary Ballance was hit the hardest with a recommended fine of £8,000 and an eight-week suspension.Ballance – one of six individuals connected with the club accused of using racist language in the case which stemmed from allegations made by former Yorkshire bowler Azeem Rafiq – had already admitted the charge brought against him by the ECB.The suspension appears to have little consequence given Ballance announced his retirement from playing last month, although at 33 years old he could theoretically return.The ECB took into account the fact that Ballance had admitted the charge, and apologised, as it gave its recommendations to the independent Cricket Discipline Commission panel.",
        "ECB lawyer Jane Mulcahy KC said: “We understand there has been a significant impact on Mr Ballance’s mental health, and that in April 2023, Mr Ballance announced his retirement from professional cricket.“So the ECB therefore suggests there be a reprimand, and Mr Ballance be fined £8,000, reduced from £12,500 to take in effect of his admissions.“We also suggest a strong recommendation be made that he attend a racism and discrimination course at his own expense, particularly if he attends to return to the game in a playing or coaching capacity.“And also an eight-week suspension, reduced from 10, if Mr Ballance ever returns to ECB-regulated cricket as a player.”",
        "Ballance’s lawyer, Craig Harris, argued the financial penalty should be reduced due to the cost of being involved in the proceedings; namely that he lost his job as a player at Yorkshire, lost a sponsorship contract, and was not considered for England selection. This is not a case where Mr Ballance says the words were not discriminatory, or that he has some sort of intellectual deficit. It is accepted he ought to have known better  Ballance's lawyer, Craig Harris  Harris also pointed to the culture in the Yorkshire dressing room for over a decade – including widespread use of the term ‘P***’ – which was eventually exposed by Rafiq’s bombshell testimony in 2021, and that Zimbabwe-born Ballance was himself the subject of discriminatory remarks.He said: “This is not a case where Mr Ballance says the words were not discriminatory, or that he has some sort of intellectual deficit. It is accepted he ought to have known better.“Even if used in a jocular sense, it is only a ‘joke’ because they are playing upon a prejudice, so I don’t go as far to say those rules were not breached.“But they were breached by someone living and playing within a culture in which the use of such language had become normalised, and where there appears to have been a degree of mutual acceptance that jokes – which ought to have no place in a dressing room or in society – did develop.",
        "“The language got worse all the time that squad spent together and there was no club intervention to eradicate it. He is somebody who himself accepted such jokes being made towards him.”",
        "Yorkshire have admitted to four charges including a “failure to address systemic use of racist and/or discriminatory language over a prolonged period”.The sanctions against the club are expected to be announced next month.The other five former Yorkshire players facing charges: John Blain, Tim Bresnan, Andrew Gale, Matthew Hoggard and Richard Pyrah, had all previously withdrawn from the disciplinary proceedings and did not provide written submissions. The charges against them were heard in their absence in March.The ECB recommended former Yorkshire captain and coach Gale be fined £7,500 and suspended for four weeks were he to return to coaching.Hoggard should be fined £7,500, Bresnan and Blain £5,000 each, and Pyrah £4,000, the ECB said.",
        "Yet as if to illustrate the ECB’s dubious handling of the entire depressing episode, Mulcahy admitted to not knowing whether Pyrah was still coaching, but recommended a two-week suspension anyway.All five, Mulcahy said, would have been suspended from playing were they still active. Hoggard, for example, is now 46 and retired almost 10 years ago.Former England captain Michael Vaughan was the only one of the seven players initially charged to appear at the hearing, and he was cleared of using racist language.",
        "The latest in a seemingly never-ending series of hearings ended with CDC chair Tim O’Gorman warning: “It is going to take time for the full decisions to be made and for them to be available in writing. That is going to take several weeks.”",
        "Former Scotland international Blain described the outcome of proceedings against him as a “depressingly predictable and wholly unjust decision” as he launched a GoFundMe page in a bid to clear his name through legal action.Blain added in a statement: “Despite being entirely innocent of these allegations, I was advised by my lawyers to withdraw from the inadequate ECB process, due to its many fundamental flaws.“The evidence given was one-sided, partial and in some areas, simply untrue – I have never used such language. This is supported by many independent witnesses, many of whom were team-mates.“I’m hugely indebted to the thousands of people in the global cricketing community – many, many of them from an Asian background – who have shown me such unwavering support.“I remain determined to take whatever legal actions are required to clear my name and have launched a GoFundMe page for that purpose.”"
    ]
}