{
    "articleURL": "/news/article-12038411/Religious-mother-starved-son-3-death-lockdown-stop-Covid-detained-hospital.html",
    "content": [
        "Olabisi Abubakar believed if she and her son Taiwo fasted it would stop CovidThey went without food for up to four months at her flat in Cardiff, south Wales A 'deeply religious' mother who starved her three-year-old son to death to save the world from Covid has been detained in hospital because she's a serious risk to the public.",
        "Olabisi Abubakar, 42, was 'thrown off balance' by lockdown and believed if she and her son Taiwo fasted it would stop the spread of the disease.The mother and son went without food for up to four months before Abubakar was found in an emaciated state on a sofa bed alongside Taiwo's body which weighed just 9.8kg (1st 5lb).Mother-of-five Abubakar, a Nigerian asylum seeker and devout Pentecostal Christian, was found not guilty of manslaughter by reason of insanity. She was also cleared of two charges of child cruelty.Before Covid, Abubakar was a 'good and devoted mother' and neighbours remarked on the smell of appetising food coming from her flat.",
        "But Cardiff Crown Court heard she was stressed about her immigration status and worried about the growing pandemic.She and Taiwo, a 'happy and healthy little boy', began fasting hoping it would stop the spread of the virus and the pair were rarely seen at their home in Cathays, Cardiff.Prosecutor Mark Heywood KC said: 'Police were called to the address by a friend who become concerned for her welfare.'Mr Heywood said Nigeria-born Abubakar was 'lying on a sofa bed, she was noticeably thin, malnourished and dehydrated.'He said Taiwo was 'emaciated and cold to the touch' adding: 'It was clear that Taiwo had been dead for some time.'",
        "Mr Heywood said the windows were closed in the flat and there was 'a pervading smell of decomposition and faeces - it was dirty and soiled nappies were lying around.'Mr Heywood said Abubakar had 'deliberately neglected' Taiwo by 'failing to provide food and water to join her in fasting as a religious act.'When police found them, Abubakar could be heard shouting: 'He's dead, he's dead, he's dead.'Taiwo weighed just 21lbs - 10lbs less than an average three-year-old boy - when he was found on 29 June 2020.A post mortem examination found he had died some time earlier of malnutrition and dehydration.",
        "Delusional Abubakar was diagnosed with paranoid schizophrenia and believed she had been brought back to life by singing angels.Abubakar, also known as Shola Phillips, came to the UK as an asylum seeker in 2011 and spent time living in London before being housed in Cardiff in 2017.Consultant psychiatrist Dr Tom Wynne told the hearing: 'She is suffering from paranoid schizophrenia and still showing some symptoms of delusional beliefs.'He had told the trial that when he examined Abubakar she 'did not feel responsible for the death' and 'denied trying to harm' Taiwo, adding she told him: 'God had taken Taiwo away'.",
        "Judge Mrs Justice Jefford told her: 'As part of your religious beliefs you would fast as a means of concentrating on God and prayer.",
        "'There were also stresses in your life, you were concerned about your immigration status and felt no one, not even God, was helping you.'You were particularly worried and scared about Covid - all these things contributed to you developing a severe mental illness.'Your paranoid beliefs interacted with your religious beliefs and you started to fast more and more.'The judge said her reasons for fasting were 'well intentioned' but went against the teachings of the church and had devastating results.She said: 'You thought it would bring the blessings and protection of God to you, your children and the nation at this difficult time.'The medical evidence is you fasted to extreme for as much as three to four months - you were extremely malnourished and dehydrated.'The police officer who entered your flat recorded what he saw and no one could fail to be moved by the condition you were in.'You had also engaged your child in fasting which your church teaches you should never do, with tragic consequences.'After hearing from two medical experts, the judge imposed an order under Sections 37 and 41 of the Mental Health Act that Abubakar should be detained in hospital where she is receiving treatment.The judge also imposed a Restriction Order because of a 'high risk of serious harm to the public' if she was allowed into the community.",
        "Abubakar, wearing a grey hoodie, appeared via a video link from the Caswell Clinic in Bridgend and showed no emotion as she was sentenced.Following the manslaughter trial, a statement was released by Taiwo's father. He said: 'Taiwo was an amazing boy. He was a pleasure to behold.'The first time I saw Taiwo he gave me such joy - I was fulfilled. I wish Taiwo was still with us but I want to remember him as the happy, talkative boy that he was.'Detective sergeant John Harris from South Wales Police said: 'This was a complex and tragic case. Our thoughts are with Taiwo and all those who knew and loved him.'"
    ]
}