{
    "articleURL": "/tvshowbiz/article-12058963/MAFS-AU-Olivia-Frazer-reveals-truth-frosty-relationship-Jackson-Lonie.html",
    "content": [
        "Married At First Sight star Olivia Frazer has given fans an update on the status of her relationship with Jackson Lonie, nine months after their split.",
        "The former couple, who found love on last year's season of the reality show, moved in together on the Central Coast after filming wrapped, but called it quits in August.Despite their seemingly amicable post-breakup status, Olivia didn't hold back when discussing her feelings toward Jackson during an interview with Yahoo Lifestyle.'To be fully transparent, we tried to maintain a friendship and be really good mates, and I think we still are,' she revealed.'To be honest, he hurts my feelings a lot,' she added.'He thinks I'll get back together with him at the drop of a hat, and when we have conversations, he thinks that he's going to lead me on if he's nice to me.'",
        "Olivia went on to describe how Jackson, usually 'very big and warm and lovely,' has transformed into 'an icy person' around her. 'He's quite cold, and it's really hard to go from being in a loving relationship to trying to be friendly exes,' she lamented.Frazer further explained the challenges of navigating this frosty dynamic, stating, 'For him to put up that wall and be quite conservative with me is a big change, and I don't like it.'",
        "She noted that she's able to maintain friendly relationships with all her exes, but not receiving that warmth from Jackson has been difficult.",
        "Despite the chilly turn of events, Olivia still expressed love and respect for her ex.'There just needs to be a bit of space at the moment,' she concluded.It comes after Olivia revealed that she was a taking a break from dating and revealed that she has no plans to go public with someone she is seeing unless they are planning on getting engaged or having a baby.Frazer confessed that the overwhelming attention on her romance definitely added strain and unnecessary pressure when there didn't need to be.   "
    ]
}