{
    "articleURL": "/wires/reuters/article-12040483/Indias-Go-First-Airways-owes-financial-creditors-798-mln--filing.html",
    "content": [
        "By Arpan Chaturvedi",
        "MUMBAI, May 3 (Reuters) - Indian budget carrier Go Airlines (India) Ltd, which filed for bankruptcy on Tuesday, owes financial creditors 65.21 billion rupees ($798 million), its bankruptcy filing showed.The company, which operates the Go First airline, had not defaulted on any of these dues as of April 30, it said in the filing, which was seen by Reuters.\"However, considering the present financial situation of the corporate applicant, defaults to financial creditors would be imminent,\" the filing said.Lenders were not aware of the airline's plans to file for voluntary insolvency and will meet soon to take stock of the situation, said two people familiar with the matter.They spoke on condition of anonymity as they are not allowed to speak to the media.The filing lists Central Bank of India Ltd, Bank of Baroda Ltd, IDBI Bank Ltd, Axis Bank Ltd and Deutsche Bank among Go First's financial creditors.However, Axis Bank, in a statement to stock exchanges, clarified that it has no outstanding exposure to the airline.The Central Bank of India and Bank of Baroda have an exposure of 13 billion rupees, respectively under a consortium loan, while IDBI Bank has a smaller exposure of 500 million, the filing showed.An official at Central Bank of India said the bank's total exposure to the airline is 20 billion rupees. The person spoke on condition of anonymity as they are not allowed to speak to the media.",
        "Deutsche Bank declined to comment. Emails sent to the other banks were not immediately answered.Go First has also borrowed 12.92 billion rupees under the government's emergency credit scheme introduced during the Covid crisis. As part of the scheme, the government guarantees loans given out by banks to the company.The airline's total liabilities to all creditors stand at 114.63 billion rupees, the filing shows. This includes dues to banks, financial institutions, vendors and aircraft lessors.\"Currently, the assets of the company are not sufficient to meet its liabilities,\" the airline said in the filing.The company has defaulted on payments to operational creditors, including 12.02 billion rupees to vendors and 26.60 billion rupees to aircraft lessors.It has received notices from lessors for termination of aircraft lease agreements and some have started actions against the company to ground or repossess aircraft, the filing said.Six lessors have also invoked letters of credit issued to them by lenders, it said. (Reporting by Arpan Chaturvedi in New Delhi, additional reporting by Siddhi Nayak in Mumbai; Writing by Ira Dugal; Editing by Mark Potter and Savio D'Souza)"
    ]
}