{
    "articleURL": "/femail/article-12056047/James-Middleton-wears-cufflinks-dedicated-late-dog-Ella-Coronation.html",
    "content": [
        "James Middleton shared a photo on Instagram and paid tribute to Ella READ MORE: Middletons rally round! Pippa Middleton stuns in yellow as she arrives with her parents to support Kate at the CoronationJames Middleton wore cufflinks dedicated to his late therapy dog Ella to the King's Coronation at Wesminster Abbey, he has revealed.",
        "The younger brother of the Princess of Wales, 36, arrived at the Abbey with his other sister Pippa, 39, and parents Carole, 68, and Mike, 73, yesterday to watch King Charles and Queen Camilla crowned - as Kate stole the show in her dazzling Alexander McQueen gown.James himself was dressed to the nines in a morning suit, with Pippa by his side in a yellow Claire Mischevani blazer dress with a Jane Taylor hat - but James revealed he had given his suit and tales a special touch.The entrepreneur posted on Instagram a photo of one of his cufflinks, which featured an image of his beloved late pooch Ella who died in January of this year at the age of 15.Posting the close-up shot of the accessory, he wrote: 'Ella still comes with me everywhere I go... even to the Coronation.'",
        "He added: 'Very proud day to be British. God save the King.' James announced the death of his much loved pooch in January in a heartbreaking Instagram post paying tribute to the therapy dog who helped him during a battle with clinical depression. The business owner, who founded the dog food enterprise Ella &amp; Co named after her, said Ella supported him 'from my darkest days to my happiest'.",
        "He has previously credited the black spaniel with helping him overcome his mental health struggles and introducing him to his wife, Alizée Thevenet. Yesterday the Princess of Wales's family looked in high spirits as they arrived at Westminster Abbey for the Coronation of King Charles III.Carole, 68, looked elegant in sapphire coloured dress as she smiled at crowds alongside her husband, Michael Middleton, 73, who donned a suit with a red patterned tie. ",
        "The Middletons have maintained a close relationship to the royals, appearing at many family occasions following the 2011 marriage of Kate and William.And as Kate has ascended the ranks of the Royal Family, Carole and Michael have continued to play an important role in the lives of their grandchildren, Prince George, Princess Charlotte and Prince Louis.They also continue to remain a pillar of stability for William, who they have known since his university days.It is believed that William is very fond of his in-laws, and that he very much enjoys spending time with Kate's parents and siblings. As well as spending time with their daughter and son-in-law, and their children, the Middletons have also been spotted at other royal events and have even been invited to join the royals at church in Sandringham, Norfolk.After speculation around whether they would or wouldn't appear at Queen Elizabeth's Platinum Jubilee last June, they were spotted at the Platinum Party on the Saturday night.",
        "Making an appearance at a much more sombre occasion, Carole and Michael joined senior members of the Royal Family for the Queen's funeral and Committal Service in September.Last December, Kate's family turned out in full support of their daughter's carol concert at Westminster Abbey, which came after the release of the final three episodes of Prince Harry and Meghan Markle's explosive Netflix documentary. ",
        "The family will today be showing their support for the new King and Queen as they are crowned. Kate's siblings have also been thrown into the spotlight after her entry into the Royal Family.Mother-of-three Pippa made headlines around the world, when she was maid of honour at her sister's wedding, with many sharing photos of her striking gown.She is married to hedge fund manager and former racing driver, James Matthews, brother of Made in Chelsea star, Spencer Matthews.Her brother James Middleton married his wife Alizée Thevenet at a French Riviera wedding in 2021. ",
        "He has previously spoken out about how he has battled depression and was also diagnosed with Attention Deficit Disorder (ADD). Speaking on his depression, he revealed to The Telegraph that he 'couldn't do anything', including seeing his family while he was struggling and that he was in a 'dark and miserable place'. ",
        "He added that Kate would join him at therapy sessions and his mother, father and sister Pippa also supported him.Last year, Kate's family turned out in full support of their daughter's carol concert at Westminster Abbey, which came after the release of the final three episodes of Prince Harry and Meghan Markle's explosive Netflix documentary."
    ]
}