{
    "articleURL": "/news/article-12053457/Royal-fans-pour-Mall-Coronation-procession-today.html",
    "content": [
        "Over a hundred thousand royal fans are expected to line King's procession routeMany thousands more poured into London to watch the procession on screens CORONATION LIVEBLOG: Click here to follow live updates throughout todayHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Millions of royal fans poured into the Mall early this morning to get the best possible view of the historic Coronation procession, securing their spots along the route, on the VIP grandstand or in front of big screens.",
        "Waving their Union Jack flags, fans who managed to bag a prime spot at the front of the metal barriers erupted in applause as King Charles and Camilla travelled in the Diamond Jubilee coach to Westminster Abbey.Others opted to use Hyde Park's big screens to watch the full ceremony, with chants of God Save The King ringing out across central London as the historic event unfolded.Royal supporters desperate to get in on the celebrations filled the Mall from the early hours of this morning, with police turning away disappointed masses who were still trying to secure a spot.Die-hard royal fans decked out in red white and blue, who had secured their positions after camping out for days, were told to take down their tents to fit the maximum number of people into viewing areas.In true British fashion, the millions who flocked to the capital were undeterred by the British weather, putting up their brollies and donning raincoats as they celebrated.",
        "Wave upon wave of spectators attempted to secure a spot to watch the procession from Buckingham Palace this morning, with crowds over a dozen people deep building hours before proceedings were due to get underway.Marshalls in high viz jackets controlled the numbers of people entering the area to avoid crushing but huge queues quickly built up at the entrance points to The Mall.",
        "There were heated arguments amongst royal super-fans who had camped out to get the best spots, with many jostling to secure a front row view as early as 5am this morning.As the morning went on, there were angry scenes as people were turned away from joining those massed against metal barriers having been told the viewing area was full.Hundreds of royal fans were left disappointed as the Met Police said there was no space for new arrivals with all entrance points to Athena Mall closed off.The roads running parallel to The Mall were choked full of disappointed and angry royal fans unable to get close enough to witness the historic occasion.Jenny Adams stood outside a gate near Admiralty Arch pleading to be allowed inside- but contract security guards refused to allow her in.One woman was close to tears as she pleaded to be allowed through to join friends - eventually barging past contractors forming a line on the pavement. Others stood at iron gates on tip toes hoping to catch a glimpse of the procession.The feared rainy weather arrived as hundreds of thousands of spectators waited patiently for the start of the procession.",
        "By 7am crowds either side of The Mall were 15 deep with spectators. The array of tents that had sprung up close to Buckingham Palace had been taken down and replaced by royal fans.",
        "As dawn broke over London many royal fans bagged a spot on steps close to Admiralty Arch and were happy to sit and wait for the procession to begin. Concession stands selling bacon rolls did a roaring trade while the queue for a mobile coffee shop stretched more than 50 yards.As viewing areas filled up, more and more royal fans have been opting to watch the procession live on one of the four big screens set up around central London. ",
        "Live TV feeds have been set up around Hyde Park on old football pitches near the Serpentine, and thousands of fans have already secured their spots on picnic blankets and camping chairs.A lucky few have been given seats on a specially-built grandstand in front of Buckingham Palace.Almost 4,000 Armed Forces veterans, NHS workers and members of royal charities, received invitations to have a front row seat on the historic day.",
        "Many of those in the various crowds around the capital took selfies with those decked out in brightly coloured outfits as a memento.Werner Marx drew attention with his Union Jack suit while Carmel Flynn who had her face painted red, white and blue happily posed with other royal fans.Police were cheered and clapped as they walked along The Mall to take up position ahead of the procession due to leave Buckingham Palace at 10.20am.",
        "Royal fans began arriving from dawn attempting to get as close as they could to Westminster Abbey in the hope of securing a vantage point.Terry Duncan, 42 beamed: 'I drove down from Yorkshire through the night just to be here. It's such an historic occasion and I really wanted to be a part of it. It's wonderful and somehow doesn't feel real. I feel as if I'm in a fairy tale seeing London dressed up like this and being part of this wonderful occasion.'Anita Parkes, 51 from Harrow, London said: 'It's such an important, historic day and I just wanted to be part of it. It wouldn't have felt the same sitting at home watching it on the television.",
        "'It's a fantastic occasion and I can't wait to see Charles, Camilla and the rest of the Royal Family. It's what makes this country great, and I'm really made up that I'm here to see a once in a lifetime event.'Alan Houghton, 39 who was with his partner Sheila Roberts, 36 said: 'We came for the Queen's funeral and it's so lovely to return to Westminster Abbey for such a happy and important occasion. We got here early because we wanted to get a good spot and it's going to get even more crowded, but it will have been worth it.'",
        "But many faced disappointment as access to roads leading to the Abbey was closed by police early due to the large volume of crowds.Osvaldo Gutierrez, 29 from Spain who was visiting London with his friend Ricardo Lopez said: 'We were planning to visit London anyhow and only realised that the coronation was happening when we got here a few days ago.",
        "'It's wonderful to be here to witness such a beautiful occasion and we just had to come, even though it's a very early start and we can't even see the Abbey. We have a royal family in Spain but don't go as made for them as they do here in the UK. It's a little different to how we do things in Spain but it's great to be here and feel a part of this special event.'Many spectators gathered along Bird Cage Walk, which runs parallel to The Mall to watch troops marching towards Buckingham Palace to meet the King for the start of the day's ceremonies.Friends Carol Sakundiak and Debbie Shimming flew from their home in Canada and were eagerly awaiting the start of the procession.'This is our first ever visit to the UK and we just wanted to be here to show our support for the Royal family. There is such a great atmosphere and we are thrilled to be here'",
        "Alongside them Lorraine Wright and Jane Sheldon stood out with glittering gold crowns.The friends from Northamptonshire handed round cakes to friends having bagged a spot on the front step alongside the Institute of Contemporary Arts.'We were planning to get closer on The Mall but sitting here we have a great view' said Lorraine.Many in the crowds were decked out in a riot of colour - mostly a patriotic red, white and blue.",
        "Among them Chris France and Sue Merrills who wore matching multi coloured wigs.'It is just great to be part of such a special occasion, said Chris who had travelled from her home in Telford.",
        "Screen 1 – old football pitches (south of the Serpentine, close to South Carriage Drive) – facing westScreen 2 – old football pitches (south of the Serpentine, close to South Carriage Drive) – facing eastScreen 3 – the Cockpit (north side of the Serpentine, near the Norwegian War Memorial)Screen 4 - boathouse lawn (north side of the Serpentine, next to the boathouse)",
        "Mum and daughter Sue and Sandra Winder from Stoke on Trent wore outfits of red, white and blue they had worn at Prince William's wedding 12 years ago.Pete Berry said he got up at 3am to add the finishing touches to his personalised Coronation suit.The 57-year-old spent hours adorning the two-piece beige suit with Union Jack cuffs and beading.He even sewed royal blue fabric onto the back of the jacket and hand-painted the official monogram of King Charles III in gold glitter.The support worker accessorised the striking outfit with a Union Jack waistcoat and a handmade gold crown.Royal fans Derek Nelson, from Harrow, west London, said he had got the first underground train into central London.The 54-year-old said he had been determined not to miss the royal occasion.'I wasnt feeling too good with a cold, but am really made up to be here.'This is a one off, and probably the only coronation I will see in my lifetime. It's special to be here and even though I had an early start I would not want to miss it.'It is nice being among so many like-minded people. I really do think there is a great affection for Charles and it is going to be spectacular.'Willie Adams, 41, was with his wife Julie and said they had carefully planned where to stand and watch the procession.'We decided to avoid too close to the Palace as everyone will want to see them on the balcony, and I think that will just be too busy.'We went to the Queen's funeral which was of course very sad, so this is great that it will be a happy occasion. All the pomp and ceremony will be such a wonderful sight to see. Its what this country does best.'",
        "As dawn broke over the Mall the die hard fans who had camped out for several nights emerged – exhausted but excited.Some were seen taking a well-earned nap in camping chairs before a long day of standing.Pat McDonald, 52, from Loughborough, said: 'It has been very tiring but once I've had my first cup of coffee, I will feel much better.'People were so excited last night we did not get much sleep, but we can always rest afterwards. This is a moment in history and not one I would want to miss.'When I see Charles and Camilla I'll be waving a cheering. It will be special to see them wave back.'",
        "The biggest concern for many of those who had camped out was that their view might be blocked by one of the 11,000 police officers on duty as they take their place on The Mall.The minicamp city that had sprung up was quickly disassembled with no sign of the blue tarpaulins that many had sheltered under when they were hit by a sudden downpour on Friday afternoon.",
        "Diane Thompson, 63, an operations manager for a food factory has been camping on The Mall for two days.Wearing a patriotic Union flag suit, topped off with red, white and blue wig, she said: 'It's makes you proud to be British, nobody does pomp and ceremony quite like us.'I'm looking forward to seeing the Royal Family all together today.'This is a once in a lifetime event, most of us have never witnessed a Coronation before so it's a day to remember.",
        "'I'm sure the Queen is somewhere looking down on Charles with pride.'Ms Thompson said the atmosphere on The Mall over the last few days had been 'wonderful' although there was a 'tense' situation this morning when the road opened and crowds pushed forward.She added: 'There was a steady build of people as soon as they opened The Mall and there was a lot of pushing forward and a few tempers frayed.'But overall the atmosphere has been wonderful, we've made friends from all around the World. We've met so many Americans who have travelled here for the Coronation and French...which is strange when you think what they did to their own monarchy!'Friends Gillian Anderson 39 and Deborah Imber, 45, have also been camping out on The Mall.",
        "Wearing a crown, Ms Imber, from West London, said:'It's going to be a spectacular day, the weather is holding out so far and there's everyone from every corner of the world in London for this.'I really hope to catch a glimpse of the Coronation carriage, that's what I've been really excited about.'But everything about today will be magnificent, it's one of those occasions that you'll remember all your life.'King Charles will be fantastic, long may he reign!'Ms Anderson added: 'We've met people from South Africa, America, France and Kent. The Coronation has brought people together from all over the world.'We are reall lucky to have such pagentry and we do it so well.'",
        "John Hemmant, 63, a winemaker from Norfolk said: 'My son is a Royal Marine reserve and will be marching 20 mins behind the King so we hope to get a picture of him as he comes past.'I've a great deal of time for Charles, he wasforemost in changing the way we farm if you think back to his pursuit in making Highgrove completely organic many years ago.'His stance on conservation has been well ahead of the curve and if he can have any influence on government attitudes toward global warming then I think that will be an incredible achievement.Mr Hemmant, wearing a Union-flag waistcoat and top hat, added: 'An event like this brings people together from all walks of life and backgrounds.",
        "'We've come through some tough times as a country so today will be a celebration of Britain I think.'Mary-Jane Willows from Cornwall said she had been camping out on The Mall for five days and four nights.She said: ' I think the moment the King, Queen and the Royal family step out on the Buckingham Palace balcony for their first appearance will be an amazing point in history.'Charles brings a new era carrying forward all the many positives from Her Late Majesty Queen Elizabeth reign with his passion for youth, the environment and championing UK businesses.'He's passionate about the Commonwealth so will grow and develop the importance of Unity. He will be a great King.'Karen Hughes, 65, and her niece Tammy Hughes, 43, travelled from Alberta in Canada two weeks ago especially for today's events.",
        "Karen, who was born in the UK, emigrated to North America when she was 18-years-old. This is the first time she has been back to her birth country in 47 years.She said: 'We love the Royal family in Canada. This is a once in a lifetime opportunity.'I will definitely be pledging my allegiance to the King with the homage of the people.'Tammy added: 'It's a chance to experience an important moment in history, which we won't get again. We couldn't miss it.'Support worker Pete Berry, 57, travelled up from Bristol last night to join in with the celebrations.The Coronation is just one of many national events the royal superfan has attended.He said: 'I've been to all the significant royal events. I went to see Kate and William's wedding in 2011 and the Queen's silver jubilee when I was 10-years- old.",
        "'She was doing a procession around Tower Bridge and I went up with my parents. I actually got to speak to her. I remember being amazed, even at the age of 10, how small she was in person.'My nephew is in the Household Cavalry and my brother is a police sergeant based in the Royal Parks so I feel a personal connection to the Royal Family.'They are at the heart of our society and they give us a way of representing our country on the national stage.'The 57-year-old said reciting the homage to the people is 'no different' to singing the national anthem.He added: 'I will definitely be pledging my allegiance. I don't understand why there was so much controversy.'I will say it to show I support the King and the Royal family and that I hope he has a good and long reign. It's no different to the national anthem.",
        "'I think it was very thoughtful of them to include and represent everyone, it's a lovely idea.'Friends Kay Davie and Clare Spry, both 35, woke up at 6am to travel down from Luton in Beds to Hyde Park.Admin assistant Kay said: 'I've been waiting for this day for years. It's the first royal event I've been to but if we don't do it now when will we? It's a once in a lifetime opportunity.''I wouldn't describe myself as a diehard Royalist but it's a bit of fun.Clare added: 'It's a great atmosphere here. It feels so patriotic.'Beautician Tabatha Gratt, 43, moved to Peterborough from Brazil three years ago.",
        "She said a big factor in emigrating to the UK was her love for the Royal Family.The mum-of-three, who was joined in Hyde Park by her husband Roberto Menta and brother Paolo Mass, said: 'We couldn't miss this moment.'I love the history and culture of this country, and the British people, and I've always loved the Royal Family. I moved to this country because of them.'And I'm passing that respect for the monarchy on to my three kids.'",
        "Paul Atherton travelled to Hyde Park from his temporary accommodation in Paddington, to view the Coronation on the big screen.The 54-year-old, who has been homeless for 14 years, said: 'The thing about our country is we are the stalwart for royal tradition.'When we do events like this, we do them on a global scale - we don't do things by halves.'Today is part of global history. It's really special.",
        "'I have experienced homelessness so most people don't expect me to support the monarchy, but there is nothing else that brings people from all walks of life together in unity like this.'It doesn't matter if you're four or 400-years-old, everyone is welcome, and everyone is accepted and everybody is here having a good time.'Paul said he will join in with the homage of the people today/yesterday (SAT).He added: 'I will be pledging allegiance to the crown but not to god.'There's been so much controversy but at the end of the day it's a choice and it's one I will be making.'I think it was a generous gesture to include everyone, not just the elite few.'Ivo Varreiros, 48, pledged his allegiance to the late Queen when he became a British citizen 20 years ago and says he will now do the same for the new King.",
        "The estate agent, who was celebrating in Hyde Park with his friend Paul Jones, 55, said: 'I'm a big fan of the Royal Family. All Brazilians are, we adore them.'It's all the pomp and pageantry. It's fantastic. I have been to all the Jubilees and big events, I never miss them.'Brazil is a very young country, so we don't have much history. We studied more British history than Brazilian history at school.'When I became a British citizen I swore to the Queen and I will definitely pledge allegiance to the King today.'Self-professed royalist Ann Abbott, 71, said she has loved the monarchy since meeting the late Duke of Edinburgh at a Buckingham Palace garden party.She was invited to the event with her daughter Amy Abbott, 42, who worked at the Royal Academy of Engineering at the time:The pair have travelled up from Bath to watch today's events unfold on the big screen in Hyde Park.Ann said: 'I'm a big royalist. I think they're fantastic. I wouldn't have missed it for the world. We've been to lots of royal events and will continue to do so.'How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk "
    ]
}