{
    "articleURL": "/tvshowbiz/article-12049097/Latin-Crooner-Luis-Miguels-San-Diego-tickets-sale-prepares-2023-World-Tour.html",
    "content": [
        "Latin music superstar Luis Miguel will be performing in San Diego as part of his 2023 World Tour. ",
        "The Grammy Award-winning singer recently announced his 43-date tour would kick off in Buenos Aires, Argentina, on August 3rd before moving through major US cities, including Chicago, Las Vegas, Miami, and Los Angeles. Miguel will perform in San Diego at Pechanga Arena on Sept 21st. Other major acts slated to perform at Pechanga Arena this year include Bruce Springsteen, Blink-182, Depeche Mode, and Erykah Badu.Pre-sale tickets for his San Diego performance go on sale Thursday, May 4th, with prices ranging from $59 - $199, and can be purchased online.Miguel is considered one of the best-selling Latin musicians ever, with 60 million worldwide record sales.",
        "The crooner will perform some of his timeless hits like 'Ahora Te Puedes Marchar' and 'Hasta Que Me Olvides,' before ending the tour in Guadalajara, Mexico, on December 17.  He is nicknamed 'El Sol de Mexico' which translates to 'The Sun of Mexico.'The pop icon has won five Grammys, four Latin Grammys and is the only artist with two Spanish-language platinum albums in the US.Miguel's last tour, México Por Siempre, ran from 2018 to 2019 and grossed $101.4 million over 116 shows, according to Billboard Boxscore.It was the highest-grossing Latin tour in history until it was surpassed by Bad Bunny's most recent tours, El Ultimo Tour del Mundo and World's Hottest Tour last year.",
        "Luis's most recent album, ¡México Por Siempre! was released in 2017 and won Album of the Year at the Latin Grammy Awards.The Mexican singer, known for keeping his personal life private, was the subject of the Netflix series Luis Miguel: La Serie. Having already aired for three seasons on the streaming service, Luis Miguel is a dramatization of the life of the famous Mexican singer who has captivated audiences for decades. The trailer opens with Diego Boneta, 30, as Luis, saying: 'My father gave me the only thing I ever have.'He can then be seen in a flashback scene as a small child as his father tells him: 'You have a gift... Anyone can sing, but to be a natural, that's something else.'",
        "An older Luis appears on the screen again and says: 'He gave me music,' before he can be seen singing on stage with a live band.Mariah Carey's relationship with Luis between 1999 and 2001 is detailed in the show.More serious matters ensue as Luis finds 'more money than can bankrupt' him, stolen from his account by a member of his own family. While Luis' father obsessively attempted to turn Luis into the superstar he himself dreamt of becoming, the reality of fame and fortune tore their family apart."
    ]
}