{
    "articleURL": "/news/article-12042231/Thirtysomething-star-Peter-Horton-69-caught-smooching-mystery-woman.html",
    "content": [
        "DailyMail.com spotted actor Peter Horton, 69, at the popular Dart Coffee shop in downtown Santa Barbara Horton was seen with a mystery blond woman hanging on his arm who pulled him in for a kiss and fed him samples of the shop's baked goodsPeter has been married twice - first to actress Michelle Pfeiffer and then to TV director Nicole DeputronActor Peter Horton was spotted getting cozy with a mystery blond woman, exclusive DailyMail.com photos reveal. ",
        "The Thirtysomething actor was seen at the popular Dart Coffee shop in downtown Santa Barbara, kissing the woman who hung on his arm and fed him samples of baked goods. The pair seemed oblivious to anything except each other, even as bystanders were vocally trying to place the actor. 'Look! It's Parker Stephenson,' whispered one woman. Her girlfriends then argued with her that he was someone famous for sure, but not the former Hardy Boys actor.",
        "The 69-year-old actor played Professor Gary Shepherd on the ensemble Emmy-winning drama series Thirtysomething. He starred in the show from 1987-1991.It chronicled the lives of a group of friends living in Philadelphia and struggling to come to grips with the various aspects of growing up: career, marriage, parenthood and health issues.Horton's character was a womanizer with Peter Pan syndrome and was shockingly killed off in a motorcycle accident in the final season.Horton's mystery date wore an Aviator Nation five stripe hoodie, while he had on jeans and a brown long sleeve shirt.After their orders were taken they both tried their hands at darts.'Bulls eye!' Horton said as he sunk his dart right in the middle of the board from about three feet away.The mystery woman then rewarded him with a kiss before they took their drinks to go.",
        "Dart Coffee is in the revamped area of downtown Santa Barbara called 'The Funk Zone.'It's popular with a younger crowd of tourists and locals who enjoy live music, wine, food tastings, upcycled art, jewelry and unique furniture stores.",
        "Horton has been married twice. In 1981 he married Michelle Pfeiffer, 64, after meeting her at an acting class. They divorced amicably in 1988.In 1995 Horton married Canadian sports writer turned TV director Nicole Deputron, 51. The couple share two daughters, Lily, 23, and Ruby, 21.While there has been no report of a divorce, Horton has not been seen wearing his wedding ring in recent photos.  He's been spending time at his quaint $1million, two-bedroom beach home he purchased in the 1980's in Cambria, California.The five bedroom, five bathroom, $5million home in Santa Monica he shared with second wife Nicole for almost three decades has not been sold and remains in the Horton Family Trust, with her still listed as the co-trustee.Since his fame on Thirtysomething, he's mostly taken his place behind the camera, writing and directing episodes of Grey's Anatomy and most recently the NBC hospital drama New Amsterdam."
    ]
}