{
    "articleURL": "/wires/ap/article-12039767/Autopsy-finds-Cash-App-founder-died-pierced-heart.html",
    "content": [
        "SAN FRANCISCO (AP) - Cash App founder Bob Lee died during surgery from stab wounds that pierced his heart and a lung, according to an autopsy report released Tuesday that also shows he had alcohol and drugs in his system.",
        "Doctors at San Francisco General Hospital tried for hours to close the wounds in Lee's heart and save his life, but they declared him dead at 6:49 a.m. April 4, according to an 18-page autopsy report by the San Francisco Medical Examiner.A toxicology test found Lee, 43, had alcohol, cocaine, ketamine and allergy medication in his system, Assistant Medical Examiner Dr. Ellen Moffatt wrote.Moffatt concluded Lee´s cause of death was multiple stab wounds, and that the manner and method of death was homicide by sharp injury.Tech consultant Nima Momeni, 38, was charged with murder with a sentencing enhancement of using a knife in the April 4 stabbing death of Lee. If convicted, he faces 26 years to life in prison.A plea hearing on Tuesday was continued until May 18 after Momeni's defense attorney, Paula Canny, asked for more time.",
        "Outside the courtroom, Canny emphasized Lee´s drug use could have led him to make bad decisions.\"There´s a lot of drugs in Bob Lee´s system. I mean, Bob Lee´s system is like the Walgreens of recreational drugs,\" Canny said.\"What happens when people take drugs? Generally, they act like drug people, and what drug people act like is not themselves, not happy-go-lucky,\" she said. \"Just kind of illusory and make bad decisions and do bad things.\"",
        "She wouldn't say whether Momeni did drugs with Lee, who police said was his acquaintance.San Francisco District Attorney Brooke Jenkins said defense attorneys often smear a homicide victim´s character as a defense strategy. \"Whether or not someone has or has not done drugs - that does not give someone a license to kill him,\" Jenkins said.Prosecutors say Momeni drove Lee to a secluded spot and stabbed him over a dispute related to Momeni´s sister. They said in court documents that surveillance video and testimony from a friend of Lee who was with him the afternoon and evening before he died led investigators to Momeni.A friend of Lee, who was not identified, told investigators the two of them met with Momeni's sister, Khazar Elyassnia, at an apartment where she was drinking with another unidentified man, according to court documents. The friend said he and Lee left the apartment and went to Lee´s hotel room where he witnessed a conversation in which Momeni was questioning Lee over whether his younger sister \"was doing drugs or anything inappropriate,\" prosecutors said.The friend and Lee parted ways around 12:30 a.m. Minutes later, Lee can be seen on video surveillance entering the high-end Millennium Tower, where public records show Elyassnia and her husband, Dino Elyassnia, own a unit. The video also shows Lee and Momeni leaving the building shortly after 2 a.m. and driving off in Momeni´s BMW.",
        "Prosecutors say that Momeni drove to a dark and secluded spot, parked his car and after the two got out of the car, attacked Lee with a kitchen knife, stabbing him three times, including once in the heart. He then sped away \"and left victim to slowly die,\" according to a motion to detain. Police recovered a knife with a 4-inch (10-centimeter) blade at the scene.Lee is known for creating the widely used mobile payment service Cash App while working as chief technology officer of the payment company Square, now known as Block."
    ]
}