{
    "articleURL": "/tvshowbiz/article-12043999/Kaley-Cuoco-cuts-casual-figure-gray-sweatpants-LA-one-month-welcoming-child.html",
    "content": [
        "New mom Kaley Cuoco was seen opting for casual comfort as she stepped out for an errand run in sunny Los Angeles on Tuesday. ",
        "The Big Bang Theory alum, 37, who recently enjoyed an adventure to a farm with her one-month-old daughter, Matilda, held a smartphone up to her ear as she held a brief conversation. The star welcomed her first child, a baby girl, on March 30 with her partner and fellow actor, Tom Pelphrey, whom she has officially been dating since May 2022. As she strolled under the warm sunshine, the Emmy-nominated actress slipped into a pair of loose-fitting, gray Nike sweatpants that were secured with drawstrings at the waist. The mother of one additionally donned a plain, white T-shirt which was partially covered by a cream-colored, fuzzy jacket that she chose to leave unzipped.  ",
        "For a pop of color to her monochromatic ensemble for the day, Kaley wore a pair of hot pink socks along with black, open-toed slip-on sandals. The Flight Attendant actress opted to not carry any heavy purses or handbags during the errand run, and simply held her car keys in her left hand as she made her way through a parking lot. Over the past weekend, the star enjoyed a relaxing day trip to a farm with her mini-me in cute videos and photos she shared to her Instagram stories earlier Saturday. In the first reel that the actress uploaded to her 7.8 million fans and followers, she could be seen holding her daughter. The star gave gentle kisses on Matilda's cheek as they stood under a shady tree with farm animals next to them.",
        "The track, Never Grow Up, by Taylor Swift, played in the background, with lyrics such as: 'Oh darling, don't you ever grow up/Don't you ever grow up/Just stay this little,' appearing towards the bottom of the video.The star additionally shared a photo of herself holding Matilda as she slightly leaned over a low, white fence so her one-month-old bay girl could meet the adorable farm animals, such as a goat.",
        "'All the littles are very interested in the human little haha,' she humorously typed out in a caption that was added onto the snap.Kaley also cheerfully posed for a loving selfie with her mini-me to capture the special moment and penned, 'Born a farm girl!'The last photo she shared onto her Instagram stories showed a close pal holding Matilda in her arms. Kaley snapped the picture as the little one looked over the friend's shoulder.Kaley announced that she was expecting her first child with Tom late last year in October, and revealed their little girl was welcomed to the world on March 30.The two lovebirds, who publicly confirmed they were dating last year in May, also celebrated their one-year anniversary last month in April. Aside from embracing motherhood, Cuoco has jumped back into the world of television, much to the delight of fans. She will appear in the upcoming Peacock thriller titled, Based On A True Story, which is slated to release next month on June 8. ",
        "The eight-part series additionally stars The Mindy Project actor, Chris Messina, as well as Death On The Nile star, Tom Bateman, and Stranger Things actress, Natalie Dryer. During an exclusive interview with Vanity Fair which was published on Tuesday, Kaley revealed that her real-life pregnancy was written into the script and added that she started filming five months pregnant and stopped shortly before giving birth to Matilda.",
        "She explained that the crew and creator, Craig Rosenberg, 'really let me be me,' and added, 'They let me do my Kaley thing.' The star later stated that, 'All of it just felt like the right fit for me, and it ended up being one of the most enjoyable acting experiences I’ve ever had.' In regards to being pregnant when production began, Kaley admitted, 'It was honestly awesome to write it in because I never had to hide anything.' 'I could still eat what I wanted and wear what I wanted, and it worked for the character, which is so rare—that you can keep eating for a role,' she added, and expressed that for more 'crazy' scenes, stunt doubles were brought in. The premise of the series follows, 'A realtor, a former tennis star and a plumber seize a unique opportunity to capitalize on America's obsession with true crime,' according to an official IMDB synopsis.   ",
        "Her fellow castmate, Chris, gushed to Vanity Fair that Kaley, 'just rolls into it, and she’s just as loose and free and playful.' ",
        "The last show she worked on was The Flight Attendant, which aired for two seasons, and garnered her numerous nominations, such as Emmys and Golden Globes. She also voiced Harley Quinn in an animated HBO Max series of the same name, with the most recent episode airing earlier this year in February.On Tuesday, the actress, who previously shared behind-the-scenes snaps from the set last month in March, excitedly announced that Based On A True Story is slated to premiere next month on June 8. She typed out to her fans and followers, 'It’s happening!' and after revealing the release date, Kaley concluded, 'if you enjoy true crime mixed with some uncomfortable comedy, this one’s for you.' "
    ]
}