{
    "articleURL": "/tvshowbiz/article-12041603/Melanie-Sykes-says-normal-Leonardo-DiCaprio-date-women-25.html",
    "content": [
        "Melanie Sykes has revealed she thinks it is 'normal' for 48-year-old Leonardo DiCaprio to only date women under 25. ",
        "The TV star, 52, also told how she prefers younger men as they are able to match her energy.   Last year, Mel ended her romance with Venice gondolier Riccardo Simionato, who was 22 while she was 50.Before that she had been married to Jack Cockings, who was 16 years younger than her, and she also dated German golf pro Martin Kaymer, who was 14 years her junior.On Tuesday she spoke on The Shift, a podcast for women over 40, and defended Leo saying it was normal that he only has younger partners.",
        "She said: 'He's got a type. He likes them that age.'Leo famously dated model and actress Camila Morrone for five years but they split last August just a month after she turned 25.Ex girlfriends Nina Agdal, Kelly Rohrbach and Toni Garrn were all also under 25 when Leo dated them. Melanie then added of her own experiences: 'It got to a point where I had a few boyfriends on the bounce that were 27. So what? I like the energy of a certain age.'It's very rare to meet a man of my age with the energy that I've got. And I don't mean for marathon sex sessions, I mean like life.'Elsewhere on the podcast she revealed she avoided sex for a year after using it as a 'Band-Aid' to patch up problems in her relationships.",
        "The former model also spoke about having a string of toyboy lovers, and said that her despite a period of celibacy, her libido remains 'high'.'I've been written off as some predator for young men.",
        "'I don't have an age, I'm just spirited. And I meet spirited people that I want to whirl around with for a while, while it feels good.'When it doesn't, I'll whirl around with somebody else.'The TV star, who has two children with her first husband, actor Daniel Caltagirone, said she found more 'respect' for herself after she endured a period of celibacy.'I've always had a high libido,' she said. 'Because I wanted to have sex with someone, I would. But it wasn't necessarily good for me, or they weren't particularly nice people.'But if you're driven by your libido, which men are notorious for and women not so much - which I think is bull**** because I think loads of women just want to get f***** sometimes and there's nothing wrong with it – but I also realised that I needed a connection.'It's like putting a Band-Aid on something. If you can resolve an argument with a really great session of sex, it doesn't mean the problem has gone.'And I thought if I withdraw the sex, then the problems I can just avoid.",
        "'And so I've just avoided. And after a year I was so much more understanding of myself and had more respect for myself.'I won't lay with anyone that isn't my equal ever again. It's as simple as that because I don't like casual sex. I tried it, I don't like it.'But it doesn't stop me wanting to have sex because that's just me being a full-on .Melanie, who also revealed she is 'turned on by smart women', was on the podcast to promote the release of her autobiography, Illuminated: Autism &amp; All The Things I've Left Unsaid,"
    ]
}