{
    "articleURL": "/wires/ap/article-12044877/Brown-scores-25-Celtics-spoil-Embiids-return-121-87-win.html",
    "content": [
        "BOSTON (AP) - The Celtics walked off the court angry and frustrated after giving up home-court advantage in their series-opening loss to the 76ers.",
        "Boston called on those emotions - and its defense - to dominate in Game 2.Jaylen Brown scored 25 points and the Celtics rolled past Philadelphia 121-87 on Wednesday night, spoiling the return of new league MVP Joel Embiid.The Celtics tied the series at one game apiece as the Eastern Conference semifinal series shifts to Philadelphia for Game 3 on Friday.\"I think we've just got to take more pride in ourselves. That's it,\" Brown said. \"I just feel like we underperformed last game. We wanted to come out and play to the best of our ability. And that's what we did.\"Malcolm Brogdon added 23 points, connecting on six of Boston´s 20 3-pointers. Derrick White and Marcus Smart added 15 points apiece. Jayson Tatum played most of the game in foul trouble and was held to seven points.",
        "Boston ratcheted up its defense and limited a 76ers team that hit 17 3-pointers in its Game 1 win to just 6 of 30 from beyond the arc on Wednesday. The Celtics led by as many as 36 points in the fourth quarter.Brogdon said their charge now is to maintain the same mindset going forward.\"It doesn´t mean anything if there´s no carryover,\" he said.Tobias Harris led the 76ers with 16 points. Embiid finished with 15 points, three rebounds and five blocks in his first game back from a sprained right knee that caused him to miss the final game of the 76ers´ first-round sweep of Brooklyn. He also sat out Philadelphia´s Game 1 win on Monday.",
        "James Harden, who tied his postseason career high with 45 points in Game 1, missed all six 3-pointers and shot 2 for 14 overall while finishing with 12 points and 10 rebounds.Embiid´s return came a day after being voted MVP for the first time.He was cleared to play by doctors and training staff following a pregame, on-court workout. That was after he did some light work during the 76ers´ morning shootaround.Embiid said he was told it could take four to six weeks for his injury to heal and the opportunity to take a 2-0 lead ultimately made him want to play, even if there was rust.\"I felt pretty good to play and I felt like I could help the team,\" he said. \"I feel like I just got this out the way. Disappointed by the loss. But that's a step toward getting back to myself.\"Tatum picked up three fouls in the first half. He was called for his fourth at the 7:34 mark of the third quarter when he knocked Harden to the floor while trying to fight through a screen.It forced him to play a little less aggressively and helped Philadelphia cut what had been an 18-point Boston lead to 73-60 with just over four minutes to play in the third quarter.",
        "But Tatum´s teammates picked up the slack, leading the way as the Celtics closed the quarter on a 19-5 run to get it back up to 92-65 entering the fourth.Embiid started slowly offensively, but with the 76ers struggling to make shots from the outside, he made an almost immediate impact defensively.First, he blocked an early shot by Smart and then forced White to adjust another attempt. Embiid had five blocks his first 13 minutes of action.But his conditioning was noticeably lacking as he lumbered into sets at times. He played just shy of seven minutes in the first quarter before getting his first rest. He returned for the final 1:05 of the period.Embiid knocked down his first field goal of the night. a jumper over Grant Williams, with 21.4 seconds left before tripping as he backpedaled back down the court. He quickly rose to his feet. He finished the first half with 13 points, going 7 of 8 from the free throw line.Brown said they expect to arrive in Philadelphia and face a 76ers team motivated after losing for the first time this postseason.\"Hostile environment. But it should be fun,\" he said. \"We should all be excited to embrace that challenge.\"TIP-INS76ers: Shot 1 of 13 from the 3-point line in the first half. ... Didn´t get their first offensive rebound until the 9:41 mark of the second quarter",
        "Celtics: Tatum´s seven points marked the first time he was held to single digits in a playoff game since Game 2 of Boston´s 2021 first-round series against Brooklyn, when he had nine. ... Boston led 57-49 at halftime. ... Had just three turnovers in the opening 24 minutes.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}