{
    "articleURL": "/wires/ap/article-12056911/Engineers-frustrated-rails-sick-time.html",
    "content": [
        "OMAHA, Neb. (AP) - Tens of thousands of engineers remain frustrated with the lack of paid sick time and the demands railroads like BNSF are making in negotiations despite the deals that have been made this year for most of the other rail unions.",
        "The lack of sick time and other quality of life concerns about the demanding schedules train crews work took center stage in the negotiations last fall that reached the brink of a strike before Congress intervened and blocked a walkout.The Brotherhood of Locomotive Engineers and Trainmen union says the railroads are still asking for too much in return for sick time instead of just providing the basic benefit it believes workers are entitled to.\"They want to take the money out of our pocket somewhere else and give it back to us in the form of sick time,\" said Rob Cunningham, one of the BLET's general chairmen who is leading the negotiations with BNSF.The BLET's frustrations generally extend to all the major freight railroads, but Cunningham said BNSF seemed to be acting especially \"hard headed\" in talks last week.The Fort Worth, Texas, based railroad is in the spotlight this weekend because it is owned by Warren Buffett's Berkshire Hathaway and thousands of adoring shareholders filled an arena in Omaha, Nebraska, Saturday to listen to him answer questions.",
        "Buffett didn't face any questions about the way BNSF is treating its workers, but Buffett takes an extremely hands-off approach to Berkshire's companies and largely lets them run themselves. In the past, he has declined to get involved in labor negotiations at subsidiaries.",
        "\"You would think with something as easy as paid sick time, he could just say: `Do it. We need to do this. This is the right thing to do,\" Cunningham said about Buffett, who is also a major philanthropist.\"But clearly he doesn´t practice what he preaches,\" Cunningham said.BNSF spokeswoman Lena Kent said the railroad has already reached deals to provide sick leave to more than 6,000 of its employees at eight of its unions, and \"it is our intention to ultimately have agreements in place covering our entire scheduled workforce.\"Across the industry, CSX has led the way by reaching agreements with most of its unions on sick time. Norfolk Southern and Union Pacific have also announced several sick time deals. Most of these deals provide workers with four days of paid sick time and give them the option to convert three leave days into sick time to give workers a total of seven sick days a year.\"CSX is determined to ensure that all employees feel valued, respected, appreciated and operate as one team,\" spokeswoman Sheriee Bowman said.Most of those other deals that have been announced focus on smaller unions that do maintenance and repair work along the rails and generally have more regular schedules. The conductors' union - the Transportation Division of the International Association of Sheet Metal, Air, Rail and Transportation Workers - has reached deals with NS and CSX that include five paid sick days and the option to convert two personal leave days.",
        "The Brotherhood of Maintenance of Way Employes Division Union that represents track maintenance workers has been able to reach sick time deals with UP, CSX and Norfolk Southern, but they have had to fight to get that benefit without making concessions.The engineers' union has yet to reach a single sick time agreement at any of the railroads.One of the key remaining concerns for the BLET is that even where the railroads seem willing to give engineers sick time, the railroads generally still want to hold workers accountable for missing work under their strict attendance policies. So even if workers do get sick time, they may not feel free to use it because they would still be penalized for missing work although CSX has said it won't punish workers for taking sick time.\"We´re going to have locomotive engineers and conductors making a choice of whether to work sick and handle some of the most dangerous items that any transportation group handles, but they´re going to work sick or be subject to attendance policies,\" said Mark Wallace, BLET´s second-highest official.U.S. Sen. Bernie Sanders who has been pressuring the railroads to give their workers sick time and tried unsuccessfully to require it when Congress was voting on the contract in December said he has been encouraged by the progress the industry has made so far.",
        "Already more that one third of all rail workers industrywide have gained paid sick time since the start of the year. On CSX and Norfolk Southern, the portion of workers who now have sick time is closer to two-thirds.But more needs to be done, and without concessions, the Vermont independent said.\"This is something that should have been done years ago and time is long overdue for those companies to provide those benefits right now,\" Sanders said.Sanders said all the publicity the railroads received last fall for refusing to provide sick time forced their hands.\"At the end of the day, what the rail industry understood is it´s just very hard to defend record breaking profits and massive stock buybacks and then saying they don´t have enough money to do what is the right and decent thing for workers and that is guarantee them paid sick days,\" Sanders said.SMART-TD President Jeremy Ferguson said he hopes the agreements his union has reached with CSX and Norfolk Southern to secure five sick days will become a model for deals with the rest of the railroads. But he is also focused on trying to get conductors relief from the stringent attendance policies that have put them on call 24-7 in recent years.",
        "\"That´s where we really butted heads with the carriers,\" Ferguson said.The deal SMART-TD reached with Norfolk Southern last week tries to ensure conductors will know their days off in advance. Norfolk Southern spokesman Thomas Crosson said those new rules should help because conductors will generally work six days in a row followed by two days off, and each week's schedule will be more predictable.___This story was first published May 7, 2023. It was updated May 8, 2023, to correct a typo in a quote in the fourth paragraph."
    ]
}