{
    "articleURL": "/news/article-12061587/Fetterman-Depression-nearly-ruined-me.html",
    "content": [
        "Sen. John Fetterman sat down with MSNBC's Joe Scarborough and talked about seeking treatment for depression He said depression 'nearly ruined me' and he avoided a potentially 'tragic' outcome by checking into Walter Reed earlier this yearFetterman also talked about how a  'social media blowtorch' was 'unleashed on my family' as he was transitioning to Washington, D.C. Sen. John Fetterman said that depression 'nearly ruined me' and he avoided a potentially 'tragic' outcome by checking into Walter Reed, in his latest comments about seeking inpatient treatment for the disease. ",
        "The Pennsylvania Democrat sat down for an interview with MSNBC's Joe Scarborough last week, which aired in full Monday night, and was asked if there was a 'triggering event' that convinced him to seek help. 'I'll never forget the decision where I'm like, if I don't do something to claim my life, this could be tragic,' the 53-year-old lawmaker said. 'I was skeptical,' he added of seeking treatment. Like in other interviews, Fetterman said that his depression became a problem after his 2022 Senate campaign wrapped up. In a local interview Tuesday with Pittsburgh's KDKA he used the word 'vicious' to describe the battle against Republican TV personality, Dr. Mehmet Oz. But with Scarborough, Fetterman also talked about adjusting to life in Washington and lashed out about the online hatred his family has received since he became a national political figure. 'Then another thing that was very punishing at that time, too, is that there was this social media blowtorch unleashed on my family,' he said. 'Unleash whatever you want on me, but on my family - I can't imagine anybody that would think it would be funny to make fun of children or whatever.'  ",
        "Fetterman's wife Gisele became targeted by the political right as she became one of his primary surrogates during the campaign after he suffered a stroke. ",
        "'Our family and I went through this grueling campaign and now you've won and now, what's wrong with us? Is it not enough for us?' Fetterman described to Scarborough. 'You know, why do you feel this way?' 'And I tried to explain to them, no, it's different,' he said of conversations with his family. 'Winning doesn't mean that it still didn't hurt still.' He told Scarborough, 'That's what's so insidious about depression. You might win and it still feels like you lose.'  'I laid there, I laid there and watched this hurt my own children. Because they were confused. Because they thought just because you won, why aren't you - you should be happy,' he recalled. Scarborough asked Fetterman if he looked to leaders like President Abraham Lincoln or British Prime Minister Winston Churchill - who struggled from depression - but fought through it to become historical figures.'I would say there's almost like a nobility to it. Our suffering. There's nobility to that,' Fetterman commented. 'So maybe sometimes it toughens you up for whatever. It didn't toughen me up, in fact it nearly ruined me,' he revealed. 'And I know it put my family through a lot of pain,' the lawmaker said. ",
        "He said the 'catalyst' for his recovery came from his children writing him inspirational notes and, in turn, him wanting to get better for his children. ",
        "'And it became kind of like that's what sparked my idea that it's like there's a whole big reason to get better,' Fetterman said. 'Me putting my kids through the scaring of losing me or what's wrong really was the single biggest motivation to take it on.'He said he felt 'ashamed' that his 8-year-old son had to be the one to enthusiastically cheer him. 'I was the guy that should have been cheering for them on and encouraging them. No it was the children that were doing all that. And they didn't hold it against me. They let their love come through,' Fetterman said, noting that he had a 'lot of support.' In a previous clip that aired Friday, Fetterman said he's 'begging' other men who are struggling with mental health issues to seek help.     As May is Mental Health Awareness Month, Scarborough pointed to figures that showed men are less likely to seek treatment when suffering from depression and anxiety, adding, 'If you need help, get help, don't be too proud.''I couldn't agree more,' the Pennsylvania Democrat said. 'I would beg - this isn't a matter of who's tough or who's not. I would just beg men, you're not too macho. It's no big deal. The only person you're really going to hurt more than anyone else is actually your family.' ",
        "Fetterman stayed in the Senate race after suffering a stroke just days before Pennsylvania's Democratic primary last spring. It kept him off the campaign trail for most of the summer.He returned to doing public events through the fall - though was slowed down by the after-effects of his stroke, which had created auditory processing issues.He described hearing voices like the adults on the Peanuts cartoons. When talking to Scarborough, he was still assisted by closed captioning technology, in order to understand what the MSNBC host was saying. Due to the stroke, Fetterman's speech was still sometimes halting. Scarborough asked the Pennsylvania Democrat what the Biden administration and Congress could do to improve mental healthcare in the U.S. Fetterman noted, 'it's all of our challenges.'  'And we should have it because there might be a time when you're going to need the kind of programming like me to turn your life around,' he said. 'It's not a Democratic issue, this isn't a Republican issue, this is not hard right, hard left, this was jsut a human issue,' the senator added. 'I'm begging people get help if you can - and it works. Just like I refused to believe I could be made better.' Previewing the full interview on Friday morning, Scarborough said, 'He's determined to stay, he's determine to fight through this.'  ",
        "He also noted that Fetterman got the most emotional about 'the love he felt from from Democrats and Republicans alike.''It's the first thing that he talked about,' Scarborough said. Fetterman was discharged from Walter Reed at the end of March. He returned to work in the Capitol when Congress came back from a two-week Easter recess in April. "
    ]
}