{
    "articleURL": "/wires/pa/article-12043387/King-changes-wording-official-prayers-include-Queen-Camilla.html",
    "content": [
        "The King has directed a change in the wording of official prayers for the royal family, replacing “Camilla the Queen Consort” with “Queen Camilla” from the day of the coronation.",
        "A Royal Warrant was issued on Wednesday, three days before Charles and Camilla are set to be crowned in Westminster Abbey.It indicates that, with effect from May 6, every prayer for the royal family in any form of service authorised for use in the Church of England should use “Queen Camilla” instead of the words “Camilla the Queen Consort”.",
        "Charles is, as monarch, the Supreme Governor of the Church, and the change also amends the prayer for the royal family in the Church of England’s Book of Common Prayer.The prayer will now read: “Almighty God, the fountain of all goodness, we humbly beseech thee to bless Queen Camilla, William Prince of Wales, the Princess of Wales, and all the Royal Family: Endue them with thy Holy Spirit, enrich them with thy heavenly grace; prosper them with all happiness; and bring them to thine everlasting kingdom, through Jesus Christ our Lord. Amen.”“Queen Camilla” appeared officially for the first time on the coronation invitations, with Buckingham Palace saying the May 6 ceremony was the appropriate time to start using the title in an official capacity.",
        "Years of debate followed Camilla’s wedding to Charles in 2005, when aides said she “intended” to be known as “Princess Consort” when her husband became monarch.",
        "The late Queen backed Camilla to be Queen Consort in a Jubilee masterstroke, and the former Duchess of Cornwall has been referred to by the Palace as such since the King’s accession.The wife of a king automatically becomes a queen and only a change in legislation would have prevented Camilla from being so.The change was issued in a Lambeth Palace circular, and the warrant will be published in the London Gazette, the UK’s official public record."
    ]
}