{
    "articleURL": "/wires/reuters/article-12044349/UK-PM-Sunak-looks-limit-losses-major-electoral-test.html",
    "content": [
        "By Andrew MacAskill and Alistair Smout",
        "LONDON, May 4 (Reuters) - Voters in England will cast their ballots in local elections on Thursday in the first major electoral test for Prime Minister Rishi Sunak following a year when the governing Conservatives have suffered a cascade of scandals, strikes and economic chaos.The elections are viewed as one of the last big opportunities to gauge public support before a national election expected next year, and a chance to assess if the main opposition Labour Party can convert their run of double-digit poll leads into election victories.Sunak, who took over last year following the scandal-ridden premiership of Boris Johnson and the chaotic economic policies that brought down Liz Truss, is credited with stabilising Britain's economy. But his party is still forecast to suffer heavy losses when the results are announced on Friday.Votes will decide more than 8,000 council seats across England in 230 local government authorities on Thursday, which are responsible for the day-to-day provision of public services such as bin collections, schools and transport.The Conservatives face a fight on two fronts, with the main opposition Labour Party - who lead by about 15 points in national polling - seeking to reclaim seats in the so-called Red Wall areas in north and central England, and the Liberal Democrats are attempting to make gains in the south.",
        "The main political parties are trying to manage expectations heading into the elections. The chairman of the Conservatives said his party could lose about 1,000 seats, while Labour leader Keir Starmer said the Conservatives should be making gains because of their previous poor performance.The last time most of these seats in England were contested was in 2019 the Conservatives fared poorly, losing over 1,000 seats as smaller parties like the Liberal Democrats and the Greens made gains. Then-Prime Minister Theresa May announced her resignation later that month.Anthony Wells, head of European Political and Social Research at YouGov, said that looking at the vote share might be a more useful indicator than which seats change hands.\"Labour are unlikely to get a lead that is as large as national polls, because the Lib Dems and Greens and smaller parties inevitably do better at local elections than they do at national elections,\" he said.\"But if (Labour) want to be on course to win the next election, they should be hoping to get a lead in national vote share of 10 points or so.\"The results will not directly affect Sunak's practical ability to govern because the vote does not cause seats in parliament to change hands.This will be the first set of elections in England where voters will be required to show a form of photographic identification to vote. A survey by YouGov last week found that about a quarter of voters are unaware of this change, meaning that people could be turned away from polling stations.",
        "(Reporting by Andrew MacAskill, editing by Ed Osmond)"
    ]
}