{
    "articleURL": "/tvshowbiz/article-12043385/Dua-Lipa-grabs-lunch-NYC-attending-Met-Gala.html",
    "content": [
        "Dua Lipa cut a casual figure as she went for lunch in New York City days after attending the Met Gala.",
        "The singer, 27, showed off her trendy sense of style as she grabbed a bite to eat with Joe Kentish, the head of Warner Records UK.The hitmaker donned a blue and white striped shirt which she wore with a pair of camo trousers.Wrapping a red striped jumper around her shoulders, Dua also carried a black printed handbag.Letting her raven locks fall loose down her shoulders, the star complimented her look with a pair of sunglasses. ",
        "Accessorising with silver earrings, the Don't Start Now completed her outfit with a pair of white trainers. Dua took to social media on Tuesday to reflect on her participation on fashion's biggest night.'The First Monday In May An honour to co-host the Met Gala this year celebrating Karl Lagerfeld and his incredible legacy. Thank you Anna and Vogue for having me,' Dua posted referencing Met Gala host Anna Wintour, 73.'Thank you patrimoine de Chanel @chanelofficial for making my dreams come true with my dream dress the FW1992 original bride dress and thank you to @tiffanyandco for lending me the most unbelievable necklace -'I felt very lucky to get to show it off for the very first time!' she added for her roughly 10.3 million followers on Twitter and 87.8 million followers on Instagram.",
        "The dress code for the fashion extravaganza was Karl Lagerfeld: A Line of Beauty - paying tribute to the controversial German fashion designer, known for his work with Chanel, who passed away in 2019.Dua stuck to the theme as she wore Claudia Schiffer's iconic 1992 Chanel bridal tweed gown to the Met Gala, which was held at the Metropolitan Museum of Art.The tweed, ballgown-shaped dress included a structured corseted midsection with black-and-white striped piping, a voluminous skirt, and a fringed hemline.",
        "Dua later changed into a black crop top and matching shorts for an after party that she hosted. The after party was its own star-studded affair that drew Rihanna, Billie Eilish, Florence Pugh, Brooklyn Beckham and Nicola Peltz. Dua co-hosted the Met Gala with Penelope Cruz, Michaela Coel and tennis great Roger Federer. "
    ]
}