{
    "articleURL": "/wires/reuters/article-12039169/EXPLAINER-How-Fed-act-U-S-default.html",
    "content": [
        "May 2 (Reuters) - Federal Reserve Chair Jerome Powell at his press conference on Wednesday is likely to get asked - again - what contingencies he plans for in the event of a U.S. debt default, and he is likely to say - again - that there is no central bank silver bullet to shield the economy from such a damaging event.",
        "The risk of default looms ever larger after Treasury Secretary Janet Yellen on Monday said the date the government may run short of funds to pay its bills under the current $31.4 trillion debt limit may be as early as June 1. Time is running short and President Joe Biden and congressional Republicans are unlikely even to meet for the first time for another week.Despite Powell's protestations, the Fed would have a role in trying to limit the harm to financial stability. In past debt-ceiling standoffs - in 2011 and 2013 - Fed staff and policymakers developed a playbook that would likely provide a starting point.And the recent banking turmoil has introduced at least one potential new twist.Here are some of the Fed's options:THE BASICSThe U.S. central bank's basic responses to debt-limit-related market stress were laid out in an August 2011 conference call held by its policy-setting Federal Open Market Committee to discuss what seemed to be imminent trouble.Two of the key ideas developed then, the use of repurchase and reverse repurchase agreements to ensure liquidity for the most important financial markets, are now permanent Fed programs integral to how it manages interest rates on a day-to-day basis.If market stress became apparent in short-term interest rates, it could temporarily increase the amounts available for \"repos\" - short-term sales or purchases of securities that can run into the trillions of dollars each day. Indeed, doing so might be necessary for the Fed to conduct monetary policy if market stress pushed its benchmark target rate outside the range set by policymakers.",
        "SUSPEND QT?Another quick tool at hand would be to suspend the current \"quantitative tightening,\" also known as QT, used by the Fed to shrink its balance sheet each month.While QT is part of the Fed's move to tighten monetary policy to control inflation, it has a net effect of pulling about $95 billion a month out of financial markets - money the central bank could in effect add back by holding its balance sheet constant until the debt-ceiling standoff ended.OLD TOOL, NEW TWIST?The Fed's most standard tool, acting as lender of last resort to banks through its discount window, would also be available.But now there's a twist, one perhaps foreshadowed in the 2011 planning discussions but brought back into the light by the failures in March of Silicon Valley Bank and Signature Bank.A default would not extend to the nearly $24 trillion stockpile of Treasury securities all at once - it would spread one bill, one note, one bond at a time as interest and principal payments became due.In 2011, top Fed staff, led by then-head of its monetary affairs division William English, posited the central bank could accept any defaulted Treasury securities as collateral for its standing programs such as the discount window or repos.",
        "That \"seems appropriate so long as the default reflects a political impasse and not any underlying inability of the United States to meet its obligations, so that all payments on defaulted securities would presumably be made after a short delay,\" English - now at Yale School of Management - told officials, the transcript of the 2011 conference call shows.English, however, had envisioned the bonds being accepted by the Fed at a market price that would likely be impaired by their defaulted status.But, following the bank failures in March, the Fed has a new bank lending facility - one that allows securities with impaired prices to be pledged at face value. The same terms apply to discount window loans.THE 'LOATHSOME'The last and most sensitive step for the Fed would involve removing defaulted securities from the market altogether - either through outright purchases that would involve increasing its balance sheet, or \"swaps\" in which it would trade its own holdings of Treasuries on which interest or principal payments were expected to stay current for those that were in default.English in the 2011 call warned that approach \"would insert the Federal Reserve into a very strained political situation and could raise questions about its independence from Treasury debt management issues.\"",
        "When the issue resurfaced during another debt ceiling stand-off in 2013, Powell - then a rather junior member of the Board of Governors with a bit over a year of service at the central bank under his belt - chafed at that idea in particular. But also didn't rule it out.After endorsing a range of less fraught options during a briefing that October, the future Fed chief said, \"as long as I'm talking, I find 8 and 9 to be loathsome,\" referring to the swaps and outright purchases.\"I hope that gets into the minutes. But I don't want to say what I would and wouldn't do, if we have to actually deal with a catastrophe.\"Ben Bernanke, Fed chair at the time, quipped: \"So you are willing to accept 'loathsome' under some certain circumstances,\" drawing laughter from others on the call.Powell responded: \"Yes, under certain circumstances.\" (Reporting By Howard Schneider and Dan Burns; Editing by Andrea Ricci)"
    ]
}