{
    "articleURL": "/sport/football/article-12043595/West-Ham-just-FIVE-outfield-subs-Man-City-clash-sickness-bug-hits-squad.html",
    "content": [
        "West Ham are currently drawing 0-0 with Manchester City at the EtihadThey're squad was drastically reduced by a sickness big among playersKey players Declan Rice, Tomas Soucek and Nayef Aguerd are all missing West Ham's squad has been ravaged by a sickness bug that has left them with just five outfield subs for their clash with Man City on Wednesday night.",
        "Key players Tomas Soucek, Declan Rice  and Nayef Aguerd are among those missing, with the likes of Flynn Downes coming into the side and Aaron Cresswell taking the captaincy.Rice had played every Premier League minute before Wednesday, but was sent back to London due to his illness. They have named just seven of a possible nine subs, with two spots taken up by goalkeepers Alphonse Areola and Joseph Anang. The bug could not have come at worse time, with the Hammers not yet safe from relegation after back-to-back losses.",
        "They face a City side who can go top with a win, although Pep Guardiola has also made changes.Kevin de Bruyne misses the game through injury, while Ilkay Gundogan and Ederson have been rested.Moyes admitted his selection plans had been affected by the bug, as he told Sky Sports: We picked our team last night, Some of them are too ill so we’ve had to change the team.'Hopefully it's not too bad. We had named some of the players who are not here in the side, but two or three of them are ill and there's nothing we can do about it. It will give some other players opportunities. ",
        "'It was always a tough game, we’ve come here a couple of times and got something. We’ll make it difficult. We want a good performance here tonight, but if we don’t get that and we win we’ll take that. ",
        "On City's in-form striker Erling Haaland, he added: 'They’ve got a super centre forward and other good players as well, we have to hope he's not having a good night. 'There are some great premier league centre halves over the year who would have loved the challenge of Haaland, we have to hope they’re up for it tonight.'Despite their list of absentees, West Ham are currently holding their own at the Etihad, where the game remains goalless. "
    ]
}