{
    "articleURL": "/wires/reuters/article-12041925/POLL-Zloty-rally-set-stall-rate-policy-turns-coming-year.html",
    "content": [
        "reuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/fx-polls?RIC=EURCZK= euro/koruna poll data",
        "reuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/fx-polls?RIC=EURPLN= euro/zlotý poll datareuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/fx-polls?RIC=EURHUF= euro/forint poll datareuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/fx-polls?RIC=EURRON= euro/lei poll datareuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/fx-polls?RIC=EURRSD= euro/Serbian dinar poll dataBy Jason HovetPRAGUE, May 3 (Reuters) - The Polish zloty's rally is set to stall and other central European currencies are also likely to retreat over the next 12 months as some central banks return to interest rate cuts, a Reuters poll showed on Wednesday.The zloty has been the fastest-rising central European currency in the last month, with a 2% gain, as interest rate cut expectations have diminished, helping it catch up with the Czech crown and Hungary forint.Tight monetary policy has supported currencies this year but with a return to loosening expected in the coming months or by year-end the poll predicted foreign exchange gains would be harder to achieve even if losses will be small.\"The zloty rally may soon run out of steam,\" Santander analysts said. \"Real activity data have been poor lately, which may be stressed by the flash Q1 GDP release in mid-May.\"Also, the zloty gains and data weakness may tilt the central bank's rhetoric towards the more dovish side again,\" they said.Markets bet on a Polish rate cut in the next six months.The poll expected the zloty to ease by 0.4% from Tuesday's close to 4.60 to the euro over the next 12 months, a slightly stronger outlook than in a poll last month. It should weaken to 4.667 within three months, the poll found.",
        "The Hungarian forint, which has gained over 6% in 2023, is set to lose almost 1% to around 378.5 to the euro in a year's time - a level the forint fell below in May last year and only returned to in early 2023.Hungary's central bank lowered the top of its interest rate corridor, paving the way for eventual cuts.Also in the poll, the Czech crown was forecast to be little changed, with a median forecast putting it at 23.60 to the euro in a year. Romania's leu was expected to fall 2.3% to 5.055 to the euro.(For other stories from the May Reuters foreign exchange poll:)(Reporting by Jason Hovet; additional polling by Sarupya Ganguly and Sujith Pai; editing by Barbara Lewis)"
    ]
}