{
    "articleURL": "/wires/reuters/article-12039397/UK-government-sets-anti-fraud-strategy-tackle-scammers.html",
    "content": [
        "By Muvija M",
        "LONDON, May 2 (Reuters) - Britain on Tuesday set out a new anti-fraud strategy to try to better protect the public from scammers, announcing a new 400-person investigative body and a ban on cold calls promoting financial products, including sham cryptocurrency schemes.Fraud was now the most common crime in Britain, costing nearly 7 billion pounds ($8.72 billion) per year and affecting one in 15 people, the government said in a statement.The new strategy, which received a cautious welcome from a leading consumer rights group, is backed by a new 30 million pound public investment.\"Scammers ruin lives in seconds,\" Prime Minister Rishi Sunak said. \"By blocking scams at the source, boosting protections for people and bolstering enforcement, we will stop more of these cold-hearted crimes from happening in the first place.\"The government said it was working with the country's communications regulator, Ofcom, to clamp down on \"number spoofing,\" which is when callers disguise their identity from the person they are calling.The plans also include a ban on methods used to reach thousands of people at once and a review into mass texting services to prevent criminal use of such technology, the statement said.The opposition Labour Party said the plan was \"too little, too late\", while consumer group Which? welcomed the strategy but criticised the government for not acting sooner.",
        "\"The fight against fraud has progressed far too slowly in recent years and in particular more action is needed to guarantee that big tech platforms take serious action against fraud,\" Which? said in a statement.The government said the new national fraud team would replace existing services and overhaul how crimes are investigated, using a \"proactive, intelligence-led approach.\"Over two thirds of fraud in Britain either starts overseas or has an international link, the government estimated, saying Home Secretary Suella Braverman would host a global fraud summit to boost cross border cooperation. ($1 = 0.8026 pounds) (Reporting by Muvija M; editing by William James)"
    ]
}