{
    "articleURL": "/wires/pa/article-12056927/Thousands-line-village-streets-greet-Duke-Duchess-Edinburgh.html",
    "content": [
        "Thousands of people lined the streets of a Surrey village to greet the Duke and Duchess of Edinburgh during its Coronation Big Lunch.",
        "Edward and Sophie delighted well-wishers in Cranleigh on Sunday, with some fans dressed in Union flag outfits or plastic crowns, eager to catch a moment of history as the couple passed through.The duke and duchess first delighted children from the Scouts and Beavers who had been waiting outside the door of Cranleigh Village Hall.Before their car arrived slightly behind schedule, excited children were looking at other cars shouting “hello?”, “where are they?” and “is that them, is that them?”.",
        "On arrival, the couple were welcomed by His Majesty’s Lord-Lieutenant of Surrey before greeting the crowds.The duke joked “it is nice to see that the weather hasn’t changed in 70 years” when asked about Saturday’s celebrations by one well-wisher.Scouts began singing the chorus of God Save the King and there were cries of “hip, hip hooray!” as they shook hands with fans.Inside the hall, they greeted people who had set up small businesses and voluntary organisations during the pandemic.Among them were refugee Nataliia Diakonets, 55, who is the only person in the village who can sew handmade Union flags and bunting.",
        "She told the PA news agency: “My host family knew I can sew so one of them asked me to do some bunting for the Jubilee and I said yes.",
        "“Nobody knew how to do it so they were looking for someone. I said I can do it so I did it for the Jubilee and now the coronation.“The duke was asking if it was hard to do the job and he joked ‘it is easy to do two colours’ (of the Ukrainian flag) which was quite a funny joke.“He said he hoped we feel welcome and said he wishes the best for Ukraine.”The couple then greeted well-wishers from tiny toddlers to Royal British Legion veterans, who told the duke their stories about National Service, along the village’s high street.The duke repeatedly asked people “have you had lunch yet?” and joked “if you find out what it is will you let me know?”.A few people managed to shake his hand but most were left disappointed as he told them “the trouble is if I did I would be here all day”.",
        "He asked several children “is this what you normally do on a Sunday?” and they revealed their hobbies including football.At one point he pointed at a woman with Percy Pigs in her hand and said “that is well-prepared”.The royal couple then took a tour of the village’s artisan market, which has stalls once every three weeks, before being presented with a slice of majestic chicken pie by chef Adam Handling on the village green.",
        "Aloine Griffiths, 49, told PA how the duke encouraged her 15-year-old twin sons Rufus and Rasmus to do the silver stage of their Duke of Edinburgh award, and they told him they would.Mrs Griffiths, who lives in the village, said: “He was asking why Rasmus was wearing a Scotland rugby shirt and my son said his granddad is from Scotland so he supports them in the rugby.“He was very happy, relaxed and jovial. He was normal.",
        "“It is lovely to see the royals out and about today and especially Edward as he is the Duke of Edinburgh as there are lots of children around here doing their Duke of Edinburgh who will be encouraged to continue.”Lisa Buckman, 41, told PA how her eight-year-old son Ethan managed to hi-five the duchess.He said: “It was good. It was exciting when she came up and said hello. I said hello back and then gave her a hi-five.”Her six-year-old daughter Amelia also said she had said hello the duchess who asked whether she had a nice day.“I said yes”, the youngster added.Ms Buckman added: “It has been a really good atmosphere and they were very normal. They took their time to go and speak to everybody. Everybody here has really enjoyed themselves.”"
    ]
}