{
    "articleURL": "/femail/article-12045553/Expert-issues-urgent-warning-dog-cat-owners-harmful-tap-water.html",
    "content": [
        "Water treatment expert Gene Fitzgerald issued an urgent warning to pet ownersREAD MORE: Cat owners could face £500 fine unless pets are microchipped An expert has issued an urgent warning to dog and cat owners over 'harmful' tap water. ",
        "Gene Fitzgerald, who works for Best Osmosis Systems, revealed that the water in our homes could be 'slowly poisoning' our pets.The water treatment expert claimed it might be dangerous for animals because of the elements dissolved in it.Gene, told The Mirror: 'Hard water contains high levels of calcium and/or magnesium. For pets, this can be harmful.'If a dog drinks too much hard water for too long a period, for example, they can develop conditions such as urinary tract and/or bladder infections, cystitis, urinary obstruction, crystalluria and stone formation.",
        "He added that hard water can also cause health issues in animals such as skin problems, as well as digestive and dental issues. Although the expert did admit that the UK is known for having some of the best tap water in the world there are some 'hard water areas'.Therefore it all depends on the tap water where you live, because some types are absolutely fine for pets to drink. Offering a solution Gene said removing the harmful substances from hard water can help to keep your pet healthy. She suggested that reverse osmosis and distillation softeners are great solutions, but to bare in mind that softeners 'contain sodium', which can be 'equally harmful' to pets.Smaller pet with pre existing health conditions are more susceptible to health issues due to hard water.",
        "There are various online tools for checking the level of water hardness in your area.  But the expert suggested that the best thing to do is to provide these types of pets with filtered tap water. As water quality varies throughout the UK, it's hard to tell what is the best thing to do. If you're worried, you can contact your water company to receive an assessment of your water quality, or speak to a vet. "
    ]
}