{
    "articleURL": "/news/article-12040463/Ham-cheese-croissant-orange-juice-sets-Sumo-Salad-diner-20-Brisbane-Airport.html",
    "content": [
        "Outrage over breakfast cost at airport Traveller bought two basic food itemsAn Aussie diner has been left outraged after purchasing a croissant and small bottle of juice for almost $20 in the latest sign of the cost of living crisis in the country. ",
        "The traveller had been looking to buy breakfast after arriving at Brisbane Airport from Sydney.He decided to step into salad bar Sumo Salad and were left shocked at the final cost of their order.",
        "The traveller shared their experience in a Reddit post saying they had spent  $18.69 for a ham and cheese croissant and an orange juice.The furious feaster said the croissant set them back a whopping $12.50, while the juice cost $6 and on top of that they had to pay a 16c card surcharge.The Brisbane local explained he boarded a 6am flight home from Sydney to Brisbane and was starving when he arrived.He said his flight landed at 7.30am and he was due to start work at 8.45am and felt like he had no option but to bite the bullet while he waited for his baggage.The price of the snack started a heated debate on social media with some saying the price is ludicrous while others said the price of airport food has always been inflated.'If we keep buying it, there will be no reason for change,' one wrote.'I don't see the problem. The airport knows you'll pay, and you paid,' a second added.'The alternative is Brisbane Airport charges lower rents but increases ticket charges. One way or the another you are paying the costs to run an airport.'",
        "'You have two options. Pay $200 for a ticket and $19 for the croissant. Pay $210 for a ticket and $9 for the croissant,' a third wrote.Another explained: 'The price is expensive mainly because the lease for the trading area is very high.",
        "'There is some entrapment penalty but it is covering the cost of the lease which means the prices are high. 'This is because the owners are taking complete capitalistic advantage of it, not because they have to cover ticket prices (that's the airlines) but simply because they can.'One Reddit user asked the Brisbane man if the croissant was any good to which he simply responded, 'It was ok'.Some social media users criticised the traveller for forking out the exorbitant amount.'You paid for this? Then you are the fool,' one wrote.A second added: 'That's f***ing wild! Lol at the card surcharge like they didn't already just rob you.'Australia's cost of living crisis worsened in January with inflation hitting a new 32-year high of 7.8 per cent.The consumer price index in the year to December surged at the fastest annual pace since the March quarter of 1990, with Treasurer Jim Chalmers describing it as 'unacceptably high'.The main contributors to the CPI increase were housing (up 9.8 per cent), food and non-alcoholic beverages (up 8.2 per cent)."
    ]
}