{
    "articleURL": "/wires/ap/article-12046675/US-claims-unemployment-aid-jump-remain-low.html",
    "content": [
        "The number of Americans applying for unemployment benefits jumped last week but remain low overall, even as the Federal Reserve has furiously raised interest rates to beat down inflation and cool the labor market.",
        "The Labor Department reported Thursday that applications for jobless claims for the week ending April 29 rose by 13,000 to 242,000 from 229,000 the previous week. The weekly claims numbers are considered a proxy for layoffs.The four-week moving average of claims, which flattens some of the week-to-week volatility, rose by 3,500 to 239,250.Overall, 1.81 million people were collecting unemployment benefits the week that ended April 22, about 38,0000 fewer that the previous week.American workers are enjoying unusual job security despite rising interest rates, economic uncertainty and fears of a looming recession.As expected, in its ongoing inflation fight, the Fed on Wednesday raised its benchmark interest rate another quarter point. One of the Fed´s goals in raising interest 10 times in the past 14 months is to cool the job market and stifle rising wages. Until very recently, there was very little evidence the central bank´s actions were working on the labor market. But cracks may be starting to show.",
        "The unemployment rate came in at 3.5% last month, a tick above January´s half-century low 3.4%. Employers added 236,000 jobs in March, down from 472,000 in January and 326,000 in February, but still strong by historic standards.Another sign that the labor market may be cooling came Tuesday when the government reported that U.S. job openings fell in March to the lowest level in nearly two years.",
        "Analysts expect that Friday´s April jobs report will show that U.S. employers added 180,000 jobs last month, a relatively low figure compared with the mostly booming job growth the past couple of years.The Fed is hoping to achieve a so-called soft landing - lowering growth just enough to bring inflation under control without causing a recession. Economists are skeptical, with many expecting the U.S. to enter a recession later this year.Last week, the Commerce Department reported that U.S. economy slowed sharply from January through March, decelerating to just a 1.1% annual pace as higher interest rates hammered the housing market and businesses reduced inventories.There have been an increasing number of layoffs in recent months, mostly in the technology sector, where companies added jobs at a furious pace during the pandemic. IBM, Microsoft, Salesforce, Twitter, Lyft and DoorDash have all announced layoffs in recent months. Amazon and Facebook have each announced two sets of job cuts since November.But it´s not just the tech sector that´s trimming staff. McDonald´s, Morgan Stanley and 3M also announced layoffs recently."
    ]
}