{
    "articleURL": "/wires/ap/article-12043741/Oregon-Republicans-stay-home-ahead-abortion-guns-votes.html",
    "content": [
        "SALEM, Ore. (AP) - Republican state senators in Oregon didn't show up to work on Wednesday, denying the Democrats who control the chamber a quorum and casting doubt on planned votes later this week on legislation pertaining to gun safety, abortion rights and gender-affirming health care.",
        "The boycott comes as several statehouses around the nation, including in Montana and Tennessee, have been battlegrounds between conservatives and liberals. Oregon has been increasingly divided between the liberal population centers like Portland and Eugene, and its mostly conservative rural areas.The office of Oregon Senate President Rob Wagner said 10 Republican senators and the chamber's lone independent were absent Wednesday, and that four of the Republicans and the independent were absent without an excuse. The so-called walkout prevented the Senate from holding its scheduled session.Republicans said they were protesting over bill summaries not being written in plain language. They based their boycott on a 1979 state law that requires summaries of bills to be readable by those with an eighth or ninth-grade education - measured by a score of at least 60 on the Flesch readability test, said GOP Senate Minority Leader Tim Knopp.He didn´t say how long Republicans planned to continue their protest, but that the caucus will take it day by day.Asked if the Republican boycott was due to the bills on gun control and abortion and gender-affirming care, Knopp said, \"It´s about every bill. But those bills specifically also don´t qualify under this law, and they refuse to fix them.\"",
        "Democrats weren't hearing it, saying they thought the moves were aimed at delaying votes on those bills, which would be passed by the Democratic-controlled Legislature. House Republicans already stalled a vote for six hours earlier this week on the bill that would expand access to abortion and gender-affirming care.",
        "\"It wasn't happenstantial that when we were about to consider those bills, that was when we saw people walking off the job,\" Wagner said during a news conference.GOP lawmakers employed the same strategy in 2019 and 2020 to freeze legislation on capping greenhouse gas emissions, among other things. But this walkout could test a new voter-approved measure that bans lawmakers who have 10 or more unexcused absences from running for reelection.Oregon has a two-thirds quorum rule, meaning that the state House and Senate need two-thirds of their members to be present to conduct business. In the Senate, that's 20 of its 30 members. Currently, 17 senators are Democrats, 12 are Republicans and one is an independent.Wednesday morning´s Senate roll call showed 18 members present, five absent and seven excused, which was not enough to open.If Republican senators deny a quorum for the rest of the legislative session, which doesn't end until late June, they could theoretically kill the bills on gun control, abortion rights and gender-affirming care.Knopp said the Republicans´ legislative director discovered the 1979 law requiring bills to be easily understandable while doing research last month. He said he didn't know when bill summaries stopped being held to the law's standards, but now that it has been brought to the attention of both parties, all bills should conform to them.",
        "\"We can´t have our highest presiding officers picking and choosing which rules and which laws they´re going to obey,\" Knopp said at a news conference.On Monday, Republicans in the House stretched out Monday's vote on abortion and gender-affirming care legislation for nearly six hours through various motions that sought to send the bills back to committee, delay voting until next month or postpone it indefinitely.The wide-ranging bill would implement a series of measures, including shielding patients and providers from lawsuits originating in states where abortion and gender-affirming care are now restricted. It would also allow doctors to provide an abortion to anyone regardless of age and bar them in certain cases from disclosing that to parents.The gun control measure would increase the purchasing age to 21 for AR-15-style rifles and similar guns, impose penalties for possessing undetectable firearms and allow for more limited concealed-carry rights.The two bills have been fiercely debated and hundreds of people have submitted written testimony both for and against them.___Rush reported from Portland, Oregon."
    ]
}