{
    "articleURL": "/wires/reuters/article-12041923/UN-aid-chief-seeks-safe-passage-humanitarian-supplies-Sudan-crisis.html",
    "content": [
        "UN aid chief seeks in-person meetings with Sudan factions",
        "Six trucks of humanitarian supplies ransacked, U.N. saysFighting continues despite supposed truce between generals(Adds RSF statement that it is committed to truce, paragraph 17)By Mohamed Nureldin and Nafisa EltahirKHARTOUM, May 3 (Reuters) - The United Nations pressed Sudan's warring factions on Wednesday to guarantee safe passage of humanitarian aid after six trucks were looted and air strikes in the capital undermined a supposed truce.U.N. aid chief Martin Griffiths said he hoped to have face-to-face meetings with Sudan's warring parties within two to three days to secure guarantees from them for aid convoys to deliver relief supplies.The meeting could take place in Khartoum, the capital, or another location, Griffiths told Reuters in a phone interview from Jeddah, Saudi Arabia, following a visit to Port Sudan intended to plan a large-scale relief operation.\"It's important to me that we meet physically, face-to-face to discuss this, because we need it to be a public, accountable moment,\" he said.The U.N. has warned that fighting between the army and the paramilitary Rapid Support Forces (RSF), which erupted on April 15, risks causing a humanitarian catastrophe that could spill into other countries. Sudan said on Tuesday that 550 people had died, with another 4,926 wounded, so far in the conflict.",
        "Air strikes were heard in Khartoum and the adjoining cities of Omdurman and Bahri on Wednesday, even as the two sides had agreed to extend a series of shaky and broken truces for a further seven days from Thursday. In Khartoum, millions were still trying to shelter from open warfare between an army using air strikes and heavy artillery and RSF forces embedded in residential neighbourhoods.Most hospitals were out of service and many areas were without power and water as supplies of food and fuel dwindled.With international mediators pressing for peace talks, Sudan's army said it would send an envoy for talks with South Sudan, Kenyan and Djibouti leaders.Aid has been held up in the nation of 46 million people where about one-third had already relied on relief assistance.Speaking earlier, Griffiths said he had been told by the U.N.'s World Food Programme that six of their trucks travelling to the western region of Darfur had been looted en route, despite assurances of safety and security.Griffiths, in the Reuters interview, said he spoke by phone to army leader Abdel Fattah al-Burhan and RSF commander Mohamed Hamdan Dagalo, commonly known as Hemedti, on Wednesday to tell them that specific aid corridors and airlift operations were required.\"We are very clear now in our operational requirements as to what we need in terms of commitments from them,\" he said.",
        "PRESSURE GENERALS, SAYS UNIn Nairobi, U.N. Secretary-General Antonio Guterres said the international community must tell the two leaders the situation is unacceptable. The two generals must face pressure to stop fighting, begin dialogue and allow a transition to civilian government, he said.Burhan's envoy, Dafallah Alhaj, said in Cairo the army accepted talks but there would be no face-to-face discussions with the RSF and communication would be through mediators.South Sudan has said both sides have agreed to the ceasefire and to send representatives to talks. Hemedti said in a tweet on Wednesday he was committed to \"opening and securing safe corridors.\" RSF later in a post on Facebook claimed its forces \"still control 90% of the three cities of Khartoum\" and said it affirmed a \"full commitment to the declared humanitarian truce.\"About 100,000 people have fled Sudan with little food or water to neighbouring countries, the U.N. says.The conflict has spread to Darfur where the RSF emerged from tribal militias that fought beside government forces to crush rebels in a war dating back 20 years.The army and RSF joined forces in a coup two years ago and had shared power as part of an internationally backed transition towards free elections and civilian government.(Additional reporting by Paravicini Giulia in Nairobi and Omar Abdel-Razek and Alaa Swilam in Cairo; Writing by Michael Georgy and Cynthia Osterman; editing by Simon Cameron-Moore, William Maclean, Mark Heinrich, Nick Macfie and Leslie Adler)"
    ]
}