{
    "articleURL": "/wires/reuters/article-12046093/Canadas-Justin-Trudeau-struggling-commands-party.html",
    "content": [
        "By Steve Scherer",
        "OTTAWA, May 4 (Reuters) - Canada's Prime Minister Justin Trudeau will kick off what is likely to be the last Liberal Party convention before the next election on Thursday, and though fatigue with his government has deepened there is little question that he is fully in command of his party.Trudeau will seek to rally some 3,500 Liberal members from across the country at 8 p.m. ET (2400 GMT) after 7 1/2 years as head of government and as much as two more years before the next vote, though most political analysts expect an election some time next year after the economy emerges from an expected slump.Trudeau's main rival, Conservative leader Pierre Poilievre, became leader of his party last year and since then has often led in polls as he systematically attacks both the government and its leader, recently for failing to head off the country's biggest strike in history.Some 57% of Canadians disapprove of Trudeau, compared to an approval rating of 37%, his lowest approval rating since September 2021, amid high inflation and a housing shortage, according to a March survey by the Angus Reid Institute.Though some cabinet members and former central banker Mark Carney appear to have ambitions to lead the party after Trudeau, no one has come out publicly against him.",
        "\"Trudeau is the party brand, for better or worse,\" said Shachi Kurl, president of Angus Reid research group.Recently there has been a seemingly constant drip of damaging news - like the federal workers' strike and allegations that the government took too lightly evidence of Chinese election meddling - that make Trudeau look vulnerable.Some 35,000 Canada Revenue Agency workers are still on strike and plan to picket outside the convention hall when Trudeau speaks on Thursday evening. In the first quarter, Conservatives clobbered the Liberals in fund raising, pulling in C$8.3 million ($6.1 million) versus C$3.6 million.'BROKEN'\"After eight years of Trudeau, everything feels broken,\" Poilievre has said repeatedly on social media and in parliament.The message resonates, said Garry Keller, a former senior Conservative Party staffer who is now vice president at public affairs consultancy Strategy Corp.\"It's an effective message for governments that get long in the teeth,\" he said. \"They start wearing things that may not even be their own fault.\"An agreement the Liberals struck to gain the support of the left-leaning New Democrats in parliament means Trudeau's minority government could last until the fall of 2025, unless Trudeau calls an election earlier.While many polls show the Conservatives now leading the Liberals nationally, Poilievre so far has failed to make inroads in large cities key to winning control of parliament, and he is attracting fewer young people, especially women, said Kurl.",
        "Conservatives would win 35% of the vote compared to 29% for the Liberals, according to the Angus Reid poll. But in Montreal, the Liberals lead 38% to 15%, and in the suburbs of Toronto the Liberals are ahead 40% to 34%, Angus Reid said.\"There's a lot of voter fatigue, even among Liberal voters,\" said Darrell Bricker, CEO of pollster Ipsos Public Affairs. \"But it doesn't seem like Poilievre is really threatening (Trudeau) yet.\" ($1 = 1.3624 Canadian dollars) (Reporting by Steve Scherer; Editing by Josie Kao)"
    ]
}