{
    "articleURL": "/tvshowbiz/article-12059759/Jane-Fonda-Diane-Keaton-Mary-Steenburgen-Candice-Bergen-arrive-NBC-Studios-NYC.html",
    "content": [
        "Jane Fonda, Diane Keaton, Mary Steenburgen and Candice Bergen's new film Book Club: The Next Chapter is set to be released on Friday, May 12.",
        "The stars were seen arriving to NBC Studios in New York City on Monday morning during their whirlwind promotional tour for the film.Jane, 85, looked incredible in an olive pantsuit, adding white slip-on shoes and a quilted bag.Diane, 77, cut a chic figure in a black turtleneck with matching slacks, while holding her hat in one hand.Mary Steenburgen, 70, stunned in a green and white flower frock with a cinched waist, adding white boots.",
        "Candice, 76, donned a blue top with black slacks, adding an orange jacket on top to round out of her look.Book Club: The Next Chapter is a sequel to the hit film Book Club, which was released in 2018.Director Bill Holderman returns for the sequel; he co-wrote the sequel with Erin Simms. Book Club was Bill's directorial debut; he also co-wrote the original film with Erin.The original film centered around the four stars as they read the steam book Fifty Shades of Grey. Book Club: The Next Chapter is about the ladies as they head to Italy for a girls trip. In the group's interview with Savannah Guthrie, Candace claimed credit for including Italy in the plot. ",
        "'Others arranged it,' the Oscar winner explained,' and we had wonderful time.'Mary said she had the most fun while shooting the project.",
        "'I was the one with a husband there, and my ancient 17-and-a-half year old dog, Arthur, 'Arturo,' in Rome,' she said.The women have created a lasting friendship through the films and the experience lead Mary to write lyrics for the song over the closing credits and all four lent their voices to the track.'It's a love song to them,' she explained.Jane, Candace and Mary later skedaddled over to the Sirius XM studios where they spoke with Andy Cohen for his radio show, Radio Andy. The host looked dapper in a charcoal gray suit with a blue shirt and green tie.  ",
        "Jane said in a recent interview that she is the 'happiest' she's ever been - at age 85.The star spoke to People magazine about the experience of aging as well as how she has faced adversity in her life.'There's been tragedy and hard things in my life. But I've never succumbed to them. I've been resilient all  my life,' she told the outlet. On getting older: 'A bad thing happens, and you think, \"Well, that's happened before and I'm fine. I'll get over it.\" You know what's important. I spent a lot of time like a canoe with no paddle being carried in the current. As I got older. I learned I'm going to put an oar in the water and steer,' Jane said. "
    ]
}