{
    "articleURL": "/sport/football/article-12049915/Italian-press-hail-Napolis-return-PARADISE-ending-33-year-wait-Serie-title.html",
    "content": [
        "Napoli came from behind to draw 1-1 with Udinese and seal the Serie A titleGoalscoring hero Victor Osimhen featured heavily across the Italian front pagesNapoli and Udinese fans fight ON THE PITCH with belts being used as weapons Napoli ended their 33-year wait for a Serie A title by coming from behind to draw 1-1 at Udinese on Thursday night. ",
        "Victor Osimhen scored the goal which sealed the Scudetto and maintained his lead at the top of the Golden Boot standings, sparking scenes of jubilation as well as violence in Udine.And the Italian press are lauding Luciano Spalletti's side, who have been perched at the Serie A summit for most of the season, after confirmation of what many had already anticipated would be a historic triumph finally came on Thursday. Napoli's last Scudetto came all the way back in the Diego Maradona era - whose likeness can be found emblazoned across the southern Italian city - with a number of fans wearing shirts with his name on the back. Tuttosport were quick to invoke the most legendary figure in the club's history, who passed away in November 2020 at the age of 60, with the headline: 'Are you watching, Maradona!' next to a picture of goalscorer Osimhen.",
        "Osimhen's strike was his 22nd in the league - surpassing Samuel Eto'o's 12-year record for the most goals scored by an African player in the Italian top-flight. By referencing Maradona, Tuttosport may well be suggesting that the Nigerian forward has joined him in Napoli folklore, although he still has some way to go to match the Argentine's legacy. Unsurprisingly given his impact this term, Osimhen featured on the majority of the front pages on Friday morning in Italy. ",
        "Corriere dello Sport ran the headline 'Napoli champions - bow down!' with a Maradona flag visible in the background, below which can be read: '33 years after a Scudetto that has no equal, it has been won by a squad of untouchables'.While Osimhen has starred throughout, several members of Napoli's squad asserted themselves on the European stage, such as Kvicha Kvaratskhelia, Kim Min-jae and Eljif Elmas, and will surely attract the interest of other leading clubs.Italian daily Quotidiano Sportivo ran the headline 'Napoli's gold has three colours' along with a graphic of the country's flag, seemingly claiming their victory as a triumph for the whole nation - despite the historic rivalry between Italy's southern and northern cities.Napoli hero Maradona infamously called on the support of Naples at the 1990 World Cup hosted in Italy, saying: 'The Neapolitans are being asked to be Italians for one night, while the other 364 days of the year they get called (an Italian slur roughly translated as peasants),' highlighting the tension between the two regions. ",
        "La Gazzetta dello Sport published a photo of the club's jubilant fans celebrating their historic win beneath the headline 'Napoli in paradise', as well as a photoshopped image of Maradona embracing Osimhen. It serves as another reminder that Napoli fans have another title-winning hero in this new-look side that has dominated the Italian league to win with five games to play, while sitting 16 points clear at the top of the table. ",
        "However, not all Italian news outlets recognised a historic evening for Napoli, with Roman publication Il Romanista instead running an image of Jose Mourinho with the headline 'Inter are ours'.Roma are set to take on the Nerazzurri on Saturday evening in the battle for a Champions League spot, with no mention of Napoli's Scudetto success coming on the front page.  "
    ]
}