{
    "articleURL": "/wires/afp/article-12055607/Hollywood-strikes-inflamed-claim-AI-writers-jobs.html",
    "content": [
        "The Hollywood writers' strike broke out this week over pay, but the refusal of studios like Netflix and Disney to rule out artificial intelligence replacing human scribes in the future has only fueled anger and fear on the picket lines.",
        "With their rapidly advancing ability to eerily mimic human conversation, AI programs like ChatGPT have spooked many industries recently. The White House this week summoned Big Tech to discuss the potential risks.As part of the weeks-long talks with studios and streamers that collapsed Monday, the Writers Guild of America asked for binding agreements to regulate the use of AI.Under the proposals, nothing written by AI can be considered \"literary\" or \"source\" material -- industry terms that decide who gets royalties -- and scripts written by WGA members cannot \"be used to train AI.\"But according to the WGA, studios \"rejected our proposal,\" and countered with an offer merely to meet once a year to \"discuss advancements in technology.\"",
        "\"It's nice for them to offer to have a meeting about how they're exploiting it against us!\" joked WGA negotiating committee member Eric Heisserer, who wrote Netflix hit film \"Bird Box.\"\"Art cannot be created by a machine. You lose the heart and soul of the story... I mean, the first word is 'artificial,'\" he told AFP on the picket line outside the streaming giant's Hollywood HQ Friday.While writers already know this, the danger is that \"we have to watch tech companies destroy the business in an attempt to find out for themselves,\" he said.",
        "- 'Not just scripts' -While few television and film writers who spoke to AFP on the picket lines believe their work could be done by computers, the apparent conviction of studios and streamers that it can has been an extra slap in the face.",
        "They fear that belt-tightening executives in Hollywood, where Silicon Valley companies have upended many traditional practices such as long-term contracts for writers, may seek to cut costs further by getting computers to write their next hit shows.Comments by top Hollywood executives at this week's Milken Institute Global Conference in Beverly Hills will have done nothing to quell writers' concerns.\"In the next three years, you're going to see a movie that was written by AI made... a good one,\" said movie producer Todd Lieberman.\"Not just scripts. Editing, all of it... storyboarding a movie, anything,\" added Fox entertainment CEO Rob Wade.\"AI in the future, maybe not next year or the year after, but if we're talking 10 years? AI is going to be able to do absolutely all of these things.\"",
        "The studios' own account of the breakdown in WGA talks offered a more nuanced take.In a briefing note shared with AFP, they said writers do not in fact want to outlaw AI, and appear happy to use it \"as part of their creative process\" -- so long as it does not affect their pay.",
        "That scenario \"requires a lot more discussion, which we've committed to doing,\" the studios said.- 'Guardrails' -For Leila Cohan, a 39-year-old writer on Netflix smash hit \"Bridgerton,\" the only usefulness of AI for writers is limited to \"busy work\" such as coming up with names for characters.",
        "But she predicted that studios \"could start making incredibly bad first drafts with AI and then hiring writers to do a rewrite.\"\"I think that's certainly a very scary possibility... it's very smart that we're addressing this now,\" she said.Indeed, the last Hollywood strike in 2007-08 won writers the right to be paid for online viewing of their shows or films -- highly prescient, at a time when streaming was in its infancy.Back then, Netflix had barely started online viewing, and the likes of Disney+ and Apple TV+ were more than a decade away.Even for sci-fi writer Ben Ripley, who believes there is no role whatsoever for AI in writing, introducing legislation now \"to put guardrails up\" is \"very necessary.\"Writers \"have to be original,\" he said. \"Artificial intelligence is the antithesis of originality.\""
    ]
}