{
    "articleURL": "/news/article-12041077/Nigel-Farage-rubs-shoulders-Donald-Trump-Turnberry-one-one-interview.html",
    "content": [
        "The ex-president warmly greeted the former UKIP leader with a firm handshakeThe two appeared to meet in Trump's Turnberry hotel on Scotland's west coastDonald Trump has ventured onto his Scottish golf course again after last night being filmed rubbing shoulders with Nigel Farage ahead of his sit-down interview with the GB News presenter this evening.",
        "The former president - wearing his trademark red 'Make America Great Again' cap - teed-off again at his Turnberry golf course in South Ayrshire today as his short trip to Scotland nears to an end.Last night, Trump was seen greeting  former UKIP leader Nigel Farage with a firm handshake as the two political friends reunited.Trump, dressed in his golfing attire, laughed and joked with a suited Farage ahead of the GB News interview this evening where the two are set to discuss 'court cases in America', the Coronation, and the state of Scottish politics.Trump's golfing trip across the pond to Turnberry came as he opened a new course on the Scottish east coast which he named after his late mother. It came as Scottish lawmakers are also revisiting a probe into how he was able to purchase the two resorts.Back home, Trump is also facing mounting legal troubles after being indicted by a Manhattan district court for his alleged role in the payment of 'hush money' to a porn star during the 2016 presidential election, as well as an ongoing New York City rape case.",
        "Trump and Farage were all smiles as the two reunited on the picturesque west coast of Scotland.The two, who appear to have struck up a tight friendship through their political support for one another, had a brief discussion, which could not be heard, before opening up to the rest of the room. ",
        "'Does everyone know Nigel?' Trump asked, addressing what seemed to be a buzzing packed out chandelier-lit hall.'I'm doing a little minor interview tomorrow,' the embattled ex-president joked - suggesting he may use the opportunity to divulge his thoughts on several key issues amid his run for the Republican nomination in 2024.A photographer then steps in and gestures as if to ask if he could take an image of the two men together.Farage has been a very vocal supporter of the former president, appearing several times at his rallies and defending many of the controversies that have surrounded the businessman-turned-politician.This evening's interview is part of Trump's brief visit to Scotland which also saw him open a course at a second golf resort in Aberdeenshire on Monday.Trump landed in Aberdeen on Monday morning, saying ahead of his arrival on his platform Truth Social that he was visiting Scotland to cut the ribbon on the 'spectacular' golf course.He and his son Eric arrived on 'Trump Force Once' - his private Boeing 757-200 - where they were greeted by two pipers, a red carpet, and a 10-vehicle motorcade.Trump's legal woes have grown significantly since his last visit to Scotland back in 2018 when he was still president.",
        "Earlier this year he was indicted by a Manhattan district court over his alleged involvement in the payment of hush money to porn star Stormy Daniels, as well as accusations of election interference and illegal retention of classified White House documents.",
        "Trump is also the subject of an ongoing  New York City rape case, which on Monday saw Judge Lewis Kaplan throw out a request from Trump's lawyer to declare a mistrial based on 'unfair and prejudicial rulings'.The case has been brought by E. Jean Carroll who says Trump assaulted her between 1995 and 1996 in upmarket New York department store Bergdorf Goodman.Carroll sued Trump for battery and defamation last November over the alleged rape and his Tweets afterwards calling her a liar.Other women have also come forward as part of the case to make allegations against the former president.A retired stockbroker on Tuesday told the court how Trump groped her and tried to kiss her on a plane in full view of another passenger.Jessica Leeds, 81, said that it felt like the former president had a 'zillion hands' when he put his hands on her breasts in the first class seat in 1979.Another passenger on the plane had 'eyes like saucers', she said, as he watched Trump put his hand up her skirt before she fought him off and walked away to another seat.",
        "The testimony came in the second week of magazine writer This is the second week of magazine writer E. Jean Carroll's civil lawsuit against Trump.Trump's attorney confirmed today that he will not be attending his rape trial in New York and instead a video deposition will be shown.",
        "Trump's arrival in Scotland this week as seen the country's politicians urge new First Minister Humza Yousaf to look again at seeking a so-called 'McMafia' order to probe how Trump was able to buy the resorts in Aberdeenshire and Ayrshire.Trump's company purchased Turnberry in Ayrshire in 2014 from a Dubai-based company for an undisclosed fee. Despite still being in the development phase, he purchased the Menie, Aberdeenshire resort back in 2006.The Scottish government previously decided not to pursue an Unexplained Wealth Order in relation to the purchase of the two resorts in 2021.Yousaf, Scotland's justice secretary at the time, told the country's parliament at the time that it would be an abuse of power to launch such a probe.According to The Herald, Trump - who in most other projects he bankrolls takes out large loans in order to finance them - instead spent more than £300 million in cash.Neither of his two Scottish clubs turn a profit, the newspaper reports."
    ]
}