{
    "articleURL": "/wires/reuters/article-12038733/NBA-Dimmed-Suns-hope-recapture-fire-home-against-Nuggets.html",
    "content": [
        "May 2 (Reuters) - The Phoenix Suns return to the Valley with the grim task of turning around their Western Conference semi-final campaign against the Denver Nuggets on Friday, with star point guard Chris Paul's future uncertain.",
        "After the Nuggets humbled them 125-107 in Saturday's opener, the Suns improved their defense but little else in Monday's Game 2, losing 97-87.\"They only scored 97 points - our defense was much better tonight. We just couldn't put the ball in the hole,\" said head coach Monty Williams.\"You've got to believe that it's going to come our way here soon. We've got to go home and take care of business. That's where we are right now.\"They will have the benefit of a home crowd for their next two meetings but perhaps not Paul, who led in assists this season and left Monday's defeat in the third quarter with an apparent groin injury.\"We're not quite sure what it is right now,\" Williams said on Monday.CURRY VS. LEBRONElsewhere in the playoffs picture, a star-studded California clash between LeBron James' Los Angeles Lakers and defending champions Golden State Warriors kicks off in San Francisco on Tuesday.The renewed rivalry between James and Golden State sharpshooter Steph Curry is expected to deliver huge ratings, as the NBA said on Tuesday that the Warriors Game 7 win over the Sacramento Kings was the most-watched first-round game in 24 years.The Philadelphia 76ers pulled off an improbable Game 1 win on the road over the Boston Celtics in their Eastern Conference semi-final opener on Monday, despite having six-time All-Star Joel Embiid sitting on the sidelines with an injury.",
        "Philadelphia star James Harden equalled his career playoff high 45 points on Monday and will need another high-caliber performance for Game 2 in Boston on Wednesday with Embiid's future unclear.Philadelphia head coach Doc Rivers told reporters their ability to win without Embiid was a testament to his players' preparedness.\"We've had practice at it, number one, and we really believe. James has missed games - we win. Joel has missed games - we win,\" Rivers told reporters.\"That's the difference between this year's team and last year's team. We have a bunch of street fighters.\" (Reporting by Amy Tennery in New York Editing by Christian Radnedge)"
    ]
}