{
    "articleURL": "/news/article-12056055/Boozy-bank-holiday-revellers-celebrate-three-day-Coronation-weekend-pack-bars-clubs.html",
    "content": [
        "Royal fans were seen dressed in Unions Flags and themed costumes last night Read more: Piers Morgan slams Liverpool fans who booed God Save the King Boozy royal fans packed out bars and clubs last night as they celebrated King Charles's big day. ",
        "An army of revellers swathed in Union Flags and themed costumes were seen out and about across the country as they make the most of the three day Coronation weekend. Thousands braved heavy rain during the procession yesterday afternoon before taking to the streets to fill up bars and drinking venues. One woman in Birmingham city centre posed for a photo while dressed head to toe in a Union Jack costume, featuring a bright corset, blue wig and top hat. Drunk friends were pictured celebrating and waving flags while others covered their heads with plastic bags to shelter from the drizzle. ",
        "Men were seen drinking in a busy club while covering their faces with masks of the newly crowned king. ",
        "One man dressed in a cheerleader costume was pictured after falling over onto the pavement as his friends tried to pull him back up. A woman dressed in a cowboy outfit was captured leaping into the air surrounded by a large group of friends. Others smiled and posed with props to celebrate the historic day.  All week the road leading to Buckingham Palace was cleared as royal fans lined the route with tents and camping chairs to catch a glimpse of their new king. People camping along The Mall could be heard shouting 'God Save the King' as senior figures of the monarchy - Charles, William and Kate - arrived to shake hands with well-wishers on Friday. ",
        "Fans who had been sleeping on the pavement were left blown away by the royal event, despite being showered by heavy downpours throughout the week. Huge crowds in London could be seen drinking and gathering in the rain to cheer on the arrival of Charles and Camilla. "
    ]
}