{
    "articleURL": "/sport/cricket/article-12050697/Ashes-Steve-Smith-dismissed-30-lowkey-County-Championship-bow.html",
    "content": [
        "Steve Smith made a lowkey start to his County Championship career The 33-year-old Australian made 30 runs off 57 balls for Sussex on Friday He was made to alter his helmet as it didn't comply with English regulations There was an exaggerated trademark leave first ball, a couple of sumptuous shots, the usual fidgets and mannerisms and even an equipment malfunction before Steve Smith fell for 30 in an eventful first Championship innings for Sussex.",
        "Australia’s star batsman packed plenty into his 80-minute stay at New Road today before falling to the impressive pace of Worcestershire’s Josh Tongue after facing 57 balls and hitting five of them for four.Most unusually, there was a five-minute delay, greeted with slow hand-clapping by the New Road faithful, when Smith was told by umpires Peter Hartley and Chris Watts he needed a stem guard added to the back of his helmet as he was contravening ECB regulations.Not quite Sandpapergate, admittedly, but still a bit of a surprise as Smith had vowed to wear the neck guard, surprisingly not mandatory in Australia, after he was hit on the back of the head by Jofra Archer and suffered concussion in the 2019 Lord’s Test.Whether Smith’s famous fastidiousness was disturbed by the demand is unclear but he suffered a few anxious moments, notably against the 25-year-old Tongue, regarded highly by the England selectors and now claiming his most notable victim to date.",
        "Tongue's progress has been held up by injuries but he featured prominently for England Lions in Sri Lanka last winter, taking eight wickets in the ‘Test’, and is described as being like a new signing this year by Worcestershire coach Alan Richardson.Here Tongue came close to dismissing Smith lbw for 15 after the controversial Sussex signing had entered the second day fray in the second over when Worcestershire took two early wickets to leave the visitors 67 for three in reply to 264 all out.",
        "Smith had taken 13 balls to get off the mark, by now with his adjusted helmet, when he cut a short wide long hop from Ben Gibbon for four but he was in his stride by the time he hit Tongue for two boundaries through the leg-side.Umpire Watts made an excellent decision when he adjudged Smith not out but Tongue got his man to one that may have been a little high – the Australian would almost certainly have called on DRS had this been a Test – after a stand of 61 with his captain Cheteshwar Pujara that represented a high-quality treat for a county audience.",
        "But it was a decent start for a batsman who will play in three games for Sussex before joining up with Australia to play against Pujara and India in the World Test Championship final next month and then the Ashes.Sussex coach Paul Farbrace reports that Smith has made an excellent impression so far at Hove, throwing himself wholeheartedly into the dressing room and spending plenty of time talking and helping the many young talented players at the club.That, of course, is one of the motivations for Sussex signing him in the first place even though the red-ball practice in English conditions must be a help to him ahead of the Ashes even for such an experienced player with four tours of England behind him.",
        "The debate over whether the Poms are lending an Ashes hand to the old enemy by employing Smith and other prominent Australians in an Ashes summer will go on but for now Josh Tongue in particular will be very glad he came."
    ]
}