{
    "articleURL": "/wires/ap/article-12038011/Scooby-doobie-dont-Discarded-joints-pose-hazards-dogs.html",
    "content": [
        "NEW YORK (AP) - Bondi, an 8-month-old toy poodle, had just returned from a walk when he began stumbling. His head wobbled and soon he could barely stand, so his owner, Colleen Briggs, rushed him to the vet.",
        "The good doctor quickly made a diagnosis: Bondi was stoned.On his walk, a sniff must have led Bondi to a discarded joint, which he ate.\"He was just doing his usual - exploring everything, sniffing everything,\" said Briggs, who began to notice the pot shops sprouting up around New York City, the frequent whiffs of marijuana while circling her Manhattan neighborhood and the unfinished joints now littering sidewalks.In places like New York City, where the first legal recreational pot dispensary opened last year, users can smoke it in the open. As a result, more dogs are coming across - and eating - discarded joints and edibles, prompting alarm among veterinarians and pet owners who blame the steep rise in poisonings on smokers oblivious to the harm they can do by littering.Marijuana poisonings, which are almost never fatal, were once rare among pets, even when medical dispensaries started opening, according to Dr. Amy Attas, a New York City veterinarian. Until recently, many occurred at home, when pets got into their owners' stashes.",
        "\"The reason we´re seeing so many cases is that people are using marijuana on the street and then discarding the unwanted ends of their joints,\" Attas said. \"And that´s a real problem because dogs will eat those.\"",
        "In the first three months of the year, she had already seen six cases, which is about the same number she's treated over the past three decades. Multiply that by the number of vets working in New York City, she said, and the result underscores the widening problem.The American Society for the Prevention of Cruelty to Animals said cases are rising nationwide. Last year, there was an 11% increase from the roughly 6,200 cases reported in 2021, and over the past five years, there has been a 300% increase.\"To me, it is unbelievable how prevalent this now is,\" said Attas.Twenty-one states have legalized the recreational use of cannabis, and in large urban areas like New York, there's no escaping the whiff of pot in public.In many cases, owners are unaware that their dogs have eaten a leftover joint until they begin showing signs of toxicity. Even then, owners might not understand what is ailing their pets.Sue Scott was in a panic when her 9-month-old fawn pug, Circe, collapsed after a recent walk. Circe's paws splayed out on the floor, her head shook to-and-fro and she drooled.\"A million things were running through my head,\" said Scott, 68. Marijuana poisoning was not among them. \"I would never had thought that,\" she said.",
        "Scott made a video call to Dr. Attas, who said Circe was showing all the signs of being high. She now keeps Circe on a shorter leash, mindful of where she pokes her nose.\"I don´t know if you know pugs - they´re constantly on the lookout for their next morsel,\" said Scott, who has owned four other pugs, none of whom ever returned home stoned. \"But sometimes it's pretty tough to control them because they are so fast. They'll just dart at something.\"Although dogs rarely die from marijuana poisoning, treatment can be expensive, sometimes requiring a trip to the animal emergency room, a stomach pump and intravenous fluids.The stress on the patient and its owner is also enormous.Bondi has been poisoned three times, the first time last fall, said his owner, Briggs.Even as Briggs grew more vigilant when walking her pup, she acknowledged that she must have gotten distracted when Bondi became sick a second time. That time, she let Bondi ride out his high.\"Walking him ... it's just a really intense situation. So I´m always looking on the ground, and it´s just everywhere now,\" she said of the spent joints that she and Bondi come across on walks.\"One time,\" Briggs said, \"I caught him and grabbed it out of his mouth.\""
    ]
}