{
    "articleURL": "/news/article-12041917/Kremlin-says-Ukraine-attempted-ASSASSINATION-Putin.html",
    "content": [
        "Russia accused Kyiv on Wednesday of attempting a drone strike on the KremlinIt said two drones used in the alleged attack were taken down by defencesRussia has accused Ukraine of trying to assassinate Vladimir Putin in a double drone strike on the Kremlin overnight. ",
        "Moscow said it had foiled the attempt and called it 'a planned terrorist act and an attempt on the life of the President of the Russian Federation'. It has prompted demands from Russian lawmakers for the Kyiv government to be 'destroyed'.Two drones were used in the alleged attack, Moscow claimed, with nighttime footage showing fireballs erupting above the roof of the government complex.The accusation was followed by a chilling warning from a senior Russian official, who called on Moscow to escalate Putin's war and use 'weapons capable of stopping and destroying the Kyiv terrorist regime'.But Ukraine quickly responded to the claim, the most dramatic Russia has levelled against Kyiv since invading its neighbour more than 14 months ago, saying it had 'nothing to do' with the alleged attack. ",
        "Zelensky on Wednesday denied Moscow's claims that Kyiv had attempted to assassinate Putin, after Russia said the two drones were shot down.'We didn't attack Putin. We leave it to the tribunal. We fight on our territory, we are defending our villages and cities,' Ukrainian president Volodymyr Zelensky told reporters at a joint press conference with Nordic leaders in Helsinki.His senior aide said earlier: 'We have no information about the so-called night attacks on the Kremlin. But, as President Zelensky has repeatedly stated, Ukraine directs all available forces and means to liberate its own territories, and not to attack others.' ",
        "One theory could be that the attack is a cynical false flag operation by Russia seeking to unite people behind the under-pressure president, amid setbacks and a huge toll caused by unleashing a disastrous war on Ukraine.The timing is certainly interesting, coming less than a week before the planned massive annual military parade in Red Square marking the defeat of Hitler - for which Putin has no victories to boast of in his on-going assault across the border. Ukrainian presidential adviser Mykhailo Podolyak said the accusation that Kyiv was behind the attack, as well as Russia's arrest of alleged Ukrainian saboteurs, could indicate Moscow was preparing for a large-scale 'terrorist' attack of its own against Ukraine in the coming days.Podolyak added that 'Ukraine does not attack the Kremlin because, firstly, that does not solve any military aims'.But soon after the accusation, officials called for an escalation in the conflict.The influential speaker of Russia's parliament, Vyacheslav Volodin, demanded the use of 'weapons capable of stopping and destroying the Kyiv terrorist regime' in response to an alleged Ukrainian drone attack on the Kremlin on Wednesday.In a statement posted on Telegram, Volodin said Russia should not negotiate with Zelensky after the purported attack. Russia has said it is open to negotiations, while making clear it would only enter talks on its own terms.",
        "Meanwhile, Kyiv and some central and eastern Ukrainian regions announced air alerts on Wednesday afternoon, warning of possible impending attacks, while the United States said it was unable to verify the Russian reports.",
        "US Secretary of State Antony Blinken said he is highly skeptical of any allegations made by Russia. 'I've seen the reports. I cannot validate them, we simply don't know,' Blinken said at an event in Washington.'I would take anything coming out of the Kremlin with a very large shaker of salt.'",
        "The allegation of the failed assassination attempt was made by Kremlin officials today and reported by Russian news agencies hours after the strike last night.The Kremlin said two drones had been used in the alleged attempt, but that they were disabled by Russian defences. The first was at 2:27am hitting the Senate Palace, the second at 2:43am, said TV Centre channel. The Kremlin did not present any evidence to back up its account.Extraordinary video posted by Baza, a Telegram channel with links to Russia's law enforcement agencies, showed a flying object approaching the dome of a Kremlin building overlooking Red Square and exploding in a burst of light just before reaching it. Seats could be seen set up for the Victory Day parade.Another video posted on a neighbourhood internet group appeared to show a plume of smoke over Kremlin spires filmed from across the Moskva River.",
        "The second strike was also captured on video, which showed another fireball erupt from the roof of the Kremlin. In one the clips, two people were seen climbing up the dome at the time of the strike. It was unclear who they were or why they were on the dome. 'Two unmanned vehicles were aimed at the Kremlin... the devices were put out of action,' Moscow's statement read. In a chilling threat, Russia made clear it reserved the right to respond to the alleged drone strike.Putin was not injured, and there was no material damage to the Kremlin buildings, the Kremlin said, adding that Putin continues to work normally.'The Kremlin has assessed these actions as a planned terrorist act and an assassination attempt on the president on the eve of Victory Day, the May 9 Parade,' RIA reported. It noted Putin had not changed his schedule.'The Russian side reserves the right to take retaliatory measures where and when it sees fit,' the Kremlin's statement added, suggesting it planned to retaliate.The Kremlin said fragments of the drones had been scattered on the territory, as Moscow's mayor announced a ban on unauthorised drone flights over the city.Telegram channels are sharing what appear to be videos of anti-aircraft fire over the Kremlin, while there were reports of a noise like a 'thunderclap' in Moscow. ",
        "Other clips have shown a flash of what is said to be the drone as it flies in over Moscow and explodes over one of the vast Kremlin buildings.Residents of Stalinist House on the Embankment 'saw sparks in the sky and people with flashlights near the Kremlin wall after the claps'.RIA state news agency reported: 'As a result of the terrorist act, the president was not injured. The schedule of his work has not changed and will continue as usual.'There were no casualties during the fall and scattering of UAV fragments on the territory of the Kremlin.'The purported drone attack would be a significant escalation in the 14-month conflict, with Ukraine taking the war to the heart of Russian power.Phillips O'Brien, professor of strategic studies at the University of St. Andrews, said, 'It certainly wasn't an attempt to assassinate Putin, because he doesn't sleep in the roof and he probably never sleeps in the Kremlin.'He added it was too soon to prove or disprove whether it was a Russian attempt 'either to make Ukraine look reckless or to buck up Russian public opinion' or if it was a Ukrainian operation to embarrass Russia.Russia has massively increased air defences in Moscow and around Putin's palaces and residences. RIA said Putin had not been in the Kremlin at the time, and was working on Wednesday at his Novo Ogaryovo residence outside Moscow. ",
        "He said in March that he is living in his apartment more often. State media 360TV reported Putin was not in the Kremlin at the time.In March, Putin said: 'I have an apartment here [in the Kremlin], where I spend a lot of time lately. I work here and spend a lot of nights often.'He met Chinese president Xi in the flat 'sitting by the fireplace and drinking tea, [and] talked about everything slowly'.Dmitry Peskov confirmed Putin was working as normal today at his official residence outside the city.",
        "Russian pro-war analysts expressed shock that drones could penetrate defences to the Kremlin, the official residence of the Russian president.Telegram channel VChK-OGPU stated that if Putin had been at the Kremlin, his spokesman would not have admitted it. Russian pro-war reporter Alexander Kots called for retaliation against Ukraine's leadership. 'They must be destroyed,' he said.'We should not hit the centres, but the people who make decisions. Methodically, systematically and ruthlessly. 'The enemy is doing this systematically on our territory.'Retired colonel and military expert Anatoly Matviychuk said the alleged bid to assassinate Putin will lead to a massive Russian response.'I think that we will strike at the decision-making centre [of Ukraine] like… the presidential palace in Kyiv.'He claimed the US and Britain would have approved the drone strike on the Kremlin.'I think this attack was made on the advice of our Anglo-Saxon \"friends\" in order to test our government's response.'How will we react - let's wait a couple more hours... Either there will be a political statement or there will be physical actions by our fighters. They [the Armed Forces of Ukraine] have already crossed not even the red line but the crimson line.'Pro-war reporter Sergey Karnaukhov said NATO planes were active over the Black Sea in the aftermath of the 'Ukrainian drone strike' on the Kremlin.The Russian outrage comes despite Putin's special forces attempting to assassinate Ukraine's president Zelensky in the first days of his invasion.Gun battles broke out on the streets of Kyiv, and the Russian saboteurs - who were understood to have been ordered to capture or kill Ukraine's first family - were repelled from the capital, before Russia retreated fully a month later.",
        "The attempted attack in Moscow comes ahead of a huge military parade scheduled against a backdrop of the Kremlin on Red Square on 9 May, marking Victory Day - the Soviet defeat of Hitler. The videos from the scene showed the branding of the event.Russia's Victory Day is seen as the biggest day in Putin's calendar, and he has no military victories to boast about to his people despite his desperate attempts to seize the eastern city of Bakhmut - which Ukraine has defended for months.There may be a calculation that such an attack will bring sceptical Russians behind Putin once more. Putin's spokesman Dmitry Peskov said today the parade would go ahead despite the drone attack.",
        "The drone strike in Moscow last night came a week after it was claimed that Ukrainian secret service agents had tried to assassinate Putin with a kamikaze drone carrying explosives as he was due to visit a newly built industrial site outside Moscow.The drone failed after it crashed a few miles short of their target, it was claimed.The Ukrainian forces reportedly launched the UJ-22 drone, laden with 17 kilograms of C4 plastic explosives, from Ukraine on Sunday, April 23.But before the deadly drone reached the Rudnevo industrial park on its alleged mission to take out the Russian despot, it crashed mere miles away from the site.German tabloid Bild cited a tweet by Ukrainian activist Yuriy Romanenko, who claims to have close ties to Kyiv's intelligence services, alleging Ukrainian secret service agents had received 'information' about Putin's apparent trip.They decided to launch the deadly drone in an attempt to assassinate the president.He claimed that a kamikaze drone that had crashed in Voroskogo village, 12 miles east of the Rudnevo industrial park, was the one that Ukrainian forces had launched as part of the assassination plot.The news of the alleged assassination attempt came as Ukraine prepared for a fresh offensive against Russian troops that has been months in planning.In possible signs that preparations are being stepped up, the frontline city of Kherson in southern Ukraine announced a long curfew for residents and sabotage acts behind Russian lines intensified.Kherson, which was re-taken by Ukrainian troops in November, will be under curfew from Friday evening until Monday morning.Regional officials said this was 'for law enforcement officers to do their job', but similar long curfews have also been used in the past for troop and arms movements.'During these 58 hours, it is forbidden to move on the streets of the city. The city will also be closed for entry and exit,' the head of Kherson's regional military administration, Oleksandr Prokudin, said on Telegram.He advised residents to stock up on food and medicine and said people could go for short walks near their houses or visit shops but should carry identity documents with them at all times.The curfew announcement came as officials said three people were killed and five injured in a Russian strike on Kherson's only working hypermarket on Wednesday.Kherson was captured by Russian troops last year in the first days of the invasion and remained under Russian occupation until November 2022.After a sustained campaign of sabotage attacks behind Russian lines, Russian forces withdrew from the city.They crossed to the eastern side of the Dnipro River which now delineates part of the front line in southern Ukraine.The curfew announcement came as officials in Russia said they were dealing with a major fire at a fuel depot close to the bridge to Russian-annexed Crimea - the second such incident in just a few days.A source in the emergency services was quoted by TASS news agency as saying that the fire had been caused by a drone.An explosion also caused a freight train to derail in a southern Russian region bordering Ukraine on Tuesday, also the second such incident in just two days.",
        "Ukraine says it has been preparing for months for a counteroffensive aimed at repelling Russian forces from the territory they currently hold in the east and south.Head of pro-Putin Wagner private army Yevgeny Prigozhin said the Ukrainian counteroffensive had begun. There was 'the highest activity' by Ukrainian aviation. Meanwhile in Finland, NATO's newest member, Zelensky was on a surprise visit to take part in a summit with the leaders of the five Nordic nations which have been key providers of military aid.'In order to be in NATO and support alliances to gain support, fundamental diplomatic work must be done. Ukraine is doing it today,' Daria Zarivna, Ukraine's presidential communications adviser, wrote on Telegram."
    ]
}