{
    "articleURL": "/tvshowbiz/article-12053513/Shannen-Doherty-seen-without-wedding-ring-filing-divorce-Kurt-Iswarienko.html",
    "content": [
        "Shannen Doherty was spotted noticeably without her ring in Malibu, California on Thursday afternoon. ",
        "The 52-year-old actress enjoyed a solo shopping trip at the Malibu Lumber Yard and already removed her wedding ring after recently filing for divorce from her husband, Kurt Iswarienko, 48.Two weeks ago, the Beverly Hills, 90210 star pulled the plug on her 11-year marriage and officially filed for separation from the cinematographer.Spotted for the first time since the  split, the Girls Just Want to Have Fun alum put on a casual display for her daytime outing.The Tennessee native sported a light gray sweatshirt teamed with a pair of medium-wash denim jeans.",
        "As Doherty rummaged through her bag for a face mask to cover her face, she juggled a tumbler and her car keys in the other hand.She was seen not wearing any jewelry at all — including her wedding ring.For the shopping trip, she was seen toting around a black duffle bag with olive green straps as well as a light gray shoulder bag with a metal chain strap.On her feet, she opted for comfort with a pair of darker gray New Balance sneakers. The Little House On The Prairie alum appeared to be sporting a makeup-free look to showcase her youthful and radiant beauty.Doherty kept a low profile and shielded her eyes from the sun with a pair of black aviator sunglasses.",
        "She tied up her raven black tresses in a loose ponytail and donned a brown trucker hat. Just last month, she filed for divorce from her estranged husband after being married for over a decade.",
        "And the official paperwork obtained by TMZ revealed that the pair have been separated since January. Through her publicist, Leslie Sloane, Doherty cited the reason for divorce and had alleged that Iswarienko's agent was 'intimately involved' with their divorce. 'Divorce is the last thing Shannen wanted,' her representative told the publication at the time. 'Unfortunately, she felt she was left with no other option.' Doherty and Iswarienko exchanged vows and tied the knot in Malibu in October 2011.Previously, she was married to actor Ashley Hamilton from 1993 to 1994, and her second marriage was with poker player Rick Salomon from 2002 to 2003."
    ]
}