{
    "articleURL": "/wires/reuters/article-12040747/Swedens-Riksbank-says-jump-crown-says-no.html",
    "content": [
        "By Alun John and Harry Robertson",
        "LONDON, May 3 (Reuters) -Sweden's central bank has tried and failed to talk up its currency and is running out of room to raise rates, leaving the crown languishing around its weakest in 14 years against the euro and undermining its efforts to control inflation.It's not going to get much better any time soon. Markets are pricing for more rate hikes from the European Central Bank and others, which are hard for the Riksbank to match due to issues in the housing sector.There is talk about possible official intervention in foreign exchange markets to support the crown, though analysts think it unlikely the Riksbank would resort to this tool in the near term, partly because of its limited reserves.\"We believe in, and want to have, a stronger crown,\" Riksbank Governor Erik Thedeen told reporters last Wednesday after the bank announced a half-point rate hike to 3.50%.\"If that doesn't happen over time, it could have significance for monetary policy because a weaker crown could lead to higher inflation,\" he said.Markets, however, were not listening. The crown weakened as much as 1% that day.More broadly it has lost 14% in value against both the euro and the dollar since late 2021. In recent months, it has held up better against the dollar, but is trading around its weakest since 2008 against the euro.",
        "The problem, analysts say is markets expect more interest rate rises from the ECB, while the Riksbank last week hinted it was nearly done with tightening and two rate-setters voted for a 25 basis point rate increase.Kenneth Broux, senior FX and rates strategist at Societe Generale said this \"dovish dissent\" would mean \"more weakness against the euro, as the rate differential moved in the euro's favour\".Traders currently expect 75 basis points more of tightening from the ECB.Expectations for higher official interest rates typically boost money market and government bond yields, attracting investor cash to a country, which boosts the currency.The gap between key parts of the Swedish and euro zone rate curves narrowed sharply in 2022 and turned in the euro's favour at the start of this year.TOUGH SPOTThe weakening crown is a problem for Sweden. It makes imported goods more expensive, thereby adding to inflation, which is already running at 8.9% year-on-year when volatile energy prices are excluded.\"The krona is not the major factor for elevated inflation, but it does play an important role and obviously it would be beneficial to have a strong exchange rate,\" said Carl Hammer, chief strategist at SEB, using the currency's Swedish name.Hiking rates further would typically support a country's currency, but it's difficult in Sweden because rate rises have already brought long-standing problems with the housing sector to the fore.",
        "The Riksbank expects house prices to bottom out in early 2024 after falling around 19% from a peak in early 2022.\"It's difficult for the Riksbank to be that hawkish,\" said Jan von Gerich, chief analyst at Nordea.\"They have an inflation problem, but they also have a housing market that's already in a weak state, and an economy that is coming down.\"Households in Sweden are more sensitive to rates than those elsewhere, as around 60% of mortgages are on floating rates.That leaves the central bank exploring other options to boost the crown.\"I think they will only hike, at the max, one more time. But I think they then increase (quantitative tightening) and then if that doesn't really help, definitely there will be some sort of verbal intervention on the table,\" said SEB's Hammer.He said the Riksbank directly intervening in markets seemed a way away.Such interventions are rate. Sweden bought crowns in 2001 to strengthen the currency, and sold it in 2021 to replace the borrowed part of its foreign exchange reserve.JPMorgan analysts said the Riksbank's reserves make up less than two days´ worth of daily market volume in dollar/crown and euro/crown trading, potentially limiting the effectiveness of intervention.Nonetheless, SocGen's Broux said intervention was \"on his radar\" as he'd been getting client questions about it.",
        "He said the 11.50 crown-per euro level could be one to watch. It is currently at 11.29.(Reporting by Alun John and Harry Robertson; Editing by Toby Chopra)"
    ]
}