{
    "articleURL": "/news/article-12059553/Jill-wants-Joe-80-ditch-ice-cream-stop-eating-like-child.html",
    "content": [
        "There's a food fight happening at the White HouseJill Biden wants Joe Biden to put down the ice cream and pick up the veggies'He has the tastes of a 5-year-old,' a longtime Biden adviser has said There's a food fight taking place at the White House, according to a new report on Monday, that's pitting Joe Biden's love of junk food against Jill Biden's quest to get him to eat more healthy.",
        "The president is a known lover of ice cream, enjoying the sweet treat every chance he can get. He's also been known to indulge when he's outside of the White House - he had barbecue delivered to Air Force One when he was in Kansas City in December 2021 and ate pizza with the troops when he was in Poland in March 2022.But the first lady is pushing him to eat more fish and veggies, Axios reported, determined to clean up his tendency to eat junk. Jill Biden's health push comes amid questions about Joe Biden's mental and physical fitness as he seeks a second term in office.At 80, he is the oldest president in American history. If he wins a second term, he would be 86 at its conclusion. Biden eats 'like a child,' some aides told the news outlet, with a diet of peanut butter and jelly sandwiches, BLT's, pizza, cookies, spaghetti with butter and red sauce, and ice cream.",
        "Bacon, scrambled egg, and cheese on a croissantChocolate-chip ice creamChocolate-chip cookiesPizzaPeanut butter and JellyKetchup Angel hair pasta with red sauce ",
        "Biden keeps chocolate chip cookies outside the Oval Office for a snack - they're even packaged with the seal of the U.S. President. He handed some out to kids in April when they were visiting for Take Your Child To Work Day.",
        "He also told the kids that he had a 'bacon, scrambled egg, and cheese on a croissant' for breakfast. His preferences are well known.When Chef Edward Lee, a Korean-American chef who's known for infusing traditional American classics with Korean flavors, designed a menu in April for a state dinner for the president of South Korea, he said ice cream was a must.'That was the first thing I was told - ice cream,' he told reporters.He made it dessert - designing a banana split to top off the three course dinner. Jill Biden noted her favorite course of the dinner was the 'first,' which was a crab cake.'Joe's favorite will be the last,' she joked. Jill Biden, who's known to enjoy a glass of wine, eats a lot of grilled chicken or fish. She told Parade magazine in January 2021 that she prefers fresh fruit and vegetables while the president likes ketchup, angel hair pasta with red sauce, and peanut butter and jelly. 'He's pretty much a basic eater,' she said. ",
        "When Joe Biden was vice president, the staff kept the place stocked with vanilla chocolate-chip Häagen-Dazs ice cream, Special K cereal, one bunch of red grapes, sliced cheese, six eggs, sliced bread, one tomato from the garden, and at least two apples on hand at all times, The New York Times reported. ",
        "President Biden doesn't drink alcohol but he does like orange Gatorade. 'He has the tastes of a 5-year-old,' a longtime Biden adviser told The Washington Post in May 2021. Biden's doctor has pronounced him physically fit to serve but the president has shown signs of his age - he sometimes walks with a limp, he's tripped boarding Air Force One, and he makes verbal gaffes.A Washington Post/ABC News poll released on Sunday found that more than 60 percent said Biden lacked the physical health and 'mental sharpness' to serve effectively as president. And only 3 percent said he was physically fit to be president.In comparision, Donald Trump, 76, did better: 64 percent of voters said he was sufficiently physically fit, and 54 percent said he was mentally sharp to be president.Biden has said he wakes up at 7 a.m. and works out at the White House at 8 a.m.. He often has a personal trainer to come in - the residence has a private gym - and spends about 45 minutes working out.And he sometime takes a break during the day to go out in the Rose Garden and play with Commander, the Bidens' German Shepherd.He relaxes by spending time with his family - usually at his home in Wilmington. He also likes sports, especially football.",
        "He's also a fan of bike riding. He spent much of the COVID pandemic working out on his Peleton. He often rides a bike while at his beach house in Rehoboth, Delaware, or when his family visits Kiawah Island, South Carolina.",
        "Biden has been downplaying questions about his age. He joked about it during a recent speech at the White House Correspondents Association dinner.'Call me old, I call it being seasoned. You say I am ancient, I say I’m wise,' he said. And, in an interview with MSNBC that aired on Friday, he pointed out the advantage of his experience: 'I have acquired a hell of a lot of wisdom and know more than the vast majority of people.' "
    ]
}