{
    "articleURL": "/wires/ap/article-12043197/Zimbabwe-opposition-figure-fined-slain-activist-comments.html",
    "content": [
        "HARARE, Zimbabwe (AP) - A prominent opposition leader and lawmaker in Zimbabwe was convicted Wednesday of obstructing the course of justice for recording a video of himself accusing ruling party supporters of killing and dismembering an activist and posting the video to social media.",
        "Job Sikhala, a Parliament member and senior official in the main opposition Citizens Coalition for Change party, was detained nearly 10 months ago. He must pay a $600 fine by Friday or face an additional six months in jail, according to the verdict by a magistrate.Sikhala was repeatedly denied bail after his arrest in July. Critics have cited his case as another example of President Emmerson Mnangagwa´s attempts to silence the opposition ahead of Zimbabwe's presidential and parliamentary elections this year.The 80-year-old Mnangagwa became president in 2017 after a coup ended the 37-year rule of autocratic leader Robert Mugabe.While the coup was initially welcomed by Zimbabweans and Mnangagwa promised democratic reforms, rights groups have recently accused him of being as oppressive as Mugabe.Amnesty International and other groups have said the arrest and pretrial detention of the 50-year-old Sikhala and other activists, along with the banning of some political meetings, show Mnangagwa´s willingness to use the justice system against his political opponents.",
        "Sikhala was arrested after his comments at a memorial service for Ali, an activist and member of Sikhala's Citizens Coalition for Change who was missing for weeks before her body was found hacked into pieces and stuffed in a well.Police have arrested one man in relation to Ali´s slaying and say they haven´t found a political link to the killing. Opposition figures claim the arrested man is an activist with the ruling Zanu PF party.",
        "Sikhala was the lawyer representing Ali's family during the search for her. At the memorial service, Sikhala accused ruling party members of killing Ali.He was seen on video making the accusation and it was posted on social media. On Wednesday, Magistrate Marewanazvo Gofa ruled that \"Sikhala was the one who recorded and uploaded the video\" and his comments \"misled\" police.Sikhala must remain in jail even if he pays the $600 fine because he is also on trial on separate charges of inciting public violence for the speech he made at the memorial service for Ali.Sikhala has been arrested more than 65 times in the past 20 years, but his lawyers say Wednesday brought his first conviction. The verdict came days after Jacob Ngarivhume, the leader of a fringe political party, was sentenced to four years in jail for a tweet that encouraged people to participate in anti-government protests in 2020. One year of the sentence was suspended.Zimbabwe´s general election will be in July or August. Many opposition figures say they are battling intense government repression similar to the time when Mugabe, who died in 2019, was president. Zimbabwe has had a series of violent and disputed elections since it gained independence from white minority rule in 1980.",
        "Mnangagwa was a Mugabe ally for decades and served as a vice president during 2014-17 before being fired by Mugabe and then taking power in a coup backed by the army. Mnangagwa denies he is clamping down on the opposition and claims his government has improved the political environment.Yet in recent months, dozens of opposition supporters, political activists, journalists, church leaders, trade union members and student leaders have been arrested on various charges that legal experts say amount to harassment.___More AP Africa news: https://apnews.com/hub/africa"
    ]
}