{
    "articleURL": "/wires/pa/article-12050547/Sam-Allardyce-returns-Liverpool-charge--Premier-League-talking-points.html",
    "content": [
        "The Premier League is reaching its climax and issues are becoming clearer at both ends of the table.",
        "Here, the PA news agency looks at the talking points ahead of the weekend’s games.The return of ‘Big Sam’Leeds go to Manchester City on Saturday for Sam Allardyce’s first game since leaving West Brom in 2021, following the sacking of Javi Gracia. The former Bolton and West Ham boss has been bullish about his ability, saying he is equal to any manager in the league. It will be a thankless task at the Etihad, though, with City having won 14 of their last 15 games – and drawing the other – in all competitions. Defeat might be expected but Allardyce knows how to squeeze the best out of sides and Leeds need their late gamble to work.Revived Liverpool can cement fifth",
        "Five straight wins and seven unbeaten in the Premier League have lifted Liverpool to fifth, and while the top four seems unlikely they are in pole position to finish best of the rest. The visit of Brentford represents another chance to cement their place ahead of the chasing pack of Brighton, Tottenham and Aston Villa. Jurgen Klopp’s side have rediscovered some swagger and a way to win – snatching a 4-3 injury-time victory over Spurs despite blowing a 3-0 lead – even if it is a little late.Arsenal entering the endgameThe Gunners’ trip to Newcastle may finally see their title chance slip away. With City hosting Leeds on Saturday, they could find themselves four points behind the leaders by the time they kick off at St James’ Park. It has been a gallant attempt from Arsenal, one few would have foreseen at the start of the season, but they are teetering on the brink of seeing City take another title. The Magpies have won four of their last five games to cement their top-four place while Arsenal need to win in the north east to keep their hopes alive.",
        "Forest’s big chance with Saints on the brink",
        "At the bottom, Southampton looked doomed and Nottingham Forest cannot pass up the chance to boost their survival chances. As the Monday night game, the hosts will know how their relegation rivals did – with Leicester heading to Fulham, Leeds at Man City and Everton going to Brighton – and favourable fixtures elsewhere make a win at the City Ground imperative. Defeat would leave the Saints staring into the abyss and the Championship. If they lose, and one of Leicester and Leeds win, they will be nine points from safety with an inferior goal difference and three games left.Can Chelsea get any worse?",
        "Beleaguered Frank Lampard takes Chelsea to resurgent Bournemouth on Saturday having lost all of his six games in charge in all competitions. They have not won in the league for almost two months and have scored just twice since the former England man replaced Graham Potter in April until the end of the season. Chelsea have fast become a laughing stock, having spent almost £600m this season, and go to the Cherries with the hosts mid-table and virtually safe. It would not be a surprise to see Lampard’s record read 007 by 5pm on Saturday – hardly a licence to thrill."
    ]
}