{
    "articleURL": "/news/article-12043935/Ministers-propose-new-aid-motorists-local-councils-scrap-pay-display-meters.html",
    "content": [
        "Ministers propose system whereby drivers can use their preferred parking appMotorists could soon be free of the need to download multiple parking apps on their mobile phones.",
        "As councils scrap pay and display meters, ministers are proposing a system whereby drivers can use their preferred app in different parts of the country – regardless of which local authority owns the space.Last month the Daily Mail reported how more than two million drivers will soon live in 'parking meter deserts' as cash parking meters are axed.Charity bosses and MPs have branded the trend 'appalling' and urged councils to consider the impact on older drivers and struggling high streets.However, under the proposed National Parking Platform scheme, the driver would only need to download one app.",
        "The Department of Levelling Up confirmed £800,000 had been spent on a pilot in Manchester with a wider roll-out of the scheme being considered.Labour MP Clive Betts, chairman of the Commons levelling up committee, said no one should be 'digitally excluded'. A Department for Transport spokesman said: 'We are pleased to support easier ways to pay for parking.'Currently, drivers who visit council car parks are instructed to use different apps in different car parks - depending on which firm the local authority has a contract with. For example, one borough may use RingGo, while another may ask drivers to download rival app PayByPhone. However, ministers are proposing a new system which would allow motorists to use their preferred app in different parts of the country - regardless of which local authority owns the space. ",
        "A lack of choice for those who would prefer to pay with cash and a lack of customer service phonelines are among the most common gripes about parking apps. Correspondence from the Department of Levelling Up, Housing and Communities confirmed £800,000 had already been spent on a pilot run by Manchester City Council. 'The NPP proposal, which will allow motorists to use the app of their choice when parking, is designed to improve and simplify the pay-by-phone user experience,' it read. Ministers acknowledged that the pilot had identified and addressed 'technical and contractual challenges' that would need to be considered. However, the authors confirmed the Government was now considering 'funding models' for a wider roll-out of the scheme. It is understood there are no plans to require minimum numbers of parking meters under the scheme. But last month Levelling Up Secretary Michael Gove wrote to councils warning them that forcing drivers to use smartphones to pay for parking was unfair. "
    ]
}