{
    "articleURL": "/wires/reuters/article-12051665/New-Yorkers-protest-chokehold-killing-subway-demand-criminal-charges.html",
    "content": [
        "By Julia Harte",
        "NEW YORK, May 4 (Reuters) - Protests were planned in New York City on Friday after a former U.S. Marine placed a fellow subway passenger in a chokehold that killed him, stoking outcry over the lack of city support for those suffering from mental illness and homelessness.The Manhattan District Attorney has not announced any charges against the unidentified former Marine who killed 30-year-old Jordan Neely on Monday by compressing his neck while both rode the F train, according to the city's medical examiner.The examiner's homicide finding alone does not imply intent or culpability, which are issues that prosecutors will consider in deciding whether to bring criminal charges.Neely, who was Black, was homeless, according to local media reports. The 24-year-old former Marine, who was white, was questioned by police and released on Monday, local media said. Organizers of local protests called the act a \"lynching\" and an example of \"white vigilantism\" against victims of color.Several civil rights and left-wing groups planned protests on Friday afternoon and evening.The New York Young Communist League called for a demonstration at the district attorney's office in lower Manhattan, demanding that he charge the former Marine and investigate the police who let him go after questioning him.\"Neely needed food and adequate housing but instead, our racist, capitalist system facilitated his murder for experiencing homelessness,\" read an announcement of the protest on Instagram.",
        "Another protest was scheduled for 6 p.m. in Washington Square Park.New York Mayor Eric Adams cited mental health issues as having a role in the incident, but said he would refrain from commenting further while the investigation is under way.A spate of attacks on train passengers last year, particularly Asian Americans, prompted Adams to increase police patrols and expand outreach to the mentally ill in the subway system, citing rising homelessness in the wake of the pandemic.A video of the incident that has circulated on social media showed an unidentified passenger applying a chokehold to a man identified as Neely on the floor of a subway train for more than three minutes. Two other men are seen in the video restraining Neely's arms before he went limp.Reuters could not verify the authenticity of the video.Neely was known to impersonate Michael Jackson, dressing and dancing like the legendary music artist on New York's busy trains and stations. The altercation occurred after he boarded the train and began yelling at passengers, saying he was hungry and ready to die, the New York Times reported, citing police.Democratic U.S. Representative Alexandria Ocasio-Cortez, whose district includes neighborhoods in the New York City boroughs of the Bronx and Queens, said Neely was murdered and called for his killer's arrest. (Reporting by Brendan O'Brien in Chicago and Julia Harte in New York Editing by Alistair Bell)"
    ]
}