{
    "articleURL": "/tvshowbiz/article-12057607/Inside-Sam-Burgess-pregnant-girlfriend-Lucy-Grahams-baby-shower.html",
    "content": [
        "The countdown is on for rugby league star Sam Burgess and his girlfriend Lucy Graham as they prepare to welcome their first child together.",
        "Lucy celebrated her pregnancy over the weekend with a baby shower arranged at the 'last minute' by her friends and family while she was visiting the UK.The hairdresser, who recently moved from England to Sydney to start a new life with Sam, looked gorgeous as she showed off her baby bump in a skintight dress.The baby shower took place at a venue in Leeds called Poppy's Potting Shed, where she made floral bouquets with her pals.Lucy was presented with a morbid-looking 'birthing cake' featuring a plastic doll.",
        "The mother-to-be shared a gallery of photos on Instagram from her special day, and thanked her loved ones for making it everything she 'could have wished for'. 'Thank you so much to my amazing friends for organising the most wonderful last minute baby shower / wedding I could have wished for,' she wrote in the caption.'Wedding' was a reference to her throwing one of the bouquets the women made.'I love you all and thank you so much to everyone for coming at such short notice and making the little time we had so much fun. There's no place like home,' she added.",
        "In one of the photos, she posed with her bouquet and cake; in others, she smiled alongside her family and friends while showing off her growing bump.",
        "Sam confirmed in March he was expecting his third child with Lucy.The NRL coach already shares two older children, Poppy, four, and Billy, three, with his ex-wife Phoebe Burgess (née Hooke).'We are so excited and happy to be starting this new chapter together... Happy days,' he said in a statement.",
        "Friends said Sam was 'beyond excited' to start a new chapter with Lucy by his side.'He's mad about Lucy. It's been a whirlwind but she is a fantastic woman,' the source said.'They get along so well. All of his friends are so thrilled to see how happy he makes her.'",
        "'The Burgesses are very family oriented and I think there was always a plan to start a family. From what I hear, she is genuinely good for him. When they're together apparently they laugh all the time - she cracks him up.'Sam became friends with Lucy more than 20 years ago when they were children growing up in West Yorkshire, England.Last month, Lucy shared a throwback snap of the two two taken 18 years earlier."
    ]
}