{
    "articleURL": "/tvshowbiz/article-12056073/Chloe-Ferry-struggles-contain-surgically-enhanced-assets-arrives-salon.html",
    "content": [
        "Chloe Ferry put on a jaw-dropping display as she arrived at her Newcastle salon on Friday.",
        "The Geordie Shore star, 27, struggled to contain her surgically-enhanced assets in a plunging blazer and skin-tight leggings.Chloe repeatedly attempted to cover herself as she spilled out of her daring top, whilst popping to her beauty business HQ with co star Nathan Henry.The reality star teamed her all-black ensemble with sexy stiletto sock boots and carried her belongings in a Givenchy handbag.She styled her long brunette hair extensions into elegant mermaid waves and accessorised with chic pearl earrings.",
        "Her busty display came days after it was revealed that Sam Gowland is set to return to Geordie Shore four years after his explosive bust-ups with ex Chloe saw him get fired from the show.The television personality, who also argued with some of the other Geordie Shore castmember, was given the boot in 2019 and has since appeared on Love Island. However, he will be back for the new Geordie Shore series alongside his ex and may cause potential fireworks on the show.Speaking to the Sun, a source said: 'Sam flew out and surprised the cast in Cyprus - it was a total shock to everyone when he arrived, and extremely awkward for Chloe. 'Fans will love to see him back on screen but the cast were really shocked.'A representative for MTV declined to comment.  ",
        "The reality star was in Geordie Shore in its sixteenth series in 2018 but did not return to the show in 2019 after discussions with Chloe. But when they briefly got back together, Sam, who met Chloe on the show in 2017, was involved in filming again.",
        "However, Sam was suspended from Geordie Shore again in 2019 amid claims he had a major bust-up in the house sparking Chloe to quit.The star was said to have got into the row because a fellow star mentioned his on/off flame Chloe had kissed another man on a Portugal night out while she and Sam were on a break from their romance.Sam allegedly took it 'way too far' in a heated exchange when Chloe's kiss with a mystery man became hot topic of conversation once again, The Sun claimed.A source told the publication: 'He got suspended again because it came out that Chloe snogged a random man during filming in Portugal...'Everyone thought it had blown over but when he went back into the house it was mentioned and he hit the roof. 'Obviously the producers want fireworks but this was way too far, hence why Sam was slapped with another suspension.'It emerged after claims Chloe had quit Geordie Shore again in protest after Sam was suspended from the show for being involved in a bust-up. ",
        "Insiders told The Sun that Chloe followed Sam as he left for a second time after a row broke out.Sam had previously left the show just weeks before, following a row with Chloe, who he  endured an on-off relationship with.She herself quit the show after splitting from Sam but returned weeks after. "
    ]
}