{
    "articleURL": "/wires/reuters/article-12046217/Moderna-beats-COVID-vaccine-sales-expectations-deferred-revenue-rolls-in.html",
    "content": [
        "By Patrick Wingrove and Leroy Leo",
        "May 4 (Reuters) - Moderna Inc on Thursday reported stronger-than-expected sales of $1.9 billion for its COVID-19 vaccine in the first quarter, driven by a surge of revenue deferred from 2022, but left its 2023 sales expectations unchanged.The vaccine maker posted a profit of 19 cents per share, compared with analyst expectations for a loss of $1.77 per share, in part because sales were higher than expected.Moderna said it continued to expect COVID vaccine sales of $5 billion for the year based on advance purchase agreements. It added it was having discussions about new contracts with customers in Europe, Japan, and in the U.S.The $1.9 billion of sales for its COVID vaccine Spikevax represents most of the $2 billion expected in the first half of the year for advanced purchase agreements and double the average analyst estimates of $998 million, according to Refinitiv IBES data.Moderna expects an additional $3 billion in deferred vaccine revenue in the second half of 2023.\"This gives us a lot of confidence that we continue to be on track to hit the minimum $5 billion we have in previously signed advanced purchase agreements,\" Moderna Chief Commercial Officer Arpa Garay told Reuters.Moderna continues to expect the U.S. annual COVID-19 market to be 100 million doses, she added.",
        "The results came two days after the company's rival Pfizer reported better-than-expected COVID vaccine sales for the first quarter and maintained its expectations for full-year sales.Moderna had generated around $36 billion in sales over the last two years from its COVID vaccine, its only commercial product and one of the most widely used shots for the virus.Demand for the vaccine has since fallen globally, and the company in February effectively forecast a possible net loss for 2023, calling it a transition year before it starts sales of its potential new vaccines for respiratory syncytial virus (RSV) and flu.All of its vaccines are based on the same mRNA platform as its COVID product.The company said on Thursday it was preparing for potential commercial launches of its RSV and flu vaccines in 2024. Longer term, it has also teamed up with Merck &amp;amp; Co Inc on a cancer vaccine that works in concert with Merck's immunotherapy Keytruda.Moderna reported diluted earnings per share of $0.19 in the first quarter of 2023, compared to $8.58 for the first quarter of the previous year. Analysts had expected the company to post a loss of $1.77 per share.The U.S. Food and Drug Administration is expected to shift to an annual COVID booster campaign with an updated strain, similar to the way Americans get their flu shots. (Reporting by Patrick Wingrove in New York; additional reporting by Leroy Leo in Bengaluru; Editing by Sriraj Kalluvila, Caroline Humer and Jamie Freed)"
    ]
}