{
    "articleURL": "/wires/aap/article-12049249/Griffin-thinking-long-term-despite-board-pressure.html",
    "content": [
        "Anthony Griffin insists he is not making panicked decisions and still planning for St George Illawarra's long-term future, despite intense pressure to keep his own job.",
        "Sunday's clash with Wests Tigers looms as crucial for Griffin, with the walls closing in on the coach after last week's loss to Canterbury headlined four straight losses.Dragons bosses had told the off-contract Griffin before a ball was kicked this year they were considering their options for next season, with that situation now becoming more critical.It comes as Griffin made the call to drop star centre Zac Lomax from NRL this week, sitting him out of football and keeping him away from reserve grade.Ben Hunt will also spend part of the match at hooker as part of a spinal restructure, with Jayden Sullivan to come off the bench and join Talatau Amone in the halves.But Griffin was adamant he was not panicking after four straight losses and with his own future in the headlines.\"Do I look like I am panicking?\" Griffin asked calmly.\"I've been coach a long time. We have built a really good group here. We have been close.\"It's been extremely frustrating for us, because we know how hard everyone is working.\"We could easily be sitting here with three or four wins over the past month. But that's rugby league, that's the NRL.\"Any change that we make is in the best interest of the team for the long term. It's not something we just flippantly think if we do this it might work.\"",
        "Sunday's spine restructure is an eye to the future at the Dragons.Sullivan and Amone have risen through the junior grades together alongside fullback Tyrell Sloan in Wollongong.Griffin would not answer extensively on his own situation when quizzed by media on Friday or when he wanted answers by, but said he was still planning long-term.\"The best way to build for the long-term is internally and all the great clubs have done that,\" Griffin said.\"You see what Penrith have gone through over the past few years. You see where Brisbane are going now.\"It takes time to build success.\"Our club is doing a really good job of that at the moment. This week at some stage you're going to have Sullivan, Amone and Sloan playing behind Ben Hunt.\"You have the two Feagai boys (Max and Mat) playing together. You have Blake Lawrie who is becoming one of the best props in the league.\"There is an evolution or development happening with our club, and it is going to be a real strong club.\"Griffin indicated Hunt's mid-match move to hooker would not herald a long-term transition to No.9, where he plays at representative level.\"It's not something we think he is just going to stay there,\" Griffin said.",
        "\"He does prefer playing halfback. But he plays hooker for Queensland and Australia and he plays it very well. So he understands he can play there.\"To Ben's credit, when I spoke to him about it, he had already thought about it.\""
    ]
}