{
    "articleURL": "/wires/reuters/article-12038627/E-Jean-Carroll-called-minutes-Trump-allegedly-raped-friend-testifies.html",
    "content": [
        "By Jack Queen",
        "May 2 (Reuters) - A friend of E. Jean Carroll on Tuesday backed up the writer´s account of being raped by Donald Trump, testifying during a civil trial that she received a phone call about the alleged attack minutes after it occurred.Author Lisa Birnbach told a jury in Manhattan federal court that she \"vividly\" remembered Carroll calling her one evening in the spring of 1996 and saying Trump had just attacked her in a dressing room in the lingerie section of the Bergdorf Goodman department store in New York City.The rape claim arose in Carroll's 2019 memoir, \"What Do We Need Men For? A Modest Proposal.\" Under cross-examination on Monday, she denied making up her claims to drive publicity for the memoir.Carroll's civil lawsuit for battery and defamation alleges Trump raped her and then tarred her reputation by claiming in an October 2022 post on his Truth Social platform that the former Elle magazine advice columnist´s case was a \"complete con job\" and a \"Hoax and a lie.\"Trump, a Republican seeking to regain the U.S. presidency in 2024, has denied the allegations and said he has never met Carroll, whom he accuses of making up the story.Birnbach, author of many books including \"The Official Preppy Handbook,\" said Carroll told her Trump slammed her into the wall, pulled down her tights and \"penetrated her with his penis.\"",
        "\"I whispered, E. Jean, he raped you. You should go to the police,\" Birnbach testified.On Monday, Carroll wrapped up her third day on the witness stand, where she recounted the alleged assault and responded to pointed cross-examination by a lawyer for Trump, who questioned nearly every aspect of her account.Carroll told jurors last week that Trump put his fingers into her vagina, which she called \"extremely painful,\" and then inserted his penis.Birnbach testified that Carroll refused to go to the police after the alleged rape and asked her to never tell anyone about the incident.\"Instead of wallowing, she puts on lipstick, dusts herself off and moves on,\" Birnbach said, explaining why her friend stayed silent about the alleged assault for decades.A lawyer for Trump, W. Perry Brandt, probed Birnbach´s allegiance to the Democratic Party and open disdain for Trump, citing podcast appearances and social media posts where she described him as a \"madman,\" \"narcissistic sociopath\" and \"Russian agent.\"Under questioning from one of Carroll's lawyers, Birnbach said she would \"never in a million years\" lie to hurt Trump politically.Another woman, Jessica Leeds, testified on Tuesday that Trump kissed her, groped her and put his hand up her skirt on a flight in 1979.Trump has not attended the trial, now in its fifth day. On Monday, he was in Scotland to visit his golf courses there.",
        "Trump´s lawyers sought a mistrial on Monday, accusing U.S. district Judge Lewis Kaplan of bias against him in a motion Kaplan swiftly denied from the bench.Because Carroll's case is civil, she must establish her claims by a preponderance of the evidence, meaning more likely than not, and need not meet the tougher criminal standard of proof beyond a reasonable doubt. (Reporting by Jack Queen in New York; Editing by Noeleen Walder and Howard Goller)"
    ]
}