{
    "articleURL": "/femail/real-life/article-12058599/Girlfriend-slammed-making-boyfriend-pay-leftover-pizza-complaining-Reddit.html",
    "content": [
        "A woman revealed her boyfriend ate her takeaway leftovers He was angry that she demanded he pay her back for the food A young woman has been slammed as greedy and immature after demanding her live-in boyfriend 'pay up' after eating her leftover pizza.",
        "The 24-year-old explained her partner 'stole' three slices of pizza from the fridge then laughed in her face when she asked him to send her money for the meal.Posting to Reddit the young woman revealed she and her partner had agreed to buy their own groceries and split bills down the middle when they moved in together.'If we buy anything that's meant to be used by the two of us, then we also split the cost,' she explained.So when her boyfriend ate three slices of her pizza without permission after coming home late one night she was furious.",
        "She explained that her boyfriend has a demanding job that causes him to work after hours every day, while she worked a 9am-5pm job.'I eat dinner alone every weekday, and so I ordered a pizza for myself last week,' she explained. 'They don't have individual pizzas, only regular sized ones, so I couldn't finish all of it.'She placed the remaining three slices in a container and stored it away to eat later.But found they were missing by morning.'I waited until my boyfriend woke up and asked him if he ate it. He said he did so I asked him to pay me back for half of the pizza.' ",
        "'He laughed because he thought I was joking, but I told him I was serious - I bought that for myself, he had no right to eat it.'The woman revealed her boyfriend called her 'selfish' for not sharing, and she lashed back claiming his theft went against their agreement when they moved in together.Many were shocked that the woman couldn't share a few slices of leftover pizza with her boyfriend. 'You really need to pick your battles,' one woman said. 'If you're going to be this petty pizza, then you're in for a wild ride of aggravation, frustration, and pain for the rest of your life with every single person you will ever meet.''You're treating your relationship like roommates with benefits - would you also charge him per sheet of toilet paper he uses?' another asked.",
        "'God, I cannot imagine being so miserly that I was penny pinching like that with someone I claimed to love,' a woman said.But others were flabbergasted that her boyfriend would eat her food without permission. 'He knowingly violated your agreement without discussion - he should pay you back for the pizza,' a man wrote. 'I would be so upset if something I planned to eat was gone.''I've been married for 15 years and and your take out leftovers belong to you,' another woman said. 'I would never eat my husband's leftovers, and he would get an earful if he didn't ask before finishing my food.'",
        "A third wrote: 'It's about respect - if I really want my partner's food, I have to ask first and readily accept 'no' as an answer. It's common courtesy, I think your boyfriend was being extremely rude.'"
    ]
}