{
    "articleURL": "/wires/reuters/article-12052145/Apples-results-send-shares-surging-nine-month-high.html",
    "content": [
        "By Noel Randewich",
        "May 5 (Reuters) - Apple's stock surged nearly almost 5% on Friday, hitting a nine-month high and on track for its biggest one-day gain since November after the iPhone maker's quarterly results cheered investors worried about a potential recession.The rally in Apple's shares buoyed optimism across Wall Street, helping lift the S&amp;amp;P 500 and Nasdaq over 1.5% after CEO Tim Cook's results late on Thursday underscored the resilience of corporate earnings in a quarterly reporting season that so far has been less bad than expected.\"Apple soothed the market because of its consistency of execution. Tim Cook has a steady hand on the helm,\" said Jake Dollarhide, chief executive officer of Longbow Asset Management in Tulsa, Oklahoma.\"Investors in uncertain times want certainty, and Apple, as well as Microsoft, are as close as you can get to certainty,\" Dollarhide added.The world's most valuable company reported lower revenue and profits for the quarter ending April 1, but still beat analysts' expectations. With Apple's results helped by emerging markets like India, executives said gross profit margins for the current quarter would be better than forecast.Apple's stock market value climbed by over $100 billion to about $2.7 trillion, extending its lead over Microsoft, the world's second most valuable company, at $2.3 trillion.",
        "Last trading at $173.48, the Cupertino, California company's shares were set to log their biggest one-day gain since Nov. 30. They were just short of a peak of over $176 last August.Apple's stock has recovered almost 40% from its closing low in January, and it is now down just 4.7% below its record high close in January 2022. By comparison, the S&amp;amp;P 500 remains down 15% from its record high close, also in January 2022.At least 13 analysts raised their price targets for Apple's stock following its report, with the median target climbing to $180 from $170 before the report, according to Refinitiv data.(Reporting by Noel Randewich, editing by Deepa Babington)"
    ]
}