{
    "articleURL": "/wires/afp/article-12056089/23-000-flee-violence-northeast-India-army-says.html",
    "content": [
        "Some 23,000 people have fled ethnic violence in northeast India that has reportedly killed at least 54, the army said Sunday, although there was no new \"major violence\" overnight.",
        "The unrest in Manipur state erupted after a protest march by a tribal group last week sparked clashes, with vehicles and houses set on fire and authorities firing tear gas.The military has deployed thousands of troops to the state bordering Myanmar, issued \"shoot-at-sight\" orders in \"extreme cases\", imposed curfews and cut the internet.The army said on Sunday no major flare-ups were reported overnight and that a curfew was lifted between 7-10 am in Churachandpur district, one of the main flashpoint areas.\"Past 24 hrs also witnessed Army significantly enhancing surveillance efforts through aerial surveillance, movement of UAVs &amp; redeployment of Army Helicopters within Imphal Valley,\" it said, referring to unmanned aerial vehicles or drones.\"Total 23000 civilians have been rescued till now &amp; were moved to own operating bases/ military Garrisons,\" the statement said.Authorities have not given an official death toll but hospital morgues in the state capital Imphal and Churachandpur had reported a combined total of 54 dead, according to local media.Tribal groups including the Kukis are unhappy about the prospect of the state's majority Meitei community being recognised under a \"Scheduled Tribe\" category.This designation would give them a certain quota of government jobs and college admissions in a form of affirmative action aimed at addressing structural inequality and discrimination.",
        "L. Sanglun Simte, 29, a Kuki who has been camping outside the airport in state capital Imphal with 11 of his family members since Saturday, recounted the horror as violence broke out.\"We fled for safety. Things are not okay. They are just attacking us Kukis,\" he told AFP.Simte said his 49-year-old cousin, Siemcha Gangte, was killed by a mob on Thursday and his house was set on fire.\"The attackers say we are outsiders and need to leave Imphal. When they attacked us, the local police didn't help.\"Simte, who has booked a flight for Agartala, the capital of neighbouring Tripura state, said he would return only if security improved.\"We don't feel safe right now,\" he said.Lalpu Suantak, 45, who works with a state-owned bank in Imphal and is also from the Kuki community, said he fled his house with 12 family members after some homes and a neighbourhood church were set on fire.\"My house hasn't been touched yet but there was fear when a mob burnt one house in our area,\" he told AFP.India's northeast has seen decades of unrest among ethnic and separatist groups seeking more autonomy or even secession from India, with at least 50,000 people killed in Manipur since the 1950s.",
        "These conflicts had waned over the years, with many groups striking deals with New Delhi for more powers.str-stu-bb-abh/pbt"
    ]
}