{
    "articleURL": "/news/article-12045159/Cameron-Turgay-Bardak-guilty-attempted-murder-ex-girlfriend-hatchet.html",
    "content": [
        "Cameron Turgay Bardak found guilty of attempted murder He attacked ex-girlfriend Maria Buci with a hatchet  A woman who survived a hatchet attack has thanked the good Samaritans who saved her life after her ex-boyfriend was found guilty of attempted murder.",
        "'They are the reason I am alive today,' Maria Buci said outside Brisbane Supreme Court on Thursday.Former security guard Cameron Turgay Bardak was charged after ambushing Maria Buci on July 2020.He struck her with the hatchet before strangling her as good Samaritans tried to intervene.A Brisbane Supreme Court jury was shown iPhone footage of Bardak on top of Ms Buci with his hands around her throat while multiple people tried to separate them.Ms Buci became emotional upon hearing the jury's verdict on Thursday.",
        "'I do just want to thank everyone who has been by my side and has assisted me these past three years - the police service, the DPP, the witnesses and everyone who saved me that night,' Ms Buci said outside court.'I am very grateful.'Bardak had pleaded guilty to an alternate charge of causing grievous bodily harm to Ms Buci, whose hand and finger were struck by the hatchet.She had a clump of hair pulled out and her throat was also injured during the attack, the court was told.However, crown prosecutor Chris Cook did not accept his plea, telling the jury that Bardak had formed the idea that 'if I can't have her, nobody will'.Ms Buci had told the jury that she was choked three times as she tried to flee her ex-boyfriend's hatchet attack.",
        "She said the assault had left her with physical scars and she was 'still messed up mentally'.Ms Buci said she was walking through the car park and spotted Bardak hiding behind a concrete pillar next to her vehicle.He told her to 'get in the car'.'He said 'I'm going to kill you' and that's when I saw the axe. Then I started screaming and he pushed me against the wall,' she told the jury.",
        "Ms Buci said Bardak hit her with the axe, causing her to fall down before striking her again while her hands were covering her head.He then started choking her.The trial heard workers from nearby offices rushed into the car park after hearing cries for help.One witness was struck in the hand by the hatchet but was able to punch Bardak in the head and kidneys in an attempt to stop the attack, to no avail.Others from neighbouring buildings ran to the scene and helped loosen Bardak's grip, allowing Ms Buci to flee but he chased her down.Multiple people were then able to free her a second time, the court was told.Ms Buci on Thursday agreed that the good Samaritans were 'heroic'.'Absolutely. What they did you don't see it every day and I hope they don't have to see it ever again,' she told media.",
        "Bardak told the court that he only bought a hatchet to force her into speaking to him again.The jury reached a verdict after they started deliberating on Wednesday morning.Bardak will be sentenced by Justice Glenn Martin on Friday. "
    ]
}