{
    "articleURL": "/wires/ap/article-12060997/Business-Highlights--Debt-ceiling-Teacher-pay.html",
    "content": [
        "___",
        "Debt options abound, but can Biden, McCarthy strike a deal?WASHINGTON (AP) - The White House and Congress could strike a deal to raise the debt ceiling in exchange for budget cuts. Or they could agree to a stopgap measure to keep paying the nation´s bills while negotiations continue. They could also do nothing, sending the economy into a tailspin. As President Joe Biden prepares to meet with House Speaker Kevin McCarthy and leaders of Congress, the options for easing the debt ceiling standoff are many. But the political incentive for compromise is harder to come by. There´s no easy endgame ahead of a June 1 deadline to raise the debt ceiling or risk default.___Teachers earn $67K on average. Is push for raises too late?HARRISBURG, PA (AP) - As schools across the country struggle to find teachers to hire, more governors are pushing for pay increases and bonuses for the beleaguered profession. Some are doing it for the second straight year, as others vow to beat out other states competing for educators. Ahead of Monday´s start of national Teacher Appreciation Week, 26 governors are talking about boosting teacher compensation. That´s according to the nonprofit Teacher Salary Project. It´s not clear how far pay raises will go toward relieving the shortages. Some teachers say it´s too little, too late to fix problems that are years in the making.",
        "___US to propose new rules for airline cancellations, delaysPresident Joe Biden says his administration will write new rules to expand the rights of airline passengers. Biden said Monday that the rules will require airlines to compensate passengers and cover their meals and hotel rooms if they are stranded for reasons within the airline´s control. It´s the Democratic administration´s latest salvo at the airlines, and it comes just weeks before the busy summer travel season. Airlines for America, which represents the biggest carriers, says that airlines have no incentive to delay or cancel flights. The trade group blames weather and air traffic control outages for most delays.___Banks report tougher credit standards in wake of failuresWASHINGTON (AP) - A Federal Reserve report shows that banks raised their lending standards for business and consumer loans in the aftermath of three large bank failures. It´s a trend that could slow the economy in coming months. The report, known as the senior loan officers survey, asked banks if they have tightened their lending standards by taking steps such as demanding higher credit scores, charging higher interest rates, or other moves that altogether would make it harder for businesses and consumers to obtain loans. About 46% of all banks said they had raised standards for business loans known as commercial and industrial loans, up from just under 45% in the previous quarter.",
        "___Congress eyes new rules for tech: What´s under considerationWASHINGTON (AP) - Most Democrats and Republicans agree that the federal government should better regulate the biggest technology companies, particularly social media platforms. But there is very little consensus on how it should be done. Tech regulation is gathering momentum on Capitol Hill as concerns skyrocket about China´s ownership of TikTok and as parents navigating a post-pandemic mental health crisis have grown increasingly worried about what their children are seeing online. Lawmakers have introduced a slew of bipartisan bills, boosting hopes of compromise. But any effort to regulate the mammoth industry would face major obstacles as technology companies have fought interference.___Facebook has 3 billion users. Many of them are old.Facebook says it is not dead. It´s not even just for \"old people,\" as young people have been saying for years. The social media platform born before the iPhone is approaching two decades in existence. But even with nearly 3 billion monthly users, for years it has struggled to stay relevant as newer, younger, more addictive rivals - at the moment, TikTok - emerge. And the portion of people under 30 who use it is declining. Without this trend-setting demographic, Facebook, still the main source of revenue for parent company Meta, risks fading into the background - like email.",
        "___Disney parks at the forefront after Iger´s returnIt´s been six months since Bob Iger canceled his retirement and stepped back into the top role at Disney to right a number of perceived wrongs under his handpicked successor, with one hovering right near the top: reconnecting with the Disney theme park die-hards and restoring their faith in the brand. Among his first acts as returning chief executive, Iger walked the Disneyland and California Adventure parks in Anaheim. And there was Iger at Disney World in Orlando, Florida, Disneyland Paris and Tokyo Disney Resort, talking to guests and cast members alike and taking a personal interest in new projects that are underway. With quarterly earnings from Disney this week, all eyes are on Iger´s attempt to re-energize the parks.___Australian company says has found oil, gas in ZimbabweHARARE, Zimbabwe (AP) - An Australian-listed company exploring for oil and gas in Zimbabwe says that it has found deposits of both as well as helium in the Cabora Bassa Basin in the north of the country. Invictus Energy said in a statement Monday that results from an analysis of samples from drilling conducted last year confirmed \"the presence of light oil and rich natural gas-condensate, with condensate gas ratios estimated at between 30 to 135 barrels per million cubic feet.\" The company said the results also showed the presence of helium gas \"in commercial concentrations.\" Helium is used in the production of semi-conductors and liquid crystal display (LCD) panels.",
        "___The S&amp;P 500 rose 1.87 points, or less than 0.1%, to 4,138.12. The Dow Jones Industrial Average fell 55.69 points, or 0.2%, to 33,618.69. The Nasdaq composite rose 21.50 points, or 0.2% to 12,256.92. The Russell 2000 index of smaller companies fell 5.41 points, or 0.3%, to 1,754.47."
    ]
}