{
    "articleURL": "/wires/reuters/article-12051567/Cubans-waylaid-weather-fuel-shortage-march-May-Day-five-days-late.html",
    "content": [
        "HAVANA, May 5 (Reuters) - Cubans rallied on Havana's Malecon waterfront boulevard to celebrate International Worker's Day on Friday, five days after the planned May 1 event was called off due to foul weather and a fuel crisis that has crippled public transport on the island.",
        "Thousands of Cubans, many dressed in white, red and blue t-shirts, touting flags and brandishing posters of former leader Fidel Castro, arrived on the Malecon well before sunrise for an event scheduled for 7 a.m.Cuban President Miguel Diaz-Canel, sporting a baseball cap and t-shirt the colors of the Cuban flag stood beside Raul Castro, Fidel's brother and former Cuban president, at the rally overlooking the Straits of Florida.Similar events were held in central squares in provincial capitals throughout Cuba, state-run television showed.Fidel Castro, who died in 2016, was famed for his fiery May Day speeches rebuking the United States trade embargo on Cuba during an annual mass rally traditionally held in Havana's iconic Plaza de la Revolucion.\"This year it was not possible, due to the fuel situation,\" said university professor Javier Sanchez, 24, as he cheered during the morning celebration. \"But even so, that did not stop us from going out to defend the revolution.\"The iconic marches, rife with symbolism and attended primarily by worker's unions and state employees in the communist-run country, have long been viewed as a show of support for Castro´s 1959 revolution, now in its 64th year.But one of the island's worst fuel shortages in decades prompted Diaz-Canel's administration last week to relocate the main event to the waterfront Malecon to avoid using extra fuel to transport participants to the more distant Plaza de la Revolucion.",
        "Though May 1 dawned clear in Havana, a wind and rain storm the previous day hindered preparations, leading Cuban officials to postpone the event until Friday.Cuban state-run media estimated that 100,000 Cubans had gathered on the Malecon by early Friday morning. Reuters was unable to independently confirm the number of participants. (Reporting by Dave Sherwood in Havana; additional reporting by Anett Rios, Alexander Frometa and Alexandre Meneghini; Editing by Conor Humphries)"
    ]
}