{
    "articleURL": "/wires/ap/article-12060533/Braves-activate-C-dArnaud-injured-list-month-out.html",
    "content": [
        "ATLANTA (AP) - The Atlanta Braves activated catcher Travis d'Arnaud from the injured list on Monday, one month after he sustained a concussion in a collision at home plate.",
        "D'Arnaud played three games on a rehab assignment at Triple-A Gwinnett, going hitless in eight at-bats with two walks. That was good enough for the Braves to bring him back ahead of a two-game series against the Boston Red Sox.Catcher Chadwick Tromp was optioned to Gwinnett.A first-time All-Star last season, d'Arnaud was injured April 8 when he was hit in the head by San Diego´s Rougned Odor, who crossed the plate standing on a throw home.The catcher stayed in that game for a couple of more innings before he was replaced. Initially placed on the seven-day injured list, d'Arnaud's recovery took far longer than expected.The Braves were taking no chances since he has a history with concussions.\"That´s nothing to mess around with,\" manager Brian Snitker said.D'Arnaud was off to a good start at the time of his injury, hitting .333 with five RBIs over eight games.. He rejoins Sean Murphy to give the Braves one of the best catching duos in the big leagues.Murphy is hitting .282 with nine homers, 28 RBIs and an NL-leading OPS of 1.048.The Braves are getting close to full strength after a rash of injuries, having activated closer Raisel Iglesias and shortstop Orlando Arcia during a series this past weekend against Baltimore.",
        "Atlanta has an NL-best 24-11 record and already leads the NL East by seven games. Seeking a sixth straight division title, the Braves are essentially back to their everyday roster coming out of spring training.But there are still concerns about the starting staff. Kyle Wright went on the 15-day IL last week with a right shoulder strain. While an MRI found no structural damage, it's not known when the pitcher who had a a majors-leading 21 wins in 2022 might return.There is also concerns about ace Max Fried, whose regular spot in the rotation would have him pitching again on Wednesday against the Red Sox. While the Braves haven't disclosed if Fried is injured, they are now listing that game as \"TBD\" in their pitching probables.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}