{
    "articleURL": "/wires/pa/article-12041113/Teenage-boy-opens-fire-school-Serbian-capital.html",
    "content": [
        "One person has reportedly been killed after a teenage boy opened fire at a school in the Serbian capital Belgrade, causing a number of injuries.",
        "Police said they received a call about the shooting in the Vladislav Ribnikar primary school in the centre of the city at around 8.40am local time (7.40am BST).The suspect, a seventh grade student (aged around 13), was arrested, police said.The statement added that the boy apparently fired several shots from his father’s gun at a teacher, other pupils and the school guard.Serbian media reported that the guard was killed in the shooting and several students were injured, some seriously.Police gave no other details.Terrified parents arrived to the school trying to find their children, according to reports.Local media footage from the scene showed a commotion outside the school as police removed the suspect, whose head was covered as officers led him to a car parked in the street.Mass shootings in Serbia and in the wider Balkan region are extremely rare and none has been reported in schools in recent years. In the last mass shooting in 2013, a Balkan war veteran killed 13 people in a central Serbian village.Experts, however, have repeatedly warned of the number of weapons left over in the country after the wars of the 1990s. They also note that decades-long instability stemming from the conflicts as well as the ongoing economic hardship could trigger such outbursts.",
        "Milan Milosevic, who said his daughter was in a history class when the shooting took place, told N1 television that he rushed out when he heard what had happened.“I asked: ‘Where is my child?’ but no-one could tell me anything at first,” he said. “Then she called and we found out she was out.“He (the alleged perpetrator) fired first at the teacher and then the children who ducked under the desks,” Mr Milosevic quoted his daughter as saying. “She said he was a quiet boy and a good student.”Police sealed off the blocks around the Vladislav Ribnikar school, in the centre of Belgrade."
    ]
}