{
    "articleURL": "/wires/reuters/article-12042705/As-DeSantis-readies-2024-presidential-bid-Florida-lawmakers-hand-fresh-ammo.html",
    "content": [
        "By James Oliphant",
        "WASHINGTON, May 3 (Reuters) - Republican Florida Governor Ron DeSantis had counted on a productive state legislative session this spring to turbocharge his coming 2024 presidential bid.Things haven't quite worked out that way.As the two-month session draws to a close this week, DeSantis is arguably in worse political shape than he was when it began, having tumbled in public opinion polls, seen endorsements go to rival Donald Trump and watched as key Republican donors expressed doubts about his viability.The Republican-dominated state legislature has indeed churned out bills at DeSantis' behest, allowing him to crow that Florida is \"the beating heart of the conservative movement.\" But a sweeping abortion ban, permitless concealed carry for guns, and more anti-diversity and anti-\"woke\" measures have been largely overshadowed by his ongoing feud with Walt Disney Co .And some of those legislative accomplishments, particularly the so-called \"heartbeat\" law that bans abortions after six weeks, could place DeSantis in political peril down the road, either in the Republican state nominating contests or in the general election should he become the party's nominee.Even so, DeSantis plans to launch his presidential run in some manner later this month, followed by a more formal event in June, sources close to the governor said, speaking on condition of anonymity.",
        "He is expected to pitch himself to voters as more electable than front-runner Trump, who has used DeSantis' absence from the race to attempt to frame him as a second-rate politician who owes his success to Trump's backing when he first ran for governor.With the first presidential nominating contest still nine months away, political analysts say DeSantis has plenty of time to turn his fortunes around.\"Anybody who has raised over $100 million and won reelection as governor of what used to be a swing state has a lot to sell,\" said Whit Ayres, a veteran Republican pollster. \"He´s got to do a better job of selling than he has done over the last six weeks.\"FAST AND FURIOUSFriendly state lawmakers have moved at a relentless pace during the session to equip DeSantis with tools to make the case that he stands as his party's leading warrior pushing back against rampant crime, illegal immigration and liberal polices favored by educators and investors.\"He got everything he wanted,\" said Ron Book, a longtime Republican lobbyist in Tallahassee, Florida´s capital.On Tuesday, DeSantis signed a bill that forbids asset managers in the state from using environmental, social and governance (ESG) considerations when making investment decisions and prohibits banks from denying loans based on borrowers' political beliefs.",
        "He has said he expects the legislature to finish a bill this week that would eliminate funding for diversity and inclusion programs at Florida's public universities.He also is waiting for lawmakers to amend last year's law prohibiting gender-identity instruction to young students to add a ban on educators using pronouns different than the one a student was born with.Legislators are still wrangling over a bill that would ban gender-affirming care for minors, and it remains unclear whether a version will pass before the session ends Friday.DeSantis has presided over a major expansion of the state's voucher program that allows all students in kindergarten through 12th grade to receive taxpayer-funded assistance to attend private schools - long a goal of conservative activists.The governor can trumpet a bill he signed on Monday that expands the state´s death penalty law to include criminals found guilty of raping a child under 12, in defiance of U.S. Supreme Court rulings on the issue. Earlier, he signed a measure that scrapped the state requirement that a jury must be unanimous to return a death sentence.Lawmakers on Tuesday passed an immigration measure that would provide more money for DeSantis´ program for relocating undocumented migrants. However, language that would have made it a crime for Florida residents to transport or house migrants within the state was stripped from the bill after fierce pushback.",
        "On guns, DeSantis and the legislature didn´t go as far as some gun-rights advocates wanted. But a new law that allows residents to carry a concealed weapon without a permit or training could still help give him traction with conservative voters.\"Nobody in the party can call him a squishy moderate,\" said David Jolly, a former Republican U.S. representative from Florida.POTENTIAL PERILSThe six-week abortion ban remains the thorniest outcome of the session for DeSantis´ national aspirations. The governor did not expressly advocate for the bill, and he signed it without fanfare to replace the current 15-week ban.The issue has turned radioactive for Republican candidates in general elections. It was instrumental in helping Democrats ward off heavy losses in last year´s midterms and was central to a liberal judge's recent victory in a high-profile Wisconsin Supreme Court race.\"It would have been helpful for DeSantis to not have to relitigate the abortion issue right now,\" said Chris Stirewalt, a political analyst at the American Enterprise Institute.But, Stirewalt said, the strict abortion ban may aid DeSantis in early voting states such as Iowa and South Carolina that have large blocs of evangelicals.DeSantis will need a boost to wrest the nomination from Trump, who has maintained his grip on the Republican Party despite his 2020 election loss and his recent indictment on charges related to hush money payments to a porn star.",
        "When the legislative session began in March, the former president held around a 15-percentage-point lead over DeSantis, according to polling averages compiled by Real Clear Politics. Trump´s lead has nearly doubled since then.Even armed with a raft of new policy victories, Jolly said, DeSantis has to be concerned that his poll numbers have slid as he has tried to raise his national profile with a book tour, interviews and a multi-country overseas trip.\"The more people see him and get to know him, the less they like him,\" Jolly said. \"The question is how does he turn that around? That´s his biggest struggle.\" (Reporting by James Oliphant; Editing by Colleen Jenkins and Jonathan Oatis)"
    ]
}