{
    "articleURL": "/wires/pa/article-12040713/Boy-cystic-fibrosis-rare-genes-make-one-four-world-needs-treatment-live-close-normal-life.html",
    "content": [
        "A baby who was diagnosed with cystic fibrosis at just 20 days old and has a rare one in two billion genotype – meaning “there’s probably more chance of him winning the lottery twice in one go” – needs funds for new treatment to help him live “close to a normal life”.",
        "Jason Moore’s son Luca, a “happy, chatty” and “cheeky” 19-month-old, was diagnosed with cystic fibrosis (CF) – an inherited condition that causes sticky mucus to build up in the lungs and digestive system – at nearly three weeks old after a blood screening.",
        "Jason, 34, a personal trainer, and his partner Becki, 31, a paediatric nurse, have to give Luca several different medications each day and assist him with physio sessions, which involve moving his body to help him clear the mucus, which is like “glue”, from his lungs.The couple, who live in Southampton, “chase him around the house, throw him up in the air”, and “bounce him around”, as the more he laughs and coughs, the easier it is for him to breathe.",
        "While Luca is “always smiling” and loves being outside and playing football, Jason said his son is among the 10% of people with CF who cannot currently benefit from modulators – a form of treatment for the condition – or are unable to take them due to the side effects.This is due to his rare genetic make-up – his genotype – which Jason said makes him “one of four in the world”.",
        "Jason is on a mission to raise money to fund research into new treatment which could help to change Luca’s life “for the better” – and he recently ran the 2023 TCS London Marathon, receiving more than £4,000 in donations for the charity Cystic Fibrosis Trust.",
        "“We found out that the drugs that are working wonders for people, unfortunately, Luca is not able to benefit from,” Jason said.“That’s because there are so few people with his genotype, there’s just not been enough testing done… but we’re not going to stop until he can get that benefit.“Our hope for Luca’s future is that he is happy and able to enjoy life to the fullest and experience the world and all the opportunities he wants to.”",
        "Luca was born on September 4 2021 with no complications, but within the first few days of his life, Jason and Becki noticed he had started “straining” and tensing his limbs.The couple were reassured by doctors that this was “completely normal”, but days later, when Luca was 20 days old, they received the heart-breaking news that he had CF.This followed a blood spot screening, also known as a heel prick test, which involves taking a blood sample to find out if a baby has one of nine rare but serious health conditions.",
        "“It was tough,” Jason said.“It’s all a bit of a blur, to be honest, what actually happened at that time.“We were just told everything, the worst possible outcome, and then they said, ‘This is how we combat A; this is how we combat B’, and they broke down all his medication.",
        "“The first couple of days were completely new to us and him, but literally, after a couple of weeks, it became second nature… and we wouldn’t have him any other way.”The diagnosis was a “huge shock”, but Jason and Becki were then told “there are only three other recorded genotypes like Luca’s, so he’s one of four in the world”.Jason said Luca has inherited two different cystic fibrosis genes from each parent, both of which are rare, and those genes together are extremely rare.",
        "He said discovering this days after the CF diagnosis was “crazy”.“He’s got such a rare genotype, it’s basically unheard of,” Jason said.“It’s crazy to hear that there’s probably more chance of him winning the lottery twice in one go than there is of him actually having his genotype.",
        "“So, for that reason alone, I think he’s going to be a special kid.”Luca has to take many different medications each day, including antibiotics; Creon, which aids digestion; salt; an inhaler to deliver medicine directly into the lungs; and omeprazole to treat reflux.He has physio sessions at least twice a day to help him clear the build-up in his lungs and chest, and has monthly check-ups at Royal Hampshire County Hospital in Winchester.",
        "According to Cystic Fibrosis Trust, people with CF are vulnerable to different bacteria which can be harmful, so Luca’s hygiene is extremely important – and his risk of contracting infections prevents him from doing certain activities.Jason said his son cannot play in paddling pools, rivers or sandpits, and cannot use bath toys which have any holes in them due to the risk of bacteria, such as Pseudomonas, developing.This poses challenges for the family but Jason and Becki try to find a balance so he “doesn’t miss out”.",
        "“I always dreamed of having a little boy who’s just going to play and get his hands dirty – go out, fall and just get back up again,” Jason said.“But whenever I see him falling now, I think, ‘Oh, I need to go and wipe his hands’.“I never really wanted to be that dad, and I’m sure Becki didn’t want to be that kind of mum, but that is definitely where it’s affected me, mentally.",
        "“It’s trying to find a balance so that he doesn’t miss out.”Jason said Luca is “always smiling” and “trying to make everyone laugh”, despite living with CF – and he wants to “let him live as much as possible” without too many restrictions.This inspired him to run the London Marathon to help increase awareness of CF and raise funds for further research into new treatment which would allow Luca to live a more “normal” life.",
        "He completed the race in three hours and 56 minutes and has raised more than £4,000 so far – but Jason and Becki do not want to stop there, as they are hoping to double this figure and are organising a CF charity golf day.Jason said Luca is “a very clever boy” and “has a real understanding of life already”, but having access to the right treatment would change his life significantly and “for the better”, as he would not have to take as many medications and his lung function would improve.",
        "“He’s a cutie; everyone who meets him just loves him,” Jason said.“My dad said to me that where he lacks in something, which is obviously his CF, then he’s going to make up for it in something else, and I think he genuinely will.",
        "“Getting access to treatment that he’s eligible for would change daily life for him in a way where he wouldn’t have to take as much medication, and his lung health would improve.“So it would be very close to a normal life.“He would still have to be aware and conscious of his surroundings, and probably set certain rules for himself as he gets older, but daily life would certainly change for the better.”",
        "Visit Luca’s Instagram page at www.instagram.com/thelifeof.luca, or the fundraiser at 2023tcslondonmarathon.enthuse.com/pf/jason-moore.To find out more about next year’s 2024 TCS London Marathon, and how to run for Cystic Fibrosis Trust, visit: www.cysticfibrosis.org.uk/2024-tcs-london-marathon."
    ]
}