{
    "articleURL": "/wires/reuters/article-12046079/FOCUS-Novo-Nordisk-rivals-room-compete-100-bln-weight-loss-drug-market.html",
    "content": [
        "By Michael Erman",
        "NEW YORK, May 4 (Reuters) - The enormous demand for weight-loss treatments like Novo Nordisk´s Wegovy could support as many as 10 competing products with annual sales reaching up to $100 billion within a decade, mostly in the United States, industry executives and analysts said.More than half a dozen companies, from Pfizer Inc and Amgen Inc to smaller players like Altimmune Inc , are working on weight-loss therapies similar to Wegovy, viewing them as important future growth drivers.Novo was first to introduce an effective treatment shown to help people lose up to 15% of their weight. Eli Lilly and Co is expected to receive a U.S. weight loss approval for its similar drug, Mounjaro, later this year.Both treatments are given by weekly injection and belong to a class of drugs known as GLP-1 agonists originally developed to treat type 2 diabetes. In addition to controlling blood sugar, they affect hunger signals to the brain and slow the rate at which a person's stomach empties, making them feel full longer.Would-be rivals see room for treatments that are more convenient or provide additional health benefits. Even a small share of the market could be worth billions.\"We're going full guns on this,\" said Bill Sessa, chief scientific officer at Pfizer's Internal Medicine Research Unit. \"If we can accelerate, we will.\"",
        "The company has two oral GLP-1 drugs in mid-stage trials, and aims to choose one for a late-stage trial this year. An obesity therapy \"is going to be one of the main drugs for Pfizer moving forward,\" Sessa said.Over 650 million adults worldwide are obese, more than triple the rate in 1975, and roughly another 1.3 billion are overweight, exacerbating conditions such as heart disease and diabetes, according to the World Health Organization.The United States is expected to account for as much as 90% of weight-loss drug sales due to the number of potential patients and higher pricing than other countries, industry analysts and executives say.\"We're seeing a sea change in how we treat metabolic conditions,\" said BMO Capital Markets analyst Evan Seigerman. He forecasts GLP-1s or similar drugs topping $100 billion in annual sales early in the 2030s, with Lilly's product accounting for more than $50 billion in sales.Morningstar analyst Damien Conover believes the weight loss market will be similar to lucrative categories like cholesterol-lowering statins and blood pressure drugs \"where the fifth, sixth, seventh, eighth to market were blockbuster drugs,\" with annual sales topping $1 billion.UNMET NEEDPfizer believes an oral therapy will appeal to people who want to avoid injections. The company plans to enroll some patients in its late-stage trial who have already used Wegovy or Mounjaro to show they can effectively switch to the Pfizer alternative.",
        "Eli Lilly is working on an oral GLP-1. Novo Nordisk already offers Rybelsus, an oral version of the same compound (semaglutide) in Wegovy for diabetes, although its success has been limited.\"More treatment options to help improve the lives of those living with obesity are good advancements for patients and a testament to the significant unmet need of addressing obesity,\" a Novo spokesperson said. Dr. Jamie Kane, chief of obesity medicine at New York's Northwell Health, called the new weight-loss drugs \"very promising.\"\"And you never know who will respond better to one versus the other, so having a variety of similar but not identical products will probably be helpful,\" Kane said.Doctors expect patients will need to stay on these drugs long term to maintain their weight loss. Last year, a Novo Nordisk-funded study found patients regained about two-thirds of their lost weight a year after stopping treatment.Smaller biotechs are also vying for a piece of the obesity market and hope large pharmaceutical companies will pay up for partnerships.\"There's interest from multiple parties who want to play in the space,\" said Altimmune Chief Executive Vipin Garg.The company's pemviditude, which targets GLP-1 as well as another hormone called glucagon, is in Phase 2, or mid-stage, trials. Garg says the combination could help reduce liver fat that contributes to a condition called NASH, or nonalcoholic steatohepatitis, another large unmet need.",
        "\"I don't know if it's $90 billion or $80 billion or $50 billion. Does that really matter in the end?\" he said. \"Even just 10% of that market size is a very significant slice of the pie.\"Germany's Boehringer Ingelheim is testing a similar dual-action therapy developed with Danish biotech Zealand Pharma .OPKO Health has completed a Phase 2 trial of its obesity drug that it expects will have fewer side effects. The current GLP-1 drugs can cause nausea and vomiting.China's LeaderMed has agreed to develop and sell OPKO's compound there. OPKO is also in talks with larger Western drugmakers for a partnership.\"This is not a market that you can ignore,\" said OPKO president Elias Zerhouni, Sanofi's former research chief. \"It's going to be a 5 to 10 company market.\"(Reporting by Michael Erman; Editing by Michele Gershberg and Bill Berkrot)"
    ]
}