{
    "articleURL": "/news/article-12052429/Karl-Lagerfelds-cat-Choupette-left-1-5-MILLION-inheritance.html",
    "content": [
        "Karl Lagerfeld's cat Choupette was left $1.5million by the late designer, who passed away in 2019 at the age of 85The logistics of leaving loads of cash to a pet is a gray area, however, in France, where Choupette resides, pets are considered property and cannot inherit Lagerfeld could have left the money to a caretaker, a foundation, or a nonprofit with stipulations that the money be used for Choupette's care Karl Lagerfeld's cat Choupette was left $1.5million by the late designer, who passed away in 2019 at the age of 85, but it's not clear-cut how exactly the feline will get her paws on the massive inheritance. ",
        "It has become increasingly popular for the ultra-wealthy to leave behind millions to their beloved pets to be able to maintain their upper-class lifestyles after their owners pass away. However, the logistics of leaving loads of cash to a pet is a gray area. Choupette is now richer than most people on the planet. Critics can imagine her dining on the most expensive bowl of kibble - if she even dares eats such a mundane pet food - in her Lucy Balu x Choupette designer bowls and sleeping on only the softest of beds. As her Instagram already shows, she travels in style in a $250 Lucy Balu x Choupette carrier or a $2,000 Louis Vuitton carrier - a far cry from the $20 standard mesh carrier from Amazon - and flies on marvelous private jets. She's even too cool for the Met Gala, with the feline seen opting for a midday nap at home rather than showing up at the exclusive event - although references to her were certainly in abundance. So, how does a blue-cream tortie Birman cat inherit her millions? ",
        "The simple answer...She doesn't. In France, where Choupette resides - as well as in the United States and the United Kingdom - pets are considered property, and therefore, cannot inherit a cent. ",
        "'In France you cannot name a pet as a beneficiary. In order for a beneficiary to receive an inheritance, it has to be a physical person or a foundation,' an international inherence lawyer, Valerie Duane-Dray, told CBS News in 2019. However, there are still multiple ways one can leave behind money to ensure a pet's well-being. Although, it's unclear what method Lagerfeld chose. ",
        "The most common method is to leave the money to the new caretaker, as an animal can be left to someone in the will. Lagerfeld's cat also has her own source of income, including modeling work, collaborations like Lucy Balu, and she is the subject of two books, among other assets. 'She has her own little fortune,' Lagerfeld once said. 'She is an heiress. If something happens to me, the person who will take care of it will not be in misery. 'She's a rich girl!' Lagerfeld could have also created a foundation which has the sole mission to care for little Choupette However, in Germany - where Lagerfeld was born - one can leave money behind for an animal. ",
        "Regardless of how Lagerfeld left the money for Choupette, the little kitty has been living the high life since his passing, although she often posts tributes to her father. ",
        "As last Monday's Met Gala was in honor of her father's designs and fashion career, Choupette revealed she had been invited to walk the red carpet in 'tribute to Daddy,' but she opted to a more cozy experience. 'We pay tribute to my Daddy every day since his parting and we are very moved to see one more day dedicated to him,' she wrote on Instagram. In February, the feline honored the fourth anniversary of her father's 'hasty' departure by saying he will 'always' be in her heart. 'You are no longer where you were but you are still where I am...I miss you daddy,' she wrote. "
    ]
}