{
    "articleURL": "/sport/football/article-12050955/Liverpool-boss-Jurgen-Klopp-gives-verdict-clubs-decision-play-national-anthem.html",
    "content": [
        "Liverpool reluctantly agreed for the national anthem to be played on SaturdayIt comes despite there being a high chance that it will be booed by supporters Jurgen Klopp insisted he held the same stance as the club despite the concernsJurgen Klopp has given his verdict on Liverpool's decision to play the national anthem before their clash with Brentford on Coronation Saturday.",
        "The Reds have reluctantly agreed to play God Save the King despite the prospect that supporters could drown the anthem out with boos as they have done so before. There has been a huge focus on the club since the Premier League contacted its members last week and advised them to mark the coronation by playing God Save the King. There was no directive from the governing body that this was compulsory.The club were aware, though, that to not play God Save the King would see them subjected, in all likelihood, to a nationwide backlash. As such, players and officials will gather around the centre circle before kick-off when the anthem is played.Klopp though said he agreed with the club's decision, while speaking to the media on Friday ahead of their clash with Brentford.Asked about the coronation in the first question of the press conference, he responded: 'The club’s position is my position. That is clear. Besides that, this is definitely a subject which I cannot really have a proper opinion about. I am from Germany, we don’t have a king or a queen, I am 55-years-old and I have no experience of that. ",
        "'Watching from the outside, it is a nice thing to watch when all the weddings are massive things in Germany but no one really knows what it is like. It is like watching a movie. We don’t feel that. ",
        "'That is it pretty much. I am pretty sure a lot of people in this country will enjoy the coronation, some will not be interested and some will not like it. That is it and that is over the whole country. That is all I can say about it. The club’s position is my position.Liverpool do not want to be in a position where they disrespect anyone and it is for that reason they will go along with every other Premier League club. Privately though, there is anger within Anfield towards the Premier League due to the position they have been put in. Liverpool had been planning to use the game against Brentford as an opportunity to celebrate the start of Eurovision week in the city and tie in their Foundation ay to mark 20 years of charitable work in the city. But it is now a case that what happens with the national anthem will dominate the wider focus.Liverpool fans gave a preview of what could take place this weekend during their 1-0 victory over Fulham on Wednesday. Supporters could be heard chanting: 'You can stick the coronation up your a***.'Sections of Liverpool’s support have booed the anthem in recent years, most notably at Wembley before the FA Cup final last May, when Prince William was guest of honour. ",
        "However a minute's silence held at Anfield to mark the death of Queen Elizabeth II was generally well observed. "
    ]
}