{
    "articleURL": "/femail/article-12046413/I-got-restraining-order-school-run-sexual-harassment.html",
    "content": [
        "Sabrina Cowley, 43, from Cheshire, revealed she was sexually harassed by a dadSimon Rowland, 50, was handed a restraining order and ordered to stay awayRead More: Cleaner wins £13K payout after suing her boss for sexual harassmentA horrified mum has revealed she was sexually harassed by a dad on the school run.",
        "Sabrina Cowley, 43, from Knutsford, Cheshire, thought Simon Rowland, 50, was just a friendly parent when he began chatting to her in the schoolyard.But she soon became uncomfortable after he made lewd comments about her skirt and gave her his hotel room number.Rowland, who hit the headlines in 2017 after winning £44,000 on a scratch card, was handed a restraining order in November 2022 and ordered to stay away from Sabrina.The mum-of-three said: 'I tried to ignore him for as long as I could, but it got very awkward in the playground. It was cringey at first but then I started to feel intimidated and anxious.",
        "'I've had abuse from members of his family since he was in court, yet I am the victim in all of this.'It's not OK for certain men to treat women like objects and say whatever comes into their heads. Attitudes have to change, and I hope I can help by speaking out.'Sabrina first got chatting to Rowland early in the summer of 2022 as they dropped their children at primary school, and he at first seemed friendly.She said: 'He'd had an amputation below the knee and told me he'd been in an accident and that was why he was a stay-at-home dad.",
        "'He was fine at first, just another parent, but then he started saying: 'Hello beautiful' and telling me how nice I looked. 'I run classes in pole fitness and I am used to men occasionally trying to overstep the mark, thinking they can push the boundaries, so I just gave him the cold shoulder.'But one day, I was leaning into my car, clipping in my daughter's car seat, and he came up right behind me and said: \"Well, Christmas has come early\".",
        "'It was really cringey. I was shaken up and I told him he was being inappropriate.'But days later, Sabrina spotted Rowland sitting on a pub wall opposite her home.The single mum, who also runs a market stall, said: 'He told me he was having trouble with his wife and he was staying in a hotel nearby. 'He gave me his room number and said I should join him if I fancied some company. Obviously I declined.'Days later, he tapped on my car window one day and told me, ''You looked so fit in that little black skirt the other day. I've never come out of school with an erection before.'''I was appalled, and I decided enough was enough. I couldn't even take my daughter to school without sexual harassment.",
        "'I spoke to the teaching staff and then I went to the police. I've been a victim of harassment in the past, and I put up with it for too long. I was determined not to make the same mistake again.'In November 2022 Rowland, of Knutsford, Cheshire, admitted harassment without violence. He was sentenced to a community order and issued with a 12-month restraining order. He was also ordered to pay £395 costs.Sabrina said: 'Since the court case, I've had horrible messages on social media, telling me it's my fault. 'In fact, I am the victim and it's important for women – and men – to feel confident to speak out about inappropriate behaviour.'I found the courage to speak out against a school-run sleaze ball and I think other women will be safer for it.'"
    ]
}