{
    "articleURL": "/wires/reuters/article-12046189/Copper-drifts-higher-possible-Fed-pause-gains-capped-China.html",
    "content": [
        "By Eric Onstad",
        "LONDON, May 4 (Reuters) - Copper prices ticked higher on Thursday after the U.S. central bank signalled it may pause rate hikes, but gains were subdued as investors worried about demand in top metals consumer China.Three-month copper on the London Metal Exchange advanced 0.9% to $8,547 a tonne by 1000 GMT, breaking two sessions of losses.The U.S. Federal Reserve opened the door to a pause in its aggressive tightening cycle on Wednesday after hiking interest rates by a quarter of a percentage point.\"Commodities have taken some cheer from those Fed comments, but it all seems rather muted,\" said independent consultant Robin Bhar.\"There are still a lot of worries out there: when is recession coming, how deep and how long, and the China story seems to be disappointing and fading over time.\"China's factory activity unexpectedly contracted in April as orders fell and poor domestic demand dragged on the sprawling manufacturing sector, which uses a vast amount of metals.The most-traded June copper contract on the Shanghai Futures Exchange closed almost flat at 66,920 yuan ($9,678.91) a tonne.Citi analysts said they were bearish on copper and downgraded their 0-3-month price forecast to $8,000 a tonne, from $8,500 a tonne previously.Nickel was the best performing LME metal, rising 1.6% to $25,135 a tonne, supported by tight inventories.",
        "Nickel stocks in SHFE warehouses &amp;lt;NI-STX-SGH&gt; fell to a record low of 1,426 tonnes on Friday, while LME levels &amp;lt;MNISTX-TOTAL&gt; dropped to 39,630 tonnes, the weakest in 15-1/2 years, data showed on Thursday.LME aluminium was little changed at $2,321.50 a tonne, zinc fell 0.4% to $2,619.50, lead dipped 0.2% to $2,127.50 and tin shed 1.9% to $26,260.For the top stories in metals and other news, click or ($1 = 6.9140 yuan) (Reporting by Eric Onstad Additional reporting by Mai Nguyen in Hanoi;Editing by Elaine Hardcastle)"
    ]
}