{
    "articleURL": "/home/books/article-12048733/CLASSIC-CRIME.html",
    "content": [
        "Private Lessonsby Bernard O’Keefe",
        "(Muswell Press £9.99, 368pp)With the violent death of a private tutor to the mega rich, Inspector Garibaldi is pitched into the world of hothouse parenting. For those in the money, no price is too high for access to the best schools and universities.Garibaldi finds that the late tutor — young, good looking and charming — had a devoted roster of students, none of whom will hear a word against him. Even so, he is convinced they are holding something back. Likewise their parents, whose priority is to protect their façade of upper-crust gentility.While Garibaldi struggles to make sense of what appears to be a motiveless crime, the complications multiply with a succession of knife-point threats against the victim’s friends and fellow tutors.As the secrets of the sheltered life of entitlement begin to emerge, the twists and turns of an exceptionally clever plot make for compulsive reading. In this, the second of the Garibaldi mysteries, Bernard O’Keefe proves to be a star turn.Murder in Dublinby Christina Koning",
        "(Allison &amp; Busby £19.99, 284pp)Blinded in the Great War, Frederick Rowlands finds that his other senses are more than adequate to make his reputation as a private detective.In this latest in a set of Christina Koning reissues, Rowlands comes to the aid of an old flame whose husband, Lord Castleford, an English-born landowner in Ireland, has been receiving death threats, presumed to be from Irish nationalists.",
        "Castleford refuses to take the threats seriously, even after Rowlands discovers that a riding accident involving his host was deliberately engineered. But matters take a yet more serious turn when Castleford is wrongly accused of the murder of his vindictive half-brother.Determined to see justice done. Rowlands is caught up in a family too much at war with itself to recognise the enemy within. With vivid characterisation and a keen ear for dialogue, Christina Koning has all the qualities of a first-class mystery writer.Dear Little Corpsesby Nicola Upson",
        "(Faber £8.99, 320pp)With the threat of a looming war, a mass evacuation takes children from the cities to the safety of the countryside.The central character in Nicola Upson’s brilliant mystery series — Josephine Tey, the renowned crime novelist from the golden age — is on hand to welcome the bewildered migrants to her Suffolk village.When, in the chaos and confusion of a makeshift operation, a young girl vanishes without trace, the blame is put on administrative bungling.But it soon becomes clear that more is at stake. Not all those who are ready to accept young strangers into their homes are acting selflessly. Ulterior motives begin to surface as Josephine, discreetly supporting her friend, Inspector Penrose, exposes the seamier side of a tight-knit community.",
        "The pain of separation and loss is a recurring theme of a story that, for Josephine, takes on a personal edge as her lover prepares to leave for America. The unforgettable impact on the reader raises this novel to a class of its own."
    ]
}