{
    "articleURL": "/wires/reuters/article-12044373/UPDATE-2-Soccer-More-plaudits-Haaland-Premier-League-scoring-record-broken.html",
    "content": [
        "By Lori Ewing",
        "MANCHESTER, England, May 3 (Reuters) - Manchester City's Erling Haaland continued his incredible debut campaign in England as he broke the record for most goals in a single Premier League season on Wednesday when he struck his side's second against West Ham United.The Norwegian goal-machine's chipped finish from a Jack Grealish pass in the 70th minute took him to 35, past the record he had shared with Alan Shearer and Andy Cole.\"It's a special night and a special moment. I'm really happy and proud. I don't know what else to say,\" Haaland told Sky Sports. \"I knew about the record, of course, but we tried to create chances to score and it wasn't easy because they wanted to defend. We struggled in the first half but they eventually came.\"The City players formed a guard of honour after the game at the Etihad Stadium, enthusiastically patting Haaland on the head as he ran through in celebration.His dad Alfie Haaland, who also played for City, watched from one of the boxes with a wide smile and accepted congratulatory handshakes from everyone around him.\"He deserved (the honour guard),\" manager Pep Guardiola said. \"All the team deserved it, because without the team he couldn't do it, but he's a special striker.",
        "\"We are very pleased for him, because he's a joy, not just to work with him, (as) manager, I think everyone is happy to have him with us. I think in football when there is a special occasion, we have to show how special it is, as (we did) today with Erling. To overcome Andy Cole and Alan Shearer - incredible top, top strikers, it's special.\"Both Shearer and Cole set their tallies in 42-game seasons.Haaland addressed the team in the dressing room, telling them \"I don't know what more to say but thank you guys so much\".He also praised team mate Grealish for his assist.\"I spoke with Jack before the game and he said he wanted to do the assist for the record-breaking goal,\" Haaland said. \"It was a perfect bounce, I didn't think to chip but the opportunity was there so I did it.\"Haaland, who is only 22 and in his debut Premier League season, has five more games to extend the record.He has also rewritten a handful of Champions League records, having taken just 27 matches to reach 35 goals in Europe's premier club competition. He was the youngest to reach 30 goals, beating French forward Kylian Mbappe by 116 days.He became only the third player in history to score five goals in a Champions League game in City's 7-0 rout of RB Leipzig in their last-16 game on March 14.",
        "Last week, he became the first player in England's top flight to score 50 goals in all competitions in a season since Tom Waring did so for Aston Villa in 1931. (Additional reporting by Martyn Herman Editing by Christian Radnedge and Toby Davis)"
    ]
}