{
    "articleURL": "/tvshowbiz/article-12049947/Bill-Wyman-86-looks-loved-wife-Suzanne-52-depart-Oswalds.html",
    "content": [
        "They married 30 years ago when she was only 18 to his 52 years - a scandal at the time.",
        "And Bill Wyman looked more loved up than ever with wife Suzanne Accosta as they departed private members' club Oswald’s holding hands on Thursday evening.The former Rolling Stones rocker, 86, couldn't contain his smile with the actress, 52, as they climbed into a taxi. He cut a casual look for the evening in a navy zip up jumper over a crisp white round neck T-shirt. The bass guitarist opted for a pair of black trousers which he teamed with a black bomber jacket and reading glasses. ",
        "Meanwhile his wife of 30 years looked stylish in a pink silk blazer and matching trousers which she wore over a plunging blue blouse. The beauty styled her long blonde tresses in luxurious curls as they cascaded past her shoulders and donned a pair of reading glasses. Bill and Suzanne married after Bill divorced his second wife Mandy Smith, whom the star had wed when she was just 18 to his 52 years - a scandal at the time.The couple share three daughters, Jessica Rose, Matilda Mae and Katherine Noelle, and live in London.Previously Bill discussed his controversial marriage to second wife Mandy, now 51.The rock and roll legend tied the knot with the singer and model in 1989 and candidly revealed he was 'really stupid' to think their union would work.",
        "The star made the confession in the documentary The Quiet One.Reflecting on his decision to marry the young blonde, he said: 'I was really stupid to ever think it could possibly work. She was too young. I felt she had to go out and see life for a bit.'",
        "However, the rocker felt their union was meant to be at the time, insisting that he was deeply in love with her.'It was from the heart. It wasn’t lust, which people were seeing it as', he says in the film, according to the NY Daily News.This marks one the first time in years Bill has discussed their controversial relationship, having previously touched upon their union in his 1991 autobiography, A Stone Alone.He wrote at the time: 'She was a woman at 13. Everyone accepted her as an adult without question.'Mandy first met the bass player in the mid 80s at the age of 13.The couple married when Mandy reached the legal age of eighteen and divorced two years later in 1991.Following the end of their romance, the blonde claimed she and Bill first engaged in sex when she was only 14.Wyman, who was one of the founding members of Rolling Stones, was part of the iconic rock group's line-up from 1962 until 1993."
    ]
}