{
    "articleURL": "/tvshowbiz/article-12041643/How-Blake-Lively-Ryan-Reynolds-set-join-Hollywoods-billionaires-club.html",
    "content": [
        "READ MORE: Who else is a member of Hollywood's Billionaires Club? Blake Lively and Ryan Reynolds are one of Hollywood's biggest success stories, with smart investments leaving the couple on the brink of joining the coveted Billionaires Club. ",
        "The couple have funnelled their acting millions into various ventures, from launching their own drinks brands, to mobile phone businesses, to the $2.5 million purchase of Wrexham FC.While it's thought that Blake and Ryan have a net worth of nearly $500 million, their multiple business deals have likely raised this figure far higher.And while Ryan and Blake have delved into other businesses in recent years, both are still huge draws in Hollywood too.So, MailOnline has taken a look at how Blake and Ryan have accumulated their incredible wealth, as they look set to join Hollywood's billionaires club...",
        "While his darkly comic portrayal of the flawed superhero Deadpool in the eponymous 2016 and 2018 films made him one of Hollywood's highest-paid actors, it is Ryan's off-screen ventures — not least his $2.5 million purchase of non-league Welsh football team Wrexham in 2020 — that have attracted increasing attention.Joining forces with actor Rob McElhenney, the pair's purchase of the club, and its journey to promotion, appeared in a Disney+ series titled Welcome to Wrexham.It was a purchase that paid off in spades, as Wrexham finally earned promotion back into the Football League last month, to the delight of its fans.It's since been announcd Ryan and Rob plan to take the team on a US pre-season tour, with friendly matches against huge clubs including Chelsea, Manchester United and MLS reserve side LA Galaxy II.",
        "The celebrity owners will also reportedly jet the team off to Las Vegas as a reward for winning the National League with a record total of 111 points.It's also been reported that Ryan could be set to takeover another sports team after celebrating promotion with the former National League outfit.He is now embarking on a venture that will see him lead a group submitting a £795m bid to buy National Hockey League's, Ottawa Senators, according to the Ottawa Sun. This isn't to say that Ryan hasn't cashed in on his huge acting success as well, earning an additional $22.5 million through box office profits after being paid $2.5 million upfront for Deadpool in 2016.",
        "For the sequel two years later, the involvement of his production company meant he earned a rumoured $40 million alone for the film.Earlier this month, the investment that Reynolds had made in Mint Mobile, a budget phone business, earned him $306 million when communications giant T-Mobile announced it was buying the company for more than £1 billion.Given the couple — who have four young children — were previously estimated to be worth $183 million, this means they almost doubled their fortune overnight from a single investment.In 2020, he made millions when Aviation American Gin, an artisanal spirits company he co-owned and for which he was the public face, was snapped up by British drinks giant Diageo in a deal that involved an upfront payment of $340 million but could ultimately be worth $619 million.",
        "Reynolds, who was believed to have owned 20 to 25 per cent of the company, remains involved in the business.Ryan also invests in Canadian wealth-management service Wealthsimple — valued at $5.1bn — and works with Canadian password-management software company 1Password, which is worth $6.9bn.He's found a suitable partner in Blake, who has also shown an entrepreneurial side, launching Betty Buzz, a range of non-alcoholic sparkling drinks.",
        "The actress is also a 'brand ambassador' for luxury names including Chanel, L'Oreal and Stella McCartney.In 2012 it was also reported that Blake earned over $3.8 million for a deal with high end fashion firm Gucci.Ryan and Blake have also recently begun expanding their property empire, buying a $1.9 million home in north Wales close to Wrexham's home ground.They also reside in a seven bedroom $5 million mansion in Bedford, New York, with famous neighbours such as Catherine Zeta-Jones and Matt Damon."
    ]
}