{
    "articleURL": "/wires/afp/article-12042015/Talks-Ethiopia-Oromo-rebels-end-without-agreement-govt.html",
    "content": [
        "Initial talks between Ethiopia's government and the Oromo Liberation Army (OLA) rebel group ended on Wednesday without yielding any agreement, both sides said, while voicing willingness to pursue the dialogue.",
        "The foes kicked off preliminary negotiations last week in Tanzania, meeting in the semi-autonomous region of Zanzibar.The OLA, an armed insurgent movement from the country's Oromia region, has been fighting Addis Ababa since it split in 2018 from the Oromo Liberation Front (OLF) when that group renounced armed struggle.The Oromo community, Ethiopia's largest ethnic grouping, has long complained of marginalisation.\"While the talks have been largely constructive, unfortunately, it was not possible to reach an agreement on some issues during this round of the talks,\" the Ethiopian government communications service said in a statement, without elaborating on the sticking points.It added however: \"Both parties have acknowledged the need to continue these talks with a view to resolving the conflict permanently and peacefully.\"The OLA, which has been listed as a \"terrorist\" organisation by the Ethiopian authorities since 2021, issued an almost identical statement.\"While understandings were reached on some outstanding issues, unfortunately it was not possible to reach an agreement on key political matters during this round of talks,\" it said.Since the OLA broke off from the OLF and started fighting, a string of armed groups in Oromia have risen up claiming to be part of its cause, although they are only loosely tied.The OLA's strength, estimated at a few thousand men in 2018, has increased significantly in recent years, though observers believe it is insufficiently organised or well-armed to pose a real threat to the federal government.",
        "Oromia, which surrounds the capital Addis Ababa and is Ethiopia's largest and most populous region, has suffered ethnic massacres in recent years carried out by unknown groups.The OLA has been repeatedly accused by the government of Prime Minister Abiy Ahmed -- himself of Oromo descent -- of being responsible for the killings, a charge it denies.The government is accused of waging an indiscriminate crackdown that has fuelled Oromo resentment against the central government.A mosaic of more than 80 ethno-linguistic communities, Ethiopia has struggled to manage rival claims to territorial and political power."
    ]
}