{
    "articleURL": "/wires/pa/article-12059929/Mixed-emotions-Gavin-Gunning-Swindon-beat-Crawley.html",
    "content": [
        "Swindon caretaker boss Gavin Gunning said his players failed to properly execute their game plan despite earning a 2-1 victory over Crawley.",
        "New manager Mike Flynn watched from the stands after signing a two-year contract as Swindon ended their season with a win.But Gunning said: “We didn’t really implement the game plan too well, even if we did score the two goals.“It was a bit of a basketball game and there wasn’t a lot of quality in the game but the moments there were came from us.“They had a couple of half-chances and the penalty is just a bit slack, maybe the boys got a bit tired.“I just wanted [Charlie] Austin to be playing in a deeper role, he is a clever player but unfortunately it didn’t go that well.",
        "“He [Austin] played quite well but the game plan wasn’t going fantastically, it was a bit hit and miss.“The decision making wasn’t great but we won the game and that is the main thing we were looking for from the match.”Crawley fooled Swindon with an early corner as it was played to the edge of the area to give Ben Gladwin space to strike, his low effort taking a deflection and going just wide.With the first half drawing to a close, Jacob Wakeling flicked a header beyond the Crawley backline and Austin charged clear of the defenders before drilling the ball into the bottom corner.",
        "Two minutes later Jake Cain lined up a free-kick from 30 yards and it flew into the top corner, with Corey Addai unable to get close to it.The Red Devils pulled one back after Saidou Khan’s late challenge on Nick Tsaroulla in the area gave Crawley a penalty, which Dom Telford stroked coolly home.Minutes later Swindon had a penalty of their own when Rushian Hepburn-Murphy was brought down. He took it himself but Addai guessed right and made a fine stop.Boss Scott Lindsey felt Crawley played with the right principles, even if they didn’t get the result against his former club.He said: “We were in the game and very good with the ball at times. We kind of got locked in a little bit in the first half and couldn’t get out in moments.“The first goal came from that where we’re trying to play and we get caught and we’re open a little bit and Charlie takes a takes his goal really well – as he does.“We’re disappointed with the result but we thought we played in the right vein, played in the right manner. We created quite a bit in the second half.“I’m here to stay obviously. I’ve enjoyed my time, enjoyed the supporters. I want to improve the squad moving forward and not be in this position next year.”"
    ]
}