{
    "articleURL": "/wires/reuters/article-12040697/Thai-PM-candidate-Paetongtarn-resume-campaign-birth-child.html",
    "content": [
        "Daughter of ex-PM Thaksin says child \"a blessing\"",
        "Says party can partner with those supporting its policiesMove Forward's Pita edges out Paetongtarn in new PM surveyThaksin return would be unrelated to politics - daughterBy Panu Wongcha-um and Chayut SetboonsarngBANGKOK, May 3 (Reuters) - One of Thailand's leading prime ministerial candidates Paetongtarn Shinawatra on Wednesday said she would next week resume campaigning after giving birth a few days ago, and remains confident of a landslide election win.Paetongtarn, 36, the frontrunner in many opinion polls for the May 14 election, made her first public appearance in a month to unveil her second child Prutthasin, nickname Thasin, who was born on Monday.Her Pheu Thai Party is also leading in recent polls and has won every election since 2001, including two in landslides.\"Thailand needs to change and the Pheu Thai party is the only answer,\" she told a press conference at a Bangkok hospital, shortly after introducing her new child in an incubator, whom she described as \"a blessing\".\"We can't wait anymore ... If Pheu Thai can win a landslide and be government, we can make change straightaway.\"Most analysts expect Pheu Thai will fall short of a landslide and will need to form an alliance, which it failed to do in the 2019 election. That was the first poll held since the government of her aunt, Yingluck Shinawatra, was toppled in a 2014 coup.",
        "Another opposition party, Move Forward, is widely seen as the most likely partner and is now seeing a late surge in polls.A nationwide survey of 2,500 people by the National Institute of Development Administration on Wednesday showed the party's charismatic leader Pita Limjaroenrat ahead of Paetongtarn for the first time, with 35.4% compared to her 29.2%.Asked about a Move Forward alliance, she said Pheu Thai would join \"with parties that support our policies\" and ruled out military-backed rivals.The Shinawatra family remains divisive in Thailand, loved by many for its years of populist policies but reviled by some of the country's most powerful families and institutions.Paetongtarn's father Thaksin Shinawatra was prime minister for five years before he was ousted by the military in a 2006 coup. He and sister Yingluck are both in self-imposed exile to avoid jail time for abuse of power, charges they say were politically motivated.On Monday, Thaksin, 73, reiterated on Twitter a promise that he would return to Thailand after 15 years in exile. Paetongtarn on Wednesday stressed any homecoming would be unrelated to politics.\"Dad wants to come back to take care of his grand kids. He didn't say he wants to be prime minister,\" she said. (Editing by Martin Petty)"
    ]
}