{
    "articleURL": "/tvshowbiz/article-12037975/Sydney-Sweeney-shows-corset-wore-Miu-Miu-gown.html",
    "content": [
        "Sydney Sweeny shared a behind-the-scenes post to Instagram on Tuesday morning of what it was like getting ready for the Met Gala.",
        "The Euphoria actress was seen in her underthings just before she hit fashion's biggest event.The blonde beauty wore a nude and semi sheer corset to pull in her waistline and push up her chest.The 25-year-old newcomer smiled as she posed in the skimpy item while still in her hotel room in New York City.The Hollywood IT girl captioned the post, 'Moments before the met with @miumiu.'",
        "The actress had her hair down and was already fully made up as she added her high heels.Sweeney had her glam team around her to make sure all was good before the dress was slipped on.When at the Met Gala, she shined on the white carpet with red and blue striped.She also was not wearing her engagement ring from fiancé Jonathan Davino.The movie star has been making headlines lately.She was accused of flirting with her Anyone But You costar Glenn Powell, who is best known for his turn in Top Gun 2 opposite Tom Cruise.This weekend Sweeney and her fiancé stepped out on a date night after speculation their romance was on the rocks. ",
        "The actress and her restauranteur husband-to-be Davino, 38, were spotted walking in New York on Friday.This comes days after rumours had swirled she had a fling with Powell.",
        "Despite Sydney previously being seen without her four-carat engagement ring, worth an estimated $150,000, TMZ reported a source told them 'all is well' between the couple, who have been engaged since February 2022.Speculation has been rife Sydney and Jonathan's relationship was in trouble after  star Glen's girlfriend Gigi Paris, 30, unfollowed the actress on Instagram.",
        "Fans believe they may have broken up because of his flirty friendship with his co-star, with Gigi fueling talk of a break-up from Glen by recently posting the cryptic message: 'Know your worth and onto the next.'Sydney and Jonathan were first spotted together in 2018.She told Cosmopolitan about how she stayed away from dating fellow celebrities: 'I don't date people in the spotlight. I don't date actors or musicians or anyone in entertainment because I can just be normal Sydthat way and it's easiest. I have a great support system.'She added about what she wants from a man: 'I look for a best friend. I need to be able to be with someone who I can literally hang out with 24/7 and never get sick of and we laugh every single day.'"
    ]
}