{
    "articleURL": "/news/article-12061467/Celia-Bean-Frenshham-Sydney-University-escort-manslaughter-charges-tradesman-Paul-Brown-Zetland.html",
    "content": [
        "Private school educated escort charged with manslaughterBeloved Sydney tradie was located in a fire escape Do you know more? Email tips@dailymail.com A private school-educated escort with a science degree has been charged over the death of a tradesman whose body was found in the stairwell of a Sydney apartment building.",
        "Celia Bean, 39, has been charged with manslaughter over the death of former reality TV contestant Paul Browne more than a year after his body was discovered in October 2021. ",
        "Before she became an escort, Bean was a horse-loving student at the exclusive Frensham School in the NSW Southern Highlands, an all-girls school that costs $35,000-a-year.     'To the greatest times I've known and to my darling teddy who I'll never see again... I love you', Bean shared on her Facebook account in 2019 alongside a photo of her childhood horse.After finishing school, Bean attended the University of Sydney, graduating with a Bachelor of Science degree in 2005. She also started a postgraduate diploma in education at the nearby University of Technology Sydney. On her LinkedIn account, Ms Bean said while she has an 'extensive knowledge of administrative environments' she is working toward a career in neuroscience to 'put my degree to use'.",
        "In the decade following her graduation, she was worked as a corporate receptionist, in a supermarket and more recently as a 'temp' worker, rather than in an scientific roles.",
        "Strike Force Bernacchi was established to investigate Mr Browne's death with Detective Inspector Phil Hallinan saying the alleged victim's family was 'devastated'.Police claim the 33-year-old, a much-loved construction manager, died of a drug overdose after consuming heroin and methamphetamine, which they allege Bean and her friend Shayne Johnson had organised to be supplied to him.",
        "The tradie is alleged to have driven to Ms Bean's apartment block from his home in the neighbouring suburb on October 7 2021.More than 19 hours later, his body was discovered in a stairwell, police say. ",
        "Bean and Johnson - also known as 'Teece' - were arrested before Christmas and remain before the courts. The pair have been been refused bail and are next due to face Downing Centre Local Court on May 25. A forensic pathologist previously told Parramatta Local Court that Mr Browne may have survived if medical assistance had been provided earlier.In a text message exchange between Bean and Johnson, police allege the pair tried to distance themselves from the incident and claimed not to be responsible for Mr Browne's death.The revelation comes as footage of emerged of Mr Browne auditioning for the singing show X-Factor in 2011, showing the construction worker in high spirits and having a laugh as he performed a ballad by Robbie Williams. When his audition was called 'terrible' by all four judges, the young man said it was likely because 'my mouth is a little dry' and 'the song wasn't in my key'."
    ]
}