{
    "articleURL": "/wires/reuters/article-12042445/JPMorgan-process-40-Russian-grain-export-payments--sources.html",
    "content": [
        "JPMorgan has already processed 1st payment for Rosselkhozbank",
        "More payments being prepared for JPMorgan's review - sourcesSuch payments are crucial in context of Black Sea deal talksRussia, the U.N. will discuss the Black Sea deal on FridayJPMorgan, the U.N. discuss Russian fertiliser exports - sourceBy Polina Devitt and Michelle NicholsLONDON/UNITED NATIONS, May 3 (Reuters) - U.S. bank JPMorgan Chase &amp;amp; Co could process another 40 Russian grain export payments, two sources said, as the United Nations seeks to save a deal allowing safe Black Sea exports of Ukrainian grain that Moscow has threatened to quit on May 18.Reuters reported last week that JPMorgan had processed the first payment for the Russian Agricultural Bank, which was cut off from the SWIFT payment system by the European Union in June over Moscow's 2022 invasion of Ukraine.Access to SWIFT for the Russian Agricultural Bank, known as Rosselkhozbank, is a key Russian demand in talks over the future of the Black Sea deal, brokered by the U.N. and Turkey in July last year.Russia has signalled that unless a list of demands is met to remove obstacles to its grain and fertiliser exports, it will not agree to extend beyond May 18 the Black Sea pact, which the U.N. says helps tackle a global food crisis that has been aggravated by Moscow's war in Ukraine.",
        "Talks between Russia and the U.N. on the Black Sea deal are expected to be held in Moscow on Friday, with the U.N. represented by top trade official Rebeca Grynspan.According to a document seen by Reuters that lists the United Nations' efforts, the U.N. is now working with the Rosselkhozbank to prepare about 40 additional payments to be processed by JPMorgan. The document also said the U.N. was discussing Russian fertiliser exports with JPMorgan.A source familiar with discussions said JPMorgan understood it could be asked to process another 40 payments for Rosselkhozbank and that it was ready to do so to help combat the global food crisis. The source said JPMorgan was also talking to the U.N. about Russian fertiliser exports.JPMorgan had been asked to help by the U.S. government, said the source.A JPMorgan spokesperson declined to comment. A spokesperson for U.N. Secretary-General Antonio Guterres declined to comment. The U.S. Treasury and Rosselkhozbank did not immediately respond to requests for comment.Russian Foreign Minister Sergei Lavrov said last week that Guterres had proposed that - as an alternative to regaining access to SWIFT - U.S. banks could help Rosselkhozbank with transactions. However, Lavrov said that could not work as a long-term solution.A source familiar with JPMorgan's first transaction last week described it as \"very limited and highly monitored\".",
        "Russia's grain and fertiliser exports are not subject to Western sanctions imposed following Moscow's invasion of Ukraine, but Moscow says Western restrictions on payments, logistics and insurance are a barrier to shipments.European Union and U.S. sanctions have also left the private sector wary of any dealings with Russia even when permitted.A senior State Department official said last week that Washington had broad exemptions in place for Russian food and fertiliser trade and that Rosselkhozbank was not blocked by sanctions.The Kremlin said on Wednesday that Russia would continue contacts with both the U.N. and other representatives in a bid to see its global grain and fertiliser exports improved. (Reporting by Polina Devitt in London and Michelle Nichols in the United Nations Editing by Mark Potter)"
    ]
}