{
    "articleURL": "/femail/article-12043487/Lara-Trump-insists-NO-fall-Ivanka-dropped-brothers-lawyer.html",
    "content": [
        "Ivanka, 41, hired her own attorney in Letitia James' fraud suit against the TrumpsShe cut ties with the lawyers who were representing her siblings Eric and Don Jr.Lara, 40, told DailyMail.com exclusively that there's no bad blood between themLara Trump has insisted that there's no bad blood between her sister-in-law Ivanka and the rest of the family, after it was revealed that the former First Daughter had dropped her brothers' lawyers in a $250 million fraud lawsuit against the Trumps.",
        "News hit the web last week that Ivanka, 41, had fired the attorneys who were representing her and her siblings Eric and Don Jr. in Letitia James' fraud suit against her family - with some suggesting that the move might be an indication that there is a froideur between Trump's eldest daughter and her siblings. Now, Lara, 40, has addressed those rumors head-on, telling DailyMail.com exclusively at the Rescue Dogs Rock NYC Cocktails For Canines event on Tuesday evening that everything is all good between them.'I think people are trying to make that a bigger deal than it really is,' she explained, while discussing Ivanka's decision to switch legal representation. ",
        "'It's not common to have to go through all this stuff that my husband and his siblings go through. 'They've had a series of different attorneys throughout this entire process and it just so happened that Ivanka felt closer to one, gravitated towards that [one].'She [may have] said, \"I'm going to have this person directly for me,\" but [the attorneys] all work as a team. I think that got lost in the story.' New York Attorney General Letitia filed a suit against former President Donald Trump last month, alleging that he, his three eldest children, his real estate firm, and its top executives falsely inflated property values to obtain cheaper loans.",
        "She is seeking $250 million – and is asking a judge to 'permanently' bar Donald and his adult children from doing business in the state. The Trumps have denied the claims.While it was first revealed that Ivanka, Eric, and Don Jr. had retained Clifford Robert and Michael Farina of Robert &amp; Robert to represent them, Forbes reported days later that Ivanka had split from the firm. The mother-of-three is now being represented by Bennet Moskowitz of the firm Troutman Pepper Hamilton Sanders, according to a court filing obtained by the outlet. When asked if she and Ivanka ever get together - since they both live in Florida - Lara told DailyMail.com, 'We do,' before quickly changing the subject, to talk about the strong bond she has with her father-in-law, Donald, instead.",
        "Lara and her husband, Eric, 39, reside in Jupiter, Florida, with their two kids, Carolina, three, and Eric Jr., five - which is a stone's throw away from where Donald and his wife, Melania Trump, settled after they left the White House in January 2021. ",
        "'It's actually great because when my kids say, \"Let's go to the beach,\" what I hear is let's go to grandpa's because we go down to Mar-A-Largo,' Lara told DailyMail.com.'We get to see grandpa quite often and he's always got chocolate and candy for my kids.",
        "'It's kind of crazy how we all ended up in South-East Florida. I love it, honestly, it's such a great place to be.'Even before Ivanka switched lawyers, speculation was swirling that there were tensions brewing between her and the rest of her family.A source told Us Weekly in November 2022 that Ivanka had a 'rotten time' towards the end of Donald's presidency and that she 'couldn't step away fast enough.' 'Even if her dad begged her to be involved in his campaign again, Ivanka would turn it down flat,' they added.",
        "'Her priority is to pursue a calm, low-key life now and enjoy her new professional start in the private sector, raise her family and stay away from the circus and volatility that will surely be coming along with her dad’s campaign.' Last year, Ivanka, who previously served as a White House advisor, announced she was stepping away from politics and would not be involved in her father's upcoming 2024 presidential campaign. Instead, she said she would be focusing on her children. 'I love my father very much. This time around, I'm choosing to prioritize my young children and the private life we are creating as a family,' she said. 'I do not plan to be involved in politics. While I will always love and support my father, going forward I will do so outside the political arena.'  ",
        "She, her husband, Jared Kushner, and their three kids - Arabella, 11, Joseph, nine, and Theodore, seven - have been living a much quieter life in Miami, Florida, since leaving the White House in early 2021.",
        "She's rarely ever seen with her dad, or the rest of her family for that matter, in public - and the last time she and Donald were seen together was in November 2022, at Tiffany Trump's wedding to Michael Boulos.One thing that may have put a strain on their relationship was the fact that Ivanka went against her father's claims that President Joe Biden's election was rigged during the hearing over the January 6 Capitol riots last year.At the time, Ivanka said she 'accepted' former Attorney General Bill Barr's determination that there was not evidence of fraud during the election.Afterwards, Donald railed against his own daughter in a scathing social media post.'Ivanka Trump was not involved in looking at, or studying, election results,' he wrote on the app Truth Social.'She had long since checked out and was, in my opinion, only trying to be respectful to Bill Barr and his position as Attorney General (he sucked).'"
    ]
}