{
    "articleURL": "/tvshowbiz/article-12044251/Jackie-O-shocks-colleagues-showing-work-best-looked.html",
    "content": [
        "She is looking better than ever following her recent 18kg weight loss.",
        "And radio host Jackie 'O' Henderson is now changing up her style as she enjoys her newfound confidence.Her co-host Kyle Sandilands was shocked when she showed up to work on Thursday sporting professional-looking hair and makeup.'This is the best you've ever... Well, I've seen you look good, but never this early in the morning,' a stunned Kyle said.'You look - let me tell you, I'm not joking - fantastic.' ",
        "KIIS FM newsreader Brooklyn Ross added: 'You look ready for a red carpet [or] TV.'Jackie, who was wearing a pair of $820 Fendi hoop earrings and a netted long-sleeved top, was thrilled by her colleagues' compliments.'Oh, that's so good you've said that!' she squealed.'Tomorrow I've got something on, and for the life of me, I cannot find anyone to do my hair and makeup for it,' she added.",
        "She then explained she was doing a 'practice run' for her big event on Friday.The Kyle and Jackie O Show is broadcast weekdays from 6am, meaning Jackie usually needs to wake up at about 4am to get ready for work.Often, she just throws on a plain outfit and keeps her hair and makeup minimal.Jackie recently revealed she'd shed a whopping 18kg in just five months, but was forced to shut down rumours it was due to taking a celebrity weight-loss drug.",
        "Many speculated she was taking Ozempic, but on Monday Jackie revealed her weight loss was done the old-fashioned way: by following a low-calorie diet, exercising regularly and cutting out alcohol.Kyle revealed he'd been asked by several guests at his wedding to Tegan Kynaston on Saturday whether Jackie - who is an ambassador for Weight Watchers - had been prescribed Ozempic to help shed the kilos. 'That diabetic medication people talk about taking, I don't take that,' Jackie replied.'Honestly, you can do it, guys... but I will say, I reckon [cutting out] alcohol and exercise was a big thing. I've never done [that] before so that was kind of the kicker for me,' she added.Kyle noted Jackie isn't 'big on needles', so would never be comfortable injecting herself with diabetes medication to lose weight.",
        "He went on to say her results came from following Weight Watchers, 'putting the wine bottle away' and ditching 'the biscuits and cheese'.Jackie, who recently started playing tennis regularly, added that quitting alcohol and embracing exercise 'was a big thing [she'd] never done before'. The mother of one also confirmed she didn't even drink alcohol at Kyle's wedding.It comes after Jackie recently reflected on her weight loss journey in a moving social media post.'Last year I joined WW again because I wanted to get my health back in order and I know their program works for me,' she wrote. ",
        "'Losing weight was never about what I looked like in the mirror, but rather an overall sense of well-being and trying to regain my energy levels,' she continued. 'Five months ago I was 18 kilos heavier and I had zero energy. My health was suffering as a result, so I decided to do a complete lifestyle change.'Jackie also recently spoke about her new diet on The Kyle and Jackie O Show, revealing she often skips breakfast, a practice known as intermittent fasting.She also avoids carbohydrates, and satiates her hunger throughout the day by snacking on pre-cut pieces of steak.'I cook steak and slice it, and then I'll just have a little sliver of steak if I'm hungry,' Jackie said.She resists splurging on high-calorie foods for lunch, opting to eat just 'three little slivers of steak' and a few Vietnamese rice paper rolls containing fish and cabbage. Kyle was shocked by her small portion size, telling her: 'A dog would eat more!'For dinner, Jackie usually eats vegetables and a protein such as chicken or red meat.",
        "In between meals, Jackie treats herself to smoothies and Starbucks Frappuccinos, a type of blended ice coffee drink.Jackie hasn't always followed such a restrictive diet.In February, she told Woman's Day she used to binge on pizza, sausage rolls and microwave meals from the petrol station before she took control of her health.",
        "'I was eating a lot of food that I could get in a hurry. You know, pizza and sandwiches and just takeaway, I wasn't cooking myself,' she said.'And I think it's always best when you know what you're putting into your body. I just got really lazy.'"
    ]
}