{
    "articleURL": "/wires/pa/article-12049617/Glimpses-coronations-past-revealed-major-insurer-s-archives.html",
    "content": [
        "Insurance giant Aviva has delved into its archives to reveal intriguing glimpses of previous coronations, as the final preparations are made to celebrate the anointment of the King.",
        "Its paperwork collection includes a letter from June 1911, requesting insurance against accident for a state coach during coronation celebrations for George V and Mary.The coach was insured for a sum of £3,000, equivalent to just over £285,000 today, according to Aviva, although the letter states: “Please note that the £3,000 may not be the full value of the old state coach.”The company that insured the royal coach in 1911 was General Accident Fire and Life Assurance Corporation, one of Aviva’s ancestor companies.Aviva’s archives also include commemorative adverts and proposals for insurance for “coronation celebrations”.",
        "One proposal outlines insurance terms for events involving between 250 and 10,000 guests, with “food, drink, fire and explosion risks” covered.It also cites claim examples from previous events, including “rope of swing fractured” and “maypole in playground collapsed”.Queen Elizabeth II’s coronation was also an exciting event for the company in 1953.One advert from 1953 from Norwich Union, which eventually became part of Aviva, announced that the best way to mark the occasion of the coronation was “by launching a pension scheme for your employees”.Another poster from the archives indicates that staff members celebrated with a cricket match between the Men of Hambledon and the Ancient Firemen, a team from Aviva ancestor company Commercial Union.",
        "Anna Stone, group archivist for Aviva, said: “Aviva’s origins can be traced back to 1696 when William III and Mary II reigned.“King Charles III is the 14th monarch we have operated under. Our archives house some delightful documents which track how fashions and trends have changed through the years – and also how some things have stayed the same.“The desire to celebrate remains strong and across the Aviva group, we’re looking forward to commemorating the occasion. We may well have a few new photos to add to our archives for the future.”Other royal connections in Aviva’s archives include the Hand In Hand Fire and Life Insurance Society insuring the royal wardrobe, where coronation robes and hangings were stored, in 1702.There were also references to Aviva’s heritage offices being decorated in 1831 for the coronation of King William IV. The London office of Union Assurance featured “ornamental lamps, prettily arranged”.Aviva said its archive also includes details of insurance policies for motor cars for Queen Elizabeth II, ranging from Daimlers used for official visits, to Land Rovers, private cars and Ford vans used on the royal estates, as well as golfing and livestock insurance taken out by her father King George VI."
    ]
}