{
    "articleURL": "/femail/article-12053827/Lip-reader-reveals-Lionel-Richie-said-Coronation-guest-getting-call-perform.html",
    "content": [
        "Lionel Richie told a guest about getting the call to perform at Coronation, says lip reader Jacqui Press Read more:  Read more: King Charles Coronation LIVE - follow the latest updates from Westminster AbbeyHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.ukLionel Richie was spotted in Westminster Abbey explaining how he got a call to perform at tomorrow's Coronation concert from his long-time friend King Charles, a professional lip reader has claimed. ",
        "Richie, 74, who told Kirsty Young on the eve of the Coronation that he wants to be the King's spokesman in the US, was all smiles in the Abbey on Coronation Day, taking time to chat to multiple guests, including London Mayor Sadiq Khan.Lip reader Jacqui Press claims the Dancing on the Ceiling singer could be seen chatting to one fellow guest explaining how he was delighted to perform at tomorrow's Coronation Concert event. The star, who has had a whirlwind month celebrating his daughter Sofia's wedding in the South Of France before jetting to the UK for the King's Coronation, is thought to have told his fellow attendee how King Charles called him in person to ask him to sing at the event. ",
        "The veteran performer, 73, has showed he has no plans to slow down in his older years as he enjoys a whirlwind trip around Europe, appearing on the BBC last night to talk about his close friendship with the King.He told Kirsty Young in a special programme on BBC One on the eve of the Coronation that he hopes to spread the word, with the King's permission, about the amazing work the Monarch is doing. While he may have entertained a billion people worldwide at the 1984 Olympics and boasts more than 40 hit singles, he said playing for the King will be ‘the best thing ever’.",
        "The Hello star was accompanied by his glamorous model girlfriend, Lisa Parigi, 40 years his junior, on the trip and met with the monarch and the Queen Consort at Buckingham Palace ahead of the coronation concert.Lionel has been an ambassador for the Prince’s Trust charity, which helps vulnerable young people, since the 1980s and said he didn’t hesitate when asked if he would headline Sunday’s event at Windsor Castle.‘This is going to be so much fun,’ he said. ‘Does this ever happen? No. This is a once in a lifetime opportunity, so to be a part of it is everything.He said of Charles: ‘Believe or not he cares. He is hands on. My job is to do the things that he cannot do, interviews and things like that. His time is valuable. So when I am travelling on my tours, this is what I do. I spread the world.’He said the concert was, without a shadow of doubt, one of the most momentous events in his life.",
        "‘In your career, there are Oscars and then there are Grammys and then there's a Coronation... are you kidding me?! This doesn't happen every day, so am I excited about this? Absolutely! This is going to be the best thing ever!’ he said.",
        "‘Windsor Castle as the backdrop? Come on, let’s be serious! There is no [other] example of something like this. It’s not like any other time in life or occasion.’Told there would be 1,000 years of history behind him at Windsor, he laughed and said: ‘Listen, don’t even say that. Now you have me scared!'As Camilla greeted Lionel and Lisa, she was heard telling the couple: 'It's very nice to see you.'",
        "During their friendly exchange, the singer was seen placing his hand on Camilla's shoulder as the group shared a laugh.‘Once the lights get up and the music starts it is just going to be fabulous. Get ready! It’s going to be magical.’Lionel will perform alongside Katy Perry, Andrea Bocelli and Take That at the upcoming live music event. The singer added he had also received an invitation to the coronation itself too, saying: ‘I’ll be there. I mean pinch me somebody. I am really trying to be calm. 'I’m a kid at Christmastime. And to have the relationship I have with King Charles is just wonderful.'"
    ]
}