{
    "articleURL": "/news/article-12038779/Giant-39-foot-fin-WHALE-dies-stranded-North-Sea-East-Yorkshire-coast.html",
    "content": [
        "A 39-foot fin whale died after being stranded in the North Sea off East Yorkshire A gigantic fin whale died after it was stranded off the East Yorkshire coast today.",
        "The 39-foot whale was spotted in shallow water in the North Sea by Bridlington beach at around 1.15pm.It is uncommon for fin whales, the second largest species in the world, to be in the North Sea, suggesting it could have been suffering from malnutrition or disease.  Hundreds of people watched as rescue teams from the Coastguard and the British Divers Marine Life Rescue (BDMLR) tried to save the poor animal, which died this evening.Mary Ford, who lives nearby, said: 'It is very sad to see such a beautiful creature die. ",
        "'It was throwing a huge spout of water initially, then that got less and less as time went on. 'It was obvious it was dying.'Another local said her dog howled just as the whale died. She said: 'It's like he knew the whale had died.'",
        "As the tide receded the huge whale struggled to lift its head and was seen thrashing its tail.Trails of bright red blood could be seen coming from its tail end.The BDMLR said: 'Sadly we are not able to return them to the water due to their size.'The fin whale is not common in the North Sea therefore for it to be found in Yorkshire would indicate there is something very wrong with the animal.",
        "'It's most likely suffering from malnutrition or disease.'",
        "Next to the blue whale, the fin whale is the second largest mammal in the world. They can grow as large as 80 ft long weigh up to 120 tons.They have a distinct ridge along their back behind the dorsal fin, which gives it the nickname 'razorback.' Fin whales have a very unusual feature: the lower right jaw is bright white and the lower left jaw is black. Commercial whaling saw nearly 750,000 animals killed the Southern Hemisphere between 1904 and 1979.Their current status is unknown in most areas outside of the North Atlantic.Commercial whaling remains a threat for fin whales. After a two-year hiatus, Iceland resumed commercial fin whaling in 2013 with a quota of 184 whales. The majority of the whale meat ends up in Japanese markets.Source: WWF "
    ]
}