{
    "articleURL": "/tvshowbiz/article-12040367/Moana-Hope-shares-personal-message-amid-rumours-shes-split-model-wife-Isabella-Carlstrom.html",
    "content": [
        "Australian Survivor star Moana Hope has shared a personal message with her fans after splitting from her model wife Isabella Carlstrom.",
        "The former AFLW player, 35, posted a tribute on Instagram to her mum on Tuesday ahead of Mother's Day.In the video, she described her mum as her 'rock' but failed to mention her wife Isabella, with whom she shares two children.'I'm one of 14 and growing up my mum also adopted some kids, so there was 19 of us living under the one roof. I lost my dad to cancer when I was 12,' she began.'Growing up, I watched my mum go to work at night, come back in the morning and take care of us throughout the day. The resilience she showed is [something] I'll never forget. As a mother of two, I don't know how she did it.'",
        "'You are unbelievable, mum. I love you and that's why this Mother's Day I really want to celebrate you. You're amazing, you're my rock and we definitely wouldn't be here without you, so happy Mother's Day, mum,' she added.It comes after Moana appeared to confirm rumours she'd split from Isabella by changing her Instagram bio to an emoji of a single woman and two children.Moana's Instagram bio previously included a mention of her wife.She last shared family photos with Isabella and their daughter Svea on April 17 as part of a Mother's Day campaign for Pandora.",
        "The sports star and the model tied the knot back in August 2019.Isabella gave birth to their daughter Svea in November 2020 and Moana carried their son Ahi, whom they welcomed in June last year.",
        "Moana and Isabella went through IVF to conceive their two children using the same donor.In a raw conversation with Dr Golly and the Experts several weeks ago, Moana said her postpartum depression was so severe she almost abandoned her family.'I just had moments where I felt like I'm not good enough to be [the children's] mum. I need to leave. It was about three occasions all up,' she revealed.'I almost got in a car and drove away because I just felt like I wasn't going to be a good enough mom for [Ahi]. It was fear.'The retired athlete went on to say her postpartum depression went hand-in-hand with her 'anxiety' and 'childhood trauma'.",
        "In an emotional moment, she confessed she was 'physically abused' throughout 'a large portion of my childhood'.'My anxiety got so bad that I thought I was going to wake up and inherit [the abuser's] anger. So I always thought, \"I don't want to be around my kids if I turn into [that],\"' she confessed.Isabella then revealed she knew Moana's childhood trauma would be 'triggered' by the 'trauma' of giving birth and asked her to see a 'psychiatrist' about it. ",
        "The podcast was released on Wednesday, but Daily Mail Australia understands it was recorded just weeks before their rumoured break-up."
    ]
}