{
    "articleURL": "/wires/reuters/article-12055273/Rangers-Gerard-Gallant-ways-1st-round-exit.html",
    "content": [
        "The New York Rangers and head coach Gerard Gallant mutually agreed to part ways, the team announced Saturday.",
        "The move came five days after the Rangers dropped a 4-0 decision to the New Jersey Devils in Game 7 of their Eastern Conference first-round series.Gallant posted a 99-46-19 record in two seasons as the coach of the Rangers, including a 47-22-13 mark in 2022-23. He guided the team to the Eastern Conference finals last year.\"I want to first thank Gerard for his work and commitment to the Rangers during his time as head coach,\" Rangers president and general manager Chris Drury said. \"I have a ton of respect for Gerard as both a coach and person and truly appreciate everything he did for us on and off the ice these last two seasons.\"After my evaluation of the season and discussions with Gerard, we mutually came to the conclusion that a change would be beneficial for both parties. I wish he and his family all the best in the future. Our search for a new head coach will begin right away.\"The Rangers acquired forward Vladimir Tarasenko in February and former Hart Trophy recipient Patrick Kane prior to the trade deadline this season. The added star power, however, did little to prevent New York from squandering a 2-0 series lead before it ultimately fell to its Hudson River rival.",
        "\"I would like to thank Mr. (James) Dolan, Chris and the Rangers organization for giving me the opportunity to be their head coach these last two seasons,\" Gallant said in a statement released by the team. \"The experience of coaching an Original Six franchise with such rich history and an incredibly passionate fanbase is something I will never forget. After conversations with my family and Chris, it became clear that this was the right decision for both myself and the Rangers at this time.\"Gallant, 59, owns a 369-262-70 record with four ties in 705 career games behind the bench for the Columbus Blue Jackets, Florida Panthers, Vegas Golden Knights and Rangers. He took the Golden Knights to the Stanley Cup Final in their first season in 2017-18.--Field Level Media"
    ]
}