{
    "articleURL": "/wires/reuters/article-12045307/WFP-suspends-food-distribution-Ethiopias-Tigray-diversion-fears.html",
    "content": [
        "WFP, USAID suspend aid distribution",
        "Tigray government urges rethink, says to investigate(Adds Tigray regional government comments)By Dawit EndeshawADDIS ABABA, May 4 (Reuters) - The U.N. World Food Programme has paused food distribution in Ethiopia's war-ravaged Tigray region in response to reports that significant amounts of aid were being diverted, the agency said.The announcement follows a similar one by the U.S. Agency for International Development, which said on Wednesday it had discovered that food intended for people in Tigray, millions of whom are in severe need of aid, was being diverted and sold.Neither organisation gave details of the source of the reports and the WFP did not say who was responsible for the diversions or when they had taken place.But it said late on Wednesday it was \"strongly reiterating to our cooperating partners that they monitor and report any illicit activities, and that they are enforcing the agreed controls.\"Getachew Reda, the head of Tigray's interim regional government, urged humanitarian agencies to reconsider suspending aid, saying in a statement that the moves would \"hurt our people who are facing grave challenges.\"He said he had set up a task force to investigate, calling the reported theft a crime against children, the elderly and the disabled.A spokesperson for Ethiopia's federal government did not immediately respond to a request for comment.",
        "A two-year war that erupted in November 2020 between the federal government and forces led by the Tigray People's Liberation Front, which dominates the northern region, killed tens of thousands of people, created famine-like conditions for hundreds of thousands, and displaced millions.The government and Tigray forces agreed to end hostilities in November, which has allowed additional aid to reach the region and for some services to be restored. (Additional reporting and writing by George Obulutsa in Nairobi; Editing by Aaron Ross, Robert Birsel and John Stonestreet)"
    ]
}