{
    "articleURL": "/femail/article-12038371/Throw-ultimate-Coronation-dinner-party-mouthwatering-PALACE-favourites.html",
    "content": [
        " EGGS DRUMKILBO",
        "Serves 4",
        "3 gelatine leaves2 x 500g (1lb 2oz) cooked Scottish lobsters75g (2¾oz) cooked and peeled prawns, plus extra to garnish3 free-range hard-boiled eggs (or use quail’s eggs)3 plum tomatoes, peeled, deseeded and diced100ml (3½fl oz) clear fish stock100g (3½oz) mayonnaise25ml (1fl oz) ketchupA splash of anchovy essence or sauce (optional)A splash of Worcestershire sauce10g (¼oz) parsley, blanched and choppedChopped chivesSalt and pepperMicro herb leaves, for decoration (optional)Soak the gelatine leaves in ice-cold water to soften.Extract the lobster meat and chop this and the prawns into 0.5cm pieces. Place in a large bowl. Dice one of the eggs and add to the shellfish, along with the tomatoes.Warm the fish stock to just below boiling point. Squeeze dry the soaked gelatine leaves and stir into the stock. When the gelatine is entirely dissolved, remove the stock from the heat.Mix the mayonnaise, ketchup, anchovy essence (if using), Worcestershire sauce and a third of the fish stock (reserving the remainder for the aspic garnish). Gently fold into the shellfish and egg mixture; add the parsley and chives and adjust the seasoning. Neatly spoon the mixture into individual serving dishes, and smooth with a palette knife.Chill for 1 hour. Glaze with the remaining aspic (gelatine-stock mixture). Return to the fridge to set the glaze. Before serving, decorate with the remaining hard-boiled eggs, either sliced or halved (or halved quail’s eggs, if using), the extra prawns and herb leaves, if liked.Did you know? This dish is one of King Charles’s favourites, according to his stepson Tom Parker Bowles.Olly Smith's wine pairing: Fruity and Fabulous Busi Jacobsohn Rosé 2019 (12%) £39.75, yapp.co.ukThis pink English fizz is the definition of ‘finesse’: dancing with summer fruit and from a stellar vintage, it’s fit for a king and has the right richness to stand up to Eggs Drumkilbo.",
        "CUTLETS OF WINDSOR LAMB WITH SAUCE PALOISE",
        "Serves 636 spears of English asparagus750g (1lb 10oz) Jersey Royal new potatoes30g (1oz) butter12 cutlets of lamb (French-trimmed)Sea salt and pepper100ml (3½fl oz) herb oil, such as rosemary or thymeFor the sauceA small bunch of mint350ml (12fl oz) white wine vinegar1tsp white peppercorns100g (3½oz) shallots, finely chopped250g (9oz) unsalted butter3 free-range egg yolksA squeeze of lemon juiceFor the sauce, pick the leaves from the mint and set aside. Chop the mint stalks, then combine with the vinegar, peppercorns and shallots in a pan. Bring to the boil over a high heat, then cook until the mixture has reduced by two-thirds.Blanch the mint leaves in boiling water for 10-15 seconds to soften, then quickly refresh under cold running water. Gently squeeze the leaves dry and finely chop with a sharp knife.Melt the butter in a pan, skimming off any white solids that rise to the surface. Keep warm. In a heatproof bowl placed over a pan of simmering water, whisk together the egg yolks and the vinegar reduction until they form a pale yellow foam (sabayon) which should hold its shape when you lift the whisk. (You must ensure that the sabayon does not get too hot or the egg yolk will start to cook.)Slowly trickle the warm butter into the sabayon with a ladle, whisking all the time. The sauce should acquire a consistency similar to that of mayonnaise. Add a squeeze of lemon juice and the chopped blanched mint.Carefully peel and trim the asparagus, taking care to remove the woody stems at the base of the spears.",
        "Wash the Jersey Royals well and bring to the boil in a large pan of salted water. Turn down the heat until the pan is just simmering and allow to cook gently until tender. Once the potatoes are cooked, strain them and return to the heat briefly to dry off, before adding the butter. Cover and keep somewhere warm for at least 10 minutes before serving: this is so the potatoes can really absorb the butter.Season the lamb cutlets with sea salt, freshly milled pepper and the herb oil before grilling in a hot griddle pan for 3-5 minutes per side (depending on how you like your lamb cooked).Allow the lamb to sit and rest somewhere warm for 5 minutes. In the meantime, cook the asparagus in boiling salted water for 4-5 minutes, depending on the thickness of the spears. Serve the lamb with the asparagus, Jersey Royals and a generous pot of warm sauce Paloise.Cook's tip: The royal kitchens use spring lamb from the Windsor Estate and English asparagus – which is beyond compare.Olly's wine pairing: Luscious with lamb Cabardes Terroirs d’Altitude Chateau de Pennautier 2018 (14.5%) £11.50, thewinesociety.comComplex, mature and delicious, this red has all the silky quality of higher-priced classics, plus a truffly richness that’s bang on for lamb.",
        "LANGOUSTINES LOSSIEMOUTH ",
        "Serves 6",
        "10ml (¼fl oz) oil, plus extra for frying50g (1¾oz) butter600g (1lb 5oz) baby spinach, washedSalt and pepper50g (1¾oz) shallots, finely chopped18 uncooked medium langoustines, shells removed150g (5½oz) button mushrooms, sliced150g (5½oz) tomato concassé (tomatoes peeled, deseeded and roughly chopped)2tsp chopped tarragonFor the Mornay sauce½ an onion1 bay leaf1 clove500ml (18fl oz) milk30g (1oz) butter30g (1oz) plain flour120g (4¼oz) strong Cheddar cheese, gratedFor the Mornay sauce, place the onion, bay leaf, clove and milk in a pan and bring to the boil. Take off the heat and leave the milk to infuse for 15 minutes. Melt the 30g butter in a small, thick-bottomed pan. Add the flour and stir with a whisk; cook gently for 1-2 minutes. Strain the milk and slowly pour into the butter/flour mixture, whisking as you bring it towards the boil over a medium heat. As the sauce reaches the boil, lower the heat and cook gently for 10 minutes, stirring frequently. Check and adjust the seasoning before removing from the heat, then add most of the grated cheese. Cover and keep warm until ready to serve.Heat a heavy-based pan, add the oil and melt the 50g butter. Wilt the spinach quickly in the pan, season; drain and keep warm in an ovenproof serving dish.In a frying pan, gently sauté the shallots and langoustines in a little oil, without colouring, before adding the mushrooms. Season and add the tomato concassé and tarragon. Place the langoustine mixture neatly on to the spinach and coat with the Mornay sauce. Sprinkle with the remainder of the grated cheese and glaze under the grill until lightly coloured.",
        "To prepare the six portions individually, divide the spinach between six ovenproof dishes and lay the langoustine mixture and Mornay sauce on top of each.Cook's tip: This is a very simple dish using one of Scotland’s finest products – langoustines, also called ‘Dublin Bay prawns’.Olly's wine pairing: Seafood sensation Langham Blanc de Blancs NV (12%) £39.95, langhamwine.co.ukA whirl of bright vigour and tension laced with hints of cookie dough, this brand new release is just wonderful with langoustines – and will also age beautifully.APRICOT CREPES SOUFFLÉ ",
        "Serves 620g (¾oz) melted unsalted butter, plus 30g (1oz) butter to assemble the crêpes once cooked, plus extra for greasing35g (1¼oz) plain flour2 free-range eggs, separated, plus 1 whole free-range egg40ml (1½fl oz) full-fat milk35g (1¼oz) unrefined caster sugar190ml (6¾fl oz) double cream200g (7oz) apricot preserveEquipment10cm flan moulds or non-stick blini pans, 2 or 3 per person; or 2 x 15cm cake tins – if you do not have flan moulds or blini pans, bake the soufflé mixture in 2 x 15cm cake tins for 10-15 minutes. Proceed as in the method, stacking the 2 crêpes on top of each other, then cut into wedges to serve.",
        "Preheat the oven to 180°C/ fan 160°C/gas 4.Prepare the flan moulds or blini pans by greasing with butter and placing on to a flat baking tray. Put this into the oven while you prepare the soufflé batter.Sift the flour. Mix together the whole egg, 2 egg yolks, melted butter, milk, half the sugar, the cream and finally the flour. Whisk the batter until smooth and place to one side.",
        "Whisk 2 egg whites with the remaining sugar until they form light peaks that support themselves; gently fold them through the batter, combining them fully.Once the oven has reached the correct temperature, carefully remove the flat baking tray. Pour the soufflé mixture into the flan moulds (or blini pans).Return the tray to the oven and bake for 5-8 minutes, or until the soufflé is golden brown in appearance.Whilst the crêpes soufflé are baking, prepare the apricot sauce to accompany the dessert. Melt the 30g butter. In a separate saucepan, gently warm the apricot preserve, adding a little water if required to amend the consistency: it should be a thick enough syrup to coat the crêpes.Once the crêpes soufflé are ready, work quickly to remove them from the oven and then from their moulds. Using a palette knife or plastic spatula, place the first crêpe on to your serving dishes, then, with a cocktail stick, pierce a few holes in the crêpe – this will allow the crêpes soufflé to absorb the butter and apricot jam that you will spoon over.Repeat this process until 2 or 3 crêpes are placed on top of each other on each dish. Spoon the butter over and then the jam, allowing it to pour down the sides and on to the dishes.Cook's tip: A small sprig of mint and a slice of tinned apricot adds the finishing touch to the top of the crêpes.Olly's wine pairing: Apricot Appetiser Coolhurst Demi-Sec Rosé 2017 (12%) £42, coolhurstvineyards.comA sensational Sussex bubbly that’s off-dry and irresistibly fruity – think rhubarb dusted with icing sugar – this is especially delightful as a partner for the Apricot Crêpes Soufflé.CHOCOLATE BISCUIT CAKE",
        "Serves 8115g (4oz) softened unsalted butter, plus extra for greasing225g (8oz) McVitie’s Rich Tea biscuits115g (4oz) unrefined caster sugar115g (4oz) dark chocolate (minimum 53% cocoa solids), chopped2tbsp warm water or dark rumFor the chocolate ganache125g (4½oz) dark chocolate, chopped125ml (4fl oz) whipping creamEquipment15cm cake ring or loose-bottomed cake tinGrease the cake ring or tin with butter and line with baking paper. If using a ring, place it on a lined, flat tray. Break the biscuits into small pieces, around 1-2cm in size. Do not place into a processor – the biscuits should not become crumbs. Place the butter and sugar into a bowl. Cream until light and fluffy.Melt the chocolate either in the microwave or over a simmering pan of water. Pour on to the butter and sugar and mix well. Add the water or rum, then the broken biscuit pieces. Stir well to make sure that all the biscuit pieces are coated with the chocolate mix.Place the mixture into the cake ring and carefully but firmly push it down to create an even texture. Place the cake in the fridge to chill until the chocolate becomes firm. This could take up to 30 minutes.Cook's tip: Decorate this chocolate biscuit cake any way you wish – with chocolate curls or chocolate buttons and gold lustre dust.For the chocolate ganacheTo prepare the ganache for the cake covering, place the chocolate in a bowl and pour the cream into a saucepan. Bring the cream to a simmer and then pour over the chocolate. Carefully stir until the chocolate has completely melted and the ganache is smoothly blended.",
        "Remove the chocolate biscuit cake from the fridge and from the cake ring. Place on to a wire rack with a tray beneath to collect the excess ganache. Carefully coat the cake with the warm ganache, making sure that all the cake is evenly coated. Allow to set fully before moving to your service plate and decorating as desired.Olly's wine pairing: Superior scotchWaitrose No.1, 8 Year Old Blended Scotch Whisky (40%) £23, 70cl Aged in bourbon casks for a natural sweetness that’s spot on for biscuit cake, this whisky has a delicate, peaty creaminess as well as a hint of fudge. Extracted from A Royal Cookbook: Seasonal Recipes From Buckingham Palace, by Mark Flanagan and Edward Griffiths, reprinted by Royal Collection Trust in 2022, price £12.95, from rct.uk/shop. Royal Collection Trust/ His Majesty King Charles III 2023. Photographer: Lisa Linder. "
    ]
}