{
    "articleURL": "/wires/aap/article-12038599/Mental-health-avalanche-pushing-psychologists-crisis.html",
    "content": [
        "Bushfires, floods and COVID-19 have created a perfect storm for busy psychologists who say they have reached a crisis point.",
        "A new study by Australian National University researchers has found a significant number of psychologists experienced burnout because of recent disaster events.In November and December last year, 469 registered psychologists took part in an anonymous online survey designed to understand the personal and professional impacts of recent disasters on them.The research also aims to discover how best to support the psychology workforce to meet current and future needs of the Australian community.Lead author of the study Emily Macleod said many psychologists had themselves been impacted by one or more of the events and were not immune to a dip in mental health.\"The COVID-19 pandemic and recent weather disasters have also impacted psychologists' professional lives,\" Dr Macleod said.\"Psychologists across the profession have experienced increased demand and changes in the nature and delivery of their work.\"As a result, Dr Macleod says the psychology workforce is reaching a crisis point.She said almost half (44.8 per cent) of the psychologists surveyed had changed job sectors or roles since 2019.\"Given the expected increase and severity of disasters, now more than ever it is important to support psychologists and prepare them to respond effectively to future disasters,\" Dr Macleod said.Roslyn Prinsley, head of disaster solutions at the university's Institute for Climate, Energy and Disaster Solutions, said looking after our psychologists has become more important than ever with climate change driving an increase in extreme events.",
        "\"Our approaches to disaster management cannot keep up. We need to be prepared for more and worse disasters,\" Dr Prinsley said.\"Psychologists are on the front line. We need more of them and to support them better.\"How psychologists rate their own mental health:*About one-third reported symptoms of depression (39.3 per cent) and/or anxiety (28 per cent)*Almost half (47.6 per cent) reported low subjective wellbeing* More than one-quarter (26.4 per cent) reported burnout (physical, emotional, and mental exhaustion), and a further one-third (34.5 per cent) were in danger of burnout.Source: Australian Psychologists in the Context of Disasters Preliminary Report"
    ]
}