{
    "articleURL": "/news/article-12055143/Meghans-estranged-father-Thomas-Markle-said-RIGHT-skip-Charless-coronation.html",
    "content": [
        "Thomas Markle said ‘it was for the best’ that the Duchess stayed at homeMeghan held 'low key' party for Prince Archie instead of celebrating coronationHarry managed a whistle-stop visit - leaving at 1.15pm to return to CaliforniaMeghan's estranged father Thomas Markle has declared she was right to skip Charles' coronation - because she has had 'too many disagreements' with the Royals.",
        "The former actress, 41, held a 'low key' celebration for Prince Archie, 4, instead of celebrating the crowning of her father-in-law as King Charles III.Prince Harry, 38, managed a whistle-stop visit for the coronation - leaving at 1.15pm to rejoin his family at their £11 million mansion in Montecito, California.And Meghan's father says this was a good thing - because of the bad blood amid the family feud.The 78-year-old, who stayed up all night to watch the ceremony on TV at his home in Rosarito, Mexico, told the Mail on Sunday he believed ‘it was for the best’ that the Duchess stayed at home.",
        "He continued: ‘There are too many disagreements between Meghan, Harry and the Royals.'It was wonderful to watch the good people of Britain welcome their new King and Queen.'Prince Harry slipped out of Westminster Abbey - accompanied by a Metropolitan police escort and four outriders - with only the briefest of goodbyes and headed straight for Heathrow Airport.He rushed from the service to the airport in a blacked-out BMW accompanied by a Metropolitan police escort and four outriders, where he was taken to the VIP Windsor Suite.After just 28 hours and 42 minutes in the UK, he was back on the plane to California before his father and stepmother had even finished having their official portraits taken.",
        "And it appears Meghan too was keen to avoid the 'drama' of returning to the UK.A source close to the Sussexes told the Mail on Sunday that Meghan ‘stayed home to celebrate Archie’s birthday because she felt it would be inauthentic to do anything else’. ",
        "They added: ‘She wanted to minimise the drama.’ Harry was pictured smiling broadly as he arrived at the airport’s Windsor suite before his British Airways flight still in morning suit and sporting his medals.The Duke of Sussex is believed to have boarded a 3.45pm flight which would have seen him land in Los Angeles at 6.55pm local time.The drive to Montecito from Los Angeles airport takes about 90 minutes. Another source said: ‘He was always determined to get back in time to spend part of Archie’s birthday at home.'Harry was determined to be back in time to tuck Archie into bed.’They confirmed Archie had a ‘private celebration’ on his birthday and a lemon cake baked by the Duchess of Sussex using fruit from their garden. When asked if any of the party guests included celebrity neighbours such as Oprah Winfrey, the source replied: ‘Some of their friends are celebrities, so yes, that’s likely. It will be a small, intimate gathering.’ Archie’s grandmother Doria Ragland was expected to be at the party, as well as Meghan’s close friend, make-up mogul Victoria Jackson, 65. ",
        "It was reported that the Duke had been invited to a post-coronation lunch at Buckingham Palace, in what many would have seen as an olive branch after his explosive memoir Spare left several members of the Royal Family reeling - most notably his brother Prince William.Harry had worn an awkward smile today as he was forced to watch the event of a generation from his relegated seat in the third row - while his sibling took centre stage alongside a radiant Kate Middleton.The Duke seemed keen to put on a jovial display amid ongoing speculation of the Royal Family's inner turmoil following the release of his bombshell book in February.Wearing medals pinned to his suit jacket, he had been seen laughing and smiling as he entered the church alongside Princesses Eugenie and Beatrice and their respective husbands Jack Brooksbank and Edo Mapelli Mozzi. It came after he awkwardly nodded at other guests as he endured a solo walk down the aisle to take his seat next to his cousins ahead of the arrival of his father and now Queen Camilla.Harry appeared to bow his head as the newly-anointed King walked past him on his way out of the abbey - although much of his true reaction was blocked by a feather on Princess Anne's hat.",
        "The prince had not been seen for over 24 hours after his arrival and accommodation plans remained shrouded in secrecy - before it emerged he had flown into the UK on a commercial American Airlines flight on Friday morning."
    ]
}