{
    "articleURL": "/wires/aap/article-12057043/Large-appetite-solar-subsidy-energy-bills-rise.html",
    "content": [
        "Most households want more assistance to install rooftop solar and batteries and would support subsidies for systems in public and community housing.",
        "A national poll released on Monday found more than three-quarters (79 per cent) want federal assistance for permanent energy bill relief through access to cheaper, smarter household solar.As energy bills soar, about half said they were avoiding air conditioning, turning on heating less and cutting back on other energy use.The Glow poll commissioned by grassroots organisation Solar Citizens found almost four in five Australians want the federal budget to prioritise subsidies or grants for low-income households to install solar.\"Having access to solar at home massively cuts your energy bills - it's that straightforward,\" said Solar Citizens national director Heidi Lee Douglas.\"Rooftop solar can save up to an average of $750 per year on their electricity bills, for up to 20 years, but up-front costs and other barriers are preventing many households from accessing these savings.\"The Queensland Conservation Council welcomed the energy bill help coming for 5.5 million Australian households in Tuesday's federal budget, but warned more needed to be done on the climate and cost of living crisis.QCC director Dave Copeman said while immediate relief is crucial, investment in large-scale renewable energy is the only way to bring prices down permanently.\"Communities also need to see increased government investment in the rollout of rooftop solar, energy efficiency and electrification,\" Mr Copeman said.",
        "Three-quarters of Glow poll respondents wanted budget funding for interest-free loans for home owners to purchase rooftop solar.There was also support for poorer households and renters, with 79 per cent backing taxpayer funding for installing solar on public and community housing as a budget priority.Federal funding for social housing would also help states and territories roll out solar systems on properties, which could cut the power bills of at least 249,000 struggling households, Solar Citizens said.Along with the bill relief, Climate Change and Energy Minister Chris Bowen last week confirmed the budget would support more large-scale renewable storage and household electrification.Nationals leader David Littleproud said he wanted solar on city rooftops and wind farms built offshore, not on prime agricultural land and native bushland.\"We're not against renewables,\" Mr Littleproud told Sky News.But renewable energy projects and transmission to connect them should not take away from food security and push up food prices, he said.\"If you put small scale modular nuclear into where existing coal fired power stations are, you don't need new transmission lines, you simply plug into where those old coal fired power stations are,\" he added."
    ]
}