{
    "articleURL": "/femail/article-12046653/Federal-budget-2023-Health-Minister-Mark-Butler-reveals-saving-Heart-Health-Check-screening.html",
    "content": [
        "Heart Health Check screening program will be extended Could save thousands of lives every yearA program to help save Australians from the nation's biggest killer has been given an injection in next week's budget.",
        "The Heart Health Check screening program will be extended for another two years, potentially saving thousands of lives every year.Under the program, people aged 45 and over and Aboriginal or Torres Strait Islander people aged 30 and over are eligible for a free check of their risk of a heart attack or stroke during a 20-minute GP consultationIt has been subsidised by Medicare since 2019. Since then, more than 455,000 tests have been performed nationally.Health Minister Mark Butler has been under pressure to either extend the rebate, which was due to expire in June, or make it permanent in the May budget.",
        "He placed the blame for the uncertainty about the future of the 'crucial heart health assessments' on the previous government.'With about 250,000 people expected to receive a heart health assessment over the next two years, our government's action on this has the potential to save thousands of lives,' the Health Minister said.The Heart Foundation estimates that over a five-year period 67,000 heart attacks, strokes and heart disease related deaths could be prevented in high-risk Australians.Chief executive David Lloyd welcomed the program's 'crucial extension'.",
        "'It shows that this is a government that listens to Australians and understands the important role that prevention can play in saving lives from heart disease, which continues to be our nation's leading cause of death and a major burden on our healthcare system,' he said.",
        "Each day 438 Australians are hospitalised with coronary heart disease, with one person dying of the condition every 30 minutes.It is the leading cause of death for males and second leading cause of death for women, according to the Australian Institute of Health and Wellbeing.The checks experienced a major upswing in take up, after lagging through Covid, following the deaths of cricket legend Shane Warne of suspected heart disease and Labor senator Kimberley Kitching."
    ]
}