{
    "articleURL": "/wires/ap/article-12053347/NY-jury-wide-latitude-decide-civil-Trump-claims.html",
    "content": [
        "NEW YORK (AP) - The jury hearing an advice columnist´s claims that she was raped by Donald Trump could begin deliberations as soon as Tuesday, and it will have wide latitude in deciding the truthfulness of the allegations against the former president.",
        "The writer E. Jean Carroll, 79, testified that Trump raped her in 1996 inside a dressing room at the luxury Bergdorf Goodman store in Manhattan after they had a chance encounter and shopped together for lingerie.Trump, 76, has said he never raped Carroll and was never with her at the department store. He has been absent from the trial, though jurors saw portions of his videotaped deposition. He has accused Carroll of making up allegations to fuel sales of her 2019 memoir.The jury's decision in the trial - which involves a civil case and not a criminal one - may come down to who they believe more. Here's more on how the jury will reach its verdict:___WHEN WILL DELIBERATIONS BEGIN?",
        "Closing arguments are tentatively scheduled for Monday with an expectation that lawyers for Carroll and Trump will finish their statements by the end of the day.The judge is expected to read instructions on the law to the jury on Tuesday, with deliberations to begin immediately afterward.U.S. District Judge Lewis A. Kaplan gave Trump a last chance to request to testify, but the former president's lawyers indicated he was likely to decline that offer.___WHAT WILL JURORS DECIDE?Kaplan instructed the nine jurors at the trial's start that the central claim pertains to \"battery.\"",
        "He said that in a civil case, battery can result from even the slightest unlawful touching of another person.\"The law does not draw a line between different degrees of violence. It totally prohibits all unconsented-to touching from the least to the most violent that a reasonable person would find offensive. In other words, anything from a gentle but unwanted peck on the cheek to stabbing somebody with a knife could be battery for purposes of a civil case like this one,\" Kaplan said.The jurors will be asked to decide whether Carroll has proven that Trump committed battery. If they decide that Trump committed battery, they are expected to be asked to what degree. After that, Carroll's attorney has proposed that jurors be asked separately whether Carroll has proven that Trump engaged in forcible touching, sexual abuse and rape. The judge has yet to make a decision on that proposal.The trial also involves a claim by Carroll that Trump made defamatory comments while denying her allegations.For defamation, jurors will be asked if Carroll had proven that Trump's statement was defamatory and whether clear and convincing evidence had proven that Trump made the statement maliciously.___WHAT IS AT STAKE?If a jury agrees that Carroll has proven her claims of battery and defamation, they can award compensatory and punitive damages. The amount is up to the jury.",
        "There isn´t any chance Trump will go to jail as a result of a case.___WHY IS IT A CIVIL RATHER THAN A CRIMINAL CASE?Carroll acknowledged during her testimony that she never went to police.Her decision not to report a crime for so long rules out the possibility of prosecutors bringing criminal charges against Trump. Until recently, it also would have prevented Carroll from bringing a lawsuit. But New York last year enacted a law temporarily letting sexual attack victims sue their alleged abusers, no matter how long ago the assault occurred.Because it is a civil case, Trump was not required to be in court.Unlike in a criminal trial, where a prosecutor might have to prove the case beyond a reasonable doubt, a civil jury decides based on \"preponderance of the evidence,\" meaning whether something is more likely to be true than not.To prove the defamation claim, Carroll is required to prove her allegations by clear and convincing evidence, which is a higher legal standard than preponderance of the evidence."
    ]
}