{
    "articleURL": "/wires/reuters/article-12044525/From-Rottweiler-queen--reinvention-King-Charles-wife-Camilla.html",
    "content": [
        "By Michael Holden and Sarah Mills",
        "LONDON, May 6 (Reuters) - After years of being depicted as the most hated woman in Britain, Camilla, the second wife of King Charles, was crowned queen on Saturday, capping a remarkable turnaround in public acceptance few would have thought possible.When Charles' divorced first wife, the popular, glamorous Princess Diana, died in a car crash in Paris in 1997, Camilla bore the brunt of media hostility. Some declared the couple could never wed.But marry they did eight years later, and since then she has come to be recognised, albeit still grudgingly by some, as a key member of the royal family, as someone on whom the new king heavily relies, and as the nation's Queen Camilla.\"She is his sort of soul mate,\" said Robert Hardman, a long-time royal correspondent and author of 'Queen of our Times', pointing out she had been married to Charles longer than Diana.\"They're a team. And you've got to be a team.\"Born Camilla Shand in 1947 into an affluent family - her father was an army major and wine merchant who married an aristocrat - she moved in social circles that brought her into contact with Charles, who she met on a windswept polo field in the early 1970s.The pair dated for a time and Charles had contemplated marriage, but felt too young to take such a major step.",
        "As he dedicated himself to his naval career, Camilla went on to marry a cavalry officer, Brigadier Andrew Parker Bowles. The couple had two children, Tom and Laura. They divorced in 1995.Charles himself married 20-year-old Diana in a wedding in 1981 that enchanted not just Britain but the world. After having two children, William and Harry, the relationship turned sour and they divorced in 1996 after he rekindled his romance with his former lover.The depth of that relationship was exposed to a shocked public in 1993 when a transcript of a secretly recorded private conversation with hugely intimate details was published in newspapers.\"I'd suffer anything for you. That's love. That's the strength of love,\" Camilla told Charles in the secretly recorded telephone conversation publicised in 1993.In a TV interview the following year, Charles admitted he had resumed their affair, but said it was only after his marriage had irretrievably broken down.\"There were three of us in this marriage - so it was a bit crowded,\" Diana, who dubbed Camilla \"the Rottweiler\", famously remarked in her own TV interview in 1995.While Diana brought glamour to the stuffy House of Windsor with her glittering gowns, many Britons could not understand why Charles would prefer the country-loving Camilla, usually pictured wearing a scarf and green waterproof riding coat.",
        "\"I cannot imagine anyone in their right mind leaving you for Camilla,\" Prince Philip, Charles' father and the late Queen Elizabeth's husband, said in a letter to Diana.FOCUS OF CRITICISMAmid a public outpouring of grief and anger after Diana's death, Camilla was singled out for harsh criticism. But in subsequent years, royal aides, tasked with rebuilding the tarnished reputation of the royal family as a whole, also slowly began to integrate Camilla into a more public role.From being able to appear in public together, to marriage and last year's approval from Queen Elizabeth to Camilla taking the title Queen Consort, their success is complete.Public relations experts say it was the result of much hard and careful work, although aides said it was mainly due to Camilla's own personality and great sense of humour. \"She is resilient, she was brought up with this extraordinary sense of duty where you got on with it, don't whinge, put your best face on and keep going, and it has stood her in very good stead,\" Fiona Shelburne, the Marchioness of Lansdowne, a close confidante of Camilla, now 75, told the Sunday Times last month.However, her rehabilitation has come at a cost. In his memoir, Charles's younger son Prince Harry accused his step mother of leaking stories about him to the press to enhance her own reputation, and that he and his brother had asked their father not to marry her.",
        "Polls also suggest she has not won widespread public affection either. A YouGov poll this week found while 48% had a positive view of her, 39% held a negative opinion, putting her among the least popular in the royal family.Other surveys have also indicated only a minority thought she should be Queen Camilla.\"I think Diana ... will be hurling thunderbolts on coronation day, that's for sure,\" royal author Tina Brown told Reuters. \"I mean the idea of a crown being placed upon the head of her deadliest rival, Camilla, I think would have given her absolute heartburn.\" (Reporting by Michael Holden; Editing by Angus MacSwan, Alexandra Hudson)"
    ]
}