{
    "articleURL": "/wires/ap/article-12059895/Struber-Red-Bulls-Lesesne-19th-coach-28-seasons.html",
    "content": [
        "HARRISON, N.J. (AP) - Gerhard Struber is out as coach of the last-place New York Red Bulls and was replaced Monday by Troy Lesesne, the team´s 19th coach in 28 seasons.",
        "The Red Bulls said Struber´s departure was mutual and assistant coach Bernd Eibler also had left. It was Major League Soccer's first coaching change since the season began in late February.New York, which has never won an MLS title, is 15th in the Eastern Conference standings with one win, four losses and six draws for nine points.Struber was hired in October 2020 after spending 11 months as coach of Barnsley in the second-tier English Championship. He previously coached Wolfsberger in the Austrian Bundesliga and second-tier Austrian club Liefering after a 13-year playing career in his native Austria.He led the Red Bulls to 29 wins, 29 losses and 23 losses in two-plus MLS seasons. The Red Bulls lost in the first round of the playoffs in each of his full seasons, to Philadelphia in 2021 and to Cincinnati last year.\"I wanted to return to Europe at the end of this season, at the latest,\" Struber said in a statement issued by the team. \"It was extremely difficult for me to live here, completely without my family. I informed the club early enough about my wishes and we came to the agreement to part ways.\"",
        "Lesesne, 39, of West Columbia, South Carolina, coached New Mexico United in the second-tier United Soccer League Championship from 2018-21, then was hired as a Red Bulls assistant coach in January 2022. He was an assistant coach at the College of Charleston from 2005-14, then became an assistant in the third tier with the Charleston Battery in 2014 and Charlotte Independence from 2015-17.",
        "\"Troy is an impressive, knowledgeable coach, who has worked incredibly well with our players for the last year and half,\" Red Bulls head of sport Jochen Schneider said in a statement. \"We are fortunate to have him lead our team forward.\"Struber followed Eddie Firmani (1996), Carlos Queiroz (1996), Carlos Alberto Parreira (1997), Alfonso Mondelo (1998), Bora Milutinovic (1998-99), Octavio Zambrano (2000-02), Bob Bradley (2003-05), Mo Johnston (2005-2006), Richie Williams (2006), Bruce Arena (2006-07), Juan Carlos Osorio (2008-09), Williams (2009), Hans Backe (2010-12), Mike Petke (2013-15), Jesse Marsch (2015-18), Chris Armas (2018-20) and Bradley Carnell (2020).Five MLS teams changed coaches during the 2022 season: San Jose, D.C., Charlotte, New York City and Houston.Columbus and Montreal changed coaches during the offseason, and Houston and San Jose replaced interim coaches with new hires.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}