{
    "articleURL": "/wires/reuters/article-12057373/Carlos-Alcaraz-outlasts-Jan-Lennard-Struff-defends-Madrid-title.html",
    "content": [
        "Spanish superstar Carlos Alcaraz completed his title defense at the Mutua Madrid Open by defeating underdog story Jan-Lennard Struff of Germany 6-4, 3-6, 6-3 in the final Sunday.",
        "Alcaraz was the tournament's top seed and entered with a 20-match winning streak on Spanish clay. Struff, on the other hand, was the first lucky loser to reach the final of an ATP Masters 1000 event since the series' inception in 1990.Alcaraz won titles in both Barcelona and Madrid last season and completed the Spanish double again Sunday, besting Struff in two hours and 25 minutes for his fourth tour-level title of 2023.\"For me it is so, so special,\" Alcaraz said after the match. \"To lift the trophy here in Madrid. In my country. It is always special to play and to be able to do a good result here and (being) a champion is so special. In front of my home crowd, my family, my friends. Everyone close to me. For me it is a special feeling that I will never forget.\"Alcaraz -- who turned 20 on Friday -- entered the tournament No. 2 in the world rankings. According to the ATP, he will unseat Serbian star Novak Djokovic for world No. 1 once he plays his opening match at the upcoming Rome Masters.Struff outplayed Alcaraz in several aspects. He held a 4-2 edge in aces and a 36-24 advantage in winners. Struff also won more of his first-service points (75.5 percent) than Alcaraz (67.2) and saved 8 of 11 break points.",
        "But Alcaraz saved 6 of 8 break points he faced and captured 11 of 19 points at the net to stay afloat.\"It was a really tough match,\" Alcaraz said. \"Jan was playing great, really aggressive. In the second set I had a lot of chances to break his serve and I didn't take it and it was tough for me to lose it. I told myself that I had to be positive all the time and that I would have my chances and I think I did it in the third set.\"Alcaraz led 2-1 in the third set when he broke Struff's serve in the fourth game, which proved pivotal. Alcaraz held serve throughout the set and had enough margin for a comfortable third-set triumph.Struff, 33, lost to Russian Aslan Karatsev in the final qualifying match but got into the field as a lucky loser. On his history-making run he upset American No. 32 seed Ben Shelton in the Round of 64 and Greek fourth seed Stefanos Tsitsipas in the quarterfinals before exacting revenge on Karatsev in a semifinal rematch.--Field Level Media"
    ]
}