{
    "articleURL": "/wires/pa/article-12055223/Erik-ten-Hag-big-fan-David-Moyes-ahead-United-s-trip-West-Ham.html",
    "content": [
        "Erik ten Hag has long admired Sir Alex Ferguson’s successor David Moyes and knows Manchester United have to be at their best to beat his West Ham side this weekend.",
        "Monday marks the 10th anniversary of the huge announcement that the Scot was stepping down after 26 medal-laden years in the Old Trafford dugout.Ferguson bowed out on the back of a 13th league title – heights United have not reached since then, enduring their fair share of ups, downs and fallow periods.Moyes was the first man to step into the breach and sacked before the end of the 2013-14 season, with the 60-year-old now in charge of a West Ham outfit hosting United on Sunday.",
        "Asked if he was pleased to be the fifth permanent successor to Ferguson rather than the first, Ten Hag said: “It’s hypothetical, so you’ll never know.“But it’s quite clear when you have to succeed Sir Alex that is a big challenge and that is a really difficult job to do.“So, yeah, he did it, he had the bravery to do it, so that’s why I think I admire him that much. He’s also that long already with many clubs in the Premier League, so it’s a great manager with a lot of skills.“I know my team has to be their best on Sunday. We have to play our maximum if we want to get the result we need, and that’s a win.”",
        "United are looking to tighten their grip on a Champions League spot on Sunday with fifth-placed Liverpool hot on their heels.",
        "Ten Hag’s side have two games in hand on their rivals but the gap sharpens the mind, which could also be beneficial given the all-Manchester FA Cup final against City looms on June 3.“I’m telling them for every game, for every training – you have to be ready for every game in the Premier League,” he said.“If you want to be in four competitions, you have to be so well prepared, you need so much energy, you need a good game plan and you have to go every game again.“You can’t do it in 99 per cent, you have to do it 100 per cent and you have to do it over the full 95 minutes. He's also that long already with many clubs in the Premier League, so it's a great manager with a lot of skills  Erik ten Hag on David Moyes  “That’s why we like it, top players like it, to have huge challenges, but it costs energy.“But that’s our job, it’s our responsibility, we have to take it and we lay this aside Sunday. We go again and I’m sure we will be there.”",
        "West Ham have had a free week to prepare for United’s visit, whereas United are reeling from being stung at the death in Thursday’s late 1-0 loss at Brighton.It has been a relentless schedule as the Red Devils balanced domestic and Europa League exertions for much of the season, but Ten Hag believes they have handled it well.“(The schedule) has already an impact on the whole season, and we are doing quite well,” he said.",
        "“We’re not doing quite well, we’re doing really well. We have a big disadvantage against others. West Ham United, I think, is a team who has the worst schedule, but then us.“But then we showed all season already we can deal with that. We are physical and mental very strong.”United need to keep that going for another month without overstepping the mark.“We have to keep our heads,” Ten Hag added. “Clear. But also I demand passion and desire from my players because if you want to win games, you need that and I think it brought us to where we are now.”"
    ]
}