{
    "articleURL": "/wires/ap/article-12049423/Thompson-scores-30-Warriors-adjust-beat-Lakers-127-100.html",
    "content": [
        "SAN FRANCISCO (AP) - After yet another big basket, Klay Thompson scurried toward the fans sitting courtside opposite the Warriors bench and raised his arms in the air to ignite an entire arena behind him. It didn't take much the way his shots were falling.",
        "He has been waiting his entire life to shine against his father's Los Angeles Lakers on the big stage.Thompson scored 30 points with eight 3-pointers, Golden State limited Anthony Davis while allowing LeBron James 23 points, and the defending champion Warriors evened their Western Conference semifinal with the Lakers at one game apiece with a 127-100 win Thursday night.\"I was just trying to get the crowd going,\" Thompson said. \"It's always fun when you shoot the ball well, it's even better when you couple that win a win.\"Stephen Curry added 20 points and 12 assists as Splash Brother Thompson got hot to help Golden State make 21 more 3-pointers - giving the Warriors an NBA record for most in the first two games of a playoff series at 42. James' Cavaliers hit 40 against Atlanta in the 2016 second round.\"They made their adjustments. We knew they were going to do that, that´s what a championship team does,\" James said. \"They held serve on their home court tonight.\"",
        "Coach Steve Kerr switched things up and inserted JaMychal Green into the starting lineup for Kevon Looney, who had a career-high 23 rebounds in Game 1 but has been dealing with an illness. Kerr aimed to give a different look with scoring options and more free-throw chances by going hard with a physical presence against Davis in the paint - where Golden State got thoroughly outplayed in a 117-112 loss in the opener.",
        "Thompson's basket with 7:48 left in the third gave Golden State its biggest lead at 82-64 and the Warriors rolled from there.\"Klay got it going and our defense was kind of fueling our offense,\" Kerr said.The Warriors had more fast-break points and points in the paint. JaMychal Green matched his playoff career high with 15 points, while Draymond Green contributed 11 points, 11 rebounds and nine assists after insisting he had to get more aggressive.\"I´ve been waiting on this moment, just wanted to show that I could help,\" JaMychal Green said. \"They always tell me to stay ready, my time will come.\"The best-of-seven series shifts to Los Angeles for Game 3 on Saturday. Back home in Southern California, Thompson said he would play in the memory of \"my biggest inspiration\" Kobe Bryant and daughter, Gigi.\"I have so much respect for just the opportunity ahead for me,\" Thompson said.James shot 6 for 8 in the first with a pair of 3s for 14 points as the Lakers led 33-26. He retrieved a loose ball and let it fly for a pretty 3 with 7:47 before halftime but the Warriors were too much.Davis followed up his brilliant Game 1 performance - 30 points, 23 rebounds, five assists and four blocked shots and 11-for-19 shooting - with 11 points while shooting 5 for 11, seven rebounds, four assists and three blocks.",
        "\"We played with more force,\" Draymond Green said.Golden State outscored the Lakers 84-47 over the second and third quarters - recording two 40-point quarters in the same playoff game for the first time in franchise history.\"It was hard for us to guard four shooters,\" Lakers forward Rui Hachimura said. \"Defensively they were more aggressive I feel like. They had all the loose balls and the rebounds and everything.\"Looney received huge roars as he came off the bench for his first action with 3:41 left in the first. He grabbed eight rebounds and scored six points playing just less than 12 minutes - and the Warriors still outboarded the Lakers 55-40 without its best rebounder.\"We're capable of playing a lot of different ways, I'm capable of playing a lot of different ways,\" Curry said.Kerr was hardly worried ahead of Game 2, pointing to how Golden State lost Game 1 of the NBA Finals at home to Boston last year before winning it all.The Warriors also rallied from a 2-0 deficit in their first-round series to beat Sacramento, the first defending champion to do so.\"You could tell, they came out just ready to try to secure a game,\" Lakers coach Darvin Ham said, \"and again not go back to our place down 0-2.\"",
        "KLAY'S DAYThompson shot 11 for 18 and 8 of 11 from deep. His 19 points in the first half were his most in a postseason contest since he scored 21 in Game 6 against the Rockets in 2019.KEY SEQUENCEThe Warriors challenged an offensive foul call on Andrew Wiggins with James defending at the 2:50 mark of the second quarter. The call was overturned and a block assessed to James, and a Lakers assistant received a technical during the review process - and the Warriors converted all three free throws to lead 60-50 before Thompson´s 3 the next time down.TIP-INSLakers: James was -27 through three quarters. The only time he had a worse plus-minus through three in a playoff game was Game 1 of a second-round series against the Pistons in 2006. ... In a big change from Game 1, the Lakers didn't take their first free throws until 1:03 before halftime and their four attempts matched their second-fewest in a first half this season.Warriors: Moses Moody added 10 points and seven rebounds off the bench and Gary Payton II seven points and five boards as Golden State controlled the glass all game. ... JaMychal Green earned his first playoff start since April 26, 2019, for the Clippers against the Warriors in Game 6 of the first round. \"Two hours before game time Loon came down pretty ill,\" Kerr said. ... Golden State improved to 20-6 in Game 2s dating to the 2014-15 title run.",
        "___AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP_Sports"
    ]
}