{
    "articleURL": "/wires/ap/article-12055953/White-powers-Whitecaps-3-2-victory-Minnesota-United.html",
    "content": [
        "VANCOUVER, British Columbia (AP) - Brian White scored two goals to help the Vancouver Whitecaps earn a 3-2 victory over Minnesota United on Saturday night.",
        "White gave Vancouver (3-2-5) an early lead when he took a pass from Andrés Cubas and scored in the 17th minute.Defender Michael Boxall pulled Minnesota United (3-4-3) even when he scored unassisted in the 33rd minute to tie the match at halftime.The Whitecaps grabbed the lead for good on back-to-back goals by White and Simon Becher. Ranko Veselinovic earned an assist on White's second netter of the night and fourth of the season - in the 52nd minute. Ryan Gauld had an assist in the 56th minute on Becher's fifth goal in four appearances this season. Becher subbed in and scored in his first two matches and had two goals in his first start.Sang Bin Jeong picked up his first career goal in his fifth appearance and fourth start for Minnesota United, capping the scoring in the 65th minute with an assist from Robin Lod.Vancouver entered play having not conceded a goal in four straight matches, tying a club record set in 2012 and matched in 2014. The Whitecaps last two matches ended in scoreless draws.",
        "Minnesota United falls to 4-5-0 all-time in matches played in Canada. Minnesota United had scored just 12 goals in its previous 16 matches. Minnesota United scored multiple goals for the third time in its last 17 contests after scoring at least two goals in 10 of its previous 11.",
        "Vancouver had a 17-11 advantage in shots and a 7-5 edge in shots on goal.The Whitecaps' Yohei Takaoka and Minnesota United's Dayne St. Clair both finished with three saves.Minnesota United travels to play Sporting Kansas City on Saturday. Vancouver travels to play the Portland Timbers on Saturday.____AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sport"
    ]
}