{
    "articleURL": "/sport/nba/article-12053127/Joel-Embiid-cries-tears-joy-adorable-son-Arthur-runs-court-MVP-speech.html",
    "content": [
        "Joel Embiid was announced as the Association's MVP  ahead of Nikola JokicThe six-time All-Star watched the announce live with teammates Tuesday nightDailyMail.com provides all the latest international sports news The NBA's newly-minted MVP Joel Embiid cried tears of joy as his son ran on to the court during the presentation of the Association's highest individual honor. ",
        "Embiid mentioned his son and motioned for him before his mom let Arthur run toward his 7-foot-tall dad before the 76ers loss to Boston in Game 3 of the Eastern Conference Semifinals series Friday night.Arthur Elijah De Paula Embiid adorably ran on to the floor before he was picked up by the six-time All-Star, after he had already began to cry. The lovable pair were greeted with strong cheers with the noise only increasing once fans inside the Wells Fargo Center were given a close-up look at the Embiids. Chants of MVP also rung around the South Philadelphia arena. NBA Commissioner Adam Silver presented the Cameroonian superstar with his first MVP trophy after he beat out back-to-back winner, Nikola Jokic for the award.",
        "'I just want to thank God, first and foremost because I wouldn't have been here without him. Obviously, my teammates have been a big part of it. Embiid first became emotional as he began to thank his parents for their part in his journey. The 29-year-old mentioned how his family 'stuck together' following the tragic death of Embiid's younger brother, also named Arthur, in a 2014 crash car in their native Cameroon. Embiid's son, named after his departed brother, wore a shirt labeled 'My Dad is the MVP.'",
        "Though, judging by his father's speech, he feels very differently about the subject.'Honestly, he's the main reason why I'm really here. Becoming a father changed my whole life and I just wanted to show him a good example.'Embiid lastly thanked the fans who responded in unison ahead of a crucial Game 3 Eastern Conference Semifinals matchup vs. the C's."
    ]
}