{
    "articleURL": "/tvshowbiz/article-12045987/Waterloo-Road-LOOK-BBC-releases-trailer-dramas-new-series.html",
    "content": [
        "The BBC has shared the first-look trailer for Waterloo Road's twelfth series, following its announcement that the drama will return later this month.",
        "The further seven episodes, which will air weekly on BBC One and be available in full on BBC iPlayer, promise new faces, fresh dramas, and lots of fun and laughter along the way.The students and staff embark on another term of romances and friendships, all whilst navigating issues including mental health, racism, the cost-of-living crisis and being LGBTQ+. Following the news that fan favourite and former deputy head, Andrew Treneman (Jamie Glover) is returning to the show, audiences will be kept guessing whether Kim’s old flame is back with good intentions or not.Meanwhile, new boy Myles (Osian Morgan), has been let go by a football academy.",
        "He's struggling to come to terms with a life back in mainstream education, makes it clear that he’s not there to make friends, and immediately sets about making a lasting impact on the school.Elsewhere, love is in the air this term as new couples get together and hidden feelings come to the surface.The popular drama series returned in January after an eight-year hiatus following a revival in audiences on BBC iPlayer during the first lockdown.The series remains especially popular with younger viewers, and is the BBC’s second biggest drama title with 16-34 year olds of the year so far, behind only Happy Valley.",
        "Waterloo Road is a Rope Ladder Fiction and Wall to Wall North co-production for BBC One and iPlayer.The executive producers are Cameron Roach for Rope Ladder Fiction, Leanne Klein for Wall to Wall and Gaynor Holmes and Jo McClellan for the BBC.The new series – Waterloo Road’s twelfth in total, and the second since Waterloo Road returned to the BBC at the start of this year - was filmed in Greater Manchester.On Tuesday, the broadcaster announced a new series of Waterloo Road will hit screens on Tuesday May 16 at 8pm, airing on BBC One and BBC iPlayer.",
        "The brand new series of seven episodes - which stars Angela Griffin, Adam Thomas and Kym Marsh - will also available in full on BBC iPlayer that day.To celebrate the news, first-look images from the new series have been released, to give audiences a glimpse of what they can expect as new faces bring fresh dramas to the school.One new pupil causes fireworks, while elsewhere secrets come to the fore with potentially devastating consequences for those involved.Fractured relationships, brutal betrayals and life-changing moments: all in a day's work for head Kim Campbell (Angela) and her team.Fans of the show will be able to get all the behind the scenes information from Waterloo Road – The Official Podcast which will also be returning with hosts Adam Thomas and Priyasasha Kumari.",
        "Launching on BBC Sounds on Saturday 6th May, the podcast will feature celebrity guests and the Waterloo Road cast as they look back at the show's legacy and take audiences on a nostalgic journey through the years.The audio show will countdown to the return of the new series and is the perfect listen for fans who have been with the show since it started.Waterloo Road returns to BBC One and BBC iPlayer on Tuesday 16th May. "
    ]
}