{
    "articleURL": "/wires/ap/article-12049475/Anti-Muslim-Twitter-feed-Spain-A-recipe-disaster.html",
    "content": [
        "WASHINGTON (AP) - The person who operates the Twitter account claims to be an Islamic fundamentalist living in Spain, empathizing with violent extremists and longing for the days, more than six centuries ago, when Muslims ruled the country.",
        "The views are as fake as the account, part of a loose and informal effort by far-right nationalists in Spain to use social media to stir up anti-Muslim and anti-immigrant fervor and to undermine faith in Spain's multicultural democracy. In some cases, they exploit Twitter's loose rules to spread hateful messages and threats of violence, while in others they pose as Muslims as a way to disparage actual followers of Islam.By harnessing the power of social media to communicate, coordinate and evangelize, those behind the so-called Reconquista movement are relying on the same playbook used by far-right extremists in the U.S., Brazil and other countries who have used social media to expand their power and recruit new followers.Reconquista also borrows the same rhetoric used by far-right groups in the U.S., and even some of the same online memes, including Pepe the Frog, a crudely drawn amphibian who has become a mascot for white supremacist and antigovernment groups in the U.S. In one Reconquista meme, Pepe is shown wearing the garb of a 16th century Spanish conquistador.As in the U.S. and other countries, the Spanish nationalists have seized on debates over trans rights, spreading misleading claims about the exploitation of children and supposed conspiracies to eradicate the idea of gender. They've also criticized COVID-19 vaccines, feminism, efforts to address climate change and support for Ukraine following Russia's invasion.",
        "The remarkable overlap of tactics and interests isn't a coincidence, but reflects how far-right groups in many countries are learning from one another, copying each other's successes, said Joel Finkelstein, co-founder of the Network Contagion Research Institute, a Princeton, N.J. group that partners with Rutgers University on the Network Contagion Lab, a training and educational center focused on cyber threats.",
        "The institute published a report on Reconquista this week. The findings were first reported by The Associated Press.\"This is a recipe for disaster,\" Finkelstein told the AP. \"All over the world we´re seeing different manifestations of the same kind of problem. The flags are all different, but it´s remarkable how similar the memes are.\"One concern, Finkelstein said, is that the rhetoric could lead to real-world violence.Reconquista takes its name from the successful effort by Christian leaders to reconquer vast parts of the Iberian peninsula from its Islamic rulers and expel Muslims during the Middle Ages. It's a term embraced by some on the far-right, who see their opposition to Islam and immigrants as a divinely ordained sequel of sorts to that bloody, centuries long conflict.Anti-Muslim rhetoric from accounts linked to Reconquista soared after a Moroccan man attacked two Catholic churches in the southern city of Algeciras in January, killing a church officer and injuring a priest. The man, an unauthorized immigrant, is now jailed in the psychiatric ward of a Spanish prison awaiting the results of a judicial probe; authorities believe he acted alone.",
        "Many of the violent threats against Muslims that spread on Twitter following the attack violated the platform´s rules, and in some cases the platform did act to remove the content or suspend the author. But often those behind the content simply created a new account days after they were suspended.The far-right party Vox helped popularize Reconquista online, using the term repeatedly in Tweets ahead of the 2019 election. Vox, whose members express strongly anti-immigrant views, now holds 52 seats, or the third largest number, in Spain's 350-member lower legislative chamber. The party's Twitter account was briefly suspended in 2020 for accusing its critics of promoting pedophilia, and again in 2021 for inciting hatred against Muslims.The party's leader, Santiago Abascal, has made several references to the Reconquista, as he did last year in a Tweet. \"Today is the anniversary of the reconquest of Granada, an indelible memory of the day the recovery of the entire national territory was completed after eight centuries of Islamic invasion,\" he wrote.Supporters of La Reconquista often display Spanish flags in their profiles and some openly praise Francisco Franco, the fascist dictator whose rule ended more than 40 years ago. They often refer to Muslims as Moors, an outdated historical term for Muslims from North Africa. One uses a photo of ex-U.S. President Donald Trump as their profile picture.",
        "\"If loving Spain is very facha, well, I am very facha,\" reads the Twitter bio of one supporter of La Reconquista, using a Spanish term for fascism.\"Reconquista style, but we won't only remove the moors but also those who opened their doors to them,\" wrote another.Spain has responded to the effort to rehabilitate Franco´s legacy by passing a law last year that made it a crime to glorify the dictator. In 2019 Franco´s body was exhumed from a tomb at a grandiose memorial complex built by the fascists. He was reburied in a nearby cemetery.Far-right groups in several countries have sought to reshape public understanding of events like the holocaust, slavery and, more recently, the Jan. 6, 2021 attack on the U.S. Capitol. By ignoring the details of the historic Reconquista or Franco's dictatorship, La Reconquista seeks to legitimize its own anti-immigrant views as traditional Spanish values, according to Marc Esteve Del Valle, a professor at the University of Groningen in the Netherlands who has studied Reconquista´s use of the internet.In that sense, the internet isn't just a place where Reconquista supporters find each other and share information, but a method of shaping public opinion and politics.\"The social networks are tools to organize, to mobilize. It's where the movement lives,\" Esteve Del Valle said.",
        "Twitter has drastically reduced its staff focused on ferreting out misinformation, hate speech and extremist content since it was bought by Elon Musk. The company did not respond to messages seeking comment about La Reconquista.In recent years a number of informally organized far-right groups have used social media in similar ways.In Italy, an anti-vaccine group known as V_V (after the movie \"V for Vendetta\") has used Telegram to threaten nurses, doctors and others involved in efforts to save lives during the COVID-19 pandemic. In Germany, a similar group known as Querdenken used Facebook to encourage violence against vaccine supporters until it was kicked off the site. In Brazil, supporters of former President Jair Bolsonaro plotted on social media ahead of January's violent attack in Brasilia.And in the U.S., social media played a critical role in spurring the deadly Jan. 6, 2021 riot at the U.S. Capitol, and is now being used by supporters of Trump in an effort to whitewash the events of that day.Trump himself has helped build bridges between some of the groups, as when he praised the Spanish Vox Party during a video message played at a rally last year.\"We have to make sure that we protect our borders and do lots of very good conservative things,\" Trump told the crowd. \"Spain is a great country and we want to keep it a great country. So congratulations to Vox for so many great messages you get out to the people of Spain and the people of the world.\""
    ]
}