{
    "articleURL": "/wires/reuters/article-12044817/Stock-markets-nervous-Fed-pivot-banking-sector.html",
    "content": [
        "SINGAPORE, May 4 (Reuters) - Global stock markets sagged while the Japanese yen rose on Thursday in reaction to the Fed's policy statement and signs of stress at another U.S. regional bank, spurring investors to price in a pivot rather than just a pause in rate rises.",
        "Another U.S. regional bank, PacWest Bancorp, reported troubles overnight, reminding investors of the precarious health of some banks despite regulators' assurances around containing the crisis that started with the collapse of Silicon Valley Bank and Signature Bank in March.The Fed raised interest rates by a quarter of a percentage point and signaled it may pause further increases, giving officials time to assess the fallout from the bank failures, wait on the resolution of a political standoff over the U.S. debt ceiling, and monitor the course of inflation.While investors initially cheered the possibility of a pause, their certainty appeared to wane as Chair Jerome Powell spoke since the Fed statement's new language does not guarantee the Fed will hold rates steady at its next meeting in June.\"The Fed decision was widely expected, so it didn't provide much of a shock to financial markets,\" Tina Teng, market analyst at CMC Markets, in Auckland.\"However, I think the whole economic playout is not positive, especially the recent banking rout from the regional banks, and those big banks taking over the smaller banks. It's not a good sign, and risks are spreading out into the wider banking system, which worries investors.\"MSCI's broadest index of Asia-Pacific shares outside Japan was flat, in trade thinned by Japanese holidays this week. China's benchmark index was about 0.4% weaker.",
        "E-mini futures for the S&amp;amp;P 500 fell 0.22%, reflecting the dramatic slide in regional banking shares after the close of U.S. markets. The S&amp;amp;P 500 had closed 0.70% lower.PacWest fell nearly 60% after announcing it is exploring strategic options, including a potential sale or capital raise, after a liquidity boost it announced in March failed to inspire confidence in its ailing share price.Those worries left Asian markets pricing in not just a possible peak in U.S. rates but even a fall.\"Investors are trying to understand whether this is a pause or not,\" said Rob Haworth, senior investment strategist at U.S. Bank Asset Management in Seattle.\"The market is trying to incorporate the data and anticipate the Fed. The Fed is trying to indicate a direction, and the market is looking further down the path than the Fed's willing to communicate.\"Treasury futures rallied, implying a 22% chance of a rate cut in June. The two-year note rose in price to a yield of 3.8%.The Japanese yen strengthened 0.1% versus the greenback at 134.51 per dollar, adding to its more than 1% rise on Wednesday.Mizuho analysts said the excitement over the implied pause in Fed tightening might be overdone and that the Fed's guidance \"is merely more contemplative\" and it was \"cautious about further hikes, not unduly panicked about having over-tightened\".",
        "The European Central Bank meets later and is expected to raise rates.(Reporting by Rae Wee and Vidya Ranganathan; Editing by Sam Holmes)"
    ]
}