{
    "articleURL": "/news/article-12057507/Long-Covid-patients-abandon-Stanford-Medicine-study-infection-staff-stop-wearing-masks.html",
    "content": [
        "Long COVID patients enrolled in a clinical study said staff weren't wearing masksAt least two abandoned the study because they were concerned and offendedThe Stanford Medicine study investigated a remedy for long COVID symptoms Long COVID patients enrolled in a study at Stanford University have walked out because the staff were not wearing masks while tending to them.",
        "The participants were enrolled in a clinical study into whether the drug Paxlovid works to reduce the symptoms of long COVID.Over the course of the 15-week study, participants were expected to visit the clinic in-person on five separate occasions, but after masking requirements were dropped multiple participants said the researchers stopped covering their faces.The walkouts were first mentioned on April 28 in a Reddit post on a forum for those suffering from long COVID.",
        "'We've been traveling hundreds of miles for months in order to try to participate in their study and provide THEM with data about the illness, and this is what they think of us,' wrote the Reddit user, whose wife was a participant in the study, according to the Daily Beast.'It's frankly abhorrent, selfish behavior, and not only does it demonstrate a complete lack of regard and understanding for the illness in question, in my opinion it calls into question the legitimacy of the entire study,' they added.Masking is no longer mandated by the California Department of Public Health and Santa Clara County Public Health, where the Stanford Infectious Disease Clinic is located and where the trial was held.The Daily Beast spoke with at least two people in the study who withdrew due to the lack of masks. When reached by publication, Stanford Medicine would only confirm that one patient in the Paxlovid trial pulled out over concerns around masks.",
        "'I knew that mask mandates were dropped, but I naively assumed that staff interacting with long COVID patients would still wear masks,' Olivia H., a patient in the trial who requested her full last name be withheld for privacy reasons, told The Daily Beast.'I was really disappointed when the research assistant and nurse entered my room without a mask on,' she added.'I would expect that all staff involved in the trial would understand that long COVID patients are fundamentally immunocompromised, and they would take necessary steps to protect what little health we have left from further deteriorating,' she said.The lead investigators of the trial, clinical assistant professor, Linda Geng, and professor of Infectious Disease, Upinder Singh, did not respond to requests for comment. ",
        "After participants in the study first started speaking out against the trial, some doctors criticized them for overreacting, including Jeffrey Bien, an oncologist with Stanford Medicine.'Be careful or you'll upset the super secret ultra-double-long-Covid community,' wrote Bien on Twitter on April 30, according to the Daily Beast. Bien was responding to a tweet from Vinay Prasad, a professor of epidemiology at the University of California in San Francisco.He questioned the disgruntled participants, writing: 'I am confused. If you already got COVID and already developed long covid then what does the mask do?'",
        "Long COVID is a little-understood condition that causes some people to experience some symptoms of the illness for long after first getting ill - for months, years and potentially longer.The technical term for the syndrome is 'post-acute sequelae of COVID,' or PASC, but doctors and researchers commonly refer to it as long COVID. More than 16 million people have developed long-COVID since 2019 and it is thought to affect between 5 and 30 percent of those that contract COVID-19, according to Stanford Medicine. However, since the illness is not well understood or defined, it is difficult to quantify exactly how many people have been affected with any certainty.",
        "Symptoms generally include chronic fatigue and exhaustion, brain fog, light sensitivity, shortness of breath, stomach issues, and heart palpitations.'I was (and still am) severely ill, and was excited to enroll in the trial as it would provide me with the chance to ease or eliminate some of my symptoms and participate in a trial that millions of long COVID sufferers are hopeful about,' Olivia H. told the Daily Beast. 'To me it almost seems logical, that long COVID patients in a long COVID trial need to be protected from the virus that triggered their illness in the first place.' Though the two lead investigators involved in the Stanford clinical study did not comment, a spokesperson for Stanford Medicine said in a statement: 'In accordance with the California Department of Public Health and Santa Clara County Public Health, wearing masks in all clinical settings is no longer mandated, but recommended.",
        "'We continue to recommend and support masking and make masks available for health care workers, patients and visitors at our care facilities.'"
    ]
}