{
    "articleURL": "/wires/ap/article-12041521/12-die-explosion-helicopter-crash-Chinese-holiday.html",
    "content": [
        "BEIJING (AP) - At least nine people were killed in an explosion at a Chinese petrochemical plant and three others died in a helicopter crash during the country's May Day holiday.",
        "Rescuers recovered the bodies of the nine workers killed in the explosion Monday at the Zhonghua Group plant in an industrial zone in the city of Liaocheng in the northern province of Shandong. One person remained missing and another was hospitalized with injuries, the zone´s management committee said in a notice Wednesday. An interdepartmental task force has been set up to investigate the cause of the blast, the committee said.On Tuesday afternoon, a small civilian-use helicopter crashed outside the northwestern city of Xi´an, killing all three people on board, state media reported. No information was given on the identities of the victims or the cause of the crash.Meanwhile, two earthquakes in the country's southwest on Tuesday and Wednesday caused minor damage and slightly injured 10 people.Work generally stops during the five-day May Day holiday, which ended Wednesday, during which tens of millions of Chinese flock to tourist sites.Despite improvements, industrial safety remains a major issue in China. Accidents are blamed largely on poor oversight and a sometimes cavalier approach to safety regulations. Industries that are major sources of employment and tax revenue are often given a pass on infractions.",
        "In February, 53 miners were killed in the collapse of a massive open pit coal mine in the northern region of Inner Mongolia, leading to numerous arrests, and four people were detained over a fire at an industrial trading company in central China in November that killed 38 people.",
        "The central government has pledged stronger safety measures since an explosion in 2015 at a chemical warehouse in the northern port city of Tianjin killed 173 people, most of them firefighters and police officers. In that accident, a number of local officials were accused of having taken bribes to ignore safety violations."
    ]
}