{
    "articleURL": "/sport/football/article-12054153/Bournemouth-1-3-Chelsea-Frank-Lampard-gets-win-interim-Blues-boss-two-late-goals.html",
    "content": [
        "Frank Lampard got his first win as Chelsea boss in this spell with a 3-1 away at plucky BournemouthConor Gallagher opened the scoring, but Matias Vina scored a superb curler to level for the hostsBenoit Badiashile scored his first Chelsea goal, before Joao Felix sealed it for the Blues late on The mood was definitely toxic. Todd Boehly’s name was invoked from the Chelsea end with a choice Chaucerian insult added. There was support proffered for Roman Abramovich, an oligarch sanctioned for enabling Vladimir Putin’s illegal war in Ukraine. And when Raheem Sterling and Hakim Ziyech came on they were roundly booed from the Chelsea end.",
        "Safe to say, all was not well for Chelsea here until the 82nd minute. There was nervousness on the ball, they were disorganised when repelling counter attacks and there was little to suggest a run of six successive defeats was coming to an end. As such, the darkening ambiance among the travelling support fitted the occasion.That said, it’s amazing what a couple of goals and your first win since March 11th can do. ‘We are staying up!’ was the delighted response from the Chelsea fans, ironically delivered but factually true: they are now pretty much safe from relegation, a huge goal difference swing aside, so that’s one milestone that Boehly can tick off in this mother of all meltdown seasons.Yet at the end of it all there was a victory – at last – and it was fashioned by the aforementioned Ziyech and Sterling, the former with a fine free kick into the path of Benoit Badiashile and the latter with a weaving run into the box to set up Joao Felix.Suddenly the world seemed a better, more manageable place. At the end, the Chelsea players walked over to their fans and there was a mutual exchange of goodwill. What had gone before, the six defeats under Frank Lampard, the two draws and defeats prior to that under Graham Potter and Bruno, was momentarily forgotten in the passing euphoria.",
        "‘It’s important to feel the connection between the players and fans,’ said Lampard. ‘They should enjoy it and we are happy there’s no doubt. Because when you don’t have that feeling for a while it gradually knocks you down. The lads are human, they have all been affected in similar ways and when you are not winning or don’t feel at your best the only way to get through that is to fight and work through it. Absolutely they should enjoy tonight and have a beer or have a wine.’",
        "Bournemouth (4-4-2): Neto 5; Smith 6, Senesi 6.5, Kelly 5.5, Vina 8; Ouattara, 6 Lerma 7 Rothwell 6 (Cook 59min, 6) Christie 8 (Semenyo 83); Billing 7 (Anthony 83) Solanke 6.5 (Brooks 90).Goal: Vina 21 Booked: Senesi.Subs (not used): Travers, Stephens, Mepham, Stacey, Zabarnyi.Chelsea (4-3-3): Arrizabalaga 7.5; Chalobah 6, Thiago Silva 7, Badiashile 7, Chilwell 6 (Azpilicueta 74); Kante 6.5 (Loftus Cheek 63, 6), Fernandez 5.5, Gallagher 7; Madueke 7 (Ziyech 74), Havertx 5.5 (Joao Felix 83) Mudryk 5.5 (Sterling 63, 7).Goals: Gallagher 9, Badiashile 82, Felix 86 Booked: Badiashile, Kante, Mudryk.Subs (not used): Mendy, Kovacic, Pulisic, HallReferee: J Brooks (Leicestershire) 7.",
        "They did that at least but for long periods, Chelsea still looked a bunch of scared strangers. N’Golo Kante, Conor Gallagher and Thiago Silva offered some leadership in driving the team on. Noni Madueke took off where he finished on Tuesday, in that he played with undoubted enthusiasm but his end product is wayward. Kepa Arrizabalaga made a fine save to keep out Matias Vina in the second half. But overall, there remains a lack of conviction.",
        "But maybe this can be a turning points of sorts. Maybe the nadir has been reached, but with fixtures against relegation-threatened Nottingham Forest, champions elect Manchester City, and Champions League chasing Manchester United and Newcastle to come, we will find out soon enough. ‘We cannot take our foot off the pedal in terms of trying to take steps forward until the end of the season because it is important,’ said Lampard.Indeed they can’t. For Bournemouth fans had their own response to Chelsea, which amounted to suggesting that for £600m, they were still not terribly good. Words to that effect anyway.For this looked to be Bournemouth’s game for the taking. ‘The only difference was they took their chances,’ said manager Gary O’Neill. ‘It was an even game. I’m disappointed that we weren’t clinical enough when Chelsea made a couple of mistakes and we didn’t make the most of them - and then we get punished at the other end. But we were always in the game.’Bournemouth had recovered from falling behind in the ninth minute, a really basic goal to concede, nothing more than a Kante cross and a fine Gallagher glancing header. But Lloyd Kelly will know that his foot up clumsy challenge on Gallagher wasn’t ever going to deter him.",
        "Yet they responded with a super effort, Matias Vina cutting in from the left, exchanging a series of passes with Ryan Christie and Dominic Solanke to cut Chelsea asunder. He received the ball back from Christie, moved it onto his right foot and curled it into the top corner.Thereafter they were the more confident team but never exploited the nervousness in Chelsea’s ranks. The visitors did come out in the second half, forcing a succession of corners and enjoying some possession. But momentum was swinging back to Bournemouth with that Vinas chance which Kepa blocked and a series of corners. And their big moment came on 78 minutes, with an in-swinging corner met firmly by Jefferson Lerma. It was directed into the path of Dango Ouattara, who rose to meet it but instead of diverting it into the net, he headed over. Heads were clutched all round.",
        "Four minutes later Chelsea were ahead, Ziyech dropping in a free kick beyond the Bournemouth back line and Benoit Badiashile was there to connect with a side footed volley from four yards.Four minutes later that it was Sterling breaking down the left, cutting inside to the box and finding Joao Felix, who drove the ball low into the net for 3-1.That was enough for the post-match reconciliation between fans and players. And for Lampard to order his own celebration toast.",
        "‘I’m ordering the beer for the coach now,’ he smiled. ‘But not too many.’ Indeed. It wasn’t a champagne performance; much more a two cans of cheap lager type of display."
    ]
}