{
    "articleURL": "/wires/aap/article-12057053/Sessions-Barrett-inspire-Eels-Brown-best.html",
    "content": [
        "Parramatta five-eighth Dylan Brown will be out to weaponise Trent Barrett's attacking wisdom when he takes the reins from Mitchell Moses in the clash against Canberra this Saturday.",
        "Moses suffered a category-one head knock attempting a tackle in the Eels' 26-24 Magic Round loss to Gold Coast and has been ruled out of round 11 per the concussion protocols introduced by the NRL this season.The Eels' following game against South Sydney will come only 12 days after Moses' concussion, so the halfback is no guarantee of returning for that fixture if he experiences prolonged symptoms.Without their game-managing half, the Eels will rely on Brown and back-up playmaker Jake Arthur to steer the ship back to the winner's circle, lest the 12th-placed Eels fall further behind their premiership rivals.\"Obviously Mitch is one of our best players, if not the best,\" Brown said.\"It's obviously disappointing (to lose him), it's the way the game goes and we obviously care more about his health rather than him playing.\"I've obviously got to step up and do certain things. Kicking's probably the main thing, that's what we lose when we lose Mitch.\"The challenge has come at the right time for Brown, who has lifted his game since being put on notice by coach Brad Arthur for his slow start to the season last month.Brown set up two tries and ran for 238 metres in the loss to the Titans, which was decided on goal-kicking.",
        "The 22-year-old credits his sessions with new Eels assistant coach and former Dally M Medal-winning playmaker Barrett for his upswing in form.After vacating Canterbury's head-coaching job last May, Barrett assumed the role of attacking coach at the Eels for the 2023 season - a position he held at Penrith on the run to the 2020 grand final.\"He's been massive for me,\" Brown said.\"He encourages me to push, push, push because when the ball's in the spine's hands, good things happen. The more involved I am, I feel like the better my edge goes.\"'Baz' is all about running and staying on the ball and demanding the ball and being there. As a half, you've got to be in the moment and I'm trying to work on that.\"Brad encourages effort and those sorts of things, whereas 'Baz' can talk about plays and executing and things. He's good like that.\"Arthur has slipped out of the Eels' bench rotation since their 2022 grand final loss but Brown backed the coach's son to break the Raiders down with his footy smarts when he lined up for his first NRL game of the year.\"When your dad's the head coach in the NRL and you've been in and amongst it for 21 years now, you slowly learn a few things,\" Brown said.",
        "\"He's probably one of the smartest players in the team when he comes up.\""
    ]
}