{
    "articleURL": "/wires/ap/article-12041059/Stock-market-today-World-shares-mixed-Fed-decision.html",
    "content": [
        "BEIJING (AP) - Asian stock markets were mixed Thursday after the Federal Reserve raised its benchmark lending rate again to cool inflation and said it wasn't sure what may come next.",
        "Shanghai and Hong Kong advanced while Seoul and Sydney declined. Japanese markets were closed for a holiday.Wall Street's benchmark S&amp;P 500 index fell 0.7% on Wednesday after the Fed announced a 0.25 percentage point increase in its lending rate. The Fed's statement dropped a reference to \"additional policy firming\" but stopped short of declaring an end to rate hikes.\"The key takeaway, in my view, is that we are likely at or very near the end of the rate hike cycle,\" said Kristina Hooper of Invesco in a report.The Shanghai Composite Index rose 0.5% to 3,340.28 and the Hang Seng in Hong Kong surged 1.1% to 19,924.15.The Kospi in Seoul lost 0.3% to 2,494.80 and Sydney's S&amp;P-ASX 200 fell 0.2% to 7,183.20. New Zealand and Southeast Asian markets also declined.",
        "On Wall Street, the S&amp;P 500 fell to 4,090.75. The Dow Jones Industrial Average lost 0.8% to 33,414.24 and the Nasdaq composite slipped 0.5% to 12,025.33.Traders expect a U.S. recession this year as the Fed and other central banks in Europe and Asia try to extinguish inflation that was near multi-decade highs.Jitters have increased following three high-profile bank failures in the United States and one in Switzerland blamed on strain from higher interest rates. Central banks have tried to reassure investors by pledging steps including additional lending if needed.",
        "Traders expect the Fed to start cutting rates as early as this year to prop up weakening economic growth.On Thursday, Fed Chair Jerome Powell said he doesn't expect rate cuts that soon.Traders worry industry turmoil might prompt banks to reduce lending, worsening downward pressure on economic activity. Powell mentioned a survey that is yet to be released and will show how much loan officers at banks say they are tightening lending standards.Shares of PacWest Bancorp, Western Alliance Bancorp and other rivals fell again a day after trading was halted following steep price slides. Western Alliance fell 4.4%.PacWest sank 2% after being up earlier in the day but plunged another 52.5% in after-hours trading. It and other similar lenders have large amounts of uninsured deposits - those above $250,000 - which have become a larger liability because rich and wealthy clients have shown themselves willing to pull their money out at the first sign of trouble.The banks are also exposed to low-interest loans that are now worth less on the open market due to the fact they were underwritten when interest rates were substantially lower.On the opposite end was Eli Lilly, which rose 6.7% after reporting encouraging results from a study of a treatment for Alzheimer´s disease. Kraft Heinz rallied 2% after beating analysts´ forecasts for profit and revenue.",
        "Profit for most U.S. companies during the latest reporting season are better than feared but are expected to reflect declines.Advanced Micro Devices fell 9.2% despite reporting stronger profit and revenue than expected. It gave a forecast for revenue in the current quarter that fell short of some analysts´ expectations.A report Wednesday suggested the job market may be in better shape than expected. ADP said hiring among private employers accelerated much more last month than forecast. That could raise expectations for the federal government´s hiring report on Friday.In energy markets, benchmark U.S. crude advanced 30 cents to $68.90 per barrel in electronic trading on the New York Mercantile Exchange. The contract plunged $3.06 on Wednesday to $68.60. Brent crude, the price basis for international oil trading, gained 45 cents to $72.78 per barrel in London. It fell $2.99 the previous session to $72.33.The dollar fell to 134.47 yen from Wednesday's 135.46 yen. The euro rose to $1.1085 from $1.1058."
    ]
}