{
    "articleURL": "/sport/nrl/article-12053807/Dolphins-new-cult-hero-Valynce-Te-Whare-scores-twice-fairytale-NRL-debut.html",
    "content": [
        "Valynce Te Whare scored a stunning try on debut for the DolphinsThe young centre only made the switch to rugby league last seasonDolphins beat Cronulla 36-16 to move up to sixth on the NRL ladderThe Dolphins' stunning inaugural season in the NRL took a new extraordinary turn on Saturday with Valynce Te Whare scoring twice on his debut in the competition in a 36-16 win over the Sharks. ",
        "The young centre announced himself on the big stage with a barnstorming try just 23 minutes into his NRL career as the Dolphins blew Cronulla off the park in the first half of their Magic Round clash.Te Whare received a pass from Isaiya Katoa, before easily brushing Sharks winger Ronaldo Mulitalo aside as he barged through a narrow in Cronulla's defence to score.'I think we are going to find with Val that he is a big match player. The bigger the occasion the better he will play,' Dolphins coach Wayne Bennett said.\"Some players have that kind of psyche and it is part of his DNA.\"",
        "Te Whare has elicit comparisons with league Immortal Mal Meninga and Broncos great Corey Parker was impressed by what he saw. 'Have a look at this, from a standing start the power and acceleration,' he said on commentary on Fox League.'See you later Mulitalo, straight through some good defenders. What a moment for the young man on debut.'Te Whare's stunning debut got even better early in the second half, when the rugby union convert crossed for his second try of the night. The 22-year-old only made his debut against the Sharks because of an injury to Brenko Lee, which forced the Dolphins coach to reshuffle his pack.",
        "Te Whare had never played the 13-man code until he signed for the Dolphins Queensland Cup team in December 2021, after team manager Peter O'Sullivan spotted him playing for King Country in New Zealand.He spent last season learning the code, while working as groundskeeper at Kayo Stadium in Redcliffe.The code switch came easy to the New Zealander, who scored 16 tries and made 24 line breaks in just 20 appearances in the Queensland Cup last season.",
        "The giant centre made his National Provincial Championship debut for Waikato in 2019 and played for the Chiefs Under-20 team in the same year alongside future All Blacks Josh Lord, Quinn Tupaea and Tupou Vai'l. Earlier this week, Bennett said Te Whare was 'a bit of a good story' and revealed he was one of the first players signed by the NRL newcomers.'He is one of the first players we signed here. [Recruitment chief] Peter O'Sullivan saw him in New Zealand playing rugby in the schoolboys,' he said.'To his credit he has worked really hard and had to make a pretty big adaption from rugby to rugby league. ",
        "'We have invested quite a bit of time in him. It has worked out for both parties.'However, the veteran coach shot down comparisons with Meninga.",
        "'I saw that the other day and I thought: \"What are the similarities between him and Mal Meninga?''I coached Mal. He is a great player and a great guy. I thought the only similarity was his shorts. I reckon they are both the same size. He is no Mal Meninga, I can tell you that.'"
    ]
}