{
    "articleURL": "/news/article-12044625/Lawmakers-demand-answers-shore-wind-turbines-blame-whale-deaths.html",
    "content": [
        "New Jersey lawmakers asked for an up to 60 day halt on construction of sprawling wind farms being built off the coast during a hearing on WednesdayAbout 32 whales have turned up dead along east coast beaches since December Federal researchers have insisted the deaths are not caused by wind turbinesNew Jersey Republicans opposed to the state's offshore wind turbines asked that construction on the projects be halted for up to 60 days to see if it will reduce the number of whales that have been washing up dead on east coast beaches.",
        "More than 30 dead whales have been found along East Coast beaches in recent months, leaving some to say turbines are to blame.  During a Wednesday hearing, four New Jersey state senators requested that wind farm work be halted for 30 to 60 days, the latest step in a movement started by environmental groups in January to determine whether turbines could be the cause of the scores of recent whale deaths.Since December, at least 32 whales of different species have been found dead on east coast beaches from Massachusetts down to Florida, a large number of which were found along the Jersey shore.New Jersey has been rapidly clearing way for the development of new wind farm projects of its coasts, with large-scale construction already underway at several sites.",
        "Though skeptics - including federal agencies such as The National Oceanic and Atmospheric Administration (NOAA) - have been adamant there is no evidence the farms are causing the deaths, federal lawmakers like New Jersey Democratic Senator Cory Booker have requested deeper investigations into what might be causing the deaths.Republican New Jersey Senator Michael Testa said halting construction on the wind farms was an easy way to test the theory.'One thing our side of the aisle gets accused of is not following the science,' he said, according to CBS News. 'So what is the harm of waiting 30 or 60 days?'",
        "In January, the Clean Ocean Action environmental group asked President Joe Biden to step in and halt the wind farm projects, saying there was evidence it was related to the whale deaths.'We've gone too far, too fast,' Clean Ocean Action executive director Cindy Zipf said, 'Over 2.2 million acres is being allocated to offshore wind and 10,000 miles of cables. We became alarmed that it was plausible that activity going on offshore had to do with the whale die-offs. We felt there was a reason for investigation.'The federal government has been studying whale deaths since it declared an 'unusual mortality event' involving humpbacks in 2016. Since then, nearly 200 whales have turned up dead along east coast beaches.The NOAA publishes a list of deceased whales each year, many of which are humpback or right whales, but other species have washed ashore as well. NOAA has said necropsies performed on the whales have determined that many of their deaths were the result of ship strikes, but panelists at Wednesday's hearing said governments have been turning away from the problem in favor of letting the new energy infrastructure develop.'You can't find evidence if you don't look for it,' conservation biologist Trisha DeVoe said.State Senator Anthony Bucco agreed, saying 'We're being told, 'Just accept what we tell you.'",
        "People in the fishing industry have also said the turbines would wreak havoc on the radar systems crucial to their livelihoods. 'Offshore wind is the single greatest existential threat to commercial fishing in the United States right now,' said Meghan Lepp, of the seafood business Seafreeze.But skeptics of the wind farm theory have said climate change is the greatest threat to the lives of marine life on the east coast.'We know that the climate crisis is the biggest threat to marine mammals and their habitats,' U.S. Rep. Frank Pallone Jr. of New Jersey said in a statement, according to CBS News.   'The food source whales depend on is moving closer to the busy shipping lanes near the Port of New York and New Jersey as ocean temperatures rise, leaving them vulnerable to vessel strikes and entanglements.'"
    ]
}