{
    "articleURL": "/wires/reuters/article-12059917/Agency-warns-Sweden-miss-CO2-targets-biofuel-cut.html",
    "content": [
        "STOCKHOLM, May 8 (Reuters) - Sweden will struggle to hit its 2030 emissions targets, a government agency warned on Monday, after the country's minority coalition cut the biofuel that must be added to diesel and gasoline.",
        "The right-wing Sweden Democrats-backed coalition government has already cut fuel taxes, raised tax breaks for people driving to work and ended new electric vehicles subsidies.Mixing in biofuels from renewable sources is a way to reduce emissions from cars, but the government said at the weekend it will cut the required amount of biofuel to 6% in 2024 and for it to remain at that level until the end of 2026.Under current rules diesel has to contain 30.5% biofuel and petrol 7.8%. The percentage was meant to increase each year.The decision was motivated by the cost-of-living crisis amid soaring inflation. Sweden has some of the highest diesel and petrol prices in the world, mainly due to heavy taxes. The move was criticised by the Swedish Environmental Protection Agency.\"A year ago we were on track to with a high probability reach all of our 2030 goals but with this decision the conditions have worsened significantly,\" Stefan Nystrom, the agency's Director of Department of Climate told Reuters.\"The transport policy goal of a 70% reduction in emissions until 2030 becomes more or less impossible to reach,\" he said.The government says people who live in the countryside are penalised by the regulations.\"The rules for the biofuel mix have not been an effective climate policy,\" the government and the Sweden Democrats said in the Dagens Nyheter newspaper on Sunday.",
        "The party had wanted biofuel levels to be cut to zero and threatened to bring down the government if that did not happen.Diesel currently costs around 20.3 Swedish crowns ($2.00) per litre and petrol 18.8 crowns. The government said reducing the amount of biofuel will cut the cost of a litre of diesel by 5.5 Swedish crowns.The opposition was also critical of the move, with Marta Stenevi, leader of the Green Party, saying on Twitter the move would push \"the entire bill to our children\". ($1 = 10.1613 Swedish crowns) (Reporting by Simon Johnson and Johan Ahlander; Editing by Alexander Smith)"
    ]
}