{
    "articleURL": "/femail/article-12059473/Im-female-astronaut-like-living-International-Space-Station.html",
    "content": [
        "Kayla Barron, from Washington was a part of the Expedition 66 crewThe 35-year-old lived aboard the ISS from November 10, 2021 to May 6, 2022In a Reddit Q&amp;A, she revealed what life was like - from washing to eating A female NASA astronaut who spent almost six months aboard the International Space Station (ISS) has revealed what it was like living 250 miles above Earth in zero gravity, with everything from bathroom habits to exercise regimes laid bare. ",
        "Kayla Barron, from Richland, Washington, was a member of the Expedition 66 crew from November 10, 2021 to May 6, 2022, and as part of her mission she conducted various scientific experiments to help identify new materials that could be used for designing future spacecraft. During her stint in space, Kayla, 35, shared images and videos to social media, and in a recent Reddit thread she gave further insights about what went on behind the scenes at the ISS. Asked by one inquisitive eight-year-old how she went to the bathroom, Kayla revealed: 'We have space toilets with fans that create suction to pull waste away from our bodies. We pee into a hose with a funnel on the end, and poop into a bag inside a canister. It takes some getting used to but works pretty well!'",
        "On the subject of sleeping, Kayla explains that as the ISS orbits the planet every 90 minutes, the crews experience 16 sunrises and sunsets every day, and 'spend about half our time in the sun and half our time in shadow.'However, because humans follow a cycle of about 24 hours - also known as a circadian rhythm - that's how astronauts structure their days in space.Kayla and her crewmates worked on Greenwich Mean Time (GMT) and usually slept from about 10pm to 6am.",
        "Mealtimes also followed a similar structure to on Earth and the freeze-dried meals she had were much better than she envisaged.Some of her favorite culinary creations included vegetable quiche, pasta with shrimp, and 'perhaps the most coveted... the Japanese Space Agency's canned teriyaki chicken! Highly recommend.'On her Instagram page, where she uses the handle @astro_kayla, Kayla posted a video to demonstrate how she worked out in space. In the clip, she can be seen using various pieces of equipment including a running machine and some bicycle pedals which she operates while standing up and pulling herself down to prevent herself from floating away.She explains in the accompanying caption that astronauts on the ISS work out everyday to 'stay fit and to prevent muscle atrophy and bone density loss.'For her, exercising also provided a 'huge psychological benefit' as she could get some time to herself. ",
        "'I would feel pretty cooped up without [the gym],' she said. The 'amazing equipment' aside, one of the other highlights of the onboard gym, Kayla said, were the views thanks to a large observatory module. She wrote in the overlaid caption: 'People will typically come up here and take pictures... as far as I know, it's got the best view of any gym in the world or off the planet.' ",
        "In another clip, Kayla shows viewers how she washes her hair in space. As water behaves differently in zero gravity with it floating instead of splashing, the astronaut shows how she has to use a bag with a straw attached to squirt the water directly on to her scalp. This way, the water absorbs into her hair instead of escaping. She then has to work her fingers into her hair to ensure all of her tresses are wet. Once that is done, she uses a 'shampoo bar' before rinsing it three to four times to check all of the suds are out. In the video, her hair can be seen standing on end once she has finished washing it. On the science side of things, one Redditor asked Kayla about the most interesting experiment she conducted in space, to which she replied: 'I loved all of our plant experiments, especially the ones that allowed us to care for, grow, and even eat edible crops. ",
        "'We got to harvest some hatch chilis and had an extra-spicy taco night to celebrate. I also really enjoyed tech demos that could improve our exploration capabilities in the future. 'For example, we installed and operated for the first time in space a miniature scanning electron microscope that could be an awesome tool in planetary exploration for identifying the most interesting samples to return to Earth for further study.'",
        "Looking ahead, Kayla says she plans to stay at NASA for a 'very long time!'In terms of her career trajectory, the Washington native graduated from the U.S. Naval Academy with a bachelor’s degree in systems engineering.Then as a Gates Cambridge Scholar, Kayla earned a master’s degree in nuclear engineering from the University of Cambridge before becoming a Submarine Warfare Officer.She was among the first class of women commissioned into the submarine community and she worked on a Ohio-class ballistic missile submarine homeported in Bangor, Washington.Following her appointment with the Navy, Kayla was selected by NASA to join the 2017 Astronaut Candidate Class and reported for duty that August following an initial training process. Offering her advice to other wannabe astronauts, Kayla concludes: 'Never close a door on yourself! When you dream big, it's easy to talk yourself out of risking failure, but failures are often our best opportunities to learn and grow, and if you don't take risks, you'll never achieve your goals. 'Share your dreams with people you trust, take chances, and don't assume that because things are hard it means you're not good at them.'When I joined the Navy, I'd never dreamed that I'd someday be an astronaut. I knew that I wanted to serve, and dedicate my life to something bigger than myself. It wasn't until after serving on a submarine that it even occurred to me that I might have the potential to become an astronaut.'"
    ]
}