{
    "articleURL": "/news/article-12054489/Social-media-users-joke-Duchess-Sussex-donned-heavy-disguise-Westminster-Abbey.html",
    "content": [
        "Twitter users joked that the Duchess of Sussex had snuck into the coronation  Read more on the MailOnline royal live blog with minute-by-minute coverage While Meghan, the Duchess of Sussex, remained in Montecito with her two children, Lilibet and Archie, some eagle-eyed Twitter users were convinced she had made it to Westminster Abbey. ",
        "Speculating that the duchess might have snuck into today's service in a large white wig and glasses, one tweet joked that she 'wasn't fooling' anyone.  But it turns out the hairdo was not an elaborate disguise - instead, the man pictured was legendary composer Sir Karl Jenkins, whose 'haunting, very Welsh' work Tros y Garreg was played during the ceremony. Others joked online about the misunderstanding, saying it was 'Tilda Swinton deep in character' or 'Just wait until the polyjuice [a transforming potion from Harry Potter] wears off'. Many agreed that the off-the-cuff remark was one of the best jokes made about the day, which saw King Charles III crowed at Westminster Abbey alongside his wife, Queen Camilla.  ",
        "Composer Sir Karl Jenkins, 79, recently told BBC News that he remembered watching the last coronation in 1953 as an eight-year-old in Swansea. Today his music formed part of Charles III's coronation ceremony, to show the King's love and appreciation for Welsh culture and music. 'I am very honoured. It obviously sums up Welsh culture - the harp - and he [the King] has always supported Welsh music,' said Sir Karl.'I don't know whether he chose it, but he was happy to have it there. I know he likes it otherwise he wouldn't have asked me.'",
        "The piece was first composed for the then Prince of Wales two decades ago, when he was reinstating the role of royal harpist. Catrin Finch, the first person to win the reinvigorated role, played the piece.  'It's a slow movement based on old Welsh folk tune,' said Sir Karl. 'It's haunting, it's very Welsh and the story is redolent of a soldier returning home and crossing the stile.",
        "'It starts very quietly, with the strings playing the melody of the folksong, then the harpist is doing this technique called bisbigliando, which means whispering in Italian,' he added.Sir Karl is perhaps best known for composing the song Adeimus, which was official released in 1995 and featured in Delta Air Lines in-flight adverts and as the opening music on Biblical series Testament: The Bible In Animation. He studied music at Cardiff University and the Royal Academy of Music, where he is a fellow and an associate. He became the lead songwriter of jazz-rock bank Soft Machine in 1974, having joined the band two years earlier. He collaborated with Tim Rice and Andrew Lloyd Webber on Jesus Christ Superstar and with Elton John on Tumbleweed Connection, released in 1970.  In 2008 Jenkins's The Armed Nab was listed as No. 1 in Classic FM's 'Top 10 by living composers'.",
        "He received an OBE in the 2005 New Year Honours and a CBE in 2010, before being knighted in 2015. "
    ]
}