{
    "articleURL": "/wires/pa/article-12051337/Unai-Emery-says-Villa-keen-build-structure-amid-links-Mateu-Alemany.html",
    "content": [
        "Unai Emery hinted Aston Villa are closing in on Barcelona’s director of football Mateu Alemany.",
        "The LaLiga leaders have already confirmed he will leave at the end of the season, with Villa his expected destination.It will be the next piece in the puzzle for Emery at Villa Park as the club looks to move to the next level.He said: “Mateu Alemany is a person with experiences, he has worked at a high level and, if he’s coming here because it is a possibility, it will be a very good opportunity to create a strong structure with him.“It’s not the moment to speak about some circumstances that could come here, about some expectation about who is coming here. When I was committed with the chairman Nassef (Sawiris) and with Wes (Edens), we were speaking about the objective in our future we want to create.“We want to strengthen our structure. To try to get another level going up with the team, with the players, with the structure we can create here.”",
        "Villa go to Wolves on Saturday having dropped to eighth after the midweek results but remain in the hunt for a surprise European place.Emery recognises failing to qualify for Europe could impact the calibre of players the club could sign this summer but it will not change his ultimate goal.“Maybe, yes, but it’s not changing the mind I have, the idea we spoke about,” he said.",
        "“We want to create a strong structure here, a strong mentality. You have to build a team like a family. If we are in Europe – we will add some possibility to take away trophies, playing more matches, for me it will be fantastic.“If it’s not this year, my idea and objective is the same – try to play in Europe with Aston Villa. Not only just to play in Europe but I want to play in the Champions League with Aston Villa. ”Philippe Coutinho, Matty Cash, Leon Bailey and Boubacar Kamara have all resumed training and could be involved at Molineux.Emery added: “This week was fantastic. Coutinho started training on Monday, Kamara and Leon on Wednesday and Matty Cash started training with the group yesterday.”"
    ]
}