{
    "articleURL": "/tvshowbiz/article-12038183/Vicky-Pattison-showcases-incredible-figure-blue-triangle-bikini-lavish-Dubai-getaway.html",
    "content": [
        "Vicky Pattison showed off her incredible figure in a blue bikini on Tuesday as she posed up a storm from a beach club in Dubai. ",
        "The former Geordie Shore star, 35, looked sensational in the triangle swim two-piece, which she teamed with a pair of black sunglasses. She flashed her toned stomach and put on a busty display as she relaxed poolside with friends.The beauty appeared in great spirits, as she sipped on a cocktail and basked in the sunshine.She styled her brunette tresses straight, cascading past her shoulders, and accessorised with a gold chain necklace. ",
        "Enjoying her time with friends, the star shared a series of snaps of them partying it up - drinks and food galore. She penned: 'No ducks givennnnnnn.'Thompo Takes Dubaiiiiiii....'Today was amazingggggg man!!! Just the best time, with the best people...✨ @blabladubai for @ladiesday_dubai is so much fun ✨Huge Thankyou @djchriswright as always son! ✨'Vicky has been giving fans plenty of updates on her trip, and only a day earlier showcased her incredible figure in a black bikini and a tan co-ord.She flashed her toned legs through an eye catching thigh high split and opted for a pair of black flip flops. Vicky styled her long brunette tresses in a messy up do leaving waved strands to frame her face.While enjoying cocktails over lunch, the TV personality added a pair of round dark sunglasses. ",
        "It comes after Vicky opened up about her body image struggles, admitting she is feeling insecure about her figure ahead of flying to Dubai next week.Ahead of jetting off to the UAE for a getaway with pals, the TV star said she is also recovering from her egg retrieval procedure at the moment.Currently going through the process to freeze her eggs, the recent medical procedure has left her bloated and inflammed, with the star explaining that she is 'amazed' at the work her body has done.But despite being in awe of her body, Vicky admitted that she was also 'mad at it' as she worried about image.She explained on Saturday: 'This thought process is not one I'm proud of but it is super hard to escape a lifetime of being conditioned into believing you are only attractive if you're a specific size or shape'.Taking to her Instagram page, Vicky shared a three-way collage of pictures taken just in a T-shirt and her underwear.Showing her real body in the natural snaps, the TV personality opened up to her 5.3M followers on the struggles she is facing.She penned: ' The human body is pretty amazing... isn't it?? Over the last two weeks my little body has been pumped full of hormones, manipulated into creating 10 eggs, 9 of which were mature and ready for the next stages! It has literally created life- Potentially 9 times over! ",
        ",'It has done far more than I ever expected it to in such a small space of time- it's incredible really. And you know the craziest thing?? Is that even after all I've put it through, all it's done for me.. I'm mad at it.'Adding where her insecurities come in, Vicky continued: 'I should be celebrating everything that my body has given me and instead I am worrying about what I'm going to look like in a bikini in Dubai next week. And please don't think how vapid and superficial that is, is wasted on me.. This thought process is not one I'm proud of but it is super hard to escape a lifetime of being conditioned into believing you are only attractive if you're a specific size or shape.'I know I'm a huge advocate for loving the skin you're in... even if it's not your usual skin. So this may seem a little bit hypocritical.. But with the recent changes to my body being so sudden.. I haven't even had a chance to get my head around them just yet. But I promise I will.'My giant sore and swollen boobs, my bloated little tummy and my saggy little boy butt are testament to what my little body has given me - which is a chance at future happiness and I need to be beyond grateful to it. Not speaking negatively about it and wishing it was something else. But sometimes those intrusive little thoughts sneak in don't they?",
        "Remaining positive, she continued to look to the fun Dubai trip and not focus on the insecurities.Finishing: 'But you know, once I get out of my head and into the moment in Dubai I reckon that I'll stop worrying that my bod isn't itty bitty or perfectly sculpted and just have fun with my mates! Because they don't care that im not a size 6 or have perky little boobs- they love me for me, and I should really start doing the same.'So I suppose that this is just a friendly reminder, to myself and anyone else that needs to hear it- bodies change. Our bodies are constantly changing- and whether they're bigger or smaller, squishy or skinny they are all deserving of love and celebration. And some cocktails in the sun once in a while'. ",
        "Vicky underwent the egg retrieval procedure last week, and shared a number of snaps from the hospital as she admitted that her recovery from the medical procedure has been more 'painful' and 'difficult' than expected.Explaining that it had been a 'challenging few days', the brunette beauty did add the good news that 10 eggs had been retrieved. Retrieval is part of the egg freezing process and is an ultrasound-guided procedure which usually takes 20–30 minutes, putting the patient under anesthetic.",
        "And the update from Vicky is the latest in a string, where she has been keeping fans in the loop of her journey.Vicky recently explained that she doesn't feel ready yet to have a child with her fiancé Ercan, 29, and believes by freezing both her embryos and her eggs it 'relieves herself of the pressure'.'I was just freezing my eggs before but freezing embryos has a better success rate so I am doing both,' she told New! Magazine.'I'm 35, but I don't want a child right now. I'm not ready. No one's ready, Ercan and I have been dating four years and he's 29. The last thing I want to do is force him into a situation where he's not confident or not ready and then he becomes resentful.'Vicky adds due to her struggle to find the perfect wedding venue with the 'wow factor', they may find they end up having a baby before getting married.'The wedding process has been more challenging than I anticipated. We may not marry first, it might be the year after that as I don't have to be married to have a baby. Everything will happen when it should.'"
    ]
}