{
    "articleURL": "/wires/reuters/article-12059275/Italy-learn-live-drought-inducing-weather-minister.html",
    "content": [
        "Drought is not a one-off crisis, Italy minister says",
        "Italy needs to do much more to adapt to new weatherCountry must not be \"ideological\" about climate changeBy Crispian Balmer and Angelo AmanteROME, May 8 (Reuters) - Italy's long-running drought is a result of climate change, meaning the country must adjust to the new reality, Agriculture Minister Francesco Lollobrigida told Reuters.Lollobrigida said Italy needed to build more basins to capture rainwater, urgently patch up leaky water networks, repair dams and consider removing traditional, but thirsty crops away from increasingly arid areas.\"The drought is not a (one-off) emergency, it is linked to climate change,\" said the minister, who is a senior member of the ruling, nationalist Brothers of Italy party.Italy suffered its most severe drought in 70 years in 2022 and prolonged dry winter weather has raised fears that 2023 could be even worse, alarming both the agricultural and industrial sectors that depend on copious water supplies.The government this month appointed a commissioner to take charge of the crisis and lead a task force of senior officials from various ministries.\"We must consume water better in agriculture, invest in research, use new drip irrigation methods and underground irrigation, and be organised to use every drop of water in the best way without any dispersion,\" Lollobrigida said.",
        "He said leaky pipes were a major problem, with an average of 41.2% of water lost from the national network before reaching the taps. By comparison, Germany had a water dispersion rate of 6.5%, the minister said.He added that Italy needed to construct more pools to collect rainfall, saying precipitation had not radically decreased, but came in shorter, sharper bursts, as happened last week in the northern Emilia Romagna region, triggering floods.\"We have a water catchment of just 11% and therefore we do not keep rainwater,\" he said.One quick fix would be to repair dozens of Italy's nearly 530 dams that had fallen into disrepair, he said, estimating that 30% of the country's dams were obstructed.Despite acknowledging that man-made climate change was to blame for the drought, the minister brushed aside criticism that the government was looking to hobble EU efforts to cut carbon emissions and green the economy.Since January, Italy has demanded that the European Union dilute a directive aimed at improving the energy efficiency of buildings, water down plans to phase out combustion engine cars and question a drive to slash industrial emissions.\"I think we need to be more pragmatic and less ideological,\" Lollobrigida said, warning of the dangers of turning Italian industry \"into a desert\" by imposing tough CO2-reduction curbs, while nations elsewhere were not doing the same.",
        "\"If we stop producing CO2 from one day to the next, but on the other side of the world some nations multiply production using energy with a strong environmental impact ... the planet does not change much, in fact it probably gets worse,\" he said. (Reporting by Angelo Amante and Crispian Balmer; Editing by Sharon Singleton)"
    ]
}