{
    "articleURL": "/wires/ap/article-12053659/The-Latest-Crowds-grow-outside-palace-kings-coronation.html",
    "content": [
        "LONDON (AP) - The Latest on the coronation of King Charles III:",
        "London´s police force says officers made a total of 52 arrests on coronation day, with people being detained for alleged offenses including disrupting public order and conspiracy to cause a public nuisance.The Metropolitan Police has come under criticism for the arrests and for being too draconian with peaceful protesters. The police force has said that its tolerance for any disruption would be low, and that it would deal \"robustly\" with anyone trying to undermine the celebration.Commander Karen Findlay acknowledged the concerns, but defended the force´s actions.\"The coronation is a once-in-a-generation event and that is a key consideration in our assessment,\" she said. She added that police allowed a protest involving large numbers to go ahead.",
        "More on the coronation of King Charles III:- Full coverage of the king's coronation- Inside Westminster Abbey for the ceremony- In photos: who wore what___LONDON - From Jill Biden´s perch in Westminster Abbey, it was \"really surreal to see and experience that moment\" when King Charles III and Queen Camilla were crowned.\"You know, you can´t imagine that moment where you actually see the crown being placed\" on their heads, the American first lady said in a telephone interview with The Associated Press from London.\"There was such beauty in the pageantry of the ceremony,´´ she said. She was representing the United States at the coronation on Saturday.",
        "The first lady also discussed her conversation from Friday with Princess Kate, the wife of Prince William.The two mothers talked about shared experiences - having kids in church and \"you do anything to keep them quiet.\"The first lady said Kate \"didn´t know if her son could sit still for two hours and we just had a good laugh over it. You know, it´s just something, I think, that´s common to a lot of us.\"At the coronation, Jill Biden sat next to Ukraine´s first lady, Olena Zelenska.LONDON - King Charles III, Queen Camilla and members of the royal family have appeared on Buckingham Palace´s balcony to greet a cheering crowd.The royal couple were flanked by Charles´ son and first in line to the throne, Prince William, his wife Kate, and their children. Also on the balcony were two of Charles´ siblings, Princess Anne and Prince Edward.Thousands of well-wishers ran onto the Mall, the grand avenue leading up to Buckingham Palace, to get as close as possible and get a glimpse of the royal appearance.The crowds appeared jubilant despite the pouring rain, clamoring to get the best spot in front of the palace.The Red Arrows, the Royal Air Force´s aerobatics team, wowed the crowds as they flew past and left red, white and blue trails in the sky. --",
        "LONDON - French President Emmanuel Macron, who attended the coronation ceremony with his wife Brigitte, expressed his \"congratulations to King Charles III and Queen Camilla, friends of France.\" \"Proud to be by your side on this historic day,\" he posted on Twitter. --LONDON - Britain´s Ministry of Defense says a highly-anticipated military fly-past over Buckingham Palace to mark King Charles III´s coronation has been scaled down because of wet weather.The original plan was for more than 60 aircraft from the Royal Navy, British Army and Royal Air Force to stage a colorful display in the air after Charles, Queen Camilla and other key members of the royal family appear on the palace balcony to greet well-wishers.The fly-past will now be formed of the Red Arrows, the Royal Air Force´s aerobatic team, and helicopters. The display will last for two minutes and 30 seconds.LONDON - Thousands of military troops that marched through London in King Charles III´s coronation procession saluted their commander in chief on the lawn of Buckingham Palace.The troops removed their caps and gave three rousing cheers to the newly crowned king and Queen Camilla who watched from a perch looking over the palace gardens.\"Hip, hip, hooray,\" the servicemembers shouted three times.Bagpipers then played a tune written for the occasion called \"King Charles III.\"",
        "HONG KONG - The coronation drew a muted response in Hong Kong, a former British colony.At British-themed pubs in Hong Kong´s bustling Wanchai district, a moderate crowd gathered to watch the live broadcast of the coronation on Saturday night. Many were foreigners.\"It´s really, really good. As I say, the last time I watched it, it was in black and white,\" said Mike Davies, who sat at the Queen Victoria pub, referring to the coronation of Charles´ mother, Queen Elizabeth II, in 1953.The response to Charles is in stark contrast to just eight months ago, when people lined up in front of the British Consulate General to lay flowers and pay tribute to Elizabeth.The city, which was under British rule for more than a century, was handed back to China in 1997.LONDON - The environmental activism group Just Stop Oil says around 20 of its supporters were arrested Saturday for protesting during the coronation celebrations.The group, which demands no new licenses for any fossil fuel projects in the U.K., said that the protesters were arrested on the Mall outside Buckingham Palace and outside Downing Street.It said the activists did not carry out disruptive action, and that they were only wearing \"Just Stop Oil\" T-shirts and holding flags with the slogan.",
        "The group criticized the government for banning legitimate dissent.LONDON - Crowds weathering chilly rain waved flags and cheered as the gilded horse-drawn coach carried King Charles III and Queen Camilla back to Buckingham Palace following his coronation ceremony.The king and queen waved back from the shelter of the Gold State Coach. Mounted troops led the way as 4,000 armed service members marched through central London.Scarlet sleeves of Welsh Guards and white-gloved hands of Royal Air Force members swung in unison to a steady drumbeat.It was the largest military procession in the city since the coronation of Queen Elizabeth II in 1953.The procession passed Trafalgar Square and went under Admiralty Arch and then bordered St. James Park on its way to the palace.MILAN - Italian Premier Giorgia Meloni has extended her congratulations to King Charles III, Queen Camilla and the British people in a social media post Saturday featuring a centuries-old mosaic upon which the throne sits for the coronation ceremony inside Westminster Abbey.In a photograph, Meloni is seen examining the circular mosaic, which \"was masterfully realized by Italian artisans about eight centuries ago.\" She said it remained testimony of the \"historic and deep cooperation between Italy and the United Kingdom.\"Meloni expressed certainty that the king \"will further reinforce\" the ties.",
        "LONDON - Newly crowned King Charles III and Queen Camilla have emerged from Westminster Abbey for a grand procession returning to Buckingham Palace after his coronation.Charles was wearing the Imperial State Crown and a ermine-trimmed purple velvet robe as he paced slowly through the cavernous church to the strains of \"God Save the King.\" Church bells rang out.The king´s grandson, Prince George, second-in-line to the throne, was among the honor pages holding up the long train of his robe.Rain was falling as the king and queen exited the church but they were protected by a see-through tent that led to the Gold State Coach, a gilded carriage that has been used in every coronation since 1831.LONDON - King Charles III and Queen Camilla have taken holy communion as their coronation ceremony at Westminster Abbey nears its end.Justin Welby, the Archbishop of Canterbury, led the congregation in saying the Lord´s Prayer, and the choir sang as the royal couple were presented with bread and wine.WASHINGTON - President Joe Biden is congratulating King Charles III and Queen Camilla on their coronation.The American leader says in a tweet that \"the enduring friendship between the U.S. and the U.K. is a source of strength for both our peoples.\"First lady Jill Biden, who was representing the United States at the ceremony, says it was an honor to be at Westminster Abbey \"on this historic day.\"___LONDON - Camilla, the queen consort, has been anointed and crowned with Queen Mary´s Crown.Clergymen handed her the Queen Consort´s Scepter with Cross, and the Queen Consort´s Rod with Dove.The choir sang a new song, \"Make a joyful noise,\" composed by Andrew Lloyd Webber.LONDON - Prince William has knelt before his father, King Charles III, to pledge his loyalty to the monarch.\"I will bear unto you, as your liege man of life and limb. So help me God,\" William said.Traditionally royals and lords will also kneel before their new monarch and pay homage, but this time that´s replaced by what officials have called \"The People´s Homage\" - people watching at home who wish to do so are invited to say \"God save King Charles\" at the end, or follow the words of the liturgy.LONDON - King Charles III has been crowned in his solemn coronation service and the congregation has cheered \"God save the king.\"The Archbishop of Canterbury placed the hefty gold and jewel-studded St. Edward´s crown on the head of Charles midway through the two-hour service. The crowning is the centerpiece of the coronation and it´s the only time during his reign that Charles will wear the solid gold crown.It features a purple velvet cap, ermine band and criss-crossed arches topped by a cross. It´s set with rubies, amethysts, sapphires, garnet, topazes and tourmalines.After the ceremony, Charles will swap the 2.08-kilogram (4.6-pound) crown for the Imperial State Crown, which weighs about half as much, for the procession back to Buckingham Palace.LONDON - King Charles III is preparing for his anointment, the most sacred and intimate part of the coronation rituals.Charles and Camilla will remove their crimson Robes of State and the king will be dressed in a white linen tunic and the \"Supertunica,\" a full-length gold coat - garments that symbolize both humility and splendor, meant to reflect the two natures of Jesus Christ.He will sit in the ancient oak Coronation Chair, which has been part of every coronation since 1308. A screen has been brought into position around the chair by guardsmen.He will then be presented with items of regalia symbolizing secular and spiritual power. That includes the Orb, which represents the world under Christ, and the Sovereign´s Ring, symbolizing the marriage of a monarch to his people. Charles will wear the Coronation Glove and hold the Scepter with Cross, a symbol of earthly power, in his right hand. In his left hand, he will hold the Scepter with Dove, representing spiritual authority and mercy.The Archbishop of Canterbury, Justin Welby, will pour holy oil from an eagle-shaped ampulla, or flask, then rub it on the king´s hands, chest and head.The ceremony has roots in the biblical story of the anointing of King Solomon, and was originally designed to confirm that the sovereign was appointed directly by God.WELLINGTON, New Zealand - Monuments in New Zealand are lit purple in honor of the king´s coronation.In the town of Rangiora, north of Christchurch, people were celebrating on Saturday.\"Regardless of what you believe, what system you think we should have, our current head of state is changing and that´s worth noting,\" said the Rangiora town crier.A cake was made for the occasion and for the revelers to enjoy.The Australian War Memorial in Canberra was also lit purple on Friday night. In Sydney, a tree was planted at Government House and a smoking ceremony held to mark the occasion.LONDON - Britain´s Prime Minister Rishi Sunak has delivered a reading from the Epistle to the Colossians, from the New Testament of the Bible.Officials have said that although Sunak is a Hindu, he is reading as prime minister so there is no issue over his personal faith during the Anglican service.LONDON - King Charles III has taken the solemn oath to govern the people of the United Kingdom with \"justice and mercy\" and to foster an environment where people of all faiths and beliefs can live freely.The oath is the second of five elements of the historic coronation rite that is rooted in more than 1,000 years of tradition.Charles said he was willing to take the oath and after placing his hand on the Bible, he solemnly promised to do so. He later kissed the holy book.The service has been modified to acknowledge the change in the religious makeup of the United Kingdom.For the first time, Buddhist, Hindu, Jewish, Muslim and Sikh religious leaders are playing a part in the coronation. That reflects Charles´ vow to be \"the defender of faiths,\" as opposed to the \"defender of the faith.\"LONDON - For his coronation, King Charles III is wearing the crimson velvet Robe of State, which was worn by King George VI at his coronation in 1937. He is also wearing a crimson tunic, cream silk overshirt, and Royal Navy trousers.Camilla, the queen consort, is also wearing a crimson robe, this one originally made for Queen Elizabeth II in 1953. Underneath she is wearing a tailored dress by British designer Bruce Oldfield.Prince William is wearing the ceremonial uniform of the Welsh Guards, while his wife, Kate, is in an ivory wool crepe dress by British designer house Alexander McQueen. She is not wearing a tiara, but a silver and crystal headpiece.Their daughter, Princess Charlotte, is also wearing a dress and cape by McQueen.LONDON - Shouts of \"God save King Charles\" and trumpet blasts have echoed in Westminster Abbey as more than 2,000 guests recognized the new monarch.The medieval tradition began with the Archbishop of Canterbury presenting Charles III to the congregation as the \"undoubted king.\" He then asked them to show their support with the chant.The church erupted with the cheer and a trumpet fanfare.Three other presenters followed the archbishop, repeating the same words. Each time the chorus of voices thundered back their support.For each of the four cheers, the king turned in a different direction to represent the cardinal points of the compass.LONDON - King Charles III has entered Westminster Abbey for the coronation ceremony built on ancient traditions at a time when the monarchy faces a shaky future.The king entered through the great west door of the abbey as the choir sang Hubert Parry´s, \"I was glad,\" which was composed for the coronation of King Edward VII.He wore a long dark red robe as he slowly proceeded through the church behind his wife, Camilla, the queen consort.Prince William´s eldest son, Prince George, was one of four honor pages carrying the train of his grandfather´s robe.LONDON - Prince Harry has arrived at Westminster Abbey for his father´s coronation.The Duke of Sussex was wearing a black three-piece set of tails and military medals on his chest.His wife, Meghan, stayed behind in California with their young children.Harry, who quit his official duties with the royal family over intense scrutiny from the British media, is not playing a role in the service.The prince further alienated himself by publishing his explosive bestselling memoir, \"Spare,\" in which he spilled family secrets.LONDON - Military bands are marching down central London streets and hundreds of servicemen and servicewomen are beginning to take their positions along the procession route ahead of King Charles III´s coronation.Soldiers in distinctive red tunics and bearskin hats are lining the Mall in front of King Charles III and Camilla, the queen consort, have started their short ride in the gilded Diamond Jubilee Coach from Buckingham Palace to Westminster Abbey, where they will be anointed and crowned in a ceremony steeped in history.They are being escorted by the Sovereign´s Escort, comprising of about 160 soldiers on horseback. The Household Cavalry Mounted Band is leading the military procession.It´s a much smaller procession than the one planned for the return route from the abbey, when some 4,000 troops will feature in a spectacular display of pageantry.The state coach Charles and Camilla are travelling in was created in 2012 to commemorate Queen Elizabeth II´s 60th year on the throne. The procession will take about half an hour.LONDON - Westminster Abbey is abuzz with excitement as the final guests, including world leaders, arrive for the coronation of King Charles III.U.S. First Lady Jill Biden wore a pale blue outfit with a matching bow in her hair as she walked into the abbey. She was followed by French President Emmanuel Macron and his wife, Brigitte.Other heads of state on the guest list include Australian Prime Minister Anthony Albanese, Canadian leader Justin Trudeau and eight current and former British prime ministers.LONDON - King Charles III and Camilla, the queen consort, have arrived in a motorcade at Buckingham Palace ahead of their coronation.Loud cheers erupted among the crowds of wellwishers lining the Mall, the grand avenue leading to the palace, as the line of cars drove by. Charles and Camilla were seen waving at the crowds from within their Bentley.The couple are expected to depart from the palace in the Diamond Jubilee state coach later this morning to Westminster Abbey, where they will be crowned.Meanwhile at the abbey, many politicians and celebrities have arrived and taken their seats. Musicians have started warming up ahead of the ceremony, which is due to begin at 11 a.m. local time (1000 GMT).LONDON - The anti-monarchy group Republic says several of its members have been arrested as they prepared to protest the coronation of King Charles III.The group plans to hold placards and chant \"Not my king\" during the monarch´s procession to Westminster Abbey. It says police were informed in advance of its plans.But on Saturday morning several of the group´s members were stopped near Trafalgar Square and led to police vans.Others managed to protest along the route, dressed in yellow and waving placards with slogans including \"king parasite\" and \"abolish the monarchy.\"Police have said they will have have a \"low tolerance\" for people seeking to disrupt the day, sparking criticism that they are clamping down on free speech.LONDON - Crowds are growing outside Buckingham Palace and guests are arriving at Westminster Abbey for the coronation of King Charles III.People who camped overnight overnight for a view of the royals awoke to cloudy skies that gave way to sun and some light rain.Fans carrying flags and clad in the colors of the Union Jack were arriving by train in London hours before the ceremony that begins when Charles and Camilla, queen consort, depart from the palace in a gilded horse-drawn carriage.The royal couple will be chauffeured on the 1.3-mile (2-kilometer) route through central London to Westminster Abbey for the two-hour ceremony.The church buzzed with excitement and was abloom with fragrant flowers and colorful hats. Invited guests streaming into the abbey including recognizable celebrities such as Judi Dench, Emma Thompson, Lionel Richie and Nick Cave, and others including judges in wigs, soldiers with gleaming medals attached to red tunics and members of the House of Lords in their red robes."
    ]
}