{
    "articleURL": "/wires/pa/article-12055101/Mohamed-Salah-sights-set-records-latest-Liverpool-landmark.html",
    "content": [
        "Liverpool forward Mohamed Salah wants to keep breaking records after another landmark goal secured a 1-0 victory over Brentford.",
        "The Egypt international struck from close range in the 13th minute for his 30th of the season – the fourth time in six campaigns he has reached that mark – and his 100th goal at Anfield.He became the first Liverpool player to score in nine successive home matches and in doing so went level with Steven Gerrard in fifth place in the club’s all-time goalscoring list with 186.“It means a lot to me. I said before, I feel (at) home here, I’m happy,” he told Sky Sports.“It’s something that makes me proud, to be fair. I work really hard and everybody knows that, everybody sees that.“I’m just motivated to keep breaking records and just scoring goals and winning games for the team.”Manager Jurgen Klopp has almost run out of ways to describe the 30-year-old’s continued excellence during their time together at the club. I'm just motivated to keep breaking records and just scoring goals and winning games for the team.  Mohamed Salah  “The numbers he creates, we all know that after his career he will be seen as one of the all-time greats, that’s clear,” said the Reds boss.“But now he is still in the career and some people might not appreciate him enough, but we do.",
        "“He deserves all the praise he gets already and he will get even more after his career, that’s how it is, because in a club with the all-time greats we had in the past, being the first one who scores in nine consecutive home games is super-special.“Scoring again 30 goals this season is super-special and setting up a lot of goals as well – he is so often involved in our goals, not only with the assist or the finish, very often with the second or third-last pass as well which is as important.”A sixth successive victory – and their third in a week – moved Liverpool to within a point of fourth-placed Manchester United, who have two matches in hand.“Winning three in a row at home is absolutely special. It will not be a game the people in the stadium tell their grandchildren about but it’s a game (where) there was a lot to enjoy because the fight was exceptional,” added Klopp.“The focus level the boys showed was exceptional, the concentration top and again a lot of good signs for us, how we could look in the future.“We have to do that more consistent, we have to learn, we have to adapt, but a lot of good signs and I am really pleased with that.”",
        "Brentford head coach Thomas Frank felt his side deserved more from their display.“I think, in many ways,  we performed enough to get something from this game,” he said.“I was very happy with the performance. The goal we could have done better in the second phase on a set-piece but besides that I thought we got better and better.”"
    ]
}