{
    "articleURL": "/wires/ap/article-12047955/Nathalie-Stutzmann-contralto-conductor-debut-Met.html",
    "content": [
        "NEW YORK (AP) - While singing on the world´s great stages, Nathalie Stutzmann thought about blond lager.",
        "\"In Europe it´s very common to have the conductor getting a beer right backstage. I was so thirsty when I came offstage after a performance, I was always dreaming: It would be nice to be a conductor and get them,\" she said with a laugh.Minutes after a successful New York Philharmonic podium debut in February, Stutzmann had a beer in hand even before reaching her dressing room.\"That´s the best beer ever, the one you get as a conductor right after the performance,\" she said.Stutzmann gave up a quarter-century career as a contralto to become a conductor. She took over as music director of the Atlanta Symphony Orchestra last fall and makes her Metropolitan Opera debut in a new production of Mozart´s \"Don Giovanni\" on Friday night, a day before her 58th birthday. On July 28 she becomes only the second woman to conduct at the Richard Wagner Festival in Bayreuth, Germany.\"She deals personally with familiar texts as a great singer would, but can transfer it to a large group of musicians,\" said conductor Simon Rattle, one of Stutzmann´s mentors. \"Nathalie is such a complete musician that our conversation is more to do with the psychology of dealing with orchestras, how to ask for more without discouraging. For me her expected strength is breathing, phrasing naturally and instinctively finding musical solutions. Unexpected: How deeply she can rethink so-called standard repertoire and make it sound new without exaggeration or point-making.\"",
        "A daughter of musical parents, soprano Christiane Stutzmann and bass Christian Dupuy, Nathalie learned piano when she was young, then cello and bassoon. She studied at the Paris Opéra´s Ecole d´Art Lyrique and sang her first concert at Paris´ Salle Pleyel in 1985.\"I tried to enter the conductor class when I was a teenager,\" she recalled during an interview between Met rehearsals. \"It was not forbidden for a girl, but the teacher was very misogynistic, so I was never able to conduct the orchestra.\"She won first prize at the Bertelsmann Foundation´s Neue Stimmen (New Voices Competition)\" in 1987, made her U.S. singing debut in 1995 at a recital at Lincoln Center´s Walter Reade Theater and her Carnegie Hall debut two years later in a Mahler Second Symphony with the Philadelphia Orchestra and Rattle. She sang at Carnegie in 1988 with the Boston Symphony Orchestra and Seiji Ozawa, who also became a mentor and provided a technical foundation.\"Because I started to sing so young, I achieved almost all my dreams as a singer,\" Stutzmann said, \"I pushed the limits of this contralto voice to the maximum. I explored the maximum of repertoire.\"She began to think about switching to conducting in the early 2000s, after perceived attitude changes.\"You can´t really fight all the time against the mentality of the society,\" Stutzmann said. \"People were starting to speak more about of what is equality, why a woman couldn´t do this and that. So, I thought, maybe it´s time for me to try. And also I wanted to give a try when I was still at the top of my vocal career to avoid that anyone could say: `She started conducting because she has no more voice.´\"",
        "Stutzmann approached Jorma Panula, a Finnish conductor and teacher who is now 92.\"All he says is about two words a day maximum,\" she explained. \"But those words are very important. He never shows you how to conduct. So, first of all, if he takes you, he thinks you have a natural talent. He takes only instinctive natural conductor. He films you conducting an orchestra. And then you sit with him, and he criticizes - lots of `That´s bad.'\"Stutzmann founded the chamber orchestra Orfeo 55 in 2009 and led it during its decade-long existence. She became principal guest conductor of the RTÉ National Symphony Orchestra in Dublin, Ireland, in September 2017 and chief conductor of Norway´s Kristiansand Symphony Orchestra the following year.She was hired as principal guest conductor of the Philadelphia Orchestra in 2021 and last fall succeeded Robert Spano as music director in Atlanta, becoming only the second woman to head a major American orchestra, after Marin Alsop with the Baltimore Symphony Orchestra from 2007-21.Stutzmann also is to conduct Mozart´s \"Die Zauberflöte (The Magic Flute)\" at the Met starting May 19.\"Nathalie brings particular attention to the quirks and idiosyncrasies of Mozart in a natural manner. It´s effervescent and light, but not dainty or stuffy,\" Met concertmaster Benjamin Bowman said. \"She thrives on extremes, and her attitude toward the music seems to be anything but lukewarm. She conducts with sensitivity and yet is quite demanding of the singers, in ways that perhaps only a singer could be!\"",
        "The Met believes Stutzmann will become the first conductor to lead two new productions in a debut season since Rafael Kubelík in 1973-74.\"She can demonstrate how she wants a line to be sung. She can actually show us the feeling and the phrasing,\" said soprano Erin Morley, Stutzmann´s Pamina. \"It´s, first of all, just a delight to hear her sing sometimes in rehearsal, but it´s also informative. I get a direct feeling of what she wants.\"Stutzmann still sings - in the shower, and while rehearsing.\"I know my voice is perfectly in good shape,\" she said. \"I thought she was going to decline, but she doesn´t. So it´s a little bit challenging because sometimes I feel like, ah, I would love to sing this instead of explaining about the music.\""
    ]
}