{
    "articleURL": "/news/article-12047169/Trump-Im-going-fly-Ireland-CONFRONT-E-Jean-Carroll.html",
    "content": [
        "Trump spoke to reporters while playing at his golf course in Ireland He called the E. Jean Carroll trial a 'disgrace' and hinted he could still attend His lawyer has already said the defense will call no witnesses Donald Trump has warned he will fly to New York to 'confront' E. Jean Carroll's charges as her rape and defamation case against him draws to a close.",
        "The former president tore into her 'false' accusations that he raped her in a Bergdorf Goodman hotel room in 1996 while taking questions at his golf course in Ireland.He also called her a 'disgrace', less than 24 hours after the court was played the infamous Access Hollywood case and a former People magazine journalist testified that Trump allegedly kissed and pushed her against a wall in Mar-a-Lago.A furious Trump also called Judge Lewis Kaplan 'extremely hostile' and insisted the trial was a political attack on a candidate 'leading the polls by 40 points'.During his round at his Trump International Golf Links &amp; Hotel in Doonbeg, County Clare, he also called President Biden 'incompetent' and criticized his golf game.",
        "He told reporters on Thursday: 'I have to leave Ireland and I have to leave Scotland where I have great properties. I have to leave early. I don't have to, but I choose to.'Then he was asked if he will attend Carroll's trial.'I probably will and i think it's a disgrace,' he said. 'It's a disgrace that it's allowed to happen against a rich guy or in my case, against a famous, rich and political person that's leading the polls by 40 points. 'And I have to go back for a woman that made a false accusation about me, and I have a judge who is extremely hostile and I'm going to go back and I'm going to confront this. ",
        "'But this woman is a disgrace and it shouldn't be allowed to happen in our country.'His lawyer Joe Tacopina however cast doubt on Trump appearing at the court proceedings.He simply said 'no' when asked to confirm Trump's travel plans.Tacopina had also previously told the court that the defense would not bring any witnesses – shutting down the possibility that Trump would appear on the stand to refute Carroll's allegations. Trump's comments about flying back for the trial, which could go to a jury next week, comes after proceedings where Tacopina's cross-examination of Carroll has been getting mixed reviews.He pressed her on why she didn't scream during the alleged attach, and appeared to be caught off guard when the judge told him a suggestion by Carroll in her book to ship all men in the country to Montana for retraining was along the lines of Jonathan Swift's 'A Modest Proposal.' Tacopina used it as evidence of the court's bias in his motion to seek a mistrial, but the judge ruled against him. Tacopina 'violated most of the rules of good cross-examination – tightly focus on just a few key issues, ask only questions to which you know the answer, don't let the witness simply repeat the compelling parts of her own testimony, and, most importantly, don't re-victimize the victim,' former U.S. Attorney Barb McQuade, now at the University of Michigan Law School, told Salon. 'Still, as they say, even a blind squirrel sometimes finds an acorn. If any jurors bite on his boorish line of questioning, he may have succeeded in casting doubt on Carroll's story.' ",
        "Trump's visit to Scotland and Ireland has coincided with the second week of the trial in Manhattan over accusations, denied by Trump, that he raped Carroll in the department store dressing room.",
        "Last night, Trump had expressed confidence in his position in his Manhattan rape trial while touring his golf property. He said he skipped the court date for his 'long-standing commitment' to visit Ireland.But less than 24 hours later, he changed his tune.  Earlier on, the former president attempted to deal a series of blows to Biden as he spoke to reporters on the golf course where a standard membership costs $3,100 per year with a $1,250 joining fee.'You think Biden can do that? I don't think so,' he joked after teeing off and driving away in a buggy which said 'President Trump' on the front of it. Trump, wearing his famed red Make America Great Again cap, added: 'Biden doesn't hit a 280 right down the middle, does he? Biden can't hit an 80 down the middle.'Asked if he was confident that he could defeat Biden in the next US election, he said: 'I could win it three times.'"
    ]
}