{
    "articleURL": "/tvshowbiz/article-12055493/Abbey-Clancy-reveals-trick-frisky-husband-Peter-Crouch-bay.html",
    "content": [
        "Abbey Clancy has told how she ties her dressing gown at the back while drying her hair in a bid to stop her husband Peter Crouch trying to get frisky.",
        "The model, 37, said she previously used to blow-dry her hair in the nude because she found the hot air from the machine too hot.However, her sportsman husband Peter, 42, tried to get amorous, prompting her to bar him from the bedroom while she ties her dressing gown in a way that is too confusing for the former footballer to undo in a hurry.She explained on their The Therapy Crouch podcast: 'It drives me insane.'I've come up with a new tactic with the dressing gown. Instead of tying the belt at the front, I tie it at the back.",
        "'It's like 'how do I untie this thing?'. It works a treat.'When Peter asked her why she did not want him admiring her, she told him: 'I do. Any other time is fine, but not when I'm getting ready.'But it's nice to know that you're still desirable to your husband after 16 years.'It comes after it emerged Abbey is launching a solo TV career after signing a deal with ITV.She is set to front an interior design series for the broadcaster and the she's going to start filming in the summer.An insider told The Sun newspaper: 'Abbey has been making waves on her podcast with Peter and now she's forging a solo path on the box.'",
        "Abbey is said to be 'hugely passionate' about the project and is looking forward to getting involved.The source added: 'Abbey is hugely passionate about interiors so she is so happy to have been asked to take part.",
        "'She has had a few hosting stints before but on lesser-known shows and channels - like when she fronted Britain's Next Top Model on Lifetime for one series in 2015.'Meanwhile, her husband Peter previously revealed he was offered the lead role in a new sitcom playing himself.In his book How To Be An Ex-Footballer, he said: 'I liked it. A fake documentary, elements of both The Office and Steve Coogan and Rob Brydon's The Trip. The scripts were excellent, written by James Kayler and Steve Lawrence who I'd worked with on Sport Relief.'One mooted episode was called 'Eat, Pray, Love', and involved me going on a spa trip, only to accidentally join a cult. The final line in the blurb will stay with me for quite a long time, 'Can Crouchie escape before he's killed?''"
    ]
}