{
    "articleURL": "/wires/ap/article-12055375/In-shadow-7-horse-deaths-party-goes-Derby.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - As the horses were loaded into the starting gate, Tedi Dietrich whispered a prayer.",
        "\"Lord, let the horses get all the way around safe,\" Dietrich said, watching the race Saturday on a giant screen erected amid the party in Churchill Downs´ courtyard.News had just broken that a sixth horse had died in the days and hours leading into the Derby. A seventh horse died later in the day.But here, in every direction, Derby-goers in fancy dresses and seersucker suits posed for selfies, fluffed the feathers in their hats and sipped mint juleps. It was a jarring contrast to reports of yet another horse being loaded into an equine ambulance in the stable area, just on the opposite side of the racetrack.All Dietrich could think to do was say a prayer before each race that day, and then keep enjoying the famous festivities.\"People come for the party, for the experience,\" Dietrich said. \"Look around, look at all this enthusiasm. I think a lot of people aren´t following the news so closely. What they´re following closely is their hats, and their suits.\"",
        "Tickets to Derby are now all-inclusive, so drink peddlers handed out booze for free: \"You already paid for it with your tickets, you might as well take one,\" they called, and people obliged. Some dressed like horses; some dressed like jockeys. Lines formed at the betting windows and hot dog vendors. Women navigated packed crowds with feathers in 2-foot circles around their heads, some carrying their high heels after they gave up and switched to flip-flops.",
        "A country band played on a stage, next to a giant silent screen of the horse racing inside the track, just on the other side of the grandstand. For many at Churchill, the sport itself fades into the background of the pomp and pageantry of Derby Day.\"I come for the environment, I come to meet people from everywhere, to see the hats, to see everyone dressed up, from all walks of life,\" said Garey Faulkner, from Cincinnati.Faulkner was a popular presence at Churchill Downs on Saturday, wearing a top hat that stretched two feet atop his head, adorned with a horse sculpture with a rose in its mouth and a trumpet on its head. He had dyed his waist-length beard red for the occasion, and wore a golden suit jacket.It was his 40th birthday. People in the crowd pick out the most boisterous outfits for photos, and a lined was forming with revelers wanting a picture with him. He was ecstatic, he said, and hadn´t heard of the dead horses.Even on the backside, it seemed like any other race day: Workers tended to horses who let out the occasional neigh.Sweet smoke wafted from barbecue grills, and bottles of bourbon stood on picnic tables in a grassy area just off the second turn. Lawn chairs were packed in, and the feel was more like a company picnic - only backside workers and their friends and families were allowed. No tickets for this gathering. You had to know somebody.",
        "\"Everybody is just excited,\" Rick \"Uncle\" Smiley said as he waded through a mix of the well-dressed and casually dressed.But in the grandstand, news rippled quietly through the crowd, and many pondered they mystery of what was happening.\"It´s just weird, you feel like something must be going on,\" said Jennifer McClinton, who lives in Louisville.But McClinton said she wasn´t letting it damper her day, the first time she´s gone to the track in 25 years. She had her hat, a giant rose that stood a foot off her head, made special to match her dress.\"It´s a fantastic time, there´s so many people to watch, so many sights to see,\" she said. \"But it´s terrible news about the horses, and you have to wonder what´s behind it.\"Curtis Pavlik, from Kentucky, wears a jockey costume to the Derby every year, he said, because this day is supposed to be fun and he wants to do his part to make it that way. Pavlik worries about horse racing´s struggles and declining popularity, so he and his friends wear their costumes and try to make people laugh, and maybe invest in the sport again. This bad news hanging over the sport´s most celebrated day feels like yet another blow.Tonia Colston and Marissa Renty watched a mid-day race Saturday with a bit of trepidation. They stood in line in the racetrack´s courtyard waiting to have their picture taken in front of a life-sized mural of Secretariat, the horse that won the Triple Crown 50 years ago.",
        "It was both of their first times at the Derby. Neither are avid horseracing fans, and they both came to Kentucky for the glamour and history of the Derby. Renty, from Oklahoma, said she was shocked at what a spectacle the party really is.As they waited in line, they exchanged news about the dead horses. It felt like a bit of a shadow over the day, they said.\"What´s going on?\" wondered Colston, from Virginia. \"What actually happened? What´s the truth behind this story?\"Another race was about to begin the giant screen in the courtyard, and the women said they were a little nervous to watch it.\"That is the last thing I want to see today,\" Renty said. \"I do not want to see anything bad happen to those creatures or their riders.\"___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}