{
    "articleURL": "/wires/ap/article-12045505/Ukraines-Zelenskyy-expected-visit-Intl-Criminal-Court.html",
    "content": [
        "THE HAGUE, Netherlands (AP) - Ukraine and Russia pressed their wartime rhetoric Thursday, with Ukrainian President Volodymyr Zelenskyy expressing confidence that Vladimir Putin would be convicted of war crimes, and the Kremlin alleging that the U.S. was behind what it called an assassination attempt against the Russian president.",
        "The countries' leaders have personally attacked each other multiple times during the war that Russia started by invading Ukraine in February 2022. The latest flare-up came Wednesday, with Russia's claim that Ukraine had attacked the Kremlin in Moscow with drones meant to assassinate Putin.Zelenskyy denied that Ukrainian forces were responsible for the purported drone attack. The Kremlin promised unspecified retaliation for what it termed a \"terrorist\" act, and pro-Kremlin figures called for the assassinations of senior Ukraine leaders.Uncertainty still surrounds exactly what happened in the purported attack.Putin´s spokesman on Thursday accused the United States of involvement. To generate domestic support for the war, Moscow has often tried to blame Washington for trying to destroy Russia through its help for Ukraine.Kremlin spokesman Dmitry Peskov told reporters during a daily conference call that the Kremlin was \"well aware that the decision on such actions and terrorist attacks is not made in Kyiv, but in Washington.\"",
        "\"And then Kyiv does what it´s told to do,\" Peskov said, without offering evidence for his claim.John Kirby, a spokesman for the U.S. National Security Council at the White House, described the claim as \"ludicrous.\" Zelenskyy, in the Netherlands, said he was \"not interested\" in the Kremlin´s opinion.U.S intelligence officials are still trying to determine who was behind the drone incident and are exploring various possibilities, including a false flag operation by Russia or that a fringe group with sympathies for Ukraine could have been involved, according to a U.S. official.",
        "But the official, who spoke Thursday on the condition of anonymity to discuss the sensitive matter, said intelligence officials don´t yet have any definitive answers. The official added that the Biden administration \"certainly would not support the strike against Mr. Putin.\"Zelenskyy´s top adviser, Mykhailo Podolyak, claimed Thursday that Russia had \"staged\" the alleged drone attack. He cited the delay in Russian state media reporting it and \"simultaneous video from different angles\" that appeared to show the aftermath of the alleged 2:30 a.m. attack.The Washington-based Institute for the Study of War also saw evidence of staging.\"Russia likely staged this attack in an attempt to bring the war home to a Russian domestic audience and set conditions for a wider societal mobilization,\" the think tank said.Given recent Russian moves to bolster security, it´s \"extremely unlikely that two drones could have penetrated multiple layers of air defense and detonated or been shot down just over the heart of the Kremlin in a way that provided spectacular imagery caught nicely on camera,\" the ISW stated.In The Hague, where the International Criminal Court is based, Zelenskyy urged the global community to hold Putin accountable and told the war crimes court's judges that Russia's leader \"deserves to be sentenced for (his) criminal actions right here in the capital of the international law.\"",
        "In March, the ICC issued an arrest warrant for Putin for war crimes, accusing him of personal responsibility for the abductions of children from Ukraine. It was the first time the global court circulated a warrant for a leader of one of the five permanent U.N. Security Council members.Zelenskyy´s visit to the Netherlands came a day after he went to Finland, which doubled the size of NATO´s border with Russia when it joined the military alliance last month, largely out of its concerns about Moscow´s long-term ambitions.The Ukrainian president also used his trip to press the prime ministers of Belgium and the Netherlands to send advanced warplanes so his country can achieve \"justice on the battlefield.\" Zelenskyy has successfully assembled significant Western military and political support for Ukraine's defense since the war began.Zelenskyy traveled in a Dutch-supplied plane and an armored car, with security kept tight at his appearances. Next week, he is expected to go to Berlin, the capital of European Union economic powerhouse Germany, in the latest display of the Western might marshaled against Putin.Zelenskyy's trips have paid dividends. After traveling to Washington last December and then London, Paris and Brussels in February, Ukraine received heavy artillery and tanks.But the chances of Putin standing trial in The Hague are remote. The court, which puts individuals on trial for genocide, war crimes, crimes against humanity and aggression, doesn't have a police force to execute its warrants. The Russian leader is unlikely to travel to any of the ICC´s 123 member nations, which are under obligation to arrest him, if they can.",
        "On the battlefield, Ukraine´s military said that three Russian drones that hit the southern city of Odesa early Thursday had \"for Moscow\" and \"for the Kremlin\" written on them, seemingly implying they were sent in retaliation for the reported strike on the Kremlin.Ukraine´s capital, Kyiv, was the target of an air attack Thursday morning, for the third time in four days, but defense systems intercepted all drones and missiles. On Thursday night, air raid sirens sounded again. After the all-clear was given, Ukraine´s military said it had taken down one of its own drones that had \"lost control\" over the capital, but at least one other drone was reportedly shot down in another area of the city and it was not clear whether it was Russian or also Ukrainian.People sheltered in underground tunnels beneath Kyiv´s Maidan Square as air raid sirens wailed. Two defensive missiles streaked across the evening sky, and a loud explosion was heard. No casualties were immediately reported.In Russia, drones hit two oil facilities in southern regions of the country near Ukraine in what appeared to be a series of attacks on fuel depots behind enemy lines, Russian media reported Thursday.Four drones struck an oil refinery in the Krasnodar region, which borders the Russia-annexed Crimean Peninsula, Russian state news agency RIA Novosti reported, citing law enforcement sources. Another facility was reportedly hit in the Rostov region.",
        "The Netherlands has been a strong supporter of the Ukrainian war effort. Prime Minister Mark Rutte´s government has promised 14 modern Leopard 2 tanks it is buying together with Denmark. They are expected to be delivered next year.The Netherlands also joined forces with Germany and Denmark to buy at least 100 older Leopard 1 tanks for Ukraine.In addition, the Dutch government sent two Patriot air defense missile systems, promised two naval minehunter ships and sent military forensic experts to Ukraine to assist with war crime investigations.___Aamer Madhani reported from Washington.___Follow AP´s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
    ]
}