{
    "articleURL": "/tvshowbiz/article-12055765/Cabaret-star-Joel-Grey-91-flashes-smile-stroll-NYC.html",
    "content": [
        "Famed Cabaret actor Joel Gray headed out on a stroll along the bustling streets of New York City on Friday.",
        "The star (born Joel David Katz) was all smiles as he made his way along the bustling streets of Manhattan's West Village neighborhood, and was helped by two male friends who walked arm-in-arm with him.Now 91, the Oscar, Tony and Golden Globe Award winner enjoyed the outdoors on a day that saw the temperatures hovering between the mid-50s Fahrenheit and low 70s.He appeared to struggle at times, but the two male pals made sure he didn't take a tumble. Flashing his infectious grin, the actor, singer, dancer, photographer and theatre director, stepped out dressed in a long military-style jacket with gray sweatpants and matching sneakers.",
        "Grey started his career, at age 10, in the Cleveland Play House's Curtain Pullers children's theatre program in the early 1940s, appearing in productions such as Grandmother Slyboots, Jack of Tarts and a lead role in their mainstage production of On Borrowed Time.And by 1952, he was appearing as a featured performer at the famed Copacabana nightclub in New York City, at the ripe young age of 20.In a breakout role, Gray played the the Master of Ceremonies in the musical Cabaret on Broadway, in 1966, for which he won Tony Award. Gray would go on play the role again in the 1972 film adaptation that was directed by Bob Fosse from a screenplay from Jay Presson Allen, which earned him an Academy Award for Best Supporting Actor in March 1973.",
        "His Oscar victory was part of a Cabaret near-sweep, which saw Liza Minnelli win Best Actress and Fosse take home Best Director, although it lost out on the Best Picture award to The Godfather. A stage actor at heart, Gray's Broadway credits include Come Blow Your Horn (1961), Stop the World – I Want to Get Off (1962), Half a Sixpence (1965), George M! (1968), Goodtime Charley ( (1975), The Grand Tour (1979), Chicago (1996), Wicked (2003) and Anything Goes ( (2011).Showing his range when it came to entertaining, the Cleveland native appeared as a panelist for the television game show What's My Line? (1967), as well as being the first Mystery Guest during its syndication in 1968.He also had a slew of guest starring roles throughout his nearly eight decades in television, which was culminated with an Outstanding Guest Actor In A Comedy Series Emmy nomination for his recurring role as Jacob Prossman on the series Brooklyn Bridge (1992-1993).",
        "As for is personal life, Gary married actress and singer Jo Wilder back in 1958, but the union would end up in divorce in 1982, but not before they welcomed their daughter Jennifer Gray, who's best known for her role in Dirty Dancing, and a son James Gray, who's a chef. But after a 24 year marriage and two children, Gray ended up coming out publicly as a gay man in 2015 at the age of 82.",
        "In an interview with People he called the time he was married to the actress the 'happiest of my life' and maintained he was not living a double life but was 'crazy in love' in love with a woman. While slowly coming to terms with that 'other part of who I am', he revealed all the people close to him had already known about his sexuality for many years.His daughter, Jennifer, would later reveal how she found out back in the late 1980s, during a conversation with her then-boyfriend Matthew Broderick's mother, Patricia Broderick.",
        "Choosing to use a homophobic slur to ask whether Grey knew her father was gay, she claims Patricia, a playwright, blurted out: 'You know your dad's a f*g.' 'All I know, all I knew at the time was that it felt like it was a sniper attack. The idea was that I was a fool and that everyone knew but me,' she told People in April 2022, while promoting her memoir Out Of The Corner.'Perhaps she was offended by my lack of knowing,'she said of her motivation. 'I don't know what she was thinking. She was, um, she was a tricky personality. I don't know how else to put it. Like, she was a truth teller, truth bombs. A Cassandra. She was, like, come what may.' ",
        "Despite his advanced age, Gray has worked all through the years, with his most recent credits being a role in the FX drama thriller The Old Man (2022), which stars Jeff Bridges in the lead, and the biographical musical film Tick, Tick... Boom! (2021)."
    ]
}