{
    "articleURL": "/news/article-12043571/Queens-godson-lives-real-life-Downton-Abbey-reveals-ISNT-invited-Coronation.html",
    "content": [
        "First time in history an Earl of Carnarvon not invited to crowning of a monarchLord Carnarvon sat behind Charles at Queen's committal service after funeralGuest list has been cut from 8,000 invited for Queen’s coronation to just 2,000Lord and Lady Carnarvon have not decided where they will be on Coronation day – either at their magnificent Highclere Castle estate or with their family in London.",
        "What seems certain, though, is that – along with some of the grandest families in the land – they will not be at Westminster Abbey to watch Charles crowned King.‘No one’s sent me an email or [made] a phone call saying, “You’re not coming.” We just haven’t received anything,’ says George Herbert, the 8th Earl.Seven months ago, he and his wife Fiona were part of a select group at the Queen’s committal service in St George’s Chapel, Windsor, which followed the state funeral at the Abbey.It was there that the Royal Family and their closest friends said their final goodbyes to Her Majesty. Lord Carnarvon, who was the Queen’s godson, was seated directly behind Charles.",
        "‘You can’t always be part of everything,’ he says today with the sort of diplomacy that helped his Herbert ancestors survive political back-stabbings right back to the War of the Roses.‘We were honoured to be part of the late Queen Elizabeth’s funeral at St George’s Chapel. It was the people who had connection with the family as friends or people who’d worked on the [royal] estates. It was an extraordinary day, but very, very sad. The end of a great era.’This will be the first time in history an Earl of Carnarvon has not been invited to the crowning of a British monarch.",
        "The King wants his coronation to be a modern, inclusive, diverse affair, reflecting today’s Britain.‘Meritocratic not aristocratic,’ we’re told – or, depending upon where you stand, Charles is giving in to what financier Ben Goldsmith called the ‘drips and dullards’ of woke as he tries to fashion a right-on realm.So, out goes the coronation chicken, in comes the coronation quiche, with a ceremony shaved of excess and ermine as hereditary peers are told to tone down the ceremonial dress. That’s if they’re lucky enough to be going at all.The guest list has been cut from the 8,000 crammed into Westminster Abbey for the Queen’s coronation to just 2,000, which means many of the families who have pledged allegiance to the Crown for generations will have to watch it on the telly.Those not invited include the Duke of Rutland, whose grandfather John, the 9th Duke, carried the orb in the procession into Westminster Abbey at George VI’s coronation; the Duke of Somerset, whose title was created in 1547 and is the second oldest dukedom in the country; and the late Earl of Mountbatten’s daughter Lady Pamela Hicks, who was bridesmaid to the Queen and attended both her and her father George VI’s coronations.",
        "‘Everyone would love to be going to a glorious state occasion,’ says Lord Carnarvon. His grandfather, the 6th Earl, was one of goodness knows how many hereditary peers and peeresses decked out in their crimson cloaks and coronets at the Queen’s coronation.",
        "‘My grandfather did like putting on the ermine and all the gear from time to time. He was a theatrical type of person, but times have changed since my grandfather’s – and my father’s – time.’The 7th Earl, a larger-than-life character, was the Queen’s racing manager and one of her dearest friends whom she affectionately called Porchey. The closeness between the two families is vividly apparent in the intimate family photo albums Lord Carnarvon, 65, shared with the Mail when he, like many of us, was ‘flooded with emotion’ following Her Majesty’s death.The snaps include a grinning Charles as a boy larking around at Balmoral, where Lord Carnarvon, whom the Queen fondly called Geordie, and his family would join the Royal Family on holiday.Another was taken at Highclere Castle, familiar to millions as the setting for ITVs Downton Abbey, and shows the future king as a very young child happy in the 7th Earl’s arms.The two families – one noble, one royal – shared many days of ‘great gaiety, great enjoyment’ while ‘off parade’, as Lord Carnarvon puts it.So much so, Lord Carnarvon’s earliest childhood memory is being brought down as a small boy in short trousers to see the Queen.A self-effacing, deep-thinking man, Lord Carnarvon is sitting with me in the wood-panelled racing room at Highclere, an estate where the sport of kings has coursed through the blood for several generations, sharing his thoughts on the new Carolean era.",
        "He has no doubt that Charles III will be ‘an absolutely excellent’ King.‘I believe he will be modern, thinking about new ways forward. I only have very nice memories of him from when I was lucky enough to visit Sandringham and Balmoral with my father,’ he says.‘The then Prince Charles would be part of the shooting party or going out on a picnic on the moors.’With the mention of picnics, we segue into the merits of the rather cheerless Coronation quiche – broad beans, spinach, cheese.‘Lots and lots of cheese,’ says Lady Carnarvon, who is a brilliant cook and, like many of us, a huge fan of Coronation chicken. Times, we agree, have changed.‘I wasn’t expecting it [an invitation] necessarily,’ says Lord Carnarvon. ‘My father was a very close friend of the Queen and connected with horses and all the rest of it, but times change. Things move on.’Aristocratic families such as his seem to be under attack left, right and centre since the late Queen’s death.First, her elderly lady-in-waiting of more than 60 years and Prince William’s godmother, Lady Susan Hussey, was accused of racism for asking British charity boss Ngozi Fulani where she was really from. Lady Susan has since apologised.",
        "‘I don’t think she would have meant anything quite as much as was immediately suggested (by Ms Fulani on Twitter),’ says Lord Carnarvon.",
        "Now it’s slavery, or rather demands for those born into privilege with links to the slave trade to wipe out the sins of their ancestors by writing a cheque. Earlier this month, Charles signalled his support for research into the monarchy’s connections to slavery.‘Well, the family [the Carnarvons] were not involved in owning property in the Caribbean so we haven’t had a difficulty from that, have we?’ asks Lord Carnarvon, turning to his wife. They exchange a look that suggests they’ve discussed this privately with their chums more than a few times. Oh, to be a Van Dyke in the dining room.‘The thing is that over the centuries every generation has done something which you could criticise the previous generation for,’ says Lady Carnarvon. ‘Whether you look back to the Romans, the Greeks, the medieval times, every generation of humankind has been unkind, which is so sad, but it’s then trying to learn from the experience, isn’t it? Not to do it again.’Long gone are the days of Downton Abbey when these old families rang a bell on a whim and the servants jumped. The Carnarvons are up at the crack of dawn and often work long past suppertime. You have to when you have 1,000 acres of parkland, and a further 4,500 of farmland, downland and woodland that are open to the public to stay on top of.",
        "Not that they mind. Lord and Lady C are dedicated to Highclere. They are, they say, simply the stewards of this spectacular place. When the 7th Earl died in 2001, they set their minds as to how the estate could survive.‘Whereas the estate used to support Geordie’s family, we are working to support the estate,’ says Lady Carnarvon. ‘We knew we needed to find a way of making people love it. It’s an emotional thing. It’s from the heart.’As if on cue, an American visitor singles out Lady C as we walk in the grounds of Highclere with the dogs. ‘Pennsylvania sends its love,’ she calls out. ‘Send our love to Pennsylvania,’ Lady C calls back. Phones are produced. Selfies and videos taken.",
        "Downton Abbey has made Highclere Castle famous throughout the world. Almost a fifth of the 1,200-a-day visitors are from the States. There are also Australians, French and Germans here, or at least those are the accents I hear in our 15-minute stroll.The estate represents the history and tradition that stands this country apart from so many others. Nationalities from all over the globe love being here.‘There’s a visible history here of what our values and cultures have been for centuries,’ says Lady C. ‘You can see it and begin to grasp it, understand it and reflect upon it – which is quite hard to do nowadays.‘This Coronation is a big change but, having said that, it is a changed world. Geordie and I always have to be optimistic and not look negatively at decisions other people have made – just wish them the best.’Lord C shoots his wife a fond look. ‘We’re all on the same side in terms of long-term stewardship and preservation. That’s the strong bond between the older families and, therefore, we are loyal to and support the King,’ he adds.Lord Carnarvon doesn’t say the King might show some loyalty back, but let’s just say I suspect he’ll be digging into Coronation chicken rather than quiche on Saturday, wherever he and his lovely wife might be."
    ]
}