{
    "articleURL": "/wires/reuters/article-12038289/US-job-openings-drop-layoffs-hit-highest-level-two-years.html",
    "content": [
        "Job openings drop 384,000 in March; February revised up",
        "Layoffs and discharges increase 248,000 to 1.8 millionDecline in job openings concentrated in small businessesBy Lucia MutikaniWASHINGTON, May 2 (Reuters) - U.S. job openings fell for a third straight month in March and layoffs increased to the highest level in more than two years, suggesting some softening in the labor market that could aid the Federal Reserve's fight against inflation.Still, the labor market remains tight, with the monthly Job Openings and Labor Turnover Survey, or JOLTS report, from the Labor Department on Tuesday showing 1.6 vacancies for every unemployed person in March. That was the lowest reading since October 2021 and compared to 1.7 in February.Fed officials, who started a two-day policy meeting on Tuesday, are closely watching this ratio, which remains above the 1.0-1.2 range that economists say is consistent with a jobs market that is not generating too much inflation.The U.S. central bank is expected to raise its benchmark overnight interest rate by another 25 basis points to the 5.00%-5.25% range on Wednesday before potentially pausing its fastest monetary policy tightening campaign since the 1980s.\"The decline in the ratio of job vacancies to unemployment in the last three months represents a reduction in the excess demand for labor that will be welcomed by the Fed,\" said Conrad DeQuadros, senior economic advisor at Brean Capital in New York.",
        "\"However, with the ratio still higher than at any time prior to November 2021, the labor market is still tight by historical standards.\"Job openings, a measure of labor demand, were down 384,000 to 9.59 million on the last day of March, the lowest level since April 2021. Data for February was revised higher to show 9.97 million job openings instead of the previously reported 9.93 million. Economists polled by Reuters had forecast 9.775 million job openings. They have dropped by 1.6 million since December.The decline in March was concentrated in small businesses, those with one to 49 employees, the main drivers of the labor market's phenomenal growth. There were 144,000 fewer vacancies in the transportation, warehousing and utilities industry.Professional and businesses services job openings declined by 135,000. Retailers reported a drop of 84,000 in vacancies. There were notable decreases in healthcare and social assistance, but educational services reported an additional 28,000 job openings. There were 34,000 government job openings.Vacancies fell in all four regions, with steep declines in the Midwest and West. The job openings rate fell to 5.8%, the lowest since March 2021, from 6.0% in February.Stocks on Wall Street were trading lower as investors focused on a warning by Treasury Secretary Janet Yellen that the federal government could run out of money within a month amid a standoff to raise its $31.4 trillion borrowing cap. The dollar fell against a basket of currencies. U.S. Treasury prices rose.",
        "DEMAND SLOWINGHiring was little changed at 6.1 million, keeping the hiring rate unchanged at 4.0%. Economists expected slowing demand for labor to be replicated in April's employment report, scheduled to be published on Friday.Nonfarm payrolls are expected to have increased by 179,000 jobs last month, the smallest gain since December 2020, after rising 236,000 in March, according to a Reuters survey of economists.The JOLTS report showed layoffs jumped by 248,000 to 1.8 million, the highest level since December 2020. The increase was led by the construction industry, which shed 112,000 positions. The decline likely reflected the job losses in the housing market, which has been hammered by higher mortgage rates.Accommodation and food services lost 63,000 jobs, while the health care and social assistance category reported 42,000 layoffs. Employment in the leisure and hospitality sector remains below it's pre-pandemic levels.Professional and business services layoffs increased by 49,000. Small and medium-sized businesses accounted for the bulk of the layoffs. All four regions reported rises in job losses.The layoffs and discharge rate rose to 1.2%, the highest since December 2020, from 1.0% in February.With job openings steadily declining and layoffs rising, fewer people are voluntarily quitting their jobs. Resignations dropped to 3.85 million, the lowest level since May 2021, from 3.98 million in February.",
        "Quits declined in the accommodation and food services sector. They dropped in the South and West, but rose in the Northeast and Midwest.The quits rates, which is viewed as a measure of labor market confidence, dipped to 2.5% from 2.6% in February. It is down from the 2.9%-3.0% range seen in late 2021 and early 2022 when job hopping was at its peak.\"The job openings and quits rates remain historically high, and the layoff rate remains historically low, but all three are moving in the direction of a cooler labor market,\" said Michael Feroli, chief U.S. economist at JPMorgan in New York.\"The signs of labor market softness won't be a game-changer for tomorrow's Fed meeting, though they do suggest that the cumulative amount of policy tightening is starting to have its desired effect on businesses' labor demand.\" (Reporting by Lucia Mutikani; Editing by Andrea Ricci and Paul Simao)"
    ]
}