{
    "articleURL": "/femail/article-12050335/Whos-foreign-royals-attending-Coronation-Monarchs-world-honour-King-Charles.html",
    "content": [
        "King broke from 900-year tradition banning crowned royals from coronationREAD MORE: Kate and William meet TikTok royalty! Prince and Princess of Wales film hilarious video with trainspotting internet star Francis BourgeoisMonarchs from around the world will make their way to Westminster Abbey tomorrow to watch the coronation of King Charles.",
        "In a break from tradition, King Charles added crowned royals to the guest list for this coronation, meaning a number of kings and queens were able to take part in the pageantry.For centuries, convention dictated that no other crowned royals should attend the coronation of a British monarch, in a tradition that lasted for 900 years.This was based on the idea that the sacred event should be an intimate exchange between the monarch and their people, in the presence of God.But Charles decided against this , which marks one of the ways he has tried to modernise the ceremony, meaning his crowned friends, including European royals and rulers from Arab states made it onto the guest list.",
        "Prince Albert of Monaco and Princess CharleneHe was the first European royal to confirm his attendance at King Charles' coronation, revealing the news at the end of January. Monaco's crown prince, 64, spoke fondly of the British king, whom he described as 'a very educated man and someone with a great sense of humour'.He also suggested he was looking forward to the event, telling PEOPLE magazine he was 'certain that it's going to be an incredible ceremony and a very moving one'.Albert added: 'We've maintained contact since His Majesty became King, but I haven't talked to him personally since the Queen's funeral.' ",
        "The prince, who is looking forward to attending the king's coronation, added: 'I'm certain His Majesty will add his own personal touches to the ceremonies, but what those will be, I'm sure I don't know.' He will be accompanied by his wife Princess Charlene -  a South-African Olympic swimmer.",
        "Earlier this year, Charlene and Albert were recently rumoured to have split after the Princess was pictured without her wedding ring.During an appearance in Milan last month, 44-year-old Charlene's ring finger was noticeably bare, prompting speculation that the Monegasque royals may be planning a separation.However, later that day, the couple made a joint appearance at the Monte Carlo Woman of the Year awards, where Charlene appeared to be wearing her wedding ring - pouring cold water on the split rumours. Rumours about the couple's marriage first circulated after Charlene was absent from Monaco for most of 2021 while having medical treatment in her native South Africa, and was admitted to a Swiss clinic to be treated for exhaustion on her return. However they are expected to put on a united front tomorrow. The pair share eight-year-old twins Jacques, Hereditary Prince of Monaco and Princess Gabriella, Countess of Carladès. Prince Albert of Monaco - who competed in bobsledding at the Winter Olympics five times from 1988 to 2002 -ascended to the Monaco throne after the death of his father, Prince Rainier III, on 6th April 2005. ",
        "Crown Prince Frederik of Denmark and Crown Princess Mary, Denmark",
        "Crown Prince Frederik of Denmark will be in attendance tomorrow alongside his wife Crown Princess Mary, Denmark. Queen Margrethe - who is the only living European queen since the death of Queen Elizabeth - was unable to attend due to back surgery.Last month,  Frederik presented ceremonial regimental flags to the 4th Battalion of The Princess of Wales's Royal Regiment at a ceremony in London.It was a tumultuous autumn for the Danish Royal Family after the monarch stripped her younger son Prince Joachim's four children of their prince and princess titles - a shocking move which he publicly spoke out against.She has said the decision was intended to allow Nikolai, 23, Felix, 20 - born from Prince Joachim's first marriage - and Henrik, 13, and Athena, 10, to live normal lives without royal obligations.Instead of being Princes and Princesses, they are Counts and Countess and referred to as Their Excellencies - a change which is now reflected on the household's website.At the time, Prince Joachim publicly spoke out against his mother's decision - claiming that his children had been 'harmed' in the process.Later this year, the 53-year-old royal, who is sixth in line to the Danish throne, will relocate to Washington DC with his family to become defence industry attaché at the Embassy of Denmark.",
        "King Carl XVI Gustav of Sweden and Crown Princess Victoria",
        "At the age of 75, Carl is the longest reigning monarch in Swedish history, having took to the throne in 1973. King Carl XVI Gustav of Sweden is one of the European royals with the closest ties to the Queen. He is a great-great-grandson of Queen Victoria and was a third cousin of the late Monarch. That is because the Swedish King is the great-grandson of Queen Victoria's son Prince Arthur, and is also related, on her mother's side to Victoria's eighth son, Prince Leopold, Duke of Albany. Following the King and Queen Silvia's tour of Estonia this week, the monarch is expected to be accompanied to the Coronation by his daughter Crown Princess Victoria. King Felipe and Queen Letizia, Spain",
        "It's been a busy week for the Spanish royals - with King Felipe and Queen Letizia hosting Colombian President Gustavo Petro and his wife Verónica Alcocer in Madrid.Following a state dinner last night, the Colombian couple are returning home to today while the Spanish royals jet out to London. Felipe is a distant cousin of Charles: his mother, Queen Sofia, was a third cousin of the Queen and a first cousin once removed of the Duke of Edinburgh. Following the death of Queen Elizabeth, who Felipe celled Aunt Lilibet, the Spanish royal wrote a touching letter to Charles.",
        "He wrote: 'Your Majesty, dearest Charles,'Deeply saddened by the sorrowful news of the passing of Her Majesty Queen Elizabeth II, your beloved mother.'I would like to offer Your Majesty and the British people, on my behalf and on the behalf of the Spanish government and people, our most heartfelt condolences.'Crown Prince Haakon and Crown Princess Mette-Marit, Norway",
        "There has long been a bond between the British and Norwegian royal families, which intensified after Germany visited Norway in 1940, and the royals came to stay in the UK.Charles was names after the former King Haakon VII, who was known colloquially among friends and family as Carl, and called Uncle Charles by Queen Elizabeth.Crown Prince Haakon is the great grandson of Haakon VII, and is set to represent his family at the coronation alongside his wife Mette-Marit.Last month, the royal couple were welcomed to Windsor Castle by the Prince and Princess of Wales during their tour of the UK.The two royal couples had previously met in 2018 during the then Duke and Duchess of Cambridge's trip to Oslo.Haakon is heir apparent to the throne of Norway. Despite being older, his sister Princess Märtha Louise of Norway is fourth in line to the throne due to Norway's succession rules.",
        "Mette-Marit was born a commoner, to farmers in Norway and was a single mother by the time of her engagement to Crown Prince Haakon in 2000.She became Crown Princess after the couple's marriage in 2001. Mette Marit has spent her reign championing humanitarian projects while joining official visits.Her first official appearance was at the Nobel Peace Prize ceremony at Oslo City Hall on December 10, 2000, following the announcement of the couple's engagement on December 1.Grand Duke Henri and Grand Duchess Maria Teresa, Luxembourg",
        "The Grand Duke of Luxembourg and his wife Maria Teresa are also guests at tomorrow's ceremony. Henri, who came to power in 2000, is a relative of the Monarch via Leopold I, Prince Albert's uncle.Last year, the couple expressed their sorrow over the Queen's passing on Twitter. The Luxembourg royal family wrote: 'Their Royal Highnesses are deeply moved and saddened by the news of the death of HM Queen Elizabeth II, a monarch deeply attached to the friendship between our two countries.'HRH the Grand Duke will send a message of condolence on behalf of the people of Luxembourg to the British Royal Family.'Crown Princess Marie-Chantal and Crown Prince Pavlos, Greece",
        "Marie-Chantal, Crown Princess of Greece, will attend the historic ceremony tomorrow alongside her husband Crown Prince Pavlos of Greece. Prince Pavlos is the eldest son and second child of Constantine II, the last King of Greece from 1964 to 1973 and his wife, Anne-Marie of Denmark. Despite the Royal Family being abolished in Greece, the British royals still have a close relationship with their distant royals. Earlier this year, Princess Anne travelled to Athens to console Prince Pavlos at his father King Constantine's burial ceremony.In the 1990s, Constantine was stripped of his Greek citizenship and the state seized Tatoi and a palace on the island of Corfu - where Britain's Prince Philip was born. King Willem-Alexander and Queen Máxima, the Netherlands",
        "Queen Maxima will attend alongside her husband King Willem-Alexander. King Willem-Alexander is distantly related to King Charles - he was the Queen's fifth cousin once removed thanks to an ancient connection in their family tree. Willem-Alexander is a descendant of Princess Carolina of Orange-Nassau, who was the daughter of William IV, Prince of Orange, and his wife Anne, the eldest daughter of King George II of Great Britain and his consort Caroline of Ansbach.In 2018, the royal couple last visited the UK in 2018 - when Maxima greeted the late Queen with a friendly peck on the cheek. The Queen and the Duke of Edinburgh also paid a state visit to Queen Juliana and Prince Bernhard of the Netherlands in March 1958. King Abdullah II and Queen Rania, Jordan ",
        "King Abdullah and Queen Rania of Jordan are also expected to attend the historic event tomorrow.The royal couple flew over to the UK for the Queen's funeral last September.The Queen of Jordan opted to wear the same black ruffled coat that she had donned to meet the late Queen in 2001.Queen Rania seemed fond of the late monarch and she referred to her as the 'Queen of the World' in a sweet Instagram tribute last year. Sharing a snap of herself with her husband at the state funeral in London she wrote: 'Bidding farewell to a Queen whose legacy will never fade or be forgotten. With His Majesty at Her Majesty Queen Elizabeth II's funeral in the UK.' She said: 'Despite being the most important person in the room, she always made you feel like the most important person in the room. 'She just had a very gentle and subtle way about her. Her elegance wasn't just in her appearance but in the way she lived her life.'I just have the most wonderful memories of her, throughout the years, every time I met her, I felt she was warmer and warmer.'She didn't always presume that you wanted her advice but she was very generous when you asked for it. I really looked up to her. To me, she is the queen of the world.'Queen Rania also expressed her confidence in King Charles III as a leader calling him 'incredibly intelligent.'Crown Prince Fumihito and Crown Princess Kiko of Japan",
        "Last month, Japan's imperial household announced that Crown Prince Fumihito and Crown Princess Kiko will represent Emperor Naruihto, 63, at the historic event.The royal couple were pictured arriving at Claridge's hotel in Mayfair yesterday - where they will stay for their three day trip.  According to the Imperial Household Agency, Japan received an invitation from the British Royal Family to the coronation in March.Although Emperor Naruhito and his wife Empress Masako attended the Queen's funeral in September 2022, the ruler has asked his younger brother Crown Prince Fumihito, 57, to represent him at the coronation.The Crown Prince is the current heir presumptive and his teenage son Akishino is second in line to succeed his uncleKing Philippe and Queen Mathilde, Belgium",
        "The Queen's distant cousin King Philippe of Belgium will be seated in the Abbey alongside his wife, Queen Mathilde. The monarchs share several common ancestors, including Franz, the Duke of Saxe-Coburg-Saalfeld, who was the grandfather of Queen Victoria and the father of King Leopold I of the Belgians.They are also related via King Christian IX of Denmark, known as the 'grandfather of Europe' due to his far-reaching family tree. The Queen is King Christian IX's great-great granddaughter. Philippe is his great-great-great-grandson. King Philippe and Queen Mathilde attended the service without their four children.Hereditary Prince Alois and Hereditary Princess Sophie, Lichtenstein",
        "Hereditary Princess Sophie of Liechtenstein will be in attendance during the event tomorrow alongside Alois, the Hereditary Prince of Liechtenstein.Aged 54, he has been regent of his country since 2004 and has been raising his four children with his wife, Hereditary Princess Sophie.His father, Hans-Adam II, the reigning Prince of Liechtenstein, was an eighth cousin of Queen ElizabethKing Jigme Khesar Namgyel Wangchuck and Queen Jetsun Pema, Bhutan",
        "King Jigme, the hugely popular fifth Druk Gyalpo, studied in the UK and the US and ascended the throne in 2006, aged just 26 after his own father abdicated. He attended a reception hosted by King Charles III at Buckingham Palace following the death of Queen Elizabeth II.King Tupou VI and Queen Nanasipau'u, Tonga",
        "Tupou VI has reigned as the King of Tonga since 2012 and is expected to attend the coronation with his wife Nanasipauʻu Tukuʻaho.During his reign, the monarch has nurtured his close links with the British Royal FamilyIn 2018, Tupou met with the Duke and Duchess of Sussex during their tour of Australia and New Zealand.His brother, Oxford-educated King George Tupou V passed away in a Hong Kong Hospital at the age of 63 in 2012, the cause of death believed to be linked to kidney problems.Otumfuo Osei Tutu II and Lady Julia, Ashanti royals (Ghana)",
        "Yesterday, King Charles welcomed Otumfuo Osei Tutu II - the King of the Ashanti Kingdom in Ghana - to Buckingham Palace.The monarch is joined by his wife Lady Julia Osei Tutu for the occasion.Charles was pictured beaming with the Asantehene as the pair laughed with each other. A multi-coloured fringed parasol was held over the Ghanaian monarch's head as the encounter took place, with the cover denoting the visiting king's seniority.The King also met the Asantehene in November 2018 when the Asantehene and Lady Julia welcomed Charles and Camilla to Manhiya Palace in Kumasi, Ghana.The Asantehene has a long-standing relationship with the British Monarchy, having met the Queen at Buckingham Palace in 2000; and Charles in Glasgow, where they both received honorary degrees. Yang di-Pertuan Agong and Raja Permaisuri Agong Tunku, Malaysia",
        "Another royal couple jetting in from halfway across the world is Yang Di-Pertuan Agong XVI and the Raja Permaisuri Agong.The couple are making the journey from their Palace in Malaysia to London this weekend.It comes as King Charles held an audience with the couple at Buckingham Palace last October. It was one of the monarch's first engagements after the two weeks of mourning for the late Queen ended. Yang di-Pertuan Agong Abdullah, 63, became the King of Malaysia in 2019.As a young man, he completed his military training in the UK at Royal Military Academy Sandhurst.",
        "He will attend the ceremony with his wife, Raja Permaisury Agong Tunky.Sultan Abdullah Sultan Ahmad Shah was crowned monarch after Sultan Muhammad V stepped down after the last his reported marriage to a Russian ex-beauty queen, Oksana Voevodina.The ceremony was televised nationally and attended by Prime Minister Mahathir Mohamad and hundreds of guests decked out in Islamic finery.Before being sworn in at the palace, the 63-year-old, who is also the ceremonial ruler of central Pahang state, was given a welcome at the national parliament and inspected a guard of honour.His predecessor, Sultan Muhammad V stepped aside following just two years on the throne after he went on medical leave. Reports then surfaced he had married a former Miss Moscow in November.King Tuheitia and Makau Ariki Atawhai, Māori royals (New Zealand) ",
        "King Tuheitia and Makau Ariki Atawhai have travelled to London to represent the Māori community at the coronation. Earlier this year, King Charles made a point to involve Māoris in his first Commonwealth Day service at Westminster Abbey.The King and Queen Consort were welcomed by Kiwi conch-blowers and a swaying Maori chorus who effectively drowned out a small cross-section of assorted protesters on the other side of the road. King Vajiralongkorn and Queen Suthida, Thailand",
        "The Thai King and Queen will be in attendance at Westminister Abbey tomorrow.They revealed ahead of the weekend that they would be attending a May 5 reception given by King Charles for invited heads of state and overseas representatives at Buckingham Palace."
    ]
}