{
    "articleURL": "/wires/pa/article-12054207/Mercedes-struggles-difficult--admits-Lewis-Hamilton-ahead-Miami-GP.html",
    "content": [
        "Lewis Hamilton has described Mercedes’ form as a “kick in the guts” – but team principal Toto Wolff insists his superstar driver will still sign a new contract.",
        "Hamilton heads into Sunday’s Miami Grand Prix 45 points behind championship leader Max Verstappen after just four rounds of the season.The British driver’s Mercedes team have endured a turbulent campaign.Hamilton finished second in Australia at the beginning of last month to raise hope of a Mercedes’ fightback, but the 38-year-old, whose contract with the Brackley team expires in just over six months, was a distant sixth in Azerbaijan last weekend.And, despite an encouraging opening practice session at Miami’s Hard Rock Stadium, with George Russell leading his team-mate in a Mercedes one-two, Hamilton ended the day’s concluding running in seventh, nine tenths back from Verstappen.Asked for his assessment of Mercedes’ speed in the Sunshine State, Hamilton replied: “It is the same as every weekend.“We are a second down. We are just not particularly quick. It is a struggle out there.“We are trying different things. First practice looked good and then we got to second practice and the true pace came out. It is a kick in the guts. It is difficult to take sometimes.”Mercedes are due to introduce an upgrade at the next round in Imola in a fortnight’s time, but Wolff has already warned Hamilton that he will not have the speed to fight with Red Bull.",
        "Hamilton added: “I am going to stay optimistic, but it feels like we are racing the same car as last year. We desperately need those upgrades, that is for sure.“We have to keep our heads down for one more race and hopefully we will start a new path at the next race.”Hamilton’s future with Mercedes, and indeed in Formula One, continues to hang in the air. It’s a work in progress, bouncing emails back and forth, and eventually we’re going to sign it  Toto Wolff on Lewis Hamilton's contract  But Wolff believes Mercedes’ failure to provide the Briton with a championship-winning machine will not prevent him from extending his stay with the team he joined in 2013.Wolff said: “We have been together for 11 years, and every single time when we talk about Lewis’s contract, it’s six months of, ‘Where are we and what is happening?’ And we keep seeing the same thing, that we’re just rolling on.“The contract negotiations are not difficult. It’s just putting a different timeline and a few different numbers in there. That is what we are doing and that is what we are working on.“It’s a work in progress, bouncing emails back and forth, and eventually we’re going to sign it.”"
    ]
}