{
    "articleURL": "/home/books/article-12048725/POPULAR.html",
    "content": [
        "THE BRINK",
        "by Jamie Fewery",
        "(Legend Press £8.99, 288pp)Young Londoners Dan and Anya are facing the end of their marriage. The rot set in with mutual infidelity; and neither counselling nor two small daughters can now defer the inevitable.To sort out the details, the couple meet with their lawyers and a mediator who practises ‘kind’ divorce. This means going back over the union in detail, from how it ended to how it started.A back-to-front love story emerges; warm, wry, sad and brilliantly sharp on urban lifestyle detail. From the scruffy Crouch End flat to the chic Suffolk cottage, we follow the trajectory of the relationship, which might not be as over as it looks. Bloke lit at its best.THIS FAMILYby Kate Sawyer",
        "(Coronet £16.99, 416pp)A wedding party in a country garden is the setting for this well-heeled drama about a charismatic family gathering together.Matriarch Mary, embarking on her second marriage, has summoned her three daughters. Two of them, Emma and Phoebe, have been estranged for years.As the action moves between past and present we discover the reason — they fell in love with the same man, famous actor Michael.Can they ever be close again? Entwined with this narrative is the story of Mary’s first marriage and her unlikely bond with feisty punk rocker Liz. A warmly emotional read that’s strong on grief, love, family and friendship.",
        "BROKEN LIGHTby Joanne Harris",
        "(Orion £20, 432pp)Lonely Bernie Moon has low self-esteem. But also a superpower, the ability to look inside others and alter the way they think.It’s been dormant since childhood but the murder of a young local mother prompts its revival.Unexpectedly this leads to new friendships and ultimately an entire change of lifestyle. The action slips back and forth in time to Bernie’s awful schooldays and a forthcoming class reunion where a number of scores are settled.Part magical, part brutally real, angry yet optimistic, this moving and brilliant novel considers the nature of truth, especially about women and the way men think of them"
    ]
}