{
    "articleURL": "/wires/reuters/article-12044545/Google-Meta-executives-push-against-Canada-online-news-bill.html",
    "content": [
        "By Sam Jabri-Pickett",
        "TORONTO, May 3 (Reuters) - Google and Meta would withdraw access to news articles in Canada if legislation compelling internet companies to pay news publishers is passed, company executives told Canadian lawmakers on Wednesday.Canada's proposed legislation would force platforms like Google parent Alphabet Inc and Facebook parent Meta Platforms Inc to negotiate commercial deals and pay Canadian news publishers for their content, part of a broader global trend to make tech firms pay for news.Google may be forced to remove links to news articles found in Canadian search results if the bill passes, its vice president of news Richard Gingras said in testimony to a Senate committee, citing an \"uncapped financial liability\" if it had to pay publishers for linking to their sites.Meta would also end the availability of news content in Canada if the bill is passed as currently drafted, said Rachel Curran, head of public policy for Meta in Canada.Ottawa's proposal is similar to a ground-breaking law that Australia passed in 2021, which also triggered threats from Google and Facebook to curtail their services. Both eventually struck deals with Australian media companies after amendments to the legislation were offered.This year, Google tested blocking some Canadian users' access to news as a potential response to the legislation, a move Prime Minister Justin Trudeau called a \"terrible mistake.\"",
        "Google last year linked to Canadian news publishers more than 3.6 billion times, Gingras said, helping those companies make money on ads and new subscriptions.Curran said Facebook feeds sent Canadian publishers more than 1.9 billion clicks in the 12 months ending April 2022, worth an estimated $230 million in free marketing.\"A framework that requires us to compensate publishers for links or news content they voluntarily put on our platforms is unworkable,\" Curran said.The bill introduced in April 2022 by Heritage Minister Pablo Rodriguez is the latest legislation aiming to make digital media platforms pay for linking news content.\"All we're asking the tech giants like Facebook and Google to do is negotiate fair deals with news outlets when they profit from their work,\" Heritage Ministry spokesperson Laura Scaffidi said. (Reporting by Sam Jabri-Pickett in Toronto, additional reporting by Ismail Shakil in Ottawa and Nia Williams in British Columbia; editing by Steve Scherer, Josie Kao and Jamie Freed)"
    ]
}