{
    "articleURL": "/tvshowbiz/article-12060525/Helen-Flanagan-forced-use-filter-wedding-dress-following-split-fianc.html",
    "content": [
        "She split from fiancé Scott Sinclair last year after 13 years together.",
        "And Helen Flanagan took to her Instagram Stories to show a glimpse of herself in a wedding dress thanks to an artificial intelligence app on Monday.The former Corrie actress, 32, tearfully declared that it was 'the closest she was going to get' to walking down the aisle.Helen, who shares children Matilda, seven, Delilah, four, and Charlie, two, with ex Scott, posted a snap of herself sitting on a bed teasing a hint of cleavage in a plunging denim dress.Slowly the picture morphed into her wearing a gorgeous bridal gown complete with diamond with tiara and veil. ",
        "She captioned the post with tearful emojis writing: 'At this rate the closest I'm going to get [to getting married]'.Before adding: 'Yes I'm a grown woman with 3 kids and paid for this [filter] app and waited for it to down load'. It comes after Helen was seen with her ex Scott for the first time last week since they split. On Sunday, she shared a throwback clip of her returning home after appearing on I'm A Celebrity South Africa.The footballer, 34, was seen waiting for Helen on the stairs with their three children.Helen wrote: 'Found this video of when I came back from the jungle. I was away for one month and never left my babies before.' ",
        "She recently hinted her dating life is going well, after joining dating site Raya following her split from Scott.After she was asked if she would meet someone new, Helen told OK! : 'I wouldn't want to say if I've been on any dates. Maybe next time! It's nice to have some fun.'",
        "Despite posting a picture of herself which looked like she was wearing her diamond engagement ring on Instagram recently, Helen has said the pair will never rekindle their 13 year romance.She has been plagued with rumours of reconciliation after she was spotted on holiday with the footballer and their three children, Matilda, seven, Delilah, four, and Charlie, two, however she insists all is not as it seems.Helen explained that the couple split in July and their separate Dubai holidays matched up, so they had a family day, adding that there is no chance of a reunion but she stated: 'I just hope we can be good friends and co-parent.'She caused further confusion when she appeared to be seen sporting the dazzling ring Scott gifted her in 2018 - nine years into their romance - however Helen insisted this was merely an oversight - and vowed to keep the ring for her daughters.",
        "As well as detailing her former love, Helen, who will hit screens on Monday night for I'm A Celebrity South Africa, also confirmed that she had joined exclusive dating app Raya, yet refused to reveal if she had been on dates.",
        "Earlier this month, Helen's trip to Dubai was thrown under scrutiny when she was seen with Scott and wearing her 'engagement ring' - causing mass confusion.Clearing up the rumours, she explained: 'We actually broke up in July... Scott was there on a break from training, so we spent a day together with the kids. That was it.'On the ring issue, she revealed the ring she was wearing was not her engagement ring - although she does not intend to return the dazzler: 'That's so typical of me – I didn't even think about wearing a ring on that finger!'Speaking about returning the ring, she said: 'My ring's my ring, it's for my girls.'She revealed she was wearing the ring through the filming of I'm A Celebrity, saying: 'I did wear my engagement ring when I was in the jungle. We'd only just broken up, and I didn't want everyone to be asking, 'Where's your ring'...",
        "'I didn't want to talk about it… I wanted to keep it private for the kids, I didn't want to be talking about it on the show...'I did find that difficult, because I had all that going on in my head. 'He's a very private person, while I'm an open book. But we were together for 13 years – we both needed to deal with the break-up.'",
        "Helen also discussed her dating future, after it was revealed that she had signed up to celebrity dating app Raya following her break-up, as well as being plagued with rumours that she will join Celebs Go Dating.She said: 'I mean yeah, I love that show. I watch it all the time. Do you think I'd be any good at Celebs Go Dating? Yeah, I don't know. Can you imagine, I'd be so funny. Well, you never know…'"
    ]
}