{
    "articleURL": "/wires/reuters/article-12041373/Motor-racing-Perez-make-statement-intent-Miami.html",
    "content": [
        "By Alan Baldwin",
        "May 3 (Reuters) - Sergio Perez wants to be considered a Formula One title contender and Sunday's Miami Grand Prix offers the Mexican a chance to lead the championship for the first time and rattle the cage of Red Bull team mate Max Verstappen.A third win in five races would lift 33-year-old Perez above reigning double world champion Verstappen and be quite a statement of intent.Verstappen, who has enjoyed an unbroken run at the top of the standings since he won in Spain on May 22 last year, has yet to finish lower than second in 2023 and arrives in Florida with a six-point advantage.The 25-year-old Dutch driver was only five points clear of Perez after four races last year but won in Miami with fastest lap and went on to finish the season 149 points ahead and with 15 victories to his team mate's two.Perez has never won more than two races in a season but is coming off the back of a double success in Azerbaijan -- in the Saturday sprint and Sunday's main event -- hoping to build momentum.\"I really believe that we are in the fight,\" he said after the race in Baku.STREET CIRCUITSHe finished fourth on Miami's debut last year and former McLaren team mate and 2009 world champion Jenson Button reckons the Mexican, who excels on street circuits, can go a long way to winning over the sceptics.",
        "\"I'm really impressed with Sergio. Max has to be the toughest team mate, because he just gets out there and gets it done,\" the Briton told reporters. \"If he (Perez) can pull out a win there (in Miami), that would be a massive deal for him.\"I think that will give him big confidence for the season. We haven't seen him throughout the season be as competitive as Max, Max is on it every weekend and Checo (Perez) has been a lot more up and down.\"Consistency is where Sergio has been lacking...but if he can do it in Miami, I think he has a chance to fight for the championship,\" added the Briton.\"And I didn't think I'd be saying that. I really didn't.\"If Button is rooting for Perez, so too are Formula One neutrals in a season that otherwise risks becoming one long Verstappen victory parade with Red Bull currently in a league of their own.Red Bull have won every grand prix, three of them one-two finishes and their rivals have been left trailing far down the road.Formula One needs an exciting race after Baku failed to live up to expectations with scant overtaking and little drama, even if Ferrari's Charles Leclerc did seize pole position and completed the podium.",
        "Miami will be hot and humid and the race, one of three in the United States now with the arrival of Las Vegas in November piling on the hype, physically one of the most demanding of the season.Aston Martin, Ferrari and Mercedes will all be hoping to get closer to Red Bull while Renault-owned Alpine need a strong result after drawing blanks in Melbourne and Baku. (Reporting by Alan Baldwin in London, editing by Ed Osmond)"
    ]
}