{
    "articleURL": "/tvshowbiz/article-12057683/Coronation-concert-viewers-left-howling-Kirsty-Young-awkwardly-butchers-Nicole-Scherzinger-name.html",
    "content": [
        "Kirsty Young left Coronation Concert viewers in hysterics after she awkwardly butchered Nicole Scherzinger's name live on air on Sunday.",
        "The BBC host, 54, made the blunder when co-presenter Jordan Banjo's interview with the pop star, 44, was cut short following the arrival of King Charles and Queen Camilla. Speaking to the camera Kirsty said: 'There of course we see the arrival of their Majesties the King and Queen'.Stumbling over her words she continued: 'There is not very much that could upstage Nicole Sher-ginger'.Before adding: 'You know who I mean'.",
        "Kirsty later apologised to Diversity dancer Jordan, 30, for her interruption saying: 'Very sorry to cut you off in your prime there. I have to tell you it was all go here'.'Suddenly the King and Queen arrived and we all thought 'What, wait a minute'.'Beaming Jordan replied: 'If anyone was gonna cut my time off with Nicole Scherzinger it had to be the King and Queen. That's fine.'Only for Kirsty to quip: 'I couldn't even say Nicole Scherzinger, never mind apologise for it.'Taking to Twitter one viewer wrote: 'HOWLING AT HOW KIRSTY YOUNG JUST DAID NICOLE SCHERZINGER and then when ah you know what I mean'.While a second added: 'Did she say I can't even say, Nicole Scherzinger? She just did. Lol.\"Another commented: 'Nicole Scherzinger looking stunning....or Nicole Sturgeon as Kirsty Young called her earlier'.",
        "Nicole later looked sensational in a Royal blue velvet gown during her performance at the star-studded event.Fans praised singer's incredible rendition of Reflection from the classic Mulan as she took to the stage on the East Lawn of Windsor Castle. The singer channelled her inner Disney Princess in the stunning dress that featured a floral mesh corset and dramatic train.  Her long brunette hair was worn in an elegant half-up half-down style that tumbled down in loose curls. Nicole accessorised her look with a dazzling bespoke diamond choker, matching earrings and chunky silver rings from Aariya Diamonds. ",
        "Following her performance, viewers of the show shared their thoughts on Twitter, claiming Nicole was 'insanely talented' and looked 'gorgeous.'One person wrote: 'Blimey Nicole Scherzinger can hit a note.'Another added: 'Nicole Scherzinger's gown for the Coronation Concert is gorgeous and she sounds really good.''Miss Nicole Scherzinger reminding everyone that she is a vocalist!' A third penned. Someone else shared: 'Nicole Scherzinger, take a bow, what a voice!' 'Nicole Scherzinger is still criminally underrated,' another fan wrote. The King and Queen took centre stage for the Coronation Concert - and got into the spirit by waving the Union Flag, dancing and singing to Lionel Richie and laughing at Miss Piggy and Kermit the Frog.Charles III and his wife Camilla walked into the royal box to roars from the 20,000-strong crowd who did three cheers for the couple who waved and grinned back as the sun set over Windsor Castle."
    ]
}