{
    "articleURL": "/news/article-12054769/Trans-woman-cleared-flashing-penis-YMCA-shes-FAT-genitals-visible.html",
    "content": [
        "Darren Glines, who now goes by Rachel, was found not guilty of three counts of indecent exposureThe 31-year-old's lawyers claimed that her gut was too large for her penis to be exposedOne of the complaints stated that there were three juveniles present during the incident in Xenia, OhioA judge ruled that a transgender woman could not have indecently exposed her penis in a YMCA female changing room after agreeing with her claim that she's too fat for it to be visible. ",
        "Darren Glines, who now goes by Rachel, was found not guilty of three counts of indecent exposure at the facility in Xenia, Ohio.Judge David McNamee cleared Glines after agreeing that the size of her belly meant it would be impossible for anyone to see her penis.  Glines, 31, has had several complaints made against her dating back to 2021 – with at least three people complaining that they saw a 'naked male in the female locker room.'One of the complaints stated that there were three juveniles present during the incident, with a woman going to the front desk to report the issue.But she was reassured by a worker that it was 'actually a woman' and that she 'shouldn't have been disturbed' but the incident.",
        "Judge David McNamee said that there was 'little dispute as to the facts of the case' as Glines was authorized by the Executive Director of the YMC to use the women's locker room.Jacqueline Brockman said that Glines was allowed to use the facilities at all of the Greater Dayton area YMCA locations.The case was legally brought against Darren Glines, but she now goes by the first name of Rachel and has not had gender reassignment surgery.McNamee said: 'There is no question that Glines was in the women's locker room. However, Glines was not charged with trespass, nor was Glines charged with being in an area of the YMCA where Glines was not supposed to be.",
        "'Quiet simply, the facts do not exist to support a find of guilt, as charges. Glines' genitalia was not visible as a result of other portions of her body covering same.'Glines' lawyers, Lauren and Keara Dever, both argued that she was so fat that her gut would obscure her genitalia.In a statement released on Monday, Glines' attorneys said: 'It's unfortunate not only for her, but for the entire community, that the filing of these charges ever occurred.'We are grateful that the rule of law and the truth prevailed so that Ms. Glines and the community can move on in peace.'",
        "Xenia City Council President Williams Urshcel said that one of the women who filed a complaint was allegedly informed by an employee at the YMCA that Glines identifies as a woman so she 'shouldn't be disturbed by this.'Urschel recounted the story at a Greene County Tea Party meeting, with attendees audibly laughing.The rest of the city council released a statement saying that Urshel's comments were 'his own,' and that the charges filed against Glines were through the Xenia Police Division's own investigation.'Neither the Xenia City Council, nor any member of the Council, had any part in the decision to file public indecency charges regarding the use of the YMCA's locker rooms.'",
        "The YMCA of Greater Dayton said in a statement that they would continue to comply with the law while also ensuring the privacy and safety of all members.'Under no circumstance will we investigate an individual's birth identity and then assign individuals to locker rooms,' the YMCA said. 'That would be counter to the law, counter to respect for all people and it is not who or what we are as an organization.'A YMCA employee was called to testify at the trial, telling the court that she had to get a restraining order against Glines after she assaulted her.",
        "Kateisha Young told Reduxx that Glines grabbed her genitals after they had gone out to coffee.Young claims that following the assault Glines started attending her place of work, knowing when she would be working.She added that she is concerned that she will be forced to find other work once her protection order against Glines runs out in 2024.The incident at the YMCA in Xena is just one of many that have hit the group's facilities across the US.Julie Jaman, 80, was banned from a YMCA pool after she demanded a transgender employee leave the women's locker room.She had been a regular at the Mountain View pool in the City of Port Townsend in Washington when she spotted the worker in the changing room while she was showering.",
        "Jaman claims that while she was changing she heard a 'mans voice' and immediately confronted the worker, Clementine Adams, who identifies as a woman.She said that she asked Adams if she had a penis, and she said it was 'none of her business', so she asked them to leave.Jaman told a member of staff at the pool, was told by YMCA aquatics manager Rowen DeLuna that she was 'discriminating' and that the police would be called.'She was told that she was 'banned from the pool forever' before DeLuna called law enforcement, where Jaman was described as having an 'emotional response' and 'screaming' in an incident report."
    ]
}