{
    "articleURL": "/news/article-12043317/Army-cadet-said-thought-pregnant-hanged-room-inquest-hears.html",
    "content": [
        "Olivia Perks was found dead at the military training school in Berkshire in 2019For confidential support call the Samaritans on 116123 or go to samaritans.org An Army cadet said she had slept with a staff sergeant and thought she might be pregnant before being found hanged in her room at Sandhurst, an inquest has heard.",
        "Olivia Perks was discovered dead at the elite military training school in Berkshire on February 6, 2019, after complaining about rumours being spread about her.An earlier inquest hearing recorded the 21-year-old's provisional cause of death as 'asphyxia due to hanging'.Her inquest at Reading Town Hall heard she told Sophie Given, whom she had met on a dating site, that the staff sergeant had slept with her and she 'may be pregnant'.In the phone call on December 9, 2018, she also said he was about 45, she was speaking to him every day and was asking whether she should reply to a text from him.",
        "Later she told Ms Given the staff sergeant 'encouraged her to get drunk' on a date and that she wanted to go back to Sandhurst during it. Inappropriate relationships between officer cadets and their superiors are banned regardless of whether or not they are sexual. Mike Rawlinson KC, who represents Ms Perks' mother Louise Townsend, told a pre-inquest review the officer cadet had fallen victim to 'gross sexual misconduct' before she died. The inquest has also heard she had spent the night with Colour Sergeant Griffith after the Falklands Ball on February 1, 2019. Both of them denied any sexual or other inappropriate activity took place. ",
        "After the ball, Ms Perks and Colour Sergeant Griffith joined a group of officer cadets who continued drinking and at one point entered a room together and locked the door, the hearing was told. Fellow officer cadet Anwar Zurmati said he heard 'grunting noises' and that it sounded like the pair were 'making out'. He said Captain Tamara Clements and him laughed but in her witness statement, she said she heard 'noises' but could not be sure where they were coming from. The rooms had thin walls, there were many nearby and people were also making noise in the corridors, she added. Ms Perks was walking back in her ballgown from the night before when she was seen by the regimental sergeant major, who told her 'my office, now', according to Ms Clements. The inquest also heard rumours about the pair began spreading on WhatsApp after the ball which left Ms Perks feeling 'like s***'. ",
        "A friend, whose name was not given due to vulnerabilities, told the inquest in evidence which was read out by counsel to the coroner Bridget Dolan KC: 'Someone sent a message saying she had slept with Colour Sergeant Griffith which had been circulating. 'People were gossiping, you could hear it. It made Liv very uncomfortable and made Liv feel like s***. ",
        "'They weren't checking in to see how she was. Others were avoiding her.' Ms Perks had made a 'significant' suicide attempt following a Royal Engineers visit in July 2018 and was back in training two days later after being classed as a 'low risk of re-occurrence'. Her friend added: 'I was not at the Engineers visit. There were rumours she had tried to kill herself and people gossiped about that. 'Officer cadets were bothering her trying to find out what she was doing rather than actively being concerned about her welfare.' Captain Annelise Milton told the hearing on Wednesday that Ms Perks told her 'I've f***** up, they will kick me out of the Army' following the suicide attempt. The inquest continues.For confidential support call the Samaritans on 116123 or go to samaritans.org "
    ]
}