{
    "articleURL": "/tvshowbiz/article-12040513/Home-Aways-Zoe-Ventoura-holds-hands-former-star-Ditch-Davey-shops.html",
    "content": [
        "Zoe Ventoura has found love with her former Home And Away co-star Kristian 'Ditch' Davey, almost three years after her split from ex-husband Daniel MacPherson. ",
        "The notoriously private actress, 42, was spotted holding hands with Davey, 46, as they went shopping in Sydney on Saturday, all but confirming their blossoming new relationship.The pair were joined by their respective children. Ventoura bought her three-year-old son Austin, who she welcomed with MacPherson, while Davey was joined by his youngest son Taika, 11, who he shares with ex-wife Sophia Dunn.The couple looked relaxed as they herded the youngsters through the busy shopping centre, making stops at Zara and Foot Locker to pick up a few items.  At one point, Ventoura allowed little Austin to sit inside a coin-operated car ride. ",
        "Both Ventoura and Davey watched on lovingly as Autsin sat behind the child-sized steering wheel and pretended to beep the horn. Ventoura dressed down for the casual outing, sporting a grey V-neck top and black skinny jeans. Davey, best known for his role as Evan Jones in Blue Heelers and as Dr Christian Green in Home And Away, meanwhile wore a white T-shirt, acid washed jeans and white sneakers. ",
        "Davey was previously married to Neighbours actress Sophia Dunn. The couple wed in 2010 and welcomed two sons, Taika and Eden, 19, but it seems they have quietly split in recent years.Saturday's sighting came one week after Ventoura's ex MacPherson went 'Instagram official' with his new girlfriend, AFL WAG and House Rules star Jessica Dover.",
        "Last Tuesday, Dover confirmed swirling romance rumours by sharing a series of photos to Instagram to mark the Neighbours actor's 42nd birthday.'Happy Birthday @danmacpherson. Adore you,' she wrote in the caption.MacPherson announced his split from Ventoura after five years of marriage in December 2020.The pair shared almost identically worded posts on Instagram at the time, revealing they had mutually decided to separate."
    ]
}