{
    "articleURL": "/news/article-12059669/Trump-weighs-Bud-Light-firestorm-amid-calls-defund-leftist-woke-companies.html",
    "content": [
        "The former president warns Bud Light that conservatives could continue their boycottIt came as the the 76-year-old promoted a book on 'woke' firm written by a long-time supporterDylan Mulvaney, a transgender actress, took part in a Bud Light social media campaign last month Donald Trump has slammed the makers of Bud Light for pandering to ‘the radical Left’ after it used an infamous transgender influencer to promote the popular beer.",
        "The former president derided parent company Anheuser-Busch for hiring Dylan Mulvaney, who rose to fame after documenting her gender transition on TikTok.Writing on his Truth Social account, the real estate mogul praised a conservative author who recently called the ad campaign ‘a woke, clueless, incredibly dumb miscalculation.’‘It’s time to beat the Radical Left at their own game. Money does talk—Anheuser-Busch now understands that. Great new Book by Wayne Allyn Root. Buy your copy today!’ Trump wrote.",
        "Root penned ‘The Great Patriot Protest &amp; Boycott Book’ two years ago and has long been a fervent supporter of the 45th president of the United States.The 61-year-old, who has spouted bogus conspiracy theories online in the past, argues that customers should ‘defund leftist woke companies.’‘In short, conservatives and patriots must wield the power of the purse. Money talks. We have the power to change the direction of this country by changing the direction of corporate policy,’ Root said.The ex-television pundit caused uproar in 2017 when he incorrectly claimed that a mass shooting in Las Vegas was a ‘clearly coordinated Muslim terror attack.’The Bud Light controversy was sparked when Mulvaney was presented with a commemorative can showing her face to mark her '365 days of being a girl.'Mulvaney announced her plans to transition last year and underwent invasive facial feminization surgery in December 2022.",
        "The gruesome operation sees bones sliced out of a patient's face and sanded down in a bid to soften male features.But the PR stunt sparked a furious response from conservatives, who accused the brand of meddling in one of the most hot-button culture war issues there is.",
        " Sales of the watery, low-calorie beer immediately slumped by more than one-fifth, sparking fears the ongoing boycott could do lasting damage.In the wake of the video, Anheuser-Busch lost more than $6billion in market capitalization in just six days.The beer giants stock roughly traded at just over 5 percent decrease in the total share value and the company's market capitalization stood at $113.33billion.And in the first week after the video was posted, Bud Light dollar sales dipped 6 percent, as Coors Light rose 3.5 percent and Miller Lite 3.1 percent.Brendan Whitworth, who heads Anheuser-Busch InBev's U.S. operations, said on April 14 that he regretted the division caused by the company's collaboration with Mulvaney.\"We never intended to be part of a discussion that divides people,\" the CEO wrote. \"We are in the business of bringing people together over a beer.\"Two executives, Alissa Heinerscheid, vice president of marketing for Bud Light, and Daniel Blake, Budweiser's vice president for marketing, were put on leave at the end of April after receiving death threats.",
        "Several famous faces slammed the brand for their decision after pro-Trump Kid Rock shot the cans and commented: 'F*** Bud Light, and f*** Anheuser-Busch. Have a terrific day.'"
    ]
}