{
    "articleURL": "/travel/article-12061011/The-inside-track-Australias-14-jaw-dropping-rail-journeys.html",
    "content": [
        "From transcontinental epics to steam journeys through jungle ravines, these trains are truly memorableOur list features the world's steepest track, hotel-standard sleeping compartments and unique locomotivesREAD MORE: I'm a train expert and these are my favourite 10 railway journeys in the world Say g'day to rail journeys that will take your breath away.",
        "Here we give you the inside track on Australia's 14 most jaw-dropping railway trips. Though by the time you've read about them all and beheld all the incredible pictures, you might just wonder if they aren't 14 of the world's most amazing rail journeys.From an epic transcontinental service between Sydney and Perth to steam locomotives that trundle through breathtaking jungle ravines, these are trains that pamper, thrill - and give passengers memories to last a lifetime.THE GHAN - ADELAIDE TO DARWIN",
        "The Ghan’s origins can be traced back to the 1830s, when Afghan cameleers arrived in Australia.These desert pioneers were immortalised in 1929 when the first steam train travelled from Adelaide to Stuart, later renamed Alice Springs. This trailblazing train was dubbed ‘The Afghan Express’ but was soon shortened to ‘The Ghan’.Today the train, operated by experiential tourism company Journey Beyond, stretches up to a kilometre in length and transports up to 300 passengers in total luxury between Adelaide on the south coast and coastal city Darwin, the capital of the Northern Territory.Northbound it's an epic two-night, three-day adventure covering almost 3,000km (1,864 miles). Journey Beyond explains that from April to October each year, the southbound journey from Darwin to Adelaide becomes The Ghan Expedition – ‘an extended, three-night, four-day journey with off-train experiences in Katherine, Alice Springs and quirky, underground town, Coober Pedy’.",
        "Journey Beyond adds: ‘With a major focus on food and wine, The Ghan’s menu tells the story of the country it travels through, proudly showcasing local produce, including barramundi [fish], quandong [fruit] and saltbush [an edible plant].’ Tickets cost from $2,480AUD (£1,328/$1,676US). For more information visit www.journeybeyondrail.com.au/the-ghan.INDIAN PACIFIC - SYDNEY TO PERTH",
        "If you want to get a true feel for the sheer width of Australia, then step aboard the Indian Pacific, so named because it links Sydney on the Pacific coast with Perth on the Indian Ocean coast.The distance? A whopping 4,352 kilometres (2,704 miles).And the fares run into the thousands, too. They start from $2,430AUD (£1,300/$1,630US), but ‘everything is included’ and operator Journey Beyond promises ‘an immersive transcontinental journey that guests will remember for years to come’.It explains: ‘The Indian Pacific has been traversing the country from Perth to Sydney since 1970. Prior to this, people could make the transcontinental crossing by changing trains at least five times thanks to the different track gauges used. The track standardisation project put an end to this and since then, the Indian Pacific has been rolling all the way from Sydney to Perth.‘From the vast stretch of Nullarbor to the verdant Adelaide Hills and Blue Mountains, the Indian Pacific truly showcases Australia’s diverse landscapes while crossing three time zones.",
        "‘Guests are invited to step off in mining town Kalgoorlie and Rawlinna on the Nullarbor Plain, the quirky ghost town of Cook, South Australia’s capital city, Adelaide, country town Broken Hill and the spectacular Blue Mountains.’For more information visit www.journeybeyondrail.com.au/indian-pacific.GREAT SOUTHERN - BRISBANE TO ADELAIDE",
        "The Great Southern, colloquially known as the 'summer train', journeys at up to 115kph (70mph) between Brisbane and Adelaide in December and January each year.The Great Southern's journey from Brisbane to Adelaide takes place over three nights and four days, while its return journey from Adelaide takes two nights and three days.On its 2,885km (1,792-mile) odyssey the train passes through Melbourne and Sydney and goes around two spectacular spiral loops of track - the Cougal and Bethungra spirals - where the train crosses over its own route at a different level.Passengers enjoy onboard features that include full-size bathrooms with showers, kitchens in each carriage where they can make their own tea and coffee - and all-inclusive meals, alcoholic drinks, and off-train excursions.Plus, staff provide commentary about points of interest along the way.Fares start at $2,340AUD (£1,250/$840US). For more information visit www.journeybeyondrail.com.au/journeys/great-southern.THE OVERLAND - MELBOURNE TO ADELAIDE",
        "Travelling between Melbourne and Adelaide over ten hours, The Overland is a vital link, says operator Journey Beyond, 'not only between the two capital cities, but between the rural towns it stops at including Murray Bridge, Bordertown, Nhill, Dimboola, Horsham, Stawell, Ararat, and Geelong'.",
        "Passengers enjoy reclining seats and offerings from 'Cafe 828', with those paying for a premium experience treated to all-inclusive breakfast, lunch and afternoon tea.The Overland has been running since 1887 - though known as the Intercolonial Express back then - with fares today starting from $95AUD (£50/$63US). Visit www.journeybeyondrail.com.au for more information.KURANDA SCENIC RAILWAY - QUEENSLAND",
        "Kuranda Scenic Railway passengers journey 37km (22 miles) from Cairns to the rainforest village of Kuranda via the Barron Gorge National Park.The train makes its way along track that rises 327m (1,000ft) above sea level and negotiates 55 bridges, 98 bends and 15 hand-carved tunnels.The trip from Cairns takes one hour and 55 minutes and includes a 10-minute stop at Barron Falls Station for a 'bird’s eye view' of the breathtaking Barron Falls. 'Unsurpassed views of dense rainforest and steep ravines' as the train climbs to its destination also come as standard.Must do's at Kuranda include taking a rainforest cruise on the Barron River, having a photo taken with a koala and enjoying 'spectacular' bird watching. For more information visit www.ksr.com.au. SPIRIT OF QUEENSLAND ",
        "The Spirit of Queensland transports passengers in style between Brisbane and Cairns on the east coast of Australia, a distance of 1,681km (1,044 miles).The journey takes 25 hours, but it's far from an ordeal.",
        "Creature comforts and features include in-seat entertainment screens, at-seat meal service, showers and seats that flatten into beds. There's also a Club Car with a relaxation lounge and snack bar.Stops include Proserpine - the gateway to the Whitsunday Islands - and Townsville, for the Great Barrier Reef.Ticket prices start from around £162 ($200US/$285AUD).PUFFING BILLY - VICTORIA",
        "Billed as a 'living time machine', the Puffing Billy Railway, an hour from Melbourne in the picturesque Dandenong Ranges, was built in 1900 to serve the local communities that lived in the hills, carrying anything from passengers to timber, and from livestock to potatoes.Today, it's a major tourist attraction that chugs for 25km (15 miles) through forest, rolling hills and open farmland and over iconic timber trestle bridges between Belgrave and Gembrook, with passengers able to sit on the sills of the traditional carriages with their legs hanging out - 'a true thrill for young and old'.Prices for Puffing Billy start from $31.50AUD (£17/$21US). First-class dining car tickets from $65.50AUD (£35/$43US). Free for all train ticket holders, passengers can also explore the Menzies Creek Museum – home to more than 80 railway-related exhibits. Visit puffingbilly.com.au.KATOOMBA SCENIC RAILWAY - NEW SOUTH WALES ",
        "The 310m- (1,017ft) long track at the Katoomba Scenic Railway in the Blue Mountains has a maximum slope angle of 52 degrees (128%). This incline makes the Scenic Railway the world’s steepest.",
        "And passengers can add to the thrill by adjusting their seat from a normal angle of 52 degrees to a ‘cliffhanger’ incline of 64 degrees.The less daring can opt for a ‘laidback’ angle of 44 degrees.The railway was built in the late 19th century to serve the Katoomba coal mine, but became a tourist attraction in 1945.Visit www.scenicworld.com.au/experience/scenic-railway.SPIRIT OF THE OUTBACK - BRISBANE TO LONGREACH",
        "This 26-hour, 1,325km (823-mile) journey takes passengers to and from 'the very heart of the Queensland Outback'.Queensland Rail Travel says: 'Travel the full journey ​or stop for a few days in the many towns along the way. No matter your destination, the adventure is aboard Spirit of the Outback.'The train ventures through the heritage towns of Blackwater, Emerald and Barcaldine before arriving in Longreach, home to the Australian Stockman's Hall of Fame and Outback Heritage Centre.Tripadvisor user 'Peter K' said of the trip 'overall a great train and journey', while another noted the 'excellent' meals and 'friendly and helpful staff'.For more information visit www.queenslandrailtravel.com.au/railexperiences/ourtrains/spiritoftheoutback. VICTORIAN GOLDFIELDS RAILWAY - MALDON TO CASTLEMAINE ",
        "A journey on the Victorian Goldfields Railway in Victoria is a glorious journey back in time, with passengers riding in steam-hauled carriages dating back to 1919 and the 1920s.The trip, between Castlemaine and Maldon, takes around 45 minutes, with those in first class treated to a full bar and refreshment service.It's also possible, for an additional payment, to ride in the cab.Fares start at $16AUD (£8.50/$10.65US). Visit www.vgr.com.au.THE Q TRAIN -  VICTORIA",
        "All aboard one of Australia's most mouthwatering rail experiences - The Q Train.This fine-dining restaurant on wheels runs from, and returns to, Drysdale Railway Station, south-west of Melbourne, trundling along the Bellarine Railway on the Bellarine Peninsula as passengers tuck into five-course meals.It's 'a gastronomical journey unlike anything else you have experienced', boasts The Q Train website. Prices for The Q Train start from AUS$139 (£75/$93US) per person for Q Class dining and $189AUD (£102/$127US) per person for first class dining. THE COCKLE TRAIN - SOUTH AUSTRALIA",
        "The Cockle Train in South Australia travels between Goolwa and Victor Harbor along the oldest steel-railed railway in the country, dating back to 1854 when it was constructed to provide a link between the River Murray and the ocean wharfs at Port Elliot and later at Victor Harbor.In the early days of settlement, the local residents would take a horse-drawn train to Goolwa to collect cockles to be used for bait from the sandy beaches near the Murray mouth. It was a great day's outing and thus the train gained its name.The Cockle Train commences its daily run from Goolwa Station (an hour and 15-minute drive from Adelaide). It takes in Port Elliot station, which is operated by the National Trust and features a small historical museum, before following the Fleurieu Peninsula coastline, offering perfect views of the Southern Ocean. In winter, look out for southern right whales in the water.The Cockle Train ends its journey in Victor Harbor. Return round trip fares cost from $32.50 per adult (£18/$22US). Visit www.steamrangerheritagerailway.org/our-trains/cockle-train.THE SAVANNAHLANDER - QUEENSLAND",
        "The Savannahlander is one of the great rail journeys in Australia, yet also one of the lesser known.This unique Outback rail experience departs Cairns weekly, winding its way at a sedate pace, between 25kph (15mph) and 60kph (37mph), through the wet tropics area of the Kuranda range and out through Savannah country to Forsayth and back.Highly personalised, passengers enjoy the tour alongside drivers in 1960’s classic ‘silver-bullet’ railmotors. You may even meet Will Kemp, a zookeeper turned train driver who is constantly commended for his outstanding customer service – his commitment to the job is such that he has the Savannahlander logo tattoo on his arm.Visit savannahlander.com.au.WEST COAST WILDERNESS RAILWAY - TASMANIA ",
        "The extraordinary West Coast Wilderness Railway in Tasmania takes passengers on a breathtaking ride along a 19th-century line that passes through glistening rainforest and Instagram-baiting gorges.The trip is made extra memorable by an ascent up one of the steepest sections of track in the Southern Hemisphere, the journey up the one-in-16 gradient aided by a rack-and-pinion system.Tours depart from Queenstown Station, with fares from $120AUD (£64/$79US) per adult for a half-day tour. Visit www.wcwr.com.au.For more on everything that Australia has to offer visit www.australia.com/en-gb. "
    ]
}