{
    "articleURL": "/wires/ap/article-12043413/Juventus-Vlahovic-end-negative-streaks-win-Lecce.html",
    "content": [
        "ROME (AP) - Lazio kept Napoli from sealing the Serie A title for at least another day by beating Sassuolo 2-0 on Wednesday.",
        "The result means that Napoli needs a point at Udinese on Thursday to win its first Italian league title since Diego Maradona led the club to its only two championships in 1987 and 1990.Felipe Anderson put Lazio ahead early with one touch following a ball over the top from Marcos Antonio and then Toma Basic doubled the Roman club's advantage in stoppage time by finishing off a counterattack.Lazio moved within 15 points of runaway leader Napoli and back into second place ahead of Juventus, which beat Lecce 2-1 earlier.Relegation-threatened Cremonese held Champions League semifinalist AC Milan 1-1 at the San Siro, where Junior Messias scored a late equalizer for the Rossoneri after David Okereke had put the visitors ahead.Inter Milan, which will face Milan in the Champions League semifinals, routed relegation-threatened Hellas Verona 6-0 with braces from Edin Dzeko and Lautaro Martinez.",
        "Also, Roma was held to a 1-1 draw at Silvio Berlusconi´s Monza.Stephan El Shaarawy put Roma ahead early following a goalkeeping blunder but Luca Caldirola equalized for Monza before the break with a difficult volley following a free kick.VLAHOVIC ENDS DROUGHTDusan Vlahovic ended a long scoring drought with the decisive goal and Juventus ended a five-match winless streak across all competitions with its victory over visiting Lecce.",
        "Vlahovic scored before the break to end a run of 773 minutes without a goal in the Italian league. And the Serbia international did it in style, using a half-volley from the edge of the area to find the target.Leandro Paredes had given Juventus an early lead with a free kick around Lecce´s wall before Assan Ceesay converted a penalty to equalize for Lecce.Danilo nearly added another for Juventus with a header off the post.Juventus hadn´t won since beating Sporting Lisbon in the first leg of the Europa League quarterfinals on April 13.DIA'S DAYBoulaye Dia scored a hat trick for Salernitana but Cristiano Biraghi scored a late equalizer for Fiorentina in a wild 3-3 draw.It´s been a big few days for Dia, who also scored an equalizer at Napoli on Sunday in a regional derby to prevent the title celebration. The Senegal forward now has 15 goals in his debut season in Italy.Also, Atalanta beat Spezia 3-2 with goals from Marten de Roon, Davide Zappacosta and Luis Muriel; and Alessandro Buongiorno and Pietro Pellegri scored for Torino in a 2-0 win at last-place Sampdoria.___Andrew Dampf is at https://twitter.com/AndrewDampf___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}