{
    "articleURL": "/sport/boxing/article-12055767/Canelo-Alvarezs-steps-boxings-biggest-star-avenge-loss-Dmitry-Bivol.html",
    "content": [
        "Alvarez called out Dmitry Bivol after beating John Ryder by unanimous decisionPromoter Eddie Hearn has previously said that he could face David BenavidezDailyMail.com provides all the latest international sports news Canelo Alvarez wasn't shy about calling out light heavyweight champion Dmitry Bivol following Saturday's title defense over 168-pound challenger, John Ryder. ",
        "'Everybody knows, we want Bivol,' Alvarez said in the ring after his unanimous-decision win over Ryder on Saturday in his native Guadalajara. 'If the fight with Bivol don’t happen, then we’ll see.'Promoter Eddie Hearn previously said that Alvarez could face David Benavidez at super middleweight, where the undefeated American recently defended his WBC interim title over Caleb Plant.But Canelo is clearly more focused on Bivol, and is eyeing September 16 - Mexican Independence Day - for a rematch with the undefeated Russian (20-0, 11 KOs).The catch? Boxing's biggest superstar wants to fight again at 175 pounds, where the Bivol easily beat Alvarez one year ago: 'Yes, same rules, same terms, same everything.'",
        "While Alvarez would likely stand a better chance at super middleweight, there is some logic to his desire to fight at 175 pounds.  He's more interested in putting Bivol's lightweight crowns on the line rather than his own array of 168-pound titles. 'I want the same terms, the same everything as the last fight,' Canelo told ESPN on Thursday. 'I think I'm better than him -- that's it,' he said. 'If you see the first five rounds, six rounds, I dominate the fight. But then I get tired, of course, because I don't train at my 100 percent.'",
        "But while Alvarez wants to fight Bivol again at 175, the Russian seems disinterested in defending his light heavyweight title. Instead, he wants to fight for Alvarez's 168-pound titles. ",
        "'Why should I even do the rematch at 175?' he asked ESPN. 'What is the challenge or what is the motivation for me if I've already beaten him at that weight class? 'And I don't think we should worry about who thinks what. It's really about what we want, what each of us wants. And I think he wants to win, and if he can win, he might have a better chance at 168 because he said that that's his weight class. And for me, there should be some motivation and some challenge.'Alvarez has battled a left wrist injury since knocking out Caleb Plant in 2021. He has since undergone surgery, giving Alvarez confidence he can beat Bivol at light heavyweight.When asked about his wrist after Saturday's fight, Alvarez said it felt 'very good,' adding, 'I'm ready for everything.'"
    ]
}