{
    "articleURL": "/wires/pa/article-12039709/Royal-Mail-unveils-four-decorated-postboxes-UK-celebrate-coronation.html",
    "content": [
        "Royal Mail has unveiled four specially decorated postboxes across the UK to mark the coronation.",
        "The boxes – in Westminster, central London; Edinburgh; Cardiff; and Hillsborough, Northern Ireland – display the occasion’s official emblem.",
        "The Westminster postbox is situated close to Westminster Abbey where the coronation will take place on Saturday.Royal Mail is also commemorating the coronation with four new stamps, depicting the King being crowned and celebrating the multi-faith and biodiversity causes Charles has made his life’s work.",
        "The set is based on newly-commissioned wood engravings by artist Andrew Davidson, and one imagines St Edward’s Crown being lowered on to Charles’s head by the Archbishop of Canterbury at the moment of coronation.Royal Mail is also applying for a special postmark to be stamped on letters in honour of the royal occasion.It will read: “Coronation of Their Majesties King Charles III and Queen Camilla 6 May 2023”, and run from April 28 until May 10.David Gold, director of external affairs and policy at Royal Mail, said: “The coronation of their majesties King Charles III and Queen Camilla is a momentous occasion and one that will be celebrated across UK.",
        "“We are proud to mark such a historic event and to offer our warmest congratulations to the King and Queen.”Culture Secretary Lucy Frazer said: “The coronation of Charles III is going to be a huge historic moment for the UK and one that will be celebrated with a weekend packed with different ways for people to get involved.",
        "“Our postboxes are recognised the world over as an iconic symbol of Britain and these four iconic unique coronation postboxes will leave a lasting royal legacy in London, Cardiff, Edinburgh and Royal Hillsborough.”"
    ]
}