{
    "articleURL": "/femail/article-12056995/Difficult-times-pass-ANGELA-GRIFFIN-reveals-one-lesson-shes-learned-life.html",
    "content": [
        "Angela Griffin, 46, lives in London with her husband and their daughtersREAD MORE: Angela Griffin enjoys a family night out with daughter MelissaAngela Griffin, 46, has starred in some of our favourite TV dramas, including Coronation Street, Holby and, currently, Waterloo Road. She lives in London with her husband, Jason Milligan, and their daughters Tallulah, 18, and Melissa, 15.",
        "DIFFICULT TIMES ALWAYS PASS Everything changes, so you've just got to enjoy the moment when it's good and be patient when it's bad. It's a lesson I've been reminded of many times since I got my first big break in Coronation Street when I was 16 — that even when you're riding high and thinking 'I've made it', there will be a point when you think you'll never work again.When I started on Corrie in 1992, it felt amazing. The most unbelievable thing was being invited to premieres — my first was Under Siege with Steven Seagal. Then Robbie Williams gave me Best Newcomer Award at the National Television Awards in 1995. I'm from a council estate in Leeds and my previous job was at Burger King.It was so exciting. Then I wanted a change and in 1999 I moved to London for Holby City. They were heady days. I moved into a flat opposite Liam Gallagher and met my two best friends, Nicola Stephenson and Lisa Faulkner, on Holby. We went to the opening of an envelope and we were all over the newspapers.",
        "I wish I'd appreciated that time more as a free and single young woman, because things changed.When I left Holby and started auditioning for really great jobs, they didn't want someone who'd been in a soap. It was hard being on a high of having constant work for six years then not getting work and feeling pigeonholed.",
        "I had the same experience with men. I split up with someone I was utterly in love with and thought I'd never fall in love again or have children. Everything changed when I fell for my husband aged 27. Our first date lasted 72 hours. Nine months later I was pregnant!The hardest lesson was having 15 months out of work. I'd finished Mount Pleasant for Sky in 2012 and did a couple of documentaries and a chat show, then the phone stopped ringing because I was seen as a presenter, not an actress. It was a real shock and I needed people telling me that it would pass. And it finally did when I got a role in One Man, Two Guvnors in the West End.Angela stars in Irvine Welsh's drama Crime, which premieres on May 11 on ITVX.Interview: Vicki Power"
    ]
}