{
    "articleURL": "/wires/ap/article-12039469/Another-woman-threw-drink-US-Rep-Matt-Gaetz-Florida.html",
    "content": [
        "MIRAMAR BEACH, Fla. (AP) - Two women have now been accused of throwing drinks at U.S. Rep. Matt Gaetz.",
        "The most recent was Saturday, when Selena Chambers, 41, of Tallahassee, threw a glass of wine at the Republican congressman during an event in Miramar Beach and shouted obscenities at him, the Walton County Sheriff´s Office said in a Facebook post.\"We cannot allow an environment where you can throw things at elected officials because you don´t like them,\" Sheriff Michael Adkinson said in a statement. \"No matter your political affiliation, this is not the way to conduct yourself and will not be tolerated in Walton County.\"Miramar Beach is about 50 miles (80 kilometers) east of Pensacola and is part of Gaetz's Florida Panhandle congressional district.Chambers was charged with battery and released Sunday on $1,000 bail.Defense attorney Matthew A. Karp said in an email that his own investigation has revealed that Gaetz and his group were engaged in a verbal altercation with a group of women at the South Walton Beaches Food &amp; Wine Festival.",
        "\"This investigation has initially shown Rep. Gaetz to have been both an aggressor and agitator, and we look forward to taking his deposition,\" Karp said. \"My client, Selena Chambers, maintains her innocence in this matter, and we intend to vigorously defend against the allegations of Rep. Gaetz.\"In 2019, another woman was previously sentenced to 15 days in federal custody for throwing a sports drink at Gaetz. Amanda Kondrat´yev was part of a group protesting outside a town hall meeting at a Pensacola restaurant. A cup struck Gaetz in the back as he left the meeting, and several witnesses identified Kondrat´yev as the person who threw it.",
        "Gaetz, first elected to Congress in 2016, is known for his strong support of former President Donald Trump and his membership in the arch-conservative Freedom Caucus in the House. Earlier this year, Gaetz announced that the Justice Department had decided not to file charges against him following a long-running sex-trafficking investigation."
    ]
}