{
    "articleURL": "/tvshowbiz/article-12048769/Home-Aways-Ada-Nicodemou-makes-shock-scenes-confession-popular-soap.html",
    "content": [
        "She's a Home and Away fan favourite.",
        "But Ada Nicodemou, who has played Leah Patterson-Baker for 23 years on the beloved Channel Seven soap, says she often doesn't have the chance to actually watch the show.Ada, 45, made the awkward confession during a recent live Instagram Q and A.The mother-of-one went on to explain that Home and Away's 7pm time slot clashes with bed time for her 10-year-old son, Johnas. 'I’m actually terrible if someone comes and asks me a storyline question that I’m not in. I struggle sometimes as I don’t get to watch it as often as I like,' Ada said.",
        "Elsewhere during the chat, Ada dodged questions about whether her character Leah would finally tie the knot with on-screen boyfriend, Justin played by the hunky James Stewart.Not about to give away any spoilers Ada told viewers: 'I dunno, do you want Leah and Justin to get married? What do you think? Give me your thoughts.'Ada also revealed that her favourite place to film in the series was the Pier Diner, which is actually a stage set.Meanwhile, the popular actress added that did not like filming on the 'Morgan House set', where her character lives with boyfriend Justin.'I know this is really controversial but I hate the Morgan house, ‘cause I feel like I can’t do a lot in the kitchen.",
        "'And I don’t like the furniture either. I just wish it was like, prettier or something.\"'I think it needs to be more Leah-fied,' she explained.",
        "Last May, Ada delighted her fans with a charming throwback photo.Taking to Instagram, Ada stunned fans with a snap from her childhood.The cute photo showed the Home and Away fave smiling as a young girl in her school uniform.  Her brown locks were completely different to her glossy straight hair now, as she sported a natural curly look with a small feathered fringe."
    ]
}