{
    "articleURL": "/tvshowbiz/article-12044227/Andy-Allens-interview-Jock-Zonfrillo-hours-death.html",
    "content": [
        "A heartbreaking interview surfaced of Andy Allen gushing over his close friend and fellow MasterChef judge Jock Zonfrillo just hours before hearing about his death.",
        "The Scottish-Australian chef was found dead by police at a hotel on Lygon Street in Carlton, Melbourne, at about 2am on Monday. He was 46.Allen, 35, who is a MasterChef winner-turned-judge, spoke highly of his friend on Sunday on the TV Reload podcast, hours before Zonfrillo's body was found. He revealed the pair didn't meet until Channel Ten announced the show's new judging line-up in 2019, with their first season together airing in 2020.Allen said he, Melissa Leong and Zonfrillo all brought something different to the judging table which helped them mesh together well as co-hosts and friends behind-the-scenes.  ",
        "'I feel like I can really relate to what the contestants are going through, and also give quite relatable feedback as well,' he said.'I think that's where Jock, Melissa and myself are such a great combination is that we really compliment each other.'It comes after a devastated Allen broke his silence on Tuesday following the tragic death of his MasterChef Australia co-star and longtime friend Zonfrillo.",
        "In a gut-wrenching Instagram post on Tuesday, Allen, 35, spoke of how his life will never be the same again after losing his mentor and confidante. The post was accompanied by photos of Allen and Zonfrillo laughing and smiling on the set of MasterChef, posing on the red carpet with their wives, and spending time together outside of work.",
        "Allen also shared a heartbreaking video of Zonfrillo dressing his son Alfie in a chef's apron.",
        "'When I met you 5 years ago I knew our lives were about to change forever. What I didn't realise is how close Alex [Allen's wife] and I would become outside of the kitchen with you, Lauren [Zonfrillo's wife] and your kids,' Allen began his post.He went on to praise Zonfrillo for being such an inspiring force both as a culinary maestro and as a friend.'Sure, you've taught me so much about food, but it's the lessons I learnt about what it means to be a great father, husband and friend that I'll take away from our time together and will last forever,' he continued.Allen, who won MasterChef in 2012 before host the show from 2019 alongside Zonfrillo and Melissa Leong, expressed how much he will miss his mate and their time on-set together. ",
        "Zonfrillo is believed to have died of natural causes and nothing unusual or suspicious was discovered in the hotel room where he was found dead, Daily Mail Australia understands.The celebrated chef was found dead by police at Zagame's House hotel in Melbourne at about 2am on Monday, just metres away from his former inner-city home in Carlton.",
        "Zonfrillo had left his family behind in Italy, where they had recently emigrated, to return to Australia for the launch of the new season of the hit cooking show.Daily Mail Australia can reveal that when the police entered the hotel room to conduct a welfare check, officers believed that Zonfrillo had died of natural causes and didn't find anything that suggested otherwise.There was also no drug paraphernalia found in the hotel room, sources said.It will now be for the Coroner to determine the celebrity chef's specific cause of death."
    ]
}