{
    "articleURL": "/news/article-12044159/Navy-SEAL-killed-Bin-Laden-angry-Pentagon-using-drag-queen-recruitment-program.html",
    "content": [
        "Navy SEAL Robert O'Neill who took part in the mission to kill Osama Bin Laden is outraged over the U.S. Navy using a drag queen for a recruitment program'I can't believe I fought for this bulls**t,' O'Neill tweeted on Wednesday The vet was referencing the Navy's use of Yeoman 2nd Class Joshua Kelley, a drag queen who announced in November an ambassadorship with the NavyA Navy SEAL who took part in the mission to kill Osama Bin Laden says he was outraged over the U.S. Navy using a drag queen for a discarded recruitment program. ",
        "Robert J. O'Neill, a decorated combat veteran who served for eight years as a member of SEAL Team Six, said on Twitter he 'can't believe [he] fought for this bulls**t.''Alright. The U.S. Navy is now using an enlisted sailor Drag Queen as a recruiter,' he wrote. 'I'm done. China is going to destroy us.'O'Neill was referencing Yeoman 2nd Class Joshua Kelley, whose stage name is Harpy Daniels, who announced on TikTok in November that she would be the Navy's first 'digital ambassador.' Kelley was tasked with highlighting her journey from performing on board beginning in 2018 and growing to become an 'advocate' for those who 'were oppressed for years in the service.'A Navy spokesman told DailyMail.com the digital ambassador program was a pilot that ended in March 2023.",
        "The program Kelley was part of ran from October 2022 to March 2023 and was designed to 'explore the digital environment to reach a wide range of potential candidates' for military recruitment. After O'Neill sent out his tweet Wednesday afternoon, others chimed in to share in O'Neill's outrage over the ambassadorship. His tweet quickly gained 1.1 million views and thousands of likes and retweets. 'As a Navy veteran, I am ashamed on behalf of the US Navy. I hope that goes over as well as Bud Light did,' one person responded.",
        "'This is beyond disturbing. I’m a former military officer and I just can’t believe what our brass is doing,' another added. 'An insult to every veteran and their families. My dad just rolled over in his grave at Arlington. I'm so glad he didn't have to see this happen,' a woman wrote. Others strongly disagreed with O'Neill's sentiments, however, calling him out for his statements.'Honor, Courage &amp; Commitment ,, I stand with the US Navy &amp; their choice,' one woman who identified herself as a veteran commented under O'Neill's post. 'Local man angry that he fought for freedom of expression,' another wrote. 'Can’t believe you fought to uphold the freedoms of citizens to be free to live however they choose? You did read the Constitution you swore an oath too right? Or did you skip the terms and conditions just to join?' one man said. ",
        "While the campaign was active, Kelley was one of five digital ambassadors. Many have since compared her to Dylan Mulvaney, the trans activist whose association with Bud Light sparked a PR crisis for the brand. Kelley has a large following on TikTok where she has been sharing videos of her drag performances on-board Navy ships for years. The outrage over the now discarded program comes as the military is predicted to miss its recruiting targets for the 2023 fiscal year. ",
        "The Military Times reported last month  the U.S. Navy, Air Force, and Army are all on track to fall short by 'thousands' of recruits.The Navy specifically is looking at a shortcoming of some 6,000 members. The Army is set to be off by around 10,000 while the Air Force is projected around 3,400."
    ]
}