{
    "articleURL": "/wires/ap/article-12047303/Oakland-teachers-union-strike-district-says-schools-open.html",
    "content": [
        "OAKLAND, Calif. (AP) - More than 3,000 teachers and other workers in the Oakland Unified School District went on strike Thursday, saying the district failed to bargain in good faith on a new contract that asks for more resources for students and higher pay for employees.",
        "The district's 80 schools remained open for the roughly 34,000 students, and office staff were tapped to \"educate and supervise\" the students, administrators said.The teachers union, the Oakland Education Association, called a strike late Wednesday, demanding higher wages, smaller classes, more guidance counselors, improved services for students with disabilities, additional mental health help for students still recovering from the COVID-19 pandemic, and support for Historically Black Community Schools.\"Oakland´s teachers are the lowest paid in the Bay Area and have not had a new contract since prior to the pandemic,\" the union said in a statement. \"Meanwhile, rising inflation and a steep rise in the cost of rent in the fast-gentrifying city is making it impossible for educators - especially new teachers at the bottom of the salary scale making $52,905 per year - to afford rent.\"The district is the second-largest school district in the Bay Area, where rents and housing prices have skyrocketed in recent years. The average rent for a one-bedroom apartment in Oakland is more than $2,500 and the average cost for a house is more than $900,000.\"I grew up in Oakland. I went to school in Oakland, I graduated from Skyline High and I´m back to teaching at Skyline High. I´ve seen firsthand the turnover rates among teachers,\" said Chris Huerta, a striking teacher at a rally Thursday outside Oakland City Hall.",
        "\"Teachers keep leaving as well, and it´s like it has a lot to do with pay, but also a lot to do with resources for students,\" he added.District Superintendent Dr. Kyla Johnson-Trammell said the breakdown in negotiations comes from the union expecting the district to solve societal issues that should be addressed by everyone in the community.\"OEA´s vision of the common good is about us, the district, attempting to singularly solve complex societal realities, such as homelessness, that go far beyond the scope of what public schools can and should do alone,\" she said.The district said in a statement schools will be open \"but it will not be a typical school day.\" A note to parents said school meals would continue to be served and all state and federally funded after-school programs would go on being held.Teachers previously held a one-day walkout against the Oakland district on April 29, 2022. In 2019, educators struck for a week and won an 11 percent pay raise.In Los Angeles, tens of thousands of school workers supported by teachers staged a three-day strike in March to demand higher wages and better working conditions. The LA Unified School District quickly reached a deal with the Service Employees International Union, which represents bus drivers, cafeteria employees and other service workers, and members ratified the pact last month."
    ]
}