{
    "articleURL": "/wires/reuters/article-12049729/Global-gold-demand-fell-quarter-2023-WGC-says.html",
    "content": [
        "LONDON, May 5 (Reuters) - Global gold demand fell in the first three months of 2023 as large purchases by central banks and Chinese consumers were offset by reduced investor buying, the World Gold Council (WGC) said on Friday. Total demand amounted to 1,081 tonnes, down 13% from the first quarter of 2022, the WGC said in its latest quarterly demand trends report. Around half of gold demand comes from jewellers, with investors and states responsible for most of the rest. Bullion is seen as a safe asset and investors often buy more during times of economic instability. Demand shot to an 11-year high in 2022 thanks to the biggest central bank on record. Gold prices, meanwhile, are near record highs above $2,000 an ounce. Among the bright spots during the first quarter, central banks bought 228 tonnes of gold, more than in any January-March period in data going back to 2000, the WGC said. China's jewellery demand was 198 tonnes, the most for any quarter since Q1 2015, as the end of COVID-19 controls unleashed consumer spending. U.S. buyers worried about banking and economic turmoil meanwhile bought 32 tonnes of gold bars and coins, the highest in any quarter since 2010. On the other hand, purchases of gold bars and coins fell in Europe, Indian jewellery demand slipped to a three-year low and exchange traded funds (ETFs) storing bullion for investors sold gold, the WGC said. Investment demand was already picking up in March as bank failures spread fear through markets and analysts anticipated the end of U.S. interest rate increases. The WGC said investment demand would likely grow this year and central bank buying would remain strong, albeit below last year's high. However, stockpiling by investors is likely to make gold more expensive, which could reduce demand in countries like India where consumers are often put off by high prices, said WGC analyst Krishan Gopaul. Following are numbers and comparisons. QUARTERLY GOLD DEMAND (tonnes)* Q1'23 Q4'22 Q1'22 Month on Year on month % year % change change Jewellery fabrication 508.6 601.3 516.4 -15% -2% Technology 70.0 72.3 81.0 -3% -13% - of which electronics 56.0 58.0 66.2 -3% -15% - other Industrial 11.6 11.9 12.0 -3% -3% - dentistry 2.4 2.4 2.7 -2% -12% Investment 273.7 250.6 558.4 9% -51% - of which bar and coin 302.4 340.3 287.7 -11% 5% - ETFs &amp;amp; similar products -28.7 -89.6 270.7 -68% -111% Central banks &amp;amp; other inst. 228.4 378.6 82.7 -40% 176% GOLD DEMAND 1,080.8 1,302.8 1,238.5 -17% -13% OTC and other 93.6 -69.7 -73.3 -234% -228% TOTAL DEMAND 1,174.4 1,233.2 1,165.1 -5% 1% * Source: World Gold Council, Gold Demand Trends Q1 2023 (Reporting by Peter Hobson; Editing by Toby Chopra)"
    ]
}