{
    "articleURL": "/debate/article-12048635/MARK-ALMOND-Invitation-brutal-puppet-master-chill-lover-freedom.html",
    "content": [
        "Some weddings have a nightmare guest who casts a shadow over the celebrations.",
        "And as the Coronation is a kind of marriage ceremony between King Charles and his people in the sight of God, it comes as no surprise to find that it has just such a figure – his name is Han Zheng.Communist China’s decision to send the man most responsible for the crackdown on pro-democracy campaigners and Press freedom in Hong Kong looks like a calculated snub to Charles III and this country.And Lord (Chris) Patten, the last governor of Hong Kong, is absolutely right not to join the Establishment’s conspiracy of silence over Beijing’s choice of the head of its delegation to the Coronation celebrations.After all, it was Patten who oversaw the handover of Britain’s former colony to Beijing in 1997 based on the principle of ‘one country, two systems’, a system negotiated by Margaret Thatcher 13 years earlier that was designed to protect the democratic rights of its residents.",
        "In the quarter-century since, those rights have been comprehensively trashed and the architect of this policy was Han.In the five years following his appointment as chairman of the Central Coordination Group on Hong Kong and Macau Affairs in 2018, this bespectacled, 69-year-old apparatchik presided over a brutal crackdown that saw no fewer than 150,000 Hong Kong citizens seek asylum in this country.",
        "Within a year of Han basing himself in a villa in Shenzhen, a vast metropolis on China’s border with Hong Kong, he had proposed an extradition Bill that could have allowed Hong Kong suspects to be sent for trial in China, a move that triggered widespread pro-democracy protests.More than a million people took to the streets in June 2019, and the authorities responded by detaining over 10,000 demonstrators, many of them students, while 15 protesters were killed and thousands injured.In the wake of this unrest, China passed a national security law that undermined Hong Kong’s autonomy and made it easier to prosecute protesters. And if Carrie Lam, Hong Kong’s then-chief executive, was the public face of the crackdown, Han was the puppet master behind the scenes.‘This kind of extremely violent, destructive activity would not be tolerated or accepted in any country or society in the world nowadays,’ Han said at one meeting with Ms Lam, who was under instructions to refer all decisions relating to the protests to his office.As the man who served nine years as mayor of Shanghai, China’s key foreign trade hub, Han mastered the art of how to muzzle rather than kill the geese that laid the golden eggs. That’s the strategy he set in motion in Hong Kong after he took charge of Beijing’s policy there. And while his actions attracted widespread international condemnation, many Western corporations failed to speak out.",
        "The behaviour of banks such as HSBC has been particularly shameful.At the behest of Beijing, it has frozen the accounts of activists and human rights groups, allowed the creation of Chinese Communist Party teams at its headquarters, and even taken ‘hostage’ the pension assets of 96,000 Hong Kong citizens who moved to the UK, according to the Wall Street Journal.Apologists for Han present him as an elder statesman, who was moved sideways last October from the Politburo to the largely ceremonial role of vice president.But the idea that he performs a benign role on the international stage, like some Chinese version of Princess Anne, couldn’t be further from the truth. Indeed, he is said by some to be the eighth most powerful man in the country.And China’s status as the West’s most menacing rival superpower shouldn’t be a reason to kowtow when its imperious ruler, Xi Jinping, sends as his representative to the Coronation the living embodiment of someone bent on rejecting the freedoms which our monarch swears to uphold.In this context, Han’s Coronation invitation tells Beijing that we are too much in thrall to its economic might to confront it. And that will send shivers down the spines of freedom-loving people everywhere.Mark Almond is director of the Crisis Research Institute, Oxford"
    ]
}