{
    "articleURL": "/tvshowbiz/article-12046667/Big-Brother-star-Sophie-Budack-welcomes-child.html",
    "content": [
        "Sophie Budack has welcomed her first child in the Netherlands. ",
        "The former Big Brother Australia star announced the news Thursday evening by sharing a two images of her newborn son to her Instagram story.In the first black-and-white picture, the little one's head is partially visible and wrapped in what appears to be a beanie. In the second, Sophie, 29, is seen tenderly cradling her little man in full glorious colour in hospital. She captioned the snap: 'Henry Ellis 04.05.2023.' Sophie announced she was pregnant in October with her boyfriend Rutger, who she has been dating since the start of 2021. ",
        "In July 2021, Sophie revealed she had found love once again after splitting from winning housemate Chad Hurst.'Oh, he's amazing! His name is Rutger and he's my perfect match,' the former gymnast told Daily Mail Australia.'Since Big Brother, I spent the last year concentrating on me and wasn't looking for love, but when love literally walks through your door, there's nothing you can do,' she added. Sophie and Rutger had been dating for several months at the time, but the athlete-turned-influencer wanted to wait before announcing the romance.While little is known about Rutger, Sophie said they were introduced by her younger sister Yasmin and 'from the first night we met there was an instant connection'.Sophie, who was raised in Australia, split with Chad after she relocated to Europe in 2020.",
        "She previously said of their break-up: 'A lot of people will be asking about myself and Chad but there are some elements of my life I want to keep private.'For now, I am just taking it one step at a time and looking at the positives. At least now I can show you the other side of the world and a bit more of me.'Chad and Sophie were last pictured together two days after he won the $230,000 cash prize when they went for a walk around Sydney's Bondi Beach."
    ]
}