{
    "articleURL": "/tvshowbiz/article-12056957/Hugh-Bonneville-arrives-King-Charles-star-studded-Coronation-concert.html",
    "content": [
        "Hugh Bonneville cut a smart figure as he arrived at King Charles' star-studded Coronation concert in Windsor on Sunday night.",
        "The Downton Abbey star, 59, will be hosting the huge event that will see  performances by Katy Perry, Take That, Lionel Richie and Nicole Scherzinger of The Pussycat Dolls.Hugh looked dapper in a three-piece green suit which was teamed with a crisp white shirt.He completed the look with shiny black shoes and looked in great spirits ahead of the big night. Also arriving on the red carpet were Cold Feet star James Nesbitt, rocker Steve Winwood and blind pianist and winner of Channel 4's The Piano Lucy Illingworth, 13. ",
        "Ahead of the hosting Hugh said on BBC Radio 2: 'It's very exciting and I have no idea how to do it! The BBC called me and asked if I was free and I didn't know it was this!'I didn't realise how big it would be! It's a huge back garden. It is a real reflection of the King's interest as well as some great music. I have seen some rehearsal.'I had a sneak peak to watch Take That rehearse the finale earlier. And it is going to be fantastic!'  The King and Queen of the royal family will join around 20,000 members of the public at the Coronation Concert to continue the celebrations after their crowning at Westminster Abbey on Saturday.",
        "The Coronation Concert will see performances by Paloma Faith, Olly Murs and veteran rock guitarist Steve Winwood.The show in Windsor, which will be hosted by Downton Abbey and Paddington star Hugh, will start at 8pm on Sunday May 7.Buckingham Palace has promised 'global music icons and contemporary stars' for the big concert.It is certainly set to be the highlight of the second day of coronation celebrations with around 20,000 members of the public are expected to attend.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video.The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.",
        "Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, will also perform.Meanwhile, fashion designer Stella McCartney will deliver a spoken word performance with a conservation theme which will reflect her and the King's 'shared passion for environmental sustainability', the BBC has said.",
        "Her performance will be part of a broader nature-themed section of the concert which will also include a rendition of a 1980s hit by classical-soul composer Alexis French and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir.Bollywood star Sonam Kapoor will also deliver a spoken-word performance.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.The concert will be broadcast on BBC One, BBC iPlayer, BBC Radio 2 and BBC Sounds.",
        "Former Desert Island Discs and Crimewatch presenter Kirsty Young will anchor the special live broadcast of the concert in the grounds of Windsor Castle after reporting from a studio at Buckingham Palace on Saturday's coronation day.The concert on the castle's East Lawn will also see TV presenter Clara Amfo and Diversity dance troupe member Jordan Banjo speaking to the artists backstage.At Saturday's coronation, King Charles and Queen Consort Camilla were officially crowned by the Archbishop of Canterbury, Justin Welby.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year."
    ]
}