{
    "articleURL": "/wires/ap/article-12054619/Taylor-Swift-returns-Nashville-reveals-Speak-Now-date.html",
    "content": [
        "NASHVILLE, Tenn. (AP) - Taylor Swift is playing catch-up with her fans this year in a massive and impressive stadium show that embraces her artistic reinventions.",
        "Nearly two months into the 52-show Eras Tour, Swift returned Friday to the origins of her musical career in Nashville, Tennessee, a city she outgrew as a country starlet destined for pop stardom.In front of 70,000 fans, Swift dropped the news that she would be releasing a re-recording of her Nashville-era 2010 record, \"Speak Now,\" on July 7.Swift started releasing new versions of her early albums in 2021, after a dispute over the ownership of the masters, which were sold to - and then by - music executive Scooter Braun. \"Speak Now,\" Swift's third album, will also be the third \"Taylor's Version\" recording - she released the re-recordings of 2008's \"Fearless\" and 2012's \"Red\" in 2021.\"Speak Now\" was an album she wrote entirely by herself and she performed one of the singles, \"Sparks Fly\" after her announcement, followed by \"Teardrops on My Guitar,\" from her 2006 self-titled debut record.The tour started chaotically with a breakdown of Ticketmaster´s ability to withstand the demand of fans, who were eager to see Swift after an extended hiatus from touring due to the coronavirus pandemic. Those who were lucky enough to get into the first of three shows in Nashville made sure to show out in their cosplay outfits inspired by Taylor´s songs, ranging from marching band geek to cardigans and cottagecore.",
        "\"I moved to Nashville nearly 20 years ago,\" she told the crowd. \"And this dream I had since I was so little I can´t even remember even first having it, this dream came true because of this town and the people in it.\"She started off the nearly 3.5-hour show with a line from \"Miss Americana &amp; The Heartbreak Prince\" as a gentle spring rain sprinkled on the crowd: \"It´s been a long time coming, but it´s you and me, that´s my whole world.\"The Eras tour theme is a natural fit for an artist whose music is often so self-referential, winking and smiling at the previous Taylors and their moments. The show is broken up into acts, not moving chronologically through her discography, but instead presenting like a house with many rooms. The color schemes, choreographed dancers and outfits support the overall feeling of musical theater, with a stage that incorporates rising platforms and hidden trap doors she can disappear through.With over 40 songs on the setlist from her 10 albums, Swift hits a lot of the highlights of her singles, ranging from \"You Belong With Me,\" \"Shake It Off,\" \"Bad Blood,\" \"Anti-Hero\" and \"We Are Never Ever Getting Back Together.\" But she also made time for special songs, like her 10-minute fan favorite \"All Too Well,\" and brought back opening act Phoebe Bridgers to perform their duet \"Nothing New,\" a vault track released on \"Red (Taylor´s Version).\"",
        "It was a five-year wait to see all the glittering chapters of Swift´s career on stage together, but the pop star´s marathon performance carried fans through to the last notes.___AP journalist Kimberlee Kruesi contributed to this report."
    ]
}