{
    "articleURL": "/wires/reuters/article-12053491/How-Turkeys-opposition-plans-roll-Erdogans-policies.html",
    "content": [
        "By Huseyin Hayatsever and Ali Kucukgocmen",
        "ANKARA, May 6 (Reuters) - Turkey's opposition alliance has vowed to reverse many of President Tayyip Erdogan's policies if elected in a May 14 election, including a return to a parliamentary democracy and economic orthodoxy, and a major shift in foreign policy.Last month Kemal Kilicdaroglu, presidential candidate of the six-party Nation Alliance, unveiled the opposition's programme for its first 100 days in power.Pledges ranged from a return to daylight saving time, tax and insurance reductions, and a merit-based recruitment system for all public servant employment.Here are details of the plan:LEGISLATIVE AND EXECUTIVE REFORMSThe main promise is a return to a parliamentary system, which the alliance says will be \"stronger\" than the one in place before a switch in 2018 to the current presidential system.It would reinstate the position of prime minister, which was abolished by Erdogan through a referendum in 2017, and make the presidency an \"impartial\" role with no political responsibility. The president's right to veto legislation and issue decrees would be abolished.The president would sever ties to any political party, only serve one seven-year term and afterward be banned from active politics.The parliament's authority to back out of international agreements would be enshrined in the constitution. It will also have more authority over planning the government budget.",
        "In public administration, boards and offices under the presidency would be abolished and their duties transferred to relevant ministries.ECONOMYThe Nation Alliance promised to lower inflation, running at 44% in April, to single digits within two years and restore the stability of the lira, which has lost 80% of its value against the dollar in the past five years.It would ensure the central bank's independence and roll back measures such as allowing the cabinet to select its governor.It would prepare legislation allowing parliament to pass laws on the central bank's mission, operational independence and high-level appointments.Policies that interfere with a floating exchange rate would end, including a government scheme that protects lira deposits against currency depreciation.It pledged to cut government expenditure by reducing the number of planes used by the presidency, the number of vehicles used by civil servants, and selling some state buildings.All projects under public-private partnerships would be reviewed. It would review the Akkuyu nuclear plant project - owned by Russian state entities - and renegotiate natural gas contracts, reducing the risk of dependence on certain countries for gas imports.FOREIGN POLICYIt would adopt the slogan of \"Peace at Home, Peace in the World\" as the cornerstone of Turkey's foreign policy.While promising to \"work to complete the accession process\" for the full membership in the European Union, the alliance has vowed to review Turkey's 2016 refugee deal with the EU.",
        "It would establish relations with the United States with an understanding of mutual trust, and return Turkey to the F-35 fighter jet programme.Turkey would maintain relations with Russia \"with an understanding that both parties are equal and strengthened by balanced and constructive dialogue.\"LEGAL REFORMSThe six opposition parties pledged to ensure the independence of the judiciary, which critics say Erdogan and his allies use to crack down on dissent, a claim denied by the government.Judges' willingness to abide by Constitutional Court and European Court of Human Rights rulings would be considered when evaluating promotions.Judges and prosecutors who cause rights violations that lead Turkey to be fined at the two courts would be made to pay the fine. Measures would be taken to ensure courts quickly implement rulings by the two high courts.The Board of Judges and Prosecutors would be reformed and split into two entities for more accountability and transparency.The structure and elections processes for higher courts, such as the Constitutional Court, the Court of Cassation and Council of State would be reformed.It would ensure that pre-trial detentions are the exception, a measure that critics say is abused under Erdogan's rule. It would strengthen freedom of expression and broaden the right to hold demonstrations. (Editing by Ece Toksabay and Jonathan Spicer)"
    ]
}