{
    "articleURL": "/travel/article-12041893/The-20-breakfast-fails-annoy-Brits-revealed-burnt-toast-overcooked-dippy-eggs.html",
    "content": [
        "The ranking has been generated by a poll of 2,000 Britons A sixth of Brits polled were happy to post their #breakfastfails to social media READ MORE: New guidebook reveals hidden gems in North East England The 20 most incendiary breakfast fails for Brits have been revealed – and burnt toast tops the ranking.",
        "In a survey of ‘very British and relatable breakfast fails’, burnt toast received 48 per cent of the vote, ‘overcooked dippy eggs’ came second with 34 per cent and ‘cremated bacon’ third with 23 per cent.Fourth was ‘soggy cereal’ (22 per cent), while 18 per cent said finding egg shell in scrambled eggs infuriated them the most.The rest of the top ten in a the poll of 2,000 Britons by the New York Bakery Co comprises ‘rock-hard butter that breaks the toast’ (17 per cent), ‘milk added to a teabag before hot water’ and ‘undercooked, flabby bacon’ in joint seventh place (16 per cent), and ‘dry scrambled eggs’ and ‘instant coffee’ in joint eighth place (14 per cent).Watery poached eggs (12 per cent), stodgy porridge (11 per cent) and being served a big slimy mushroom on the side of their fry-up (five per cent) also leave Britons disappointed.",
        "Meanwhile, one in 20 say the most annoying breakfast fail is having beans on the same plate as their fry-up, and not in a separate ramekin.Yet despite being regularly disappointed with their breakfast, 71 per cent would not dream of complaining about one that was below par, with one in three (27 per cent) insisting it is simply not the done thing.",
        "However, a sixth of Brits (16 per cent) were happy to post their #breakfastfails to social media, with hilarious results, as we’ve shown here.Even though there were plenty of complaints, two thirds (66 per cent) agree that when done well, breakfast is the best meal of the day.",
        "1. Burnt toast - 48 per cent2. Overcooked dippy eggs - 34 per cent3. Cremated bacon - 23 per cent4. Soggy cereal - 22 per cent5. Egg shell in your scrambled eggs - 18 per cent6. Rock-hard butter that breaks the toast - 17 per cent7= Milk added to a tea bag before hot water - 16 per cent7= Undercooked, flabby bacon - 16 per cent8= Dry scrambled eggs - 14 per cent8= Instant coffee - 14 per cent9= Cold baked beans - 12 per cent9= Watery poached eggs - 12 per cent10. Stodgy porridge - 11 per cent11= UHT milk in little packets - 10 per cent11= Slimy egg white on your fried egg - 10 per cent12. Limp toast soldiers - 6 per cent13= Half an undercooked tomato with your full English - 5 per cent13= A big slimy mushroom with your fry-up - 5 per cent13= Beans on the same plate as your fry-up - 5 per cent14. Breakfast smothered in ketchup or brown sauce - 4 per centSource: New York Bakery Co ",
        "Making time for it is the issue, with almost half (44 per cent) saying they are usually too rushed for breakfast during the week, and 69 per cent saying it is usually a hurried, chaotic affair.According to the stats, Brits would love their weekday breakfasts to be more like their weekend ones, with eight in ten (79 per cent) preferring weekend brunches because they have more time.Alastair Unite, from the New York Bakery Co, said: ‘We know that weekday family breakfasts can be pretty chaotic. It’s something we can all relate to. Burned toast, slimy eggs and cold beans - we’ve all been there - and shared a laugh or two along the way.‘But we also know that people want to make more of breakfast. The research shows that over half of Brits wish they could spend more mealtimes together, with a further 53 per cent agreeing that some of their best memories are created over breakfast.‘There’s something special about breakfast and the feelings it creates. That’s why it’s time to ditch plain old toast and shake things up with bagels, the toast of New York.’"
    ]
}