{
    "articleURL": "/wires/pa/article-12057577/Harry-Kane-Europa-Conference-League-chance-Tottenham-end-trophy-drought.html",
    "content": [
        "Harry Kane has insisted Tottenham should view the Europa Conference League as a chance to end the club’s trophy drought if they are involved in the competition next season.",
        "Spurs remain in the hunt for European football after Saturday’s 1-0 win over Crystal Palace where Kane’s first-half header helped move them up to sixth in the Premier League.Brighton, in seventh, are still favourites for Europa League qualification given they have three games in hand and are only two points off Tottenham.A top-seven finish and therefore at least a Europa Conference League spot could be guaranteed for Spurs with victory at eighth-placed Aston Villa on Saturday but some fans have recently debated whether Europe’s third-tier tournament would be an inconvenience.The England captain disagrees and despite uncertainty over his future, Tottenham have no intention of selling the forward this summer, which means he could play in the Europa Conference League next season.“We’ve got three games left, a big game against Villa next week away,” Kane said.“Obviously Brighton have a few games in hand on us. If we can come away from this season with European football, that’s a small prize at the end of a tough season.“We’ll be fighting for that and fighting in the three games to try to pick up three wins.“Ultimately I like to play football games no matter what competition it is. That’s what you deserve from where you finish in the season.",
        "“You can’t disrespect any competition that you play in. It’s one of those, if you end up in the Conference League and win it, it’s worth it. If you don’t, then people probably look at it as an inconvenience.“But when you’ve been at a club where we haven’t won a trophy for 15 years, if we do end up in it, it could be an opportunity to try and put that to bed.”Kane’s 209th Premier League goal settled a drab contest with Palace after Tottenham kept their first top-flight clean sheet since February 26.Ryan Mason, in only his third match since replacing Cristian Stellini as acting head coach, tweaked the 3-4-3 tactics regularly used under Antonio Conte with Spurs playing with a back four out of possession.Former Tottenham midfielder Mason immediately put his name forward as a candidate to permanently replace Conte last month but Kane preferred to stay out of the managerial talk. When you’ve been at a club where we haven’t won a trophy for 15 years, if we do end up in it, it could be an opportunity to try and put that to bed  Harry Kane on the Europa Conference League  “We’re all behind him. We know the club is in a situation where I spoke about getting some of the values back. I feel like Ryan brings all those attributes,” Kane added.",
        "“He’s been here through the academy, he knows what it’s like as a fan, he knows what it’s like to play here. With that attitude and that desire, he brings a great enthusiasm to the coaching role here.“Ultimately it will be down to the chairman (Daniel Levy) and the club what they decide, but for these three games, we’re fully behind him to try to improve and to try to win and see what happens.“If I end up speaking with the chairman towards the end of the season, then I’m sure he’ll fill me in on what he’s thinking.",
        "“But ultimately we’ve got three more games, we don’t want to look too far ahead and get too carried away.“The club will make the best decision for everyone, for the players, the fans, for the club in general, so we’ll just have to wait and see what that is.”Meanwhile, Spurs midfielder Pierre-Emile Hojbjerg has acknowledged the club must do everything to keep Kane, who enters the final year of his contract this summer.Hojbjerg said: “Harry is one of those players who will be in the (record) books, in the history for a very long time.“It is important also for Harry to understand he has a big responsibility and also I think the club has a responsibility to make sure the scenario for him is the best possible.”"
    ]
}