{
    "articleURL": "/wires/ap/article-12038335/MATCHDAY-City-hosts-West-Ham-Lazio-delay-Napoli-title.html",
    "content": [
        "A look at what´s happening in European soccer on Wednesday:",
        "ENGLANDFirst-place Manchester City hosts West Ham, and striker Erling Haaland needs one goal to set a new record for the most goals scored in a Premier League season. He has 34 and shares the record with Alan Shearer and Andy Cole. City has six games remaining so it seems certain Haaland - who has 50 goals in all competitions - will set a new benchmark. \"The magnitude of a record is because for a long time it was not broken,\" City manager Pep Guardiola said. \"All records will be broken one day.\" Liverpool hosts Fulham with the fifth-placed Merseyside club looking to strengthen its bid for Europa League qualification and keep alive its slim Champions League hopes.ITALYNapoli could be crowned Serie A champion without even kicking a ball - if second-place Lazio fails to beat Sassuolo. If Lazio wins, Napoli's 33-year wait for the league title will extend at least another day when it plays at Udinese. Lazio has lost its past two matches and also needs the points to keep hold of second place. It has one more point than Juventus, which hosts relegation-threatened Lecce. Inter Milan, AC Milan and Roma are all locked on the same number of points, three behind Juve, in a tight battle for the Champions League qualifying spots. Both the Milan clubs play teams fighting for survival as fourth-place Inter visits Hellas Verona, while Milan hosts 19th-place Cremonese. Verona would move out of the bottom three with a win. Roma travels to Monza. Bottom club Sampdoria hosts Torino and Fiorentina visits Salernitana, which snatched a late draw at Napoli on Sunday to keep the Partenopei´s celebrations on hold.",
        "GERMANY",
        "Stuttgart can reach the German Cup final with a win at home over Eintracht Frankfurt in their semifinal despite fighting for survival in the Bundesliga. Only goal difference was keeping Stuttgart out of the league´s relegation zone with four rounds remaining, making it a candidate for the relegation/promotion playoff against the team that finishes third in the second division. That two-legged playoff would take place around the same time as the cup final, meaning the German soccer federation could be forced to change the schedule if Stuttgart beats Frankfurt. Frankfurt will hope to save the federation the bother by reaching its first German Cup final since 2018, when it defeated Bayern Munich 3-1 to win the competition for the fifth time. Stuttgart is going for its fourth cup title.SPAINValencia continues its fight against relegation when it hosts Villarreal in the Spanish league. Valencia entered the midweek round in 17th place, just outside the relegation zone. It has won only twice in its last seven league matches. Villarreal, which has won five of its last seven games, including the last two, is still fighting for a Champions League place. It entered the round in fifth place, five points behind fourth-place Real Sociedad. Atletico Madrid continues its chase of second-place Real Madrid when it hosts relegation-threatened Cadiz. Second-to-last-place Getafe, winless in six matches, tries to move out of the relegation zone when it hosts Celta Vigo, which has one win in six games.",
        "FRANCEBrest hosts Nantes in a match with huge relegation implications. Both clubs have 32 points but Brest is currently in the final relegation spot on goal difference. Nantes will try to bounce back from a 5-1 loss to Toulouse in the French Cup final on Saturday.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}