{
    "articleURL": "/wires/aap/article-12044931/Budget-issues-wont-influence-myki-contract-call-govt.html",
    "content": [
        "Budget constraints won't influence how Victoria fixes its ageing tap-and-go public transport fare system, the state government insists.",
        "Victoria's myki card system officially replaced Metcard tickets in 2012 and is set to expire in November.The Andrews government is considering bids for the next contract and Public Transport Minister Ben Carroll rejected suggestions it is willing to compromise on quality for the sake of the state's faltering budget.\"We're going for the best option,\" he told reporters on Thursday.\"We are looking at a modern, 21st century public transport system, where you can use your mobile phone, use your watch, use your credit card, and that's what this procurement process will deliver.\"Mr Carroll said the system would be \"on par\" with anywhere in the world once upgraded or overhauled.Train commuters in Sydney, London and Singapore are able to use their credit and debit cards to tap on and off, and Brisbane is implementing similar technology.Visitors to Melbourne must purchase a myki card and add funds to it, unlike Sydney's Opal cards which have no attached fee.Public Transport Users Association spokesman Daniel Bowen said the inconvenience, cost, lack of availability, and confusion around myki cards and top-ups is a barrier to more people using the network.\"It is therefore essential that the option of credit card fare payment is provided in the ticketing system,\" he said in a statement to AAP.",
        "\"This would largely resolve numerous problems, especially for new and occasional passengers including tourists, and iPhone users.\"Myki's creator NTT Data was given a $700 million, seven-year contract extension in 2017 despite being plagued by system failures and cost overruns.The Victorian government set aside $1m in 2019 to try to incorporate Apple technology into myki but a solution was not found.\"This will be addressed through this procurement process, where we're essentially solving a lot of problems all at one time,\" Mr Carroll said.Premier Daniel Andrews wouldn't confirm three companies remain in the running for the government tender, citing the ongoing nature of negotiations.Victoria's net debt is predicted to hit $165.9 billion by mid 2026, with annual interest repayments tipped to rise from $3.86b to $7.32b over the next four years.Those forecasts will be updated when the state budget is handed down on May 23."
    ]
}