{
    "articleURL": "/news/article-12042245/Key-flashpoints-Rishi-Sunak-faces-major-test-local-elections.html",
    "content": [
        "Rishi Sunak and Keir Starmer waiting for the verdict of voters in local electionsMore than 8,000 council seats are up for grabs tomorrow in Rishi Sunak's first major electoral test.",
        "Local elections in England should give the clearest indication yet of how the public is viewing the main parties - with perhaps a year to go until the Westminster contest.The Tories are under huge pressure from Labour in the Red Wall, as Keir Starmer's party rides high in national polls. Meanwhile, the Lib Dems are hoping to make significant gains in the South East and South West.But there are dangers for Sir Keir as well, with questions over whether Labour can turn in a performance good enough to show he is on track to enter Downing Street. The Tories are trying to limit losses to a few hundred seats, but experts say Sir Keir needs to rack up 500 gains or more.On a visit to a community group in Buckinghamshire this afternoon, Mr Sunak said: 'We've always said these are going to be a tough set of elections for us. We are concentrating on delivering on people's priorities.'Sir Keir told Labour activists on a trip to Medway: 'We desperately need change, I think you can sense that in the air.' Here are some of the key battlegrounds to look out for when the results begin arriving in the early hours of Friday morning. ",
        "NORTH WEST Bolton is likely to be a litmus test for the night, with every council seat up for grabs.",
        "Both Labour and the Conservatives are hoping to do enough to win a majority, although Sir Keir's outfit needs 12 more seats while the Tories would get over the line with five.Labour will look to rack up numbers in strongholds such as Liverpool, Manchester and Wigan. The showing in Blackpool will be watched closely, with the town currently represented by two Conservative MPs.Sir Keir is targeting a majority in Cheshire West &amp; Chester, which would require a moderate boost from the existing 33 of the 70 seats held. And in Wirral, Labour needs 10 gains to turn minority control into overall control.However, Sir Keir's party is in a dogfight to hold off the Greens' bid to become the largest party in Lancaster.NORTH EAST Labour requires just two seats to take Middlesbrough, another crucial part of the Tories' northern base. They will also seek to underline their resurgence in Sunderland, which came close to falling to the Conservatives in the 2019 general election rout. .Hartlepool, once a symbol of Boris Johnson's 'big tent' appeal with a shock by-election win in 2021, is the site of a bitter struggle between Labour and the Conservatives for overall control. They each need six gains. YORKSHIRE &amp; HUMBER The Lib Dems are defending one of their only northern outposts in Hull. The party secured the council from Labour last year, but Sir Keir's team only requires two seats to get back in the driving seat.",
        "Sheffield sees a three way deathmatch between Labour, the Lib Dems and the Greens - made more complicated by the fact that the trio are currently power sharing.Labour is pitching to dethrone the Lib Dems in York, where they have been in coalition with the Greens. The city could also be a rare spot for the Tories, who are looking to pick up seats.",
        "EAST MIDLANDS Another totemic Red Wall area, Bolsover, will give a signal of Labour's fortunes. The party is aiming to shore up a slender majority.  In Derby every seat is in play, and Sir Keir will have ambitions of ousting the minority Tory administration.In Boston, Lincolnshire - known as one of the most Brexit-supporting parts of the country - strong independent candidates could thwart the Conservatives from gaining full control.WEST MIDLANDS The Tories' 20-year dominance of Stratford-on-Avon is at risk from a Lib Dem advance. The Lib Dems would become the largest party if they take four seats from Mr Sunak's crew.Solihull is another council where the Conservatives have lost ground in recent years, but here their main challengers are the Greens.Labour will be pinning a lot of hopes on Stoke-on-Trent to show it is making progress. The area was once a stronghold for the party, but the Tories now have all three MPs and half of the councillors. ",
        "EAST The Conservatives are facing a serious threat from the Lib Dems in Brentwood. Meanwhile, Labour could stage a recovery in Thurrock - although it would be a major upset if the Tories lost control.Colchester has become a three-way tussle between the Tories, Labour and the Lib Dems. With a third of its seats in play the results here could see a shift from the current Labour-Lib Dem-Green coalition.The Greens are pushing to become the largest party in Mid-Suffolk.",
        "SOUTH EAST The Lib Dems have their fingers crossed for big advances in this region, and on a good night might even end up the biggest party overall.Ed Davey's warriors are hoping for gains in Dacorum, as well as to tighten their grip on Woking, where they secured a wafer-thin majority last year.Tories would also be alarmed by advances in spots such as Surrey Heath - where Michael Gove is the MP - and Wokingham.Labour and the Tories are going head-to-head in the ultra-marginal council of Crawley in another key contest.SOUTH WEST Here the Lib Dems are working to boost their slender advantage in Cotswold, while the Tories are mounting a revival against the yellow incumbents in Torbay.Labour only needs five gains to take charge of Plymouth. ",
        "The minority Tory administration has endured bad headlines recently for chopping down 110 healthy city centre trees overnight.Tory-run Swindon is also a target for Sir Keir. If Labour grabs control here – which means taking six of the 19 seats on offer – it will likely have performed well overall."
    ]
}