{
    "articleURL": "/tvshowbiz/article-12053327/Jessica-Simpson-shows-slender-frame-skintight-pants-steps-Los-Angeles.html",
    "content": [
        "Jessica Simpson was spotted running errands in Los Angeles.",
        "The 42-year-old Public Affair singer - who introduced her new line of handbags last week - was seen with her blonde hair down in skintight black leather lace-up pants and chunky knee-high black boots.The Entrepreneur wore chrome aviator sunglasses and hid her petite frame beneath a green hooded sweatshirt. Simpson wore a $3650 Louis Vuitton Soft Trunk crossbody, accessorized with rings on each hand and gold bracelets that extended over her middle fingers.The mother-of-three's outing comes after she released her new Jessica Simpson Collection handbags online last week.",
        "The former actress modeled her new collection with the caption, 'Ya can’t leave home without a handbag, so I say we might as well adore our shoulder statements! Our exclusive handbag launch is now up on JessicaSimpson.com!' it said in the caption.She also shared an image wearing a yellow floral print dress alongside her 63-year-old mother, Tina Ann Drew Simpson, who helps run her clothing and accessory lines.Tina appears to be aging in reverse and could pass for Jessica's sister. The Dukes of Hazzard star inscribed over the photo that she will appear on HSN soon.This comes after the mother-of-three looked her thinnest ever in a neon green two-piece from Kim Kardashian's SKIMS swimsuit line. She has very adeptly managed to go from pop singer to reality TV star to fashion designer who steers her own empire.",
        "In March of last year, the blonde bombshell landed on the cover of Entrepreneur magazine.The siren looked slender in a low-cut black suit as she flashed a Mona Lisa smile with her blonde hair parted in the middle and down her back.The Dukes Of Hazzard actress seemed proud in her caption, writing, 'Let them underestimate you! Quite possibly my most meaningful cover headline to date. Thank you @entrepreneur @francesdodds [the deputy editor of the magazine] for giving me a platform to share my Jessica Simpson Style story and seeing me for who I am.' ",
        "Then she offered some sage advice for her followers. 'Don't put too much pressure on yourself because it's never make-or-break, you know?' wrote the wife of Eric Johnson.'There's always a way to make that break. Let time move a little slower so you learn and grow along the way. Then, by the time you get there, you'll be ready.'",
        "In January Simpson said she considered borrowing money against her homes to regain ownership of her eponymous brand.The 41-year-old star and her mother, Tina, were left with a minority stake of 37.5% in the Jessica Simpson Collection when Sequential Brands Group Inc. bought a majority share in 2015, but four years later, the star wanted the lifestyle firm back.",
        "Jessica made the decision while in hospital with bronchitis, 34 weeks into her pregnancy with daughter Birdie, now two.She recalled pledging: 'We'll borrow against our homes. Even if I have to go live in a little, tiny place in Ireland, I will.'She added to Bloomberg Businessweek: 'We're ready to go into the trenches. Pay it all back and earn it ourselves.'In the time since she established the company, Jessica realized she was at the heart of what drove the firm.She said: 'At the beginning of the business, it was a lot about people-pleasing. Then we realized we actually are the leaders.'In January 2021, Jessica and Tina hired boutique investment bank Threadstone Capital LLC to arrange financing so they could buy back the Jessica Simpson Collection and the With You singer had a clear brief for them.",
        "Threadstone managing director William Susman said: 'Jessica's message since I've been involved has been very, very clear: \"I want my name. I want the control of my company.\" She views it very much as part of her identity.'The pair bought regained control of the firm in October 2021. They planned to keep all 20 of its licensees in over 30 categories, as well as expanding into new products and thinking about creating their own licensing company.",
        "Tina said: 'We want to build our own IP platform so that we can sign other people under us and our umbrella, and we will take good care of them.'Jessica - who has Birdie, as well as Maxwell, and Ace with her husband Johnson – admires the way her friend Kim Kardashian runs her business empire.She said: 'She reminds me of myself in a lot of ways: She's very vulnerable, very honest, self-deprecating, and driven. I wish I had a little bit more of her confidence.'"
    ]
}