{
    "articleURL": "/femail/real-life/article-12044865/Podcaster-Olivia-Fitzpatrick-slammed-giving-money-advice-using-900-Dyson-Airwrap.html",
    "content": [
        "Olivia Fitzpatrick chastised people for needlessly wasting money on clothes'How will you ever buy a house?' she asked  A self-proclaimed budgeting queen has been slammed online for criticising her followers' 'trivial' purchases while styling her hair with a new $900 Dyson Airwrap.  ",
        "Olivia Fitzpatrick, who is a teacher, was lecturing her followers about budgeting in order to afford a house when she became a target.The 29-year-old recently made a video where she slammed shoppers for spending $100 on a new outfit every week while using a $900 Dyson Airwrap.Many were upset by the hypocrisy of Olivia judging other people despite frequently using expensive equipment.Scroll down for video ",
        "'If you want to stop feeling broke and achieve some of those big financial goals I know you have - you need to stop buying clothes,' she said.Olivia added: 'You cannot buy a new outfit that costs between $100-$300 every single weekend and expect to save for a house deposit - it's just not going to happen.'The teacher explained in the caption, 'Don’t get me wrong, treat yourself and buy that birthday outfit but it can’t be every weekend.''For some reason we’ve been told we can always have it all, but that’s not the truth. We can save for things and buy during special occasions and reach goals but we can’t buy whatever we want whenever we want and still expect to reach huge goals,' she said.Many were infuriated by the podcaster's cruel prop while disseminating her message.'So, the chick with the $900 Airwrap will tell me how to spend my money,' a woman said.",
        "'Your message is much less relatable if you're using such expensive props,' another added. A third wondered: 'Is this satire? Because you're literally using a Dyson.' But the homeowner does not let negative comments get her down. The rising cost of Australian house prices is making it more difficult for first home buyers to crack into the market, but Olivia managed to do so with a $40,000 deposit.She purchased a two-bedroom property in Melbourne by herself at the age of 25 for $400,000 in 2019.Olivia, now 29, told FEMAIL she started saving for a deposit in 2017 when she began working full time.'I managed to save by putting away as much of my income as possible, which was difficult as I was living in a share house paying $230 per week in rent,' she said.Since then, she has renovated sections of the quaint inner-west unit to boost the value of the home. ",
        "The property is just 9km from the Melbourne CBD and close to trendy suburbs - an ideal location many strive to live in.  'I made saving for a house deposit my only financial goal at the time, so I was focused and all of my spare money went there,' she said.She honed in on frugal spending habits and carefully tracked where she was spending her money. ",
        "After she had the funds for the deposit, the process of looking for the perfect home itself took two to three years with assistance from real estate agents. Olivia said she started researching well before she began attending auctions and open houses to get a feel for what she wanted and could afford.",
        "'When I purchased the property, it was a complete dump - this is how I managed to secure a great property for a great price,' Olivia said.'I have renovated most things in the property from the floors in every room to a brand-new kitchen.'She added there's still 'more work to be done', including a full bathroom and garden renovation. ",
        "Already the $20,000 home renovation has boosted the value of the property up to $530,000.Olivia purchased the home with hope for it to one day become an investment property, but she's living in it for now.'I love my property and would love to do another property renovation in the future with my partner. For now, I am focused on investing in the stock market,' she said.Each week Olivia hosts The Motivated Millennial Podcast where she talks about finance, money, budgeting, building wealth and investing. ",
        "Always check the heating and cooling systems the property has and whether this needs updatingAsk the agent if they have a floor plan of the propertyAsk for a copy of the vendor's statement, which will include ratesTake a quick glance at the ceiling and make sure there's no water marksCheck what appliances there are in the kitchen, such as dishwasher and gas stoveIf possible, inspect the property when it's raining to see if there's any leaks"
    ]
}