{
    "articleURL": "/tvshowbiz/article-12050587/Guardians-Galaxy-Vol-3-given-rave-reviews-fans.html",
    "content": [
        "Fans have given the latest film in the Guardians Of The Galaxy franchise rave reviews - despite the dire critics rating on Rotten Tomatoes. ",
        "Despite fans expressing their excitement and saying the film is great after it was released earlier this week, it only has an 80 per cent critics score on Rotten Tomatoes, the lowest of the three films.In Guardians Of The Galaxy Vol.3, Chris Pratt, Zoe Saldana, Dave Bautista, Bradley Cooper, Karen Gillan, Pom Klementieff and Vin Diesel are all reunited.Their newest mission begins as Peter Quill (Pratt) is sad after the death of Gamora (Saldana) which occurred in The Guardians Of The Galaxy Holiday Special.More twists and turns follow in the movie as Bradley's character Rocket faces up to demons from his past and Peter has to protect his pal by heading up a treacherous quest for the Guardians which could lead to their dissolution.  ",
        "Elsewhere on the site, the 2014 film Guardians Of The Galaxy comes out on top in the ratings, with a score of 92 per cent and the second instalment has 85 per cent. However, the new film has won high praise from fans, who have given it an audience score of 97 per cent.Meanwhile, Volume 2 only has an 87 per cent audience score and Volume 1 has 92 per cent.  Fans have taken to Twitter to express their delight over the latest film.",
        "One person wrote: 'Guardians of the Galaxy Vol 3 was good. Pro-tip for Springsteen fans. Badlands is the last song in the credits. So wait for it.'Another said: 'My Guardians of the Galaxy 3 review: really enjoyed it! Not too many MCU films manage to carve themselves a little niche where you care about whatever tiny pocket of the universe they inhabit, but here you ride with gang.'Also we have known them so long now we get to see arcs!'Someone else wrote: 'The guardians of the galaxy movie is superb' while a separate person added: 'Guardians of the Galaxy vol 3 is pretty good. Enjoyed it a hell lot.'",
        "Fans have given the latest film in the Guardians Of The Galaxy franchise rave reviews but with an 80 per cent critics score on Rotten Tomatoes, it's far behind the 92% score for 2014's Guardians of the Galaxy and the 85% for 2017's Guardians of the Galaxy Vol. 2.DailyMail.comRating:Brian Viner gave the superhero sequel four stars out of five, declaring it 'marvellously bonkers.'He praised the soundtrack and said: 'Needless to add, it’s not meant to be taken remotely seriously, although at times it tries a little too hard to be funny. Come to think of it, the forced humour of all three Guardians films could make another academic thesis.'VarietyPeter DeBurge noted that director James Gunn, 'keeps the surprises coming, so audiences are actively engaged throughout, trying to manage multiple storylines and the ever-changing loyalties between characters.'The Hollywood Reporter Frank Scheck also offered a positive review of Guardians 3, though he admitted Gunn's writing left something to be desired.'Gunn doesn’t fully succeed in tying all these threads together into a coherent whole. And the storyline is too complicated by far, with so many things going on at so many different times and places that multiple viewings are practically necessary to keep it all straight (not that Disney has a problem with that),' Scheck said.Wall Street Journal Critic Kyle Smith called the sequel a, 'blahbuster'He adds the sequel, 'jogs along from one visually extravagant, strenuously jokey set piece to another without offering much in the way of either dramatic engagement or actually funny ideas.'",
        "One of the many negative reviews from critics was from Wall Street Journal critic Kyle Smith, who called the sequel a, 'blahbuster.'He adds the sequel, 'jogs along from one visually extravagant, strenuously jokey set piece to another without offering much in the way of either dramatic engagement or actually funny ideas.'Vanity Fair critic Richard Lawson called the sequel an, 'odd, lumbering patchwork of a film, occasionally fascinating but otherwise bloated and aimless.'Johnny Oleksinski from the New York Post added, 'The misfit team’s constant punchlines and I’m-just-busting-your-chops dynamic have grown exhausting. They’ve become the guy at the party who thinks he’s hilarious but is actually just drunk.'"
    ]
}