{
    "articleURL": "/wires/pa/article-12055643/Gunman-opens-fire-mall-injuring-multiple-people-killing-unknown-number.html",
    "content": [
        "A gunman shot multiple people at an outlet mall in the Dallas suburb of Allen, Texas, on Saturday, killing an unknown number.",
        "Officials received reports of gunshots at around 3.40pm from the Allen Premium Outlets.Witnesses told The Associated Press they saw multiple victims, including some who appeared to be children, and that they saw a police officer and a mall security guard who appeared to be unconscious on the ground.Allen police said in a Facebook post that nine victims had been taken to hospitals.Medical City Healthcare, a Dallas-area hospital system, said in a written statement it was treating eight between the ages of five and 61. Their conditions were unknown.An Allen Police officer was in the area on an unrelated call when the officer heard gunshots at Allen Premium Outlets at 3.36pm, the police department wrote on Facebook.“The officer engaged the suspect and neutralized the threat. He then called for emergency personnel. Nine victims were transported to local hospitals by Allen Fire Department,” the agency wrote in the Facebook post. “There is no longer an active threat.”A crowd of hundreds of people who had been shopping stood outside, across the street from the mall, on Saturday evening.Officers circulated among them asking if anyone had seen what happened.Fontayne Payton, 35, was at H&amp;M when he heard the sound of gunshots through the headphones he was wearing.",
        "“It was so loud, it sounded like it was right outside,” Mr Payton said.People in the store scattered before employees ushered the group into the fitting rooms and then a lockable back room, he said.When they were given the all-clear to leave, Mr Payton saw the store had broken windows and a trail of blood to the door. Discarded sandals and bloodied clothes were laying nearby.Once outside, Mr Payton said he saw bodies.“I pray it wasn’t kids, but it looked like kids,” he said. The bodies were covered in white towels, slumped over bags on the ground, he said.“It broke me when I walked out to see that,” he said.Further away, he saw the body of a heavyset man wearing all black. He assumed it was the shooter, Mr Payton said, because unlike the other bodies it had not been covered up.Tarakram Nunna, 25, and Ramakrishna Mullapudi, 26, said they saw what appeared to be three people lying motionless on the ground, including one who appeared to be a police officer and another who appeared to be a mall security guard.Another shopper, Sharkie Mouli, 24, said he hid in a Banana Republic store during the shooting. As he left, he saw what appeared to be an unconscious police officer lying next to another unconscious person outside the outlet store.",
        "“I have seen his gun lying right next to him and a guy who is like passing out right next to him,” Mr Mouli said.Stan and Mary Ann Greene were browsing in the Columbia sportswear store when the shooting started.“We had just gotten in, just a couple minutes earlier, and we just heard a lot of loud popping,” Mary Ann Greene told AP.Employees immediately rolled down the security gate and brought everyone to the rear of the store until police arrived and escorted them out, the Greenes said.Eber Romero was at the Under Armour store when a cashier mentioned that there was a shooting.As he left the store, Mr Romero said, the mall appeared empty, and all the shops had their security gates down. That is when he started seeing broken glass and people who had been shot on the floor.Video shared on social media showed people running through a parking lot while gunfire could be heard.More than 30 police cruisers with lights flashing were blocking an entrance to the mall, with multiple ambulances on the scene.A live aerial broadcast from the news station showed armoured trucks and other law enforcement vehicles stationed outside the sprawling outdoor mall.Ambulances from several neighbouring cities responded to the scene."
    ]
}