{
    "articleURL": "/femail/article-12047031/SAMANTHA-BRICK-Heidi-Klum-49-lost-mummy-moral-compass.html",
    "content": [
        "Heidi has raised eyebrows posing in lingerie ad with her daughter  READ MORE: I'm sick of this HRT mania, says SAMANTHA BRICKAnother day another mother making a dollar (or two) off the back of her kid. ",
        "This time it isn’t one of the usual suspects - those dodgy mother influencers, Katie ‘Mucky Mansion’ Price or even one of the grisly Kardashians. Instead step forward Heidi Klum.The 49-year-old host of America’s Got Talent has once more hoisted her boobs and bum into the pricey undies of the Italian giant Intimissimi. And yet again she has inexplicably trotted out her teenage daughter in the same bra-knicker get up too.My eyes! What on earth were the ad gurus behind this campaign thinking?Unless you’ve had a lobotomy I’d wager you agree with me and are silently calling it out as awful shonky behaviour.",
        "But that’s thirsty social media obsessed 2023 for you.And in the obsessive pursuit for those Insta followers – Klum has 10 million and her daughter has 1.7million - there are zero limits when it comes to monetizing motherhood.Klum – who celebrated reaching 10million Instagram followers by eating cake from her crotch - has quite clearly lost her grip on her mommy moral compass.Because what this says to us potential customers isn’t ‘buy these beautiful undies’ but rather the off-brand message broadcast is: ‘Celebrities clearly don’t care how they make their money. If that includes flogging their own flesh alongside that of their kids too? No problem!’",
        "Victoria’s Secret model Heidi Klum is, of course, no stranger to getting her kit off. The woman has virtually lived in her undies and little else for decades. Good for her. If that’s how she wants to make a buck then fine.Yet it seems as though the internet agrees with me concluding the current mother and daughter lingerie campaign is, in a word, creepy.Is the creepy claim justified? I think so. A curt glance at the advert shows one very vulnerable and awkward looking 18-year-old trussed up in underwear more suited to the robust body of a middle-aged woman. What teenager bothers with padded, underwired bras and complicated looking, spangly lacy knickers?As for Heidi? She might think she looks hot but she is looking less MILF and more like she is coming to the end of her sexy shelf-life date.",
        "Naysayers will call out female columnists such as myself for being envious.But nothing could be further from the truth. My mantra in life is ‘you do you.’ In this case Heidi is doing what she likes – but can the same be said for her daughter?Mothers recognizing there is cold hard cash to be made out of their daughters’ flesh has been a constant way before the terms ‘supermodel’ and ‘influencer’ were ever formed.",
        "Think actresses Brooke Shields and Jodie Foster. When their mothers thought it was fine for Foster as a teenage to act as a prostitute and an 11-year-old Shields to appear topless as one too. Little wonder they have had complicated relationships with their mothers during their adult years. Who on earth can blame them? Mothers are supposed to protect not publicly promote their daughters vulnerable physical forms.Disturbingly it’s the norm for most female celebs to want to graspingly maintain their profile and cash in when they become pregnant. They get a taste for the easy extra moolah while their kids are in utero. Little wonder they continue to use their offspring to make money as they grow up.As if they’d stop when their kids were old enough to make their own decisions about their careers?",
        "And let’s face it it’s not as if Klum is hard up and struggling to pay the bills. She lives the gilded, cliched life in posh Los Angeles suburb Bel Air. According to Celebrity Net Worth, she is worth $160million – to put it bluntly it’s not as if she needs the money.Yet she isn’t alone – and that’s the problem. How many model mammas haven’t used their daughters looks and enviable youth to ignite their flagging career? Think Jerry Hall and her younger girls. Cindy Crawford has been trotting out daughter Kaia Gerber for years. It’s fair to say that these women unashamedly use their kids to keep themselves relevant.",
        "It’s no biggie right? Well it is actually. So many faces have come out and said they regret (and then some) the types of underwear modelling campaigns they were involved in as teenagers. Kate Moss told Vanity Fair that she was not comfortable modelling as a teenager. In the interview she reflected on the 1992 Calvin Klein shoot she starred in with Mark Wahlberg and said she regretted it: ‘I had a nervous breakdown when I was 17 or 18, when I had to go and work with Marky Mark and Herb Ritts.’Kelly Brook is no different, of her experience modelling underwear as a teenager she reflected: ‘Of course I look back on it and think there was something about it that was… I was very young.’‘It was good money but, yes, to have someone of that age posing like that… I think that’s probably not great.’",
        "British actress Samantha Womack also said the same: ‘I wish I had understood at the time. I’m very pro-women and I love women being sexy but there were some photos I did which were quite degrading.‘There were a couple when the tone was wrong. It was explicit, and when you’re young you don’t understand the impact of those issues. You’re not a woman yet.’",
        "However you look at this tawdry tacky campaign it’s got very little to do with selling underwear and much more to do with an astute, hard-as-nails businesswoman making money off the back of her nubile offspring. Other pictures on the teenager’s Instagram feed show her in the same ad campaign looking confused - and who can blame her? Who would want to be a Nepo Baby in the Klum household? No thanks. One very wise Instagram commentator on Klum’s feed speaks for us all: ‘I would not be proud to show my daughter off in this way. I would feel embarrassed and sad.’Klum - take note."
    ]
}