{
    "articleURL": "/news/article-12050083/I-survived-Chastonbury-camped-Mall-heres-happened.html",
    "content": [
        "We went undercover at the Coronation camp out and lived like royal super fans For the third time in a year The Mall in central London has been swamped by royal fans who have been camping out for days to catch a glimpse of Charles' coronation on Saturday. ",
        "Dubbed Chastonbury, the festival atmosphere of the famous street has captivated the nation, and as something of a Royalist myself (I abhor Oliver Cromwell) - I wanted a slice. It may seem silly to compare fans of the Royal family to football fans, but in many ways they're very alike. They all wear the same outfits, all hero worship the same icons, all travel to events in huge numbers and all but the most levelheaded of them passionately despise the rival team (no prizes for who this may refer to in the context of the Royals). But how would I fare in this bubbling cauldron of coronation mania - given that the most patriotic thing I'd ever done in my life was order food loudly in English in a restaurant in Paris?",
        "Wednesday - 3 days till the CoronationThe man at Decathlon couldn't believe his luck when I waddled in. 'I need to buy camping supplies and I'm not sure what I'll need.' 'Ok great, where are you camping, anywhere fun?' 'I'm basically squatting on the side of a road with a bunch of strangers for three days. We're all hoping we'll see a man waving from a car.' His eyes widened, and ten minutes later and over £200 worse off, I was in a car heading to the Mall.",
        "When I arrived I was shocked to see how well laid out everything was with tents neatly stacked along the barricades, organised into small communes with interconnected tunnels and pathways. ",
        "Finding a spot, I erected my tent and began chatting to my neighbours who consisted of an amicable Canadian woman named Mary and Californian woman who had flown over the pond with her 17-year-old royal super fan Brandon. Mary, who is married to a British citizen and lives in the country with her three children,  admitted her husband thought she was nuts for spending three days in her predicament. Still, activities like this have to be preferable to having affairs. As the sun set, my new Royalist friends and I passed the evening contently, sharing a drink and discussing Meghan's new look (we don't like it). 'This is actually quite fun' I remarked, 'I can sort of see why people do this.' 'This is the calm before the storm' said Mary sagely, pulling her Canadian flag tighter around herself: 'They're coming.' Thursday - 2 days till the CoronationI slept appallingly due to a woman three tents down screaming all night and woke up with a bruised hip from the hard and cold concrete of the Mall.Pulling myself out of my dusty tomb I found that Mary had indeed been right, 'they' had come. ",
        "It was pandemonium. Everywhere you looked there was a new multicoloured marvel of unhinged patriotism whether it was man dressed in a Union Jack suit or actual Prince Harry and Meghan impersonators, who were jeered as they milled about the crowd. People without tents had slept on camping chairs or the floor and the world's media had descended to interview the most original and flamboyant personalities. At one point there were five news cameras queuing up to interview a man dressed as a flag. As media scrums go, it was probably the most deranged one I've ever seen. My first job of the day was to find some breakfast but after rummaging through my tent I found I had rolled over in the night and crushed it. Feeling embittered, I tottered off to the cafe and inhaled a bacon sandwich in front of Buckingham Palace - God, I love this country! As you might expect, camping out for an event two days before it actually starts involves a lot of waiting. This was harder for me than most as I didn't actually remember to bring a chair so was forced to hot seat through multiple different camps all day, moving on only when my position became untenable or they became tired of my witty Coronation jokes. ",
        "My favourite group of all was a group of ladies I nicknamed 'The Golden Girls'. Jessie Young, Margaret Tinsley, Eunice Hartstone, Elizabeth Couzens and Shirley Messinger all met at the Platinum Jubilee last year and decided to get together again to be in London for Charles' Coronation.",
        "And they came prepared. Their tent was like a fortress with four sides and a central compound perfect for sitting, chatting and inevitably drinking. It was in this haze that most of the day passed. Occasionally we'd all shout if we saw a black car and whispers would run along the Mall that it was William or Charles but sadly, it never was. When the sun heaved itself back to hell, the mood around the Mall took a sombre turn. With the media gone and the temperature dropping, campers turned their mind to survival. Drinks began to be rationed, layers doubled up. Those unhinged enough to arrive with no tents settled back into their camping chairs - their fate sealed.Food too was scarce and I was reduced to eating a KFC on the dusty street and taking small sips of gin from a plastic cup - gifted to me by a man wearing a mask of Prince Phillip's face. As situations go it was a bleak one.  ",
        "After wishing my campmates goodnight at around midnight, I paused and surveyed the scene. As far as the eye could see, coronation campers lay strewn across the pavement, some lying under canvas, others frozen to their chairs. My gaze was drawn to two women, aged in their early 50s at most - the same age as my mother. They were shivering and huddled together for warmth. I looked back at my tent. It was small, but there was easily enough room for two people inside and I was young, sturdy and more able to bare the cold than these two flag waving ladies. What was the right thing to do in this situation? Locked in thought, I vowed to mull this decision over and come up with a concrete solution in the morning.Feeling selfless, I zipped up my tent and went to sleep. In the distance, the woman from the first night shrieked something intelligible about Charles for the fifth time. 'IF YOU DON'T SHUT UP, I'LL COME OVER THERE AND MAKE YOU', yelled an anonymous patriot in reply. I love this country. ",
        "Friday - 1 day to goI woke up and completely forgot what I had been mulling over. Opening my tent I saw the two ladies clumped together on a campchair fort - I'm fairly sure they were still breathing. ",
        "Brushing my teeth, a new sense of bonhomie came over me. We'd lasted two days and two nights, within 24 hours we'd have front row seats to arguably the event of the century! 'Bet we'll feel great tomorrow watching the procession from our tents!' I hollered to my campmates. They looked at me blankly. 'Haven't you heard?''Heard what?' I said, whistling, I was really chipper now. 'The police will be here at 6am tomorrow. We'll have to pack everything up and fight to get to the front like everyone else.' 'WHAT?!' "
    ]
}