{
    "articleURL": "/wires/aap/article-12054799/Tigers-gun-recruits-face-criticism.html",
    "content": [
        "Key Richmond figures have leapt to the defence of Tim Taranto and Jacob Hopper in the face of \"disappointing\" commentary around the high-profile recruits.",
        "The two former GWS midfielders had been accused by prominent AFL commentators of gathering plenty of touches without influencing matches since their off-season moves to the Tigers.The spotlight came during Richmond's five-match losing streak, which sent them tumbling to 16th spot on the ladder.But both Taranto and Hopper have been valued internally and were strong contributors in Saturday's much-needed 46-point win over West Coast.The result breathed some life back into Richmond's (2-1-5) season ahead of a crunch clash with Geelong in round nine.\"I was getting a bit frustrated with the commentary around Taranto and Hopper,\" Richmond defender Nathan Broad told AAP.\"We try not to look into it but I really do feel for those guys.\"They've come in and they're probably our two best players at the moment.\"They're giving everything, they're buying into everything and their performances are A-grade.\"The flak they're copping is pretty disappointing, to be honest.\"But they're doing a great job and hopefully we can keep getting wins because without them we might not have won a game.\"Taranto produced his best game for Richmond with 30 disposals, 10 clearances, six score involvements and two goals against West Coast, while Hopper had 32 touches and 10 clearances.Tigers coach Damien Hardwick fired up when asked post-match about former Port Adelaide premiership teammate Kane Cornes' assessment that Taranto isn't in the top 150 players in the AFL.",
        "\"(Taranto) is an outstanding player,\" Hardwick said.\"We wouldn't be anywhere near where we need to be ... without those two boys.\"They've been wonderful for our footy club.\"They're starting to learn what it is to be a Richmond person and starting to play like Richmond men, which is really important.\"I thought those two boys were very, very good today and will continue to be for a long period of time.\""
    ]
}