{
    "articleURL": "/wires/ap/article-12060249/Whats-Syria-s-return-Arab-League.html",
    "content": [
        "BEIRUT (AP) - The Arab League´s decision to re-admit Syria after shunning it for 12 years was a significant symbolic victory for Damascus, part of a larger regional realignment and an indication of the United States´ waning role, analysts say.",
        "But it may not immediately bring the reconstruction dollars that Syrian President Bashar Assad is hoping for. Nor is it likely to bring the changes Syria´s neighbors want, such as an agreement on refugee returns and moves to reduce drug trafficking.Syria is returning to the Arab fold even though there is no sign of a resolution to the country´s uprising-turned-civil war, now in its 13th year. The long-stalemated conflict has killed nearly a half million people since March 2011 and displaced half of the country´s pre-war population of 23 million. Multiple mediation attempts have failed.The league approved Syria´s readmission at a closed-door meeting in Cairo on Sunday. It means Assad can attend the league´s summit in Jeddah, Saudi Arabia on May 19, further cementing his move out of pariah status.WHAT IS THE ARAB LEAGUE AND WHY WAS SYRIA SUSPENDED FROM IT?The Arab League is a 22-member organization founded in 1945 to promote regional cooperation and resolve disputes. But it is widely seen as toothless and has long struggled to help solve conflicts, especially in the recent era of wars in Syria, Yemen and Libya and a bitter diplomatic rift between Gulf monarchies and Qatar years ago.",
        "The league suspended Syria´s membership in 2011 after Assad´s government cracked down brutally on mass protests against his rule, an uprising that quickly descended into a brutal civil war. Qatar, Saudi Arabia and several other Arab countries funneled support to armed opposition groups trying to overthrow Assad, who was backed by Russia, Iran and militias affiliated with Tehran.",
        "WHY LET IT BACK IN NOW?After years of deadlock in the war, Assad´s government has a secure grip on most of the country, particularly most main cities. Opposition groups or U.S.-backed Kurdish forces control most of northern and eastern Syria -- and that´s unlikely to change any time soon -- but it has been clear for years now that an opposition overthrow of Assad is virtually impossible.Arab governments that may have once hoped for that outcome are now deciding it´s better to reach out.\"We´re not looking for magical solutions, but what we do know is that the current situation is unsustainable. It´s going nowhere,\" Saudi political scientist Hesham Alghannam said. \"We don´t know when the conflict will end, and boycotting the regime didn´t lead to a solution.\"In recent years, several Arab countries moved towards reestablishing diplomatic ties, most notably the United Arab Emirates in 2018. Jordan and Syria reopened their borders in 2021. Last month, Saudi Arabia and Syria announced they are moving to reopen embassies and resume flights.The devastating Feb. 6 earthquake that hit Syria and Turkey also sped up rapprochement, bringing sympathy for Syria. More than 6,000 people were killed in Syria and hundreds of thousands lost their homes. Senior officials from once-hostile countries visited Damascus for the first time in over a decade and sent planeloads of aid.",
        "Approaching Assad under the pretext of the humanitarian crisis was a less controversial way to continue improving ties.Another boost was the Chinese-brokered deal to reestablish ties between Saudi Arabia and regional rival Iran, which is encouraging them to de-escalate conflicts like Syria and Yemen.Also, the United States´ \"de-prioritization of the Middle East and particularly of the Syria portfolio\" led regional actors to work out their own deals with Damascus, despite Washington´s objections, said Randa Slim, director of the Conflict Resolution and Track II Dialogues Program at the Washington-based Middle East Institute.WHICH COUNTRIES WERE FOR AND AGAINST IT?Saudi Arabia played a key role in pushing for Syria´s return to the Arab League, hosting a meeting last month to discuss the topic. Jordan hosted another gathering earlier this month.Qatar remained the most prominent hold-out. However, after Sunday´s decision to readmit Damascus, Qatar said in a statement that it \"will not be an obstacle\" to \"an Arab consensus.\"Kuwait also has not endorsed normalization, said Bader Al-Saif, assistant professor of history at Kuwait University.Kuwait \"wants to know what the conditions are, what the political solution looks like. Will there be elections? An apology? Anything?\" he said. Despite these key skeptics, al-Saif said Riyadh will continue to push for Damascus to work for a \"more robust and integrated Arab order.\"",
        "One main criticism of the rapprochement is that Assad has made no concessions toward a political deal to resolve Syria´s conflict. Without a credible resolution, millions of Syrians who fled abroad - many to neighboring countries - will be too afraid to return.WHAT WILL HAPPEN ON THE GROUND?On the symbolic level, Syria´s return to the league signals to opposition Syrians that \"they are left on their own,\" Slim said, and confirms to Damascus that its scorched-earth strategy in the war worked.But on a practical level, \"a seat at the Arab League is not that powerful,\" she said.U.S. and European sanctions will likely prevent Arab countries from significant investments in reconstruction in the near future.Many Syrians in government-held areas hope to see a benefit in greater trade with the Arab world to help to offset a crippling economic crisis.That could happen, Alghannam said. \"If there is stability, I believe there will be an influx of Gulf investment and trade with Syria.\" Still, he noted, Saudi-Syrian relations were strained even before the Syrian conflict, \"so confidence-building will take time.\"A statement issued by the Arab League after Sunday´s meeting suggested that Syria´s further reintegration will depend on moving towards a political solution to the conflict, combating drug trafficking and facilitating the return of refugees. Gulf countries have also pushed for Damascus to curb Iranian influence in Syria.",
        "Maha Yahya, the director of the Beirut-based Carnegie Middle East Center, said it is unlikely that Syria will meet Arab countries´ demands.As such, she said, \"I honestly don´t think this move is going to open the floodgates of support for Syria.\""
    ]
}