{
    "articleURL": "/wires/reuters/article-12055991/Pirates-look-end-slide-salvage-finale-vs-Blue-Jays.html",
    "content": [
        "Things are going swimmingly for the visiting Toronto Blue Jays, but the Pittsburgh Pirates are drowning going into the teams' series finale Sunday.",
        "The Blue Jays, who entered the series with a five-game losing streak, have won the first two games of this set, a 4-0 shutout Friday and an 8-2 pasting Saturday.Pittsburgh was also looking to turn things around for the better this weekend, but instead has run its losing streak to six games.Toronto has clinched the series, improving to 8-3-0 in series this season, 4-3-0 on the road, and seems to have gotten back on track.Getting a couple wins has left the Blue Jays upbeat. Brandon Belt got on base four times Saturday and drove in two runs before being ejected in the eighth for questioning a strike call. It was his first time this season reaching four times.\"I'm just happy I've been able to run. Legs are still fresh, unfortunately,\" Belt cracked.The Pirates go into Sunday trying to avoid being swept for the second series in a row. They have been outscored 34-8 during their six-game slide, with no more than two runs scored in any of those games.Pittsburgh manager Derek Shelton looks back to when his club was one of the best in baseball, before this slide.\"It gives me confidence,\" Shelton said. \"We've kind of got to find our groove. We've been inconsistent over the last six games, but I know our guys can hit. I know our approach can be good.\"",
        "Both teams continue to deal with injuries.Toronto infielder Vladimir Guererro Jr. was a late lineup scratch Saturday because of left wrist discomfort. Guerrero, who has missed just three games over the past three seasons, is hitting .318 with seven homers and seven doubles.\"We'll see how he feels (Sunday) and go from there,\" Blue Jays manager John Schneider said.Pittsburgh was without designated hitter Andrew McCutchen and infielder Ji Hwan Bae, who sustained ankle injuries Friday -- McCutchen during pregame warmups and Bae coming out of the batter's box in the eighth.Shelton said McCutchen and Bae are \"trending in the right direction.\"In the series finale, Toronto left-hander Yusei Kikuchi (4-0, 4.02 ERA) is scheduled to oppose Pittsburgh right-hander Roansy Contreras (3-2, 4.09).As with most of the Blue Jays rotation, Kikuchi got caught up in the team's five-game losing streak entering this series.On Tuesday against Boston, he did not get a decision after allowing five runs and nine hits in 4 1/3 innings. Among the first six hits off him were three doubles and a homer.Kikuchi is 0-0 with a 7.11 ERA in two career appearances, one start, against Pittsburgh.Contreras was cruising along with three straight quality starts, going 2-0 in those games, before he stumbled in his most recent outing. He gave up four runs and six hits in 5 1/3 innings Tuesday against Tampa Bay and was visibly frustrated in the dugout when he came out of the game.",
        "In his only appearance against Toronto, a start last Sept. 3, Contreras had a quality start but did not get a decision. He allowed one run and four hits in six innings, with five strikeouts and two walks.--Field Level Media"
    ]
}