{
    "articleURL": "/femail/article-12049191/Left-mothers-day-present-late-Use-Uber-Package-mum-gift-couple-hours.html",
    "content": [
        "We've all had that moment where we've managed to buy the perfect last minute gift for Mum and realised that we've got no way of getting it to them in time for Mothers Day. ",
        "As the big day approaches, new research commissioned by Uber Package reveals Aussies have a poor track record of forgetting about Mother's Day until the very last minute, putting themselves under pressure and resorting to purchasing flowers from the servo.",
        "If this sounds like you, you're not alone. Uber Package's survey of 1,000 Australians found that nearly half (42%) admit they've forgotten about Mother's Day at least once in their lives. In fact, 56% of Australians only realise it's Mother's Day when they start seeing advertising (30%), cards being sold (13%) or posts on social media.There's no doubt a lot of us love to cut it fine, with the majority (55%) buying their gifts on the week of the special day. One in five (21%) even admit to buying it on their way to seeing her! For the forgetful or last minute Aussies looking to gain back brownie points with Mum this year, you can simply use Uber Package and get your present delivered without a hitch, even on the day itself. ",
        "With Uber Package, you can easily book a delivery in the same way that you request a ride. And the best part? You can get on-demand delivery usually within the hour! Now you can watch your scented candle or tea towel with your face printed on it as it makes its way to Mum, and get a notification when it's delivered.",
        "As long as your package can fit in the boot of a midsized car, it can travel with Uber Package. Uber Package allows you to request a delivery person to transport your package to a person waiting at a designated drop-off location. You can even request a package to be sent to you from a designated sender.",
        "Just tap the Package icon on the Uber app home screen and follow the in-app instructions. But keep in mind that Uber Connect is designed for local delivery, so the package recipient should be available to meet the delivery person at the door or kerb. If you need to ask the delivery person to leave the package at the recipient's door, you'll be able to add delivery notes with further instructions to smooth the delivery process.",
        "To ensure that your gift arrives safely and smoothly, it's recommended that you notify Mum of the delivery so she can meet the delivery person to retrieve the package from the vehicle. And if you do send Mum a package as a surprise, you'll need to clearly instruct the delivery person, in the message section of the Uber app, to leave the package at her door.So why not use Uber Package to deliver your last-minute Mother's Day gift? It's quick, easy, and hassle-free!"
    ]
}