{
    "articleURL": "/wires/reuters/article-12058153/Struggling-Yankees-hope-brighter-days-vs-place-As.html",
    "content": [
        "While the New York Yankees experienced a frustrating weekend visiting the best team in the majors, the Oakland Athletics enjoyed their best weekend so far.",
        "After one of their most disappointing losses of a middling season, the Yankees will return home and attempt to stay over .500 Monday night when they face the Athletics, who are coming off their first series win.The Yankees are hoping to avoid falling to 18-18, which would mark their second time at the .500 mark this month. They were 15-15 after blowing a two-run lead on May 1 at home against Cleveland.After winning the final two games against the Guardians, the Yankees sandwiched a pair of one-run losses around a 3-2 win in their first series with the Tampa Bay Rays. On Sunday, Anthony Rizzo and Harrison Bader homered before the Yankees blew a six-run lead and took an 8-7 loss when Albert Abreu allowed a game-winning hit to Isaac Paredes in the 10th inning on Sunday.The Yankees fumbled Sunday's game with ace Gerrit Cole on the mound and made other mistakes that led to runs for Tampa Bay.\"I thought that we progressed as a group throughout the series,\" Cole said.In the sixth inning, Jimmy Cordero fielded Yandy Diaz's grounder, threw to first to get the out and allowed Jose Siri to score from second to put the Rays ahead 7-6. In the 10th, Aaron Hicks was thrown out at the plate after avoiding a tag during a rundown on a ground ball by Gleyber Torres.",
        "\"Difficult, but we start a big homestand tomorrow and we got to move on from it,\" manager Aaron Boone said.The Yankees managed to score more than five runs for just the second time in their past 16 games.Oakland scored 17 runs in taking the first two games of a three-game series at Kansas City but was held to four hits Sunday and had two at-bats with runners in scoring position. The A's totaled 26 hits and had 26 at-bats with runners in scoring position during their first winning streak of the season.Ryan Noda went 0-for-4 Sunday as the A's saw their run differential increase to minus-124. Brett Rooker, who is hitting .319, went 0-for-3 and is 5-for-23 in his past six games after hitting .353 in his first 22 games.Nestor Cortes (3-2, 4.91 ERA), who is coming off the worst start of his career and has allowed 14 runs over his last three starts, opens the series for New York. Cortes had his turn pushed back due to strep throat and is pitching for the first time since getting torched for seven runs and five hits, including three homers, over 4 2/3 innings in a 15-2 loss at Texas April 30.Cortes is 0-1 with a 4.38 ERA in four career appearances against Oakland. In his only start against the A's, Cortes allowed three runs in 5 1/3 innings in a 3-2 road loss on Aug. 28, 2021.",
        "JP Sears (0-2, 5.06) -- who was 3-0 with a 2.05 ERA in seven games (two starts) before the Yankees traded him at the 2022 deadline for Frankie Montas -- goes for Oakland.Sears is coming off his best start of the season, when he allowed four hits in six scoreless innings before Oakland's bullpen allowed five runs in the 10th inning of a 7-2 loss to Seattle on Wednesday.\"Outstanding job by Sears,\" Oakland manager Mark Kotsay said. \"Unfortunately, the back end and the bullpen just haven't been able to close it down.\"--Field Level Media"
    ]
}