{
    "articleURL": "/femail/article-12051719/Crown-Princess-Mary-Denmark-stuns-pink-Buckingham-Palace.html",
    "content": [
        "Crown Princess Mary of Denmark looked stunning as she arrived for the eventREAD MORE:  Princess Mary wears army chic for Home Guard paradeCrown Princess Mary and her husband Crown Prince Frederik of Denmark have arrived at King Charles III’s drinks reception at Buckingham Palace ahead of tomorrow’s Coronation.",
        "The 51-year-old royal and her husband are on the exclusive guest list attending the dazzling reception hosted by Charles and Camilla before they are crowned. MailOnline exclusively revealed that guest numbers for the King’s Coronation are so tight many foreign royals and British aristocrats have missed out on invitations to the Westminster Abbey ceremony.Arriving at the event with her 54-year-old husband, Princess Mary showed off her impeccable style in a coral pink Andrew Gn dress.The thrifty royal previously wore the garment to celebrate her daughter Princess Isabella's confirmation at the end of April 2022. ",
        "Wearing her long chestnut hair down in delicate waves, Mary kept her make-up soft and classic with a slightly smokey eye and subtle pink lip, opting for a nude shade on her nails.  Mary's coral Andrew Gn dress stood out beautifully against her olive complexion, while she added a pop of colour with a turquoise beaded clutch to tie in with the exquisite brooch on the dress's matching belt. The mother-of-four finished the outfit with nude heels, a thin gold necklace and diamond earrings. Mary's pre-Coronation outfit is a much more subtle take compared to how she styled the same dress for her 16-year-old daughter's special occasion last month. Opting to forgo a bag, the royal added a statement headband to her hair that featured a soft pink netted veil. ",
        "However, the fashionista couldn't help but add a pop of fresh spring colour on her nails by wearing a hot coral pink. Tonight's drinks reception is the first in a long list of events organised to celebrate the King's Coronation. More than 1,000 guests are expected to attend the special reception tonight, along with the most senior members of the Royal Family.The event won’t be a traditional sit-down dinner but will be modelled on the reception Charles and Camilla also held for dignitaries and Commonwealth representatives just before Queen Elizabeth’s funeral.‘It will feel rather like the annual Diplomatic reception held every December at Buckingham Palace as opposed to a state banquet, and will be a nice mix of majesty, family and friends,’ a source said.",
        "It is understood that many will be the spouses or children of guests who did not make the cut for the Abbey due to the tightness in numbers.They include King Willem-Alexander of the Netherlands and his wife, Queen Maxima, who will attend the Coronation.But they will be joined at Buckingham Palace on the Friday by the former queen, HRH Princess Beatrix, 85, who knows Charles well, and her grand-daughter the future queen, 19-year-old Catharina-Amalia, the Princess of Orange.‘It will basically be most of the VIP coronation guests plus all those Their Majesties wanted to invite to the ceremony but couldn’t due to the scaled back numbers at the Abbey,’ another source said."
    ]
}