{
    "articleURL": "/wires/reuters/article-12041043/UBS-wary-buying-Credit-Suisse-February-wanted-analysis--SEC-filing.html",
    "content": [
        "By Noele Illien",
        "ZURICH, May 3 (Reuters) - UBS was considering the potential impact of buying struggling rival Credit Suisse as early as December, months before the takeover was hastily arranged by Swiss authorities in March, according to a regulatory filing.The filing with the U.S. Securities and Exchange Commission (SEC) also showed UBS concluded in February that buying Credit Suisse was not desirable, but that it should prepare in case its rival encountered \"serious financial difficulties\".The disclosure, dated April 26, provides the clearest insight yet into UBS's thinking and shows it had been looking at its struggling competitor months before the rescue deal orchestrated by Swiss authorities was put together.In March, UBS agreed to take over Credit Suisse for 3 billion Swiss francs ($3.4 billion) and said it would assume up to 5 billion francs in losses, as part of a rescue that is backed by as much as 250 billion francs of state support.In February, Switzerland's financial regulator FINMA said it was closely monitoring Credit Suisse given it was experiencing \"significant\" outflows, but noted the stabilising effect of its liquidity buffers. Only days before the rescue, the regulator and the central bank, while pledging funding if necessary, still judged Credit Suisse remained sound.They stepped in after clients, unsettled by market turmoil unleashed by the collapse of two mid-sized U.S. lenders, kept pulling money from the scandal-plagued 167-year-old institution.",
        "The regulator later defended its actions, saying it had been quick to respond and called for more powers to call banks to account.Since then, the Swiss authorities and UBS have been racing to close the takeover as soon as possible in an effort to retain Credit Suisse's clients and employees, Reuters has reported.Addressing a financial conference in Zurich on Wednesday, UBS Chief Executive Sergio Ermotti said the bank aimed to close the deal by the end of May or early June.UBS said in the filing that the merger still required approval from regulators in the European Union, India, Japan, Mexico and South Korea.Last month, UBS secured temporary approval from European Union antitrust regulators, while the U.S. Federal Reserve approved the UBS Group's acquisition of Credit Suisse's U.S. subsidiaries.The filing also said the merger could be terminated if its \"closing conditions have not been satisfied\" by December, but that any missing regulatory approvals would not be treated as a breach of those conditions by UBS. (Reporting by Noele Illien Additional reporting by Stefania Spezati Writing by Matthias Williams and Tomasz Janowski Editing by Sharon Singleton and Mark Potter)"
    ]
}