{
    "articleURL": "/wires/reuters/article-12051869/Soccer-Lazio-face-crunch-match-Milan-race-Champions-League-spots.html",
    "content": [
        "Lazio aim to preserve second place at Milan",
        "Juve visit Atalanta strongholdRoma host in-form InterBy Tommy LundMay 5 (Reuters) - The Serie A title race may be over after Napoli won the Scudetto this week but Lazio's visit to AC Milan on Saturday could play a key role in the fight for the last three Champions League spots.Maurizio Sarri's Lazio side face a tough test in Milan, who have been unbeaten at San Siro in their last eight games in all competitions. Stefano Pioli's Milan outfit, meanwhile, need a win to provisionally move back into fourth place.Lazio have 64 points ahead of Juve (63) and Inter Milan (60) with Atalanta, Milan and AS Roma (58) jostling for the top four.Pioli, whose Milan team were dethroned by Napoli in the league, also have a Champions League semi-final, first leg against Inter on Wednesday to think about.\"It's almost all or nothing tomorrow. We have to pick up a lot of points between now and the end of the season and tomorrow is incredibly important,\" Pioli said.\"Each season tells its own story. Last year we won an exceptional championship and this year we set off with the will to win it again.\"Last year we took big steps forward when we came out of the Champions League, while this year in Europe we're doing exceptional things.\"",
        "Milan right back Alessandro Florenzi might miss out due to a virus but centre-back Fikayo Tomori is set to return to the starting lineup after a one-game suspension.Lazio will have defender Alessio Romagnoli back after a one-match suspension.ATALANTA TESTJuventus have only point from their last three away games in Serie A and the fixtures do not get any easier with fifth-placed Atalanta up next for Massimiliano Allegri's side on Sunday.The hosts are undefeated in their previous six league meetings with Juve, who are back in the top-four hunt after moving up from seventh to third following the decision in April by Italy's top sports body to overturn a 15-point deduction.However, the Turin side only have one win in their last five league matches while Atalanta have won five of their last seven.Juve have found scoring on the road difficult, managing only four goals in their last five league games.Striker Moise Kean is set to miss out due to muscular problems, so Juventus are likely to pin their hopes on Dusan Vlahovic who scored his first goal in Serie A since early February in Wednesday's 2-1 win over Lecce.Atalanta may have to play without Danish striker Rasmus Hojlund, who is still struggling with a muscular issue that caused him to pull out before their 3-2 victory over Spezia.",
        "Inter's resurgence poses a challenge for injury-hit RomaSimone Inzaghi's side have reversed their recent poor form and won three straight games to move up to fourth after only managing a single draw in their last five matches.They visit injury-plagued AS Roma, who are seventh and without Rick Karsdorp, Chris Smalling, Gino Wijnaldum, Diego Llorente and Stephan El Shaarawy while Zeki Celik is suspended.\"I expect a match against a strong, motivated team, led by an excellent coach,\" Inzaghi said. \"We know it will be a match with many potential hazards and a very important result is at stake for the rankings of both sides.\"As Jose Mourinho faces his former club, he will also have one eye on Roma's Europa League semi-final, first leg against Bayer Leverkusen scheduled for the Stadio Olimpico on Thursday. (Reporting by Tommy Lund in Gdansk; Editing by Ken Ferris)"
    ]
}