{
    "articleURL": "/news/article-12046237/Zelensky-says-Putin-tried-criminal-acts-visits-International-Criminal-Court.html",
    "content": [
        "Zelensky today called for a special tribunal to be set up to hold Russia to accountInternational Criminal Court has had a warrant out for Putin's arrest since March Ukrainian President Zelensky said today on a visit to The Netherlands that a special tribunal must be created to hold Russia to account for its 'crime of aggression'.",
        "He told the International Criminal Court in The Hague: 'We all want to see another Vladimir here in The Hague... One who deserves to be punished for his criminal acts in the capital of international law.'I am sure that this will happen when we win. Whoever brings war must be judged.' The ICC issued a warrant for Putin's arrest for war crimes back in March.Dutch foreign minister Wopke Hoekstra has said more than 85,000 war crimes have been registered since the war started. The visit came a day after Zelensky denied that Ukrainian forces were responsible for what the Kremlin called an attempt to assassinate Putin in a drone attack on Moscow. The Kremlin promised retaliation for what it termed a 'terrorist' act. ",
        "Thursday's visit to The Hague is Zelensky's first to The Netherlands and follows a stop in Finland on Wednesday to meet with Nordic leaders.",
        "During yesterday's visit, Zelensky responded to Russia's allegations Ukraine was responsible for the 3 May attack on the Kremlin and told reporters: 'We didn´t attack Putin. We leave it to (the) tribunal' - an apparent reference to the ICC.In a news conference yesterday, the Ukrainian President also thanked Finland for its support of 'our freedom and territorial integrity and sovereignty'. Finland finally secured NATO ascension on 4 April after months of deliberation.",
        "Since the attack on the Kremlin, Ukraine's military has claimed three Russian drones that hit the southern city of Odesa early Thursday had 'for Moscow' and 'for the Kremlin' written on them, seemingly meant in retaliation for the strikes on the Kremlin.Kyiv was also the target of an air attack for the third time in four days.Dmitry Peskov, Putin's spokesperson, said Thursday that the US was behind Ukraine's decision to strike the Kremlin. Today, in The Netherlands, Zelensky was welcomed outside the ICC building by the court's president, Poland's Piotr Hofmański. Staff crowded at windows to get a glimpse of Zelensky's arrival and raised a Ukrainian flag next to the court's own flag outside the building.Zelensky gave a speech titled No Peace Without Justice to diplomats and officials earlier today. The Hague, a city in The Netherlands, hosts the International Criminal Court as well as the United Nations' top judicial organ, the International Court of Justice.The city is known as the home of international law and arbitration.The ICC is only able to hear a case if the country where the offence was committed is a party to the Rome Statute - which established international crimes of genocide, crimes against humanity, war crimes and the crime of aggression - or if the perpetrator's county of origin is party to the statute.",
        "As it stands, Ukraine has signed the 1998 treaty but not yet ratified it.Russia was a signatory but withdrew its signature in 2016.The US, Israel and Sudan have all also informed the UN Secretary General that they no longer intend to be state parties.While the chances of Putin standing trial at The Hague are slim - the court does not have a police force to execute its warrants - they have maintained pressure on the leader for allegations of war crimes.A statement on 18 March issued by the ICC claimed Putin 'is allegedly responsible for the war crime of unlawful deportation of (children) and that of unlawful transfer of (children) from occupied areas of Ukraine to the Russian Federation.'",
        "While visiting the Netherlands, Zelensky is due to meet Dutch Prime Minister Mark Rutte and Defence Minister Kajsa Ollongren.The Netherlands has pledged both financial and military support to Ukraine since Russia launched its invasion in February 2022.The country announced last month that it would buy 14 Leopard 2 tanks with Denmark to give to Kyiv, which is demanding more heavy weapons. An AFP correspondent saw Zelensky arrive at the ICC under heavy security measures, as a Ukrainian flag was flown at the court."
    ]
}