{
    "articleURL": "/wires/reuters/article-12061377/West-Virginia-s-Bob-Huggins-calls-Xavier-fans-gay-slur-apologizes.html",
    "content": [
        "West Virginia coach Bob Huggins used a slur when describing fans of an old rival during a sports radio show appearance on Monday afternoon.",
        "Huggins soon released an apology, saying he had \"no excuse\" for his comments, and West Virginia said it will review and address the matter.Huggins coached at Cincinnati from 1989-2005, and each year the Bearcats play the Crosstown Shootout, an annual rivalry game with Xavier University, a Catholic school.Appearing on WLW in Cincinnati Monday, host Bill Cunningham asked Huggins if he had poached any Xavier players from the transfer portal, to which he replied, \"Catholics don't do that.\" Huggins then referred to an incident in which some Xavier fans purportedly threw \"rubber penises\" onto the court.\"Any school that can throw rubber penises on the floor and then say they didn't do it, by God they can get away with anything.\"Cunningham responded with an off-color joke that the incident occurred on \"transgender night,\" leading Huggins to respond, \"It was the Crosstown Shootout, yeah. No, what it was was all those f--s, those Catholic f--s. They were envious they didn't have one.\"Cunningham laughed and called Huggins \"the best ever,\" but West Virginia was less than pleased.\"Coach Huggins' remarks today on a Cincinnati radio show were insensitive, offensive and do not represent our University values,\" the university said in a statement. \"Coach Huggins has since apologized. West Virginia University does not condone the use of such language and takes such actions very seriously. The situation is under review and will be addressed by the University and its athletics department.\"",
        "The Mountaineers' men's basketball Twitter account also published a lengthy apology from Huggins.\"Earlier today on a Cincinnati radio program, I was asked about the rivalry between my former employer, the University of Cincinnati, and its crosstown rival, Xavier University. During the conversation, I used a completely insensitive and abhorrent phrase that there is simply no excuse for -- and I won't try to make one here. I deeply apologize to the individuals I have offended, as well as to the Xavier University community, the University of Cincinnati and West Virginia University.\"As I have shared with my players over my 40 years of coaching, there are consequences for our words and actions, and I will fully accept any coming my way. I am ashamed and embarrassed and heartbroken for those I have hurt. I must do better, and I will.\"Huggins, 69, has coached West Virginia since 2007. He was inducted into the Basketball Hall of Fame in 2022 and is one of only six men's coaches to reach 900 career wins.--Field Level Media"
    ]
}