{
    "articleURL": "/wires/reuters/article-12047919/Blackstone-weighs-options-Spanish-gambling-firm-Cirsa-sources.html",
    "content": [
        "By Amy-Jo Crowley, Pablo Mayo Cerqueiro and Andres Gonzalez",
        "LONDON, May 4 (Reuters) - Blackstone is weighing options for Spanish gambling company Cirsa, including an initial public offering (IPO), people familiar with the matter told Reuters.The U.S. buyout group recently invited proposals from investment banks to manage a possible share sale and refinancing of Cirsa's debt, said the people, speaking on condition of anonymity.It is common for banks managing an IPO to also provide a loan to the company.Blackstone declined to comment. Cirsa did not immediately respond to a request for comment.An IPO would follow a public share sale by Italian peer Lottomatica, backed by Apollo Global Management , whose shares began trading in Milan on Wednesday.However, Lottomatica's lacklustre performance on its debut may impact the timing of a deal, the people said.Lottomatica, which pressed ahead with its listing plans despite recent market turmoil, priced its IPO at the bottom of its targeted valuation range and its shares have fallen in the aftermarket.Explorations for Cirsa are preliminary and may not lead to a transaction, the people said.Cirsa, a casino operator, posted 552.5 million euros ($609.24 million) in earnings before interest, tax, depreciation and amortisation (EBITDA) for 2022. It had close to 2.3 billion euros of net debt in 2022, or four times its EBITDA, based on its latest annual accounts.",
        "Based on Lottomatica's valuation, Cirsa could be worth several billions of euros, including debt.Blackstone acquired Cirsa in 2018 at an enterprise value of 2.2 billion euros, according to Refinitiv. It was reported in 2021 by the local media to be exploring an IPO of the group but a deal never materialised. ($1 = 0.9069 euros) (Reporting by Amy-Jo Crowley, Pablo Mayo Cerqueiro and Andres Gonzalez in London; editing by Elisa Martinuzzi and Jane Merriman)"
    ]
}