{
    "articleURL": "/wires/afp/article-12056481/Sudan-maternity-hospital-fights-save-lives-fire.html",
    "content": [
        "When a maternity hospital in the Sudanese capital came under bombardment, Esraa Hesbalrasoul snatched her premature twins from an incubator and rushed out in a panic.",
        "In the chaos, only one of the infants survived.Hesbalrasoul now tends to her baby in a small hospital in the capital's twin city of Omdurman that for weeks has struggled to weather the near-ceaseless fighting.Numerous medical facilities have been shelled in the fighting that broke out on April 15 between rival generals and the forces they command.The battles have left only 16 percent of hospitals in Khartoum fully functional, according to the United Nations, putting countless lives at risk.But the small Al-Nada hospital in Khartoum's twin city of Omdurman remains a lifesaver, keeping its doors open to offer vital health care despite the mounting odds.When strikes shook the ground on April 20 around the facility initially caring for the twins, \"we were told we had to evacuate everyone right away\", Hesbalrasoul told AFP.\"There were no ambulances available so we had to transport our babies as best we could,\" she said.\"But one of them died because of the lack of oxygen.\"",
        "Her tragedy is hardly an isolated one.The UN estimates that there are \"219,000 pregnant women in Khartoum, including 24,000 women expected to give birth in the coming weeks\".Al-Nada is one of the rare facilities they can turn to.Its director, Mohammed Fattah al-Rahman, in particular credits a generous donation from the Sudanese American Physicians Association (SAPA-USA), which has allowed it to keep running.",
        "With this money, \"we have been able to deliver 500 births, naturally and through caesarian sections, and to admit 80 children\", he told AFP, surrounded by premature babies in incubators.But the war is never far from the dimly-lit facility. Sounds of gunfire and blasts can often be heard echoing in the distance.There is no air conditioning, only overhead fans that attempt to relieve the heat which often reaches up to 40 degrees Celsius (104 Fahrenheit) even before the blazing peak of summer.As the war rages, killing hundreds and injuring thousands so far, much of Sudan's meagre medical resources have been diverted to tending the war-wounded with urgent care.\"There have been no obstetrics or paediatric services since the beginning of the conflict,\" Rahman says.That meant that Sudanese couple Fatima and her husband Jaber could find no facilities to treat their young son for meningitis, until they arrived at Al-Nada, which offers paediatric care as well as maternity facilities.- Fear of 'collapse' -Even before the war broke out, mothers and children faced grave dangers in Sudan, one of the world's poorest countries.Almost three out of every thousand women die in childbirth in Sudan, eight times higher than the figure in neighbouring Egypt, according to the UN children's fund, UNICEF.",
        "It says 56 out of every 1,000 Sudanese children die before reaching the age of five.",
        "Last year, the UN estimated that one in three Sudanese needed to walk more than an hour to get medical care.Today, the small team that keeps the Al-Nada hospital going fears conditions will soon force them to stop their essential work.\"Our stocks of medicines are starting to dwindle,\" said Alaa Ahmed, a pharmacist at the hospital. \"If it goes on like this, everything will collapse.\"The prospect of getting more supplies from the government warehouse on the other side of the Nile River is not only unlikely -- it is closed and unaccessible -- but possibly deadly while combat rages.As a result, Ahmed laments, \"a lot of people ask me for medicine but unfortunately I can't give it to them\"."
    ]
}