{
    "articleURL": "/tvshowbiz/article-12053905/Domenica-Calarco-Ella-Dings-podcast-reaches-3-million-downloads-despite-scathing-reviews.html",
    "content": [
        "Domenica Calarco and Ella Ding have kept themselves relevant through their outspoken podcast after appearing on Married At First Sight last year. ",
        "Almost one year after starting their Sit With Us podcast, the besties are celebrating three million downloads. They posted a photo of themselves smiling and hugging to their official Instagram page, as they announced the exciting news to their almost 70k followers. Alongside the photograoh, Dom, 30, and Ella, 29, wrote: 'Crazy to think we have had 3 million downloads in less than a year! Big thanks to everyone to supports us! We love you all'. On the podcast, the women speak about their love life's after being on Married At First Sight, reality TV, and pop culture. ",
        "They received glowing reviews about the podcast on their three million downloads celebration post. One person wrote: 'You deserve every success. Your podcast is one of my favourites. I listen every week. You are authentic people and your genuine friendship shines through.'While another said: 'Congratulations on not only your wonderful hard work and success, but for showcasing and highlighting such interesting challenging and at times sensitive topics.' ",
        "And a third commented: 'You deserve every success. Your podcast is one of my favourites. I listen every week.'However, when the podcast was first released it wasn't all good reviews, with some branding the former MAFS brides as 'immature'.'I really liked both girls on MAFS but unfortunately, their true colours and immaturity are now showing in this podcast,' one person wrote. ",
        "Another said: 'It's nothing special, which is a bit disappointing. For two women who purported themselves to be progressive feminists with unique views - this podcast doesn't do anything that a hundred other lifestyle and dating podcasts aren't already doing.'"
    ]
}