{
    "articleURL": "/femail/article-12053591/Where-Prince-Louis-coronation-ceremony.html",
    "content": [
        "The youngest Wales sibling left his seat for parts of Westminster Abbey serviceREAD MORE: King Charles' Coronation LIVE Prince Louis delighted crowds as he travelled to Westminster Abbey this morning for the historic Coronation of King Charles - but he was not in his seat for the entire ceremony. ",
        "The youngest Wales sibling, five, was whisked away for part of the service after joining his parents and Princess Charlotte in the procession to the abbey, but later reappeared for the National Anthem. While his nine-year-old brother Prince George, who is second in line to the throne, was a page of honour during the historic ceremony, the Prince and Princess of Wales had a special plan for their youngest son.Some eagle-eyed royal fans spotted that Louis was taken away from his seat next to Kate Middleton during the ceremony, and wondered if he'd been told off. However, it was always the plan that the youngster would retire for some parts of the ceremony, which would have been a long time to sit still for the five-year-old.  ",
        "After putting on a very professional (and cheeky) display during the procession, little Louis sat down with his sister Charlotte and next to his mother the Princess of Wales. He later took to the wings for a break on what is to be a very long day for the young royals.Royal fans were quick to spot the prince's absence, with some wondering whether he was retired for the rest of the ceremony. While some people suggested that the royal had been removed from the row because of his cheeky antics, it was always the plan that the youngster take some time to rest away from the cameras during the momentous day.  ",
        "'Need to know where Prince Louis has gone, bet he was playing up bless his heat, long time for him to sit still, surprised he was there tbh, gotta love him,' one fan said. 'We seem to have lost Prince Louis, he did a fine job,' another said. 'Looks like Prince Louis has been taken out of the chapel. Every parent who's tried to get a fidgety five-year-old to sit still for an hour will sympathise with Kate and William right now,' one wrote. However, Louis later returned to his seat for the last part of the ceremony, and was spotted during the National Anthem.  ",
        "As Prince George, nine, and Princess Charlotte, who turned eight this week, were on their best behaviour at the Abbey, the younger generation of royals put their best foot forward to represent the family.But at just five years old, it was decided ahead of time by Kate, 41, and William, 40, that Louis should only take part in a section of the day. Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head. The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. ",
        "He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' ",
        "He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen' and 'thank you William'.The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign. Minutes later Camilla was crowned. As Andrew Lloyd-Webber's Coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.The monarch and his wife Queen Camilla had smiled at each other and to the congregation as they walked through the church before and after the Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry."
    ]
}