{
    "articleURL": "/wires/reuters/article-12044727/Marcell-Ozuna-powers-Braves-past-Marlins.html",
    "content": [
        "Marcell Ozuna hit a grand slam and a solo homer against his former team as the Atlanta Braves defeated the host Miami Marlins 14-6 on Wednesday night.",
        "Kyle Wright, who topped the majors in wins last season at 21-5, left the game early. Atlanta was leading 8-3 with no outs in the third inning when Wright departed due to right-shoulder soreness. He allowed six hits, one walk and four runs (three earned) with three strikeouts.The Wright issue happened on a night the Braves got 18 hits, including six homers.Ozuna, who played the first five years of his major league career with the Marlins, entered Wednesday batting just .111 with two RBI. But he had a huge game, going 3-for-5 with five RBIs and three runs.Ozzie Albies also had a big game, going 4-for-5 with a single, two doubles, one homer and two RBIs.In addition, the Braves got a three-homer by Ronald Acuna Jr. and two-run blasts by Michael Harris II and Austin Riley.Harris later left the game after taking an awkward step while running to first base.Braxton Garrett (1-1) took the loss, allowing 14 hits, two walks and 11 runs with three strikeouts in 4 1/3 innings. His ERA increased from 2.45 to 5.81.The Braves are 14-3 on the road this season, and they have won seven of their past nine games overall.Miami, which entered this series on a four-game win streak, has dropped two straight. The Marlins are 1-5 against Atlanta.",
        "Atlanta sent 12 batters to the plate in the second inning to go up 7-0. The Braves' first seven batters reached -- and all of them scored. The big blows, in order, were Ozuna's grand slam, Harris' two-run homer and Albies' RBI double off the left-field wall.Miami got two runs back in the bottom of the second. Jesus Sanchez led off with a single, and Jean Segura doubled to start the rally. Sanchez scored on Nick Fortes' groundout. Segura scored when Braves shortstop Vaughn Grissom threw high to first base on speedy Jon Berti's two-out chopper.Ozuna jumped on the second pitch of the third inning as his solo homer gave Atlanta an 8-2 lead.In the bottom of the third, Miami bashed five hits, including Luis Arraez's RBI double and Fortes' run-scoring single.The Braves surged ahead 13-4 in the fifth on the homers by Acuna and Riley.In the seventh, Miami's Xavier Edwards singled for his first major league hit before scoring on Sanchez's two-run homer.Marlins catcher Jacob Stallings pitched a scoreless inning in the ninth, striking out Acuna looking at an 85-mph fastball.--Field Level Media"
    ]
}