{
    "articleURL": "/wires/pa/article-12061123/Everton-stun-Brighton-boost-survival-hopes-Southampton-brink.html",
    "content": [
        "Everton stunned Brighton with a 5-1 win on the south coast that moved the Toffees out of the relegation zone on a day that left Southampton in deep trouble and edged Leicester closer to the drop.",
        "Just three matches, all with big implications at the bottom, produced 21 goals as sorry Leicester went down 5-3 at Fulham, dropping into the relegation zone along with Leeds as Nottingham Forest climbed out with a 4-3 win over basement boys Southampton.The biggest smiles were on Everton faces as fans celebrated only their second league away win of the season, and one of the more unlikely results of the campaign, as they took out some of their considerable frustrations on Europe-chasing Brighton.A quick break saw Abdoulaye Doucoure poke Everton in front after just 34 seconds, and the Mali midfielder made it 2-0 just before the break as he met Dwight McNeil’s cross with a stunning strike.Alex Iwobi was trying to set up Doucoure for a hat-trick six minutes later but when he over-hit his pass, McNeil picked up the loose ball and struck a cross which went in off Jason Steele for an own goal.Brighton boss Roberto De Zerbi made four changes at the break and his side were much improved, but Everton hit them on the break in the 76th minute when McNeil rounded Steele, celebrating the fourth goal before he even applied the finish.Although Alexis Mac Allister got one back soon after, finally beating the superb Jordan Pickford, there would be no denying Everton a huge win as McNeil added an emphatic strike in stoppage time.",
        "That puts the Toffees 17th, two points clear of the bottom three but still one behind Forest, who took a step away from the trapdoor by pushing Southampton all but through it.Taiwo Awoniyi scored twice in four minutes midway through the first half to put Forest in control, first sweeping home Brennan Johnson’s low cross, then rifling in a volley when Southampton failed to clear.The visitors were back in it soon after when Carlos Alcaraz slotted home but the two-goal Forest lead was restored from the penalty spot by Morgan Gibbs-White after Ainsley Maitland-Niles caught Johnson.Lyanco’s 51st minute header restored Southampton belief and the visitors were on top until Forest broke away with 17 minutes left and Danilo lifted the ball over Alex McCarthy.James Ward-Prowse converted a stoppage-time penalty but there was no avoiding a defeat that leaves the Saints eight points adrift with three to play.",
        "The goal rush had started earlier in the day at Craven Cottage, where Fulham tore into Leicester to end their three-game unbeaten run and leave them second from bottom.Leicester, who started the day outside the relegation zone on goal difference alone, were ripped apart in the first half as Willian, Carlos Vinicius and Tom Cairney gave Fulham a commanding 3-0 lead before the break.",
        "Cairney then got his second early in the second half before Leicester finally woke up, too late to change the outcome.Harvey Barnes pulled one back but Willian’s second made it 5-1 before Barnes scored again and James Maddison added a late penalty to at least limit the damage to Leicester’s goal difference."
    ]
}