{
    "articleURL": "/news/article-12053417/Woman-lost-Mitta-Mitta-bushland-five-days-Bright-Victoria-helicopter.html",
    "content": [
        "Lillian Ip, 48, got lost in the Victorian bush The visitor's car got bogged at a dead endPolice found her after five days on her ownShe ate lollies and downed wine to stay aliveA 48-year-old woman has been found after being lost in dense bushland for five days when her vehicle was bogged in mud and she hit a dead-end. ",
        "Lillian Ip got stuck in the Mitta Mitta wilderness without phone reception on April 30 while travelling around Bright in Victoria's north-east.She sucked on lollies and downed a bottle of wine she had bought for her mother to keep her fluids up during the ordeal. The woman's family raised the alarm after she didn't make her daily check in on Sunday. She had been driving to Dartmouth Dam when she realised she had taken a wrong turn. ",
        "While trying to turn around and backtrack, the Cheltenham woman's car became bogged in mud and without mobile coverage she wasn't able to call for help. She was unable to walk to get help so she stuck it out remaining at her vehicle at the Yankee Point Track for the week. The decision could have been a lifesaver as the nearest town was 60km away. Rescue crews scoured the Mitta Mitta, Wodonga, Bright and Albury areas but were unable to locate her for five days. On Friday Ms Ip's vehicle was finally spotted by a police Air Wing chopper as officers continued searches throughout the hilly terrain. A police vehicle was then directed to where she was with aerial footage of the rescue being videoed from the helicopter. Aerial vision of the dramatic rescue showed Ms Ip standing on a dirt track donning a big chequered coat while frantically waving at a police helicopter.",
        "Ms Ip gestured up and down as a police vehicle pulled up on the dirt road in front of her before officers emerged from the car. One of the officers threw his hands in the air as he walked towards her before he and his partner lead her to safety.The policemen then gestured a thumbs up to officers in the chopper. Lillian was taken to hospital for observation and to be treated for dehydration.Wodonga police station sergeant Martin Torpey said she had only planned a short-day trip so she only had meagre rations. ",
        "'She had only taken a couple of snacks and lollies with her but no water,' Sergeant Torpey said.'The only liquid Lillian, who doesn't drink, had with her was a bottle of wine she had bought as a gift for her mother, so that got her through.'She used great common sense to stay with her car and not wander off into bushland, which assisted in police being able to find her.'After being lost in the bush for five days, she was extremely relieved and grateful to see us and we were just as happy to see her.' "
    ]
}