{
    "articleURL": "/femail/article-12047873/Kate-William-meet-TikTok-royalty-Prince-Princess-verdict-Elizabeth-line.html",
    "content": [
        "TikToker was invited to join the couple on the Tube to reach a 'younger audience'For all the latest Royal news, pictures and video click hereAs two of the most senior members of the Royal Family, the Prince and Princess of Wales are used to meeting people from all walks of life.",
        "But yesterday, the royal couple brushed shoulders with internet royalty when they filmed a hilarious video with TikTok star Francis Bourgeois. Prince William, 40, and Kate Middleton, 41, travelled from Acton to Tottenham Court Road on the Elizabeth Line to visit the Dog and Duck pub in Soho.In attempt to reach a 'younger audience', Palace aides invited the train enthusiast - who lives in Battersea, London, and boasts over 2.9m followers on the video app - to meet the royal couple at the end of their journey.This evening, the 22-year-old social media star - whose real name is Luke Nicolson - posted a hilarious video his interaction with Kate and William. ",
        "The short clip opens with Luke walking through the newly-refurbished Tottenham Court Road station wearing his trademark GoPro.He said: 'Have you ever found yourself at Tottenham Court station wanting to go Eastbound and the train you're wanting to get is ready to go?'Well, me too. Pretty much every time.' The TikToker then proceeds to sprint through the station as footage shows a close-up of his face filmed using the fish-eye lens. After making it on to the tube just as the doors close, Luke grabs hold of the handrail before then collapsing into an empty seat.  As he recovers from the sprint, the TikToker spots Kate and William getting ready to leave the tube. ",
        "Before stepping off the train, Kate - dressed in a bespoke Eponine coat and holding a white Mulberry bag - goes to shake his hand.Beaming at Luke, Kate says: 'Very nice to meet you.' ",
        "After also being greeted by Prince William, a starstruck Luke struggles to get his words out and simply says: 'Hi. Um, nice to meet you.'I hope you enjoyed the Elizabeth Line!'Smiling at his wife, William says: 'We have, it's been good! Have a good day. See you later.'Stunned by the royal interaction, Luke then says 'cheerio' before collapsing in his seat again.Posting the clip on his social media accounts this evening, Luke jokingly captioned the video: 'The Elizabeth line sprint at Tottenham Court Road is quite enjoyable once you get used to it!'",
        "On Instagram, Kate and William's official account replied with a waving emoji and wrote: 'Nice to see you!' Since it was uploaded this evening, Luke's video has amassed over 19,700 'likes' on TikTok and a further 23,700 on Instagram.Luke went viral on TikTok in 2021 when he was still a Mechanical Engineering student at Nottingham University and began sharing clips of himself travelling around the country to spot his favourite trains. It was the couple's first trip on the Elizabeth Line, which the late Queen Elizabeth opened almost a year ago on May 17, 2022. ",
        "Royal aides said the couple do 'occasionally' travel by tube in a private capacity. 'What's the feedback you've been getting since it opened?' William asked.  'Everyone loves it,' TFL worker Mr Grindley told him, explaining how it had made many journeys across London shorter and easier.'And how green are we now,' asked William, laughing. 'You know I've got to ask that question!'",
        "William heard how the line's trains are electric, and how much of the earth that was dug up to build the line, was moved and re-used for a nature reserve. 'It's good, it clearly gets thought about now,' he said.Speaking to Miss Serco about the opening of the line last year, William said: 'I can't quite believe it has been nearly a year. It's quite nice to get the chance to see it all, after my grandmother opened it.'Asking the group which of them would be working this weekend, Kate asked: 'Do you think there's going to be extra pressure on the service during the coronation weekend? How do you manage that?'One of the group then asked how the royal family's preparations were going, and Kate replied: 'Yes, it's going to be a very busy time. We're getting there. I still feel like we're trying to get ducks in a row.'",
        "After the short journey from Acton, via Paddington to Tottenham Court Road, the couple were presented with gifts by Mr Lord – a plaque tile of a TFL Roundel, or 'Crowndle' as Mr Lord described it, inscribed with 'King Charles III,' and a TFL roundel lightbox for Prince George, Princess Charlotte and Prince Louis.Dozens of stunned onlookers then rushed towards the escalator with their phones, to film the couple as they made their way up the escalator.Speaking after the couple had left the station, Mr Lord said: 'It was amazing to welcome them on their first visit on the Elizabeth Line. It's coming up to the anniversary of the Queen opening it, and they were very impressed with it.'"
    ]
}