{
    "articleURL": "/wires/afp/article-12061577/Canada-expels-Chinese-diplomat-alleged-intimidation-plan.html",
    "content": [
        "Ottawa said Monday it would expel a Chinese diplomat accused of having sought to intimidate a Canadian lawmaker critical of Beijing, plunging the two nations into a new diplomatic row.",
        "Foreign Minister Melanie Joly declared the diplomat \"persona non grata\" and said Canada would \"not tolerate any form of foreign interference in our internal affairs.\"\"We remain firm in our resolve that defending our democracy is of the utmost importance,\" she said, adding that foreign diplomats in Canada \"have been warned that if they engage in this type of behavior, they will be sent home.\"The move aggravated already strained Sino-Canadian relations, with China saying Canada had \"sabotaged\" relations between the two nations.\"The Chinese side will take resolute countermeasures and all consequences arising therefrom shall be borne by the Canadian side,\" a statement from the Chinese embassy in Canada said, calling on Ottawa to \"step back from the brink.\"Beijing said it had filed an official protest over breaches of international law and diplomatic norms, and accused Canada of \"deliberately undermining relations\" with its second-largest trading partner.According to a source familiar with the matter, Zhao Wei, an official at the Chinese consulate in Toronto at the heart of the affair, has been asked to leave Canada within five days.His expulsion followed an outcry led by parliamentarian Michael Chong over allegations revealed by local media that China's intelligence agency had planned to target Chong and his relatives in Hong Kong with sanctions for voting in February 2021 for a motion condemning Beijing's conduct in the Xinjiang region as genocide.",
        "This was \"almost certainly meant to make an example of this MP and deter others from taking anti-PRC (People's Republic of China) positions,\" the Globe and Mail newspaper last week cited a Canadian Security Intelligence Service document as saying.- 'Gamble' -Canadian Prime Minister Justin Trudeau has faced growing pressure to take a hard line with Beijing following revelations in recent months that it sought to sway Canada's 2019 and 2021 elections.The latest allegations were used by his critics to further accuse him of inertia in the face of foreign meddling.\"There was a real political risk for the Trudeau government in this affair, which is taking a gamble by showing its muscles in this way,\" said Genevieve Tellier, a politics professor at the University of Ottawa.Relations between Beijing and Ottawa have been tense since Canada's arrest in 2018 of a top Huawei executive and the detention of two Canadian nationals in China in apparent retaliation.All three have been released, but Beijing has continued to blast Ottawa for aligning with Washington's China policy while Canadian officials have regularly accused China of interference.After China's ambassador was summoned last week over the latest interference allegations, Beijing on Friday slammed what it called \"groundless slander and defamation\" by Canada.",
        "The Chinese foreign ministry insisted the scandal had been \"hyped up by some Canadian politicians and media.\"On Monday, Chong told reporters in Ottawa: \"It shouldn't have taken the targeting of a member of Parliament to make this (expulsion) decision.\"\"We have known for years that the PRC is using its accredited diplomats here in Canada to target Canadians and their families,\" he said.He said Canada has become \"a playground for foreign interference,\" including the harassment of diaspora communities.Roromme Chantal, a China expert at the School of Advanced Public Studies in Moncton, told AFP that Canada should expect retaliation to take the form of \"the expulsion of a Canadian diplomat if not several diplomats.\"Beijing, he said, \"could also take economic reprisals, as a way of sending a message to other countries that are talking about interference.\"burs-je/oho/cwl"
    ]
}