{
    "articleURL": "/wires/reuters/article-12045877/Cycling-Evenepoel-Roglic-gear-Giro-battle.html",
    "content": [
        "May 4 (Reuters) - Remco Evenepoel and Primoz Roglic will lock horns again in the year's first Grand Tour when the Giro d'Italia begins on Saturday with cycling fans anticipating a renewal of the battle that was sadly interrupted at last year's Vuelta a Espana.",
        "Belgian tyro Evenepoel won his first Grand Tour race after Slovenian Roglic crashed on stage 16, ending what had been a stunning fightback by the Olympic road TT champion.They will start as leading favourites for the Maglia Rosa in the 106th Giro -- a three-week haul that starts at Fossacesia Marina on Italy's Adriatic Sea coast, covers 3,489 kilometres, climbs 51,000 metres and includes five brutal mountain stages.The 23-year-old Evenepoel (Soudal-Quick-Step), who made his Grand Tour debut at the 2021 Giro, has already shown great form this season and arrived in Italy on the back of winning the final spring classic, Liege-Bastogne-Liege.With two flat time trials in the first nine stages, Evenepoel will be looking to gain time on Jumbo-Visma rider Roglic, but some doubts remain about his durability when the steep mountain stages come thick and fast later in the race.Roglic, third in 2019, silenced doubts about his recovery from the crash that ended his charge for a fourth Vuelta title, by winning three stages at Tirreno-Adriatico and the GC.And he will already have marked stage 20 as potentially decisive -- an 18km time trial up a vicious climb near the Italian border with Slovenia, almost home road for Roglic.But there are many obstacles to overcome before then over a course that will expose any chinks in the armour.",
        "\"It's interesting to see them fighting again after the Vuelta last year,\" three-time Giro stage winner Philippe Gilbert, who will be analysing the race for Eurosport, told Reuters. \"They know each other and I just hope they stay fit and healthy until the end with no crashes.\"Gilbert says the three time trials could be worth as much a minute for the GC contenders and believes that Roglic will bide his time and wait to make his move later in the race.While much of the focus will be on the two race favourites, several other dangermen are in the field with INEOS Grenadiers having a powerful looking line-up including 2020 Giro winner Tao Geoghegan Hart and former Tour de France winner Geraint Thomas.Portugal's Joao Almeida (UAE Team Emirates) will also be eyeing the podium while France's Thibaut Pinot (Groupama-FDJ) will hope to make his mark as he races his final Giro.Away from the GC battle there will be some intriguing sub-plots too with sprint king Mark Cavendish (Astana Qazaqstan) chasing stage wins with opportunities in the first week.Home favourite Filippo Ganna could light the blue touchpaper in Saturday's 19.6km time trial when the Italian powerhouse will be favourite to be the first rider to slip on the maglia rosa.",
        "Sunday's stage is a flattish 201km ride from Teramo to San Salvo while the first big moves in the GC classification may come on stage seven with the summit finish at Gran Sasso d'Italia after a 45km uphill drag. (Reporting by Martyn Herman Editing by Toby Davis)"
    ]
}