{
    "articleURL": "/tvshowbiz/article-12057303/Susan-Boyle-makes-rare-outing-reunites-comedian-Peter-Kay.html",
    "content": [
        "Susan Boyle delighted fans as she made a rare outing this weekend and reunited with comedian Peter Kay 12 years after they collaborated on their Comic Relief single I Know Him So Well.",
        "The singer, 62, who rose to fame on Britain's Got Talent in 2009, was seen posing with Peter, 49, in a picture shared on her Instagram page on Saturday.Scottish star Susan looked stylish in a tweed jacket as she posed with comedian Peter who put his arm around her shoulder.The caption on Susan's Instagram post read: 'A reunion 12 years in the making! Susan Boyle &amp; Peter Kay back together again after she went to see his hilariously brilliant show “Peter Kay Live” in Glasgow.'How has it been 12 years since their Comic Relief video came out?!'",
        "Peter and Susan first teamed up to record the song I Know Him So Well from the musical Chess in 2011, with the track being recorded by Elaine Paige and Barbara Dickson in the eighties.And fans were delighted to see the pair back together and Susan out and about.Taking to the comments section of her post, one person wrote: 'GO SUSAN!', while someone else remarked: 'That is so sweet.'Another person wrote: 'Beautiful Susan! So glad to see you doing well.'While someone else shared: 'Susan is an example to be followed!!!! And her voice is unique!'It comes after Susan made a rare outing as she enjoyed a getaway in Ireland recently.",
        "The former Britain's Got Talent sensation made a surprise trip to the Emerald Isle, visiting the Knock House Hotel in Mayo.Bosses at the hotel shared a picture of the singer on their Facebook page, writing: 'It was our pleasure to welcome Susan Boyle back to Knock House again recently. ",
        "'Susan is a fabulous Lady and we always love to see her return time and time again to Knock House Hotel. 'Pictured here with the lovely Des Dugan from the team at Senior Times LIVE!'Musical performer Susan rose to international fame after she competed on the third series of Britain's Got Talent in 2009.She grew up in Blackburn, West Lothian, in Scotland, and while she experienced huge success as a singer, she did not move far from her roots.Susan still lives in her childhood home after knocking through the wall to the adjoining property next door. It comes after Susan's first audition was voted as the most iconic moment in the show's history last year, with 71 per cent of the public agreeing.The Scottish singer shocked the judges and live audience with her powerful voice when she performed I Dreamed A Dream from Les Miserables.Judge Piers Morgan said: 'Without a doubt that was the biggest surprise I have had in three years of this show. ",
        "'That was stunning, an incredible performance. I'm reeling from shock.'Amanda Holden added: 'I think that's the biggest wake-up call ever. ",
        "'It was a privilege listening to that.'Her audition quickly went viral around the world and she went on to reach the final of the show, coming in second place to dance troupe Diversity.Susan's debut album I Dreamed A Dream became the UK's best-selling debut album of all time and set a record for first week sales by a debut album, according to the Official Charts Comapny.She went on to become one of Britain's Got Talent's most successful acts ever and has sold over 19million albums worldwide."
    ]
}