{
    "articleURL": "/health/article-12043003/Doctors-perform-brain-surgery-baby-moms-WOMB.html",
    "content": [
        "Surgeons cured a child's rare, potentially deadly, birth defect while in the wombIt is the first ever brain surgery performed on an unborn child, experts sayREAD MORE: How risky stem cell transplant cured HIV in many suffering disease Doctors have saved an unborn baby from certain death after performing a first-of-its-kind brain surgery while the child was still in the womb.",
        "A ten-strong team at the Boston Children's Hospital and Massachusetts General Hospital carried out the meticulous procedure, which involved cutting into the womb, the baby's skull and then operating on the developing brain.The baby was diagnosed with vein of Galen malformation at 30 weeks. Children born with the condition have a 30 percent chance of dying before age 11.The condition — which affects one in 60,000 babies — occurs when arteries in the brain drain blood directly into the veins instead of capillaries. This floods the heart with blood and could lead to dangerously high blood pressure.",
        "The operation, performed by doctors in Boston, was performed by slicing into the pregnant woman's abdomen and using an ultrasound to identify the artery and guide the surgery.The woman gave birth to a healthy child two days later, and he was born without birth defects. Researchers are working with the Food and Drug Administration (FDA) to perform trials on this surgery's safety and effectiveness, hoping to expand use.'The fetal intervention team at Boston Children's Hospital and Brigham and Women's Hospital have successfully devised another in utero procedure that may be very impactful,' Dr Gary Satou, a cardiologist at the University of California, Los Angeles who was not involved in the research, said. ",
        "The surgery was documented in a case study published Wednesday in the American Heart Association's journal Stroke. Doctors identified the malformation in a woman who was 34 weeks into pregnancy.",
        "Tannaz Ameli has been declared cancer free after receiving the surgery in June.",
        "Using an MRI, they identified an overly wide falcine sinus — a curved vein in the brain that drains the artery. This tells surgeons there was a 99 percent chance that the malformation would occur. Doctors used a needle to breach the woman's lower abdomen. Then, using ultrasound to pinpoint the correct spot, they cut into her uterine wall.Surgeons then proceeded to slice into the unborn child's brain and perform surgery to implant a coil near the artery that would restrict blood flow.'This approach has the potential to mark a paradigm shift in managing vein of Galen malformation,' Dr Darren Orbach, a surgeon at Boston Children's Hospital, said.'We [repaired] the malformation prior to birth and head off the heart failure before it occurs, rather than trying to reverse it after birth.'This may markedly reduce the risk of long-term brain damage, disability or death among these infants.' After a successful operation, they induced labor in the woman two days later. This is because the operations ruptured tissue surrounding the baby in the womb that holds fluids in — also known as the 'water breaking'.",
        "The child was born with limited complications at 4.2 pounds — light for a newborn baby.Three weeks after birth, the child did not require any cardiovascular assistance. MRI scans also found no sign of abnormal blood flow in the brain.'We were thrilled to see that the aggressive decline usually seen after birth simply did not appear,' Dr Orbach said. 'We are pleased to report that at six weeks, the infant is progressing remarkably well, on no medications, eating normally, gaining weight and is back home. 'There are no signs of any negative effects on the brain.'",
        "The condition occurs when the circulatory system does not properly form in the pregnancy's first trimester.The anterior choroidal artery at the brain's center drains blood into capillaries — small blood vessels connecting blocks to the veins. They almost serve as speed bumps, controlling how fast blood moves from arteries into the body's swathing network of veins.However, this system could be disrupted if the veins and capillaries do not properly develop in the womb.In children who suffer from vein of Galen malformation, blood goes straight into the veins, skipping the capillary.This leads to the artery draining blood into the circulatory too quickly. In turn, a person's blood pressure will sharply rise as the increase in flow causes more pressure on the rest of the circulatory system.",
        "Over time, this can restrict blood flow to the heart, lungs and other vital organs, potentially leading to failure. Increased high blood pressure also dramatically increases the likelihood of suffering heart disease.A 2019 study by French researchers found 36 percent of children with the condition had died by age 11.Current treatment for the malformation includes a brain embolism, where fat is used to restrict blood flow and act as the capillaries do.However, surgeons believe they can act even before the child is born to prevent them from suffering complications while alive.This operation is the first in a clinical trial being performed to gauge whether this surgery is a proper treatment for the condition. Doctors have received FDA approval for their work. 'As always, a number of these fetal cases will need to be performed and followed in order to establish a clear pattern of improvement in both neurologic and cardiovascular outcomes,' Dr Satou said. 'Thus, the national clinical trial will be crucial in order to achieve adequate data and, hopefully, successful outcomes.' "
    ]
}