{
    "articleURL": "/wires/ap/article-12045039/New-Orleans-musics-old-guard-star-Jazz-Fest.html",
    "content": [
        "NEW ORLEANS (AP) - Bassist George Porter Jr. and drummer Zigaboo Modeliste played the very first New Orleans Jazz &amp; Heritage festival in 1970 with their groundbreaking funk band The Meters. More than 50 years later, The Meters are no more, but Porter and Modeliste are still among the festival's mainstays.",
        "So are singer Irma Thomas, the renowned \"Soul Queen of New Orleans,\" who first played the fest in 1974; and guitarist and singer Deacon John Moore, also a regular since 1970.\"Originally it was all local bands,\" Porter said in a recent interview, reminiscing about days when he would close down one Jazz Fest stage with The Meters and run with Modeliste to another stage for a final set with piano legend Professor Longhair. \"Local and regional bands - meaning Baton Rouge, Lafayette - those acts were always the headliners,\" he said.Plenty of nationally and internationally known acts populate the roster for the 2023 festival, which includes current megastars like Lizzo and Ed Sheeran and long-established crowd-pleasing artists like Santana and the Steve Miller Band.Still, longtime Jazz Fest producer Quint Davis would argue that the home-based acts remain the real headliners.Jazz Fest unfolds over seven days that play out over two long weekends. When it's over Sunday night, around 580 acts will have played on more than a dozen stages. Davis estimates close to 500 of them are from New Orleans or southwest Louisiana. \"That´s what the festival´s built on,\" he said.",
        "Thus, preceding Lizzo on one of the festival's biggest stages last Friday were two New Orleans acts, Big Freedia, then Tank and the Bangas. Louisiana-rooted bands Sweet Crude and The Revivalists were on that same stage Saturday before Sheeran performed. Another veteran of The Meters, guitarist Leo Nocentelli, performed Sunday.",
        "Thomas takes the big stage this Friday evening before Jon Batiste (a New Orleans-area native) closes. Porter and his band Runnin' Pardners play that stage Saturday, followed by Anders Osborne, then the Preservation Hall Jazz Band - all New Orleans acts - before John Mayer takes the stage with Dead &amp; Company.Once a small affair that drew about 350 people to Louis Armstrong Park near the French Quarter, the festival now overflows the vast infield of the historic Fair Grounds horse racing track.Moore, who turns 82 in June, doesn´t mind the influx of big-name pop acts that don´t necessarily have a Louisiana connection.\"We have to bring those kind of bands in to attract younger people to come to the festival,\" he said. \"They´ll be exposed to the indigenous culture and the older musicians and the other genres of music that the festival promotes, like Zydeco, Cajun, R&amp;B, folk, jazz, traditional jazz, avant-garde jazz - the whole thing.\"Festival elders like Porter, 75; Thomas, 82, and Moore are the contemporaries of departed greats such as Fats Domino, Dave Bartholomew, Dr. John, Alan Toussaint and others - royalty among New Orleans artists. They kept the city's musical legacy alive in the mid- and late-20th century with the evolving contemporary music of their time, much as jazz pioneers Louis Armstrong, Sidney Bechet and others did in the early 1900s.",
        "When Jazz Fest debuted more than 50 years ago, it provided a needed showcase for local musicians, some of whom had not seen financial benefits commensurate with their early recording success. Thomas, who started recording as a teenager, had national or regional hits including \"Wish Someone Would Care,\" \"It´s Raining,\" and \"Ruler of My Heart,\" by the time she first took a Jazz Fest stage in 1974. The festival was a kind of homecoming for Thomas, who lived at the time in California. And the gig was needed. She had sometimes supplemented her income with work at a department store.\"I worked at Montgomery Ward´s because my career wasn´t doing all that great,\" Thomas recalled.If, now, there is a lament among festival veterans, it´s that the cost of the festival - $95 per person per day, not including food and drinks - has put it out of reach for some in the city.Davis points to other festivals with higher prices and says the nonprofit that owns Jazz Fest distributes 8,000 free tickets per year. Also, there is a \"local day\" on the Thursday that opens the second weekend, when tickets for Louisiana residents are $50.And he speaks with pride about the uniquely Louisiana flavor of the festival - from the variety of foods at booths throughout the Fair Grounds to the Louisiana-based acts with a strong reputation. \"Our talent is really known nationally and internationally,\" he said.",
        "Among his examples, Davis noted the touring success of Trombone Shorty, who first appeared at Jazz Fest as a child and now traditionally closes the festival with his dynamic, brass-heavy blend of New Orleans funk, rhythm and blues and rock.Porter, despite expressing some concerns about ticket prices and what he sees as a somewhat diminished role for local Black artists in comparison to the early years, has high praise for the festival´s fidelity to local culture.\"I think they put the music, culture, the artistry - down from the food all the way up to the artists on stage - I think the New Orleans Jazz Festival does that better than anybody.\""
    ]
}