{
    "articleURL": "/femail/article-12041793/Im-washing-machine-expert-know-missing-socks-are.html",
    "content": [
        "A Tiktoker has discovered where socks go after they vanish during the laundryRenea, who is an appliance repair tech, from Salt Lake City, shared a video onlineRead More: TikToker reveals the reason statues of athletes have small penises As we rifle through our sock drawer in a rush every morning trying desperately to find a matching pair, we are left asking where on earth they have all vanished to - but a TikToker appears to have solved the mystery. ",
        "Renea, who is an appliance repair tech from Salt Lake City, shared a video on TikTok explained exactly where socks disappear to during the laundry cycle.In the clip, which racked up over 18 million views, she claimed that it's not down to forgetfulness - the washing machine actually does swallow them. In the video she can be seen removing the back panel off the washing machine with a chisel.Once the panel is off, the inside of the washing machine is completely stuffed with odd socks.",
        "Taking the pile out and laying the socks on the floor it was clear that the machine had been collecting odd socks for some time. Many were shocked with some joking they owe an apology to their tumble dryer for blaming that for years. One person wrote: 'All the years joking about how 'the dryer eats them'.'Another said: 'We all owe the dryer an apology.'While another quipped: 'Are my Tupperware lids in there too?'Others were completely shocked as they always thought it was an old wives tale. ",
        "One person said: 'So my washing machine does eat my socks!!!!!!'Another said: 'So that’s prob where my paw patrol sock that I lost when I was 3.'While someone else wrote: 'I always said that the washing machine has been eating my socks. I’m going fishing for my lost socks !!!!!'",
        "Renea's revelation comes after a savvy mother also revealed on TikTok how best to clean your washing machine using just two ingredients.Jen Watson, a mother-of-five from the US, revealed on her TikTok page titled OrganizedAndSimplified4u that a mixture of bicarbonate of soda and vinegar can clean the rim of the washing machine in just one cycle.In the short clip Jen pulled back the rubber part of the door in a washing machine to show all the built up scum and dirt before advising adding bicarbonate of soda and white wine vinegar.Applying around two tablespoons of the powder directly to the mess, she then poured over the liquid so the mixture immediately started bubbling.Quickly shutting the door, Jen put the machine on a rinse and watched as the cheap and easy solution worked its magic.As soon as it was over the mother pulled back the rubber lining to show it was now spick and span and clean enough for all your delicate washing."
    ]
}