{
    "articleURL": "/wires/pa/article-12050477/Liam-Gordon-feels-St-Johnstone-not-panic-despite-relegation-battle.html",
    "content": [
        "Liam Gordon is adamant St Johnstone will not panic after being dragged back into a relegation battle.",
        "The Perth men looked comfortable just a couple of months ago as they chased a place in the top six while other teams near the bottom struggled for form.But after failing to win any of their last seven games, they go into the post-split fixtures having allowed 10th-placed Dundee United and 11th-placed Kilmarnock to close to within two points of them, while they are just six points clear of last-placed Ross County.Captain Gordon – whose side needed a relegation play-off to survive last term – is adamant he and his colleagues will not allow the renewed threat to their cinch Premiership status to spook them.“It’s not rocked us at all,” he said ahead of Saturday’s showdown with United at McDiarmid Park. “It’s obviously a position we didn’t want to find ourselves in because of the position we were in (recently) but these things happen in football.“We had a couple of poor weeks and we find ourselves in this situation and it’s up to ourselves to get out of it but I wouldn’t say we’re rocked at all.",
        "“We know the task at hand, we’re all prepared and we’re ready to do it. The pressure is always high at any stage of the season but obviously it is coming to crunch time.",
        "“We’ve got five cup finals left, and it’s not just us who will be looking at it like that. But if we apply ourselves the way we know we can and keep to the level of performance we put in against Hibs (in the recent 1-1 draw), we should be good.”Gordon has been impressed by the manner in which his former team-mate Steven MacLean has handled himself since stepping up to become interim manager following the sacking of Callum Davidson last month.“He’s been really good,” said the defender. “He’s obviously been in a coaching role for a while so he’s got that experience under his belt but he’s always been very knowledgeable, you could see that from the way he played the game himself.“He had a great understanding of the game, he was a very clever player. He’s obviously his own man and he’s putting his own ideas across, and the players are really buying into it and enjoying it.“We’ve had a couple of good training weeks and the Hibs game was a good performance, so it’s been all positive. The boys are upbeat and we’re ready for the fight.”"
    ]
}