{
    "articleURL": "/news/article-12051839/Coronation-chicken-sold-Royal-fans-strip-supermarket-shelves-bare-ahead-big-day.html",
    "content": [
        "Shelves have been emptied ahead of a day of coronation parties tomorrowKing Charles Coronation LIVE: Royals at Buckingham Palace as Kate dazzlesBritain is up for a party and King Charles is the reason. Brits across the country are planning for raucous street parties and coronation dinners to celebrate the monarch's big day.",
        "Royal fans have stripped supermarket shelves bare as summer fruits, coleslaw and even pork pies disappeared ahead of the crowning of King Charles III tomorrow.Coronation Chicken has even sold out at Aldi and Lidl, an enthusiastic shopper reported.Leading supermarket Waitrose has even seen searches for coronation recipes quadruple ahead of the nation's royal festivities.Preparations for the coronation are nearing their completion with The Mall decorated with huge union flags and others from the Commonwealth and crash barriers and other crowd control measures in place.",
        "During the ceremony itself, the St Edward's Crown, which weighs about  4lb 12oz and dates back to 1661 and the reign of his namesake King Charles II, will be placed on Charles' head during the ceremony. Among the other historic items involved will be the golden Sovereign's Sceptre with Cross which holds the 530 carat Cullinan 1 diamond, also known as the Star of Africa and the world's largest colourless cut diamond.After the ceremony there will be a mile-long procession involving some 4,000 military personnel, with the newly-crowned King Charles III and Queen Camilla returning to Buckingham Palace in the four-tonne Gold State Coach, pulled by eight horses.Thousands are expected to line the route and millions more will watch on giant screens erected at 30 locations around Britain or at home, with the event set to be broadcast live around the world.",
        "Sainsbury's said sparkling wine sales are up 128 per cent year on year, with sales of Nyetimber soaring by 600 per cent as consumers choose to buy British for the coronation weekend.The store added it had sold 143.3 miles of bunting and 22,000 Charles and Camilla face masks ahead of coronation weekend.Searches for red, white and blue clothing are also up by 676 per cent on last week, the supermarket said, while searches at Argos for King Charles cardboard cutouts are up by 369 per cent over the last four weeks.",
        "Lidl said quiche sales were up 33 per cent as customers took inspiration from the official coronation dish, while sales of mini Scotch eggs and Melton Mowbray pork pies were up 15 per cent and 10 per cent respectively.The supermarket said it sold one of its coronation mugs every five seconds on the first day of sale, along with enough bunting to line the coronation procession route 75 times.Wine merchant Berry Bros. &amp; Rudd said sales of English sparkling wine were up 304 per cent on last year.Searches for 'Coronation Celebration' were up more than 500 per cent on Asda, while the store saw sales of the bunting are up 227 per cent.Beer sales are expected to be 25 per cent higher for the three-day weekend. ",
        "Meanwhile, a food firm is burning the midnight oil to produce millions of Scotch eggs and cocktail stick sausages for the nation's Coronation celebrations.Pilgrim's UK, of Ruskington, Lincolnshire, who supply major supermarkets and food catering businesses, have made twenty million cocktail sausages.They've also worked round the clock to produce 2.5 million Scotch eggs and almost 22 million mini scotch egg bites for pubs and street parties, not to mention knees-ups in people's houses.",
        "The truckloads of sausages to go on sticks, not to mention the Scotch eggs, will fill supermarket shelves - a welcome increase of 15 per cent on the usual weekly output.During the Queen's Jubilee celebrations last year, sales of snacking products increased by 20 per cent, and the forecast is for a similar bumper sale this weekend.With the producer supplying a host of leading retailers, shoppers looking for snacking goods are spoilt for choice, including new products such as Sainsbury's Soft Set Scotch Eggs and Waitrose's new Honey &amp; Mustard Cocktail Sausages.Kelly Eastwood, insight director at Pilgrim's UK said 'We love to come to come together to celebrate a special occasion in Britain and food is always at the heart of this.'The King's Coronation will be no exception and we're increasing production to help our retail partners meet the soaring demand expected for snacking products ahead of this momentous occasion.",
        "'It is important that retailers stock their shelves with both traditionally British and innovative new food and drink in the run-up to the weekend - with demand for scotch eggs, cocktail sausages and sliced-cook meat products set to rocket.'The King's Coronation is just the start for snacking. Over the summer months the seasonal uplift in sales will return, with an almost 22 per cent increase compared to the winter.'So, this is a good time for retailers to test our how they can make their snacking lines work harder, utilising promotions, in-store POS, and cross-merchandising to drive sales.'"
    ]
}