{
    "articleURL": "/tvshowbiz/article-12045007/Emily-Seebohms-radio-host-ex-offers-emcee-wedding-Ryan-Gallagher.html",
    "content": [
        "Olympic swimmer Emily Seebohm had an uncomfortable reunion with her ex-boyfriend during a live radio interview on Wednesday.",
        "Seebohm, 30, came face-to-face with Nova host David 'Luttsy' Lutteral when she was a guest on his breakfast show Ash, Luttsy and Susie O'Neill. The two had dated for a year from 2020 to 2021. She was there to discuss her future Olympic prospects, but things quickly became awkward when Lutteral asked about her new fiancé, MAFS star Ryan Gallagher. Seebohm had announced her engagement to Gallagher in March, just months after they met on the set of Channel 10 reality show The Challenge.'We really got along [on The Challenge]. The show is about people who stab you in the back, or [about how] you really can't trust people, and he is just one of the people that you can actually trust on reality TV,' she said of her husband-to-be.",
        "'We got on like a house on fire and then we came back and we basically were like, \"This is it,\"' she said. Things became even more awkward when Lutteral, who at 46 is sixteen years Seebohm's senior, jokingly offered to be the emcee at the couple's wedding.His co-hosts Ashley Bradnam and Susie O'Neill laughed nervously, before Seebohm replied: 'I think we might pass on that.'",
        "Lutteral and Seebohm dated for one year before calling it quits in March 2021, reportedly parting ways due to their 'differing lifestyles'.",
        "Seebohm and Gallagher met as co-stars on The Challenge Australia last August. They became engaged just four months later, but waited until March the following year to go public with the news.",
        "Seebohm said of their decision to initially keep the engagement a secret: 'We just wanted to live in our own little bubble, we just wanted that for us and our families.'Before dating Lutteral, the three-time gold medallist was in a long-term relationship with fellow Olympic swimmer Mitch Larkin.The sporting couple dated for nearly three years before their bitter split in 2018.Gallagher shot to fame in 2018 on Married At First Sight. His on-screen 'wife' Davina Rankin infamously cheated on him with another groom, Dean Wells."
    ]
}