{
    "articleURL": "/news/article-12046921/Thinking-moving-Utah-usurps-Washington-best-state-live.html",
    "content": [
        "Utah's strong economy has made it the top place to call home, experts sayBeehive State was followed by Washington, Idaho and NebraskaIt comes after a separate survey found Virgina was the best place to retire A strong economy and low unemployment rates have made Utah the best state to live this year, a new survey has found. ",
        "The Beehive state usurped Washington DC, which had come out No.1 for the past two years on the U.S News and World Report's Best States rankings.The survey rated the states across eight categories including healthcare, education and natural environment. But Utah was buoyed by its financial stability, for which it ranked first out of all 50 states. Meanwhile, Louisiana was ranked the worst state to live in due to its high crime rate, poor economy and infrastructure. ",
        "It was followed by Alaska and Mississippi which came in 49th and 48th place respectively.For several years Utah has been praised for its strong economy and fiscal governance.It is one of the few states to have budget surpluses rather than deficits each year - meaning it has been able to afford a raft of tax cuts. Utah entered 2023 with an extra $3.3 billion.Lawmakers also made it a priority to wage war on homelessness, creating a 'housing first' system which moved many off the streets and into permanent accommodation.What's more, the National Bureau of Economic Research found that the state had the best response to the pandemic for balancing its residents' economic interests against their health risks. Justin Theal, from the nonprofit The Pew Charitable Trusts, said: 'Since early 2020, Utah's tax revenue recovery has consistently outpaced the national trend.",
        "'In fact, tax revenue in Utah has outperformed nearly every state when you compare its overall collections in recent years to the state's pre-COVID growth trend.'Overall the top ten states spanned nearly every region of the country - however more than half were in the West or Midwest.",
        "While Utah was ranked number one overall, other states came out on top in certain categories.For example, Hawaii ranked first in healthcare and natural environment while New Hampshire was found to have the best handle on crime and corrections. Minnesota was the best place for infrastructure and Florida finished in first place for education.Florida came out tenth overall in good news for the Sunshine state which was recently usurped by Virginia as America's retirement capital.Residents in the Sunshine state said they had been priced out by rising house prices.According to the Wall Street Journal house prices average between $378,000 and $411,000.The costs are sky-high compared to the median income which falls between $57,000 and $67,000. Retirees were said to be moving to Baldwin County in Alabama instead, due to its cheaper mortgages and property taxes. The Wallet Hub survey similarly found that Alabama was the cheapest state to retire."
    ]
}