{
    "articleURL": "/news/article-12053211/Courtney-Morison-took-life-release-Townsville-University-Hospital.html",
    "content": [
        "Mum calls out hospital after daughter's death  Girl took her life after being sent away from hospitalHealth Minister Yvette D'Ath said review is underwayA grieving mother has slammed a hospital after staff sent away her troubled daughter hours before the girl tragically took her own life. ",
        "Anne Le Pla said her daughter Courtney Grace Morison was released from Townsville University Hospital on two separate occasions last October after twice attempting to take her own life. The hospital is now under a 'full clinical review' into the care given to the young woman. Courtney had tried to take her life twice in the days leading up to her death - once on October 9 and again on October 10. The teen, who suffered from depression, was sent to the hospital after the first attempt but was released the next day. ",
        "The mental health facility at the hospital then took her in later that night after she tried to take her life again - but the teenager was again released just hours later. Courtney then died the next morning. After one occasion of being dismissed by the hospital, Courtney posted on Facebook about how she wasn't being taken seriously.'How do you deal with being told it’s behavioural all (the) time from the hospital …' she wrote.'I’m diagnosed with bipolar as well and haven't been doing well, everyone around can see something is clearly wrong but they won’t help me cause (sic) it’s behavioural apparently.'Mrs Le Pla said her 'cheeky and funny' daughter should never have been released in such a short space of time. ",
        "'If somebody goes in there twice in a row trying to take their own life, you would think that would mean something was wrong,' she told News Corp.'At the end of the day, what they told her was inexcusable.'Courtney was diagnosed with bipolar in 2018 but was on medication to help her cope with her mental health challenges.The teen, who her family described as having a bubbly personality despite her issues, would front up to mental health care facilities to get help. She had also posted on social media after one visit to the hospital saying the staff 'won't help me' - and they had put her issues down to just a 'behavioural' problem.Her sister Brittany Morison said Courtney told her the hospital workers would often dismiss her saying there was nothing wrong with her. 'Courtney has suffered with her mental health for many years and when she was living up in Townsville she would present herself to the hospital when she was struggling – something I was extremely proud of,' Ms Morison said. But things started to go down hill after Courtney was sexually assaulted - with the incident under investigation.Mrs Le Pla said she wants answers and doesn't want any mother to go through the same 'painful' thing she has.",
        "Meanwhile, Townsville University Hospital chief executive Kieran Keyes told Daily Mail Australia the review into Courtney's care is under way.'Findings will determine if there are any learnings or actions resulting from this tragedy,' he said. Mr Keyes said intensive mental health care is complex and is tailored to individual needs which can include being an inpatient or out in the community. 'Our health service is subject to privacy and confidentiality legislation and for this reason, I am unable to provide any further details about Ms Morison’s care,' Mr Keyes added.'I would like to extend my deepest condolences to the family of Ms Morison.' ",
        "The family's story comes after a man was sent home from the same facility after he tried to harm himself. Army veteran Steven Angus was released from the hospital on April 21 before being shot dead at his home by police just hours later. Health Minister Yvette D’Ath would not comment on individual cases but said a review into the teenager's care at the hospital was ongoing. She said she recognises there is a lot of work to be done to improve mental health, alcohol and other drug services across the state. Lifeline: 13 11 14  Suicide call back service: 1300 659 467  Beyond Blue: 1300 224 636  ",
        "Murri Watch: 3891 6431  Open Arms - Veteran and families counselling: 1800 011 046  Kids Helpline: 1800 551 800 Headspace: 1800 650 890 "
    ]
}