{
    "articleURL": "/sport/football/article-12040737/Granit-Xhaka-warns-Arsenal-team-mates-ahead-Newcastle-trip.html",
    "content": [
        "Newcastle extinguished Arsenal's top four hopes by beating them last season Granit Xhaka wants his Gunners team-mates to 'believe' ahead of weekend trip MATCH REPORT: London is RED as Arteta's title chasers add to Chelsea's misery Granit Xhaka wants Arsenal to head to Newcastle and play with a swagger that proves why they are in a title race. ",
        "The Swiss midfielder is still reeling from last season's trip to St James' Park, where Mikel Arteta's side were blown away in a 2-0 loss, extinguising the Gunners' hopes of a top four finish. Newcastle 'destroyed' Arsenal that night and for Xhaka, who bagged three assists in Tuesday's 3-1 rout of Chelsea, he has warned team-mates there can be no repeat collapse in the North East.'We don't forget the game we had there last season,' he told Sky Sports.'I have to be honest they destroyed us. They were much, much better, they wanted it more. We have to go there and show them we are ready and why we are where we are.",
        "'We deserve to be where we are at the moment. But it will be a very tough moment because Newcastle are doing a very good job.'He added: 'We have to go there and believe and to play our game and hopefully we can take the three points back to London.'Arsenal needed to step up with pressure on them last season and they failed - something they cannot repeat with so little margin for error in this gripping title race with Manchester City.Victory over Chelsea on Tuesday restored them back to the top of the table with 78 points, albeit having played two games more than City, who are two points behind.",
        "In-form Newcastle, who are third, held Arsenal to a draw in this season's reverse fixture at the Emirates Stadium in January.Arsenal know they likely need to win all four remaining matches and hope City - who can return to the top of the table with a win at home against West Ham on Wednesday night - slip up.'It is four games to go, we are at the top right now,' Arsenal boss Arteta said.'We cannot do that (let heads drop), to be where we are after 10 months against the team we are fighting against, being there and having the possibility to be top - we have to enjoy it and embrace it, maximise the opportunity that we have because we don't know what is going to happen.",
        "'We wanted to have a very different approach to the game, and we did it right from the beginning.'The team is back to its best. We wanted to prove we had that fire in the belly. I could see that in the last few days, and we prepared (for) the game well.'Mentally we arrived in the right mood and with the right level of energy. Everything went for us as well, which is important.'We've had a couple of difficult weeks with very different games, with a lot of emotions involved. We're back to the top of the league - let's see what happens.'"
    ]
}