{
    "articleURL": "/wires/pa/article-12054997/Spaniel-parade-fitting-honour-new-King-says-organiser.html",
    "content": [
        "The organiser of a King Charles spaniel parade on the day of King’s coronation said the march was a “fitting way” to honour Charles.",
        "Jenny Matthews, owner of Love My Human – a pet groomers boutique on King’s Road in Chelsea, led a parade of more than 150 dogs to celebrate Charles becoming King and to mark the first coronation in over 70 years.Ms Matthews said onlookers were in “wonderment” and that hosting the spaniel march was “a no brainer”.“It was fitting to honour King Charles today with a lot of King Charles spaniels,” the 53-year-old told the PA news agency.",
        "“I heard comments saying ‘Oh my goodness, and there’s more’.“I think everyone was charmed by it.”Spaniels, young and old, were seen parading through King’s Road passing luxury boutiques and some donned royal attire to mark the historic event.“We had much older dogs in pushchairs that came out and the owners decorated the pushchair with bunting and beautiful velvet purple throws,” she said.“One of the stipulations was if you wanted to take part in the parade, and if your dog doesn’t mind, can you get them to wear a crown? We saw all kind of crowns – homemade crowns, little shop bought ones, paper crowns and everybody was really keen to comply and we were hoping to create a spectacle.“There were lots of dogs wagging their tail down the street. We wanted to really make sure that everyone knew why we were there.”",
        "The pet company owner was initially dubious that dog owners would not take part in the parade, but was “overwhelmed” to see the masses of King Charles spaniels walk King’s Road.“It’s been amazing and I really didn’t think it would get the attention that it did,” she said.“From initially a few people taking up on it, and everyone loved the idea, then all of a sudden overnight 150 King Charles have registered on the Cavaliers of London site to want to take part.“At one stage I stood still to photograph the parade and it just went on and on and on.”",
        "The parade started at 2pm and the party of dog owners and their spaniels was popular with the crowd as “everybody wanted to stop and take a photograph”.Ms Matthews said: “We got to Dovehouse Green where we were meeting everyone to make our way over to the Duke of York Square, and I was just overwhelmed because everybody showed up.”Despite the weather, people’s spirits were not dampened, though Ms Matthews admits that the rain may have helped to limit numbers to make the event more manageable.She added: “It was just pouring with rain, and I thought ‘yes, that’s so British’ – come rain or shine they’re out with their dog and they didn’t care they were getting wet.",
        "“In a way (the rain) did us a favour because I think everyone with a King Charles spaniel would have come out in force and it would have been overwhelming.”"
    ]
}