{
    "articleURL": "/tvshowbiz/article-12041055/Tamara-Ecclestone-shares-rare-family-snap.html",
    "content": [
        "Tamara Ecclestone and her sister Petra shared a rare insight into their family life this week as they posted snaps from Sam Palmer's 40th birthday celebration.",
        "The family got together for a special meal to commemorate the milestone and later documented the dinner on their Instagram pages on Monday.While some key members of the family were missing from the snap, many of the Ecclestone/Palmer clan gathered to celebrate Sam's big day.The family snap showed the group stood around Sam as he posed with his huge birthday cake, which featured an iced figurine of WWE wrestler The Undertaker.The cake was covered in family polariods and also hinted at Sam's favourite hobbie, which included football and golf. ",
        "Guests at the dinner included Tamara, 38, and her daughter Serena, two, who she held in her arms. However her husband Jay Rutland, 42, and there eldest daughter Sophia, nine, appeared to be absent.Meanwhile, Petra, 34, and Sam, 38, were joined by their daughter Minnie, three. Petra's children Lavinia, 10, and her twin boys Andrew and James, seven, from her marriage to James Stunt were also at the bash.Sat beside Sam was his smiling mother Sue, while his sister Louise also attended with her children.The family didn't hold back in their celebrations, as Sam revealed one of the rooms in his mansion had been lined with gold, silver and blue balloons.",
        "There was also inflatable lettering which spelt out Sam 40.",
        "Sam's birthday comes weeks after he reportedly splashed out on a $30.5 million mansion in Los Angeles with his wife Petra.The real estate mogul and the F1 heiress bought the new property in Brentwood, according to The Wall Street Journal.The house was newly built by Emily White, a former Snapchat executive, and her financier husband Bryan Kelly, meaning it was never on the market.The sprawling property boasts seven bedrooms and 11 bathrooms and is 13,500 square feet. The dark grey house is situated behind high gates and a large wall of olive and oak trees.",
        "It has a huge garden complete with a large swimming pool, as well as a movie theatre room.The mansion also has a music room and a wine cellar that can hold up to 200 bottles of wine. According to Sam, the couple has some renovations and customizations planned for their new home.Petra will reportedly be taking the lead on the interior design of the house, while Sam will take on the landscaping, which is still unfinished.He plans to incorporate grassy lawns, vegetable gardens and al fresco dining areas.This is not the first home in Brentwood, Bernie Ecclestone's daughter has purchased.   In 2019 the mother-of-four made headlines when her £86 million US home became the most expensive sold in the state of California.",
        "In July this year she married former used car salesman Sam from Essex, in a lavish ceremony at her £170 million London mansion.The couple now live in Los Angeles with their four children."
    ]
}