{
    "articleURL": "/sport/football/article-12045351/Rodri-Man-Citys-midfield-metronome-needs-rest.html",
    "content": [
        "Rodri has played more minutes for Manchester City this season than Ederson Pep Guardiola is wary about resting him but this weekend could be the moment Also, Erling Haaland, Jack Grealish and Phil Foden is the future of City's attack Incredibly, Rodri has played more minutes than Manchester City's first-choice goalkeeper, Ederson, this season so it is little wonder the holding midfielder looks like he might need a short rest.",
        "The Spaniard has started every single Premier League game since October – and all but four in all competitions thereafter – and Pep Guardiola is surely going to have to find a way of giving him a breather at some point.Towards stoppage time of Wednesday's victory over West Ham United gave an indication of that. Guardiola was yelling at his players – who were happily knocking the ball about between them with the points already safe – to stick it out of play so City could make a change and introduce Kalvin Phillips for the final few minutes. After what felt like an age, they finally accomplished that.Saturday's visit of Leeds United might well be an opportunity to remove Rodri for an afternoon, perhaps with an eye on the first leg of their Champions League semi-final at Real Madrid next week. ",
        "Ilkay Gundogan sat out the midweek win but has been deployed in a deeper role before and capable of dovetailing with John Stones, who continues to excel when asked to flit between centre half and midfield.Guardiola, though, is majorly cautious when it comes to not picking Rodri, who probably fills City's most important role and keeps them steady. There are big decisions to make in that area.",
        "RELENTLESS CITY CANNOT LET UP City's assault on a third consecutive Premier League title continued with a ninth straight win and the reaction to last week's thumping of Arsenal will have encouraged Guardiola.The message to his players since beating their title rivals has been that it means nothing if they do not then follow that up. They have, with wins over Fulham and then West Ham, and both came without them playing anywhere near their best. That's the requirement now, just doing enough to get through – although Guardiola is already wary of a trip to relegation battlers Everton a week on Saturday.'West Ham have exceptional players,' he said. 'They've not had a good season but we've always struggled against them.",
        "'It was not going to be an exception. It was windy, cold, everyone was a bit down. 'The people expect, \"ah City have won eight games in a row and are going to be 4-0 up after 20 minutes.\" That is completely out of reality.'Leeds will be quite similar. And I cannot imagine the game at Goodison Park. It's the third or fourth time I've mentioned it. 'I saw their draw at Leicester, how they played on the front foot and the chances they had, how aggressive they are. It'll be so difficult.'",
        "GREALISH-HAALAND-FODEN IS THE FUTURE Jack Grealish felt like the difference against West Ham. Purposeful driving runs, able to pick the right pass – see his assist for Erling Haaland's record-breaking goal – and carrying the ball superbly throughout. He continues to grow as a major player in City's system and another who is now on his way back after injury is Phil Foden.Foden, who scored the 1,000th goal of Guardiola's reign, has yet to start since having his appendix removed in March but is looking sharper.",
        "Managing to select Foden, Grealish and Haaland in the same team cannot be far away – and has not happened too often this term. The trio have only started seven times together and that has yielded 23 goals – including six against rivals Manchester United back in October. In those, the only fixture where City have not come out on top was a 1-1 draw at Nottingham Forest and there were enough chances to win at least a couple of games that day.They are the most exciting and direct three attackers at Guardiola's disposal and it cannot be long before that becomes a permanent choice for the manager. If not during the run-in, then certainly next term."
    ]
}