{
    "articleURL": "/wires/reuters/article-12052195/Shutout-minded-Dynamo-test-defense-vs-RSL.html",
    "content": [
        "The Houston Dynamo look to become just the second team to post shutouts in five straight home wins to start a season when they entertain Real Salt Lake on Saturday night.",
        "The 2020 Columbus Crew own the record and Houston will look to join them against a club it has had immense trouble beating over the past five-plus seasons.Real Salt Lake (3-5-1, 10 points) is unbeaten in the last 10 meetings (5-0-5) with the Dynamo since Houston recorded a 5-1 victory on May 31, 2017.The Dynamo (4-3-1, 13 points) will look for a different outcome under first-year coach Ben Olsen, who said he wasn't aware of the streak when it was brought up in Thursday's press conference.\"They are always a tough out,\" Olsen said of RSL. \"I expect a very good team to show up here. I think they understand what we are about, and I think we have a good understanding about how they go about the game. There are a lot of similarities.\"I think it will be a fairly tactical game and we will have to be at our best on the defensive side. ... Hopefully, offensively, this is the game we click in transition and put up a few goals.\"Houston had a bye last weekend, while Real Salt Lake played the visiting Seattle Sounders to a scoreless tie.Real Salt Lake's Zac MacMath was called on to make just one save while recording his first shutout of the season. He had a career-best 10 last season.",
        "Jefferson Savarino had scored goals in three consecutive matches for RSL before being held in check by Seattle.Savarino has 31 goals and 30 assists in 109 career games with Salt Lake. He joined the 30-30 club against the San Jose Earthquakes on April 22 in his 108th match with RSL. The only player in team history to do it fast was Joao Plata, who reached the mark in his 104th appearance. Plata finished his RSL stint with 46 goals and 43 assists in 175 matches from 2013-19.Savarino, 26, is tied for eighth on the club's all-time goals list and stands fifth in assists.\"We don't know what the future holds, we don't know what could happen in the future or whether or not I'll be here for a long time, but I do hope I'm able to reach other milestones with RSL,\" Savarino said.RSL is just 1-3-0 on the road this season.--Field Level Media"
    ]
}