{
    "articleURL": "/femail/real-life/article-12044449/Skin-cancer-symptoms-treatments-revealed-Melissa-Lewis-shows-confronting-pictures.html",
    "content": [
        "Melissa Lewis, 48, has suffered several cruel blows since 2009 She requires life-long preventative skin cancer treatment All could've been prevented by using sunscreen more frequently  Melissa Lewis regrets every moment she spent by the pool in her youth.",
        "The porcelain-skinned mum-of-four has been diagnosed with three different types of skin cancer since 2009, and now faces a lifetime of invasive treatments to stay well.The nurse, who has become the 'unofficial face of skin cancer' on TikTok, spoke to FEMAIL about the brutal reality of the disease.She revealed she never had a classic symptom such as a 'dodgy looking mole', explaining her cancers looked more like flakey skin or an uneven complexion. To avoid the condition turning deadly, she now requires ongoing treatment for the rest of her life.In 2018 surgeons removed a melanoma from her ear and also took a biopsy from a suspicious lesion on her forehead, which turned out to be an early form of skin cancer called Bowen's disease.Melissa admitted she was constantly burnt as a child from being out in the sun all summer by the pool, and during her teen years she would tan on the beach due to 'peer pressure'. 'Thinking back now, if I could have a moment to pull my younger self aside I would say - 'listen what you're doing now might be fun, but you're going to pay for it in future. And it could cost you your life\",' Melissa said. Scroll down for video ",
        "While most people believe skin cancer looks like a 'dark, scary mole', this wasn't the case for Melissa as her early signs of the deadly disease were practically invisible to the naked eye. ",
        "She never had any moles, but rather 'scaly bumps' on the skin. 'I had a melanoma and it didn't look like anything at all. In fact it took two dermatologist to diagnose it. They needed to look at my face under a microscope to try find it,' she said. The Sydney nurse is now on a mission to encourage others to be diligent with skin checks and protect their skin everyday by wearing sunscreen, regardless of the season.",
        "From 2009 to 2018, dermatologists found lesions all over her body - including her nose, forehead, ear, chest and calf.To add to her traumatic decade, Melissa was diagnosed with breast cancer and in 2017 she almost died from sepsis after a gynecological procedure gone wrong. But it's the battle against skin cancer which she is promoting online, hoping to warn millions of sun-loving Australians about the consequences of not protecting your skin. Nowadays, Melissa has to undergo an agonising facial treatment every year which leaves her skin blistering red, peeling and sore - all in precaution to ensure the Bowen's disease found on her forehead doesn't invade her bloodstream. One of the scariest blows of all was when dermatologists confirmed Melissa had a melanoma on her left ear. ",
        "'It was a total shock because that word is synonymous with cancer - it's the top level because a melanoma has gone to the deepest layer of the skin and is about to invade,' she said. ",
        "'I was very lucky because it was caught during the stage 0 phase - it hadn't yet invaded the bloodstream.' Doctors had Melissa in for surgery in 2018 to remove the melanoma and reconstruct her ear. Prior to the procedure, she asked doctors to inspect a spot of concern in her scalp - which turned out to be Bowen's Disease. 'It's been a real journey and my confidence has shaken because your face is how you present yourself to the world,' she said.'But I've come out of this a softer person knowing more of the world and the importance of taking care of your ski.'She now requires daylight photodynamic therapy for rest of her life, a treatment that uses sunlight as a light source to treat superficial skin cancer.Melissa said the painful procedure involves 'scratching away at the surface of the skin as if with sand paper' to exfoliate - concentrating on the areas with the most sun damage. For Melissa this was her nose and forehead.Then a 'photosynthesising agent' is applied followed by heavy sunscreen. ",
        "2009 - basal cell carcinoma (BCC) spot found on left shoulder found and removed2009-2013 - annual skin checks and cryotherapy treatments to prevent further concerns2014 - biopsy conducted on back of right calf to remove potentially sinister spot. The right calf was treated with cryotherapy from 2014 as it had BCC type features2016 - spot on calf wasn't responding so a biopsy conducted then and removed in dermatologists rooms with wide marginsThe cancer continued getting worse, and cryotherapy wasn't enough to stop it. Started daylight photodynamic therapy on her whole face - worse effected areas were the forehead and nose 2017 - another BCC lesion detected on nose and was removed. Plastic surgery required and a skin graft from my forehead2018 - melanoma found on left tragus on ear, which was removed. Plastic surgery was required to reconstruct the ear. There was no graft required thankfully this time2018 - another BCC found on right upper chest removed with plastic surgery and biopsy to forehead/scalp in theatreThis came back as Bowen's disease, (squamous cell carcinoma insitu). This was then removed a few weeks later also under plastic surgery with wide margins2022 - diagnosed with breast cancer and took a year off skin treatments because of thisNow: bi-annual skin surveillance and painful daylight photodynamic therapy every year to keep removing surface and deeper cancers",
        "When she first had the treatment she had to expose herself fully in the sun for two hours to activate the agent to 'kill only the cancer cells'. Following the treatment the skin is left feeling burnt and continues to peel for seven days, or sometimes longer.The first time she had this done in 2017, it exposed another basal cell carcinoma on the side of her nose which was then removed, and in 2018 she had yet another BCC removed from her right upper chest. A BCC is the most common and least dangerous form of skin cancer, often appearing red or pale in colour and lumpy. The most deadly form is a melanoma and if left untreated it can be life-threatening. Worryingly, none of Melissa's carcinomas have looked like 'obvious cancerous moles'. 'None of my lesions have ever been dark and scary looking,' she said.  'From 2005 onwards my skin was bumpy, red in texture and scaly. Brushing my hair was painful because there were lesions there, but I just didn't know it at the time, and it would often bleed. 'When I towel dried my face my skin would bleed from being so crusty.' Dermatologists found the very first BCC on Melissa's shoulder back in 2009  Little did she know it was just the start of a series of ongoing health scares that would involve painful treatment, surgeries and crippling fear.",
        "Up until 2013 she had yearly skin checks and regular cryotherapy treatments all over her face, shoulders and back - involving the freezing of any sun spots and hidden pre-cancerous lesions. In 2014 she had a biopsy on the back of her calf and a another potentially sinister lump with 'BCC-type features' had been detected during a checkup.'It's the place where you'd least expect to have a problem. But if you think about it, when you walk the sun hits the back of your legs without realising,' Melissa said. By 2016, it still wasn't responding.At that point Melissa said the cancer was 'clearly getting worse' and the cold therapy 'just wasn't enough' to battle against the other lesions emerging from the surface of the skin.This is when she began daylight photodynamic therapy.",
        "Melissa says all of this could've been prevented if she wore sunscreen as a child and teenager. 'We were burning constantly as children. I have vivid memories of my sister and I sitting in front of a fan putting lotion all over ourselves from being burnt, then peeling our skin a few days later,' she recalled. 'My siblings and I used to go to school some days with blisters on our back and shoulders from being sunburnt. And I don't tan, I just burn.",
        "'During the summer I think it was the norm back then to put your SPF 15 sunblock on and go out for a day at the pool - and there was never the thought to reapply.' Her tiny body would be completely red with a silhouette outline of her one-piece swimsuit.As a teenager her 'whole world was centered around the beach' as she attended an all girls school in Manly and was constantly tanning after school in summer. 'The peer pressure to tan was just as intense as smoking a cigarette or drinking alcohol,' she said.",
        "There are three main types of skin cancer: melanoma (including nodular melanoma), basal cell carcinoma and squamous cell carcinoma.Melanoma: Most deadly form of skin cancer and if left untreated, it can spread to other parts of the body. Appears as a new spot or an existing spot that changes in colour, size or shape.Basal cell carcinoma: Most common, least dangerous form of skin cancer. Red, pale or pearly in colour, appears as a lump or dry, scaly area. Grows slowly, usually on areas that are often exposed to the sun.Squamous cell carcinoma: A thickened, red scaly spot that may bleed easily, crust or ulcerate. Grows over some months, usually on areas often exposed to the sun. More likely to occur in people over 50 years of age.",
        "'The message I need to get out there to people is that skin cancer is not what you think and you have to go get your skin checked by a dermatologist every year,' she said. 'Back then I was living my carefree teenage life and followed what all my friends did. I used the lowest amount of SPF to try get the deepest tan, and I think of it now and just shudder.'The damage the I did is so intense. My face will forever have skin cancer on it. I'm not going to be free of it at all, which is scary.'"
    ]
}