{
    "articleURL": "/sport/nfl/article-12038843/Ex-Raider-Henry-Ruggs-takes-plea-deal-DUI-case-meaning-jailed-3-10-years.html",
    "content": [
        "Henry Ruggs has been on house arrest for the last 18 months following the crashThe Las Vegas Raiders cut ties with him less than 24 hours after his arrestDailyMail.com provides all the latest international sports newsEx-Las Vegas Raiders player Henry Ruggs told a judge Tuesday he will admit that he drove drunk at speeds up to 156 mph, causing a fiery crash that killed a woman. ",
        "The plea deal could send the 24-year-old first-round NFL draft pick to state prison for three to 10 years.Ruggs waived a long-delayed preliminary hearing with the agreement to admit that he drove under the influence of alcohol causing death, a felony, his lawyers said. A six-month sentence for a guilty plea to misdemeanor manslaughter will be folded in with the total.Ruggs spoke only to acknowledge for Justice of the Peace Harmony Letizia that he understands the terms of the agreement. Prosecutor Eric Bauman told the judge the Clark County District Attorney's office endorsed the deal.'This is the first step toward a fair resolution to this matter and we look forward to closure for all parties involved,' Ruggs' attorneys, David Chesnoff and Richard Schonfeld, said in a statement handed to reporters. ",
        "They and their client and several people with them declined additional comment in the court hallway.Ruggs' lawyers lost a bid to prevent prosecutors from presenting evidence that Ruggs had a blood-alcohol level of 0.16 percent - twice the legal limit in Nevada - after the predawn rear-end wreck that killed 23-year-old Tina Tintor and her pet dog, Max.Ruggs' Corvette Stingray hit Tintor's Toyota RAV4 and propelled it 571 feet, according to police, setting it on fire. A coroner later ruled that Tintor and her dog had burned to death.",
        "An attorney who has represented Tintor's family members at earlier court appearances did not respond to email and telephone messages to him and his media representative about Ruggs' plea.Ruggs' sentencing is scheduled for May 10 in state court in Las Vegas, with the former Raider expected to formally plead guilty at that time.Other charges will be dismissed, including felony reckless driving, driving under the influence causing substantial injury to Ruggs' girlfriend, Je'nai Kilgo-Washington, and a misdemeanor gun charge. Police said they found a loaded handgun in Ruggs' demolished Chevrolet Corvette after the crash.Ruggs was released by the Raiders shortly after the November 2, 2021, crash. He could have faced more than 50 years in prison if convicted of all the charges at trial, District Attorney Steve Wolfson had said.Ruggs posted $150K bail to be freed from jail after leaving the hospital and has remained on house arrest for 18 months with strict conditions including alcohol checks.Bauman said outside court that Ruggs would remain on house arrest pending sentencing, and his minimum three-year sentence cannot be reduced by converting that to time already served.",
        "Ruggs was granted permission last year to leave home confinement twice a week for three hours a day to work out.Kilgo-Washington and Ruggs have a daughter together, and Kilgo-Washington was not cooperative with prosecutors as a victim in the substantial injury charge. Her attorney, Peter Christiansen, lost a bid to block prosecutors from getting Kilgo-Washington's medical records on privacy grounds.",
        "Prosecutors said Ruggs suffered a leg injury and Kilgo-Washington underwent surgery for an arm injury.Ruggs had been emerging as a star wide receiver for the Raiders before the crash, and records showed he owned a $1.1million home not far from the crash scene. He had signed a four-year rookie contract reported to be worth more than $16m."
    ]
}