{
    "articleURL": "/news/royals/article-12039595/King-Charles-Coronation-make-Britain-proud.html",
    "content": [
        "Duke of Norfolk said time to be reminded of ‘pride we have in our great country’Edward Fitzalan Howard’s family responsible for state occasions since 1483Earl Marshal said Coronation procession will be ‘a glorious display of pageantry’This weekend’s Coronation will be a ‘proud moment’ in the nation’s history and promote Britain abroad, the man tasked with organising it has said.",
        "The Duke of Norfolk – known as the Earl Marshal – said it was time to be reminded of ‘the pride we have in our great country’, which the monarchy has played such a significant part in.Edward Fitzalan Howard’s family have been responsible for state occasions since 1483 and on a hereditary basis since 1672.He is currently in charge of a team of more than 100 organisers from across Buckingham Palace, the Government, the Church, military and others. With just three days to go, the duke said the Coronation was about ‘blending the best of tradition and history while reflecting the nation we are today’.",
        "Speaking from Buckingham Palace, he said: ‘This is a proud moment in our national history. 'During the Coronation, the King will swear before God and the nation to serve our country as head of state, upholding our laws and maintaining justice for all. ",
        "'But this is also a time to remind ourselves of the pride we have in our great country and our unwritten constitution which has served us so well for 1,000 years during our long history.’He added: ‘The late Queen Elizabeth II who reigned for 70 years and who dedicated her life to service earned the admiration and respect of the world.",
        "‘Now we have the continuity of a new king who will follow in her footsteps but do it in his own way, with his wife and family carrying out their loyal service alongside His Majesty. 'It is a system which has constantly evolved over time, helping to secure the freedom we enjoy today.’ The Earl Marshal said the Coronation procession will be ‘a glorious display of pageantry’ which will feature 7,000 troops including 400 from the Realms and the Commonwealth.He described the Coronation as an opportunity to bring these nations closer together, adding that it ‘plugs into the power of the past, promoting our shared values to the wider world with all that we have to offer’.After the ceremony the family will appear on the Buckingham Palace balcony before a six minute flypast at 2.30pm."
    ]
}