{
    "articleURL": "/news/article-12060045/Address-book-owned-Howard-Carter-naming-Tutankhamun-backer-Earl-Carnarvon.html",
    "content": [
        "Carter found Tutankhamun's resting place in Egypt's Valley of the Kings in 1922He was backed financially by George Herbert, the 5th Earl of CarnarvonCarter's address book lists the Earl's home, Highclere Castle It was perhaps the greatest discovery of lost treasure in history.",
        "On November 4, 1922, Howard Carter found the resting place of the Egyptian pharaoh Tutankhamun, complete with more than 5,000 priceless artefacts. But the expedition in Egypt's Valley of the Kings might not have taken place at all, if Carter's financial backer had pressed on with his threat to cut off the archaeologist's funding.Carter's address book, which is set to be sold for £5,000 later this month, reveals the address of the Earl of Carnarvon, who lived at the famous Highclere Castle, where hit TV series Downton Abbey was filmed. The Earl threatened to pull his funding when he became frustrated with Carter's lack of progress in the search for Tutankhamun's tomb, after the First World War put a halt to excavations.Fortunately, in 1922 he agreed to provide the money for Carter to hunt for one final year, a decision that led to the Egyptologist's discovery of treasures including a solid gold coffin, Tutankhamun's mask, thrones, furniture, food and wine.",
        "Carter's book, which lists around 200 addresses of his diverse array of high-society contacts, will be sold at London's Rare Book Fair later this month by rare bookseller York Modern Books.Carter and George Herbert, the 5th Earl of Carnarvon, met in 1907 and the aristocrat agreed to fund his explorations. ",
        "The pair ended up working together for the next 17 years. Although their early years together were successful, the First World War put a pause on their work that was not lifted until 1917.When the searches resumed, Carter did not come close to finding anything despite intensive excavations, prompting the Earl to consider withdrawing his funding.But after Carter did find the tomb, the Earl was there to pose triumphantly outside it with his expert and his daughter Evelyn.Evelyn's address is also among those listed in Carter's book. She claimed to have rejected Carter's romantic advances, later telling her daughter that 'at first I was in awe of him, later I was rather frightened of him.' ",
        "Carter initially viewed Tutankhamun's tomb through a small hole made in masonry after two days of digging through a rubble-filled passage.Holding up a candle, he looked inside and gave what became a famous response to Carnarvon's impatient question: 'Can you see anything?''Yes,' he said. 'Wonderful things.'The tomb - which included four rooms - was filled with royal treasures, including a dagger made a from meteorite. They had lain untouched for more than 3,000 years.The tomb also contained three coffins nestled within one another, the innermost of which contained the Boy King's body.",
        "Shortly after it was discovered, both the inner and middle caskets were transferred to the Egyptian Museum in Cairo, while the outer gilded coffin was left behind.Tragically, the Earl passed away in April 1923 after he was bitten by a mosquito and developed sepsis.His death led to headlines that proclaimed 'The Curse of Tutankhamun'.Fifty years after Carter's discovery, many of the treasures inside Tutankhamun's tomb were displayed at a now-famous exhibition at the British Museum in London.",
        "The exhibition, which was opened by the Queen, had originally been set to last for three months, but ended up being open for six due to its enormous popularity. Around 4,400 visited on its first day, with more than 30,000 coming in the first week. On its first day, hundreds of people queued for more than 14 hours overnight to get inside the museum. On the exhibition's last day, in September, there were still thousands frantically trying to get a final glimpse of Tutankhamun's treasures - but an employee with a loudhailer had to tell them: 'I am very sorry, it is the last day, so they are going to put him to sleep now for another 3,000 years.'  ",
        "Records revealed by MailOnline last year showed how Carter was staying with the Earl of Carnarvon at Highclere when the 1921 Census was taken. ",
        "His age was listed as 47, his marital status 'single' and his occupation made no mention of his real profession. Instead, Herbert bizarrely referred to him as 'artist (painter)'. The record also showed how the Earl, his wife Almina and Evelyn were attended to by 14 servants. After the clearance of Tutankhamun's tomb was completed in 1932, Carter retired from excavation work and died seven years later. London's Rare Book Fair is being held at the Saatchi Gallery from May 19-21.  "
    ]
}