{
    "articleURL": "/sciencetech/article-12042561/I-bought-5-items-Dark-Web-wont-believe-sent.html",
    "content": [
        "Red Mask unwraps parcels he claims are from the dark web in TikTok videosTaped up iPhones and a 'haunted doll' are among his bizarre purchasesHe described the dark web as 'the Wild West' hosting 'everything and anything'  An anonymous masked TikToker has lifted the lid on the 'Wild West' of the dark web, after claiming to have found a bizarre yet disturbing array of items. ",
        "On the surface, coke cans, iPhones and KSI's Prime drinks are quite ordinary things you can widely purchase on the internet.But influencer Red Mask (@maskred) suggests a trip to the web's darker side may give different results, having been sent bottles brimming with hotdogs, taped up devices and even creepy dolls. 'There's a lot I can't show on social media which I imagine would shock and surprise a lot of people,' he told MailOnline. 'It's like the Wild West where it seems as though anything and everything is available. Some of it may be scams, some of it may never arrive. That's the risk you take. It's not a safe place and not somewhere I recommend you do your shopping.' ",
        "iPhones filled with strange photos and phone numbersWorld War I tins that contained Nazi medals when openedBottle of Prime filled with hot dogs with a home address attachedA 'haunted' doll with no eyesCoke can filled with beans ",
        "The 30-year-old from East London began unwrapping his dark web parcels on TikTok in January, amassing an audience of more than 150,000 followers in three months.While many of his purchases are things that are used, eaten or drank in day-to-day life, RedMask claims he would never dream of doing this.'There's a user who sells everything and anything and I thought it would be interesting to try and purchase regular items which always seem to involved something odd,' he said.'A lot of the time things come and seem normal but there is always something off.'",
        "The dark web is a part of the internet that is generally hidden from public view and  not indexed by conventional search engines such as Google.Accessing this part of the internet requires use of a specific browser such as Tor or i2p which hides your location and browsing activity.Searching on the dark web is not illegal in itself, but it is home to marketplaces selling both strange and unlawful products including weapons, counterfeit currency and drugs.RedMask continued: 'I would recommend you find someone who has experience navigating the dark web before trying to dive right in. ",
        "'You can open yourself up to having your information hacked and stolen with one wrong move. You can also stumble onto some pretty gnarly stuff that you probably don't want to see.'There is all the things you expect like gore and NSFW content but I think the most unsettling things I've come across are the huge databases of hacked passwords and bank details. 'I managed to find my own data had been hacked along with millions of other people. This was available to buy for a small price. You wouldn't believe some of the email passwords that were available.'iPhones filled with strange photos and phone numbers are among some of the more disturbing purchases Red Mask claims to have made.",
        "In one TikTok, RedMask films himself unboxing a phone wrapped in masking tape alongside a blurry polaroid photo.World War I tins appearing to contain Nazi medals, a Prime bottle with a written address attached and a 'haunted' doll are among numerous other purchases he claims to have made. 'I threw the doll out almost immediately as I feel like it must have a tracker or a small camera or something,' RedMask said. 'I get my packages delivered to a few different secure drop off points and when I picked up this doll I had the feeling someone was watching me the whole time. So I made sure to take a different route home just to be sure no one was following.'Objects filled with beans are a common theme of the purchases made by RedMask, including a Starbucks drink, a coke can and a coconut.This has sparked some scepticism among followers about how genuine his videos are, with some accusing the parcels of being 'homemade to get likes'.",
        "Global Security Advisor Jake Moore at ESET also added that there is 'no proof these videos are even representing genuine dark web purchases'.He said: 'The problem with buying anything on the internet is that the buyer has no knowledge with what they are truly buying, let alone confidence or insurance in the sale which can leave people vulnerable. ",
        "'The seller, however, will know the purchaser's postal address which makes such purchases one sided and potentially slightly more dangerous.'The dark web can be used for staying anonymous online which can be useful for when users are mindful of their privacy. But once payment is included, there is no assurance the item or service will even arrive due to seller anonymity as well as no official platform to complain to.'There is also no proof these videos are even representing genuine dark web purchases so people need to be very wary of the videos their algorithms are providing them.'When approached about the truth of his videos, RedMask said: 'People should always be wary of the content their algorithms provide them...question everything.'",
        "Users can go to websites like ID Security and Have I Been Pwned that will use your email address or phone number to see if you are on the dark web. Password managers also monitor the dark layer of the internet and send users alerts if their credentials are compromised.Apple's keychain encrypts account names and passwords for your Mac, apps, servers, and websites, and confidential information, such as credit card numbers or bank account PIN numbers. "
    ]
}