{
    "articleURL": "/wires/pa/article-12046625/Sculpture-King-s-coronation-sophisticated.html",
    "content": [
        "A new sculpture of the King marking his coronation will show how he has become “more sophisticated” and “dignified” in the last decade, its creator has said.",
        "Leeds-born artist Frances Segelman, who has also created busts of the late Queen and Duke of Edinburgh, said the depiction also showed a look of concern upon his face as he deals with “the weight of the world on his shoulders”.Segelman previously sculpted the then Prince of Wales in 2014 at Highgrove, marking the 40th anniversary of his charity, The Prince’s Trust.",
        "Her new work is a life-and-a-half-sized rendition depicting how the new King will be seen on Coronation Day, and will be completed once she has seen his uniform on Saturday.She told the PA news agency: “He has changed. His face has changed in 10 years.“He has actually got much more sophisticated. He looks very handsome, I think. He is a very handsome man.“He has got fuller in the face and obviously his hair has got more grey but he is very lucky, he has got lots of hair.“But I think he looks like a very dignified person and I am really pleased I am doing the sculpture because it is showing the change in his face.”While her 2014 work was based on facial measurements she personally made of the King, the new work draws on recent images as well as other material.Segelman said that when she sculpts “what comes out is something inside them”.",
        "She added: “I don’t try and change that – it just comes out.",
        "“What I have seen in the one of the King is actually, he looks very concerned.“There is a certain look in his face. I didn’t change it. I felt like maybe I should change that but actually that is what came through.“There is a worried look in his face. He has got the weight of the world on his shoulders now.”Segelman has sculpted other members of the royal family including the Princess Royal and the Countess of Wessex, and plans to complete a depiction of the Queen Consort in the near future.She also recalled measuring the late Queen with a pair of calipers, saying: “I was allowed to go up to the Queen and measure her – her hair, her nose, her face.“There was somebody in the room while I was doing it. I don’t know if it was her secretary. But it was so unbelievable that I was allowed to do that, and that she trusted me so much, and that I could take photos of her.“Masses of photographs I have, of every different angle of her. She was so trusting.”Born in Leeds, Segelman is a fellow of the Royal Society of Arts, a member of the Royal Society of British Sculptors and a liveryman of Painters and Stainers Livery Company."
    ]
}