{
    "articleURL": "/femail/food/article-12057777/How-save-money-groceries-Man-vegetarian-saves-1500-year-cost-living-crisis.html",
    "content": [
        "Dave Kirk and his partner save $1500 on groceries by changing their diet They save between $20-$30 a week by reducing their meat intake A man has revealed how he saves up to $1,500 a year on groceries with one simple swap at the supermarket.",
        "Dave Kirk, 32, from Sydney, noticed the benefits to his bank account by incorporating vegetarian meals into his diet. On average he and his partner save between $20-$30 per week ($1,560 each year) by reducing their meat intake. 'Myself and my partner slowly started introducing more vegetarian-based meals about a year or so ago during the Covid omicron wave, and the meat shortage,' Dave told FEMAIL. 'We saw instant difference in the price of groceries, and wanted to keep it up for health reasons.'Rather than opting for chicken or beef, Dave and his partner instead fill their diet with other protein-rich foods such as eggs, legumes, spinach, lentils, beans and pumpkin seeds. ",
        "Beforehand they were spending between $150-$200 with the inclusion of chicken in their shop, which can cost an average of $10-$15 extra. Dave also noticed the benefits on his health and bank account by tracking his meals using popular app MyFitnessPal. 'Tracking my food was really important when reducing my meat intake as we were able to make sure we were eating a balanced diet with enough protein,' he said. 'I think if it wasn't for that we probably would have gone back to eating mostly meat - as we might have struggled with energy levels and concern that we weren't eating right.'",
        "And Dave isn't the only Aussie that has become a 'flexitarian' to save some extra cash each week. According to research conducted by Perspectus Global and the No Meat May campaign, 37 per cent of surveyed consumers are already buying fewer meat products in an effort to save money. On top of that, 61 per cent are considering increasing their plant-based intake as the cost of living continues to rise. The results were 'no surprise' to No Meat May founders Ryan Alexander and Guy James Whitworth, who say that even more people would make the switch if they knew it would save them money.'Eighty-one per cent of consumers say they would consider a shift to more plant-rich eating if they could shave a third off their shopping bill, but only 37 per cent are doing so,' the pair said.'This tells us that many Aussies are not aware of the huge upside at the checkout by simply swapping their source of protein.'The survey was commissioned as a part of the No Meat May campaign which urges people to switch to plant-based eating for the entire month."
    ]
}