{
    "articleURL": "/wires/pa/article-12060413/Tony-Mowbray-praises-second-half-display-Sunderland-make-play-offs.html",
    "content": [
        "Tony Mowbray praised his Sunderland side’s second-half display after they dramatically sealed a play-off place with a 3-0 win over Preston.",
        "After a rocky opening 45 minutes, second-half goals from Amad Diallo, Alex Pritchard and Jack Clarke at Deepdale meant the Black Cats had done all they could in their quest to try and sneak into the play-off places.That victory proved enough to finish in sixth and claim the final play-off spot after Millwall spectacularly blew a 3-1 lead to lose 4-3 to Blackburn at The Den.Blackburn finished just behind Sunderland in the table, also on 69 points but with an inferior goal difference, while Millwall fell down to eighth after having had matters in their own hands before kick-off.Sunderland will now face Luton over two legs for a place in the final at Wembley, and Mowbray was pleased that his side were able to take charge after a frantic first half.He said: “I felt as though we could come here and control the game.",
        "“I knew we could win at Preston, we’ve won away at West Brom and Norwich – we’ve been good away from home.“We started sloppy, but then grew into the game. We were naive and let them have too many chances. It was like a basketball game in the first half.“We didn’t have harsh words at half-time, but we discussed that we needed to control the game better. We became more confident and, off the back of the first goal, we controlled things. It was a solid performance.",
        "“I always believe we’ve got attacking players at the top of the pitch who are really talented and, if we can get the ball to them around the edge of the box, then we can score.”Travelling Black Cats fans brought incredible energy to Deepdale, but Mowbray admitted there were some injury concerns ahead of their semi-final.“It’s an incredible scenario to see the people of Sunderland enjoying their football so much,” he added. “It’s going to be awesome being in the semi-finals, we’ve got to be ready for Luton.“As I sit here now, the conundrum in front of us is really difficult because we’ve got injuries to central defenders, but we have to find another performance.”Preston finished the season in 12th but only six points behind Sunderland and Blackburn, and boss Ryan Lowe admitted key moments across the season as a whole had cost them.Lowe commented: “We’ve given it a good go but it’s not been today or Sheffield United that’s cost us the play-offs, it’s from games earlier on in the season.“I said about mentality, I don’t mean they’re not giving everything, I mean being savvy and taking the opportunities. We went out all guns blazing and we wanted to have a right good go.",
        "“We fell short by six points but in the grand scheme of things, it’s not bad. For us and clubs like us, we need to keep building and I think we’re going in the right direction, we just need that little bit extra.“We’re pleased with what we’ve tried to do and where we are. The effort of the players and the staff, they’ve been excellent.“I want to bring the good times back to this club. We are slowly but surely trying to get there, but our aim is to do what Sunderland have done today and get into those play-offs.”"
    ]
}