{
    "articleURL": "/tvshowbiz/article-12055591/Priyanka-Chopra-reveals-reason-husband-Nick-Jonas-makes-cameo-new-rom-com-Love-Again.html",
    "content": [
        "The new romantic comedy-drama Love Again, starring Priyanka Chopra and Sam Heughen, made its premiere in theaters in the U.S. on Friday.",
        "As fans begin to get a first-look at the rom-com, they will soon learn that Chopra's real-life husband, Nick Jonas, actually makes a cameo, in a late add to the cast.In the film, the actress plays a woman who's just making her way back to the dating pool after losing someone she loved dearly. But before she shares a spark with Heughen, who plays Rob Burns, her character Mira Ray has to suffer through one of those unfortunate dates with Jonas.In an interview with Entertainment Weekly, the actress revealed how Mira's date was supposed to lick her face, but due to the ongoing COVID-19 pandemic, at the time of the shoot, that actor would have had to wait around in quarantine before filming his scene.'They were going to cast a random actor who would’ve eventually had to lick my face during COVID, which meant that he had to quarantine for 14 days and sit in a hotel room just waiting to lick my face. It was just awful,' she explained.",
        "Chopra, 40, went on to explain how the Jonas Brothers' star was the perfect choice to be the one to lick her face because he had already been in quarantine with her.'Nick came to help me settle in, and our director Jim (professionally known as James C. Strouse) had the bright idea. He was like, \"Do you think Nick would consider this?\" And I was like, \"Yes. Yes, please!\"'she recalled. ",
        "The Jamshedpur, Bihar (present-day Jharkhand), India native went on to share how her husband actually saved the day on the set.'So Nick took one for the team and was extremely gracious and lovely,' she added. 'He turned out to be so funny. It was so hard for me to act like I was embarrassed or mad at him, because I just couldn't stop laughing.'All those laughs made for a fun time on the set, leading up to the shoot for their not-so-great date. 'There was one time where Nick said something or did something, and we were inside the taxi, and the crew outside laughed out loud that we had to do another take,' she recalled of their time working together.Written and directed by Strouse, 46, Love Again is an English-language remake of the 2016 German film, MS für Dich, which in turn is based on a novel by Sofie Cramer. The story follows Mira Ray (Chopra), as she struggles with the death of her fiancé, who unintentionally sends a sequence of romantic messages to his old cell phone number.",
        "It turns out that old phone number has since been given to Rob Burns, for his job as a journalist.Drawn to the candidness in Mira's beautifully written texts, Rob tries to find a way to meet Mira in real life to win her over, and ultimately ends up seeking out the help of famous singer Celine Dion, after he's assigned to do a feature story about her.",
        "The real Celine Dion, 55, portrays a fictionalized version of herself, in what is her first-ever movie role.The cast also includes Russell Tovey, Steve Oram, Omid Djalili, Sofia Barclay, Lydia West, Arinzé Kene, and of course Nick Jonas, in his memorable awkward date scenes.On Friday, the day of the film's premiere at the AMC Lincoln Square in New York City, Chopra took to her Instagram page and shared a few photos of herself, alongside family members who were there to lend their support.'Family.. to every one that came to support. I love you.. without you, none of it is possible. @loveagainmovie #afterparty @sonanewyork,' she gushed in the caption of thepost that includes Chopra, Nick Jonas, his older brother Kevin Jonas, his wife Danielle Jonas, as well as the mothers of both Nick and Priyanka.",
        "She also shared some behind-the-scenes photos she took during shoot of the film in another Instagram post on Friday.'Best time with the best people. @loveagainmovie In theatres today!!' the actress wrote when plugging the film's premiere on Friday. In another promotional push for the production, the mother of one posted a video, dubbed, '5 reasons to see Love Again.''The time to love again is NOW! @loveagainmovie in theatres in the US today!! Go watch now,' she shared in the caption. ",
        "Priyanka and Nick Jonas have been married for more than four years, and are the proud parents of 16-month-old daughter Malti, who arrived with the help of a surrogate.Love Again is now playing in theaters all across the United States."
    ]
}