{
    "articleURL": "/sciencetech/article-12040997/Scientists-develop-beer-TWO-pull-tabs-say-results-pint-perfect-head.html",
    "content": [
        "Nendo has designed a can that can help provide a 'golden ratio' of beer to foam The can has two tabs allowing it to open to its fullest, facilitating less bubblesThanks to Nendo's step-by-step guidance it claims the perfect pint is possiblePulling off the perfect pint can take a little practice, with beer drinkers often turning their nose up at foamy heads.",
        "But this may soon be a thing of the past, as scientists have unveiled a new can design that could solve the froth problem once and for all.Japanese firm Nendo claims the so-called 'golden ratio' of beer to foam can be achieved using its newly designed product. At a glance, it may look just like an ordinary can, but the product's two pull tabs are said to make a huge difference. Nendo claims that this innovative design results in a pint with the perfect head. ",
        "The tab labelled '1' should be pulled first to allow some foam to form.The beer should then be poured into a glass until it is half-full.The drinker should then wait a seconds for any bubbles to settle.Afterwards, the second tab should be pulled, opening the can to its fullest.The remaining liquid can then be poured into the can, forming the 'golden ratio' of beer to foam. Source: Nendo ",
        "Nendo stated: 'There are two main principles of bubbles that form from canned beer, besides the factor derived from its raw materials: the sudden drop in pressure inside the can when it is opened and the friction that occurs between the can and the liquid when pouring. 'Through our study, it has been found that if the pull tab doesn't fully open the can, the pressure is concentrated in the narrow opening. At the same time, when pouring, the area of the beer in contact with the lid increases, which facilitates the formation of bubbles.'In its research, the firm established that properties of the lid and distances between tabs alter how much a can opens. For the optimum pint, experts recommend opening the tab labelled '1' first and pouring it into a glass until it is half-full.",
        "At this point, beer guzzlers should wait for a couple of seconds to let any bubbles settle.Then, the second tab should be pulled, allowing the can to open to its fullest.The remaining liquid can then be poured from the can into the glass.'Beer heads are considered essential for having beer taste better, at least in Japan,' Nendo said.'It is because a layer of foam with adequate thickness acts as a lid to prevent beer from coming into contact with the air, and keeps it from releasing aroma, flavor, and carbonation. 'In the domestic beer market, beer for commercial use is usually shipped in bottles or tanks, while most beer for home consumption is canned. 'In the latter case, however, it is difficult to create an ideal foam when pouring from a can into a glass.'    ",
        "In reference to its two-tab can, Nendo added: 'In this way, a glass with a liquid-foam ratio of 7:3, so-called golden ratio, can now be easily achieved with canned beer.'The new can follows numerous other technologies and contraptions that have been developed to achieve the perfect pint.This year, Guinness launched a 'ground-breaking' £25 Nitrosurge device that attaches to the top of a can and pours a perfectly-straight jet of liquid – as if it's coming from draught.",
        "At the heart of the electronic devise is an 'ultrasonic transducer' – a sensor that can generate or sense ultrasound energy.The transducer has a 'specifically tuned wavelength and frequency to create the iconic Guinness surge', Guinness says – although it's yet to comment on how it actually does this.Six years prior, students at the University of Leeds created a pint-pouring robot that mimics the movement of bartenders to fill up glasses.The robot can start its work with just a simple button push, causing a beer tap to be mechanically pulled down while filling the glass."
    ]
}