{
    "articleURL": "/news/article-12059489/T-J-Holmes-Amy-Robach-planning-divorce-goes-final-stretch.html",
    "content": [
        "Amy Robach and T.J. Holmes's romance is still going strong six months after their scandalous affair was exposed, with the pair now planning to move in together as T.J.'s lease is up for renewal later this summer Sources told DailyMail.com the co-stars-turned-lovers remain committed to each other despite the fallout over their affair, with new photos showing the two living in domestic bliss in New York City This comes as Holmes's divorce from wife Marilee Fiebig, 45, reaches its final stages, after Robach's split from ex-husband Andrew Shue was finalized in MarchAmy Robach and T.J. Holmes are set to take the next big step in their relationship – moving in together – six months after news of their affair saw both their marriages crumble and ended their on-screen gigs at GMA. ",
        "With T.J.'s divorce about to be finalized and the lease on his Manhattan apartment up for renewal in late summer, the practically inseparable co-stars-turned-lovers are eager to start fresh and further cement their relationship by shacking up as a couple. 'They're together all the time anyway, mostly at her place,' a friend of the couple told DailyMail.com exclusively. 'I know at first we may have thought this was just a fling that would burn out, but nuh-uh. They are committed.' ",
        "The source added: 'They run together and hit up their favorite gym practically every day. They're out for romantic dinners.... a little PDA at their local grocery store.' Indeed, new exclusive DailyMail.com photos speak to the undeniably close bond between them, with the two seen holding hands while grocery shopping, going on jogs together, and just stepping out in Manhattan day to day. On Monday, they were back on their fitness routine once again, with the two walking over to the West Side Highway where they began their morning run. Setting off on a balmy sunny day, Amy opted for lighter athletic attire, wearing a black racerback tank top, running shorts, and fluorescent pink and orange sneakers. T.J., 45, also kept cool in a dri-fit black hoodie, white shorts with white leggings underneath, and colorful sneakers.  ",
        "The avid runners had also been seen kicking off the weekend by going on a two-hour run around Manhattan on Friday. ",
        "And earlier in the week, on Thursday, the ousted TV hosts were snapped leaving Amy's Greenwich Village apartment and heading to a nearby grocery store where they were the picture of domestic bliss, browsing the produce section and picking out fresh veggies together. Just a year ago they were skulking about, keeping their relationship top secret from their spouses, peers, and public. Or so they thought. But now they are focused, determined and very much in love and about to make more of a commitment to each other – and save money at the same time, sources say. Two can live more cheaply than one, especially in Manhattan.Of course there are hurdles – Amy's younger daughter, Annalise, 16, still lives with her, however, the teen appears to be closer to her stepfather Andrew Shue, now more than ever, according to insiders. In fact, it was Annalise, who turns 17 on Wednesday, who was seen meeting up with her mom's ex to hand over custody of Amy and Andrew's Maltipoo Brody, in March. ",
        "In the six months since their affair resulted in THE hosts being fired from ABC and filing for divorce from their respective spouses - both after 12 years of marriage - Amy and T.J.'s controversial relationship has managed to prove solid so far. ",
        "In March DailyMail.com revealed Amy and Andrew had finalized their divorce after privately working out their agreement through mediation and reaching a custody deal over their beloved dog. ",
        "Robach and Shue, who each have children from previous relationships, had been married since 2010. The official split came about six months after the Melrose Place actor, 56, learned of her affair and subsequently moved out of their West Village apartment last August.Months later, in December, days after her affair became public, Robach herself was seen moving out of the home, with her parents arriving to help with move.   Robach and Shue had bought the three-bedroom, two-bath Barrow Street property in 2018 for $4million, according to ET. The apartment was reportedly put on the market back in September – after Shue is said to have learned of his wife's romance with Holmes – and sold for $5.2million in mid-November, right before the clandestine relationship came to light. Since then, Robach has moved into a co-op in the Village, however, she is frequently seen spending a lot of time at Holmes's apartment in the Financial District – to which he relocated full time after separating from wife Marilee Fiebig. Holmes and Fiebig are said to have separated late last summer, around the same time as Shue and Robach's marriage collapsed, but the former GMA star only officially filed for divorce in late December.",
        "Sources say the divorce proceedings are now in the final stretch. ",
        "Many had doubted that the couple would outlast the turbulence that blew up around their secret romantic outing last year. ",
        "Robach and Holmes were officially pulled from ABC's airwaves for good in late January after the network's internal review into their affair dragged out their suspension for eight weeks.DailyMail.com secured a copy of the email bosses sent to GMA staff, saying that after 'several productive conversations,' it was agreed it was best for the couple to 'move on from ABC News.' Network executives said they were thankful to Robach and Holmes for their years with ABC but were anxious to move on. ABC executives said they believed Robach and Holmes waited too long to disclose their relationship and sources said the network felt that their 'behavior on set' was 'uncomfortable' for staff.Reports also indicated that Robach walked away with a larger settlement because she had worked at the company two years longer than TJ, and had a higher profile within.But even while their future at GMA still hung in the balance, they continued enjoying their romance undeterred in the face of the scandal, frequently flaunting their love with public displays of affection in the streets of New York City and galivanting around the country and abroad together.",
        "Earlier this year, Holmes was even seen taking his love for Robach to new heights while jewelry shopping ahead of her 50th birthday. Despite being out of work, the former TV anchor was spotted buying a gold 'promise' ring and a chain to hang it on as he prepared for February 6, the day his sweetheart reached the half-century mark.At the time DailyMail.com revealed Holmes stopped first at David Yurman's downtown Manhattan store where he walked away with an 18-karat gold Unity Cable ring that goes for $650, as part of the bridal/wedding collection."
    ]
}