{
    "articleURL": "/wires/reuters/article-12047493/NFL-investigated-two-US-states-sex-bias-harassment-claims.html",
    "content": [
        "By Daniel Wiessner",
        "May 4 (Reuters) - State attorney generals in New York and California on Thursday launched a joint investigation into allegations that female employees of the National Football League (NFL) have been subjected to sex discrimination and harassment.California Attorney General Rob Bonta and New York Attorney General Letitia James, both Democrats, said the investigation will examine the NFL's workplace culture and claims made in several pending lawsuits that the league violated federal and state laws banning sex discrimination, including equal pay laws.Bonta and James said they issued subpoenas to the NFL on Thursday seeking relevant information.The NFL, a multibillion-dollar enterprise led by Commissioner Roger Goodell and headquartered in New York City, is the most popular U.S. sports league.NFL spokesman Brian McCarthy in a statement said the allegations of bias and harassment were inconsistent with the league's values and practices, but that it would cooperate with the investigation.\"The NFL is committed to ensuring all employees of the league are respected, treated fairly, and have equitable pay and access to developmental opportunities,\" McCarthy said.McCarthy said that 37% of the NFL's 1,200 full-time employees are female. The league's chief operating officer, chief revenue officer and chief administrator of football operations are women.Bonta in a statement said his office has serious concerns about the NFL's role in creating \"an extremely hostile and detrimental work environment.\"",
        "\"No company is too big or popular to avoid being held responsible for their actions,\" Bonta added.James in a statement said that \"no institution is above the law, and we will ensure the NFL is held accountable.\"James and five other attorney generals last year sent a letter to Goodell asking the league to respond to allegations of harassment and bias described by dozens of women in a New York Times article and multiple lawsuits.The NFL at the time denied wrongdoing and said it has taken steps toward diversifying its workforce. McCarthy on Thursday said the league \"received no further communication from any of the attorneys general\" before the announcement by the attorneys general.A female former NFL production manager who has sued the league claimed she was excluded from high-level meetings and passed over for a promotion, while a female former NFL wardrobe stylist who also sued claimed she was groped and subjected to sexual comments by numerous league employees.The league in 2020 also launched an investigation into claims that 15 female employees of the Washington NFL team now called the Commanders faced sexual harassment, which also prompted scrutiny from Congress.The NFL is separately facing a lawsuit by Minnesota Vikings defensive coordinator Brian Flores accusing the league and its teams of discriminating against Black candidates for coaching and management jobs. The NFL has said the lawsuit lacks merit.",
        "(Reporting by Daniel Wiessner in Albany, New York, Editing by Will Dunham and Alexia Garamfalvi)"
    ]
}