{
    "articleURL": "/wires/reuters/article-12044007/Ed-Sheeran-copyright-case-goes-jury-New-York.html",
    "content": [
        "By Brendan Pierson",
        "NEW YORK, May 3 (Reuters) - A jury will now decide whether British singer-songwriter Ed Sheeran ripped off Marvin Gaye's \"Let's Get It On\" after hearing closing arguments on Wednesday in a week-long copyright trial.Sheeran's lawyer, Ilene Farkas, told the jurors in Manhattan federal court that similarities in the chord progressions and rhythms of Gaye's classic and Sheeran's hit \"Thinking Out Loud\" were \"the letters of the alphabet of music.\"\"These are basic musical building blocks that songwriters now and forever must be free to use, or all of us who love music will be poorer for it,\" she said.Keisha Rice, who represents heirs of Gaye's co-writer Ed Townsend suing Sheeran and his record label, said her clients were not claiming to own basic musical elements but rather \"the way in which these common elements were uniquely combined.\"\"Mr. Sheeran is counting on you to be very, very overwhelmed by his commercial success,\" she said, urging jurors to use their \"common sense\" to decide whether the songs are similar.The jurors were sent home shortly after closing arguments and will return on Thursday morning to deliberate.Townsend's heirs in 2017 sued Sheeran, his label Warner Music Group and his music publisher Sony Music Publishing, claiming infringement of their copyright interest in the Gaye song.",
        "Sheeran and his co-writer, Amy Wadge, both testified during the trial that they did not copy \"Let's Get It On.\" Sheeran said he had only passing familiarity with the song and that \"Thinking Out Loud\" was inspired by Irish musician Van Morrison.Gaye, who died in 1984, collaborated with Townsend, who died in 2003, to write \"Let's Get It On,\" which topped the Billboard charts in 1973. \"Thinking Out Loud\" peaked at No. 2 on the Billboard Hot 100 in 2015.Sheeran is also facing claims over \"Thinking Out Loud\" in the same court from a company owned by investment banker David Pullman that holds copyright interests in the Gaye song.Sheeran won a trial in London last year in a separate copyright case over his hit \"Shape of You.\"Gaye's heirs in 2015 won a $5.3 million judgment from a lawsuit claiming the Robin Thicke and Pharrell Williams song \"Blurred Lines\" copied Gaye's \"Got to Give It Up.\"(Reporting by Brendan Pierson in New York; Editing by Will Dunham, David Bario and Jamie Freed)"
    ]
}