{
    "articleURL": "/wires/reuters/article-12038713/Inflation-beginning-dent-diesel-demand-says-Marathon.html",
    "content": [
        "By Laura Sanicola",
        "May 2 (Reuters) - High inflation is reducing demand for diesel fuels as manufacturers curtail production and consumers curb consumption, a Marathon Petroleum executive said on Tuesday.While gasoline demand rose 4.7% in the first quarter compared to the prior year period, the distillate demand fell 1.7% for the fuelmaker.\"With the inflationary pressures, you do expect to see some demand curtailments, and we do see that manifesting,\" said Brian Partee, a senior vice president of fuel products at Marathon on the company's first quarter earnings call, adding that it is not a \"bright red light\" for the company.The U.S. Federal Reserve and other central banks are expected to announce further interest rate increases this week after aggressively tightening credit conditions to tame the worst outbreak of inflation in 40 years.Industrial production in sectors such as paper, primary metals and wood products were down between 5% and 11% this year, cutting into transportation needs.Distillate futures fell year-on-year by nearly 50% to $2.275 per gallon on Tuesday, their lowest level since December 2021.Partee called the selloff in recent weeks a \"paradox\" that is overdone and not a reflection of supply and demand fundamentals.Rather, he attributed it to uncertainty around the effects of Western sanctions on Russian refined products in early February on global distillate flows.",
        "Russia has increased its diesel exports to Brazil and other parts of Latin America following an embargo on shipments to Europe, according to traders and Refinitiv Eikon data.\"I think the market had to be more bearish view, if you will, of those sanctions and the implications in terms of slowing flows into the global market,\" Partee said.On an earnings call last week, U.S. refiner Valero said it was not seeing any weakness in diesel demand. (Reporting by Laura Sanicola; Editing by Emelia Sithole-Matarise)"
    ]
}