{
    "articleURL": "/wires/pa/article-12041283/Over-female-athletes-ignored-missed-periods-survey-finds.html",
    "content": [
        "Thirty-six per cent of female athletes have ignored missed periods thinking it was normal or in some cases beneficial for an active person, a new survey has found.",
        "The Female Athlete Health Report from Project RED-S and Kyniska Advocacy focused on responses from 769 athletes in the UK assigned female sex at birth to questions concerning their menstrual cycle and body image.It also found 30 per cent of respondents had been told by a medical professional that period abnormalities were “normal” given their activity level.The report stated this indicated GPs and other healthcare professionals “were not sufficiently informed about the potentially serious health implications of irregular/missed periods”.Common reasons for menstrual dysfunction include low energy availability, polycystic ovary syndrome, an overactive thyroid or heart disease.The absence of menstruation is also a key symptom of Relative Energy Deficiency in Sport (RED-S). It is a condition which can affect elite and non-elite athletes, and is characterised by low energy availability due to a calorie deficit.Pippa Woolven is a former track and field athlete and co-founder of Project RED-S, who helped to develop the Female Athlete Health Report.Woolven struggled with fatigue, injuries and low moods during her career but was consistently given the all-clear by medics to continue competing. She was finally diagnosed with RED-S in 2017 and retired in 2021.Woolven said: “RED-S carries widespread and often life-changing health and performance consequences to athletes of any age, gender, ability or activity. Historically, it has been misunderstood, undiagnosed and untreated. We’re here to help push for change across all levels of sport.”",
        "RED-S can lead to irreparable damage, impairing almost every system in the body if left untreated.",
        "The report found less than 50 per cent of respondents had heard of RED-S before taking the survey.One athlete who completed the survey said: “My GP told me it was normal to miss my period. I had every RED-S symptom, but because none of them were ‘that bad’, my doctors and coach just let me carry on. I thought it was just part of being an athlete.”The report also looked at athlete body image.Seventy four per cent of the survey group agreed that they had “felt as though they did not look like an athlete”, 50 per cent said they had consciously restricted their food intake in order to improve their performance, while 52 per cent said they did so in order “to fit in or look the part in their sport”.The report found 91 per cent agreed that they had worried about how many calories they were eating, with 19 per cent admitting these worries occurred “all the time”.Fifty-three per cent of athletes said they had received comments about their body, with athletes receiving those comments four times more likely to restrict their food intake.One respondent said: “When I was deep in anorexia, someone actually said to me ‘you’re looking like a real runner these days’.",
        "The percentage of respondents in a female athlete health survey who said they worried about calories all the time. (Female Athlete Health Report)",
        "“I was so unwell and so underweight, yet someone felt the need to make that comment.”The report also looked at how athletes get health information. It found only four per cent had received specific female health support from a national sports governing body, with 49 per cent saying they had looked on the internet for information and advice.The report recommends mandatory, centralised and comprehensive coach education on female health to be embedded within all coaching qualifications at all levels, after the survey found athletes who felt their coaches were uninformed suffered 36 per cent more RED-S symptoms.It also called for the creation of an athlete-led female health, body image, eating disorder and RED-S support network, widespread distribution of an online female athlete health toolkit for athletes and parents to be used from an athlete’s first entry into sport.General practitioners should be provided with a resource to better understand specific female athlete health concerns, including RED-S, the report recommended."
    ]
}