{
    "articleURL": "/wires/ap/article-12052811/Canelo-Alvarez-John-Ryder-make-weight-fight-Mexico.html",
    "content": [
        "GUADALAJARA, Mexico (AP) - Canelo Alvarez felt the love on Friday.",
        "After all, he was home.With family and friends in attendance at the iconic Teatro Degollado, Alvarez made weight for his fight against John Ryder on Saturday. Alvarez is fighting in Guadalajara for the first time since June 2011, when he defeated British fighter Ryan Rhodes.Backed by a mariachi band playing popular Mexican songs, the 32-year-old Alvarez registered 167.5 pounds while Ryder weighed in at 168.Alvarez is putting his undisputed world super middleweight crown on the line in the fight at Akron Stadium, a 25-mile ride from Juanacatlan, the small rural town where Alvarez grew up.\"It´s going to be something special, I started boxing here in a little arena, and now I´m coming back to fight in a big stadium,\" Alvarez said. \"I always thought of coming back to fight in Guadalajara, but sometimes you expect something, and the result is even better.\"",
        "Alvarez (58-2-2, 39 KOs) acknowledged that he took a major pay cut, around $14 million, to fight in his home area.\"It's not about the money for me, and yes it´s hard to organize a fight here, for the TV and a lot of things that had to move to do it here, but I´m happy I made this happen and to be fighting here in Guadalajara,\" he said.",
        "Alvarez is a polarizing sports figure in Mexico, but he is still revered in Guadalajara. Fans stood behind barricades outside of the Teatro Degollado, one of the city's landmarks, hoping to get a glimpse of the boxer.At the end of the weigh-in, Alvarez took a few minutes to sign autographs and waved to the fans, many of whom waited four hours in the sun.Even though many fans in Mexico are underestimating Ryder (32-5, 18 KOs), the Briton has won his last four fights. The 35-year-old Ryder holds the interim World Boxing Organization super middleweight belt, which he won in November by beating Zach Parker.Alvarez knows that the fight will not be as easy as his fans believe.\"He's going to be coming for me, he's a southpaw and throws punches from everywhere, it's dangerous because he has nothing to lose, he's going to bring everything,\" Alvarez said. \"But I've been in this position before, I'm more experienced and I know I can handle anything on the ring.\"Alvarez had surgery on his left wrist after closing a trilogy of fights against Gennady Golovkin last September. If he wins on Saturday, he has his eyes set on a rematch with Dmitry Bivol, who defeated him a year ago.\"I want the same terms and the same everything as the last fight, now I´m more focused on John Ryder because it´s boxing and you never know, but the goal is to have the rematch with Bivol,\" Alvarez said.",
        "Organizers are expecting a crowd of about 50,000 for the fight. Alvarez said he struggled to get tickets for his whole family, and the bout will be special because his mother and grandmother will be in attendance for the first time in his career.\"Training here a whole month has been different, and my grandma it´s going to be there with my whole family, my trainer Eddy Reynoso told me to enjoy it and I will, and I´m happy to be fighting here in my prime,\" Alvarez said.___More AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP_Sports"
    ]
}