{
    "articleURL": "/tvshowbiz/article-12058977/Huge-ITV-quiz-renewed-sixth-series.html",
    "content": [
        "A very popular ITV quiz show has been renewed for a sixth series - and is set to hit TV screens later this year.  ",
        "Beat The Chasers, The Chase's spin-off show, will begin filming this week at Elstree Studios and will wrap on May 21. ITV confirmed that the popular series will return, alongside all six chasers: Mark 'the Beast' Labbett, Anne 'the Governess' Hegerty, Shaun 'the Dark Destroyer' Wallace, Jenny 'The Vixen' Ryan, Paul 'The Sinnerman' Sinha and Darragh 'The Menace' Ennis.  Presented by Bradley Walsh, the show sees a professional quizzer - known as the 'Chaser' - compete against a contestant. However, unlike the show's regular format, a contestant could end up facing all six chasers at once.   ",
        "The Chase has a regular TV audience of three to five million and the spin-off Beat The Chasers was first commissioned in 2019. The show has gone from strength to strength, even winning Quiz Game Show at the National TV awards in October 2022. Unlike the traditional episodes of The Chase, Beat The Chasers steps up the action a notch as a contestant attempts to beat a combination of chasers. In the cash builder round, contestants answer five multiple-choice questions for £1,000 each. To then win the amount, they must then face the chasers who will directly compete against them. Beat The Chasers has a 'Super Offer' - if a contestant answers all five questions correctly in the first round they can face all six chasers for a huge reward. ",
        "As in the original format, tensions are high when the clocks are stopped and the contestant is 'chased' for the correct answer. Other spin-offs for the show include the Celebrity Special, The Family Chase, The Chase Extra and The Chasers' Road Trip.  ",
        "It comes after The Chase's question writer hailed praise on show host Bradley Walsh, admitting he is the 'only reason the show works'.The TV personality, 62, has been fronting the hit quiz show since 2009, appearing in over 1,000 episodes.Consequently, the ITV favourite has witnessed maximum success - beating This Morning to Best Daytime Show at the 2022 TV Choice Awards.But, the key behind that success - says Fraser Cameron - is Bradley.Fraser is one of a group of question writers on the ITV game show, including four-time world quiz champion Olav Bjortomt who has been on the show since the first episode.And speaking to Radio Times, he was full of praise for Bradley, admitting he turns a 'normal sounding question' into 'comedy gold'.He explained: 'He [Bradley] reads the multiple-choice questions for the first time on air, so his reaction is genuine shock.'We try to push what is decent at teatime by using words like plums or beaver, or slightly rude words in strange contexts.",
        "'If we're writing funny options, they're usually option C, as the last punch line at the end.'Bradley is one of the main reasons why the show's so popular — he can take a very normal-sounding question and turn it into comedy gold.'Beat The Chasers will return later this year on ITV1 and ITVX.  "
    ]
}