{
    "articleURL": "/wires/reuters/article-12040989/South-Korea-community-doctors-launch-strike-protest-nursing-law.html",
    "content": [
        "By Hyonhee Shin",
        "SEOUL, May 3 (Reuters) - More than 10,000 South Korean community doctors and certified nursing assistants went on strike on Wednesday, protesting a nursing bill they fear would hurt their jobs even as it improves nurses' pay and working conditions.The bill, passed in parliament last week, was primarily designed to help nurses, who have been suffering from burn-out and a shrinking talent pool while fighting on the frontlines against COVID-19.But doctors see the bill as opening the door for nurses to provide treatment without a medical license, while nursing assistants say it would expand jobs for registered nurses at the expense of theirs. They urged President Yoon Suk Yeol to veto the bill and lawmakers to rewrite it.An official at Yoon's office said it would decide after discussions with medical groups and the ruling party.More than a dozen groups staged the strike, including the Korean Medical Association, which represents all doctors in South Korea but did not specify the number of participants. The Korean Licensed Practical Nurses Association, the largest grouping of nursing assistants, said about 10,000 members joined.The impact of the strike was seen as limited, as most protesters used their holidays or shortened business hours in the afternoon, and major hospitals were operating normally.",
        "But the groups said they would go on a general strike nationwide on May 17 if their demands were not met, which would most likely cause disruptions in a medical system already hit hard by the protracted battle against COVID.\"The law should be fair and sensible,\" Lee Pil-soo, president of the Korean Medical Association, told a news conference on Tuesday, asking the government to make a \"fair, reasonable\" decision.The Korean Nurses Association, which has pushed for the legislation, says nurses had long been exposed to hostile work environments and abuses, and the bill would help provide better health care without damaging the interests of doctors and assistants.The health ministry, which had played a mediating role between doctors and nursing groups, blamed the main opposition Democratic Party for using its majority in parliament to pass the bill.Officials expressed concerns that the divide among medical workers could derail their cooperation and undercut the health system.The ministry said on Wednesday it has asked larger hospitals and clinics to extend business hours and maintain 24-hour emergency care services. (Reporting by Hyonhee Shin. Editing by Gerry Doyle)"
    ]
}