{
    "articleURL": "/wires/reuters/article-12053855/Fijiana-Drua-brush-aside-adversity-retain-Super-W-title.html",
    "content": [
        "SYDNEY, May 6 (Reuters) - Fijiana Drua put aside a season of adversity to retain the Super W title with a 38-30 victory over the Queensland Reds in the final of the sixth edition of the Australian elite women's competition in Townsville on Saturday.",
        "Their second success in their first two years in the competition came after off-field money issues that at one point left them locked out of the restaurant at their Queensland accommodation over an unpaid bill. \"It hasn't been the easiest of years, we've been through so much,\" Drua captain Bitila Tawake said as she fought back tears, before leading her squad in the singing of the Fijian hymn \"We have overcome\".While last year they topped the regular season standings, this year the Drua finished fourth and had to beat the four-times champion New South Wales Waratahs in the semi-finals to reach the final.On Saturday, tries from Drua number eight Sereima Leweniqila and winger Adita Miliana early in the second half broke open what had been a tight game.A Luisa Tisolo penalty and a superb solo try from Karalaini Naisewa increased the lead to 38-17, which proved a sufficient cushion despite two Drua players being sent to the sin bin in the last 10 minutes.Hooker Tiarna Molloy and replacement winger Sam Curtis scored tries to make the scoreline more respectable but the Reds were unable to escape a fourth loss in the five Super W finals.\"What an epic battle that was tonight, we'll definitely be back next year,\" said Queensland captain and Olympic Sevens champion Shannon Parry.",
        "The Reds had opened the scoring in both halves through a mazy run from centre Alana Elisaia in the fourth minute and fullback Renae Nona after a neat interchange of passes five minutes after the break.It always looked, however, like were only just containing the powerful Drua, who had a try from close range from prop Tawake and another from a rampaging run by lock Mereoni Nakesa in the first half.(Reporting by Nick Mulvenney, editing Ed Osmond)"
    ]
}