{
    "articleURL": "/wires/reuters/article-12046085/Starbucks-pushes-appeal-Memphis-union-case-US-labor-tactics-scrutinized.html",
    "content": [
        "By Daniel Wiessner",
        "May 4 (Reuters) - Starbucks Corp's lawyers on Thursday will urge a U.S. appeals court to rule that a lower court should not have forced the company to reinstate seven workers allegedly fired for leading union organizing efforts.The case involving a Starbucks cafe in Memphis, Tennessee is one of many legal disputes stemming from a nationwide union campaign at the world's biggest coffee chain whose labor practices are under scrutiny in the U.S. Congress.The dispute is among the first to reach an appeals court. Judges and the National Labor Relations Board have found the company violated federal labor law in several other cases.Starbucks' lawyers on Thursday will tell a three-judge panel of the 6th U.S. Circuit Court of Appeals in Cincinnati, Ohio that a judge was wrong to rule that the firings of the Memphis workers were motivated by anti-union animus.A loss for Starbucks could ratchet up scrutiny of its labor practices after a recent U.S. Senate hearing and a shareholder proposal directing the company to conduct an independent assessment of its response to the union campaign.The Memphis store is one of nearly 300 Starbucks cafes in the United States to unionize since late 2021. The company was union-free for decades.More than 540 complaints have been filed with the labor board accusing Starbucks of illegal labor practices such as firing union supporters, spying on workers and closing stores during labor campaigns.",
        "The company has broadly denied wrongdoing and said it offers employees competitive wages and benefits and respects their rights under federal labor law.Starbucks has argued that the Memphis workers were fired for violating company safety policies and has said it respects the unionization process. It said it reinstated them despite disagreeing with the ruling.On Thursday, the company will argue that the fact that the Memphis store ultimately unionized proves the firings did not improperly erode support for the union.The labor board says the order was crucial to ensuring that workers at the Memphis store and at Starbucks locations nationwide can continue to exercise their rights to organize.Starbucks and Starbucks Workers United, the union waging the nationwide campaign, did not respond to requests for comment on Wednesday.Starbucks is also appealing a February ruling in a separate case ordering the company to cease and desist from firing or disciplining employees at an Ann Arbor, Michigan cafe. The judge in that case rejected the labor board's claim that Starbucks has implemented a company-wide anti-union policy.At the Senate hearing in late March, former Starbucks CEO Howard Schultz defended himself and the coffee chain against allegations by Democrats of \"union busting\" and said the company is ready and willing to bargain with unions that win elections.",
        "Republicans at the hearing defended Schultz, praising the company's competitive wages, health benefits, employee stock purchase program and other benefits. (Reporting by Daniel Wiessner in Albany, New York, Editing by Alexia Garamfalvi and David Gregorio)"
    ]
}