{
    "articleURL": "/femail/article-12045993/Relative-Princess-Diana-looking-East-Coast-universities-considers-moving-US.html",
    "content": [
        "Earl Spencer has revealed his daughter is considering moving to AmericaREAD MORE: House of Wind-sor! Queen Elizabeth used a nifty £1.50 hack to preserve her modesty on blowy days... but the other Royals haven't had such luck! Princess Diana's son Prince Harry has made America his home in recent years - and now another of the royal's relatives is thinking about setting up camp across the pond.",
        "Charles Spencer, 9th Earl Spencer, told his popular podcast Rabbit Hole Detectives, which he co-presents with Reverend Richard Coles and historian Cat Jarman, that his daughter, Lady Lara Spencer, is considering the move. He explained that he recently toured the 'East Coast universities' ahead of his 17-year-old, who he shares with ex-wife Caroline Freud, deciding on where she wanted to further her studies.During a discussion about the history of libraries, he shared how his daughter may attended university in the US.Charles said: 'I just did a tour of the East Coast universities for my teenage daughter, and everywhere you went, one of the big stats they had was how many [books libraries had]… ",
        "'That's a really big thing to them, it's a symbol of not just learning but status,' he added.In August 2022, one of Princess Diana's former bodyguards claimed the royal was planning to move to the United States without her sons just weeks before she died.In his memoir, Protecting Diana: A Bodyguard's Story, Lee Sansum recounts how the princess was about to tell the paparazzi of her plans to move to America in an effort to protect William and Harry from the press as they vacationed with her boyfriend, Dodi Al-Fayed, in St Tropez in July 1997.The family was staying on businessman Mohammed Al-Fayed's luxury yacht as paparazzi swarmed the boat daily, according to Sansum, who looked after the royals during their trip.",
        "'The press were the bane of her life everywhere, not just in St. Tropez,' Sansum writes. 'And she said to me, \"There is nothing I can do in the UK. The papers there attack me no matter what I do.\"'Then she told me: \"I want to go to the US and live there so I can get away from it all. At least in America, they like me and will leave me alone.\"'At that point, Sansum said he remembers asking Diana if her sons would be joining her, to which she explained she would never be allowed to take them from their royal duties.If she moved, Diana reportedly said, 'I will probably only be able to see them in the school holidays.'",
        "As Sansum writes in his memoir: 'You could tell Diana was a wonderful mother, so loving and attentive to her two boys, but it looked as if she might have to leave them both behind in the UK to escape from the press, who hounded her relentlessly every single day of her life.'It was also to free them from all the attention they got when she was with them.'Finally, after a few days into the vacation, Sansum writes, Diana announced she was off to tell the press she was leaving the UK for good.",
        "'I was alarmed because if we thought the press pack outside was huge now, just for her holiday, it would probably go up ten-fold if she gave them a story as big as this one,' Sansum recounts. 'The place would be swarming with paps, desperate to get pictures of the princess who was about to leave it all behind to run off to America.'Sansum said the princess did, indeed, talk to the press that day — but did not wind up saying anything about a potential move to the US.Meanwhile, Charles' second marriage to Caroline, who was previously married to PR guru Matthew Freud, ended in acrimony.The pair married in 2001 and had two children, the Hon. Edmund and Lady Lara Spencer, but Charles left when their daughter was just four months old to start a relationship with American journalist Coleen Sullivan who had been sent to interview him.His divorce settlement with Caroline, who walked away with a £5.65 million payout, left Charles unhappy after he believed he had overpaid.Expecting to pay £4.5 million, Charles blamed his lawyer Sir Nicholas Mostyn for costing him the extra £1 million.He set out to sue the legal team who represented him because he said they did not warn him that changes in the law meant his divorce hearing would not be in private, resulting in him settling out of court.",
        "But his action and a counter-claim against him were then dismissed after all parties agreed to an undisclosed settlement.His new relationship with journalist Coleen brought despair among his family - Caroline was apparently 'devastated' and his older children reportedly never came to terms with the end of the relationship with Caroline - who they were said to have been fond of.Charles late married his current wife Karen Spencer, Countess Spencer, in 2011.  "
    ]
}