{
    "articleURL": "/tvshowbiz/article-12045355/Chris-Pratt-Bradley-Cooper-pose-special-screening-Guardians-Galaxy-Vol-3.html",
    "content": [
        "Chris Pratt and Bradley Cooper reunited on the red carpet at a special screening of Guardians of the Galaxy Vol. 3.",
        "The 43-year-old Pratt - who plays Star-Lord - and 48-year-old Cooper - who voices Rocket Raccoon - posed together on the red carpet at a screening held at iPic Theater in New York City.They were also joined by co-stars Chukwudi Iwuji, Miriam Shor, Karen Gillan and director James Gunn for the screening.The screening comes after box office projections put the Marvel Studios sequel at $110 million domestic and $250 million worldwide for its debut this weekend.Pratt stepped out in a dark blue dress shirt and matching tie under a light blue plaid suit coat with matching pants.",
        "The scruffy Pratt - who was sporting the early makings of a fresh beard - completed his look with brown dress shoes.The equally-scruffy Cooper opted for a green t-shirt under a double-breasted navy blue cardigan sweater.The actor completed his look with matching navy blue pants and black dress shoes for the screening. Cooper also posed with filmmaker James Gunn, who directed all three Guardians of the Galaxy movies. He also posed with one of the franchise newcomers, Chukwudi Iwuji, who plays The High Evolutionary.Pratt also shared a snap of him and Cooper on his Instagram story, along with a shot of him and his team, thanking them for enduring two press tours in as many months, for Guardians 3 and The Super Mario Bros. Movie. ",
        "The actor also took to his Instagram story to share birthday wishes for his co-star Pom Klementieff, who turned 37 on Wednesday. Guardians of the Galaxy Vol. 3 kicks off the summer movie season this weekend, earning an 80% score from the critics on Rotten Tomatoes.",
        "The sequel's aforementioned projected box office debut of $110 million debut would rank 17th in Marvel's 32 films, between 2017's Spider-Man: Homecoming ($117 million) and Ant-Man and the Wasp: Quantumania ($106.1 million).The film is slated for release in roughly 4,400 theaters, which includes 400 Imax auditoriums, 960 Premium Large Format screens, 2,900 3D locations, 285 D-Box/4D motion screens, and 85 ScreenX locations.Chris Pratt returns as Star-Lord alongside Zoe Saldana's Gamora, Dave Bautista's Drax the Destroyer, Bradley Cooper's Rocket Raccoon and Vin Diesel's Groot.Will Poulter will make his MCU debut as the highly-anticipated Adam Warlock, with Chukwudi Iwuji also portraying The High Evolutionary."
    ]
}