{
    "articleURL": "/sport/football/article-12054121/Wolves-1-0-Aston-Villa-Toti-Gomes-ninth-minute-strike-proves-difference.html",
    "content": [
        "Toti Gomes opened the scoring for the home side in the opening 10 minutesDespite a flurry of chances in the second half, Villa were unable to level Unai Emery's 10-match-winning run came to an end against Man Utd last week Julen Lopetegui believes leading Wolves to the brink of Premier League safety is the greatest achievement of his managerial career.",
        "Wolves were bottom of the table when the former Spain and Real Madrid coach took charge of his first game, the 2-1 win at Everton on Boxing Day, but Toti Gomes’ early header was enough to lift them to 40 points – 10 clear of the bottom three with three games left – and bury the memory of last weekend’s 6-0 defeat at Brighton.‘When I took the job a lot of people called me and said ‘You are crazy. Why are you going there?’ said Lopetegui. ‘This was much more difficult than winning the Europa League with Sevilla, or qualifying for the Champions League in three consecutive seasons there.‘I hope we are safe. This victory is about the merit of the players. We arrived here five months ago with 10 points from 15 matches, four points adrift of safety.‘We were in a very bad situation with bad belief and low morale. The players have worked very hard and we have suffered. I want to highlight the club, the staff, the owners, the players and the fans.’",
        "The Italian restaurants of the Black Country have acquired some new regulars since Lopetegui arrived and set about turning around Wolves’ fortunes.Copying a trick used by Claudio Ranieri when he took Leicester to the title seven years ago, Lopetegui rewards his team with pizza whenever they keep a clean sheet and this was their seventh in 10 league games at Molineux.",
        "Meanwhile, Lopetegui’s fellow Spaniard Unai Emery was left scratching his head as Aston Villa have lost punch at just the wrong time, placing their hopes of qualifying for Europe in serious doubt.Ollie Watkins and Tyrone Mings wasted excellent chances for the visitors, who had most of the play but could not make it count when it mattered.Wolves defended their box as if their lives depended on it, and Diego Costa produced a ferocious performance in attack. Lopetegui celebrated extravagantly at full-time, sinking to his knees and shouting ‘Vamos!’ towards the directors’ box.",
        "After scoring in every league game under Emery, Villa have now failed to do so in each of their last two games. Next weekend’s meeting with Tottenham – also pushing for a European spot – at Villa Park is perhaps their final chance.‘We are three points behind Tottenham but we play them at home next week and we will try to keep the European chance still open,’ said Emery. ‘That match is our final.‘The result is disappointing but we have to be excited. The position we are in, we could not have dreamed of three months ago.’After the hammering on the south coast, Wolves needed a reaction and they had it within 10 minutes. Mings could not climb high enough to clear Ruben Neves’ corner and Toti powered home a header off the bar.",
        "Then Jose Sa stopped Wolves losing their lead instantly when Watkins found Emi Buendia and Sa flew to his right to turn the Argentine’s angled effort behind.The pattern was set: Villa knocked at the door, Wolves kept it shut. Watkins’ overhead-kick fell just wide and then Villa’s top scorer put a close-range header straight at Sa after Mings had released Jacob Ramsey on the left.",
        "WOLVES (4-4-2): Sa 7; Semedo 6.5, Dawson 7.5, Kilman 7.5, Toti 8; Nunes 6.5 (Moutinho 90min), Neves 7, Lemina 7.5, Neto 6.5 (A Traore 84); Costa 7.5 (Collins 83), Cunha 7 (Hwang 68, 6).Subs (not used): Bentley, Ait-Nouri, Podence, Sarabia, Gomes.Booked: Costa, Toti, SemedoManager: Julen Lopetegui 8ASTON VILLA (4-4-1-1): Martinez 7; Young 7 (Carlos 65, 6), Konsa 5.5, Mings 5.5, Moreno 6 (Digne 85); B Traore 4.5 (Bailey 46, 6), Luiz 6 (Kamara 86), McGinn 6.5, Ramsey 7; Buendia 7.5 (Duran 81); Watkins 5.5.Subs (not used): Olsen, Chambers, Coutinho, Dendoncker.Booked: Mings, Watkins, LuizManager: Unai Emery 6Referee: S Attwell (Warwickshire) 6Attendance: 31,651",
        "Wolves started the second half with the same purpose at the first and Emi Martinez did well to keep out Costa’s low strike after Pedro Neto’s pass.At the other end, Buendia won the ball superbly in the Wolves half and exchanged passes with Ramsey, forcing the Wolves defence to make another last-ditch block – this time from Max Kilman. Villa kept pushing, with Ashley Young guiding just wide from the edge of the box following a smart free-kick routine, while Matheus Nunes also went close for Wolves.",
        "The wayward shot was to be one of Young’s final contributions as he was replaced by Diego Carlos midway through the half. The Brazilian had not played since August due to a ruptured Achilles and joined Mings in central defence, with Ezri Konsa switching to right-back.Villa should have levelled Douglas Luiz’s floated free-kick found Mings unmarked on the six-yard line only for him to put the volley over. That was Villa’s race run but Wolves are surely across the finishing line now."
    ]
}