{
    "articleURL": "/news/article-12060021/Homeless-hero-saved-baby-rolling-street-lands-job-California-Applebees.html",
    "content": [
        "The homeless man who saved a baby from rolling into traffic says he has landed a job at Applebee's Ron Nessman was leaving an interview at Applebee's when he saw a baby rolling toward the street in a stroller and stopped the incident in a viral videoNessman says he received the job at Applebee's and will be washing dishesThe homeless man who saved a baby rolling toward the street in a stroller in a viral video has revealed he landed a job at a Southern California Applebee's. ",
        "Ron Nessman was leaving a job interview at the restaurant chain when he noticed a stroller heading directly into traffic as the baby's great-aunt stumbled to the ground. On Thursday, he told NBCLA he got the job he interviewed for and will be washing dishes in the kitchen after eight years of being homeless. 'I'll earn everything I get so with that in mind, you know, I appreciate the opportunity that Applebee's has given me. It's really cool,' Nessman said.",
        "Speaking with the Southern California outlet, a manager for the Applebee's location Nessman is now employed at said the viral video didn't factor into the job offer. 'He's a great guy and he was a great candidate, and he'll definitely fit with us here in Team Victorville at Applebee's,' general manager Emily Canady said.The Good Samaritan said he is just glad to have a job and be able to work after years of being homeless. He also said that despite online fundraisers having been started, he wants to make his own money. 'I gotta come to work tomorrow and I can hardly wait to start doing what I do, you know what I mean? It's going to be a good feeling,' he said.In fact, Nessman said he had no idea the viral video had reached so many people after the incident but that he is glad it's been seen as much as it has. ",
        "He told the outlet family members from Florida and Missouri have reached out to let him know they saw it. Nessman just said he's thankful the baby and her great-aunt are doing OK.Agonizing video footage showed Nessman saving the baby after the newborn's great-aunt tripped and fell down onto the ground losing her grip on the baby stroller.Nessman was sitting on the bench of a nearby carwash when he saw the baby propelling towards the four-lane Bear Valley Road, pushed by strong winds blowing through the high desert.'I didn't have time to even think about it. You just react,' he told KCAL News.",
        "'I heard screaming to the right, she said. And I look back and I see a stroller going down the driveway and my heart dropped.'At that moment, she saw her brother grab the stroller before it rolled into the road, where she said cars do '50 to 55 and it was a busy time of day.'He said: 'I knew I could get it and I got it and I'm thankful for that because I really wouldn't want to see the end result if I wasn't there.'She tried everything she possibly could to get up. Her knees were bleeding when I got up to her. She was still shocked and she was crying.'",
        "The video was originally posted on May 1 around 7:30pm by USSGoodGirl with the caption: 'Windy AF here today and the stroller rolled away… Thank god a man catches the stroller before anything bad happens to this lady’s baby.' The post has garnered more than 58 million views after being shared on Twitter.Many users have taken to social media to say they hope Nessman gets the job at Applebees. One person wrote: 'I hope he gets that job he applied for. Incredible!!!' and another said 'Please give him the job.'Someone else wrote: 'I wish this man happiness and I hope he is able to get a job and move ahead with his life.' ",
        "Some people who watched the video wondered if there should have been a lock on the stroller.'Holy s**t!!; wrote one person. 'Why wasn’t it locked?! No way I’d let my hands off a stroller if it was windy like that.'Before he was identified, many shocked viewers were grateful for Nessman's intervention. 'I hope the guy who saved the day by catching the stroller got some kind of kudos locally. Impressive feat,' wrote someone.'I watched that with my heart in my throat,' wrote another user. 'God bless that man.'"
    ]
}