{
    "articleURL": "/news/article-12055507/Actress-Theresa-Randle-Martin-Lawrences-wife-Bad-Boys-replaced-sequel-seen-living-rough-LA.html",
    "content": [
        "Video has emerged, showing actress Theresa Randle, known for her role in the Bad Boys film series, on the streets of LA's Skid RowVideo posted online sees Randle seated in a walker, raising concerns about her well-beingThe development follows news that Randle will not be reprising her role in the upcoming Bad Boys movie with her character now recastVideo of Bad Boys actress Theresa Randle on Los Angeles' Skid Row has alarmed fans just days after she was replaced in an upcoming Bad Boys movie in a role which she had frequented since the mid 90s.",
        "In footage posted to Instagram, the actress looked 'smaller' than previous sightings and appeared to be sitting in a walker. The images come after news was released that she would not be reprising her role in the latest Bad Boys movie, as they had recast her role with a different actress.Roger Neal, Randle's former manager and publicist, confirmed it was his ex-client in the video and said it had raised 'concerns' for her welfare. 'That's definitely her. 100 percent,' Neal said to RadarOnline.Neal represented Randle about a decade ago and despite having received requests for her, he does not have any up-to-date contact information for the actress including an email or a phone number for her.  ",
        "The video sees Randle conversing with locals on the street wearing a Disneyland sweater, a baseball cap, and disposable gloves. Neal was unable to say for sure whether Randle was homeless or simply visiting the area.One woman who has claimed to have been at the scene when the video clip was recorded explained the encounter and said Randle was at Skid Row in Downtown, Los Angeles helping the community.'For the thousandth time she was not in a wheelchair. She was on a walker due to a broken femur, and she was downtown helping out the Skid Row community,' they explained on Twitter. ",
        "'I am the young lady you hear her in the background talking with as well as my nephew. People are so rude and always pass judgment not even knowing the situation.'",
        "The first three films of the Bad Boys franchise's saw Randle play Martin Lawrence's onscreen wife. But now the role has been recast with actress Tasha Smith taking on the role, reports Variety.Plot details on the sequel have been kept under wraps, and it's unclear why Randle was ultimately replaced by Smith.Will Smith - who was spotted filming the sequel earlier this week in Atlanta - will return as Burnett's partner, Mike Lowrey.They will be joined by three stars from 2020's Bad Boys For Life - Vanessa Hudgens (Kelly), Alexander Ludwig (Dorn) and Paola Nunez (Captain Rita Secada). Randle began her acting career in the 1987 film Maid to Order. She the went on to appear in several Spike Lee films, including Girl 6, Jungle Fever, Malcolm X, Beverly Hills Cop III and Space Jam all shot during the late 80s to 2020. ",
        "Both Smith and Lawrence appeared in a video from the set that played for CinemaCon attendees in Las Vegas last week, where Smith revealed they had been filming for roughly four weeks.Newcomers to the franchise include Eric Dane, who joined the cast in April and is said to be playing the new villain, with Ioan Gruffudd signing on as well.",
        "Bad Boys For Life directors Adil El Arbi and Bilall Fallah are returning to direct from a script by Chris Bremmer (Bad Boys For Life, The Man From Toronto), based on characters created by George Gallo.Jerry Bruckheimer is returning to produce, alongside Will Smith through his Westbrook company and Doug Belgrad.Martin Lawrence, James Lassiter, Chad Oman, Mike Stenson, Barry Waldman and Jon Mone will also be serving as executive producers.The franchise kicked off in 1995 with Michael Bay's directorial debut Bad Boys, which opened at $15.2 million en route to $65.8 million domestic and $141.4 million worldwide from a $19 million budget.That movie - along with 1996's Independence Day - solidified Smith as a bona fide box office star, though it took several years for the first sequel to move forward.Bad Boys II was finally released in 2003, with Smith and Lawrence returning and the sequel introducing Syd as Marcus' sister... who Mike was secretly dating.",
        "While a third movie had been discussed for years, it took 17 years for the third movie - Bad Boys For Life - to finally see the light of day, debuting in January 2020, just months before the COVID-19 pandemic shuttered theaters around the world.The sequel - which brought back Smith and Lawrence - debuted with a franchise-best $62.5 million with $206.3 million domestic and $426.5 million worldwide from a trimmed budget of $90 million.",
        "Tasha Smith started her career as an actress with roles in The Whole Ten Yards, ATL, Why Did I Get Married, The Longshots and more, perhaps best known for playing Carol Hardaway in Fox's Empire, while also branching out as a director. She has directed episodes of Star, Black Lightning, 9-1-1, Big Sky, BMF and most recently Mayor of Kingstown and Bel-Air. "
    ]
}