{
    "articleURL": "/wires/reuters/article-12055131/Warren-Buffett-says-Berkshire-not-planning-buy-Occidental-Petroleum.html",
    "content": [
        "By Jonathan Stempel, Carolina Mandl",
        "OMAHA, Nebraska, May 6 (Reuters) - Warren Buffett said on Saturday that Berkshire Hathaway Inc is not planning to acquire Occidental Petroleum Corp but remains happy with its large investment in the oil company.Speaking at Berkshire's annual shareholder meeting, Buffett rejected speculation that Berkshire would buy Occidental after having accumulated a 23.6% stake.\"We will not be making any offer for Occidental,\" Buffett said. \"We have got the right management.\"Occidental did not immediately respond to a request for comment.Analysts and investors have said an acquisition could diversify Berkshire's energy portfolio, which includes several utilities, electricity distributors and renewable power projects.Berkshire started amassing shares of Houston-based Occidental in February 2022, around when Russia invaded Ukraine. Buffett has also had a close relationship with Occidental CEO Vicki Hollub, who has been slashing debt and returning money to shareholders since the company bought Anadarko Petroleum Corp in 2019.\"Hollub is an extraordinary manager at Occidental,\" Buffett said. \"We love having Vicki run it.\"Occidental and Chevron Corp, another large Berkshire holding, also have significant presences in the Permian Basin, an area in Texas and New Mexico that accounts for a significant amount of U.S. crude production.Berkshire ended March owning $21.6 billion of Chevron stock, though it appeared to sell about $6 billion in the first quarter, Edward Jones &amp;amp; Co analyst Jim Shanahan estimated.",
        "Until recently, Berkshire also owned $10 billion of Occidental preferred stock with an 8% dividend, which helped fund the Anadarko purchase, plus warrants to buy another $5 billion of common shares at $59.62 each.Berkshire said on Saturday that Occidental redeemed about $474 million of the preferred stock at a premium, which it had a right to do, reducing dividend payouts. Last August, Berkshire won U.S. Federal Energy Regulatory Commission permission to buy up to 50% of Occidental's common stock.It needed the authorization because it would have had exceeded the Federal Energy Regulatory Commission's 25% ownership limit had it exercised the warrants. Buffett, 92, has longed for another large acquisition for his Omaha, Nebraska-based conglomerate, whose dozens of businesses include Geico car insurance and the BNSF railroad.Berkshire had a 22.6% stake in BNSF before paying $26.5 billion for the remainder in 2010. (Reporting by Jonathan Stempel in Omaha, Nebraska and Carolina Mandl in New York)"
    ]
}