{
    "articleURL": "/wires/reuters/article-12055835/Slingy-Pathirana-Sri-Lankas-asset-reduced-workload--Dhoni.html",
    "content": [
        "NEW DELHI, May 7 (Reuters) - Chennai Super Kings captain Mahendra Singh Dhoni believes Matheesha Pathirana could become a limited-overs asset for Sri Lanka with a light workload that does not include any test cricket.",
        "Operating with a slingy action, Pathirana has proved his death-overs skills in the Indian Premier League (IPL) inviting comparisons with compatriot Lasith Malinga, who troubled the best batters of his time with a similar unconventional action.The 20-year-old claimed 3-15 to set up Chennai's six-wicket victory on Saturday, bowling all his overs in the second half of the Mumbai Indians innings.\"I personally think he is not someone who should play a lot of red-ball cricket,\" Dhoni said alluding to the rigour of test cricket.\"I think he shouldn't even get close to it. Even in white-ball cricket, he should play the 50-over version as less as possible.\"Sri Lanka should use him sporadically and only for showpiece events organised by the International Cricket Council (ICC), Dhoni said.\"Make sure he is fit and available for all ICC tournaments and he will be a great asset for Sri Lanka. Not to forget, he is a really young boy.\"Pathirana has played only one T20 International match and went unsold at the auction ahead of last year's IPL before Chennai brought him to replace an injured Adam Milne.The right-arm bowler played just two matches last year but has 10 wickets from seven matches this season with an economy rate of 7.60.",
        "\"I feel he will serve for a very long time for Sri Lankan cricket, but we'll have to keep an eye on how much he bowls,\" Dhoni said insisting there was more to Pathirana's bowling than just the odd action.\"People who don't have very clean (conventional) action, batsmen find it difficult to pick them...\"That is just on the action part, we are not talking about the pace that he bowls, the variations he has and the consistency he has got. All of it makes him special.\" (Reporting by Amlan Chakraborty in New Delhi; Editing by Muralikumar Anantharaman)"
    ]
}