{
    "articleURL": "/tvshowbiz/article-12058685/Khloe-Kardashian-shares-rare-snap-son-Tatum-9-months-poses-daughter-True-5.html",
    "content": [
        "Khloe Kardashian has shared a gorgeous new snap of her son, Tatum.",
        "The reality star, 38, who shares the nine-month-old with her on-off boyfriend Tristan Thompson, 32, posted the rare photo to Instagram on Sunday.She had been celebrating her nephew Psalm's fourth birthday with her daughter True, five, and her youngest child, who was wearing a red firefighter's hat.Khloe - who looked chic in a white top in the pic - captioned her latest post with three bear emojis.Kim Kardashian spared no expense as she threw the lavish firefighter-themed party for Psalm.",
        "She shared several photos and videos from the event on her Instagram Story.The entrepreneur, who recently reconnected with her ex Pete Davidson at the Met Gala, was also joined by her younger sister Khloe, who appeared in several photos and videos that had been taken during the event.Kim began by sharing a video of several firefighters from Calabasas, who had been invited to the event, standing in front of a vintage fire engine.The social media figure then entered 'Psalm's fire department' and showed off a sizable mural that showed her son responding to a fire alarm.The influencer also showed off her son posing in front of a balloon sculpture that showed a firefighter hosing down a blaze.Psalm was later seen as he took a look at the mural, of which he seemed particularly impressed.",
        "Kim showcased a mocktail station that she had set up for the event in another one of her clips.The reality television personality also had custom plate decals printed that featured text reading: 'Psalm is fired up to be 4!'",
        "The entrepreneur then gave her fans a look into 'Psalm's firehouse,' where partygoers could get their hands on custom-printed 'Psalm merch.'Many of the guests were provided with firefighter's costumes featuring their first names printed on the back of their coats.She went on to show off one of the event's dessert tables, which featured various Dalmatian-themed biscuits, cupcakes and marshmallow sticks, and she also had a churro stand installed at the event.Kim later donned her own custom-made firefighter's jacket and held her son's hand as they walked through the party's grounds.The reality television personality lovingly held her child as the partygoers all sang Happy Birthday.The entrepreneur's youngest son subsequently attempted to break open a fire engine-shaped pinata, and he was later high-fived by one of Calabasas' firefighters.She went on to show off a rolled ice cream stand that had been set up for the party.Kim provided the party's guests with their own Dalmatian-esque stuffed animals, and each came with a 'certificate of adoption.'",
        "Kim shares Psalm and North, aged nine, with her former husband Kanye West.",
        "The social media mainstay went on to share videos of various dessert and candy tables that had been set up for the guests.Kim and Khloe were later seen while riding in the vintage fire engine, and the latter posted a photo of her daughter True, aged five, wearing a t-shirt bearing her aunt's image on her Instagram Story.Khloe's daughter was also provided with one of the custom-printed firefighter's jackets.Psalm's older sister North shared a video to her TikTok account in which she went for a ride with her friends in the fire engine. The influencer and the 45-year-old rapper previously tied the knot in 2014, and they also share son Saint and daughter Chicago, aged seven and five.The former couple eventually split up and their drawn-out divorce was finalized last year.The performer has since moved on with Bianca Censori, whom he married in a non-legally binding ceremony."
    ]
}