{
    "articleURL": "/wires/pa/article-12050265/Break-rapper-Ye-hits-Adidas-earnings.html",
    "content": [
        "Adidas saw operating earnings dwindle in the first three months of the year as the German sportswear company’s break-up with the rapper formerly known as Kanye West and his popular Yeezy shoe brand cost it 400 million euro (£351 million) in lost sales.",
        "Profit was down to 60 million euro (£52 million) from 437 million euro (£383.7 million) in the same quarter a year ago, while the firm’s profit margin shrank to a bare 1.1%.Net sales declined 1%, to 5.27 billion euro (£4.6 billion), and would have risen 9% with the Yeezy line, the company said on Friday.Losing the Yeezy brand is “of course hurting us”, new CEO Bjorn Gulden said in a statement, which did not explain what Adidas would do with 1.2 billion euro (£1.05 billion) worth of unsold Yeezy shoes after the company cut ties with the rapper now known as Ye in October.Adidas is “getting closer and closer to making a decision” on what do to with the shoes and “options are narrowing,” Mr Gulden said Friday – but with “so many interested parties” involved in the discussions, no decision had yet been reached, he said.An operating loss of 700 million euro (£614 million) is possible this year, Adidas said, mostly due to the 500 million-euro hit it would take if it does not sell the existing Yeezy shoes. The break-up, which followed Ye’s antisemitic comments on social media and in interviews, will reduce earnings by 500 million euro (£439 million) in the coming year, the Herzogenaurach-based company has said.",
        "Mr Gulden did say the results for the Herzogenaurach-based company were “a little better than we had expected” as the company seeks to restart growth and move beyond the break-up with Ye.The company also faces other problems tied to Ye. Investors sued Adidas a week ago in the US, alleging the company knew about Ye’s offensive remarks and harmful behaviour years before the split, and failed to take precautionary measures to limit financial losses.The lawsuit – representing people who bought Adidas securities between May 3 2018, and February 21 2023 — pointed to 2018 comments where Ye suggested slavery was a “choice”, and reports of Ye making antisemitic statements in front of Adidas staff.The company said last week that it rejected “these unfounded claims and will take all necessary measures to vigorously defend ourselves against them”.Ending the Ye partnership also cost Adidas 600 million euro (£526.9 million) in lost sales in the last three months of 2022, helping drive the company to a net loss of 513 million euro (£450.5 million)."
    ]
}