{
    "articleURL": "/sport/football/article-12048035/Erik-ten-Hag-hands-Paul-Ince-bottle-wine-accused-disrespecting-him.html",
    "content": [
        "Erik ten Hag's Man United faced Paul Ince's Reading earlier this seasonInce accused Ten Hag of a 'lack of respect' for not inviting him for a drink Ten Hag made amends by handing Ince a bottle of wine on Thursday night Manchester United manager Erik ten Hag got back in Paul Ince's good books by handing the former Premier League midfielder a bottle of wine ahead of his side's clash with Brighton on Thursday night.",
        "Ten Hag and Ince were in opposite dugouts earlier this season when United hosted Reading in the FA Cup in January.The Red Devils picked up a convincing 3-1 victory, but Ince was left unhappy afterwards as he accused Ten Hag and his staff of lacking respect for not inviting him for a drink following the final whistle.Ince has since departed Reading, and having taken on punditry duties at the Amex Stadium, Ten Hag spotted his moment to make amends.Walking over for a pre-match chat with Sky Sports, Ten Hag immediately made a beeline for Ince and presented him with a bottle of wine.",
        "As he handed the bottle over, Ten Hag joked: 'I owe him one!'Ince was thrilled with the gesture and thanked the Dutch manager, who insisted the ex-United star was 'always welcome' and explained that he had simply not had time to catch up with Ince after their meeting in January. A smiling Ince replied: 'We will share it after you win the cup final,' referencing United's upcoming FA Cup showdown with rivals Manchester City next month.Ten Hag, Ince, Jamie Redknapp and Kelly Cates then went on to discuss United's upcoming match before the conversation got back around to wine, with Ince admitting it looked like an expensive bottle.",
        "Ten Hag quickly pointed out: 'It's not about expensive, it's about the taste!'Cates added that the club also have a similar mindset in the transfer market, looking for value over cost, which Ten Hag agreed with.Ten Hag may now have to work wonders in the next transfer window following a recent report that he will only have £100m to spend this summer.He was only able to bring in Wout Weghorst, Marcel Sabitzer and Jack Butland on loan in January, and looks set to be given limited funds once more in the coming months as United looking to avoid any Financial Fair Play breaches. "
    ]
}