{
    "articleURL": "/wires/afp/article-12042295/115-perish-flooding-hits-Rwanda.html",
    "content": [
        "At least 127 people have died as floods and landslides engulfed several parts of Rwanda after torrential rains, destroying homes and cutting off roads, the presidency said Wednesday.",
        "Images posted online by the state broadcaster showed rivers of mud sweeping through the streets as residents scrambled for safety, some wading through the water or clambering over the corrugated iron roofs of collapsed houses.The small country in the Great Lakes region of Africa has been hit by similar disasters in the past but this appears to be the deadliest in several years.Rwanda's government said it was setting up shelters for the homeless in schools and other buildings, without giving a number for those displaced.\"Rescue interventions are ongoing in the most affected districts... in order to secure endangered citizens,\" President Paul Kagame's office said in a statement announcing that 127 people had lost their lives so far.\"My deepest condolences to the families and loved ones of the victims of the landslides and floods that occurred last night in the Western, Northern and Southern Provinces,\" Kagame said in a separate statement on Twitter.\"We are doing everything within our means to address this difficult situation.\"The state-run Rwanda Broadcasting Agency (RBA) said most of the deaths occurred in Western Province which borders Lake Kivu.\"I was at home with my children but we escaped successfully before it collapsed,\" said Jane Munyemana, a resident in the town of Rubavu in Western Province.",
        "\"We plan to remove the floodwaters and sleep in it tonight but we are worried that it may rain again and destroy whatever is remaining,\" she told AFP.In the first four months of 2018, more than 200 people died in Rwanda because of floods and landslides.Other parts of East Africa have also been battered by rains and flooding in recent days, including Uganda where six people have been reported dead.- 'Massive landslides' -Alain Mukuralinda, deputy spokesman for the Rwandan government, told AFP that residents in affected areas have been instructed not to stay in their homes overnight and to find shelter in other sites such as schools.\"We have managed to get essentials such as food, water and electricity in some of these sites and we are trying to get more necessities to ensure that all the affected do not lack the basics in this period,\" he added.Rwanda's minister in charge of emergency management, Marie Solange Kayisire, had earlier told RBA that the authorities were already helping to bury victims of the disaster and provide supplies to those whose homes were destroyed.\"When the floods started, there were massive landslides which caused trees to fall and bury the road down here. Our plantations were also washed away. We have a big problem down here,\" one woman in Northern Province told RBA.",
        "In neighbouring Uganda, six people died in the west of the country when landslides struck their homes after days of torrential rain, according to the local Red Cross.It said five of the dead belonged to the same family and were from a single village.Images shared by the Red Cross showed local farmers perched on steeply terraced hillsides digging through the fresh mudslide and homes buried up to their rooftops in mud.East Africa often suffers from flooding and landslides during the rainy seasons, although several countries in the Horn of Africa have been in the grip of the worst drought in decades.Experts say extreme weather events are happening with increased frequency and intensity due to climate change -- and Africa, which contributes the least to global warming, is bearing the brunt.Last month, at least 14 people died after heavy rains triggered floods and landslides in southern Ethiopia, regional police said. Hundreds of livestock perished and scores of houses were damaged.In May 2020, at least 65 people died in Rwanda as heavy rains pounded the region, while at least 194 deaths were reported in Kenya.At the end of 2019, at least 265 people died and tens of thousands were displaced during two months of relentless rainfall in several countries in East Africa.",
        "The extreme downpours affected close to two million people and washed away tens of thousands of livestock in Burundi, Djibouti, Ethiopia, Kenya, Somalia, South Sudan, Tanzania and Uganda."
    ]
}