{
    "articleURL": "/tvshowbiz/article-12044991/MasterChef-Australia-air-New-Zealand-following-Jock-Zonfrillos-shock-death.html",
    "content": [
        "New Zealand television station TVNZ 2 has confirmed when it will be airing the new season of MasterChef Australia following the death of judge Jock Zonfrillo.",
        "Zonfrillo, 46, was found dead at a hotel in Carlton, Melbourne, at about 2am on Monday after police were called for a welfare check. He died from natural causes.The fifteenth season of MasterChef, originally scheduled to premiere in Australia on Channel Ten at 7.30pm that night, was delayed for a week out of respect.It is now due to premiere at 7:30pm on Sunday, May 7, 'with the full support of' Zonfrillo's family, the network announced yesterday.Following Ten's lead, TVNZ 2 has also moved to launch MasterChef a week later than originally scheduled, with the cooking show now slated to start on Sunday, May 14.",
        "'With the full support of Jock Zonfrillo's family, the new season of MasterChef Australia will premiere on TVNZ 2 and TVNZ+ on Sunday May 14 at 7pm,' a TVNZ spokesperson said on Thursday. 'The season will serve as a tribute to Jock, whose legacy will always live on in the MasterChef kitchen.' New Zealand viewers were generally supportive of the decision, with one saying the new season will be an 'awesome tribute to Jock'.'I'm sure Jock will live on in his family's minds and hearts forever, as it will ours, whenever we watch MasterChef,' they added. 'I don't know if I will be able to watch it without crying,' another Kiwi viewer said. ",
        "Ten's decision to air the new season of MasterChef following the death of judge Jock Zonfrillo has divided viewers.The fifteenth season had been scheduled to launch on May 1 but it was pushed back after the Scottish-born chef was found dead in the early hours of Monday morning.It will now premiere on Sunday, May 7, in the usual 7:30pm time slot.Some fans praised the network for continuing with the season with the family's blessing, while others said it would be difficult to watch in light of Zonfrillo's death.",
        "'This is going to be so hard to watch, but I will. His family will be in my thoughts,' one viewer wrote on Instagram.'While it will be sad knowing this is the last we will see of Jock, it'll be a great honour to see him off in his last work on TV,' another said.'Oh man, it's going to be an extremely hard watch but I wouldn't miss it,' a third viewer commented.'I was so excited for this season to start, but it's going to hurt when it ends. Give it up for Jock Zonfrillo, everybody,' another wrote.One fan said: 'Man, this'll be hard to watch. I don't know if I can.'",
        "'Watching this season is going to be utterly heartbreaking. Still in total disbelief. I cannot imagine how his family must be feeling,' another agreed.",
        "Production wrapped on the 62-episode season at MasterChef HQ in Flemington, Melbourne, last month.The new season reportedly cost 'millions' to make, and producers are now looking to add a special 'tribute' episode to Zonfrillo before confirming his replacement.Zonfrillo is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.A Victoria Police spokesperson told Daily Mail Australia: 'Police attended a Lygon Street address for a welfare check and located a man deceased about 2am on May 1.'The 46-year-old man's death is not being treated as suspicious. A report will be prepared for the coroner.'"
    ]
}