{
    "articleURL": "/sport/football/article-12050095/Neil-Warnock-reveals-WONT-permanent-job-Huddersfield-despite-Championship-survival.html",
    "content": [
        "Warnock guided the Terriers to survival after taking over the club in FebruaryThe 77-year-old admitted that he won't stay on as boss of Huddersfield TownHe believes that 'the job is done' for him after guiding the club to safety this yearNeil Warnock strolled into the press conference room at the John Smith’s Stadium half an hour after Sheffield United manager Paul Heckingbottom had concluded his post-match duties and made sure he was worth the wait.",
        "For the best part of the next half an hour, the 74-year-old spoke with all the humour, honesty and love for the game that has seen become somewhat of an icon over the years, with constant mentions of Sharon (his wife) who persuaded him to to take the Huddersfield Town job, tales of Pep Guardiola’s Man City been the best side he has ever seen and so much more.In an era of cliche-filled press conferences, the sheer authenticity of Warnock was refreshing in itself. In truth, he could have gone on all night.Before the 74-year-old had even sat down to discuss Huddersfield’s great escape - 30 years after his first stint as Terriers boss - he turned to Steven Chicken of the Huddersfield Examiner and thanked him directly.‘Can I thank you Steven for picking the team? My team was different and then I read your column in the paper this morning and decided to go a little bit more defensive,’ Warnock admitted.",
        "On Thursday morning, he opted for Rarmani Edmonds-Green at right wing-back and played Josh Koroma up front, instead of Joseph Hungbo.‘Where do you want your statue (for saving Huddersfield) then?’ asked Steven.‘There’ll be a few pigeons happy about that, all over the country,’ responded Warnock in typical fashion.",
        "Huddersfield may have been 90 minutes away from the Premier League this time last year but the euphoria from the twenty-thousand plus at full-time in West Yorkshire after a 1-0 win to secure their Championship status and the adulation for Warnock around at the ground showed just how much this meant.Even Warnock himself said it was the biggest achievement of his 43-year managerial career after coming out of retirement in February, with Huddersfield just a point off the bottom.‘Right at the top (it ranks) - I’ve not had anything more difficult,’ Warnock told Mail Sport.",
        "‘I don’t think I’ve been any prouder. I think it’s a massive achievement.‘When Ronnie Jepson (his assistant) phoned me after the Stoke City game (which Huddersfield lost 3-0), I was in New York and he said to me ‘Gaffer, are you sure? It’s the worst team I’ve ever seen in the Championship.’‘So to come and then have two four-nil defeats and still get out (of the relegation places), it's just fantastic. I can't be any prouder to be the man in charge when we've done something like this.‘And I like to think we’ve had a bit of humour and we’ve had a laugh along the way.‘You've got to get a dressing room that wants to do it for you. That wants to die for three points,’ said Warnock, fittingly.",
        "From seven wins in 31 games before Warnock’s arrival to six wins in 14 under him and Jepson, they have transformed the fortunes of the Terriers.",
        "And the pair were even given a guard of honour by the Huddersfield squad.‘That’s the first time I’ve ever had one of them,’ admitted Warnock.‘It was quite emotional all the way around the ground. It’s been an amazing roller coaster ride.‘I think this will have converted youngsters to be Huddersfield Town fans for years to come. Because I remember going to Bramall Lane one night and it was amazing. I think it was Arsenal we were playing in floodlights, and I just remember wow! Joe Shaw, Doc (Derek) Pace and how brilliant they were and that just did me. I had to be Sheffield United I and I hope this will have created a few more Huddersfield Town fans.‘You can’t replicate an evening like this when that whistle goes - no matter what you say. As old as I am, it’s still the same when that whistle goes and you know how much it means. It’s just a fantastic feeling,’ Warnock insisted.Asked about what he put down the successes of himself and the likes of 75-year-old Roy Hodgson at Crystal Palace to, Warnock stressed the importance of experience.",
        "‘Yeah but he has some good players doesn’t he Roy. Wilfried Zaha, Ebere Eze, Michael Olise and all them. Bloody hell, I’d have that job,’ joked Warnock.‘When you get older, I think it’s the calmness and the confidence that you bring. You look at what Roy’s done and he’s just given them freedom. Like (Jaheim) Headley here. At half-time, I gave him a roasting telling him ‘I’d have played somebody else if I’d have known you were going to cut back inside all the time. Take him on. I’m not bothered if you lose it’.’‘I thought in the second-half he was super and it’s just directing them really,’ added Warnock.‘I could stop here with you lot all night but I want a Negroni now,’ he laughed as the questions kept on coming.",
        "‘Anyone else?’ asked Warnock before noticing former Sheffield United striker Carl Asaba, who played under him at Bramall Lane, in amongst the dozen or so journalists.‘Sarbs, I didn’t bloody recognise you with your hat on! I’ve only just seen you now Sarbs. Bloody hell, are you alright? Is your family alright?,’ Warnock asked.And even when the Huddersfield Town Communications Director David Threlfall-Sykes finally signalled an end to proceedings, Warnock’s next comment was to ask, ‘When are we doing press for Monday?’",
        "Like a child buzzing with excitement. Over 1600 matches later, but still in love with the game.Monday’s clash against Reading now will be a survival party for Huddersfield fans, as advertised by the stadium announcer minutes after the final whistle had blown, where Warnock will also say goodbye as his short-term contract expires. For now, he has no plans of extending or of taking another job.‘I couldn’t do ten months of this. I’ll be back next February somewhere. I’m sure she’ll (Sharon) get fed up of me at home,’ joked Warnock.‘But I think the job’s done here for me. I’ve really enjoyed it.’All good things must come to an end. It’s just a lot better when it’s a happy ending.And for those a few miles up the M62 at Elland Road, they will be hoping that another managerial veteran in Sam Allaradyce, will give them their own great escape."
    ]
}