{
    "articleURL": "/wires/reuters/article-12044547/Oklahoma-Gov-Stitt-sees-growing-foreign-investments-state.html",
    "content": [
        "By Andrea Shalal",
        "WASHINGTON, May 3 (Reuters) - Oklahoma is seeing a sharp increase in foreign investment interest, especially in its renewable energy sector, and is on the cusp of signing large new deals with firms in Switzerland and Asia, Governor Kevin Stitt told Reuters on Wednesday.Stitt said Oklahoma, which just signed a trade agreement with Britain, said foreign governments were increasingly looking to bypass what he called \"dysfunction\" in the U.S. Congress to forge favorable trade deals with states like his.\"If you want a manufacturing center in the U.S., there's not a better state to be located in than Oklahoma. We're dead center located in the middle of the U.S.,\" he said, citing a big push by countries and companies to diversify their supply chains and reduce reliance on China.The state's low energy costs - about one-third the cost of energy in Europe and the lowest in the United States - were a big draw, Stitt said, adding that Oklahoma derived about 45% of its electricity from renewable sources.He said he had met recently with officials from Germany, Switzerland, South Korea, Taiwan, France and Qatar, and was in talks with various firms about potential deals valued at around $1 billion, but ranging higher.One Asian firm was preparing to finalize an investment deal valued at $5 billion, with another deal imminent with a Swiss firm in the \"green energy\" space, he said.",
        "Stitt, in Washington for the SelectUSA Investment Summit, gave no further details about the companies involved.Japan's Panasonic Holdings), a battery supplier to electric vehicle maker Tesla Inc, said on Sunday it is considering building a battery plant in Oklahoma, its third in the United States.Stitt said agriculture and rare earths production were other promising areas.USA Rare Earth is investing heavily in a rare-earth metal manufacturing facility in Stillwater, Oklahoma, Stitt said. (Reporting by Andrea Shalal; Editing by Lincoln Feast)"
    ]
}