{
    "articleURL": "/news/article-12049075/Liliana-Goodson-Twist-case-American-accused-golden-gun-designer.html",
    "content": [
        "Liliana Goodson is US graphic designerArrested for allegedly bringing gun to AustraliaFailed to make bail and stayed in jail for a week A heavily tattooed graphic designer who is accused of trying to smuggle a 24-carat, gold-plated semi-automatic gun into Australia will spend at least a week in jail after she failed to make bail.",
        "Liliana Goodson, 28, travelled to Sydney from LA on Sunday before Border Force agents allegedly detected the 1911 Colt 45-style pistol in the American's luggage.Goodson was detained and charged with intentionally importing a prohibited item without approval - before being given a $10,000 bail. However, in a twist, it was revealed in court on Friday that the non-binary designer, who uses they/them pronouns, had failed to pay the surety and is in custody. Goodson lodged an appeal to be released next Monday and to be allowed three days to pay the $10,000. However, a magistrate instead adjourned the case until next week, meaning Goodson will spend at least the weekend behind bars.",
        "A briefing on Goodson's case is also expected to be presented to court on June 28. If convicted, Goodson could be jailed for 10 years. The designer also faces visa cancellation and deportation back to the US. Daily Mail Australia previously revealed that Goodson - who also goes by the name River SolDorado Salvatore Chunga - had a job lined up in Australia and planned to live in the trendy beach suburb of Bondi.But those plans have gone awry after the alleged discovery of the $2,000 gold-plated weapon inside Goodson's suitcase. Goodson was taken to Surry Hills Police Station and charged with intentionally importing a prohibited item with without approval. ",
        "Daily Mail Australia also revealed that Goodson grew up in U.S. southern state of Alabama and studied physics at Troy University after finishing high school.Goodson worked in a range of hospitality jobs after 2016 and had a stint as a tattoo artist in Andalusia for three years before relocating to Los Angeles and moving into freelance graphic design.",
        "In March, Goodson wrote a post in an LA-based Facebook group asking whether any users would foster two dogs for about eight months.'I’m traveling overseas for work and unfortunately, the process to export my loves is a long process due to the country’s requirements,' they wrote. ",
        "'I would love to keep in touch for updates, as well as someone who can work with me as I continue their half year or so process so they can eventually join me overseas.'Importing a dog from the US to Australia is a lengthy and expensive process which involves multiple government-approved vets, blood tests, parasite checks, and mandatory 10-day quarantine upon arrival.Following Goodson's arrest, Australian Border Force Commander Justin Bathurst said the agency's were able to prevent the deadly weapon from entering the community through the combined efforts of ABF officer skills and sophisticated detection technology.'We have seen just how good ABF officers are at targeting and stopping illegal, and highly dangerous, goods from crossing Australia's border,' he said.",
        "'The ABF is Australia’s first and most important line of defence.'ABF officers are committed to protecting our community by working with law enforcement partners to prevent items like unregistered firearms getting through at the border.'"
    ]
}