{
    "articleURL": "/wires/reuters/article-12056439/Thairo-Estrada-Giants-aim-win-struggling-Brewers.html",
    "content": [
        "The Milwaukee Brewers must find a way to figure out a guy Giants manager Gabe Kapler calls \"one of the best players in baseball\" when the clubs conclude a three-game series in San Francisco on Sunday afternoon.",
        "The Giants have won the first two games of the series -- 6-4 and 4-1 -- getting two hits (including a homer), three RBIs and two runs from shortstop Thairo Estrada.Normally a second baseman but getting an extended run at shortstop with Brandon Crawford out with a calf strain, Estrada has hit safely in four straight games and nine of the past 10. He has raised his average from .310 on April 25 to .336.Estrada's one hit Saturday went an estimated 376 feet, over the left-field fence for a two-run homer that extended a one-run lead to 3-0 in the third inning. The homer was his fifth of the season, and the two RBIs raised his season total to 13.\"I think we're getting to the point where Thairo is one of the best players in baseball,\" Kapler said after his club's fourth straight win. \"When you have a guy who can play up the middle (defensively) like he does and be the type of offensive player like he is right now for us, you've got to mention him as one of the best in the league.\"The task of slowing Estrada in the series finale will fall on Brewers right-handed starter Adrian Houser, who is slated to make his 2023 debut. The 30-year-old began the year on the injured list after suffering a strained groin during spring training.",
        "Houser has never gone head-to-head with Estrada and has faced the Giants just once, in a two-inning relief stint in 2019 in which he allowed three hits and one run.Milwaukee manager Craig Counsell hopes to see the entirety of Houser's debut after having been ejected in the fourth inning of Saturday's loss for arguing the reversal of a balk call on Giants starting pitcher Alex Cobb.\"We were going on two (pitcher) disengagements, and a balk was called, and they changed the call,\" Counsell explained after the game. \"Their ruling was they took away the (first) disengagement because at some point after the disengagement they did a mound visit. In my eyes, it wasn't related, and the first-base umpire didn't see it that way. Apparently one of the (other) umpires did, and that was enough to overturn the disengagement.\"The Giants will call on right-hander Ross Stripling (0-1, 6.10 ERA) to make his third consecutive start on Sunday.The 33-year-old has bounced between starting and relieving this season but has been impressive in his last two starts, allowing just two earned runs in each over a total of 8 1/3 innings.Stripling has pitched well against the Brewers in his career, going 1-0 with a 1.53 ERA in five appearances (three starts). He will face a Milwaukee club that has lost six games in a row.",
        "One of the biggest issues for the Brewers in San Francisco has been a lack of pop. They've totaled just 13 hits in the two games -- 12 singles.--Field Level Media"
    ]
}