{
    "articleURL": "/health/article-12060521/I-went-partially-blind-getting-sunburn-EYES-Heres-wish-knew-beforehand.html",
    "content": [
        "Dana Galiano, 47, spent two days at the beach before seeing marks on her eyesA burning sensation lasted hours and she only later found out it was from UV raysREAD MORE: Experts advise wearing  sunglasses all day March to September Your favorite pair of sunglasses are more than a fashion statement — they also protect your eyes from sunburn.",
        "Dana Galiano, 47, from New Jersey, was struck with photokeratitis — the clinical name for a sunburn on the cornea — in both eyes during a family beach trip to Ocean City in July. She believes the burns are responsible for impairing her short-distance vision. The woman did not wear sunglasses on this trip, and when she got home she felt a burning sensation in her eyes as if sand had been blown into them.She is no longer in pain and her vision has not been harmed drastically in the long-term, though she finds she needs her glasses more often than ever before. Doctors strongly advise that people wear sunglasses outside and avoid looking directly into the sun which emits harmful UVA and UVB radiation that over time can lead to cataracts and eyelid cancers. ",
        "‘I don't always wear sunglasses in the sun, and I started to feel almost like a burning in my eye, not like, from allergies or anything, like an actual burn in the eye,' Ms Galiano told DailyMail.com.'And I didn't think anything of it… I did realize that there was some mark on my eye, right? But I didn't know what it was.’The Jersey native spent a long beach day reading an issue of Us Weekly last summer and felt pain when she returned home.",
        "She said: ‘After I felt like that, I closed my eyes and put a towel over the top of my face, and then when I got home from the beach just rinsed my face with water. And my eye wasn’t red or anything but it was still kind of aching.’At first, it felt like grains of sand had blown into her eye, causing a severe burning sensation. It turned out that she had experienced a sunburn within her right eye.One of the primary symptoms of photokeratitis is grittiness in the eyes, which can be mistaken for debris there.‘I even said to my mom, can you look at my eyes, do I have sand in my eye, like I don't know what it is because my eye wasn’t red or anything,' she continued.'That's what's so crazy about this whole thing, nothing was in my eye and I'd rinsed it out with water,’ she said.The pain finally subsided a few hours and a dose of Motrin later.Still, though, she saw a mark on her right eye that had not been there before. But, as a self-described procrastinator when it comes to check-ups, she ignored it.",
        "Rugby player Thom Evan suffers with a condition called pterygium - which is caused by exposure to UV sunlight.",
        "When the same thing happened in her left eye the following weekend after a day of lounging at the beach, leaving her with another mark, Dana sought medical attention.She said: ‘Lo and behold, I go to the doctor, and they were like, you have a sunburn in your eye and it's permanent. And they asked how often do you wear sunglasses. And I’m like, I sometimes wear them but not all the time.‘I haven't worn sunglasses my whole life when I'm in the sun. I just don't do it. So they're like, you have a burn, a permanent burn on your eye. And you cannot continue to not wear sunglasses.‘[The doctor] said it just it would get worse. And it actually will affect your vision. So right now the spot on my eye, can see it, but over time, she said what would happen is if I don't wear sunglasses, that it can eventually get bigger and then you know, I won't be able to see.’While she isn’t in pain anymore, Dana has had to get glasses to deal with farsightedness. Photokeratitis typically does not harm vision long-term and Dana acknowledged that her doctors could not say for sure that her increased need to wear glasses was a direct result.  ",
        "She initially thought losing her vision was a symptom of aging, but her doctor told her the permanent burn could absolutely affect her ability to see.Dana said: ‘She didn’t say the burn on your eye is 100 percent the reason that you need stronger glasses now. Before I just used them at night for driving, but now I need to wear glasses every day, looking at my computer and to drive.‘That [damage is] part of it. Because whenever you have any type of damage or something to your eye, like your cornea, it impairs your vision.’Permanent vision damage due to photokeratitis is rare but not unheard of, according to Dr Jeff Dello Russo, an ophthalmologist who specializes in laser eye surgery in New York and New Jersey.Dr Dello Russo told DailyMail.com: 'It's most often something that happens, you can just see it over a very long period of time, not like one instance in the sun, but it's possible.'You can have photokeratitis with no visible signs other than your eyes are red and irritated, that's most of the time. Seeing a physical mark like that is less common.'The condition is caused by the sun’s rays reflecting off water, sand, or snow, and is especially common among winter sports athletes who spend a lot of time at high altitudes where the air is thinner and provides less protection from UV rays.",
        "It is unknown how common or uncommon the condition is, as it can be mistaken for eyestrain, dry eyes, or debris in the eyes. Dr Dello Russo said: 'I don't think there's any true incidence report on how common it is.' Ms Galiano has spent much of her life in the sun, including her professional life. As a director at the National Mortgage Insurance Corporation, she conducts a fair bit of business outdoors on the golf course.Other symptoms of photokeratitis include redness, pain and swelling, tearing, blurred vision, eyelid twitching, sensitivity to light, gritty feeling in the eye, and inflammation of the conjunctiva, or the mucous membrane that protects the eye.Photokeratitis usually lasts less than a couple of days and permanent damage is rare, but over time repeated cases of photokeratitis can increase your risk of long-term eye damage. For instance, 10 percent of cataract cases can be attributed to too much exposure to UV rays.Dana is a dedicated polarized sunglasses wearer now, she said, and presses her two daughters ages 15 and 18 to wear them whenever they encounter UV rays.She said her eyes are ‘a main priority now. It's my vision, because these are my only eyes.’"
    ]
}