{
    "articleURL": "/wires/reuters/article-12053019/Tyrrell-Hatton-3-Wells-Fargo-leaders-second-round.html",
    "content": [
        "Englishman Tyrrell Hatton shot a 6-under 65 to soar into a share of the 36-hole lead at the Wells Fargo Championship on Friday in Charlotte, N.C.",
        "Hatton, Nate Lashley (66 Friday) and Wyndham Clark (67) are atop the leaderboard at 8-under 134.A host of big names on their tails with a share of a $20 million \"designated event\" prize purse on the line. Sungjae Im of South Korea (66), Justin Thomas (67), Xander Schauffele (69) and Australia's Adam Scott (68) are all part of a six-way tie for fourth at 7 under, along with J.J. Spaun (67) and Canada's Adam Svensson (67).First-round leader Tommy Fleetwood of England settled for a 71 on Friday and is tied at 6 under with Michael Kim (68) and South Korea's K.H. Lee (70).Hatton's 65 matched the round of the day at Quail Hollow Club. He began his round on the back nine and birdied four of his first six holes before a setback of consecutive bogeys at Nos. 16 and 17.He rectified that by saving six straight pars, draining a 33-foot birdie putt at the par-3 sixth and carding an eagle on the par-5 seventh from 26 feet out. One last birdie at the par-4 ninth, this time from 31 feet, brought him to 8 under.\"They're not the type of putts that you hole consistently, so to finish the round that way, I'm obviously very pleased with that,\" Hatton said.",
        "While Hatton has a single win on the PGA Tour (the 2020 Arnold Palmer Invitational), Clark is still after his first. Clark also eagled the seventh hole en route to his second straight 67.\"The shot in there was very lucky and unbelievable,\" Clark said. \"We were trying to hit it left of it. I was trying obviously to hit a cut, but I was not trying to go for the green. It kept cutting and kept cutting and kind of knuckled on me and ended up on the green. Then, yeah, I hit that putt firm, so glad it hit the hole.\"Lashley entered the week No. 209 in the Official World Golf Ranking and hasn't won since the 2019 Rocket Mortgage Classic. Lashley put together a bogey-free card with five birdies Friday.\"Anytime you get a round at Quail Hollow with no bogeys, it's a great round,\" Lashley said.Thomas will be one to watch on the weekend; the two-time major champion has slipped to No. 15 in the world but won his first PGA Championship (2017) at Quail Hollow.He navigated Friday with five birdies and two bogeys.\"This is a very, very special place to me and always will be, so it's always going to put me in a good head space here,\" Thomas said.",
        "World No. 5 Schauffele stayed in the mix after an opening-round 66. He was even through his first 12 holes but birdied the par-3 fourth and the seventh.Lee was tied with the three co-leaders at 8 under stepping to his final hole, the ninth, but a wayward drive and a poor third shot led to him making double bogey and losing his share of the lead.Defending champion Max Homa shot 67 and was part of a tie for 13th at 5 under. Patrick Cantlay (71 Friday), Webb Simpson (67) and Gary Woodland (69) are among those tied at 4 under. Rickie Fowler posted a 68 to get to 3 under and ensure he would make the cut.Northern Ireland's Rory McIlroy, the world No. 3, made a crucial par save at the par-4 18th to finish off a 73 and make the cut on the number at 1-under par. His tee shot at No. 18 nearly found the creek to the left of the fairway, and standing on a difficult lie, he sailed his ball onto the front of the green, where he two-putted for par from 75 feet.Notable names to miss the cut include Australia's Jason Day (even), Ireland's Shane Lowry (2 over), Collin Morikawa (4 over) and Jordan Spieth (7 over).",
        "--Field Level Media"
    ]
}