{
    "articleURL": "/sport/cricket/article-12042909/Three-Yorkshire-players-guilty-using-racist-language-Azeem-Rafiq-not-pay-fines.html",
    "content": [
        "The long-running disciplinary process in danger of descending into farceSix former players were found guilty of using racist language towards Rafiq ECB's legal team urged the CDC to levy fines totalling £37,000 on the players A number of the former Yorkshire players found guilty of using racist language towards Azeem Rafiq will refuse to pay fines imposed by the Cricket Discipline Commission with the long-running disciplinary process in danger of descending into farce. ",
        "At a hearing in London on Wednesday the ECB's legal team urged the CDC to levy fines totalling £37,000 on the six ex-Yorkshire players, including former Ashes winners Matthew Hoggard and Tim Bresnan, as well as recommending a formal reprimand and education course.Mail Sport has since spoken three of the players involved who have said they will not pay the fines in protest at what they regard as the ECB's flawed disciplinary system. In a separate development former Yorkshire bowler and second XI coach John Blain has launched a crowdfunding appeal to help fund his legal costs.'This is a depressingly predictable and wholly unjust decision,' Blain said. 'Despite being entirely innocent of these allegations I was advised by my lawyers to withdraw from the ECB process due to its many fundamental flaws.",
        "'The evidence given was one-sided, partial and in some areas simply untrue. I have never used such language, as is supported by many independent witnesses.'The ECB are understood to be aware they may face problems collecting any fines imposed by the CDC, who are not expected make a decision on the punishments until next month. The governing body's only recourse of action if the players refuse to pay would be to take their case to a small claims court, although this could cost more money than they would be due to recoup.",
        "Former England batter Gary Ballance was the only player to have legal representation at Wednesday's hearing after he pleaded guilty to using discriminatory and/or racist language towards Rafiq. The 33-year-old is facing the strongest punishment after the ECB asked for him to receive an eight-week playing ban and £8000 fine despite the fact that he retired from all cricket last month after making a brief return playing one-day internationals for Zimbabwe.The ECB asked for their former star players Hoggard and Bresnan to be given fines of £7,500 and £5,000 fines respectively, while the ex-Yorkshire trio of Andrew Gale, John Blain and Richard Pyrah are facing fins £7,500, £5,000 and £4,000 fines respectively for their part in the scandal.The ECB said all five players would have been suspended if they were still playing. Bresnan retired in January 2022, Gale in 2016, Pyrah in 2015, Hoggard in 2013 and Blain's last top-level match was in 2010.CDC Chairman Tim O'Gorman warned the panel would not be able to make a quick decision almost 11 months after the ECB first brought disciplinary charges against the players.'It is going to take time for the full decisions to be made and for them to be available in writing,' he said. 'That is going to take several weeks.'",
        "Sanctions against Yorkshire, who admitted four amended charges, will be discussed at a hearing in late June."
    ]
}