{
    "articleURL": "/sport/football/article-12038449/Leeds-players-divided-young-stars-blaming-senior-pros-slide-drop-zone.html",
    "content": [
        "Leeds United news LIVE: Allardyce AGREES to replace Gracia as managerDivisions in the dressing room at Elland Road mirroring those in the boardroomDirector or football Orta sacked as he believed Gracia should have been retainedSam Allardyce will be tasked with lifting a demoralised and divided group of players when he takes charge of his first training session as Leeds manager on Wednesday. ",
        "Mail Sport has learned that there are divisions in the dressing room at Elland Road mirroring those in the boardroom, which saw the departure of director or football Victor Orta on Tuesday due to his belief that Javi Gracia should have been retained.A number of players are also understood to have remained loyal to Gracia, who won just three of his 11 matches in charge to leave Leeds deep in relegation trouble after four defeats in their past five games.Behind the scenes there are also tensions between Leeds’ younger and more experienced players, with a number of the youngsters believing the team are suffering from a lack of leadership shown by the club’s senior professionals.Leeds have imploded over the last month following a decent start after Gracia was belated appointed as caretaker manager in February, conceding 18 goals in their last five games. Heated words were exchanged following the 5-1 home defeat to Crystal Palace last month that started the dismal run and the players’ morale has not improved since.",
        "Leeds owner Andrea Radrizanni had almost made his mind up to sack Gracia after they missed an opportunity to stop with rot by drawing 1-1 at home to Leicester last Tuesday, with Sunday’s 4-1 defeat at Bournemouth the final straw. ",
        "Orta was Gracia’s only defender at Boardroom level and following discussions with Radrizanni on Monday and Tuesday it was decided the Spaniard should leave the club."
    ]
}