{
    "articleURL": "/tvshowbiz/article-12048737/Emma-Weymouth-wows-shiny-white-suit-opening-new-exhibition-National-Gallery.html",
    "content": [
        "Emma Weymouth wowed in a shiny white suit on Thursday as she attended the opening of the Saint Francis Of Assisi exhibition at The National Gallery. ",
        "The Marchioness of Bath, 37, was at a private dinner hosted by fashion designer Brunello Cucinelli. Emma donned a white tube top to showcase her slim figure, which she paired with a statement shining suit. The socialite added inches to her height with heels to match the neutral tones of her ensemble and toted her belongings in a sliver sparkly bag to add to the glitz and glam of the look. For make-up, she wore a very glowing palette with a rosy red lip and black eyeliner to accentuate her beauty. ",
        "She posed for pictures with Brunello's daughter Carolina Cucinelli and fashion writer Pippa Vosper. Also in attendance were Mark Strong, Martha Ward, Federica Benda and Liza Marshall for the swanky evening out.  Emma's father-in-law Alexander Thynn died from Covid-19 in April 2020, making her husband the Marquess of Bath in April, and inheriting the estate Longleat, which is famous for being the first drive-through safari park outside of Africa.Emma has been married to Viscount Weymouth Ceawlin Thynn, 48, since June 2013, with the couple sharing sons John, six, and Henry, four. The boys' official titles are The Honourable John Alexander Ladi Thynn and The Honourable Henry Richard Isaac Thynn.On her wedding day, Emma became the first black marchioness in British history.",
        "Yet in November, Emma said she doesn't want her skin colour to be a 'defining characteristic' and is a reluctant role model after becoming Britain's first black marchioness.The Marchioness, who is the daughter of a Nigerian oil tycoon, appeared on the cover of Tatler in November 2021 talking about her grand plans for her family's Longleat estate.",
        "In the interview she said she had a 'responsibility' to maintain the estate.She added: 'I aspire to a future where [my skin colour] is not a defining characteristic.'In the past, Emma has also talked about raising her sons on the Longleat estate which contains an enormous wildlife Park.In 2014 she told Hello! Magazine that her eldest son John was getting a varied education from living around animals.She said: 'He's learned to roar from being around the Longleat safari park lions and the animatronic dinosaurs. He can make monkey noises, too.'"
    ]
}