{
    "articleURL": "/wires/aap/article-12040493/Indigenous-legal-services-brink-crisis.html",
    "content": [
        "Mathew Cash believes his family would have had no chance of justice for his sister without the Victorian Aboriginal Legal Service.",
        "Jingili woman Narisha Cash, 41, died following significant delays after she called triple zero on March 26, 2020.VALS represented her loved ones when the Victorian coroner held an inquest last year and Mr Cash said they were fantastic from the get go.\"They live and breathe in that realm so it made it very easy when it came to explaining my situation,\" he said.\"The sensitivities of my family and how we were still feeling at the time, the frustrations and not getting answers and not knowing everything happened around 'Nish' passing away.\"Without VALS, I really wouldn't have been able to make a connection into the Victorian legal system so I really wouldn't have been able to have a voice for my sister.\"Supporting families at inquests is one of the many roles Indigenous legal services play.But National Aboriginal and Torres Strait Islander Legal Services chair Karly Warner, who is also the chief executive of Aboriginal Legal Service (NSW/ACT), told AAP without an injection of emergency federal funding, it will be forced to scale back.Aboriginal Legal Service (NSW/ACT) says it will have to freeze criminal law services at 13 courts if it doesn't don't get help, while Aboriginal and Torres Strait Islander Legal Service Queensland has implemented suspensions including at Atherton, Innisfail, Mareeba and Tully.",
        "Indigenous legal services are calling on the federal government to deliver $250 million in emergency support.\"Demand for Aboriginal and Torres Strait Islander legal services has increased up to 100 per cent since 2018 but core funding from the Commonwealth has declined in real terms,\" Ms Warner said.\"The service freezes will have dire consequences for Aboriginal and Torres Strait Islander Australians who need them to have any chance of equal access to justice to prevent disastrous outcomes like increased family violence, child removals, unjust incarceration, to deaths in custody.\"There's no point in sugarcoating this. We are on the brink of an absolute crisis and we're in the federal government's hands.\"A spokesperson for Attorney-General Mark Dreyfus said last October's budget included a $99 million package for First Nations justice.\"This includes $13.5 million in additional funding to Aboriginal and Torres Strait Islander legal services to increase their capacity to provide culturally appropriate legal assistance in coronial inquiries and $1 million to build greater capacity in the peak body, the National Aboriginal and Torres Strait Islander Legal Services,\" the spokesperson said.Ms Warner said the increased demand for Indigenous legal services was due to changes in policy, policing and bail regulations.The National Legal Assistance Partnership, through which the Commonwealth funds Indigenous legal services, aid and community centres, ends in June 2025.",
        "An independent review of the agreement begins this year.Mr Cash said VALS had provided culturally-appropriate help and advice at a difficult time.\"We felt like slaves to the system. It was very daunting, very upsetting, a lot of late nights, a lot of tears,\" he said.\"Without them we would have really been lost.\"I don't think we would have had justice for my sister, whatever the outcome of the inquest may be.\""
    ]
}