{
    "articleURL": "/wires/reuters/article-12056511/Anti-monarchists-criticize-heavy-handed-arrests-King-Charles-coronation.html",
    "content": [
        "Protesters released after coronation",
        "Arrest were to save royal embarrassment, Republic saysPolice vowed low tolerance for disruptionUK minister says police operation struck right balance(Adds new arrest figures in paragraphs 6-7)By Alistair SmoutLONDON, May 7 (Reuters) - Anti-monarchists on Sunday criticized the policing of the coronation of King Charles as heavy-handed, saying there was no longer a right to peaceful protest in Britain after dozens of protesters were arrested and detained into the night.Police arrested Graham Smith, leader of the Republic group, and dozens others in central London as thousands of royal fans gathered in the capital for the event on Saturday, saying their duty to prevent disruption outweighed the right to protest.Republic said that members began to be released late on Saturday evening after nearly 16 hours in custody.\"This was a heavy-handed action which had the appearance of a pre-determined arrest that would have occurred regardless of the evidence or our actions. The right to protest peacefully in the UK no longer exists,\" Smith said in a statement.\"These arrests were not about protecting people from harm, but about protecting the King from embarrassment.\"London's Metropolitan Police said on Sunday night that 64 arrests in total had been made on Saturday for offenses including breach of the peace and conspiracy to cause a public nuisance.",
        "One had been charged under the public order act, while others had been released on bail.The police said on Saturday that they understood public concern following the arrests, but said they acted after receiving information that protesters were determined to disrupt the coronation procession.London police chief Mark Rowley warned on Friday that police would take action if protesters tried to \"obstruct the enjoyment and celebration\" of people, saying there would be a \"very low tolerance\" for disruption.Police have gained further powers to curtail protests under a new policing law passed last year, and a public order act which came into force on May 3.In a separate incident, there was a dispute after police arrested three people on Saturday morning and seized a number of rape alarms. The police cited intelligence that there were plans to disrupt the procession with the alarms, but the local Westminster Council expressed concern that trained volunteers for a night safety scheme had been detained.\"We are deeply concerned by reports of our Night Stars volunteers being arrested overnight,\" local councilor Aicha Less said, adding the volunteers were being offered support.\"We are working with the Metropolitan Police to establish exactly what happened.\"Wes Streeting, a senior lawmaker from the opposition Labour Party, declined to comment on specific arrests while investigations were ongoing, but said London's police would have to be accountable as to whether their overall approach to the coronation was proportionate.",
        "Tens of thousands of people turned out to catch a glimpse of the newly crowned King Charles and Queen Camilla, who rode in a state coach back to Buckingham Palace after Saturday's service at Westminster Abbey.Not everyone who came to watch was there to cheer Charles, with hundreds of republicans booing and waving banners reading \"Not My King.\"Culture Minister Lucy Frazer said she had huge confidence in the police and added that they were right to take a tougher line on an event that could have raised questions about national security.\"I think overall (the police) managed to get that balance right,\" Frazer told Sky News.(Reporting by Alistair Smout; Editing by Frances Kerry and Mike Harrison)"
    ]
}