{
    "articleURL": "/wires/afp/article-12046707/UK-crowning-fuels-calls-return-royal-gems-S-Africa.html",
    "content": [
        "The coronation of King Charles III has rekindled calls for Britain to return to South Africa the world's largest diamond -- the centrepiece of the sceptre he will hold at Saturday's ceremony.",
        "The 530-carat First Star of Africa was unearthed in 1905, when South Africa was under British rule, and donated two years later by the colonial government to King Edward VII for his 66th birthday.\"All the mineral wealth in South Africa belongs to the people of South Africa, not the British palace,\" lawmaker Vuyolwethu Zungula, who heads the African Transformation Movement (ATM), a small opposition party, told AFP on Thursday.\"People had to die, blood had to be spilt for those diamonds to find their way to Britain.\"The First Star of Africa was cut from the 3,126-carat Cullinan Diamond, the biggest diamond ever mined, weighing 621 grammes in its raw state.It was sent to Amsterdam where it was cut into two major stones, seven gems and 96 brilliants.Many were set in the crown jewels -- the second-largest stone adorns the front of the Imperial State Crown -- and the rest were given to other members of the Royal family.Since the end of apartheid there have been repeated calls for the gems to be returned, which have grown louder around flashpoint events such as Queen Elizabeth II's first visit to the country in 48 years in 1995.Meanwhile international momentum has grown for the restoration of African artefacts from former colonial powers such as Britain, France, Germany and Belgium.",
        "\"We want #StarOfAfrica...together with ALL the rest of the diamonds, gold &amp; other minerals, that the #BritishEmpire stole from SA back, WITHOUT COMPENSATION,\" firebrand politician Carl Niehaus tweeted after Elizabeth's death in September.\"One does not pay for stolen goods!\"An online petition urging King Charles to return the Cullinan diamonds has been signed by more than 8,000 people.\"As South Africans, we would like our diamonds returned and displayed in a South African museum,\" the petition reads."
    ]
}