{
    "articleURL": "/tvshowbiz/article-12046823/Ed-Sheeran-admits-hates-idea-sad-pop-star.html",
    "content": [
        "Ed Sheeran has admitted he hates the idea of being viewed as a 'sad pop star,' despite detailing his recent struggles on his new album.",
        "The singer sat down with Zane Lowe on his Apple Music 1 show ahead of releasing his new record Subtract on Friday.And in an exclusive clip from the interview, Ed revealed he decided to undergo therapy after realising his vast wealth 'doesn't fix things.'Ed also admitted he got 'super low' when his close friend Jamal Edwards tragically died as he 'couldn't do anything about it.'The hitmaker lost his pal just weeks after his wife Cherry Seaborn was diagnosed with cancer, and was forced to delay treatment as she was six months pregnant with her second child.",
        "Explaining why he decided to open up about his struggles on his new album, Ed told Zane: 'I've always had ups and downs and struggles, and I've felt like, ever since I was a young kid, have had real, real, real lows. 'Whatever it is, it's chemical imbalance or something to do with genes. I have lots of family members that the same thing. 'But I've never spoken about it because I put it in…. You can listen across my albums, it's there. But I hate the idea of it being sad pop star because no one wants to hear that. 'No one wants to hear someone that has had success in their field who, from the outside looking in, everything's great. ",
        "'No one wants to hear someone go, 'Well, actually, it's not.' I think the reason why I was more open about it this time is it's not like people... This is why I started therapy, because I live a very, very privileged life. 'I've made money over the years, and I have all these things. Whenever I would say to my friends, last year, this was happening, they would always point out all the good things in my life. And that's great.'Alluding to Jamal's death, Ed continued: 'But money doesn't buy back your friend who's died. It just doesn't, and it doesn't make it better. Steve Jobs was the richest guy on earth, and he died from cancer. It doesn't just fix things. 'I hate talking about it because everyone goes, 'Well, it does, actually. It does this, this, and this.' But there's just certain things it doesn't. I got super low when my friend died, and you can't do anything about it, you know?'",
        "Ed sat down with Zane for an in-depth chat ahead of the release of his new album, Subtract on Friday.It comes after Ed revealed he faced suicidal thoughts after the death of his best friend Jamal Edwards while making his latest album. Jamal, a music producer and the son of Loose Women star Brenda Edwards, tragically died after a cardiac arrest brought on by cocaine and alcohol in February 2022 at the age of 31.",
        "Ed detailed feeling like he was 'drowning', when another close friend, Australian cricketer Shane Warne passed away the following month.In a raw interview with Rolling Stone, the singer explained he felt shame around his suicidal thoughts as they seemed 'selfish'. Meanwhile in the same chat, Ed also admitted that he'd developed an eating disorder as he compared himself to other pop stars including Justin Bieber. Speaking about his depression, he said in the interview: 'My best friend died. And he shouldn't have done.'I've always had real lows in my life. But it wasn't really till last year that I actually addressed it.'I felt like I didn't want to live anymore. And I have had that throughout my life.… You're under the waves drowning. You're just sort of in this thing. And you can't get out of it.'Ed added being depressed seemed 'selfish, especially as a father. I feel really embarrassed about it.'With the aid of his wife Cherry Seaborn who told him to seek help, Ed started seeing a therapist.He explained: 'No one really talks about their feelings where I come from. People think it's weird getting a therapist in England.... I think it's very helpful to be able to speak with someone and just vent and not feel guilty about venting.'",
        "He continued: 'The help isn't a button that is pressed, where you're automatically OK. It is something that will always be there and just has to be managed.' Hear the full interview today at 5pm BST on The Zane Lowe Show on Apple Music 1. Tune in to the show here apple.co/_Zane."
    ]
}