{
    "articleURL": "/wires/ap/article-12040569/Washington-state-decriminalize-drugs-unless-lawmakers-act.html",
    "content": [
        "SEATTLE (AP) - Washington Gov. Jay Inslee is calling lawmakers back to work after they rejected a bill setting out a new statewide drug policy - a development that has put the state on the brink of decriminalizing possession of fentanyl and other drugs while also depriving it of much-needed investments in public health.",
        "Lawmakers adjourned their regular session late last month after voting down a bill that would keep drug possession illegal and boost services for people struggling with addiction. Many liberal Democrats objected to criminalizing drugs, while conservative Democrats and Republicans insisted they must be to provide incentive for people to enter treatment.Inslee has called that unacceptable, and on Tuesday he set a special legislative session beginning May 16 to give them another chance.\"Cities and counties are eager to see a statewide policy that balances accountability and treatment, and I believe we can produce a bipartisan bill that does just that,\" Inslee said.A temporary law that makes possession of small amounts of drugs a misdemeanor expires on July 1, so if lawmakers fail to pass a bill, Washington would become the second state - after neighboring Oregon - to decriminalize drug possession. Cities and counties would be free to adopt their own approaches to drug possession and paraphernalia, creating a patchwork of laws that could undermine efforts to treat addiction as a public health issue.Lawmakers said Tuesday they were increasingly optimistic they can reach a compromise to avoid those consequences.",
        "\"I've cleared my schedule,\" said state Rep. Roger Goodman, D-Kirkland. \"I'm working day and night on this.\"Like other states, Washington has wrestled with what to do with an overdose crisis worsened by the widespread availability of cheap, deadly fentanyl. Public drug use is rampant in cities around the state, and deaths have soared.",
        "Several Washington cities have already contemplated or passed new drug laws in the absence of legislative action. Seattle City Attorney Ann Davison and two City Council members, Sara Nelson and Alex Pedersen, have proposed a ban on public use.\"Our hands-off approach to people using illegal drugs in public has resulted in rampant street crime and a death toll rivaling that of COVID-19 in Seattle,\" Nelson said in a statement. \"Complacency is no longer an option.\"The Washington Supreme Court in 2021 struck down the state law making drug possession a felony. The court said it was unconstitutional because it did not require prosecutors to prove that someone knowingly had the drugs. Washington was the only state in the country without that requirement.In response, lawmakers that year made intentional drug possession a misdemeanor and required police to refer offenders to evaluation or treatment for their first two offenses - but there was no obvious way for officers to track how many times someone had been referred, and availability of treatment remained inadequate.Lawmakers made the measure temporary - having it expire July 1, 2023 - to give themselves two years to come up with a long-term policy.But as this year´s session ended late last month, a measure billed as a compromise was voted down in the Democratic-controlled House 55-43. It would have increased potential penalties for drug possession, making it a gross misdemeanor punishable by up to a year in jail, rather than a misdemeanor punishable by up to 90 days.",
        "It also would have eliminated the requirement that police refer a person´s first two offenses for treatment rather than prosecution, enabling officers to arrest someone for a first offense if they thought it appropriate, while also encouraging police and prosecutors to divert cases. Judges could impose jail time for people who refuse treatment or repeatedly fail to comply.It would have made clear that public health workers could not be prosecuted for giving out drug paraphernalia, such as clean glass tubes for smoking fentanyl.And it would have included funding for drug crisis centers; a pilot program for health engagement hubs where users could access clean drug paraphernalia and connect with other services; and expanded access to withdrawal medication in jails and prisons.Without those provisions of the bill being passed, the state's approach to drugs amounts to \"an entire diversion system with nothing to divert people to,\" said Caleb Banta-Green, a research professor at the University of Washington School of Medicine.\"We need $50 million to $100 million statewide and a health engagement hub in each county, and we could cut deaths in half in a year,\" he said. \"We know what to do.\"Democratic and Republican lawmakers agree on the need to increase services, with many saying they have no intention of returning to the punitive approach of the war on drugs.",
        "But Republicans objected that the bill did not do enough to ensure accountability for offenders; would preempt local bans on drug paraphernalia; and would create recovery residences where those trying to maintain sobriety might stay with those who continue to use drugs.\"I want these people to get better,\" said Rep. Greg Cheney, R-Battle Ground, a lawyer with experience in drug courts, said during a floor debate last month. \"But not requiring them to acknowledge they have a problem is not the right path to go.\"Many liberal Democrats, meanwhile, said they were opposed to making drug possession a crime at all. Rep. Tarra Simmons, of Bremerton, who spent time in prison on drug charges before becoming a lawyer and a lawmaker, said she was willing to vote to make it a misdemeanor as part of a compromise that would increase services.But a gross misdemeanor is actually worse than its old status as a felony, she suggested, because the felony came with a sentencing recommendation of zero to six months for the first three offenses; the gross misdemeanor is up to a year in jail. Judges in municipal courts around the state could keep punishing those struggling with addiction, she said.\"It was really hard for me not to vote for all the good things in that bill,\" Simmons said. \"But we don't need to cause people more pain in order to help them.\""
    ]
}