{
    "articleURL": "/wires/reuters/article-12049027/Burkina-Faso-interim-leader-hails-Russia-strategic-ally.html",
    "content": [
        "OUAGADOUGOU, May 4 (Reuters) - Burkina Faso's interim President Ibrahim Traore on Thursday said Russia had become a key strategic ally but denied that Russian mercenaries were supporting Burkinabe forces in their fight against Islamist armed groups.",
        "The West African country's relations with Moscow are in the spotlight after it booted out French troops in February and ended an accord that allowed France to fight insurgents there amid a rise in anti-French sentiment in parts of the region.In a rare televised interview, Traore was asked who Burkina Faso's international allies were now in the conflict that has killed thousands and displaced around 2.5 million in the broader Sahel region over the past decade.\"The departure of the French army does not mean that France is not an ally,\" Traore replied. \"But we have strategic allies too. We have new forms of cooperation. Russia, for example, is a strategic ally.\"He said Russia was a major supplier of military equipment and would remain so, without giving further details.\"I am satisfied with the cooperation with Russia. It's frank,\" he said, sitting on an ornate chair in military fatigues and a beret.Western countries are concerned about Russia's widening sway in Africa's Sahel and its border regions. France withdrew its forces from Mali last year after the junta there started working with Russian military contractor Wagner Group to fight the insurgents liked to al Qaeda and Islamic State.Traore was asked to comment on reports Wagner forces are also on the ground in Burkina Faso.",
        "\"Our army fights alone,\" he said. \"Wagner's presence was invented to harm Burkina, so countries would not cooperate with us.\"The instability in Burkina Faso triggered two coups last year by the military, which has vowed to retake control of the country but has so far failed to stop attacks.Unrest in the region began in neighbouring Mali in 2012, when Islamists hijacked a Tuareg separatist uprising. The violence has since spread into Burkina Faso and Niger and threatens to destabilise coastal countries further afield. (Reporting by Thiam Ndiaga; Writing by Alessandra Prentice and Stephen Coates)"
    ]
}