{
    "articleURL": "/sport/football/article-12051497/SPECIAL-REPORT-Manchester-United-legend-Sir-Alex-Fergusons-retirement-unfolded-decade-on.html",
    "content": [
        "Sir Alex Ferguson decided to step down as Man United manager on May 8, 2013It followed a night of fevered speculation as David Moyes was backed to succeedMail Sport has spoken to key figures about how the drama unfolded a decade on Britain is all set for a coronation, but 10 years ago this weekend the country was gripped by talk of an abdication.",
        "It was the story that rocked football. The bombshell news that changed the Premier League landscape forever. Sir Alex Ferguson's decision to step down as Manchester United manager at the age of 71 after 26-and-a-half-years at Old Trafford, his 13th league title and a total of 38 trophies.The club made the announcement on May 8, 2013 but only after a night of fevered speculation as David Moyes was heavily backed by the bookmakers to succeed the legendary United boss.A decade on, Mail Sport has spoken to some of the key figures closest to Ferguson and club insiders about how the drama unfolded.",
        "At his home in Wilmslow, Ferguson has two mementoes given to him by the United players on the eve of his final match, a bonkers 5-5 draw with West Bromwich Albion at The Hawthorns.One is a Rolex watch made in 1941, the year that he was born in Glasgow. It was set at 3.03pm, the time of his birth. A nice touch thought up by Rio Ferdinand.The other gift presented to Ferguson at the Hyatt Regency in Birmingham that night was a huge book of photos and memorabilia from his time at United. It is said to be bound in the same luxury red leather used by Ferrari for the interior in their sports cars.",
        "Inevitably, there was an air of sadness in the room. 'I noticed a particular look on some of the players' faces,' Ferguson wrote in his autobiography.'It was a moment some weren't sure how to handle because they had always had me with them, some for 20 years. I could see a vacant expression that seemed to say: what's it going to be like now? Some had known no other manager but me.' It was customary for Ferguson to dine with assistant Mike Phelan, first-team coach Rene Meulensteen and goalkeeper coach Eric Steele, but on this occasion all of United's non-playing staff were invited.He ordered the best wine on the menu, one so exclusive that it soon ran out and he had to look for a slightly cheaper option.The next day, the greatest chapter in the history of English football drew to a close with that 10-goal thriller as Fergie bowed out.",
        "'What a spectacle,' Steele told Mail Sport this week. 'In the dressing-room afterwards, he patted his heart and said: \"That's what this club does to me - it's not good for my ticker!\" He was laughing because that summed up his time at United.' While Ferguson headed into retirement with his gifts from the players, there was little else to mark the occasion.",
        "'It was surreal really,' recalls Meulensteen. 'You'd have thought there would be a great send-off from the club, but it never happened.'There wasn't any hoo-ha or goodbye party. We had a drink with Steve Clarke in the manager's office at West Brom. There were a few more drinks and laughs on the bus back to Carrington, and that was it.' As a final thank-you, Ferguson took the staff out a couple of months later to Puccini, an Italian restaurant in Swinton. He paid the bill, asking only that everyone contribute £10 for tips.The seeds of Ferguson's retirement were sown in October 2012 when his sister-in-law Bridget Robertson passed away.'Cathy's sister dying in October had changed our lives,' wrote Ferguson, describing it as a 'watershed moment'. Otherwise, he would have continued as United manager.Bridget and Cathy were said to be inseparable, and it was Ferguson's concern for his wife that led to his decision to put family first after a life in football.",
        "He told Cathy that Christmas. She had talked him out of retirement in 2001, but this time there was no opposition. Ferguson had also quit United on the eve of the Treble season in 1998 before swiftly reconsidering, but now it was final.He only prayed that he could avenge United's agonising title loss to Manchester City on the last day of the previous season and sign off in triumph. The other yearning wish was a final shot at the Champions League.",
        "Ferguson was obligated to inform United by March 31 of his decision to quit, but he told David Gill one Sunday in February when United's chief executive came round to the house to tell him that he was also standing down.Chairman Joel Glazer failed to persuade Ferguson to stay on, and it was during a meeting between them in New York shortly afterwards that Moyes was chosen as his successor. The two managers met at Ferguson's house to strike a deal.He broke the news of his retirement to Gill's replacement Ed Woodward over lunch, and privately Woodward has since described it as the single biggest setback of his time in charge before the failed European Super League hastened his departure.Otherwise, Ferguson's retirement became the most closely guarded secret in football. Even United's chief operating officer Michael Bolingbroke didn't know when he chaired a meeting to discuss plans for a victory parade before Ferguson delivered the club's 20th title by beating Aston Villa in April.On Monday, May 6 another meeting of the club's media and marketing departments convened at Old Trafford ahead of the final home game against Swansea.There was to be a big announcement but those present were led to believe it was a new signing or sponsor. Such was Ferguson's aversion to social media, the club didn't have an official Twitter feed so it was decided to take over the press office account. To this day, confirmation of Ferguson's retirement only has 25,000 retweets and 3,000 likes.",
        "The meeting was almost finished when one marketing executive in the know stood up and declared: 'The tone of it is, The Queen is dead!' The cat was out of the bag. From that moment on, Ferguson's secret began to unravel and United were in a race against time.MUTV cleared its programming for the Wednesday. The players were on a golf day at Dunham Massey the day before, and were told to report to Carrington at 9am for a major announcement. The big money started to go on Moyes.Meulensteen was going to bed when his phone buzzed. 'It was from Simon Wells, our video analyst at the time, saying that the players had heard Sir Alex was going to retire at the end of the season,' says Meulensteen.'I didn't even reply but then I got another message from my neighbour saying: \"Is it true?\" I went downstairs to open the laptop, saw the headlines and smelt the fire.' Until that moment, even Ferguson's closest confidantes didn't have an inkling about his plans. There had been murmurs after it emerged that the manager needed a hip replacement, meaning he would not be able to go on the club's pre-season tour.There were already plans to put Sir Alex's bed downstairs at the house in Wilmslow along with a stationary bike, similar to the one he had in his office at Carrington.",
        "Then there was his splenetic reaction to United's Champions League defeat to Real Madrid in early March after Nani was shown a harsh red card for a challenge on Alvaro Arbeloa.Club insiders say they had never seen such anger in Ferguson. So much so, he sent Phelan to do his post-match press conference.",
        "'He was massively p****d off about it,' says Meulensteen. 'He knew that was going to be his last Champions League campaign, but obviously we didn't.' Phelan, Meulensteen and Steele received a text message telling them to get into Carrington early on the morning of May 8.'Just the four of us in the meeting,' recalls Steele. 'It was very short and to the point. It lasted about two or three minutes.'When he started speaking, you guessed that something serious was happening. \"I've decided it's my time, I'm stepping down, it's my decision.\"'When we came out of the office, that's when it hit us. The shock was on the faces of me, Mick and Rene. We were stunned. Wow, the great man is leaving. We respected his decision, but it was a sad day.'As you walked away past the unbelievable photos he had of all the great players he'd worked with, there was a realisation that it was the end of an unbelievable era.' Meulensteen adds: 'He was a bit apologetic about the fact it had leaked out.. For family reasons he wanted to spent more time with Cathy, which you could understand.'He announced that David Moyes was coming in and for us it was work as usual.' Club doctor Steve McNally followed along with a number of other key personnel. Next, Ferguson went to tell the players in the dressing-room at Carrington. The squad were suited and booted for a day at Chester Races.Mobile phones were strictly prohibited to prevent the news from leaking out before it was officially confirmed to the world at 9.17am.Ferguson apologised to Robin van Persie - the architect of United's title success after moving from Arsenal - and Shinji Kagawa if they felt let down by his decision.'Things change,' he said. 'My wife's sister dying was a dramatic change.' Then it was upstairs to the video analysis room where the football staff greeted his announcement with applause and, finally, to the canteen where more than a hundred employees were waiting.Tears were choked back around the room as Ferguson delivered the news. He immediately began clearing his desk, mindful of the shadow that Sir Matt Busby had cast over his successors, and headed for home to shelter from the media storm.",
        "Ferguson, now 81, still has an office at Old Trafford where he can entertain guests on match days. Sam Allardyce was there last weekend and Usain Bolt has been in recently.However, Moyes's arrival signalled the end for Ferguson's backroom staff, even though Phelan later returned as No.2 to Ole Gunnar Solskjaer.The Scot preferred to bring in his own team from Everton, which is widely accepted as one of the reasons he only lasted 10 months at United.Meulensteen recalls: 'I said to David: \"Please realise what an opportunity you have in front of you. Just go and sit in Sir Alex Ferguson's chair and see how we do it. You will find your way in.'I tried to explain to him to trust the people who knew how it worked rather than saying, \"no I'm going to do it myself\".'The people who came in had never been at the top of the Premier League or in the Champions League. They couldn't associate themselves with the ambitions and standards and expectations that a club like United has.' There is a perception that Ferguson's last title win was one of his greatest achievements, dragging an average squad over the finishing line one last time.Wayne Rooney claimed last year that Ferguson 'got out of United as quick as he could', and United's defeat to Brighton on Thursday means they will finish lower than City in the Premier League table for the 10th year in a row since his retirement.But Meulensteen has a different view. 'People said afterwards that we had an ageing squad and it was this and that, but I guarantee you that if Ferguson had carried on and we all had carried on, we would have been there or thereabouts again the season after.",
        "'He had something magical about him, something invincible around Manchester United. I'm 100 per cent sure that all the other teams, including City and Liverpool with Pep Guardiola and Jurgen Klopp coming in, saw the opportunity to pounce.' One of the first things Moyes did was to ban fish fingers, chips and mushy peas because he felt it wasn't cuisine in keeping with a club like United.The players loved it, though, and Ferguson would often decline the more refined dishes on offer in the canteen at Carrington and make himself a fish finger and mushy pea sandwich instead.The moment Moyes was replaced by caretaker Ryan Giggs, they were back on the menu.If only all United's problems could be fixed so easily."
    ]
}