{
    "articleURL": "/wires/pa/article-12039629/Medicinal-cannabis-helps-relieve-cancer-pain-cuts-need-drugs--study.html",
    "content": [
        "Medicinal cannabis helps relieve cancer pain and can cut down how many drugs people need, research suggests.",
        "A new study found that products with an equal balance of the active ingredients tetrahydrocannabinol (THC) and cannabidiol (CBD) seemed to be the most effective for pain.At the moment, only specialist hospital doctors can prescribe cannabis-based medicines on the NHS, and only for a few limited conditions such as rare and severe epilepsy, vomiting or nausea caused by chemotherapy and muscle stiffness caused by multiple sclerosis (MS).These drugs are only considered on the NHS when other treatments are not suitable or have not helped relieve symptoms.In the latest study, published in BMJ Supportive &amp; Palliative Care, researchers including from the School of Medicine at the Royal College of Surgeons Dublin and the Medical Cannabis Programme in Oncology at Cedars Cancer Centre in Canada concluded that medicinal cannabis is “a safe and effective complementary treatment for pain relief in patients with cancer”. The particularly good safety profile found in this study can be partly attributed to the close supervision by healthcare professionals who authorised, directed, and monitored treatment  Researchers  Existing evidence suggests around 38% of all patients with cancer experience moderate to severe pain, while 66% of patients with advanced, metastatic or terminal disease suffer pain, they wrote.",
        "While traditional painkillers are commonly used, a third of all patients are thought to still experience pain.",
        "The team studied 358 adults with cancer whose details were recorded by the Quebec Cannabis Registry in Canada over a period of 3.5 years (May 2015 to October 2018).The patients’ average age was 57, nearly half (48%) were men, and the three most common cancer diagnoses were genitourinary, breast and bowel.Pain was the most frequently reported (73%) symptom that prompted a prescription of medicinal cannabis.Around a quarter of patients took THC-dominant products in the study, 38% took THC:CBD-balanced drugs and 17% took CBD-dominant products.Patient pain intensity, symptoms, total number of drugs taken and daily morphine consumption were then monitored quarterly for a year.Medicinal cannabis seemed to be safe and generally well-tolerated in the study. The two most common side-effects were sleepiness, reported by three patients, and fatigue, reported by two.The study found that at three, six and nine months, there were statistically significant drops in worst and average pain intensity, overall pain severity, and pain interference with daily life.Overall, THC:CBD-balanced products were associated with better pain relief than either THC-dominant or CBD-dominant products.“The particularly good safety profile of [medicinal cannabis] found in this study can be partly attributed to the close supervision by healthcare professionals who authorised, directed, and monitored [the] treatment,” the researchers said.",
        "The total number of drugs taken also fell at the check-ups, while opioid use fell over the first three check-ups.The researchers said their study was observational and a significant number of patients were lost to follow-up over the course of the 12 months.But they concluded: “Our data suggest a role for medicinal cannabis as a safe and complementary treatment option in patients with cancer failing to reach adequate pain relief through conventional analgesics, such as opioids.”It comes as a clinical trial of an oral spray containing cannabinoids to treat the most aggressive type of brain tumour has opened at Leeds Teaching Hospitals NHS Trust and the Christie NHS Foundation Trust in Manchester.The trial, funded by the Brain Tumour Charity, will investigate whether combining nabiximols (a cannabis medicine) and chemotherapy can help extend the lives of people diagnosed with recurrent glioblastoma.It will recruit more than 230 glioblastoma patients at 14 NHS hospitals across England, Scotland and Wales in 2023 including Birmingham, Bristol, Cambridge, Cardiff, Edinburgh, Glasgow, London, Liverpool (Wirral), Manchester, Nottingham, Oxford and Southampton.Glioblastoma is the most aggressive form of brain cancer with an average survival of less than 10 months after recurrence."
    ]
}