{
    "articleURL": "/wires/pa/article-12054623/Motherwell-boost-survival-chances-victory-struggling-Kilmarnock.html",
    "content": [
        "Motherwell took a significant step towards securing cinch Premiership football for another season with a 2-0 home win over Kilmarnock, who remain immersed in relegation danger.",
        "Blair Spittal’s fourth-minute strike and a late second from Kevin van Veen lifted Stuart Kettlewell’s side nine points clear of their vanquished opponents – and with a vastly superior goal difference – with just four games left of the season.The defeat leaves Kilmarnock in 11th spot in the table and only now a point ahead of bottom side Ross County following the Dingwall side’s victory over Livingston.Motherwell made just one change from the team that had drawn at Celtic, Mikael Mandron replacing Harry Paton.There were two changes to the Kilmarnock team that won at St Mirren as out went Kyle Vassell and Lewis Mayo to be replaced by Joe Wright and Scott Robinson.The home side went ahead with the first real chance of the game after four minutes. Sean Goss sent James Furlong clear down the left and his cutback was finished well by Spittal.",
        "Kilmarnock responded with a Robinson shot that slid past the near post after Christian Doidge had played him in.Spittal then nearly had his second of the game only to see his effort deflected wide for a corner. The forward took the set-play himself, finding Calum Slattery outside the box whose low driven shot was again diverted wide.Both teams seemed intent on attacking and Danny Armstrong was unfortunate to see his free-kick beat the wall but strike the outside of the Motherwell post.",
        "Motherwell continued to pursue a second goal and, from Paul McGinn’s deep cross, Mandron somehow headed over the bar from close range.Van Veen is likely to be a contender when the Player of the Year nominations are shortly announced and the Dutch striker showed his class again with a back-heeled pass to set up Spittal. The former Ross County player cut inside and got his shot away only for Sam Walker to save with his legs.Van Veen then created a chance for himself but once again the goalkeeper proved equal to it, Walker making a fine save to keep his side in the contest before looking alert to grab Dan Casey’s attempted lob.McGinn ought to have made the game safe late on but somehow struck the post with the goal at his mercy, the ball then falling kindly into Walker’s arms.However, Van Veen fared much better in stoppage time as he calmly slotted in his 25th goal of the season to net for a seventh game in succession."
    ]
}