{
    "articleURL": "/news/article-12052223/Jack-Black-lets-bushy-beard-natural-color-walks-round-LA-funky-garish-shorts.html",
    "content": [
        "Jack Black showed off his grown-out, bushy, gray beard  as he stepped out in Los Feliz with a friend The 53-year-old actor dressed down in a colorful pair of funky, patterned shorts, a gray long-sleeved puffer jacket, black shoes and blue tube socksThe outing comes as the Hollywood funnyman draws rave reviews for his recent performance in box office hit The Super Mario Bros. MovieHollywood funnyman Jack Black was virtually unrecognizable as he was spotted stepping out with a friend in Los Angeles. ",
        "The 53-year-old actor, who has received rave reviews for his performance in box office hit The Super Mario Bros. Movie, showed off his casual, quirky style, with his grown-out, bushy gray beard on full display last week.He dressed down in a colorful pair of funky, patterned shorts, a gray long-sleeved puffer jacket, black shoes and blue tube socks as he strolled through his Los Feliz neighborhood with a pal. ",
        "He carried a black backpack and was wearing Apple Pro Max headphones. The comedian has recently drawn praise for his performance as Super Mario villain Bowser in the blockbuster hit released in April. The Super Mario Bros. Movie is on track to cross the $1billion mark at the box office. In an interview last month, Black admitted it was a 'no-brainer' when it came to taking on the role. The star voices the fire-breathing antagonist in the new film adaptation of the hit Nintendo video game series and had no doubts about taking the role as there is an established audience for the movie.Jack told the BBC: 'My instinct was to say \"yes\" straight away, but then my agent says, 'Whoa, whoa, whoa. Wait a second. Let's negotiate with them.''But for me, it's one of those no-brainers. 'They want you to play Bowser in Super Mario Brothers?' That just sounds like a home run. There's a built-in audience of kids around the world who are familiar with this brand.",
        "The new flick is the latest in the trend of video game adaptations – following on from the Uncharted movie and The Last of Us TV series – and Jack thinks that the influence of video games will be felt on both the big and small screens for years to come.",
        "The School of Rock star said: 'In the future, film and television are going to keep going towards using the stories told in video games, because that market seems to be growing and growing exponentially.'The TV and film industries seem to be seeing a little bit of shrinkage. It will be interesting to see what happens to the entertainment industry over the next 20 to 30 years but I think we will be seeing more storytelling from the gaming universe.'Earlier in April, Black also confirmed that he will reunite with his School Of Rock co-stars in honor of the film's 20th anniversary, much to the delight of fans. The beloved musical comedy was released on October 3, 2003 and featured a then 10-year-old Miranda Cosgrove before she became a Nickelodeon megastar, as well as Sarah Silverman, Joan Cusack and Mike White. ",
        "'We're gonna get together and have a 20-year anniversary. We like to jam,' Black told ET. 'I'm looking forward to seeing all of the grownups from 'School of Rock.'' ",
        "The actor, 53, marveled at the fact that his school age co-stars are now full grown adults.'All those kids — dig this — they were 10 years old when we made that movie and now they're all, like, 30,' he said.He stated that the reunion will be documented via social media in the form of clips and photos.The entire cast notably reunited for a screening in honor of the film's 10 year anniversary back in 2013.There was a mini School Of Rock reunion in 2019 but Black and many of the main cast members were absent.Black has long considered School Of Rock to be the 'highlight' of his decades-long career in Hollywood."
    ]
}