{
    "articleURL": "/wires/ap/article-12045363/DIARY-Waiting-leave-Sudan-hotel-sanctuary.html",
    "content": [
        "KHARTOUM, Sudan (AP) - We were a diverse group of more than a dozen people, hunkered down in a small hotel in central Khartoum - a Sudanese family and the Sudanese hotel staff, a few British and French citizens, a Syrian family and a Lebanese man.",
        "In better times, the Lisamin Safari Hotel catered to small tour groups that came to see Sudan´s little-known attractions - the ancient pyramids of Merowe and the coral reefs of the Red Sea.Now, it was simply a five-story place of refuge.Fighting between Sudan's two most powerful generals had reduced the capital to an urban battlefield. The city had never seen anything like it, as the army and the paramilitary group known as the Rapid Support Forces blasted each other in the streets with automatic rifles, artillery and airstrikes.Each day, millions of Sudanese caught between them faced terrifying choices of how to survive: Stay hiding at home, where a bullet or a missile could blast through a wall, or make a run for it, risking the mayhem outside.After days trapped in their homes, many chose to flee to the Liasamin Hotel - most of them on foot from the nearby neighborhood known as Khartoum 2, when the destruction became too great. I got to the hotel on the seventh day of the fighting. In this place of temporary safety, we all began to search for a way to escape the city.",
        "We spent long hours together in the hotel lobby, the sound of gunfire almost constant in the mornings. Whenever the explosions got closer, some guests - myself included - moved to the stairwells for safety.",
        "The guests exchanged stories of what they´d endured, seeing death outside their doors, armed men robbing people, looting shops and commandeering buildings. Early on in the fighting, Sudanese military planes flattened several RSF bases in the capital of Khartoum, driving paramilitary fighters into the streets.\"They used our roof to shoot from,\" said a British woman. She and her group had left for fear the building would be targeted; the structure next door had been hit and caught fire.The Sudanese family had fled their home with almost nothing. The father was an anthropology researcher at Khartoum University. Their children, a daughter of around 15 and her younger brother, were stoic, rarely complaining. They worried about the books, clothes and electronics they´d left behind and asked their mother if they could return to the house to retrieve them.\"I don´t think the RSF are going to steal your books,\" she told them with a laugh.We all waited for the hour or so each day when the generator was turned on - if there was fuel to run it - to charge our phones.Like much of south Khartoum, the hotel fell under the control of the RSF, a force with a ruthless reputation. Its fighters strolled the area in their desert camouflage uniforms. We suspected others, in civilian clothes, were also RSF, from their buzz cuts and thick boots. Some could not have been older than 18.",
        "I had landed in Khartoum from Cairo exactly a month before the fighting broke out, to report on the first phase of Sudan´s democratic transition, agreed upon by a handful of Sudanese political parties, the military and the RSF last December.On paper, the new era promised closure to a 2021 coup in which Sudan´s two top generals, Abdel Fattah Burhan, and RSF commander Gen. Mohamed Hamdan Dagalo, joined forces to overthrow a Western-backed, power-sharing government.But on the ground, unease was rife. At night, the streets, which normally would have been bustling during the Muslim holy month of Ramadan, were still. The start of the transition was delayed repeatedly. The army and the RSF were at loggerheads over merging the paramilitary force into the army, a key clause of the deal. Long-smoldering resentments between the two forces heated up.Then, convoys of RSF fighters and army troops moved into downtown Khartoum. While Sudanese citizens warned of potential clashes, analysts, journalists and diplomats alike leaned to the logic that each side had too much to lose from open conflict. There was no sign of foreign embassies or aid agencies packing up.We were wrong. After fighting erupted on April 15, I was trapped in an apartment where I´d been staying in Amarat, a neighborhood just south of Khartoum 2. With no water and food supplies dwindling, remaining there grew more perilous.",
        "Finally, after several missiles struck the road outside, I decided to walk further south to the Lisamin.Among the guests, fear had different triggers. For me, it was the hum of drones circling above the rooftops. It could drag on ominously for 15 minutes, until there came the sharp whine of a bomb being dropped.During the lulls in fighting that usually came in the afternoon, our terror morphed into a duller angst. We talked about broader plans for the future. Hanging over us was an unspoken rule: Don´t talk about worst-case scenarios.The owner, Mr. Salah, was generous. A single room cost $60 a night, a discount given the hardship of the times, and those without money were not charged. At night, the skilled cooks among us become the hotel caterers, using whatever dried and tinned food was left. Everyone knew the supplies would not last more than a few days.All paths beyond the hotel were risky.The Sudanese guests and staff planned their escape to the countryside and other cities where fighting was less fierce, or, they hoped, to neighboring Egypt. The nearby city of Wadi Medeni was one option, but without a vehicle, fuel or a willing driver, it too was out of reach.Those of us with European passports pinned our hopes on an eventual evacuation. But with no functioning airport and street fighting still ongoing, this seemed difficult.",
        "By April 23, as foreign governments hinted at potential evacuation operations, it was clear we had to make a move. The Sudanese family found transport to Port Sudan, where the mother had family. Three French women in the hotel were told to make for the embassy by whatever means possible.Two British nationals, a surgeon and a widow from Glasgow, decided to stay behind. The Syrian family and Lebanese man had few options; they didn´t know a government that would help them leave.In the hotel lobby that morning, we all said our goodbyes and wished each other well.I was promised a spot on a Turkish-organized land evacuation to neighboring Ethiopia. My colleagues helped find a car to the assembly point, another hotel further south. At checkpoints along the way, my driver charmed his way past RSF soldiers, some of whom stood nervously at attention while others lounged in the shade making sandwiches.Halfway there, we received a message from my manager that the plan had changed: I was to turn around and head for the French Embassy. Thanks to my colleagues in Paris, I had been added to the French evacuation list. I was lucky, grateful, but most of all, deeply privileged.While I made it safely into the fortified embassy building, others were not so lucky. A French soldier lay in an embassy hall, a tin foil blanket covering his wounds. A British woman struggled to walk after her foot was struck by a stray bullet.",
        "Our convoy of at least four buses and 25 armored cars set off from the embassy at around 6 p.m., crossing through RSF-held streets into army-held territory, before arriving at the Wadi Seidna airbase just northwest of Khartoum.To my great surprise, I spotted the hotel owner, Mr. Salah, at the airport hangar. We embraced, and I thanked him for the past three days.After women, children and the elderly left on flights, other young men and I were bundled onto the final flight of that round of evacuations in the early hours of April 25, heading for Djibouti.It was not meant to turn out like this. Not for Sudan, not for my colleagues, friends and millions of Sudanese.Tracking down everyone from the hotel since the evacuation has proved difficult. Some of the staff say they are safe, for now, in other parts of the country. The hotel owner is in Copenhagen with family. The three French women also made it safely to France.I have had no word from those who stayed behind. The mobile phone network in Khartoum is all but dead."
    ]
}