{
    "articleURL": "/tvshowbiz/article-12052789/Pete-Davidson-behaved-like-gentleman-spoke-Kim-Kardashian-Met-Gala.html",
    "content": [
        "Pete Davidson reportedly behaved like 'a gentleman' when he spoke to his ex-girlfriend Kim Kardashian at the Met Gala on Monday night.",
        "The 29-year-old comedian  ran into his former flame at the A-list soiree in New York City, where they enjoyed what appeared to be a very pleasant conversation. Bedecked in a show-stopping dress of bright white pearls, Kim, 42, was seen chatting up the dapper duo of Pete and Usher – which instantly became one of the most talked about moments at the Met Gala. And now an insider has confirmed that their giddy interaction was 'totally fine.' Speaking to Entertainment Tonight, the source said: 'They both really respect each other and there are zero hard feelings.'",
        "The source added: 'He knows Kim was looking to have fun when they dated, and he was totally fine with it. He also enjoyed their time together.' The former couple's nine-month relationship took Hollywood by storm last year when Kim jumped into a high-profile rebound with the playboy funnyman. Pete was the reality star's first fling after her marriage collapsed to Kanye West, and even though their whirlwind romance was short-lived, a source said that the SNL alum still considers the bombshell to be a 'great person.'Living up to his Lothario reputation, Pete quickly moved on to supermodel Emily Ratajkowski before embarking on his current relationship with Bupkis co-star Chase Sui Wonders.But Kim hasn't publicly dated anyone since parting ways with the Meet Cute star, and an insider recently shared that Kim's family are keen to see her find love.",
        "A source told Entertainment Tonight: 'Her family is encouraging her to get back out there again and everyone just wants her to be happy and continue to succeed in all ways.'The mother of four – she shares North, nine, Saint, seven, Chicago, five, and Psalm, three, with Kanye West – is reportedly doing her best to maintain a 'good co-parenting relationship' with her ex-husband.",
        "She is also eager to 'move forward' with her life, as an insider shared: 'Kim is doing great and just wants to move forward and be happy.'",
        "Meanwhile, another source has claimed that Kim is determined to include Kanye in the lives of their children.The SKIMS founder – whose eight-year marriage to West unraveled in 2022 – won't allow her split from the rapper to undermine his relationship with their kids.The insider told E! News: 'Kanye will always be their dad and it won't change.'All the kids are very bonded to Kanye and adore him despite what's going on. Kim is doing a great job of not letting that change their relationship.'"
    ]
}