{
    "articleURL": "/news/article-12051367/Cardiff-man-31-charged-murder-delivery-driver-hit-van.html",
    "content": [
        "Mark Lang, 54, died after being mown down in North Road, in Cathays, CardiffChristopher Elgifari, 31, appeared in front of magistrates charged with murder A man has been charged with the murder of a delivery driver who was allegedly dragged 800 yards under his own van while attempting to stop it being stolen. ",
        "Mark Lang, 54, died the University Hospital of Wales on April 15 - two weeks after being mown down in the North Road area of Cathays, Cardiff, on March 28.Christopher Elgifari, 31, was charged with his murder after an inquest heard Mr Lang suffered brain damage.He was already charged with attempted murder but appeared at Cardiff Magistrates' Court today on the murder charge.A police spokesman said: 'He was further arrested and subsequently charged with murder following consultation with the Crown Prosecution Service.",
        "'Mr Lang's family have been updated and continue to be supported by a family liaison officer.'Prosecutor Nicholas Evans told magistrates that South Wales Police was called to the scene in Cathays at about 12.50pm. He said Mr Lang had got out of a white Renault van to make a delivery at Laytonia Avenue, Cathays, but saw it being stolen.Mr Evans said Mr Lang attempted to stop the van but was allegedly hit at speed.He was trapped underneath the vehicle and dragged around 800 yards before it came to a stop on the main North Road leading into the centre of the Welsh capital.Emergency services took Mr Lang to the University Hospital of Wales in Heath where he was treated for a brain injury and 'multiple lacerations across the body.'",
        "An inquest into his death heard he had suffered numerous injuries including to his brain before eventually succumbing to his wounds.A coroner said his death was likely 'violent in nature' and would 'require further investigation'.",
        "A post-mortem examination found Mr Lang's provisional causes of death to be brain injuries, traumatic cardiac arrest and blunt force injuries to the trunk.Area coroner Patricia Morgan adjourned the Pontypridd inquest for six months.She added: 'I wish to take this opportunity to express deep condolences to Mr Lang's family at this difficult time'.His partner paid tribute to Mark as a 'a good man, with a lot of love to give' after he died at the University Hospital of Wales in Heath, Cardiff.The tribute said: 'It's difficult to put into words quite how any of us are feeling. I don't think we can ever get over something so brutal and ultimately pointless.'Our thanks go out to all the emergency services who did their best to bring him back to us, the people on the scene who rallied around him and called for help, and all the staff at the Heath who made sure his final days were comfortable and who worked tirelessly to help him and the family.'Throughout all of this it has been comforting to see so much love and support from so many people who knew Mark. Friends, colleagues, old teammates as well as customers and their dogs.",
        "'We've been inundated with nice words and if we noticed it we spoke to him about it. Assume he was aware of your kind words and very happy to hear them.'Mark was a good man, with a lot of love to give. He passed in the early hours of the morning surrounded by family. Peacefully. Comfortably. Loved. He will be sorely missed.'"
    ]
}