{
    "articleURL": "/wires/reuters/article-12051867/UEFA-involve-fans-planning-finals-2022-Champions-League-chaos.html",
    "content": [
        "May 5 (Reuters) - UEFA will involve fans in the \"planning and execution\" of finals, it said on Friday as it announced plans to implement recommendations made by an independent panel following the chaos at the 2022 Champions League showpiece.",
        "The Champions League final was delayed by 36 minutes after thousands of Liverpool supporters were unable to get into the Stade de France for the match on May 28, which Real Madrid won 1-0.UEFA, Europe's soccer governing body, apologised to Liverpool for initially blaming the Merseyside club's fans for the mayhem following the release of the review in February.UEFA said it has since had \"positive dialogue\" with fans through the group Football Supporters Europe (FSE) to ensure they are involved in finals in the future.\"At UEFA, we are fully committed to ensuring that every football fan can enjoy their team's appearance in a UEFA final in a safe, secure, and welcoming environment,\" UEFA General Secretary Theodore Theodoridis said in a statement.\"We have developed and implemented comprehensive operational measures which incorporate the recommendations... and the valuable input of fan groups to enhance safety and security at our club and national team competition finals.\"UEFA said it would work with FSE, its supporters network and finalists to determine how many fans would be travelling to the host cities, make arrangements along with local authorities such as setting up fan zones and improving fan communication.\"FSE representatives are also integrated into the matchday operational teams for each final and are part of the revised comprehensive debrief process to ensure lessons learned are integrated into future finals,\" UEFA said.",
        "UEFA said it has increased the number of its safety and security officers who will cover finals while it has commissioned crowd modelling reports for finals this year.The soccer body also said it has established a process to avoid a repeat of last year where CCTV footage from the stadium was destroyed after the game. (Reporting by Rohith Nair in Bengaluru Editing by Toby Davis)"
    ]
}