{
    "articleURL": "/wires/reuters/article-12054181/Prince-Harry-joins-royals-King-Charles-coronation-without-Meghan.html",
    "content": [
        "By Suban Soraia",
        "LONDON, May 6 (Reuters) - Prince Harry, the younger son of King Charles III, attended his father's coronation in Westminster Abbey on Saturday although he had to settle for a third-row seat behind other members of the royal family.It had been unclear until early April whether Harry, who now lives in California, would attend the historic occasion following a falling out with his family.In his book \"Spare\", published in January, he criticizes his father, his stepmother Queen Camilla, and his brother Prince William.Harry, 38, was smiling as he arrived at the abbey dressed in a morning suit and with medals on his chest. The prince is an army veteran who served in Afghanistan.He nodded to members of the congregation as he joined the heads of state, dignitaries and representatives of the arts, military, charities and sport inside the Abbey.But there was no formal role for him and he sat in the third row behind working members of the royal family, alongside his disgraced uncle Prince Andrew, who was forced to quit royal duties because of his friendship with late U.S. financier Jeffrey Epstein, a convicted sex offender.Harry, who is the Duke of Sussex, said last month he would attend without his wife Meghan and two young children, who remained in the United States. His eldest child Archie was celebrating his fourth birthday on Saturday.",
        "RIFTHarry was once one of the most popular members of the royal family and his wedding to Meghan, a U.S. actor, at Windsor Castle in May 2018 was a grand affair which drew enthusiastic crowds.But his decision to quit royal duties and the rift with his family has divided public opinion.Lisa Penny, 53, a supermarket worker from Dorset who was among the crowd in London on Saturday, said: \"I think he's done a fair amount of damage and I think they need a bit of time to get over that. I'm pleased he is here for his father.\"It would be difficult to picture Harry and Meghan on the balcony of Buckingham Palace with King Charles and other members of the royal family, she said. It was not yet known if he would make a balcony appearance.\"He'll always be a Prince Harry to many people but for the other royal titles, no (he shouldn't keep them). He's not a royal anymore, he doesn't do any duties, he doesn't live in the country,\" she said.Jacqueline Brown, 28, a museum caretaker who had come from Missouri in the United States to witness the events, was still pleased to see him there.\"He's the king's son, he should be here to support him. It's nice he's doing that despite everything,\" she said. (Reporting by Suban Soraia and Kate Holton; Writing by Angus MacSwan, Editing by Alexandra Hudson)"
    ]
}