{
    "articleURL": "/wires/ap/article-12052425/Texas-investigates-hospital-care-transgender-minors.html",
    "content": [
        "AUSTIN, Texas (AP) - A Texas hospital's care for transgender minors is being investigated by state Attorney General Ken Paxton, who said Friday he's seeking evidence of alleged \"potentially illegal activity\" but did not elaborate.",
        "Texas law does not currently ban gender-affirming care for minors, but Paxton has sought to designate it as child abuse. The hospital investigation in Austin is the latest attempt by Paxton and Gov. Greg Abbott, both Republicans, to pursue other legal avenues for restrictions.The move came against the backdrop of state Republican lawmakers trying to ban gender-affirming care for anyone under 18 in Texas. The GOP-controlled Legislature is pushing to make Texas the latest conservative state to crack down on medical care and the rights of transgender people, but a scheduled House vote on the bill Friday was delayed for at least a day.In 2022, Paxton released a non-binding legal opinion that labeled certain gender-confirming treatment as child abuse. Abbott followed by ordering the state's child welfare agency to investigate families who were receiving care. A Texas judge halted those state probes last year.Paxton's new inquiry seeks information from Dell Children´s Hospital about its policies on puberty blockers as well as documents identifying patients it has referred for treatment or counseling. The attorney general´s office issued a request Friday to examine hospital records \"to determine whether any state laws have been violated or misrepresentations have been made to parents and patients.\"A recent report by the right-wing group Project Veritas, which bills itself as a news organization, alleged improper medical practices at the hospital and several others around the country.",
        "\"This investigation aims to uncover the truth,\" Paxton said.Dell Children´s Medical Group operates the hospital under the non-profit Catholic health system Ascension, and is affiliated with the University of Texas. The medical group said it prohibits surgery and prescribing hormone therapy for treatment of gender dysphoria in children. The group referred to a statement issued April 28 that said it would review any allegations of care that \"may have been inconsistent\" with those positions.It also said it would take \"appropriate action\" if any care was found to be inconsistent with hospital policy. Hospital spokesperson Ann Howser declined to elaborate.At least 16 states have now enacted laws restricting or banning gender-affirming care for minors. Three states - Florida, Missouri and Texas - have banned or restricted the care via regulations or administrative orders. On Monday, a judge in Missouri temporarily blocked the state's unique rule that would require adults and children to undergo more than a year of therapy and fulfill other requirements before they could receive gender-affirming treatments.The Texas Senate has already passed a version of the transgender care ban for minors. The scheduled vote in the House on Friday was stalled on a technical matter for the second time this week.On Tuesday, transgender rights activists disrupted the House with protests from the chamber gallery and state police forced demonstrators to move outside the building.",
        "___Associated Press Writer Acacia Coronado contributed."
    ]
}