{
    "articleURL": "/wires/reuters/article-12039441/Hoffman-Suleymans-AI-startup-Inflection-launches-ChatGPT-like-chatbot.html",
    "content": [
        "By Krystal Hu",
        "May 2 (Reuters) - Inflection AI, the artificial intelligence startup founded by LinkedIn co-founder Reid Hoffman and Google DeepMind co-founder Mustafa Suleyman, has released its first AI chatbot product, the company said on Tuesday.Similar to OpenAI's viral chatbot ChatGPT, Inflection's AI chatbot, named Pi, uses generative AI technology to interact with users through dialogues, in which people can ask questions and share feedback.Suleyman, Inflection AI's CEO, said the startup developed the technology in-house and its Pi chatbot was built on prioritizing human-like conversations with a high level of emotional intelligence, including being kind and supportive.\"It's very balanced and even-handed on political issues or sensitive topics, but also sometimes it can be funny and silly and creative,\" Suleyman said.The chatbot is suitable for personal day-to-day tasks, but not for generating code or essays, he added.Suleyman said the company had also spent time on boundary training to make sure the AI did not violate its behavior policies, including engaging in romantic conversations.\"The goal is to make sure that the AI always knows it's an AI and never tries to imitate a human. So it reminds the human user that it is an AI frequently,\" he said.Users can interact with Pi across platforms including its website, app and social media platforms like Instagram. The service is free, and the startup may launch premium subscriptions in the future, Suleyman added.",
        "Pi uses user data, including conversational content, to train its AI systems, according to its terms of service. The chatbot is not currently connected to the internet.Chatbots powered by generative AI technology has become a crowded field since OpenAI's ChatGPT burst into the scene last November. Using large language models, which mine vast amounts of text to summarize information and generate content, chatbots like Google's Bard and Character.AI enable people to have in-depth conversations for both professional and personal needs.Founded in 2022, Inflection was incubated by VC firm Greylock, which led a $225 million investment in the startup.Co-founder Hoffman, a partner at Greylock who is also a Microsoft Corp board member, resigned from OpenAI's board in March, citing potential conflicts due to his work with AI startups. (Reporting by Krystal Hu and Jeffrey Dastin; Editing by Mark Potter and Jamie Freed)"
    ]
}