{
    "articleURL": "/sport/rugbyunion/article-12047891/Former-New-Zealand-mens-coach-John-Mitchell-named-new-England-womens-head-coach.html",
    "content": [
        "Mitchell will take over as England women's head coach later this year Simon Middleton stepped down following the Six Nations triumph Former England captain Sarah Hunter will join Mitchell's backroom staff England have confirmed their former men's assistant coach John Mitchell will take charge of their hugely successful women's side as successor to Simon Middleton.",
        "Mitchell, who worked alongside Eddie Jones in his most recent RFU role, is currently defence coach with Japan and will be a key figure with the Brave Blossoms at the men's World Cup later this year.After the tournament he will join England's Red Roses who sealed a fourth straight Women's Six Nations title and a second successive Grand Slam with victory over France last weekend.England have grown to become the dominant force in women's rugby - despite losing the last two World Cup finals to New Zealand - but the appointment of Mitchell has divided opinion.Mitchell has almost three decades of international knowhow having coached in New Zealand, Australia, South Africa, USA, Japan and in England where he worked with the England men's team as forwards coach between 1997-2000 and defence coach between 2018-2021.",
        "There can be no doubting his experience, but many would have liked to have seen the RFU opt for a female coach. Mitchell will be the one in charge when England host the next Women's World Cup in 2025 - a tournament they hope to win on home soil.'The Red Roses have set an incredible standard and foundation for women's rugby, being the most successful team in the Six Nations which is a tremendous achievement,' Mitchell said.",
        "'We now have the opportunity to build on this, mature in key areas, and become a truly champion side that can rightfully contest for the World Cup in 2025.'I would like to honour the hugely supportive Red Roses fans with successful performances as we work towards winning and selling out Twickenham for the Rugby World Cup in 2025.' Middleton ended his spell as Red Roses head coach on a high.His time in charge was hugely successful. He led England to a 30-match unbeaten run and the only downsides to his tenure were World Cup final defeats by New Zealand in both 2017 and 2022. Mitchell will hope to go one better. Louis Deacon will continue as forwards coach and will lead the team until Mitchell joins.",
        "England's most capped player and former captain, Sarah Hunter, has been appointed to the role of transition coach to work with both the senior women's team and England's pathway programme. Lou Meadows has been promoted from her role as women's Under-20 head coach to attack coach for the women's senior team.England's grand slam-clinching win over France was watched by a world record crowd for a women's rugby match and there can be no doubt the female game is only going in one direction.",
        "The RFU hope to sell out Twickenham for the 2025 World Cup final.Conor O'Shea, their executive director of performance rugby, said: 'We are thrilled to be welcoming John back to England.'With our most recent Six Nations grand slam win and setting a global record crowd, a high bar has been set. I'm confident this extensively experienced coaching team will be equally challenging and supportive of the team in the next stage of their development.'"
    ]
}