{
    "articleURL": "/tvshowbiz/article-12059343/Home-Away-star-Kate-Ritchie-spots-stunning-rainbow-freezing-day.html",
    "content": [
        "Kate Ritchie has experienced a new lease on life after overcoming a difficult period during which she was charged with drink driving. ",
        "And the former Home and Away star appeared in excellent spirits as she headed out for a walk on a freezing Sydney day on Monday. The 44-year-old spotted a rainbow, sharing a photo of her gorgeous view to Instagram. 'Worth freezing for...' she wrote in the caption alongside the photo, which showed her rugged up in a hoodie and leggings.   In an additional video shared to Instagram Stories, which was filmed by Kate's boyfriend Chevy Black, she sat in the whipping wind cradling her dog and gazing at the rainbow. ",
        "Kate recently reflected on her decision to get professional help after her shock drink driving charge in August.In December, Daily Mail Australia broke the news Ritchie had entered an exclusive private mental health facility in Sydney to help treat her alcohol dependency.The former Home and Away star told The Sunday Telegraph that after struggling with several personal challenges last year she decided it was time to seek help.'It was a long time coming. I sought professional help, the help that I needed. Sometimes enough is enough,' she said. The actress also recently said that starring in Channel Seven's true-crime drama The Claremont Murders helped 'reignite' her passion for acting. ",
        "Kate appears in the two-part mini series as Carol Spiers, a real-life Western Australian woman whose daughter Sarah went missing in Claremont in 1996 and has never been found. ",
        "'Working on this project in Perth, being on set, surrounding myself with good people has undoubtedly reignited something in me,' she told The West Australian. 'The opportunity to work on this and watch it all come together has reminded me of many things. Most importantly of a passion that started long ago,' she added. Kate's new gig marks her return to acting after a decade away from the craft. ",
        "She also told the publication that she tried to remain 'respectful' to the real-life victims of the Claremont incident during her performance. 'It really is a story that belongs to the families involved and the wider community of Perth. I felt the telling of this story was in good hands, and therefore I was, too,' the mother-of-one said.The suspenseful series provides a never-before-seen account of the incredible investigative efforts of the WA police who finally caught the killer in 2016.Kate stars alongside a variety of veteran actors including fellow Home and Away star Ryan Johnson, 44, and Erik Thomson (Packed to the Rafters)."
    ]
}