{
    "articleURL": "/wires/ap/article-12049107/State-police-end-24-7-coverage-Reno-amid-high-turnover.html",
    "content": [
        "Truck driver Kim Santiago´s delivery routes between Utah and California routinely take him through Reno, Nevada, while most people are still asleep.",
        "After countless trips through northern Nevada, Santiago is now likely to find himself traveling on Reno's highways during a gap in state trooper police coverage prompted by a critical staffing shortage. State law enforcement leaders and union officials had warned for years that the shortage would impact public safety if left unaddressed.\"Is anyone gonna come help if there's an accident?\" said Santiago, a truck driver since 2019. \"How long will that take?\"Nevada State Police confirmed this week they don´t have enough troopers to maintain around-the-clock coverage in parts of Washoe County, the state´s second most populous county, which includes Reno.The agency did not respond to multiple requests from The Associated Press seeking additional information. But a police union representing state police officers told AP it was notified that troopers will no longer be assigned to cover Washoe County between 2 a.m. and 5 a.m., beginning in June or July.Nevada State Police said in a statement that the change \"will provide a greater level of service to the public and allied agencies during hours of highest demand.\"",
        "A spokesman for the Reno Police Department declined Thursday to comment when asked if the agency will respond to calls for service on freeways and state routes during the gap in highway patrol coverage. Police in Sparks, just east of Reno, and the Washoe County Sheriff's Office did not respond to requests for comment.",
        "The rollback is emblematic of a nationwide trend: Police departments across the country are reporting that they cannot hire officers fast enough to replace those retiring or resigning. An annual survey of nearly 200 agencies by the Police Executive Research Forum shows that resignations increased by 47% from 2019 to 2022.In 2020, amid the pandemic and a racial reckoning sparked by the high-profile deaths of George Floyd in Minneapolis police custody and Breonna Taylor during a botched police raid on her Louisville apartment, Nevada State Police´s overall officer turnover rate was 135% - up from 109% in 2019, 127% in 2018 and 86% in 2017.On Wednesday, the president of the Nevada Police Union urged state lawmakers and Republican Gov. Joe Lombardo, the former county sheriff in Las Vegas, to take immediate action to address the job vacancies.\"We have continuously sounded the alarm on pay inequity that directly caused record-high turnover and vacancy rates of state police, which leaves Nevadans less safe,\" Dan Gordon said in a statement.Base pay for a Nevada State Police sergeant was about $55,000 in 2021, according to data presented to state lawmakers at the time. By comparison, sergeants for the Las Vegas Metropolitan Police Department were making $81,000; sergeants for the Carson City Sheriff's Office were earning $87,000; and Henderson city police sergeants were paid $100,000.",
        "The cut in overnight highway patrol shifts comes as the final month of Nevada´s legislative session approaches. Lawmakers are currently considering a bill that would give all state workers a 2% cost of living raise and issue back pay owed to state police officers under collective bargaining agreements reached last year.Democratic Senate Majority Leader Nicole Cannizzaro, the bill's sponsor, said in a statement the bill has been met with political resistance from the right \"at every step\" and urged her Republican colleagues in the Legislature to pass the bill.\"We should stop playing games with Nevadans´ safety and work to resolve the staffing crisis in our state police,\" Cannizzaro said.Meanwhile, Lombardo included in his proposed $11 billion state budget for the next two years a pair of raises for state employees - 8%-10% in 2024 and 4% the following year.\"Rather than political theater that accomplishes nothing for our brave law enforcement officers, Democrats should quickly approve the Governor´s budget,\" Elizabeth Ray, a spokesperson for the governor's office, said Thursday.The session ends June 5. Lawmakers are not scheduled to meet again until early 2025.\"If we can´t start stopping the bleeding this year, we´re not sure we´ll be around by next year,\" Sheri Brueggemann, deputy director of Nevada's public safety office, which includes Nevada State Police, said during a legislative hearing earlier this month."
    ]
}