{
    "articleURL": "/wires/reuters/article-12040695/Pandemic-sized-euro-surge-boon-ECB-Mike-Dolan.html",
    "content": [
        "By Mike Dolan",
        "LONDON, May 3 (Reuters) - The surging euro may be the European Central Bank's best friend for a change.Unlike much of the past 15 years, euro strength is on the ECB's side as it meets on Thursday. And it is unlikely to restrain the central bank from tightening further.With so much focus on the dollar's recoil from last year's 20-year high , with U.S. interest rates seemingly cresting, it is easy to overlook the mounting independent strength of the euro.Beyond the euro/dollar pair itself, the ECB's nominal trade-weighted euro exchange rate - measured against more than 40 of the bloc's trading partners - has jumped almost 9% since last August, or in just 245 trading days.The scale of that rise matches the trade-weighted euro's surge as the pandemic unfolded in 2020 and in less time than the 300 days it took back then.Perhaps as significant is the fact this broadest measure of 20-nation single currency is little more than 1% from record highs hit just before the banking crash of 2008.And Asia's trading powerhouses are the soft spots. Japan's yen has plummeted to its lowest level in 15 years against the euro, South Korea's won is at its weakest in nine years and even China's yuan at its lowest in 18 months.",
        "For the past decade, that sort of euro strength would have drawn howls of ECB protest against a deflationary impact via import, energy and commodity prices - aggravating the central bank's struggle to get inflation up to its 2% target, even with negative interest rates and persistent asset purchase schemes.Indeed, ECB President Christine Lagarde and chief economist Philip Lane littered speeches with warning shots about an excessive euro strength when the euro last snarled up to this extent in October 2020.Lagarde's predecessors Mario Draghi and Jean-Claude Trichet similarly weighed in with verbal intervention to cool periodic 10% surges in the trade-weighted euro over its history.But this time it really is different.BRUTAL NO MORESince the pandemic ended and after the Ukraine invasion last year, the ECB - much like most other major central banks - has struggled to get record, energy-spurred inflation rates back down from double digits and closer to its 2% target.Euro strength has built on belated ECB interest rate hikes since July - up some 350 basis points to 3.0% so far and expected to go up at least another 25 bps this week.And although inflation is falling, the 7% headline rate remains far above its goal. At least one more quarter-point ECB hike is expected by money markets by July after this week's move - assuming it is not a half-point move this Thursday.",
        "Aside from relative interest rate moves, euro strength this year has also been catalysed by the bloc dodging a long-assumed recession due to rapidly retreating natural gas prices and related trade account boost that left the ECB free to tighten.What's more, a preference of global investors for relatively cheap euro zone equities and a greater exposure of the bloc to China's post-COVID reopening helped the currency. Murmurs of a reshuffling of reserve holdings away from dollars due to geopolitics and the U.S. debt ceiling standoff added something at the margins.So should euro strength be finally embraced by ECB as way of slaying the inflation beast?It is unlikely to stand in its way anymore at least.According to ECB studies, the effect of the exchange rate on consumer prices is hard to disentangle from the overall monetary policy - but it is marginal. Pre-pandemic models suggest a 1% euro index move hits import prices by 0.3% over the following year - but then affect consumer prices by as little as 0.04%.That suggests the impact of the recent euro surge on its own may be as little as half a percentage point - perhaps a bit more now, given the outsized contribution of the recent dollar-denominated energy price shock.",
        "While that may once have alarmed a central bank battling deflation, it would be positively welcome right now - even if only a modest shaving of a 7% headline inflation rate, forecast to be just below 4% by year-end.And so if anything, the ECB may want more.While it needs to be wary of over-tightening - where a brutal exchange rate rise starts to hurt corporate Europe as well as weighing on prices - the ECB will likely lap up record currency strength for now.The opinions expressed here are those of the author, a columnist for Reuters.(Writing by Mike Dolan Editing by Matthew Lewis Twitter: @reutersMikeD.)"
    ]
}