{
    "articleURL": "/news/article-12053003/Royal-fans-social-media-enjoying-sausage-finger-sandwiches-celebrate-King-Charles-coronation.html",
    "content": [
        "Quiche has been declared the official dish of the coronation but royal fans have opted for sausage-finger sandwiches to celebrate the historic event.The snack has been produced to in honor of King Charles III's 'sausage' fingers and comes complete with tomato buttons and even a cheese signet ring.He has been widely mocked for his puffy hands – which he jokingly described as his 'sausage fingers' during a 2012 Australian tourQuiche has been declared the official dish of the coronation but royal fans have opted for sausage-finger sandwiches to celebrate the historic event.",
        "The snack has been produced in honor of King Charles III's 'sausage' fingers and comes complete with tomato buttons and even a cheese signet ring.A user on Twitter shared the masterpiece and joked his mother had been working on it for almost an entire night. King Charles has been widely mocked for his puffy hands – which he jokingly described as his 'sausage fingers' during a 2012 Australian tour.Millions of people are preparing for his coronation on Saturday after he ascended to the throne following the death of his mother Queen Elizabeth II on September 8, 2022. ",
        "Many have been whipping up dishes and meals to celebrate the big event, with some very humorous and impressive results.A user on Twitter named Wayne shared a funny picture of a meaty sausage sandwich which was viewed 14,000 times. 'Just woke up to this absolute beauty mum spent most of the night creating, pretty sure its the most amazing thing I've ever seen,' he joked. 'He even has a ring on one of his sausage fingers! We’ll be making our way to London today to camp out over night hoping to get a glimpse tmrw.' The dish was well received by other royal fans on social media who appreciated the funny recreation. 'Your mum's so talented, what a beautiful tribute,' one user wrote.",
        "Another said: 'Brilliant, made my morning- you have won twitter.'And a third added: 'Gosh this actually made me a bit emotional. So lovely , Charles would nod and smile if he saw it I'm sure.'",
        "It comes after King Charles was accused of hiding his hands to avoid being mocked for his 'sausage fingers' in portraits released ahead of his coronation.In the new pictures, the monarch wore a simple pinstripe suit while his wife Camilla, the Queen Consort, posed in a cobalt blue dress.But members of the public realized that one detail appeared to be hidden from the photographer – the King's hands.In one shot he had them hidden behind his back as he stands alongside Camilla, 75.A second shot showed the 74-year-old with one hand in his pocket.Other food related inspirations include a pizza restaurant in Glasgow is marking the big day with their King Charlie Pizza.Sharing a post on Facebook, Villaggio Pizza wrote: 'To commemorate our new monarch we have produced our King Charlie Pizza.'It's a one-off and not available to order, unfortunately, but we do have all our usual great food.'",
        "Bakeries were quick to share their tributes to the King ahead of the big day.Baked In Bunbury shared a snap of their incredible Charles shaped cake on Instagram, much to the delight of their followers.",
        "They wrote: 'A cake fit for a King! We’ve got our bunting up, the clotted cream is in the fridge and we are ready to party on Saturday!'The bakery also shared a snap of a cake molded into the shape of a corgi, posting: 'We’re getting in the Coronation mood here at Baked In Bunbury!'If you’re looking for a centrepiece for your own big celebration get in touch today to see how we can help!'Meanwhile another bakery created a Coronation Cookie, featuring a Freddo chocolate biscuit in the center.King Charles III – who adores anything with eggs and cheese – has chosen a 'Coronation Quiche' to celebrate being crowned. ",
        "It appears to have taken inspiration from the monarch's love of gardening, and features spinach, broad beans and tarragon.The 'Coronation Quiche' was developed in close conjunction with the King and Queen Consort by the Royal Chef Mark Flanagan, at Buckingham Palace. Flanagan has been in charge of royal meals since 2002. It is hoped people will be inspired to make the quiche and serve it up at the 'Big Lunches' being held in communities up and down the country over the Coronation weekend of May 6-8.Quiche was chosen because it is considered a good 'sharing' dish to take to a street party and can be served hot or cold. ",
        "It also suits a wide variety of dietary requirements and preferences and is considered to be 'not too complicated to make or require costly or hard-to-source ingredients'."
    ]
}