{
    "articleURL": "/columnists/article-12044411/EPHRAIM-HARDCASTLE-King-Charles-emulate-Edward-VIII-kiss-William-cheek.html",
    "content": [
        "Will King Charles emulate Edward VII and embrace his son William when he pays homage and kisses his left cheek? When Charles's great-grandfather, and predecessor as Prince of Wales, George V kissed his father Edward, he was so deeply moved that he broke precedent, leapt up from the coronation chair and threw his arms around his son. Should history repeat itself and Charles embrace William, might the King blow a conciliatory kiss to faraway Harry in his distant seat?",
        "Before bestowing his kiss, William's homage consists of kneeling before the King, placing his hands in his father's and pledging obedience before standing and touching the crown. The only other person paying homage is the Archbishop of Canterbury, who makes do with kissing the King's hand. Does limiting the royal homage save the awkwardness of Harry and Andrew appearing centre stage kneeling before the King?One gesture of Edward's not being followed by Charles is the 'King's coronation dinner to the poor'. In 1902 he asked the lord mayor of London to co-ordinate arrangements for 500,000 people to be fed and watered across the capital. Edward VII was insistent that there be no fundraising and he paid £30,000 (just under £3million) to fund the project. Not even a rummage in the royal pocket is required by Charles to pay for Sunday's nationwide Coronation Big Lunch.In a major break with tradition, Cardinal Vincent Nichols is the first Roman Catholic prelate to attend a coronation. In 1953 Nichols's predecessor Cardinal Bernard Griffin declined his invitation and, following precedent, the papal delegation took part in processions to and from the Abbey but didn't enter the building. Cardinal Vincent has been invited in and even gets to say a prayer.Irked by George Osborne now calling for a ban on smoking, Boris Johnson's ex-paramour Petronella Wyatt, pictured, recalls the former chancellor's own nicotine habit. 'Bloody cheek coming from smoker George Osborne,' she huffs. 'He seems to have forgotten how many cigarettes he used to bum off me in Italy.' Do tell, Petsy!Sir Michael Palin, who is mourning the death of his wife of 57 years Helen, was regularly teased about his marital bliss by thrice-divorced Monty Python colleague John Cleese. Noting that Cleese, now on wife number four, had cheekily described the length of his marriage as 'absolutely pathetic', Palin briefly imagined a different life, remarking: 'I'd be wearing my thong skipping up the beach with my 13th wife. More like John Cleese really.'Is comedian Jack Whitehall suffering from low esteem? 'I think I might have quite a punchable face and a body that looks like it has been drawn by a child,' he wails. And asked what was the worst thing anyone has said to him, he replies: 'You look like a fat Jack Whitehall.' Cheer up Jack!"
    ]
}