{
    "articleURL": "/wires/reuters/article-12048685/Tennis-Dominant-Sabalenka-ends-Sakkaris-run-reach-Madrid-final-Tsitsipas-knocked-out.html",
    "content": [
        "MADRID, May 4 (Reuters) - Top-ranked Iga Swiatek cruised past Veronika Kudermetova 6-1 6-1 in the late semi-final of the Madrid Open on Thursday to set up a second straight final showdown with world number two Aryna Sabalenka.",
        "Swiatek had beaten Sabalenka 6-3 6-4 to win the Stuttgart Open at the end of April, gearing up for her French Open title defence later in May.The Pole marched into her maiden final in Madrid in a clinical display against the 12th seed Kudermetova, improving her head-to-head record against the Russian to 4-0.Earlier on Thursday, Sabalenka brushed past Maria Sakkari 6-4 6-1 as their ninth meeting on tour and first on clay ended with the 24-year-old Belarusian extending her win-loss record over the Greek ninth seed to 6-3.Sabalenka, who was champion in Madrid in 2021, stayed on track for her second title of the season in style after winning the Australian Open in January.She won an impressive 70.7% of her first serve points and saved five of six break points while sending down four aces against Sakkari.It will be the third time in the last 40 years that the world top two will meet twice in the same season on clay after Serena Williams and Maria Sharapova in 2013, and Martina Navratilova and Chris Evert back in 1984.TSITSIPAS KNOCKED OUTIn men's singles, world number five Stefanos Tsitsipas crashed out following a 7-6(5) 5-7 6-3 defeat by Germany's lucky loser Jan-Lennard Struff in the quarter-finals.",
        "In-form Struff will next face qualifier Aslan Karatsev on Friday as both reached their first Masters 1000 semi-final, the Russian doing so by beating China's Zhang Zhizhen 7-6(3) 6-4 earlier on Thursday.In the other semi-final, world number two Carlos Alcaraz will be looking to celebrate his 20th birthday with a win against Croatian 17th seed Borna Coric. (Reporting by Pearl Josephine Nazare in Bengaluru and Anita Kobylinska in Gdansk; editing by Pritha Sarkar and Stephen Coates)"
    ]
}