{
    "articleURL": "/wires/reuters/article-12045467/Rockies-sweep-season-vs-Brewers.html",
    "content": [
        "Injuries present opportunities, and Connor Seabold is getting his Thursday afternoon.",
        "The right-hander has made seven relief appearances with the Colorado Rockies this season, but he will get his first start when Colorado wraps up a three-game home series with the Milwaukee Brewers.Seabold (0-0, 5.27 ERA) will match up against lefty Wade Miley (3-1, 1.86) with a chance for the Rockies to sweep their first series of the season.The Rockies' 7-1 win Wednesday night -- their third in a row overall -- assures they will win their second series of the season and first at home. Seabold is getting the start with German Marquez out for the rest of the season with an elbow injury that will require Tommy John surgery.Acquired from Boston in the offseason, Seabold has worked exclusively out of the bullpen in two stints this year. He made six career starts with the Red Sox the past two seasons but has never faced Milwaukee.Colorado has posted its first three-game winning streak with solid starting pitching and timely hitting, which were missing for the first month of the season. The Rockies are also seeing their patience with shortstop Ezequiel Tovar pay off.Tovar was hitting .172 on April 22 but has started to generate some offense. He has a six-game hitting streak to raise his average to .219 and hit his first home run of the season in Tuesday night's 3-2 win.",
        "The rookie is also flashing some impressive glove work, including a leaping grab of a line drive in the ninth inning Tuesday.\"Offensively, there's a little bit of sneaky pop there,\" manager Bud Black said. \"And he's only 21 years old. That's what we've got to keep telling ourselves. He's 21 and not 25 or 26. And he's played much better the last couple of weeks -- a complete game with offense, defensively -- than the first two weeks.\"The Brewers haven't solved Colorado but they have a pitcher starting Thursday that could salvage the finale. Milwaukee is 4-1 when Miley starts and he is coming off his third quality outing, allowing one earned run in six innings against the Los Angeles Angels on Friday night.Miley credits the Brewers' defense for helping him get off to a good start and trusts his fielders to make all the plays.\"Heck yeah, you just go after guys,\" Miley said after his no-decision against the Angels. \"You know your defense has got your back. They make plays. So it's, `Let's go beat them. Let's attack.' For a guy like me who's pitching to contact 95 percent of the time, it's very good to know that I trust those guys back there.\"Miley has plenty of experience against the Rockies. In 17 games (16 starts), he is 9-3 with a 4.25 ERA. He has made seven appearances (six starts) at Coors Field, where he is 4-2 with a 5.79 ERA.",
        "--Field Level Media"
    ]
}