{
    "articleURL": "/news/article-12060763/Kansas-cops-pull-DUI-suspect-dressed-BUD-LIGHT-rowdy-Cinco-Mayo-celebrations.html",
    "content": [
        "A DUI suspect was pulled over in Kansas dressed as a Bud Light beerSheriff's Office left perplexed by the strange interaction Bud Light may welcome some light relief after weeks of turmoil following Dylan Mulvaney controversy A Kansas sheriff's deputy was left perplexed after pulling over a DUI suspect dressed as a can of Bud Light.  ",
        "The uniquely dressed driver was pulled over by the cop in Franklin County on Cinco de Mayo, last Friday, although it's unclear if the suspect had been celebrating that event. 'A career in law enforcement is exciting, and you get to experience something new every day' the Sheriff's office wrote on its Facebook page.'Sometimes you see things you can’t believe!'The Sheriff's Office also posted a picture of the suspect on the side of the road with his arms outstretched, pairing a pink cap with the bright blue and silver beer can costume, featuring the famous 'BUD LIGHT' lettering overlaid. ",
        "Adding to the post they wrote: 'Deputies were surprised to see that the driver was wearing a beer can costume. Yes, you read that correctly. 'The driver was eventually placed under arrest for driving under the influence of alcohol and transported to the Franklin County Jail.'Although enjoying the spectacle the Office reminded the public that 'as always, suspects are innocent until proven guilty.' The driver, who has since been released from custody, was headed northbound on Interstate 35 southwest of Kansas City metro.'Obviously it was significant enough that we thought it needed to be posted out on social media,' Franklin County Sheriff Jeff Richards told The Kansas City Star on Monday. ",
        "'We see strange things in our line of work, but that’s toward the top for sure.' ",
        "Despite it being Cinco de Mayo Richards told the Star that they did not believe the suspect had been at a celebration. Bud Light may welcome this less controversial PR distraction as it continues to grapple with the fallout from its promotion by trans activist Dylan Mulvaney.  The social media star was given a special can by Bud Light, featuring her own face underneath the brand's logo, to celebrate one year of her transition from male to female. Mulvaney posted a video at the start of April to her TikTok account, where she has more than 10million followers, with the hashtag #budlightpartner. ",
        "The brand is now facing a furious backlash from both rightwingers who say the brand has gone 'woke' betraying its traditionally conservative base, and from LGBT supporters who say the company has thrown Mulvaney to the wolves as executives backtrack over the partnership.The controversy, which reached a fever pitch online when singer Kid Rock posted a video of him opening fire on several cases of the beer, has led to a 26% drop in sales.Parent company Anheuser-Busch has since sought to disavow the campaign, sparking fresh fury from LGBT activists who've accused the brand of throwing Mulvaney to the wolves. "
    ]
}