{
    "articleURL": "/debate/article-12061439/AMANDA-PRITCHARD-Plan-let-pharmacies-hand-prescriptions-free-GPs-need.html",
    "content": [
        "READ MORE: Chemists to get powers to give prescriptions for common illnesses",
        "For nine in ten people contacting the NHS every day, their local GP surgery is the first port of call.",
        "As head of the NHS, I have the enormous privilege of meeting and speaking to patients and families across the country.I consistently hear how vital these services are to them and their communities, providing care from cradle to grave. And as a patient and a parent, I know that personally.GPs and their teams are already treating half a million more people a week than before the pandemic. But with record numbers seeking care from their practice – and an ageing population – we know that more action is required to ensure people can get the right care when they need it.So just as the NHS has done throughout its 75-year history, we are continuing to innovate to ensure primary care is fit for the future. That means expanding capacity across primary care – with pharmacists on your high street set to play an even more important role in keeping you and your families well.For the first time pharmacies will be able to prescribe medicines for seven common conditions such as earache, sore throat or shingles, offering faster and more convenient care for patients on their doorstep.Women will also be able to pop into their high street pharmacy to be prescribed the contraceptive pill instead of having to book a GP appointment.",
        "The NHS will almost triple the number of blood pressure checks available at pharmacies. Our plan means 2.5 million tests will be carried out on the high street, helping to identify up to 76,000 people at higher risk of heart attack or stroke, and ensuring they are prescribed preventative treatments.All of this means that millions of GP appointments will be freed up for those who need them most.Our ambitious plan also commits to ending the '8am rush' for appointments, which can be a source of frustration for patients.",
        "GP practices will get investment to install state-of-the-art telephone systems, and staff will get additional training so they can assess your needs and help direct you.Those needing to see a family doctor will be fast-tracked for an appointment, while patients with needs which can be better and more quickly met by other professionals – such as pharmacists, physios, mental health therapists or specialist nurses – will be able to skip the need to see a GP first.Up to half a million people a year will be able to refer themselves for key services such as hearing tests or podiatry, and there will be better support for people to manage their own health, with nine out of ten people able to see their GP records, including test results, on their smartphones in the next year.",
        "This fresh drive to improve access won't be the whole answer – we know we need more GPs and other professionals, and we continue to work with Government to publish a long term plan on workforce.But we are confident that our plans will give people in every part of England even greater and more convenient access to expert care in their communities, and free up GPs to provide enhanced care for the people who need it most."
    ]
}