{
    "articleURL": "/wires/ap/article-12039501/Officials-inmate-stuck-US-death-row-years.html",
    "content": [
        "CHICAGO (AP) - Prison officials this week moved a former drug dealer convicted of killing a 16-year-old Texas girl off federal death row to serve a life sentence in another prison amid criticism he should have been moved years ago after a judge deemed him intellectually disabled and vacated his death sentence.",
        "The transfer comes two weeks after The Associated Press first highlighted Bruce Webster's case, reporting that chronic bureaucracy and jurisdictional obstacles left him stuck in solitary confinement on death row at a U.S. penitentiary in Terre Haute, Indiana, since the judge's 2019 ruling.Webster, of Pine Bluff, Arkansas, was in a solitary, 12-by-7-foot cell, 23 hours a day, while on death row, but has been transferred to a less restrictive U.S. prison in Allenwood, Pennsylvania, according to his lawyers, who say the prison informed them Tuesday that Webster had been transferred overnight.\"Obviously, we are delighted he is off death row. That should have happened a long time ago,\" one of Webster's lawyers, Minneapolis-based Steven Wells, said Tuesday.Wells was still seeking details but hoped Webster would be placed in a program at Allenwood that helps former inmates held for years in solitary confinement transfer to general prison population.The U.S. Department of Justice on Tuesday declined comment.",
        "In his 2019 ruling, the federal judge in Indiana, William Lawrence, cited tests putting Webster´s IQ between 50 and 65, below the benchmark score for severe intellectual disability of 70. The average is 100.Webster was sentenced to death in 1996 for the kidnapping, rape and killing of Lisa Rene. He and three accomplices kidnapped the sister of a rival drug trafficker, kicking their way into an Arlington, Texas, apartment as Rene frantically dialed 911. They raped her over two days, then stripped her, bludgeoned her with a shovel and buried her alive.",
        "Before the transfer, another of Webster's lawyers, Monica Foster, said she was baffled and frustrated by inaction of the Justice Department and its subordinate agency, the Federal Bureau of Prisons, to move her client despite the ruling tossing his death sentence.She added that the Biden administration should have seen moving Webster as an uncontroversial, if modest, step toward fulfilling President Joe Biden´s campaign pledge to stop federal executions for good.\"This case is a no-brainer,\" the Indianapolis-based federal defender said.As part of regular inspections of U.S. prisons, Bureau of Prisons Director Colette Peters recently visited Terre Haute, stopping by the death row section where Webster was at the time. She has said she's committed to reforms.With his death sentence vacated, the only available sentence for Webster is life in prison. But because of jurisdictional disputes, formal resentencing hasn't yet taken place.When his lawyers and the Justice Department asked in a joint 2021 motion for the judge in Texas where Webster was tried in 1996 to resentence him, he refused, saying he lacked jurisdiction. Judge Terry Means also chided his Indiana counterpart for tossing Webster´s death sentence.The Justice Department executed 13 U.S. death row inmates, some of them Webster's friends, in the last months of Donald Trump's presidency. While Biden's Justice Department paused the executions and reversed decisions to seek death sentences in some cases, it continues to seek them in others.",
        "Judge Lawrence based his Webster ruling on Atkins v. Virginia, a landmark Supreme Court decision in 2002 ruling that executing those with intellectual disabilities violated Eighth Amendment protections against \"cruel and unusual\" punishment.During arguments, prosecutors accused Webster of playing dumb and intentionally answering IQ questions incorrectly to avoid the death penalty. They said proof of his aptitude included how, during a jail stint, he figured out how to pick locks on a food chute to slip into a women´s section.The decisive evidence, however, were newly obtained Social Security records from before the killing indicating Webster´s IQ was within the intellectually disabled range. That evidence, despite requests for it, wasn't made available at his trial.___Follow Michael Tarm on Twitter at @mtarm."
    ]
}