{
    "articleURL": "/wires/ap/article-12057881/Taveras-Garcia-power-Rangers-16-8-victory-Angels.html",
    "content": [
        "ANAHEIM, Calif. (AP) - Texas manager Bruce Bochy thought the top of his lineup would be tough to beat.",
        "It turns out, the entire Rangers offense is prolific, even without two of their top hitters.Leody Taveras had a career-high four hits and Adolis García hit his team-leading ninth home run of the season as Texas routed the Los Angeles Angels 16-8 on Sunday to take the weekend series.It is the third time this season the AL West-leading Rangers have put up at least 16 runs in a game. The rest of the majors has accomplished that just four times.\"I´ll hope we do it a few more times,\" said a smiling Bochy, who is in his first season leading the Rangers. \"It´s a good offense. Power and good discipline. You get to the bottom of the lineup and Leo (Taveras) hitting over .300, so it's a lineup that is tough to navigate through.\"Texas' Ezequiel Duran and Josh H. Smith also went deep. Taveras drove in four runs for the Rangers, who scored 26 runs in the last two games after losing Friday's series opener 5-4 in 10 innings.",
        "Garcia had three hits after he came into the game 1 for his last 14. His three-run drive to center off Chris Devenski during a five-run seventh inning moved him into the major-league lead in RBIs with 36.The Rangers (20-13) are off to their best start since 2013 due in large part to their offense. They have scored 221 runs, and are first team in the majors to score that many through their first 33 games since the 2000 St. Louis Cardinals had 223.",
        "This is despite shortstop Corey Seager and catcher/designated hitter Mitch Garver being on the injured list for most of the season.\"Once those two get back it is going to be tough to put together a lineup. That's a good problem to have,\" said second baseman Marcus Semien, who had two hits. \"The group that we have right now has been playing well together and feeding off each other.\"Anthony Rendon had four RBIs and gave the Angels a short-lived 3-0 lead in the first inning with a three-run homer down the left-field line. Hunter Renfroe added a solo shot in the ninth and Matt Thaiss had three hits.Josh Sborz (1-1), the second Texas pitcher used, got the win.Taveras had a pair of two-run hits - a single in the third that just got over the glove of Rendon and a double in the fourth - as the Rangers had an 11-7 advantage after four.Duran's two-run shot in the second inning off Angels' starter José Suarez (1-2) started the Rangers' comeback.It was tied at 3 after two innings when Texas scored four times to take the lead. Smith, who came into the game in the top of the third when Travis Jankowski left due to right hamstring tightness, connected for a two-run homer to right to extend the lead to 7-3.",
        "\"We just didn´t play very well together today. The team effort was not good,\" manager Phil Nevin said.TOUGH TIME FIELDINGThe Angels committed three errors Sunday. Rendon's throwing error trying to get Nathaniel Lowe out at home led to two runs in the fourth inning as Texas grabbed an 11-5 advantage.\"We played horribly defensively, not just the three errors,\" Nevin said. \"There were alignments, not understanding some runners, wild pitches, passed balls, you name it. We did a lot wrong.\"COULD NOT CONVERTRenfroe came up twice with the bases loaded and the Halos trailing 11-7, but could not produce a hit.He grounded out to third baseman Josh Jung to end the fourth. He then flew out to second baseman Marcus Semien for the last out in the sixth.STRUGGLES CONTINUESuarez allowed seven runs in 2 2/3 innings and has a 9.62 ERA in six starts. He came out one pitch into facing Semien due to left shoulder discomfort. Nevin said Suarez will undergo an MRI on Monday.STREAK SNAPPEDMartín Pérez allowed a season-high seven runs and didn't go at least five innings for the first time in 37 starts.The left-hander went 3 2/3 innings. He came into the game seventh in the AL with a 2.41 ERA and had allowed only two runs (one earned) in his past two starts.",
        "TRAINER'S ROOMRangers: Bochy said Seager (left hamstring strain) is on track to begin a rehab assignment late this week.Angels: INF Jared Walsh (headaches and insomnia) did more fielding drills, but there isn't an updated timetable on when he would begin to face live pitching.UP NEXTRangers: RHP Jon Gray (1-1, 4.40 ERA) has had no decisions in his last four starts as Texas begins a three-game set at Seattle on Monday.Angels: Open a three-game series against Houston on Monday. LHP Patrick Sandoval (3-1, 2.93 ERA) has won his last two starts. ___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}