{
    "articleURL": "/wires/reuters/article-12044771/Chinas-factory-activity-skids-April-weak-demand--Caixin-PMI.html",
    "content": [
        "BEIJING, May 4 (Reuters) - China's factory activity unexpectedly dipped in April, a private sector survey showed on Thursday, due to softer domestic demand and suggesting the manufacturing sector is losing momentum amid a bumpy post-COVID economic recovery.",
        "The Caixin/S&amp;amp;P Global manufacturing purchasing managers' index (PMI) fell to 49.5 in April from 50.0 the previous month prior.The reading missed expectations of 50.3 in a Reuters poll and marked the first contraction since January when the \"exit wave\" from zero-COVID policies hit production lines. The 50-point index mark separates growth from contraction on a monthly basis.The reading echoes a similarly disappointing official PMI released on Sunday and reflects the uneven nature of China's economic recovery, with services consumption, a key growth driver in the first quarter, outperforming manufacturing.Along with a subdued property market and a deep slump in industrial profits, analysts say the economy faces continued headwinds.\"This suggests that China's economic recovery significantly slowed after COVID-19 infections peaked at the start of this year,\" said Wang Zhe, economist at Caixin Insight Group.\"It remains to be seen if the rebound is sustainable after a short-term release of pent-up demand. The Caixin China manufacturing PMI in April, in particular, pointed to the fact that the economic recovery has yet to find a stable footing.\"Production growth slowed for the second straight month in April as weaker-than-anticipated new orders dampened output, the survey showed.New orders shrank for the first time in three months due to sluggish market conditions and softer-than-expected customer spending. New export orders swung back to growth from the contraction in March.",
        "Muted client demand led manufacturers to cut their staffing levels at the quickest pace since January. This was mostly through attrition, though some firms also trimmed headcount to cut costs.Both input costs and selling prices at factories slumped at the quickest rate in about seven years. Lower costs for some raw materials and fuel were linked to the renewed drop in expenses, supporting a steeper reduction in selling prices as firms looked to attract new business.Despite the downbeat data, manufacturers' optimism picked up with firms citing new product releases and supportive government policies. Investment in new equipment was also expected to drive growth, some said.The soft demand has caught the attention of policymakers with the Politburo, a top decision-making body of the ruling Communist Party, stressing last week that boosting demand is key for a sustained recovery.(Reporting by Ellen Zhang and Ryan Woo; Editing by Sam Holmes)"
    ]
}