{
    "articleURL": "/wires/reuters/article-12042371/Indian-Oil-recoup-dues-Go-First-bank-guarantees--sources.html",
    "content": [
        "By Nidhi Verma and Siddhi Nayak",
        "NEW DELHI, May 3 (Reuters) - Indian Oil Corp will recoup $61.14 million of jet fuel sales to cash-strapped Go First by cashing in bank guarantees and is optimistic it will recover a further $6.11 million for unsecured sales made in the past few months, sources said.IOC, the country's largest fuel retailer, was the sole supplier of jet fuel to low-cost carrier Go First, which filed for bankruptcy protection on Tuesday, blaming \"faulty\" Pratt &amp;amp; Whitney engines for the grounding of about half its fleet.Jet fuel sales by Indian retailers to airlines are typically backed by bank guarantees provided by the buyers.\"IOC has already approached the banks for encashment of bank guarantees of 5 billion rupees($61.14 million) and that has been accepted by the banks,\" said one of the sources.Bank guarantees were issued by the state-run Bank of Baroda and Central Bank of India, a second source said.However, in the last two-to-three months IOC sold jet fuel worth about 500 million rupees ($6.11 million) to Go First without any bank guarantees after the airline had used its credit limit, they said.It is not clear why the state-run Indian Oil continued to sell fuel to Go First without bank guarantees.The first source said IOC is hopeful of recovering the outstanding 500 million rupees.",
        "\"It is not a governance issue that has led to this bankruptcy, it is the issue of engines that has not been attended to. So we are hopeful of recovering the dues.\"IOC, Bank of Baroda, Central Bank of India and Go First did not respond to request for comments.In a bankruptcy filing with the National Company Law Tribunal on Tuesday Go First said its total debt to financial creditors was 65.21 billion rupees as of April 28.The company had not defaulted on any of those dues as of April 30, but had defaulted on payments to operational creditors, including 12.02 billion rupees to vendors and 26.60 billion rupees to aircraft lessors, it said in the filing. ($1 = 81.7750 Indian rupees) (Additional reporting by Tanvi Mehta; Editing by Sharon Singleton)"
    ]
}