{
    "articleURL": "/wires/ap/article-12043243/Raducanu-miss-French-Open-Wimbledon-hand-surgery.html",
    "content": [
        "LONDON (AP) - Emma Raducanu will miss the French Open and Wimbledon after announcing Wednesday that she is having what she called \"minor\" procedures on both hands and an ankle and expects to be sidelined for \"the next few months.\"",
        "The 2021 U.S. Open champion, a 20-year-old from Britain, has struggled with a series of injuries, most recently pulling out of the Madrid Open because of a hand problem.Raducanu said on her social media accounts that she's dealt with \"a recurring injury on a bone of both hands\" for the past 10 months. She posted a photo of herself in a hospital bed with her right wrist and hand bandaged.\"I´m disappointed to share that I will be out for the next few months and while I am at it will have another minor procedure that is due on my ankle,\" the 85th-ranked Raducanu wrote. \"It pains me that I will miss the summer events and I tried to downplay the issues so I thank all my fans who continued to support me when you did not know the facts.\"Raducanu became one of the stars of tennis in 2021, when she made a surprising run to the fourth round at Wimbledon as a teenager ranked outside the top 300, then, soon after, won the U.S. Open to become the first qualifier to claim a Grand Slam singles title.She hasn't made it past the second round at a major tournament since.",
        "This season, Raducanu has a 5-5 record and hasn't played since a straight-set loss to Jelena Ostapenko last month in the first round at Stuttgart, Germany.",
        "\"I tried my best to manage the pain and play through it for most of this year and end of last year by reducing practice load dramatically, missing weeks of training as well as cutting last season short to try heal it,\" Raducanu wrote Wednesday. \"Unfortunately it´s not enough. I´m having a minor procedure done on both hands to resolve the issues.\"The French Open begins on May 28; Wimbledon begins on July 3.A message on Wimbledon's Twitter feed Wednesday said: \"We'll miss you this year, Emma - rest up and come back stronger.\"___AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}