{
    "articleURL": "/wires/afp/article-12043345/US-posts-10-mn-reward-alleged-Russian-cybercriminal.html",
    "content": [
        "The United States offered a reward of up to $10 million on Wednesday for a Russian national accused of running a stolen credit card operation.",
        "Denis Gennadievich Kulkov, in an indictment unsealed by a US District Court in New York, is charged with device fraud, computer intrusion and money laundering.Kulkov, 43, is accused of founding an electronic platform called Try2Check that helped cybercriminals verify whether stolen credit cards were valid.\"As such, Try2Check was a primary enabler of the trade in stolen credit card information, processing at minimum tens of millions of card numbers every year,\" the US Attorney's Office for the Eastern District of New York said.It said the United States and partners in Germany and Austria had collaborated to take Try2Check's websites offline.\"Try2Check can no longer serve as a vehicle for continued criminal activity or illicit profits,\" US Secret Service special agent Patrick Freaney said in a statement.The State Department and Secret Service said a reward of up to $10 million had been offered for information leading to the arrest and capture of Kulkov, who lives in Russia.According to the indictment, Kulkov created Try2Check in 2005, \"building it into a primary tool of the illicit credit card trade.\"\"The platform offered its users -- individuals who stole bulk credit card numbers on the internet -- the ability to quickly determine the validity of a credit card number,\" the indictment said.",
        "To carry out its card-checking, Try2Check allegedly obtained unauthorized access to the servers of a major US-based payment processor.The payment processor was not identified in the indictment.Kulkov was alleged to have made at least $18 million in bitcoin through the Try2Check operation, purchasing a Ferrari and other luxury items, according to the US Attorney's Office.Kulkov potentially faces up to 20 years in prison."
    ]
}