{
    "articleURL": "/wires/reuters/article-12060895/US-judge-temporarily-suspends-six-creditors-joining-Citgo-auction.html",
    "content": [
        "By Marianna Parraga",
        "HOUSTON, May 8 (Reuters) - A U.S. court of appeals has granted Venezuela a temporary stay preventing six companies from joining a proposed court auction of shares in a Citgo Petroleum parent to enforce judgments for past expropriation of assets.Since March, creditors including a unit of O-I Glass, Huntington Ingalls Industries, ACL1 Investments, Koch Minerals and mining firms Rusoro Mining and Gold Reserve , have been granted rights to seize shares in the parent of Venezuela-owned refiner Citgo, PDV Holding.The companies had won conditional attachments to a federal case in which the judge has approved a process to auction the shares to pay a $970 million judgment won by miner Crystallex.The six hold arbitration awards or judgments that total about $2.6 billion and wanted those awards to be included in the auction.The appeals court on Friday suspended the attachments until a panel could hear from Venezuela and the six companies to be filed with the court by June. The proposed auction, which could break up the seventh largest U.S. refiner to pay creditors, took a giant step forward last month with a greenlight from the U.S. Treasury.\"The motion suspends, under an emergency request, the attachments the six additional companies had won to be part of the auction until an appeal is introduced by us in the coming weeks,\" Horacio Medina, head of a board supervising Citgo Petroleum, told Reuters.",
        "The board had said in March it would appeal the decisions granting the six firms rights to seize shares. The U.S. Court of Appeals for the Third Circuit on Friday gave Venezuela until May 19 to file an appeal, moving a final decision on the attachments likely to the third quarter, Medina said.Citgo split from Venezuelan state-run oil company PDVSA in 2019 under an order by Venezuela's National Assembly after the U.S. imposed sanctions intended to oust President Nicolas Maduro. Washington has since recognized the opposition-led congress as the entity controlling the refining subsidiary, extending protection to prevent its breakup at the hands of Venezuela creditors.The freeze is separate from the progress of the original Crystallex case, in which U.S. oil producer ConocoPhillips also received an attachment for a $1.3 billion claim.Earlier this month, U.S. officials told the court the U.S. will not block the auction or settlement talks, paving the way for a potential seizure or negotiated deal with creditors of Venezuela's most-prized foreign asset. A U.S. Treasury license would still be needed to complete any sale.\"This is just a temporary lifesaver for us,\" Medina said, adding that talks over possible payment arrangements with several creditors have not been interrupted even amid the court's decisions.Last week, the chief of Venezuela's opposition-led congress complained about the U.S. change of position on the protection of the Venezuela-owned facilities overseas, and prompted the supervisory boards to preserve the assets. (Reporting by Marianna Parraga and Gary McWilliams Editing by Marguerita Choy)"
    ]
}