{
    "articleURL": "/femail/article-12041209/McDonalds-announces-menu-shake-new-items-arriving.html",
    "content": [
        "McDonald’s celebrates McNuggets 40th birthday by releasing FOUR dips Burger joint is also launching the new Spicy Big Tasty with a fiery kickRead More: 'Phenomenal' McDonald's DIY loaded fries recipe delights foodiesMcDonald’s celebrates McNuggets 40th birthday by releasing four dips and a brand new burger.",
        "The fast food chain will be launching garlic mayo, chipotle mayo, mega hot sauce, and creamy ranch for a limited time across the UK and Ireland from May 10.The new dips will be welcomed by fans who have been crying out for new flavours for years.The brand new Mega Hot Sauce and Garlic Mayo dips will be available from next week, with two more to follow on 31 May.The burger joint is also launching the new Spicy Big Tasty which is similar to the Big Tasty but with a fiery kick.",
        "The spicy version is built with beef patty, made with Emmental cheese, lettuce, bacon, tomato Big Tasty sauce with a jalapeno twist. It is also bringing back old fan favourites including the classic version of the The Big Tasty burger and halloumi fries. The four delicious halloumi cheese sticks will be coated in a light batter and served with a rich tomato dip. And if that wasn't enough the popular Wispa McFlurry will also be making a return.It's made up of soft dairy ice cream, swirled with Wispa chocolate pieces and a chocolate sauce.Or fans can opt for a Wispa Gold McFlurry which is made with Wispa chocolate pieces and a Cadbury caramel sauce. ",
        "While another new addition will be coming to the menu as Netflix series Karma’s World is becoming a Happy Meal.",
        "Available in all McDonald’s restaurants nationwide from May 3 until June 3.The new promotion sees Karma and her friends encourage joyful family moments with a set of unique journal toys – or the option of a Little People, Big Dreams book.Featuring the characters of Karma, Winston, Switch, there are eight unique activity journals from Karma’s World to collect in a limited-edition Happy Meal box. ",
        "Each Happy Meal box also includes a QR code which gives fans the chance to dance along with Karma and her friends.As part of McDonald’s mission to support children’s literacy, it has partnered with Little People Big Dreams, the best-selling biography series for kids by Maria Isabel Sánchez Vegara, throughout 2023. The book series allows children to discover the lives of outstanding people, from designers and artists to scientists and activists. Available for around £3.49, a Happy Meal contains a choice of Fish Fingers, Chicken McNuggets or Veggie Dippers with an Apple &amp; Grapefruit Bag, or Carrot Bag side, plus drink options including water, milk, or Fruit Shoot. "
    ]
}