{
    "articleURL": "/news/article-12055545/Witnesses-Texas-mall-shooting-man-dressed-SWAT-like-gear-firing-dozens-shots.html",
    "content": [
        "Witnesses heard dozens of shots and saw 'bodies going down' when a gunman opened fire and killed multiple civilians at an outdoor outlet in suburban TexasCrowds of people were forced to run and take shelter in stores and some said they saw the killer's body on the ground as they were being evacuatedTwo people described the shooter as wearing all black and wearing SWAT-like gearThe shooting happened in Allen, a small suburb Dallas, at an outdoor outlet mall",
        "Witnesses have described the moment they heard dozens of shots and saw 'bodies going down' when a gunman opened fire and killed multiple people at an outdoor outlet in suburban Texas. ",
        "The shooting happened at the Allen Premium Outlets in Allen, a small suburb north of Dallas and it left at least nine injured and several dead before the gunman was shot dead by police. Crowds of people were forced to run and take shelter in stores and some said they saw the killer's body on the ground as they were being evacuated. Witnesses described the shooter as a 'big guy' wearing all black SWAT-like gear and said he was carrying a rifle before he opened fire and people began to run screaming in different directions.Reports from local police sources initially indicated that there may have been two gunmen - the one killed by first-responders and another still at-large - though police are now saying they believe the unidentified gunman in the footage acted alone.Cops have yet to release a statement confirming any casualties - but in a statement, the town's fire chief said nine citizens were hospitalized, and aerial footage of the scene showed at least four bloodied bodies lying outside of the mall's many stores.",
        "A woman named Colleen, who did not wish to provide her surname, told CBS Texas she was with her son at the mall at the time of the shooting.They described the shooter as wearing all black in and wearing 'like a SWAT uniform without the letters SWAT on it'. ",
        "She said the shooter was a 'big guy' and was carrying a rifle before he opened fire and people began to run screaming in different directions.  Colleen and her 22-year-old son said they saw the killer dead on the ground when they were evacuated by the police with other bodies on the floor too.Her son initially thought the gunshots were construction noises before he saw the killer in front of the store.  He said: 'Out of nowhere I heard about like 10 pops go off and I look at the customer next to me and I was like \"was that gunshots?\".'And he said it was probably just construction and more shots go off, heard like 10-15 more shots go off and so I ran to the front of the store and we're like no that's shooting.'We saw the guy dressed in all black wearing a vest, has an assault rifle and he's just shooting at people.'A witness told CNN he saw the gunman exiting his vehicle before ‘shooting his gun everywhere for the most part’ on the sidewalk outside.He said: ‘The door opened and I was letting the customers come inside the store.‘He was pretty much walking down the sidewalk and blazing for the most part and shooting his gun outside the store.",
        "‘He was walking down the sidewalk towards Fat Burger and he was just shooting his gun everywhere for the most part.’Another man, who was shopping with his wife and six-year-old son, said his family ran into a changing room and stacked cardboard boxes against the door to protect themselves.He said: 'We hid ourselves in the try-on room and there were spare boxes so we tried to lock it with the boxes and a couple of other ladies were there.'We hid for around two minutes and heard the noise. We didn't realize [what was happening] because the noise was coming from outside.'To be frank, for 10 minutes I was completely scared, I couldn't imagine what could be because we just parked the car and it was hardly five minutes.",
        "'When the police started the evacuation we saw the dead body and I didn't want my son to see but he also saw.'Another witness named Jamil said: 'We were inside the store and all of a sudden we heard a gunshots and everybody was panicking but the store we were in they were very helpful. They took everybody in the back and then police came, a SWAT team came, they brought us outside and they escorted us out.",
        "'When we were walking outside across from Michael Kors we saw the dead body, the guy had all the gear, he looks like a police officer but when you look at this shoes he was wearing converse.'So that makes you think he was just trying to trick people and he was shot right in his forehead.'One man rushed to the scene after his daughter who was at the mall texted him saying 'daddy I love you, there's a shooting'.He said: 'My daughter just texted her mom and me and said \"daddy I love you, there's a shooting and I am surrounded by the police just pray for me\".'We rushed here and we saw the police outside her door and they told us to let go and that they were still looking for the person.'This is America, people are dying in the hospitals, waiting rooms and on college campuses. There's no more safe places.'And other witnesses said they were taken into the back of stores by employees before exiting from that side once police said it was safe to leave. Police were seen sweeping stores around 6pm, more than two hours after police first descended on the complex after receiving reports of gunfire. Footage circulating online shows the moment those shots rang out, with the still unidentified gunman seen pulling up in a car to the site where the dead bodies were later spotted - and opening fire indiscriminately.",
        "Elaine Penicaro, another local mother, also described hearing a nonstop hail of gunfire while shopping with her own daughter.'We were outside the Converse store and we just heard all this popping,' Penicaro told Fox 4 after also fleeing the scene, ducking for cover when they heard the shots reportedly around 3:45pm.'We kind of all just stopped, and then a second later, just \"Pop, pop, pop, pop, pop,\" and there were sparks flying like it was right in front of us.'Brayson Jones, a 17-year-old who was working the PM shift at the outlets' Champs Sports store, told the New York Times that he heard “probably 20-plus shots” and saw people running out of stores.'As soon as I heard the shots and people yelling, I didn’t wait to see what was going on, I backed out and got out of there,' the teen recalled of the hectic scene.He added that in the frenzy he rescued a random stranger, who he said ran toward his car when the shots were fired and motioned to let him inside.",
        "In a statement four and half hours after cops were first called to the mall, the Allen Police Department revealed that one of its officers subdued the shooter while responding for an unrelated call, when they heard gunshots just after 3:30 pm.",
        "That officer, a rep for the department said, 'engaged the suspect and neutralized the threat.'Police Chief Brian Harvey did not identify the officer or officers who neutralized the threat, but confirmed there were several fatalities. He did not say how many.Prior to the 8pm update, police had said that the scene was 'active,' with local law enforcement sources telling CNN that one of the suspects was still at large.Cops, however, seemed to dismiss that theory with their latest update, indicating the shooter acted alone and was no longer a threat.In terms of the number of victims, cops also kept mum - though a spokesperson for Medical City Healthcare a few miles away said eight victims are being treated at their facilities.Some of the victims, as much of the disturbing video being seen online had suggested, were children, with the rep telling Fox 4 that they ranged in age from 5 to 61.Aerial video shows citizens being escorted off the premises, many with their hands on the heads looking visibly distraught - while more shocking footage laid bare some of the fatalities, with at least four dead bodies seen outside an H&amp;M store.The same store is seen in the footage of the first gunman opening fire on several unsuspecting victims, with distressing video footage showing bloodied backpacks suggesting some of those slain were children.Other accounts posted to social media from 5pm to 8pm offered a similar account of the events that caused police to evacuate the massive shopping center - as video footage and eyewitness accounts provide only an idea of the horror shoppers faced as they frantically audible sounds of gunfire.One such account, posted a little over the first of dozens of shots reportedly rang out, came from mom whose car was pierced by two bullets as she fled the scene with her young daughter.",
        "'Do not go to the Allen outlet!!!' Van Alstyne resident Kimberly Blakey wrote in a post to Facebook at 5:13pm. Attached to the post were multiple photos showing the damage to the door of her car by the two bullets.'Peyton and I were just there and someone starting shooting,' she recalled after escaping the scene with her eighth grade daughter.'People were running and we were just trying to leave.''The shooting,' she added, 'was nonstop.''My car got hit by two bullets. We are so grateful to be OK.'Few other details regarding the shooting, and it is still unclear if there have been any fatalities. Multiple shots, however, were fired, according to both cops and those who survived the tragedy.Earlier in the day, a rep for Collin County Sheriff's Office - which is aiding in local cops' probe - confirmed Saturday there were 'some' victims, though their status, as of 9pm ET, still remains unknown."
    ]
}