{
    "articleURL": "/tvshowbiz/article-12058003/Michelle-Yeoh-Ke-Huy-Quan-reunite-American-Born-Chinese-TV-series-premiere-New-York-City.html",
    "content": [
        "Michelle Yeoh and Ke Huy Quan beamed as they attended the American Born Chinese series premiere in New York City on Sunday.",
        "The 60-year-old actress and 51-year-old actor, who starred in Everything Everywhere All At Once together, reunited on the red carpet.Michelle looked stunning in a structured, satin, ivory mini dress with a black fine line graphic throughout.For his part, the Indiana Jones star looked handsome in a simple black suit with a dark green shirt underneath.Both stars wore fashionable black-rimmed eyeglasses to the event as they posed alongside each other. ",
        "Yeoh's dress was designed to mimic a traditional button-down shirt and featured a coordinating skirt underneath.The frock's slightly puffy sleeves cropped at her elbows and she teamed the look with shiny, black, thigh-high boots.Her trim waistline was accentuated with a black belt that boasted a silver-toned, flower-shaped buckle. Last month the promotional push got underway for the upcoming Disney+ series with the release of its first full trailer.The adaption of Gene Luen Yang’s award-winning 2006 graphic novel of the same name reunited Michelle, Ke, and Stephanie Hsu.The story follows Jin Wang (Ben Wang), a child of Chinese immigrants who is seemingly a normal high schooler struggling with his school and home life.But it comes to light that things are far from normal soon after he's introduced to a new Chinese exchange student and asked to play the role of chaperone to the newcomer.",
        "Their meeting leads to a sequence of events that thrusts Jim into a battle between Gods of Chinese mythology.",
        "Michelle pulled her lustrous, long, raven locks into a simple ponytail, keeping the attention on her fashion.She skipped earrings and a necklace but donned a black watch and a single understated ring.The Malaysia-born entertainer rocked a pearly, almond-shaped manicure for the star-studded affair.And she looked radiant in a full face of soft, flattering makeup that brought out her beauty.Her cheeks were dusted with a matte pink blush that matched her moisturizing lip stain. Ke's dark hair was styled in a straight mushroom cut and he wore shiny black dress shoes with his suit.This series is the story of a young man’s battle for his own identity, told through family, comedy, and action-packed Kung-Fu.Along with Yeoh, Quan and Hsu, the cast also includes Yeo Yann Yann, Chin Han, Sydney Taylor, Hong Huifang, Poppy Liu, Ronny Chieng, Rosalie Chiang, James Hong, Lisa Lu, Jimmy O. Yang and Leonard Wu.After making its world premiere at South By Southwest on March 15, all eight episodes of American Born Chinese are slated to debut on Disney+ May 24.",
        "Yeoh previously worked with the show's co-director Destin Daniel Cretton as part of the cast of Shang-Chi And The Legend Of The Ten Rings.",
        "Lucy Liu also serves as director in the series, which is comprised of eight episodes.Yeoh, Quan and Hsu were all nominated for Oscars for their roles in Everything Everywhere All At Once at the 95th Academy Awards, which was held March 12.The absurdist comedy-drama film won 7 of 11 Oscar nominations, including Best Actress for Yeoh, Best Supporting Actor for Quan, Best Supporting Actress for Jamie Lee Curtis, along with Best Picture and Best Director for the team of Daniel Kwan and Daniel Scheinert.Quan started his career at just 12-years-old when he was cast as Short Round in 1984's Indiana Jones and the Temple of Doom, which he followed up with Data in the 1985 classic Goonies.He worked sporadically throughout the rest of the 1980s and 1990s with roles in the short-lived TV series Head of the Class and the 1992 film Encino Man before stepping away from acting for decades.The Vietnam native, who fled the country with his family when he was just four-years-old, returned in EEAAO, collecting a slew of awards before winning Best Supporting Actor at the Oscars.The actor opened up to Variety just hours after his Oscar win, admitting that despite his recent success he's afraid it won't last.",
        "'I had a conversation with my agent. I’m so worried that this is only a one-time thing,' Quan revealed.",
        "In addition to American Born Chinese, he has a role in season two of the Marvel series Loki, expected to debut in 2023.He also has a role in the action-adventure The Electric State alongside Millie Bobby Brown, Chris Pratt and Anthony Mackie.When asked if he was worried that he might not be cast again despite his Oscar win, Quan relayed some advice he was given by two-time Oscar winner Cate Blanchett.'I attended an event recently and sat next to Cate Blanchett. I told her that I don’t know what I’m going to do next, but I feel I have a responsibility to do something good, and that I don’t want to disappoint all the people that have supported me,' Quan said."
    ]
}