{
    "articleURL": "/wires/aap/article-12040683/Pilots-escape-burning-firebomber-cockpit-window.html",
    "content": [
        "The pilots of a Boeing 737 large air tanker that burst into flames after it crashed in Western Australia while fighting a bushfire were trapped in the plane as it started to burn.",
        "The two men escaped the buckled wreckage after they scrambled through a cockpit window as the blaze consumed the aircraft, an Australian Transport Safety Bureau investigation found.The Coulson Aviation tanker, known as Bomber 139, was destroyed in February after it slammed into a steep hill in the remote Fitzgerald River National Park, about 600km southeast of Perth.The charred flight recorder's data showed the crew was on its second run to drop fire retardant and had descended to about 80 feet, or 25m, above the ground before it struck the ridge line.The 737 descended into a valley with an airspeed of 110 knots, or 200km/h, and the engines at high idle as it dropped the retardant on a slope.\"The aircraft then cleared a small line of foliage, before impacting the ground a second time and sliding to rest,\" Angus Mitchell, the bureau's chief commissioner, said in a preliminary report released on Wednesday.The pilots made an all-stations mayday call as fire broke out on the left side of the aircraft.They tried to escape from the bent cabin door and the right cockpit window but they couldn't be opened.\"Fortunately, and remarkably, both pilots were able to exit the aircraft through a cockpit window and suffered only minor injuries,\" Mr Mitchell said.",
        "Investigators at the crash site found the 737's jet-blast lines in the vegetation and felled trees likely broken from contact with the aircraft's engines and airframe as it came to ground.After hitting the ridge, the tanker became airborne for about 69m, shedding an engine, a wing and fuselage debris before hitting the ground a second time.The Boeing came to rest about 176m from the ridge. The fuselage had a main fracture near the tail and the left engine had separated from the fuselage.After the accident, Coulson Aviation was ordered to increase its large air tanker minimum retardant drop height to 200 feet above ground level. The minimum airspeed was also increased.The investigation continues."
    ]
}