{
    "articleURL": "/sport/football/article-12044433/Arsene-Wenger-joins-Rio-Ferdinand-Petr-Cech-collecting-Premier-League-Hall-Fame-awards.html",
    "content": [
        "The trio collected medallion packages at an event held at The Shard in London Sir Alex Ferguson and Tony Adams were also officially inducted on WednesdayBut the duo could not make the event in person to celebrate their induction Arsene Wenger was among a trio of Premier League greats including Rio Ferdinand and Petr Cech who have been officially coronated into the Premier League Hall of Fame.",
        "While the trio were confirmed recently to have been inducted via a fan vote into the class of 2023, a event was held on Wednesday night at The Shard in London to officially mark their entry.The former Arsenal boss is among the first managers inducted along with Manchester United legend Sir Alex Ferguson who was unable to attend the event in person.Wenger's former Arsenal captain Tony Adams was a confirmed inductee but couldn't make the event.However, in front of friends and family Wenger, Ferdinand and Cech proudly collected medallions to mark their huge impact they have made on the Premier League since its 1992 inception.",
        "Wenger went on to win the Premier League title three times as Arsenal manager after arriving in 1996 - including an unbeaten season in 2003-04 before leaving in 2018.He revealed his struggles upon arriving in England as well as his delight in being inducted alongside his one-time rival Ferguson.'I’m very happy to join the Premier League Hall of Fame with Sir Alex Ferguson, I must say he is certainly the greatest ever Premier League manager,' Wenger said.'There was a lot of scepticism when I arrived in the Premier League, so I had to gain people’s trust. During the invincible season I discovered what it was like to become a manager without fear. The team went to another level, above ego.'",
        "Wenger then revealed how he tips current Manchester City star Kevin De Bruyne to be his favourite among a list of great to join the line-up in the future, commenting on his 'exceptional decisiveness over the last five years.'De Bruyne though cannot feature immediately as only retired players can enter the Hall of Fame. ",
        "Rio Ferdinand, who won, an incredible six Premier League titles playing under Sir Alex Ferguson at Manchester United also revealed his delight at joining the Hall of Fame.The former England defender, who was present with his wife Kate, remarked on how the event was held close to where he grew up before he got his big break at West Ham United during the mid 1990s.'You can see the estate where I grew up in Peckham from here if you look closely,' Ferdinand said.'I’m going into the Hall of Fame alongside some of the greats, which is not something you dare think about at the beginning. I had a motto growing up that said, \"if I play one minute of professional football then I would die a happy man.\" This [joining the Hall of Fame] is a fabulous curtain call.'Petr Cech, who lifted four Premier League titles across 11 seasons with Chelsea and is the clean sheet record holder with 202 was delighted to be inducted alongside his goalkeeping inspiration and fellow Hall of Famer Peter Schmeichel who previously starred for Manchester United.",
        "'One of my earliest football memories is watching Peter Schmeichel at the Euros in 1992,' Cech said. 'He inspired me and It’s an honour to be inducted alongside him. Arsène’s legacy is also undeniable.'I think the Premier League changed when he came to England and his Hall of Fame place is totally deserved.'The Hall of Fame launched in 2021, with inaugural inductees including David Beckham, Dennis Bergkamp, Eric Cantona, Thierry Henry, Roy Keane, Frank Lampard, Steven Gerrard and Alan Shearer.In 2022, Sergio Aguero, Didier Drogba, Vincent Kompany, Wayne Rooney, Peter Schmeichel, Paul Scholes, Patrick Vieira and Ian Wright, were the next group to be inducted into the Hall of Fame.",
        "1. Alan Shearer2. Thierry Henry3. Eric Cantona4. Roy Keane5. Frank Lampard6. Dennis Bergkamp7. Steven Gerrard8. David Beckham 9. Patrick Vieira 10. Wayne Rooney11. Paul Scholes12. Didier Drogba13. Peter Schmeichel14. Sergio Aguero15. Vincent Kompany16. Ian Wright17. Sir Alex Ferguson18. Arsene Wenger 19. Rio Ferdinand 20. Petr Cech21. Tony Adams ",
        "To be eligible for the Premier League Hall of Fame, individuals must have been retired as of 1 January 2023, and only their Premier League career is considered in their candidacy.It recognises and celebrates those who have an exceptional record of success and have made a significant contribution to the Premier League since its inception in 1992. It is the highest individual honour awarded by the league.",
        "Meanwhile, Ferguson, the Premier League’s most successful manager, joined former Arsenal captain and fellow 2023 inductee Tony Adams, in sharing a video message as the pair were unable to attend the event in person.It is the highest individual honour awarded by the League and all inductees have selected a charity which receives a £10,000 donation. "
    ]
}