{
    "articleURL": "/wires/pa/article-12039811/Probe-Sue-Gray-s-Labour-role-paused-refusal-operate.html",
    "content": [
        "A Government probe into partygate investigator Sue Gray’s switch to a senior Labour role has been paused after she refused to co-operate.",
        "Some Tories reacted angrily after an update into her departure from her high-ranking Whitehall position to become Sir Keir Starmer’s chief of staff did not say whether she had broken rules, as had been suggested by several reports.Others criticised the Government’s statement as a “political stunt”, as allies defended Ms Gray for prioritising a separate review by the anti-corruption watchdog. Ms Gray was given the opportunity to make representations as part of this process but chose not to do so  Oliver Dowden  In a written statement to the House of Commons on Tuesday, Cabinet Office minister Oliver Dowden said the Government will “consider next steps” after Ms Gray “chose not to” speak to the investigation.It was launched following concerns that she had engaged with the opposition while looking into allegations of parties being held in Downing Street during pandemic lockdowns.The Government has submitted a “confidential assessment” to the Advisory Committee on Business Appointments (Acoba), which will “consider evidence from a range of sources to make a recommendation on any appropriate restrictions on the appointment”, Mr Dowden said.",
        "The watchdog can set recommendations for when senior people leave government, including calling for a cooling-off period between three months and two years to avoid any conflict of interest.",
        "Mr Dowden noted that under Civil Service guidance, any contact between senior civil servants and leading members of opposition parties should be cleared by ministers.But he stopped short of saying whether the Cabinet Office deemed her to have broken rules.The Deputy Prime Minister said: “In order to maintain confidentiality towards an individual former employee, I am unable at this stage to provide further information relating to the departure of Ms Gray whilst we consider next steps.”Sir Tony Blair’s former chief of staff described the statement as a “political stunt” following briefing to the press that the inquiry would find Ms Gray had breached the Civil Service Code.Jonathan Powell, who left the diplomatic service to work for the former prime minister, told BBC Two’s Newsnight: “We were briefed all day yesterday and today it was going to be full of these sins committed by Sue Gray and there’s been absolutely nothing in it at all.“I think today has really been a complete diversion and the real thing is Acoba.”Dave Penman, leader of the FDA union which represents senior Whitehall staff, said Ms Gray “has the right” to prioritise Acoba’s deliberations and stressed that she is no longer a civil servant.Calling the statement a “damp squib”, he told Times Radio: “Acoba is really the real deal when it comes to this and who’s going to make a decision. And it really should be, because it isn’t doing it for political ends.",
        "“It’s doing it based on evidence, and I can understand why she’d prioritise that.”A Labour source told the PA news agency: “Sue Gray has fully co-operated with the Acoba process and is awaiting their outcome. They are the designated channel in cases like this.”Once the watchdog makes its recommendation, Rishi Sunak will make the final ruling, though neither he nor the committee have the power to block an appointment.Former Acoba chairwoman Baroness Angela Browning said she would be “very surprised” if a prime minister challenged the advice, a move that would trigger “an almighty row”.",
        "The failure of the Whitehall inquiry’s outcome to materialise came after intense negotiations between Cabinet Secretary Simon Case and Tory ministers, the Guardian reported.The paper said that Mr Case, who initially backed the release of findings critical of Ms Gray’s departure, blocked the plans amid concerns over publishing a politically-charged report into a former official just days before the local elections when the Government is meant to observe “purdah” rules on political impartiality.After the Government update, Tory MP Mark Jenkinson tweeted: “When Sue Gray was in the Propriety and Ethics Team, how might she have reacted to someone who failed to comply with her investigations?“What might she have said about ‘Partygate’ witnesses if they’d declined her offer of a chat?”",
        "Sir Keir earlier insisted he was “confident” Ms Gray had not broken any rules.The Labour leader said he “had no discussions with her while she was investigating Boris Johnson whatsoever, I don’t think anyone is suggesting that’s the case”."
    ]
}