{
    "articleURL": "/wires/reuters/article-12058313/GRAINS-Wheat-drops-2-week-high-fading-Black-Sea-deal-hopes-limit-losses.html",
    "content": [
        "Chicago wheat futures fall after three sessions of gains",
        "Corn, soybeans ease ahead of U.S. planting progress report(Recasts, adds quote in paragraph 3, updates prices)By Naveen ThukralSINGAPORE, May 8 (Reuters) - Chicago wheat slid for the first time in four sessions on Monday, although the downside in prices was limited on slowing grain exports from Ukraine amid uncertainty over the extension of the Black Sea export deal.Corn and soybeans lost ground ahead of a weekly planting progress report due to be issued by the U.S. Department of Agriculture.\"The weather forecast looks a bit bearish but the market is extremely oversold and Russia is still not satisfied how the Russian agriculture exports are represented in the Black Sea grain deal,\" commodities research firm Hightower said in a report.The most-active wheat contract on the Chicago Board of Trade (CBOT) gave up 0.3% at $6.58 a bushel, as of 0245 GMT, after hitting a two-week high of $6.64 a bushel in the previous session.Corn fell 0.2% to $5.95-1/4 a bushel and soybeans lost 0.1% to 14.35-1/2 a bushel.Russia is still not satisfied with how the issue of Russian agricultural exports as part of the Black Sea grain deal is being resolved, TASS news agency quoted Deputy Foreign Minister Sergei Vershinin as saying on Saturday after the latest talks with a top U.N. official.",
        "The pace of shipments from Ukraine under a U.N.-backed initiative has slowed as concerns grow over ships getting stuck if a deal is not renewed later this month, according to sources and data.Russia, which is one of the key parties involved, said it will keep talking although Moscow has threatened to quit on May 18, which has created more uncertainty for traders and shipping companies trying to plan ahead.The agricultural markets were looking ahead to a U.S. crop reports on due later on Monday and a monthly U.S. crop production report on May 12.Large speculators increased their net short position in Chicago Board of Trade corn futures in the week ended May 2, regulatory data released on Friday showed.The Commodity Futures Trading Commission's weekly commitments of traders report also showed that non-commercial traders, a category that includes hedge funds, increased their net short position in CBOT wheat and cut their net long position in soybeans. (Reporting by Naveen Thukral; Editing by Sherry Jacob-Phillips and Uttaresh Venkateshwaran)"
    ]
}