{
    "articleURL": "/news/article-12047905/Hunter-daughter-Finnegan-going-Kings-coronation-Jill-Biden.html",
    "content": [
        "Jill Biden left for London on Thursday to attend King Charles III's coronationShe was joined by her granddaughter Finnegan, who will attend the ceremonyFirst lady has packed schedule, including meetings at 10 Downing Jill Biden is bringing granddaughter Finnegan Biden with her to London for King Charles III's coronation ceremony as President Joe Biden was accused of being 'disrespectful' for skipping the event.",
        "The daughter of Hunter Biden will join the first lady in Westminster Abbey for the historic ceremony. She is going as a guest. There is no official delegation, per the White House.'There is no official U.S. delegation. Finnegan is a plus one,' the East Wing said in a statement. 'As we’ve noted before with other family travel, historically, family members of Presidents have frequently joined them during travel. Current practices are consistent with those used by prior Administrations.'Meanwhile, Jill Biden expressed her excitement about the trip. 'Headed to the U.K. for the Coronation of King Charles III – the first in 70 years!,' Jill Biden tweeted on Thursday as she left Joint Base Andrews. 'It's an honor to represent the United States for this historic moment and celebrate the special relationship between our countries.'",
        "President Biden called the king in April to tell him that Jill Biden would attend the coronation on behalf of the United States.And former President Donald Trump said it was 'very disrespectful' for Biden to turn down the invite and send his wife instead.The White House has noted that no sitting U.S. president has ever attended the coronation of a British monarch. 'I was very surprised to see that. I think it's very disrespectful for him not to be here,' Trump said in an interview with British commentator Nigel Farage.",
        "'I don't think he can do it physically, actually. I think it's hard for him to do it physically,' Trump said. 'Certainly, he should be here. He's our representative of our country.' President Biden did accept an invitation from the King for a state visit to the UK. No date has been set for that visit, however. ",
        "The first lady has a packed schedule for her time in the United Kingdom. Finnegan Biden, 24, who is named after President Biden's Irish family the Finnegans of County Mayo, will join her at other events in addition to the coronation.The first granddaughter, the middle child of Hunter Biden and his first wife Kathleen Buhle, has been on other presidential trips. She joined her grandparents in Spain last June for a meeting of NATO countries. The Bidens' time in London will include receptions and meetings at Downing Street - the seat of the British government. Jill Biden will meet with Akshata Murty, the wife of British Prime Minister Rishi Sunak, at No. 10 Downing Street, on Friday afternoon. The two women will also meet with veterans and their families and they will visit a local primary school hosting a Coronation fair.In the evening, Jill Biden will attend a reception hosted by the king at Buckingham Palace. ",
        "On Saturday, she'll be at the coronation in the morning and, in the evening, she'll attend a reception hosted by U.S. Ambassador Jane Hartley. On Sunday, Jill Biden will attend a Coronation Big Lunch hosted by Sunak and Murty at No. 10 Downing Street. She returns to Washington D.C. in the evening. Charles plans for a more toned-down coronation compared to his mother's, Queen Elizabeth II, in June 1953.The ceremony will be shorter than his mother's three-hour extravaganza and no more than 2,800 guests in the audience - far fewer than the 8,000 who assembled to see Elizabeth crowned. During the service conducted by the archbishop of Canterbury, Charles will be anointed with oil, receive the traditional symbols of the monarch - including the orb and scepter - and have the St. Edwards Crown placed on his head for the first time. His wife Camilla will be crowned as queen consort. ",
        "Additionally new research has revealed how the first lady and the king are distant cousins.Both are descended from 16th century noble couple Philippe III de Croÿ and his wife Johanna. They are 13th cousins once removed.Philippe III, who died in 1595, served as a knight under Spain's King Philip II, the husband of Queen Mary who sent the Spanish Armada to invade England in 1588. "
    ]
}