{
    "articleURL": "/wires/ap/article-12061593/Willson-Contreras-returns-Wrigley-Field--Cardinals-DH.html",
    "content": [
        "CHICAGO (AP) - It was rainy and cold in Chicago. Not that it mattered all that much to Willson Contreras - even amid his bumpy transition to St. Louis.",
        "After all, he was back at his first big league home.\"It's been (an) emotional last few days for me, for sure,\" Contreras said. \"But I'm happy to be back here at Wrigley Field.\"Contreras led the struggling Cardinals to a 3-1 win over the Cubs on Monday night. He had two hits and two RBIs in his first game against Chicago since he left the team in free agency, signing an $87.5 million, five-year contract with St. Louis in December.The Cubs paid tribute to Contreras with a pregame highlight video, and the grinning catcher popped out of the dugout and waved his hat to acknowledge the cheers from the crowd of 30,937.He was greeted with more applause when he batted for the first time in the second inning, including Cubs pitcher Marcus Stroman clapping on the mound. After he singled up the middle, Contreras held his arms in the air and motioned for more from the crowd.",
        "\"It was a fun game,\" Contreras said. \"It was fun to play against my ex-teammates and my ex-team.\"Contreras, who turns 31 on Saturday, played for Chicago for seven seasons before joining one of the team's biggest rivals. The three-time All-Star helped the Cubs win the 2016 World Series during his rookie year for the franchise's first title since 1908.",
        "Along the way, he became a fan favorite for his intensity and fiery demeanor. He was on the trade market last summer - leading to an emotional day on what many thought would be his final home game with Chicago - but he remained with the team after the Aug. 2 deadline.By the time Contreras became a free agent, the Cubs were content to let him go.\"There's no hard feelings. ... I understand that this is a part of business,\" he said.Contreras stepped into a challenging situation with St. Louis, replacing popular catcher Yadier Molina after the nine-time Gold Glove winner retired at the end of his 19th season with the Cardinals. The difficulty of the move came into focus when manager Oliver Marmol announced Saturday that Contreras would be taking a break from catching for a while.The Venezuela native served as the designated hitter against Chicago, and Andrew Knizner was at catcher.\"I think from now on we're following a really good plan to help (my) catching behind the plate,\" Contreras said. \"That doesn't mean I'm not a St. Louis Cardinal catcher, as many people think that I'm not going to catch anymore. It's not that way.\"The Cardinals had dropped 15 of 19 going into the series with the Cubs, slipping into last place in the NL Central in a surprisingly shaky start for one of baseball's winningest franchises. The team ERA was 4.59 for the first 35 games, ranking 21st in the majors, and Contreras had a 5.27 catcher ERA, according to Sportradar.",
        "There were several reasons behind the change for Contreras. With the World Baseball Classic taking place during spring training, he didn't have much time to work with some of the team's pitchers. Baseball's new pitch clock also makes it more difficult for a battery to adjust on the fly during games.Mix in the staff's connection to Molina and the difficulty of navigating the pitching infrastructure, game-planning and terminology for a catcher in a new organization, and the Cardinals decided the best move was altering their plans for Contreras.\"The point of this is we have a guy that is highly, highly, highly passionate about leading behind the plate,\" Marmol said. \"We've done that well for a long time here with (Molina), and there's a process that we're accustomed to and at the end of the day, our ability to instill that in him while him bringing his flair and his own personality to it is important. And that's going to take work.\"The Cardinals also are mindful of the future, looking to nurture the relationships between Contreras and the team's pitchers at the start of the catcher's five-year contract.\"Would a possibility of him continuing to catch and us going down the road that we felt like we were going down turn out worse than what we're discussing right now? My answer to that is potentially yes, in the long run,\" Marmol said. \"We chose to be proactive.\"",
        "The short-term plan for Contreras includes sitting beside Marmol and pitching coach Dusty Blake in the dugout during games, and more work with pitchers during bullpen sessions. There is no timetable for his return to catcher.Marmol and pitchers Adam Wainwright and Jack Flaherty also had a productive meeting with Contreras on Sunday.\"What we did was we sat him down yesterday and just poured into him: We love this guy, we're glad he's here, we want him to be our guy,\" Wainwright said. \"No one's giving up hope on Willie. That was the main message that we wanted to share with him.\"___Follow Jay Cohen at https://twitter.com/jcohenap___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}