{
    "articleURL": "/wires/aap/article-12044749/AI-shows-bushfire-ravaged-species-brink.html",
    "content": [
        "A small carnivorous marsupial that was all but wiped out in the Black Summer bushfires has made a welcome recovery, thanks to game-changing AI technology.",
        "The 2019-20 bushfires scorched more than 90 per cent of the Kangaroo Island dunnart's habitat, leaving the species edging towards extinction.But an unlikely partnership between AI and wildlife experts has led scientists to believe the dunnarts are recovering well on the South Australian island.Emma Spencer, from the World Wildlife Fund's Eyes on Recovery program, says the species has been detected at every site on Kangaroo Island where cameras are deployed.\"There's almost nothing better than seeing a threatened species on camera in a place where you least expect it,\" Dr Spencer said.\"These pictures show that not only are our unique species resilient, sometimes they can be darn cute.\"The cameras have been trained to detect a variety of species by being shown thousands of images, with scientists deliberately including blurry photos of animals to improve accuracy.\"The AI model had never seen Australia's unique animals before, so when we started uploading images it was identifying wombats as pigs and kangaroos as deer,\" Dr Spencer said.\"Now, after training, the model can recognise species like eastern grey kangaroos, wombats, koalas and spotted-tailed quolls with more than 90 per cent accuracy.\"The cameras have captured more than seven million photos and the project has been labelled a game-changer for Australian researchers, saving conservationists hundreds of hours reviewing images.",
        "The cameras have also made some other discoveries, including koalas surviving in the Blue Mountains, and previously unrecorded colonies of brush-tailed rock wallabies found in fire-ravaged habitats in northern NSW.While the recovered species provide a glimmer of hope for researchers, the project has also made some stark findings, identifying growing populations of invasive species including foxes, feral cats and cane toads.The research will now play a key role in wildlife recovery plans."
    ]
}