{
    "articleURL": "/news/article-12050007/Prigozhin-claims-Wagner-WITHDRAW-Bakhmut-labels-Russian-defence-minister-scum.html",
    "content": [
        "Wagner chief published a grisly video showing his slain mercenaries in Ukraine He blamed deaths on Russia's defence ministry and said he will retreat on May 10But Ukrainian officials claim even more mercenaries are headed for the front lineThe head of the Wagner mercenary group today declared a withdrawal from the embattled city of Bakhmut on May 10 and slammed the Russian defence minister as 'scum' over his failure to provide sufficient ammunition to frontline forces.",
        "But senior Ukrainian officials cast doubt over Yevgeny Prigozhin's announcement, alleging it is likely a ploy designed to distract Ukraine's armed forces from another brutal Russian assault ahead Moscow's Victory Day celebrations on May 9.Ukraine's Deputy Defence Minister Hanna Maliar said Wagner's proposed retreat, which would come one day after the annual events commemorating the Soviet victory over Nazi Germany in World War Two, was a lie and claimed Kyiv's troops were instead seeing an influx of more mercenary fighters to the front lines.'We are now seeing them pulling (fighters) from the entire offensive line where the Wagner fighters were, they are pulling (them) to the Bakhmut direction,' Maliar said in televised comments.'The Russians are inclined towards symbolism and their key historic myth is May 9 and they really have set the objective of taking control of Bakhmut by this date,' she said.It comes after Prigozhin – nicknamed Putin's 'chef' for his close links to the dictator – raged against Sergei Shoigu and Russian army chief General Valery Gerasimov in a gruesome video posted on Telegram yesterday. ",
        "The mercenary leader was filmed standing over the corpses of dozens of slain Wagner fighters – all of whom he claimed had been killed in bitter fighting earlier that day in fervent attempts to capture Bakhmut. ",
        "In an emotional and foul-mouthed rant, he said: 'These are the Wagner PMC [Private Military Company] fighters who died today – the blood is still fresh... Film them all!'Addressing Putin-appointees Shoigu and Gerasimov, who are in charge of military operations, he said: 'Now listen to me, you ******* *****. These are someone's ******* fathers and someone's sons.'And those scum who don't give us ammunition will eat their guts in hell. Mother*******.'Prigozhin then declared he will withdraw all his fighters from the front lines in Bakhmut by May 10 in the face of 'senseless' losses.'My men will not take unnecessary and unjustifiable losses in Bakhmut without ammunition,' he said in a video addressed to Shoigu and Gerasimov.'Therefore, as of May 10, 2023, we are withdrawing from the settlement of Bakhmut.'If, because of your petty envy, you don't want to give victory to Russians in Bakhmut, then that is your problem!' Meanwhile, Moscow today ordered the evacuation of families with children and of the elderly from Russian-held frontline areas in southern Ukraine because of an increase in shelling from the Ukrainian side.'In the past few days, the enemy has stepped up shelling of settlements close to the front line,' the Russian-installed head of the Zaporizhzhia region, Yevgeny Balitsky, wrote on social media.",
        "'I have therefore made a decision to evacuate first of all children and parents, elderly people, disabled people and hospital patients,' he wrote.Ukraine has been preparing an offensive against Russian forces for months and some analysts say sabotage attacks and long-distance strikes behind Russian lines in recent days show it is now imminent.",
        "Last year, the mercenary group's ranks swelled as they recruited thousands of criminals from prisons and were furnished with weapons, ammunition and equipment by Russia's then-army chief General 'Armageddon' Sergei Surovikin - a close ally of Prigozhin.But Surovikin was demoted in January in favour of Russia's army chief Gerasimov, who with the long-suffering defence minister Shoigu is wary of Prigozhin and sees his group's success as damaging to the Russian army's ailing reputation. Wagner has since been banned from recruiting prisoners - and Prigozhin believes Gerasimov and Shoigu are responsible for stemming the flow of vital ammunition and equipment to Wagner's front line forces.'We're 70% short of ammunition,' the Wagner chief declared in the grisly video.'Shoigu [and] Gerasimov: where the **** is the ammunition?'You're sitting around, you scum, in expensive clubs. Your children are getting off on life, making videos on YouTube.'You think you're the masters of this life and that you have the right to dispose of their lives. You think that if you've got warehouses full of shells, you're entitled to them.'",
        "Shoigu has insisted adequate ammunition supplies have been delivered to Wagner and other frontline troops. But Prigozhin's outburst appears to confirm suspicions that the Russian defence ministry are seeking to undercut the mercenary group.",
        "The Wagner boss told the defence minister: 'It's a basic calculation - if you give us the [correct] ammunition, five times fewer will die.'They came here as volunteers and are dying for you to live in your redwood offices. Keep that in mind.'In theory both Prigozhin and Shoigu are on the same side amid the conflict in Ukraine, and are among autocrat Putin's most loyal henchmen.But Prigozhin has declared his own war on Shoigu and his right-hand man Gerasimov.Putin meanwhile remains silent on the rift that threatens to tear apart his armed forces, and has appeared weak in his failure to address the issue. Prigozhin's extreme rants against the army's high commander, of which this is the strongest, should lead him to be arrested under Putin's draconian laws preventing criticism of the army.But Wagner has proven effective on the battlefield - more so than many regular Russian army units - and the mercenary leader seems to have been given carte blanche to operate freely without fear of reprimand.  Wagner – composed of mercenaries, volunteers and convicts – has suffered tens of thousands of losses in the war so far. ",
        "Prigozhin blames the scale of the deaths on the army's refusal to release proper supplies of ammunition and weaponry – though many of his units are also poorly trained, owing to their recent recruitment from the Russian penal system. "
    ]
}