{
    "articleURL": "/wires/ap/article-12058647/Sudan-doctors-At-100-killed-armed-fighter-clashes.html",
    "content": [
        "CAIRO (AP) - Clashes that erupted last month between armed fighters in a city in Sudan´s restive Darfur region killed at least 100 people, according to Sudan´s Doctors Syndicate.",
        "Hospitals were still out of service in the Darfur city of Genena and an accurate count of the wounded was still hard to make, the doctors´ union added in a statement posted on its official Facebook page late Sunday.The fighting in Genena, which broke out a few days after Sudan´s two rival generals took up arms against each other in the capital of Khartoum, points to the possibility that the conflict could engulf other parts of the East African country.The syndicate's death toll comes as talks continue between the warring parties in the Saudi Arabian city of Jeddah. A statement issued by the Saudi foreign ministry on Monday said the negotiations between delegations from the country's military, on one side, and on the other the powerful paramilitary, the Rapid Support Forces, are expected to go on for a few more days.The talks, which are focused on creating humanitarian corridors to allow aid and civilians to move, are part of a broader diplomatic initiative proposed by Saudi Arabia and the U.S. to stop the fighting.The doctors' union did not specify the two parties to the clashes in Genena, a city of around half a million people located near the border with Chad that has been a flashpoint since the early days of the fighting.",
        "Late last month, residents described how armed fighters, many wearing the uniform of the Rapid Support Forces paramilitary, rampaged through the city, looting shops and homes and battling with rival forces. They said the fighting was dragging in tribal militias, tapping into longtime hatreds between the region´s two main communities - one that identifies as Arab, the other as East or Central African.In the early 2000s, African tribes in Darfur that had long complained of discrimination rebelled against the Khartoum government, which responded with a military campaign that the International Criminal Court later said amounted to genocide. State-backed Arab militias known as the Janjaweed were accused of widespread killings, rapes and other atrocities. The Janjaweed later evolved into the Rapid Support Forces paramilitary group, known as the RSF.At least 481 civilians were killed in Khartoum clashes that erupted in mid-April between the military, led by Gen. Abdel Fattah Burhan, and the RSF, led by Gen. Mohamed Hamdan Dagalo, according to the same doctors´ statement. The number of the wounded among civilians has jumped to more than 2,560.On Friday, the governor of West Darfur, where Genena is located, accused the RSF of damaging government offices, setting fire to more than 10 shelters housing displaced communities, and looting homes and stores.",
        "\"Today, West Darfur is a doomed province. What is left of the Darfur population lives under very harsh conditions,\" Gen. Khamis Abdullah Abkar said in a video posted on a local news site Friday.\"The international community should not remain silent about the challenge in this province. It should act immediately; people need shelter, food and medicine,\" he said.The paramilitary has repeatedly denied claims that its forces have terrorized civilians or used brutal tactics.On Monday, Sudan´s leading pro-democracy alliance, which has spearheaded protests against the country's military leaders since 2019, expressed its support for the Jeddah talks and called for an immediate cessation of fighting.In a statement released Monday, the Forces for the Declaration of Freedom and Change stressed the need for a \"comprehensive political solution that would achieve peace, justice, a transition to civilian democratic rule and a military and security reform.\""
    ]
}