{
    "articleURL": "/sport/formulaone/article-12050171/George-Russell-says-Max-Verstappen-spat-dummy-sprint-bust-Baku.html",
    "content": [
        "The two drivers collided during a sprint race on the Azerbaijan GP race weekendRussell, 25, had previously been magnanimous about the pair's fiery bust-upBut he refused to hold back on Thursday, calling out Verstappen for hypocrisy George Russell pulled off a remarkable U-turn just hours after saying there was 'no need' to clear the air with Max Verstappen - labelling the world champion 'pathetic' and his behaviour 'a bit poor' following their bust-up in Baku on Saturday.",
        "The two drivers collided during the race weekend's sprint with Russell's Mercedes taking a chunk out of the Dutchman's Red Bull within the first three corners. Verstappen had been largely at fault after refusing to concede space for the British driver and later regaining the lost position from Russell, but he could still be heard raging over his radio before confronting his rival after the race and calling him a 'd***head'. Russell had previously told assembled journalists on Thursday that he would 'shake his hand' if he encountered Verstappen, despite the two-time champion dubbing him 'Princess George' in his own press conference.But comments made to Ted Kravitz for Sky Sports struck a different tone. ",
        "'It was all a little bit pathetic,' Russell said, calling out Verstappen's perceived hypocrisy. 'I think something you learn as a kid is if you're going to give something you've got to be willing to take it as well.'He's had his fair share of giving moves like that and being tough and hard at racing and it's a little bit poor to see how he sort of spat his dummy out when it was the first time he probably got something back in the same regard.'Making it clear he wished to move on, Russell added: 'From my side, there was nothing really to say.",
        "'I thought it was good racing, exciting racing and that's the only thing that happened that weekend. We're both drivers, we've both been in the sport a long time now and we have plenty of experience. 'We'll have a chat, everything is fine, move on and I guess we'll laugh about it one day.'Despite the fiery exchange between the pair, Verstappen too insisted there was no lingering bad blood. ",
        "'Maybe that's what people would like to hear but, no, it's absolutely fine,' Verstappen stated. The Red Bull driver has instead reserved most of his ire for the sprint format itself, which was introduced in Baku last race weekend. 'Just scrap the whole thing,’ said Verstappen, who finished third in Saturday's challenge. ‘It is important to go back to what we had and make sure every team can fight for a win. That is what we have to try to aim for and not to implement this artificial excitement.' He went on to compare the format to 'gambling' and said that he had been 'bored' qualifying for Sunday's race, which saw the leader in the drivers standings finish second behind his team-mate Sergio Perez.    "
    ]
}