{
    "articleURL": "/wires/pa/article-12054457/Crowds-gather-Sunderland-watch-coronation.html",
    "content": [
        "Celebrations took place in Sunderland as crowds gathered in Keel Square to watch the King’s coronation.",
        "A big screen was set up in the city centre with picnic benches and chairs for viewers, while activities including face painting, a Punch and Judy show and crown-making went on throughout the day.Plenty arrived to watch the event on a warm morning in Sunderland, including Kath Stark, 67, from Washington, who was with clients she supports who have learning difficulties.Wearing a white T-shirt with a picture of the King and the Union flag, she told the PA news agency: “Watching the coronation, I just like history and have come to see the King crowned.",
        "“It’s just a joyous day out for the customers, just everyone’s in a party mood, everyone’s happy so we’re going to stay quite a few hours if the weather holds.“The history (of the coronation) is massive. I’m a royalist, I think they do very well for the country. I know not everybody thinks the same, but I think they do.“The history, we’ve had them for over one thousand years, I just enjoy it.“I enjoy watching things like this, like the jubilee, even the Queen’s funeral, the big processions, nobody does it like we do.”As St Edward’s Crown was placed on the King’s head, the crowd at Keel Square cheered and there was a gentle patter of applause.",
        "Victoria Mills, 45, is a housing support officer from South Shields and watched with friends from work and her children.“(The coronation has) been brilliant, I’ve really enjoyed it,” she said.",
        "“I think it just brings the community together, the whole country’s going to be watching, it’s just a real British and patriotic thing.”Hilary Buttigieg, 56, was also among the revellers.Originally from the city, she now lives in Luton, but returned for a visit and expressed her excitement at watching “a moment in history”.She told PA: “It’s a moment in history, the last time was with the Queen many years ago.“I think we’ve got some people who are for it, some who are against it.“Whether you’re pro-monarchy or not, it is a moment in history, this will go in the history books, you’ll remember where you were at that time. That’s why I thought it would be nice to come out to be with my community.“At the end of the day he’s been in training for this all of his life and he’s now going to get his chance to be King.“I think he’s going to be a modern person, I loved the Queen, I don’t think anyone’s got a bad thing to say about the Queen, she was brilliant, but I think he’s going to try and bring it into modern times.",
        "“He’s done all of his work for The Prince’s Trust, he’s always been about climate change so I think that’ll be good, that’s a hot topic at the minute.”"
    ]
}