{
    "articleURL": "/wires/aap/article-12044895/Corica-pleads-Sydney-fans-cancel-derby-boycott.html",
    "content": [
        "Sydney FC coach Steve Corica has urged the club's active supporter group to reconsider their boycott of their A-League Men finals derby with Western Sydney Wanderers.",
        "As star winger Joe Lolley races the clock to be fit for Saturday's trip to Parramatta's CommBank Stadium, Sydney's hierarchy have been locked in discussions with The Cove, the club's active supporter group.The Cove have chosen to boycott their men's side over the A-League's controversial decision to sell grand final hosting rights to Sydney for the next three years.In a statement released on social media earlier this week, The Cove said they were sick of being a \"doormat\" for A-League bosses to walk over.They have remained in dialogue with the club this week, with Sydney great Alex Brosque attempting to dissuade them from boycotting.\"We would love for them to come and get behind the team,\" Corica said.\"It's obviously tough, we're a little bit disappointed that they're not coming.\"They are like our 12th man and we need them there to support the boys.\"The Wanderers' active group, the Red and Black Bloc (RBB), have said they will back their club and be present on Saturday night, leaving the Sky Blues facing the prospect of walking into a hostile environment.Midfielder Luke Brattan said it would be noticeable not having the club's boisterous active supporters in the stands.\"When you look up and see the fans, it's a boost,\" he said.",
        "\"It's not ideal not having them there.\"It's the stuff that gets you over the line when the game is hard and you're running your arse off for 90 plus minutes.\"It's the biggest game of our lives, I don't want to really talk about fans, we need to win this game for the club to get to where we belong.\"Corica's side is at full strength, barring Lolley who trained separately from the main group on Thursday and is nursing a hamstring issue.Corica is hopeful Lolley will feature but it seems that would most likely be as a substitute from the bench.The Sydney boss is eager to set the record straight after the 4-0 thumping earlier this year that helped the Wanderers finish above the Sky Blues at the end of the regular season.\"That really counts for nothing once you're there,\" Corica said.\"It's a massive game and it's the first time we've met in the finals series.\"It's going to be interesting, it's always a massive game between us and the Wanderers.\"The pressure is always on in this game anyway and to have it in a finals game it's exciting.\""
    ]
}