{
    "articleURL": "/news/article-12045643/Millionaire-sued-blasting-boy-16-shotgun-scared-urban-explorers.html",
    "content": [
        "Tom Frearson was 16 when he was shot in the back by millionaire Gary SteeleMr Steele is being sued by Mr Frearson for almost £3m after the 2019 incidentThe 63-year-old tech tycoon insisted that the shooting was not deliberate He claimed Mr Frearson ran into a warning shot designed to scare him away A tech tycoon being sued for almost £3million after blasting a teenager with a shotgun claims he was 'frightened' at the time following an online dare campaign by explorers to target his £30million country estate.",
        "Tom Frearson, then 16, says he 'feared for his life' after millionaire Gary Steele, 63, boss of a successful superfast broadband tech firm, shot him from over a wall at his 1,300-acre Witley Estate, near Godalming, Surrey, in July 2019.Mr Frearson, now 21, was rushed to hospital in an ambulance, having had his back, hand, arm and buttock peppered with steel pellets from the 20-gauge Beretta shotgun, which was licensed to Mr Steele's partner Amanda Karn, but not him.Mr Frearson, of Hambledon, Surrey, is now suing the tycoon, claiming he was 'deliberate or reckless' in firing the gun and causing him injuries which he says have left him struggling to get work and needing lifelong care and assistance.But Mr Steele is defending the action, claiming he 'accidentally' shot the youngster while feeling 'isolated and afraid' after his estate had been targeted by an online campaign challenging people to find his underwater ballroom and follies.",
        "A target was an 'underwater ballroom' at the estate, a glass-domed room accessible via a tunnel beneath one of the man-made lakes on the grounds and surmounted by a 'floating' statue, his lawyers say in documents submitted to London's High Court. ",
        "Mr Steele was found guilty of possession of a shotgun without a licence, having been acquitted of attempted murder, wounding with intent and unlawful wounding by a jury at Guildford Crown Court in October 2019.",
        "The tycoon, who reportedly sold the Witley Estate in 2019 for £30million and now lives at £12million Roundhurst Farm, Lurgashall, Surrey, was sentenced to 15 months' prison, suspended for 12 months, and ordered to pay a total of £11,140 in fines and costs. He was also told to forfeit the shotgun and ammunition.But Mr Frearson is now claiming around £2.9million in compensation, plus interest, for the injuries he suffered.He says his intended career as a mechanic, as well as his ability to care for himself, has been blighted because he cannot grip properly with his injured left hand.He has also been left traumatised with scarring which makes him self-conscious and faces up to 50 more operations to dig the shot out of his body.He is claiming around £1million for lost future earnings and another £1.1million for future care and assistance.But Mr Steele is defending the claim, insisting his actions were nether deliberate nor reckless. He says the youngster ran into the path of a 'warning shot' he had fired to scare him off while feeling 'vulnerable' after his property was targeted by explorers.",
        "In papers submitted to the High Court, his barrister Laura Johnson KC says: 'Due to its follies, in particular the underground ballroom and the \"Ice House\", the estate attracted trespassers looking to explore the grounds.",
        "'Although some of these individuals left when requested, the defendant and his partner also encountered incidents of criminal damage, antisocial behaviour and theft.'One of the follies, the Ice House, was repeatedly targeted as a destination for parties and illegal raves. The Boat House was also targeted by people breaking in, stealing - and eventually sinking - the defendant's boat and seeking to gain access to the Underwater Ballroom or the Ice House.'On occasion, intruders even brought their own watercraft to use on the lake to gain access to the follies.'In November 2014, there were two incidents on the estate. The first involved two follies being broken into. A few days later, on November 17 2014, the Underwater Ballroom was broken into.'During the course of the police investigation into these incidents, the defendant discovered that the Underwater Ballroom had become the subject of a challenge publicised on social media, which encouraged individuals to enter the estate, break into the Underwater Ballroom and take a photograph of themselves there.'This was very upsetting to the defendant. He invested significant time requesting internet sites to remove reference to or footage of this challenge. Notwithstanding these efforts, problems with trespassers and intruders continued.",
        "'In 2017 and 2018, the defendant and his partner continued to suffer extensive problems with criminal conduct.",
        "'During the summer of 2018, the problems continued and indeed escalated. The estate continued to suffer from being a focus on social media whereby people encouraged each other to break into the estate.'The defendant and his partner were distressed by these problems. They felt unsafe in their home,' she said.On the night of the shooting, a group of youths - whom Mr Frearson knew but was not with - had been spotted within the grounds of the estate, with youths having also been in the grounds the previous night, the barrister claims.'The claimant's friends entered the estate whilst the defendant and his partner were having dinner on the terrace,' she says.'Their presence on the estate was upsetting and distressing to the defendant and his partner.'The defendant and his partner were frightened by the arrival of the claimant's friends. It was a Monday evening. More youths attended than the night before, their behaviour was bolder and the defendant and his partner felt vulnerable because the police had not attended the previous evening when their assistance was sought.'They had no near neighbours and were isolated and afraid.'The defendant wanted to ask them to leave. He believed that their behaviour was bolder and escalating.'He took the gun with him for reassurance because of the previous incidents when he had been verbally assaulted, had stones thrown at him and been threatened.",
        "'He was also aware that at least one security camera had been disabled. The defendant drove the quad bike into the woods but the youths had disappeared. As a result he decided to look for the CCTV camera that had been disabled to reinstate it.'Near to the Turbine House and close to the wall, he heard voices and realised there was an intruder running along the gully beneath the wall. The intruder was out of sight.",
        "'The defendant was scared that the group outnumbered him, were spread out around him and coming closer.'As a result of the defendant's fear, with the intention of frightening the intruder away with the sound of the shot, he decided to fire a warning shot.'It is now known that the intruder on the other side of the wall, below where the defendant was standing and out of sight, was the claimant.'The claimant was not on or near the public footpath....He was some distance from the closest bridleway in the gully on the other side of the wall.'Although he was not within the core of the walled estate, he was on the defendant's land.'As the defendant fired the warning shot, the claimant ran into the range of the shot and was hit. At the time the defendant fired the shot, he believed that it was safe to do.",
        "'Although it is admitted that the defendant had the shotgun with him, it is denied that it is appropriate to describe him as \"armed\".'He carried the shotgun with him for reassurance because he was fearful for his safety and had the possibility in his mind of firing a warning shot to scare the intruders away.'The defendant did not fire the shotgun at the claimant. He fired a warning shot when he believed it was safe to do so, with the intention of scaring the intruders away with the sound. He accidentally hit the claimant who was running.",
        "'The claim is premised only on the cause of action of trespass to the person and the claimant must prove that the defendant intended or was reckless as to whether he injured the claimant. This is denied.'But she added: 'It is admitted that the claimant was injured by shotgun pellets in his left arm, hand, back and buttock and required surgery to his left forearm as a result of the effect of the same.'In documents lodged with the court, Mr Frearson's barrister Colm Nugent says he was 'walking outside the perimeter wall of the estate along or near a public footpath' when he was 'shot by the defendant without any forewarning from an elevated position within the grounds'.He added: 'It later transpired that the defendant wrongly believed or claimed to believe that the claimant had been trespassing on his land earlier that same day.'The defendant fired the shotgun at the claimant from a distance of approximately 12 meters.'After he had shot the claimant he said to him over the wall \"I told you not to come back\".'The submissions in the documents submitted to the court have yet to be tested in evidence before a judge."
    ]
}