{
    "articleURL": "/tvshowbiz/article-12056151/Katy-Perry-displays-unique-style-London-ahead-King-Charles-Coronation-concert.html",
    "content": [
        "Katy Perry caught the eye as she left a London hotel on Saturday ahead of King Charles' Coronation concert. ",
        "The pop star, 38, displayed her unique style in a houndstooth skirt suit and pink knee-high boots as she descended some steps.Katy's monochrome ensemble boasted a cinched-in waist with pemplum detailing, and she perfectly matched her colour-pop boots with a handbag of the same hue. The singer shielded her eyes with black sunglasses and styled her raven tresses into a sleek ponytail.She was escorted out of the hotel flanked by members of her entourage while the gracious doorman held up an umbrella to protect her from the rain. ",
        "It has been reported that Katy's glam squad is set to take up five dressing rooms backstage when she performs at the Coronation Concert at Windsor Castle.The California Girls singer is said to have flown in with a royal-sized entourage in tow for her appearance at the star-studded Coronation, where she will headline.The American singer-songwriter - who took a week off her Las Vegas residency to appear at the glitzy bash - is reportedly expected to have more than 50 aides on site at Windsor Castle.The entire squad, which has taken up five dressing rooms, consists of hair and makeup artists, stylists, costume designers, her sound engineering team, her lighting specialists, and her dance team, according to The Mirror.",
        "Her entourage had reportedly earlier travelled to the venue in ten Mercedes people carriers and were allocated five dressing rooms to get Katy ready for the big show.A source also revealed to the publication that Katy's backstage room includes luxury sofas, fresh flowers, and a refrigerator with a glass door.Another source added: 'Katy has easily the biggest entourage of any on the bill.'They continued: 'But she has a trusted team who she always works with and relies upon. They know exactly how she likes things done… and will make sure they’re done to the letter.'",
        "However, they insisted that Katy isn't 'over the top' when it comes to her backstage squad.When speaking to Extra TV earlier this month, Katy gushed over the fact that she had been asked to perform at King Charles The Thirds Coronation Concert.She said 'I’m grateful to have been asked. It’s very exciting.'She continued: 'It [the invite] was very regal – I loved it. I’m an ambassador to one of his foundations… he asked me to sing and it all aligned.'"
    ]
}