{
    "articleURL": "/wires/ap/article-12048139/Judge-extends-suspension-Missouri-AGs-transgender-rule.html",
    "content": [
        "A judge has extended her order barring the enforcement of a unique rule pushed by Missouri's Republican attorney general that would require adults and children to undergo more than a year of therapy and fulfill other requirements before they could receive gender-affirming treatments such as puberty blockers, hormones and surgery.",
        "Attorney General Andrew Bailey initially sought to implement the rule effective April 27, prompting a lawsuit on behalf of transgender people. St. Louis County Judge Ellen Ribaudo on Monday granted a temporary restraining order and originally scheduled a May 11 hearing on the lawsuit.A posting Thursday on Missouri's online court system shows that Ribaudo pushed back the hearing to July 20, following a joint request from both sides. The posting said the order will remain in effect until July 24 or until the judge rules on whether to grant a preliminary injunction.A spokeswoman for Bailey confirmed the date change, saying the July hearing date was the one that worked best for all parties in the case.Ribaudo's ruling granting the temporary restraining order noted that patients are at \"high risk\" of having their medical care interrupted indefinitely and losing care through their current providers if the rule takes effect.Legal experts and transgender advocates say that implementation of the rule would make Missouri the first state to restrict gender-affirming care for adults and the first to enact such restrictions through emergency rule-making instead of through a new law.",
        "On Thursday, the Kansas City Council introduced a resolution making Missouri's largest city a \"sanctuary city\" for transgender people receiving gender-affirming care. The resolution now goes to a committee, which will receive public input before deciding on further action.",
        "The lawsuit argues that Bailey sidestepped the Republican-led Legislature and exceeded his authority by attempting to regulate the health care through Missouri´s consumer-protection law.Bailey said the rule would shield minors from what he describes as experimental medical treatments, though puberty blockers and sex hormones have been prescribed for decades and the rule would also apply to adults.The attorney general´s office has said there are 12,400 Missourians who identify as transgender. The office has estimated that 600 to 700 Missourians would begin intervention in the next year.The rule would require people to have experienced an \"intense pattern\" of documented gender dysphoria for three years and to have received at least 15 hourly sessions with a therapist over at least 18 months before they could receive treatment. Prospective patients also would be required to be screened for autism, and any psychiatric symptoms from mental health issues would have to be treated and resolved.Minors, but not adults, also would have to be screened for \"social media addiction\" before treatments could begin.Bailey issued the restrictions after launching an investigation in February into the Washington University Transgender Center at St. Louis Children´s Hospital. The probe was prompted by a former employee who alleged that the center was providing children with gender-affirming care without informed consent, a sufficient individualized case review and wraparound mental health services.",
        "The university´s internal review found no misconduct, determining the claims were unsubstantiated.Bailey´s emergency rule on gender-affirming care comes amid a push by Republicans throughout the country to pass laws aimed at transgender people. More than a dozen states have enacted laws restricting or banning gender-affirming care for minors."
    ]
}