{
    "articleURL": "/tvshowbiz/article-12061285/Fans-shocked-Aussie-influencer-Christie-Swadling-reveals-real-age.html",
    "content": [
        "Fans of a popular Australian fitness influencer have been shocked to find out how old she really is.",
        "Christie Swadling, a YouTuber who filed for bankruptcy in December, shared a TikTok video of her latest hair transformation - ditching her statement blonde locks to a short brunette look with bangs.Christie posted a before clip of herself with heavy makeup and her blonde hair in a high ponytail, before a photo of her latest makeover. 'When you finally discover blonde hair and heavy makeup isn't for you,' she wrote alongside the video. The Instagram model then added in her caption: 'Only took 26 years xx.'Christie's age surprised several fans who took to the comments after they initially thought she was older.'There’s no way you are 26,' one follower wrote.'You're not 26,' another commented, to which Christie replied, 'Yes lol.''Something's off,' a fan said as another later added, 'I thought u were 39.'",
        "Christie is in fact 26 years old, as stated on her bankrupcty filing.Documents leaked online in February showed the YouTuber was in financial strife, even though she projects a lavish lifestyle on social media.It was revealed that Swadling was bankrupt after an anonymous user on the Tattle Life forums paid $15 to obtain the paperwork on her bankruptcy filing.",
        "The Instagram model listed her job as an 'advertising and marketing professional' in the publicly available document filed on December 29.",
        "The status of her bankruptcy is 'undischarged', which means she will still need to pay back particular debts.It also means she will not be able to borrow again from financial institutions without the disclosure of her bankruptcy.The release of the debtor's petition did not specify the outstanding debts.",
        "The document was published on Tattle Life after a user decided to pay the $15 clerical fee to settle the speculation about the mystery bankruptcy once and for all.'Well, well, well. Look what we have here. Best $15 spent,' they wrote.'Public register states she has been bankrupt since December 29. She probably got approval to leave for Bali but chances of her travelling again are slim to none.'There is no minimum amount owed for an individual to claim bankruptcy.According to the Australian Financial Securities Authority, a creditor must be seeking $10,000 or more to apply to make you bankrupt."
    ]
}