{
    "articleURL": "/sport/nba/article-12038493/LeBron-James-Americas-highest-paid-athlete-raking-16-5m-Cristiano-Ronaldo.html",
    "content": [
        "LeBron James' earnings were massively boosted by his off-court venturesAnd one star tennis player made almost all of his money from endorsementsDailyMail.com provides all the latest international sports newsLeBron James is the highest-paid American athlete over the last 12 months, bringing in a total of $119.5million according to Forbes.",
        "While James is making $44.5million on the court with the Lakers, it's his off-court ventures that put him into a different stratosphere than his basketball peers.Aside from endorsements from Nike and other brands, James has a stake in Fenway Sports Group, owners of Liverpool, the Boston Red Sox and the Pittsburgh Penguins.He also owns sports entertainment venture the SpringHill Company, which produces James' 'The Shop' roundtable show for HBO, among others.James, who came in as the fourth-highest paid athlete in the world, is one of five Americans on the list, with Dustin Johnson placing at sixth.",
        "The LIV golfer made an astounding $102million after joining the Saudi-backed league, including a tour-best $35.6million in prize money.He brought in $5million off the course too.Further down the list, Johnson's LIV colleague Phil Mickelson (No. 7) raked in a total of $106million, while Stephen Curry (No. 8) and Kevin Durant (No. 10) made $100.4million and $89.1million respectively.Curry has a long-term deal with Under Armour and a partnership with Chase Bank, while Durant recently penned a lifetime contract with Nike and has stakes in the Philadelphia Union, the Premier Lacrosse League and more.The top three on the list all come from the world of soccer, as Cristiano Ronaldo, Lionel Messi and Kylian Mbappe had incomes of $136million, $130million and $120million respectively.",
        "For Ronaldo, an estimated $46million of that income has come on the field - which Forbes say 'blends together his two [Manchester United and Al-Nassr] contracts for this season and accounts for his brief unemployment' - while close to double the amount has come through off-field endorsements.The Portuguese striker signed a mammoth deal with Al-Nassr in January, worth an estimated $75million per year, according to Forbes.",
        "1. Cristiano Ronaldo - $136million2. Lionel Messi - $130million3. Kylian Mbappe - $120million4. LeBron James - $119.5million5. Canelo Alvarez - $110million6. Dustin Johnson - $107million7. Phil Mickelson - $106million8. Stephen Curry - $100.4million9. Roger Federer - $95.1million10. Kevin Durant - $89.1million",
        "Messi, meanwhile earned $65million off the field with the help of endorsement deals from Adidas, Budweiser and PepsiCo.And Mbappe, who was tempted to stay at PSG with the most lucrative contract in world soccer, made $100million over the last 12 months on the field with PSG.Elsewhere on the list, boxer Canelo Alvarez earned a total of $110million after a pair of blockbuster fights, while the now-retired Roger Federer raked in $95million off the court from partnerships with Uniqlo, On and Credit Suisse, among others.Federer made just $100k from playing over the last year after participating in one final match at the Laver Cup in September. "
    ]
}