{
    "articleURL": "/wires/ap/article-12046179/Knicks-Brunson-Hart-turn-press-conference-press-comedy.html",
    "content": [
        "NEW YORK (AP) - Jalen Brunson, like a good point guard, was trying to set up his teammate.",
        "Josh Hart wasn't ready for the pass. Not when he was busy with a mouthful of pizza.\"You can finish chewing,\" Brunson said.That was following Game 2 of the Eastern Conference semifinals Tuesday night, when the New York Knicks teammates sat side by side for their latest interview room act. Brunson attempted to let Hart take a question, but talking hoops at that moment would have meant talking with food in his mouth.Brunson had scored 30 points and Hart just missed a triple-double in a 111-105 victory over the Miami Heat that tied the series. With another win behind them, it was time for the other fun part of the Knicks' long-awaited postseason success.Reunited this season, the former teammates at Villanova have turned the press conference into press comedy.",
        "\"Josh is a clown, so he contributes to that more than I do,\" Brunson said.Indeed, Brunson is the straight man, looking alternatively annoyed and amused as Hart sits next to him while feasting on his postgame snack.Popcorn one game. Chicken wings another. And pizza after the most recent.\"It´s like an SNL skit. I don´t know why the two of them have to be in there together all the time, but it´s comical,\" Jay Wright, their coach at Villanova, said with a laugh.",
        "Now retired, Wright was their target Tuesday when Brunson was asked if the coach would have allowed Hart to be eating during his postgame interviews.Brunson wouldn't comment on that, but the two quickly turned the question into their opportunity to publicly call out Wright for not yet coming to a game.\"They torched me,\" said Wright, who added his former players have arranged for him and his wife, Patty, to attend Game 5 at Madison Square Garden.Brunson and Hart helped the Wildcats to the 2016 NCAA title and Brunson was still there for another championship in 2018. They became teammates again this season after the Knicks, who had signed Brunson away from Dallas over the summer, acquired Hart from Portland.Brunson was sitting for his postgame interview after a victory in Cleveland in the opening game of the playoffs when Hart entered and sat next to him, wearing a T-shirt with a picture of Brunson's face from his Slam Magazine cover on the front.They have continued together after all the Knicks' victories, though Hart spoke alongside RJ Barrett after the Game 1 loss to Miami.Usually serious in that setting, Brunson hasn't been able to keep from laughing a few times when Hart makes him the butt of jokes. Asked if he considered Brunson a star player, Hart responded that he was \"undersized, overrated, overpaid.\"",
        "When Brunson was asked about one basket that a reporter called a dunk, Hart blurted out, \"layup,\" to make clear that his 6-foot-2 teammate didn't exactly shake the rim like a Shaq slam.Brunson doesn't impress Hart with his ability as a golfer either, with a club or a console in his hand. When recently set to play a video game version, the reaction from Hart's wife was a reminder that not everyone loves the duo spending so much time together.\"She was like, 'Didn´t you guys just see each other?'\" Hart said. \"I´m like, `Yes, technically.´ But that´s just how we are.\"Wright enjoys watching them, proud his players have become such an important part of a Knicks team that is in the second round of the playoffs for the first time in 10 years.Now he has no choice but to go see the team in person.\"I don´t like going to the games too much,\" Wright said. \"I love watching the games on TV, I really do. But they´re calling me out now. I´ve got to go.\"___AP Sports Writer Dan Gelston in Philadelphia contributed to this report.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}