{
    "articleURL": "/health/article-12039097/Doctors-say-theyre-seeing-quiet-surge-FEMALE-hair-transplants.html",
    "content": [
        "The procedure can cost up to $12,000 and takes between five and six hoursPatients are given between 50 and 75 small injections to numb the areaREAD MORE: I had a hair transplant because I hated my huge foreheadHair transplants have become a go-to cosmetic surgery in recent years — with famous men like Elon Musk and LeBron James heavily rumored to have had one.",
        "But doctors tell DailyMail.com the procedure is quietly becoming popular among women.David Kurzman, who runs the Natural Transplants clinic in Florida, said between 80 and 90 percent of his patients are now women who are either self-conscious about the size of their forehead or suffer from balding or alopecia.Other patients like Shilpa Cacho, from Dallas, Texas, are traveling to Turkey, where the procedure costs a fraction of the price — about $2,000 compared to around $12,000 in the US.",
        "The International Society of Hair Restoration Surgery in the US reported last year that, globally, of those having hair transplants, 87 percent are men and just 13 percent women — and that number is growing.Ms Cacho, 35, was traveling through Istanbul, Turkey, in November 2021 while traveling when she decided to get a hair transplant at Este Grande clinic.She told DailyMail.com: 'I always had thin hair, but it was getting progressively thinner as I got older.'When I got to Istanbul, I started doing some research and found a clinic that had good reviews. 'I'm very much a person who's like, if I'm thinking about something, let's just give it a shot. I don't really think about it too much. 'So I just decided to do it. They were able to get me scheduled within a few days.'",
        "During the transplant, hair follicles are extracted from areas of the scalp where hair is fuller — usually at the back — and placed into areas where the hair is thinning, where they will continue to grow and therefore give the appearance of fuller hair. ",
        "But the painstaking procedure is not for the faint-hearted.It takes between five and six hours and starts with the patient's ideal hairline being drawn onto their forehead with a pen.Then a section at the back of the head is shaved and patient is given between 50 and 75 small injections to numb the area.The surgeon makes an incision and cuts out a strip of tissue which is given to technicians to cut the hair follicles out of. The skin is sewn back together.Then little incisions are made at the front of the head to place the hair follicles into.Ms Cacho, who paid just $1,800 for the procedure, said: 'They took hair from the back of my head and put it on the front.'The most painful part is where they're injecting the anesthesia into your scalp. It's just really painful. That's probably like 15 minutes of pretty bad pain.'She added: 'They shaved the back of my head before they took the follicles and then they placed it on the front. She created a new hairline for me. ",
        "'Then I went back the next day, they removed the bandage washed the area and my hair.'",
        "She said: 'One thing I wish I knew, is that you shouldn't go in hoping that if you have thin hair that you're going to all of a sudden have thick hair. That's not what's gonna happen. 'It literally just replaces some of your thinning hair before, but I still have thin hair. It's not a full head of hair that magically just appeared. 'It just covers up what you wanted and it creates a new hairline. But because I didn't have a lot of hair follicles in the first place, I'm not going to magically have thick hair.'When the Natural Transplants clinic opened up in 2015, Mr Kurzman said: 'We happened to do one lady and we did a video of her and it became viral. We had people coming from the UK immediately, from France, Germany, all over. 'Dr Mehmet Oz [TV personality] even saw the video and he had one of my doctors on the show because he was so impressed with the results. 'After that, our phone rang off the hook. Next thing you know, from that point on, over 80 percent of my patients have always been women.'",
        "The majority want to do either hairline lowering or have traction alopecia, he said.",
        "Patients using the blockbuster weight-loss drugs Ozempic and Wegovy say their hair has started to fall out in clumps. ",
        "'We give them more density so they don't look like a man... roughly 70 percent of the ladies that come to us have already had botched hair transplants. A lot of them went to Turkey... they have minimal hair and it looks terrible. A lot of them were in tears when they come in.'Traction alopecia happens from braids and other tight hairstyles and weaves. That rips the hair up by the roots and once the follicles are ripped out, the hair doesn't grow back.The clinic will not treat anyone under the age of 21, while their oldest patient was 81.How much they charge depends on the amount of hair being removed, but is somewhere between $6,500 to a hefty $12,000. Dr Harold Siegel, hair transplant surgeon at Natural Transplants, told DailyMail.com that 90 percent of his patients are female.He thinks more women are getting the procedure done because of social media.He said: 'A lot of times when I do a consult, my patients say, I\" never knew this could get done. I never knew that we could do hair transplants.\"",
        "'YouTube has been incredible, as a source of informing and educating our patients.'Sonja van den Berg, 33, from Amsterdam, got a hair transplant because she hated her forehead and thought it was 'huge'. She visited a clinic in the Netherlands to get her hairline lowered.  The procedure cost her over $3,000 and she was so delighted with the results that she decided to set up her own company to help others gain the confidence they need. She is now the founder of Beauty Gainz, a company that offers all-inclusive hair transplant trips to Istanbul and Turkey.Ms van den Berg said: 'It's funny how something so subtle can make such a big difference. Honestly, I feel a little sad that I didn't know about the procedure earlier.'Finally, I can wear my hair in ways and styles that I wasn't comfortable with before my hair transplant, and when it's windy outside I don't feel the need to hide my forehead when the wind blows my hair.'"
    ]
}