{
    "articleURL": "/femail/article-12059733/Inside-Simone-Biless-wedding-gown-fitting-ahead-stunning-ceremony-Cabo.html",
    "content": [
        "Simone Biles, 26, shared a look inside her Galia Lahav wedding gown fittingThe four-time Olympic gold medalist tied the knot with NFL star Jonathan Owens'I like the sheer, I like how it fits and the little pearl details,' she said of her dressSimone Biles has shared a look inside her wedding gown fitting that took place before her second destination celebration in Mexico this weekend.",
        "The four-time Olympic gold medal gymnast, 26, tied the knot with NFL star Jonathan Owens, 27, in front of 144 family and friends in Cabo on Saturday, two weeks after they made their marriage legal on April 22 in a courthouse ceremony.After Simone, originally from Ohio but now lives in Texas, said 'I do' a second time, Vogue shared a behind-the-scenes video of the athlete's final fitting for her Galia Lahav dress designed by head designer Sharon Sever. 'I found my dress in the DMs and I found my future husband in the DMs. Jesus,' she quipped with a laugh at the beginning of the video.",
        "The most-decorated gymnast gave a brief insight into the process of finding her dress and what she wanted out of her gown for her special day.'When I started dress shopping, I was like if I get married, it has to be a Galia Lahav,' Simone said.'And so once I looked at the dresses, I was like this one is definitely my style. I like the sheer, I like how it fits and the little pearl details, I love the pearls.'If there's something else I wanted at my wedding, it's flowers and pearls.'A Galia Lahav wedding dress costs generally between $6,000 - $16,000.",
        "Simone also opened up about how she was nervous about her gown being a ballgown style as she was 'so petite' - the athlete stands at just 4ft 8in.'But it works perfect, you guys will see,' she gushed to the camera.And once the dress is revealed, Simone looks ecstatic with her choice as she looks every bit the glowing bride in the Galia Lahav creation and her veil.",
        "She also highlighted the thigh-high split of her gown. 'The leg slit was very crucial. It was to add, in my head, more length to my body. I think this is exactly how brides are supposed to feel – luxurious, beautiful, kind of on top of the world,' Simone added.The Galia Lahav creation was a far cry from the outfit she wore to her lowkey courthouse wedding in Texas earlier last month. For that ceremony, Simone wore a $120 dress from online retailer Selfie Leslie and a pair of white heels from Amazon.The couple, who met on exclusive dating app Raya, wed more than a year after the football player proposed on Valentine's Day 2022.It's been a bridal-themed couple of weeks for Simone who has been giving fans an inside look at her wedding celebrations, which included an extravagant bachelorette party in Belize and a bridal shower.",
        "Following their nuptials in Texas, Simone explained to fans: 'We had to get married \"legally\" here in the U.S. since our wedding will be a destination wedding.'In photos from the ceremony, Simone looked stunning in her fairytale gown with ornate detailing, while Jonathan was a handsome groom in his dashing beige tuxedo.Their beautiful altar was decorated with greenery and white flowers.Simone's father Ronald Biles walked her down the aisle and the ceremony was officiated by her uncle, Paul.",
        "Ronald and his wife, Nellie, are actually Simone's grandparents, but they officially adopted her and her sister, Adria, when she was six, and she refers to them as her dad and mom.The Cabo wedding came after their equally lavish rehearsal dinner on Friday night when Simone dazzled in a shimmering minidress while her groom looked dapper in a white suit with shorts.Jonathan was seen being walked down the aisle by his mother, Arthurine Cannon, who was dressed in a curve-hugging, white sleeveless dress with a square neck.The proud mother styled her long hair straight and wore silver sandals as she walked with her son across the sand.She was seen giving him a loving hug as they stood in front of Uncle Paul before taking her seat in the front row.",
        "'Uncle Paul aka gonna be the best officiant y'all have ever seen,' the blushing bride wrote in an Instagram story.Guests included fellow gymnasts Melanie De Jesus Dos Santos, Aly Raisman, Maggie Nichols, Madison Kocian, Jordan Chiles and Katelyn Ohashi."
    ]
}