{
    "articleURL": "/wires/afp/article-12051325/Nigeria-troops-two-Chibok-girls-abducted-nine-years-ago.html",
    "content": [
        "Nigerian troops have found two of the more than 200 schoolgirls abducted by Boko Haram jihadists nine years ago, bringing to 14 the abducted girls found by troops in recent years, the military said.",
        "Dozens of Boko Haram militants stormed the Chibok girls' boarding school in April 2014 in northeast Borno state and herded 276 pupils aged 12 - 17 into trucks in a mass abduction that generated global outrage.Fifty seven of the girls managed to escape by jumping off the trucks shortly after their abduction while 80 were released in exchange for some detained Boko Haram commanders following back-channel talks with the Nigerian government.A few of the girls were found mostly with children for Boko Haram fighters, but 96 still remain missing and are believed to have been forced to marry jihadist fighters.On Thursday, the military commander fighting jihadists in the northeast presented Hauwa Maltha and Esther Marcus before journalists in the regional capital Maiduguri ,where the duo have been kept since their rescue on April 21.\"I present before you the two latest Chibok girls to have been rescued by our gallant troops during a military operation at Lagara in Bama district,\" Major-General Ibrahim Ali said.Maltha and Marcus where 12 when they were abducted and later married off to Boko Haram fighters by the group's late leader Abubakar Shekau. Both had borne children.Maltha, who was found with a three-year-old child and heavily pregnant, was married to three different fighters at different times, according to Ali.",
        "She was first married to Salman, a Shekau lieutenant who recorded propaganda videos, and later to another fighter after Salman was killed in fighting with troops in Lake Chad, the military commander said.Maltha's second husband was also killed in fighting with troops in the group's Sambisa forest enclave and the two children she has for him died from undisclosed sickness, he said.\"Hauwa who was about 8 months and 2 weeks pregnant during the time of her rescue delivered a bouncing baby boy on April 28, 2023, while undergoing thorough medical examination,\" Ali said.Marcus was also married off twice to Boko Haram fighters who were both killed fighting troops.Maltha told reporters that she and other girls were married off to jihadist fighters personally by Shekau.\"We did not get married on our own choice. It was Shekau that married us to them.\", Maltha said.Shekau, who died in May last year during infighting with a rival ISWAP jihadist faction, had released videos of the Chibok girls clad in Muslim veil reciting the Koran, and threatening to marry them off since they had become Muslims.Since the Chibok kidnapping jihadist militants have carried out several mass abductions and deadly attacks on schools in the northeast.The 14-year jihadist conflict has killed 40,000 people and displaced around two million in the northeast, creating a dire humanitarian crisis in the region."
    ]
}