{
    "articleURL": "/wires/pa/article-12051333/Glen-Matlock-struggles-rhyme-King-new-version-God-Save-The-Queen.html",
    "content": [
        "Former Sex Pistols bassist Glen Matlock appears to be struggling to rework the lyrics for God Save The Queen ahead of performing a new version on the day of the coronation.",
        "The singer-songwriter will be at the 100 Club in London on Saturday where he will perform God Save The King.Matlock told the PA news agency: “When you start changing one word, you’ve got to change them all.“There’s not that many words that kind of rhyme nicely (with king) apart from bling, ming, it’s not great.",
        "“I’ll probably just sort of make it up as I go along, so if you want to find out what the new lyrics might be, you better come on down because it’ll probably be on the spur of the moment.”Matlock, whose performance is listed on London City Hall’s programme of royal festivities in the capital this weekend, said he is “passionately ambivalent” about the monarchy.Sex Pistols released their anti-authoritarian hit in 1977 to mark the silver jubilee of the late Queen, and it was banned by the BBC.The song surged to number two in the UK singles chart despite being the only track in history to be listed with a blank title to avoid offence.The band promoted the record on their own jubilee boat trip along the Thames, which ended in their arrest, and it was re-released last year to mark the Queen’s Platinum Jubilee.Matlock said he will not watch the King and Queen Consort being crowned at Westminster Abbey as he will be “deciding what shirt to wear” and doing a sound check on Saturday.",
        "Asked what he thinks of the coronation’s pomp and ceremony, Matlock said: “There’s just so many people in destitution at the moment in this country. I think things are bleak for a lot of people and I think the royal family... they're kind of the opium of the masses, just keeping people quiet  Glen Matlock  “I think it’s kind of rubbing their noses in it a little bit. It’s all a distraction but that’s the country we live in.“Yeah, two sides of the coin, and I’m sort of somewhere floating between the middle. I will not go down The Mall.“I think things are bleak for a lot of people and I think the royal family is, like, kind of pretty much the same as Love Island or (The) X Factor. They’re kind of the opium of the masses, just keeping people quiet, I think.“This is England and that’s the way it is, what can I do about it? I just can rail against it every now and then.”Matlock has been touring as new wave band Blondie’s bassist and released his latest album Consequences Coming in April.He said: “(Blondie) have a great body of work, they’re interesting.“Chris Stein – who isn’t touring any more, but was one of the founding members – he doesn’t describe them as a pop group, he calls them an art project, and I can see what he means.",
        "“They’ve always kind of pushed the envelope for their particular idiom.”"
    ]
}