{
    "articleURL": "/wires/reuters/article-12046577/SCO-foreign-ministers-gather-India-regional-security.html",
    "content": [
        "By Krishn Kaushik",
        "GOA, India, May 4 (Reuters) - Foreign ministers of the Shanghai Cooperation Organisation (SCO) gathered in India on Thursday to discuss regional security matters, including adding Iran and Belarus to a union of nations seen as a counterweight to Western influence in Eurasia.The SCO is a political and security union of countries spanning much of Eurasia, including China, India and Russia. Formed in 2001 by Russia, China and ex-Soviet states in Central Asia, the body has been expanded to include India and Pakistan.The expansion of the group to include Iran and Belarus was one of the main items on the agenda of the one-day meeting to be held in the Indian coastal resort state of Goa on Friday, an Indian foreign ministry official said.The foreign ministers, including Russia's Sergei Lavrov and China's Qin Gang, will prepare the ground for an SCO summit in India in July that Russian President Vladimir Putin and Chinese counterpart Xi Jinping are expected to attend in person.Iran and Belarus are expected to be inducted into the SCO at the New Delhi summit, an Indian foreign ministry official said. Kuwait, Myanmar, the United Arab Emirates and Maldives are likely to be included as dialogue partners, he added.Pakistan's Bilawal Bhutto-Zardari was also on hand for Friday's foreign ministers' gathering, the first senior Pakistani leader to visit India in nine years amid longstanding tensions between the large, nuclear-armed South Asian rivals.",
        "However, there are no plans for Bhutto-Zardari to meet Indian Foreign Minister Subrahmanyam Jaishankar separately and his visit was not expected to lead to a breakthrough in strained Indian-Pakistani relations.\"During my visit, which is focused exclusively on the SCO, I look forward to constructive discussions with my counterparts from friendly countries,\" Bhutto-Zardari tweeted before arriving in Goa.Relations between India and Pakistan have been fraught for decades and they have fought three wars, two of them over the Muslim-majority Himalayan region of Kashmir, which they both claim in full but rule in part.India, which holds the chair of both the G20 major economies and the SCO this year, is treading a diplomatic tightrope as it faces Western criticism of its growing trade with Russia, which invaded Ukraine last year, amid its own tensions with China. (Reporting by Krishn Kaushik in Goa; editing by YP Rajesh and Mark Heinrich)"
    ]
}