{
    "articleURL": "/money/beatthescammers/article-12046203/Major-bank-calls-Meta-huge-rise-scams-platforms.html",
    "content": [
        "TSB calls on Meta to take responsibility as new data lays bare extent of fraud Scams taking place through Meta-owned platforms make up 80% of fraud casesThe number of Whatsapp scams has jumped 300% in one year A major bank has called on Meta to do more about the fraud proliferating on its platforms, including Whatsapp, as it lays bare the scale of social media scams.",
        "TSB has slammed Meta as it revealed scams taking place through its companies account for 80 per cent of fraud cases at the bank within its top three fraud categories.TSB, which has 5million customers in the UK, has warned consumers to be cautious of fraud taking place through Facebook, Whatsapp and Instagram.Banks have long warned of the dangers of social media scams, but TSB is one of the first to break cover and directly call on Meta to clean up its act.",
        "Paul Davis, director of fraud prevention at TSB, told This is Money: 'Social media companies must urgently clean up their platforms to protect the countless innocent people who use their services every day.'Facebook Marketplace has been the biggest hotbeds of frauds, accounting for three fifths of purchase fraud cases, followed by Instagram which makes up 18 per cent of cases.Facebook Marketplace has exploded in popularity in recent years. Sellers list goods and arrange a sale with potential buyers through Facebook's built-in messaging platform.Originally, buyers could look at what someone in their area was selling and hand over cash on the doorstep without fees. This was especially useful for bulkier items like furniture.But as its popularity has grown, more and more items are being sold over a wider distance and items are usually sent out.",
        "Unlike other platforms like eBay and Amazon, Facebook doesn't have its own payment platform, which means shoppers are often using bank transfers to send money directly.This leaves them without protections offered by PayPal or credit and debit cards, where payments can be reversed if goods and services are not delivered as advertised.As more consumers turn to Facebook to buy goods secondhand to save cash in the cost-of-living crisis, the amount of fraud happening on the platform continues to rise.TSB said scam activity on Facebook Marketplace had risen 97 per cent in one year and had refunded over 2,000 cases from Facebook alone.In November last year, we revealed how bank bosses were labelling Facebook Marketplace as the Wild West of fraud.  &gt; Get the latest news on the scams doing the rounds and advice on how to beat them in our special Beat the Scammers section.Number of 'Mum and Dad Whatsapp' scams soarAnother scam that has claimed thousands of victims has been the so-called impersonation scam.This is when a fraudster contacts you to be from your bank, the police or another trusted organisation to convince you to send them money.The criminals often use a tactic called 'spoofing' to make their call or text appear genuine by cloning the number or sender ID.",
        "The 'Mum and Dad' Whatsapp scam has been another popular trick used by scammers, in which scammers pose as the victim's son or daughter, asking for money urgently. Last year, This Is Money reported Moira Spearman's story. Moira, 71, received a message from an unknown number, claiming to be her daughter having broken her phone.At the time, Moira had never heard of the 'Mum and Dad' scam and transferred £719 to a bank account thinking it would be used by her daughter to pay bills.It was only when she was asked for a second payment of £820 that she realised she had been tricked. TSB's figures show this type of fraud taking place on Meta's platforms make up 86 per cent of all impersonation fraud cases over the year.Fraud conducted on Whatsapp accounted for two thirds of cases, marking a 300 per cent rise in just a year, with over 550 cases refunded by the bank.Nationwide Building Society said it had seen more Whatsapp scams in recent years, and scammers were targeting older consumers. The average age of victims is 65.Santander has also seen a marked rise in impersonation scams this year, with fraudsters even trying to impersonate their head of fraud risk management Chris Ainsley.",
        "'Scammers leave no stone unturned in tricking victims, and as somebody working with colleagues across Santander to protect customers from fraud, it was quite a surprise to discover scammers impersonating me,' he said.'Imitation is certainly not a form of flattery in this case, but instead a timely reminder that nobody from a bank or legitimate organisation would ever attempt to rush you into transferring funds into another account.'Santander's data shows £10.2million worth of impersonation scams happened between January and March this year, up 11 per cent from the same period last yar. The average reported loss per customer was £6,906.One banking insider told This Is Money that Whatsapp scams far outnumbered fraud on any other platform.While Instagram has lower levels of purchase and impersonation fraud cases, it has been the go-to place for investment scams.Scammers often promise life-changing returns via their get rich quick schemes on Instagram, and TSB says these now make up 59 per cent of all investment fraud cases.Banks call on Meta to take responsibility TSB says it has refunded 97 per cent of cases - but that is not the case at all major banks, with some refunding at a far lower level than this. Banks believe Meta and other platforms need to take more responsibility.Jim Winters, director of economic crime at Nationwide said: 'The exponential rise of social media has brought with it an increased risk of fraud and scams. ",
        "'Controls are yet to catch up with other industries, allowing criminals to all but freely target victims on platforms such as Marketplace and Whatsapp in particular.'We need to collectively address this issue to avoid the problem growing and more victims needlessly losing money. 'To do that we need to a joint approach whereby social media platforms, including Meta, work with telecoms, financial services and government to stop fraud at the outset - not just after the criminals have struck.'Santander echoed the sentiment, claiming 70 per cent of APP fraud originated on big tech and social media platforms.A spokesman said: 'Making it harder for fraudsters to target consumers on these platforms will be essential to stopping them at source.''At present banks are solely responsible for reimbursement when customers unfortunately become victims of scams, but it is vital that all sectors are incentivised to invest in prevention.'Meta recently launched a scams awareness campaign by Whatsapp and the National Trading Standards, although this will be of little comfort to those who have been scammed out of thousands already.A Meta spokesman said: 'This is an industry-wide issue and scammers are using increasingly sophisticated methods to defraud people in a range of ways including email, SMS and offline.'We don't want anyone to fall victim to these criminals which is why our platforms have systems to block scams, financial services advertisers now have to be FCA authorised and we run consumer awareness campaigns on how to spot fraudulent behaviour. ",
        "'People can also report this content in a few simple clicks and we work with the police to support their investigations.'Earlier in the week, the Government announced tougher measures to crackdown on fraud.  ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}