{
    "articleURL": "/tvshowbiz/article-12059899/Julia-Fox-apologizes-fan-not-taking-photo-trying-catch-flight-Los-Angeles.html",
    "content": [
        "Julia Fox kept her look low key but stylish as she arrived at Los Angeles International Airport Sunday.  ",
        "The actress, 33, who slammed the Met Gala for honoring controversial designer Karl Lagerfeld, stepped out in gray yoga pants and a black T-shirt.She wore a green leather jacket for warmth against the chilly night temperatures. The Uncut Gems actress appeared makeup free, showcasing her smooth complexion. She styled her dark hair in a high bun, and wore sunglasses to maintain her privacy.Fox then went on social media to tell fans she is visiting Los Angeles for an 'important meeting.'",
        "As the influencer rushed to make her flight in New York, Julia apologized to a fan in a video posted on her Instagram Stories before she boarded her flight. 'There was a girl in terminal one who asked to take a photo with me and I had to say \"no\" because my driver dropped me off at the wrong terminal. 'It wouldn't have been a big deal, but I was checking a bag,' explaining she was about to miss the cut-off time for doing so.'I have a really important meeting in LA at noon,' she explained, 'and this was the last flight out to LA.'I had to say \"no\" and I'm so sorry, like, I've been thinking about it ever since, okay?''So, I just need to get this off my chest,' she continued walking through the facility.",
        "'I love you, I'm so sorry, and if it's any consolation, I made it to the counter with one minute to spare, so if I had stopped to take the photo, I would have missed the f**king tram and then, there goes my whole life. I love you and I'm sure we will cross paths again.'Julia didn't hint at the nature of the important project, but she was spotted arriving safely in Los Angeles, with her checked bag.",
        "In a February interview on the Good Children podcast to promote her book Down the Drain, in which she details her own journey from being a childhood outcast to a fashion icon and cultural influencer.She detailed being sent to Italy for school after acting out in middle school put her in a pipeline to for one of New York's rougher high schools. 'I'm really happy I went, because I did get a really good education and I was exposed to just exposed to such a beautiful culture and... good taste and good food.'The cover model who is known around the world claimed she doesn't identify as a celebrity.'This was all very accidental,' she said, revealing she didn't set out to be famous.'This life chose me. I'm just showing up for it at the best of my abilities, but at the end of the day, I'm just an artist and I've always been.",
        "I'm performative but I'm very artistic as well and I love to write and I can act and I can pretty much to anything... if I set my mind to it.'I believe, as cheesy as it is, if you believe in yourself, it becomes true.' "
    ]
}