{
    "articleURL": "/news/article-12050839/Furry-friends-don-Union-Jack-bandanas-ribbons-mini-crowns-celebration-King-Charles.html",
    "content": [
        "Four-legged friends are dressed like Royals ahead of King Charles' CoronationDogs wearing Union Jacks and crown-wearing cats have been photographed Meanwhile, a town in Gloucestershire will crown their own 'Coronation Chicken' Do YOU have pictures of patriotic pets? Email lauren.haughey@mailonline.co.uk Four-legged friends across Britain have put their best paws forward and donned patriotic bandanas, ribbons and even crowns as the country counts down to King Charles' Coronation.",
        "From crown-wearing cats to Coronation chickens, Brits are going above and beyond to prove their pet is the most patriotic.Gus, a gorgeous miniature wire haired dachshund living in Battersea, looked regal in his crown and gold ribbon for the Coronation while Teddy the King Charles Cavalier Spaniel wore a noble 'God Save The King' bib against a backdrop of Union Jack flags. Meanwhile, Clementine the fuzzy sphynx looked as pretty as a Princess, wearing a sequined rainbow crown and multi-coloured vest.And the Forest of Dean in Gloucestershire will see around 40 King Charles Spaniels take part in a procession tomorrow - and crown a 'Coronation Chicken', gathering all owners to explain in 50 words why their bird deserves the title.The majestically dressed animals are popping up with less than 24 hours to go until His Majesty's Coronation, with thousands flocking to London and throwing street parties to celebrate.Do YOU have pictures of patriotic pets? Email lauren.haughey@mailonline.co.uk ",
        "Even guinea pigs at the Primrose Piggies Rescue in Bedfordshire were seen to be celebrating, with bunting hung all around their enclosure.'The piggies have their bunting up. Have a lovely Coronation/bank holiday weekend,' a Twitter user wrote. While Brits make a last-minute scramble to throw Coronation parties all over the country, a rescue centre in Cardiff also held one for furry friends.",
        "Earlier this week, Sky News reported that The Rescue Dog Hotel laid out some dog-friendly toys in a royal-themed picnic.It comes after King Charles welcomed his rescued Jack Russell Terriers, Beth and Bluebell, into Buckingham Palace. Late Queen Elizabeth also loved dogs, with her Corgis Muick and Sandy at her deathbed on September 8, according to Palace sources.Her love for dogs stemmed all the way back to childhood, owning her first pet at just seven years old.   'It's amazing that King Charles III has made history by welcoming the first shelter dogs to live in Buckingham Palace and we hope this inspires more prospective pet owners to consider adoption themselves,' Director and trustee of The Rescue Dog Hotel, Toria Acreman told the publication. ",
        "Meanwhile, the town of Forest of Dean in Gloucestershire will see around 40 King Charles Spaniels take part in a procession.While the breed's name is well-fitted for the Coronation, it is actually derived from King Charles II who was said to have taken his spaniels everywhere during the 1600s.  Tomorrow the town will crown a 'Coronation Chicken' too, gathering all owners to explain in 50 words why their bird deserves the title.Event organiser Nikki Norman told ITVX: 'Cinderford crowned a sheep for the 1977 Jubilee so we decided to have a Coronation chicken.",
        "'It's just a bit of fun, a gimmick, but since we announced it things have gone a bit mad.'In Sussex's Drusillas Park, animal-friendly cream teas were even fed to red pandas, lemurs, capybaras, meerkats, and donkeys.Senior keeper, Jacinta Dawe, said: 'We are all so excited to celebrate the coronation this weekend and lots of the team have plans with family - our animals here are family to us so we wanted to make sure they didn't miss out!'We introduce our animals to various enrichment activities every day to keep them happy and stimulated, and to encourage them to work for their food, practice problem solving, explore puzzles, or investigate new scents. These activities help to encourage them to display natural behaviours and keep their minds active.'The cream teas are of course fun for us to see, but also present food in a new way for them all, so they had to investigate, explore, and seek out their food, much like the effect of giving your dog a treat ball or a snuffle mat.'",
        "A dog groomers in North Shields has also decorated its shop ahead of the big day.Pooches will have the chance to be snapped in Hair of the Dog's photo booth wearing a crown, ChronicleLive has reported.",
        "Owner Catherine Shield told the publication: 'What has been really interesting is we have been inundated with lots of people who own King Charles Cavalier Spaniels which has been a really nice other theme.'It has been perfect for us as we have been able to take lots of pictures and put them on our social media Facebook and Instagram. It is another special way of celebrating the Coronation which is really nice.' Cocker Spaniels are a known favourite of the Prince and Princess of Wales, according to vet nurse Shauna Walsh at PDSA.Princess Beatrice and Princess Eugenie are also said to be fond of Norfolk Terriers too, having owned many over the years.The Coronation will take place at 1pm on Saturday May 6. "
    ]
}