{
    "articleURL": "/wires/reuters/article-12039211/Soccer-Wrexham-paint-town-red-open-bus-parade-promotion-EFL.html",
    "content": [
        "May 2 (Reuters) - Wrexham's Hollywood owners Ryan Reynolds and Rob McElhenney ditched the star-studded Met Gala to join the Welsh soccer club's open-top bus victory parade on Tuesday as they celebrated promotion to the English Football League.",
        "Wrexham last month secured a fairytale return to the EFL following a 15-year absence by beating Boreham Wood 3-1 to win the National League with a game to spare, and ended the season with a record 111 points.The Hollywood glitz has made Wrexham's promotion one of the most unlikely and heart-warming stories for many seasons.Thousands of people gathered on Tuesday as the 159-year-old club's fans filled the streets with red and white smoke.The size of the crowd meant the bus route had to be changed and the parade was extended before finishing at the club's Racecourse Ground later than scheduled.Since being taken over by Reynolds and McElhenney in November 2020, Wrexham have become a club with global appeal, gaining international interest and new fans across the world.Humphrey Ker, Wrexham's executive director, said the scenes proved again why the Hollywood pair took over the club, seeing a place with an incredible legacy and potential.\"And if you can activate both of those things, you get what you have today - crowds of people coming out to celebrate a historic championship in terms of points numbers, but also, in terms of restoring what we now belong to,\" he told the BBC.The Welsh outfit were the first minor league side to feature on the hugely-popular FIFA video game in the 'rest of the world' category, while a Disney docu-series \"Welcome to Wrexham\" that followed the club's journey under the new owners was released.",
        "The club also attracted the attention of American tourists in Wales, with celebrities such as Will Ferrell and Hugh Jackman also turning up at games to show their support.Wrexham said Tuesday's parade was also to celebrate the achievements of their women's team, who won promotion to the Adran Premier, the highest league in the women's game in Wales. (Reporting by Manasi Pathak in Bengaluru, additional reporting by Tommy Lund in Gdansk; Editing by Christian Radnedge and Ken Ferris)"
    ]
}