{
    "articleURL": "/news/article-12053963/Villagers-Vanuatu-tribe-worship-Prince-Philip-god-celebrate-Charles-Coronation.html",
    "content": [
        "Nations across numerous continents streamed King Charles' Coronation todayOthers lit up local landmarks in Britain's national colours of red, white and blueMeanwhile, tribespeople in Vanuatu declared Charles 'son of our power' Coronation fever has swept all over the world today, as thousands have gone above and beyond to celebrate the crowning of King Charles. ",
        "From the Prince Philip-worshipping island of Vanuatu, to the bustling Croatian city of Osijek, royalists are paying a variety of touching tributes to His Majesty.It comes as King Charles pledged his faith to Britain in a historic ceremony, surrounded by the Prince and Princess of Wales, Prince Harry and numerous other Royal Family members.Nations across numerous continents were seen to stream the landmark event too, with crowds gathering in the Philippines and the United Arab Emirates to watch the spectacle on huge screens.On the island of Vanuatu, one tribe declared Charles as the 'son of our power', as they celebrated his crowning after being presented with his portrait. ",
        "The Kastom people around the villages of Yaohnanen and Yakel, on Tanna, Vanuatu, have also long believed that the late Duke of Edinburgh was the son of a mountain spirit. The communal belief has stemmed out of ancient legend, which says that the spirit's son travelled overseas to a distant land where he married a powerful woman, before returning home.This theory strengthened when Philip visited the remote island in 1974, and Charles has since met the villagers during a 2018 tour of the South Pacific island.As they celebrate Charles' coronation today, villagers from Iaohnanen and Yakel on received a portrait from Britain's Acting High Commissioner Michael Watters.",
        "Ahead of the ceremony in Westminster Abbey, Chief Johnson Iakapass said islanders would celebrate the new King with a flag-raising ceremony.They also planned to take part in celebrations involving ceremonial dances and lots of kava, a traditional drink in a yellow coconut shell.'It will be a big celebration. We're talking about 5,000 to 6,000 people gathering together to celebrate the crowning of this king,' the Chief told ABC.'This person is really meaningful to the people of Tanna.",
        "'It's another thing that will bring back the history of England and Tanna and keep remembering the friendship on this island.'According to Kirk Huffman, an expert on Vanuatu and authority on what is known as the Prince Philip Movement, the tribespeople likely switched their focus to King Charles following the death of Prince Philip and Queen Elizabeth II.Mr Huffman told The Mirror: 'The movement has nothing to do with \"worshipping a white man\", as they believe that the Duke of Edinburgh was originally from their island (not from anywhere in Europe or other 'remote areas' like that).'Interest there may now eventually focus on King Charles (as the son of their god/spirit/guardian/power).The 400-strong community believe that after his death, Philip's spirit will return home to their island, and will bring peace and harmony to the world. ",
        "'People may say that we're crazy,' said one villager. 'But that makes me believe he'll come home even more,' he told Channel 4's Meet The Natives.The tribe believe that Tanna and England were once the same island. 'When they broke apart, things started to go wrong for you on the other side of the world,' explains one tribesman. 'So our God of the volcano sent his son on a special mission to try to help you in England. 'You, the people of England, have always been told that Prince Philip was born in Greece, then he came to your country to join the navy where he met your young Queen.' 'But we believe that Prince Philip is a spirit, born in Tanna, who was sent to England to bring peace, unity and harmony to the world.'  ",
        "'All happiness comes from Him,' says one tribe member, while another enthuses: 'I love Him so much...I pray for my life to connect to His.'A third added: 'He's the spirit and he's the son of our god. Everyone believes in him and his name is Prince Philip.'In 2007, five of the tribe members were invited to travel to England to meet Prince Philip as part of Channel 4 documentary, 'Meet the natives.'  ",
        "The tribesmen and women on the South Pacific island of Tanna in Vanuatu mourned Prince Philip through dancing, speeches and the ceremonial drinking of the native plant kava, according to an expert on the culture.The group - who believe Prince Philip is their god and the incarnation of a volcano spirit - was also expected to anoint his son Prince Charles as his successor.Australian Museum research associate Kirk Huffman is considered an authority on what is known as the Prince Philip Movement - a group based in villages in the south-western part of the island of Tanna in southern Vanuatu.He said followers all speak a language called Navhaal - which is only spoken by approximately 4,500 people worldwide - just a few hundred people are associated with the Philip Movement.He said at the time: 'Those in the movement have been very saddened to hear about his death.'As soon as the messages about his death came they had meetings.'They got leaders, important people from two, possibly three different factions of the group together at a meeting to sort out how they're going to deal with the funerary situation.'They held funerary speeches last weekend. There may be special dances.'Dancing there is a highly-respected form of saying something powerful, and there may be some that have already gone on.'There may be a periodic display of some of the movement's Prince Philip memorabilia - photographs, letters, that sort of thing. There'll also be more periodic speeches by various traditional leaders there.'However, possibly the most important element of the funerary rituals was evening sessions of the men of the group drinking kava - an infusion made from the root of a pepper plant.Mr Huffman described the drinking of kava as a 'sacred activity', which is the 'liquid key that opens the door between the material world and the non-material world'.He said: 'Through the medium of kava, one can pass messages back and forth between those worlds.'Traditionally, the purpose of drinking kava is to ensure the continuity of life as it should be.'Through the use of kava, you can get better rain, better sun, better crop fertility, all sorts of things. Because you put these requests into the world through the kava.'There'll be that same sort of thing in Tanna for Philip's spirit. There'll be messages and ideas being sent and received, that will be very important.'Mr Huffman explained that, in traditional religions throughout the region of Melanesia - which consists of Vanuatu, Fiji, the Solomon Islands and Papua New Guinea - death is merely considered the end of someone's physical form, with their spiritual form persisting.He continued: 'Your spirit form can recycle. You can be reincarnated. It can wander around, it can come out years later in another person.'So from the point of view of the people of the movement, (Philip) is originally from Tanna.'",
        "During the trip, they took the opportunity to deliver a special message to the Duke of Edinburgh - with the chiefs wanting to know if the pawpaw was ripe yet or not - which was their way of knowing whether Prince Philip's spirit was ready to return home to the island. 'My heart rejoices that He is returning to Tanna,' exclaimed one,' while another explains: 'The prophecy states that when Prince Philip's work is over in England, He will come back to Tanna. The fish will leap from the sea, the harvest will never fail and we will all live forever.' 'These days we have plenty of food and our life is good. 'Why then do we really need Prince Philip?' asks one person, to which another replies: 'The goodness we are experiencing is a gift from someone else and that someone who is greater than all of us, is Prince Philip. 'That's the story we are delivering to the people everywhere. He is the ending of the story and only He has the final word.'A further member of the tribe can then be seen heading deep into the forest and says: 'Here we grow the sacred yam plant that we worship. 'Every year we plant new yams which grow new shoots that keep Prince Philip's spirit alive. ",
        "This yam propagates the next one, which then produces new yams. Meaning that He can never really die because the yam spirit is eternal.'  It is the tribe's belief that Prince Philip and the yam plant are one defined being which 'keeps all of us alive.'During the pilgrimage, the tribe pass through the mountains where they believe the spirit of Prince Philip was born before he left for the coast.At last they arrive at the coast where Prince Philip left for England to marry the Queen - it's also where he's said to have returned some 50 years later.Now, many years later, the human form of Prince Philip has died, and the tribe believe he has finally sent them his sign.'This is the pawpaw I asked about in the castle,' explains the tribesman, cutting it from the plant. 'The one that Philip told me about. And now it is ripe!'Believing the time is right for the Duke of Edinburgh's spirit to return to Tanna, the five of them embark on a pilgrimage across their island in a bid to share the good news with everyone they meet. In the 1970s, the Royal Britannia was on the tour of the south pacific when it sailed past our island. ",
        "'Our grandfather saw Prince Philip on board, lit up by the sun. 'It was that moment which confirmed to us he really is defined.'A tribesmen who witnessed it happen, explains: 'My father, Kehma, told me His kava here. Philip's ship was due to pass our island. 'Dad said He will come here to drink kava at night. As I prepared the kava, Prince Philip shone a search light from His ship.His spirit came ashore, drank the kava and went back to His ship. So He drank the kava and left!' However, during their pilgrimage, the tribe are met with some resistance from those who have abandoned the traditional ways, many of the villagers still live the 'kustom' way of life, actively rejecting Western lifestyles and Christianity, and continue to worship their Gods.  Keen to share one message with those who no longer believers, a member of the tribe explains: 'Recently, Prince Charles visited our islands. 'The High Commissioner contacted me from the Embassy. He said it's vital Charles meets us five ambassadors who met his Father in England. 'I was already in Port Vila, so I went to give Prince Charles a message on behalf of us all.'He continues: 'On his arrival he shook hands with me and I told him that we are giving you this rod and telling you that the chiefs who foretold your Father's prophecy are dead. ",
        "He shook my hand and said: 'Thank you. I almost missed what I came for. It's a special mission isn't it.'''Charles accepted from me the story about his Father. He will keep our faith alive. Prince Charles.' In Australia, a group of Indigenous men performed a prestigious smoking ceremony to mark King Charles' Coronation day.The traditionally dressed men were captured proudly kneeling before a portrait of the new King as a brass band played behind them.This event took place at a tree-planting event hosted by the Government House in Sydney, with Australia remaining to be one of the 54 countries in the Commonwealth. On the other side of the world in Chiang Mai, Thailand, crowds proudly waved Union Jack flags outside a hotel in the country's northern region.Others nearby appeared to have organised a festival celebrating Charles' big day too, brimming with food, music and activities. Similar festivities took place in Yaounde, Cameroon, with familiar red, white and blue decor laid out on the grass amidst the royal ceremony. ",
        "Meanwhile, numerous countries streamed the ceremony on huge screens, with crowds gathering to watch at bunting-filled bars in the United Arab Emirates (UAE) and mass-scale picnics in the Philippines.The British Embassy in the UAE tweeted: 'Our embassy staff and HM Ambassador took #watchpartygoals to the next level during the coronation ceremony! We had themed snacks, and fancy crowns. It was a blast celebrating together!'In the Philippines, another Twitter used added: 'The British Embassy is hosting a livestream picnic at Quezon Memorial Circle with different booths.'Canada, France, Germany, and South Africa are among other countries believed to be watching the Coronation today, with coverage running on a number of TV networks. Other countries, such as Croatia and Madagascar also lit up local landmarks with Britain's national colours in the midst of the unforgettable event.Osijek's major pedestrian bridge was lit up in one of Croatia's largest cities, while Antananarivo's town hall shone a bright shade of blue in Madagascar."
    ]
}