{
    "articleURL": "/wires/pa/article-12052963/Services-promise-spectacular-coronation-display-9-000-personnel-part.html",
    "content": [
        "The nation’s armed forces have promised a “spectacular” display of military pomp and pageantry when the King and Queen travel by carriage through the streets of the capital on coronation day.",
        "The event is the military’s largest ceremonial operation since Queen Elizabeth II’s 1953 coronation, with 9,000 servicemen and women deployed and 7,000 of these performing ceremonial and supporting roles.When the newly crowned Charles and Camilla ride in the Gold State Coach back to Buckingham Palace, their coronation procession featuring 4,000 ceremonial troops will stretch for a mile.Six months of planning followed by extensive rehearsals have laid the groundwork for the military event which will also see a King’s Procession take the couple from Buckingham Palace to Westminster Abbey – featuring a Sovereign’s Escort of about 200 troops.",
        "A Ministry of Defence (MoD) spokesperson said: “It will be spectacular and with the precision and detail you would expect, we have taken key lessons and best bits from previous coronations, the Platinum Jubilee, Her Late Majesty’s funeral and added them to our plan.”The route the monarch and his consort will follow – The Mall, Admiralty Arch, Trafalgar Square, Whitehall and Parliament Square – will be lined by more than 1,000 servicemen and women spaced at intervals of five paces.Guardsmen, in their distinctive scarlet tunics and bearskins, will line The Mall, the Royal Navy and Royal Marines will take up positions at Admiralty Arch and Trafalgar Square – the site of Nelson’s Column, the monument to Lord Nelson the nation’s greatest sailor.",
        "In Whitehall, the uniformed civilian services: police, fire and others, will line the route and the RAF will be in place from the Cenotaph to the Abbey.",
        "A tri-service Guard of Honour of nine officers and 159 other ranks will be stationed outside the palace gates and will give a royal salute when the Diamond Jubilee Coach sets off for the Abbey, and a military band will play the national anthem.The 33-minute journey will begin at 10.20am and the Sovereign’s Escort will be led by the Household Cavalry Mounted Regiment band, 48 horses and musicians with their two drum horse, Atlas and Apollo, at the front.Following will be four mounted divisions from the Household Cavalry, with the King’s coach in the middle, two from the Blues and Royals taking the lead, the Life Guards behind the carriage and farriers carrying their axes at the rear.The return coronation procession will form up while the King and Queen are crowned, with the front at the top of The Mall while the rear will be at the Abbey.Lieutenant Colonel James Shaw, Grenadier Guards, Brigade Major of the Household Division, will lead the huge mass of troops, divided into eight groups and supported by 19 military bands with 1,000 musicians.",
        "The signal to “step off” will be given at about 1pm by Garrison Sergeant Major, Warrant Officer (Class 1) Vern Stokes, who helped devise the procession and gave the same order to start Queen Elizabeth’s funeral procession.",
        "He will say: “The coronation procession, by the centre, quick march”.The Household Cavalry Mounted Band and the King’s Troop Royal Horse Artillery will lead the procession, followed by about 400 service personnel from Commonwealth Armed Forces, flanked by 114 Guardsmen of the Household Division carrying realm and Commonwealth flags.They will be followed by a detachment from the Royal Air Force, three from the British Army and a final one from the Royal Navy.The Gold State Coach carrying the King and Queen will be in the middle of a household procession of Household Cavalry troopers from the Blues and Royals and Life Guards on horseback, who form the Sovereign’s Escort, and Guardsmen of the Household Division.Historically, household troops guarded the sovereign and they still perform the role today and will be joined by 18 representatives of countries where Charles is King, who will flank the carriage.The Princess Royal, who is gold stick and Colonel of the Blues and Royals, will ride behind the King’s carriage, while the Prince and Princess of Wales and their children will travel behind in a carriage.Buckingham Palace will play host to the marching troops and musicians who will form up in the royal residence’s garden, and at 1.45pm the King and Queen will appear on the west terrace.",
        "Warrant Officer Stokes will order the troops to remove their headdresses and he is expect to ask for “three cheers” for the King."
    ]
}