{
    "articleURL": "/wires/afp/article-12040389/Dead-rivers-flaming-lakes-Indias-sewage-failure.html",
    "content": [
        "Mohammed Azhar holds his baby niece next to a storm drain full of plastic and stinking black sludge, testament to India's failure to treat nearly two-thirds of its urban sewage.",
        "\"We stay inside our homes. We fall sick if we go out,\" the 21-year-old told AFP in the Delhi neighbourhood of Seelampur, where open gutters packed with plastic and sickly greyish water flow alongside the narrow lanes.\"It stinks. It attracts mosquitoes. We catch diseases and the kids keep falling sick,\" he added. \"There is no one to clean the filth.\"India at the end of April was projected to have overtaken China as the world's most populous country, according to the United Nations, with almost 1.43 billion people.Its urban population is predicted to explode in the coming decades, with over 270 million more people forecast to live in its cities by 2040.But of the 72 billion litres of sewage currently generated in urban centres every day, 45 billion litres -- enough to fill 18,000 Olympic-sized swimming pools -- aren't treated, according to government figures for 2020-21.India's sewerage system does not connect to about two-thirds of its urban homes, according to the National Faecal Sludge and Septage Management Alliance (NFSSM).Many of the sewage treatment plants in operation don't comply with standards -- including 26 out of Delhi's 35 facilities, according to media reports.Coupled with huge volumes of industrial effluent, the sewage is causing disease, polluting India's waterways, killing wildlife and seeping into groundwater.",
        "- Ecologically dead -",
        "Although India has made major progress in reducing child mortality, diarrhoea -- caused mostly by contaminated water and food -- remains a leading killer.More than 55,000 children under five died of diarrhoea across India in 2019, according to a study published last year in the scientific journal BMC Public Health.The Yamuna in Delhi is one of the world's filthiest rivers and is considered ecologically dead in places, although people still wash clothes and take ritual baths in it.It often billows with white foam, and facilities processing drinking water from the river for Delhi's 20 million people regularly shut down because of dangerous ammonia levels.Despite some bright spots, as well as efforts to plant more trees alongside rivers, the situation elsewhere is often no better in big cities including Mumbai and Chennai.In Bengaluru, massive Bellandur Lake has on occasion caught fire when methane, generated by bacteria feasting on sewage in the oxygen-depleted water, ignited.- 'Water crisis' -",
        "Mridula Ramesh, author of a book about India's water woes who lives in a \"nearly\" net-zero-waste home, said properly treating sewage into useable water would help solve the crisis.According to the World Bank, India is one of the most \"water-stressed\" countries in the world, with plummeting water tables and increasingly erratic monsoon rains.",
        "Chennai nearly ran out of water briefly in 2019, and other cities may see similar calamities in the coming years due to excessive groundwater pumping and rainfall volatility.\"India is headed for a water crisis. Sewage can so easily be co-opted to fight that and help us to a very large extent solve the problem in our cities,\" Ramesh told AFP.This could be achieved with decentralised treatment plants partially funded by the private sector or non-governmental organisations, with some of the fully treated sewage reused or released into local lakes.\"India's water is so seasonal. Many cities in India get 50 rain days... but sewage is available every day because you go to the bathroom every day... It's such a powerful weapon,\" she said.For Khalil Ahmad, standing by the revolting open drain in Seelampur as flies buzz around, a solution can't come soon enough.\"Children keep falling sick... If they don't get treatment and medicine, the children will die,\" he told AFP."
    ]
}