{
    "articleURL": "/wires/reuters/article-12051787/Soccer-Messi-apologises-PSG-Saudi-trip.html",
    "content": [
        "May 5 (Reuters) - Lionel Messi apologised to Paris St Germain and his team mates on Friday after being suspended for making a trip to Saudi Arabia earlier this week and missing a training session as a result.",
        "French media reported that Messi was suspended for two weeks after an unauthorised trip to Saudi Arabia when he was supposed to train with the squad the day after the Ligue 1 leaders' 3-1 defeat at home to Lorient on Sunday.\"I sincerely believed that I would have the day off after the game as had been happening in previous weeks. I had this trip organised and I couldn't cancel it, I had already cancelled it before,\" Messi said in a video on Instagram.\"I apologise to my team mates and I'm waiting for what the club wants to do with me,\" added the Argentina forward.PSG boss Christophe Galtier said earlier on Friday that he had nothing to do with the club's decision to suspend Messi, who is set to miss the next two matches at Troyes and home to Ajaccio as they look to keep their Ligue 1 lead intact.\"We'll see when Leo returns, we'll see what happens. Obviously there will be discussions with the entire club, but also with Leo,\" Galtier had said at a press conference.PSG are five points clear of Olympique de Marseille with five matches left in the season.Messi has received a formal offer to join Saudi Arabian club Al-Hilal next season, a source close to Argentina's captain told",
        "Reuters, with a contract renewal at PSG not on the cards for the World Cup winner who turns 36 next month.The oil-rich nation appointed Messi its tourism ambassador last year and he visited Jeddah in May 2022.He returned in January to play a friendly match with PSG against a team of Saudi League stars, when he faced great rival Cristiano Ronaldo.Al Hilal coachRamon Diaz, however, refused to be drawn on claims the Saudi club are attempting to sign Messi as they are focused on their clash with Urawa Red Diamonds in the second leg of the Asian Champions League final. (Reporting by Rohith Nair in Bengaluru and Angelica Medina in Mexico City; Editing by Ken Ferris and Toby Davis)"
    ]
}