{
    "articleURL": "/tvshowbiz/article-12050619/Inside-Loose-Women-Denise-Welchs-Hollywood-connections.html",
    "content": [
        "She's a former Corrie star turned Loose Women panellist - but Denise Welch has proven to be very well connected in Hollywood with some rather unlikely pals.",
        "Her son Matt Healy, 33, - is the frontman in the band The 1975 - and he has introduced her to some of the biggest singers on the music scene - including Taylor Swift who he is reportedly now dating.Taylor and Matty's 'relationship' was revealed this week, soon after her split from her boyfriend of six years Joe Alwyn was announced. Back in January, Denise shared a cheeky selfie with Taylor while she was at the 02 to watch her son Matt, 33, perform with the band.Denise, 64, was backstage with Taylor after the singer made a surprise appearance on stage during the gig.Denise also recently stunned fans when she shared a video of herself giving a speech at Sir Michael Caine's 90th birthday dinner. She left Tom Cruise in stitches with a rude joke at her pal Michael's expense during the fun-filled evening which also saw David Walliams attend.While fans might be surprised by Denise's unlikely friendship with acting legend Sir Michael, the pair have been friend for years after her artist husband Lincoln Townley painted the actor's portrait in 2016. Lincoln has painted movie legends, including Al Pacino, Dame Judi Dench, Leonardo Di Caprio and Charlie Sheen. His painting of boxer Muhammad Ali sold for $623,000 in 2017. ",
        "Here we take a look at Denise's VERY A-list contact book and how she is networking her way through Hollywood. ",
        "Taylor Swift",
        "Back in January, Denise shared a cheeky selfie with Taylor Swift, while Florence and The Machine looked on amused in the background. The TV star was at the 02 to watch her son Matt, 33, perform with the band. Denise was backstage with Taylor after the singer made a surprise appearance on stage during the gig. Denise couldn't wipe the smile off her face as she posed with the hitmaker, posting a picture on Instagram, as well as a selfie with Charli XCX. ",
        "'Oh what a night at a sold out 02. So proud I can't even begin!!' Denise's post was captioned.Taylor performed chart-topper Anti-Hero for the first time during a surprise appearance at The 1975's London gig. Taylor walked onstage during the band's set to perform and also covered their 2013 song, The City. Matt, 33, previously revealed the band worked with Taylor on her latest album Midnights, but their tracks didn't make the cut.He told KROQ's Klein/Ally Show for Audacy's DTS Sound Space: 'We actually worked a bit on that but then the version of it never came out.'The star was then booed and he responded: 'That's not how it works. It was for reasons that are not to be criticised. She's amazing.'",
        "Taylor and The 1975 have been friends for years, with the songstress spotted at their concerts and sharing producer Jack Antonoff. Back in 2015, he was forced to deny the pair were dating after it was revealed they had exchanged numbers. 'It's fake. It's all bloody fake. It's a farce!' he said with animation.'Yeah, we met each other, we exchanged numbers in the same way that a lot of people in this kind of world do and we spoke occasionally.'Michael Caine ",
        "Back in March Sir Michael Caine celebrated his milestone year with an intimate dinner at London's River Cafe, with Tom Cruise who just days earlier chose to skip the 2023 Oscars ceremony, one of the VIP guests.In the clip posted to Instagram, Denise quipped: 'Only the other morning, [Michael's wife Shakira] said she heard a scream from downstairs, it was Michael shouting \"Shakira look, there's a parcel, my Olympic condoms have come.\"'He said \"I'm going to wear the gold ones tonight\", and she said \"why not wear the silver and c**e f**king second for a change\".'As the camera panned around, Tom appeared to be weeping with laughter as he sat beside Michael, who appeared amused as he enjoyed his glass of red wine.The clip was filmed by Denise's husband Lincoln, who could be heard telling another party-goer: 'I live with her.'",
        "In a caption alongside the video, Denise joked that it appeared Hollywood star Tom likes a rude joke just as much as her friend Michael does.",
        "She wrote: 'Such an honour to be asked by Shakira to say a few words at Sir Michael Caines' 90th birthday!!! He loves a dirty joke and so does @tomcruise it appears!!!! Great night and amazing company.'Denise's fans were delighted by the video, with one quipping: 'Tom Cruise skipping the Oscars to watch Denise perform stand up was not on my 2023 bingo card.'Michael and Shakira first came into Denise's life when the actor attended Lincoln's art exhibition at Somerset House back in June 2016.Sir Michael clearly had an affinity for Lincoln's work, and the pair conversed in the exhibition space with the latter later painting Sir Michael's portrait.Speaking exclusively to MailOnline previously, Denise quipped she and Michael's wife Shakira, 76, were planning on setting up a racy site to rival Only Fans that they would dub Only Nans.Denise said: 'Michael is a complete legend. I was very nervous of him when I first met him, he's a huge fan of my husband's work. I became very good friends with Shakira with his wife.'We see them as regularly as possible and I adore him - it's my favorite shot in the world when I get papped with Michael Caine because I feel so cool!",
        "'We don't seem to make movie stars like that anymore. He's just a legendary actor and he's just wonderful.' Jared Leto ",
        "Back in 2016, Denise was in California to show her support for her son and his band, The 1975.But the TV star couldn't help but that the opportunity to rub shoulders with some of the A-list partygoers at Coachella Valley Music and Arts Festival.The former Coronation Street actress was quick to share her joy as she got a snap with Jared Leto.The former Loose Women panellist posed with her arm around the Thirty Seconds to Mars musician with a large grin on her face. Her son could be seen on the large projector screen in the background as she captioned the snap saying: 'Me and my new best friend, @JaredLeto , watching Matty #Coachella2016 !!! xx'. Earlier in the day, she posted a collage of her experience on the first day of the festival saying: 'Well we survived our first Coachella!! Deserted by the kids after 3 minutes of course!!! xx'Kate Thornton  ",
        "Denise has close friendships with the Loose Women panel, particularly Kate Thornton. The actress has been a regular on the chat show since 2005, with Kate being a panellist on the show from 2009 - 2011. ",
        "The pair have kept up their friendship more than a decade on. Back in 2021, Denise wished Kate happy birthday on Instagram and wrote: 'Happy birthday to my gorgeous , loyal, talented, funny friend @thekatethornton. We love you very much and can’t wait to celebrate by me coming for a sleep over and you cooking for me!!! Love you.' "
    ]
}