{
    "articleURL": "/wires/ap/article-12047377/New-York-California-probing-workplace-discrimination-NFL.html",
    "content": [
        "NEW YORK (AP) - Prosecutors in New York and California launched an investigation of the NFL's workplace culture on Thursday, issuing subpoenas to executives of one of the world's richest sports league in search of documents related to an array of accusations that include racial discrimination and sexual harassment.",
        "New York Attorney General Letitia James and California Attorney General Rob Bonta, both Democrats, say they are not targeting any of the league's 32 teams that take up so much of the country's cultural space. Instead, their probe is focused on the league itself, specifically its corporate offices in New York and California.The investigation is in response to what Bonta called a \"robust public record\" that points to a \"disturbing and concerning set of allegations about gender and racial discrimination in the NFL.\" That includes lawsuits filed by former employees, congressional hearings last year into the workplace practices of the Washington Commanders and a 2022 New York Times article detailing allegations of gender discrimination by more than 30 former female NFL employees.\"No one is above the law,\" Bonta said in an interview with the Associated Press. \"We´re gonna get to the bottom of what´s happening and if there is discrimination occurring, we´re gonna make sure we address it and that the NFL is held accountable.\"The league said it would cooperate with the investigation but called the allegations \"entirely inconsistent with the NFL´s values and practices.\"\"The NFL offices are places where employees of all genders, races and backgrounds thrive. We do not tolerate discrimination in any form,\" league officials said in a statement.",
        "The NFL has faced investigations before, including an inquiry by the U.S. Drug Enforcement Administration into former players' claims that teams were mishandling prescription drugs. But the investigation announced Thursday appears to be the first of its kind for various workplace violations in the league's corporate office.The NFL is not a monolith, consisting of 32 teams with 32 different owners who are \"primarily responsible for steering their own ship,\" said Nellie Drew, director of the Center for the Advancement of Sport at the University of Buffalo School of Law. But an investigation of the league itself, depending on the results, could tarnish the entire brand - something that could impact sponsorships.\"It´s probably not what they want people talking about the week before the schedule drops,\" Drew said, referring to the NFL's plans to unveil the 2023 schedule next week, an event that often generates buzz about high-profile matchups and for the 2023 season and prompts speculation about the chances of success for each team.Complaints of race and sex discrimination have dogged the NFL and individual teams. The Washington Commanders, owner Dan Snyder, the NFL and Goodell were sued by the attorney general for the District of Columbia in November for colluding to deceive fans by lying about an inquiry into \"sexual misconduct and a persistently hostile work environment\" within the team.",
        "Fired Miami Dolphins coach Brian Flores filed a federal lawsuit against the NFL and three teams last year over alleged racist hiring practices for coaches and general managers, saying the league remains \"rife with racism.\"And a lawsuit filed earlier this year in Los Angeles Superior Court by Jennifer Love, a former director for NFL Enterprises, attributed her 2022 layoff to retaliation for her complaints of \"pervasive sexism\" and a \"boys´ club\" mentality.The NFL has said Flores´ claims are without merit. NFL spokesperson Alex Riethmiller said the league had no comment on Love´s lawsuit.Beyond the lawsuits, James and Bonta cited a 2022 New York Times story where more than 30 former female NFL employees described a sexist culture at the league. The women said the culture persisted despite promises of reform that Commissioner Roger Goodell made after the 2014 release of a video that showed Baltimore Ravens running back Ray Rice punching his fiancee.One former NFL executive, Theresa Locklear, who held the position of director of business intelligence and optimization, told the Times that after the Rice video became public, managers were told to speak to their staffs about the video and the league's response to it.Locklear said that when she met with her team, a male employee, Aaron Jones, argued that Rice´s fiancée was partly at fault because she had egged Rice on, and other men on the call seemed to agree.",
        "Jones told the Times that he had never spoken to Locklear about Rice and would never have argued that a woman was to blame for her assault._______Beam reported from Sacramento, California. Associated Press writers Rob Maaddi and Stephen Whyno contributed."
    ]
}