{
    "articleURL": "/wires/ap/article-12054657/Tips-surge-nurse-practitioner-charged-sex-crimes.html",
    "content": [
        "AMES, Iowa (AP) - More than 70 tips have poured in after an Iowa nurse practitioner who is accused of photographing a teen's genitals during an exam was arrested on sex crime charges, police say.",
        "Several districts and one university also have issued alerts that Carl Markley, 44, performed school physicals for their students, although none of the charges against him allege that crimes occurred during those exams.Markley, who is free on bond, is charged with sexual exploitation of a minor, pimping, prostitution and human trafficking. The charges were filed in two batches, and police in Ames arrested him the second time Monday.His attorney, Nicholas Arthur Sarcone, didn't immediately respond Saturday to a phone message and email from The Associated Press seeking comment.According to the affidavit, several electronic devices, a hidden camera clock and pen were seized from Markley´s residence. During examination of the seized devices, detectives located a commercial pornographic video depicting doctor models conducting sex acts with patient models in a clinical setting.Detectives also located multiple thumbnail images, including one of a teen boy with his genitals exposed, taken covertly in Markley´s clinic, the affidavit saysThe minor later said that he was 15 to 16 years old at the time and had been told by Markley that he needed the physical examination to work at Markley´s business, according to the affidavit. It says Markley touched the minor male´s genitals during the appointment with the intent of the act being recorded so it could be viewed later \"for purposes of arousal or sexual gratification.\"",
        "Markley´s search history also showed searches on \"tween porn sites.\"Another criminal complaint alleges that Markley paid for sex at a local motel and at an apartment complex he owns.WHO-TV reports that police believe the allegations against Markley date back to 2008. They now have a special unit dedicated to investigating Markley.Ames and Gilbert public school districts both contracted Markley to provide pre-activity physical examinations. Both school districts are now urging potential victims within the schools to come forward.Grand View University President Rachelle Keck said in an email Friday that Markley also performed physicals there.\"This is the first we have heard of these allegations and wanted to share what we know so far,\" the statement said."
    ]
}