{
    "articleURL": "/sport/football/article-12049933/Andy-Carroll-issues-heartfelt-apology-fans-Reading-suffer-relegation-League-One.html",
    "content": [
        "Huddersfield secured their second-tier status with victory over Sheffield UnitedAs a result of their triumph, Reading have now tumbled down into League OneEx-England and Liverpool striker Carroll was quick to apologise on social mediaAndy Carroll issued a heartfelt apology to Reading fans after the club suffered relegation to League One on Thursday night.",
        "Huddersfield made certain of their place in the Championship next season with a 1-0 victory over Sheffield United.The Terriers needed a point to ensure survival and Danny Ward's second-half effort proved enough for Neil Warnock's side to avoid a final-day relegation battle against Reading.As a result of their triumph, the Royals have now tumbled into League One and former England striker Carroll, who has scored nine goals in 30 games this season, was quick to apologise to supporters on social media.The 34-year-old posted several pictures on Instagram and wrote: 'The people, the place, I love you all. I'm so so sorry we weren't enough this season.",
        "'I know I'll be working my f***ing a*** off this summer to get this fantastic club back up and beyond. Thank you for making this club my home.'Carroll shared an image of his family, who were sporting Reading's famous blue and white hoops, and some of his best goal celebrations from the season.He has two sons and one daughter - Arlo, Wolf and Marvel Mae - with former TOWIE star Billi Mucklow.Carroll also has two further children - Emilie Rose and Lucas - from a previous relationship.The ex-Newcastle, Liverpool and West Ham forward first joined Reading last season, scoring twice in six appearances.",
        "After spending the second half of last season at West Bromwich Albion, Carroll returned to Reading in September.He recently signed a new contract with the Royals which keeps him at the Madejski Stadium until the summer of 2024."
    ]
}