{
    "articleURL": "/wires/pa/article-12054721/Sublime-Marnus-Labuschagne-century-puts-Glamorgan-charge-against-Yorkshire.html",
    "content": [
        "Marnus Labuschagne put down a marker for the Ashes, capitalising after being dropped on 11 to record a mammoth century and advance Glamorgan’s push for victory over Yorkshire.",
        "A diving Finlay Bean got two hands to the ball but could not cling on at backward point, preventing a boundary and reprieving Labuschagne on the third morning of the LV= Insurance County Championship game.There was no second chance as Labuschagne spectacularly went through the gears to record 170 not out off 207 balls in Glamorgan’s 352 for four declared, leaving Yorkshire 492 to claim an unlikely victory.Leicestershire chased down 389 at Headingley on the final day last month to down Yorkshire, whose task will be to avoid a second defeat in four Division Two matches this season. They were helped in this endeavour as rain wiped out the last session after their depleted bowling line-up was put to the sword.Sam Northeast (66) and Sheffield-born Billy Root (51no) put on 148 and an unbroken 130 with Labuschagne, whose contribution to this fixture has been a weighty 235 runs and he will be hoping to have a similar impact on his next visit to the ground for Australia in two months’ time.He resumed on seven not out – with Glamorgan 196 ahead and eight second-innings wickets in hand – alongside a scoreless Northeast, with the outside edges of the pair frequently challenged early on.",
        "Mickey Edwards was a handful but it was fellow seamer Jordan Thompson who created an opportunity, tempting Labuschagne into flashing at a short and wide delivery, with the ball darting to Bean.",
        "Had a very difficult chance stuck, Yorkshire might have fashioned a route back into a contest where they have been behind the eight-ball for long spells but Bean’s parry gave Labuschagne a life.Labuschagne had earlier gotten off and running with a sublime cover drive off compatriot Edwards although it was not all one-way traffic as the Yorkshire seamer, bowling with good pace, looked to exploit some early movement.Gradually, though, Labuschagne started to find his feet alongside Northeast with Yorkshire a bowler down because of Ben Coad’s groin injury. It was for the most part a sleepy opening stanza with the visiting batters largely content to tick over as they brought up their half-centuries.Only when Dom Bess was brought on just before lunch did Labuschagne cast off the shackles, reverse sweeping the off-spinner twice then lapping him over his shoulder for three fours in an over. It was a testing day for Bess, who leaked 76 in 10 chastening overs.Either side of Northeast falling to his favoured cut shot off Thompson, Labuschagne hit Edwards out of the attack after lunch. There were five fours in the space of six balls, with Labuschagne backing away and agriculturally muscling across the line as the ball was dispatched to all parts.",
        "Kiran Carlson nicked off to Matthew Fisher, who then left Labuschagne on his knees on 97 with a blow to the midsection. Labuschagne showed no sign of the issue bothering him as a cute dab off Thompson for his 17th four brought up a 142-ball hundred – his first three-figure score of the domestic campaign.His second fifty was completed in just 38 balls and he continued to accelerate alongside Root, the younger brother of Yorkshire and England star Joe who needed just 68 balls to reach his fifty.Labuschagne continued to toy with Bess upon his reintroduction to the firing line, taking 58 runs off the 41 balls he faced from the former Somerset bowler, including a towering straight six to go with his 24 fours in his innings.Yorkshire, having taken only two wickets in as many sessions, were put out of their misery with Glamorgan’s lead approaching 500 but showers brought an early end to the day."
    ]
}