{
    "articleURL": "/tvshowbiz/article-12057781/Ed-Sheeran-performs-free-pop-West-Hollywood.html",
    "content": [
        "Ed Sheeran delighted fans in West Hollywood, California on Sunday as he performed a free show.",
        "The 32-year-old singer-songwriter - who defeated a copyright claim last week - sang his famous music atop a bright red StarLine City Sightseeing bus.The Halifax, United Kingdom-born star was dressed down per usual, donning a crew neck white t-shirt.The redheaded crooner bared his tattooed arms in the look, adding a pair of faded black pants.After hitting the makeshift stage Sheeran took time to greet and pose for photos with excited attendees. ",
        "Ed, who's responsible for catchy hits like Shape Of You and Thinking Out Loud, was equipped with a guitar as he sang his heart out.The musician's lengthy signature fiery mop of locks was slightly disheveled and tousled as they blew in the breeze.On Saturday the day the music artist had taken to social media to alert his local fans of the upcoming performance.He wrote in his Instagram Story, 'LA pop up. I got the address wrong. 8483 Melrose Avenue West Hollywood, CA 90069. See you around 11:30am.'He then followed up the next day with another message that read: '8483 Melrose. LA pop up, see you there this morning. 'I have a different vehicle for more fun. RIP the Volvo.'The entertainer also shared multiple posts on his Instagram grid, one of them reflecting on grieving his late friend Jamal Edwards.",
        "Sharing a video, he wrote, 'Subtract Sundays - Life Goes On - What I find so hard is just life resuming so quickly after losing someone close.'",
        "The caption continued, 'Days just appear, weeks pass by, and everyone just gets on with it. 'But I want the world to just stop turning and everyone to notice. Love is so easy to fall into, with friends or partners, it’s easy come. 'But when it goes it’s so hard to deal with. So that's the easy come, hard go. But in the end, life just goes on.'It comes after he recently opened up about making an album on grief and depression, sharing that his new record is his most 'uncomfortable' yet.The singer sat down with Zane Lowe on his Apple Music 1 show ahead of releasing his new album Subtract on Friday.Ed said he poured his feelings out into his tracks after what had been a 'horrible' period in his life which saw the death of Edwards and his wife Cherry diagnosed with cancer, among other things.The star also admitted that he's cried 'every day' since Jamal's passing, saying he feels it's the most 'respectful' way to feel about someone he's lost.On making the album Subtract, he told Zane: 'I sent this record to the record label, and they were like, \"Is it a break-up album?\" And it's not. It's an album about grief and depression and stuff.'",
        "Also last week, Sheeran was cleared of allegations his 2014 hit Thinking Out Loud ripped off Marvin Gaye’s Let’s Get it On at Manhattan federal court on Thursday.He had previously threatened to quit the music industry if he was found guilty of ripping off Gaye's classic love ballad.Sheeran, who adamantly denied the accusation his hit stole fundamental musical elements from Marvin's song, had faced a lawsuit brought by the heirs of the song's co-writer, Ed Townsend.But he heard a verdict he was in the clear on Thursday after a jury comprised of three men and four women deliberated for less than three hours before reaching their decision. "
    ]
}