{
    "articleURL": "/sport/football/article-12050499/Sam-Allardyce-admits-faces-biggest-decision-Illan-Meslier-ahead-Man-City-trip.html",
    "content": [
        "The 68-year-old has just four matches to transform Leeds' chances of safety Jamie Carragher calls Sam Allardyce 'DELUSIONAL' for Guardiola comparisonCity versus Leeds WILL be televised despite 3pm blackout due to Coronation Leeds manager Sam Allardyce claimed that the 'biggest decision' he has to make ahead of his first match in charge against Manchester City is whether to continue starting out-of-form goalkeeper Illan Meslier. ",
        "The Frenchman has had a checkered season but criticisms of Meslier have gathered speed in light of the keeper conceding a mammoth 18 goals in Leeds' last five matches. Leeds currently sit just one place above the relegation zone in 17th and level on points with 18th-placed Nottingham Forest. Allardyce has been drafted in to spearhead the Yorkshire outfit's campaign to stay up with just four matches left to play following the shock sacking of Javi Gracia on his birthday on Monday. But amidst the myriad different considerations that Allardyce must keep in mind as he prepares his team to face a ferocious City side, the veteran coach stated that the Meslier issue is his most challenging. ",
        "'I don't ever see a problem in training because there's no real pressure there like there is in a game,' Allardyce began on Friday as he met with the press. 'There's the goalkeeper coach working with [Meslier], there's nothing you can see to suggest or say anything other than you look at him and like all the keepers do together, he goes through the routine.'There are a bit daft, a bit mad aren't they, because they love doing what they do. If you did that for an outfield player they'd get really bored but goalkeepers love it and they're a right good pack together.",
        "'They're like a little family of their own and that will help him hopefully but that for me lies to be probably the biggest decision I have to make today.'Leeds' second option, Joel Robles, is yet to start a Premier League match, and has only garnered four appearances this season. The Spanish shot-stopper joined the club on a free transfer over the summer from Real Betis, and previously featured at Everton, Atletico Madrid, and Wigan, where he won the FA Cup in 2013. The 68-year-old coach may decide to call upon the Spaniard's considerable experience to steady the ship between the sticks.  ",
        "The former Bolton Wanderers and West Ham manager was happier discussing the instant impact he believes he has felt upon his move to Elland Road. 'In terms of response, I couldn't be any more pleased about the fact the players have aired their views, which is very important for me about how to go forward,' he continued.'We have put a plan together about the big task we have in front of us and analysed the best way we can play on Saturday and listening to the staff about how best the players play in what positions.'We have formed an idea and will tell them the starting XI this morning and will be on the pitch to do the final bits and pieces before we get off to Manchester.'",
        "City arguably present the toughest test in the Premier League due to the white-hot form that has seen Pep Guardiola's side win their last 15 matches across all competitions. By contrast Gracia's Bank Holiday sacking was prompted by Leeds recent drop-off in quality that has seen them win only one of their last six games. Allardyce's primary focus has been to lift the mood amidst the turblency and has set up his team – which includes former Leeds striker Robbie Keane – to ensure that confidence issues are redressed and 'doom and gloom' is banished. 'I have tried to lighten the training somewhat – there is nobody better than Robbie Keane for that, by the way,' the manager added.'He has got in amongst the players. He has joined in and done a bit of coaching with them.",
        "'We have got Karl [Robinson], who is the same, so we have created a bit of an atmosphere in the way we like to work – making the training ground a nice place to come to.'That doesn't feel like that with the results Leeds have had recently. It's been a bit doom and gloom and we have to try to lift that.'We can do that to a certain degree, but the only way we lift that in the end is to start getting the results.",
        "'We have to try to do that starting on Saturday because there are only four games left to try to survive in the Premier League.'"
    ]
}