{
    "articleURL": "/sport/nrl/article-12056245/Dual-code-legend-Wendell-Sailor-warns-Broncos-superstar-Payne-Haas-waste-union.html",
    "content": [
        "Rugby Australia signed Joseph Suaalii and is targeting Payne HaasWendell Sailor has warned Haas against moving to rugbySailor starred in both codes for Queensland and the Wallabies Dual-code legend Wendell Sailor has warned Payne Haas he would be a 'waste' in union should he decide to swap league for rugby.",
        "Last month, Rugby Australia formally opened negotiations with the Broncos star just just a week after rugby boss Hamish McLennan revealed the Wallabies had made signing the Brisbane prop their number one priority.The audacious bid to poach Haas comes less than a month after Sydney Roosters Joseph Suaalii agreed a three-year deal worth $1.6million-a-year with Rugby Australia from 2025. But Sailor, who starred in both codes, has warned Haas against following the Roosters gun to union. 'I want Payne Haas to stay in rugby league,' he told CODE Sports. ",
        "'If rugby union gets him, good luck to them but I think he‘d be a waste in union.'Australian Rugby League chairman Peter V'landys has batted away concerns of an exodus towards rugby union, but that hasn't stopped a number of NRL stars being linked with a code switch.Aside from Haas, the likes of Rabbitohs star Cameron Murray, Newcastle captain Kalyn Ponga, Manly star Tolu Koula and Parramatta centre Will Penisini have all been mentioned as potential targets. And while he believes Haas should stay put in the NRL, Sailor has warned the competition may struggle to prevent more players following the path taken by Suaalii.The Wallabies may not be the drawcard they were when Sailor switched codes back in 2001, but the prospect of an British and Irish Lions Tour and a World Cup on home soil may prove too tempting for league stars to resist.",
        "And the former Queensland star believes Eddie Jones' appointment has already revitalised Australian rugby.During Jones' first stint with the Wallabies, Sailor, Mat Rogers and Lote Tuqiri all crossed codes and all started for Australia in the 2003 World Cup final against England.Since he replaced Dave Rennie at the helm of the Wallabies in January, Jones has bullishly suggested he may raid league to convince some of the game's biggest stars to switch code. ",
        "'Eddie‘s changed the game up again. Rugby union has got Eddie at the right time again,' Sailor said.'I‘ve got no doubt we can get to the semi-finals. I’m not saying that they will win it but I’ve got no doubt that we’ve got the talented players and Eddie has this knack in the first couple of years, just making everyone want to play for one another.'Sailor felt rugby league imports 'raised the standard' in union, but admitted not everyone welcomed him and his fellow NRL stars with open arms.'Some of it was a bit nasty. Me and David Campese went head to head a few times,' he explained.'He was saying: \"Sailor hasn‘t got the skills to be a rugby player\" because he was trying to sign me to bring me over so I said: \"David Campese was a great rugby player, but I’ll treat him like a doormat\".",
        "'I wasn‘t being disrespectful but obviously I’m not a shrinking violet.'By the time Sailor switched codes, he'd won four premierships with the Broncos, two State of Origin series with Queensland and a Rugby League World Cup with the Kangaroos.That did not stop him from copping plenty of flak as critics accused him of moving to rugby purely to pick up a $700,000 salary, much as they have done with Suaalii over the last two months.But the Queenslander insisted criticism never bothered him. ",
        "'Not for a minute do I regret it,' Sailor said.'I played 37 Tests for the Wallabies and I got to see the world. I got to play the All Blacks, I got to play in South Africa, I got to play France, Italy, Ireland all those teams.'You can‘t buy that, which is why I encourage all players to do whatever they feel because it’s their bodies and their mums and dads who brought them through the junior sporting systems.'"
    ]
}