{
    "articleURL": "/sport/football/article-12039597/Frank-Lampard-criticises-Blues-team-following-Arsenal-defeat.html",
    "content": [
        "Lampard said it's 'clear to see' why the team have struggled so much this seasonThey are 12th in the Premier League and have lost their last six gamesSky Sports pundits agreed with the Blues boss as they weighed in with criticism Chelsea manager Frank Lampard appeared to aim a thinly-veiled dig at the Chelsea board after his side's defeat to Arsenal on Tuesday.",
        "The Gunners blew Lampard's side away in the first half of the game at the Emirates, as Martin Odegaard netted twice before Gabriel Jesus put the icing on the cake for the new Premier League leaders.Chelsea have now lost their last six games - all under Lampard - and are 12th in the Premier League, with the risk of slipping to 13th if they lose to Bournemouth at the weekend.Lampard was honest in his assessment of his side after the game when speaking to Sky Sports, admitting that they had a long way to go to get back to the heights they once reached.But he also references the Blues' successes during the reign of Roman Abramovich - who Chelsea fans sang for at the game - amid the chaos that has unfolded since Todd Boehly took over last year. ",
        "'Chelsea has been a big success for 20 years but at the moment we aren’t in that position,' the Blues' all-time top goal-scorer said.'In the time I’ve been here it’s clear to see behind the scenes, on the training ground, the reasons why. If you’re going to be a nice team to play against all the time it doesn’t matter where you go. That won’t change overnight but we better get there quickly.",
        "'The passive nature of our game you could attribute to many things. The players certainly care. They are low on confidence, but when you play for Chelsea you have to play a certain way even if you are low on confidence.'Whatever it is, it maybe doesn’t even matter because the only thing that will get you out of it is understanding and working hard. The gap was the other way around for many years.'Cesc Fabregas, meanwhile, working as a pundit for the game alongside Patrick Vieira and Jimmy Floyd Hasselbaink, appeared to question Lampard's tactics as they suffered their latest loss, though admitted the issue is deeper than simply the man in charge.'When I was little, I had a coach with 11 olives and he would throw them on the table with no tactics. This is how I see Chelsea,' Fabregas, who made 198 appearances for the club between 2014 and 2019, said.'We saw two different sides. One was really well drilled and coached and Chelsea allowed that. Sometimes Chelsea, I couldn’t believe the tactical and technical mistakes. We are not used to it. They had World Cup winner, World Cup winner, World Cup finalists, Brazil captain. Sometimes it doesn’t matter.'It is difficult. I feel for Lampard. I completely understand where he is coming from in a way. It is just sometimes about the players, you need to look in the mirror yourself and ask questions. Nowadays what I see is the excuse to look at the manager. He doesn’t play, it’s the players showing up.’",
        "Hasselbaink claimed Chelsea were 'asking for trouble' with their performance against their London rivals, insisting it was always going to fall apart if they didn't try to deliver.'This is how harsh football can be when you’re not at it or do the fundamentals right or work hard enough,' he said. 'The intensity today was very low. 'When you do those things the gaps are going to be big and the Premier League is unforgivable. You need to be at it every time. There are a lot of new players but certain things you need to see back. We didn’t see that in the first half today.’The Blues seem set to appoint former Tottenham manager Mauricio Pochettino to take over next season, but an agreement is still yet to be reached.The Argentinian will have a huge task on his hands if he does take over, having to cut several of the players from the squad Boehly built in the summer and trying to lift the club from their struggles.Hasselbaink and Vieira, however, were in agreement, however, that whoever goes in will have to be backed in the long run.",
        "'If you go with Pochettino you need to follow him and support him, that is also from above, Hasselbaink said. 'Give him the tools. It has to be a long-term job. You still need to win matches and he will, but let him be successful.",
        "'It will be important for Chelsea to finish the season well, Vieira added. 'They have to win games because of who they are. They can think it’s over but they have to prepare for next season and give time to those players who want to be here next season. 'It doesn’t matter who is going to come, what will be important is the person needs to have the keys of the car and make decisions and everyone at the football club has to be behind them and support them. 'The success of Mikel Arteta at Arsenal came because everyone was behind him. Guardiola, Klopp. Make the decision and be 200 per cent behind the manager."
    ]
}