{
    "articleURL": "/tvshowbiz/article-12040961/Joel-Dommett-wife-Hannah-Cooper-expecting-child.html",
    "content": [
        "Joel Dommett and his wife Hannah Cooper are expecting their first child.",
        "The comedian, 37, took to Instagram on Wednesday to share the exciting news alongside a carousel of photobooth snaps showing off the model's growing bump.Playfully alluding to the news that they were going to be parents, the post was captioned: 'Does anyone know how to change a nappy? Because Joel has s**t himself.'Joel and Hannah met after she slid into his DMs following his 2016 appearance on I'm A Celebrity… Get Me Out Of Here!, sending him a heart eye emoji.The comedian recalled how 'blown away' he was by how funny Hannah and revealed that they went on their first date just days later, and they made their first public appearance together in May 2017.",
        "Joel and Hannah co-hosted ITV comedy series during the coronavirus lockdown, and appeared on Gogglebox together.Joel exclusively told MailOnline in 2021: 'I love working with Hannah, I really do. She's so naturally joyful and funny, and likeable, something I've had to work at for 15 years, and it just comes to her naturally, which is very frustrating. 'She's great and I really like working with her so hopefully over the next couple of years we'll do more together. 'Hopefully we'll do more Gogglebox too because it's a really fun one actually.' Joel and Hannah announced their engagement in December 2017 after a year of dating, and in May 2019 confirmed that they had purchased their first house together. ",
        "In 2018, he told Metro.co.uk: 'This is the person I want to spend the rest of my life with. It's easy. Nothing feels difficult about talking about the future.'The couple married in 2019 after three years together, in an idyllic ceremony Mykonos, officiated by their friend Iain Stirling.The comedian announced the happy news on Instagram, sharing the first joyous photo of the couple's beach wedding.",
        "In the snap, model Hannah looked gorgeous in a lacy off-the-shoulder bridal gown, with a semi-sheer skirt that revealed her honed legs.A smitten Joel wrote: 'BEST DAY EVER. Love you' while Hannah shared the same snap with the caption 'My heart'. Discussing their wedding with OK! in 2020, Joel said: 'It was honestly so fun.'I was fully prepared to say it was the best day of my life and pretend it was - because I've been lucky enough to do Bake Off and I've had these amazing experiences in my life - but it was genuinely the best day of my life!'We had 28 people there. Some people have weddings where half the day is saying hi and bye to people. I wanted our closest friends and family to have a wonderful time.'In 2020, Joel admitted he hadn't dismissed the prospect of having children with Hannah, telling OK! Magazine: 'I think we're just going to chill for a couple of years and see what happens. We're in no rush to push it forward.'",
        "'I'm genuinely just really enjoying myself and I feel very lucky. Hopefully we'll continue on that streak.'"
    ]
}