{
    "articleURL": "/tvshowbiz/article-12057159/Dianna-Agron-looks-strange-exploitative-GQ-cover-shot-Terry-Richardson-Glee-days.html",
    "content": [
        "Glee alum Dianna Agron grew up 'a pretty nerdy kid' so when it came time to promote her hit Fox show 13 years ago, she was horrified to discover 'a rack full of bikinis' for her to wear at photo shoots for magazines.",
        "'We had a photo shoot with GQ, and it was with Terry Richardson, and there were no other clothes, our reps were not there, and we were just told, \"This is what you have to do for your show,\"' the 37-year-old SAG Award winner recalled to Rolling Stone on Sunday.'I remember feeling strange after about the whole thing...I didn't ever really feel comfortable dolling up or expressing my sexuality in that way, because I didn't even fully understand how I felt about my own sexuality.'I really came of age on that show. I was 22 when it started. There were things that happened where I had to learn how to use my voice to advocate for myself, and I wish people would have had more of an awareness to support me or ask my permission.'Dianna stressed that the problematic 57-year-old photographer was 'kind' not creepy shooting her 2010 GQ cover with castmates Cory Monteith and Lea Michele, but she said it was 'a woman on set that played a role in the photo shoot.'",
        "Agron famously played William McKinley High School cheerleader Quinn Fabray in Ryan Murphy, Brad Falchuk, and Ian Brennan's allegedly 'cursed' musical series, which aired from 2009-2015.The Georgia-born triple threat admitted she can relate to the societal pressure to have children her character - 37-year-old infertile woman Ella Patel - feels in Alexis Jacknow's sci-fi horror film Clock, which premiered April 28 on Hulu.",
        "'I've experienced this a lot in my own life,' Dianna explained.'There's this \"normal\" timeline that people think everyone should stick to. My mom had me when she was 30. I'm 37 and have no children. I also have friends my age whose parents had them when they were 40 to 44 years old, but that was not as \"normal.\" Somehow, weirdly, 37 years later it is still not very \"normal.\"'Agron filed for divorce from her two-time Grammy-winning husband - Mumford &amp; Sons banjoist Winston Marshall - in 2020 after a one-year separation and three years of marriage.Before the 35-year-old Englishman - the Acidman producer-star reportedly romanced Alex Pettyfer, Sebastian Stan, Chris Evans, Harold Ancart, and Bradley Cooper.The Holocaust-inspired reproductive thriller - also starring Melora Hardin and Jay Ali - received a 79% critic approval rating (out of 33 reviews) and a 60% audience score on Rotten Tomatoes.'We were also shooting this right in Texas as [Roe vs. Wade] was overturned, so it was charged,' Dianna noted.",
        "'It felt emotional being on set, telling this story, and thinking about people who are having their choice completely stripped away from them.'Agron will next play Sarah, the mother of a gifted Jesus-like 13-year-old boy in Netflix six-part series The Chosen One alongside Bobby Luhnow and Tenoch Huerta.",
        "'I hadn't done TV for almost a decade,' the As They Made Us actress explained.'The boy who plays my son is 13 years old, and him and his friends, who are this Goonies/Stand by Me little bunch, they are all between the ages of 13 and 16, and they hadn't acted before. Watching them interact with each other, I was reminded of the curiosity, enthusiasm, intrigue, and discovery that we had on Glee. It allowed me to reflect a lot on it.'The Chosen One - formerly known as 'El Elegido' - is based on Mark Millar and Peter Gross's graphic novel trilogy, American Jesus.On June 16, cast members Raymundo Garduño Cruz and Juan Francisco González Aguilar died and six crew members were injured in a car accident near Mulegé, Mexico during the production - according to Deadline."
    ]
}