{
    "articleURL": "/femail/article-12050861/Who-Prince-Harrys-allies-Coronation.html",
    "content": [
        "The Duke of Sussex, 38, is set to attend the Coronation on SaturdayREAD MORE: Has Prince Harry landed in the UK?Prince Harry is attending King Charles' Coronation solo, and given his frosty relationship with  his brother, he will have to rely on a number of royal family members to keep him company.",
        "The Duke of Sussex, 38, will attend the service in London alone, with Meghan Markle remaining in California with their children Archie and Lilibet, and it's believed he may have flown into the UK earlier today.This morning a private jet from Van Nuys airport in California landed at Farnborough, the VIP airport closest to Windsor Castle. Van Nuys is just an hour from Harry and Meghan's Montecito mansion, but it is not yet known if he was on board. Tonight Harry is expected to spend a final night at Frogmore Cottage after his father decided to evict him and his American wife just days after the release of his memoir Spare.There is speculation he will have no formal role in the service at Westminster Abbey tomorrow, and may even be sat several rows back from his brother William and other working royals.",
        "It is understood the duke will only be in the UK for around 24 hours so he can get home for his son Archie’s fourth birthday, which is the same day as the Coronation. During that time, he will have to rely on a key number of family members who he still retains apparently friendly relations with. Here FEMAIL reveals the royals who Harry may be forced to lean on for company at the historic event. ",
        "PRINCE EDWARD",
        "While Prince Harry has criticised a number of members of his family, the Duke of Edinburgh is among those who have escaped his public comments.In recent years, he is among the members of The Firm who has been seen setting aside any politics to chat with the Duke at royal engagements.The Duke and his wife Sophie were seen chatting with Prince Harry and Meghan at Westminster Abbey at the Commonwealth Day service in March 2020.Edward, who was joined by his wife Sophie, deftly bridged the conversation gap between the Sussexes and the then Duke and Duchess of Cambridge, who were seated in the row in front. Edward's relaxed, easy-going nature was noted by royal supporters watching at home, who said he was 'chatting' and 'giggling' with Meghan to help put her at ease. Meanwhile in an interview in 2021, he admitted there is a 'very sad' rift between Harry, Meghan and the royals after months of transatlantic truth bombs but said 'that's families for you', adding: 'I stay way out of it. It's much the safest place to be'.The Earl of Wessex said the situation is 'very difficult for everyone' and dodged what he thought of the Sussexes naming their daughter Lilibet after the Queen in an interview on what would have been his father Prince Philip's 100th birthday. ",
        "The late Queen's youngest son was asked about how the Royal Family has coped with a 'difficult few months', especially Harry and Meghan's flurry of US interviews where they have repeatedly taken potshots at his British family, including accusing them of racism. In an interview with CNN he said: 'It's difficult for everyone but that's families for you', and on the couple's decision to quit as frontline royals and emigrate he said: 'We wish them the very best of luck. It's a really hard decision'. He added intrusion is part of royal life, but 'we all had to deal with it in different ways'. Edward was also asked how he viewed that 'very public' row in a sit-down with the BBC and replied: 'It's very sad' before adding: 'I stay way out of it. It's much the safest place to be'. He added: 'We've all had that same spotlight shone on our lives. We've all been subjected to massive intrusion and all the rest of it. We all had to deal with it in different ways'. When asked if he was sad he said: 'Of course, you know. I mean it's…There are all sorts of issues and circumstances there but we've all been there' - but dodged what he thought about the choice of name Lilibet.  ",
        "PRINCESS EUGENIE ",
        "Over the years, Eugenie has been Harry's close friend, confidante, and even matchmaker. Now she is seen as one of his closest allies within the royal family, remaining steadfast in her support of him and Meghan in the wake of their move to California and string of explosive tell-all interviews. The Duke of Sussex and Princess Eugenie grew up playing together in royal parks and frolicking on the slopes on family ski holidays. Although their older siblings Prince William and Princess Beatrice were there too, it was always clear the relationship between Harry and Eugenie was special. Their connection is rooted not only in their shared experience as young royals and younger siblings finding their own path in life, but also as children of parents whose dirty laundry was aired in the press. 'From an early age, Eugenie had to deal with the embarrassing headlines of both her father and mother,' explained Nigel Crawthorne, author of Prince Andrew.'Harry had to deal with his share of headlines, too, and this bond between them was a great consolation for them.' ",
        "Despite being born five years apart, Harry and Eugenie often spent time together as children thanks to the friendship between their mothers Princess Diana and Sarah Ferguson, who would pack up the children for joint family holidays. ",
        "Photos from a 1995 ski trip show William and Harry smiling in the snow with the two young York sisters, and trudging up the slope with the girls trailing determinedly behind. Beatrice and Eugenie were also included in the final Christmas card Princess Diana sent out before her death. 'Out of all the Queen's grandchildren, Harry and Eugenie have one of the most natural connections,' Omid Scobie and Carolyn Durand wrote in the Sussex biography Finding Freedom. The book also describes them as the 'closest of friends'.'Like Harry, Eugenie is loyal, honest and great fun,' the book continues. 'The two had many nights out together in London, sneaking into back entrances of clubs, such as Mahiki, where Jack once was manager, or Tonteria, where in one of the VIP cave areas they downed shots from Mexican skull shaped glasses and a giant frozen margarita (with multiple straws).' The cousins also bonded over their shared difficulty of carving a role for themselves within the royal family, with Eugenie, who is not a working royal, having to seek out her own career path.Harry has always confided in Eugenie and she was reportedly among the first to know about his relationship with Meghan, whom she already knew through their mutual friend Misha Nonoo.",
        "'Not only did he trust her implicitly, but friends said that she gives great advice and has always been 'beyond wise' for her years,' Scobie and Durant wrote.  Eugenie and Jack, who married in October 2018, just six months after Harry and Meghan, went on double dates with the couple in Toronto and London. The Princess and her then boyfriend were at a party in Soho House in Toronto in 2016 when Harry and the Suits star were first seen together. Eugenie was instrumental in keeping their relationship secret. In the explosive tell-all Oprah Winfrey interview, in which Harry and Meghan criticised the Royal Family, Eugenie was singled out for praise. Meghan said: 'Eugenie and I had known each other before I had known Harry, so that was comfortable [...] We're friends with them as a couple.'The Sussexes, Eugenie and Jack were all guests at Misha Nonoo's lavish Rome wedding in the summer of 2019. They also have mutual friends in singer Ellie Goulding and George and Amal Clooney, who were guests at Harry and Meghan's nuptials. Jack is European Director of Casamigos, the tequila brand co-founded by George.Harry and Eugenie's relationship came under strain in 2018 when he and Meghan reportedly told senior royals they were expecting their first child together at Eugenie and Jack's wedding. The official announcement came just days later, eclipsing any lingering coverage of Eugenie's big day. However it would seem any bad blood between the cousins was soon washed away.  In a sign of how close they are, Eugenie and Jack, now live with their son, August, in Frogmore Cottage, the house on the Windsor estate renovated by the Sussexes before they emigrated to North America. On both of Harry's most recent trips back to the UK - for the funeral of his grandfather Prince Philip and the unveiling of the Princess Diana statue - he chose to stay with Eugenie, Jack and August, and form a bubble with them. Meghan also referred to the Duchess of York as 'Fergie' during her tell-all Oprah interview, hinting at a friendship that would have surprised many viewers. Despite there being five years between Harry and his younger cousin, they married and had children at the same time. Meghan and Eugenie reportedly bonded over motherhood and pregnancy and have taken similar approaches to presenting their children on social media - choosing to have photoshoots in the garden but obscuring the little ones' faces. Eugenie is also keen to show her public support for the Sussexes, dedicating an Instagram post to congratulating them on the arrival of daughter Lilibet in June. This week, Eugenie has given the clearest sign yet that she is a trusted member of Meghan's well-connected girl gang after she was hand-picked by the Duchess for her 40x40 initiative. The project, launched to mark the Duchess's birthday, calls on people to give 40 minutes of their time to mentor women going back into work. Eugenie wrote: 'To celebrate dear Meghan's 40th birthday, I'm contributing 40 minutes of my time to helping women re-entering the workforce... If you can please join me to commit 40 minutes to community, service or mentorship.'Commentators are split over whether Eugenie will be able to use this can-do attitude to repairing her cousin's frayed relationship with his family. Eugenie is also among the only royals who are known to have visited Prince Harry and Meghan in California. She was the only member of The Firm to be featured in the couple's Netflix series and was also mentioned a number of times in Prince Harry's book. ZARA TINDALL",
        "While Prince Harry is known to be close to Princess Eugenie, he is also believed to share a special bond with his eldest female cousin - Zara Tindall - and her husband Mike.The Duke is even godfather to the couple's youngest daughter, Lena.Harry, along with his brother William, were were raised in Gloucestershire, just a few miles from where Zara and her brother Peter Phillips grew up.The four royal cousins were often spotted chatting and joking at royal events, with William previously revealing how it was 'hard to keep a straight face' when sitting opposite his cousins in church.The bond between cousins is particularly close for members of the Royal Family, who might struggle to let outsiders into their inner circle.Such is the closeness between the cousins that they are all part of a WhatsApp group where they exchange messages on upcoming events and family news.'Me, my brother and then a few of Zara's side like her brother Pete [Phillips] and the cousins are on WhatsApp groups,' Mike once revealed. 'I wouldn't say we're cutting edge, but it's just easier for some reason on WhatsApp.'He added on a separate occasion: 'It's just what you do to try and set up get-togethers and we are going to something that is the same.'If you are going to go, [we discuss things like] \"Are you going to take the kids?\" Quite a lot of people have family WhatsApp groups.'Both Peter and Zara have been described as 'peacemakers' between William and Harry in the past, with the new Prince of Wales asking his cousin to strand between the pair during Prince Philip's funeral procession in April.Harry is even said to have introduced Zara to her now husband Mike Tindall.  The former England Rugby pro was said to be 'drowning his sorrows' at a bar in Sydney after being cut from the world cup squad when his pal Harry introduced the pair.The Duke of Sussex also has a close relationship with Mike, who is not a working royal but lives on Princess Anne's Gatecombe estate. Harry attended Mike's stag do in 2011, while Mike cheekily offered to be Prince Harry's best man when he announced his engagement to Meghan Markle.The former England rugby captain text his cousin-in-law to say: 'I've written my speech, I'm ready'.To which Harry replied: 'Sorry mate that job's full but I do need someone to show people where to park their cars.'Mike also joked he didn't receive an invite to Prince Harry's stag party, joking at the time: 'It was probably a very wise decision on his behalf that I wouldn't be there, I think.' Mike and Zara have also stood by Harry and Meghan on their rare return trips to the UK following Megxit.During the National Service of Thanksgiving at St Paul's Cathedral to mark the Queen's Jubilee earlier this year, the pair were pictured giggling away with Zara.It is believed Mike and Zara attended the birthday party for Prince Harry and Meghan's son Archie at Frogmore Cottage last year. The Duke will be hosting any such event for Archie's birthday this summer - given that the little boy will remain in the US with his mother - but he is still likely to catch up with his cousin and her husband while in the country.In September, following the Queen's death,  Prince Harry left Parliament in a limousine with Zara.While it is not known if Zara or her husband Mike have visited the Sussexes in California, the former rugby ace was spotted as they hit the shops together in Santa Monica in February.He shopped for children's shirts and also visited a womenswear shop in the town, which is not far from Prince Harry and Meghan's home in Montecito. PETER PHILIPS",
        "Prince Harry's eldest cousin Peter Phillips is believed to have acted as a 'buffer' between the Duke and Prince William at UK events since they fell out - including at the Duke of Edinburgh's funeral - and is likely to continue the tradition at the Coronation.It was claimed Prince William asked for Peter to stand between him and Harry during Prince Philip's funeral procession.Sources told The Mail on Sunday that Harry had experienced 'a great deal of frostiness' from many of his relatives since arriving in Britain a week before the funeral and self-isolating at Frogmore Cottage, the house given to him and Meghan as a wedding present by the Queen.However the brothers were separated by Princess Anne's son as they walked behind the Duke of Edinburgh's coffin while it made its way to St George's Chapel in Windsor in the spring of 2021. Both Peter and Zara have been described as 'peacemakers' between William and Harry in the past. "
    ]
}