{
    "articleURL": "/news/article-12061135/Iowa-woman-says-rubber-BIRKENSTOCKS-saved-nearby-lightning-strike.html",
    "content": [
        "Amber Congleton of Cedar Rapids, Iowa says Birkenstocks saved her life after she was near a lightning strikeDoctors told her the rubber on her sandals may have helped her surviveAn Iowa woman claims the rubber on the bottom of her shoes may have saved her life after she was injured by a nearby lightning strike which caused her legs to 'feel like noodles.' ",
        "Amber Congleton, 20, had just gotten out of her car in Cedar Rapids when she fell to the ground and lost her hearing following a lightning strike in a parking lot. Congleton told the Des Moines Register that a cart corral roughly two feet away from her had been hit and the impact was so strong it knocked her down. The woman said her doctors were shocked by her survival considering her proximity to the strike and speculated that her rubber Birkenstocks may have helped. The woman is still dealing with injuries from the strike but says she feels lucky to be alive after the run-in with death. ",
        "The incident happened during severe thunderstorms that moved into the Cedar Rapids area on Sunday. 'It was a bananas situation, I just got out of my car and within 10 seconds it hit and I honestly had no idea for a minute what happened,' Congleton said. According to the report from the Des Moines Register, after the lightning struck the woman fell to the ground screaming in pain. She told the outlet she saw people rushing over to help her but the situation was heightened by the fear of never being able to walk or stand again.'As soon as it hit the cart thing I lost my hearing and sort of just fell to the floor screaming for help because my legs felt like noodles,' Congleton said. ",
        "The woman was rushed to the hospital and she said her tests came back well. It was there the doctors told her their theory that her rubber-soled shoes may have been her saving grace. She now says she is recovering and able to walk again, but has to routinely check the blood flow in her legs. The woman also said she will need to get her eyes and ears checked. All in all, however, she is grateful and is 'overly blessed' by her outcome and the number of people who rushed in to help. 'I had so many random people just run over to me and help, it was sweet,' she said. 'I got my hearing back after like two minutes, but my legs I couldn't move for quite some time — then I wiggled my toes and so on. It was definitely really scary,' she continued. ",
        "The National Weather Service states that while rubber is an insulator, it is only effective 'to a certain point' due to the power of lightning. A lightning flash typically contains around 300 million volts of energy. Additionally, a return stroke of lightning can reach temperatures of up to 50,000 degrees Fahrenheit; the surface of the sun is around 11,000 degrees Fahrenheit.   'Your ½\" (or less) of rubber will make no difference,' NWS says in response to the question of whether or not rubber shoes protect against lightning. "
    ]
}