{
    "articleURL": "/tvshowbiz/article-12052655/Kaley-Cuoco-hits-gym-giving-birth.html",
    "content": [
        "Kaley Cuoco is back in the gym after the birth of her daughter Matilda on March 30.",
        "The Big Bang Theory alum, 37, shared a series of snaps and a short video clip to her Instagram Stories on Friday.'Slowly but surely on my way back,' she captioned one snap.'Let's Gooooo,' she superimposed over the video clip.The Flight Attendant actress wore black leggings and a grey tank top over a lavender bra as she used the Versaclimber and did squats.",
        "The 8 Simple Rules alum looked fit and trim and not at all like she just had a baby five weeks ago. Kaley shares her daughter with boyfriend Tom Pelphrey, 40, and revealed she's just 'going with the flow' when it comes to getting to know and parent Tildy.She also said: 'still haven't read a damn thing' about parenting' in an interview with Entertainment Tonight at an event for the John Ritter Foundation on Thursday.'We find ourselves in a very natural situation. We're just kind of going with the flow,' the new mom said. 'She really tells us what she wants, it's very clear, it's like one of three things.'She's cool. She's really just awesome, and we're loving it,' Kaley continued. 'We're loving being at home with her. Yeah, we didn't read anything and it's working for us.' Kaley is clearly in love with her baby girl as she gushed, 'Everyone's happy, everyone's good… She's thriving, she's the best!' ",
        "'She's amazing. She's five weeks old and she was laughing today, full on laughing and I was like, 'This kid is hysterical!'' Kaley added. 'I've become that mom who posts every freaking thing. She does something, and I'm like, 'I have to post that!''",
        "The Meet Cute star summed up her parenting journey so far in three words: 'Special, exciting and insane — but in the best way.' The go with the flow approach is also how she went into the birth of Matilda. 'I have no plan and I've read zero books, so that's the type of mom I will be,' she told ET in February.She added, 'I'm not like a prepper. I'm just not that way. It's gonna be great, I trust the process. Tom has googled enough for the both of us. He could probably deliver this baby at this point.'"
    ]
}