{
    "articleURL": "/wires/afp/article-12047661/Irans-Raisi-calls-Syria-trip-turning-point.html",
    "content": [
        "Iran's president on Thursday hailed his visit to Damascus as a \"turning point\", after Tehran's support helped Syria retake most of the territory it lost in 12 years of war.",
        "Ebrahim Raisi's two-day trip is the first such visit to Tehran's close ally since 2010, and gives Iran a leading role as Syrian President Bashar al-Assad seeks to focus on reconstruction, despite Western sanctions on both countries.\"This trip will be a turning point in Iran-Syria relations and will have an effect on the region and the trade and economic relations of the two countries,\" Raisi said during an event for businessmen.His visit comes weeks after Iran and its arch-rival Saudi Arabia agreed to restore ties, prompting regional capitals to re-engage with the internationally isolated governments in Damascus and Tehran.\"In no way do we consider the level of economic activity between Iran and Syria to be proportional to the level of political relations between the two countries,\" Raisi said.\"We believe that there should be a leap forward in commercial relations.\"Iran has long propped up Damascus with economic and military aid, including bringing in the powerful Tehran-backed Hezbollah group to fight alongside Assad's forces.- 15 deals -The Syrian conflict erupted with the repression of peaceful protesters in 2011, and has killed more than 500,000 people and displaced millions.Large parts of the northern Syria are still outside government control.Assad is eyeing reconstruction deals to revive the country's devastated economy and infrastructure.",
        "Raisi said Iran and Syria had signed 15 \"cooperation documents\" which would allow \"both countries to open a new chapter in economic relations\".On Wednesday, Raisi and Assad signed memoranda of understanding on \"long-term strategic cooperation\", covering fields including oil, aviation, railways and agriculture.Earlier Thursday, Raisi called for a united front against Israel during meetings with what Iran's IRNA news agency called \"Palestinian resistance commanders\".Tehran has long provided logistical and military support to factions fighting its arch-foe.Israel has carried out hundreds of air strikes against Iran-backed forces in Syria since 2011. While rarely commenting on such raids, Israel has repeatedly warned it will not allow Iran to extend its footprint there.\"The unity and cohesion of the resistance forces, the region and the Islamic world is necessary to speed up the defeat of the Zionist regime,\" Raisi said, referring to Israel.- 'Achieving victory' -He also met foreign minister Faisal Mekdad, who briefed him ahead of a meeting with his Russian, Turkish and Iranian counterparts in Moscow to discuss Syria-Turkey normalisation efforts.Damascus is a staunch ally of Moscow, which intervened in the civil war in 2015, using its air power to support the government's struggling forces.Turkey, meanwhile, backed rebel efforts to topple Assad.Raisi praised Assad on Wednesday for \"achieving victory\" in the country's war.",
        "As Syria slowly emerges from regional isolation, Assad is hoping that full normalisation of ties with wealthy Gulf monarchies and other Arab states will also help finance reconstruction.A deadly earthquake that struck Syria and Turkey in February and Iran-Saudi detente have both sparked a flurry of diplomatic activity.In April, Foreign Minister Prince Faisal bin Farhan made the first visit to Damascus by a Saudi official since 2011.On Sunday, Arab League foreign ministers will hold emergency meetings on Sudan and Syria's readmission to the bloc from which it was suspended in 2011 for its brutal crackdown on protesters.Analysts say sanctions on Syria are likely to continue to deter investment.burs-rkh-lar/aya/srm"
    ]
}