{
    "articleURL": "/femail/article-12046325/Im-mum-three-perfect-lazy-recipe-school-treat.html",
    "content": [
        "Sarita Holland showcased her recipe for 'DIY frozen yoghurt ice pops' on TikTok READ MORE: Working against each other! People share their colleagues' most irritating habits (so, how many are YOU guilty of?)Working out what healthy snacks your children will actually enjoy can sometimes feel like an impossible task.",
        "But one Australian mother has discovered the perfect after-school treat to keep her three youngsters happy - and it only involves one ingredient.Former model Sarita Holland showcased her 'lazy b****' recipe for 'healthier and easy DIY frozen yoghurt ice pops' on TikTok.She explained that all you need to make the fun snack are a few pots of yoghurt and wooden lolly sticks, which you can purchase as craft shops or online for as little as £1.  In her clip, the blonde bombshell - who appeared on Australia's The Price is Right back in the early 2000s - used yoghurts that she bought on special offer in her local supermarket.",
        "The mother-of-three pushed the wooden sticks directly into the pots of yoghurt, leaving the lids in place. She then placed the pots into the freezer and left them to set overnight before taking them out.  After leaving them for a couple of minutes outside the freezer, or placing them in warm water, the yoghurt packaging was then removed to reveal a tasty frozen treat.'How good is this hack for yummy after school treats,' said Sarita at the start of her video.After making the snacks, she added: 'How's good that, yoghurt tastes so much better frozen. ",
        "'The kids are going to love these after school, and in the meantime this frozen yoghurt is my breakfast because it's not bad for you.'",
        "TikTok users loved the idea, with one person writing: 'That's pretty cool, I'm gonna try that.'Another said: 'I love your lazy b**** cooking videos, you speak my language!', while a third person added: 'Great idea!'After debuting on Australia's The Price is Right, Sarita modelled for the likes of FHM and Ralph and is now a popular lifestyle influencer and ambassador. "
    ]
}