{
    "articleURL": "/news/article-12041993/Interactive-map-reveals-Coronation-Big-Lunches-Britain.html",
    "content": [
        "Thousands of street parties are set to be held over the weekend across BritainPeople are being encouraged to come together for the 'Coronation Big Lunch' An interactive map has revealed where more than 3,700 lunch parties to mark King Charles III's Coronation are happening across Britain as well as dozens more abroad.",
        "Thousands of street parties are expected to be held over the weekend, with people encouraged to come together for what has been dubbed the 'Coronation Big Lunch'.Organisers told MailOnline that the most northern event in Britain is planned on the Shetland Islands, while the most southern event will be on the Isles of Scilly. The map shows there are currently 3,754 Coronation Big Lunches planned in the UK plus more abroad in Canada, the US, France, Germany, Greece and New Zealand.Buckingham Palace said the lunches from Saturday to Monday will be 'a nationwide act of celebration and friendship', with some Royal Family members set to join in.On Sunday, the Duke and Duchess of Edinburgh will attend a Big Lunch at Cranleigh in Surrey, while Princesses Beatrice and Eugenie will be at one in Windsor. Plans for Prince William and Kate are expected to be released by Kensington Palace soon.Big Lunches take place across the UK every year with more than one million held since 2009. Last year the events raised more than £22million for local charities.Click here to use the Eden Project tool to find a Coronation Big Lunch near you ",
        "The gatherings are overseen by the Eden Project, which is an educational charity and visitor attraction based in Cornwall. They aim to bring neighbours together to celebrate the Coronation, and Camilla has been patron of the initiative since 2013.",
        "Those wanting to get involved can request a Coronation Big Lunch pack from the Eden Project, which features ideas, tips and practical notes to help with an event.Charles and Queen Camilla have personally chosen a recipe for 'Coronation Quiche' in celebration of the Big Lunches due to be staged to mark their Coronation.Last month the couple shared a recipe for the open-baked savoury dish, which features spinach, broad beans and tarragon.",
        "For the late Queen Elizabeth II's coronation in 1953, Coronation Chicken – cold chicken in a curry cream sauce with a well-seasoned dressed salad of rice, green peas and mixed herbs – was invented to feed the foreign guests who were entertained at Buckingham Palace after the ceremony.The recipe is by royal head chef Mark Flanagan and was chosen by Charles and Camilla in collaboration with him.Former Buckingham Palace chef Darren McGrady said the King's choice came as no surprise because Charles loves anything with eggs and cheese.Buckingham Palace said the quiche was chosen because it worked as a sharing dish, can be served hot or cold, suits a wide variety of dietary requirements and can be easily adapted to suit different tastes.",
        "The Palace also said it tasted delicious and had the benefit of not being too complicated and not requiring costly or hard-to-source ingredients.",
        "Quiche is known as a classic French dish, but is said have actually originated in Germany in the Middle Ages with the word quiche from the German kuchen, meaning cake.A statement on the Eden Project website said: 'As events go, they don't come much bigger than the crowning of a new monarch.'We're excited to be part of the official celebrations and we'd love for people across the UK (and the world!) to hold a Coronation Big Lunch to celebrate.'"
    ]
}