{
    "articleURL": "/news/article-12038167/University-students-charged-stabbing-19-year-old-student-death.html",
    "content": [
        "Kwabena Osei-Poku, 19, was fatally stabbed near the University of NorthamptonTwo university students have been charged for murder which happened in AprilTwo university students charged with murdering a 19-year-old student who was stabbed to death near the University of Northampton's campus have been told they will face trial in October. ",
        "Ogechi Eke and Melvin Lebaga-Idubor, both aged 19 and from London, appeared at Northampton Crown Court on Tuesday charged with murdering Kwabena Osei-Poku, who was fatally attacked on April 23. The university has confirmed both defendants and two other people charged with attempting to pervert the course of justice have been suspended from their courses pending the outcome of criminal proceedings. Mr Osei-Poku, originally from Peterborough, was studying on an advertising and digital marketing course. Police said he died at the scene after being stabbed in New South Bridge Road, Northampton, following an incident which started on the university campus. ",
        "Eke and Lebaga-Idubor spoke only to confirm their names during a five-minute appearance before Judge Rupert Mayo. Adjourning the case for a plea and trial preparation hearing, Judge Mayo told the men: 'Your trial will take place in October but before then there needs to be another formal hearing at this court, which will take place on the 12th of June, when you will both attend. 'In the meantime, you are remanded in custody.' Lebaga-Idubor, of Ice House Court, Abbey Road, Barking, and Eke, of Brimsdown Avenue, Enfield, are charged with murder and possession of an offensive weapon. They were told their trial will begin on October 2 and is expected to last for around ten days. In a statement issued last Friday, University of Northampton vice chancellor Anne-Marie Kilday extended her gratitude to 'our community and neighbours for their resilience during such an unprecedented, difficult time'. ",
        "'Following the charges brought against these individuals we will continue to closely support staff and students while assisting officers with their inquiries,' she added."
    ]
}