{
    "articleURL": "/wires/reuters/article-12040875/Quadruple-whammy-whips-June-Fed-rate-hike-table-McGeever.html",
    "content": [
        "By Jamie McGeever",
        "ORLANDO, Florida, May 3 (Reuters) - The Fed may well hike U.S. interest rates again on Wednesday but cracks appearing on multiple fronts - jobs, lending, the banking system and debt ceiling - strongly suggest it will be the last of the cycle.Elements of all four have come together this week ahead of the Fed's Open Market Committee meeting, prompting rates futures markets to wipe out any prospect of a move next month and even cast some doubt over a last hurrah on Wednesday.Before the March 'JOLTS' employment data on Tuesday, rates futures were pricing in a 28% chance of the Fed raising its fed funds target range by a quarter point on June 14 to 5.25-5.50%.That assumed a nailed-on 25 basis point hike later on Wednesday to 5.00-5.25%.The June hike is now off the table completely, and traders now see a 15% chance of the Fed not raising at all this week or in June. From 'one and done' to 'done'?Sudden, sizeable swings in market pricing are common and can reverse as quickly as they appear. But evidence is mounting that what the Fed calls a \"long and variable\" lag of almost 500 basis points of monetary tightening since January last year is finally biting.",
        "The banking system started bleeding in March, and the economy's skin is now breaking too. This is significant for the June 14 policy decision because the Fed also releases its new Summary of Economic Projections that day.While inflation remains sticky and there are undoubtedly areas of economic resilience - purchasing managers indexes spring to mind - the fallout from the most aggressive tightening campaign in 40 years will only increase over the next six weeks.Consider what has happened with regard to banks, credit conditions and the debt ceiling since the FOMC met on March 21-22, a meeting where \"several participants\" considered keeping rates on hold due to the banking blow up earlier that month.First Republic Bank bank became the biggest U.S. bank failure since 2008; the Fed is still providing banks with more than $300 billion in emergency lending, small business credit conditions deteriorated sharply; and Treasury Secretary Janet Yellen said Treasury could run out of cash on June 1.\"As banking sector developments continue to unfold, some FOMC policymakers may prefer a wait-and-see approach to the prospect of additional rate hikes in June and beyond,\" wrote HSBC's U.S. economist Ryan Wang on Tuesday.JOLT FROM THE BLUEThere is little indication that regional banks will get out of the firing line any time soon. The KBW regional banking index slumped 5.5% on Tuesday to a two-and-a-half year low and has lost a third of its value in two months.",
        "The deposit flight may have stopped but Fed officials will be acutely aware of the negative feedback loop on the economy, given the deep-rooted linkages between small banks and businesses.According to Goldman Sachs, 70% of small firms' commercial and industrial loans are from banks with less than $250 billion in assets; in over half of U.S. counties, non-'globally systemic important banks' provide 90% of loans to small businesses; and 75% of loans to small businesses are made by banks based within 25 miles (40km) of the borrower.\"This steady attack on regional banks is destructive to financial markets and ultimately the economy,\" former Boston Fed president Eric Rosengren tweeted on Tuesday.Small businesses account for around 40% of national employment. Figures on Tuesday showed that 'JOLTS' job openings - Fed Chair Jerome Powell's favorite labor market indicator - fell for a third month to the lowest in almost two years.The March survey of small businesses by the National Federation of Independent Business showed multiple signs of weakness, and even more attention than usual will fall on the next Senior Loan Officer Opinion Survey.The quarterly survey of banks about whether they are tightening or loosening loan standards will be released next week, but is already in the hands of FOMC rate-setters this week.",
        "That will matter little if failure to fix the $31.4 trillion U.S. debt limit standoff means Treasury runs out of cash and the country - and world - is suddenly staring down the barrel of U.S. default.Many analysts reckon the so-called 'X-Date' when the government coffers run dry will be around late July or early August, although some time in June cannot be ruled out. Yellen on Monday warned it could be June 1.Will the Fed be raising rates on June 14 if this is still a live issue? You can never say never, but the short answer is no.(The opinions expressed here are those of the author, a columnist for Reuters.)Related columns:- Small U.S. banks and businesses make for big problem- 'Peak Fed' aggravates U.S. debt ceiling strains- Fed's 'R-star' becomes black hole(By Jamie McGeever; Editing by Lincoln Feast)"
    ]
}