{
    "articleURL": "/wires/aap/article-12041211/Commissioner-defends-police-search-journalists-home.html",
    "content": [
        "Western Australia's police commissioner has defended the treatment of a journalist who had her home searched and equipment seized during an investigation into a protest.",
        "AAP has confirmed about 10 officers were involved in the search at the home of Roebourne-based Ngaarda Media reporter Eliza Kloser on Friday.The journalist shares the property with a colleague charged over an incident at Woodside Energy's annual general meeting on the same day.During the search in connection with her colleague's alleged actions, Ms Kloser's bedroom, clothing, bedding and other personal items are understood to have been searched.Detectives seized a photo storage card containing images that Ms Kloser believes are a record of Aboriginal rock art being removed from an industrial construction site on the Burrup Peninsula.Ms Kloser was also stopped by police twice earlier the same day as she drove away from the Perdaman fertiliser plant site.Officers are understood to have asked why she was taking photos from a public roadway before undertaking an extensive check of her car.WA Police Commissioner Col Blanch says the SD card had been returned to Ms Kloser and rejected any suggestion that the officers had targeted her.\"The warrant was specifically in relation to two individuals who have been identified and charged with taking noxious gas and flares into the (Perth) exhibition centre,\" he told ABC Radio.Mr Blanch said the alleged incident was being investigated as a crime and people's occupations were not a consideration.",
        "\"We're looking for evidence that we have to provide before the courts,\" he said.The Media, Entertainment and Arts Alliance has raised concerns over the search and seizure, saying the execution of the warrant was disturbing and amounted to harassment.\"The bottom line is that this kind of police action utterly undermines journalism and the public's right to know,\" the union's media director Cassie Derrick said on Tuesday."
    ]
}