{
    "articleURL": "/news/article-12057927/Colorado-mom-discovers-SNAKES-slithering-inside-walls-home-worked-life-buy.html",
    "content": [
        "Amber Hall made the shocking discovery last month, days after moving into the four-bedroom, two-bath behemoth in Colorado with her two school-aged kidsThe home is set on a scenic, tree-lined street in Centennial, a municipality located among some of of Denver's most affluent suburbs, to the city's southHall, 42, says spent her entire adult life working to afford the dream domicile - and was over the moon when she moved in, but is now facing an infestationA single mom has recounted how she horrifyingly stumbled across a horde of snakes living in the foundation of her new home.",
        "Amber Hall made the shocking discovery last month, days after moving into the four-bedroom, two-bath behemoth in Colorado with her two kids.The home is set on a scenic, tree-lined street in Centennial, centrally located among some of of Denver's most affluent suburbs, to the city's south.Hall, 42, says spent her entire adult life working to afford the dream domicile - and was over the moon when she and her children moved in back in April.However, that changed when the mom-of-two came across the school of scaly reptiles slithering in her walls and underneath her patio. Moreover, the realtor who sold her the house has since gone AWOL, forcing her to personally fork over thousands of dollars for professional help - who are telling her the infestation is now more serious than once thought.Scroll down for video: ",
        "'I was unpacking in here and one of my dogs crouched down and started walking over to this corner really slow,' Hall told FOX31 of how she has made the disturbing discovery almost immediately after moving in. 'I was like, \"What is it, buddy?\" I thought maybe it was a spider, whatever,' she recalled.'I came over and as I came over, I saw the snake slither up the wall.'Upon closer inspection, she realized it was not one snake, but several - all living along the back wall of the home's garage that leads into the yard.",
        "What's more, the unwanted guests were all shockingly large - and coiled up in a crevice that obscured their true numbers.Wary of more legless visitors out of sight in the home's inner workings, said she Hall put her hand on the wall above the several visible and felt warmth, leading her to believe there were still more snakes unseen.Since finding the first snakes on April 23, Hall says she has found at least nine more - and has paused unpacking her belongings or committing to moving in until the matter is resolved.Hall remarked to Fox31 of the infestation. 'I started watching and there were more and more and more snakes. 'I don’t know if I can even live here peacefully. I’m petrified.'",
        "Hall added that she was unsure of the species of snake, but according to experts that he has since been forced to seek out in the absence of the listing agent, the animals are garter snakes, which are harmless.However, she told Denver 7 that even professional wranglers were astounded by the snakes' size, saying they are uncharacteristically large for a garter snake - and have likely lived in the home's walls for years.  'Shockingly big,' Hall recalled of the snakes' size. 'Everybody's saying they're some form of garter snake. But they're also giving the caveat that nobody's ever seen their garter snake that big.",
        "She added: I can't unpack any of my stuff because I'm definitely afraid that there's snakes in the boxes or under the boxes.'It's like you crawl into bed, and if the sheet brushes your foot or something, you immediately rip the covers off or jump out of bed to make sure nothing's in there.'  Hall has hired a snake wrangler, who helped her discover that the infestation was not limited to the home's walls, but underneath its flooring - with the critters burrowing within the dry wall and under the patio.She told Denver 7 that the expert has been helping remove the snakes in a humane fashion, but at a cost - with the mother spending over $1,000 on the professional assistance, as well as multiple traps. That said, the snake wrangler told her he believes some of the snakes have been living there for multiple years based on their size, and that there are likely 'a lot more.'",
        "As for the listing agent who sold her the place, Hall told Fox31 they are not cooperating.In a statement, a spokesperson said the company denied having any knowledge of the infestation, and would have told Hall if they had been aware of their presence. They further told the station that this is the first time they have heard about snakes on the property. ",
        "That leaves Hall without a legal leg to stand on, as she can only pursue litigation if she can show proof that the seller had actual knowledge of the house's questionable condition.'I just want somebody to be responsible for whatever it takes to get them out,' Hall said, maintaining that she will not feel comfortable in the house she paid for until she rips up the concrete and locates where they are living.Experts hired by the mom theorize that due to the snakes' advanced age and numbers, the home is likely set on top of a snake den. Until it is discovered, Hall told both Fox31 and Denver 7 that her boxes will stay packed."
    ]
}