{
    "articleURL": "/tvshowbiz/article-12057161/Jennifer-Ellison-looks-glamorous-busty-cut-jumpsuit-Eurovision-2023-welcome-event.html",
    "content": [
        "Jennifer Ellison put on a glamorous display as she arrived at the 67th Eurovision song contest welcome event in Liverpool on Sunday. ",
        "The former glamour model, 39, caught the eye in a busty cut-out jumpsuit while posing for photos on the red carpet outside St George's Hall. She looked incredible in the figure-hugging number that featured satin panels and flared trousers. Jennifer styled her bright blonde hair into a sleek a sleek long bob and opted for a bronzed makeup look. To complete her ensemble, she slipped into a pair of heels and carried a small handbag on her shoulder.  ",
        "The Turquoise Carpet ceremony opened on Sunday afternoon in the city, which is preparing to host the song contest final next Saturday on behalf of last year's winners Ukraine.Hosted by Olympian Sam Quek and Ukrainian presenter Timur Miroshnychenko, the ceremony will see all 37 acts take to the carpet for a welcome to the city.Eurovision fans lined one side of the carpet, waving flags and scarves to support their countries.Norwegian act Alessandra was first to arrive on the carpet, where entrants had their photos taken and were interviewed.She said: 'I feel so blessed. I feel so nice here. I'm the first one out and that's an honour.'Conor O'Donohoe, from Irish band Wild Youth, said: 'It's all starting to feel very real. Everyone's getting here now, all the press are here and family are starting to fly in, so it's all starting to kind of really settle in.'",
        "The contestants wore their finest for the occasion, with Croatian group Let 3 taking to the carpet in bustled gowns accessorised with military-style peaked hats and facial hair.In scenes reminiscent of 1981 UK Eurovision entry Bucks Fizz, the group whipped off their gowns while having their photos taken to reveal white petticoats and vests.",
        "Latvian group Sudden Lights paid homage to Liverpool's most famous music act the Beatles by recreating the outfits worn on the Abbey Road album cover.The ceremony will be followed by The National Lottery's Big Eurovision Welcome outside St George's Hall.Among the artists set to perform for a crowd of almost 30,000 is band Frankie Goes to Hollywood, who will reunite after their split in 1987.Other acts with a Liverpool connection on the line-up include girl group Atomic Kitten, funk band The Real Thing, and The Lightning Seeds - singers of the football anthem Three Lions."
    ]
}