{
    "articleURL": "/news/article-12050689/Democrats-meet-privately-debt-limit-deal-ramp-pressure-campaign-GOP.html",
    "content": [
        "Schumer is convinced that House Speaker Kevin McCarthy won't be able to keep his GOP conference in lineJeffries is working with liberal advocacy groups in order to bolster Democratic supportDemocrats met behind closed doors Thursday evening as they plan to ramp up a pressure campaign on congressional Republicans to get behind a clean debt limit deal with only 27 days left until the country defaults on its debts on June 1.",
        "Democrats are insisting on lifting the debt ceiling with a 'no strings attached' clean bill, while Republicans say they won't allow the nation to plunge further into debt without spending cuts. Senate Majority Leader Chuck Schumer, D-N.Y., and House Minority Leader Hakeem Jeffries reportedly held a private call Thursday night with other Democratic members and key stakeholders as they attempt to strategize a way to avoid blame for the rapidly-approaching debt default.According to reporting from Punchbowl News, Jeffries is working with liberal advocacy groups in order to bolster Democratic support for a clean bill and also try and secure the backing of 'some more reasonable Republicans.'The groups include: League of Conservation Voters, Climate Power, SEIU, VoteVets, Center for American Progress, UnidosUS, the National African American Clergy Network and others.",
        "Schumer is convinced that House Speaker Kevin McCarthy won't be able to keep his GOP conference in line with a small four vote margin. 'A whole bunch of hard right congressmen have told McCarthy they are not negotiating, that it's this proposal or nothing,' Schumer reportedly said. 'And of course, that's unacceptable. That leads to default.' It all comes as a new Washington Post / ABC News poll show the public is split on who to blame for the impasse, with 39 per cent blaming Republicans, 36 per cent blaming President Biden, and 16 per cent split evenly. ",
        "However, McCarthy has insisted that everyone keeps underestimating him.At the end of last month, he was able successfully pass the Save, Limit and Grow Act, which would raise the $31 trillion debt ceiling in exchange for government spending cuts.It lifts the debt ceiling by $1.5 trillion in exchange for saving $4.5 trillion by capping spending at fiscal year 2022 levels in 2024. It will also limit growth to 1 percent per year. 'Now as the president continues to not negotiate what what I know is I'm confident that one party has taken care of the debt ceiling. We have lifted the debt ceiling so nobody could worry about whether the debt ceiling is gonna get lifted,' the speaker has said. 'We did. The Democrats have not. The president wants to make sure the debt ceiling is going to be lifted, sign this bill.' With the passage of the House bill, it appears as though Republicans are not planning to fold and back a Democrat-led clean bill anytime soon. Senate Minority Leader Mitch McConnell has expressed strong support for the House Republican plan, and is planning to take a sideline approach to any upcoming negotiations. In addition, the standoff between President Biden and Republicans has turned ugly as both sides blame the other for not committing to take default off the table.",
        "Sen. Ted Cruz, R-Texas, said Wednesday that Biden won't negotiate on the debt ceiling because 'his mental faculties are too diminished right now to do what he did in 2011, to sit down and actually work together on a solution to the problems.'Sen. John Cornyn, R-Texas, tweeted Friday morning that Biden is 'running out of time and excuses' on debt ceiling.'It is baffling how clueless President Biden is about the #BidenBorderCrisis and the end of Title 42, and the threat to our fragile economy from his stubborn and irresponsible refusal to negotiate a resolution to the debt limit. He is running out of time and excuses.'",
        "The Treasury Department announced earlier this week that it now believes the nation could default on its debts as early as June 1. Sec. Janet Yellen wrote to Congress on Monday with the new default date. Previously, the Congressional Budget Office had predicted the nation's timeline for default was between July and September. 'In my January 13 letter, I noted that it was unlikely that cash and extraordinary measures would be exhausted before early June. After reviewing recent federal tax receipts, our best estimate is that we will be unable to satisfy all of the government's obligations by early June, and potentially as early as June 1,' Yellen wrote.",
        "Just after Yellen's letter was made public it was revealed President Biden had called McCarthy's team to set up a meeting on how to move forward with the nation's $31.4 trillion borrowing limit, three months after their last meeting.A meeting with Biden and the 'Big Four' congressional leaders - Kevin McCarthy, Mitch McConnell, Chuck Schumer and Hakeem Jeffries - will take place on May 9."
    ]
}