{
    "articleURL": "/tvshowbiz/article-12038841/Brooklyn-Beckham-cuts-casual-figure-NYC-attending-Met-Gala-wife-Nicola-Peltz.html",
    "content": [
        "Brooklyn Beckham cut a very casual figure as he was spotted out in NYC on Tuesday, after attending the star-studded Met Gala with wife Nicola Peltz the previous evening. ",
        "The son of David and Victoria Beckham, 24, donned a cream sweater and black cargo trousers for the early morning outing. He slipped his feet into comfy trainers and slicked back his dark locks as he chatted intently on his phone.It comes after the aspiring chef and his wife put on a loved-up display as they arrived at the city's Metropolitan Museum of Art for the swanky event on Monday.Brooklyn showed off his edgy sense of style as he wore a semi-sheer black shirt which left his chest on show. ",
        "He wore a black jacket and matching trousers with a pair of chunky-souled shoes in the same colour. He stood arm-in-arm with Nicola, with the actress, 28, wearing an off-the-shoulder white dress which featured an expansive sheer train.The pair both added a touch of sparkle to their outfit by wearing matching diamond and pearl necklaces as they posed-up at the star-studded event.Nicola's glamorous gown featured delicate ruffled detail on the corset top section, with the shaped dress perfectly accentuating her hourglass figure.The skirt reached right down to the ground while a black bow sat on her waist.She wore lashings of make-up to highlight her pretty features and accessorised with a pair of dazzling earrings. Brooklyn also found time to share a sweet throwback snap of himself and dad David as he marked the football legend's 48th birthday.",
        "In the snap shared to Instagram on Tuesday, Brooklyn beamed alongside his dad as they wore matching khaki jackets. ",
        "David, who at the time sported shoulder length blonde locks, draped his arms around his son, while the both propped a leg onto the table.Emulating his famous father's style, both Brooklyn and David wore Chelsea boots and black skinny jeans with casual T-shirts while enjoying an evening at the pub.Captioning his post, Brooklyn wrote: 'Happy birthday old man x love you so much ❤️❤️.'While wife Nicola commented on the post with four red heart emojis. The actress, 28, also shared her own tribute to her father-in-law, sharing a snap of herself and David alongside her own father Nelson Peltz. ",
        "She wrote over the photo: 'Happy birthday @davidbeckham we love you!'Elsewhere. Victoria Beckham paid tribute to her husband, calling him the family's 'everything'. The fashion designer, 49, took to Instagram and shared a loved-up snap of the pair out for a lavish meal as she lead the family's tributes to the footballer.Alongside the post, Victoria wrote: 'Happy Birthday @DavidBeckham we love you sooooo much xxxxx The most amazing husband and incredible daddy. You are our everything'In another photo, Victoria appeared to be sunbathing while cosied up to David's foot. She jokingly wrote: 'I love you this much'",
        "David was then seen posing with son's Brooklyn, 24, Romeo, 20, Cruz, 18, and daughter Harper, 11, in different holiday locations.Romeo was the first of their brood to post a birthday message to his father. Alongside a sweet snap of them hugging on a football pitch, he wrote: 'Happy birthday old man love you so much'Cruz shared a snap of him and his father on a beach and penned: 'Happy birthday old man, you inspire me every day'."
    ]
}