{
    "articleURL": "/wires/ap/article-12044913/Red-Sox-extend-winning-streak-5-8-3-win-Jays.html",
    "content": [
        "BOSTON (AP) - Enmanuel Valdez, Triston Casas and Masataka Yoshida each drove in two runs and the Boston Red Sox extended their winning streak to five games with an 8-3 victory over the Toronto Blue Jays on Wednesday night.",
        "\"We´ve been doing that since Day One,\" manager Alex Cora said. \"Just moving the ball forward, hitting behind runners, running the bases well.\"Nick Pivetta (2-2) went six innings and gave up three runs, including solo home runs by Daulton Varsho and Vladimir Guerrero Jr. - whose shot in the third cleared the Green Monster and left Fenway Park.\"They´re a really aggressive lineup,\" Pivetta said. \"I was able to execute my offspeed early and then use my fastball later and then flip-flop that around. I'm not just here to throw. I´m here to pitch and execute all pitches in the zone.\"Alek Manoah (1-2) allowed five runs, two earned, and eight hits in five innings.Manoah held Boston hitless until there were two outs in the third, but encountered a rough stretch after getting hit in his right calf by a sharp line drive off the bat of Rafael Devers with one out in the fourth. Devers took second when catcher Alejandro Kirk fielded the carom and threw the ball into right field.",
        "Devers advanced to third when Manoah's pick-off attempt sailed into center and scored on Jarren Duran's double. Casas' single tied the game at 2.Toronto took the lead in the fifth when Kevin Kiermaier led off with a double, took third on George Springer's sacrifice fly and scored on a balk by Pivetta.",
        "But the Red Sox went ahead 5-3 in the bottom of the inning by scoring three unearned runs off Manoah with two outs, including a two-run single by Valdez.\"I thought he was getting on a roll a little bit,\" Blue Jays manager John Schneider said of Manoah. \"It was kind of typical Alek. He was making good pitches, but we didn´t help him defensively. You can´t have four errors, throw the ball around and expect to win. I thought he was good.\"The teams combined for six errors, including four by Toronto that led to four unearned runs.Blue Jays reliever Anthony Bass, who replaced Manoah, also took a line drive off his body in the sixth. Yoshida's shot scored Connor Wong and extended Yoshida's hitting streak to 13 games. Justin Turner's single to center drove Bass from the game with Boston up 6-3.Yoshida's two-out RBI double in the seventh off Trevor Richards made it 7-3.Boston added another run in the eighth when Casas reached on a one-out single to left, took second on left fielder Varsho's throwing error and scored on Kiké Hernández's single.Boston reliever Kutter Crawford, who entered to start the eighth, left with one out in the ninth, appearing to slip on the mound. Ryan Brasier got the final two outs to seal the victory.",
        "TRAINER'S ROOMRed Sox: RHP Garrett Whitlock, on the injured list since April 25 with right elbow neuritis, has started a throwing program. ... Closer Kenley Jansen, who hasn't pitched since Saturday because of back tightness, threw a bullpen session Wednesday and is expected to be available Thursday. ... INF Adalberto Mondesi, on the IL all season recovering from left knee surgery, will travel to Boston to see a doctor and determine his next steps. ... RHP Zach Kelly, who underwent ulnar nerve transposition revision in his right elbow Tuesday, could \"hopefully\" return In September, Cora said.UP NEXTRHP Kevin Gausman (2-2, 2.33 ERA) is scheduled to start the series finale for Toronto. In six starts against Boston last season, he was 3-0 with 47 strikeouts and two walks in 34 innings. RHP Brayan Bello (0-1, 6.57) is expected to go for Boston. In three starts against Toronto last season, Bello was 0-2 with a 7.62 ERA.AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}