{
    "articleURL": "/wires/afp/article-12057543/At-7-killed-car-ramming-outside-Texas-migrant-center.html",
    "content": [
        "At least seven people were killed Sunday in south Texas and several others injured when a car plowed through a group waiting at a bus stop outside a migrant aid center, police said.",
        "Law enforcement said they were treating the incident as an accident for now, though a witness told AFP the driver had yelled insults at the group before accelerating.The gray sport utility vehicle \"went through a red light and ran over several people\" at around 8:30 am (1330 GMT) in Brownsville, a border city at the southernmost tip of the state, local police spokesman Martin Sandoval told AFP.He said seven people died and \"nearly 10\" other people were injured.Witness Luis Herrera, whose arm was hurt in the incident, told AFP the crash was \"sudden.\"\"A woman went by in a car and warned us to get out of the way,\" he said.\"It was a matter of moments. The killer came (through) in the car, gesturing at us, insulting us,\" the 36-year-old Venezuelan said.Herrera then described the driver as accelerating the car to full force.The motorist, whom Sandoval said was also taken to the hospital, was detained by witnesses until police arrived. He has been charged for now with reckless driving.\"More than likely there's going to be other charges coming on later,\" Sandoval earlier told a local ABC affiliate, without clarifying what the additional charges might be.Authorities have launched an investigation into whether the fatal crash was an accident or intentional, Sandoval said.",
        "\"We're looking (into it),\" he told AFP.- 'Intense' -The victims were among a crowd of about 25 people waiting at a bus stop, according to Victor Maldonado, the executive director of the Ozanam Center, a homeless shelter across the street from the crash.The group, whom he said were all Venezuelan, had just eaten breakfast at the facility.He described a grisly scene, with body parts left behind along the street.Witnesses were \"really shocked,\" Maldonado told AFP. \"It was pretty intense.\"The homeless center is open 24 hours per day, Maldonado said, as \"we've been housing individuals coming from Chile, Colombia, Ecuador, China, Ukraine - and multiple Venezuelans,\" he added.Sandoval said at least some of the victims were migrants, but could not confirm whether they all were.\"It's something that we are investigating with border police,\" he said.The news of the tragedy comes as authorities brace for the lifting on Thursday of a Donald Trump-era federal policy that allows border patrol officers to deport or turn away migrants without even accepting their asylum applications.The looming expiration of the rule known as Title 42 has authorities fearing a spike in undocumented migrants entering the United States.It also comes a day after a shooter killed at least eight people at a shopping mall, also in Texas, in the latest mass shooting to rock the country."
    ]
}