{
    "articleURL": "/news/article-12054403/So-long-Britain-Prince-grins-Heathrow-Airport-races-away-King-Charless-Coronation.html",
    "content": [
        "King Charles Coronation LIVE: Read the latest updates from Westminster Abbey and the Palace hereHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.ukFor months, he had kept the British public - not to mention his own family - on tenterhooks with a cat and mouse guessing game over his attendance.",
        "And in the end it was truly a blink or you’ll miss it moment.Obscured by Princess Anne’s feathered plume from the cameras for most of the ceremony, Prince Harry slipped out of Westminster Abbey - accompanied by a Metropolitan police escort and four outriders - with only the briefest of goodbyes and headed straight for Heathrow Airport.After just 28 hours and 42 minutes in the UK, he was back on the plane to California before his father and stepmother had even finished having their official portraits taken.He was pictured smiling broadly as he arrived at the airport’s Windsor suite before his British Airways flight still in morning suit and sporting his medals.",
        "Which begs the question, as I wrote in the Daily Mail today, what on earth was the point of him even attending?Perhaps Harry, still fifth in line to throne and a Counsellor of State despite the hell he has put his family through, wanted to do the right thing.I do think there is chance he genuinely wanted to be there, albeit briefly, for his ‘pa’ on such an historic day. It may surprise some to know, given the touching kiss that William lay tenderly on his father’s cheek on Saturday, that it was ‘adorable’ Harry who always had the better relationship with their father.",
        "And despite the contempt he has shown for his family and the institution in recent years, I find it hard to believe that Harry has lost every vestige of pride for his sovereign.But given his determination to weaponise everything his loved ones do, one also has to ask whether this olive branch may yet one day be thrown back in his father’s face as Harry tells him ‘see what I did for you’.From the moment it was announced last October that Charles’ coronation was to held on May 6, planning was dominated by chatter about ‘the Sussex question’.Earlier this year, staff at Buckingham Palace were planning for the eventuality Harry and Meghan might come - which indicated it was, at least, not an off-the-bat no.But that came with unique problems for the Lord Chamberlain’s Office over everything from logistics to catering.Palace officials felt like they were always walking over hot coals, fearful of being accused of leaking anything about their future plans and inviting yet another volcano of wrath from across the Atlantic.There was relief when the palace and the Sussesex’s spokespeople simultaneously announced last month in a rare show of unity that Harry would be attending, but that Meghan had decided to stay at their Montecito mansion with their children.",
        "It was an understandable decision given that yesterday was also their son Prince Archie’s fourth birthday, but one source also told me at the time: ’In all honesty I think there’s a palpable sense of relief in some quarters at the way it has panned out.’Yesterday I reported that Harry, 38, was not expected to play any part in today’s coronation celebrations apart from his brief appearance at Westminster Abbey.Sources told me there were no plans for him to join the procession, take part in the private family lunch or even appear in any of the official or unofficial photographs.And lo, the prince was not seen once after it was said he flew in on a scheduled American Airlines flight to Heathrow on Friday morning while the rest of the family were undertaking multiple eve of Coronation duties in London.Today he left Frogmore Cottage, the Windsor home he and Meghan once shared, almost certainly for the last time after his father’s decision to evict them, just before 9.30am in a BMW with blacked-out windows.Interestingly, given his ongoing legal battle with the Home Office over his security, he appeared to be accompanied by a Metropolitan Police back-up car, standard for working members of the Royal Family, and four motorbike outriders.",
        "He entered Westminster Abbey alongside his non-working royal cousins - Zara Tindall, Princess Beatrice and Princess Eugenie.Lurking at the back of the group, Harry could be seen chatting slightly stiltedly to Beatrice and her husband, Edo Mapelli Mozzi.Eugenie and her husband, Jack Brooksbank, probably now the closest family members to Harry, turned round with big smiles.",
        "‘Oh wow,’ said Harry, indicating to a heavily-pregnant Eugenie’s tummy, ‘wow look, amazing.’‘Thank you,’ Jack said.Like the other non-working royals, Harry dressed in a morning suit with medals and the KCVO - Knight Commander of the Royal Victorian Order - given to him by Queen Elizabeth round his neck.But he was forced to make his way, somewhat awkwardly, down the Nave in the full view of the congregation on his own.The prince turned twice, once to his right and then to his left and smiled at someone he recognised.But he quietly took his seat three rows from the front in the South Lantern.The prince had been cleverly sat immediately between the always friendly Jack Brooksbank and elderly Princess Alexandra, a first cousin of Queen Elizabeth, who still undertakes limited royal duties.In front of him was Princess Anne, her husband Vice Admiral Sir Timothy Laurence and the Duke of Kent.",
        "Many wryly noted, given that he and Meghan were obscured by a giant candle at his grandmother’s funeral service, that the bouncing red plume of Anne’s hat largely blocked out her nephew’s face from the television cameras.Perhaps it was no bad thing.The front row was reserved for the Prince of Wales - the brother from whom he is now deeply estranged - his wife and their children, as well as the Duke and Duchess of Edinburgh.How sad that Harry, once a doting uncle who would often stop in at Kensington Palace with presents for baby George, wasn’t even able to speak to his adorable nephews and niece.Lip readers noted the 38-year-old royal remark to Mr Brooksbank that he was on a flight that day at ‘about quarter to four’.‘So soon?’ was the reply, another indication that lines of communication with even friendly family members are few and far between.Other than pulling the odd comedic grimace, Harry otherwise appeared to keep to himself.He did, however, clearly pay homage to his father during the service speaking the words: ‘God save King Charles, Long Live King Charles. May the King live forever.’As the glorious ceremony drew to a close, Harry left through the Great West Door and, with the same police outriders accompanying him, headed straight to Heathrow, where he was later spotted still wearing his medals.",
        "Behind the scenes at Buckingham Palace, though, there was a minor flurry of activity yesterday when staff were told not to rule out the prince changing his mind at the last minute and staying for lunch.And I am told that a place was even set for him just in case he decided to stay, but in truth no-one ever seriously thought it was an option.With his flight due to land in Los Angeles at around 6.30pm local time, Harry was hoping he could get home in time to kiss his birthday boy goodnight.And who would honestly begrudge him that?The big question, of course, however, is where does Harry go from here?Are there more beans to spill, or will this be the start of a rapprochement with his family, particularly his elder brother who is said to be hurt and angry?Despite some of the criticism levelled by his younger son at his wife, Charles is more forgiving - but even he has been pushed to edge of his fatherly limits.As one well-placed source, who has always been rather fond of the prince, told me this week: ‘Attending is probably the right thing for him [Harry] to do in the long run. He can at least say he came and made the effort to be with his father on his big day.’But for some Harry’s hypocrisy at taking a seat at the heart of such a Holy and beautiful ceremony, one that is the embodiment of the historic contract between the monarch and its people, leaves the bitterest of tastes.",
        "Prince Harry was 'out of step with the others around him' as he twisted and bent his body while entering Westminster Abbey for his father's Coronation, a body language expert has said. His nervous walk into King Charles III's ceremony was a 'sure sign he was on his own', Carole Railton explained, and was 'with his own thinking'.However, he then stepped in line and started smiling broadly which showed him being more comfortable. The pro added that his hand holding the edge of his jacket may signal the need for a 'small hug' to make himself feel better in what is bound to be a tense reunion with his family.Carole also remarked that the twisting and turning of Harry’s body would indicate discomfort, which is an 'unusual pose' which we 'do not normally see this with the royals'.",
        "During Saturday's Coronation ceremony, Harry was seated between Eugenie's husband Mr Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for 10 years. They were joined by Prince Andrew's daughters Eugenie, 33, and Beatrice, 34, and her husband Edo Mapelli Mozzi. Also in the third row, at the other end from Harry, was the Duke of York, who stopped using the title His Royal Highness in an official capacity in January 2022. He wore his Order of the Garter robe.William and Kate were in the front row at the abbey for the historic ceremony, with their children Prince George and Princess Charlotte.Their youngest child, Prince Louis, who recently turned five, took his seat after processing through the abbey, but retired once the ceremony began.Only the other senior working royals had a front row seat, made up of the Duke and Duchess of Edinburgh - Edward and Sophie - and their children Lady Louise and James the Earl of Wessex, as well as the ever-popular Princess Anne and her husband Tim Laurence. A source told the Sun: 'There were discussions that the seating could be arranged on line of succession. But that would have put fifth-in-line Harry front and centre — and with William and Kate.'Instead the decision was working royals only at the front and work back from there. Harry will be a long way from his father.'Sources previously told the Mail there were 'no plans' for Harry to join the Royal Family on the Palace balcony or to even appear in official photos.",
        "It emerged today that the Duke jetted into the UK on a commercial flight on Friday morning, leaving passengers gobsmacked. The King's son arrived from Los Angeles on American Airlines flight AA136, which landed at 11.23am at London Heathrow yesterday.Sources this week stressed that Harry will be 'in and out of the UK in 24 hours'. He planned to dash back straight after the two-hour ceremony to be with Meghan Markle for their son Archie's fourth birthday. He was expected to spend a final evening at Frogmore Cottage last night after his father decided to evict him and his American wife just days after the release of his memoir Spare.As was widely expected, it was confirmed by the Palace this morning that Harry and Andrew would be mere spectators to the historic Coronation Ceremony given that they are no longer working royals. The two men were also absent from the procession behind the Gold State Coach that carried the newly crowned King and Queen to the Palace after the ceremony.",
        "All eyes were on Harry as he faced his relatives in public for the first time since he criticised Charles, Camilla and the Prince and Princess of Wales in his explosive tell-all book. Insiders last night said they could not rule out him having an unplanned heart-to-heart with his father after arriving to the UK.'Of course you can never say never,' said one. 'Anything is possible, especially with him. And His Majesty loves his son despite everything.' But others felt that this was extremely unlikely.'To be honest it seems a bit pointless him being there. His place in the pecking order couldn't be clearer,' another source told the Mail.'Attending is probably the right thing for him to do in the long run. He can at least say he came and made the effort to be with his father on his big day... But the red carpet is most definitely not being rolled out and, as it stands, he will just be another member of the congregation.' ",
        "Sources last month suggested that other family members – with the possible exception of Princesses Beatrice and Eugenie – had no interest in talking with Harry at the Coronation beyond the most basic of greetings. It came after the prince publicly called on his family to apologise to himself and Meghan for what they saw as slights against them. ",
        "He also demanded that his father and brother sit down with him before May 6 to thrash their issues out - a meeting which never came to fruition.Adding fuel to the fire, Harry also indicated he has enough material to fill another book, which is likely to make the royals wary of encountering him.Sources previously said the decision by Meghan to remain in California had come as a relief in some circles, following fears her presence could have heightened family tensions.It is also understood there was real concern in the Sussex camp about the public reception the couple would have received if they attended the Coronation together.Friends, including Meghan's biographer Omid Scobie, suggested her decision was largely due to the Coronation falling on the same day as Archie's fourth birthday.The couple had delayed answering their invitation for weeks, causing difficulties for organisers tasked with complex seating plans, transport and security for senior members of the Royal Family, world leaders and other dignitaries.Sources described the negotiations as a game of 'transatlantic ping pong', and Harry was said to have wanted numerous assurances about arrangements.Coronation organisers admitted that they were stressed about Harry's plans and said that it was like 'trying to communicate with Mars'.Asked in an interview in January whether he would attend the Coronation if invited, Harry said 'the door is always open'.It was then reported last month that the duke would be coming to the Coronation alone, leaving Meghan at home with their children Archie and Lilibet.Buckingham Palace later said it was 'pleased to confirm' the Duke of Sussex will be at Westminster Abbey. There had been uncertainty at the Palace over the Sussexes' attendance.Sources last month said Charles was very pleased his youngest son is coming and his mood was described as 'generally quite forgiving', however, his brother William was understood to still feel betrayed and angry, particularly by the revelations in Harry's memoirs.One source told The Telegraph that the 'gulf' between the brothers, who were once as close as siblings could be, is now so large they cannot see how their relationship can ever be repaired.But their father hoped his Coronation could heal some of those wounds, sources said. ",
        "Sussex supporters said Harry understood that the Coronation is the biggest day of his father's life and felt it was right to be present, despite his attacks on the family. But more than one source confirmed to the Mail that there had been 'extensive discussions' between London and California over the issue of Harry's attendanc.One said: 'Harry's side was keen to find out, presumably because they wanted to rubber-stamp it, what the seating plan at the Abbey is. There's been extensive back and forth about who they [Harry and Meghan] would be sitting behind if they came. And who would be behind them.'Harry was apparently quite preoccupied by this particular detail, the source said.Another source added: 'This is true. There have been a lot of questions on detail for the Abbey.'Publications with links to the Sussexes have suggested that Harry had a list of questions for the Palace about what would happen if he attended and wanted certain 'assurances', but did not detail what they might be.When Harry and Meghan came to the UK for Queen Elizabeth's Platinum Jubilee they joined other members of the Royal Family at St Paul's Cathedral for a service of thanksgiving. But, notably and rather awkwardly, they were seated on the other side of the nave from Charles, Camilla, William and Kate.The Duke and Duchess of Sussex have been shunted away from the main seats as their rift with the Royal Family has grown.There had been hopes the Coronation could provide an opportunity for reconciliation - but as of last month, members of the Royal Family were understood not to have an appetite for it.One source told the Daily Express: 'The Royal Family are focused on planning for the historic occasion and have no appetite or time at this stage to think about reconciliation.' "
    ]
}