{
    "articleURL": "/wires/reuters/article-12059767/Biden-wants-airlines-pay-passengers-U-S-lengthy-delays.html",
    "content": [
        "By David Shepardson and Nandita Bose",
        "WASHINGTON, May 8 (Reuters) - U.S. President Joe Biden on Monday said his administration is writing new rules that will require airlines to compensate passengers with cash for significant flight delays or cancellations when the carriers are responsible.\"Our top priority has been to get American air travelers a better deal,\" Biden said.It is the latest in a series of moves by the Biden administration to crack down on airlines and bolster passenger consumer protections for domestic U.S. flights and international flights involving an American destination or origin.\"Summer travel is going to put enormous pressure on the system,\" U.S. Transportation Secretary Pete Buttigieg said Monday. \"Airlines need to accept their fundamental responsibility to better serve passengers.\"The U.S. Department of Transportation did not specify how much cash it aims to require airlines to pay passengers for significant delays. But it asked carriers last year whether they would agree to pay at least $100 for delays of at least three hours caused by airlines.Biden said the delay compensation rules will be proposed by the end of the year but it could take years to finalize rules, and some carriers privately question whether the department has the legal authority to mandate compensation for delays. A July 2021 proposal to require airlines to refund consumers fees for baggage that is delayed, or onboard service like Wi-Fi that do not work, are still not finalized.",
        "The Transportation Department said it plans to write regulations that will require airlines to cover expenses such as meals and hotels if carriers are responsible for stranding passengers. Most carriers voluntarily committed last August to provide hotels or meals but resisted providing cash compensation for delays.The Biden administration has objected to family seating fees, investigated 10 carriers for failing to provide refunds, pressed Southwest Airlines to do more after a holiday meltdown led to more than 16,000 flight cancellations, and proposed other new consumer protections.The Transportation Department on Monday made clear on a government website that no U.S. carriers have agreed to provide cash compensation for delayed or canceled flights under carriers' control.The Biden administration has sparred with U.S. airlines over who was to blame for hundreds of thousands of flight disruptions last year.Airlines for America, a trade association representing Delta Air Lines, United Airlines, American Airlines , and others, said U.S. airlines \"have no incentive to delay or cancel a flight and do everything in their control to ensure flights depart and arrive on time, but safety is always the top priority.\"U.S. airlines note the Federal Aviation Administration (FAA) acknowledges it does not have enough air traffic control staff and is operating 10% fewer flights than in 2019 to reduce pressure on the system.",
        "In October, Reuters first reported major U.S. airlines opposed Transportation Department plans to update its dashboard to show whether carriers would voluntarily compensate passengers for lengthy delays within airlines' control.The updated dashboard shows JetBlue Airways offers frequent flyer miles, travel credits or vouchers when cancellations or delays that are under the airline's control result in passengers waiting three hours or more, and Alaska Airlines offers travel credits or vouchers. No airline guarantees cash compensation.There is no legal requirement for airlines to compensate U.S. passengers for delayed or canceled flights, but the European Union and some other countries require compensation of up to 600 euros ($663) for most significant delays. (Reporting by David Shepardson and Nandita Bose in Washington; Editing by Jonathan Oatis)"
    ]
}