{
    "articleURL": "/tvshowbiz/article-12055371/Britains-Got-Talent-fans-fume-Travis-George-misses-Golden-Buzzer.html",
    "content": [
        "Britain's Got Talent viewers were left astounded when singer Travis George was not given a Golden Buzzer during his Britain's Got Talent audition on Saturday.",
        "The singer, 22, from South Wales, who has also appeared in TV drama Casualty, took to the stage in front of judges Simon Cowell, 63, Amanda Holden, 52, Alesha Dixon, 44, and Bruno Tonioli, 67, to sing Stars from musical Les Misérables.And while he was given cheers in abundance and a standing ovation from the live theatre audience during his audition and was put through to the next round by the judges, he did not get a Golden Buzzer which would have granted him an automatic place in the live semi-finals.The judging panel's choice did not go down well with viewers, with many taking to Twitter to express their disbelief. One person wrote: 'Travis should have been given the golden buzzer. Could really tell he was nervous throughout the audition.'",
        "While someone else shared: 'If they give the golden buzzer to a dancing dog over Travis George then I'm going to be absolutely fuming.''Travis was the most deserving golden buzzer act and no one gives him one lol, typical,' posted another viewer, while someone else shared: 'Travis's life has just changed. Should have had the golden buzzer.'Another viewer remarked: 'Travis smashed it. He was probably better than the golden buzzer acts.'Someone else tweeted: 'You know that #Gogglebox is going to show the #MrBlobby bit from #BGT next week instead of this legend! Travis George who deserved a golden buzzer and was robbed! Amazing voice!!! #BGT and #Gogglebox are both farcical shows!'",
        "While someone else posted: 'I actually thought Ant and Dec were going to give Travis the golden buzzer. Really deserved it.'Someone else wrote: 'Very surprised that Ant and Dec didn't choose Travis as their Golden Buzzer act.'While one other show fan asked: 'How come did Travis not get Golden Buzzer on #BGT.'Another viewer posted: 'Travis probably should have been a golden buzzer moment tbh.'",
        "Travis appeared to be so nervous before his audition that he was rendered speechless when asked what he hoped to get out of appearing on Britain's Got Talent by head judge Simon. However, while Travis appeared to have stage fright, some viewers called into question just how genuine this was. They took to Twitter to claim they'd previously seen him on television drama Casualty.One person wrote: 'Well done, Travis George said he's never done anything like #bgt before, yet he's been on Casualty! #britainsgottalent Another scouted act?'",
        "Someone else shared: 'This Travis guy in #BritainsGotTalent has connections He was in #casualty two weeks ago playing the boyfriend to the pregnant lady with down syndrome Is #BGT going to admit it's fixed?''Travis was just on casualty again a couple of weeks ago, I knew I recognised him lmaooo,' wrote another viewer.While someone else shared: 'I'm sure Travis George has been on casualty !! He was on last week I'm sure #BGT.'",
        "Britain's Got Talent continues on ITV1 and ITVX next Sunday at 7.40pm."
    ]
}