{
    "articleURL": "/wires/reuters/article-12047137/Ukraine-hopes-protect-Kyiv-Israeli-alert-summer.html",
    "content": [
        "By Dan Williams",
        "JERUSALEM, May 4 (Reuters) - An Israeli-designed missile detection system that would give Ukrainians more time to take shelter from Russian missile attacks is being tested in Kyiv and may be activated within two months, Ukraine's ambassador to Israel said on Thursday.Israel, which has been honing its own air defences since coming under Iraqi Scud salvoes in the 1991 Gulf war, agreed to share technologies with Ukraine last year even though it held off on meeting Kyiv's requests for weaponry.One of those requests had been for the Iron Dome, a short-range interceptor that Israel regularly uses to shoot down rockets fired by Palestinian militants in Gaza.Mindful of their government's efforts to maintain good relations with Moscow, Israeli officials have not provided details on the detection system being developed for the Ukrainians.Ambassador Yevgen Korniychuk said the system, fed with data from Ukrainian radars, is now being tested in the capital.\"It allows for identifying the different objects, including ballistic missiles, and calculates where they will go and basically that allows us to close certain parts of the country rather than the whole country,\" he told Reuters, referring to the air-shelter orders current being issued when under attack.When complete, the system will warn residents of areas about to be struck by Russian missiles or drones, either by sounding sirens nearby or with alerts on cellphones, he said.",
        "The system would allow more precisely tailored messages that would sound the alarms in individual neighbourhoods under threat. \"It will allow us to close Kyiv sectorially,\" Korniychuk said.\"Some residents will be told on their phones how much time they have to jump into their shelter, while in other parts of Kyiv people will be able to sit and have coffee.\"What I know from our experts is that they have already started work and I do hope that, in accordance with our internal schedule, it will take another month or two to get it working in Kyiv,\" he said, adding that five other cities would follow.The account appeared to track with the missile detection system used in Israel, which, according to one official, divides the country into around 1,700 zones, with Tel Aviv and Jerusalem subdivided into four or five zones each.The alerts, delivered over cellphone, automatic loudhailers and websites, give \"times to shelter\" in accordance with the distance of the target to the source of the launch, the official said. The shortest is 15 seconds, the longest three minutes.The alerts appear on the cellphones of Israelis who download the relevant military app - but only if they are in the impact zone. The app does not otherwise track users' cellphones and is only activated if they happen to be in the impact zone. (Writing by Dan Williams; Editing by Nick Macfie)"
    ]
}