{
    "articleURL": "/wires/aap/article-12045013/Artist-makes-scents-having-head-clouds.html",
    "content": [
        "Mark Eliott's new exhibition in Sydney, Essence of Cloud, takes the idea of mixed media sky-high.",
        "The story that goes with the show is told using words, woodwork, photography, animation, music, blown glass, even perfume.About seven years ago Eliott, a glassblower by trade, began writing a novel about an eccentric character who tries to extract a mysterious substance called \"essence of cloud\" from the sky.\"I'm intrigued by clouds, they often change and you see things and faces in clouds,\" the artist told AAP.Part fiction, memoir and family history, the book even has its own creation myth, involving a cloud goddess whose tears of loneliness seed the oceans with life.Eliott began making watercolour sketches and blowing cloud shapes in glass as a way of illustrating the story.\"It was simultaneously happening in two platforms, a process that was quite novel to me,\" he said.The concept expanded even further, with Eliott inviting half a dozen artists from different disciplines to help him.He even invited a maker of scents, so that gallery-goers will find parts of the story represented in smell - they have to imagine what the fragrances might mean for the tale.The central piece of the show is a large glass-blown boat teeming with glass animals, humans and plant life.It's all very whimsical, according to Eliott, but underneath there's a serious message about the environment.",
        "\"Like so many artists at the moment I'm trying to join the chorus of people calling for human behaviour to change,\" he said.Eliott wants to see people understand their place in a broader ecosystem.\"I think part of what has got the planet into such a state is a sense of humanity being separate from nature,\" he said.Around the gallery, glass clouds are suspended from the ceiling, and at an event on May 10 the artist will help his audience make even more of them, by breathing into a long hose attached to his blowpipe as the clouds are formed.Eliott was also inspired by a piece in the collection of the Corning Museum of Glass in the US, a \"trick glass\" from Spain, intentionally designed to be impossible to drink from.One of his pieces has been acquired by the museum, which houses the pre-eminent glass collection in the world.Essence of Cloud is on at the Ellipsis Gallery in Sydney, with Mark Eliott presenting on May 10."
    ]
}