{
    "articleURL": "/wires/aap/article-12055295/Washing-machine-filters-no-brainer-cut-pollution.html",
    "content": [
        "Australians may not know it, but every time they chuck on a load of washing it gives plastic pollution a free ride into the environment.",
        "With plastic now a dominant component of clothing and other textiles, every turbulent wash strips away fibres that end up in wastewater - a key pathway for the long-lived pollutant to enter the marine environment.From there, the plastic breaks down into smaller and smaller pieces that can be absorbed by plants, animals and humans.A range of studies have found microplastics in human faeces, urine, blood, lungs, and the placentas of unborn babies. Studies on the health impacts are ongoing.In Brisbane, a world-leading research lab is investigating impacts from even smaller nano plastics that might be capable of crossing the barrier that protects the human brain from toxins or pathogens circulating in the blood system.The federal government is well aware of the microplastics problem and the national plastics plan loosely details ambitions for all new washing machines sold in Australia to be fitted with microfibre filters by mid-2030.But experts say it's a case of too little, too late especially given the OECD estimates global plastic production will almost triple by 2060, with less than a fifth likely to be recycled.Frederic Leusch, from Griffith University's Australian Rivers Institute, is an expert in environmental toxicology, which is the study of how chemicals in the environment, like those used to make plastic, affect living things.",
        "The dominant source of microplastics in wastewater is washing machines, Professor Leusch says. Fast-tracking filters is a \"no-brainer\".\"Ninety per cent plus of the microplastic that reaches our wastewater treatment plants are PET fibres - polyester fibres from clothing. There's a very simple fix for that. Why are we waiting seven years?\"Prof Leusch also wants to see filters on clothes dryers, saying they are a big driver of plastic air pollution in homes.Engineers Australia expressed similar views at a recent federal parliamentary hearing on plastic pollution in Australia's oceans and waterways.The 2030 target date for washing machine filters is too far away and only addresses half the problem, it believes.Engineers Australia also wants filters on treated water entering homes and businesses, given microplastic pollution is now ubiquitous, including in the air.Prof Leusch says the water industry didn't create the problem but, like other contaminants that make their way into the wastewater system, has to deal with it.\"They feel like they've been unfairly treated because wastewater treatment plants are called a source of microplastics to the environment. They are not a source, they are a pathway.\"The federal Environment Department says textiles are estimated to account for about nine per cent of the microplastic pollution that flows into the ocean every year, with the washing of synthetic clothing a major source.",
        "But moving to filters is no quick fix given Australia imports most washing machines sold nationwide.Australia is participating in efforts led by the International Electrotechnical Commission to assess the feasibility of methods to measure microplastics in the wastewater from washing machines.But preliminary work only began last year and the next stage won't happen until next year.\"Following development of the IEC standard, consideration will be given to its adoption as an Australian standard and phase in Australia,\" the department said.In the meantime, the problem persists.In 2019, Italian researchers found a single washing machine cycle can shed up to 1,500,000 fibres per wash, demonstrating the scale of loss possible from synthetic clothes, which also shed microplastics while they're being worn.Prof Leusch says while Australia does not have discharge limits, conventional wastewater treatments are quite effective at removing microplastics.But given the volume of microplastics arriving at treatment plants, even the small percentage that's released back into the environment is a mounting problem.Water Services Association of Australia executive director Adam Lovell says the industry supports the phase-in of washing machine filters but notes it does nothing to solve the root cause of the problem.\"The water industry is being left to deal with the legacy of microplastic pollution, amongst others, which poses quite significant costs for water utilities and their customers,\" he says.",
        "\"We believe that there is a need for more research and innovation to find solutions for these emerging contaminants, as well as stronger regulation and enforcement, to prevent them from occurring in the first place.\"So while the wait for filters seems long, what can consumers do to reduce microplastic burdens on the environment? Plenty, says Pip Kiernan from Clean Up Australia.Two simple things are washing clothes less often and only using the machine when there's a full load.But the biggest thing is to be conscious of what's in the clothing you buy.There's been a dramatic shift in the last 20 years away from natural materials to synthetics, and that's adding up to a mountain of waste that can't be reused, Ms Kiernan says.A recent Australian Fashion Council report found the average Aussie buys 56 items of clothing a year. That's the equivalent of 14.8kg per person, and most are made from unsustainable materials that won't last.\"Unfortunately, we don't have high levels of recycling of clothing in Australia, it's very much in its infancy,\" Ms Kiernan says.\"It is where we need to go, but we're a long way from there. And we can do a lot of damage to the environment on the way.\""
    ]
}