{
    "articleURL": "/wires/ap/article-12052461/UN-experts-warn-Taliban-restrictions-femicide.html",
    "content": [
        "ISLAMABAD (AP) - Taliban restrictions on Afghan women and girls may amount to femicide if they are not reversed, a team of U.N. experts warned on Friday.",
        "Since they seized power in Afghanistan in August 2021, the Taliban have barred women from most jobs and workplaces, and girls can´t go to school beyond the sixth grade. Woman are also banned from public spaces and must cover themselves from head to toe outside the home.In a statement released Friday, the U.N. experts accused Afghanistan´s Taliban authorities of the \"most extreme forms of misogyny\" and said there could be multiple preventable deaths that may amount to femicide if the restrictions are not reversed.The restrictive measures and bans imposed by the Taliban have caused international condemnation and outrage, but the Taliban have shown no sign of willingness to lift them.The U.N. experts also said the Taliban are imposing their interpretation of Islam, which appear not to be shared by the vast majority of Afghans. They expressed alarm about widespread mental health issues and accounts of escalating suicides among women and girls.\"As girls and women are prohibited from attending school above grade six, as well as university education, and they can only be provided care by female doctors, unless the restrictions are reversed rapidly, the stage may be set for multiple preventable deaths that could amount to femicide,\" said the experts, who shared their preliminary observations from an eight-day trip to Afghanistan.",
        "The bans have reportedly contributed to an increase in the rates of child marriages and forced marriages, as well as the growth of gender-based violence \"perpetrated with impunity,\" the statement said.The U.N. experts noted, however, that gender-based discrimination in Afghanistan precedes the Taliban rule and is engrained in society, and urged the international community not to use Afghan women and girls for political purposes, saying their rights should never be a negotiation tool.The experts, appointed by the U.N. Human Rights Council, include Richard Bennett, special rapporteur on the situation of human rights in Afghanistan, and the head of the working group on discrimination against women and girls, Dorothy Estrada-Tanck.Last November, the U.N. experts said the Taliban treatment of women and girls in Afghanistan may amount to a crime against humanity and should be investigated and prosecuted under international law.The Taliban at the time rejected their statement."
    ]
}