{
    "articleURL": "/tvshowbiz/article-12058575/Jenna-Ortega-wins-Best-Performance-Wednesday-2023-MTV-Movie-TV-Awards.html",
    "content": [
        "Jenna Ortega was among the major winners at the 2023 MTV Movie &amp; TV Awards on Sunday.",
        "She took home the prize for Best Performance in a Show for her popular Netflix series Wednesday.Like many of the evening's other nominees, she wasn't on hand to accept the award.Sunday's show became a stripped-down affair after Drew Barrymore withdrew as host in solidarity with striking members of the Writers Guild of America (WGA), and the show opted to no longer be live after many guests and nominees said they wouldn't be willing to cross a picket line.Ortega has a bit of history with the striking writers — who are battling studios to fix years of anemic pay and Hollywood's attempts shorten TV seasons, hire fewer writers and potentially replace them with so-called 'AI' technology — as some of them poked fun at her on their picket signs due to recently resurfaced comments she made about unilaterally changing the scripts for her Addams Family spin-off series.",
        "BEST MOVIEScream VI (WINNER) BEST SHOWThe Last of Us (WINNER) BEST PERFORMANCE IN A MOVIETom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWJenna Ortega — Wednesday (WINNER)MOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER) BEST DUOPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)BEST SONGTaylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)",
        "Jenna's win was particularly impressive, as she was competing in a stacked category.Other stars vying for the golden popcorn included Aubrey Plaza, who was acclaimed for her role as a suspicious wife in the second season of HBO's hit series The White Lotus.Christina Ricci also scored a nod for her creepy role in Showtime's Yellowjackets, while Riley Keough was nominated for her Amazon series Daisy Jones &amp; The Six, which follows a fictional 1970s band inspired by Fleetwood Mac.Sadie Sink's standout turn in the fourth season of Stranger Things yielded a nomination, as did Selena Gomez's work in the Hulu comedy series Only Murders In The Building, on which she costars with Steve Martin and Martin Short.Although Jenna emerged triumphant, it was an anti-climactic moment, as she wasn't around in any capacity to accept the award.Some stars, including Pedro Pascal and Jennifer Coolidge, accepted their awards virtually, and both stated that they were in solidarity with striking writers.Although Drew Barrymore sat out her hosting gig, she made a live virtual appearance after winning the Best Host award, and she made sure to thank the writers of her hit talk show.But Ortega didn't even appear virtually to accept her award, so the show moved on without a pause. ",
        "Ortega has lately been in the news in connection with the WGA strike after comments she made in March on Dax Shepard's Armchair Expert podcast began making the rounds again.At the time, she revealed that she became 'unprofessional' on the set of Wednesday's by changing several of the title character's lines, contrary to what the screenwriters had come up with.'There were times on that set where I even became unprofessional in a sense where I just started changing lines,' she explained. 'The script supervisor thought I was going with something, and then I would have to sit down with the writers and they’d be like, \"Wait, what happened to the scene?\" And I would have to go through and explain why I couldn’t do certain things.'The creative team appear to have appeased her, as she was not a producer on the project, and an actor normally would not be given that kind of leeway on set to overrule writers, directors and producers.'Everything that she does, everything that I had to play, did not make sense for her character at all,' she complained, before noting some of the changes she made. 'Her being in a love triangle made no sense. There was a line about this dress that she has to wear for a school dance and she says, \"Oh my god, I love it! I can’t believe I said that. I literally hate myself.\" And I had to go, \"No, there’s no way.'",
        "Many striking writers have been writing humorous or punny statements on their signs, and some playfully poked fun at Ortega's statements.",
        "'Without writers, Jenna Ortega will have nothing to punch up!' joked House Party writer Brandon Cohen in a tweet posted by Variety on May 3.Earlier, the writer Nick Adams joked on Twitter that the self-described writer Ortega 'better be back from NY for her afternoon shift on the picket line.''Rewriting is writing! See you at the line, Jenna! [black heart emoji],' added Karen Joseph Adcock.Ortega's series Wednesday has been renewed for a second season with Netflix. ",
        "BEST MOVIEAvatar: The Way of WaterBlack Panther: Wakanda ForeverElvisNopeScream VI (WINNER)SmileTop Gun: MaverickBEST SHOWStranger ThingsThe Last of Us (WINNER)The White LotusWednesdayWolf PackYellowstoneYellowjacketsBEST PERFORMANCE IN A MOVIEAustin Butler — ElvisFlorence Pugh — Don’t Worry DarlingKeKe Palmer — NopeMichael B. Jordan — Creed IIITom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWAubrey Plaza — The White LotusChristina Ricci — YellowjacketsJenna Ortega — Wednesday (WINNER)Riley Keough — Daisy Jones &amp; The SixSadie Sink — Stranger ThingsSelena Gomez — Only Murders in the BuildingBEST HERODiego Luna — AndorJenna Ortega — WednesdayPaul Rudd — Ant-Man &amp; The Wasp: QuantumaniaPedro Pascal — The Last Of Us (WINNER)Tom Cruise — Top Gun: MaverickBEST VILLAINElizabeth Olsen — Doctor Strange in the Multiverse of Madness (WINNER)Harry Styles — Don’t Worry DarlingJamie Campbell Bower — Stranger ThingsM3GAN — M3GANThe Bear — Cocaine BearBEST KISS Anna Torv + Philip Prajoux — The Last Of UsHarry Styles + David Dawson — My PolicemanMadison Bailey + Rudy Pankow — Outer Banks (WINNER)Riley Keough + Sam Claflin — Daisy Jones &amp; The SixSelena Gomez + Cara Delevingne — Only Murders in the BuildingBEST COMEDIC PERFORMANCEAdam Sandler — Murder Mystery 2 (WINNER)Dylan O’Brien — Not OkayJennifer Coolidge — Shotgun WeddingKeKe Palmer — NopeQuinta Brunson — Abbott ElementaryBREAKTHROUGH PERFORMANCEBad Bunny — Bullet TrainBella Ramsey — The Last Of UsEmma D’Arcy — House of the DragonJoseph Quinn — Stranger Things (WINNER)Rachel Sennott — Bodies Bodies BodiesBEST FIGHTBrad Pitt (Ladybug) vs. Bad Bunny (The Wolf) — Bullet TrainCourteney Cox (Gale Weathers) vs. Ghostface — Scream VI (WINNER)Jamie Campbell Bower (Vecna) vs. Millie Bobby Brown (Eleven) — Stranger ThingsKeanu Reeves (John Wick) vs. Everyone — John Wick 4Escape from Narkina 5 — AndorMOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER)Jesse Tyler Ferguson — Cocaine BearJustin Long — BarbarianRachel Sennott — Bodies Bodies BodiesSosie Bacon — SmileBEST DUOCamila Mendes + Maya Hawke — Do RevengeJenna Ortega + Thing — WednesdayPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)Simona Tabasco + Beatrice Grannò — The White LotusTom Cruise + Miles Teller — Top Gun: MaverickBEST KICK-ASS CASTAnt-Man &amp; The Wasp: QuantumaniaBlack Panther: Wakanda ForeverOuter BanksStranger Things (WINNER)Teen Wolf: The MovieBEST SONGDemi Lovato — Still Alive (Scream VI)Doja Cat — Vegas (Elvis)Lady Gaga — Hold My Hand (Top Gun: Maverick)OneRepublic — I Ain’t Worried (Top Gun: Maverick)Rihanna — Lift Me Up (Black Panther: Wakanda Forever)Taylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST DOCU-REALITY SERIESJersey Shore Family VacationThe Real Housewives of Beverly HillsFamily Reunion: Love &amp; Hip Hop EditionThe Kardashians (WINNER)Vanderpump RulesBEST COMPETITION SERIESAll-Star ShoreBig BrotherRuPaul’s Drag Race: All-Stars (WINNER)The Challenge: USAThe TraitorsBEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)Joel Madden — Ink MasterNick Cannon — The Masked SingerRuPaul — RuPaul’s Drag RaceKelly Clarkson — The Kelly Clarkson ShowBEST REALITY ON-SCREEN TEAM (presented by SONIC®)Mike “The Situation” Sorrentino, Vinny Guadagnino, Pauly D (MVP) — Jersey Shore Family VacationTori Deal and Devin Walker — The Challenge: Ride or DiesRuPaul Charles and Michelle Visage — RuPaul’s Drag RaceAriana Madix, Katie Maloney, Scheana Shay, LaLa Kent — Vanderpump Rules (WINNER)Garcelle Beauvais and Sutton Stracke — The Real Housewives of Beverly HillsBEST MUSIC DOCUMENTARYHalftimeLove, LizzoSelena Gomez: My Mind &amp; Me (WINNER)SherylThe Day the Music Died: The Story of Don McLean’s American PieBEST MUSICAL MOMENT Sofia Carson's Come Back Home from the film Purple Hearts (WINNER) COMEDIC GENIUS AWARDJennifer Coolidge (WINNER)"
    ]
}