{
    "articleURL": "/news/article-12058675/How-street-parties-Kings-Coronation-compared-Queens-70-years-ago.html",
    "content": [
        "CORONATION LIVEBLOG: Follow all the latest royal news and updates on Coronation events here Beaming at long tables bedecked with food and drink, jubilant families are seen celebrating the coronation of the new monarch.",
        "The scenes yesterday after King Charles's crowning at Westminster Abbey echoed those that took place at street parties all around the country at the Queen's Coronation in 1953.And the celebrations were similar too in both 1937 - when King George VI was crowned - and in 1911, when King George V succeeded his father Edward VII as monarch.However, what successive generations of revellers were eating has changed. Whilst Britons tucked into the likes of quiche, crisps and sausage rolls yesterday, they were more likely to have enjoyed tea and scones or other simple treats back at previous coronations.  One image, taken yesterday in Mortlake, west London, shows young children and their parents tucking in to sweet treats in a street just a stone's throw away from one where, in 1953, families were pictured doing the same beneath bunting and the Union Jack.Another shot shows residents packed around a huge table in Kilburn, north  London are they tuck into quiche and other dishes yesterday. The image echoes the scenes in Edenvale, Fulham, back in 1937 when celebrations were held to mark the Coronation of King George VI ",
        "In Regent's Park yesterday, families tucked into sausage rolls, sandwiches, crisps and other snacks and wore paper crowns as they played a full part in the celebrations.  ",
        "As other images show, there was similar jubilation in Morpeth Street in London's East End and Kensington in the west of the capital back in 1953, when residents would have enjoyed less exciting sweet treats. ",
        "Whilst revellers yesterday tucked into quiche, crisps, sandwiches and cake, those celebrating the Queen's Coronation were more likely to have enjoyed tea and scones or even Coronation Chicken, the dish which was made to celebrate Her Majesty's crowning.  Yesterday, arguably the greatest concentration of loyal subjects were to be found in Richmond, where 198 road closures were booked for the weekend - representing an incredible one in five of the capital’s official street parties.Tanya Fell, 49, who organised one in Mortlake, said the borough was bursting with events because of ‘the sense of community round here’.‘People want to make the most of the coronation and are perhaps more royalist than elsewhere,’ she said.About 10,000 revellers in Morecambe Bay were aiming to smash the record for the longest street party.Some 900 tables were lined up along the promenade - nearly double the record-busting 500 tables laid out for the Queen’s Diamond Jubilee last year.Tracy Robbins, 51, who helped co-ordinate the bash, told the Telegraph: 'The weather is certainly helping - the sun has come out and it’s really quite warm.'",
        "Without doubt the smallest street party was in Buckinghamshire, where Milton Keynes Model Railway Society created a charming miniature knees-up, depicting a long row of tables groaning with food on a cobbled street. Members also made a tiny version of the Coronation procession.One of the most charmingly bizarre events was at Bude Sea Pool in Cornwall, where daring paddle boarders enjoyed a cream tea extravaganza on the water.The weekend's celebrations were due to cover the furthest reaches of the UK, from Scalloway in Shetland; to St Martin’s island in the Isles of Scilly.Events were held in the country’s easternmost point of Lowestoft, in Suffolk, and, more than 400 miles away to the west, at Enniskillen Castle in County Fermanagh, Northern Ireland.In 1953, whilst wartime rationing had not completely come to an end, by the time of the Coronation, on June 2, restrictions on sweets, chocolate, eggs and cream had been lifted, although sugar was still limited.  Even atrocious, unseasonal summer weather could not dampen the enthusiasm, just a rain on Saturday did not put a halt to celebrations in London and elsewhere.People began to bed down in the streets of London as early as 48 hours before the ceremony on Tuesday, just to make sure they had a standing place to watch the Queen pass by.",
        "By Monday evening, in pouring rain and driving wind, half a million people were already lining the procession route.The public were not the only ones making preparations. King Charles himself recalled the night before the big day, when he was aged just four.'I have vivid memories of the coronation; of my mother coming to say goodnight to my sister and me while wearing the crown so that she could get used to its weight on her head before the coronation ceremony; of thousands of people gathered in The Mall outside Buckingham Palace chanting 'We want the Queen' and keeping me awake at night,' Charles, who just four at the time, remembered.On the day, the festivities – 'Crowds singing in the rain', declared one national newspaper – was crowned with the news that climbers from a Commonwealth expedition had conquered Mount Everest, the highest mountain in the world.A smiling Queen Salote of Tonga won the hearts of the waiting crowds when she refused to raise the roof of her carriage for protection despite the rain.The coronation was shared with a wider audience through the relatively new medium of television, which came of age with the screening of the ceremony for the first time.",
        "Despite initial reservations, the Queen eventually agreed to the TV cameras being present in Westminster Abbey to capture the event.",
        "Licence holders doubled from one and a half million to three million in anticipation and many people rented a set for the day.An estimated 27 million people in Britain alone watched the coronation live on their black and white televisions, and the images were beamed around the world.The uncrowned Queen Elizabeth II – she actually wore the George IV Diadem on the journey – set out from Buckingham Palace in the Gold State Coach, escorted by the Yeomen of the Guard, the Household Cavalry and the Royal Bargemaster and Royal Watermen.Through the unwelcome drizzle, a continual roar followed the coach from the Palace, along The Mall, and in an extended circular route to Westminster.Some 65 years later in a BBC documentary about the day, the Queen recalled how the journey had been 'horrible'.'It's only sprung on leather,' she said of the coach, adding: 'Not very comfortable.'The Queen and the Duke of Edinburgh, who was in the full-dress naval uniform of Admiral of the Fleet, departed just after 10.30am pulled by eight grey geldings – Cunningham, Tovey, Noah, Tedder, Eisenhower, Snow White, Tipperary and McCreery.The sovereign's procession, as it entered the abbey, was 250-strong with traditional representatives from crown, church and state.Three bishops carried the paten (Eucharist plate), the chalice and the Bible. Peers carried the regalia from the Crown Jewels and the Lord High Steward carried St Edward's Crown.",
        "Others in the procession carried two royal maces, three swords symbolising mercy, spiritual justice and temporal justice, the Great Sword of State and St Edward's Staff.Just before she entered the church, the Queen is said to have paused, turned to her coronation maids of honour and asked: 'Ready girls?'The Queen recounted many years later how she had a problem getting started in her lengthy crimson Robe of State when her train became stuck on the new thick carpet in the Abbey.'I remember one moment when I was going against the pile of the carpet and I couldn't move at all,' she remarked.She is said to have asked for a push from the Archbishop of Canterbury Geoffrey Fisher, telling him 'Get me started'.Her coronation dress, by couturier Norman Hartnell, was a far cry from post-war clothing coupons.The white satin gown was encrusted with diamonds, gold and silver bullion, seed pearls, crystals, pale amethysts and sequins to create a shimmering effect.Embroidery in pastel-coloured silks depicted the emblems of the United Kingdom and countries of the Commonwealth.Her all-white bouquet echoed the symbolic theme of unity with orchids and lily of the valley from England, more orchids from Wales, stephanotis from Scotland, and carnations from Scotland and the Isle of Man.She wore a diamond collet necklace, made for Queen Victoria, and matching drop earrings, with the collar or chain of the Order of the Garter.",
        "The Chairs of Estate in which the Queen and Philip were seated during the first part of the coronation ceremony are now on the dais in the Throne Room at Buckingham Palace.The three-hour service, which took place in front of a congregation of more than 8,000, began with the Archbishop's declaration to the assembled bishops: 'Sirs, I here present unto you Queen Elizabeth, your undoubted Queen.'The Queen took the oath, finishing with the words: 'The things which I have here before promised, I will perform and keep. So help me God.'The Holy Communion and the act of anointing followed, hidden from the cameras and congregation by a silken gold canopy put over the Queen's head by Knights of the Garter.The archbishop made a sign of the cross on her hands, chest and head to anoint the Queen, who was sitting on the Coronation Chair, and having shed all her robes and adornments, and wearing a simple white dress.The anointing had the deepest significance and was the central act of the religious ceremony.The anointing oil contained oils of orange, roses, cinnamon, musk and ambergris. Usually a batch is made to last a few coronations, but in May 1941 a bomb hit the deanery, destroying the phial containing the existing oil so a new batch had to be made up.The pharmacy that mixed the last anointing oil had gone out of business, but the recipe was found.Having been sanctified, the sovereign was 'qualified and entitled' for investiture with the ornaments.She first put on the newly made Colobium Sindonis – a loose linen-lawn garment, and then a robe of cloth of gold – the Dalmatic or Supertunica, which was used by King George VI.The Lord Great Chamberlain presented the golden spurs, the symbol of chivalry, after which the Archbishop of Canterbury presented a jewelled sword, and then the armills, the golden bracelets of sincerity and wisdom.Finally, the Queen put on a stole and cloth of gold Robe Royal (Imperial Mantle) and received the orb, the coronation ring, the glove, which was newly made and presented by the Worshipful Company of Glovers, and the sceptres.The orb, made in 1661, was the most important part of the regalia after the crown.It is a globe of gold surrounded by a cross girdled by a band of diamonds, emeralds, rubies, sapphires and pearls with a large amethyst at the summit.Next came the crowning. The archbishop held the majestic St Edward's Crown above the 27-year-old Queen for a few moments and then brought it carefully down, placing it on her head.",
        "The crown, made in 1661, weighs 4lb 12oz and is made of solid gold.It was used by Charles II and is believed to have been adapted from one that belonged to Edward the Confessor.This done, all the princes and princesses, peers and peeresses put on their coronets and proclaimed: 'God Save the Queen.'",
        "Trumpets sounded and royal gun salutes were fired at the Tower of London and elsewhere.Homages from the archbishop, the Duke of Edinburgh and the senior nobility followed with the acclamation: 'God Save Queen Elizabeth. Long live Queen Elizabeth. May the Queen live forever.'Philip swore to be his wife's 'liege man of life and limb' and was the first layman to pay tender homage to the newly crowned monarch.Kneeling before her, he put his hands between hers and declared: 'I, Philip, Duke of Edinburgh, do become your liege man of life and limb, and of earthly worship; and faith and truth will I bear unto you, to live and die, against all manner of folks. So help me God.'He stood, touched her crown and kissed her left cheek.Unlike a Queen Consort, Philip, as the husband of a reigning queen, was not crowned or anointed at the coronation ceremony.But he did kneel beside her to receive a special blessing from the archbishop.It had been customary to proclaim a general pardon for criminals read out by the Lord Chancellor.This was abandoned but, before the coronation, the Queen declared an amnesty for deserters from the armed services.A further deviation from tradition was that a representative from outside the Anglican Church – the Moderator of the Church of Scotland – was present for the first time.Prince Charles watched in the abbey seated between his grandmother, the Queen Mother, and his aunt, Princess Margaret, and he became the first child in British history to witness their mother's coronation as a Queen Regnant.Princess Anne, who was two years old, was considered too young to attend.The sovereign finally withdrew to St Edward's Chapel, changed into the purple velvet Robe of Estate and put on the lighter Imperial State Crown for the journey back to the Palace.The longer seven-mile return procession was accompanied by 13,000 troops, 29 bands and 27 carriages and took two hours.Each Commonwealth prime minister had his own carriage and, for the first time, there was a shortage of professional coachmen.Millionaire businessmen and country squires offered to dress up as Buckingham Palace servants and drive the British and other prime ministers – an offer that could not be refused.Coronation chicken was invented for the foreign guests who were to be entertained after the coronation.Constance Spry, who also helped with floral arrangements on the day, proposed a recipe of cold chicken in a curry cream sauce with a well-seasoned dressed salad of rice, green peas and mixed herbs – a recipe that won the approval of the Minister of Works.Back at Buckingham Palace, the Queen, wearing her crown, and Philip appeared on the balcony with the other members of the royal family.Their children, Charles and Anne, were greeted with great excitement by the crowds.In her broadcast address to the nation the same evening, the young Queen thanked the public for their support.'All of you, near or far, have been united in one purpose. It is hard for me to find words in which to tell you of the strength which this knowledge has given me,' she said.",
        "She added: 'I have in sincerity pledged myself to your service, as so many of you are pledged to mine.'Throughout all my life and with all my heart I shall strive to be worthy of your trust.'The sixth and final appearance of the Queen and the duke on the balcony was at midnight.They waved to a huge cheering crowd which was still wild with excitement.Bowler hats were held high on umbrellas, balloons were released and streamers festooned the Palace railings.The night came to an end as hundreds of thousands on Victoria Embankment watched a spectacular coronation fireworks display."
    ]
}