{
    "articleURL": "/news/article-12061603/Ralph-Gonsalves-Terrance-Drew-say-having-King-Charles-head-state-absurd.html",
    "content": [
        "Ralph Gonsalves said he wanted to see country severed from the monarchy Terrance Drew claimed his country is 'not totally free' while he is its head of stateREAD MORE: King Charles hails the outpouring of celebration for his CoronationThe Prime Minister of Saint Vincent and the Grenadines said having King Charles III as the head of state is 'absurd'. ",
        "Ralph Gonsalves said he wanted to see his country severed from the monarchy within his lifetime and do away with 'the absurdity'. The 76-year-old said he would also welcome an apology from the UK state for past injustices relating to slavery. He told BBC Radio 4's the World At One programme: 'It's something that I'm hoping to see consummated, the severing of the umbilical cord between our country and the British monarch.'King Charles knows that, he and I have discussed that in very amicable ways, but Saint Vincent and the Grenadines will remain in the Commonwealth.",
        "'The King is understanding of the impulses of former colonial peoples to cut the links.'Mr Gonsalves is the second Caribbean leader to call for an end to links with the monarchy since King Charles' Coronation. Terrance Drew, of St Kitts and Nevis Labour party who won a snap election in August, claimed his country is 'not totally free' while King Charles is its head of state, signalling the eastern Caribbean county could be the next to become a republic.   He told the BBC a public consultation on whether the Commonwealth realm nation should become a republic will start during his leadership. Dr Drew has also called on the monarchy to apologise for its historic links to the slave trade, according to the BBC.",
        "Buckingham Palace said King Charles III takes slavery 'profoundly seriously', amid his support for a landmark study into historical links between the monarchy and slavery.St Kitts and Nevis prime minister Dr Drew was among world leaders who posed in a group photograph with Charles after attending a Commonwealth reception at Marlborough House in London on Friday, ahead of the Coronation at Westminster Abbey on Saturday.",
        "King Charles is sovereign of 14 Commonwealth realms in addition to the UK, while the Commonwealth as a whole is a voluntary association of 56 independent nations, almost all of which were formerly under British rule.",
        "Ahead of the Coronation, representatives from 12 Commonwealth countries joined forces to call on Charles to acknowledge and apologise for the impacts and ongoing legacy from British 'genocide and colonisation'.It comes amid a republican push across the Commonwealth, with Barbados becoming a republic in 2021 when it replaced the late Queen with a president as its head of state.There has since been speculation that other countries, such as Jamaica, could follow suit.Last year, Jamaica said that it plans to pursue independence, and in February Australia decided to remove the British monarch from the last of its banknotes, although an image of Charles is expected to feature on coins.",
        "Ahead of the Coronation, a poll suggested that nearly half of the King's realms, including Canada and Australia, would vote to become republics if a referendum was held tomorrow.Research by former Conservative deputy chairman Lord Ashcroft found that of the 14 overseas countries where he is head of state, six - Australia, Canada, the Bahamas, Jamaica, the Solomon Islands, and Antigua and Barbuda – would vote to ditch the monarchy.",
        "Last week, New Zealand Prime Minister Chris Hipkins said that he personally favours his country - which is self-governing but sees Charles retaining a largely ceremonial role as head of state and King - becoming a republic.In early April, Charles expressed his support for the first time for research into the historical links between the British monarchy and the transatlantic slave trade.",
        "Buckingham Palace said the royal household will help with the academic project by offering access to the Royal Collection and the Royal Archives.The research is expected to analyse previous rulers' involvement with slave-trading companies, including the Royal African Company and its deputy governor, Edward Colston, whose statue was thrown into Bristol Harbour by anti-racism protesters. Charles's support for the academic work, carried out by the University of Manchester with Historic Royal Palaces, was welcomed by researchers and campaigners.",
        "But others voiced fears it could open the door to the Royal Family and the Government facing demands to pay compensation, or reparations, for their role in the slave trade and colonialism. Speaking in the St Kitts and Nevis capital Basseterre, Dr Drew told the BBC that the research was a 'step in the right direction'.'I think that acknowledging that... something wrong was done, acknowledging it and apologising for it, is a step in the right direction,' he reportedly said.A Buckingham Palace spokesperson said: 'This is an issue that His Majesty takes profoundly seriously.'They cited a speech by Charles to Commonwealth leaders in Rwanda last year, when he said: 'I cannot describe the depths of my personal sorrow at the suffering of so many, as I continue to deepen my own understanding of slavery's enduring impact.'The spokesperson added: 'That learning process has continued with vigour and determination since His Majesty's Accession.'As one part of it, the Royal Household is supporting Historic Royal Palaces' independent research project that is exploring, among other issues, the links between the British Monarchy and the Trans-Atlantic slave trade during the late 17th and 18th centuries.'On the references to republics, the spokesperson added: 'His Majesty has long acknowledged the discussion about constitutional arrangements with the royal family.",
        "In his Rwanda speech, Charles said: 'I want to say clearly, as I have said before, that each member's constitutional arrangement, as republic or monarchy, is purely a matter for each member country to decide.'The benefit of long life brings me the experience that arrangements such as these can change, calmly and without rancour.'Last week, the late Queen's only daughter Princess Anne, 72, distanced the Windsors from the slave trade amid calls for Britain and the royals to pay compensation.When asked about what her brother meant about 'support', she said:  'It's not really a subject of conversation that I would even go down. I have a historical perspective which is slightly different, maybe more realistic.''The historical perspective [is] it just goes back a lot further. And the modern contexts are very different. Slavery hasn't gone away.'The future role of the monarchy in the realms came under renewed scrutiny following the death of the Queen and controversies surrounding royal trips to Caribbean countries by the Prince and Princess of Wales and Duke and Duchess of Edinburgh last year.Prince William and Princess Kate's royal trip in March 2022 to Belize, Jamaica and the Bahamas was criticised over allegedly 'tone deaf' images, which critics claimed were reminiscent of colonial days.",
        "The controversial photos showed the couple, then known as the Duke and Duchess of Cambridge, shaking hands with Kingston crowds behind a mesh wire fence, and standing in the back of a Land Rover.Belize locals also claimed they were not consulted about a royal engagement, and the couple were met with calls for slavery reparations from the monarchy in Jamaica. The Duke and Duchess of Edinburgh, Prince Edward and his wife Sophie also faced calls for reparations during their tour of Antigua and Barbuda, St Lucia, and St Vincent and the Grenadines in April 2022. "
    ]
}