{
    "articleURL": "/news/article-12050133/Is-Morrisons-open-Coronation-bank-holiday-Opening-times-revealed.html",
    "content": [
        "Morrisons confirms opening times for coronation day, Bank Holiday Monday Ahead of King Charles' coronation, popular supermarket brand Morrisons has revealed its opening hours for the upcoming Bank Holiday. ",
        "Different opening hours may be in place at your nearest Morrisons branch, depending upon its size and location. It is the second Bank Holiday to fall in May 2023, after the traditional early May Bank Holiday. So, will Morrisons be open on coronation day? Will hours change due to the occurrence of another Bank Holiday? Read on below for everything you need to know about Morrisons opening times over the coronation weekend. ",
        "Is Morrisons open on coronation day?Morrisons opening times will remain as normal over the weekend of King Charles' coronation.Morrisons stores will open from either 6am or 7am before shutting at 10pm or 11pm on Saturday. Morrisons Sunday opening hours will also remain the same due to Sunday trading laws.This is usually either 10am until 4pm or 11am until 5pm, for stores in England and Wales.In Scotland, stores are typically open 8am until 8pm on Sundays.Is Morrisons open on bank holidays? For the Monday bank holiday, which falls on 8 May, Morrisons stores will open at their usual time but will close at 8pm, slightly earlier than normal.Customers should check their local store times on Morrisons’ store finder.Like many other supermarkets, Morrisons is launching a special promotion for the coronation weekend, with discounts on a number of different products. Its websites states: 'From throwing a street party to royally ravishing recipes, enjoy ideas and inspiration to help you make it a weekend fit for royalty. ",
        "Do you have to pay for Morrisons delivery?Customers not aware of a potential offering from Morrisons could be missing out on the chance to have free delivery when they shop online. Through a scheme called the Morrisons Delivery Pass, customers can shop online as often as they like without having to pay for delivery every time they checkout. To get free Morrisons deliveries, all you have to do is choose the length of your delivery pass and when you want your deliveries.Passes are available at varying different lengths and times of the week. For deliveries between Tuesdays and Thursdays, a monthly pass costs £5, with a six-month delivery pass available for £25. To get free Morrisons deliveries all year round, an annual pass will set you back £40. If you are looking for grocery deliveries from Morrisons from Monday to Sunday for extra flexibility, the cost rises to £8 for a weekly pass, £45 for a six-month pass and £70 for an annual pass.  "
    ]
}