{
    "articleURL": "/wires/ap/article-12045017/Bryant-Blackmon-homer-Rockies-beat-Brewers-7-1.html",
    "content": [
        "DENVER (AP) - Kyle Freeland pitched five scoreless innings, Kris Bryant and Charlie Blackmon homered and the Colorado Rockies beat the Milwaukee Brewers 7-1 on Wednesday night for their season-best third straight win.",
        "Alan Trejo hit a three-run double and Elías Díaz had an RBI single for Colorado, which improved to 9-3 in its last 12 games against the Brewers.Already ahead 4-0, the Rockies added to their lead in the seventh when Jurickson Profar doubled off Tyson Miller and Bryant launched his fourth homer. Blackmon connected for a solo shot off Jake Cousins in the eighth.\"We´re just getting comfortable with the groove of the season,\" Bryant said. \"These last three games have been great. We´ve got to keep chipping away. The pitching has been great, really good defense and situational hitting. We keep doing that the best we can and usually we get a good result out of it.\"Eric Lauer (3-3) went 4 2/3 innings for Milwaukee, allowing four hits and four runs - none earned. Third baseman Mike Brosseau made a throwing error in Colorado's four-run fourth.\"We gave them too many outs,\" Brewers manager Craig Counsell said. \"They put together some good at-bats. Eric got a big strikeout to get to two outs, but it´s that one extra out they got that ended up being the big blow.\"",
        "Freeland (3-3) gave up three hits, walked none and struck out five in snapping his three-game losing streak. Five relievers finished a five-hitter.",
        "Freeland felt a twinge in his neck after his first pitch in the fifth but was checked by team trainers and finished the inning, striking out the side before being lifted. He said after the game that he tweaked a neck muscle during a weightlifting session four days ago but got treatment, felt good enough to make his start and expects to take his next turn on schedule, too.\"I´m not too concerned about it,\" Freeland said. \"We´ve got great trainers here who will take care of me and we´re going to get this taken care of and make sure I´m ready to go in five days.\"Milwaukee scored in the ninth on a sacrifice fly by Tyrone Taylor.TRAINER´S ROOMRockies: RHP Antonio Senzatela is expected to come off the injured list to start Friday night's series opener at the New York Mets in his season debut. It will be the first outing for Senzatela since surgery to repair a torn left ACL he sustained last August attempting to field a grounder.UP NEXTBrewers: LHP Wade Miley (3-1, 1.86 ERA) starts Thursday´s series finale.Rockies: RHP Connor Seabold (0-0, 5.27) is scheduled to make his first start of the season Thursday, replacing injured Germán Márquez in the rotation. Seabold has made seven relief appearances over two stints with the Rockies.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}