{
    "articleURL": "/tvshowbiz/article-12056053/Courteney-Cox-Kaley-Cuoco-look-effortlessly-chic-casual-outfits-Rock4EB-fundraiser.html",
    "content": [
        "Courteney Cox and Kaley Cuoco were seen at the Rock4EB! fundraiser in Malibu, California on Saturday.",
        "The 58-year-old Friends actress looked elegant in a cream cardigan and figure-hugging jeans while The Big Bang Theory alum, 37, rocked a colorful flannel button-up with maxi skirt at the event.The Scream vet — who recently said she regrets 'frying' her skin with too much tanning in her 20s — left the top button of the low-cut cardigan unbuttoned to show off a delicate lace camisole.The entrepreneur accented her look with a skinny belt, a structured shoulder bag, and pointed-toe leather boots all in black.The annual event is held to benefit the fight to find a cure for epidermolysis bullosa — a rare and life-threatening skin condition.",
        "Cox styled her raven black, collarbone-length tresses in casual, beach waves and opted for a minimal makeup look to showcase her radiant beauty.For accessories, she donned a pair of gold hoop earrings as well as a silver chain and dainty pendant necklace. Cuoco — who recently welcomed her first child with boyfriend Tom Pelphrey — opted for a casual yet chic ensemble for the fundraiser. She sported an oversized unique flannel top with a long skirt and white sneakers.The new mother threw up her blonde tresses into a messy bun and wore layers of necklaces around her neck to jazz up her look. ",
        "Tiffany Haddish looked elegant in a plunging, halter-style maxi dress adorned with a colorful floral pattern. Over the dress, the stand-up comedian sported a tight-fitting navy blue jacket and a black, leather crossbody bag. The actress also modeled a statement necklace with a silver horse head as the pendant. ",
        "Billie Lourd looked effortlessly stylish in a loose-fitting black dress decorated with delicate floral embroidery and silver buttons down the garment. The American Story actress wore a sharp black blazer jacket and a pair of leather combat boots. Rande Gerber and Cindy Crawford were also seen at the event in matching denim jeans. The businessman sported a gray T-shirt underneath a light green denim jacket. The supermodel opted for a chic white sweater and accessorized with a brown fedora hat. Catherine Bell modeled a plunging taupe dress decorated with asymmetrical fringe at the bottom. The JAG actress teamed the bohemian-inspired garment with a pair of gray cowboy boots. She also styled her jet black bob in slight waves and accessorized with silver hoop earrings. ",
        "Catherine O'Hara was also seen at the event with her longtime husband, Bo Welch.The Schitt's Creek actress looked radiant in a checkered button-down underneath a pastel pink blazer. And she paired the look with denim jeans and white Converse sneakers.",
        "By her side, the production designer and film director sported a light blue button-up top with a navy cardigan and medium-wash denim jeans.He finished off the look with a stylish pair of green-gray, suede Chelsea boots. Brandi Carlile looked fancy and fashionable in a light pistachio green pantsuit. For the occasion, the singer-songwriter donned the polish set over an off-white, silk button-down top and wore pointed-toe, camel brown boots. Iris Apatow wowed in an off-shoulder, burgundy top and low-waisted denim jeans as well as a pair of patent leather, bright red ballet flats. The actress rocked a bold red lip and slicked back her brunette tresses into a sleek, polished updo.",
        "David Spade and Dana Carvey were also seen at the fundraiser in stylish jackets.The stand-up comedian donned a bright blue puffer jacket over a navy top and black pants while the solo comedian and screenwriter sported a leather bomber jacket over a black sweater and gray pants.Kevin Nealon bundled up in green flannel and gray heathered jacket over a burgundy sweater. The comedian teamed the look with dark-wash denim jeans and black sneakers. Ed O'Neill and Catherine Rusoff also attended the fundraiser with their daughters, Sophia and Claire. The married couple sported matching black outerwear while their daughters matched in brown and white cardigans as well as light-wash denim jeans. ",
        "The wife of Jimmy Kimmel — Molly McNearney — and filmmaker Judd Apatow as well as the talk show host himself were also seen posing together at the event. "
    ]
}