{
    "articleURL": "/news/article-12053883/King-Charles-Coronation-Anthony-Albanese-Jodie-Haydon-arrive-Westminster-Abbey-Sam-Kerr.html",
    "content": [
        "Prime Minister Anthony Albanese and Jodie Haydon arriveProcession of high-profile Australians entered Westminster AbbeyMatildas caption Sam Kerr, a flagbearer, wore black suit The group of high-profile Australians handpicked to attend the Coronation of King Charles III have arrived at Westminster Abbey.",
        "Prime Minister Anthony Albanese and Jodie Haydon held hands as they entered with other heads of state from around the world. Ms Haydon wore a royal blue dress and matching hat while Mr Albanese donned a navy suit with a red speckled tie.Soccer superstar and Matildas captain Sam Kerr, who is Australia's flagbearer, wore a smart black suit as she led the cohort of Australians inside the church.New Zealand Prime Minister Chris Hipkins was also seen in the procession, alongside Canada's leader Justin Trudeau.Governor General David Hurley walked ahead of Mr Albanese and Ms Haydon and was joined by his wife Linda Hurley.",
        "Australian singer and songwriter Nick Cave was pictured beside the former Archbishop of Canterbury Rowan Williams as he arrived at Westminster. Cave told reporters he was 'slightly nervous' ahead of the procession. 'But it's a lovely affair isn't it?' he said.Julie Bishop wore an elaborate hat and designer beige dress to the Coronation, and scored a prime spot beside American musician Lionel Richie. The 66-year-old shared a glimpse inside Westminster Abbey ahead of the ceremony to her Instagram Stories.'And I take my seat at the Coronation next to Lionel Ritchie, Prince's Trust Global Ambassador,' she wrote in her caption.On Friday, Ms Bishop shared a photo of herself in London alongside her 'plus one' 16-year-old Tayla Green-Aldridge.",
        "'We at Prince's Trust Australia are thrilled that Tayla Green-Aldridge, a proud young Wiradjuri and Yuin woman from NSW and a recent graduate of @princes.trust.au,' she wrote in her Instagram caption.'Her first trip overseas, in fact her first time on a plane, Tayla is taking London - and the Australian media - in her stride! Congratulations to all Prince's Trust alumni who will be witnessing this historic occasion,' Ms Bishop, who is chair of the Princes Trust, added.",
        "Other notable Australians attending include Dr Daniel Nour, who founded Street Side Medics, a not-for-profit, GP led mobile medical service for people experiencing homelessness, and Rhodes Scholar Yasmin Poole. London-based nurse Emily Reegan is also at the event. She worked for the NHS in the emergency department during the peak of the Covid pandemic.  Australian comedian Adam Hills joked he had planned his toilet breaks ahead of the Coronation and said he was keen to do some star-spotting inside the Abbey.  'I've done the dry run, I had a coffee and juice yesterday and went four hours without (going to the toilet) this is the real run, it will be a doddle,' he told reporters outside. 'The worst part is over, there's no stress mate, I managed to get here before the traffic in the crowds. It's gonna be a hell of a show.'",
        "King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year.At Saturday's coronation, he and Queen Consort Camilla will be officially crowned by the Archbishop of Canterbury, Justin Welby."
    ]
}