{
    "articleURL": "/tvshowbiz/article-12057993/Sunrise-host-Edwina-Bartholomew-buys-country-hotel-selling-inner-west-Sydney-home.html",
    "content": [
        "Sunrise presenter Edwina Bartholomew has purchased a 177-year-old country hotel in rural NSW after selling her inner-west Sydney home in March for $2.1million.",
        "The newsreader-turned-property flipper, 39, shared a video to Instagram on Sunday showcasing her new property in Carcoar, 260ks west of Sydney.Bartholomew's property, known as 'The Victoria Hotel', was built in 1846 and she has plans to renovate it so it could one day reopen for business.The video captured inside the two-storey historical property and its stunning architectural design, including a beautiful balcony and French windows.She captioned the footage with some exciting words. ",
        "'In 1846, it was built on the banks of the Belubula River in Carcoar. 177 years later, on the same land, The Victoria returns to welcome a new generation of guests,' she wrote.'A new chapter for the town time forgot. A new full-time project for us. A new side hustle for me in addition to waking up with you every morning on @sunriseon7.'Reopening 2025 (with a lot of Fawlty Towers updates to come between now and then),' she added.",
        "Back in March, Bartholomew announced she and her husband Neil Varcoe had secured a buyer for their renovated three-bedroom, two-bathroom property in inner-Sydney.She  posted a photo on Instagram of the 'for sale' sign outside the home with a huge 'sold' sticker plastered on the front of it.'Our lovely little house is now another couple's home. Let the next renovation adventure begin (again),' she wrote.",
        "She previously said she did not originally plan to sell the stone brick 1880s-era house, but the couple decided to let it go after finding another renovation project.'We've found this other project that we want to take on and it feels right,' she told Realestate.com.au.Bartholomew, who shares daughter Molly, two, and, one-year-old son Tom, with husband Neil, a former executive at Twitter Australia, said moving out had been hard for her.'I get emotional when I think about everything that's happened in this house. It's where we started our family. It's such a special place that we love so much,' she said."
    ]
}