{
    "articleURL": "/wires/pa/article-12043519/Trump-lawyers-say-won-t-call-witnesses-rape-trial.html",
    "content": [
        "Donald Trump’s lawyers have said they will not call any witnesses at the New York civil trial arising from writer E Jean Carroll’s claims that the former president raped her in the mid-1990s.",
        "Trump lawyer Joseph Tacopina said they decided not to put on a defence case after learning that health issues were preventing their expert witness, a psychiatrist, from giving evidence.Mr Tacopina had previously said Mr Trump would not give evidence at the trial in federal court in Manhattan.Ms Carroll’s lawyers said they could finish presenting their case on Thursday.They listed five remaining witnesses, including a former People magazine writer who says Mr Trump pinned her against a wall and forcibly kissed her at his Mar-a-Lago mansion in Florida in 2005, an allegation he denies.They also plan to play excerpts of a sworn deposition Mr Trump gave in connection with Ms Carroll’s lawsuit, as well as a the 2005 Access Hollywood tape in which he boasted about grabbing women’s genitals.The former president denies touching women against their will and has said Ms Carroll’s claims are politically motivated attempts to smear his reputation and deny him the White House.His lawyers attacked her credibility through exhaustive cross-examination, questioning why she did not scream for help during the alleged attack and why she never went to police.A psychologist giving evidence on her behalf said on Wednesday that it is common for rape victims to fall silent and blame themselves.",
        "The case is not being heard on Fridays, meaning jurors could hear closing arguments and start deliberating next week.“I think you can reasonably expect to get the case early next week,” Judge Lewis Kaplan told jurors.Earlier on Wednesday, a clinical psychologist hired by Ms Carroll’s lawyers said she shows common signs of trauma.Leslie Lebowitz said Ms Carroll has avoided intimate relationships, sometimes shutting down during dates, and often finds herself fending off “intrusive memories” of what she says Mr Trump did to her in a dressing room at a luxury Manhattan department store.Giving evidence for a second day, Ms Lebowitz relayed decades of clinical expertise and her observations of Ms Carroll during interviews in preparation for trial. Ms Carroll told the court last week that Ms Lebowitz is the only mental health professional she has spoken to since the alleged sexual assault.“For many years, she just simply blamed herself for the assault, thought she just did something stupid and that’s why it happened,” Ms Lebowitz said.For 17 years, Ms Carroll did not speak publicly about the event, but in a 2019 memoir she described how a sometimes flirtatious chance encounter with Mr Trump at the store in spring 1996 ended with violence when he cornered her in a dressing room after they challenged each other to try on a piece of lingerie.",
        "Ms Carroll is an “extremely resilient person”, Ms Lebowitz said, explaining that her persona as a popular Elle magazine advice columnist and her Mid West upbringing combined to lead her to try to keep her experience with Mr Trump secret.“It made her feel she was worthless. She felt degraded, diminished,” Ms Lebowitz said. “Ms Carroll, like most of us in many ways, doesn’t want to be a victim, doesn’t want to be pitied. But more than most people, she is fiercely identified as… the person who can march on… and put it behind you.”"
    ]
}