{
    "articleURL": "/tvshowbiz/article-12042701/Britains-Got-Talent-fans-inundate-Ofcom-complaints-ITV-aired-dangerous-stunt.html",
    "content": [
        "Britain's Got Talent fans inundated Ofcom with 83 complaints after ITV aired a very dangerous stunt during Saturday night's episode.",
        "The chilling act saw contestant Andrew Stanton lift judge Amanda Holden, 52, from the ground with a chain attached to his eyeballs.He'd tied his own arms around his back, picked up a sword with his mouth and swallowed it.Andrew then put three sharp long knives in his mouth as his assistant fiercely pushed them down his throat with a frying pan.Simon Cowell even branded the performance the most 'disgusting' in the show's 16-year history.",
        "Judges Alesha Dixon and Bruno Tonioli had to look away, horrified by the scene.Amanda was asked to lay down on a platform attached to a chain, which was hooked and suspended by his eyes.As Andrew lifted her from the floor - Simon was left in shock while Bruno and Alesha couldn't dare to look.'Stop it, man! What's the matter with you?!' said Declan Donnelly desperately.'That was horrific,' said Amanda as she was freed from the chains.Dec added: 'We've never seen anything like that before.' Simon sarcastically commented: 'I mean this as a compliment, it was the most disgusting thing I've ever seen.' Alesha remarked: 'You took it to another level.'",
        "The show had returned to screens for the latest series, with some fans unimpressed by the 'dangerous' acts shown on screen.TV regulator Ofcom confirmed it received 83 complaints.",
        "A Britain's Got Talent spokesperson told MailOnline: 'BGT has often featured acts by highly trained performers.'Throughout the act, viewers were given an explicit \"Do Not Try This at Home\" warning on screen and we expressly warned our audience not to try to imitate Andrew's performance.'Before our act performed, there was also a verbal warning in the announcement that informed our viewers that the programme contained some dangerous stunts.'Last month, Britain's Got Talent found itself embroiled in another Ofcom storm as the show received over 400 complaints from outraged viewers.According to The Mirror, the ITV talent show received 66 complaints from viewers on April 15 which jumped to 334 the following day.Auditionee Thomas Vu had set himself on fire while trying to solve a Rubix Cube, which unimpressed many viewers.",
        "Taking to Twitter, one outraged viewer said: 'I'm sorry but matey setting himself on fire was foul. That's not entertainment. Can't bear these dangerous acts each year.'Another added: 'I mean kids watch this. How is someone setting themselves on fire a bloody good example.'A third wrote: 'Who decided to set themselves on fire while solving rubix cubes? There's a fine line between talent &amp; stupidity.'Other viewers were left disgusted by Saturday's opening episode which featured a man who popped balloons with his farts.",
        "Ichikawa Koikuchi from Japan raised eyebrows with his act, which even saw Simon Cowell go up on stage to help him when he kept missing hia target.One viewer said: 'At one time, this type of \"act\" would never had got through. But curiously, the new look Simon said Yes. How low the depths of BGT has fallen. It really is a load of hot air!'Another added: 'I think you've just reached a new low #BGT,' while a third agreed, saying: 'And so a new low was reached #BGT'."
    ]
}