{
    "articleURL": "/wires/reuters/article-12041575/Sudans-history-coups-wars-instability.html",
    "content": [
        "May 3 (Reuters) - Sudan, which has been in the grip of a bloody power struggle between the army and a paramilitary group for three weeks, has a history of civil wars, military takeovers and rebellions.",
        "The commanders of the army and paramilitary Rapid Support Forces, who shared power as part of an internationally backed transition to democratic rule, have shown no sign of compromise.Here are some major episodes of political turmoil and conflict in Africa's third largest country:* 1985. President Jaafar Nimeiri, who seized power in a coup in 1969, is ousted after a popular uprising. Another military commander takes charge, promising elections in a year. The vote held in 1986 heralds a three-year period of civilian rule.* 1989. Omar al-Bashir, an army general, stages a coup and starts three decades in power with support from Islamist army officers and initially with the backing of influential politician Hassan al-Turabi, seen as the spiritual leader of Sudan's Islamists. Turabi later breaks ranks with Bashir.* 1996. Under pressure from the United States, the Sudanese government tells Osama Bin Laden, the leader of Al Qaeda, to leave Sudan in May 1998 after he has spent five years in the country as an official guest.* 1998. The United States fires missiles at El Shifa medicine factory in Khartoum. U.S. officials say it was producing chemical weapons ingredients and was partly owned by Bin Laden. Sudan says it was only making pharmaceutical drugs.* 2003. A conflict in Sudan's western Darfur region flares, pitting rebels against government forces backed by a militia known as \"Janjaweed\", which roughly means \"devils on horseback\". Some 300,000 people are killed and millions are displaced. Violence persists even after a peace deal is reached in 2020.",
        "Bashir is charged by the International Criminal Court with orchestrating genocide and other atrocities in Darfur.* 2005. Sudan's northern-based government and rebels in the south of Sudan sign a peace deal after two decades of fighting in Africa's longest running civil war that led to the deaths of 2 million people. The deal provides for a referendum on southern secession. South Sudan declares independence in 2011.* 2019. Bashir is toppled after a popular uprising. This is followed by a period of rising tension between the army and civilian politicians over the transition to democratic rule.* 2023. After protests against the military, fighting erupts on April 15 between the army led by General Abdel Fattah al-Burhan, head of Sudan's ruling council, and the RSF paramilitary, led by General Mohamed Hamdan Dagalo, known as Hemedti, who is Burhan's deputy in the council.(Compiled by Michael Georgy; Editing by Edmund Blair)"
    ]
}