{
    "articleURL": "/sport/football/article-12045999/Manchester-United-hit-rock-bottom-Brighton-year-Erik-ten-Hag-restored-fear-factor.html",
    "content": [
        "Manchester United head to Brighton in the Premier League on Thursday nightReds have only won at an empty Amex Stadium during Covid restrictionsTen Hag's side are a very different proposition to side that crashed there in 2022 It was the afternoon Manchester United bottomed out. Interim manager Ralf Rangnick had long since given up and so had most of the players as they crashed 4-0 at Brighton in May last year.",
        "The result confirmed United couldn't qualify for the Champions League - which given the dire state of affairs at that moment, was probably just as well - and underlined in bold just how much of a rebuilding job Erik ten Hag had on his hands.Not only was this United side hopeless against the very top teams in the Premier League, they looked startlingly inferior to mid-ranking ones as well.Unable to win on the road to save their life - that was their fifth consecutive away league loss - they conceded three times in 11 second-half minutes in a capitulation that actually surprised nobody.Rangnick had already said the squad needed 'open-heart surgery' to compete for honours again and anybody at the Amex that day would have agreed with his headline-grabbing diagnosis.",
        "As United return to Brighton on Thursday night, an awful lot has changed. Ten Hag has turned United into a winning machine again - to a point - and the outlook is significantly brighter.It could be said Dr Ten Hag has performed 'open-heart surgery' on United but actually only four players from last May's starting line-up now play elsewhere.Cristiano Ronaldo, Juan Mata and Nemanja Matic have left United, while Alex Telles is out on loan at Sevilla. Jesse Lingard and Edinson Cavani, of the substitutes from last May, have also departed.",
        "Yet the team now looks infinitely more resilient at the back and potent going forward. Of that starting XI, only David de Gea, Raphael Varane and Bruno Fernandes remain regulars.Others including Diogo Dalot, Victor Lindelof, Scott McTominay and Anthony Elanga have seen more of the subs' bench since Ten Hag came in.There had to be a new broom and a clear-out when Ten Hag came in, plus plenty of quality acquisitions, and the United team that runs out at the Amex on Thursday night will be a lot more intimidating.Lindelof will be in central defence again, alongside Luke Shaw, but that's only because of injury issues at the back.Fernandes will also start, as he always does, but surrounded by players who weren't there last season in Casemiro, Christian Eriksen, Antony and Marcel Sabitzer.",
        "Line-up in 4-0 defeat last seasonDe Gea; Dalot, Lindelof, Varane, Telles; McTominay, Matic (Cavani); Elanga (Fred), Mata (Maguire), Fernandes; RonaldoProbable line-up on ThursdayDe Gea; Wan-Bissaka, Lindelof, Shaw, Malacia; Casemiro; Antony, Sabitzer, Eriksen, Fernandes; Rashford",
        "Marcus Rashford missed last season's visit because he had bronchitis but with the England striker in the form of his life, Brighton will be genuinely fearful.Ten Hag has restored a bit more of an intimidation factor to United this season, but that hasn't necessarily translated into away wins over their peers in the upper reaches of the table.",
        "Fulham remain the only team in the current Premier League top half United have managed to beat away from home and Brighton, with their European ambitions, will be no pushovers.We saw that at Wembley just a couple of weeks ago when a fatigued and labouring United needed penalties to reach the FA Cup final.Indeed, Brighton are something of a bogey team for the Reds. They won 2-1 at Old Trafford in Ten Hag's first competitive match in charge back in August.What's more, United have never won at the Amex when there has been a crowd present.Nobody would consider it the most intimidating stadium to visit - to the point that Brighton often serve ales sourced from close to the visiting club in the away section to make fans feel welcome - but United often come unstuck there. Jose Mourinho's team lost 1-0 to a Pascal Gross goal in 2017-18, Brighton's first Premier League campaign.United also went down 3-2 early in the following campaign thanks to a calamitous first-half.During Project Restart in June 2020, Ole Gunnar Solskjaer's men convincingly won 3-0 and there was an identical scoreline in the Carabao Cup in September 2020, both in front of no spectators.",
        "May 4, 2018 - Brighton 1 Man United 0August 19, 2018 - Brighton 3 Man United 2June 30, 2020 - Brighton 0 Man United 3*September 26, 2020 - Brighton 2 Man United 3*September 30, 2020 (Carabao Cup) - Brighton 0 Man United 3*May 7, 2022 - Brighton 4 Man United 0* Played behind closed doors ",
        "That last one came a few days after United won 3-2 in the league, but only courtesy of a Fernandes penalty awarded by VAR for handball after referee Chris Kavanagh had blown for full-time.Last season's 4-0 demolition, thanks to goals by Moises Caicedo, Marc Cucurella, Gross and Leandro Trossard, was a modern era nadir for United as a club.As mentioned, a lot of the personnel remain in the squad but Ten Hag has upgraded the team emphatically thanks to a transfer spend of over £200million in his first summer.The players he inherited heaven't always been moved on, just demoted to bit-part roles. A midfield combination of Casemiro and Eriksen is obviously an improvement on Matic and McTominay.",
        "Likewise a forward line of Rashford, Fernandes and Antony looks much better than one containing Elanga and Mata, with Lingard and Cavani the options off the bench.Almost a year on from that four-goal drubbing, United return to Brighton in a much stronger place and with the intention of getting much better yet.Ten Hag has ended the trophy drought by winning the Carabao Cup and the FA Cup could follow next month. Win, or even draw, on Thursday night and a Champions League spot should be secure.More survivors from last year's team are likely to be shipped out this summer and replaced by high quality upgrades in Ten Hag's image.",
        "Roberto De Zerbi's Brighton are well equipped to expose United's remaining limitations. But the opponents Brighton face on Thursday are a totally different proposition to that golden afternoon a year ago."
    ]
}