{
    "articleURL": "/news/article-12046047/Three-teens-appear-court-murder-female-motorist-20.html",
    "content": [
        "Two other drivers suffered minor injuries in the incident, investigators sayThree teenage boys appeared in court Wednesday accused of killing a 20 year-old woman by hurling a rock through the windshield of her car.  ",
        "Nicholas 'Mitch' Karol-Chik, Joseph Koenig and Zachary Kwak, all 18, faced a judge in Jefferson County, Colorado, over the April 19 murder of Alexa Bartell, 20.The trio have already been charged with crimes including first-degree murder - and now face additional counts of assault and attempted assault.Those charges relate to other incidents of rocks being hurled at cars which prosecutors say they were responsible for too.  Karol-Chik, Koenig and Kwak sat next to each other in the dock - the first time they've seen each other since being arrested over the killing of Alexa, which saw a huge rock hurled through the windshield of her yellow Chevy Spark.Former Denver prosecutor Craig Silverman was in court to watch proceedings, and suggested the case could well go to a full trial.He told KDVR: 'The majority of cases end with a plea bargain but I’m not sure that will happen here given the number of victims. We shall see how the evidence plays out.' ",
        "According to the Jefferson County Sheriff´s Office, Alexa Bartell was talking on the phone with a friend while driving in her yellow Chevy Spark at 10:45pm on April 19 in Arvada, Suburban Denver, when she was hit by the rock. After the call went silent, the friend tracked Bartell's location with a phone app, drove to her, and found the woman dead in her car, which had crashed into a field. ",
        "The boys returned later to take a photo of the car as a 'memento', Karol-Chik told investigators when questioned.They also allegedly attacked six other cars in Arvada on April 19, First Judicial District Attorney Alexis King announced.Meanwhile, MSU Professor of Criminal Justice and Criminology Denise Mowder told KDVR that she thinks prosecutors have a strong first-degree murder case.She explained: ' The killing was the fourth of six rock-hurling incidents reported from 10pm onwards on that same evening, causing minor injuries to two other drivers. The office of Karol-Chik's lawyer, Holly Gummerson, and Koenig's lawyer, Tom Ward, declined to comment. A message left by the Associated Press for Kwak's lawyer, Emily Boehne, was not immediately returned. During a brief afternoon court hearing, the lawyers all declined to have the charges read.Karol-Chik told investigators that Koenig slowed down so Kwak could get a photo of Bartell's car after it crashed into a field. He said all three got excited every time they hit a car with landscaping rocks taken from a Walmart parking lot, but acknowledged he felt 'a hint of guilt' passing by her car, according to court documents.Kwak said he took the photo because he thought that Karol-Chik or Koenig would want to have a 'memento' of what had happened, according to the arrest affidavits.",
        "He reportedly told the others: 'We have to go back and see that.'  ",
        "Karol-Chik told investigators with the Jefferson County Sheriff´s Office that he and Koenig had thrown rocks and even a statue at passing cars on at least 10 other days before Bartell was killed. Kwak heard about what they had been doing and asked to join them, according to Karol-Chik's account in the affidavits.Karol-Chik and Kwak offered different accounts about who threw the fatal rock.Koenig did not speak to investigators after he was arrested, according to the arrest affidavits.Prosecutor Padraic Emerine said: 'This was an extremely reckless and irresponsible situation that the defendant was involved in that, unfortunately, cost the life of a very innocent and very young woman in this case.'A friend of the trio told police he'd watched them several hours earlier as they loaded a truck with landscaping rocks taken from a Walmart parking lot. The friend claimed the three boys picked up 'as many as they could carry'.He said he knew 'something bad was going to happen' so asked Koenig, Karol-Chik and Kwak to take him home.",
        "The three alleged killers then patrolled roads in the area and searched for passing cars to target.Kwak said they would use 'marine terms' when launching the rocks, saying: 'Mitch would say things like, ‘contact left,’ before Joseph would throw the rock at a car on the left side of theirs.'",
        "He said the rock which killed Bartell made a 'very loud noise... like a rail gun' when it made contact with her windshield.Koenig was described by a friend as someone who likes creating 'chaos' and would often act in a destructive manner.'Joseph and Mitch were talking about them now being ‘blood brothers’ and they could never speak of the incident,' Kwak added.The three met up the following day to 'get their stories straight'.They had thrown rocks at vehicles on about ten occasions since February. Six other cars were damaged and two more drivers were injured on the night Bartell was killed.Lyft and Uber driver Nathan Tipton was uninjured after being targeted.Speaking to reporters at a news conference on Tuesday, he said he was headed southbound on Highway 93, close to the Jefferson County and Boulder County lines, at around 10.15pm.'I saw two vehicles going northbound, but all I could see was the headlights, it was a dark road,' he said. 'And then a large shatter - it sounded like a shotgun blast. It scared the heck out of me.'He said he pulled over immediately and saw that both driver-side windows of his mini van had been shattered.'It's horrible. Nobody should lose their child for a random act of whatever this is,' he added."
    ]
}