{
    "articleURL": "/femail/article-12057281/Lady-Louise-Windsor-19-looks-elegant-Coronation-concert.html",
    "content": [
        " Lady Louise Windsor, 19, looked elegant as she joined her parents and brother at Coronation concertREAD MORE: For all the latest Royal news, pictures and video click here The Duchess of Edinburgh's daughter looked elegant as she joined her parents, Prince Edward and Sophie, and her brother James, Earl of Wessex, at the star-studded Coronation concert this evening.",
        "The 19-year-old was stunning in a black outfit as she took her place in the royal box with the other members of the royal family ahead of the musical extravaganza.Over the last two years, Lady Louise has taken on an increasingly public role as her parents Prince Edward and Sophie have been bumped up the royal food chain following the disgrace of Prince Andrew and the departure of the Duke and Duchess of Sussex. She was front and centre in the Platinum Jubilee celebrations, joined her parents at the Commonwealth Games and made her successful TV debut in a documentary about her beloved grandfather the Duke of Edinburgh.Indeed she has become such a well-known face that she is recognised by customers of the garden centre where she has been working for £6.63 per hour since finishing her A-levels in June last year. ",
        "Sophie and Prince Edward wanted to give their daughter and son a 'normal' childhood with school friends and extra-curricular activities.And so Lady Louise was largely kept out of the limelight throughout her childhood, with her first major royal outing coming at the age of nine when she was a bridesmaid at the Duke and Duchess of Cambridge's wedding in 2011.Meanwhile she took on a larger role in the events mourning the late Queen last Autumn, appearing emotional yet poised. ",
        "Lady Louise, who is a university student at St Andrew's, stole the show in a flowing white and blue floral gown and a chic headpiece yesterday at the Coronation.Sophie donned a regal white Suzannah couture floor-length embroidered gown with a Jane Taylor headpiece and Royal Victorian Order Mantle, while her husband wore morning dress with a Garter Mantle over a black smart suit. James, Earl of Wessex, 15, who rarely makes public appearances, also looked smart in a black suit which he paired with a white shirt and a burgundy tie.It comes after Buckingham Palace said the King and Queen were 'deeply touched' by the nation's celebration of their coronation.More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen's funeral in September.",
        "After the ceremony, the family appeared on the Buckingham Palace balcony with a select group of senior royals as The Mall was swamped by tens of thousands of cheering supporters.Lady Louise and James stood beside their royal parents as they waved to crowds before a RAF flypast, which had to be scaled back to just helicopters and the Red Arrows because of the heavy rain in London.Meanwhile, earlier today Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.",
        "A Palace spokesman said the King and Queen were 'profoundly grateful' for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.",
        "The King, Queen and royal family have joined around 20,000 members of the public at the musical extravaganza.Heir to the throne William took to the stage to deliver a speech during the event in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, saw Hollywood star Tom Cruise and adventurer Bear Grylls appear via video message.The series of pre-recorded sketches revealed little-known facts about the monarch. There were also performances by Paloma Faith, Olly Murs, veteran singer Steve Winwood - whose grandson Arthur Eliot was one of Camilla's pages of honour - and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang performed too.",
        "The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art all came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Thousands of street parties have been held across the country with people encouraged to come together for the Coronation Big Lunch.Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.Meanwhile, Camilla asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.The simple posy, including auriculas, the late Queen's favourite lily of the valley, and one of Charles' favourites hellebores, by the King and Queen's go-to florist, Shane Connolly, was laid at the memorial.Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother.Camilla did not carry the flowers on Saturday as it was a coronation not a wedding, the Palace said."
    ]
}