{
    "articleURL": "/wires/pa/article-12054773/Julen-Lopetegui-Survival-Wolves-biggest-achievement.html",
    "content": [
        "Boss Julen Lopetegui believes keeping Wolves in the Premier League will be his biggest achievement as they all but ended any relegation fears – and damaged Aston Villa’s European dream.",
        "Toti Gomes’ first-half header earned a gritty 1-0 win and moved Wolves onto 40 points after they were bottom of the table at Christmas.It was their fourth straight top-flight home win – for the first time since 1975 – and depending on other results they could be mathematically safe by Monday night.Lopetegui was appointed in November before taking over after the World Cup in December and Wolves are now 10 points clear of the relegation zone.“It was one of the biggest challenges of my life, as a coach. It has been my most difficult achievement as a coach, much more difficult than (winning) the Europa League and putting Sevilla in the Champions League,” said the manager, who celebrated vigorously at full time.“It was a very bad situation. A lot of people called me, ‘you are crazy, why do you go there?’",
        "“It’s very important points for us. To arrive at 40 points, it’s not mathematic but we are very close to our aim. I’m very happy for the club, fans, players. We arrived here in December with 10 points at the bottom.“Today I showed more emotion, I am human. We’ve suffered a lot.”Gomes bagged the winner after nine minutes when he headed in Ruben Neves’ corner off the bar.",
        "Villa dominated much of the first half with Jose Sa saving from Emi Buendia and Ollie Watkins wasting their best chance when he planted a free header straight at Sa.Matheus Cunha fired over just before the break with Emi Martinez thwarting Diego Costa soon after the re-start.Villa struggled to break a resilient Wolves – who lost 6-0 at Brighton last week – down but should have made it 1-1 with 19 minutes left.Douglas Luiz floated in a free-kick which landed perfectly for Tyrone Mings but the defender volleyed over from six yards.Defeat delivered a blow to Villa’s European hopes as they remain eighth, having played more games than Brighton, Tottenham and Liverpool – who they face in their final three matches.Boss Unai Emery said: “I’m frustrated with the result but overall in 90 minutes we tried to keep going with the game plan, we did it, we had good positioning, good progress with passes and then got in the box.“At half time I said I liked to watch our team playing like that, the best way to get a good result is like that.“In the second half the rhythm was going down, they were trying to waste time and we didn’t get our best performances.",
        "“We tried to change the match but we didn’t. We have to be excited because three months ago we were thinking of a different target, even if two weeks ago the possibilities were better.“Tyrone’s chance was the best chance. In the first half we had more but not as clear. It’s football.”"
    ]
}