{
    "articleURL": "/wires/afp/article-12051117/Kenya-pays-tribute-legendary-independence-heroine-Kimathi.html",
    "content": [
        "Kenya's President William Ruto led tributes on Friday to Mukami Kimathi, describing her as a \"legendary fighter\", whose husband led a bloody resistance against British colonial rule during the 1950s.",
        "Kimathi, who was in her nineties, died in a Nairobi hospital on Thursday night, local media reported.Her husband Dedan Kimathi headed the feared Mau Mau rebellion and was executed half a century ago by the colonial authorities, prompting her later to appeal to the Kenyan government to exhume his body so he could be given a state funeral.But successive governments tried and failed to locate his remains.In a statement, Ruto said he was saddened by the news of Kimathi's death, calling her \"a celebrated heroine of our nation's struggle for independence\".\"Mama (mother) Mukami Kimathi courageously withstood the brutality of colonial oppression, proudly wore the scars of the battle and bore the terrible losses of war with admirable fortitude,\" he said.\"We shall honour her memory and treasure her legacy.\"Ruto's predecessor Uhuru Kenyatta, whose father Jomo Kenyatta was Kenya's founding president, hailed her as \"a true patriot (who) never failed to play her role as a mentor and a leader worthy emulating.\"\"For those of us who had the privilege of interacting with her, we will forever cherish the moments we shared and thank God for having given us the opportunity to associate with such a great warrior,\" he said in a statement.The Mau Mau freedom fighters suffered horrific abuses under the colonial regime for taking part in one of the British Empire's bloodiest insurgencies.",
        "In 2015, thousands of Mau Mau veterans attended the unveiling in Kenya's capital Nairobi of a British-funded memorial to the thousands killed, tortured and jailed in the rebellion, in a rare example of former rulers commemorating a colonial uprising."
    ]
}