{
    "articleURL": "/news/article-12038569/Social-media-users-left-horrified-SoCal-restaurants-dystopian-playing-National-Anthem.html",
    "content": [
        "TikTok users left horrified comments underneath a video of people standing for the National Anthem inside a Southern California restaurantThe video was taken inside the Rainbow Oaks Restaurant in Fallbrook17,000 people have commented on the viral video which has 450,000 likesA viral video of patriotic patrons standing up for the National Anthem inside a Southern California bar has shocked some media users who left thousands of horrified comments on TikTok post. ",
        "The 14-second video posted by a user identified as 'Paulina' shows roughly a half dozen individuals standing for the Star-Spangled Banner as it played on a TV screen. 'By far the most dangerous situation I've ever been in,' Paulina wrote alongside the hashtags 'godblessamerica,' 'getout,' 'illegal,' and 'whitepeoplethings.' The video was taken at the Rainbow Oaks Restaurant in Fallbrook - a city located around 50 miles northeast of San Diego. ",
        "According to KUSI, the restaurant plays the National Anthem every day at noon. One video posted by the San Diego news station in April shows the restaurant packed with customers, all singing the patriotic tune with their hands over their hearts. The TikTok user who posted the now viral-video of the salute was clearly not aware of the daily tradition and was stunned by the display. Shared less than a week ago, the video has garnered more than 3.1 million views.Not all who watched were moved by the large group standing for the National Anthem, however, as the majority of comments were outraged and disgusted. 'Serious question. Is this real? Like people actually do this in real everyday life?' one user asked.'This happened when i was at mission bbq once and it was so awkward that i haven’t been back since,' another responded. ",
        "'As someone from the uk this feels so dystopian,' one person said. 'This feels like a horror movie,' another added.  'As a Canadian this is kind of insane,' one user wrote.'I would be scared for my life,' one person responded.  Others who chimed in called the video, 'wild' and 'terrifying.' ",
        "According to KUSI, the restaurant has carried out the tradition daily for six years. Many of the San Diego station's viewer's found the display endearing and patriotic when they shared video of the tradition in mid-April.  'Love it! Beautiful show of patriotism,' one person wrote on KUSI's video. 'Great food and yes very patriotic. The staff treats everyone very well. Breakfast there is one of the best in North County,' another person responded.   'Love this. Would like to see more restaurants do it,' a man wrote.'Good for them, we need more businesses and people like this,' another wrote. "
    ]
}