{
    "articleURL": "/wires/ap/article-12049733/Closing-arguments-near-stepmoms-murder-trial-Colorado.html",
    "content": [
        "DENVER (AP) - A lawyer for a Colorado woman who repeatedly stabbed and then shot her 11-year-old stepson before driving his body across the country said Friday that the brutality of the attack was the strongest evidence that the killing was the result of a \"psychotic break.\"",
        "During closing arguments in Letecia Stauch's murder trial in Colorado Springs, Josh Tolini urged jurors to find her not guilty by reason of insanity. He emphasized that she would be kept confined at the state mental hospital if they reached that verdict in the 2020 killing of Gannon Stauch. Tolini said prosecutors had not shown why the special needs teacher would want to kill the slight 80-pound boy she cared for and lived with in such a violent way.\"This wasn´t a pre-planned calculated killing for some gain. This was a psychotic break fueled by rage attacking a demon from the past,\" he said in court before jurors began deliberations.Prosecutors say Gannon was stabbed 18 times before being hit in the head and then shot by Stauch, suggesting that she first tried to kill him by burning him and drugging him with an opioid. His father, Stauch's husband Al, was on a National Guard deployment at the time. They say Stauch then put Gannon's body in a suitcase, drove it across the country in a rented van and threw the suitcase over the side of a bridge in the Florida Panhandle.Prosecutors are not required to prove a motive but District Attorney Michael Allen said they had shown that Stauch killed Gannon because she hated him and because it was a way to hurt her husband, whom she planned to leave. He pointed to how Stauch had done a Google search for \"I don't like my stepson\" and had also researched getting a moving truck and places to live in Florida before killing him.",
        "\"The brutality of it speaks to the abject hatred she had for Gannon and the pure determination she had to kill Gannon,\" Allen said.",
        "Stauch is charged with first-degree murder, first-degree murder of a child by a person in a position of trust, tampering with a deceased human body and tampering with physical evidence.Experts at the state mental hospital concluded that Stauch had a personality disorder with borderline and narcissistic features but was sane at the time Gannon was killed. Under Colorado law, that means understanding the difference between right and wrong and being able to form the intent to commit a crime.The defense claims Stauch suffered a psychotic break because of trauma from being physically, emotionally and sexually abused by her mother's string of partners during her childhood. Its main witness, Dr. Dorothy Lewis, author of the book \"Crazy, Not Insane\" and featured in an HBO documentary with the same title, concluded Stauch suffered from dissociative identity disorder - when someone has two or more personalities as the result of trauma - and was not sane at the time. Allen pointed out that Lewis did not know how sanity is defined under Colorado law.Prosecutors have argued that Stauch took steps to cover up her actions - proof that she knew what she did was wrong - and was therefore sane. They said she cleaned up blood in Gannon´s bedroom, where he was killed, and moved his body to various locations to hide it before disposing of it off a bridge that crosses a river flowing into the Gulf of Mexico. It was discovered shortly after by a bridge inspector doing a biennial safety check."
    ]
}