{
    "articleURL": "/wires/pa/article-12056863/Liverpool-defender-Virgil-van-Dijk-talks-big-leader-Alisson-Becker.html",
    "content": [
        "Mohamed Salah’s 100th goal at Anfield – among other achievements – grabbed the headlines but Liverpool defender Virgil van Dijk believes goalkeeper Alisson Becker is more than worthy of similar recognition.",
        "Salah’s solitary strike secured a sixth successive Premier League victory to maintain the Reds’ unlikely push for the Champions League but the 1-0 win was only possible because Alisson brought up a century of clean sheets in the game.In a disappointing season Alisson has been the club’s most consistent player, even taking into account Salah reaching 30 goals for the campaign for the fourth time in six years.Van Dijk, who has not been immune from the struggles which have affected the whole side, recognises that.“He’s an example for a lot of players, especially goalkeepers. I’m very glad that he’s my goalkeeper and we have been very successful,” said the Netherlands captain.“Obviously on the pitch his qualities are there for everyone to see – his contribution, the saves, the leadership, that’s all very important – but away from the pitch is just as important, the qualities he has.“He is a big, big leader in the group and someone a lot of players look up to.“Obviously this (100 clean sheets) is for him a big moment and hopefully there are many more to come.”Liverpool, who are in talks with former Wolfsburg sporting director Jorg Schmadtke to replace the departing Julian Ward, recorded back-to-back Premier League clean sheets for the first time in two months – when they had three in a row – and only the fifth occasion in the whole campaign.",
        " He's an example for a lot of players. I'm very glad that he's my goalkeeper and we have been very successful  Virgil van Dijk on Alisson Becker's importance  Much of that poor record has been down to how the team defends and not Alisson’s performances, which have been generally better than the rest of the squad overall.Van Dijk accepts those failings but believes they have finally started to iron out their issues.“He is the one who has the highest risk factor in the team as well, if he makes a mistake then it’s a goal,” he added.“It’s the whole doing it together type of feeling that we feel we have. That’s the basis.“He would probably say that without the boys in front of him and the midfielders and strikers doing their work, this (100 clean sheets) would not be possible. Everyone is part of it, but he should definitely be proud of it.",
        "“The last couple of games, the commitment we have shown and the reaction when we lost the ball is very important.“It’s important to get the ball back, win challenges, and while there’s still room for improvement, winning six games in a row is something that has been unheard of this season.",
        "“But let’s just keep going and enjoy the moment and take it into next season.”Van Dijk could not, however, fail to recognise the enduring excellence of Salah, who has drawn level with Steven Gerrard as the club’s joint-fifth all-time goalscorer on 186.It is the Egypt international’s relentlessness which sets him apart from most of his contemporaries, having been available for a remarkable 97 per cent of all Premier League and Champions League matches since he joined the club in 2017.“He is doing it consistently, even when we are struggling he has still found a way to be important for the team,” said the Dutchman.“Being consistent every three or four days, obviously you can have games where you don’t score but you can reach that level, and also staying fit that’s the most difficult thing to do.“People don’t really speak about those kind of things too much, but maybe we should. On top of that, his numbers speak for themselves. In the world we live in nowadays, maybe the respect comes after he has stopped playing.",
        "“But I don’t think he cares about that anyway. He just wants to keep doing what he’s doing and be important for the club. That’s the main thing.”Brentford’s bid for European football appears to be fading after just two wins in the last nine matches.",
        "“You need to perform almost perfectly against these top-six sides,” said head coach Thomas Frank.“We are definitely getting closer, we’ve shown that in the performances and the wins we’ve had so far this season, but you need to be almost perfect to get a point or to win and, unfortunately, we were not quite perfect, but we were close.”"
    ]
}