{
    "articleURL": "/news/article-12046749/Tories-brace-hard-night-local-elections-amid-ID-rules-confusion.html",
    "content": [
        "More than 8,000 council seats up for grabs in elections across England todayTories are braced for a 'hard night' of local election losses as Keir Starmer tries to show he is on track for No10.",
        "With 8,000 seats up for grabs across 230 authorities in England, Rishi Sunak has admitted that 'good councillors' are set to be ejected.  But there have been reports of confusion at ballot stations over new ID rules, with the Lib Dems complaining that the numbers are 'significant'.Some said they turned up to vote with photo ID only to be told it was the wrong type - while others claimed 'greeters' were asking for identification and turning people outside, meaning that records would not be kept.The craze for #dogsatpollingstations has even got in on the act, with one owner creating an ID for her pet. The results, which will start appearing in the early hours of tomorrow, will give the clearest indication yet of who is winning the wider political battle.Experts have warned that Sir Keir must have a double-digit lead in the national vote share to be confident of winning the keys to No10 at the general election, due next year.But although polls suggest Labour has that kind of advantage, they have been narrowing recently. ",
        "Today mark the first time it has been compulsory for all voters in England to show photo identification at polling stations. There were regional pilots previously.Peopler are required to show a form of photo identification, such as a passport, driving licence or blue badge.",
        "Other forms of identity that will be accepted include biometric residence permits, defence identity cards, and national identity cards issued by the European Union, Norway, Iceland or Liechtenstein.Supporters say it is normal to show ID in much of the rest of the world, and the move protects the integrity of the process. But critics argue it could deter young people and those from poorer communities.There have been questions raised about why bus and travel passes for older and disabled people are being accepted as photo IDs, but that young people's travel cards will not be permitted.Lib Dem MP Layla Moran tweeted today: 'We've had reports by our tellers of people being turned away at polling stations for lack of correct ID. 'That's just in my constituency so far. Across the country I'm worried this will be significant numbers and far more than the exactly 0 people found guilty of fraud last year.' One Twitter user said they had been unable to use a driver qualification card to prove their identity. The Electoral Commission responded explaining that it was not one of the 20 accepted forms in legislation.The watchdog's director of communications also moved to clarify that expired photo IDs were acceptable - as long as the picture is still recognisable.",
        "'There is a specific list of around 20 (forms of ID) so I urge people to check that list,' he told Sky News.'If you've got an ID which has expired that doesn't matter as long as it still looks like you.'He also said that Electoral Commission research found that around 96% of people already have an eligible photo ID.Annette Hill, from Weston-super-Mare, made light of the row by making her dog Ruby her own photo ID, complete with name, photo, and an 'authorised signature' of a paw print.The 58-year-old, who works in learning and development HR, said her two-year-old golden retriever was making her first trip to the polling station.Some Conservative MPs have been increasingly optimistic they can hold down losses today, despite ministers repeatedly saying they expect to shed 1,000 seats in a pincer movement from Labour and the Lib Dems. Mr Sunak's gave a downbeat assessment at an Onward think tank event last night.He hailed the Tories moving away from the 'box set drama' of what went before his premiership, in a reference to turmoil under predecessors Boris Johnson and Liz Truss.But he said: 'We should be prepared that tomorrow night is going to be hard for us.'Good councillors will lose their seats because of all that has happened over the past year.'",
        "Mr Sunak added: 'I've only been Prime Minister for six months but I do believe we're making good progress. Just think about where we were then and where we are now.'Elections guru Professor Sir John Curtice said Labour securing more than 10 per cent of the projected national vote share - which will be estimated from the council results - would show Sir Keir is on track to become PM.Sir Tony Blair had double-digit local election vote share victories in the lead-up to New Labour's landslide in 1997, as did David Cameron's Tories before 2010 when they ended up in coalition with the Lib Dems.Labour has been arguing that vote share is misleading at local elections because more independents stand, suggesting that gaining 400 seats would be a good night. Experts say that would be far too low. The measures of success are particularly complicated in these local elections. Around 90 per cent of the 8,000 seats were last up for grabs four years ago, when Theresa May was struggling to get her Brexit deal through. But Labour was also failing to make major inroads with an unpopular leader in Jeremy Corbyn. Sir Keir, speaking to broadcasters on the eve of the polls opening, said his party had 'a positive case to tell' and that he hoped to make electoral 'progress'.",
        "He said voters could 'set Britain on a path of growth, security and the promise of a better future'.'If you believe it's time to build a better Britain you can do something simple – grab your ID, get down to your polling station and vote Labour today.'Elections are not taking place in all parts of England this year. There are no contests in London and Birmingham, along with other areas including Cornwall, North Yorkshire and Cumbria.Polls are also taking place to choose mayors in Bedford, Leicester, Mansfield and Middlesbrough. There are concerns about confusion at ballot stations as it is the first time new voter ID rules have applied - ahead of the change coming into force for UK general elections.The policy means it will be compulsory for voters to present photo identification.Deputy Lib Dem leader Daisy Cooper said: 'Senior Conservative MPs are in for a big shock tomorrow. The Liberal Democrats are now on the cusp of causing a major political upset.'"
    ]
}