{
    "articleURL": "/money/cars/article-12048145/Charge-point-anxiety-hits-switch-electric-cars.html",
    "content": [
        "Demand for electric cars is being held back by ‘charge-point anxiety’ as drivers fret about the cost and convenience of going green, say industry experts.",
        "The Society of Motor Manufacturers and Traders (SMMT) said it expects plug-in battery electric vehicles (EVs) to account for 18.4 per cent of new sales this year and 22.6 per cent next year, down from previous forecasts of 19.7 per cent and 23.3 per cent.The update will fuel fears that the Government’s plans to ban the sale of new petrol and diesel models in 2030 are unworkable.",
        "Mike Hawes, chief executive of the SMMT, said: ‘The new car market is increasingly bullish, as easing supply chain pressures provide a much-needed boost. The broader economic conditions and charge-point anxiety are beginning to cast a cloud over the market’s eagerness to adopt zero-emission mobility at the scale and pace needed.‘To ensure all drivers can benefit from EVs, we need everyone – Government, local authorities, energy companies and charging providers – to accelerate investment in the transition and bolster consumer confidence in making the switch.’Options for recharging on motorways and A roads are limited and a charging point at home is not always an option. At the start of April, there were 40,150 public charging points across the UK. But they are not evenly distributed and only 7,647 are rapid devices.Westminster has 2,196 – more than the 1,593 available across Liverpool, Manchester, Newcastle, Leeds, Sheffield and Birmingham combined.",
        "Campaigners say only a few are at ‘en-route’ locations, such as motorway service stations, making planning journeys particularly hard.‘The main focus should be ensuring we have the right speed charger in the right location and we avoid any blackspots,’ said Jack Cousens, head of roads policy at the AA.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}