{
    "articleURL": "/sport/football/article-12042013/Chelsea-star-Thiago-Silvas-wife-doesnt-know-say-husband-amid-form.html",
    "content": [
        "Chelsea are enduring a nightmare season, with the latest defeat against ArsenalThiago Silva's wife has said that she no longer knows what to say about the formShe took to Twitter to tell her centre back husband that he is 'not alone' right nowThiago Silva's wife has ran out of things to say to cheer her husband up amid Chelsea's dire season, which has them nine points above the relegation zone. ",
        "The Blues took their latest beating away to table-topping Arsenal, going down 3-1 to make it six defeats from six games for interim boss Frank Lampard.Silva was spotted in what looked to be a blazing row with Ben Chilwell after Martin Odegaard's second goal about defensive positioning and other factors which led to Arsenal doubling their lead.Now the Brazilian defender's wife has conceded that Chelsea's dire form is making it harder and harder for her to raise morale at home. Belle Silva wrote on Twitter: 'Very difficult to see what I see on TV. At home the situation worsens because I don't know how to help, what to say. Very sad @tsilva3 you aren't alone.'",
        "Silva is a veteran in the Blues dressing room but his presence and experience has done little to stop the rot, with Chelsea winless in their last nine games in all competitions.That is a run that stretches back almost two months and Chelsea will end the season without silverware and without Champions League qualification as a result.The centre back, 38, hit out at the Chelsea hierarchy following the team's lacklustre Champions League exit at the hands of Real Madrid last month, blaming 'indecision' for the west London side's disappointing season. Silva, who won the Champions League with Chelsea under Thomas Tuchel in 2021, has cut a disappointed figure on the pitch after final whistles as misery has been compounded in recent weeks.",
        "And having been at some of the world's biggest clubs, Silva has been left staggered at the lack of a plan in co-owner Todd Boehly's miserable first 12 months in charge.",
        "'I think the first step has been made. An incorrect step, but it has been made,' Silva told Brazilian media.'We can't be blaming the managers if we don't take responsibility. It's a hard period for the club, with a lot of indecision.'Change of ownership, new players arriving – we had to increase the size of the changing room because it didn't fit the size of the squad.'Silva has played 31 matches for Chelsea this season but his experience has counted for very little in a campaign which has seen Tuchel and Graham Potter sacked and £600million worth of players integrated."
    ]
}