{
    "articleURL": "/sport/football/article-12051623/Jamie-Carragher-Steven-Gerrard-superior-player-Paul-Scholes-Frank-Lampard.html",
    "content": [
        "Fans have long argued over who was best out of Lampard, Gerrard and ScholesJamie Carragher thinks there is one fact that sets Gerrard apart from the othersCarragher and Gerrard played together at Liverpool for over a decade  Jamie Carragher believes he has a point which brings a definitive end to one of football's great debates.",
        "Frank Lampard, Steven Gerrard and Paul Scholes made up England's golden generation of midfielders and fans have long argued over who was the best.A great case can be made for all three but Carragher thinks there is one fact that makes his former team-mate Gerrard stand out.Speaking on That Peter Crouch Podcast, Carragher agreed after Crouch said Gerrard was the best player he'd played with 'by far'.He added: 'It's not even close, is it? People think I don't like Frank Lampard and I don't like Paul Scholes.",
        "'You know when this debate comes up, and I go \"they were amazing players, but it's not even a debate, it's not close.\"''I'll tell you what kills this debate,' he says. 'Alex Ferguson tried to sign him and so did Jose Mourinho. And they had Scholes and Lampard.'Carragher also added how his former team-mate was the one player he never argues with on the pitch",
        "He added: 'I'm not shy, being on the pitch, but he's the one person I've never had a go at on the pitch. I'd lose my head with different things but if it's Stevie... what can i say? You just have to let that one go!'Fans are unlikely to be swayed too much by Carragher's words with the former defender having played alongside Gerrard for over a decade. ",
        "The trio were often playing for two positions in the England's central midfield with Scholes often moved out to the left hand side under Sven Goran Eriksson's reign until the ex-United star's international retirement in 2004.For the next decade debate then infamously raged over whether Lampard and Gerrard could play in the same England team, and if not which one should be dropped. "
    ]
}