{
    "articleURL": "/wires/reuters/article-12045591/U-N-conference-seeks-final-funds-Yemen-Safer-oil-tanker-operation.html",
    "content": [
        "By Lisa Barrington",
        "DUBAI, May 4 (Reuters) - The United Nations on Thursday aims to raise the final $29 million needed to start salvaging 1.1 million barrels of oil from a decaying vessel moored off war-torn Yemen's coast and avert an environmental disaster.U.N. officials have been warning for years that the Red Sea and Yemen's coastline was at risk as the Safer tanker could spill four times as much oil as the 1989 Exxon Valdez disaster off Alaska.A U.N. plan to offload the oil needs $129 million, which includes purchasing a large tanker, the price of which has shot up due to the war in Ukraine. Around $99 million has been raised from governments, private donors and crowdfunding.A U.N. pledging event co-hosted by Britain and the Netherlands on Thursday hopes to raise the remaining $29 million, the U.N. said.A tanker, the Nautica, was procured by the U.N. in March and set sail from China in early April.The operation cannot be paid for by the sale of the oil because it is not clear who owns it, the U.N. has said.War suspended maintenance operations on the Safer in 2015. The U.N. has warned its structural integrity has significantly deteriorated and it is at risk of exploding.Yemen has been mired in conflict since the Iran-aligned Houthi group ousted the government from the capital Sanaa in late 2014. A Saudi Arabia-led military coalition intervened in 2015 aiming to restore the government.",
        "Peace initiatives have seen increased momentum since Riyadh and Tehran in March agreed to restore diplomatic ties severed in 2016.A Saudi delegation in April went to Sanaa seeking a permanent ceasefire. Houthi authorities said more talks would happen after the Eid al-Fitr holiday, which was two weeks ago.U.N. Yemen envoy Hans Grundberg is holding meetings in Yemen and the region this week. (Reporting by Lisa Barrington; additional reporting by Reyam Mukhashaf; editing by Christina Fincher)"
    ]
}