{
    "articleURL": "/tvshowbiz/article-12046347/Amanda-Holden-puts-leggy-display-eye-catching-green-mini-dress-departs-Heart-FM.html",
    "content": [
        "Amanda Holden made yet another stylish departure from Heart FM as she stepped out in an eye catching green mini dress on Thursday. ",
        "The Britain's Got Talent judge, 51, looked stunning in the summer number, which boasted a frill bottom and short sleeves, as she left the central London studios. She showcased her incredible figure by cinching in her waist with a coordinated material belt with a round buckle. The TV personality added inches to her frame in nude strappy heels by Christian Louboutin and toted her belongings around in a co-ordinated shoulder bag. Amanda styled her long blonde tresses poker straight and she opted for minimal makeup. ",
        "The broadcaster flashed her gorgeous smile as she shielded from the sun behind a pair of chunky black sunglasses. Amanda's co-host Ashley Roberts, 41, looked effortlessly cool in an oversized black and red leather racer jacket as she departed the Global studios. The former Pussycat Dolls singer flashed her toned midriff in a crisp white crop top and a pair of grey wide legged trousers from NastyGal. She kept comfortable in a pair of black and white Nike Air Force trainers and carried her belongings in an eye catching woven red bag. Ashley was all smiles as she completed her work attire with a pair of stylish sunglasses. It comes after Amanda pressed her Golden Buzzer during last week's Britain's Got Talent show. She said she was 'blown away' by 'amazing' Olivia Lynes after she encouraged the schoolgirl to audition for the ITV talent series.",
        "Olivia performed an incredible rendition of Defying Gravity from Wicked, leaving fellow panelist Bruno Tonioli fighting back tears. ",
        "Speaking exclusively to MailOnline after the show, Amanda admitted that she 'had no idea Olivia could sing' when she met her the previous day to tell her that her mum and nan had signed her up for her contest.Despite not knowing if she 'was allowed to push the button,' the TV personality pressed the Golden Buzzer after her performance received a standing ovation.Amanda explained: 'So I didn't know if I was allowed to press it for her because I’d actually met her the day before as part of our golden moments and encouraged her to come down and audition.'The presenter continued: 'But when I met her I had no idea if she could sing, and then was absolutely blown away by her performance.'And it's just so typical of what I would press my buzzer for. I was almost like, \"Oh my god. It's going to have to be this because I love it. She is amazing.\"During the show, fans saw Olivia nervously walk on to the stage while her mum and nan fought back tears as they stood with Ant and Dec.Upon seeing her, Amanda exclaimed: 'Yes! Olivia we meet again!",
        "'She was going to see the show Matilda and I was in the box office. I told her to come down because her mummy and nanny said she had the most amazing singing voice.'The school girl reduced the audience and Bruno to tears after belting out the hit track from the musical, prompting Amanda to hit the buzzer."
    ]
}