{
    "articleURL": "/wires/afp/article-12041597/Iran-forces-seize-second-oil-tanker-six-days-US-Navy.html",
    "content": [
        "Sanctions-hit Iran seized on Wednesday a second oil tanker in less than a week as tensions rise in the commercially vital Gulf waters.",
        "A fleet of high-speed Islamic Revolutionary Guard Corps Navy (IRGCN) craft surrounded the Greek-owned Niovi as it travelled empty from Dubai to Fujairah, another port in the United Arab Emirates, the US military said.The Panama-flagged vessel's seizure in the Strait of Hormuz comes six days after a similar incident also in the Gulf, which lies between Iran and the Arabian Peninsula and carries at least a third of the world's seaborne oil.\"A dozen IRGCN fast-attack craft swarmed the vessel in the middle of the strait,\" said a statement from the Bahrain-based US Fifth Fleet.\"The IRGCN subsequently forced the oil tanker to reverse course and head toward Iranian territorial waters off the coast of Bandar Abbas, Iran,\" it said.Iran seized the vessel \"following an order from the judiciary\", the judiciary's Mizan Online news website said.The US called for the ship's immediate release.\"Iran's harassment of vessels and interference with navigational rights in regional and international waters are contrary to international law and disruptive to regional stability and security,\" said State Department spokesman Vedant Patel.\"We join the international community in calling the Iranian government and the Iranian Navy to immediately release the ship and its crew.\"- Sanctions link -Around 30 people were aboard the ship, including a Greek skipper and crew members from the Philippines and Sri Lanka, a spokeswoman for Greece's coastguard told AFP.",
        "The Gulf has witnessed a spate of incidents since 2018, when then US president Donald Trump pulled out of a nuclear agreement and reimposed crippling sanctions on Iran.",
        "On Thursday, helicopter-borne Iranian navy commandos abseiled onto the deck of a Marshall Islands-flagged oil tanker, the Advantage Sweet, in the Gulf of Oman. It was then moved to Bandar Abbas, TankerTrackers.com said.The two seizures come after the United States captured a Greek-managed tanker carrying Iranian oil, maritime security firm Ambrey said.The Niovi's capture also followed a warning from Greek authorities of heightened risk after the US seizure, Ambrey added.\"Greek authorities had issued a warning that Greek shipping was at an increased risk from Iran after the detention of a Greek-managed Suezmax tanker carrying Iranian oil,\" it said.Iran has responded with tit-for-tat measures in the past after seizures of Iranian oil shipments. US sanctions target Iranian oil and petrochemical sales in a bid to reduce Iran's energy exports.\"What we are seeing now is the return to a very familiar pattern of US sanctions pressure and Iranian counterpressure that led to frequent attacks against shipping and energy infrastructure during\" the Trump administration, said Torbjorn Soltvedt of risk intelligence firm Verisk Maplecroft.\"The message Iran is sending is the same now as then,\" he told AFP. \"Tehran is prepared to put a cost on US efforts to curb its oil exports.\"",
        "- Risk expected to persist -Video footage released by the Fifth Fleet showed at least 11 small boats approaching the Niovi on Wednesday.",
        "Iran has harassed, attacked or hampered the navigation of 15 foreign-flagged merchant vessels in the past two years, the US Fifth Fleet said, calling Tehran's actions \"contrary to international law and disruptive to regional security and stability\".The seizures also follow a tightening of sanctions on the Revolutionary Guards last week by Iran's Western rivals.Iran then announced countermeasures including financial sanctions and entry bans targeting EU and UK individuals and entities.Tensions have escalated since the US withdrew from the accord on Iran's nuclear activities. Marathon efforts to relaunch the agreement with major powers have stalled.\"The risk to shipping and energy infrastructure in the wider region will persist as long as the issue of Iran's nuclear programme remains unresolved,\" Soltvedt said.In 2019, Iran's Guards seized the British-flagged oil tanker Stena Impero in the Strait of Hormuz for allegedly ramming a fishing boat, and released it two months later.In 2021, Iran released a South Korean oil tanker it had held for months amid a dispute over billions of dollars seized by Seoul.And in May 2022, Iran seized two Greek tankers after a Russian-flagged tanker carrying Iranian crude was seized a month earlier near Athens. The two vessels were both released in November."
    ]
}