{
    "articleURL": "/wires/ap/article-12052671/Mississippi-impeding-funds-Jacksons-water-group-says.html",
    "content": [
        "JACKSON, Miss. (AP) - Mississippi has intentionally created hurdles that prevent the majority-Black capital city of Jackson from receiving enough money to repair a long-troubled water system that nearly collapsed last year, the Southern Poverty Law Center said Friday in announcing a new civil rights complaint it filed.",
        "The center asked the U.S. Treasury Department to investigate Mississippi's rules for distributing $450 million to water systems operated by cities, counties and rural water associations. The funds came from pandemic relief money distributed by the federal government.State officials said in November that Jackson would receive $35.6 million, and that the city would have to match that amount - a matching requirement in place for larger communities in the first round of funding.Southern Poverty Law Center said in the complaint, which it filed Tuesday, that the state´s application for the grant program failed to consider the dire need for costly improvements to the largest water system in the state, and that created a \"disparate impact on the Black residents who live in the drastically underfunded city of Jackson.\"The state has been slow in sending money to Jackson, the center said.\"The people of Jackson are suffering daily. Residents and business owners are paying a costly price for the gross negligence of state leadership,\" Waikinya Clanton, the center's Mississippi director, said in a statement Friday.The Mississippi Department of Environmental Quality is in charge of distributing the water system improvement money. In response to questions from The Associated Press on Friday, department spokesperson Jan Schaefer said the funding approved for Jackson is for two wastewater projects and five projects to improve the drinking water system. She said the grant program is based on the state reimbursing cities, counties and water associations, and Jackson has not yet submitted requests for reimbursement.",
        "The Southern Poverty Law Center's complaint to the Treasury Department is the latest of several efforts to bring federal pressure to force improvements for the Jackson water system. The city has nearly 150,000 residents, with about 25% living in poverty.In August and September, most of Jackson lost water pressure after heavy rainfall exacerbated problems at the main water treatment plant. Thousands of people lined up to get water for drinking, cooking, flushing and bathing.In October, the Environmental Protection Agency announced it was investigating whether Mississippi state agencies have discriminated against Jackson by refusing to fund water system improvements. Republican Gov. Tate Reeves responded by saying Jackson has received a disproportionate amount of water funding based on the city´s size. He also said local officials only have themselves to blame for the water woes.In November, a federal judge approved a Justice Department request for a rare intervention to try to fix the Jackson system. Federal authorities appointed Ted Henifin, a water administrator with decades of experience in other states, to lead the effort.The Republican-controlled Legislature wrote the program's rules to distribute the $450 million and Reeves signed them into law April 2022. Revisions were signed last month.Jackson was awarded its portion of the money during the first round of applications. The revision this year said cities or counties that received money are ineligible to receive more money in the second round.",
        "Jackson officials have said the water system repairs could cost up to $2 billion. In December, Congress allocated $600 million for the Jackson water system as part of a $1.7 trillion federal spending bill."
    ]
}