{
    "articleURL": "/wires/reuters/article-12041507/Robinhood-securities-regulators-face-Massachusetts-fiduciary-rule.html",
    "content": [
        "May 3 (Reuters) - Massachusetts' highest court on Wednesday will consider whether to revive a state fiduciary duty rule that was central to an enforcement action securities regulators filed against the online brokerage Robinhood.",
        "A subsidiary of Robinhood Markets Inc and Massachusetts Secretary of State Bill Galvin will argue before the state's Supreme Judicial Court about a 2020 state regulation that placed a fiduciary duty on broker-dealers. Robinhood has said the rule oversteps Galvin's authority.A lower court last year sided with Robinhood in a lawsuit the firm filed after Galvin in December 2020 accused it of encouraging inexperienced investors to place risky trades. He argued that Robinhood violated the rule he adopted that raised the investment-advice standard for brokers and that its broker-dealer license in the state should be revoked.The judge's decision to invalidate the rule knocked out a main part of the case against Robinhood, which is on hold pending the outcome of Galvin's appeal.\"The Secretary claims the power to outlaw whatever industry conduct he sees fit, without regard to this Court´s, or other states' and federal regulators', contrary rules,\" lawyers for Robinhood said in a court filing. \"The Secretary does not have that power.\"A Robinhood spokesperson declined to comment.Galvin's complaint against Robinhood said the firm had a duty to protect its customers and their money, but instead gave its inexperienced customers the ability to make an unlimited number of trades without first screening them.Robinhood has faced legal and regulatory scrutiny for so-called \"gamification\" of investing and for its role at the center of a 2021 retail trading frenzy.",
        "\"Secretary Galvin feels strongly in the need to apply fiduciary duty standards to financial professionals,\" a spokesperson said in an email. \"The Robinhood case is the perfect example of the need for such a rule in Massachusetts.\" (Reporting by Chris Prentice and Nate Raymond; editing by Grant McCool)"
    ]
}