{
    "articleURL": "/wires/pa/article-12052717/Ryan-Mason-concerned-Tottenham-clubs.html",
    "content": [
        "Ryan Mason has aimed a thinly-veiled dig at Liverpool boss Jurgen Klopp after his criticism of Tottenham’s style last weekend.",
        "Klopp took umbrage with Mason’s post-match comments about Diogo Jota, who caught Oliver Skipp with a head-high tackle during the 4-3 clash but stayed on the pitch to score a stoppage-time winner in the Anfield fixture.After Mason had made clear his exasperation at Jota being able to avoid a red card, Klopp hit back during an interview with the BBC by suggesting the 31-year-old should “worry about other stuff” before he told Spurs they “can’t just counter-attack” and urged them to “play better football.”",
        "Tottenham’s acting head coach responded before the visit of Crystal Palace on Saturday, where only three points for the hosts will keep alive their top-six hopes.“Yeah, I mean first of all I respect and admire Jurgen Klopp,” Mason said.“I also respect Liverpool Football Club, but honestly in my current situation now and regardless of what happens in my coaching career, I don’t believe I will ever be in a position where I can sit here and criticise another football club in the way they are doing things. I don't think I will ever be in that position or earn the right to criticise another football club for how they want to try and win the game and how they feel is the best chance for them to win the game  Ryan Mason  ",
        "“Look, I will not create a war of words. That is my opinion on it. I don’t think it will change in 20 years time.“I don’t think I will ever be in that position or earn the right to criticise another football club for how they want to try and win the game and how they feel is the best chance for them to win the game in that moment in time.”The image of Skipp being caught in the head and falling to the floor may have brought back bad memories for Mason, who retired at the age of 26 following a fracture of his skull after a clash of heads with Chelsea’s Gary Cahill during a match for Hull in 2017.",
        "Mason admitted Skipp had been fortunate, adding: “He is a very, very lucky boy. He had a couple of gashes in his head, needed near to 10 stitches and we are talking about a couple of inches away from an eye problem.“I think the overall feeling this week is we are quite grateful Skippy is okay and nothing too serious.“Obviously a different situation (to me), different moment as well. One was with a head, one was with a boot so the dangers are different.“At the same time the head is a vulnerable part of the body. We continue to see that. Thankfully Skippy is okay. He is in contention.”",
        "Skipp is one of two Spurs academy graduates set to feature against Palace alongside vice-captain Harry Kane and the club’s Under-18s were able to secure a second trophy of the season on Thursday night at Villa Park.A 3-1 win over Aston Villa clinched the Under-18 Premier League Cup to add to the Under-17 version won against Nottingham Forest last month.Mason has seen plenty of the youth team this season and knows the path they will now attempt to take, but he insisted there can be no set timescale on how long it could take some of Stuart Lewis’ current crop to break into the first-team.“Absolutely I have seen a lot of them. I work for this football club, I work in the first-team and it is part of my job to pay attention and understand where the academy are at and try bridge that gap,” he explained.“Of course we have hope for many of them but at 16 and 17, it can be a long road and it can be difficult.“Sometimes people develop earlier than others and sometimes players seize the moment. Hopefully some of them can make the step up in the coming years.“From a timescale point of view, it is very difficult to put a time on it but historically this football club has always valued that and we continue to do that now.”"
    ]
}