{
    "articleURL": "/home/gardening/article-12057015/WILD-MEADOWS-King-Charles-big-fan-letting-nature-try.html",
    "content": [
        "This month the UK's RHS is encouraging gardeners to take a relaxed approach READ MORE: A fondness for phlox: American beauties bring colour and sweet scent to bordersThe Royal Roots exhibition of botanical paintings at the Old Laboratory, RHS Wisley, reveals that the plant most associated with King Charles III is not his favourite delphinium, but the humble yellow rattle.",
        "Rhinanthus minor is often called 'the meadow maker' due to its ability to weaken vigorous grasses, allowing wildflowers to flourish.It is found in the Wildflower Meadow at Highgrove, laid out for the then Prince of Wales by Miriam Rothschild in 1982.The meadows have now come into fashion. This month, the Royal Horticultural Society is encouraging gardeners to let their lawns grow long as part of No Mow May.Taking a more relaxed approach to grassy areas gives insects, birds and small mammals a chance to thrive, while leaving us with more time to enjoy that Coronation tea.",
        "ROYAL EXAMPLEWe may not have the King's acres, but it's possible to create a mini meadow in the smallest of gardens, even in a tub on a balcony or by the front door.If you have a bit more space to play with, you can make a grassy meadow with areas cut shorter between it to create pathways and seating areas.The Wildlife Trusts explains that by letting grass grow long, peppered with flowers, we can provide one of the rarest habitats in our well tended gardens.It suggests leaving most of the mowing until July or August after plants have flowered.Alternatively, make a wildflower patch from scratch. Preferably choose a site in full sun, somewhere that hasn't been cultivated recently, and where the soil is relatively poor.",
        "Planting mixes are available for partial shade plus conditions ranging from dry, chalk grasslands to moist meadows.You can also choose between seed blends that need resowing annually but provide more colourful displays and perennial mixes.After a few years, one or two species may dominate perennial wildflower plantings, but you can thin these out as desired.First, prepare the seedbed by raking over the soil and remove vigorous weeds, such as nettles, which could take over if left.Sow seeds evenly. Using silver sand can help identify areas you have already sown.Then cover with a thin layer of peat-free compost and water well.MIX IT UPThere are many different meadow mixes — those that attract bees, butterflies and other pollinators, cottage garden blends, colour-themed selections and shade-lovers.If you have a more fertile soil, a mix including cornflowers, poppies, marigolds and corn cockles can work well.A perennial mix might include echinacea, rudbeckia and coreopsis.You can also buy seed impregnated papers, which you simply lay onto a prepared bed.These are great for beginners and children and help suppress weeds. More expensive are meadow mats.These are laid like standard grass turf and are a good option if you want to create a wildflower meadow quickly.Once you've established a mini meadow, save your own seed for future years. Leave plants for a few weeks after flowering to allow the seeds to set, then remove the pods as they turn brown and store in a labelled, paper envelope.",
        "Once the seeds have shed, remove the husks, and keep them in a cool, dry place until required."
    ]
}