{
    "articleURL": "/news/article-12058559/South-Korean-mum-charged-murder-children-suitcases-New-Zealand.html",
    "content": [
        "A mum has been charged with the murder of her childrenHer two children were found in suitcases back in August She is fighting to keep her name hidden in NZ's High CourtA mother who has been charged with the murder of her two children is fighting in court to keep her name hidden.",
        "The bodies of the children were discovered inside abandoned suitcases in Auckland, New Zealand last August.Following an international manhunt, the children's mother, 42, was extradited from South Korea and charged with murder.The woman, who has pleaded not guilty to the two charges, faced New Zealand's High Court on Monday.Her lawyer, Chris Wilkinson-Smith, submitted an application for continued name suppression after Justice Anne Hinton refused to grant suppression back in March.",
        "The appeal was once again made on the basis of extreme hardship and that the publication of the woman's name would risk her safety.Mr Wilkinson-Smith claimed Justice Hinton did not take proper consideration of health reports when continued suppression was declined.The prosecution rubbished this assertion, saying the report was taken at its highest by Justice Hinton.Justice Anne Hinton explained that there was no evident test to prove that the publication of the woman's name would endanger her safety.'While it sounds harsh, that is the relevant test,' she declared.'I have not been provided with evidence showing that [the defendant] would likely be severely affected by the publication of her name or that her safety would be endangered.'Tania Goatley, the lawyer for media publications Stuff, NZME, Discovery and RNZ, opposed the suppression.The Court of Appeal has reserved its decision.",
        "During an appearance in court last week, the woman said she would prove her innocence as she was led back to her jail cell.  ",
        "The remains of a boy and girl were only discovered after a storage unit's contents were auctioned online to a family last year.The family opened the suitcases at their home last August when they discovered the remains. It has been revealed the suitcases were moved between storage units at the SafeStore Papatoetoe facility in Auckland during the second half of 2021, but staff had no reason to suspect there was anything amiss. The children's mother, a Korean-born New Zealander, was arrested in the South Korean city of Ulsan last September after the Korean Ministry of Justice received a request from New Zealand for her provisional arrest.Her extradition back to New Zealand was approved in November, where police escorted her home upon her arrival to the country.She was charged with two counts of murder and faced court less than 24 hours later. The identities of her two children remain suppressed by the coroner.The woman's trial is set to go ahead in Auckland next year."
    ]
}