{
    "articleURL": "/wires/pa/article-12043217/World-Rugby-announces-new-partnership-help-bring-women-sport.html",
    "content": [
        "Rugby chiefs have sealed a multi-million partnership deal which will help to bring more women into the game on and off the pitch as they attempt to seize a potentially pivotal moment.",
        "World Rugby has announced a three-year arrangement with global insurance brokerage Gallagher, the official title partner of Premiership Rugby.Under the deal, Gallagher becomes an official partner of women’s rugby and Rugby World Cup 2025, WXV – the new, three-tier annual global women’s competition featuring 18 teams – in 2023 and 2024, and a founding partner of a new High Performance Academy aimed at increasing the prominence of females in coaching and other roles within the game.The initiative comes days after a record crowd of 58,498 watched England beat France 38-33 to win a fifth consecutive Tik Tok Six Nations title, and six months after 42,579 spectators packed into Eden Park to see New Zealand defeat the Red Roses in the World Cup final.",
        "Speaking from the company’s Chicago headquarters, where she was joined by former England captain Sarah Hunter and three-times World Cup winner Kendra Cocksedge, both brand ambassadors, World Rugby’s head of women’s rugby Sally Horrox said: “We should recognise that it’s a moment in time.“It’s come six months on the back of a record-breaking World Cup, so for me it’s that momentum and people acknowledging and recognising the value and the potential of the game on more than just one occasion when a World Cup comes around.",
        "“But I would hate people to think it just happened overnight. It’s been building for a while, but with that sort of visibility and fans buying tickets, then people start to recognise value; that unlocks fans and revenue which then unlocks investment which means it does kick us on to a new place.“That’s what ground-breaking attendances like that more regularly can do for the game – as well as just allowing women like Sarah and Kendra and the people that are following them just to have the right level of attention and the showcase that they deserve as brilliant athletes, which shouldn’t ever forget that.”World Rugby has set a target of having 25 per cent of all coaching and performance roles with the 16 teams at the 2025 World Cup filled by women, one which Horrox admits is “very, very ambitious”.Hunter, who retired as a player in March having amassed a record 141 international caps, has seen huge change since her early days in the game, but knows that is only a start.She said: “There are more females involved in domestic rugby across the world; our next step is to try to get more of those females into that international space. That's the big thing we need to do, we need to make it a place that women have the confidence to come.  Former England captain Sarah Hunter  ",
        "“You look at Gaelle Mignot over in France, but she’s one of too few that we have, so we want to try to accelerate that and just create a really inclusive landscape for women to want to come and be involved in the game.“That’s the big thing we need to do, we need to make it a place that women have the confidence to come. There are so many great female leaders out there and it’s just saying, ‘Actually, no you are good enough and actually, you do belong at that level in this game’.“Hopefully this is what this programme will do.”"
    ]
}