{
    "articleURL": "/sciencetech/article-12059563/First-human-crew-Mars-female-astronauts-new-study-claims.html",
    "content": [
        "A new study claims NASA should send an all-female crew to MarsThis is because women exude less energy than men and need less resourcesREAD MORE: What living on Mars could do to the human body NASA is set to launch a human mission to Mars in the 2030s and a new study suggests it should be an all-female crew because they are more efficient.",
        "Researchers from the European Space Agency (ESA) found women use less oxygen, produce less carbon dioxide and require less food than their male counterparts.The team simulated a 1080-day mission with four women astronauts and found they needed 3,736 pounds less food, saving more than $158 million.Because Mars is about a seven-month journey from Earth, the study urges space agencies to consider the findings to reduce the mass and volume of food that must be launched and stored with the crew.",
        "Men and women, however, are both vital in space and will be necessary for when humanity colonizes the Red Planet. Approximately 622 people have launched into space, but only 72 are women.NASA has sent a total of 355 people to space so far, of which some 55 have been women — or 15 percent. It has also sent 24 people to orbit the moon and 12 to walk on the lunar surface, who were all men. Russian Valentina Tereshkova was the first woman to ever leave the earth's atmosphere — setting off in 1963. And it was not until 1983, when Sally Ride launched to the International Space Station, did American women first visit the final frontier.However, NASA is determined to put the first female astronaut on the moon in two years and will likely include women on the trip to Mars.",
        "The new research suggests that NASA and other space agencies need to focus on all-female astronaut crews when it comes to long space missions.The simulated 1080-day mission of the all-female crew shows because of their smaller stature, the group would free up eight cubic feet of space in the capsule.",
        "This is about four percent of a 'Gateway' HALO module in NASA's proposed lunar orbit space station. Scientists with the ESA analyzed oxygen consumption, total energy expenditure, carbon dioxide, heat production and water requirements of males and females on more extended spaceflight missions to see what the optimal astronaut would look like.",
        "The avid surfer, rock climber and sailor was selected to become an astronaut in 2013.",
        "Male astronauts had a total energy expenditure rising by 30 percent, oxygen consumption rising by 60 percent, carbon dioxide production rising by 60 percent, and water requirements increasing by 17 percent.Female astronauts had much better metrics across the board as their body size increased, with the most impacted figures equating to a 30 percent reduction. NASA scientist Geoffrey Landis has long thought females are more fit for space.In 2000, he said: 'Women are on average smaller than males: women use less oxygen, consume less consumables, produce less carbon dioxide. 'They have lower mass and take up less volume. The argument for an all-female crew is simple: such a crew would require considerably less support… and allow a smaller spacecraft. ",
        "'This would produce a considerable savings in cost.'NASA astronaut Christina Koch was recently named the first woman to visit the moon when NASA's Artemis II mission takes off next year.The Grand Rapids, Michigan native, 44, is already the record-holder for the longest amount of time a woman has spent in space, 328 days, and for taking part in the first all-female spacewalk in 2019.The Artemis II mission marks NASA's first trip to the moon in half a century, which is really a test for NASA's ultimate goal of sending humans to Mars.The agency sent an empty Orion capsule around the moon last year before it returned to Earth in a long-awaited dress rehearsal.If this latest mission goes well, then another flight to land people on the moon will be sent in 2025 — as part of tests ahead of getting people onto Mars."
    ]
}