{
    "articleURL": "/tvshowbiz/article-12039309/Pamela-Anderson-55-shows-incredible-toned-curves-white-swimwear.html",
    "content": [
        "Pamela Anderson showed off her incredible toned curves and radiant make-up free visage in a sizzling photoshoot for her collab with Frankies Bikinis. ",
        "The Baywatch star, 55, revealed her ample cleavage and toned midriff as she modeled two different white swimsuits - a sizzling bikini and a sexy one piece with a cut out over her taut tummy.In one photo, the Love, Pamela star lounges on a cement seashell with a pool in the background. She is gorgeously fresh-faced and her hair is in soft waves. The second suit featured hip-hugging bottoms with fringe hanging from the hips with the star striking a sultry pose.The snaps were captioned: 'surf bunny. a super soft washed cotton like your favorite vintage tee, lined with swim fabric #pamxfrankies.' ",
        "Another show saw Pamela straddling a surf board in a pool, as she showed off her toned abs in a light pink bikini.She also rocked a racy high-cut white one-piece bathing suit reminiscent of her 90's Baywatch wear.Pam jetted off to Grand Cayman for the shoot at the luxurious Palm Heights Hotel. The Home Improvement alum also shared a Polaroid-like snap of herself in a bikini top with her hands in her beachy hair and a big smile on her face.The Barb Wire actress announced her collab with the Malibu based swimwear brand on April 27.In an Instagram post, she shared a snap of her in her iconic red Baywatch-era one piece swimsuit.",
        "'It’s about time. I have been so excited to share this with you -I’m horrible at keeping a secret. Time went so slowly…But today after a long year -I can tell you All my favorite ideas and tricks of the trade -All mixed into my swimwear collaboration with @frankiesbikinis,' she wrote.'A dream come true/ And who better to do this with than the sweetest girl from Paradise Cove (@francescaaiello). She grew up before my eyes, with my boys - our story is authentic and unique. Raw, fun &amp; timeless… Available May 4th,' she added.",
        "Pam lived in Paradise Cove, Malibu with her sons Brandon, 26, and Dylan, 25.  The V.I.P. star has been promoting her new line of swimwear for several days and her fans are loving it. 'So glad Pamela is showing the new kids how to really pose,' one fan wrote.Another fan chimed in, 'Love Love Love! Pamela is cutest with no make up on!'"
    ]
}