{
    "articleURL": "/femail/article-12048965/Its-drug-Speech-therapist-details-screen-time-ruining-kids.html",
    "content": [
        "TikTok user Ema recently opened up about issues with public education She recalled having a student whose parents allowed him unlimited screen timeEma said he'd get violent at school whenever he had to stop using technology  A speech therapist has opened up about how screen time is ruining children and causing more behavioral issues in school. ",
        "TikTok user Ema, who uses the handle @emaroadkill, recently went viral when she reflected on the issues plaguing public education in the U.S., saying things are 'pretty bad right now.' 'Kids are having more behaviors than I've ever seen before, and then we're also having a mass exodus of teachers,' she explained. 'So in places where you need a lot of support, we have less than we've ever had.'Ema noted that many people have blamed the pandemic, but she thinks 'it's a symptom of a bigger issue.'",
        "She recalled how she had a 'very violent' student who was addicted to screen time because his parents let him use his tablet whenever he wanted.  'This kid was hospitalizing people. This kid was injuring staff and other kids, and 99 percent of the time it always came back to the same thing,' she said. Ema explained that the violent outbursts arose any time they tried to transition from using technology to another activity, including lunch and going to the bathroom. 'We started having all these meetings to try to find a solution,' she told viewers. 'We brought in behavior specialists and autism consultants. We made a behavior plan.'They tried positive reinforcements, negative reinforcements, sensory breaks, and access to sensory tools, but nothing worked.",
        "'The second he needed to be off any kind of technology, everything broke down and people got injured,' she said. It wasn't until she talked to the child's parent that she got to the root of the issue.  'At one of these meetings, I was talking to the parent, and I just said, \"How much screen time does he get at the house?\" And the parent said, \"I'm not sure.\"'",
        "The parent told her that he had his own tablet that went everywhere with him. He had unlimited screen time, and the only time he wasn't using it was when he was sleeping or showering. 'Let's read between the lines there,' Ema said. 'This kid gets unlimited access to screens while they're not at school, and we know now that screen time is a drug. 'Research is undeniable. It's not debatable. It's a drug. It released dopamine hits to your brain just like a drug, and you need more and more of it to get the same effect just like a drug.'Ema realized that all of the interventions they were doing at school weren't working because the child was addicted to screen time. 'We were trying to take someone who has 24/7 access to a drug and give it to him in little drips and drops here and there and expecting him to be okay with that,' she explained.",
        "She wishes she could tell the parents that these meetings are a waste of time if they aren't willing to enforce the same limitations at home. 'It doesn't matter if we have a full staff of behavior specialists to follow your kid around all day. We are putting a Band-Aid on a gushing wound,' she said. ",
        "'We are asking a full-blown addict to be okay with small amounts of their drug when we decide when they have full-blown access the 16 hours a day they're not at school. 'What I will also say is I'm not willing to get injured because of your lack of limits,' she added. 'If you're not willing to moderate his usage at all, why don't we just hand him an iPad and call a spade a spade at school?'Screen time is ruining our kids, and I don't know a single educator who wouldn't agree with that.'Ema's video has been viewed nearly 700,000 times and has received more than 3,500 comments. One user agreed that it's '100% parents not wanting to be parents or not willing how to learn,' while a school psychologist said she is 'seeing this SOOOO much this year.''I have so many parents tell me \"I don't give my kids consequences I don't want them to hate me\" which doesn't help teach their kids right from wrong,' someone else added. "
    ]
}