{
    "articleURL": "/sport/football/article-12045523/David-Beckhams-Inter-Miami-Al-Hilal-Barcelona-battle-Lionel-Messi-summer.html",
    "content": [
        "Lionel Messi is the subject of a three-way tug-of-war including Inter Miami Messi told owner David Beckham in 2018 that he could 'give me a call' one day PETE JENSON: Messi will LEAVE PSG at the end of the season after suspensionLionel Messi was never likely to be short of options once his time at PSG came to an end, and Inter Miami remain keen to fend off Al-Hilal and Barcelona and bring the 35-year-old to the MLS. ",
        "The seven-time Ballon d'Or winner's deal at the Ligue 1 titans is up at the end of the season, and after prolonged uncertainty over his future, it was confirmed that he will leave the club earlier this week. After his success in Qatar - lifting the World Cup trophy alongside his Albiceleste team-mates in December - rumours had hinted that Messi would remain with PSG.But any contract failed to materialise, and now he has been banned for two weeks after visiting Saudi Arabia without permission from PSG - and reports suggest that his father, Jorge, informed Les Parisiens that his son would be leaving a month ago.And now David Beckham's Inter Miami are thought to have entered the race, joining the likes of Saudi Arabian outfit Al-Hilal and Messi's former side Barcelona, who may be hamstrung by their own financial troubles. ",
        "Beckham's side have long been linked with a move for the Argentine, and the Times report that the players representatives met with Inter Miami's owners during the World Cup, with the MLS club left confident that they could secure their man. While it is unlikely that the club could rival the financial allure of a move to Saudi Arabia - where he would face long-term rival Cristiano Ronaldo - Miami is somewhere that the Messi family would be comfortable moving to. ",
        "They already own a holiday home there, and Messi would find a South American contingent already at the club, with compatriots Nicolas Stefanelli and Franco Negri, Brazil's Jean Mota and Venezuelan striker Josef Martinez. The Argentinian FA are also building a high-performance centre in Miami, and Messi himself teased a future move to the club after they were formed in 2018, telling Beckham: 'Maybe in a few years you can give me a call!''For us, the landscape's not changed at all,' Inter Miami coach Phil Neville said. 'With any deal for any DP [designated player allowed outside of a salary cap] of the level you're talking about, it is complicated; it takes time.'Rest assured, we're working every second of every day to bring in the best players, and I think he's one of the best.'It is not just Neville and Beckham that are fighting for Messi, though, with league commissioner Don Garber outlining his potential plan to lure the 35-year-old across the Atlantic.'You're dealing with perhaps the most special player in the history of the game. So when there are rumours of him connected to Miami, that's great,' Garber told The Athletic.'And if it could happen, it would be terrific for MLS, it would be terrific for Messi and his family, and like everything with us, we try to run every opportunity down. I can't give any more details than that because we don't have them.'",
        "'We're gonna have to structure a deal that's going to compensate him in ways that he and his family expect.",
        "Barcelona are an equally lucrative prospect for the Messis, having spent 17 years there before the player's departure, and his family have now returned to the Catalan city. But a move would likely leave the club breaching LaLiga's stringent financial rules, with the Blaugrana already battling to balance the books, and are likely the third most likely destination after Al-Hilal. The Saudi Pro-League side can offer Messi an eye-watering £350million-a-year deal to land his signature, which will be a difficult prospect to pass up. Messi is also an ambassador for the country, having signed a £25m-a-year package with Saudi Arabia, which led to his unauthorised trip this week. "
    ]
}