{
    "articleURL": "/femail/article-12048133/Style-Queen-Letizia-stuns-sleek-black-dress-gold-heels.html",
    "content": [
        "The minimal outfit was in stark contrast to her gala ensemble last night Read More: Queen Máxima of the Netherlands is elegant in black coat dress as she attends Remembrance service in Amsterdam with King Willem-AlexanderQueen Letizia of Spain looked effortlessly chic as she hosted a reception for the Colombian president with King Felipe this evening.",
        "The royal, 50, opted for a sleek sleeveless midi dress for the event at the Royal Palace in Madrid.  The minimal dress had a slight A-Line fit, which highlighted the mother-of-two's petite frame and flared out at the bottom. In contrast to the tiara she wore last night, Letizia opted to keep her jewellery simple this evening.The monarch choose a pair of plain gold hoop earrings - which perfectly matched her selection of rings. ",
        "Adding a pop of colour to her ensemble, Letizia opted for a pair of gold metallic slingback heels. The royal styled her chocolate brown hair straight this evening and opted for her trademark bronzed complexion and smokey eye. Meanwhile, King Felipe was suitably smart for the state reception in a navy pinstripe suit, blue patterned tie and black shoes. What's more, Verónica Alcocer - the wife of Colombian President Gustavo Petro - stunned in a bold colour blocking ensemble for the occasion.The stunning silk gown featured a bright blue tiered skirt, hot pink bodice and a bright orange belt and sleeve.Last night, Letizia pulled out all the style stops as she hosted a gala for their visitors.The royal oozed elegance as greeted Colombian President Gustavo Petro and his wife Verónica Alcocer.The mother-of-two opted for a stunning red gown with peplum detailing around the waist and slightly flared short sleeves. ",
        "The show-stopping gown skimmed Letizia's slim figure and even had a small train incorporated into the design.Queen Letizia paired her frock with a glitzy floral tiara and simple diamond stud earrings.The Colombian politician has made the trip to Spain to urge more action against climate change. The presidential couple arrived in Spain yesterday and will stay until Friday.After the Colombian president's visit, Queen Letizia and King Felipe will join other crowned heads and 203 international heads of state in attending King Charles' Coronation in London on Saturday.It has been reported that some 2,200 people will witness the historical event at Westminster Abbey this weekend.A number of recognisable figures, such as the Archbishop of Canterbury and the Duke of Westminster, will have key roles to play during the coronation ceremony."
    ]
}