{
    "articleURL": "/wires/ap/article-12047295/PSG-shift-focus-following-likely-exit-Lionel-Messi.html",
    "content": [
        "MANCHESTER, England (AP) - Lionel Messi's impending exit from Paris Saint-Germain could mark the beginning of the end of the French soccer club's era of excess.",
        "The Argentina great's departure after this season has the potential to be every bit as significant as the host of superstar signings since Qatari money transformed PSG into one of the richest clubs in the world.Barring a sudden change of heart from either side, Messi is set to leave when his current contract expires in a few weeks.While that paves the way for the seven-time Ballon d'Or winner to earn a reported $400 million a year in Saudi Arabia, it also gives PSG a chance to pivot away from a strategy that hasn't quite worked out and turn instead to developing local talent.Owned by Qatar Sports Investments since 2011, PSG has dominated French soccer and signed some of the biggest names in the sport, including Zlatan Ibrahimovic, Kylian Mbappe, Neymar and Messi. But the team has yet to win European club soccer's biggest prize, the Champions League.If anything, PSG is slipping further away from the trophy it craves the most after back-to-back eliminations in the round of 16 over the past two seasons.Despite a roster stacked with world-class talent, the club has gone out at that stage of the competition in five of the last seven seasons and only reached the final once in its history, in 2020.",
        "Not even the dream team of Messi, Mbappe and Neymar has been able to alter that.While Messi's exit makes things appear clear now, the shift in strategy to focus on young talent seems to have started last year. A state-of-the-art training center in Poissy is close to completion and will provide a base to nurture the best young players France produces.At the heart of this new vision, however, is arguably the biggest talent of them all: Kylian Mbappe. That raises questions about the future of Neymar, with the Brazilian not appearing to fit the club's model.It also may explain the parting of ways with Messi.While the recent World Cup winner's time at PSG is ending on a sour note - he was fined and suspended for an unauthorized trip to Saudi Arabia - his move from Barcelona is still considered a success.In his first season at the French club, Messi is estimated to have earned PSG a profit of about $11 million in commercial partnerships.As a point of pride, PSG president Nasser Al Khelaifi also managed to assemble an array of soccer's biggest stars into one attack, albeit for a short time. Now comes a shift away from the \"bling\" to more home-grown talent.France, after all, has produced some of the best soccer players in history, with Mbappe the latest, and PSG wants to capitalize on that.",
        "France won the World Cup in 2018 and only lost to a Messi-led Argentina on penalty kicks in last year's final. Mbappe was the only PSG player in the France team that started in that final in Qatar.France's brightest young stars have headed instead to European clubs like Real Madrid (Aurelien Tchouameni, Eduardo Camavinga), Barcelona (Ousmane Dembele, Jules Kounde) and Bayern Munich (Kingsley Coman, Dayot Upamecano).Coman, who came through at PSG, scored when Bayern knocked his former team out of the Champions League this season.Leipzig forward Christopher Nkunku, who is expected to move to Chelsea in the offseason, was also at PSG. So was another France international, Bayer Leverkusen winger Moussa Diaby.Mbappe, who has been a long-term target for Real Madrid, appears to be on board with PSG's plans because he signed a three-year contract with the club last May. He is certainly \"bling\" in soccer terms, but he also fits in perfectly with the new strategy of local youth.There have been moves toward that this season with 17-year-old players Warren Zaire-Emery and El Chadaille Bitshiabu breaking into the first team and playing in the loss to Bayern.The hiring of a French coach in Christophe Galtier last year was another example of the shift, though it is unclear if he will remain beyond this season with results dropping off in the second half of the campaign.",
        "PSG still leads second-place Marseille by five points in the French league and is on course for a ninth title in the era of Qatari ownership. But it is the club's failings in the Champions League that have been unacceptable in the face of the huge sums spent on Neymar ($219 million) and Mbappe ($190 million).That underachievement at the highest level has fed into a general sense that PSG is a collection of individuals, rather than a cohesive team. And the focus of the collective going forward points to an acknowledgement of that.By comparison, Manchester City, which is backed by Abu Dhabi's ruling family, has put together arguably the best team in Europe under Pep Guardiola, even if the Champions League still eludes it.That could change this season with City in the semifinals for the third year in a row.Messi's departure from PSG, and maybe Neymar's, too, could ultimately move the French club a step closer in its mission to finally win the European Cup.___James Robson is at https://twitter.com/jamesalanrobson___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}