{
    "articleURL": "/sport/football/article-12049901/Man-shot-dead-amid-Napoli-Serie-title-celebrations-200-injured.html",
    "content": [
        "Napoli drew 1-1 with Udinese to secure their first Serie A title since 1990It brought thousands of people out onto the streets of Naples to celebrateMore than 200 people were injured during a wild night of celebrations after Napoli won their first Serie A title in 33 years.",
        "Scores of fans raced onto the pitch at the Friuli stadium in Udine after the final whistle blew and used their belts to beat each other in violent scenes. Men were seen cowering on the floor and covering their heads in an effort to avoid the blows.At least 203 people ended up in hospital overnight for injuries sustained during the celebrations - from knife wounds to burns from firecrackers and asthma attacks caused by inhaling smoke from flares.The celebrations erupted after Napoli sealed the Serie A title with a 1-1 draw against Udinese, matching the league record by clinching victory with five games to spare. It is Napoli's first championship since Diego Maradona led the club to its first two Serie A titles in 1987 and 1990. ",
        "Police said Vincenzo Costanzo, 26, was shot dead in a crowd in Naples but said his death was 'completely unconnected' to the celebrations.Costanzo was a member of the D’Amico crime family which has been involved in a bitter feud with rivals from another clan. Naples police chief Claudio Palomba said at least seven bullets had been fired and all indications were it was a hit as part of gang violence between members of the Camorra, the organised crime group based in the city.",
        "Costanzo was found on the ground bleeding heavily, along with three others, one of which was his girlfriend, and all were taken to a nearby hospital for treatment.Doctors battled to save Costanzo but he was declared dead while the others were treated for minor injuries and expected to be released from hospital in a few days.Later, medical authorities in Naples issued an updated report to say that an astonishing 203 people had been treated across the city following the title win.Officials said 22 were in a serious condition having suffered burns, head injuries, and broken bones after being hit by fireworks or falling from scooters and cars.Among those hurt were three police officers who were attacked as they tried to move crowds on, but they were not seriously injured.Thousands flooded into the main square of Naples at Piazza Plebiscito waving flags and banners, with many climbing up lamp posts and up onto balconies in their exuberance.Sixty thousand fans had packed into the sold-out Diego Maradona stadium to watch the game live on giant screens as it was beamed back from Udine 500 miles away.They were whipped into a frenzy ahead of kick-off with a music and light show but the atmosphere went decidedly flat after just 13 minutes when Udinese took the lead through Sandi Lovric after just 13 minutes.",
        "However top scorer Victor Osimhen's leveller in the second-half secured the single point needed and kick off crazy scenes of joy across Naples as the side went an unassailable 16 points clear with five games left.",
        "Earlier in the week the British Consulate in Naples - a city popular with tourists from the UK - had posted a warning to visitors about the expected reaction to the title win.It said: 'Spontaneous celebrations are expected to take place throughout Naples from the end of April to early May following the Serie A football championship.'If you're visiting Naples during this time, you should plan for transport delays due to busy streets and possible road closures.'Expect large crowds and the use of loud fireworks. Remain vigilant and take care of your personal possessions.'Police Naples had outlawed the use of fireworks in an attempt to lessen casualties and traffic was also banned from the centre to try and stop gridlock.But as England fans found out two months ago when they visited the city during an 'alcohol ban' the edict was more of a suggestion than a strictly enforced rule.",
        "Nigerian striker Osimhen led celebrations in the dressing room at Udine and pictures on social media showed the players dancing wildly and singing loudly.",
        "He said: 'I'm happy for all Napoli fans worldwide. No one deserves the Scudetto more than Neapolitans - more than us. 'I don't care who scored, I just wanted to get the Scudetto.'I want to enjoy this moment for the rest of my life. Then after the season my other dreams can come.' There were also celebrations in London's Soho where dozens of ex-pat Italians had gathered to watch the game in pizzerias and restaurants.Local authorities in Naples were now planning for the partying to continue for several days and were on standby for the return of the team from Udine with people expected to line the streets from the airport.Napoli previously won the title in 1987 and 1990 when Diego Maradona played for the southern Italian side and is worshipped as a god by devoted fans with several shrines dedicated to him across the city."
    ]
}