{
    "articleURL": "/sport/football/article-12055425/Micah-Richards-changes-ridiculous-bright-yellow-suit-Sky-Sports.html",
    "content": [
        "Micah Richards was seen wearing an outlandish yellow suit on Sky SportsThe outfit included a mushroom-dotted waistcoat, and was the result of a bet Richards wore the garish number after winning a wager with Jamie RedknappMicah Richards has revealed the outlandish outfit he wore on Sky Sports on Saturday was a result of a bet he won against Jamie Redknapp.",
        "The pundit wore a garish yellow blazer complete with a flower pattern and a label baring his 'Big Meeks' nickname.He also sported a black waistcoat spotted with mushrooms to complete the look, which came in stark contrast to Redknapp's black suit.Such an outfit may seem like a forfeit, but Richards later revealed it was in fact the result of a bet he had won on another Sky programme.He said during Sky's coverage of Manchester City vs Leeds and Liverpool vs Brentford: 'So basically I won the bet on A League Of Their Own. We went to south east Asia.",
        "'And whoever won had to wear this ridiculous that Jamie has designed. How am I looking?'Redknapp said he was 'very proud' of his handiwork and nicknamed himself 'Georgio Redknappio'.Kelly Cates, who was hosting the show, commented that 'all the colours toned in' on Redknapp's joke outfit, but when asked by Richards if he 'pulled it off' she replied 'I wouldn't say that.'Aside from the pundits' choice of clothes, the games they watched produced two important results.Liverpool were unconvincing in their 1-0 win over Brentford, but their sixth victory in a row has put them within one point of  fourth place Manchester United.The Red Devils do have two games in hand, but Jurgen Klopp's side are running them closer than many would have predicted earlier this year.",
        "As for Manchester City, their 2-1 victory against Leeds has put them four points clear of Arsenal at the top of the Premier League table.They did have a late wobble as Ilkay Gundogan, promoted ahead of Erling Haaland to take a penalty as he was on a hattrick, hit his spot kick against the post and saw Leeds run up the other end and score just seconds later.Pep Guardiola was enraged by the incident, but his side did hold of for a vital three points in their treble chase.City will next be in action in the first leg of their Champions League semi final against Real Madrid on Tuesday. "
    ]
}