{
    "articleURL": "/tvshowbiz/article-12055427/Taylor-Swifts-rumored-boyfriend-Matty-Healy-seen-spending-time-Nashville-condo.html",
    "content": [
        "Matty Healy was seen flashing a smile as he grabbed a Starbucks on Saturday while being guided by Taylor Swift's bodyguard after reportedly spending time at her Nashville condo the night before. ",
        "The British-born singer, 34, exited the popular coffee shop chain and headed back to an awaiting vehicle that took him to Nissan Stadium ahead of Swift's concert. The 1975 front man opted for stylish comfort wearing a pair of black trousers that were secured with a black belt with a silver buckle at the waist. Matty also donned a long-sleeved, white button up which he chose to leave partially unbuttoned near the collar, and added a plain white shirt underneath. Later on Matty took to the stage in a skeleton onesie to join Taylor's opening act, Phoebe Bridgers, ahead of Swift performing herself. ",
        "The singer carried a warm drink in his hand while also looking through his smartphone as he was led to a sleek, white SUV parked near the coffee shop. Matty had reportedly arrived at Taylor's Nashville condo, and left later Friday night following her anticipated concert performance. After grabbing a drink to get a boost of energy, Healy was later seen arriving at Nissan Stadium in the heart of Nashville ahead of Taylor's Saturday night performance in the city. The Somebody Else singer who recently stopped by the performer's Eras Tour concert earlier Friday, appeared to confirm their budding romance while singing along to her hit track, Shake It Off, which was captured on video and uploaded to Twitter. ",
        "Earlier on Wednesday, Taylor, 33, and Matty's rumored romance came to light, only weeks after the Blank Space hitmaker's split with actor, Joe Alwyn, was confirmed.Earlier on Friday, he was seen dancing along to Swift as she sang her hit track, Shake It Off, amongst fellow concert-goers in a secured area on the floor section of the venue.The video was posted on Twitter and quickly went viral amid rumors that Matty and Taylor have started a budding romance. Despite the speculation that the two have entered a relationship, both singers have yet to publicly confirm they are dating. However, earlier Thursday, The Sun reported that Taylor and Matty have plans to confirm the romance over the weekend during her Nashville stop, with the British star set to join her on stage. According to the outlet, Healy is slated to perform two of her popular songs, with a source stating, 'Taylor and Matty have been planning their ‘coming out’ for a few weeks now, and are really excited just to go public with their love.'  ",
        "The insider further revealed, 'Neither of them want any secrets, or to hide away. The plan is for Matty to walk out on stage mid-show and play two songs.' 'They will chat to the audience and, at present, the idea is for them to confirm their romance with some kind of PDA — public display of affection. It won’t be anything remotely cheesy though.' ",
        "And on Saturday, Matty strummed on his guitar as he made an appearance with Taylor's supporting act during the show.  Wearing a black and white skeleton ensemble, the musician sang along with the Moon Song singer moments before his rumored girlfriend also stepped out onto the stage.  Taylor and Matty's rumored romance first came to light earlier this week on Wednesday, with a separate source telling The Sun, 'She and Matty are madly in love.' 'It’s super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn’t work out,' the insider added. Before dating rumors emerged around Swift and The 1975 singer, Taylor had dated British actor, Joe Alwyn, for six years until their split was confirmed last month in April. In regards to her ex, the source informed the publication, 'Taylor and Joe actually split up back in February, so there was absolutely no crossover.' ",
        "'Both Matty and Taylor have been touring over the past few weeks, so it’s been a lot of Face-Timing and texting but she cannot wait to see him again,' and added that the two stars, 'are incredibly supportive of their respective careers.' 'They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to ‘own’ this romance, and not hide it away.' ",
        "While Taylor focuses on her Eras Tour, which is slated to conclude later this year in August, Matty is also in the middle of touring with his band, The 1975. Before being romantically linked to Swift, the British hitmaker previously dated model, Meredith Mickelson, until they went their separate ways earlier this year in February. 'Matty was seeing Meredith while he was in LA in February - but things fizzled out when he went to New York at the end of the month,' an insider told The Sun. Following the break up, the two are reportedly still on 'good terms.' Not long after Taylor and Joe's split was confirmed in April, a source opened up to People about the reasoning behind the break up, and explained that the two, 'weren't the right fit for one another.' The insider further expressed that Joe didn't have a chance to fully get to 'know' Taylor during the pandemic and that, 'he didn't really 'know' her yet outside of that bubble.' ",
        "The source added that the actor had a difficult time, 'with Taylor's level of fame and the attention from the public.' However, their split was not dramatic and the insider revealed that the two stars are also still on 'friendly' terms. Taylor and Matty's rumored romance might not come as a surprise to some fans due to the two singers knowing each other for years. ",
        "He had notably helped her create tracks for her Midnights album two years earlier, although the songs eventually never made it onto the record upon its release late last year.  The Love Story songstress has also already met Healy's mother, Denise Welch, back in January while attending The 1975's concert at the O2 in London. She also joined the band on stage as a special guest at the time. "
    ]
}