{
    "articleURL": "/tvshowbiz/article-12042135/Slim-Matt-Lucas-longingly-gazes-artisan-choux-pastries-quitting-Bake-Off.html",
    "content": [
        "Matt Lucas appeared to be missing the Great British Bake Off tent as he longingly gazed at a selection of artisan choux pastries while out in Soho, London on Tuesday.",
        "The comedian, 49, stepped down as host earlier this year, with Alison Hammond stepping up to replace him for the upcoming series. And Matt showed off his sweet tooth as he looked at the chocolate eclairs on display at the Maitre Choux pastry shop. Matt admired the eclairs in the window. They are described to be the world's best eclairs and are prepared by their 3 Michelin Star-experienced pastry chef. But the slim Little Britain star didn't end up giving in to his sugary cravings, after changing his diet and fitness regime to lose weight he had gained in lockdown. ",
        "Matt cut a casual figure in a red Snoopy jumper, leather jacket and red baseball and chatted away on the phone as he enjoyed a low-key stroll. In April 2020, Matt admitted that he was keen to 'get fitter' during his time in lockdown, after feeling he had 'put on a little bit of weight'.He said: 'The one thing I need to do is get fitter, I have put on a little bit of weight, that's my next challenge to do a bit more exercise.'I might have to make a game of it when I go out an exercise to stay out of people's way. I don't have a garden so I have to find a way to do that.'",
        "The funnyman was previously told to reduce his daily calorie intake to 1,500 by doctors over fears he may develop diabetes.Matt took the doctor's warning serious after tragically losing his own father John to a heart attack in 1996.The actor announced in December that he had quit Great British Bake off because he could no longer juggle the programme's schedule alongside other projects. In March, Alison confirmed her exciting new position on Great British Bake Off in a video of a cake which was shaped like the show's iconic white tent and featured a model of her, Noel and judges Paul Hollywood and Dame Prue Leith.",
        "In a voiceover, the presenter said: 'This is breaking news, Alison Hammond is joining the team of The Great British Bake Off.'Alongside the post, she wrote: 'It's Official!! It's happening The Great British Bake off! let's have it – The cake that is so excited @BritishBakeOff @Channel4 @PrueLeith @PaulHollywood @noelfielding11 #GBBO'. Existing co-host Noel was more than thrilled to welcome Alison to the Great British Bake Off family.Meanwhile, departing host Matt told Alison she was 'born' for the role. In a tweet, he said: 'Dear Alison, many congratulations! 'You were born to do it. You will be brilliant! Xx'"
    ]
}