{
    "articleURL": "/wires/aap/article-12040615/Tasmanias-Australian-Rules-players.html",
    "content": [
        "TASMANIA'S MOST NOTABLE VFL AND AFL PLAYERS",
        "DARREL BALDOCKOne of four Tasmanians with Australian Football Hall of Fame legend status, Baldock captained St Kilda to its first - and still only - premiership in 1966. He debuted at 16 for East Devonport before moving to the VFL in 1962. Known for his ball control, 'Mr Magic' or 'The Doc' played 119 games for St Kilda over seven seasons, kicking 237 goals. Was St Kilda's best and fairest three times and runner-up in the Brownlow Medal. Captain of St Kilda's and Tasmania's teams of the century.IAN STEWARTOne of just four players to win three Brownlow Medals and the only to do so at different clubs, St Kilda (1965, '66) and Richmond ('71). Born in Queenstown on the remote west coast and grew up in Hobart, earning selection for Tasmania as an 18-year-old after four senior games. Formed a deadly combination with Baldock. Has Australian Football Hall of Fame legend status.PETER HUDSONBorn in New Norfolk north of Hobart, Hudson is regarded one of the greatest-ever full-forwards. He holds the highest goal-per-game average (5.64) in VFL/AFL history. Played 129 games for Hawthorn between 1967 and 1977, booting 727 goals. Recruited to the Hawks as a 20-year-old after slotting 378 majors in 78 games for New Norfolk. Has Australian Football Hall of Fame legend status.",
        "ROYCE HARTAmong the greatest centre-half forwards, Hart, who grew up in central Tasmania, played 10 seasons for Richmond from 1967 and won four premierships, two as captain. Is part of the VFL/AFL, Tasmania and Richmond teams of the century. Known for his superb pack marking skills. Has Australian Football Hall of Fame legend status.NICK RIEWOLDTHobart-born Riewoldt was drafted to St Kilda in 2000 as the No.1 pick and went on to play 336 games for the club and kick 718 goals. He captained the side and was a six-time St Kilda best and fairest and a five-time All-Australian.MATTHEW RICHARDSONPart of Richmond's team of the century, Richardson grew up in Devonport on Tasmania's northwest coast. He debuted in the AFL in 1993 and was the clubs season leading goal-kicker a whopping 13 times, finishing with 800 in a 282-game career.ALASTAIR LYNCHAnother key forward to hail from Tasmania's northwest, Burnie-born Lynch won three premierships with the Brisbane Lions in the early 2000s after making his debut for Fitzroy in 1988. He was drafted at No.50 four years earlier.RODNEY EADERecruited from Glenorchy to Hawthorn as a teenager in 1976, Eade won four premierships with the club. The wingman went on to coach 377 games at the top level at Sydney, the Western Bulldogs and Gold Coast."
    ]
}