{
    "articleURL": "/wires/reuters/article-12042847/New-York-State-bans-natural-gas-new-construction.html",
    "content": [
        "By Brendan O'Brien",
        "May 3 (Reuters) - New York has become the first U.S. state to pass legislation banning the use of natural gas for heating and cooking in some new buildings, a plan designed to reduce carbon emissions but opposed by industry groups as excessive and costly.Both the Democratic-led Assembly and Senate late on Tuesday approved the provisions, which are included the state's $229 billion budget. Governor Kathy Hochul and lawmakers agreed to the outlines of the spending package last week.\"Changing the ways we make and use energy to decrease our reliance on fossil fuels will help ensure a healthier environment for us and our children,\" New York Speaker Carl Heastie said in a statement.The move in New York comes amid fierce public debate in the United States over the health and environmental impacts of the cooking appliances that burn fossil fuel and over the broader role of natural gas in climate change.Dozens of cities around the United States have adopted or are considering policies that ban or discourage natural gas in new buildings to address public health and climate concerns. They have been met with strong resistance from gas industry groups and restaurant and appliance lobby groups that argue those concerns are overblown.\"A first-in-the-nation, unconstitutional ban on natural gas hookups in new construction will drive up utility bills and increase housing costs,\" Republican New York State Senator Robert Ortt said in a statement.",
        "The provisions will require new buildings to be constructed with only electric hookups for appliances and utilities beginning in 2025. The law will go into effect for buildings with fewer than seven stories beginning in 2026. The requirements will kick in for taller buildings by 2029, according to the New York Times.Hospitals, critical infrastructure and commercial food establishments will be exempt from the requirements.Buildings where the local grid is not capable of handling the load will also be exempt from the new law. Existing buildings and appliances will not be affected by the legislation. (Reporting by Brendan O'Brien in Chicago; Editing by Bill Berkrot)"
    ]
}