{
    "articleURL": "/wires/reuters/article-12051241/Centre-right-lawmakers-push-EU-nature-laws.html",
    "content": [
        "By Kate Abnett",
        "BRUSSELS, May 5 (Reuters) - The political party behind the European Parliament's biggest lawmaker group on Friday opposed two of the EU's main policies to protect the environment, threatening to block the laws which the group says would hurt European farmers.In a resolution adopted on Friday, the centre-right European People's Party (EPP) said it rejected a proposed EU law requiring countries to restore damaged natural ecosystems and another to halve chemical pesticide use by 2030.\"In too many regions or member states the implementation of existing nature legislation has led to a bureaucratic nightmare and planning deadlock, endangering food security, renewable energy production, crucial infrastructure etc,\" said the resolution, seen by Reuters.It urged the European Commission to first help countries address issues caused by existing EU nature laws. The proposed pesticide targets are \"simply not feasible\" for farmers, it added.The EPP has the most lawmakers of any group in the European Parliament - 176 out of the assembly's 705 members. A source from the EPP group said it stood ready to reject the two laws, if its views were not heard.That could block the policies, if lawmakers from some other groups in the parliament also reject them.The Commission, which proposed the policies, says restoring soil and habitats' health is vital to protect farmers' livelihoods - particularly as they face increasing climate change impacts like drought.",
        "The European Union reformed its huge farm subsidy programme in 2021, setting aside cash to support greener farming.Speaking at a German government conference on Thursday, EU climate policy chief Frans Timmermans said farmers were being told they are \"heroes\" and the EU's green policies are standing in their way.\"But how will they remain heroes when the soil is dead and there are crop failures due to drought? Isn't it time to help farmers regenerate soil and protect crops from drought and high temperatures?\" he said.Other Commission proposals to tackle the 10% of EU greenhouse gas emissions produced by agriculture have also faced resistance - including emissions limits for livestock farms, which member states are trying to weaken. (Reporting by Kate Abnett Editing by Mark Potter)"
    ]
}