{
    "articleURL": "/wires/aap/article-12045303/No-quick-fix-AFLs-struggling-Eagles-Simpson.html",
    "content": [
        "West Coast coach Adam Simpson says he understands the frustration fans are feeling in the wake of the team's woeful form, but concedes there's no quick fix.",
        "The Eagles sunk to last on the AFL ladder after copping a 108-point home loss to Carlton last week.West Coast won just two games last season, and a devastating run of injuries over the past five weeks has crushed any hope of a bounce back this year.At 1-6 and with stars such as Nic Naitanui, Jeremy McGovern, Luke Shuey, Elliot Yeo, Jamie Cripps and Liam Ryan on the sidelines, West Coast are in grave danger of collecting just the second wooden spoon in the club's proud history.West Coast hit the draft hard last year after finally deciding it was time to embark on a rebuild, but it's widely tipped it will take years before the club becomes a finals force again.Simpson has implemented a more attacking game plan this year, but the early progress was soon stifled by the heavy injury toll.The 10th-year coach is contracted until at least the end of 2024, and says he's the right man to lead the rebuild.\"We're chasing something that's not just about this week. It's the longer term,\" Simpson told reporters on Thursday.\"I know it's been frustrating for our fans, and we understand that. No one is more frustrated than me.\"But we've made some changes in the off-season. We've gone in a different direction.",
        "\"We've hit the draft, we want to play in a certain way, and up until round three we (only) had four injuries on our list.\"Simpson said his players simply didn't bring enough effort against the Blues last week.\"That's the start point and the finish point - bring effort, bring intensity and we'll keep working on the things that we think are going to pay us back in the long term,\" Simpson said.\"It's just not a quick fix.\"There's going to be some ups and downs, and last week wasn't good enough.\"Simpson revealed he will likely rotate the captaincy in the coming weeks to give young leaders like Oscar Allen, Liam Duggan and Dom Sheed a chance.Vice-captain Tom Barrass has been leading the side while skipper Shuey (ankle) and vice-captain McGovern (hamstring) have been out injured.Sheed will return from a fractured larynx for Saturday's clash with Richmond at the MCG in a much-needed boost to West Coast's struggling midfield brigade.Despite the doom and gloom surrounding West Coast's struggles, Simpson is doing his best to keep spirits high.He even shaved his head this week after losing a bet to first-year speedster Coby Burgiel.\"I have to apologise to my wife for this haircut,\" Simpson said.",
        "\"I underestimated the intelligence of some of our players. Burgiel, he got me, 'The Burger'.\""
    ]
}