{
    "articleURL": "/money/mortgageshome/article-12051239/Whats-happening-UK-property-market.html",
    "content": [
        "Some 20% of all offers were more than 10% below asking price last monthBut only 7% of these offers were accepted by sellersSome 26% of homes sold for above their asking price in AprilCheck the best mortgage rate you could apply for with our calculatorHome buyers are trying to take advantage of the slow property market to knock down house prices, but sellers are not budging easily.",
        "A report by one of Britain's leading estate agents, Hamptons, has revealed a snapshot of Britain's housing market this spring and how buyers and sellers are faring.It paints a picture of a stand-off between buyers and sellers, with the former expecting price reductions to reflect much higher mortgage rates than in recent years, but the latter standing firm if they have no desperate need to sell. While sellers have lost some power compared to last year, when the market was red hot, they  are managing to shift their homes for closer to their asking price than in any April before the pandemic, according to Hamptons.This suggests that house prices may not fall as much as previously thought, the estate agent said, adding to signs of a slight recovery in the property market in recent weeks.",
        "There have been signs that after a dramatic mortgage spike-induced slowdown, the property market is finding its feet as mortgage rates level off at about 4 to 5 per cent. This is still far higher than the 2 to 2.5 per cent average seen early last year before rates started to rise.House prices reversed seven months of falls, rising by 0.5 per cent in April, according to the most recent Nationwide Building Society.",
        "Meanwhile, Bank of England data published last week showed a 'significant' rise in the number of mortgage approvals.Mortgage rates have fallen from the 6 per cent-plus highs they reached at the end of last year -  after the mini-Budget triggered a financial market panic - though they are still far more expensive than they were in early 2022, continuing to hamper demand.Low offers are more common but not often acceptedMore potential buyers asked for big price reductions last month, with 20 per cent of all offers more than 10 per cent below asking price, up from 12 per cent this time last year.However, only around a third of these discounted offers - or just 7 per cent of all offers at any level - were accepted by sellers, according to Hamptons, which analysed data from some 550 estate agency branches across Britain.More modest offers of at least 5 per cent off also increased significantly, taking them back almost to April 2019 levels.Around 39 per cent of buyers were hoping for discounts of at least 5 per cent under the asking price, up from 22 per cent a year ago. ",
        "Aneisha Beveridge, head of research at Hamptons, said: 'A single-digit annual increase in the number of new homes coming onto the market has not been enough to push stock levels to the point where the scales are tipped in favour of buyers.",
        "'While there are more buyers putting in cheeky offers than a year ago, the majority are unsuccessful. 'Rather, sellers are sticking to their guns and are holding out for a figure which is closer to their asking price than in any April pre-2021.'",
        "A quarter of homes sold for above their asking price Sellers have lost some power compared to last year, but they continue to achieve closer to their asking prices than they did pre-Covid.The average home sold in England &amp; Wales in April achieved 99 per cent of its asking price - this is down compared to April last year but ahead of the 98.1 per cent in April 2019.Meanwhile, astonishingly, just over a quarter of homes sold in England &amp; Wales last month went for above their asking price, up from 17 per cent in April 2019.Hamptons said the uptick in achieved prices has been driven by first-time buyers and investors, acting as mortgage rates have come down from their peak.Last month, the average investor paid 100.1 per cent of the asking price for a property in England &amp; Wales. ",
        "Price reductions rise in the North, but fall in the SouthWhile homes in the South, where affordability is stretched, are still more likely to be sold following a price cut, it was Northern regions that saw the biggest increase in sellers agreeing to lower their price tags. ",
        "The share of homes sold following a price reduction in the North East, North West and Yorkshire &amp; the Humber rose to 45 per cent in April, up from 41 per cent in March.Half of homes in the four Southern regions last month were sold following a reduction, a slight improvement from 51 per cent in March. ",
        "Homes take longer to sell... except for £1m-plus onesThe average home in Britain took 49 days to sell in April, up from 28 days in April last year, but generally this year's sellers have found a buyer quite quickly, Hamptons said. Nearly a quarter (23 per cent) of all the homes that came onto the market so far this year sold within two weeks, in line with pre-pandemic norms. This is especially true for £1million-plus homes with a record one in four selling within two weeks, up from 23 per cent in April 2022.'The £1m plus market has held up a little better,' Beveridge said.'Cash has played an increasingly important role in this sector of the market and has insulated buyers from interest rate rises the like of which haven’t been seen for nearly two decades.'This all points towards a major price correction looking increasingly unlikely in 2023. Rather, we expect activity to track 2019 levels throughout the remainder of the year as the market treads a more sustainable path.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}