{
    "articleURL": "/wires/aap/article-12053297/Fagan-hails-tougher-Lions-crushing-Carlton.html",
    "content": [
        "Brisbane coach Chris Fagan believes his Lions are a more resilient and tougher group than the one that has fallen short in the last four finals series.",
        "The Lions put themselves on top of the AFL ladder with a commanding 26-point victory over Carlton at Marvel Stadium on Friday night.After starting the season 1-2, the Lions have won five-straight matches to put their premiership credentials on display.At 6-2 and with nine more games in Queensland to come, Brisbane have set a platform to try and win their first flag since 2003.The Lions have exited at the preliminary final and semi-final stages twice each since 2019.\"I think they're a different group,\" Fagan said.\"In life, you've just got to go through experiences, and sometimes you have to fail in order to learn how to win; not that we've been a failure the last four years, we've been really good, but we just haven't been able to get right to the end.\"It's months away though (the finals), but the signs are positive at the moment so we've just got to play with that intensity week in week out and have a bit of luck with injuries.\"I wouldn't make the early call on that but I think we are a tougher footy team than than we have been.\"Star recruit Josh Dunkley shone in his best display since joining the Lions from the Western Bulldogs during the off-season.",
        "The midfielder dominated in his battle with Brownlow medallist Patrick Cripps, limiting the Blues captain to just 17 touches.\"I just want to say it's one of the great games I've ever seen,\" Fagan said of Dunkley.\"If you weigh it all up - he had 33 touches,13 tackles and kept Cripps to a quiet game.\"I would have settled for Cripps having a quiet game, to be honest with you, but Josh's influence on the contest was exceptional and his leadership since he's been at the club has been outstanding.\"Keidean Coleman was subbed out of the game in the final quarter for veteran midfielder Jarryd Lyons, but Fagan siad the dashing defender was only suffering from cramp."
    ]
}