{
    "articleURL": "/wires/pa/article-12051671/Will-Fish-happy-making-mark-Hibs-rocky-start-loan-spell.html",
    "content": [
        "Will Fish is delighted to have become a Hibernian mainstay over the past few months after fearing his loan move from Manchester United was not going to plan.",
        "The 20-year-old centre-back joined the Easter Road club on a season-long deal last summer in a bid to increase his exposure to first-team football.With Rocky Bushiri, Ryan Porteous and Paul Hanlon all ahead of him in the pecking order, Fish had to wait until January to make his first start – and even then it was a disaster as he was played out of position at right-back before being subbed at half-time in a 3-0 defeat at city rivals Hearts.However, the sale of Porteous to Watford and a serious injury sustained by Bushiri paved the way for Fish to start each of Hibs’ last 11 matches.“You have doubts, but I always had the backing of the staff,” he said when asked if he feared his move to Hibs was not working out. “They were always in dialogue with me and they said I would get my chance and they’ve stuck to their word.“In football, you have to get a bit of luck. Porto left and Rocky got injured and I managed to get my chance, and I’ve done alright. The more games you play, the more experience you get and you feel more confident.",
        "“I’ve enjoyed my time here massively. I’ve had some bumps along the road but I feel like I’ve come out the other side better for it. I’ve really enjoyed it and I owe a lot to Hibs for giving me this chance.”",
        "Before joining Hibs, Fish had made only three first-team appearances – one as a sub for parent club United and two while on loan at Stockport last term. With that in mind, the 20-year-old has been grateful to have 33-year-old Hanlon to help guide him at Easter Road.“Paul’s been great,” Fish said ahead of Saturday’s match at home to St Mirren. “You couldn’t ask for a better centre-half partner for my first few games in men’s football. On and off the pitch, he’s great.“He helps me through the games and we discuss things together. He’s a top lad.”Fish is contracted to United until 2025 but is expected to go on loan again next term.“I don’t know,” he said when asked if he will return to Hibs. “I’m just focusing on the next five games and then we can take it from there and see what happens.“I’ve still got time on my contract but I think everyone is on the same page that I need to go out and play men’s football again (next season) so that will be the plan.”"
    ]
}