{
    "articleURL": "/wires/reuters/article-12055051/Celtics-defense-looks-make-things-tough-76ers.html",
    "content": [
        "James Harden raised the bar with a sterling performance in the opener of the Eastern Conference semifinal series only to lower it considerably over the next two games.",
        "Harden will look to quiet the critics in Game 4 on Sunday afternoon when the third-seeded Philadelphia 76ers host the second-seeded Boston Celtics. The Celtics hold a 2-1 lead in the best-of-seven series.Harden answered a 45-point performance in Philadelphia's 119-115 victory versus Boston in Game 1 by struggling mightily over the past two games. The former NBA MVP and three-time scoring champion has made just 5 of 28 shots from the floor, including 2 of 13 from 3-point range since Game 1.\"I mean, you just talk to him and you keep telling him to keep shooting,\" 76ers star Joel Embiid said after Harden made 3 of 14 shots from the floor in a 114-102 setback on Friday.\"Be aggressive. Can't get too high, can't get too low. Some nights you're going to make lots of other shots, a lot of tough ones, and some nights you're not going to make them. So it's about finding other ways to impact the game.\"Harden appeared to pass up scoring opportunities after struggling to locate his shot early in the game.\"I don't know. I got to watch the game,\" the 33-year-old Harden said. \"But I'm pretty good on basketball instincts. I know when to score and I know when to pass. So I'm pretty sure a lot of them was the right play.\"",
        "Harden was quick with a comment when asked if the Celtics did anything defensively to impact his game.\"Nope,\" he said.Boston guard Malcolm Brogdon had a different take.\"We're purposely making it hard on him,\" Brogdon said. \"He came out in Game 1 and won them that game. He played terrific. We don't want him to play like that anymore. So we've got to be as specific as we can with him, force him into tough shots, make him uncomfortable, really, for 94 feet.\"With Harden struggling, a clearly hobbled Embiid has been tasked with taking an even bigger role for Philadelphia. The newly minted NBA MVP returned from a series-opening absence due to a knee injury to score 15 points in Game 2 and total 30 points and 13 rebounds on Friday.\"We know how dominant Embiid is and can be, and we know how if those other guys get going, how deadly the Sixers can be,\" Celtics guard Jaylen Brown said. \"So we just ultimately wanted to be better on defense and make it all harder for everybody. And I think our pressure and intensity the last two games have done that.\"Boston's Jayson Tatum rebounded from a seven-point performance in Game 2 by collecting 27 points and 10 rebounds on Friday.",
        "Brown tallied 23 points and seven rebounds on Friday, and Al Horford sank five 3-pointers while finishing with 17 points and seven rebounds. Marcus Smart and Brogdon each had 15 points and Derrick White added 13 for the Celtics.--Field Level Media"
    ]
}