{
    "articleURL": "/news/article-12060373/Pregnant-mother-husband-two-babies-killed-head-collision.html",
    "content": [
        "Dad-of-two Xavier Caballero, 23, was driving a minivan in the right lane of the freeway when they were struck head-on by an SUV driven by George Wallace, 46 His wife Melodi Boivin, her unborn child, and their two young children all diedA pregnant mother, her husband and their two young children have been killed in a head-on collision after an SUV barreled down the wrong side of a Texas freeway. ",
        "Melodi Boivin, 21, and Xavier Caballero, 23, were pronounced dead at the scene in Lubbock, Texas, and their two babies, Marcellus, 2, and Lezlie, 1, later died in hospital.   The family, who were expecting to welcome their third child in the coming months, were driving near Marsha Sharp Freeway and Upland Avenue in Lubbock, Texas, around 1.30am on Sunday morning. Dad-of-two Xavier was driving a minivan in the right lane of the freeway when they were struck head-on by an SUV.The SUV was being driven by 46-year-old George Wallace. Cops say Wallace was traveling on the wrong side of the freeway when he fatally collided with the family.",
        "Parents Melodi and Xavier, as well as Wallace, all died at the scene.The two children were rushed to hospital in an attempt to save their lives, but they tragically also succumbed to their injuries. Police confirmed that both children were in car seats at the back of the van at the time of the collision. Melodi's unborn child also died as a result of the fatal crash, cops said.  A GoFundMe page for the family reads: 'My name is Kittye Tannery and am creating this fund for a close family friend Janice. 'Janice’s Granddaughter Melodi, Melodie’s husband Xavier, and their two babies, were all involved in a fatal head on collision. ",
        "'Four funerals are a lot and I know Janice will appreciate any help we can give. ALL funds will go to funeral. Please keep the family in your prayers as they mourn the loss of Melodi Boivin, Xavier Caballero, Marcellus Boivin, Lezlie Caballero and Melodi and Xavier's unborn baby.'Family and friends have taken to social media to mourn the family. One person wrote about Melodi: 'I'm sorry you are gone. You were soo amazing and it was an honor to be your friend. 'You lit up the room with good vibes and you where just an amazing person in general. My condolences to both families. I love yall rest easy.' Another wrote about Xavier: 'Still in shock. Xavier Caballero you were a great friend whom I shared many memories with. Doesn’t feel real. Rest easy old friend.' "
    ]
}