{
    "articleURL": "/news/article-12042307/Jury-hears-999-call-mother-murdered-boy-says-fell-asleep-bath.html",
    "content": [
        "Alfie Steele died with 50 separate injuries across his head, back and buttocksJurors have been played a 999 call made by the mother of a nine-year-old boy found unresponsive in cold bath water - after he had allegedly been ‘deliberately and repeatedly’ beaten to death in his 'dishevelled house'.",
        "Carla Scott, 35, and fiancé Dirk Howell, 41, are accused of murdering Alfie Steele – leaving the boy with 50 separate injuries across his head, back, legs and buttocks.Jurors have been Alfie told was pronounced dead after Scott dialled 999 claiming her son had 'fallen asleep' and drowned in the bath in February 2021. During the early part of the call, Scott remained calm as she told the call operator she could ‘feel a rattle’ on her son’s chest.She then added: ‘He’s not breathing, but he keeps making noises.’",
        "When the operator asked ‘What noises?’ Scott replied: ‘Lots of gargling noises.’At one point during the audio call groaning noises could be heard in the background and Scott was asked if that was the patient.She then replied: ‘I can see him breathing a bit, not a lot, but I can see him breathing a bit.’",
        "PC Paul Pickering, an enhanced medically trained firearms officer who was in the first 999 crew to arrive at the scene, said he found a ‘distressed’ Scott upstairs, wearing a vest and knickers. ‘She was knelt down over a child who was lying naked on the floor’, he said.The court was then played the officer’s heavily-redacted bodycam footage as he attempted chest compressions – the camera view bouncing up and down as he worked on the lifeless boy, at one point urging Alfie to ‘come on mate’.",
        "Another clip showed Scott clutching her phone on the landing, as the officer asked her when Alfie had been found collapsed.Scott replied: ‘I can’t remember…about an hour ago’. The officer replied: ‘You’re not making much sense here. When did you come across him (like this)?’Scott then clarified: ‘About ten minutes ago.’ Soon after, she could be heard wailing ‘Oh God.’Describing the bedroom where Alfie was moved to after being found in the bath, a second police officer PC Stacey Hegenbarth said: ‘I remember it being midday and very sunny, the curtains were drawn so it was very dark in there.‘There was a large, dirty, badly stained mattress on the floor. No bedding, no bed.‘The floor was dirty and sticky. I think there was a broken wardrobe in one corner. Just very untidy.’",
        "But she said that downstairs, the property looked like ‘a show home’. She added: ‘It was spotlessly clean.‘It was the polar opposite upstairs, it was a completely dishevelled property.’The officer then broke down as she recalled having to step outside ‘to take a moment’ as attempts to resuscitate Aflie by paramedics continued.Scott was arrested on suspicion of child neglect at the scene in Droitwich, Worcestershire, jurors were told, after Alfie was taken to hospital.",
        "Prosecutor Michelle Heeley KC had earlier told Coventry Crown Court Alfie had endured a ‘sad home life’ in the months before his February 2021 death, suffering 'assaults and cruelty, by being beaten, assaulted, punished with cold water and made to endure a life that no child should lead.’Jurors were told a social services care plan barred Howell – who had been in a relationship with Scott for 19 months and engaged to her for over a year – from staying overnight at the address.But Ms Heeley said the pair ‘wilfully and continuously’ flouted the rule, and that Howell had in fact been ‘at the house since the previous night.’He was spotted by attending police in a street close to the scene of Alfie’s collapse and then tracked to the town’s train station, where he Howell was arrested as he attempted to board a departing train.Ms Heeley said Howell favoured ‘physical and psychological’ forms of discipline. She added that both defendants ‘thought it was acceptable’ to hit Alfie with ‘belts, or a slider - like a heavy-duty flip flop - and use other more sinister forms of punishment’.Alfie was also forced to ‘stand outside, in the middle of the night and have cold water’ thrown over him and punished by dunkings in cold water, the court heard.",
        "Scott, of Droitwich, denies murder, manslaughter, causing or allowing the death of Alfie and child cruelty offences against her son and other children.Howell, of Birmingham, has previously admitted child cruelty offences against other children. He denies murder, manslaughter, cruelty or causing or allowing the death of Alfie.The trial continues."
    ]
}