{
    "articleURL": "/wires/ap/article-12039613/Florida-man-charged-throwing-explosive-Capitol-riot.html",
    "content": [
        "WASHINGTON (AP) - A Florida man accused of setting off an explosive and injuring several police officers during the insurrection at the U.S. Capitol on Jan. 6, 2021, was arrested Tuesday, officials said.",
        "Daniel Ball, 38, of Homosassa, Florida, was arrested in Inverness, about 60 miles (96 kilometers) west of Orlando, according to court documents. He is charged with multiple felonies, including assaulting, resisting, or impeding certain officers with a deadly or dangerous weapon.According to court documents, Ball joined with others in objecting to Democrat Joe Biden´s 2020 election victory over then-President Donald Trump. A mob stormed the Capitol to try to stop Congress from certifying election results for Biden over Trump, a Republican, authorities have said. Five people died in the violence.According to the criminal complaint, Ball entered the Capitol through the Senate wing door and pried a piece of a wooden shutter from a window in the Senate connecting corridor before exiting the building.Ball later worked with others to violently push against fully uniformed police officers attempting to keep people out of the Capitol, prosecutors said. When that was unsuccessful, Ball moved back into the crowd and threw an explosive into the entranceway, investigators said.An FBI explosives expert was unable to conclusively identify the precise dimensions, charge size or whether the device was improvised or commercially manufactured. But after reviewing various video angles, the expert concluded the device was capable of inflicting damage to surrounding property and causing serious injury.",
        "Online court records didn't list an attorney for Ball.More than 1,000 people have been arrested in nearly all 50 states for alleged crimes related to the Capitol breach, officials said. More than 320 people have been charged with assaulting or impeding law enforcement."
    ]
}