{
    "articleURL": "/money/investing/article-12054015/Should-join-dash-safe-haven-funds-pay-4.html",
    "content": [
        "Money market funds are popular place for investors to dock for short time These are funds that invest in only the safest assets, such as cash and bondsExperts warn that these funds are not necessarily as safe as they first appear As storms rage in financial markets, increasing numbers of investors are looking for safe harbours to catch their breath. Many are being lashed about by the fallout of soaring inflation, rising interest rates around the world – and the threat of another global banking crisis.",
        "Add to this the prospect of further volatility caused by the war in Ukraine and speculation about conflict between China and the West, and it is understandable that many investors are feeling jittery – even though financial markets are proving remarkably resilient.Although there have been worrying flashpoints, such as last week's collapse of US bank First Republic, which was sold to JP Morgan Chase, so far they have been dealt with without triggering a full-on global crisis. Money market funds are emerging as a popular place for investors to dock for a short time and wait until the skies lighten. These are funds that invest in only the safest assets, such as cash and bonds issued by governments and companies.Investment platform Interactive Investor has seen a 40 per cent increase in money market fund holdings owned by its customers this year. Rival Hargreaves Lansdown saw a 2,000 per cent increase in the year to April.",
        "But money market funds are far from a perfect solution. Experts warn that they are not necessarily as safe as they first appear. Plus the returns barely match those of a top-paying savings account.So should you join the nervous investors crowding into these funds – or steer well clear? Wealth &amp; Personal Finance investigates.",
        "How do these funds invest your money?Money market funds put your money into a selection of investments considered among the safest available. They are usually mainly comprised of bonds issued by robust governments and companies that are very unlikely to default.Some money market funds add yet another layer of protection. Called short-term funds, these only invest in bonds that are due to mature very soon. The logic is that the shorter the time you have to wait for the bond debt to be repaid to you, the lower the risk that something could go wrong in the interim and put your money at risk.Money market funds usually pay out income in the form of dividends. Some currently yield a little over one per cent in dividend income, while the highest-paying offers around four per cent.Would a savings account be better?As interest rates on savings continue to rise, several top-paying accounts offer a higher rate than the income available on money market funds.OakNorth Bank pays 4.86 per cent on a one-year fixed-rate account, for example. Chip offers 3.71 per cent on an easy-access account. Savings accounts also have the advantage over investments of FSCS protection, which is a Government-backed protection of savings on balances up to £85,000.So why are some investors opting for money market funds instead of just stashing their money in a savings account?",
        "Money market funds are not comparable with a long-term fixed-rate account. This is because they should only ever be a short-term place to park some of your investments. Secondly, nervous investors often do not wish to get out of the stock market altogether, which is what shifting money to a savings account would entail. They just want a safer option for a short period.Investors who wish to keep their money within their Individual Savings Account (Isa) or Self-Invested Personal Pension (SIPP) will not be able to access the best savings rates. Investment platforms do allow customers to hold cash within their Isas and SIPPs. But their rates are less attractive.For example, investment platform AJ Bell pays 2 per cent interest on cash balances in Sipps up to £10,000 and 2.75 per cent on balances above that amount. Hargreaves Lansdown pays just 1.25 per cent on cash held in an Isa with a balance up to £10,000, rising gradually to 2.25 per cent on balances of £100,000 or higher.Is a money market fund right for you?If you are considering moving some of your investments into a money market fund, make sure you are doing it for the right reasons.Episodes of turbulence in financial markets are normal and all part of investing. There are often periods of volatility, but a diversified portfolio of company shares and bonds tends to go up in value over the long term.",
        "If you pull your money out of markets in difficult times, you risk missing out on subsequent recoveries.Even amid the current tumult, investors in company shares have been making good returns. The MSCI World, which is an index of the world's biggest companies, is up more than ten per cent over the year. The FTSE 100 index of the biggest UK companies is up three per cent.So if you don't need your money for at least five to ten years – or preferably much longer – you may not need to be seeking out safety.If worries about your investments are keeping you up at night, the short-term protection that a money market fund offers may not be an ample solution. It may be worth looking at your portfolio as a whole and considering whether you need to lower your risk profile by moving into a range of safer assets.If you plan to spend your investments within five years, you are likely to be better off holding your money in cash than investing at all.Darius McDermott, managing director of investment platform Chelsea Financial Services, says that even if you use them, you should only put a small proportion of your portfolio in money market funds.'You might use them on an investment platform for short-term tactical asset allocation,' he says. 'If you are nervous about markets, you might move, say, 10 per cent into money market funds as a short-term home.",
        "'But check the rates the platforms are offering on actual cash rather than money market funds – sometimes that might be a better option.'Be wary of investing in money market funds for too long. The comparatively low income that they offer means that they are especially vulnerable to the ravages of inflation.The consumer prices index of inflation is still raging in double figures at 10.1 per cent.",
        "How safe are they from turbulence?Although low-risk, money market funds are far from completely safe. Firstly, if large numbers of investors tried to get their money out of these funds at once, their values could drop, and they could become harder to sell.The brutal truth is that DIY investors are mere minnows when it comes to money market fund sales.The vast majority of these funds are held by huge investment and pension funds, financial institutions and local authorities. Should some of these investing giants suddenly head for the exit, it would very quickly create large waves for all investors.Money market funds came under severe strain in March 2020, during the financial market sell-off triggered by the first Covid-19 lockdowns.Fearful investors dashed to move from these funds into cash, and some money market funds struggled to match buyers with sellers at the levels required by law.",
        "Fortunately, no funds had to be suspended, and disaster was averted. But it showed that money market funds are far from perfect.'Everything will be fine 99.9 per cent of the time, but we have seen that money market funds are not exempt from experiencing stress,' says McDermott. 'Why bother with the extra risk?'Investment returns from these funds are also far from secure. They have been increasing in recent months thanks to rising interest rates in the US, UK, Europe and around the world.However, if interest rates start to reverse – particularly in the US – returns could fall.Jason Hollands, managing director at investment platform Bestinvest, adds: 'If the US enters recession at the end of this year or next year, as some economists predict, and if inflation continues to fall, the US Federal Reserve may well move into reverse gear and start reducing rates again.'Choosing a fund that is right for youAll money market funds are designed to be low risk, but some are more so than others.L&amp;G Cash Trust is one of the most popular and pays one of the higher rates at 3.9 per cent. However, McDermott says the fund is 'too concentrated for my liking' as it holds a quarter of its fund in investments from three institutions; Rabobank, Nationwide Building Society and First Abu Dhabi Bank.Another popular fund, the Abrdn Sterling Money Market Fund, has a safer portfolio, mostly held in bank accounts. However, it yields just 1.22 per cent. Mike Stimpson, partner at wealth management firm Saltus, suggests that a larger fund might be safer than a smaller one. 'By being invested within a larger pool of capital, you might have a larger margin of safety than being in a smaller fund,' he says.Stimpson adds that if a money market fund is outperforming its peers, this may suggest it is taking more risk. If you are using such a fund to avoid risk, you may not think it is worth chasing the outsized returns.Investors should also consider fees, as these can eat away at your returns. 'Typically, money market funds are very cost competitive – with ongoing charges of around 0.15 per cent,' adds Stimpson. But ensuring that there are no high transaction costs is still important.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}