{
    "articleURL": "/tvshowbiz/article-12043821/Khloe-Kardashian-displays-abs-gives-followers-inside-look-workout-routine.html",
    "content": [
        "Khloe Kardashian shared a look into her workout process with a video that was shared on her Instagram account on Wednesday.",
        "In the clip, the 38-year-old reality television personality gave her staggering 305 million followers a look into one of the routines she uses to keep her body in peak physical condition.The entrepreneur, whose relatives recently expressed their concerns about her weight loss, also shared a detailed summary of her workout in her post's caption in case any of her fans wanted to try out her various exercises.Kardashian wore an all-pink that was comprised of a Nike sports bra, which showcased her chiseled abs, that was worn underneath a Fabletics half-zip long-sleeve top for part of the workout.The influencer paired her tops with matching pairs of form-hugging leggings and athletic shoes, and she accessorized with a pair of sparkling necklaces.",
        "Although her lengthy blonde hair remained free-flowing prior to the workout, she later tied her locks into a ponytail during her routine.She went on to humorously speak about how her personal trainer would push her to her physical limit every time they had a session.'Don does a magic potion on people where he abuses you and then you call him back and then you pay him. I don't know what special power he has, but this guy is a lunatic and I keep calling him back,' she said.",
        "Following the workout's conclusion, Kardashian discussed how she would be fine later in the day after working through the pain.She described herself as 'the best kind of crazy...I'm exhausted, but I'll get a second wind, I just need a little breather.'The social media powerhouse was later joined by her daughter True, aged five, whom she shares with her former partner Tristan Thompson. Kardashian introduced her eldest child by stating: 'Ladies and gentlemen, the most beautiful girl in the world.'The social media personality recently spoke about her commitment to fitness during an interview with InStyle, where she opened up about the reason she started regularly working out.",
        "'The reason why I turned to the gym was actually through my divorce. I didn't really know what to do...in the beginning you [have to] get over that hump of it being really hard and something so new for you. But I felt so accomplished,' she said.Kardashian then stated that she had since learned how to use exercise as a confidence-boosting method.'If I'm having a really bad day, I go to the gym. I might not want to go to the gym, but I go and right when I'm done, I feel so much lighter,' she said.She added: 'I've never regretted going to a workout. I've always regretted missing them or pushing the snooze button.' "
    ]
}