{
    "articleURL": "/femail/article-12045463/Heres-run-traditional-farm-scenic-Welsh-coast.html",
    "content": [
        "National Trust Cymru is looking for tenants to run scenic farm on coast of WalesREAD MORE: Farm candy: meet the cream of the cropYou can now be the new tenant of a clifftop farm located in the scenic Welsh coast as National Trust Cymru seeks out people to care for the property 'in a way that benefits nature, people and climate'.",
        "Lords Park Farm, which is near Llansteffan, stretches across 134 acres and features rustic white-washed structures distinguished by their traditional rural feel, adorned by huge symmetrical windows.There are also more modern buildings on the site, making for an aesthetic that is both traditional and chic, as well as an annex on the site.The four-bedroom Grade II listed property, which dates back to the late 19th century, has recently been refurbished. A price is available on application. ",
        "And the views are breathtaking - the farm's new tenant would be treated to lush grassy surroundings high above Carmarthen Bay and border of rich SSSI (Site of Special Scientific Interest) coastal scrub at Wharley Point.Beautiful flora, including woodland and hay meadows also add to the natural beauty of the place, which overlooks the point at which the Taf and Towy estuaries meet.The Trust seeks out people passionate about conservation to bring the farming business to life in a way that is harmonious with the environment around them. It has recently done work in the nearby area, including planting a mix of trees in the area and letting wildflowers bloom to aid the pollination process.  Lords Park Farm is all ready to be handed over to its future tenant, and is offered on an initial fixed 10-year term. ",
        "'There is a rare opportunity here at Lords Park Farm to make a difference and deliver something special on this stunning clifftop location,' National Trust Cymru's General Manager for Carmarthenshire &amp; Ceredigion Meg Anthony said.'Loss of nature and the changing climate are two huge threats we are facing, and tenant farmers play a vital role in helping to conserve landscapes and tackle these crises.'We want to find someone who will put nature at the heart of all they do in running a diverse and resilient farming business.",
        "'We are excited by the possibilities, with the new tenant being crucial to shaping the future for Lords Park Farm, bringing benefits to nature, the local community and for farming across the Trust.' The Trust has also recently introduced more footpaths at Lords Park to allow for more public acces, Meg revealed. 'The new paths connect with the Wales Coast Path, which could also offer potential opportunities for diversification to a future tenant from the thousands of people that walk the 870mile path each year,' she added. National Trust Cymru are holding a viewing day on the 17 May. Bookings are by appointment only email to wa.tenantenquiries@nationaltrust.org.uk.The details of the listing can be found on Rightmove."
    ]
}