{
    "articleURL": "/tvshowbiz/article-12042277/Whoopi-Goldberg-writing-comic-book-superhero-powers-triggered-menopause.html",
    "content": [
        "Whoopi Goldberg is working on a comic book about a grandmother superhero whose powers are triggered by menopause.",
        "The 67-year-old will co-write the project with television's Jaime Paglia, who created the Sci-Fi Channel's Eureka and worked on The CW's The Flash.Entitled The Change, the comic follows the exploits of a woman named Isabel Frost who has begun to feel she is spinning her wheels in life.She has an active social circle through her passion for video games, as well as being a married mother with a grandson who adores comic books.But her increasingly repetitive routine gets a new breath of life when menopause begins and her superpowers reveal themselves, Screen Rant reports.",
        "Isabel becomes a superhero called The Change, throwing herself into her new role while relying on the support of her trusty best friend and her grandson. In a first-look image released by Screen Rant, the title character is seen wrapped in a long black leather coat and holding a ball of blue and purple flame.Over the years Whoopi has been candid in her stand-up about her personal experiences with undergoing menopause.She was particularly scathing about what she saw as double standards in health care with regards to the issue, joking: 'Why don't you have this down? How can you keep a man hard for 19 hours and not be able to cool down a hot flash?'",
        "Whoopi's comic book debut opens against the backdrop of a scandalous phase of her career, owing to her crackpot remarks on the Holocaust.In early 2022 she set off a media firestorm after bizarrely claiming that the Holocaust was not about 'race' as 'these are two white groups of people!'The Holocaust was based on Nazi theories of race science that classified certain groups, including Jews, as 'untermenschen' - 'subhumans.'She faced an international deluge of backlash and was suspended for two weeks from her long-running hosting gig on The View.",
        "In the initial wave of blowback, Whoopi issued an apology saying she 'stands corrected' and was 'sorry for the hurt I have caused.'However she swiftly did a U-turn, discussing the Holocaust with Stephen Colbert on his late-night talk show and declaring: 'You can't call this racism.' Whoopi provoked a fresh round of backlash in December when she told the Times Of London that the Holocaust 'wasn’t originally' about race as the first victims were 'people they considered to be mentally defective.' She further remarked that 'you could not tell a Jew on a street. You could find me. You couldn’t find them. That was the point I was making.'Confronted with another surge of controversy, Whoopi maintained: 'It was never my intention to appear as if I was doubling down on hurtful comments.' ",
        "The Sister Act star was originally called Caryn Johnson but adopted Whoopi Goldberg as her stage name and has insisted she has Jewish heritage.Meanwhile historian Henry Louis Gates Jr., who has hosted such ancestry-themed TV shows as African American Lives and Finding Your Roots, dug into Whoopi's family history and was unable to find any Jewish relations. Some reports have alleged she adopted the surname Goldberg because her mother told her she could increase her chances in Hollywood by seeming Jewish."
    ]
}