{
    "articleURL": "/sport/football/article-12041175/Which-Arsenal-ace-comes-weeks-POWER-RANKINGS.html",
    "content": [
        "Arsenal punished Chelsea to go back to the top after City's win at FulhamBrighton's 6-0 drubbing of Wolves showed the sky's the limit for the SeagullsLiverpool threw away a three-goal lead but still beat Ryan Mason's Spurs An exhilarating Premier League season may be nearing its end but drama at both the top and bottom of the table continues apace. ",
        "Arsenal got their title hopes back on track with a 3-1 victory over hapless Chelsea – whose run goes from bad to worse under Frank Lampard.City had briefly gone top of the table for the first time since February after beating Fulham 2-1 on Sunday. At the other end, Leicester and Everton both missed out the chance to earn a vital win as they drew 2-2 at Goodison Park, and Southampton's prospects were further dented in a 3-1 defeat to top four-chasing Newcastle.Wolves were on the receiving end of 6-0 thrashing at the hands of Roberto De Zerbi's rampant Brighton, Aston Villa's 10-game unbeaten streak ended at Old Trafford as Manchester United won 1-0 at home, and Tottenham's search for a win under caretaker manager Ryan Mason continued as they lost 4-3 to Liverpool in a dramatic affair at Anfield.So who makes it into our top 10 Power Rankings after the latest round of Premier League fixtures? ",
        "10. John Stones (down five)City's stalwart continues to shine as yet again he makes the rankings after a sterling performance at Fulham. John Stones' role this season has been less straightforward than in previous years as he has been given a more hybrid position between defence and midfield. But wherever he plays, he looks assured. Alongside Kyle Walker, who has been out in the cold for segments of the season as Guardiola worked out how he might fit into the new system, Stones reverted to a more straightforward centre-half role after Fulham's equaliser on Sunday.",
        "This gave City renewed confidence and shortly after, Julian Alvarez's exceptional strike pulled the visitors ahead. Stones has played a pivotal role in City's increasingly dominant season. He is a vital cog in Guardiola's machine and him maintaining his form could be vital in their treble charge.9. Jordan Pickford (new entry)All is not well at Goodison Park. Sean Dyche's appointment has not sparked a new manager bounce and Everton are in severe danger of losing their Premier League status.Currently sitting 19th in the table and perilously close to relegation from the top-flight, the Toffees are in need of heroes. Against Leicester on a must-win Monday night – when the points were inevitably shared – Jordan Pickford's save of James Maddison's penalty saw the England No 1 rise to the occasion. ",
        "Pickford had a cheat-sheet water bottle and saved easily from Maddison, who fired straight down the middle, as predicted.It could prove a costly miss for Leicester, who are just a point ahead of Everton in the bottom three The goalkeeper has made the third-highest number of saves in the Premier League this season, behind only Bernd Leno for Fulham and Brentford's David Raya, and Pickford has come to Everton's rescue many, many times.8. Julio Enciso (new entry)",
        "Of the six goals that Brighton put past Wolves goalkeeper Jose Sa, none of them actually sprung from the boot of summer signing Julio Enciso. But Danny Welbeck, Dennis Undav, and Pascal Gross all owe the Paraguayan a debt of gratitude as he put in a superb display on a superb day for the Seagulls.De Zerbi called what he saw from his team 'the best performance in my career as a coach', and Enciso's contributions were key. The 19-year-old has featured for the Italian in the starting line-up since his wondergoal from the bench against Chelsea and saw out his first win in some style on the south coast. ",
        "Directly assisting both of Gross' efforts within the space of 13 minutes, Enciso's pace made him look uncatchablle and Wolves' defence allowed him acres of space they could ill afford. His partnership with Billy Gilmour, who also impressed, was excellent.The win was the biggest in the Seagulls' history, and much needed after the team were knocked out of the FA Cup and following defeat to Nottingham Forest.Enciso's commanding performance will lift the fans' spirits in more ways than one - and shows there is plenty of talent in their ranks if they do have to sell their prized assets in the summer.",
        "7. Bruno Fernandes (new entry)Manchester United didn't have the easiest of days out against Aston Villa but they did what they needed to do – and in style. Unai Emery's men had gone 10 games unbeaten and were set to crash the top-six party and strong-arm their way into Europe. They still could, but Bruno Fernandes' goal damaged their lofty hopes.Fernandes has faced his fair share of criticism but is a vital element of Erik ten Hag's side.",
        "He followed home Marcus Rashford's initial strike against Villa, which Emiliano Martinez should have done better with.After the final whistle, Ten Hag said it was 'crazy' to doubt Fernandes' captaincy, because he is a 'big leader'. 'He leads by example, gives so much energy to the team, so much desire and determination. If you want to win games and trophies, you need such players,' Ten Hag said.",
        "6. Erling Haaland (down three)",
        "10. Ruben Dias 9. Lucas Paqueta8. Callum Wilson7. Trent Alexander-Arnold6. Jadon Sancho 5. John Stones4. Jacob Murphy3. Erling Haaland2. Alexander Isak1. Kevin De Bruyne",
        "34 Premier League goals. 50 goals across all competitions this season: Haaland keeps breaking record after record.With Alan Shearer's record top-flight season now in his sights, and a half-century that sees him break a 92-year English record, Haaland certainly had a good day out in west London. ",
        "City were tested by Fulham but Haaland still shone through.Most impressive was his link-up play, which has gone unnoticed among his goalscoring exploits. The idea that Haaland could only play in a tailored system has been blown out of the water, and so too could the idea that he and Alvarez don't do their best work in tandem with Kevin De Bruyne. Haaland needs just 13 more goals to break the big one: Dixie Dean's mammoth 63-goal haul in 1928, the most ever scored in a single English season. City will play nine, and they could play ten. Nothing feels impossible anymore.  5. Trent Alexander-Arnold (up two)Much has been spoken about Jurgen Klopp's rebuild at Liverpool and Trent Alexander-Arnold will be to it. His tweaks to Alexander-Arnold's role amid a run of bad form for both the defender and the club have been encouraging and as Liverpool edge up the table, could yet prove the difference in pursuit of European competition next season. The Reds' performance against Tottenham was far from perfect but above it, it had the much-discussed mentality that Klopp has seen go missing among his players this season. ",
        "In the opening twenty minutes – when Spurs went 3-0 down – Alexander-Arnold was a vital cog in Liverpool's press, and his reward in the opening seven minutes was a part in Curtis Jones' opening goal. ",
        "His role in Liverpool's midfield link-up as the side flooded up the pitch, again and again, felt vintage and Tottenham were entirely overwhelmed. The win moved Klopp's men up into fifth in the table, once again in contention for Europe. But more than that, there's fresh optimism around Anfield after a string of impressive showings. Whilst the problems aren't entirely solved, Alexander-Arnold's ability to adapt has reaped invaluable benefits in the short-term.  4. Callum Wilson (up four)Eddie Howe's use of his squad has been notable this season. Callum Wilson, who has endured injury absences this season, started Newcastle's clash with Southampton on the bench. But a goal down and heading into the second half, it was time for the player to step up. He duly scored twice to hand Newcastle a crucial win and deepen Southampton fans' fears of relegation.Wilson, who combined well with Alexander Isak, did exactly what his manager asked of him and showed why they are looking pretty good for a Champions League place.",
        "Club legend Alan Shearer said Wilson's half-time substitution 'changed the game'.'He gave them exactly what they needed and they didn't have that in the first half, they didn't have the threat,' Shearer added.  Wilson has been in superb form for large parts of the season, scoring 15 in black and so far, and his two at St Mary's were his fourth and fifth in three games.3. Julian Alvarez (new entry)There have been very few opportunities for Julian Alvarez this season owing to Haaland's ridiculous scoring record. Debut seasons like Alvarez's Norwegian team-mate have been enjoying do not come around often – and that's an understatement. But there is a reason that City signed the World Cup winner and almost every time that Alvarez does get the opportunity to show it off, he does. Against Fulham, the Argentine was electric and once again made Guardiola's ability to pair him with Haaland feel like a Premier League cheat code. Almost responsible for City's first before he was felled by Tim Ream, Alvarez instead scored the match winner with a wonderful long-range effort.",
        "That he doesn't start match is a testament to City's quality in depth.The standout on the day, Guardiola claimed that the performance had the power to reshape his thinking tactically when the currently undroppable Kevin De Bruyne is fit enough to return to the starting XI. 'In tight games, where we play against defences with five at the back, this will be so so important,' said the Catalan manager.'It's not just the goal and the penalty. It's the intensity in the pressure, keeping the ball, and the vision because he is an incredible, exceptional player.' That City snagged him for £14m will only feel increasingly unbelievable. 2. Alexander Isak (non-mover)Isak's sensational showing against Everton – capped by his incredible run to set up Jacob Murphy for the side's fourth goal – cemented his status as one of the signings of the season, and there's been no drop in quality.Southampton were not expected to prove a challenge to the Magpies, who are all but shoo-ins for a spot in the Champions League draw next season, but after the Saints drew first blood, Newcastle found their form.The Swedish ace featured alongside his team-mate Wilson to dramatic effect, which will give their manager ample food for thought - the players are yet to start next to one another - and strike considerable fear in the hearts of teams they are yet to face. ",
        "As well as playing a crucial role in Wilson's first, Isak set up a number of chances for the visitors, with Southampton scarcely able to lay a glove on the £60m-man after Howe shifted his striker onto the left to accommodate the England international.1. Martin Odegaard (new entry)Despite the visitors providing little resistance, the Arsenal captain's performance against Chelsea was undoubtedly a cut above, and an important statement as the Gunners look to reinvigorate their title charge.Odegaard sharpened Arsenal's attacking threat and the result was two delicious goals to put the now-league leaders ahead. Even a Chelsea fan would – through gritted teeth – applaud his audacious opener, taken from a neatly-passed ball from Granit Xhaka and struck sweetly to kiss the crossbar and fall, satisfyingly, across the line. His second caught the cluttered defenders in blue asleep in the box and duly punished them. Odegaard's gift for controlling Arsenal's tempo and leading their exhaustive press, particularly in the first half, left Chelsea floundering. His excellent reading of the game was on display too."
    ]
}