{
    "articleURL": "/wires/reuters/article-12047353/Albemarle-aims-use-new-lithium-tech-Chile-govt-broadens-control.html",
    "content": [
        "By Ernest Scheyder",
        "May 4 (Reuters) - Albemarle Corp is open to renegotiating its Chile lithium contract before 2043 and would seek access to even more of the country's vast reserves of the metal used to make electric vehicle batteries, CEO Kent Masters told Reuters on Thursday.The decision by Chilean President Gabriel Boric last month to gradually nationalize his country's lithium industrysparked concernthat U.S. miner Albemarle and rival SQM could be kicked out of the country, even though officials have stressed they would not tear up existing contracts.While lithium for years has typically been produced using open-pit mines or evaporation ponds, Boric's plan relies on the wide scale deployment ofdirect lithium extraction (DLE) technologies that have so far never worked in commercial operations, but which Albemarle and its peers are studying.Albemarle and SQM's contracts only grant access to the Atacama salt flats, or salars, but Boric hopes to open up many other salars across his country for lithium production, a step that will require DLE technologies.\"We've never said there's a hard no in renegotiating before 2043,\" Masters said in an interview. \"Post-2043, or after we renegotiate, the government will be involved, probably as a partner. And we would anticipate even before that having the opportunity to perhaps get even more rights for additional resources.\"",
        "Many DLE technologies use lots of potable water and electricity, a limitation that Albemarle has acknowledged and one it is working to limit. None have yet to work independently at commercial scale. Chile and Albemarle could cement their dominant role in the global lithium and EV industries if they can get one or more DLE technology to succeed.Reutersreported last monththat SQM plans to begin renegotiations on its contract, which ends in 2030, as soon as next month, a step Masters said he expects to \"give us a bit of intelligence.\"General Motors Co, Stellantis NV, Standard Lithium Ltd, Rio Tinto Ltd and others have made their own DLE bets.Shares of the Charlotte, North Carolina-based Albemarle rose about 1% in afternoon trading to $174.04 after jumping more than 6% earlier in the session. Masters and other executives repeatedly downplayed concerns about weakening spot lithium prices in China.\"Lithium demand and the EV market continue to grow at an extraordinary rate,\" Masters said.Masters declined to comment on Australian lithium developer's Liontown Resources Ltd rejection in March of Albemarle's $3.7 billion takeover bid. (Reporting by Ernest Scheyder; Editing by David Gregorio and Marguerita Choy)"
    ]
}