{
    "articleURL": "/news/article-12052069/Police-searched-secret-storage-locker-belonging-suspected-Idaho-quadruple-killer-Bryan-Kohberger.html",
    "content": [
        "Documents show that police swabbed dozens of areas in his university apartment,  had two test positive for traces of bloodIt is unclear if the blood belonged to any of the victims or Kohberger himself, but the items were taken for further investigation They also found a lock and key which matched a storage container and requested a search warrant to access the containerNew court documents have revealed that police searching Bryan Kohberger’s apartment discovered a secret storage locker they believe he used after the time of the murders of four students in Idaho.",
        "Washington State University Police swarmed his apartment in Pullman – a 15-minute drive from the property where the murders were committed – shortly after his arrest at his family home in Pennsylvania on December 30.Criminal justice major Kohberger, 28, is accused of killing Kaylee Goncalves, 21, Madison Mogen, 21, Xana Kernodle, 20, and Ethan Chapin, 20, on November 13 last year.Documents show that police swabbed dozens of areas in the small property and had two test positive for traces of blood.Officers also found a lock and key which matched a storage container and requested a search warrant to access the container.",
        "It is not clear if anything was found in the locker, but officers state that they believe Kohberger used it to store items after the murders of the four University of Idaho students.One of the items which tested positive for blood was a pillow, which had a large stain on one side, and was taken away for further testing.The other was a mattress cover which was on his bed, which had multiple stains on it and was also taken for further testing following testing positive for blood.It is unclear if the blood belonged to any of the victims or Kohberger himself, and the items were simply collected by officers for further investigation.",
        "A previous affidavit confirmed that the two items had stains on them consistent with blood, but the new documents show that they tested positive for it.Police also seized several hair strands, including one suspected animal hair, a black glove and a computer tower.Investigators, who raided the property back in December, also picked up receipts from Walmart and two Marshall's receipts, as well as collecting the contents of his vacuum cleaner.Court documents show that eight strands of hair were recovered from the apartment, as well as a 'possible' animal hair.",
        "They also recovered a Fire TV stick during their search. All the items are now being stored at the Washington State University Police department.Authorities reportedly said they wanted to see if any hair had been 'transferred' onto Kohberger and then back to his apartment – including that of Kaylee Goncalves' dog Murphy.Murphy was found alive in Kaylee's room by investigators who were called to the scene, and has now been returned to her ex-boyfriend.It comes after one of the surviving roommates agreed to meet with lawyers for Kohberger at her home in Reno, Nevada, after trying to argue that she should not have to testify during the various court hearings.Court documents earlier this week revealed that Bethany Funke's lawyers were arguing that she should not have to testify at a preliminary hearing in June, or for the duration of the trial.",
        "In new documents submitted on Wednesday, both sides came to the agreement that the defense would go to Funke for an interview in Nevada– dismissing a subpoena they issued on April 11.",
        "It means that the surviving roommate may not be forced to appear at the preliminary hearing on June 28, depending on the information that she gives investigators.Investigator Richard Bitonti, who is working for Kohberger's defense team, subpoenaed Fukne on the basis that she may have 'exculpatory' information.They claimed that the information she has is 'material and necessary' to the alleged killer's defense – though it is unclear exactly what that is.Bitonti wrote in an affidavit: 'During the course of my investigation, it became known to me that [she] has information material to the charges against Mr. Kohberger.'He added that she 'disclosed things she heard and things she saw' when interviewed by police and was present when police were called.However Funke's lawyers hit back by saying that the preliminary hearing is not meant to 'become a mini-trial', and is only meant to decide probably cause.",
        "A gag also remains in place, preventing anyone connected to the case from speaking publicly.Kohberger is yet to enter a plea in the quadruple homicide, and is charged with four counts of murder and one of burglary.",
        "It comes after it was revealed that his lawyer will be paid $200 an hour in his case – with any additional overtime.Chief Public defender Anne Taylor will be paid by Kootenai County for her 40-hour work week, with Latah County agreeing to give the funds to Kootenai for her work.But any overtime that she accrues outside of those hours will be paid by Latah County directly to the attorney, with a second lawyer supporting Taylor in the case being paid $180 an hour.Taylor is representing the 28-year-old criminal justice major after stepping down as the lawyer for Cara Northington – the mother of murdered Xana Kernodle, 20.She was in charge of her case until January 5, the same day that Kohberger was extradited from his home in Pennsylvania to Idaho.The lawyer is also accused of a second conflict of interest in the case after it was revealed that she represented Maddie Mogen's stepmother, Korie Hatrock, in June 2022 and oversaw a case involving her father, Benjamin in 2020."
    ]
}