{
    "articleURL": "/sport/nba/article-12056687/Nick-Gilbert-son-Cleveland-Cavaliers-owner-Dan-dies-aged-26-genetic-condition.html",
    "content": [
        "The son of Dan Gilbert, the Cleveland Cavaliers owner, has died at the age of 26He lived with neurofibromatosis, a condition with no cure or treatmentDailyMail.com provides all the latest international sports news Nick Gilbert, the son of Cleveland Cavaliers owner Dan Gilbert and long-time lucky charm of the NBA team, has died at the age of 26 from a genetic condition he had suffered with since the age of one.",
        "The sad news was revealed on Sunday morning, with the Ira Kaufman Chapel revealing that he died on Saturday, 'peacefully at home surrounded by family.'Nick lived with neurofibromatosis, a condition with no cure or treatment that causes non-cancerous tumors to grow along nerves in the skin, brain and other parts of the body.He was first diagnosed at 15 months old, initially undergoing multiple brain surgeries and chemotherapy, which resulted in a loss of vision. The 26-year-old was best-known among NBA fans for attending the Draft Lottery each year as the Cavaliers' lucky charm, beginning in 2011 after their nightmarish first season without LeBron James.Amid his presence at the event, they won the No 1 overall pick, allowing them to select Kyrie Irving, and the then-14-year-old became notorious for his bow ties.",
        "He represented the team again in 2012 - when they fell to No 4 - but then again in 2013 they landed the No 1 overall pick again.The Cavaliers dedicated the 2022-23 season to Gilbert by wearing bowtie emblems on their warm-up jackets, and tributes immediately began to pour in for the 26-year-old after the news of his death was released this weekend. Speaking at the start of the season, Cavs owner Dan - and father of Nick - said: 'We want to give a special thanks to Cleveland fans for always embracing Nick and showing him support and love over the years.",
        "'This season, we’re using the Cavs platform to raise awareness of NF and the millions who are impacted by this disease. While there’s currently no cure, we hope to help support cutting-edge research through our efforts. So, as you cheer on the Cavs this season, we ask that you keep Nick and all those fighting NF in your hearts.'After Nick's death on Saturday, the Detroit Mayor Mike Duggan tweeted his condolences: 'Nick inspired people everywhere with his bravery and brought joy to everyone he met. All of Detroit has the Gilbert family in our prayers today.'",
        "Back in 2018, Gilbert underwent further surgery, enduring an eight-hour operation that resulted in him spending more than a month in recovery.The condition can be inherited, but none of Dan Gilbert's other four children have been diagnosed. Cavaliers owner Dan Gilbert has an estimated net worth of $18.6billion, per Forbes, and he bought the team in 2005 for a then-record $375m.His tenure has been a topsy-turvy one, with the high coming when the Cavaliers won a first NBA title in 2016, with Nick pictured lifting the trophy in the celebrations. "
    ]
}