{
    "articleURL": "/wires/reuters/article-12040927/Australian-Rules-Tasmania-savours-victory-hard-fight-secure-AFL-team.html",
    "content": [
        "By Ian Ransom",
        "MELBOURNE, May 3 (Reuters) - Tasmania declared victory in its decades-long battle to join the Australian Football League (AFL) on Wednesday as officials confirmed the island state will have a team in the nation's dominant sporting competition by the end of the decade.The state government signed off on commitments to secure the AFL's 19th team license and has targeted the 2028 season to launch in the Australian Rules top flight.\"This has been a hard fight ... by many, many Tasmanians over a number of generations,\" state Premier Jeremy Rockliff said in the state capital Hobart.\"I want to pay tribute to the believers - the people at the grass roots, footy clubs, the young players that believed ... in Tasmania.\"The license was a parting gift from outgoing AFL chief Gillon McLachlan, who on Tuesday secured sign-off from the league's 18 clubs, a number of which had been strongly opposed.Tasmanian fans will rejoice at the prospect, although some may feel it long overdue.While lacking the population and wealth of Australia's mainland states, Tasmania has embraced 'Aussie Rules' for over 150 years and produced some revered players.Peter Hudson, one of the greatest full-forwards to have graced the game, crossed the Bass Strait to Melbourne to boot 727 goals for the Hawthorn Hawks in the 1960s and '70s.",
        "Richmond Tigers forward Jack Riewoldt has carried on Hudson's legacy, with 769 goals and counting in his 17th season for the side.For all that heritage, efforts to join the league came to nothing in the decades after the Victoria-based competition went national in the 1980s.The AFL targeted richer eastern states and continues to spend a fortune propping up expansion teams in territory long owned by rugby league.AFL clubs relying on league distributions balked at the prospect of another drain on the league's coffers.Tasmanian fans have had only visiting teams to support, with Hawthorn having long profited from generous government sponsorship to play games in Launceston.Hawthorn will soon play second fiddle in the state, though, due to a rare convergence of political interests, government funding and McLachlan's deal-making chutzpah.WON'T COME CHEAPThe team will not come cheap for Tasmania.Government money will pay about half of the A$715 million ($476.48 million) bill for a stadium on Hobart's waterfront, a condition of entry to the AFL despite the state boasting the 20,000-seat Bellerive Oval and Launceston's York Park.Tasmania's Labor opposition decried the development as a waste of money that could be better spent elsewhere and protesters heckled Prime Minister Anthony Albanese when he announced the federal government's contribution.",
        "Local footballers may relish the prospect of playing at home but luring talent to the country's smallest and coldest state may prove a challenge.\"Because there's not much happening down there, it could be difficult,\" Hawthorn captain James Sicily told SEN Radio.\"I couldn't imagine myself living there. It would be hard.\"League officials will hope the new team can build firmer foundations than the Gold Coast Suns, who have struggled for wins and fans in the rugby league heartland of Queensland since joining the AFL in 2011.McLachlan said the Tasmanian team could expect a helping hand when building their foundation squad, likely in the form of preferential draft picks.\"I think we've learnt a lot about list builds and how we do that to ensure more immediate success,\" he said.\"We will, reasonably quickly and with the support of the clubs, get a set of rules to put the squad together. It will be good decision-making after that.\" ($1 = 1.5006 Australian dollars) (Reporting by Ian Ransom in Melbourne; Editing by Peter Rutherford)"
    ]
}