{
    "articleURL": "/health/article-12051855/CDC-director-step-June-30.html",
    "content": [
        "The director was in her post for two years and will step down at the end of June Her reign was marred with decisions that degraded the agency's public trustREAD MORE: HHS to dump vaccine guidelines just days after CDC renewal Dr Rochelle Walensky, director of the Centers for Disease Control and Prevention (CDC), will step down from her post next month.",
        "She submitted her shock resignation on Friday after just two years in the $200,000-a-year job, saying the waning of the Covid pandemic was a good time to make the transition.Dr Walensky, 54, leaves the CDC with public trust in the health agency at a historic low following its handling of the Covid response - when it was accused of being too political.'I have never been prouder of anything I have done in my professional career,' she wrote in her resignation letter to President Joe Biden.Her exit comes as the World Health Organization has declared the end of the Covid global health emergency and remaining pandemic measures in the US are set to end next week, signaling a transition for public health agency's around the world.",
        "'The end of the Covid public health emergency marks a tremendous transition for our country, for public health, and in my tenure as CDC Director,' Dr Walensky said in her resignation letter. 'I took on this role, at your request, with the goal of leaving behind the dark days of the pandemic and moving CDC – and public health – forward into a much better and more trusted place.''In the process, we saved and improved lives and protected the country and the world from the greatest infectious disease threat we have seen in over 100 years.'",
        "The CDC also announced on Friday that it would begin scaling back Covid data tracking amid the WHO's decleration. Dr Walensky has been the agency's director since January 2021, appointed by President Biden at the start of his administration. In her letter to Biden, she expressed 'mixed feelings' about the decision and didn't say exactly why she was stepping down.However, she noted that the nation is at a moment of transition as emergency declarations come to an end.'I have never been prouder of anything I have done in my professional career,' she wrote.",
        "Tedros Adhanom Ghebreyesus said Friday: 'I declare COVID over as a global health emergency.'",
        "Her time leading the organization was fraught with controversy.In January, the Center for Strategic &amp; International Studies (CSIS), called for a widespread overhaul of the agency, citing severe deficiencies in the way it operated.Authors called for a 'reset' or the agency and to reprioritize how it spent its annual budget of $12billion and 12,000 employees.The CSIS said the agency needs to have better flexibility in using its funding - which will allow it to respond faster to emerging threats.'The big picture here is, we all see the need for a reset of the agency,' Julie Gerberding, who served at the CDC's director from 2002 to 2009 and now a CSIS member, told CNN at the time.",
        "Throughout the pandemic, the agency's priorities and decision-making caused confusion and backlash among the population.The agency advised schools to close early in the pandemic, a decision some have linked to lower test scores and mental health issues among young people.A September report found that school closures during the pandemic caused school performance among nine-year-olds to drop to their lowest levels in 20 years. Pandemic-related restrictions also played a role in the staggering youth mental health crisis facing the US.A CDC report published last week found 10 percent of US high schoolers have attempted suicide and one in three are depressed 'most of the time'. It also firmly grasped onto mask mandates for public transportation for much longer than many saw necessary.Americans were required to wear masks on public transportation such as planes and trains until April 2022, when a federal court struck down the rules.A 2022 Pew Research Poll found that a majority of Americans opposed mask mandates, despite the CDC's insistence to keep them in place.In early 2021 it said that people who had received the Covid vaccines were no longer recommended to mask in public places, only to backtrack when the Delta variant emerged months later.At the end of April, the CDC chose to extend vaccine requirements for international travelers into the US, despite the Biden administration announcing the end of pandemic-related orders on May 11.",
        "Only days later, the Department of Health and Human Services (HHS) — the CDC's parent agency — announced the rule would be dumped.These repeated missteps have caused the public's trust in the agency to dwindle.A Harvard University survey published in March found that just 23 percent of Americans trusted the agency's recommendations. Within the survey, many who did not trust the agency did so because they believed its decisions were motivated by politics — not science. Dr Walensky, previously an infectious-diseases specialist at Harvard Medical School and Massachusetts General Hospital, had no previous experience running a government health agency.She came with a reputation as a prominent voice on the pandemic, sometimes criticizing certain aspects of how the government was responding. "
    ]
}