{
    "articleURL": "/tvshowbiz/article-12058409/Australias-human-Barbie-Tara-Jayne-McConachy-shows-extreme-new-look-nose-job.html",
    "content": [
        "She made headlines after appearing on E!'s Botched following a $200k face and body transformation. ",
        "And plastic surgery queen Tara Jayne, 33, showed off her extreme new look while going shopping in Melbourne on Sunday, following another reported nose job.Tara, who is globally known as Australia's 'human barbie', was hard to miss as she strutted around the chilly city in a colourful fur coat.The nurse offered a glimpse of her surgically-enhanced cleavage in a low-cut top teamed with leather trousers. Tara finished her look with a baker boy cap and and chain strap Yves Saint Laurent bag that she slung over her shoulder.",
        "Tara, who has had five breast augmentations, six nose jobs, and endless rounds of Botox and filler, accentuated her look with dramatic makeup. She wore her raven tresses down past her shoulders.        In August 2021, Tara appeared on Todd Sampson's headline-making documentary series Mirror Mirror, which followed a group of Australians obsessed with going under the knife.   ",
        "In the show, Tara described herself as an 'upgraded limited-edition Barbie doll', while also bemoaning the inadequacy of her E-cup breasts.'I think I want to get my boobs bigger,' she said.She had previously featured on E! reality show Botched in the hope of convincing Drs Paul Nassif and Terry Dubrow to give her bigger implants.  ",
        "'Everything is tiny on me except for my tatas... I'm on a quest for a bigger chest!' she told producers.",
        "'I currently have 540 CCs [of breast implant silicone], and I'm just not happy with them at all,' she said.Tara said she'd noticed a 'rippling effect' on the skin on her breasts and hoped 'filling out the space more' would fix the issue. But she was left disappointed when the doctors said her weight was 'dangerously low' at 45kg, making her far too slim to carry larger implants.",
        "'I'm really concerned about Tara's overall wellbeing', Dr Nassif said.'Not just as it relates to surgery, but she really needs to get both physically and mentally healthy.'Tara said she'd stop at nothing to maintain and even enhance her 'knockout' 37-inch bust, 17-inch waist and 29-inch hips'.'There is no limit for me when it comes to plastic surgery. It is incredibly addictive and I already want bigger breasts,' she added.",
        "'As soon as travel is permitted, I have plans to go back overseas to visit my surgeon and get my breast size increased to 1500cc [from their current 1050ccc].''I think in this day and age, it's very important for a woman to be able to express the way they feel and just express everything about beauty,' she told The Morning Show last year.'Plastic surgery is how I do that and that's what makes me happy. It gives me the confidence to be the best version of myself.'",
        "Tara recently joined adult subscription website OnlyFans to help fund her lifestyle and future cosmetic work during the Covid pandemic.She charges $25 for a monthly subscription, and previously boasted of making $10,000 in her first three days on the platform."
    ]
}