{
    "articleURL": "/tvshowbiz/article-12041579/A-look-Bill-Nighy-Anna-Wintours-relationship-former-romances.html",
    "content": [
        "Bill Nighy and Anna Wintour confused fans when they appeared to confirm their 'romance' on the Met Gala red carpet, only to insist they were just friends. ",
        "Held each year on the first Monday in May, the latest Met was especially significant for Anna, 73, who attended on Bill's arm and set tongues wagging after years of speculation that they're an item.However, a representative for Bill, 73, poured cold water on the rumours as they announced the next day: 'Bill and Anna have simply been great friends for two decades. They are not in a relationship.'So if it is not Love, Actually, then how did this closeness arise – and will it eventually lead to a full-blown romance? MailOnline takes a look at how their special friendship blossomed and the pair's previous relationships. ",
        "When did Bill Nighy and Anna Wintour meet? The pair's so-called platonic relationship dates back to the early 2000s when they began getting to know each other through the British theatrical scene.Anna - whose father 'Chilly Charlie' Wintour founded the Evening Standard Theatre Awards - and Bill have attended many of the same events over the years, and in 2006 when the actor starred in The Vertical Hour on Broadway, the Vogue editrix was there to offer her support while attending the opening night.At some point in those early years of theatrical run-ins, Anna and Bill formed a close friendship and began to see each other socially whenever she was in London.",
        "In 2009, they were seen leaving a theater performance together at intermission and going out for dinner together instead of staying for the second half of the play.In 2011 the friendship had grown close enough for Anna to quietly give Bill's daughter a job; actress-turned-director Mary Nighy was commissioned by Vogue to shoot a short film, Jonnie and Ari, inspired by the punk theme of that year’s Met Ball.In 2010, 2012 and 2013 the not-a-couple sat together at the Nicole Farhi fashion show in London.On all occasions they greeted each other with a kiss and whispered in each others ears.Anna, who has thrown her weight - and that of her publication - behind several celebrity pals over the years, including James Corden and Roger Federer, has also thrown several parties for Bill at her New York City townhouse.One such event in 2014 featured a screening of his film Turks and Caicos, and another held last year was thrown in honor of his movie Living.In 2015, during an interview with the Wall Street Journal, Bill was asked if it was true that he was dating someone - a question to which the actor had a very coy response.'Well, I have obviously nothing to say about that,' he said, before adding in what appears to be a moment of blazing indiscretion that 'there are a lot of rumors about me and probably about Anna Wintour.'",
        "It was a staggering thing to say, and unsurprisingly set off a wave of gossip on both sides of the Atlantic.Particularly because Anna was, at the time, in a relationship with her live-in boyfriend Shelby Bryan, an investor with whom she spent 20 years.In fact a few weeks before Bill's interview was published, Shelby had walked up the red carpet at the Met Gala five paces behind Anna (his customary position). The couple left the after party at the same time, although once again the financier trailed his partner at a respectful distance.Intriguingly Bill, who was living in New York for a few months while performing on Broadway, was also at the Met Ball, it is said at Anna's personal invitation - although those within the actor's inner circle were quick to deny that there was anything romantic between the pair.One friend of his said at the time that it was '100 per cent' a platonic friendship between him and the editrix and nothing more.While official spokespeople might continue to insist that the relationship between the longtime 'friends' remains entirely platonic, there is no doubting that Anna and Bill's joint appearance at the Met Gala on Monday night will have been carefully planned.Dame Anna is famously in control of everything – leaving lunches after 45 minutes, spending 20 minutes at parties, eating the same lunch, rising at the same time, and wearing the same couture Chanel day in and day out.",
        "To prepare the ground for her red carpet debut with Bill, she granted a rare interview to The Times newspaper, selecting an interviewer who had profiled Bill for the paper previously.",
        "Who has Bill Nighy dated?  Bill has not gone public with a relationship since his split from his long-term partner Diana Quick in 2008, with whom he shares a daughter, Mary. The couple had been together for 27 years and their union had become known as one of the most solid in showbusiness. Therefore fans were shocked when it emerged they had called time on their romance, with the couple initially keeping their split secret for 18 months.  Relatives told The Daily Mail that not only did the couple keep the separation hidden from the public, Diana's sister Julie was also in the dark until she read about it in a newspaper.Speaking to the paper about what went wrong in the relationship, a friend of Bill's said: 'It's pretty well-known among his friends that Bill has had a bit of a funny turn.'I suppose you could call it a delayed mid-life crisis. After years of muddling through, he found huge success pretty late in life and he hasn't dealt with it especially well. He's been working himself silly and it's not good for him.",
        "'He neglected Diana for years and I think she finally got sick of it. There was some sort of ultimatum and she left.'Plagued by anxiety and chronic stage fright, he had a drinking problem when he and Diana met, but he eventually gave up drinking and drugs in 1992. He barely speaks about that period now, other than to say that there are no anecdotes to be shared because there was nothing fun about it.'I don't think it's big and I don't think it's clever and I don't think it's funny. For me it wasn't funny at all and it is great when it finally stops,' he said.",
        "Who has Anna Wintour dated? Wintour's first marriage was to David Shaffer in 1984, who was 10 years her senior. They had two children, Charles and Bee, but by 1999 the couple were divorced and Anna began dating Shelby Bryan. The chemistry between Anna and Shelby was evident from the moment they met in November 1997, when they were seated next to each other during a New York City Ballet gala — both were married to other people.At the time, Shelby was regarded as a Democratic Party rainmaker, having raised $1.5million for candidates including Al Gore, during fundraisers held at his Upper East Side home. He also served on Clinton’s Foreign Intelligence Advisory Board.",
        "He and Anna were certainly more than a match for each other. The unabashedly ambitious Anna was by then being described as the ‘godmother’ of the fashion mafia, while Shelby was described by a 1999 New York Magazine article as a ‘flashy extrovert with undisguised social ambitions’.However, relationship is said to have run into trouble in 2013, when it was revealed that he owed $1.2 million in back taxes to the IRS.The pair were often pictured at social events and tennis matches in the years prior, but were less frequently been spotted out in the time since.In 2020 the couple announced they had split after 20 years together."
    ]
}