{
    "articleURL": "/sport/mma/article-12050797/What-time-Aljamian-Sterling-vs-Henry-Cejudo-UFC-288-watch-stream.html",
    "content": [
        "Aljamain Sterling will face former champion Henry Cejudo later tonightSterling defeated T.J. Dillashaw via second-round TKO in his last fight Cejudo's last fight came in 2020 when he defeated Dominick Cruz at UFC 249 Aljamain Sterling will defend his bantamweight title for the third time when he faces former champion Henry Cejudo tonight. ",
        "Sterling is coming off a second-round TKO victory against T.J. Dillashaw last October. The current champion has proved his doubters wrong since he won the belt back in 2020 against Petr Yan at UFC 259. As for Cejudo, the former two-division champion announced his retirement from the sport in 2020 after his second-round TKO victory against Dominick Cruz at UFC 249. The win over Cruz was Cejudo's only defence of his bantamweight title after winning the vacant title against Marlon Moraes at UFC 238 in 2019.This weekend's PPV card also sees an epic welterweight fight between Belal Muhammad and Gilbert Burns and is set to serve as the co-main event. A mouthwatering lightweight bout between Drew Dober and Matt Frevola will also feature on tonight's card.Mail Sport breaks down everything you need to know ahead of Sterling vs Cejudo, including how you can watch in the UK and who else is fighting.",
        "When is UFC 288?UFC 288 will take place tonight, with the early prelims getting underway at 11pm in the United Kingdom. For those watching in America, the early prelims will begin at 3pm PT, 5pm CT and 6pm ET on Saturday. The prelims are then scheduled to take place at 1am on Sunday, while it is set to get underway at 5.30pm PT, 7.30pm CT and 8.30pm ET on Saturday in America.",
        "UK fans will be able to watch the main card at 3am. In the US, the final five fights will start at 7pm PT, 9pm CT and 10pm ET on Saturday.The main event between Sterling and Cejudo will not get underway in the UK until around 5.30am on Sunday morning. Sterling's showdown with Cejudo is set to take place at the Prudential Center in Newark.How to watchUFC 288 will be shown live on BT Sport 1 in the UK and will also be shown live on the broadcaster's app.Coverage for this weekend's PPV showdown will start at 1am on Sunday.Mail Sport will also be covering the event live, so you can keep up-to-date with us.",
        "Sterling vs Cejudo: The key stats  Aljamain SterlingAge: 33Height: 5ft 7inReach: 71''Stance: OrthodoxRecord: 22-3 Henry Cejudo Age: 36Height: 5ft 4inReach: 71''Stance: OrthodoxRecord: 16-2Fight card in fullMain Card Aljamain Sterling vs Henry Cejudo – For UFC Bantamweight ChampionshipBelal Muhammad vs Gilbert Burns Jessica Andrade vs Yan Xiaonan Movsar Evloev vs Diego LopesKron Gracie vs Charles Jourdain  Preliminary CardDrew Dober vs Matt Frevola Kennedy Nzechukwu vs Devin Clark Khaos Williams vs Rolando Bedoya Marina Rodriguez vs Virna Jandiroba Early Preliminary Card   Braxton Smith vs Parker Porter Phil Hawes vs Ikram Aliskerov Rafael Estevam vs Zhalgas Zhumagulov Joseph Holmes vs Claudio Ribiero Daniel Santos vs Johnny Munoz Jr What's been said?Heading into tonight's main event, Sterling revealed that he is looking forward to defeating another 'legend'. 'The guy came back after a three-year layoff, that's pretty impressive,' Sterling said at the UFC 288 pre-fight press conference.'I thought the guy was joking around. I'm glad to see he's serious about this and I can't wait to smash another legend, another former champion. He's got some good accolades and I can't wait to take that away from him, because he said this is going to be an easy fight. So what's going to happen when he loses and I make him bend the motherf****** knee?",
        "'I can't wait for Saturday because I'm going to silence the crowd again! Again! You think I can lose to a guy who dresses up in a velour suit? And his team? Look at these clowns! Sit your a** down!'",
        "As for Cejudo, 'Triple C'  believes that he is still the current champion of the bantamweight division. 'I never lost the belt,' Cejudo said. 'So the way I see it, I'm the champ, he's the challenger, and you guys hired the right hitman. I'm here to do my job. Weight is good, I feel good. I'm doing my weight cut in the morning, I'm super light. I'm excited to put this clown six feet under.' OddsAljamain Sterling to win - 10/11Henry Cejudo to win - 5/6Draw - 50/1All odds via Paddy Power and correct at the time of publication. ",
        "Prediction It will be interesting to see if ring rust plays a big factor in this fight for Cejudo, seeing as he has not fought in three years.For Sterling, he may not be the best striker, but his wrestling and grappling are arguably one of the best in the division. If he can get the fight to the floor and take Cejudo's back, he can get the job done as his submission skills are second to none.",
        "Despite Sterling dominating his last fight against Dillashaw, it is fair to say that this weekend's clash with Cejudo will be his toughest yet.With Cejudo a former Olympic medalist in wrestling, Sterling may have a tough time taking him down. On the feet, Cejudo will have the edge and has proven to knock top strikers out over the years.Prediction: Aljamain Sterling via decision "
    ]
}