{
    "articleURL": "/wires/reuters/article-12044071/Ford-CEO-calls-electric-vehicle-market-price-cuts-worrying-trend.html",
    "content": [
        "By David Shepardson and Joseph White",
        "WASHINGTON, May 3 (Reuters) - Ford CEO Jim Farley said on Wednesday that price cuts in the electric vehicle market were \"a worrying trend\" after the U.S. automaker dropped prices for its Mustang Mach-E in response to a series of reductions by rival Tesla.Ford on Tuesday announced a price cut of up to 8% of its Mustang Mach-E electric vehicle, the second cut the automaker announced this year.Farley compared the price war in the EV market to Henry Ford's series of price cuts for the Model T starting in 1913. But the Ford Chief said the company founder's strategy ultimately put Ford at risk.\"You do not want to commoditize the product,\" Farley said at a Wall Street Journal forum.\"The resale value for people who bought at higher prices is awful. They never forget,\" Farley said. Ford will follow Tesla price cuts for models such as the Mustang Mach-E that competes head-on with Tesla's Model Y, he said. \"There´s a limit to how far we´ll go.\"Tesla CEO Elon Musk praised Ford's EV strategy. \"Always tough with margins for new vehicle lines, especially when there are major technology shifts,\" Musk wrote on Twitter. \"I think Ford´s overall strategy with EVs is smart. The electric F-150 (Lightning) has high demand.\"",
        "On other points, Farley said Ford does not plan to drop Apple CarPlay software that allows customers to mirror their smartphone screens in a vehicle's dashboard. General Motors Co recently said it will phase out CarPlay in future models.In terms of entertainment streamed into a car, \"we kind of lost that battle ten years ago,\" Farley said. Moreover, \"70% of Ford customers in the U.S. are Apple customers.\"Ford chose to build a new electric vehicle manufacturing hub near Memphis, Tennessee, in part because the region has cleaner electricity from hydro and nuclear facilities, Farley said.Ford will train workers for that facility, and will invest in retraining current workers, Farley said. But not all Ford employees will make the transition to electric vehicles, he said.\"We can't upskill everyone,\" he said. \"It will take too much time.\" (Reporting by David Shepardson and Joseph White; Editing by Aurora Ellis and David Gregorio)"
    ]
}