{
    "articleURL": "/wires/pa/article-12054337/King-Queen-watch-scaled-flypast-palace-balcony.html",
    "content": [
        "The King and Queen appeared on the Buckingham Palace balcony to watch a scaled-down military flypast.",
        "The RAF’s Red Arrows display team trailed red, white and blue smoke as their Hawk jets flew over the crowds gathered on The Mall and outside the palace.",
        "More than 60 aircraft from the Royal Navy, British Army and Royal Air Force had been due to take part in the flypast, but “unsuitable weather conditions” meant that plan had to be abandoned.",
        "Instead, helicopters from the three services and the Red Arrows took part in the display which lasted for around two-and-a-half minutes.The King and Queen smiled and waved to the crowds as the aircraft flew overhead.The RAF acknowledged it was “disappointing that the poor weather prevented all of our aircraft participating in the flypast”.In a social media post, the RAF said: “The safety of spectators and our pilots and crew always comes first and the conditions weren’t right for the other planned aircraft to join the flypast today.“We are hoping for clear blue skies in June for The King’s birthday flypast.”Squadron Leader Mike Willers, one of the crew members unable to take part in the flypast, told the PA news agency: “Unfortunately the weather was not suitable for us to safely conduct a flypast.“Ultimately what we need to do is make sure that, whenever we do this sort of thing, we keep our people and our assets safe and everybody on the ground safe.”",
        "But he said it was “good operational practice” and “we hope for blue skies next month for the King’s birthday flypast”.Footage from Royal Navy helicopters showed how poor the weather was in the skies above London.Rain streaked the windshields of the aircraft as they flew low over the heart of the capital.The flypast involved 16 Juno, Wildcat, Merlin, Apache, Chinook and Puma helicopters and nine Red Arrow Hawks."
    ]
}