{
    "articleURL": "/tvshowbiz/article-12057997/Drew-Barrymore-KISSES-Cocaine-Bear-pre-taped-2023-MTV-Movie-TV-Awards-skit-dropping-out.html",
    "content": [
        "READ MORE: Jennifer Coolidge leads winners at MTV Awards 2023 Drew Barrymore kicked off the 2023 MTV Movie &amp; TV Awards in style with a hilarious skit referencing some of the past year's buzziest films and television shows.",
        "The 48-year-old actress and talk show host was featured in a pre-taped sketch that was completed prior to the start of the Writers Guild of America's strike, which began on Monday, May 2.In the skit, Drew dressed up in an old-fashioned pink prom dress to parody her character from her hit 1999 romantic comedy Never Been Kissed.In footage assembled from recent shows and movies, she showed off her dance moves with the evil robot M3GAN from the movie of the same name and Wednesday (Jenna Ortega) from Netflix's eponymous Addams Family spinoff, before finally getting her long-awaited kiss from the title creature of Cocaine Bear. Barrymore announced earlier in the week that she would be dropping out as the host of the awards show in solidarity with film and television writers, who are striking over chronically low pay and concerns that studios are attempting to further shrink staffing on television shows and to potentially replace them with so-called AI programs. ",
        "BEST MOVIEScream VI (WINNER) BEST SHOWThe Last of Us (WINNER) BEST PERFORMANCE IN A MOVIETom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWJenna Ortega — Wednesday (WINNER)MOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER) BEST DUOPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)BEST SONGTaylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)",
        "Drew sported the braces that she wore in Never Been Kissed as she gave herself a quick pep talk in her high school–era bedroom at the start of the clip.But then she took a stroll down a pink hallway and found herself at a hospital room with a man sporting an eerie ear-to-ear grin, which was featured in the hit horror film Smile.'I don't mean to be forward but I noticed you smiling at me,' she said, seemingly charmed.'OK, awkward,' she added after he failed to respond and kept smiling at her.Then he rose up and started shouting over and over, 'You're going to die!''So, no kiss then,' she joked before moving on.Suddenly, she was out in the Southern California desert with Daniel Kaluuya from Jordan Peele's acclaimed sci-fi horror film Nope.She tried to solicit a kiss from him before he looked up at the terrifying jellyfish-like alien monster Jean Jacket, which hovered above them and sucked her into its chute-like mouth. ",
        "Next up, she found herself in a blue-bathed ballroom as he had a 'dance off' with the Addams Family's Wednesday (Jenna Ortega).'You're good!' she gushed to Wednesday. 'Are you on TikTok?!'Then, without explanation or transition, she was aboard a yacht from the second season of HBO's popular series The White Lotus.",
        "Jennifer Coolidge's character pleaded to her with one of her most-quoted lines from the season: 'These gays, they're trying to murder me!''I'll kiss them too!' replied a desperate Drew.Next up, she found herself in 'another dance off' with the killer robotic doll M3GAN.She thought it was fun at first, but she skedaddled as soon as M3GAN ripped the blade off a paper cutter and wielded it like a machete.She didn't fare much better at the beach football scene from the box office juggernaut Top Gun: Maverick, as she got a football to the head as soon as she called out to the pilots. ",
        "'I can't believe it. I've still never been kissed,' she moaned as she found herself standing at the top of a tree-covered mountain in a remote forest.'Hello there, bear,' she said as she looked ahead with binoculars and saw the drugged-up title character from the horror-comedy Cocaine Bear.'This is it, Josie. You're finally gonna get kissed,' she murmured to herself as the bear approached.Then it charged, jumping into the air in slow motion to attack her, but she held her arms out as if to embrace it.After a quick pause, the bear was seen writing on the ground in ecstasy while Drew laid on its stomach.",
        "As it exhaled a cloud of cocaine powder, she breathed it in and leaned forward so touch tongues with the bear.'Oh my gosh, I feel so alive! Like I could take on the world. Do anything. Because I'm not Josie Grossie anymore,' she said, reference her nickname in Never Been Kissed.Reactions on social media to the intro were mixed, with some applauding Drew, while others complained that the skit felt out of place now that she was no longer hosting the live show.",
        "'No host. Drew Barrymore pulled out because of the writer's strike. But that intro was based on her hosting. Feels extra stupid now,' wrote one user.Another person complained that subsequent commercials that the actress had shot felt out of place now that she wasn't there in person. 'Lol these commercials that drew barrymore recorded before she decided not to host anymore don't make sense now,' one viewer tweeted.Another added, 'I'm crying they played a drew barrymore clip of her getting ready to host as if she didn't drop out.'Another person sounded excited to see what Barrymore was up to, but decided the results were 'painful.'But others found Barrymore and her skits charming.'Omg I love @DrewBarrymore,' gushed one fan. 'I love that she is genuinely herself!' ",
        "Another user said the intro was 'silly,' but they 'just love[d]' the actress. ",
        "Some overly sensitive viewers acted as if they were offended by Drew's fake kiss with a fake bear on cocaine. 'Sorry did @MTVAwards just open w a girl making out with a bear? What is happening??? That is illegal on earth right?' wrote one particularly puzzled user.A few commenters even seemed delighted that most of the planned portions of the show had to be scrapped, as union writers couldn't participate in the show after the start of the WGA's strike, and a bevy of stars were unwilling to cross a picket line.'Drew Barrymore is the coolest mf ever bc they canceled the whole award show and are currently airing a powerpoint presentation,' one viewer joked.The 2023 MTV Movie &amp; TV Awards are airing Sunday from the Barker Hangar in Santa Monica, California.The show, which had previously been split over two days for scripted and unscripted content, has been condensed back into a single evening this year.Films including Avatar: The Way Of Water, Elvis, Nope and Top Gun: Maverick are among those competing for the Best Movie award, while The Last Of Us, Stranger Things, Wednesday, The White Lotus, Yellowstone and Yellowjackets are among the nominees in the Best Show category.",
        "The long-running awards show is one of the first victims of the ongoing dispute between the Alliance of Motion Picture and Television Producers and the Writers Guild of America union.Writers are now on strike and picketing studios, leading the host Drew Barrymore to announce she was dropping out last Sunday.'I have listened to the writers, and in order to truly respect them, I will pivot from hosting the MTV Movie &amp; TV Awards live in solidarity with the strike,' Barrymore told Variety after her decision. 'Everything we celebrate and honor about movies and television is born out of their creation.'Barrymore added that she'll be watching the show from home, and she stills plans to return as host next year. The labor action has also led the awards show to cancel its red carpet festivities, and other stars may also drop out to show support to strikers.On Thursday, Vanderpump Rules star Lala Kent also announced she was no longer attending as a show of solidarity.'Although Vanderpump Rules falls under the unscripted sector of TV, that is not an excuse for me to remain silent and carry on as if there isn’t so much at stake for every writer and their families,' she told The Hollywood Reporter in a statement. 'We have to protect our creators and I hope you’ll stand with me and many others as we do so until we reach a resolution (hopefully very soon).'The White Lotus star Jennifer Coolidge, who appeared in the first two-seasons of the hit HBO dramedy, has a chance to continue her streak of awards-season wins with the Most Frightened Performance prize for her work in the Sicily-set second season.She is also slated to receive the Comedic Genius award, though it's unclear if she will still attend amid the ongoing strike. The original list of presenters included recent Oscar winner Jamie Lee Curtis, Gal Gadot, Tiffany Haddish, Sarah Michelle Gellar and Lil Dicky's Dave Burd, along with several stars from Yellowjackets, Transformers: Rise Of The Beats and Joy Ride, including Oscar nominee Stephanie Hsu, though some may opt to join Barrymore and Kent in boycotting the show. Riley Keough, Ayo Edebiri, Kaia Gerber, Bodies Bodies Bodies star Rachel Sennott, Camila Morrone, Suki Waterhouse and The Little Mermaid's Halle Bailey are also expected to appear. Top Gun: Maverick and the shows Stranger Things and The Last Of Us scored the most nominations of any films and series. ",
        "Audiences enthralled by the ongoing 'Scandoval' on Vanderpump Rules will get to see the Bravo series face off against Jersey Shore: Family Vacation, The Real Housewives of Beverly Hills, Family Reunion: Love &amp; Hip Hop Edition and The Kardashians.As in previous years, the show will feature gender-neutral award categories. The MTV Movie &amp; TV Awards airs live on Sunday, May 7, at 8 p.m. ET/PT on MTV. It will be simulcast on BET, BETHer, Comedy Central, CMT, Logo, MTV2, Nickelodeon, Paramount Network, Pop, TV Land and VH1.Viewers can also stream the show on Paramount+. ",
        "BEST MOVIEAvatar: The Way of WaterBlack Panther: Wakanda ForeverElvisNopeScream VI (WINNER)SmileTop Gun: MaverickBEST SHOWStranger ThingsThe Last of Us (WINNER)The White LotusWednesdayWolf PackYellowstoneYellowjacketsBEST PERFORMANCE IN A MOVIEAustin Butler — ElvisFlorence Pugh — Don’t Worry DarlingKeKe Palmer — NopeMichael B. Jordan — Creed IIITom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWAubrey Plaza — The White LotusChristina Ricci — YellowjacketsJenna Ortega — Wednesday (WINNER)Riley Keough — Daisy Jones &amp; The SixSadie Sink — Stranger ThingsSelena Gomez — Only Murders in the BuildingBEST HERODiego Luna — AndorJenna Ortega — WednesdayPaul Rudd — Ant-Man &amp; The Wasp: QuantumaniaPedro Pascal — The Last Of Us (WINNER)Tom Cruise — Top Gun: MaverickBEST VILLAINElizabeth Olsen — Doctor Strange in the Multiverse of Madness (WINNER)Harry Styles — Don’t Worry DarlingJamie Campbell Bower — Stranger ThingsM3GAN — M3GANThe Bear — Cocaine BearBEST KISS Anna Torv + Philip Prajoux — The Last Of UsHarry Styles + David Dawson — My PolicemanMadison Bailey + Rudy Pankow — Outer Banks (WINNER)Riley Keough + Sam Claflin — Daisy Jones &amp; The SixSelena Gomez + Cara Delevingne — Only Murders in the BuildingBEST COMEDIC PERFORMANCEAdam Sandler — Murder Mystery 2 (WINNER)Dylan O’Brien — Not OkayJennifer Coolidge — Shotgun WeddingKeKe Palmer — NopeQuinta Brunson — Abbott ElementaryBREAKTHROUGH PERFORMANCEBad Bunny — Bullet TrainBella Ramsey — The Last Of UsEmma D’Arcy — House of the DragonJoseph Quinn — Stranger Things (WINNER)Rachel Sennott — Bodies Bodies BodiesBEST FIGHTBrad Pitt (Ladybug) vs. Bad Bunny (The Wolf) — Bullet TrainCourteney Cox (Gale Weathers) vs. Ghostface — Scream VI (WINNER)Jamie Campbell Bower (Vecna) vs. Millie Bobby Brown (Eleven) — Stranger ThingsKeanu Reeves (John Wick) vs. Everyone — John Wick 4Escape from Narkina 5 — AndorMOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER)Jesse Tyler Ferguson — Cocaine BearJustin Long — BarbarianRachel Sennott — Bodies Bodies BodiesSosie Bacon — SmileBEST DUOCamila Mendes + Maya Hawke — Do RevengeJenna Ortega + Thing — WednesdayPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)Simona Tabasco + Beatrice Grannò — The White LotusTom Cruise + Miles Teller — Top Gun: MaverickBEST KICK-ASS CASTAnt-Man &amp; The Wasp: QuantumaniaBlack Panther: Wakanda ForeverOuter BanksStranger Things (WINNER)Teen Wolf: The MovieBEST SONGDemi Lovato — Still Alive (Scream VI)Doja Cat — Vegas (Elvis)Lady Gaga — Hold My Hand (Top Gun: Maverick)OneRepublic — I Ain’t Worried (Top Gun: Maverick)Rihanna — Lift Me Up (Black Panther: Wakanda Forever)Taylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST DOCU-REALITY SERIESJersey Shore Family VacationThe Real Housewives of Beverly HillsFamily Reunion: Love &amp; Hip Hop EditionThe Kardashians (WINNER)Vanderpump RulesBEST COMPETITION SERIESAll-Star ShoreBig BrotherRuPaul’s Drag Race: All-Stars (WINNER)The Challenge: USAThe TraitorsBEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)Joel Madden — Ink MasterNick Cannon — The Masked SingerRuPaul — RuPaul’s Drag RaceKelly Clarkson — The Kelly Clarkson ShowBEST REALITY ON-SCREEN TEAM (presented by SONIC®)Mike “The Situation” Sorrentino, Vinny Guadagnino, Pauly D (MVP) — Jersey Shore Family VacationTori Deal and Devin Walker — The Challenge: Ride or DiesRuPaul Charles and Michelle Visage — RuPaul’s Drag RaceAriana Madix, Katie Maloney, Scheana Shay, LaLa Kent — Vanderpump Rules (WINNER)Garcelle Beauvais and Sutton Stracke — The Real Housewives of Beverly HillsBEST MUSIC DOCUMENTARYHalftimeLove, LizzoSelena Gomez: My Mind &amp; Me (WINNER)SherylThe Day the Music Died: The Story of Don McLean’s American PieBEST MUSICAL MOMENT Sofia Carson's Come Back Home from the film Purple Hearts (WINNER) COMEDIC GENIUS AWARDJennifer Coolidge (WINNER)"
    ]
}