{
    "articleURL": "/news/article-12046867/RuPauls-Drag-Race-star-Shangela-accused-rape.html",
    "content": [
        "Daniel McGarrigle is seeking unspecified damages over the alleged attackHe claims incident occurred in Louisiana hotel room after a crew party in 2020Shangela, real name Darius Jeremy Pierce, has strenuously denied allegations RuPaul's Drag Race star Shangela has been accused of raping a former production assistant who worked on HBO show We're Here after a drunken crew party in 2020.",
        "The LA Times reported that a lawsuit was filed on Wednesday in Los Angeles Superior Court against the drag star, whose real name is Darius Jeremy Pierce. Daniel McGarrigle is seeking unspecified damages for sexual assault, sexual harassment, gender violence, false imprisonment and negligence.McGarrigle, 39, also accused Pierce, 42, of violating the Ralph Act, which forbids hate violence as well as intimidation by threats of violence under California law.Pierce has strenuously denied the accusations, and said: 'I can't begin to explain how hurt and disgusted I am by these totally untrue allegations.",
        "McGarrigle's suit claims Pierce raped him in a Louisiana hotel room following a 2020 crew party.The lawsuit claims an inebriated McGarrigle fell asleep fully clothed in Pierce's hotel room before he was allegedly attacked. The suit, which also names 'We're Here' production company Buckingham Television, alleges sexual assault, gender violence, false imprisonment and sexual harassment. Cast and crew gathered at El Toro, a restaurant and bar in Ruston, Louisiana, to celebrate the final day of production for the fifth episode of Season 1, the documents state.McGarrigle claims in the suit that Pierce insisted on buying him drinks and shots for various sections of the crew - and says every drink he had that evening was purchased and handed to him by Pierce. ",
        "The suit further alleges that after the party Pierce invited McGarrigle back to his hotel room to help him pack for an early morning flight.The lawsuit says: 'Pierce rubbed his back as he [McGarrigle] vomited and brought him a cup of water.It continues: 'After McGarrigle had finished throwing up, Pierce suggested he spend the night with him in his room.'Sick and exhausted, McGarrigle agreed. He laid down in Pierce's bed fully clothed, shoes and socks still on.'The suit states that McGarrigle later woke up to a cold liquid being poured on his face, burning his eyes and nose. ",
        "McGarrigle alleges that the liquid was a type of poppers, a chemical inhalant sometimes used during sex to relax muscles and create a euphoric head rush. The suit states that McGarrigle's  'pants were pulled down' and that Pierce initiated anal sex without using a condom. The accuser claims he screamed 'no' and tried to fight him off - but 'felt extremely weak'.The lawsuit continues: 'Plaintiff was disoriented from the high he was experiencing from the poppers and the fear that overcame him during the sexual assault. Pierce overpowered McGarrigle and was able to hold him down.'The suit claims McGarrigle felt weak, disoriented and overcome by fear and that Pierce was aggressive both physically and verbally.",
        "McGarrigle claims Pierce said: 'I know you want it, and you're going to take it.'In a statement Pierce said: 'I can't begin to explain how hurt and disgusted I am by these totally untrue allegations'.'They are personally offensive and perpetuate damaging stereotypes that are harmful not only to me but also to my entire community. 'An external investigation into this embittered individual's claims previously concluded that they were completely without merit. ",
        "'This newest filing is nothing but an attempt to shake down both me and a well-regarded television company. No one should be fooled: it has no basis in fact or in law, and it will not succeed.''As a hardworking and outspoken drag entertainer for more than a decade, I know that I am far from alone in battling ignorance, bigotry and prejudice, all of which played a role in the filing of this complaint. 'That is why I will fight this entirely meritless lawsuit and not allow it to destroy me and those I love, or harm the causes we all stand for.'A statement issued on behalf of Buckingham Television and HBO by a representative of the series said: 'Buckingham Television, the production company for 'We're Here,' received a complaint late summer 2021 regarding an incident that was alleged to have occurred in early 2020. ",
        "'Buckingham and HBO take the safety and well-being of personnel on our shows very seriously, and Buckingham immediately launched an investigation. 'The investigation concluded that there was insufficient evidence to support these allegations.'",
        "The suit also alleges that Pierce sexually harassed McGarrigle 'on a daily basis' until McGarrigle resigned in July 2021.The alleged harassment included 'asking him out for drinks, touching with lingering hands various parts of McGarrigle's body while making suggestive comments about how good Plaintiff looked.' Pierce first joined the cast of RuPaul's Drag Race as Shangela in season two but was eliminated in the first episode.  After auditioning again, she was invited back for season three where she made it to the top five. Since then Pierce has gone on to appear in several TV shows including Glee, and placed fourth on Dancing with the Stars as his alter ego. Since 2020, Shangela has co-hosted 'We're Here' on HBO which involves herself and and two other drag queens travelling across the US to recruit small town residents to participate in a one night only drag show. The show has gone on to achieve critical acclaim and won two Primetime Emmy Awards for costume and makeup. "
    ]
}