{
    "articleURL": "/wires/ap/article-12043783/Mexico-develops-COVID-19-vaccine-2-years-late.html",
    "content": [
        "MEXICO CITY (AP) - Mexican officials celebrated Wednesday the announcement that the country finally developed its own COVID-19 vaccine, more than two years after inoculations from the U.S., Europe and China were rolled out.",
        "It was unclear what use would be made of the vaccine, named \"Patria\" or \"Motherland,\" developed in a joint effort between the government and a Mexican company, Avimex, which previously did work on animal vaccines.Vaccine uptake in Mexico dropped precipitously in late 2022 and 2023, and Mexico still has millions of doses of the Abdala vaccine it bought from Cuba.María Elena Álvarez-Buylla, the head of Mexico´s government commission for science and technology, said the new vaccine would be approved for use as a booster shot. She did not say whether the government medical approval agency had formally authorized the Patria vaccine.Dr. Fidel Alejandro Sánchez, who sits on the council of researchers in charge of following virus variants in Mexico, said he had doubts about using a vaccine designed two years ago as a booster to protect against currently circulating strains.\"It is like reading yesterday's newspaper,\" Sánchez said. \"It makes no sense to use it as a booster when it wasn't designed for that.\"",
        "Mexico started developing the Patria vaccine in March 2020. But testing was slow, and the country wound up importing 225 million doses, mainly Astra-Zeneca and Pfizer, and some Chinese vaccines.Mexico bought 9 million doses of the Cuban-made Abdala vaccine in September 2022, even though it was designed for coronavirus variants circulating in 2020 or 2021, not current variants. Few Mexicans have shown up to get the Cuban booster shots.",
        "Mexican President Andrés Manuel López Obrador has made a point of trying to make Mexico self-sufficient in many industries, while at the same time supporting Cuba however he can.\"This opens the door to recovering vaccine sovereignty,\" Álvarez-Buylla said.Mexico's official death toll of test-confirmed COVID-19 deaths stands at almost 334,000, but testing was scarce in the early days of the pandemic and the government's own review of death certificates shows more than 505,000 deaths where COVID-19 was listed as a cause of contributing cause of death."
    ]
}