{
    "articleURL": "/wires/pa/article-12040107/Crocheting-royal-fans-let-imaginations-wild-postboxes-coronation.html",
    "content": [
        "Crocheters across the country have been stocking up on wool and letting their imaginations “go wild” to celebrate the coronation, creating royal-inspired postbox toppers including portrayals of the King, Queen Consort and crown jewels.",
        "Marge Ellis is the coordinator for new members at The Secret Society of Hertford Crafters and facilitated the creation of their pillar box toppers for the coronation – which is so extensive it even includes a knitted depiction of the group topping a postbox.",
        "The 37 crafted creations – which were made across a 14-week period by the group – have found pride and place on pillar boxes in both Hertford and Ware, centred on five themes: coronation, celebration, the King, community and conservation.“People’s imaginations have gone wild,” Mrs Ellis told the PA news agency.“We have a topper of the Tower of London and beefeaters.",
        "“We thought it might be nice to actually look at King Charles himself and who he is and what he does and what makes him happy.“So we’ve got his Jack Russell dogs and we’ve got the King fishing.”",
        "The group, which has an age range of 19 to 99, has even created a self-referential postbox topper depicting the group placing a topper on a pillar box.“I love it, I have to say,” Mrs Ellis said.“And I am even on it.”Mrs Ellis added that for the conservation theme, someone found out that Charles was keen on the Black Cornish Bee project.",
        "The money raised from the postbox toppers, which are eventually to be auctioned off, will go towards the Essex &amp; Herts Air Ambulance Trust.",
        "Mrs Ellis added: “It’s not just a case of putting a topper on a postbox, it’s a way of making people happy and it’s a way of life.“One woman said she was excited about the coronation because of our toppers, it’s fantastic, and some have even had tears in their eyes, which sets me off.”",
        "Judit Kocsis-Barna, 48, has used her skills as the founder of Inspire Crochet Group in Wallasey to create her own take on coronation regalia, dubbed “the cartoon version of the crown jewels” by her husband – Istvan, 48.",
        "Ms Kocsis-Barna, who works as a carer, made a crocheted crown, sceptre and orb, complete with crocheted gemstones, as part of a postbox topper which also includes work from others in her group.“We usually put our creations on a postbox outside Wallasey Post Office – which is a huge oval one – which Amanda and Sarah who work there have looked after for us this year,” she told PA.",
        "“Members Sandy, Pat, Karen, Norma have helped with other items including guards and Camilla holding her crown in the wind and Charles wrapping his arm around her, and I made a crown, sceptre and orb.",
        "“I roped in my husband who built the structure for the crown for me and he mapped out where I should crochet the coloured gemstones.“He has called the crown the cartoon version of the crown jewels.”",
        "Ms Kocsis-Barna has crocheted since the age of nine, and has spent “hours, hours and hours” making the three items, in which she closely studied images of the regalia online and in Anna Keay’s book, The Crown Jewels: The Official Illustrated History.She added that the orb was the easiest to make and includes a plastic bowling ball, with the sceptre proving to be tricky because of its partially twisted shape.",
        "“I thought, I don’t know what to do and it was midnight and I was looking on YouTube for a twisted crochet video and found one in Italian,” she said.“I don’t speak a word of the language and they were crocheting frosting on a cupcake in this twisted style, but I figured out how to do it from that.”",
        "On the afternoon of May 5, the topper is to be kept in St Hilary’s Parish Church.Laura Sharp, 56, who is based in Swindon, has graced three postboxes in her local area with crocheted toppers, with two featuring a crown and the other, mini woolly versions of Charles and Camilla, based on patterns from fellow crocheters on Etsy.",
        "“I thought, I will do a couple of crowns because they look nice and then made gnome versions of Charles and Camila, but adapted the second pattern to make my design bigger and to incorporate more colours,” Laura, who is retired and used to work in the water industry, told PA.“They just sort of evolve, you get an idea and just go for it.”",
        "Mrs Sharp previously made toppers for the jubilee, which she said came in handy this time around.“Rather than chucking them away, I washed them, dismantled what was on it and then it’s ready to use another time.She said that it takes her roughly five hours to crochet a base, with a crown taking around 20 hours to complete.“The one with the King and Queen on top took longer because they’re a bit more fiddly to make.“I can spend anywhere between 20 to 50 hours on a topper.”",
        "Mrs Sharp – who has crocheted for roughly three years – has said she is “absolutely addicted” to it – and has been spurred on to keep at it by “lovely” responses from the public.“Sometimes you go down to the shops and see people standing around it taking photographs, and that’s really nice, and the community really look after them too.”",
        "She joked: “I don’t like seeing naked postboxes anymore – I just don’t have the time to do them all though.”",
        "Despite not having any strong opinions about the monarchy, Mrs Sharp said she will celebrate the coronation with her friend who is hosting a garden party.“You probably won’t find me with loads of Charles mugs, but it’s something worth celebrating and I just want to inject some positivity with my work,” she said."
    ]
}