{
    "articleURL": "/wires/ap/article-12052081/School-dean-shot-student-sentenced-racketeering.html",
    "content": [
        "BOSTON (AP) - A former Boston high school dean serving a 26-year sentence in state prison for shooting a student he had recruited to deal drugs has received an additional 18 years or more on a federal gang-related charge.",
        "Prosecutors said that Shaun Harrison, 63, lived a double life, portraying himself as an anti-violence activist and mentor for troubled teens while hiding his own gang ties and luring students into drugs and violence.In 2022, Harrison pleaded guilty to a count of racketeering conspiracy, also referred to as a RICO conspiracy.Harrison is serving time after his 2018 conviction for attempting to kill a student who was selling marijuana in the high school at Harrison's direction, authorities said. The 17-year-old was shot in the back of the head after a dispute over declining drug sales, prosecutors said. The student survived but suffered partial face paralysis, permanent hearing loss and other injuries.Massachusetts U.S. Attorney Rachael Rollins said Harrison exhibited what she described as an astonishing level of betrayal and dishonesty.\"As the academic dean at a Boston public high school he lured and manipulated teenagers into a criminal enterprise that specialized in street terrorism,\" Rollins said in a written statement after Harrison was sentenced Thursday in federal court. \"Harrison was the architect of ruin for an entire generation of promising young lives.\"",
        "She said Harrison continued to associate with the Latin Kings gang while in state prison.Federal prosecutors said last year that Harrison was one of dozens of defendants to plead guilty in a sprawling Latin Kings case stemming from an investigation dubbed \"Operation Throne Down.\"",
        "Last year, a federal judge ordered Harrison to pay more than $10 million in damages to the former student he was convicted of trying to kill, but it´s unclear whether the victim will ever get any money from Harrison.Harrison was hired by the Boston Public Schools in 2015 to serve as an academic dean at English High School, a public, magnet school. In that role, Harrison was to act as a mediator between teachers and students, contact families when students struggled and work with at-risk students, officials said."
    ]
}