{
    "articleURL": "/news/article-12060959/Dubai-Real-estate-developers-try-expats-lured-Emirate.html",
    "content": [
        "Around a quarter-of-a-million Brits are estimated to now call Dubai their homeSome 90 per cent of the city state's population is already made up of expatsJust four decades ago, Dubai was little more than a desert. Now, the city stands as a metropolis of indulgence and extravagance.",
        "Skyscraper upon skyscraper shoots into the sky, surrounded by pristine man-made bodies of water. The beating desert sun shines off the vast glass facades of this concrete jungle as if it were a CGI-constructed set of a utopian film.Back in the 1990s, the World Trade Centre was Dubai’s tallest tower with little else surrounding the lonely 603ft (184m) structure. More than 30 years later, the building once considered the jewel in the then-desolate crown is now lost among the vast clusters of high-rise monuments.Now at the centre of this city state is the 21st-century's Tower of Babel. The Burj Khalifa imposes itself over the rest of Dubai's sheer opulence, standing at just over half-a-mile tall.Yet this is not enough to quench Dubai’s thirst for the biggest and best. A short distance to the east, the Dubai Creek Tower is slowly being pieced together in the hope that it will one day succeed the current title holder.",
        "Opulence is synonymous with this city. Enormous wealth flows in and out as a continuous stream. This has long created something of a gated community for the rich and famous who have made it their home.But after years of being seen as a playground for tourists and only a home for the rich, Dubai is now changing. After a boom through its relative infancy, the city has somewhat matured since the Covid-19 pandemic. And those with perhaps less well nourished wallets are uprooting and making the move to the city state.",
        "In recent years, families and young professionals from the UK have flocked to Dubai. While the exact number is unknown, it is estimated that around a quarter-of-a-million Brits now call Dubai their home.And with around four days of rain a year, no income tax, and one of the lowest crime rates in the world, it’s no wonder that so many have flocked to the Emirates' biggest city.Now many schools are reporting increased demand forcing them to put children on waiting lists to wait for spots to open up.Around 90 per cent of Dubai's population is already made up of expats. While foreigners are slightly limited by the property they can purchase, Dubai's ruling family has aimed to present the city as an ideal location for those wanting to be liked to the East and West.In 2022, Dubai's population hit 3.5 million. But the government has set a target of 5.8 million by 2040 as it hopes to continue luring migrants to its year-round sun. This has been made easier by expats no longer needing to find a sponsor to make the move.",
        "Rizwan Sajan, the founder and chairman of Danube Properties, one of Dubai's biggest real estate developers, says his business has had to cope with Dubai's demand in recent years.",
        "Speaking to MailOnline, Sajan said: 'When people come to UAE or Dubai, they don't want to go back to their home country. It's such an addiction that when you come and stay here for one or two years, you will want to stay here.'Dubai has changed like anything over the last decade. Dubai is everyday changing, it's really difficult to keep up with that skyline and what is happening in Dubai.But despite Dubai's increased demand, Sajan was insistent that expats could still come to the city without blowing their budget. 'When you look at Dubai, Dubai is full of glitter, glamour, fashion, lifestyle - people want to enjoy and really feel.'People come to Dubai for extravagance but that they want it at an affordable price,' the developer said.",
        "The developer recently unveiled his plans for the latest construction - a partnership with Europe's FashionTV brand - at an ornate press conference last month. The eponymous 'Fashionz' tower is the latest creation set to open in 2026. The residential tower will have over 700 apartments spread over 65 floors.Sajan describes the new building as a 'ultra-fashionable residential tower that will stand out on its own and be a remarkable addition to the iconic Dubai skyline.' Hoping to continue the trend of luring expats to the city, and to beat his competitors to their business, he said his apartments will start at 850,000 dirhams (around £185,000).",
        "The developer is excited by Dubai's future and says he expects the country's popularity to continue.'Over the next ten years I believe Dubai is going to be the busiest airport in the world. What you see in the infrastructure, we are expanding day by day. Digitally we are going to grow crazy.'Dubai is going to become a very cosmopolitan city. It already is but it is going to take over many other cities in the world."
    ]
}