{
    "articleURL": "/sport/football/article-12057441/DOMINIC-KING-Liverpool-formidable-striker-Darwin-Nunez-despite-recent-struggles.html",
    "content": [
        "Liverpool won their sixth game in a row on Saturday as they beat Brentford 1-0Darwin Nunez struggled in the game, as he missed two golden opportunitiesOnce he finds his rhythm, the Uruguayan forward will be a star at AnfieldDarwin Nunez grimaced and all around Anfield the reaction was as if a decisive penalty had been missed in a shootout.",
        "On the touchline nearest to the tunnel, Curtis Jones — with whom Nunez has struck up a close bond — dropped to the floor and clamped his head in hands. Trent Alexander-Arnold, who had just provided this exquisite chance, looked at the floor in dismay.A few yards away, Ibrahima Konate scrunched up his face in disbelieving agony, while Jurgen Klopp howled and reacted as if he had been told to assume the 'brace, brace' position on an aeroplane. There was a will to see the Uruguayan score but, again, he had not read his lines.Inevitably, there was barracking from the visiting Brentford fans about Nunez being an inferior version of Andy Carroll but the comparisons between the two men begin and end with them having cost Liverpool a lot of money and their shoulder-length hair.Carroll, save for a couple of big days against an embryonic Manchester City team and Everton, never gave the impression that he would flourish for Liverpool nor did he grasp the size of the stage to which he was thrust. He was an emblem of all the club's missteps in the early Fenway Sports era.",
        "Many are watching Nunez and wondering whether he will go the same way. The chance that Nunez squandered in this win — Liverpool's sixth in succession — left you thinking of a young foal trying to work out which leg goes where.",
        "There was another miss shortly after, a failure to connect with his head from Mohamed Salah's quite beautiful ball. Brentford defended superbly and asked plenty of questions of Liverpool, but had Nunez been ruthless, they would have been put to the sword. It has been the story of his season, in many respects, and nine goals wouldn't come near to what many envisaged when Liverpool, who are likely to appoint veteran German Jorg Schmadtke as their new sporting director, invested an initial £64million to sign him.",
        "LIVERPOOL (4-3-3) Alisson 8; Alexander-Arnold 8, Konate 7, Van Dijk 7, Robertson 6.5 (Tsimikas 82min); Gakpo 7, Fabinho 7, Jones 7 (Milner 82); Salah 8.5, Jota 7 (Henderson 73, 6), Nunez 6.5 (Diaz 65, 6).Scorer: Salah 13. Booked: Alisson, Van Dijk, Fabinho, Konate.Manager: Jurgen Klopp 7.BRENTFORD (5-3-2) Raya 6; Hickey 6 (Wissa 88), Jorgensen 7, Pinnock 7, Mee 7, Henry 7.5 (Schade 72, 6); Onyeka 6 (Dasilva 72, 6), Jensen 6 (Baptiste 82), Janelt 6 (Damsgaard 81); Mbeumo 7, Toney 7.Booked: Henry, Mbeumo.Manager: Thomas Frank 6.Referee: Anthony Taylor 6.Attendance: 52,838.",
        "But there is something about Nunez that leaves you certain that next year he will be a starburst in this team, with an explosion of goals to come. Look at his time with Benfica: first season, six goals in 29 appearances in the Primeira Liga. Second season? 26 in 28.",
        "When Nunez finds his rhythm — and starts speaking English with more fluency to understand the finer details of what Klopp wants — Liverpool will have a formidable player on their hands with the potential to join Salah in plundering 30 and beyond.His talent to do this is there for all to see. Klopp hugged Nunez when he took him off in the second half and again at the final whistle. If the 23-year-old is serious about fulfilling his potential, he should look at his manager's back story in terms of improving forwards.Robert Lewandowski, Pierre-Emerick Aubameyang, Sadio Mane, Roberto Firmino and, of course, Salah all went to new heights under Klopp's guidance. Why, then, can't Nunez, with his speed and power and fearlessness, not do something similar?Nunez should be looking at Salah and realising what is possible. To hear Klopp call the Egyptian an 'all-time great' after his scrambled effort secured victory over a Brentford team, who once again demanded you admire them for how well coached and talented they are, struck a chord.Salah, the man they call The King, dominated the post-match discussion. Pre-match, of course, was consumed by the whole avoidable fiasco of the booing of God Save the King; Liverpool fans getting their chance to show dissent to the establishment, and those who don't like Liverpool fans, the city or the club, getting their chance to call them pathetic and disgraceful. ",
        "This mess, do not forget, is firmly on the shoulders of the Premier League. Thank goodness we can now move on.We have spoken about Salah's goals plenty of times since 2017 but the fact he is now in the club's all-time top five is extraordinary — and to think there was an argument that the decision to extend his contract last July was folly.",
        "What makes Salah different is his durability. He has barely missed a game in the last five-and-a-half years, being available for 97 per cent of Liverpool's fixtures since 2017.That, alone, would be worthy of praise but when you put the goals on top, you realise why he is unique.'We shouldn't forget he's playing as a winger, and that's also quite rare to score so many goals in that position,' explained Virgil van Dijk. 'There is so much work that goes in behind the scenes, for Mo in this case. But it goes for a lot of players that nobody really sees.'For him to be fit for 97 per cent of the games, that's maybe the most difficult thing, along with staying consistent. Even when we are struggling he has still found a way to be important for the team. The manager called him an all-time great? I don't think there is anything to argue with that.'"
    ]
}