{
    "articleURL": "/wires/aap/article-12058587/New-Zealand-boosts-defence-force-pay.html",
    "content": [
        "New Zealand will offer its defence personnel bumper pay rises in a bid to stave off attrition and fight cost of living challenges among its troops.",
        "On Monday, Defence Minister Andrew Little revealed an $NZ823 million ($A766 million) package for the country's military in a significant announcement ahead of next week's budget.Half will go to new capital upgrades, including $NZ328 million ($A305 million) towards upgrading assets and $NZ85.5 million ($A80 million) for defence housing.The other half will bolster the pay packets in a bid to avoid more troops walking out the door.Late last year, then-defence minister Peeni Henare called the attrition \"some of the worst rates the defence force has seen in its history\", citing poor earnings.\"They're just looking for other opportunities and I don't begrudge them that,\" he told TVNZ.Mr Little revealed around 10 per cent, or 800 personnel, left the defence force in the last year.\"High rates of staff turnover, as well as increasing calls on the NZDF such as responding to Cyclone Gabrielle, training Ukrainian troops in the UK, and surveillance and patrolling in our region means our forces are stretched,\" he said.\"We have a moral obligation to ensure our soldiers, sailors and aviators are fairly paid for the critical and often dangerous work they do, and the government takes that responsibility seriously on behalf of all New Zealanders.\"Mr Little said most NZDF personnel would see hikes between $4000-$15,000 ($A3725-$13969) that would mean 90 per cent of NZDF were paid \"at, or close to, market rates\".",
        "Prime Minister Chris Hipkins said the announcement was part of a \"no frills\" budget, which Finance Minister Grant Robertson will deliver on May 18.\"Spending is going to where it is needed the most,\" he said.\"One group of New Zealanders whose wages have lagged behind are the dedicated women and men of our defence forces. It's unfair and it's leading to significant rates of attrition.\"It's also putting at risk our ability to make necessary deployments whilst also responding to events such as Cyclone Gabrielle.\"Hundreds of NZDF personnel and assets were sent on clean-up and rescue missions in February in the aftermath of Gabrielle's destruction."
    ]
}