{
    "articleURL": "/health/article-12041221/Breathing-nose-makes-PRETTIER.html",
    "content": [
        "Nasal breathing can trigger physical and mental health benefits, experts sayStudies show it can boost brain function, lower blood pressure and relieve stress'In through the nose, out through the mouth' — that's how the old saying goes.",
        "But switching breathing to solely through the nose can trigger an array of physical and mental health benefits, experts say. The simple act of closing your mouth can make you more attractive, claims Mads Tömörkènyi, a longevity scientist and biomechanics specialist from Denmark.This is because the breathing technique can prevent wonky teeth, 'lazy' looking eyes and an elongated face, he said. And studies show nasal breathing can also boost brain function, lower blood pressure and relieve stress and anxiety.Here, experts explain why nostril breathing is your easy ticket to better health. ",
        "Better lookingMads, founder of fitness brand MT Performance, said: 'The mouth is only designed for breathing when your nasal passage is constricted by a cold or allergies, other than for eating and speaking.' He said nasal breathing can 'change the muscle and tissue structure in the face, which ends up making you look more attractive'.Mads said: 'Mouth breathing overstimulates certain cheek muscles. This can make your face appear longer, your eyes \"lazier\", or even change the shape of your nose.'Mouth breathing that leads to airway constriction causes the mandible [the largest and strongest bone in the face, forming part of the jaw] to become under-stimulated. It shrinks in size, just like the airways do.'The consequence of the jaw shrinking in size is overcrowded and wonky teeth, said Harley Street dentist, Dr Richard Marques.",
        "He said: 'The long-term adaptation of nose breathing will aid the muscles in the face and thus support the position of the jaw and formation of straight teeth.'Prevent bad breathDr Marques said mouth breathing is 'detrimental for the teeth, gums, and overall oral health'.He said: 'Excessive mouth breathing causes the mouth to dry out which can result in chronic bad breath problems.'The gums are also impacted by mouth breathing and can become quite red, swollen, and irritated. As a result, this increases the chance of gum disease.'Mouth breathing can also be a cause of tooth decay and sensitivity as the level of acid that resides in the mouth is increased.'Reduce stressYanar Alkayat, a personal trainer and registered yoga therapist from London, explained that nasal breathing can tackle stress and anxiety.She said: 'The first thing you might notice about breathing through the nose — especially on the out-breath – is that it's easier to slow the breath down. It's physically harder to breathe slowly through the mouth.'The slow out-breath sends signals through the vagus nerve (the longest cranial nerve in the body travelling from your stomach to the brain).'This triggers the parasympathetic nervous system, a network of nerves that relaxes the body after stress or danger, such as by slowing the heart rate.",
        "There are dozens of breathing techniques, including 4-7-8, box breathing, and alternate nostril breathing. Experts warn to start nasal breathing at the easiest level, avoiding anything drastic.Shut the mouthGillian McMichael, a transformational coach and meditation teacher from Edinburgh, said: 'Go back to some basics. When you notice that you're breathing through the mouth at rest, rectify it.'Signs you are a mouth breather include a dry tongue, waking in the morning with a dry mouth and difficulty comfortably breathing through the nose.During the dayGill said: 'I would suggest that people set themselves a target for doing breathing exercises. For example, at breakfast, lunch and dinner, just to see if it makes a difference.'At your deskAlternate nostril breathing, in which you pinch one nostril shut while inhaling or exhaling with the other, is practised in yoga for boosting energy.It's known as nadi shodhana pranayama, which translates to 'subtle energy clearing breathing technique' - a perfect pick-up at your desk.Join meditation or yogaGill said: 'One of the best things to do to help you improve your breathing is learning how to meditate. Join a meditation class online or use one of the many apps.'On a walkMark Hallam, a Melbourne-based personal trainer, said: 'Walking is a great time to practise. Take five to ten steps whilst inhaling through the nose, holding your breath for five to ten steps, and then exhaling for five to ten steps.'As you get better at nasal breathing these numbers can increase.'Between sets in the gymMark said: 'When training, in rest periods from work that isn't particularly high intensity, sit down and focus on box breathing. This is where you inhale for a count of four, hold for a count of four, exhale for four and then hold for another four.'Mads agreed to start nasal breathing only with gentle exercise 'with the lowest possible heart rate' before building up.",
        "'You'll feel an instantly calming effect,' Yanar said.She said studies have shown nasal breathing can increase heart rate variability (HRV).She said: 'The higher your HRV the more balanced your nervous system is. It means you can experience a spike in stress and adrenaline and then recover quickly.'Reduce blood pressureThe same activation of the parasympathetic nervous system via nose breathing can also manage blood pressure, said Gillian McMichael, a transformational coach and meditation teacher from Edinburgh.She said: 'High blood pressure can be caused by a lot of stress and anxiety, among a range of other things. When we are in a high state of alert, such as when we've had a big falling out with someone, we naturally breathe through the mouth.'Simple breathing techniques, such as the \"box method\" have been proven to lower blood pressure if you do it on a regular basis,' she said.The box method involves exhaling to a count of four, holding your lungs empty for four, inhaling at the same pace and holding your breath for four seconds.In one study, participants who were instructed to practise 10 minutes of nostril breathing exercises twice a day, alongside their usual medication, saw a 'statistically significant difference' in their blood pressure after just five days, compared to those who did not.",
        "Better sexThe pelvic floor is a net of muscles that supports organs such as the bladder, vagina and penis.Strengthening it can prevent urinary incontinence and prolapse, and make 'sex better', the NHS says.During pregnancy and childbirth, the pelvic floor muscles can stretch and weaken.Lulu Adams, a pre and postnatal exercise specialist, said: 'Because nasal breathing involves breathing in through a smaller \"space\" than the mouth, it almost forces you to use the diaphragm to breathe, rather than recruiting the accessory breathing muscles in the front of the neck and shoulders.'Better diaphragm engagement positively influences the entire deep core unit, including the pelvic floor.'There's certainly a school of thought that stronger pelvic floor muscles can help you achieve better orgasms.'However, if the pelvic floor muscles are too tight, this can cause pain with penetration.'Improves brain functionWhen breathing through the nose, nitric oxide is released from the body. This molecule acts as a vasodilator, meaning it opens up blood vessels.Lulu said: 'By opening up the blood vessels, particularly in the lungs, nitric oxide allows better circulation (and diffusion) of oxygen throughout the body.'This means more energy is delivered to the body's organs.With brain imaging, the University of Korea showed higher brain activation during a task with nasal breathing compared to oral breathing.",
        "Better workoutsMark Hallam, a Melbourne-based personal trainer, says breathing through your nose, and oxygenating the body efficiently.One small study by Colorado State University showed that with practice, nasal breathing during running can increase oxygen in the bloodstream.This may mean 'you can work for longer at high intensities and recover better between working sets, ultimately getting more done', Mark said.He added: 'People that breathe through their mouth are limiting themselves.'You're not able to train as hard or for as long when you chronically breathe through your mouth. So if you can't train as much, you're always going to limit the results you get.'",
        "Less snoring'Mouth taping' is an increasingly popular tool used during sleep to encourage nose breathing. The approach, which involve sticking tape over the lips to a person cannot easily open their mouth, could prevent snoring, advocates say.It was proven to work in a pilot study of 30 people with mild obstructive sleep apnoea — a condition in which the airways become too narrow during sleep, restricting proper breathing.Those who wore a patch over their mouth snored less.However, the Sleep Foundation says more research is needed and the safety of mouth taping at night is highly debated.Improved immunityDr Sarah Brewer, a GP in Guernsey and Medical Nutritionist at Healthspan, said air goes through a purifying system within the nasal passages, unlike through the mouth.'This helps to help filter out air-borne contaminants such as microbes, pollution, smoke, dust, allergens and bugs.'To do this, the nose is lined with a layer of special cells and tiny hairs called cilia (too small to see). These cells produce sticky mucus to trap dirt and germs, while the cilia beat continuously to clear mucus out of the sinuses towards the back of the nose and throat.'Help asthmaThe symptoms of asthma are known to worsen with exposure to dust, pollen, smoke, pollution and cold air.'Breathing through the mouth results in cool, dry air being drawn into the lungs which can cause airways to narrow,' said Patrick McKeown, author of Close Your Mouth and Asthma-Free Naturally.'Breathing through the nose warms, moistens and filters incoming air and harnesses the gas, nitric oxide, which is anti-viral, anti-bacterial, and helps to open the airways in the lungs.'The Buteyko Breathing Method, which dates back to the 1950s, has been shown in several studies to potentially improve asthma.It involves exhaling slowly, holding that breath for as long as possible and only inhaling when there is moderate discomfort. An Australian study in 1994 revealed participants who followed the technique had 70 per cent less asthma symptoms.Patrick, Clinical Director of Buteyko Clinic International, said: 'There have been about 20 clinical trials investigating the Buteyko method for asthma. Overall results have been positive.'Always talk to your doctor before beginning breathing exercises."
    ]
}