{
    "articleURL": "/wires/reuters/article-12038097/Players-union-warns-agents-mobile-betting-apps-memo.html",
    "content": [
        "By Amy Tennery",
        "NEW YORK, May 2 (Reuters) - The National Football League Players Association (NFLPA) has sounded the alarm about the use of sports betting apps, warning agents that the mobile gambling platforms can track their clients' activity, leading to stiff penalties.The NFL last month suspended five players - including three indefinitely - for violating the league's gambling policy, which prohibits any member of the league from \"engaging in any form of gambling in any club or league facility or venue.\"\"We have confirmed that some states monitor/audit FanDuel and the other gambling apps to ensure that the companies are in compliance with state law,\" the NFLPA said in a memo on Monday seen by Reuters.\"Further the apps monitor gambler activity. It was as part of that monitoring that the NFL learned of the players using the apps at work in violation of NFL rules,\" it said.The NFL announced its first-ever U.S. sportsbook partnerships in April 2021, reaching deals with Caesars Entertainment, DraftKings and FanDuel as the lucrative business of sports betting has become legal in more U.S. states.Sports betting is live in 33 states and Washington, D.C. and is legal but not yet operational in another four, according to the American Gaming Association.But the league maintains a strict code of conduct regarding wagering among players and personnel. In March, Jacksonville Jaguars wide receiver Calvin Ridley was reinstated after serving one year of an indefinite suspension for violating NFL rules on gambling.",
        "\"These apps (like FanDuel) are highly sensitive and very sophisticated at tracking, among other things, user location to be sure that people using the app are not \"prohibited gamblers,\" the NFLPA letter said.\"At no time should players open or use any mobile gambling app while at work.\" (Reporting by Amy Tennery in New York; Editing by Bill Berkrot)"
    ]
}