{
    "articleURL": "/health/article-12059987/Americas-processed-foods-problem-exposed-Chips-TV-dinners-120-ADDITIVES.html",
    "content": [
        "Ultra-processed foods make up more than 70 percent of the US food supplyThese foods could increase the risk of obesity, heart disease, and cancerREAD MORE: Only eat foods with fewer than FIVE ingredientsAt this point, most people know junk food is loaded with added sugar, saturated fat and salt, all of which are bad for us. ",
        "But many may be surprised to find out that some of their favorite indulgent treats have up to 120 ingredients.DailyMail.com found chips, snack mixes, frozen pizza, and microwave meals were among the worst offenders. But even some salad kits had up to 50 additives, including mostly preservatives and added flavors. Mountains of studies show eating too much ultra-processed food dramatically raises the risk of an early death, dementia, and heart disease. Experts say a good rule of thumb is to aim to eat for foods with no more than five ingredients.",
        "Of hundreds of items analyzed by DailyMail.com, Munchies Flamin' Hot Flavored Snack Mix came out worst in terms of additives. An eight-ounce bag - which contains Doritos, Cheetos, Sun Chips, and pretzels - has about 120 ingredients, including a slew of dyes like red 40, yellow 5, yellow 6, and blue 1, some of which contain known cancer-causing compounds. Additives like these are put into many processed foods to enhance their flavor, appearance or help keep them fresh. Red 40 and the two Yellows have both been banned from food products in the UK because they contain benzidine, a human and animal carcinogen permitted in low doses.According to the Food and Drug Administration, ingestion of free benzidine raises the cancer risk to just under the ‘concern’ threshold, or one cancer in 1 million people.",
        "Some states, like California, have pushed to ban additives such as these, though they are largely permitted in the US. While some of the ingredients in Munchies are recognizable, many sound more like scientific elements than food ingredients, such as maltodextrin, ammonium bicarbonate, and disodium guanylate. ",
        "While individual additives have not been extensively studied, eating too many has long been linked to chronic health conditions. A 2022 study published in the journal Neurology found that a 10 percent increase in ultra-processed food consumption could raise the risk of dementia.Additionally, a large cohort study in France would that the same increase in ultra-processed foods led to an increased risk of breast cancer. A global comparative study published in Obesity Reviews showed that an increase in sales per capita of ultra-processed food and drink was associated with higher body mass index (BMI). And a pair of studies from researchers in Spain and France found an association between consuming ultra-processed foods and an increased risk of early death. The Munchies weren't the only food scoring in the triple digits.  ",
        "Jessica Cording, a New Jersey-based registered dietician, told DailyMail.com, that sticking to short ingredient labels with simple-to- pronounce items was a good rule of thumb for healthy eating. ",
        "A single-serve Totino's Party Pizza has about 100 ingredients, including the preservative BHA. ",
        "This common additive is often found in processed foods such as cereals, gum, fast food, and snacks to extend freshness and help prevent spoilage caused by bacteria, mold or other issues.It's also a possible human carcinogen, meaning that it can increase the risk of cancer, according to the International Agency for Research on Cancer. Lean Cuisine, which is generally considered a light and healthy brand for a quick meal, also has dozens of ingredients in some of its meals. The brand's Frozen Chicken Club Panini has 85 items on its ingredients list, including forms of nitrates. On their own, nitrates are harmless. However, bacteria already living in the mouth and enzymes in the body can convert them into nitrites and then to nitrosamines. These have carcinogenic properties.A 2022 study from Northeastern University's Network Science Institute estimated that 73 percent of the United States food supply is ultra-processed. And a study published in Frontiers in Nutrition found that more than 60 percent of US caloric intake comes from these foods. Processing involves adding or altering raw ingredients, such as by storing them in oil or putting sugar or salt into them.Foods like apples are usually exactly how they appear in nature, and are classed as minimally processed.Processed foods, such as apple sauce, have gone through at least one level of processing that has changed their original form.",
        "Ultra-processed foods have gone through multiple levels of processing and are usually full of extra hard-to-pronounce fats, colors and preservatives.'At the very basic level, depending what some of those ingredients are, it is possible that those foods might have protein, they might have fat, and carbohydrates. That does not necessarily mean that the sources of those nutrients are really optimal for supporting health,' Jessica Cording, registered dietitian in New York City and author of The Farewell Tour, told DailyMail.com. '[Ultra-processed foods] tend to be very high in sodium, things like sodium, sugar, refined carbohydrate in general, and unhealthy fats, as well as preservatives,' Ms Cording said.Microwave meals, snack mixes, and ice cream are common examples.But even a Caesar salad kit from Wal-Mart has around 50 additives in it. These could largely be from the dressing and certain add-ons, like croutons. 'People think they're doing something good for themselves because it's salad. They're always hearing that they should be eating more vegetables. But then the issue is what you're putting in that salad,' Ms Cording said. Ms Cording said that to lower these risks, try picking foods that only have a handful of ingredients. 'It's really best to choose foods that have few, if any, of these additives,' Ms Cording said. 'I think ideally, it would be best to recognize what the ingredients are in your food.'"
    ]
}