{
    "articleURL": "/health/article-12047131/Family-girl-given-world-brain-surgery-inside-WOMB-say-shes-thriving.html",
    "content": [
        "Surgeons cured a child's rare, potentially deadly, birth defect while in the wombIt is the first-ever brain surgery performed on an unborn child, experts sayREAD MORE: How risky stem cell transplant cured HIV in many suffering disease A baby girl with a deadly genetic disorder was treated for the condition while inside her mother's womb, in a world-first.",
        "Little Denver Coleman, now two months old, from Baton Rogue, Louisiana, is 'thriving' and is not showing any signs of illness after the 20-minute operation, according to her family.Her mother, Kenyatta Coleman, 36, said it was 'the most beautiful moment being able to hold her, gaze up on her and then hear her cry'- after the child was given a devastating diagnosis while still in utero.Ms Coleman was only weeks away from giving birth to her fourth child when she was told the unborn fetus was suffering from vein of Galen malformation. The condition occurs when the blood vessel that carries blood from the brain to the heart doesn’t develop correctly, putting an overwhelming amount of stress on the body.If young Denver was born with the condition, she had a 50 percent chance of suffering immediate symptoms and a 40 percent chance of dying before her teens. But a pioneering trial at Boston Children's Hospital offered a lifeline.",
        "It was successful, and Denver was born healthy two days later. Ms Coleman describes her daughter as a 'fighter', and says she is currently doing well. 'She's shown us from the very beginning that she was a fighter,' Ms Coleman told CNN. 'She's demonstrated … \"Hey, I wanna be here.\"'The surgery was carried out in March but was documented in a case study published Wednesday in the American Heart Association's journal Stroke. ",
        "'This approach has the potential to mark a paradigm shift in managing vein of Galen malformation,' Dr Darren Orbach, a surgeon at Boston Children's Hospital, said.'We [repaired] the malformation prior to birth and head off the heart failure before it occurs, rather than trying to reverse it after birth.'This may markedly reduce the risk of long-term brain damage, disability or death among these infants.' A 10-man team of doctors used a needle to breach the woman's lower abdomen. Then, using ultrasound to pinpoint the correct spot, they cut into her uterine wall.Surgeons then proceeded to slice into the unborn child's brain and perform surgery to implant a coil near the artery that would restrict blood flow.Ms Coleman says she and her husband Derek, 39, did not suffer any pregnancy complications for the first 30 weeks of pregnancy.",
        "'Baby was doing well. The anatomy scan came back unremarkable. All of her biophysical profiles were all unremarkable,' Ms Coleman said. 'We honestly thought that we were in the clear.'An ultrasound at 30 weeks made a shock discovery, though. The child was experiencing malformed development of the arteries and veins in her brain.Her doctor sat Ms Coleman down and 'she shared with me that something wasn't right in terms of the baby's brain and also her heart was enlarged.'",
        "The child suffered from the disease, which causes blood to quickly drain from an artery in the brain into the veins without going through capillaries.As a result, this leads to the child suffering dangerously high blood pressure and puts them at risk of heart disease and failure of other vital organs. Doctors then introduced the prospective surgery to the woman - a challenging but quick procedure that could save the child from severe complications down the line.",
        "Tannaz Ameli has been declared cancer free after receiving the surgery in June.",
        "The operation required the baby to be flipped inside the womb to get in a position where the procedure could be performed.'So after learning she was in the ideal position, that was confirmation for me [that I was doing the surgery]... there is no backing out of this,' Ms Coleman said.While the surgery, performed 34 weeks and two days into pregnancy, was a success, the mother still feared for her baby's future.'Will she be able to continuously show progress after? Will she need just additional support after I have her? Will she go into immediate heart failure still?' she asked. Two days later, on March 17, Ms Coleman gave birth to Denver Coleman, who weighed 4.2lbs.'I heard her cry for the first time and that just, I – I can't even put into words how I felt at that moment,' she said.",
        "'It was just, you know, the most beautiful moment being able to hold her, gaze up on her and then hear her cry.'The baby's father finally got to meet his new daughter days later in the neonatal intensive care unit.'I gave her a kiss and she was just making little baby noises and stuff,' he said. 'That was all I needed right there.'Now two months later, Denver Coleman is happy and healthy. Scans have found no issues in her circulatory system.Researchers are working with the Food and Drug Administration (FDA) to perform trials on this surgery's safety and effectiveness, hoping to expand use.'The fetal intervention team at Boston Children's Hospital and Brigham and Women's Hospital have successfully devised another in utero procedure that may be very impactful,' Dr Gary Satou, a cardiologist at the University of California, Los Angeles who was not involved in the surgery, said.   Dr Orbach continued: 'We were thrilled to see that the aggressive decline usually seen after birth simply did not appear.''We are pleased to report that at six weeks, the infant is progressing remarkably well, on no medications, eating normally, gaining weight and is back home. 'There are no signs of any negative effects on the brain.'The condition occurs when the circulatory system does not properly form in the pregnancy's first trimester.",
        "The anterior choroidal artery at the brain's center drains blood into capillaries — small blood vessels connecting blocks to the veins. They almost serve as speed bumps, controlling how fast blood moves from arteries into the body's swathing network of veins.However, this system could be disrupted if the veins and capillaries do not properly develop in the womb.In children who suffer from vein of Galen malformation, blood goes straight into the veins, skipping the capillary.This leads to the artery draining blood into the circulation too quickly. In turn, a person's blood pressure will sharply rise as the increase in flow causes more pressure on the rest of the circulatory system.Over time, this can restrict blood flow to the heart, lungs and other vital organs, potentially leading to failure. Increased high blood pressure also dramatically increases the likelihood of suffering heart disease.A 2019 study by French researchers found 36 percent of children with the condition had died by age 11.Current treatment for the malformation includes a brain embolism, where fat is used to restrict blood flow and act as the capillaries do.However, surgeons believe they can act even before the child is born to prevent them from suffering complications while alive.This operation is the first in a clinical trial being performed to gauge whether this surgery is a proper treatment for the condition. Doctors have received FDA approval for their work. ",
        "'As always, a number of these fetal cases will need to be performed and followed in order to establish a clear pattern of improvement in both neurologic and cardiovascular outcomes,' Dr Satou said. 'Thus, the national clinical trial will be crucial in order to achieve adequate data and, hopefully, successful outcomes.' "
    ]
}