{
    "articleURL": "/wires/reuters/article-12040783/U-S-cities-turn-old-garbage-dumps-solar-parks.html",
    "content": [
        "Solar on former dumps could power millions of homes",
        "Nearly 300 landfill solar projects completed to dateNew federal renewables cash prioritizes brownfield sitesBy Carey L. BironANNAPOLIS, Maryland, May 3 (Thomson Reuters Foundation) - R unning low on suitable land for solar power projects, officials in the U.S. city of Annapolis homed in on a spacious site they had long written off as useless - the old municipal garbage dump.The 62-acre (25-hectare) landfill closed in 1993 and \"just sat there as a liability\", said David Jarrell, public works director in Annapolis, the state capital of Maryland.Today, capped and covered with grass, the plot accommodates more than 50,000 solar energy modules with a total capacity of 18 megawatts (MW). The only clue to its past are the venting pipes that poke out of the ground intermittently to release gas emitted by the decomposing waste below.\"We changed a liability into an asset,\" Jarrell told the Thomson Reuters Foundation of the solar park, which is being held up as a model as the U.S. government prepares to release new federal funding for solar development - including on brownfield sites such as landfills.When it was completed in 2018, the Annapolis site was the largest landfill solar project in the country, but it has been overtaken repeatedly since then as cities recognize the potential to turn old landfills into solar parks.",
        "Such projects not only help cities meet ambitious renewable energy targets, but they can also reduce local power bills and generate revenue for city coffers by leasing out idle land.\"It makes (the production of clean energy) tangible for residents, maybe makes it cheaper ... and shows that they're trying to actively reduce their local emissions,\" said Matthew Popkin, a manager with think-tank RMI's U.S. program who leads its Brightfields Accelerator partnership, which helps local governments convert brownfield sites for clean energy use.While the number of solar parks being built on landfills has increased in recent years, there is still huge untapped potential, industry specialists say.There are at least 10,000 disused or closed landfills across the United States - and most are publicly owned, Popkin said.He and his team were able to analyze about 4,300 of those sites and estimated that those alone could produce 63 gigawatts (GW) of electricity - enough to power 7.8 million U.S. homes.FEDERAL FUNDINGRenewables make up more than 21% of U.S. electricity generation, according to U.S. Energy Information Administration data from February, though President Joe Biden has set a goal of creating a power sector that is carbon pollution-free by 2035.Many cities are racing to hit similarly ambitious targets, with shortages of suitable land posing a major challenge in the switch to solar and wind power.",
        "The city of Ann Arbor, Michigan, has a goal of being carbon-neutral and using 100% renewable energy by 2030, but figuring out where to site any major clean power development has been tricky, said Missy Stults, the city's sustainability and innovations director.\"We're pretty built-out. We just don't have large tracts of land that could go for renewables - except for this,\" she said of a plan to build a 20-MW solar project on the city's old landfill.At the moment, there are about 300 solar installations on landfills across the United States, nearly 50 of which have been completed since 2019, a spokesperson for the Environmental Protection Agency (EPA) said.And they are increasing in size.In December, completion was announced on a more than 26-MW landfill project in New Jersey. Others include a nearly 50-MW development in Columbus, Ohio, and a 52-MW park in Houston.Landfill solar is set to get another boost as new federal solar incentives are earmarked for landfills and other industrial areas in \"energy communities\" where the closure of fossil fuel industries has hit the local economy, Popkin said, citing regulatory guidance released in April.RIGHTING LANDFILL WRONGSSuch projects could also help address long-standing grievances over the location of landfill sites, which historically have tended to be built close to Black and other marginalized communities.",
        "One study found that \"race was the most significant factor in siting hazardous waste facilities, and that three out of every five African Americans and Hispanics live in a community housing toxic waste sites,\" according to a U.S. Department of Energy primer on environmental justice.The large New Jersey project, in Mount Olive Township, was built on a so-called Superfund site that had been contaminating local groundwater for years after its operator went bankrupt in the early 1980s, according to the EPA.Superfund sites are contaminated areas that have been officially recognized by the agency and prioritized for cleanup.Not only was the project able to address that pollution by properly sealing the site, but it brought in $2.3 million for the township to fill tax arrears accrued by the site over decades, said Mayor Robert Greenbaum.\"The reclamation of the landfill was a win-win for the township,\" he said.The project is currently the country's largest on a Superfund site, according to project developer CEP Renewables, which has been specializing in solar projects on landfills and other former industrial locations.\"Some of these landfills are capped, covered and maintained properly, but some of these are in total disarray when we get our hands on them,\" said Chris Ichter, the company's executive vice president.",
        "State and federal funding incentives are critical to making such projects financially feasible, he added.\"It's a lot cheaper to go do a project in an open farm field than on a landfill, but it's a lot more beneficial for everyone (on a landfill).\" (Reporting by Carey L. Biron; Editing by Helen Popper. The Thomson Reuters Foundation is the charitable arm of Thomson Reuters. Visit https://www.context.news/)"
    ]
}