{
    "articleURL": "/wires/ap/article-12057409/Deaths-Congo-floods-approach-400-search-continues.html",
    "content": [
        "GOMA, Congo (AP) - The death toll from floods in eastern Congo has almost doubled, reaching close to 400 people as of Sunday, according to a local official.",
        "The administrator of the worst-affected area, the Kalehe territory of South Kivu province, told The Associated Press by phone that more bodies were recovered Sunday, including many found floating in Lake Kivu.Administrator Thomas Bakenge said the confirmed number of dead stood at 394 but it was a provisional count since the search was continuing. More than 300 victims had been buried as of Sunday, local groups said.Torrential rains across Kalehe territory began on Thursday evening. Rivers broke their banks, with flash floods sweeping away the majority of buildings in the villages of Bushushu and Nyamukubi, causing the huge loss of life.Delphin Birimbi, a civic leader in Kalehe, said he understood that thousands of people remained missing. He told the AP that some doctors arrived to treat the injured but communities were pleading for more emergency assistance.The destruction caused by the flooding hampered aid efforts, with two main roads impassable.",
        "More than 170 victims were buried in four mass graves, Valet Chebujongo, a youth political activist helping in the rescue efforts in Kalehe, said by telephone. \"Imagine, you bury them in a mass grave, without a coffin,\" Chebujongo said.The Congolese government declared Monday as a national day of mourning, with flags to fly at half-staff in memory of the victims.",
        "A delegation of government officials and lawmakers sent by Congo's president, Félix Tshisekedi, arrived in Bukavu, a city near the southern part of Lake Kivu and planned to visit the devastated area on Monday, according to a government spokesperson.Heavy rains in recent days have brought misery to thousands in East Africa, including in parts of Uganda and Kenya.Flooding and landslides in Rwanda, which borders Congo, left 129 people dead earlier in the week."
    ]
}