{
    "articleURL": "/wires/reuters/article-12047599/Oil-slightly-smaller-ECB-hike-demand-concerns-linger.html",
    "content": [
        "By Laura Sanicola",
        "May 4 (Reuters) - Oil prices rose on Thursday after the European Central Bank (ECB) decided to slow the pace of its interest rate hikes, but prices were unable to claw back much of this week's more than 9% decline as demand concerns in major consuming countries weighed.Brent futures were up 32 cents, or 0.44%, to $72.65 a barrel by 11:53 a.m. EDT (1553 GMT). U.S. West Texas Intermediate (WTI) crude rose 12 cents, or 0.17%, to $68.72.WTI in early trading on Thursday fell to a session low of $63.64 a barrel, the lowest price since December 2021.Oil prices have plunged this week on concerns about the U.S. economy and signs of weak manufacturing growth in the world's largest oil importer China, sliding further after the U.S. Federal Reserve raised interest rates on Wednesday. That capped near-term economic growth prospects.The market, however, has seen some support from the Fed's signal that it may pause further interest rate increases to give officials time to assess the fallout from recent bank failures and to gain clarity on the dispute over raising the U.S. debt ceiling.The ECB increased its three policy rates by 25 basis points, the smallest hike since the central bank starting lifting them last summer, and kept its options open on future moves as it fights stubbornly high euro zone inflation.",
        "The Organization of the Petroleum Exporting Countries (OPEC) and allies including Russia, a group known as OPEC+, started voluntary output cuts at the beginning of May.Russian Deputy Prime Minister Alexander Novak said on Thursday that Russia was abiding by its voluntary pledge to cut oil output by 500,000 barrels per day (bpd) from February until the end of the year.\"What we're seeing is a combination of economic headwinds and skepticism that OPEC cuts will actually occur,\" said John Kilduff, partner at Again Capital LLC in New York. (Reporting by Laura Sanicola; Additional reporting by Rowena Edwards in London; Sudarshan Varadhan in Singapore and Stephanie Kelly in New York; Editing by Jan Harvey, Mark Potter, Alexander Smith and Paul Simao)"
    ]
}