{
    "articleURL": "/wires/ap/article-12043587/Florida-Republicans-pass-pronoun-diversity-bills.html",
    "content": [
        "TALLAHASSEE, Fla. (AP) - Florida Republicans on Wednesday approved bills to ban diversity programs in colleges and prevent students and teachers from being required to use pronouns that don't correspond to someone's sex, building on top priorities of Republican Gov. Ron DeSantis.",
        "The two proposals were given final passage by the Republican supermajorities in the House and Senate. DeSantis is expected to sign the bills into law.DeSantis, who is expected to announce a presidential campaign in the coming weeks, has driven a hardline conservative agenda as he seeks to bolster support of Republican primary voters ahead of his White House run.The state's Legislative session, scheduled to end this week, has been dominated by divisive cultural issues, with Republican allies of DeSantis approving his priority bills on sexual orientation, gender identity, race and education that are expected to aid the governor in his presidential bid.The Senate on Wednesday voted to expand the law critics call \" Don't Say Gay,\" a major calling card of DeSantis, with a sweeping bill that prevents school staffers or students from being required to refer to people by pronouns that don´t correspond to the person´s sex.It also bans classroom instruction on gender identity and sexual orientation up to the 8th grade, legally reinforcing a DeSantis administration move to prohibit such lessons in all grades. Additionally, the bill strengthens the system in which people can lodge challenges against school books, another DeSantis initiative that has led to the removal of material he and his supporters argue are inappropriate for children.",
        "\"Think about what we´re doing, honestly. Think about how this will affect families that don´t look like yours,\" said Sen. Tracie Davis, a Democrat. \"They're still families. They're Florida families. But we´re treating them like they're outsiders and we´re telling them we don´t want them here.\"Republicans said the bill is intended to shield children from sexualized content and reinforce that teachers should conform to existing state curriculums.\"You see society coming at our children in a culture war that has an agenda to make them confused,\" Republican Sen. Erin Grall said. \"We are depriving children of the ability to figure out who they are when we push an agenda, a sexualized agenda, down onto children.\"Separately, Republicans in the House gave final passage to a DeSantis priority bill that bans colleges from using state or federal funding for diversity, equity and inclusion programs.Such initiatives, sometimes referred to as DEI, have come under increasing criticism from Republicans who argue the programs are racially divisive.Republican lawmakers in at least a dozen states have proposed more than 30 bills this year targeting diversity, equity and inclusion efforts in higher education, an Associated Press analysis found using the bill-tracking software Plural.\"They want rote belief in the same thing. They say they want inclusion, but they don´t unless you believe what they believe,\" said Rep. Randy Fine, a Republican. \"These programs are being used all over the country. Imagine how great our universities will be when we are the only ones who are not.\"",
        "The House also approved a proposal to ban people from entering bathrooms that do not correspond to their sex, a bill aimed at transgender bathroom use.DeSantis is expected to formally announce his presidential candidacy after the end of the legislative session. He has spent significant time in recent months traveling to battleground states and elsewhere to promote his conservative agenda and trumpet his policies on race, gender and education.In the statehouse, Democrats, who have no power to stop the Republican legislation, have increasingly begun to vent over the rightward shift in policy emanating from the GOP.\"The message that resonates from this chamber over the last few years is one of hate and exclusion and punishment,\" said Democratic Sen. Jason Pizzo. \"There is very little grace and very little compassion.\"___Associated Press writer Curt Anderson in St. Petersburg, Florida, contributed to this report."
    ]
}