{
    "articleURL": "/wires/pa/article-12043579/Westwood-Poulter-Garcia-signal-end-Ryder-Cup-careers-resignations.html",
    "content": [
        "Lee Westwood, Ian Poulter and Sergio Garcia have resigned from the DP World Tour and in the process seemingly ended their Ryder Cup careers.",
        "The trio have been stalwarts of Europe’s Ryder Cup squad for the best part of three decades but last summer decided to join the LIV Golf series.A host of other top names were lured to the Saudi Arabia-backed breakaway venture with multi-million dollar deals, huge prize funds and no-cut events.It proved the catalyst for months of wrangling and legal battles and despite Westwood, Poulter and Garcia long ago pledging their allegiances to LIV Golf, only now have they handed in their resignation to the DP World Tour in the latest chapter of the sport’s civil war.Englishman Richard Bland has also resigned from the DP World Tour, but it is the confirmation of Westwood, Poulter and Garcia’s withdrawal that is the final nail in the coffin of their illustrious Ryder Cup careers – as the rules stand they can never be captains or vice-captains either.Westwood remains Europe’s record appearance holder with 11 showings and Garcia the leading all-time points scorer of the competition, while the biennial event always brought out the best of Poulter, but they will now definitely not be involved in September’s latest instalment in Rome.“The DP World Tour today confirmed it has received membership resignations from Sergio Garcia, Ian Poulter, Richard Bland and Lee Westwood who were sanctioned for serious breaches of the Tour’s Conflicting Tournament Regulation committed last June,” a statement read.",
        "“The DP World Tour would like to take this opportunity to thank the four players for the contribution they have made to the Tour and in particular to Sergio, Ian and Lee for the significant part they have played in Europe’s success in the Ryder Cup over many years.“Their resignations, however, along with the sanctions imposed upon them, are a consequence of their own choices.",
        "“As we have consistently maintained throughout the past year, the Tour has a responsibility to its entire membership to administer the member regulations which each player signs up to. These regulations are in place to protect the collective interests of all DP World Tour members.“The independent panel appointed by Sport Resolutions recognised this, determining that our Conflicting Tournament Regulation and its application in the circumstances did not go beyond what was necessary and proportionate to the Tour’s continued operation as a professional golf tour and that we have a legitimate interest in protecting the rights of our full membership by enforcing it.“A further update on other sanctioned members will be provided on Thursday.”Westwood, Poulter, Garcia and Bland were all given sanctions by the DP World Tour for breaking rules by appearing in the LIV Golf series’ opening event in Hemel Hempstead last year without permission."
    ]
}