{
    "articleURL": "/wires/afp/article-12040229/Young-Thai-protesters-hope-game-changer-election.html",
    "content": [
        "Three years ago, Panusaya Sithijirawattanakul was on the front lines of Thailand's democracy movement as thousands of young protesters clashed with police firing teargas and rubber bullets on the streets of Bangkok.",
        "The movement shook the kingdom with its calls for reform and unprecedented demands to curb the power of King Maha Vajiralongkorn but petered out as the coronavirus spread and Panusaya and other leaders were arrested.Many of the young protesters are about to vote for the first time in Thailand's May 14 election. They have not given up their calls for change, even if they know they must be patient in a kingdom where conservative elites have long thwarted reform.Panusaya, better known by her nickname Rung, delivered a speech on monarchy reform in August 2020 that included a 10-point manifesto. It sent shockwaves across Thailand and had her yoyoing in and out of prison.\"This election will be very important. It can change the game,\" said Panusaya, who is preparing to begin a master's degree in political science.\"If the pro-democracy party wins, we have many options to stop the selection of senators, to write a new constitution or to change various laws,\" the 24-year-old told AFP.Millennials and Gen Z -- voters aged roughly 40 or younger -- account for just over 40 percent of Thailand's 52 million-strong electorate.Young Thais might be excited about the prospect of voting Prime Minister Prayut Chan-O-Cha out of office, Panusaya said, but they are also not naive.",
        "Thailand has been hit by a dozen coups since 1932, most recently in 2014, as the military-royalist establishment squashed governments it deemed unsuitable or too progressive.Panusaya recalls the \"heartbreak\" of the 2019 election, when junta leader Prayut managed to cobble together a sprawling coalition to keep out Pheu Thai, the main opposition party that won the most seats.\"Authorities in this country are selfish,\" she said.\"Those who are in power are obsessed with their power. They want to stay in power no matter what the cost.\"- Royal protection -The junta rewrote Thailand's constitution after the last coup to stack the deck in its favour.",
        "To become prime minister, a candidate must now secure a majority across the lower house as well as the Senate, whose 250 members were appointed by the military.Panusaya is not convinced that, against such a backdrop, pro-democracy parties will have the courage to embark on the kind of comprehensive reform the protest movement called for.\"We know that all our expectations will not be met in this election,\" she said.One key demand was reform to Thailand's royal defamation laws, considered to be among the harshest in the world and which human rights groups say are used to crush political dissent.Panusaya faces 12 lese majeste charges, which could see her jailed for up to 180 years, but said the fact that reform of the laws is even being debated is a legacy of the protests.",
        "It is a difficult issue for political parties.Even the leftist Move Forward Party, which had been the sole voice advocating change, appeared to water down its stance in March when it said it was not \"the party's main campaign goal\".- Generational clash -Thailand's royal family is deeply revered and sits at the apex of a hierarchy in which power and wealth are concentrated in the hands of a number of powerful clans.",
        "As well as a political protest, the 2020 movement was also a generational clash pitting better-educated, outward-looking younger Thais against their conservative parents and grandparents.\"My dad was afraid of me being too much involved in politics,\" said Pooripat Buakong, who joined the protests as a high school student.\"He said: 'The government and politics are not for change'.\"The protests encompassed not just party political demands but also calls for LGBT rights and reform to the strict rules imposed in Thai schools.Pooripat, now 20 and studying humanities at a university in Bangkok, said young Thais want a meritocracy -- the opportunity to get a decent education and a well-paying job no matter whether they were born in a rural village or the city.Long gone are the noisy rallies with their three-fingered \"Hunger Games\" salutes and big, bright yellow inflatable ducks that were used to deflect water cannon blasts.",
        "Technology analyst Noppakorn Sakkamart, 24, who was a protest regular in 2020, said the hunger for political change has not curdled into cynicism.\"I don't think the new generations will lose hope and not be voting. I think they will keep fighting,\" Noppakorn told AFP.He expected strong youth support for Move Forward, which rose from the ashes of the Future Forward party that was dissolved by a court in February 2020.Move Forward is challenging Pheu Thai in the polls but Chulalongkorn University political analyst Thitinan Pongsudhirak warned history could repeat itself as powerbrokers try to maintain their rule.\"One nuclear option would be another dissolution of a major party... Pheu Thai or Move Forward Party,\" he told AFP."
    ]
}