{
    "articleURL": "/wires/pa/article-12047861/Donald-Trump-s-return-Doonbeg-quieter-affair-presidential-visit.html",
    "content": [
        "Donald Trump’s flying visit to the west of Ireland was in stark contrast to his last Irish trip in 2019, when he arrived to much fanfare as President of the United States.",
        "That prestigious visit, along with the motorcade and diplomatic aplomb that comes with it, differed a lot from what was billed as a private 24-hour trip.In 2019, the businessman-turned-politician was greeted by Irish premier Leo Varadkar at Shannon Airport before being driven to his hotel, Trump International Golf Links and Hotel in Co Clare.Four years on, a very different visit took place.",
        "While Garda cars, vans and motorcycles patrolled the vicinity around the village of Doonbeg and access to the Trump hotel was locked down ahead of him landing at Shannon Airport, there was no Government representative waiting to greet him.Outside the hotel, a handful of fans appeared in Trump and MAGA garb to welcome his arrival.When Mr Trump arrived at the hotel, he told Irish reporters that he had been “treated well” in Ireland and that his resort had “revitalised” the area.Throughout the ups and downs of Mr Trump’s presidency, locals in Doonbeg village, where he bought a hotel in 2014 for 15 million euro, have maintained their gratitude for his investment that has been a significant source of employment in the rural area.Their thanks was still evident as locals working in the village hoped that Mr Trump, or his son Eric who accompanied him, would come into the village during their 24-hour Irish trip.",
        "Despite the high-profile guest, it was business as usual for locals on Wednesday night: karaoke took place in one bar and a boy came running into another in a karate kit on an otherwise quiet main street.Although several Trump International vans appeared outside the pubs in the village, pricking up journalists’ interest, they invariably picked up other hotel guests and whisked them off quietly.By Thursday, as small US flags fluttered in the wind alongside massive yellow-and-blue Co Clare ones throughout the village, a giant star-spangled banner was seen rolled up in the doorway of the Doonbeg Community Hall.Two Trump fans from Limerick were seen walking through the town, one wearing a green “Make Ireland Great Again” hat and the other wearing a red “USA” hat with “45” on the side of it – a nod to the 45th President of the United States, Donald J Trump.Earlier on Thursday, they had applauded Mr Trump as he played on his golf course and though they were greeted by him when he briefly stopped, they did not get a photograph with him as they had hoped.",
        "Their fierce support is stark against the casual attitude of locals towards the “west Clare hotelier”, as he is sometimes referred to in local papers.",
        "Between the tee and green of the fourth hole at Trump International Doonbeg, a public path runs from the road to the sandy beach on the other side.Several members of the public passed through just before Mr Trump began his round of golf – including joggers, cyclists, and dog walkers.One man with two white dogs with red and blue leads jokingly apologised to photographers for turning up late before heading off on his walk.As he returned, he said that Mr Trump had just teed off, but did not wait around himself to catch a glimpse of his swing."
    ]
}