{
    "articleURL": "/sport/football/article-12050017/Graeme-Souness-tells-Gary-Neville-oversteps-mark-crusades-nobodys-interested-in.html",
    "content": [
        "Souness announced his Sky exit after Liverpool's win over Tottenham on SundayHe has also appeared on William Hill's Up Front with Simon Jordan podcastThe Mail Sport columnist gave his verdict on the pundits he worked with at Sky Graeme Souness has aimed a parting shot at Gary Neville as he delivered his verdict on Sky Sports' leading pundits days after leaving the broadcaster.",
        "The Liverpool and Scotland legend announced his departure from Sky following Liverpool's 4-3 victory over Tottenham at the weekend. During his 15 years with the broadcaster, the fiery pundit was involved in many fierce debates with the likes of Gary Neville, Roy Keane and Jamie Carragher.The 69-year-old, who will continue sharing his views as a columnist for Mail Sport after leaving Sky, appeared as a guest on William Hill's Up Front with Simon Jordan podcast in which he said that Neville can 'overstep the mark' with some of his on-air 'crusades'. Neville has since hit back at the Scotsman, saying that it 'isn't the Souness' he spoke to at Anfield on Sunday.",
        "When asked which fellow pundits he liked during his time at Sky, Souness replied: 'I like Roy Keane, listening to Roy. The Chuckle Brothers (Carragher and Neville) are entertaining.'Well I think Gary Neville and Jamie Carragher can be entertaining. It makes me chuckle anyway.'Jordan in response to Souness said: 'I spend a lot of time [talking about him], not because I want to give him too much substance but because he's a busy b******* anyway. 'I spend a lot of time calling out Neville, calling him the mayor of Manchester, the de-facto mayor of Manchester, the backroom lawyer. Do you think I'm wrong for doing that?'",
        "Souness then admitted: 'I think he fights every cause going. I've got to choose my words (carefully). I think he does overstep the mark with some of these crusades that he goes on.'Because no one's really interested in listening to him with certain subjects.'Neville, tweeting in response to the video posted on William Hill's Twitter account, wrote: 'Are their two Graeme Souness's? That isn't the one I spoke to on Sunday! Jordan is like Boris. Will take everyone down with him.'Carragher meanwhile found the funny side of Souness' comments, posting a GIF of British comedy duo the Chuckle Brothers in response to Neville.  Souness and Neville were involved in many on-air spats, with perhaps the most notable incident this season coming during Sky's broadcast of Liverpool's 7-0 victory over Manchester United.",
        "Before the game, the Scotsman said that he had 'never felt more confident' about a Liverpool victory in a game between the two sides despite the Reds going through a tough season.Keane and Neville could barely contain themselves as they both sported massive grins - but it was Souness who had the last laugh as Liverpool wiped the floor with their rivals to inflict the heaviest defeat in their history.Souness said that after the game that Keane took the defeat 'gracefully', yet claimed Neville insisted that United 'weren't that bad' and Liverpool did not perform well. ",
        "He told Jordan: 'I think Roy was boiling inside but took it gracefully. He knew his team hadn't turned up - they were miserable.'Gary chose to see it that Manchester United weren't that and Liverpool weren't that good.'After the game we're up in the studio and there's four of us, me, Carra, Gary and Roy and in one of the breaks, Gary said \"Well Liverpool weren't very good today\".'And then we went back on air. I challenged him on that. I said \"are you prepared to repeat?\"'I said \"you called me out before the game (over his confidence about a Liverpool victory) and I repeated on-air what I was willing to say off-air, are you willing to do the same?\" And he was reluctant to do it. 'And I have to say I enjoyed that bit of television as much as any television I've worked in the last 20 years. My team beats their biggest rival 7-0.'",
        "Neville has been criticised in the past for delivering political rants during his work as a football pundit.He sparked fury after comparing striking UK workers to migrant labourers in Qatar during ITV's coverage of the World Cup final.He claimed the conditions for striking nurses and railway workers were like those faced by Qatar's huge foreign labour force. The Gulf state has been criticised over allegedly exploitative employment practices and for the number of deaths on construction projects. ",
        "It led to Prime Minister Rishi Sunak telling Neville to stick to football. He also took digs at Boris Johnson after the former PM apologised for attending a party at Downing Street in May 2020 when the country was in a Covid lockdown. Johnson had insisted that he 'believed implicitly that this was a work event'.During a Sky Sports broadcast of Brighton v Crystal Palace in January 2022, Neville began: 'We get these Friday night football matches, Brentford won last time and it was absolutely fantastic.'We always seem just to get a massive party.'Carragher also joined in replying: 'Let's be straight though, this is not a party tonight, this is about work.'Neville also used his ITV commentary role to blast Johnson's 'poor' leadership on the night England beat Denmark to reach the Euro 2020 final.  "
    ]
}