{
    "articleURL": "/wires/reuters/article-12052361/U-S-regional-banks-rally-capping-whipsaw-week.html",
    "content": [
        "By Manya Saini and Chibuike Oguh",
        "May 5 (Reuters) - Shares in PacWest Bancorp jumped nearly 82% amid a broader rebound in U.S. regional banks on Friday after analysts upgraded a number of lenders they said were oversold, though some investors fretted the surge may be short-lived.Investor worries about the health of mid-sized lenders deepened in recent days following the collapse of First Republic Bank and PacWest's announcement that it was exploring strategic options to bolster its finances, which triggered a brutal sell-off.The whiplash in regional banks' shares underscores ongoing investor uncertainty over the health of the sector as market sentiment has started to over-run balance sheet fundamentals.Friday's jump, buoyed by a stronger-than-expected jobs report that lifted Wall Street's main indexes, could be painful for some investors that have bet heavily against regional banks.\"The regional bank group has completely disconnected from the fundamentals during this week´s sell-off,\" Art Hogan, B. Riley Wealth chief market strategist, wrote in a note to investors.JPMorgan analysts, led by Steven Alexopoulos, upgraded their ratings of several regional banks on Friday, including Western Alliance, Comerica and Zion Bancorp, saying that the stocks appear \"substantially mispriced\" after seeing \"intense shorting/selling pressure.\" \"With sentiment very negative and a potential sector re-rating on the horizon, we now move to the middle of the boat and adopt a neutral sector stance,\" the analysts wrote in a note to investors.",
        "Western Alliance and Zion Bancorp gained 49% and 19%, respectively. Comerica Inc rose 17%, Keycorp was up nearly 10%, First Horizon Corp added 9%, and Truist Financial Corp jumped about 10%.The KBW Regional Banking Index, which has plunged about 30% this year, closed nearly 5% higher.RELIEF RALLYBut some investors said the rebound may not signal a long-term shift in sentiment.\"It's more of relief rally just after the dramatic sell-off,\" said Sandy Villere, portfolio manager at Villere &amp;amp; Co in New Orleans, adding the market may also be anticipating some kind of government support for the sector in coming days.Wall Street executives have urged regulators to provide greater protection for bank deposits, arguing only a strong intervention could stop the contagion, although some analysts have said such a move is not immediately likely.\"The most recent movements in bank equity prices are more about general confidence than deposits. That would be a more difficult issue for regulators to address,\" said Citigroup analysts.On Friday, St. Louis Fed President James Bullard reiterated the position of regulators that the banking sector is fundamentally in good shape, telling the Economic Club of Minnesota that regional banks had a \"couple of issues\" but represented a small share of U.S. financial intermediation.",
        "Deposits at small U.S. bank fell slightly to $5.32 trillion in the week ending on April 26th compared with $5.34 trillion in the prior week, Fed datashowedon Friday, indicating that customers retained confidence in mid-sized lenders.U.S. Treasury Secretary Janet Yellen will also tell her Group of Seven counterparts next week that the banking system remains sound, Reutersreportedon Friday.As many as 16 midsized banks have shed more than $57 billion in market capitalization since last Friday, Reuters calculations showed.Short-sellers reaped a combined $430.47 million in paper profits betting against PacWest, Western Alliance, Zion and First Horizon on Thursday, according to data from analytics firm Ortex.\"A shift in momentum could cause a massive short squeeze,\" said Hogan.Regional banks have hit back at short sellers, writing in a letter to Securities and Exchange Commission chair Gary Gensler on Thursday that many such bets did \"not appear to reflect the issuers´ financial status.\" Gensler said on Thursday the agency would probe any manipulative behavior.(Reporting by Manya Saini and Manas Mishra in Bengaluru and Chibuike Oguh in New York; additional reporting by Amruta Khandekar; Editing by Michelle Price, Lance Tupper, Vinay Dwivedi, Jonathan Oatis, Louise Heavens and Deepa Babington)"
    ]
}