{
    "articleURL": "/wires/aap/article-12040307/Dockers-coach-turns-heat-misfiring-midfield.html",
    "content": [
        "Fremantle coach Justin Longmuir has put the heat on his AFL team's misfiring midfield unit as the Dockers attempt to fix to their clearance woes.",
        "The Dockers were smashed in the clearances 46-28 in last week's 48-point loss to Brisbane at the Gabba.Fremantle were also smashed in the clearance battle by St Kilda and North Melbourne in the opening two rounds, and they have lost the crucial contested possession stat in every game this season.With Sean Darcy in the ruck and the likes of Andrew Brayshaw, Caleb Serong, Will Brodie and Jaeger O'Meara at ground level, Fremantle's on-ball division was meant to be a strength.But the Dockers' finals hopes are on thin ice at 2-5 leading into Saturday night's clash with Hawthorn at Optus Stadium, and Longmuir wants his midfield unit to stand tall.\"A lot of our issues are coming down to, especially the last two weeks, clearance,\" Longmuir told reporters on Wednesday.\"The pressure losing clearances puts on your ball movement is quite significant.\"We need to get it right through there.\"We need to start maximising Sean (Darcy's) hitouts and we need to start getting some field position from that source.\"The Dockers have been handball happy all season, but they took it too far against the Lions, registering 194 handballs and 187 kicks.Longmuir was happy with the dare his side showed, but acknowledged they handballed too much.\"We've been putting a lot of work into the mental side of our game and trying to free up our players to play what's in front of them and play with a bit more freedom,\" Longmuir said.",
        "\"We probably saw that come out in over handballing on the weekend, but we keep educating our players to play what's in front of them and try to play with dare.\"We've got a real focus of getting to the outside with our handball - but not overdoing it - and making sure our handball contributes to us getting field position or scoring.\"Fremantle veteran Nat Fyfe is on track to make his playing return this week after getting through Wednesday's main training session unscathed.Fyfe (plantar fasciitis) hasn't played since round one, and Longmuir is yet to decide whether the former skipper will return against the Hawks or through the WAFL.Darcy appears to be under an injury cloud after training away from the main group on Wednesday and leaving the track early.Michael Frederick (groin) is a chance to return, but Heath Chapman will miss a minimum of six to eight weeks with a serious hamstring injury.Longmuir is weighing up the prospect of recalling spearhead Josh Treacy to help beef up the struggling forward line."
    ]
}