{
    "articleURL": "/wires/reuters/article-12058467/Kraken-crush-Stars-2-1-series-lead.html",
    "content": [
        "Matty Beniers, Alex Wennberg, Eeli Tolvanen and Justin Schultz each had a goal and an assist as the Seattle Kraken defeated the visiting Dallas Stars 7-2 Sunday night in Game 3 of their Western Conference semifinal series.",
        "Five different players scored second-period goals for the Kraken, who took a 2-1 lead in the best-of-seven series. Game 4 is Tuesday night in Seattle.Jordan Eberle, Carson Soucy and Yanni Gourde also tallied for Seattle. Goaltender Philipp Grubauer made 24 saves.Mason Marchment and Jani Hakanpaa scored for the Stars, who are 9-17 in best-of-seven series when trailing 2-1. Jake Oettinger stopped 12 of 17 shots through two periods before being relieved by Scott Wedgewood, who made six saves on eight attempts on goal.Seattle took advantage of an injury to Dallas defenseman Miro Heiskanen, who averaged nearly 32 minutes of ice time in the first two games of the series. Heiskanen was hurt on the Kraken's opening goal at 2:10 of the second period and didn't return.The first goal came after Tye Kartye's shot from the high slot deflected off defenseman Ryan Suter's stick and hit Heiskanen in the left cheek. Heiskanen dropped to his knees just outside the crease, with Eberle picking up the loose puck and putting it into the net.Wennberg scored on a wrist shot from the right faceoff circle at 3:36 of the period after Jaden Schwartz took a stretch pass from Vince Dunn.Soucy scored at 6:30, beating Oettinger between the pads.",
        "Beniers made it 4-0 on a wrister from the top of the left faceoff circle at 8:22.Marchment got the Stars on the scoreboard at 12:40 of the second, taking a cross-ice pass from Evgenii Dadonov on a three-on-one rush and beating Grubauer to the near post on a one-timer from the right faceoff circle.Tolvanen scored at 19:21 after Oettinger failed to clear a rebound to make it 5-1 after two periods.Gourde extended Seattle's lead with a short-handed goal 1:49 into the third.Hakanpaa scored on a slap shot from the right point at 7:00.Schultz capped the scoring on the power play at 17:30.--Field Level Media"
    ]
}