{
    "articleURL": "/tvshowbiz/article-12059889/Maya-Jama-puts-racy-display-skimpy-pink-bikini-shares-holiday-photo-album.html",
    "content": [
        "Maya Jama shared her Thailand holiday photo album to social media on Monday.",
        "Taking to Instagram, the presenter posted one snap of herself putting on a racy display in a skimpy pink bikini as she took time to rest and relax.She grinned and looked chilled and carefree, sweeping her raven tresses into a low bun. The television personality opted to go makeup-free, letting her natural beauty shine through.Another image showed her looking ready to hit the beach, donning a cover-up and toting a bag of essentials.  ",
        "Elsewhere, the beauty looked glowing as she pouted in a pink knitted dress and sunglasses, enjoying her stunning surroundings. She wrote a long caption for her post, emphasising the importance of trips like the one she has just taken for her mental health.The star admitted that she likes to work and play hard and does not take care of herself as she should.Maya revealed that she was feeling lucky have had the chance to relax ahead of her next presenting stint on Love Island. It comes after it was revealed that the show's Mallorcan villa is having a facelift ahead of the launch of the next series in a few weeks.The summer version of the dating show will be returning on June 5 according to the Sun, and in preparation for the arrival of more contestants, workers are giving the villa an overhaul.",
        "Updated features in the huge space will include a revamped fire-pit and new decking as well as a different kitchen. It is likely that the new firepit area will add extra drama to the upcoming series as the singletons enjoy parties and endure recouplings. The renovations come after the winter Love Island wrapped on March 13 after beginning on January 16.",
        "A source said of the new series: 'This series will be eight weeks long, meaning the couple who win the show will be in the villa for two months.' It comes after Love Island's Maxwell Samuda  finally spoke out on the real reason he split from girlfriend Olivia Hawkins.The pair coupled-up during this winter's series but left the season just days before the final.They decided to go their separate ways just a few weeks after arriving back in the UK, with some programme fans accusing them of having a showmance.However, Maxwell, 24, insisted they simply drifted apart once they returned from South Africa, where the show was filmed, insisting 'other things' took his attention away from their union."
    ]
}