{
    "articleURL": "/news/article-12053357/Homeowner-faced-squatters-poured-CEMENT-pipes-shares-secret-boot-unwanted-tenants.html",
    "content": [
        "Landlord Sam received a tip on how he could evict illegal occupants in his home and avoid the court system after a local news station shared his story He was told about a Florida statute that allows police to remove them if he signs an affidavit which claims they are squattersNow the homeowner is sharing this tip, which works as long as the squatter is a transient trespasser and not a former renter, to help out other landlords A real estate investor who had issues with squatters who once poured cement down pipes has shared a secret statute to remove them without facing expensive legal battles. ",
        "Florida landlord Sam received a tip on how he could evict illegal occupants in his home and avoid the court system after a local news station shared his story. He was told about a Florida statute that allows police to remove them if he signs an affidavit which claims they are squatters, according to Fox News. Now the homeowner is sharing this tip, which works as long as the squatter is a transient trespasser and not a former renter, to help out other landlords in the area. ",
        "He said he would still be going through the courts to deal with squatters if it wasn't for the local news initiative titled 'Help Me Howard' where he was given the advice. 'I'm more than happy to be the harbinger for other people to be able to find solutions to this kind of terrible, terrible situation that people get into,' Sam, who did not wish to share his last name, told Fox News. 'If I can help even one person, then it's worth it for me.'His rental house was under contract for sale but it was empty while he waited for permits to replace the roof.But when he visited the house on one occasion he noticed the locks were upside down and he started to investigate. ",
        "'Obviously, they were changed, all the locks that we put on are put on properly,' Sam said. 'So right away I realized that, okay, somebody has broken into this home and is probably hanging out there, so I called the police.' He went into the property through the back door and realized the squatters weren't there so he removed their belongings and changed the locks. They began to confront him verbally and physically, according to Sam. He said: 'They started pushing us around, me and my workers and screaming, yelling.'I have no idea who these people are, and I realize that obviously these must be the people squatting.'The police then arrived on the scene and one of the squatters brought out a false lease from her pocket.Sam said:  'She knew what to say to the officers. The fact that she was carrying her lease with her meant to me that she already knew what was going to happen and knew that this is my ticket.'Officers then told him he had to turn the utilities on for the squatters and hand over the key to his house until it was resolved in court.He then spent $1,000 on a retainer for a lawyer and got in touch with local TV show Help Me Howard which provides users with advice to solve their legal issues.",
        "And he received a call from a police sergeant following the first episode. 'He says, \"I heard you're having a problem, tell me what's going on,\"' Sam said. 'So I told him and I said, you know, I've hired an attorney already and he said, \"Stop\".'The officer told Sam squatters can be removed with a signed affidavit if they are a transient trespasser and not a former renter.",
        "He said: 'I was shocked. All you have to do is sign this affidavit that you're the owner and this person is just a transient trespasser and we have the authority and the police department has the authority to take them out.' He had to close his legal case and lost the money he spent on the lawyer's retainer and had to make sure the police had closed their case before this new method could work. But the use of the Florida statute, located in Chapter 82, section 035 in the civil practice and procedure code, was successful and Sam was able to get his home back.He said one of the squatters was 'cursing me out the entire time'. 'As they passed us, they would scream and curse and she said, \"I'm going to find you\" and other horrible things.'The landlord discovered that one of the squatters has faced nine evictions before and in one property she allegedly poured cement down the pipes and caused $150,000 worth of damage. ",
        "The situation cost Sam around $15,000 to repair damage on the walls from the squatters' dogs and plumbing issues from grease being poured down drains.And he lost out on a sale of the property as an interested buyer pulled out.  He added: 'I ended up putting the house back into contract and I actually increased the asking price of the house by $15,000, and I got it.'So I ended up recouping all the money that I had lost.'He pledged to donate 10 per cent of his profits selling the home to charity as he prayed during the stressful situation.Sam donated the money to his synagogue and other charities after the money came in. Other landlords have asked him for help and advice with squatter issues after the second episode of Help Me Howard, which showed Sam's illegal occupant being evicted, aired. He said: 'I try to help. I try to tell everybody pretty much, \"Hey, this is what I did, it's really that simple, and you just have to make sure you get your police department to service it.\"' But Sam said he initially had a problem finding lawyers who knew about the statute and that a lawyer he went to for help at the start contacted him to learn about how solution worked.",
        "'I hope that this will help make landlords and investors more aware of this statute and hopefully encourage new legislation in other states and municipalities,' he said. "
    ]
}