{
    "articleURL": "/wires/ap/article-12045035/AP-News-Brief-12-04-m-EDT.html",
    "content": [
        "Some call NYC subway choking criminal, others hold judgment",
        "NEW YORK (AP) - The choking death of a man at the hands of another New York subway rider was setting off powerful reactions Thursday, with some calling it a criminal, racist act even as authorities reserved judgment on the killing.New York has become one of the nation's safest large cities, but the emotional responses recalled the metropolis of decades ago, when residents felt besieged by crime and fatal vigilantism made national headlines.Manhattan prosecutors promised a \"rigorous\" investigation into whether to bring charges in the death of the Black man, who was tackled by fellow passengers and put in the chokehold by a white Marine veteran.The medical examiner´s office ruled Wednesday night that Jordan Neely, 30, died in a homicide caused by compression of the neck but the office said that any determination about criminal culpability would be left to the legal system.Regardless, many New Yorkers saw the choking as the latest in a long history of attacks on Black city residents.___Official: Gunman kills 3, then self in rural Georgia townA Georgia man shot two of his relatives and a fast food worker dead before killing himself on Thursday in rural south Georgia, the local coroner said.The shooter killed his mother and grandmother at two neighboring homes and killed a woman at a McDonald's restaurant in downtown Moultrie, Colquitt County Coroner C. Verlyn Brock told The Associated Press. He said the gunman then shot himself.",
        "Brock did not provide the identities of the shooter or the victims. He said he did not know whether the gunman and the McDonald's worker knew each other.The Georgia Bureau of Investigation said the Moultrie Police Department requested its assistance, as is typical in major crimes in Georgia.\"We are working to learn more information and track down some additional witnesses,\" GBI Special Agent in Charge Jamy Steinberg wrote in an email.___Proud Boys' Tarrio guilty of Jan. 6 seditious conspiracyWASHINGTON (AP) - Former Proud Boys leader Enrique Tarrio and three other members of the far-right extremist group were convicted Thursday of a plot to attack the U.S. Capitol in a desperate bid to keep Donald Trump in power after the Republican lost the 2020 presidential election.A jury in Washington, D.C., found Tarrio and three lieutenants guilty of seditious conspiracy after hearing from dozens of witnesses over more than three months in one of the most serious cases brought in the stunning attack that unfolded on Jan. 6, 2021, as the world watched on live TV.Jurors cleared a fifth defendant - Dominic Pezzola - of the sedition charge, though he was convicted of other serious felonies. The judge excused the jury without delivering a verdict on some counts - including another conspiracy charge for Pezzola - after jurors failed to reach a unanimous decision.",
        "It´s a significant milestone for the Justice Department, which has now secured seditious conspiracy convictions against the leaders of two major extremist groups prosecutors say were intent on keeping Democratic President Joe Biden out of the White House at all costs. The charge carries a prison sentence of up to 20 years.\"The Justice Department will never stop working to defend the democracy to which all Americans are entitled,\" Attorney General Merrick Garland told reporters after the verdict.___Jury finds Ed Sheeran didn't copy Marvin Gaye classicNEW YORK (AP) - A federal jury in New York concluded Thursday that British singer Ed Sheeran didn't steal key components of Marvin Gaye´s classic 1970s tune \"Let´s Get It On\" when he created his hit song \"Thinking Out Loud,\" prompting Sheeran to joke later that he won't have to follow through on his threat to quit music.The emotions of an epic copyright fight that stretched across most of the last decade spilled out as soon as the seven-person jury revealed its verdict after more than two hours of deliberations.Sheeran briefly dropped his face into his hands in relief before standing to hug his attorney, Ilene Farkas. As jurors left the courtroom, Sheeran smiled at several of them and mouthed the words: \"Thank you.\"",
        "He then spoke for about 10 minutes with plaintiff Kathryn Townsend Griffin, the daughter of Ed Townsend, who co-created the 1973 soul classic with Gaye. They hugged and smiled with each other.Sheeran later addressed reporters outside the courthouse, revisiting his claim made during the trial that he would consider quitting songwriting if he lost the case.___Napoli wins 1st title since Maradona played for the clubROME (AP) - Napoli won its first Italian soccer league title since the days when Diego Maradona played for the club, sealing the trophy with a 1-1 draw at Udinese on Thursday.The \"scudetto\" (championship) set off wild scenes of celebrations throughout Naples, inside the stadium in Udine and beyond.Maradona led Napoli to its only previous Serie A titles in 1987 and 1990.League scoring leader Victor Osimhen equalized for Napoli early in the second half by redirecting in a rebound after Sandi Lovric had put Udinese ahead early on.\"I´m happy for all Napoli fans worldwide,\" Osimhen said. \"No one deserves the scudetto more than Neapolitans - more than us.___Justice Clarence Thomas let GOP donor pay child's tuitionWASHINGTON (AP) - A Republican megadonor paid two years of private school tuition for a child raised by Supreme Court Justice Clarence Thomas, who did not disclose the payments, a lawyer who has represented Thomas and his wife acknowledged Thursday.",
        "The revelation of tuition payments made by Dallas billionaire Harlan Crow is the latest example of Crow's generosity to Thomas and his family that has raised questions about Thomas' ethics and disclosure requirements more generally. The payments, along with the earlier examples of Crow's financial ties to Thomas, were first reported by the nonprofit investigative journalism site ProPublica.ProPublica reported Thursday that Crow paid tuition for Thomas' great-nephew Mark Martin. Thomas and his wife, Virginia, raised Martin from the age of 6.Over the past month, ProPublica has reported in other stories about luxury vacations paid for by Crow that the conservative justice took as well as Crow's purchase of property from the Thomas family, neither of which were disclosed. Democrats have used the revelations to call for stronger ethics rules for the Supreme Court, and the Democrat-controlled Senate held a hearing on ethics issues this week. Republicans have defended Thomas.According to the ProPublica story, Crow paid tuition for Martin at a military boarding school in Virginia, Randolph-Macon Academy, as well as Hidden Lake Academy in Georgia.___Porn industry group sues over Utah age verification lawSALT LAKE CITY (AP) - An adult entertainment industry group filed a lawsuit on Wednesday challenging a new Utah law that requires porn websites to implement age verification mechanisms to block minors from accessing sexually explicit materials.",
        "The law, which took effect Wednesday, made Utah the second state to require adult websites to verify the age of those who want to view their pages - either through an independent contractor or digital ID. Lawmakers likened the requirement to those for alcohol or online gambling and argued that stronger protections were needed to shield kids from pornography, which is ubiquitous online.The Free Speech Coalition - along with an erotica author and companies that manage adult websites and are party to the suit - argues that Utah's new law unfairly discriminates against certain kinds of speech, violates the First Amendment rights of porn providers and intrudes on the privacy of individuals who want to view sexually explicit materials. The plaintiffs have asked a federal judge to bar enforcement of the law until their legal challenge is resolved.They contend that the age verification law \"imposes a content-based restriction on protected speech that requires narrow tailoring to serve a compelling state interest.\"It is currently illegal to show children pornography under federal law, however that law is rarely enforced.___Embattled 1st Black St. Louis prosecutor Kim Gardner resignsST. LOUIS (AP) - Embattled St. Louis Circuit Attorney Kim Gardner, the city's first Black prosecutor and a Democrat, announced Thursday that she will resign, following allegations of negligence and calls for her ouster by Republican leaders.In a letter to Republican Gov. Mike Parson released by Gardner's office, she said she will step aside effective June 1. Parson in a statement said he will immediately begin looking for a replacement and that he is \"committed to finding a candidate who represents the community, values public safety, and can help restore faith in the City´s criminal justice system.\"Republican Attorney General Andrew Bailey took legal steps to remove Gardner from office in February. Bailey said too many cases, including homicides, have gone unpunished under Gardner´s watch, that victims and their families are left uninformed, and that the prosecutor´s office is too slow to take on cases brought by police.Gardner said Bailey´s efforts to remove her were politically and racially motivated. A hearing on whether Gardner should be removed had been scheduled for September.Gardner's resignation letter also cited legislative efforts on a bill that would allow Parson to appoint a special prosecutor to handle violent crimes, effectively removing the bulk of her responsibilities.___Kids and social media: Here are tips for concerned parentsWhen it comes to social media, families are seeking help.With ever-changing algorithms pushing content at children, parents are seeing their kids' mental health suffer, even as platforms like TikTok and Instagram provide connections with friends. Some are questioning whether kids should be on social media at all, and if so, starting at what age.Lawmakers have taken notice. A bipartisan group of senators recently introduced legislation aiming to prohibit all children under the age of 13 from using social media. It would also require permission from a guardian for users under 18 to create an account. It is one of several proposals in Congress seeking to make the internet safer for children and teens.Meanwhile, on Wednesday the Federal Trade Commission said Facebook misled parents and failed to protect the privacy of children using its Messenger Kids app, including misrepresenting the access it provided to app developers to private user data. Now, the FTC is proposing sweeping changes to a privacy order it has with Facebook's parent company Meta that would include prohibiting it from making money from data it collects on children.But making laws and regulating companies takes time. What are parents - and teens - supposed to do in the meantime? Here are some tips on staying safe, communicating and setting limits on social media - for kids as well as their parents.___Carrie Fisher gets her Walk of Fame star, on May the FourthLOS ANGELES (AP) - Carrie Fisher received a star on the Hollywood Walk of Fame on Thursday, a May the Fourth tribute to a beloved \"Star Wars\" actor that had a touch of stardust.The late star´s daughter, Billie Lourd, wearing her mother´s portrait printed on her metallic dress, accepted the star on behalf of Fisher. She threw glitter, her mother's favorite, on the newly unveiled star.\"My mom used to say you weren´t actually famous until you became a Pez dispenser. Well, people eat candy out of her neck every day. I say you aren´t actually famous until you get a star on the Hollywood Walk of Fame,\" she said. \"My mom is a double-whammy - a Pez dispenser and has a star on the Hollywood Walk of Fame now. Mama, you´ve made it.\"Mark Hamill, who played Fisher's space brother, Luke Skywalker, was also on hand, and recalled meeting the young actor when she was just 19.\"She played such a crucial role in my personal and professional life and both would have been far emptier without her. Was she a handful? Was she high-maintenance? No doubt! But everything would have been drabber and less interesting if she hadn´t been the friend that she was,\" Hamill said."
    ]
}