{
    "articleURL": "/wires/pa/article-12058453/Eight-dead-vehicle-strikes-bus-queue-outside-migrant-shelter.html",
    "content": [
        "The death toll from a vehicle hitting a crowd of people waiting for a bus outside a migrant shelter in Texas has risen to eight, police said.",
        "Brownsville police investigator Martin Sandoval confirmed the eighth death, but said police were unsure whether Sunday morning’s collision in the border city was deliberate.",
        "The driver was taken to hospital after the collision, which injured at least 10 others, with police waiting to arrest him.Mr Sandoval said: “It could be intoxication, it could be an accident or it could be intentional. In order for us to find out exactly what happened, we have to eliminate the other two.“He’s being very uncooperative at the hospital, but he will be transported to our city jail as soon as he gets released. Then we’ll fingerprint him and (take a) mug shot, and then we can find his true identity.”Shelter director Victor Maldonado said the SUV ran up the curb, flipped and continued moving for about 200 feet (60 metres). Some people walking on the sidewalk about 30 feet (nine metres) from the main group were also hit – witnesses detaining the driver as he tried to run away.He said most of the victims were Venezuelan men waiting for the bus to return to downtown Brownsville after having spent the night at the overnight shelter.“I’ve had a couple of people come by the gate and tell the security guard that the reason this happened was because of us,” said Mr Maldonado, who said the centre had not received any threats before the crash.",
        "A surge in the number of migrants prompted Brownsville commissioners to indefinitely extend a declaration of emergency on Thursday.“We don’t want them wandering around outside,” city commissioner Pedro Cardenas said after the crash. “So, we’re trying to make sure they’re as comfortable as they can be so they don’t have to go out and look for anywhere else.”Brownsville has long been an epicentre for migration across the US-Mexico border.The Ozanam shelter is the only overnight shelter in the city and manages the release of thousands of migrants from federal custody."
    ]
}