{
    "articleURL": "/tvshowbiz/article-12038889/Christina-Milian-seen-filming-Meet-Christmas-Santa-Claus-set-Toronto.html",
    "content": [
        "Christina Milian, 41, was spotted getting into the holiday spirit on the set of her upcoming movie Meet Me Next Christmas.",
        "The upcoming rom-com will stream on Netflix.It follows the story of her character, Layla, who is looking for romance with the man of her dreams and must race through New York City to get tickets to the sold out Pentatonix Christmas Eve concert.Milian produces as well as acts in the movie, which is her third project for the streamer after 2019's Falling Inn Love and 2021's Resort to Love. In two of the photos, the mom of three can be seen in a long, red dress and black coat running through the streets with a look of determination on her face.   In another snap, The Love Don't Cost a Thing actress cozies up to Santa Claus.",
        "In the fourth snap, the Be Cool star stands in front of a tree decorated for Christmas. The film also stars Devale Ellis, Kofi Siriboe. and Kalen Allen as well as the popular a capella group Pentatonix.The upcoming film is the third holiday-themed movie Milian has starred in.She previously appeared in 2010's Christmas Cupid on Freeform and 2018's Memories of Christmas on the Hallmark Channel.Millian shares daughter Violet Nash, 13, with her ex, rapper The-Dream, along with Isaiah, 3, and Kenna, 2, with her husband, the French singer, Matt Pokora 37. ",
        "In an interview with BET Lifestyle last year, the Bring It On: Fight to the Finish star explained how she and her husband enjoy traveling as often as possible. 'Once a month, we try to travel and]stay at least a day or a day and a half.' 'We don't go too far away from the kids,' she said, 'but we like to do something for ourselves. We need that time to just be adults and not have to worry about anything.'",
        "'Every time we do it, it is always really refreshing. I love to travel and I love spontaneity. Thank goodness he has that in him because it's a good fit for the both of us,' she explained.The Man of the House star also talked about date nights with her husband.'We like going to dinners with friends that have kids because we have somebody to have conversations with, she said. 'We’re together all the time—literally all the time—so it's nice to have somebody else that relates to us. We also get massages together.''Sometimes we go to the movies too. That’s a nice date, but sometimes we fall asleep so I'm just gonna say dinner is better,' she revealed."
    ]
}