{
    "articleURL": "/tvshowbiz/article-12048781/Hailey-Bieber-Lori-Harvey-color-coordinate-sporting-black-white-ensembles-Beverly-Hills.html",
    "content": [
        "Hailey Bieber was seen with her close friend, Lori Harvey, as they stepped out wearing comfy, black and white outfits while enjoying an outing in Beverly Hills on Thursday. ",
        "The Rhode founder, 26 - who was chic running errands in LA earlier Tuesday after choosing to skip the MET Gala for the first time in eight years - strolled through a parking garage with the model, also 26, by her side. The wife of Justin Bieber donned a long-sleeved, black hooded sweatshirt that was zipped up towards the base of her collarbone. She additionally slipped into a pair of black, gym shorts that easily showed off her toned legs. The star completed her casual ensemble for the day by adding white crew socks and white, Nike sneakers that were tightly secured with laces. ",
        "Hailey's short locks were slicked back into a ponytail to prevent any loose strands from falling onto her face. She accessorized her look by adding a flashy, gold-chained necklace along with a pair of dainty, gold-hooped earrings. The model threw on a pair of rectangular-shaped, black shades for a stylish flare and to protect her eyes when stepping out into the bright sunshine. The businesswomen, who recently opened up about her mental health and going through a 'hard time,' opted to not carry any purses or handbags for the outing, and instead simply carried her smartphone in her right hand. Lori also opted for casual comfort wearing a pair of fitted, black and dark gray camouflage leggings and flashed her toned midriff in a long-sleeved, white cropped top. ",
        "The daughter of Steve Harvey slipped into a pair of white sneakers that contained a light blue stripe. The media star slung a sleek, black purse over her left shoulder to hold a few items she needed during the day. Similar to her friend, Lori also threw on a pair of fashionable, black shades. Her locks were slicked back and styled into a tight bun at the back of her head, revealing a pair of small, dangly gold earrings.  ",
        "Hailey was absent from the MET Gala that was held earlier this week on Monday after opting to not attend for the first time in eight years. The star has recently been vocal about having a 'hard time' throughout 2023 in a message she uploaded on Instagram late last month. 'I like to make jokes about how I feel because sometimes it's easier than admitting I'm having a hard time. But truthfully since 2023 started I have had some of the saddest, hardest moments in my adult life and my mind and emotions have been fragile to say the least...' She continued, 'And I know so many other people feel the way I feel, so just know you're not alone.' In conclusion, the Rhode founder added, 'That being said, let's keep being there for one another. Let's be there for loved ones and friends and family and strangers. Let's be there for people...let's keep showing up for each other even when it's hard. We're better together.' ",
        "Not long after the post was uploaded, a source told Us Weekly that Justin Bieber was heartbroken over his wife's situation. 'It breaks Justin’s heart to have seen Hailey struggling emotionally the way she has been these past few months.'  The insider added, 'He loves his wife more than anything and knows she has a heart of gold.' Earlier this year in January, Hailey and Kendall Jenner posted a since-deleted TikTok video as they lip-synced, 'And I’m not saying she deserved it, but I’m saying God’s timing is always right.' ",
        "Fans of Selena Gomez quickly speculated that the lyrics were in reference to the Justin's ex. However, in March, the Only Murders In The Building actress jumped to her Instagram stories to call for peace and broke silence on the drama. 'Hailey Bieber reached out to me and let me know that she has been receiving death threats and such hateful negativity.' 'This isn't what I stand for. No one should have to experience hate or bullying. I've always advocated for kindness and really want this all to stop.' Although Hailey was absent at the star-studded MET Gala this year, she still made her way to the Big Apple and attended the Tiffany &amp; Co. grand re-opening in NYC earlier last week. "
    ]
}