{
    "articleURL": "/news/article-12043995/Trump-says-hes-doing-E-Jean-Carroll-trial-cites-long-standing-commitment-Ireland.html",
    "content": [
        "Trump has been skipping proceedings in Manhattan courthouseE. Jean Carroll's lawyers played infamous 'p****' tape in court WednesdayTrump's team said it won't call the former president or other witnesses Former President Donald Trump expressed confidence in his position in his Manhattan rape trial while touring his golf property in Ireland on Wednesday.",
        "Trump gave the long-distance thumbs up to the performance of his legal team on a day attorney Joe Tacopina told a judge overseeing the trial the defense team would not call any witnesses in the case, and where a new witnesses provided dramatic testimony that could help his accuser.Asked why he was in Ireland instead of attending the trial, Trump responded: 'Because we have a longstanding agreement to come here. We've had a tremendous reception, a beautiful reception.''The people of Ireland have been great and we have tremendous respect. And I hear we're doing very well in New York,' he told Sky News. ",
        "It was his first commentary on how his legal team was faring in the courtroom, although he has blasted the the case as a 'hoax' online and denied magazine writer E. Jean Carroll's accusations against him.Tacopina said the sole witness he had intended to call, an expert witness, wouldn't be there due to a medical problem. Trump's appraisal came on a day when lawyers for Carroll played the infamous 'Access Hollywood' tape, where Trump's comments about grabbing women by their genitals was captured on video.The emergence of the 2005 video rocked Trump's 2016 campaign, but did not stop Trump from reaching the White House.",
        "The court also has heard from two women whose testimony was meant to corroborate Carroll's own statements by speaking of their own experiences with Trump. ",
        "Former People magazine writer Natasha Stoynoff said Trump forcibly kissed her at Mar-a-lago during an interview for a magazine piece.  The story was about the one-year anniversary of his marriage to Melania Trump.Stoynoff cried as she told of the 2005 encounter, where she said Trump pushed her up against a wall and kissed.She testified Trump 'had his hands on my shoulders, pushed me against the wall and started kissing me.''He came toward me again, and I tried to shove him again. He was kissing me and, you know, was against me,' she said. She also said she didn't scream and that 'no words came out of me' – days after Tacopina asked Carroll why she didn't scream during the attack inside a Bergdorf Goodman department store that she alleges happened. Closing arguments could begin Monday, said Judge Lewis A. Kaplan, which could put the case to the jury on Tuesday.Trump earlier played a round of golf at his golf course in Turnberry, Scotland before flying to Ireland, where he got questions about taxation at his Doonbeg course in County Claire.He dodged a question on whether U.S. companies doing business in Ireland should pay taxes in Ireland rather than in the U.S.",
        "'That's an interesting question,' Trump responded. 'But I won't answer that question in your country, but a lot of people would say yes,' he said.'But Ireland has done a great job, you've lured a lot of companies in. And they love it here, they really love it here, they've been treated well just like I've been treated well. This has been a great success,' he said.Earlier, businesswoman Jessica Leeds testified about her allegations that Trump grabbed her on a 1979 flight from Texas to New York while seated in a first class seat.She said in deposition he started 'grabbing me, trying to kiss me, grabbing my breasts, pulling me towards him, pulling himself on me.'Also in New York on Wednesday, a judge tossed out Trump's suit against the New York Times and ordered him to pay attorneys' fees. Trump's filing accused the paper, reporters, and niece Mary Trump of a plot to get his tax returns. "
    ]
}