{
    "articleURL": "/femail/article-12052505/Biographer-Tom-Bower-says-King-Charles-III-cut-Montecito-Royals-off.html",
    "content": [
        "Author Tom Bower says King Charles III should ‘cut Harry and Meghan off’ Read More: King Charles is all smiles ahead of his and Camilla's Coronation How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Tom Bower, author of an insider's account of Revenge: Meghan, Harry and the war between the Windsors, has stated that now is the time for King Charles III to cut his son and daughter-in-law off, once and for all.",
        "Chatting to Jo Elvin on Mail Plus's Palace Confidential, the 76-year-old spoke candidly about how he thinks Charles should handle his youngest son going forward.When asked what his thoughts were on Harry, Meghan and their fractured relationships with his family, Tom said: ‘Well I think King Charles has played it badly, that’s the problem.‘I don’t think he realised the full nature of Meghan’s vindictiveness and her poisonous attitude towards relationships.’He went on: ‘And I think he should have closed her down and shouldn’t have let them give their children titles and all the rest.",
        "‘He’s a father clearly with a conscience that he somehow hasn’t helped Harry in his youth, but now I think it’s up to him to make it absolutely clear that the Montecito Royals are cut off and have absolutely no role whatsoever in Britain.’Harry, 38, and Meghan, 41, moved into their $14 million mansion in Montecito, California, after they stepped back from their royal duties in 2020. The Duke of Sussex jetted in from Los Angeles to UK for the coronation on a commercial American Airlines  on Friday, amid gobsmacked passengers, landing at 11.23am at London Heathrow.He's leaving his wife and two children at home, and is intending to fly back to California straight after the historic ceremony ends this afternoon so he can make it to see Archie on his fourth birthday.",
        " There is speculation he will have no formal role in the service at Westminster Abbey and may even be sat several rows back from his brother William and other working royals.Royal commentators have considered whether he will even be allowed to fit within the processions to the Abbey. They have also suggested that he could face ‘uniform humiliation’ as he may not be allowed to wear his military garb.There was no sign of Harry last night at a family dinner ahead of Charles' big day. Prince Andrew joined his children, the Tindalls, Princess Anne and her husband, the Kents and the Wessexes at Mayfair club Oswald's, which is owned by British entrepreneur Robin Birley.Birley also owns and runs 5 Hertford Street, which is where Prince Harry and Meghan Markle had their first date.Oswald's is the most exclusive of London's private members' clubs, with the Queen Consort and Boris Johnson and his wife Carrie among those who frequent the venue."
    ]
}