{
    "articleURL": "/sport/football/article-12045659/Leeds-sacked-Javi-Gracia-birthday-amid-emotional-scenes.html",
    "content": [
        "Leeds United sacked manager Gracia following a run of five winless matchesSpaniard only took over in February and won just three of 12 games at the helmSam Allardyce has come in to try and steer Leeds away from the bottom three Javi Gracia was fired by Leeds United in a phone call on his birthday after a torrid run of results left them outside the Premier League relegation zone on goal difference alone.",
        "Sunday's miserable 4-1 defeat at Bournemouth proved the Spaniard's final act after just two-and-a-half months and 12 games in the Elland Road hotseat.Leeds also sacked director of football Victor Orta earlier this week, with Sam Allardyce making a shock return to management to try and steer the club to safety.Gracia, 53, said club owner Andrea Radrizzani delivered the news to him personally on Monday afternoon.'It was my birthday, May 1. It was a phone call,' he told The Athletic.",
        "'It was a call to explain the situation. It was all handled correctly by the club. I have to accept the decision from the club's owner and that's it.'Having replaced Jesse Marsch in February, Gracia won his first game in charge at home to Southampton. Leeds also beat Wolves and Nottingham Forest during his tenure as they desperately tried to keep their heads above water.But a second-half collapse in the 5-1 home loss to Crystal Palace on April 9 proved the turning points, with Leeds collecting just one point from a possible 15 since then.The dreadful run of results also included a 6-1 home thrashing by Liverpool, before the 4-1 loss at the Vitality Stadium on Sunday, after which supporters vented their anger Gracia and the players, proved the final straw.",
        "'When we arrived, we were 19th in the table. In my first training session, we had 11 players injured and we trained with 10 healthy outfield players,' Gracia said.'This was not easy. It was only because of the will of the players and exceptional hard work by the medial team, everyone pulling in the same direction. Then we went and beat Southampton.'Bit by bit, we got some players back and the team grew. But the inflexion point was against Palace.",
        "'I had the feeling that the players felt a little like a boxer who had been hit, who is down for a few moments and wants to get up but he is not able to.'It is sure that it transmitted something negative that did not correspond with what I believe my players really are.'Orta was opposed to the decision to sack Gracia, something which hastened his Elland Road departure.",
        "The Athletic reported both Orta and Gracia delivered emotional farewell speeches to the players and coaching staff, some of whom were in tears.Gracia added: 'I can honestly say my time at Leeds has been an enriching experience, and the human qualities of Victor Orta have been an authentic pleasure to be around.'It was one of the places in my career where they have made me feel good and comfortable in myself.'",
        "Meanwhile, a bullish Allardyce claimed he was every bit as good at management as Pep Guardiola, Jurgen Klopp and Mikel Arteta as he set about his mission to rescue Leeds from relegation.His first game is a daunting trip to title-chasing Manchester City on Saturday, before games against Newcastle United, West Ham and Tottenham.The 68-year-old said: 'Far too many people think I am old and antiquated, which is so far from the truth.'I might be 68 and look old but there's nobody ahead of me in football terms. Not Pep, not Klopp, not Arteta. It's all there with me.'They do what they do, I do what I do. But in terms of knowledge and depth of knowledge, I'm up there with them. I'm not saying I'm better than them, but certainly as good as they are.'Guardiola said after City's win over West Ham on Wednesday night: 'He is right. Look at Neil Warnock at Huddersfield, these incredible managers. 'It looks like the young managers know the tactics and whatever, but they are really good. 'They help us be who we are. We created football? No. It was already created.' "
    ]
}