{
    "articleURL": "/wires/pa/article-12042861/Ukraine-denies-Russian-claims-assassination-attempt-Vladimir-Putin.html",
    "content": [
        "Russia has claimed it foiled an attack by Ukrainian drones on the Kremlin, calling it an unsuccessful assassination attempt on Vladimir Putin and promising retaliation for what it termed a “terrorist” act.",
        "Ukraine denied any involvement, saying Moscow could use it for further escalation of the war.The Russian president was not in the Kremlin at the time but was at his Novo-Ogaryovo residence outside Moscow, his spokesman Dmitry Peskov told state news agency RIA Novosti.There was no independent verification of the reported attack on the Kremlin, which Russia authorities said occurred overnight but presented no evidence to support it.Questions also arose as to why it took the Kremlin hours to report the incident and why videos of it surfaced so late in the day.A video posted overnight on a local Moscow news channel, shot from across the river from the Kremlin, appeared to show smoke rising over the buildings. It was not possible to ascertain its veracity.According to text accompanying the footage, residents of a nearby apartment building reported hearing bangs and seeing smoke at around 2.30am.Another video on social media, which looks to have been taken from across Red Square, appears to show the moment a drone explodes in a flash of fire above the roof of the Senate Palace in the Kremlin, near a flagpole flying the Russian flag, with debris falling on the roof. Ukraine has nothing to do with drone attacks on the Kremlin  Mykhailo Podolyak  ",
        "The Kremlin said Russian military and security forces stopped the drones before they could strike, and nobody was hurt. It added that debris from the drones fell in the grounds of the Moscow landmark without damage.Ukrainian President Volodymyr Zelensky denied any role in the attack, saying: “We don’t attack Putin or Moscow. We fight on our territory. We’re defending our villages and cities.” Ukraine presidential adviser Mykhailo Podolyak denied any involvement, saying: “Ukraine has nothing to do with drone attacks on the Kremlin.”He added that the claims would provide a pretext for Russia “to justify massive strikes on Ukrainian cities, on the civilian population, on infrastructure facilities” in coming days.US sources said the Pentagon and intelligence officials are looking into the alleged attack. I would take anything coming out of the Kremlin with a very large shaker of salt  Antony Blinken  Secretary of state Antony Blinken said he had seen the reports but “I can’t in any way validate them. We simply don’t know”.He added: “I would take anything coming out of the Kremlin with a very large shaker of salt. So let’s see. We’ll see what the facts are and it’s really hard to comment or speculate on this without really knowing what the facts are.”",
        "The purported drone attack would be a significant escalation in the 14-month conflict, with Ukraine taking the war to the heart of Russian power.Phillips O’Brien, professor of strategic studies at the University of St Andrews, said: “It certainly wasn’t an attempt to assassinate Putin, because he doesn’t sleep in the roof and he probably never sleeps in the Kremlin.”He added it was too soon to prove or disprove whether it was a Russian attempt “either to make Ukraine look reckless or to buck up Russian public opinion” or if it was a Ukrainian operation to embarrass Russia.The alleged attack immediately prompted calls from pro-Kremlin figures in Russia to assassinate senior leadership in Ukraine.The Kremlin claimed the attack was planned to disrupt Victory Day, which Russia celebrates in Red Square on May 9 to commemorate the defeat of Nazi Germany in the Second World War. Mr Peskov said the parade will take place as scheduled.Shortly before the news about the alleged attack broke, Moscow mayor Sergei Sobyanin issued a ban on using drones in the Russian capital, with an exception for drones launched by authorities.He offered no reason for the ban, saying only that it would prevent the “illegal use of drones that can hinder the work of law enforcement”."
    ]
}