{
    "articleURL": "/tvshowbiz/article-12049851/Amanda-Holden-looks-gorgeous-floral-dress-boards-special-coronation-bus.html",
    "content": [
        "Amanda Holden was interviewing giddy Royal fanatics already lining the streets of London while Sharon Osbourne greeted campers on The Mall ahead of Coronation festivities on Friday - as the stars got ready for the big day. ",
        "Britain's Got Talent judge Amanda, 51, was made Heart FM's prime Coronation correspondent as she was sent through the capital to report on the festivities. She headed to The Mall to greet Royal fans - where an unlikely Sharon, 70, was situated - who had camped out on the tree-lined road connecting Trafalgar Square to Buckingham Palace ahead of King Charles' celebrations on Saturday. She beamed as she posed between fans, who were draped in Union Flags, before she headed back to Global Studios to dress in a Bridgerton-style ensemble as she was marking the release of Netflix's new show Queen Charlotte: A Bridgerton Story. Prior to her visit to The Mall, she boarded a bus to take her to Heart FM ahead of the big day and looked great in a pretty floral dress. ",
        "The collared number featured a spring design and was cinched in at the waist with a belt as she posed up a storm onboard. She completed the look with a pale blue coat and pointed white stilettos while shielding her eyes from the sun.Amanda wore her honey tresses in loose waves over her shoulders and opted for a typically bronzed makeup look. She looked like she was having a great time on the special bus which drove through central London including past Big Ben and Trafalgar Square.",
        "The beauty then stopped to pose at the front of the bus which said 'King's Coronation Special' on the front. As she arrived she was then accompanied by two men in royal fancy dress as she beamed away. Elsewhere Sharon was pictured emerging from a tent after greeting those who were camping to get a good view of the Coronation. Sharon has jetted into the UK for TalkTV's Coronation coverage and will also be joining Vanessa Feltz and a slew of royal experts, including ex-royal butler Paul Burrell, for live coverage of the event on Saturday. A fan shared some snaps of her and wrote in the caption: 'GOOD MORNING! Day Two of the #Coronation Camp-Out is here!'Surrealist moment of last night? Watching Sharon Osbourne filming a segment at 1am and then having her walking about offering up sandwiches and cakes to campers! Thanks for the sarnie, @MrsSOsbourne!' ",
        "The coronation itself will take place in Westminster Abbey on Saturday, with the Coronation Big Lunch and Coronation Concert on Sunday.Members of the public have been encouraged to take part in The Big Help Out on Bank Holiday Monday by volunteering for local organisations.",
        "The first glimpses of the Coronation procession seen during a rehearsal overnight have given an insight into what the pageantry will look like and who will be involved.",
        "The procession returning to Buckingham Palace down The Mall will feature the Gold State Coach. King Charles III and Queen Consort Camilla will sit in it as they are greeted by crowds.It comes after it was revealed last week that Amanda - who has been on the ITV talent show BGT since it started in 2007 - is reportedly considering quitting the UK and moving to the US after visiting the set of America's Got Talent.",
        "The former Wild At Heart star put her five-bedroom Surrey 'dream' house on the market last year for £5million.Now, the Britain's Got Talent judge is considering a move to Hollywood after spending two weeks meeting producers in Los Angeles, according to The Sun.The presenter is judging the current series of BGT, alongside new judge Bruno Tonioli, 67, who has replaced David Walliams after he quit the show last year.It's been claimed that Amanda has visited the set of Simon Cowell's show America's Got Talent and got on well with judges Heidi Klum and Sofia Vergara.Her daughter Lexi, 17, is also said to be considering attending a university in the US and has been looking at studying in LA, Boston or New York.",
        "Amanda shares Lexi and a younger daughter Hollie, 11, with her music producer husband Chris Hughes, who she tied the knot with in 2008.",
        "A source said told The Sun: 'Amanda is seriously contemplating a move to the States. It feels like the time is now.'She spent the school holidays in LA with the whole family, and had a wonderful time.''She even visited the set of America's Got Talent, and sat alongside judges Heidi Klum and Sofia Vergara, the producers absolutely loved her,' they added."
    ]
}