{
    "articleURL": "/sport/formulaone/article-12049189/Motorsport-star-takes-hilarious-shot-Brad-Pitt-prepares-drive-British-F1-Grand-Prix.html",
    "content": [
        "Brad Pitt will make 'F1 debut' in July at Silverstone trackWill be part of a film the Hollywood heartthrob is starring inThe news lit up social media, with many F1 fans in disbeliefMotorsport star Colton Herta has taken a playful swipe at Brad Pitt on social media as the Hollywood heartthrob prepares to take to the track at the British Formula One Grand Prix.",
        "Pitt, 59, will drive a race car at Silverstone from July 7 as he continues filming an F1 movie - and the irony of being beaten to getting a grand prix drive by an unqualified actor didn't go unnoticed by Herta.Last year the American was denied the super-licence that's required to drive in the top tier of motorsport because he didn't have enough points - and he was quick to convey his thoughts on the matter via Twitter.The 23-year-old - who's the youngest ever person to win an IndyCar Series race - attracted interest from the likes of Red Bull and McLaren last year, only to see his F1 dreams dashed.",
        "'Brad Pitt got a super license before me. Tough,' Herta tweeted. News of the movie star being permitted to race on the track during the Grand Prix lit up social media - and it didn't paint Pitt in a positive light.Some Twitter users uploaded footage of previous crashes, bluntly suggesting that F1 circuit driving should be left to the professionals, not A-list actors.It has since been confirmed Pitt will film on-site at the British Grand Prix in July - between the main F1 sessions.Mercedes pin-up boy Lewis Hamilton will also co-produce the yet-to-be titled movie and the F2 car Pitt will be steering has been modified by the seven-time world champion and engineers at his team, Mercedes.",
        "According to news.com.au, F1 CEO Stefano Domenicali believes the filming at Silverstone - where Pitt will play a retired driver on the comeback trail - will be 'invasive'.'We are going to start shooting very soon, and you will see it will be the first movie when basically, they will be within the racing event,' he said.'It's something that we need to control in a way, but it will be another way of showing that F1 never stops.'It is hoped the film, which is being produced by Jerry Bruckheimer, will be received in a similar vein to the immensely popular Drive to Survive series on Netflix."
    ]
}