{
    "articleURL": "/wires/reuters/article-12058283/Hot-teams-collide-Nationals-visit-Giants.html",
    "content": [
        "Rookie right-hander Jake Irvin hopes to get off to a better start in his second major league outing, but he will gladly take the same ending when the Washington Nationals open a three-game road series against the San Francisco Giants on Monday night.",
        "The cross-country pairing pits two teams playing their best baseball of the season, with the Nationals having won four of six and the Giants four of five.Irvin (0-0, 2.08 ERA) contributed to the Nationals' strong run with 4 1/3 innings of two-hit, one-run ball in his major league debut on Wednesday at home against the Chicago Cubs. Washington went on to win the game 2-1.The former fourth-round draft pick had gone 2-2 with a 5.64 ERA in five starts for Triple-A Rochester before earning his promotion, then got a little too amped up for the big event, hitting Nico Hoerner in the shoulder with his first big-league pitch.\"I've got to imagine I'm one of few to do that, right?\" Irvin was able to declare amid a chuckle afterward. \"I can't imagine many other guys have plunked the first guy, first pitch in their debut. So just laugh it off, next hitter.\"The 26-year-old responded by striking out that next man -- Dansby Swanson -- and had little trouble getting 13 outs, after which the game was tied 1-1 in the fifth.A team win was all Irvin needed to have a reason to celebrate by day's end, though.\"This is something that you dream of since the day you pick up a baseball,\" Irvin said. \"I'm on top of the world.\"",
        "The way the Giants have been going, that might be a temporary feeling. After winning its final two games in Houston last week, San Francisco won the first two against visiting Milwaukee before a 7-3 setback in the series finale Sunday.Even in defeat, Giants manager Gabe Kapler saw positives, including 13 hits that constantly had Brewers pitchers in trouble. Alas, the Giants went 3-for-12 with runners in scoring position, stranding 10 runners in the process.\"It's always disappointing when those rallies are cut short,\" Kapler noted. \"We've been able of late to capitalize on some of those and get some big knocks but we weren't able to do that (Sunday).\"Thairo Estrada had two homers among five hits in the Milwaukee series, while Brett Wisely hit safely in all three games. Wisely also hit a homer, scored twice and drove in a pair.Luis Garcia was Washington's big hitter in three games in Arizona -- where the Nationals scored a total of 16 runs the last two days -- before Joey Meneses smacked a go-ahead, three-run homer in the ninth in Sunday's 9-8 win.In the San Francisco opener, the Nationals will be up against righty Anthony DeSclafani (3-1, 2.13), who has won his last two starts, including a 2-0 decision at Houston last Tuesday in which he threw eight innings of shutout ball, allowing just three hits.",
        "The 33-year-old has gone 4-1 with a 2.44 ERA in 10 career appearances (seven starts) against the Nationals. He last faced them in 2021, when, over the course of two games, he threw 15 scoreless innings, allowing just five hits to pick up a pair of wins.--Field Level Media"
    ]
}