{
    "articleURL": "/sport/football/article-12051649/Ruben-Selles-insists-Southampton-DESERVE-beat-Nottingham-Forest-positive-performances.html",
    "content": [
        "Saints are on the verge of relegation from the Premier League after 11 yearsSelles is the club's third manager in what has been a tough season for the clubThey have improved in recent times but are without a win in 10 games nowRuben Selles believes Southampton have deserved more in recent weeks ahead of the must-win clash with Premier League relegation rivals Nottingham Forest.",
        "Saints sit at the foot of the table, six points from safety with four matches remaining.Southampton are without a win since March 4, when they beat Leicester, but they have shown some promise in recent matches against high-flyers Arsenal and Newcastle to give them hope before the trip to the City Ground.'For us right now it is about changing the dynamic of results, try to get that victory that we need and I think we deserve,' Selles said.'We need to find that changing point for us and try to show we are still competitive and can win football matches, and it will be a big plus for us if we can get that on Monday night.'",
        "Saints have mustered just one point in their last six games, which came last month in a 3-3 draw at the Emirates when they conceded two late goals.They are on the verge of relegation from the Premier League, with Selles' side trailing Leeds in 17th place by six points with four games to play.The club will face Fulham, Brighton and Liverpool after their game against Forest, with a relegation set to end their 11-year stay in the country's top divsion. ",
        "Selles believes the responsibility for his team's form lies with both the staff and players.",
        "'No, I will not put this (blame) only on the players. I think we (coaches and players) need to be better on that,' he said.'I think we are a unit and we need to stick together, and when we don't do it it's not only one player or one group of players, it's just us as a team, as a club.'If we're not good enough in the 95, 100, 107 minutes as we did against Arsenal, I think it is for us to find a better strategy, better mindset, situations for the players. So all of us need to put a little bit more on that.'"
    ]
}