{
    "articleURL": "/sport/football/article-12055079/Piers-Morgan-labels-Liverpool-fans-booed-God-Save-King-pathetic.html",
    "content": [
        "The national anthem was widely booed before Liverpool's win over BrentfordIt was played to mark the crowning of King Charles III, but was drowned outPiers Morgan has labelled the fans who failed to observe the anthem 'pathetic'Piers Morgan has labelled Liverpool fans who booed the national anthem on coronation day 'pathetic'.",
        "God Save the King was drowned out by boos and chants at Anfield as it was played ahead of the Reds' 1-0 win over Brentford to mark the crowning of King Charles III and the Queen Consort.The jeering started immediately after the PA announcer confirmed that the national anthem would be played moments before kick-off. Chants of 'Liverpool, Liverpool' and loud boos drowned out the anthem, which could only be heard faintly.Reds skipper Jordan Henderson appeared to sing along with the anthem from the touchline as a substitute, but most players from multiple nationalities decided to keep silent.",
        "Morgan has hit out at the fans who drowned out the anthem with a simple one-word tweet that called them 'pathetic'.After being criticised for his take, he clarified his position by adding: 'Championing free speech doesn’t mean agreeing with everything you hear. 'Liverpool fans are perfectly entitled to boo the anthem on the day of the coronation, just as I’m perfectly entitled to call them pathetic for doing so.'Fans were seen at Anfield with anti-monarchy banners, some of which read 'not my King' in reference to legendary Liverpool forward 'King Kenny' Dalglish, while others stated 'you can stick your royal family up you're a***'Clubs were not obliged to play the anthem before kick off, but the Merseyside club announced they would do so on Friday as they anticipated failing to do so could lead to national backlash.",
        "Liverpool supporters did respect a minute of silence for Queen Elizabeth II following her death last September.But the national anthem had been jeered by some of their fans prior to last season's FA Cup final at Wembley.",
        "As Sportsmail's Dominic King has explained, Liverpool's history of booing the national anthem stems from long-held anti-establishment sentiment within the city and a feeling of disconnect with the British government, rather than a distaste for individual royals.Jurgen Klopp's side followed the anthem controversy with an important if unconvincing 1-0 win over Brentford, as Mohamed Salah scored the only goal of the game after 13 minutes.The goal, Salah's 100th at Anfield and 30th of the season, moved Liverpool within one point of fourth-place Manchester United, although they have played two more games.Klopp's men will next be in action on May 15 when they face relegation-threatened Leicester. "
    ]
}