{
    "articleURL": "/wires/reuters/article-12057419/Cal-Quantrill-flirts-no-hitter-Guardians-blank-Twins.html",
    "content": [
        "Cal Quantrill shook off unusual home struggles this season and returned to form on Sunday, flirting with a no-hitter and pitching the Cleveland Guardians to a 2-0 victory over the visiting Minnesota Twins.",
        "Quantrill had been pretty much a sure thing for the Cleveland Guardians throughout his career when pitching at home until 2023. He had a 15-0 record in 45 appearances at home since joining the Guardians in 2020 before losing his first two home starts this season.But the Quantrill of old returned, and the right-hander had a no-hitter into the seventh inning by inducing 11 ground-ball outs during that stretch, before Alex Kirilloff broke up the gem with two out in the seventh by rifling a single through the infield into right field. Quantrill walked the next hitter, Joey Gallo, but then struck out Jose Miranda to end his outing.The Guardians, who came into the game having scored three runs or fewer in 20 games -- tied for the most in the majors with the Miami Marlins -- needed Quantrill's sterling effort. Cleveland has scored four or more runs only 13 times, including Saturday's 4-3 win against the Twins.But Cleveland opened this game with three straight singles off Minnesota right-hander Joe Ryan, who was leading the major leagues with a 0.77 WHIP entering the game.Jose Ramirez delivered the third of those hits, with his single to right scoring Steven Kwan, then Ramirez later came across to score for a 2-0 lead on Josh Bell's RBI single.",
        "Meanwhile, Quantrill was only in trouble once in the early going, loading the bases in the top of the second by plunking Byron Buxton and walking consecutive batters with nobody out. But he got Miranda to pop out to shortstop, then induced an inning-ending 4-6-3 double play by Nick Gordon, and stomped off the mound pumping his fist.Quantrill (2-2) gave up just the one hit in his seven frames, striking out four and walking three while throwing 58 of 95 pitches for strikes.Ryan (5-1) gave up two runs and eight hits over six innings with four strikeouts without walking a batter.James Karinchak worked around a walk to Christian Vazquez to pitch a scoreless eighth for Cleveland. Guardians closer Emmanuel Clase gave up a walk but otherwise retired the Twins for his MLB-leading 12th save.--Field Level Media"
    ]
}