{
    "articleURL": "/sport/racing/article-12058225/Jockey-David-Tootell-61-emerges-coma-horror-fall-leaves-Aussie-racing-shock.html",
    "content": [
        "David Tootell involved in shocking fall Suffered brain bleeds in the accident Veteran rider's daughter was present Veteran jockey David Tootell has woken up from an induced coma after he was thrown from his mount in shocking scenes during a race in country South Australia on Sunday. ",
        "The 61-year-old hoop was riding the Annette Harder-trained gelding Hardashian in race three at Port Augusta when the horse buckled in the first 100metres - sending Tootell flying over its head.The wily veteran, who also trains as well as rides, was rushed to the Port Augusta Hospital in a critical condition and placed in an induced coma due to 'two small brain bleeds', according to his close mate, Shane Cahill.Fortunately, Tootell, who has ridden more than 800 winners in an industrious career that began in 1986, has since woken up in the Royal Adelaide Hospital.Racing South Australia said in a statement that the veteran was now communicating with family.",
        "'Jockey David Tootell has come out of an induced coma and is communicating with his family following an incident in race three at Port Augusta,' the organisation said in a statement.'He will undergo further scans today. Our thoughts are with the Tootell family at this time.' His daughter Caitlin, an apprentice jockey, was also at the meeting, and stood down from some of her rides following the incident, which left her shaken. The pair went head to head in the first race of the day, where she came second and her father came in fourth.Son David slammed organisers for not updating him or the public on his father's condition in a withering spray. ",
        "'Racing.com and Racing South Australia (are a) disgrace with updates in regards to my father! He's 61, had a heavy fall, in and out of consciousness and laying on the track for long time and nothing,' he said.'I'm 5 hours away and had no clue what was going on until some mates let me know and people at the track.' ",
        "Other fans and racing participants took to social media to find any information they could about Tootell's condition, desperately hoping the popular veteran was okay. 'Thinking of you David,' wrote top ex-jockey Clare Lindop, with the Australian Jockeys Association writing of its relief that he had woken up from his induced coma: 'Fantastic news and wishing David all the best in his recovery.' The incident comes on the same day the devastated racing community will come together to mourn top jockey Dean Holland, who died after a race fall on April 24, leaving behind a wife and four children under the age of five.Thousands are expected to go to the funeral at Flemington Racecourse, as well as a live streaming event at Morphettville in his native South Australia.Tootell, who rode alongside Holland for many years, was left stunned in the wake of the tragedy that racing would go ahead the following day.",
        "'I'm in disbelief the races at Gawler are going ahead. Sometimes there are bigger issues out there, look at the photo attached and try and disagree with me,' he wrote on social media alongside a photo of Holland's four young kids at Geelong Racecourse. Cahill shared a profound thought as he updated everyone on his close mate's condition: 'Another reminder today of how dangerous this job is.' "
    ]
}