{
    "articleURL": "/sport/cricket/article-12050593/Former-Cricket-Australia-chief-DENIES-performing-sex-act-sleeping-male-colleague.html",
    "content": [
        "A former Cricket Australia executive has denied sexual offence allegations Timothy Whittaker is accused of preforming a sex act on a sleeping male staffer Daily Mail Australia provides all the latest international sports news A former executive has strongly denied sex offence allegations as recordings of his police interviews following his arrest were played to court on Friday.",
        "On Christmas Day in 2020, Timothy Whittaker was arrested and interviewed over an allegation he had sexually touched a sleeping colleague after a staff party.The following year another man came forward with a similar allegation dating back to January 2016.Mr Whittaker has strongly denied the allegations and is fighting two charges in a contested hearing before the Melbourne Magistrates' Court.On Friday, the recording of his 2020 police interview was played to the court as Detective Leading Senior Constable Sonja Cameron said he had ignored a request for a second interview.WARNING: GRAPHIC CONTENT BELOW ",
        "In the video, he denied the complainant's version of events that included him waking up in Mr Whittaker's bed after passing out on his couch following a March 2019 end-of-year staff party.It's alleged he had pulled down the man's pants and was 'jerking' his penis.'I wouldn't do something like that ever,' he said.'It's not true and it makes me angry to hear that.'",
        "He told police he woke up about 5.30am as the man left, texting him words to the effect of 'are you OK', saying he was concerned for his welfare.'He rang me and sounded distraught. I said I couldn't understand you and he hung up,' he said.Police allege Mr Whittaker then sent the man several text messages saying: 'You just can't ring me and say that mate.",
        "'Sorry but what the f--k, there's no f--king way I was doing that dude.'Mr Whittaker responded that while the phone call was incomprehensible, he could tell the man was 'accusing me'.He further told police he had hired a defamation lawyer and sent a letter to Cricket Australia after rumours of sexual misconduct got him 'terminated' from later jobs at the International Cricket Council and Australia Post.'I can't help but feel it's vindictive and it's following me ... In terms of having an impact on my employment,' he said in 2020.The hearing, before magistrate Timothy Gattuso, continues. "
    ]
}