{
    "articleURL": "/wires/aap/article-12048815/ANZs-profit-soars-CEO-warns-challenges-ahead.html",
    "content": [
        "Australia and New Zealand Banking Group has delivered a record first-half cash profit but CEO Shayne Elliott has tempered expectations with warnings of intense competition and rising stress from higher interest rates in the coming months.",
        "While the lender benefited from rising rates by expanding margins, it now expects the impact of a rapidly changing environment to be felt across the economy.\"The challenges are very real, the economic cycle is turning, there's going to be more stress in people's budgets, whether in households or in businesses,\" Mr Elliott said on Thursday.He also flagged ongoing turmoil for the banking sector, saying recent developments including the collapse of Credit Suisse and US lenders Silicon Valley Bank and First Republic Bank were not isolated.\"When considering global interest rates, you can't go from zero to 100 in record time and expect limited casualties. While it's easy to dismiss this as happening somewhere else, in a hyper-connected world, what happens elsewhere impacts us faster than ever,\" Mr Elliott said.The Reserve Bank on Tuesday lifted its cash rate 25 basis points to 3.85 per cent, for its 11th increase since May 2022.Investor worries over the likelihood of higher bad debts in the banking sector amid rising rates sparked a sell-off on the ASX on Thursday, although major bank stocks again saw gains on Friday.By 12.15pm AEST, ANZ shares were up 1.2 per cent to $23.75 in a weak Australian market.The stock rebound came after ANZ posted a 23 per cent jump in cash profit to $3.82 billion, largely in line with analyst expectations, with the lender benefiting from strong growth in its home lending and institutional businesses.",
        "Statutory net profit for the six months to March 31 was marginally lower at $3.55 billion, while operating income rose six per cent to $10.14b.Mr Elliott said the result was driven by solid revenue growth across the board.ANZ's institutional division was the strongest performer, posting a 35 per cent jump in revenue and doubling its contribution to the profit.The unit benefited from higher volumes of payments processing and servicing of other financial institutions.The commercial division also lifted revenue 30 per cent while the New Zealand unit's revenue rose 14 per cent along with margin expansion.Revenue at its retail division was up 11 per cent from a year ago, largely on the back of strong home loan volumes.But with the mortgage market continuing to be highly competitive, this likely came at the cost of lower margins.Impaired loans were down 16 per cent, however the bank increased its provisions in light of the increasing economic challenges ahead.ANZ's overall net interest margin - a key measure of its profitability - rose seven basis points from the preceding six months to 1.75 per cent amid a rising rate environment but came in slightly below market expectations.Analysts believe the margins have likely peaked.\"The earnings growth was primarily driven by higher interest rates, with the bank's net interest margin expanding. However, we see limited earnings upside for the second half as competition will limit further margin improvement and the prospect of higher credit charges will constrain profit growth,\" ratings agency Moody's said after the results.",
        "ANZ will pay a fully franked interim dividend of 81 cents per share, compared with 74 cents for the same period a year earlier."
    ]
}