{
    "articleURL": "/wires/reuters/article-12058511/Chinas-yuan-eases-against-dollar-partly-widening-rate-differentials.html",
    "content": [
        "SHANGHAI, May 8 (Reuters) - The yuan weakened against the dollar on Monday, partly due to the differential in Chinese and U.S. interest rates and partly due to concerns that weakness in overseas markets will hamper Chinese exports this year. China's 5-year non-deliverable interest rate swap (NDIRS) rate hit 5-month low last Friday, while the U.S. Treasury yields rose after the strong US jobs data. China nudged banks this month to cut deposit interest rates further, seven people with knowledge of the matter said, in the latest effort to channel the country's vast savings pool into spending and more productive investments. Prior to the market's opening, the People's Bank of China set the midpoint rate at 6.9158 per U.S. dollar, 44 pips weaker than the previous fix 6.9114. Spot yuan opened at 6.9130 per dollar and was changing hands at 6.9153 at midday, 73 pips weaker than the previous late session. Organisers of the Canton Fair, China's biggest trade show, said the value of signed export orders remained lower than pre-pandemic levels, but still exceeded expectations. Analysts at OCBC Bank said the weak demand seen during the trade show reinforced expectations that exporters will face headwinds this year. \"We notice that optimism on the China reopening has been waning since late April, with the simulated China Foreign Exchange Trade System (CFETS) RMB basket index falling to the near year-to-date low of 99.15 level,\" said Ken Cheung Kin Tai, Chief Asian FX Strategist at Mizuho Bank. Market participants will monitor China's April export data coming out tomorrow, and new loan data and inflation print this week for more clues on the pace of economic recovery of the world second-largest economy. If the data points to a positive direction, sentiment toward the yuan could improve, traders said. By midday, the global dollar index fell to 101.174 from the previous close of 101.214. The one-year forward value for the offshore yuan traded at 6.7501 per dollar, indicating a roughly 2.50% appreciation within 12 months. The yuan market at 0300 GMT: ONSHORE SPOT: Item Current Previous Change PBOC midpoint 6.9158 6.9114 -0.06% Spot yuan 6.9153 6.908 -0.11% Divergence from -0.01% midpoint* Spot change YTD -0.22% Spot change since 2005 19.68% revaluation Key indexes: Item Current Previous Change Dollar index 101.174 101.214 0.0 *Divergence of the dollar/yuan exchange rate. Negative number indicates that spot yuan is trading stronger than the midpoint. The People's Bank of China (PBOC) allows the exchange rate to rise or fall 2% from official midpoint rate it sets each morning. OFFSHORE CNH MARKET Instrument Current Difference from onshore Offshore spot yuan 6.9191 -0.05% * Offshore 6.7605 2.30% non-deliverable forwards ** *Premium for offshore spot over onshore **Figure reflects difference from PBOC's official midpoint, since non-deliverable forwards are settled against the midpoint. . (Reporting by Shanghai Newsroom; Editing by Simon Cameron-Moore)"
    ]
}