{
    "articleURL": "/tvshowbiz/article-12057637/CHRISTOPHER-STEVENS-reviews-weekends-TV.html",
    "content": [
        "Antiques Roadshow: Royal Treasures ****",
        "Black Ops ****What do you give the woman who has everything? Really, everything... palaces, dominions, diamonds as big as duck eggs?As a wedding present to Princess Elizabeth in 1947, the people of Australia sent 500 tins of pineapples. Well, rationing was in force, and you can't have a party without pine-apple chunks on cocktail sticks.Sadly, Fiona Bruce didn't discover any leftover tins on the Antiques Roadshow: Royal Treasures (BBC1). But she did find a slab of chocolate in an embossed tin, sold in 1902 to celebrate the coronation of Edward VII.I notice Cadbury's Dairy Milk has produced a coronation bar, by appointment, on sale in supermarkets at £8.50. It won't count as an antique for a few decades, but at that price it had better be an investment. Being a cheapskate, I'll just get a King-size Snickers.All the commemorative ephemera of the coronation fascinates Robert Opie, of the Museum Of Brands off West London's Portobello Road — the street that is the spiritual home of antiques dealers (Paddington's old friend Mr Gruber has a shop there, you'll remember).",
        "Robert brought some of his treasures to show Fiona, including a cardboard box of Shredded Wheat from 1953. On the back was a cut-out coronation coach, which the curator regarded with heartfelt awe. Fiona managed to keep a straight face but you could tell it was a struggle.",
        "He also had a cardboard periscope, as used by people, especially children, to get a better view along the processional route. These were given away by newspapers. They might look odd now, but on Saturday, thousands in the crowds were holding their phones aloft, to film the parade so they could watch it later. That's not so different.Most of this episode consisted of clips from previous shows, highlighting items with royal connections. Perhaps the most surprising was a chunky gold bracelet with a VR monogram, for Victoria Regina, and a curl of the queen's hair in a locket on the back.The bracelet was found lying in the street, and its owner could not be traced — though sleuths who saw the original broadcast identified it as a trinket worn by Victoria's palace companions, the maids of honour, until the death of Prince Albert in 1861. It was valued at £4,000 to £6,000. Quite a thing to find on the pavement.These compilation episodes are always good value, because they feature more discoveries, and any waffle is trimmed out. Devotees will remember some of the segments, of course, but the pacy editing makes up for that.Black Ops (BBC1), a sitcom about two hapless undercover police, is also edited at a cracking pace. Within the first half hour, we saw our incompetent heroes flounder on the beat, get recruited as spies, infiltrate a drugs gang, face death, get rich, face death again and bury a body.",
        "That's eventful, but the comedy also found time for a series of very funny swipes at institutional racism in the Met, and a send-up of the classic drugs drama The Wire.Hammed Animashaun plays Kay, an evangelical Christian who's so well brought up that he can't help telling junkies to 'take care' as he sells them wraps of heroin. 'It's good customer service,' he says, 'so he'll come back.'Gbemisola Ikumelo is his partner Dom, very slightly more streetwise but with the emotional maturity of a 14-year-old.A star cast supplies cameos, including Rufus Jones and Joanna Scanlan as senior officers, and a promised appearance from Zoe Wanamaker later in the series.I'm hooked and I'll come back for more. Must be the customer service."
    ]
}