{
    "articleURL": "/tvshowbiz/article-12049037/How-grinning-Richard-Branson-defeated-bumptious-man-Beeb.html",
    "content": [
        "Amol Rajan Interviews Richard Branson",
        "Rating:Inside No. 9Rating:Never get into a name-dropping contest with Richard Branson. You are bound to lose.Early in his encounter with the Virgin billionaire, bumptious Amol Rajan remarked, 'I've just been to Kenya with Bill Gates, your dear friend.' The subtext was clear: your money doesn't impress me, pal — I know richer people than you.Sir Richard just nodded a tight, gnomic smile and didn't respond, like a politician ignoring a heckler. But Amol's card had been marked.A few minutes later, as the BBC man tried to draw his interviewee on drug use, Keith Richards's name came up.",
        "Branson grinned, praised the Rolling Stones guitarist for his ability to roll the perfect joint, and launched into a sensational story about an escapade at Virgin's Oxfordshire recording studios, the Manor.One morning, awoken by furious knocking, he opened the front door to a man demanding to know if his wife was inside with Keef.",
        "Motherland stars Diane Morgan and Anna Maxwell Martin joined the late Paul O’Grady on For The Love Of Dogs (ITV1), hoping to adopt a pet. Anna knew just which one she wanted: a Staffie owned by comedian Julian Clary. ‘I’ll have to warn him,’ Paul sighed.",
        "Over the man's shoulder, Branson saw the Stone and the woman in question, both stark naked, fleeing across the lawn. ",
        "'They're not here,' he told the angry husband with technical truthfulness, 'but you're welcome to come in and make sure for yourself.' If you're going to drop a name, do it like a megaton bomb and wipe out the opposition.After that, there was little by way of confrontation during Amol Rajan Interviews Richard Branson (BBC2). Any feints were brushed aside, dismissed with another tight little smile. When Rajan asked whether living on the Caribbean island of Necker was convenient for tax purposes, Branson replied, 'Your question, I slightly resent.'He said much the same when asked if he 'winced' at old photos of himself with girls in bikinis. The question was resented, and thus didn't require an answer — though he did add that, 'I don't think I ever made anybody feel uncomfortable.'Branson was more forthcoming about his dismal experiences at boarding school, producing reports that described him as 'handicapped', 'backward' and 'stupid'. In fact, he had undiagnosed dyslexia, which he now describes as his superpower. Certainly, most of us would like to be 'stupid' enough to own an island and a space rocket.Though he has always loved his publicity stunts, Branson has rarely opened himself up to inquisition. The purpose of this one gradually became apparent as he talked about the effects of lockdown on his businesses. ",
        "'We had 50, 60 planes all on the ground. There was a time when I thought we were going to lose everything.'He saved his companies, at a personal cost of £1.5 billion, but public criticism was harsh when the Virgin Group asked for a £500 million bailout, which was refused. This interview appeared to be his attempt to restore some lustre to his reputation.The occasion ended with Branson trouncing Rajan at chess. That was superfluous — the man from Auntie had already been roundly defeated.Inside No. 9 (BBC2), the comic playlets written by stars Reece Shearsmith and Steve Pemberton, are also becoming superfluous. Once packed with imagina-tion and dark invention, the series is now running out of steam.",
        "The only purpose of the latest episode was to invent a story around the word 'paraskevidekatriaphobia,' a mouthful coined to describe the superstitious fear of Friday 13th.Co-starring Amanda Abbington and Samantha Spiro, with a cameo from Dermot O'Leary, it featured a couple of false twists, like a parody of Roald Dahl's Tales Of The Unexpected in the 1980s.The best joke was Dermot's reaction when he was mistaken for half of Ant and Dec. He gave a tight, humourless smile — just like Branson."
    ]
}