{
    "articleURL": "/wires/ap/article-12047991/Correa-takes-cheater-comment-Middleton-stride.html",
    "content": [
        "CHICAGO (AP) - Carlos Correa took a postgame dig about his past in stride.",
        "A day after White Sox reliever Keynan Middleton struck out Correa to end the game, then called him a cheater after he earned his first save of the season, the two-time All-Star shortstop refused to take the bait.\"I´ve heard worse,\" Correa told reporters before Thursday´s series finale. \"I´m just glad he´s doing good and he´s playing good and he can take care of his family.\"Obviously, he´s tough. He´s getting better and that´s why he´s pitching high-leverage situations for them.\"Middleton played his first five big-league seasons in the AL West, competing against Correa and the Astros.He seemed to relish the chance to face him with a game on the line.",
        "\"I knew I was going to face Correa, and I don´t like him. So it was kind of cool,\" he said after delivering a strikeout with a 96.2 mph fastball to finish off the White Sox's 6-4 win. \"I like that. I enjoyed that a lot. ... I mean, he´s a cheater.\"Houston was disciplined by Major League Baseball after it was found the team used electronics to steal signs during its run to the 2017 world championship and again in the 2018 season.MLB´s investigation determined Houston used a video feed from a center-field camera to see and decode the opposing catcher´s signs during home games. Players banged on a trash can to signal to batters what was coming, believing it would improve their odds of getting a hit.",
        "Then-manager A.J. Hinch was suspended and fired in the fallout, but no players were punished after Commissioner Rob Manfred granted them immunity as part of the league´s investigation.Correa and other members of the Astros who´ve moved on to other teams since the investigation are frequent targets of boos from fans at opposing ballparks.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}