{
    "articleURL": "/tvshowbiz/article-12055317/Machine-Gun-Kelly-returns-rap-diss-Jack-Harlow-ferocious-new-freestyle.html",
    "content": [
        "Machine Gun Kelly made a ferocious return to rap on Saturday when he posted a brand-new freestyle on YouTube and seemingly dissed Jack Harlow. ",
        "The Bloody Valentine hitmaker, 33 – who recently flew solo at the Bupkis premiere without his fiancee Megan Fox – appeared to take a direct shot at Harlow's bold claim that he is the greatest white rapper after Eminem.Kelly proved his talent by rapping over the instrumental from Jay-Z's 2001 hit track Renegade, which just so happens to feature Eminem.  Recording in the backyard of his 'homie,' MGK wove innuendo through all of his lyrics: 'Make sure there's no confusion / I'm a great white, I can eat their barracudas.'His freestyle quickly gained steam, becoming more brazen with each bar and blasting Harlow's new album Jackman: 'I see why they call you Jackman / You jack man's whole swag / Give Drake his flow back man.'",
        "MGK's fiery freestyle comes after his rival lit the fuse with his newly released album Jackman.In the track titled They Don't Love It, Harlow calls himself 'the hardest white boy since the one who rapped about vomit and sweaters' — referencing Eminem's famous line in Lose Yourself.The 25-year-old rapper then goes on to drop bars about how he outdoes his competition without naming any names.The subsequent lines heard Harlow listing all the reasons he believes he deserves the silver medal for best white rapper behind Eminem – the self-proclaimed Rap God.",
        "'And hold the comments 'cause I promise you I'm honestly better than whoever came to your head right then,' Harlow rapped as he dissed his adversaries lyrically.'They ain't cut from the same thread like him,' he continued. 'They don't study, doin' work to get ahead like him.'They don't toss and turn in the f***in' bed like him, 'cause they don't love it,' the lyrics went.Last month, Harlow released his self-titled third studio album, Jackman, and he is currently gearing up to make his feature film debut next month in the Hulu remake of White Men Can't Jump. ",
        "Jack entering the acting game means that he will be competing with MGK on yet another front, as Kelly has repeatedly tried to establish himself as a serious film actor and Hollywood star.This effort has largely failed thus far, with MGK appearing in a string of box office bombs that include the abysmal Midnight in the Switchgrass and the disastrous Good Mourning. He has been much more successful on the music front, rocketing to the top of the charts with his pop-punk albums Tickets to My Downfall (2020) and Mainstream Sellout (2022).Perhaps this latest freestyle is a sign that MGK plans on returning to his rapper roots to claim the crown of 'greatest white rapper' after Eminem – who he has also feuded with in the past. "
    ]
}