{
    "articleURL": "/tvshowbiz/article-12049689/Rihanna-looks-stunning-white-bomber-jacket-distressed-miniskirt-solo-night-NYC.html",
    "content": [
        "Rihanna looked stunning as she stepped out in New York City on Thursday evening.",
        "The 35-year-old songstress put on a stylish display in a white bomber jacket and a matching miniskirt, both purposefully distressed with a paint splatter design, for her night out on the town.The Anti hitmaker rocked a pair of slouchy, white knee-high boots to go with her eye-catching look.The Fenty Beauty founder also modelled a bold, red lip to coordinate with the New York Yankees logo emblazoned across the torso in a bright red color.The entrepreneur  appeared to be enjoying a solo night out without the father of her children after she took the Met Gala by storm baring her baby bump in a sultry ensemble for a romantic date night with A$AP Rocky, 34. ",
        "After enjoying dinner, the billionaire mogul was spotted walking to her car and with her baby bump bundled up.The Ocean's 8 actress accessorized with a red watch adorned with sparkling diamonds and eye-catching, dangling earrings. She was also seen toting around a small purse in white leather and silver hardware.For makeup, she looked glamorous in a brown smokey eye teamed with a sharp winged liner look.She appeared radiant and naturally flushed with a subtle wash of pink blush across her cheeks as well as a deep red, glossy lip. Her jet black tresses were styled in a polished and chic updo with bombshell curls. ",
        "Later, RIhanna was also photographed with her best friend since childhood, Melissa Forde — who looked sensational in a bright green trench coat over a white button-up top and a silver wrap skirt. Meanwhile A$AP joined Lewis Hamilton in the Paddock ahead of the F1 Grand Prix of Miami. ",
        "The rapper, 34, was all smiles as he crouched down and posed with the British racing driving in front of one of the cars. He cut a casual figure in a crisp white top and jeans while the athlete an eye catching blue co-ord.  Previously, Rihanna revealed she and Rocky are expecting their second child by showcasing her baby bump at her Super Bowl halftime show in February.Last month, she was seen shopping for baby clothes and sparked rumors on the gender of her soon-to-come child based on the color of her choices. The happy couple welcomed their first child — their baby son — last May. The pair have not yet revealed the name of their son — who will soon turn one later this month.The expecting parents first began dating in 2020 after years of friendship and musical collaboration. Before starting a romantic relationship, Rihanna and Rocky have been longtime and close friends since he joined her Diamonds World Tour in 2013.",
        "That year, Rihanna also starred in his music video for his song Fashion Killa from his Long. Live. ASAP album."
    ]
}