{
    "articleURL": "/sport/boxing/article-12054277/Tyson-Fury-opens-talks-Joe-Joyces-conqueror-Zhilei-Zhang-WBC-heavyweight-title-fight.html",
    "content": [
        "The Chinese boxer, 40, beat Joyce after the Brit suffered a serious eye injury Fury looked nailed on to take on the Ukrainian, but the two camps walked awayHis US promoter said 'We're focusing on the Chinese kid that beat Joe Joyce'Tyson Fury has reportedly opened talks with Joe Joyce's conqueror Zhilei Zhang over a WBC heavyweight title fight.",
        "The Chinese boxer, 40, beat Joyce by sixth round technical knockout after the Brit suffered a serious eye injury.Zhang earned the WBO interim heavyweight title by beating Joyce, who had previously been unbeaten as a professional.The title makes Zhang the WBO's mandatory challenger to Oleksandr Usyk, although the Ukrainian is first expected to face Britain's Daniel Dubois.Fury's US promoter Bob Arum told Ringside Reporter: 'No not really [Andy Ruiz]. We're focusing on the Chinese kid that beat Joe Joyce, Zhilei Zhang, he's the frontrunner for that fight.",
        "'It's likely for July, we're trying to close that out over this weekend.''I like to challenge the strongest,' Zhang said in a recent interview. 'As I said before the fight, only by defeating the strongest can one become stronger. 'And now, people probably think that I am not strong enough, because there are real boxing champions above me, like Tyson Fury and Anthony Joshua.He added: 'Although Joshua is not a champion now, he has mastered the sport and has ruled for many years.'They're all strong fighters. So I want to challenge any of them. In this way, I can gradually become stronger. 'I will show everyone, show to the world, to all boxing fans, Chinese power.'The Gypsy King looked nailed on to take on the Ukrainian in what would have been the first undisputed showdown since Lennox Lewis against Evander Holyfield in 1999, with Usyk even agreeing to concede a 70/30 split in Fury's favour.",
        "But with neither team able to put pen to paper on the finer details of the contract - including terms about the rematch clause - the two camps walked away, leaving Fury's schedule fully open for his next fight."
    ]
}