{
    "articleURL": "/wires/pa/article-12056471/Head-anti-monarchy-protesters-says-arrests-direct-attack-democracy.html",
    "content": [
        "The head of an anti-monarchy group arrested ahead of a planned protest on Coronation Day has branded the detention of him and dozens of others a “direct attack on our democracy”.",
        "Republic chief executive Graham Smith, who was released on Saturday night after nearly 16 hours in police custody, said officers should “hang their heads in shame”.",
        "The Metropolitan Police confirmed that 52 people were arrested for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance around the coronation.Mayor of London Sadiq Khan said he had demanded “clarity” from the force’s leaders on the arrests.He tweeted: “Some of the arrests made by police as part of the Coronation event raise questions and whilst investigations are ongoing, I’ve sought urgent clarity from Met leaders on the action taken.”Mr Smith said a total of eight members of Republic’s team were arrested as they prepared for “a peaceful and lawful protest”.He told the PA news agency officers had been “intimidating, heavy-handed, not willing to listen, not willing to co-operate or to engage”.He added: “They clearly made up their mind they were going to arrest us the moment we got there.”They were arrested for being equipped for locking on, a new offence under the controversial Public Order Act.In a statement, Mr Smith said: “These arrests are a direct attack on our democracy and the fundamental rights of every person in the country.“Each and every police officer involved on the ground should hang their heads in shame.”",
        "He said the right to protest peacefully in the UK “no longer exists” and that the detentions “destroyed whatever trust might have existed” between campaign groups and the police.",
        "Asked what further action he and other members of Republic face, Mr Smith told PA: “We don’t know. We’ve all been bailed, that’s all we know. So, we will hear about whatever happens later.”Culture Secretary Lucy Frazer argued that police got the “balance right” between allowing protest and enjoyment of the King’s coronation.She defended the Met after the force was heavily criticised by MPs and human rights groups over the arrests, denying that officers had gone too far.The Cabinet minister told Sky News’ Sophy Ridge On Sunday programme: “What they have to do is balance the right to protest, which is important in a democracy. At the same time there’s the right of all those other people to enjoy what was a fabulous day.“I think, overall, they managed to get that balance right.”She said it was right of the police to take into account the context of the event, as it took place on the world stage with hundreds of foreign dignitaries attending and had national security implications.Parts of the Public Order Act which recently came into force mean protesters who have an object with the intention of using it to “lock on” are liable to a fine, with those who block roads facing 12 months in prison.",
        "Asked whether she trusts the police to use the new laws, Ms Frazer said: “Yes, I do trust them to use those new powers.“I have huge confidence in the police.”The new laws are intended to “redress the balance” after a recent change in demonstrators’ tactics, she said.“We’ve seen in this country a rise in protests and the way people are protesting that is interfering with the rights of people to go around their daily life.”Metropolitan Police Commander Karen Findlay acknowledged concerns about the arrest of protesters but defended Scotland Yard’s actions, saying: “Our duty is to do so in a proportionate manner in line with relevant legislation.”The Met said they received information that protesters were “determined to disrupt” the coronation – including defacing public monuments with paint, breaching barriers and disrupting official movements. What worries is me is that the Conservative Government have now increased these sort of wide-ranging powers ... what they haven’t done is enshrined the sort of legal responsibility and the duty on the police to actually facilitate peaceful protest  Liberal Democrat deputy leader Daisy Cooper  The Liberal Democrats’ deputy leader said she has “concerns” that the police may not have got the balance right in handling protests.“Some of that information is unfolding. But, on the face of it, I do have concerns,” Daisy Cooper told Ridge.",
        "“What worries is me is that the Conservative Government have now increased these sort of wide-ranging powers … what they haven’t done is enshrined the sort of legal responsibility and the duty on the police to actually facilitate peaceful protest.”A former police chief constable warned against a “totalitarian police state”.Sue Sim, a former chief constable of Northumbria Police, said she expected “this sort of thing was going to happen” when the Public Order Act was rushed through Parliament, but that she was “very, very disappointed that that did happen”.She told The World This Weekend on BBC Radio 4: “Where you are talking about peaceful protest the whole thing for me is, what type of society do we want? We do not want a totalitarian police state.”"
    ]
}