{
    "articleURL": "/wires/reuters/article-12041711/Serbia-school-shooting-major-killings-children.html",
    "content": [
        "May 3 (Reuters) - A 14-year-old boy shot his teacher in a Belgrade classroom on Wednesday before opening fire on other students and security guards, killing eight pupils and a security guard, Serbia's interior ministry said.",
        "Here are details of some previous school shootings and mass killings of children around the world:- NASHVILLE, TENNESSEE, March 27, 2023 - A heavily armed 28-year-old fatally shoots three children and three adult staffers at a private Christian school, before police kill the assailant. - NA KLANG, THAILAND, Oct. 6, 2022 - A former policeman kills 34 people, including 23 children, during a knife and gun rampage at a daycare centre in northeast Thailand, before shooting dead his wife and child at home and turning his weapon on himself.- UVALDE, TEXAS, May 24, 2022 - A gunman burst into a classroom in Uvalde, Texas, and shot dead 19 students, aged 9 to 11, along with two teachers.- KABUL, AFGHANISTAN, May 8, 2021 - Three explosions by a school in Kabul killed at least 80 people, most of them schoolgirls.- SANTA FE, TEXAS, May 18, 2018 - A 17-year-old student opened fire at his high school outside Houston, Texas, killing nine students and a teacher, before surrendering to officers. - PARKLAND, FLORIDA, Feb. 14, 2018 - A former student at Marjory Stoneman Douglas High School in Parkland, Florida, killed 14 students and three educators. - PESHAWAR, PAKISTAN, Dec. 16, 2014 - Taliban gunmen massacred 134 students and 16 staff in a Peshawar school.",
        "- NEWTOWN, CONNECTICUT, Dec. 14, 2012 - A heavily armed gunman killed 20 children from five- to 10-years old and six others, in a rampage at Sandy Hook Elementary School in Connecticut.- UTOEYA ISLAND, NORWAY, July 22, 2011 - Far-right Norwegian extremist Anders Behring Breivik gunned down 69 people, mostly teenagers, at a Labour Party youth camp on Utoeya island and killed another eight people with a car bomb in Oslo.- BESLAN, RUSSIA, Sept. 1, 2004 - 186 children were among 333 hostages who died in a chaotic storming of School No.1 in Beslan, after it was seized by rebels demanding Chechen independence. - LITTLETON, COLORADO, April 20, 1999 - Two student gunmen killed 12 other students and a teacher at Columbine High School in Littleton, Colorado, before killing themselves. - DUNBLANE, SCOTLAND, March 13, 1996 - A gunman killed 16 children, mostly five-year-olds, and their teacher in Dunblane, Scotland.(Editing by Edmund Blair)"
    ]
}