{
    "articleURL": "/news/article-12050217/Just-Stop-Oil-streets-London-two-slow-marches.html",
    "content": [
        "JSO said they will not be marching in central London tomorrow afternoonThe group normally holds a rally at noon on Saturdays at Parliament SquareAn angry van driver blasted Just Stop Oil activists who disrupted rush hour traffic this morning with a slow march through north London. ",
        "The driver shouted: 'You're wasting everyone's f***ing time. How is this saving the environment? There's about one-hundred f***ing people sitting behind me with their engines running!'Activists in two groups set off from Gloucester Gate and St Pancras Way in Camden around 7.30am. JSO said around 33 activists were involved in today's protest which is the latest in a series which began on April 24. The group wants a commitment from government to end licensing and agreeing any new fossil fuel projects in the UK. However, in a welcome move, JSO has decided to cancel their weekly slow march at Parliament Square tomorrow lunchtime due to the Coronation of King Charles III. ",
        "Thousands of well-wishers and tourists are expected tomorrow in key locations across the city in what will be the biggest security operation since Queen Elizabeth II's funeral. As well as members of the public, a large number of world leaders are expected in London tomorrow to witness the historic event. JSO supporter Quenton Kelley, 64, from Portsmouth, who was taking part in this morning's action said: 'A wall is being built around our city to keep the sea out. The government is still subsidising oil. 'It makes no sense! The government takes £3.5 million from the fossil fuel lobby. Then they encourage more fossil fuel extraction, ban onshore wind and channel £236 million a week of taxpayers money into the pockets of Shell and BP, who just announced obscene profits.' ",
        "The dock worker added: 'The corruption and criminality is plain as day and this is the price they are putting on our childrens' heads. Now they take away our right to speak out about it and imprison anyone who resists. 'This is fascism plain and simple. I will not be silenced and neither should you. Go to juststopoil.org to sign up to march, as is our democratic right, established in international law.' JSO claims since their campaign was launched on April 1, 2022, 2,100 people have been arrested with 138 sent to prison.Yesterday, a former royal protection officer warned they could be shot if they disrupt the Coronation.On Wednesday, 23 members of the group were arrested during a march from Downing Street to Parliament Square. A record 11,500 police officers – a large number of them armed – will guard London this weekend in what is set to be the biggest security operation in British history.This warning comes after the group have caused chaos across London for more than a week, holding slow marches in the middle of the capital's busy roads.",
        "Former royal protection officer Simon Morgan, now director of operations at security firm Trojan Consultancy, said demonstrators need to be aware that they will be in the middle of an armed policing operation during Charles' Coronation this weekend.",
        "Mr Morgan said: 'It's an armed policing operation because of the threat that the UK faces, the threat that the royal family faces, dignitaries that are attending. So we have to be very careful.'Somebody that's going to run out in front of the carriage, fiddling with something in their rucksack, who's to say that's not an IED rather than a banner that's just going to be unfolded.'These demonstrators have to be very careful as to the environment that they're going into, the police are acutely aware of it.'Last year, the Metropolitan Police admitted it had spent £7.5m over the course of nine weeks during JSO protests which closed the M25 motorway with activists climbing up overhead gantries. The £7.5 million cost to the Metropolitan Police – revealed in response to a Freedom of Information request – covers the total of nine weeks from October 1 to November 14, and from November 28 and December 14.It includes the cost of officers and staff planned to be on duty, overtime bills and costs for vehicle use.The Government is planning to further clamp down on the right to protest by preventing activists from marching slowly along the road to disrupt traffic. Police will be given the power to stop 'slow walking' by climate protesters under proposals unveiled by the Government.",
        "New legislation would give officers the ability to intervene and stop the tactic, which is widely used by Just Stop Oil.It is used to block roads in a way that does not involve sitting in the middle of the street to stop traffic, which is illegal.Last year the group changed its approach and deployed the tactic widely after several activists were arrested for blocking roads.",
        "The legislation was introduced in Parliament by statutory instrument and complements the Public Order Bill, which will pass into law after being approved by the House of Lords.The new legislation will support the Bill by clearly setting out what is meant by 'serious disruption to the life of the community'.The Government says this will give police the clarity they have asked for on when they can use existing powers to break up the 'selfish, guerrilla' slow-marching tactics used to halt traffic across the UK.The Public Order Bill creates a new criminal offence of interfering with key national infrastructure such as roads, airports and railways, with perpetrators facing 12 months behind bars.People who lock themselves on to others, objects or buildings will face up to six months in jail or an unlimited fine.Police will also be allowed to stop and search protesters they believe are setting out to cause 'serious disruption'.",
        "Home Secretary Suella Braverman said: 'Selfish, disruptive protesters are wreaking havoc in people's everyday lives across the country and this must be brought to a stop.'This is why we are bringing forward this new law to clearly define serious disruption as requested by police chiefs.",
        "'Not only will the Public Order Bill introduce new criminal offences for causing serious disruption, this new legislation permits the police to clear the roads of slow-marching protesters who are hell-bent on causing chaos across the UK.'Crime and policing minister Chris Philp added: 'The British public do not deserve to have their daily lives disrupted by the self-indulgent, criminal behaviour we have seen in some recent protests.'BJ Harrington, the National Police Chiefs' Council lead for public order and public safety, said: 'Policing is not anti-protest, but there is a difference between protest and criminal activism, and we are committed to responding quickly and effectively to activists who deliberately disrupt people's lives through dangerous, reckless and criminal acts.'It is the responsibility of Parliament to make the law and our job to enforce it.'We have advised and provide professional advice to the Home Office to inform decisions about public order legislation.'This has been based on ensuring that we can discharge our responsibilities appropriately, while balancing the rights of the public who are going about their daily business lawfully and the rights of those protesting.'"
    ]
}