{
    "articleURL": "/sport/football/article-12060499/Claudio-Ranieri-opens-Chelsea-sacking-Roman-Abramovich.html",
    "content": [
        "Ranieri had been Chelsea manager for three years when Abramovich arrivedRussian billionaire assured Italian he wasn't demanding immediate successBut chief executive Peter Kenyon stuck a very different tone and he was sacked Claudio Ranieri has revealed the moment of 'disaster' he knew he'd be fired as Chelsea manager.",
        "The Italian had been in charge at Stamford Bridge for almost three seasons when Russian billionaire Roman Abramovich bought the club in 2003.Abramovich had not demanded instant success of Ranieri when he arrived, despite £120million spent in the transfer market, only that the coach 'build a team.'In came the likes of Hernan Crespo, Juan Sebastian Veron, Damien Duff, Adrian Mutu and Claude Makelele in Abramovich's first summer and Chelsea improved their Premier League position from 4th to 2nd behind the Arsenal 'Invincibles.'They also reached the semi-finals of that season's Champions League, losing to Monaco.",
        "Despite this success, Ranieri was unable to shake off speculation about his future and he knew he was doomed to the sack when chief executive Peter Kenyon shifted the goalposts.He said in an interview that Chelsea not winning anything that season would be deemed a failure.Ranieri told the new Paramount+ documentary Fever Pitch: 'When Peter Kenyon made the first interview I said to myself, \"finished Claudio, you are dead.\"'He has said, \"If Claudio does not win any title it is a disaster.\"'I said, \"why\", Roman never asked me something like this in the first year.'Ranieri was duly fired at the end of that season with Chelsea moving for Jose Mourinho, who'd just won the Champions League with Porto.",
        "Also interviewed in the documentary, Kenyon said life was 'easy' with Ranieri but it didn't take long to decide his future.Kenyon, who was also Manchester United's chief executive under Sir Alex Ferguson, said; 'Claudio was a very nice guy and you will have an easy life.",
        "'I never had an easy life with Sir Alex. We took the decision early on, that we will make a change and we will only make the change, when we have found the right person.'Given Mourinho won back-to-back Premier League titles in his first two seasons, the decision to dispense with Ranieri can be viewed with hindsight as a shrewd one.But the Italian gained a measure of sweet redemption when he led Leicester City to their miraculous Premier League title win in 2016.Now 71, Ranieri is still in the dug-out with Italian Serie B club Cagliari."
    ]
}