{
    "articleURL": "/wires/pa/article-12051433/Steven-Naismith-hopes-Josh-Ginnelly-s-Hearts-success-convince-stay.html",
    "content": [
        "Steven Naismith is hopeful that the improvement Josh Ginnelly has enjoyed at Hearts will help persuade the attacker to commit his future to the club.",
        "The former Burnley, Walsall and Preston player – approaching the end of his third campaign with the Jambos – has emerged as a key man this term and is the Edinburgh side’s second-highest scorer with 11 goals to his name.Ginnelly is out of contract at the end of the season and supporters are eager to see the club tie down the 26-year-old Englishman to a new deal.“I’m not sure whether he will stay or go,” said interim manager Naismith when asked for an update. “I think the club will want to keep him. He’s had the most consistent season since he’s been at the club.“The years he has been here, he has progressed from being a new guy in with good attributes, to building his consistency and then becoming a more experienced character in the group. All these factors have been good for him and for the club.“In his previous moves, he’s signed on thinking one thing and very quickly it’s developed into something else which has not been great for him and he’s not played his best stuff, hence why he came up to Hearts.",
        "“I think this period of his career has probably been the most enjoyable. The club I’m sure are trying to keep him, and Gino’s got a decision to make.”",
        "Naismith was handed the reins until the end of the season following the sacking of Robbie Neilson last month as Hearts search for a new permanent manager.Asked if he had any input into which of the out-of-contract players the club will attempt to retain, the 36-year-old said: “I make recommendations and stuff like that but at the same time those players could have been speaking to clubs since January.“It’s been made clear that with the players out of contract, it will be towards the end of the season that things are confirmed one way or the other.”Naismith has been helping plan a pre-season even though it remains unclear whether he will be part of the new managerial set-up.“In terms of pre-season, there needs to be a programme there,” he said. “Whether I’m the manager or somebody else is the manager, if we get to the summer and we don’t have that, we’re in big trouble because you’re not going to get a pre-season trip or schedule as you want it.“As much as we can, we’ve made the decisions, no matter which manager is in place.”Hearts, who are trying to chase down Aberdeen in the battle for third place in the cinch Premiership, host Celtic this Sunday and Naismith is hoping his team are able to prevent Ange Postecoglou’s rampant side settling into their rhythm early on.",
        "“That’s been consistent with Celtic since the manager came in, that he wants to start really fast and get ahead early in the game, which gives them a lot of control,” said Naismith. “That’s a threat we need to come up against and be brave enough to keep the ball and cause them as many problems as they cause us.“If we start fast and get the crowd something to back, then they’ll back it and it will be a great atmosphere. Every game at home, that’s what we need to do to get ourselves the backing of the fans which then gives us more confidence on the pitch.“We did it well against Ross County and hopefully we can do it again on Sunday.”"
    ]
}