{
    "articleURL": "/sport/othersports/article-12045493/Britain-close-ice-hockey-World-Championships-promotion-fourth-win-Nottingham.html",
    "content": [
        "Pete Russell's side dropped out of the top level of global ice hockey last year Britain are closing in on an immediate return after four wins in the second tierVictory over Italy in Nottingham on Friday would ensure Britain are promotedGreat Britain returned to the top of their World Championships group and stayed on course for a return to the elite level of ice hockey with a 7-0 win over Romania in Nottingham.",
        "Britain now need only a point against Italy in their final match in this Division One Group A on Friday to seal a return to the top table of the sport they left last year when they were relegated in Finland after a four-year stay at the highest level. A fourth win in four games as hosts of this group was sealed for GB in the second period on Wednesday when they scored three unanswered goals against Romania, Brett Perlini, Liam Kirk, with his eighth point in four games, and Jonathan Phillips all finding the net after a goalless first period.It was just what GB needed to ease their nerves after Italy had defeated Lithuania 6-4 and Poland, the surprise package in this tournament, had thrashed Korea 7-0 to leave the pressure on the hosts despite their wins against Korea, Poland and Lithuania.Two teams will be promoted and it will all come down to Friday’s final game when Britain will have to beat Italy and join Poland in returning to the highest level. A defeat, meanwhile, will leave GB frustrated and facing a second season in the second tier.",
        "Coventry’s Johnny Curran sealed GB’s win with his first World Championships goal when he deflected Evan Mosey’s shot into the Romanian net and Sam Ruopp, another GB first, added a fifth on the power-play to emphasise Britain’s superiority.",
        "Mosey added a sixth on the power-play as Romania, so defiant in the first period, finally ran out of steam and Josh Waller completed the scoring for a rampant GB.Cardiff’s Ben Bowns, GB’s outstanding goalminder, completed his third shut-out in four games in this tournament by saving 13 shots to seal his team’s night.‘We’re very happy,’ said GB defenceman Davey Phillips, captain on the night to celebrate his 100thcap. ‘We started a little slowly but as the game went on we got into the groove and finished how we wanted to.’ "
    ]
}