{
    "articleURL": "/wires/aap/article-12056033/Lolesios-message-Eddie-Jones-Brumbies-pip-Rebels.html",
    "content": [
        "Noah Lolesio has sent a message to Wallabies coach Eddie Jones and rival five-eighth Carter Gordon as he helped the Brumbies to a thrilling 33-26 Super Rugby Pacific victory over the Melbourne Rebels.",
        "The result pushed the Brumbies back up to second on the ladder while the Rebels remain outside the finals-bound eight.Snubbed for Jones's first Wallabies camp, with Gordon called in for the first time, Lolesio made an early statement in Sunday's match at AAMI Park.The 17-Test playmaker scored two tries, showing some rare emotion after both.With Jones watching from the stands, he thumped his chest after the first and after the second yelled \"Carter Gordon\" after touching the ball down.He told commentator, former Wallabies winger Drew Mitchell, it was \"personal\".\"It's a bit personal this game but I will keep it on the field,\" Gordon said as he walked from the field at halftime.Brumbies coach Stephen Larkham welcomed Lolesio's passion.\"He's super competitive, there's no doubt about that,\" the former Test playmaker said of the 23-year-old.\"He's someone that wants to be better and better every week and we see that at training.\"He's challenging himself at training, challenging the guys around him and it's good to see that bit of passion come out with his emotions at halftime.\"Despite Lolesio crossing twice it was a fairly even battle between the playmakers, with Gordon showing his toughness in defence while he set up two tries by firing cut-out passes to winger Lachie Anderson.",
        "Gordon also bagged one of his own in the 71st minute when he swooped after a loose Brumbies pass to touch down.The game was level at 14-14 after 22 minutes, with Brumbies fullback and Test hopeful Tom Wright showing his pace to cut through the defence for Lolesio's first five-pointer.Melbourne's first try was scored after a barnstorming run by flanker Josh Kemeny in the second minute.Tries to flanker Jahrome Brown through the Brumbies powerful maul either side of half-time pushed their lead out to 28-14.Melbourne skipper Brad Wilkin limped from the field before his team closed the gap with Anderson diving across for his second.However the Brumbies' physicality bore fruit through their Test flanker Rob Valentini, who barrelled over after 12 phases in the 62nd minute.With five minutes remaining the Rebels looked to have tied up the match, but the TMO ruled a double movement by prop Cabous Eloff.With the Brumbies still down a man with lock Darcy Swain yellow-carded for cynical play, Melbourne continued to hammer the line but couldn't break through the Brumbies' defence.Shattered Rebels coach Kevin Foote defended his team's decision to take a quick tap rather than a scrum but said it was poorly executed.\"I think the decision was right ... statistically we know that we're very good in that zone and we know that when we get close we can finish, so just poor execution,\" Foote said.",
        "\"It was maybe a bit of white-line fever and we just had to set up another phase and we would have been right there.\"Wilkin later said the team medical staff had cleared him of serious injury."
    ]
}