{
    "articleURL": "/wires/ap/article-12039221/Business-Highlights-Writers-strike-bank-stocks.html",
    "content": [
        "___",
        "Late-night TV shows go dark as writers strike for better payNEW YORK (AP) - The first Hollywood strike in 15 years began Tuesday as the economic pressures of the streaming era prompted unionized TV and film writers to picket for better pay outside major studios, a work stoppage that is leading most late-night shows to air reruns. The labor dispute could have a cascading effect on TV and film productions depending on how long the strike lasts, and it comes as streaming services are under growing pressure from Wall Street to show profits. Some 11,500 film and television writers represented by the Writers Guild of America walked out after failing to reach a new contract with the Alliance of Motion Picture and Television Producers.___Bank stocks continue to fall following First Republic demiseNEW YORK (AP) - Regulators have barely written the epitaph for First Repbulic Bank, but investors on Wall Street have already moved onto speculating which bank might be the next to fail. Bank stocks fell sharply Tuesday, led downward by smaller banks with heavy exposure to uninsured deposits and commercial banks like Western Alliance Bank, PacWest Bancorp, Comerica and Zions Bank. Shares of Western Alliance were down 17% in afternoon trading and PacWest dropped 25%, with trading of both stocks halted briefly due to high volatility. The ongoing concern among investors and regulators is that banks such as PacWest have large amounts of uninsured deposits - those above $250,000.",
        "___Chegg´s stock plunges on fears of competition from ChatGPTShares of the education technology company Chegg have lost nearly half their value in a single day. The sell-off came Tuesday after Chegg´s CEO warned that OpenAI´s free ChatGPT service was cutting into its growth. CEO Dan Rosensweig told investors on a conference call Monday that early in the year, the company was meeting expectations for new sign-ups for its educational services. But that changed in recent months. The company´s stock traded above $100 in early 2021 as most students were still stuck at home attending class online during the pandemic. On Tuesday it ended down 48% at $9.08.___Lyft´s new CEO tackles a job requiring some heavy liftingSAN FRANCISCO (AP) - Even before he joined Lyft´s board in 2021, David Risher had taken hundreds of trips as a passenger so he felt like he knew a lot about the ride-hailing service. But he never expected to be thrust into the driver´s service at a time when Lyft was running like a jalopy. After shaking off his initial shock at being asked to replace Lyft´s co-founder s CEO, Risher quickly began to shake up a company sinking into a morass of mounting losses. Shortly taking the job, Risher laid out a plan to lay off nearly 1,100 employees and plow the savings into lower fares to better compete against Uber.",
        "___Europe´s inflation inches up ahead of interest rate decisionFRANKFURT, Germany (AP) - Europe´s painful inflation inched higher last month, extending the squeeze on households and keeping pressure on the European Central Bank to unleash another large interest rate increase. The European Union statistics agency Eurostat said Tuesday that consumer prices jumped 7% in April from a year earlier. That´s just up from the annual rate of 6.9% in March. Food price inflation eased a little, falling to an annual 13.6% from March´s 15.5%. Core inflation, which excludes volatile food and fuel, slowed slightly but was still high at 5.6%. That underlines the expectation that the ECB will press ahead with its campaign to beat inflation into submission with rate hikes.___`Godfather of AI´ leaves Google, warns of tech´s dangersWASHINGTON (AP) - Geoffrey Hinton, the man widely considered as the \"godfather\" of artificial intelligence, has left Google - with a message sharing his concerns about potential dangers stemming from the same technology he helped build. Hinton has said he left Google so that he could focus on raising public awareness and speak freely about potential risks. At the heart of the debate on the state of AI is whether the primary dangers are in the future or present.",
        "___Ford posts $1.76B 1Q profit largely on gas-powered vehiclesDETROIT (AP) - Ford Motor Co. made $1.76 billion last quarter, swinging into the black from a $3.1 billion net loss for the same period a year ago. Excluding one-time items, Ford made 44 cents per share. That beat Wall Street estimates of 42 cents. Revenue rose 20% to $41.74 billion, soundly beating the $39.25 billion that analysts expected. Ford reaffirmed its earlier pretax profit guidance for the full year of $9 billion to $11 billion. Ford lost $722 million before taxes on its electric vehicles, but it made $2.62 billion on internal combustion vehicles. The company´s commercial vehicle unit added $1.37 billion to the pretax profits.___HBCUs get donations 178 times lower than Ivy League: studyThe average historically Black college and university received 178 times less funding from foundations than the average Ivy League school in 2019, according to a new report on the underfunding of HBCUs released Tuesday. The study -- conducted by the philanthropic research group Candid and ABFE, a nonprofit that advocates for investments in Black communities - found that the eight Ivy League schools received $5.5 billion from foundations compared to $45 million for the 99 HBCUs in 2019. Between 2002 and 2019, foundation support of HBCUs declined 30%. Some study participants blamed systemic racism. Others said connections between philanthropists and HBCU leaders are limited.",
        "___Chinese electric vehicle brands expand to global marketsYOKOHAMA, Japan (AP) - Chinese electric car exporters are starting to compete with global brands in their home markets. They bring fast-developing technology and low prices that Tesla´s chief financial officer says \"are scary.\" BYD Auto is the biggest-selling Chinese electric brand. It opened a dealership in Japan in February. NIO, a maker of premium-priced SUVs, exports to Europe. The ruling Communist Party has made China the biggest EV market with the help of multibillion-dollar subsidies. The ruling party wants to make China a creator of renewable energy and other profitable technologies. Other Chinese EV exporters include Geely Group´s Zeekr and Ora, a unit of SUV maker Great Wall Motors.___The S&amp;P 500 fell 48.29 points, or 1.2%, to 4,119.58. The Dow Jones Industrial Average fell 367.17 points, or 1.1%, to 33,684.53. The Nasdaq composite fell 132.09 points, or 1.1% to 12,080.51. The Russell 2000 index of smaller companies fell 37.10 points, or 2.1%, to 1,732.11."
    ]
}