{
    "articleURL": "/wires/reuters/article-12038393/From-US-London-royal-super-fan-makes-lifetime-coronation-pilgrimage.html",
    "content": [
        "By JEEVAN RAVINDRAN",
        "LONDON, May 2 (Reuters) - U.S. citizen Donna Werner is no stranger to royal celebrations - for more than three decades she has travelled to Britain to join in the public party at weddings and jubilees.Now she is ecstatic to be in London for her first coronation.\"And we're off! This is such a once-in-a-lifetime experience,\" Werner exclaimed as she set off from her hotel towards Buckingham Palace, where she plans to secure a front-row seat to watch events around Saturday's coronation of King Charles III.The drama will come to life on the king and queen's return to the palace after the coronation ceremony, when they will travel in a 260-year-old gold state coach in a parade with 5,000 men and women from British and Commonwealth armed forces.\"Nobody does it like the British - the pomp and the circumstance,\" said Werner, 71, who had travelled from Connecticut in the United States. \"We don't have anything like this in the States.\"Things got off to a good start on her journey to the palace, first charming a construction worker into carrying her camping gear and then catching an unexpected glimpse of King Charles driving past in his car.\"He was waving at us. I was like, 'Oh, my god, it's like really happening',\" said Werner, who plans to stay up all night so she can sneak a peek at a rehearsal taking place on Tuesday night.",
        "Werner's first royal event was the wedding of Prince Andrew to Sarah Ferguson in 1986, and she has been hooked ever since.\"I'm just happy to be here and be part of history. I mean, this hasn't happened in 70 years,\" Werner said.Next to her tent, Werner has hung an American flag and a sign reading \"US loves King Charles.\" She has also painstakingly created a hat covered with flags, photos and cut-out figures of King Charles.\"It's right there and we're right here,\" Werner said, reflecting on her proximity to Westminster Abbey, where the coronation will take place. \"It gives you goosebumps. It really does, it really, really does.\" (Reporting by Jeevan Ravindran, additional reporting by Sarah Young; editing by William James and Angus MacSwan)"
    ]
}