{
    "articleURL": "/sport/football/article-12039163/Cruise-liners-robotic-barmen-neck-massages-Grandad-Sam-spent-two-years.html",
    "content": [
        "Sam Allardyce is set to take over as manager of Leeds United for final four gamesVeteran Premier League boss has been out of work since end of 2020-21 seasonHis addiction to the muck and nettles of the Premier League earned a returnA few weeks ago, Sam Allardyce marvelled at the wonders of the Bionic Bar aboard a Royal Caribbean cruise, where two robotic bartenders serve your drinks. They would not, you assume, pour wine into a pint glass.",
        "But if that was a vision of the future, Allardyce knows that his own worth still exists in the past. That is not to say he is a has-been, or his methods are redundant, more so there is a body of work that makes him an appealing short-term solution for any crisis club. Even his friends call him 'Red Adair'.It is more than two years since he last answered one such cry for help, only for it to end in tears. His first four home games at West Bromwich brought an aggregate score of 17-0 - and not to West Bromwich. This time, at Leeds, he only has four matches to avoid a second Premier League relegation of his career. He has been out of work since taking the Baggies down, but that was never going to signal retirement.'It's a drug, an addiction. It's very difficult to shake off,' he said last year. 'You miss it. You're inspired by the pressure.'Allardyce, 68, did not look like he was longing for a return when he visited his grandson, Sam, at university in the United States last month. There, at the Marriott Grande Vista in Orlando, he enjoyed an impromptu neck and back massage beneath the swimming pool's waterfall. Maybe it was one last chance to relax after all, before picking up his hose and tackling the flames inside Elland Road.",
        "And that is how he has spent much of the past 24 months - being granddad. He was with his wife, daughter and grandsons as part of the same Stateside trip before they embarked the Wonder of the Seas cruise-liner at Cape Canaveral. The ship is described as 'the boldest, the biggest and larger than life'. Little wonder Big Sam fancied it.He celebrated the 21st birthday of his grandson, Keaton, at an Alice in Wonderland-themed restaurant. With a fixed price of £50 per person, Grandad Sam would have no doubt settled the bill.He has enough money by now for it not to be his motivation at Leeds - even if a seven-figure survival bonus might see him leave Cape Canaveral by rocket instead of boat next time. Rather, it is the money-can't-buy adulation of saving a football club that is his currency of choice at this stage in life.Allardyce could have continued to holiday around the world. Earlier this year, on a golf course in Dubai, he measured a 100-yard iron over a lake and towards the green. As the ball dropped, he muttered, 'Bunker? Water? No?'. When it landed pin-high, a family member remarked, 'Lovely shot'.But sand and water have never been his type of hazard. It is the muck and nettles of the Premier League he prefers to navigate. He has turned down jobs in China, Greece and Turkey, as well as an approach from Strictly Come Dancing. There was also a conversation with former club Everton earlier this season, but Allardyce had reservations. His wife, meanwhile, won't let him do I'm A Celebrity, for fear of him embarrassing her by trying to manage the camp. It always comes back to management.",
        "For amidst all the family time and holidays, football has remained the constant - be that media work, charity matches or attending games. He was a guest of Sir Alex Ferguson in the boardroom at Old Trafford in February, sharing a table with actor James Nesbitt, and he was back there on Sunday for the 1-0 win over Aston Villa.",
        "Allardyce was also at Wembley to watch Bolton lift the Papa Johns Trophy last month. It was during a Q&amp;A in a corporate lounge that news broke of Brendan Rodgers being sacked by Leicester. 'Well, I'm available,' he joked.Except, it wasn't really a joke. Just last week, as the host of his 'No Tippy Tappy Football' podcast mentioned him 'not getting a call from Leeds', Allardyce tried to use his glass of water to mask what was, perhaps, a knowing grin. He was certainly not shy in outlining what he could do to help them.'I've no problem looking at the Leeds situation. You go in and set a structure of not to get beat,' he said. 'Confidence is built by results. It starts with a 0-0. The more draws then extend into winning matches. The players are suffering from a huge lack of confidence. That is built by waking up on a Sunday morning and not feeling, \"We've lost again\".'",
        "Allardyce's first match is at Manchester City on Saturday. How about that for a re-introduction, a meeting with Erling Haaland? It will feel much like he's back in front of those big robotic bartenders."
    ]
}