{
    "articleURL": "/wires/ap/article-12057325/Alcaraz-beats-lucky-loser-Struff-retain-Madrid-Open-title.html",
    "content": [
        "MADRID (AP) - Carlos Alcaraz is paving his way back to the top of the world rankings after a second-straight Madrid Open title.",
        "Alcaraz beat lucky loser Jan-Lennard Struff 6-4, 3-6, 6-3 in the Spanish capital on Sunday to guarantee his return to the No. 1 spot by playing at least one match at the upcoming Italian Open in Rome.The 20-year-old Spaniard converted on his first match point after a hard-fought battle against Struff to secure his fourth title of the year and 10th of his impressive young career. He had also successfully defended his title in Barcelona two weeks ago.\"To defend the title here in Madrid, on the verge of regaining the No. 1 ranking, these are very big achievements for me,\" Alcaraz said. \"I feel very proud of the work that I´ve put in and of what I´ve been achieving. I'm an ambitious guy and I´m going for more in Rome.\"It was Alcaraz´s 29th win of the season, and 21st straight in Spain going back to a loss to Rafael Nadal in Madrid on his 18th birthday two years ago.He joined Nadal as the only consecutive Madrid champion in tournament history, and is the youngest player to successfully defend a Masters 1000 title since Nadal at Monte Carlo and Rome in 2005-06.",
        "\"For me it is so, so special,\" Alcaraz said. \"To lift the trophy here in Madrid. In my country. In front of my home crowd, my family, my friends. Everyone close to me. For me it is a special feeling that I will never forget.\"",
        "Alcaraz´s other titles this year came in Buenos Aires and Indian Wells. He is the first player to win two Masters 1000 trophies this season. It was the fourth Masters 1000 title overall for last year's U.S. Open champion.\"It was a really tough match,\" Alcaraz said. \"Jan was playing great, really aggressive. In the second set I had a lot of chances to break his serve and I didn´t take it and it was tough for me to lose it. I told myself that I had to be positive all the time and that I would have my chances and I think I did it in the third set.\"The big-serving Struff was the first lucky loser to reach an ATP Masters 1000 final, having earned an unexpected spot in the main draw after another player had to drop out.The 33-year-old German, ranked 65th in the world, was playing in his second tour-level final and trying to become just the fourth player and first in more than 20 years to win his first tour-level trophy at a Masters 1000.He called it \"a best-career achievement so far.\"\"Of course I wanted to go all the way to win today, but I would definitely say if someone told me two weeks ago `You´re gonna play the finals,´ I would take it, definitely,\" he said. \"I was in the game. Had my chances. But he was too good at the end and congrats to him.\"",
        "Struff had lost in the final round of qualifying to Aslan Karatsev, the player he eventually beat in the semifinals after upsetting fourth-seeded Stefanos Tsitsipas in the quarterfinals. The final was his ninth match at the clay-court tournament in Madrid, compared to six for the top-seeded Alcaraz.Struff beat Alcaraz on clay at the French Open in 2021, while Alcaraz needed five sets to down Struff at Wimbledon last year.WOMEN´S DOUBLESVictoria Azarenka and Beatriz Haddad Maia won the women´s doubles title by defeating top-seeded Americans Coco Gauff and Jessica Pegula 6-1, 6-4.The unseeded winning duo upset two of the top-three seeds in Madrid.___Tales Azzoni on Twitter: http://twitter.com/tazzoni___AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}