{
    "articleURL": "/femail/article-12059695/What-did-Princess-Wales-really-think-Harrys-exes.html",
    "content": [
        "Kate dated William for decades and met Harry's romantic interests over yearsREAD MORE: How William isn't afraid to show his affection for KateIt's no secret that sisters-in-law the Duchess of Sussex and Kate Middleton do not share a warm relationship.",
        "But before Meghan Markle married Prince Harry, the Duke enjoyed a number of other relationships with socialites from across the world. He famously considered Kate like a sister - and she would go on to meet a multitude of his girlfriends and romantic interests over the years. But how did the Princess really get along with these other women?Here, FEMAIL takes a look at Harry's ex girlfriends - both rumoured and confirmed - and what the Princess of Wales thought of them.  Chelsy Davy",
        "Chelsy Davy dated Prince Harry on and off for seven years, from 2004 until 2011 and was constantly in the papers throughout their relationship.Harry first came across the Zimbabwean businesswoman during his gap year which he spent in Cape Town.Prince Harry also mentioned Chelsy in his book, Spare, and wrote: 'I remembered her being… Different.'Unlike so many people I knew, she seemed wholly unconcerned with appearances, with propriety, with royalty.'He also wrote about having his 'first kiss under the stars' with Chelsy. However, Kate and Chelsy did not seem to be each other's biggest fans - as an insider claimed the pair did not get on so well.Royal expert Katie Nicholl spoke to the The Express about the pair's relationship.Ms Nicholl said that the pair got off on the wrong foot after Kate offered to take Chelsy shopping, but she did not want to go because they had different styles.",
        "She added: 'Although Chelsy gets along well with Kate's sister, Pippa, whom she occasionally goes out with, she and Kate are less friendly.'They got off to an inauspicious start when Kate offered to take Chelsy shopping on the King's Road the last time she was in London.'When Chelsy, whose sense of style is very different from Kate's, snubbed the invitation, Kate was said to be offended.'However, at the wedding of Peter and Autumn Phillips in 2008, the girls had something in common - they were both about to meet the Queen for the first time - according to Nicholl's book Kate: The Future Queen. Kate was by herself as Prince William had other things he had to attend to. Nicholl wrote: 'On this occasion, however, they bonded, because they were both nervous about meeting the Queen.'Although she was a regular guest at the royal palaces and had been to Sandringham for the Boxing Day shoot, this was, rather surprisingly, the first time Kate would be formally introduced to the Queen. 'Understandably, without William by her side, she was shy and later recalled, 'It was amongst a lot of other guests and she was very friendly.''The pair had attended several events together which they were pictured at - including the Beaufort Polo Club, Gloucestershire in 2006 and then again for the Tusk charity polio in 2008. ",
        "In an article Katie Nicholl wrote for the Mail on Sunday in 2009, she claims that Chelsy was 'not impressed' by Kate's advice after they broke up for the first time in 2007.A friend told Nicholl: 'When they last saw each other Kate told Chelsy not to make such a fuss about Harry being away.'She also told Chelsy to ignore rumours he was playing around. Kate's thoughts were that it comes with the territory.'In 2011, Kate and William's wedding convinced Chelsy that Prince Harry was not 'the one' she was meant to be with. When the pair had their ceremony on April 29 - which was watched worldwide by millions - she realised that she did not want to be in a relationship with a high-profile royal for the rest of her life.Journalist Angela Levin wrote in royal biography Harry: Conversations with the Prince: 'A friend revealed that seeing the enormity and pomp of the day convinced Chelsy that she and Harry had been right to separate.'Although they had a lot in common, she saw clearly that because they came from such different worlds it could never have worked, especially as she valued her privacy and guarded it so carefully.'Chelsy went to Harry and Meghan's wedding at Westminster Abbey in 2018. ",
        "Cressida Bonas",
        "Cressida and Harry dated for two years, from 2012 until 2014, and she was one of his more serious partners.The Prince was introduced to her by his cousins Princess Eugenie and Princess Beatrice. Harry spoke about their relationship in Spare, and revealed that the Prince and Princess of Wales were fond of Cressida.He wrote that Kate and William 'mentioned, pointedly, repeatedly, how much they liked Cressida'.E! News  reported that Cressida and Harry were moving closer to marriage before they broke up and were having discussions about wanting to keep their 'semi-normal lifestyle' for as long as they can.A royal insider spoke to the outlet and said that Kate was helping Cressida on how to keep her normality.The source said: 'Kate's been brilliant with Cressida and has been giving her advice.'She likes her very much and has offered her tips on how to keep her normality. 'Kate's been there and done it and, while she knows Cressida won't be as talked about and followed like she was, she needs to get a real slant on what happens.'But according to Katie Nicholl's book Harry: Life, Loss, and Love, Cressida had second thoughts about their relationship. Similarly to Chelsy, this was after she saw how much media attention William and Kate got when they went on their Tour of Australia and New Zealand with their son Prince George, who was then only eight-months-old.",
        "Nicholl wrote: 'He tried to convince her they could make it work, but Cressida's mind was made up.'Harry suffered a real blow when she said, 'I can't do this'. I think she really broke his heart.'However they split on good terms, as she too attended Harry and Meghan's wedding in 2018. Ellie Goulding ",
        "Ellie Goulding was trusted by Kate and William for a crucial part of any wedding - singing the song for their first dance as husband and wife. Ellie sang Elton John's 'Your Song' as the future King and Queen of the United Kingdom danced the night away at their fairytale wedding. However it has been rumoured that the Duke dated the singer Ellie in 2015.The pair were spotted getting very close at the Audi Polo challenge in Coworth Park, Berkshire.Onlookers said the pair were 'all over each other' and one claimed they appeared to share a kiss under a blanket.A source told The Sun: 'Harry got Ellie's number a while ago and got in touch.'They'd always got on very well through their various meetings after she was the wedding singer at Kate and William's wedding reception.'The outlet also reported that Ellie said she was 'friends' with the Prince and Princess of Wales adding: 'It's not like it's awkward because I don't know them. So that's fine.'",
        "The Wales' have since had runs with Ellie on a couple of occasions.When Kate hosted Royal Carols: Together at Christmas which aired in 2021, Ellie sang Have Yourself a Merry Little Christmas.As she performed, the Prince and Princess were seen smiling fondly at each other, leading people to wonder whether this brought back sweet memories of their wedding day, as the concert was held at Westminster Abbey where the couple tied the knot. The singer also attended the Earthshot Awards in Boston last year, and chatted with the royal pair backstage.Kate greeted Ellie with a friendly kiss on the cheek, as they were pictured smiling and catching up.Ellie is not only friendly with Kate and William, but is also close with Princess Beatrice and Eugenie, attending her wedding to Jack Brooksbank in 2018. The royal sisters also returned the favour and both attended Ellie's wedding to Caspar Jopling in 2019. She has been on holiday with the royal sisters over the years, and Hello! reported that Princess Beatrice and heavily pregnant Princess Eugenie took Sienna Mapelli Mozzi and August Brooksbank to the Bluebird Cafe in Chelsea to celebrate Goulding's son, Arthur, who turned two at the start of May. Astrid Harbord",
        "In 2009, News of the World, reported that Harry spent the night clubbing with Astrid Harbord, who is Kate's friend. The pair were spent the evening at Raffles nightclub on Kings Road before travelling back to his flat in Clarence House at 3am.Harry, who was then aged 24, spent the evening with his ex-girlfriend Chelsy Davy days before.Kate and Astrid were pictured together a year prior at The Boodles Boxing Ball, in aid of Starlight Children's Foundation, Royal Lancaster Hotel. They were pictured smiling and laughing as they sat together to watch the match unfold.Astrid was said to have attended Kate's hen party and reportedly remained close to the Duke after he called it quits with Chelsy, The Express  reported.But the media outlet previously reported in 2018 that Meghan had 'frozen out' some of Harry's old friends - including Astrid and Tom Inskip, who he went to Eton with.The outlet reported that Harry had stopped returning Astrid's calls.A source told the Express at the time: 'It's all part of Meghan's quiet airbrushing out of Harry's old posse. 'She doesn't want temptation - of any sort - being put in his way while they concentrate on starting a family.' "
    ]
}