{
    "articleURL": "/wires/ap/article-12055243/Devils-Jack-Luke-Hughes-Game-3-vs-Canes.html",
    "content": [
        "NEWARK, N.J. (AP) - With his team down 2-0 again, New Jersey Devils coach Lindy Ruff is shaking things up in Game 3 of the Eastern Conference semifinals against the Carolina Hurricanes.",
        "Goaltender Vitek Vanecek probably will return to the starting lineup Sunday afternoon for the first time since being replaced by Akira Schmid after losing the first two games of the first-round series against the rival New York Rangers.That's just one move. The real surprise is the insertion of 19-year-old defenseman Luke Hughes into a lineup that is led by his 21-year-old brother and budding superstar, Jack.Luke Hughes is going to replace defenseman Ryan Graves, who sustained an upper body injury in Game 2 on Friday night.\"If I get the opportunity I am very prepared and very ready,\" Luke Hughes said after staying late after practice ended to work Saturday with the power-play unit.If he had been told he was playing, he didn't let anyone know.",
        "Ruff, who usually does not disclose lineup changes the day before the game, was surprisingly open. He said Luke Hughes is going to play and there is a possibility that Vanecek will return. Ruff's voice clearly indicated his No. 1 goaltender was more than a possibility.Jack Hughes was looking forward to playing with his brother in the playoffs\"He´ll be a guy that can move the puck in and out of the zone and get us moving fast,\" Jack Hughes said of his brother.",
        "\"We know he is going to skate,\" Ruff added. \"He got a little taste at the end of the year. I really feel his skating will help us, so I am excited to see him get in and play.\"While Luke Hughes clearly has talent and skating ability, he is a novice in the NHL. He signed with the Devils on Apr. 8 after Michigan lost in the semifinals of the Frozen Four. New York's top draft pick in 2021 (No. 4 overall) played in the final two games of the regular season, scoring the game-winning goal in overtime of the finale against Washington.Schmid also was somewhat untested when he was thrown into the lineup in Game 3 against the Rangers. He had appeared in 24 regular season games over the past two seasons with New Jersey, splitting both seasons between the parent club and its top farm team at Utica (AHL).All the 22-year-old netminder did over the rest of the series was post a 4-1 record, allowing two goals in his wins and recording two shutouts, including one in the deciding game 7 at the Prudential Center.Vanecek had struggled in the first two games against the Rangers, who outscored New Jersey 10-2.Carolina has outscored New Jersey 11-2, collecting nine even-strength goals. Ruff said his team has been reckless with its coverages against the Hurricanes. He hopes returning home for the next two games sparks his team and get his players to take their game to another level.",
        "\"We haven't played our best,\" Jack Hughes said. \"We did it again and dug ourselves a hole and now's the time we have to work our way out of it.\"___"
    ]
}