{
    "articleURL": "/wires/reuters/article-12049463/Rockies-roll-New-York-face-floundering-Mets.html",
    "content": [
        "Two teams trending in opposite directions will meet when the New York Mets begin a three-game series against the visiting Colorado Rockies on Friday.",
        "Colorado owns a season-high four-game winning streak after a sweep of the Milwaukee Brewers, while the Mets have fallen to .500 after losing nine of their last 11 games.New York was shut out for the sixth time in Thursday's 2-0 loss to the Detroit Tigers, who outscored the Mets 16-6 during a three-game sweep.\"We need to find our identity I think right now,\" New York pitcher Justin Verlander said. \"We have played some really good baseball. This series was difficult ... I feel like it hasn't quite matched up yet.\"Francisco Lindor is batting .212 for New York, which was held to three hits in Thursday's loss. The Mets' offensive woes continued in the ninth inning, when Brandon Nimmo was thrown out attempting to steal second with his team down by two runs.\"It's a byproduct of us trying to push something that is not there,\" New York manager Buck Showalter said. \"Guys are pushing -- outs are precious. But he's a really good player for us and we're lucky to have him and that isn't what beat us. We had three hits and what, hit one ball hard all day? That is the thing I dwell on.\"The Mets will send right-hander Kodai Senga (3-1, 4.15 ERA) to the mound in the series opener. He allowed two runs over five innings while throwing 94 pitches in a 4-1 loss to the Washington Nationals last Wednesday.",
        "Senga, 30, has 32 strikeouts through his first five major league games, tied with Noah Syndergaard and Nolan Ryan for the fourth-most in franchise history.Colorado will counter with right-hander Antonio Senzatela, who is making his season debut after tearing the ACL in his left knee last August.Senzatela, 28, made two rehab starts with Triple-A Albuquerque, going 0-1 with a 9.95 ERA in 6 1/3 innings. He was 3-7 with a 5.07 ERA in 19 starts last season.Rockies manager Bud Black said Senzatela could throw as many as 80-90 pitches in his season debut. He is 2-2 with a 2.88 ERA in five career outings (four starts) against the New York Mets, including 1-1 with a 2.70 ERA in two starts at Citi Field.Colorado scored five runs in the eighth inning to beat Milwaukee 9-6 on Thursday. Charlie Blackmon had two hits and two RBIs, while Kris Bryant and Mike Moustakas had two hits apiece.\"We're kind of getting comfortable with the groove of the season,\" Bryant said. \"We've had really good at-bats, good situational hitting, really good defense.\"Bryant has hit safely in 23 of 29 games for Colorado, which has won six of its last nine.Rookie shortstop Ezequiel Tovar is also playing well after batting .213 last month. He is 8-for-24 (.333) during his seven-game hitting streak.",
        "\"He's only 21 years old. That's what we've got to keep telling ourselves,\" Black said. \"He's 21 and not 25 or 26. And he's played much better the last couple of weeks -- a complete game with offense, defensively -- than the first two weeks. So he's doing well.\"--Field Level Media"
    ]
}