{
    "articleURL": "/femail/article-12059031/King-Harald-Norway-86-hospitalised-infection-second-time-six-months.html",
    "content": [
        "King Harald of Norway is under care at Oslo's main hospital, RikshospitaletREAD MORE: Princess Martha Louise opens up about her 'Megxit' moment King Harald of Norway will remain on sick leave after recovering from an infection that saw him hospitalised last week.",
        "The 86-year-old King left Oslo's main Rikshospitalet on Monday, according to the Norwegian Palace. There have been few details, but a brief statement last week read: 'The king has been diagnosed with an infection that needs to be treated, and will therefore remain in hospital for a few days.'On Wednesday, the Palace announced in another statement: 'His Majesty the King is still at Oslo University Hospital'.The Palace added that his condition 'is improving but he will be on sick leave until the end of the week.'",
        "While the King was hoping that he would be able to greet the President of Italy, who was in in Norway last week on a state visit, his son, Crown Prince Haakon, has taken over his father's duties this week, serving as regent.Crown Prince Haakon, told reporters last week that his father 'will remain in hospital for a few more days.'He added: 'We don't know whether he'll be back on the palace balcony on the 17th of May, but he hopes to have recovered by then.'The royal has been relying on crutches for a number of years. this is the second time has been admitted to hospital in the past six months.In December, the monarch was treated for an infection at the same hospital, where he received intravenous antibiotics.",
        "King Harald underwent a leg operation in January before contracting Covid-19 in March, and spent time in hospital in August with another infection.He went through a successful operation to replace a heart valve in October 2020 after being admitted to hospital with breathing difficulties.Crown Prince Haakon, 49, Harald's son, will take over the monarch's duties while he is in hospital.The development comes after the Crown Prince attended the Coronation of King Charles III with his wife, Crown Princess Mette-Marit, on Saturday.Haakon donned ceremonial military attire for the event. Meanwhile, Mette-Marit was elegant in pale pink, wearing a monochrome outfit with matching midi-dress, hat, gloves and stiletto pumps.",
        "The pair were also hosted by the Prince and Princess of Wales in March during their two-day visit to promote an increased business sector with a focus on green industrial transition, innovation and energy alongside a promotion of Norwegian literature and music.The Norwegian Royal Family, with King Harald and his wife Queen Sonja at its head, has been under the spotlight recently.Princess Martha Louise, the King and Queen's eldest child, recently revealed that her decision to step back from royal duties was filled with 'turmoil'.The princess, 51, who describes herself as 'spiritual' and claims to be a clairvoyant spoke to the BBC for the first time since she announced she was stepping back from royal duties in November.",
        "She also spoke about being able to 'see things', a gift she believes she has had from being a young child. When asked about her decision in comparison with Prince Harry and Meghan Markle, who also stepped down as senior royals, she spoke about her 'amazing' family, including King Harald and Queen Sonja, and how the dialogue between them has always remained open.'What I think has been amazing through this whole cycle has been the conversations we have had through it all,' she said.",
        "'From a very young age I remember my mum and dad saying (the King and Queen saying) that we always have to stick together. We always have to talk things through even if it's hard, we have to put all the cards on the table because we are family and we have to work things through.'The Norwegian royal, who is engaged to American businessman Durek Verrett, also discussed how her fiancé's controversial 'views' had contributed to how the public viewed her position in the royal family.She said: 'The Norwegian people I guess... have decided it's best for me to step down because of his views about things.'Durek, who describes himself as a 'Shaman', was dropped by his publisher shortly after the couple announced their engagement in June 2022 over pseudoscientific claims he made in his book 'Spirit Hacking'.",
        "Among the claims were that children 'can get cancer from being unhappy'.Durek has also claimed he once came back from the dead, recovering from a month-long coma, by letting his soul 'burn' and he has also spoken of having to undergo a kidney transplant from his sister as a child.It is unclear why he needed the kidney or how he became wheelchair bound, as he has described. The illness which sent him into a coma is also undisclosed."
    ]
}