{
    "articleURL": "/wires/reuters/article-12039755/Soccer-Ten-man-Real-Madrid-lose-2-0-Sociedad-Barca-close-title.html",
    "content": [
        "SAN SEBASTIAN, Spain, May 2 (Reuters) - Second-placed Real Madrid suffered a 2-0 defeat at Real Sociedad after being reduced to 10 men early in the second half in LaLiga on Tuesday, leaving Barcelona on the brink of the title.",
        "Runaway leaders Barca, who earlier beat Osasuna 1-0, will have the chance to clinch their 27th LaLiga crown with a win in their next game at city rivals Espanyol on May 14.Barca moved to 82 points from 33 matches and extended their lead to 14 points over reigning champions Real Madrid, who have lost two of their last three league matches.With only five games remaining, Real would only be able to reach 83 points if they win them all.They could slip to third place on Wednesday if their city rivals Atletico Madrid win their home match against lowly Cadiz.Real Madrid rested several key players, including Karim Benzema and Luka Modric, as they prepare for the Copa del Rey final on Saturday against Osasuna and next week's Champions League semi-final first leg at home to Manchester City.They were also without the suspended Vinicius Jr and never looked dangerous as Sociedad took control early in game.\"The fans should not doubt us ...\" defender Nacho told Movistar Plus. \"In the next ten days we have the most important thing at stake... and at the beginning of the season we all would have signed up to be like this at this point.\"\"Logically, (we would like to be) in a different way in the league, but we have to raise our heads quickly and fight for the titles we have left.\"",
        "After a slow first half, a mistake by defender Eder Militao right after the break gifted Sociedad the opener.While putting pressure on Alexander Sorloth on the right side of the area, Militao slipped and tried to deliver a pass to goalkeeper Thibaut Courtois that was intercepted by Take Kubo who opened the scoring by tapping into an empty net.Defender Dani Carvajal was sent off on the hour for a second yellow card after a sliding tackle on Aihen Munoz.The hosts then extended their lead in the 84th through 21-year-old Ander Barrenetxea who ghosted behind the defence and slotted a David Silva pass between Courtois and the near post.\"We always go out to win, but in recent matches, especially away from home, we are not showing the level we should for a competition like LaLiga,\" added Nacho.\"You can see it today: if you don't go out with intensity, anyone can beat you.\" (Reporting by Fernando Kallas in Madrid; Editing by Ken Ferris)"
    ]
}