{
    "articleURL": "/wires/reuters/article-12039701/King-Charles-coronation-economic-boost-Buckingham-Palace-says.html",
    "content": [
        "By Michael Holden",
        "LONDON, May 3 (Reuters) - The coronation ceremony for King Charles on Saturday will be the most glorious display of pageantry seen in Britain for a generation and will provide an economic boost to the nation, its organiser and Buckingham Palace have said.Charles, along with his wife Camilla, will be crowned at London's Westminster Abbey in a historic event whose origins date back some 1,000 years, and involving thousands of military personnel in a mile-long procession through central London.\"This is a proud moment in our national history,\" said Earl Marshal Edward Fitzalan-Howard, the Duke of Norfolk and England's most senior peer.\"This is also a time to remind ourselves of the pride we have in our great country and our unwritten constitution which has served us so well for over 1,000 years during our long history,\" Fitzalan-Howard, whose family have organised state occasions since 1483, told reporters.Some 7,000 armed forces personnel will be involved in ceremonial duties, with more than 4,000, including military bands, taking part in a procession from the Abbey back to Buckingham Palace where the newly-crowned king and queen will be given a royal salute in the gardens.It will be \"a glorious display of pageantry\", Fitzalan-Howard said. The royals will, as is traditional, wave to the crowds from the balcony of Buckingham Palace afterwards, and there will be a flypast by military aircraft.",
        "As the palace has previously acknowledged, the service itself will be different to that of Queen Elizabeth seven decades ago, reflecting the different eras.There will be only 2,300 guests in Westminster Abbey as opposed to the 8,000 who watched in 1953, although 100 heads of state will still be present, and it will be much shorter.Critics have questioned the cost of a lavish coronation when the public is facing a cost of living crisis but a palace spokesperson said there were reports that more than 1 billion pounds ($1.25 billion) was expected to flow into the struggling economy as a result.\"It´s not for me to say how accurate those figures are but certainly the theory pertains that the celebrations are an enormous economic boost to the nation,\" the spokesperson said, adding that having so many heads of state present was also a huge networking opportunity.However, consultancy Pantheon Macroeconomics said it expected that British gross domestic product would fall about 0.2% month-to-month in May, with the decline due to the extra bank holiday the government has allocated for the coronation. ($1 = 0.8015 pounds) (Reporting by Michael Holden; Additional reporting by David Milliken; Editing by Jonathan Oatis)"
    ]
}