{
    "articleURL": "/wires/afp/article-12060039/Zimbabwean-author-wins-appeal-against-protest-conviction.html",
    "content": [
        "Prominent Zimbabwean novelist Tsitsi Dangarembga on Monday won an appeal against an \"inciting violence\" conviction she received for staging a silent protest.",
        "The award-winning author and filmmaker was given a 70,000 Zimbabwean dollar ($200) fine and a six-month suspended sentence in September over the small demonstration when she held up a sign calling for reform.A High Court in Harare on Monday overturned the verdict saying it was erroneously reached, with the judge adding the full reasoning behind the decision would be released at a later stage.\"I am very happy that the High Court shows respect for the law of Zimbabwe,\" Dangarembga told AFP after the ruling, describing her initial conviction as a \"blatant miscarriage of justice.\"Zimbabwe's constitution grants the right to demonstrate peacefully.\"No offence was committed in the first place. The judges said she did not commit any offence,\" Dangarembga's lawyer Harrison Nkomo told AFP.The 64-year-old was arrested in July 2020 as she walked the empty streets of Harare during the coronavirus lockdown with a friend -- journalist Julie Barnes -- and a handful of other demonstrators.Dangarembga held a placard reading, \"We want better -- reform our institutions\".She also wore a sign on her back calling for the release of a prominent journalist who had previously been arrested on similar charges of inciting violence.Authorities alleged the demonstration had not been authorised and was aimed at inciting violence, while the author contended she spoke to no one during the walk.",
        "Barnes, who was jointly charged with Dangarembga, was also acquitted on appeal.- 'Extremely stressful' -While welcoming the verdict, Dangarembga said she was \"mindful\" that her initial conviction came as part of a pattern.Arbitrary arrests and repression against civil rights organisations have hardened under the presidency of Emmerson Mnangagwa, who succeeded Robert Mugabe in 2017.Lower courts appeared to be \"weaponising\" the law against those that the ruling ZANU-PF party \"thinks its opponents, or threats to its apparent project of hijacking all political power in Zimbabwe\", Dangarembga said.Rights groups and the opposition say the crackdown has intensified ahead of national elections -- which are to be held in August, although no date has been announced yet -- accusing the government of using the courts to silence dissent.Dangarembga mentioned Job Sikhala, a popular opposition politician and lawmaker who last week was convicted of obstruction of justice, a move that bars him from contesting elections, among a number of such examples.She urged Zimbabweans to continue to demonstrate peacefully against the \"undermining of Zimbabwean law\" which \"leads to national disarray and decay, and to the misery of citizens\".Dangarembga's 1988 novel \"Nervous Conditions\" was the first book to be published in English by a black woman from Zimbabwe and earned her the prestigious Commonwealth Writers' Prize.",
        "The writer described the trial as \"extremely stressful\", adding it led to abuse and forced her to turn down job opportunities.\"I am six months behind with my next novel,\" she added.Musa Kika, the head of a coalition of rights groups, the Zimbabwe Human Rights NGO Forum, welcomed the ruling saying it \"corrected a wrong\".",
        "\"This must get us to reflect on why the lower court got it wrong in the first place, and confront the now common desire, drive and motivation of the magistrates court to convict opposition and pro-democracy activists,\" he said."
    ]
}