{
    "articleURL": "/tvshowbiz/article-12061045/Demi-Lovato-snaps-shot-mysterious-object-sky-Did-just-capture-UFO-camera.html",
    "content": [
        "Demi Lovato is an award winning singer and songwriter with millions of fans around the world. ",
        "The 30-year-old hitmaker, who has been showcasing her healthy bikini body on social media, may have something new to add to her list of accomplishments - UFO spotter. The Still Alive singer shared several photos in her Instagram stories Monday showing an unidentifiable object in the sky over the California desert near Palm Springs. 'Did I just capture a UFO on camera?' she wrote over the first snap.A gray oblong image was seen in the cloudless blue sky over a wind farm.",
        "The hitmaker shared a closer view image and drew a big white circle around it so her 156 million fans could see what she saw. A since deleted frame read 'Saw a UFO last night And yes, I'm still looking up!!' followed by laughing emoji, and a space ship and alien emojis.The area where she shot the snap was close to Edwards Air Force Base.The EAFB website touts the facility as 'The Center of the Aerospace Testing Universe,' so, whatever ever Demi saw could have been from there.According to the Edwards Instagram page, pilots have been conducting F-22 Raptor tests, as well as in-air refueling tests in the area. A 2021 Gallup poll found that 41-percent of those questioned believed that at least some UFOs spotted have been alien space craft, while 50-percent believe they can be explained by human activity. ",
        "In 2021 she starred in a four-part investigative docuseries Unidentified.On one part, she tried to find alien life while out in Joshua Tree.",
        "She met with experts in the field to obtain 'secret government reports and conduct tests at known UFO hot spots.'She said at the time: 'I had this crazy experience that happened to me in Joshua Tree. It was this bright light kind of moved in like these weird ways that a plane wouldn't move. My goal is to find out what really happened.'As Lovato seeks to 'make contact with the truth' about extraterrestrial life, they wonder if aliens may not be closer to Earth than most would expect. Demi announced she will make her directorial debut in a new documentary for Hulu.Child Star, according to a statement to Teen Vogue, 'will deconstruct the highs and lows of growing up in the spotlight through the lens of some of the world’s most famous former child stars, including Lovato.'",
        "The film will also 'explore how children are propelled to superstardom at a young age and how their rise to fame, fortune and power affects their futures.'Demi got her start on Barney and Friends in 2002 and appeared as Angela in 10 episodes of the children's show.",
        "As a teen she starred in Disney's As the Bell Rings sitcom, as well as the 2008 film Camp Rock.'There is no better film or topic for my directorial debut than this story, which is close to home,' Demi said in a statement about the film. 'Our project sheds light on important messages about growing up in the public eye, learning to protect our boundaries, and becoming active advocates of our own destinies. I'm humbled to be able to learn from the individuals who have lived the unique experience of child stardom and share their stories in our film.'The Child Star is expected to stream on Hulu in 2024.  "
    ]
}