{
    "articleURL": "/sport/football/article-12059337/Manchester-United-growing-doubts-David-Geas-position-clubs-starting-XI.html",
    "content": [
        "Man United have 'growing doubts' over David de Gea's position in the team It comes after the goalkeeper was guilty of a poor mistake against West Ham Concerns have been rising over his performances despite his clean sheet record Manchester United have 'growing doubts' over David de Gea's position as the club's No 1 according to reports.",
        "The goalkeeper was at the centre of the controversy on Sunday as Erik ten Hag's side suffered a disappointing 1-0 loss to West Ham at the London Stadium, with De Gea making a costly mistake - failing to deal with Said Benrahma's 20-yard shot which slipped over his gloves and into the net. It is one of several errors United's first choice goalkeeper has made in recent times, the most notable of those coming as the Red Devils crashed out of the Europa League after they were beaten by Sevilla 3-0 (5-2) on aggregate. De Gea's distribution was questioned during that match, while fans have claimed that his teammates were starting to 'grow tired' of his costly errors, and said 'it was time for him to go'.While Ten Hag rallied to defend the 32-year-old after the match, who still leads the way as the goalkeeper with the most clean sheets (15) this season, it appears concerns are starting to mount from within the club over his place in the starting eleven. ",
        "According to Manchester Evening News, 'some inside Man United have reservations over extending De Gea's contract' with the outlet also claiming that 'some figures at United want to move on from the Spaniard.'   His contract is due to expire this summer and despite overtaking legendary shot-stopper Alex Stepney this weekend to amass more appearances than any other goalkeeper in the club's history (540), the goalkeeper is yet to agree terms to renew his £375,000-a-week deal. ",
        "De Gea signed with the Red Devils back in 2011 from Atletico Madrid for £17.8million with the goalkeeper renewing that deal back in 2019 to make him one of the highest paid players in the squad. With that deal set to expire next month, it was rumoured that he was willing to accept a pay cut in order to stay at Old Trafford.On Sunday, Sports Agenda reported that talks over his new deal were progressing positively, with his manager also expressing his desire for the shot-stopper to renew his deal. 'We want him to stay and we want him to extend his contract,' Ten Hag said after the defeat by West Ham. 'He has the most clean sheets in the Premier League. We would not be here in this position without him.'I believe there are no concerns. It happens. As a team, you have to deal with it, show character, be resilient, bounce back and that's what this team will do.'We started well, we dictated the game, we created chances, we didn't take them, and then one mistake. In three days, twice individual mistakes makes us lose games.' And he is not the only person who has claimed Rice should stay at the club, with Eric Steele, the goalkeeping coach who pointed De Gea out to Sir Alex Ferguson, saying to Mail Sport: 'He's still in his prime.'",
        "‘He’s still young as a goalkeeper but look at the experience. He’s not going to be far off 550 games by the end of the season, and that’s at 32 years of age.‘I wouldn’t want him to be lost to Manchester United and the Premier League. Hopefully they will get this deal sorted and he stays part of the Ten Hag era.‘It’s down to David and the club. I think it’s about time it was sorted. We keep hearing it’s going to be resolved but we’re in May now. His contract runs out at the end of June. It would be nice to have an announcement to say which way it’s going.‘All I can say is that I would be very saddened to lose David after the 12 years he’s given.’"
    ]
}