{
    "articleURL": "/femail/article-12046863/FEMAIL-reveals-Royal-Family-members-regulars-London-Underground.html",
    "content": [
        "The Queen became the first reigning monarch to travel on the tube in 1969 For all the latest Royal news, pictures and video click here They might have access to luxury cars and historic carriages - but even members of the Royal Family can find that the Underground is the most efficient way of getting around London.",
        "The Prince and Princess of Wales made their first trip on the Elizabeth Line on Thursday when they travelled from Acton Main Line station to Tottenham Court Road to visit the Dog and Duck pub in Soho.Back in the 1930s, the Queen had her first experience of using the tube when she was a teenager with her younger sister Princess Margaret.  In the years that followed, Queen Elizabeth went on to make many Tube journeys and even had a railway line named after her in May 2022 - just four months before she passed away.  Camilla is also said to have used the underground from time to time to get around London before she became a senior royal. ",
        "What's more, King Charles also made journeys with his father Prince Philip in the late 1960s.Following Prince William and Kate Middleton's Elizabeth Line outing, FEMAIL reveals all the royals who have tapped in and tapped out of the London Underground over the years.  The Queen Queen Elizabeth herself has taken the underground on multiple occasions, starting when she was just 13 years old.She took the tube with her younger sister, Princess Margaret who was nine at the time, and their governess, Marion Crawford.The Princesses were pictured leaving the Young Women's Christian Association, near Tottenham Court Road.",
        "The Queen also officially opened the Victoria Line in 1969, named after her great great-grandmother, Queen Victoria.Her Majesty, aged 42, rode two stops from Oxford Circus, in central London, to Victoria train station.",
        "During the journey the Queen took control of the train in the driver's cab while at Green Park - the closes stop to her home at Buckingham Palace.Pictures show the Queen sat on the plush new seats in a brown fur coat, a colourful blue dress and polished black shoes.This was a particularly special and iconic journey as the Queen became the first reigning monarch to travel on the London Underground.She then went on to ride the London Underground on a number of occasions. In 1977 as she opened up part of an extension to the Piccadilly Line and travelled between Hatton Cross and Heathrow on the train.She also visited Aldgate station in 2010, to view a plaque in honour of those killed in the July 7 bombings in 2005. She also met with those who were working on that fateful day. ",
        "Her Majesty was also presented with a one-of-a-kind underground sign which said 'Buckingham Palace' on it. Queen Elizabeth boarded stationary carriage to mark the underground's 150th anniversary in 2013. Dressed in monochrome colours, the Queen was presented with an underground pass and she tapped out of Baker Street station, echoing what millions of commuters do every day. ",
        "In February 2016, the Queen visited the Crossrail station site at Bond Street, to mark the name change from Crossrail to the Elizabeth line.She unveiled the new purple Elizabeth Line logo which now features across the network and also matched her outfit for the occasion, wearing lavender to match with the tube colour's sporting a lavender suit, as she smiled with the new sign.  Last May, The Queen and The Earl of Wessex, visited Paddington Elizabeth line station to mark the completion of the new railway before it officially opened to passengers.King Charles",
        "In 1968, the King and his father, the Duke of Edinburgh, wore protective gear over their suits when they visited the underground.Prince Philip and Charles, who was around 20 years old at the time, were given a tour of London Underground's latest expansion routes. In 1979, the King officially opened the Jubilee Line, which was actually intended to be named the Fleet Line, but it was changed to honour the Queen's silver Jubilee in 1977.During the opening celebration, Prince Charles travelled in a carriage from Green Park to Charing Cross. After a short stop, the Prince continued his journey to the end of the line at Stanmore. A commemorative headboard, featuring a silver crown, adorned the front of the train for the occasion.",
        "In 1986, The King rode on the Piccadilly Line to Heathrow Airport with his wife at the time, Princess Diana. The royal pair made the trip to officially open Terminal 4, which costed £200 million and was built on the south side of the airport.Pictures show the Wales' riding with a driver at the front of the train. Queen Camilla ",
        "The Queen Consort took a one-stop trip on the Metropolitan Line between Farringdon and King's Cross with King Charles in 2013.The royal couple were there to celebrate the 150th anniversary of the first journey on the network. But the Queen Consort was already familiar with the underground, as she was an occasional user in her pre-royal days.They were presented with limited edition commemorative Oyster travel cards by staff which had been topped up with £10 credit for the £2.10 journey.Even the royals can't resist a little bit of Harry Potter, as Charles and Camilla were then taken to platform nine and three quarters at King's Cross station.Princess Diana ",
        "Other than her visit with Charles in the 80s, Princess Diana used to take the tube with William and Harry on multiple occasions. According to her former bodyguard, Ken Wharfe, the People's Princess rode on London buses and the Underground However, Diana could not use public transport too often because of security risks.  ",
        "Speaking to the Evening Standard in 2017, Diana's former employee said using public transport made her 'feel normal' - and most commonly jumped on buses.Wharfe reminisced and said:  'We used the London Underground too, but less often, as it presented more security difficulties. 'We did manage to achieve it a few times. She always saw these moments as major victories..'She once arrived at the beginning of the London Marathon in 1988 wearing a top with the famous London Underground logo on it.The Prince and Princess of Wales ",
        "The Prince and Princess of Wales travelled on the Elizabeth Line from Acton to Tottenham Court Road to go to The Dog and Duck pub in Soho.Kate looked stylish in her Eponine London coat, which she teamed with a white Suzannah dress, a white Mulberry bag, matching Jimmy Choo heels and Maria Black earrings.Whereas William was in black suit trousers, an onyx blazer and a blue formal shirt.",
        "The royal pair beamed and laughed as they chatted with members of staff on their way to Soho.Screen grabs from their official Instagram show Kate whizzing through the barriers as they scanned their cards. But this was not Kate's first trip on the tube as a royal, as in 2013, the mother-of-three joined the Queen when she visited Baker Street station.",
        "She was then pregnant with her first child, Prince George, and was pictured wearing a TFL 'Baby on Board' badge. "
    ]
}