{
    "articleURL": "/wires/aap/article-12052777/Country-roads-lead-Australias-technology-revolution.html",
    "content": [
        "Over rolling hills past vineyards, wineries, and paddocks filled with newborn lambs sits a narrow country lane scarred with potholes.",
        "A factory stands at the end of the bumpy road in Borenore, a village in central western NSW, where signs warn of snakes, and sleek silver fermenters loom large.This is the home of Cauldron, a high-tech start-up that raised $10.5 million in seed funding from the CSIRO's venture capital firm, Main Sequence, and Horizons Ventures, the private investing arm of Hong Kong magnate Li Ka-shing.Cauldron uses precision fermentation to create molecules for animal-free food, fibres and biodegradable plastic, the same well-established process that replaced the need for animal products in insulin.\"We're trying to supplement conventional agriculture as food scarcity or fibre scarcity becomes apparent from climate change,\" CEO Michele Stansfield tells AAP.\"We're moving into a sustainable industry to help the population.\"The Queensland government has also backed the company to the tune of $500,000 as a test case for a future food manufacturing facility in Mackay, the centre of sugarcane country.A new offshoot of a decades-old local business, Cauldron is shaping up to be a major player in synthetic biology - an industry the CSIRO estimates will be worth $700 billion globally by 2040.Despite the hype, the money and the big names, the company will always work best on a patch of land in regional Australia, far from tight-knit start-up communities in Sydney, Melbourne and Brisbane.",
        "Its expanding labs need to be close to sources of sugar and starch for fermentation and will work hand-in-hand with agriculture, Ms Stansfield says.\"Our heart is in the regions. There's absolutely no reason for us to be in cities.\"With these large facilities, we're going to look like a winery and you don't see wineries popping up in (Sydney's) Petersham.\"Cauldron is one of several ambitious tech start-ups outside the capitals alongside Gilmour Space, on Queensland's Gold Coast, carbon sequestration company Loam Bio, in Orange, NSW, and Newcastle renewable energy innovators MGA Thermal.Main Sequence partner Phil Morle says his quest to find the most valuable investment opportunities in Australia often leads him to the regions.The landmass and long history of highly-skilled industries like energy, engineering, mining and agriculture lend to a new era of manufacturing that looks to biology and nature for solutions.\"These times are exciting. I can't remember another time when there's been these forces lined up,\" Mr Morle says.\"More people have moved to the regions, so there's more people available to work, there's more natural production that can happen and there is government policy and intent to bring more sovereign capability back to Australia.\"Gilmour Space, which is developing hybrid-engine rockets, could never be based in a city, Mr Morle points out.",
        "\"You can't launch rockets from Circular Quay,\" he says with a laugh.Referencing US entrepreneur Peter Thiel's joke about technology promising flying cars but delivering 140-character tweets, Mr Morle says: \"These big flying car-type companies are appearing in the regions.\"But the nation must act quickly if it is to become a leader in the opportunities offered by country Australia.Mr Morle says high-profile Silicon Valley companies are already scouting Australian start-ups to help make their alternative food, fibre, and fuel products.\"We've got hundreds of years of working with the land on a massive scale in a climate-challenged environment. We've been practising for 100 years about what to do about climate change.\"Today there is as good as nowhere to get these products built, so the first country that breaks ground ... will have an incredible advantage.\"Australia will be the first in the world - or one of the first in the world - and people will have to go where the solution is.\"Across the road from Tomago Aluminium, the country's largest smelter, Newcastle-based MGA Thermal is developing energy storage blocks that may be used to retrofit power stations.Last year, AGL and the Australian Renewable Energy Agency announced the start-up would be part of a $1 million feasibility study into a thermal battery powering a steam turbine at the energy giant's gas-fired Torrens Island Power Station in South Australia.",
        "MGA Thermal chief technology officer Alex Post says it's critical to be based near the Hunter region, and next to its customers in the core of the east coast's energy supply.\"Renewable energy is really linked with regional development,\" Dr Post says.\"Our whole grid is transitioning from a centralised model where you have big power plants spreading out this spindly network to reach everywhere to distributed solar farms and wind farms across the entire country.\"If we do this right Australia could reclaim a position of a real industrial powerhouse because we have some of the best wind and solar in the world.\"Back in Borenore, Ms Stansfield sits in a small meeting room freshly painted \"Cauldron green\" ahead of an expansion after its recent funding.She hopes the federal government will pay more attention to country-based innovators.\"All the funding goes to Sydney ... so it's come down to the people in the regions to find their own money and do it themselves.\"I always say: this is Australia's opportunity to lose.\""
    ]
}