{
    "articleURL": "/sport/football/article-12038649/PLAYER-RATINGS-Martin-Odegaard-leads-example-Arsenal-win-Chelsea.html",
    "content": [
        "Arsenal cruised to a 3-1 victory over Chelsea in a Premier League London derbyThe Gunners now return to the top of the Premier League table after top displayBut Chelsea suffered another poor 90 minutes under boss Frank Lampard Arsenal kept up otherwise fading hopes of winning the Premier League title after crushing Chelsea in a London derby.",
        "In what looked like a tricky game on paper, the Gunners never gave their rivals a chance following a dominant display that saw them power to a 3-1 victory and go two points clear of Manchester City at the summit - albeit having played two games extra.Martin Odegaard opened the scoring early on before adding another on the half-hour mark.The skipper's second goal was followed three minutes later by a Gabriel Jesus effort to make it 3-0 and job done for the north London side before Noni Madueke struck a consolation goal in the second half. ]Mail Sport looks at how both sides fared at the Emirates Stadium. ",
        "ARSENAL (4-3-3)Aaron Ramsdale - 7Didn't have too much to do - but made a superb stop to deny Ben Chilwell in the first period before his back four largely gave him a 'night off'.Ben White - 5.5Didn't look too comfortable at right-back but Chelsea were never really at the races to take advantage of his off-colour display Jakub Kiwior - 6.5Nervous first few minutes saw him miss a header but he soon settled and justified his surprise team selection on his first Premier League start",
        "Gabriel Magalhaes - 6.5Seemed to spend most of the game going down and needing treatment for an injury. Crucial when he's fit though and it will be a concern how he eventually had to trudge off late in the game. ",
        "Oleksandr Zinchenko - 6Overloading from the left, the Ukraine left-back played his part in attack but was caught too advanced for Chelsea's consolation strike.Martin Odegaard - 8.5A brilliant attacking display. Took both of his goals superbly in a rampant opening half-hour for Arsenal to produce a captain's performance when his side needed it most. ",
        "Jorginho - 7Given a start against his former club and didn't disappoint. Retained and recycled possession effectively and didn't put a single foot wrong. Granit Xhaka - 7.5Ended the night with two assists for Odegaard - the first being a very clever low ball into the box. Alert throughout and unlucky not to score with a couple of half-chances. Bukayo Saka - 7Not involved with the goals but still a crucial cog in this Arsenal attack. A headache for the Chelsea defenders from the off and the Blues would have been delighted to see the back of him when he was taken off late on.Gabriel Jesus - 7.5Effectively ended the game when he fired home the third goal in the 34th minute. Did little afterwards but the Gunners had pulled the handbrake by then.",
        "Leandro Trossard - 7Effective on the flank and ensured no shortage of problems for Chelsea before he was given the rest of the night off before the hour mark.",
        "Subs:Kieran Tierney - 6A late replacement for Zinchenko and plugged any potential gap Chelsea could exploit down their right side. Reiss Nelson - 6Given a run-out so Saka could put his feet up, yet looked busy and to was involved in a late penalty shout to win a spot-kick in a call that went against him. Gabriel Martinelli 6.5Thrown on to try and build his confidence back up but the Brazilian striker had little to go on with the game already won. CHELSEA (4-3-3)Kepa Arrizabalaga - 5Saved his side's blushes early on with a save but then never had a command over his hapless defence or penalty box in general and was left beaten at corners  Cesar Azpilicueta - 5A bad night or signs of ageing legs? Poor header back saw him fortunate not to gift Arsenal an early goal before he then made a couple of late poor challenges. Wesley Fofana - 5Struggled all evening, and eventually had to depart with a minor injury having done little to limit Arsenal's constant attacks. Thiago Silva - 6Still performing to a ridiculous high standard at 38 and was Chelsea's most effective defender, clearing a shot off the line in the second half from point blank range. ",
        "Ben Chilwell - 6Forced a smart save from Ramsdale in the first half after a driving run forward but that's about as good as it got for the left-back. N'Golo Kante - 6Wasted a good counter attack for the Blues by choosing the wrong pass after a surge down the centre. Doesn't seem the player he once was in what has become a chaotic Chelsea side.Enzo Fernandez - 5.5Still waiting to see the performances that made him a World Cup star, and he was largely a bystander as Arsenal passed the ball around him at the Emirates.Mateo Kovacic - 6.5Not a difficult evening to be Chelsea's best midfielder but the Croatian takes the 'honour' thanks to an excellent sprayed pass to pick out Madueke for the Blues' consolation strike.Noni Madueke - 6.5Not a great night for the most part, especially after his cut-back from the byline failed to find a team-mate. Did though make amends with his first Premier League goal.",
        "Raheem Sterling - 6Like Aubameyang, his night just never got going and he never looked like causing any threat to the Gunners defence before being substituted.Pierre-Emerick Aubameyang - 4An utterly miserable evening. Nine touches and even four of those were from kick-off against his former side before being hooked at the break.",
        "Subs:Mykhailo Mudryk - 6.5Given 19 minutes to silence the boo boys having turned down Arsenal to move to Chelsea in January, and it's fair to say the Gunners won't be too down about 'having to settle for Trossard' instead. Kai Havertz - 6Came on at half-time for Aubameyang and in another night playing out of position as a lone frontman hardly had a sniff at goal. Not his fault, but never looked like changing the game or troubling the Gunners.Conor Gallagher - 6Came on soon after Madueke pulled a goal back but seemed to only bring stability to limit any more Arsenal damage rather than act as a game changing spark. "
    ]
}