{
    "articleURL": "/news/article-12057365/Husband-diver-died-accident-furious-Netflix-film-paints-character-murderer.html",
    "content": [
        "Netflix hit movie No Limit facing legal action over similarities to real diversHusband of Audrey Mestre, who died in 2002, tried to save her when divingAs television dramas go, it's undeniably gripping. Strikingly beautiful Roxana Aubrey is a rising star in the extreme sport of freediving, where competitors descend to the deepest depths of the ocean without oxygen. Such is her skill, she attempts to set a world record by diving 561ft below the surface of the sea on a single breath.",
        "However, the biggest threat to her lies not below the waves, but above them, in the shape of her abusive and jealous husband Pascal Gautier, whose own career prospects as a freediver are fading.Just minutes before his wife's dangerous stunt, he is shown furtively adjusting the inflatable airbag she will need to propel her safely back to the surface.Tragedy strikes when the safety equipment fails, and Roxana drowns.Suspicion falls on her envious spouse, who appears to have deliberately sabotaged her dive, condemning her to a terrible death.",
        "This, in short, is the enthralling plot of the 2022 Netflix hit movie No Limit. With a captivating script, steamy sex scenes and pitch-perfect acting, one can see why viewers were gripped.Certainly, it played its part in the streaming giant retaining its 231 million subscribers worldwide, and recording revenues of $31.6 billion last year alone.There's just one problem. While the film claims to be 'a work of fiction', it also simultaneously says it's 'inspired by real events'.And at the end of the drama, it displays a photo and biography of the inspiration for Roxana Aubrey — 28-year-old Audrey Mestre, a Frenchwoman who died free diving in 2002.At the time, she and her Cuban-American husband, Francisco 'Pipin' Ferreras, were indeed the world's most famous 'no limit' freedivers, setting record after record.",
        "But, in reality, Ferreras risked his own life to try to save his wife. And while he was criticised for not having enough safety measures in place at the time of the dive, Audrey's death was ruled an accident.No one ever suggested the preposterous theory that he actually killed his wife.Not surprisingly, Ferreras, now 61, has launched a lawsuit against Netflix.'They turned the story around and put it the way they wanted,' an outraged Ferreras tells the Mail. 'Why would I do something like that? We were in love.'I was so proud of Audrey and everything she did. I did everything I could do to save her that day. Every day I get attacked on social media — people saying I killed my wife.'Ferreras said he 'managed to get through half the film' before having to stop. 'I couldn't believe this was happening to me, to the memory of Audrey and to Audrey's parents who lost their daughter,' he says.As 'suggestions' go, it's hard to imagine one more serious, yet 'Trial by Netflix,' has become something of a televisual trend, thanks to the company's lucrative stock-in-trade docudramas which meld real-life events with gripping fictionalised narratives. Indeed, from heinous crimes to bed-hopping marriage breakdowns, it's often difficult to tell fact from fiction when watching Netflix, which has been blithe, to say the least, about using real-life events and tragedies as small-screen fodder.",
        "Perhaps the most famous example of this comes in the untrue storylines in The Crown, such as Prince Charles lobbying the then Prime Minister John Major to help overthrow the late Queen, and then trying to recruit his successor, Sir Tony Blair, as an ally to help pave the way for his marriage to Camilla Parker Bowles.Both Major and Blair have dismissed the scripts as nonsense.But there are other cases, too — and, like Ferreras, they have also taken legal action against Netflix. Last year, Georgian chess master Nona Gaprindashvili sought damages of nearly £4 million for the 'grossly sexist and belittling' allegation in the popular series The Queen's Gambit, starring Anya Taylor-Joy, that she'd never played against men.In reality, she had been a true trailblazer, facing 59 male competitors by 1968, the year in which the series was set.Then there's former Vanity Fair photo editor Rachel Williams, who's suing Netflix for her unflattering portrayal in Inventing Anna, the series about the New York con artist known as Anna Delvey, who shamelessly fleeced her society victims of more than £200,000.Despite rather brazenly containing the disclaimer, 'This story is completely true. Except for the parts that are totally made up', scriptwriters went on to depict Williams as an opportunistic hanger-on, accepting lavish gifts and trips from Delvey, before selling her out to the authorities when she learns that the young conwoman does not have a family fortune after all.",
        "Both Rachel Williams and Francisco Ferreras are being represented by British lawyer Alexander Rufus-Isaacs, who now practises in Santa Monica, California.'The pattern seems to be that the creatives who work on these programmes think they have a licence to bend the facts to make the story more exciting and dramatic, and they do not consider the effects on the real people involved,' he says.'The production team made a deliberate decision to make Anna Delvey more likeable as a type of Robin Hood character, and as a contrast to make Rachel a really unattractive person.'The effect on Rachel has been profound. On social media, she has become a pariah, and people who don't know her judge her on the woman who appeared in the series — a free-loading, shallow and self- centred person, when she is not like that at all.''If you are portraying a real person, or a character based on a real person, you should have a duty to that person to be accurate and fair about the portrait you paint. Because this is what the world is going to think of them.'As for Ferreras, Rufus-Isaacs says: 'This man lost his wife in a tragic accident and then, on top of the grief of losing her, to be accused of murder: it's a cruel thing to do. They were a happy couple who were in love, and he had no reason to kill his wife. In fact, he risked his own life to try to save her.",
        "'But the truth was not sufficiently dramatic for the makers of the film, who portrayed the marriage as deeply troubled. Audrey's parents are also aghast at his portrayal in the film and think it's diabolical that he has been portrayed as a murderer. They support him 100 per cent.'",
        "According to the Ferreras lawsuit, while 'No Limit' presents itself as fiction, there are striking similarities between the narrative presented in the film and the real-life facts in Audrey's case.Her husband, Ferreras, was already a champion freediver, with 21 world records to his name, when he met Audrey, an experienced scuba diver, in 1996 while she was studying marine biology at university in Mexico.The pair were definitely soulmates: 'no limit' freediving is, truly, only a sport for the brave. Divers can use any method they like to descend as deep as possible and ascend to the surface again.Weighted sleds are typically used to descend, and a gas-filled balloon to rise to the surface. The average time a freediver can hold his or her breath ranges from three to 11 minutes.After the couple fell in love, Audrey abandoned her university studies and began freediving with Ferreras as her instructor. They married in 1999 and a year later, Audrey broke the female world freediving record by descending to 410ft — around the height of a 40-storey building.",
        "In 2001, Audrey then broke her own record by reaching 427ft.However, she had competition from British-American Tanya Streeter, who set a new record for men as well as women with a dive of 525ft in August 2002.Ferreras, at this point, was taking a break from diving on doctors' orders, so when Audrey attempted a world-record dive of 561ft on October 12, 2002, at Bayahibe beach, in the Dominican Republic, her husband was there to assist and support her.While members of Audrey's dive team prepared her equipment, Ferreras carried out the final check, including making sure there was compressed air in the tank which she would use to lift herself back to the surface.According to the lawsuit, Ferreras determined that it did contain compressed air, but didn't use a pressure gauge to see how much air was in it.Audrey successfully descended to 561ft — but when she opened the valve on the air tank to inflate the lift bag, the sled did not rise.Monitoring the dive from the surface, Ferreras put on scuba gear and dived down 90ft, where he met a safety diver who was bringing Audrey's unconscious body up from the depths.Ferreras brought his wife's body to the surface as quickly as possible, risking the bends or passing out himself, but it was too late.A dive that should have lasted three minutes took eight-and-a- half minutes and, although Audrey still had a pulse and Ferreras and others tried to resuscitate her, she was pronounced dead in hospital.A report by the authorities in the Dominican Republic concluded Audrey's death was accidental, as did other inquiries. While Ferreras was criticised — for not arranging for more safety divers to be in the water with Audrey; for not arranging for a doctor to be in the support boat, for not providing more safety equipment and not using a pressure gauge to check that her air tank was full before the dive — no one suggested that Audrey's death was due to anything more than human error and a combination of other factors.Ferreras filed a lawsuit against Netflix last month, in which he named the streaming giant as well as the production company, Nolita Cinéma, and writer-director David M. Rosenthal, accusing them of defamation as well as invasion of privacy.Last year, Netflix settled out of court in the case involving Soviet chess grandmaster, Nona Gaprindashvili, who was also represented by Alexander Rufus-Isaacs.She'd argued that she'd been defamed in The Queen's Gambit, in a scene where the fictional Beth Harmon character, played by Anya Taylor-Joy, is competing in a 1968 tournament in Moscow.A chess commentator compares Harmon to the real-life Gaprindashvili, calling her the 'female world champion', but adds that she 'has never faced men', before panning to a character in the audience who resembles the real-life Gaprindashvili.Speaking from her home in the Georgian capital Tbilisi, the formidable 82-year-old claims she was 'surprised and hurt' by the distortions in the Netflix drama. She says they were 'almost impossible to endure', and decided to take on the streaming giant because 'the truth was on my side'.'I became [the] first woman to be awarded grandmaster rank among men,' she says.'I won all possible and impossible titles in chess due to my strong character. I never retreated, always struggled to the winning end, and accordingly made the only correct decision to start legal procedures defending my career and lifetime achievements.''It is very difficult to tolerate when your achievements are distorted in a series viewed by millions all over the world.'Netflix was approached by the Mail for comment on the Williams and Ferreras claims of defamation, but so far it has not responded.Rachel Williams — whose case against Netflix is still pending — says this hinterland between fact and fiction has become 'a particularly dangerous space'.'People sometimes believe what they see in entertainment more readily than what they see on the news,' she said.'This show is playing with a fine line — peddling it as a true story, but also [in the opening disclaimer] saying 'except for all the parts that aren't.''I think it's worth exploring at what point a half-truth is more dangerous than a lie.'"
    ]
}