{
    "articleURL": "/sport/formulaone/article-12057427/Max-Verstappen-romps-victory-ahead-Red-Bull-teammate-Sergio-Perez-Miami-Grand-Prix.html",
    "content": [
        "Max Verstappen endured an unfortunate qualifying session but his race pace was far better than his rivalsVerstappen overtook Red Bull teammate Sergio Perez to take the lead within just 21 laps of the race in MiamiDailyMail.com provides all the latest international sports news Max Verstappen, in the form of his life, does not require the boos of a pre-match crowd to inspire him.",
        "Nor would he unduly mind the jeers at the end. Not given the destructive manner of his victory in the Miami Grand Prix, a masterclass from ninth on the grid in a Red Bull admittedly operating like a magic carpet.'I call that simply f****** lovely,' he declared. Amid all the swank of this Floridian spectacle, the Dutchman proved that sporting substance still counts in modern Formula One, with his third victory of the season to extend his lead in the drivers' championship to 14 points over the poor sap who has the bitter-sweet experience of steering the same machinery.That individual is Sergio Perez and he started on pole. Flushed by success in Azerbaijan last week, the Mexican might have expected to repeat the feat across 57 laps around the Hard Rock Stadium.",
        "This expectation, realistically, was severely tested only a few minutes in as Verstappen chewed through the field as if they were standing still, despite being shod on hard – and supposedly slower – tires.End of lap one, he was up to eighth. Start of lap four, he put down his major marker, zooming past Haas' Kevin Magnussen and Ferrari's Charles Leclerc in one single move. Two for the price of one at the first corner.At this point, you could foretell the inevitable conclusion. Factored into this belief was the fact that Verstappen had shown himself the head-and-shoulders star performer through practice, only to fall victim to Leclerc's crash prompting a premature conclusion to qualifying on Saturday.",
        "It denied Verstappen a shot at a final flying lap. Perez had been off the pace all weekend, but lucked in, his time already banked. You could sense the dejection in team principal Christian Horner's voice: he had wanted a one-two on the grid. It didn't matter in the end, the race result showing Perez in second spot, with Aston Martin's Fernando Alonso finishing third.At least Horner could enjoy Verstappen in race mode. The defending champion made his next move at turn 17 of lap eight, taking Mercedes' George Russell.Lap nine, he made mincemeat of Alpine's Pierre Gasly. Lap 14, Ferrari's Carlos Sainz was the next lamb to slaughter. Lap 15, he left Alonso for roadkill.At this stage he was 3.7sec behind Perez, who, as we had just learned, was the most popular competitor among the 90,000 fans.",
        "That had materialized on the pre-race grid, the glitziest, flashiest, loudest parade imaginable from Williams' Fort Lauderdale-born Logan Sargeant's at the back to Perez starting at the front.That stretch of asphalt was a prized spot to be as LL Cool J, the now 55-year-old rapper, introduced the drivers, who entered through plumes of smoke, though the PA system was a touch muted. Here, of all places, the volume needed turning up.",
        "Not all the drivers welcomed the fanfare interruption to their preparations, but here in the land of F1's brave new world such considerations have to take runner-up spot.Perez emerged to the biggest cheers of the evening. Leclerc, Russell, Lando Norris, as well as Hamilton, were well-supported. The only one who attracted derision was Verstappen, introduced last because he bears 'No 1' on his car.He walked to the cockpit, his face like thunder. Or was he just concentrating on what was to come?Perhaps his moody behavior in Baku counted against him. Or the events of Abu Dhabi in 2021. Or maybe nobody much likes a winner.",
        "Whatever the reason, it did not disturb his countenance. Twenty laps later, as we pick up the race narrative again, he had closed to within 1.2sec of Perez, who was then pulled into the pits for new rubber. We were denied, at least for the time being, an on-track fight.So now Verstappen led. He was going to go long on his hards. Remarkably 35 laps in, he set the fastest time of 1min 31.225sec, later bettered by himself at the end. He would be coming in at some distant day for medium tires. Perez had moved from mediums to hards at his stop. This was all playing into Verstappen's hands.",
        "He finally pitted on lap 45, leading by 18.3sec. New tires, please. He came out 1.2sec off Perez, an impressive defender, in front. At the start of lap 48, Verstappen wriggled through as inevitably he was bound to and the lead was his, irrevocably. He was 5.3sec ahead at the end.Of all the celebrities on the grid, one was a former basketball player turned CBS analyst called Rip Hamilton. Which didn't bode well for Lewis.",
        "He had performed poorly on Saturday, only qualifying 13th. Russell was sixth quickest over one lap. Team principal Toto Wolff was moved to call the Mercedes 'a nasty piece of work'. All I would say is, it wasn't so bad in Russell's hands.And on Sunday Russell was superb. He notably passed Gasly and Sainz, a lovely move. 'That's how we roll,' he chimed over the radio.Hamilton was impressive a week ago in Baku and salvaged sixth here with a decent showing.Mercedes are looking for significant gains when they bring their major upgrade to Imola a week on Sunday. Given the false dawns, creeping advances and rapid retreats over the past 18 months, betting men wouldn't wager their houses on it."
    ]
}