{
    "articleURL": "/debate/article-12039151/SARAH-VINE-Making-Camilla-Queen-truly-revolutionary-hope-works.html",
    "content": [
        "Maybe it’s just me, but the more I read about the arrangements for Saturday, the less it seems like a Coronation and the more it feels like a wedding.",
        "It’s not just the dress code (hats and fascinators yes, tiaras and ermine no) and the celebrity guest list (Ant and Dec, Lionel Richie, TV magician Dynamo, British Vogue editor Edward Enninful, Kelly Jones, the lead singer of Stereophonics).It’s the fact that the ceremony will see the culmination of King Charles’s unwavering quest to ensure the woman he loves is acknowledged as Queen, not just in the eyes of God and the Church, but also in front of the entire world.Given the inclusive nature of the proceedings, and the fact that — compared to similar events in the past — the whole thing has been made much less formal, it may seem an arcane anomaly that Camilla will be fully crowned and anointed, in a ceremony of her own, as Her Majesty the Queen.But in Charles’s mind — and heart — that is no less than she deserves. She is and always was his queen — even when he was married to someone else.",
        "The moment the Archbishop of Canterbury places Queen Mary’s crown on Camilla’s head will be the one she is finally, unequivocally confirmed as legitimate.It is, in many ways, the ultimate romantic gesture from a man who has, if you believe in the divine right of kings, moved heaven and earth to bring about this moment.",
        "It’s a remarkable achievement when you think about it. There was a time, not very long ago, that such a thing would have been unthinkable. Only one heir to the British throne has ever married a divorcee, and it cost him his crown.Edward VIII died in exile as the Duke of Windsor, and not even on his deathbed could he persuade his niece, the late Queen Elizabeth II, to at least confer a minor title on his widow, Wallis Simpson.The idea that Charles could not only wed Camilla, but also retain his royal title and elevate her accordingly is extraordinary.People talk about the younger royals modernising the institution; but what Charles has done is little short of revolutionary. It’s testament to his tenacity as an individual; but also to the power of his love for her.But then he’s a Windsor man, and most Windsor men are, at heart, hopeless romantics. When they love, they love ferociously. Not just the late Queen’s uncle but also her father, Bertie, who proposed twice to Elizabeth Bowes-Lyon before finally succeeding on his third attempt.And then, of course, there’s Prince Harry, who has sacrificed his own life as a royal on the altar of his marriage. Whatever you think of his behaviour, there’s no denying his commitment and loyalty to his wife. Nor the fact that he’s paid a high price for it.",
        "In fact, as the Mail’s publication of Lord Ashcroft’s fascinating survey into the British people’s attitude to the Royal Family shows, the only member of the family less popular than the Duke and Duchess of Sussex (22 and 18 per cent approval respectively) is Prince Andrew (seven per cent).Interestingly, at 39 per cent the new Queen doesn’t rank too high either (the late Princess Diana, by contrast, is at 63 per cent), which worries me. It suggests that the King still has some persuading to do.There is no doubt in my mind that Camilla is a remarkable woman — warm, kind, sincere, intelligent, and all-round fabulous.She is the one of the best things that ever happened to Charles. I have no doubt that had he been allowed to marry her in the first place, things would have turned out very differently.But he wasn’t, and he didn’t, and there are still some who, while delighted to see him so happy, are not entirely convinced of Camilla’s right to be Queen. Will her anointment change people’s minds? Will her new title see her automatically rise in the public’s estimation?Or will her elevation be seen as a bridge too far — a King putting his personal feelings ahead of his historic duty to the Crown, and in so doing eroding not just his personal capital, but that of the monarchy? ",
        "I do hope the rumours that the Princess of Wales will wear a flower crown to the Coronation are false. Flower crowns are lovely, but — rather like ballet flats — they look ridiculous on anyone over the age of 12. ",
        "If it really is the case that senior civil servant Sue Gray was in talks about joining Keir Starmer’s team at the same time as she was fronting Whitehall’s damning investigation into Partygate, then I’m afraid her whole report will have to be dismissed as a farce. To be honest, though, even if it transpires that she was not in direct communication with Sir Keir, the fact that she is now slated to be his chief of staff clearly invalidates any credibility she might ever have had. I mean, seriously: they might as well have put Alastair Campbell in charge. Interesting choice of Lizzo to entertain guests at the Met Gala. Incredibly talented young woman; but not what you might call your average-sized fashion plate.Not that it matters, of course — except that Karl Lagerfeld, to whom the evening was dedicated, was famously incredibly fat-phobic and used to say that ‘no one wants to see curvy women’.",
        "Prison pond lifeA female prison worker has been suspended after allegedly being caught ‘behaving intimately’ with the killer of Zara Aleena in Belmarsh prison.",
        "Firstly, how can such a thing happen in one of the country’s supposedly most secure jails; and second, what kind of a depraved lunatic could entertain doing such a thing with a man who sexually assaulted and murdered a young woman as she walked home from a bar?Talk about pond life.",
        "Thousands of pupils are due to start their GCSEs and A-levels in a few weeks’ time — so what do teachers do? Tack an extra day onto their bank holiday. I’m sorry, but any teaching union that genuinely cared about children’s educational outcomes would issue a moratorium on strikes around exam season. It’s clear from yesterday’s action that they couldn’t care less.Being fat is not a crime A lot of people seem awfully cross about these weight-loss jabs — Ozempic, Wegovy and so on. They seem incensed at the idea that fat people should somehow be given the means to lose weight without having to ‘suffer’.It goes hand in hand with the idea that if you’re overweight you are somehow morally and mentally deficient, lazy, ill-disciplined, ignorant — and should be punished for it.And so instead of welcoming an effective solution to the growing problem of obesity in society, one that could ultimately save the NHS far more than it would cost by preventing countless obesity-related illnesses, the conversation turns to how it’s somehow cheating.",
        "Of course it would be better if everyone could have the perfect Body Mass Index; but since they don’t, and science has devised a perfectly safe and effective solution, I really can’t see what the fuss is about.Given the latest ‘revelations’ from the Duchess of Sussex’s estranged family, I’m starting to see why she’s less than keen to see them.In the same way that she and Prince Harry can’t exactly be relied upon to respect the privacy of certain members of the Royal Family, her rag-tag lot seemed equally determined to cash in on her. Karma in action?",
        " Pedro rocks the Just William lookI can’t help feeling actor Pedro Pascal was taking neither himself nor the Met Gala terribly seriously when he turned up at Monday’s extravaganza in memory of Karl Lagerfeld.Nothing like a man dressed as a cross between Angus Young of AC/DC and Just William to remind us how ludicrous fashion can be.",
        "Trans cyclist win isn’t fairAustin Killips, a trans woman cyclist who went through male puberty, has unsurprisingly beaten her non trans women rivals in a major U.S. competition.The rules state trans women can compete in the female category if they have reduced testosterone levels of 2.5 nanomoles per litre for two years.Leaving aside the fact that a woman’s natural level is between 0.5 to 2.4 — so the threshold for biological males is right at the upper end of the scale — anyone who has undergone male puberty has a permanent advantage over anyone who has not in terms of muscle mass and stamina.It’s not dissimilar to asking a child to compete with an adult. It’s not a question of male or female, trans or non; it’s about what’s fair and what isn’t.",
        "Thursday's local elections will be the first in which voter ID is required. Labour is wailing that this will reduce the number of young people able to vote.But since it is impossible in this day and age to buy cigarettes or a drink in a bar, or get into a nightclub without possessing some form of photo ID — either a passport or a driving licence — surely this is unlikely to be an issue?"
    ]
}