{
    "articleURL": "/wires/ap/article-12048307/Kolkata-beats-Hyderabad-5-runs-Indian-Premier-League.html",
    "content": [
        "HYDERABAD, India (AP) - Mystery spinner Varun Chakravarthy bowled a remarkable three-over spell as Kolkata Knight Riders beat Sunrisers Hyderabad by five runs in the Indian Premier League on Thursday.",
        "Chakravarthy finished with 1-20 in four overs and defended nine runs off the final six deliveries, conceding only three, as Hyderabad was restricted to 166-8 (20 overs).This was after Rinku Singh´s 46 off 35 balls helped Kolkata reach 171-9 (20 overs).Kolkata had made a poor start with Rahmanullah Gurbaz falling for a first-ball duck, even as Jason Roy made 20 off 19 balls.Marco Jansen struck twice, picking up both Gurbaz and Venkatesh Iyer for seven runs, with the score at 16-2.Roy´s dismissal made it 35-3 in 4.4 overs, leaving a tough rebuilding job for the incoming batsmen.",
        "Singh and skipper Nitish Rana (42) then added 61 off 40 balls for the fourth wicket to resurrect the Kolkata innings.At 96-4, the job was only half done when Rana was out caught and bowled to Aiden Markram in the 12th over.Singh then put on vital partnerships with the lower-middle order batsmen, most prominently 31 off 18 balls with Andre Russell (24).Russell hit two sixes but Hyderabad kept striking at regular intervals and Kolkata´s scoring rate never picked any real momentum.Chasing a par score on a two-paced wicket, Hyderabad got off to a slow start. Openers Mayank Agarwal and Abhishek Sharma only put on 29 off 17 balls.",
        "Pacers Vaibhav Arora (2-32) and Shardul Thakur (2-23) picked up four wickets to rock the Hyderabad lineup. Russell dismissed Rahul Tripathi for 20.The big blow came when left-arm spinner Anukul Roy trapped Harry Brook lbw for a four-ball duck with the scorecard reading 54-4 in 6.2 overs.Like with Kolkata´s innings, the middle order propelled Hyderabad´s innings too. Skipper Markram and Heinrich Klaasen put on 70 off 47 balls for the fifth wicket.This is where the game turned for Kolkata with both set batsmen dismissed in the space of three overs.Chakravarthy then squeezed the lineup, bowling 18 out of the last 30 deliveries, and sent down eight dot deliveries.Abdul Samad kept the chase ticking as he scored 21 off 18 balls, with three fours, but he holed out to deep midwicket in the final over and Hyderabad fell short again.Kolkata thus secured the win to keep alive its hopes for qualification and now has eight points from 10 games - good enough for eighth place.___More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports"
    ]
}