{
    "articleURL": "/sport/football/article-12057755/Alan-Shearer-GRILLS-former-referee-Dermot-Gallagher-angry-TV-exchange.html",
    "content": [
        "Alan Shearer berated Dermot Gallagher as the former referee explained decisionThe Newcastle legend was furious at first half penalty being overturned His bullish onslaught in the studio made for a hugely awkward exchange Alan Shearer was involved in an extraordinary clash with ex-Premier League referee Dermot Gallagher on live TV during Sunday's coverage of Arsenal's 2-0 win at Newcastle.",
        "The Magpies' legend was seething after seeing a crucial penalty decision reversed. Referee Chris Kavanagh pointed to the spot just seven minutes into the game after Bruno Guimaraes' shot appeared to strike the arm of Arsenal defender Jakub Kiwior.However, on closer inspection it appeared the ball struck the thigh of the Poland international. Kavanagh reversed his decision after checking the pitchside monitor and Shearer reached boiling point in the TV studio. On punditry duty for Premier League Productions, Shearer was incredulous at the decision, as he grilled Gallagher with a bullish onslaught.'You think Dermot, or you know?' he asked Gallagher.",
        "'Well I’m convinced it’s hit the top of his thigh,' the former referee, clearly uncomfortable, responded.'Are you 100 per cent certain that’s hit the top of his leg and it’s an absolute howler from the referee!?' Shearer interjected.'Can you answer the question? Are you absolutely 100 per cent certain that's hit his leg on the replays that you’ve seen?'Because I can’t see it, you must have better eyes than I have, and why’s it taken seven replays if it’s that certain?'Expressing his thoughts further on social media, Shearer tweeted: 'The handball law is a complete f***ing mess.' Ian Wright, working alongside Shearer and Gallagher, said nothing while the grilling took place though chimed in at the end, siding with the former referee.",
        "He said: 'When I look at it, and I know people will say, \"Oh he's Arsenal\", when you look at it, the reason why you're as vexed as you are Al, is because that looks to me like it hits the top of his thigh. 'Why are they  looking at it so many times, that's the problem. You don't need to look at it so many times, you can see. I'm totally happy with the decision, it came off the top of his thigh!'",
        "The overturning of the original penalty award seemingly changed the direction of the game, with Arsenal awaking from an early match slumber almost immediately after.Martin Odegaard opened the scoring for the title-chasing visitors just seven minutes later, while they went on to spurn a number of presentable opportunities in an engrossing first half.'The penalty decision is a big one and probably rocked us more than it did them,' Newcastle boss Eddie Howe said afterwards. 'It was about keeping the ball better as Arsenal are a big transition threat. But we have four games to go and our destiny is in our own hands. We need to focus on that.'We have performed so well throughout the season. The players have been incredible for us. The consistency, mentality and attitude have been there. Now we have to go another level and that is always going to be hard. That is the challenge we face.",
        "'When you look at the four games we have, we will need the crowd and to stay united. 'Incredible support we have had all season. The noise was there today. We just needed to score and it would have helped us take off.'"
    ]
}