{
    "articleURL": "/wires/pa/article-12054791/Stella-McCartney-perform-conservation-focused-speech-Coronation-Concert.html",
    "content": [
        "Stella McCartney will deliver a spoken word performance with a conservation theme at the Coronation Concert to celebrate the crowning of the King and Queen.",
        "The speech by the fashion designer, who has championed a vegan lifestyle and sustainable design throughout her career, will reflect her and the King’s “shared passion for environmental sustainability”, the BBC has said.McCartney, who is the daughter of former Beatle Sir Paul McCartney and his late wife photographer Linda, was made a CBE earlier this year for her services to fashion and sustainability.Her performance will be part of a broader nature-themed section of the concert, which is being held in the grounds of Windsor Castle on Sunday.",
        "Classical-soul composer Alexis Ffrench and London-based singer-songwriter Zak Abel will also be part of the segment as they perform a rendition of a 1980s hit alongside a house orchestra, band and choir.A visual display will accompany the performance, with images spanning across the large screen at the top of the stage as well as being projected onto the facade of the castle.The performance will also be interspersed with footage of drone displays taking place above the Eden Project in Cornwall, an eco visitor attraction, and the Wales Millennium Centre in Cardiff.The section is due to end with a ‘Did You Know?’ video, which will reveal “little-known information” about Charles’ relationship with the natural world, the BBC has said.The broadcaster added that the stage has also been designed and built almost entirely of rental stock to make it as sustainable as possible, with the majority of the lighting being LED to improve energy saving.",
        "Take That, Katy Perry and Lionel Richie are also among the star-studded line-up as well as Italian opera singer Andrea Bocelli and Welsh bass-baritone Sir Bryn Terfel.The concert, produced by BBC Studios Productions, will be broadcast live on BBC One, BBC iPlayer, BBC Radio 2 and BBC Sounds from 8pm on Sunday."
    ]
}