{
    "articleURL": "/wires/reuters/article-12045383/Britains-Next-keeps-profit-guidance-quarterly-sales-edge-lower.html",
    "content": [
        "Q1 full-price sales down 0.7%",
        "Expects Q2 sales to fall 5%Keeps guidance for full-year profit of 795 mln stg(Adds detail on sales and outlook)By James DaveyLONDON, May 4 (Reuters) - British fashion retailer Next maintained its guidance for annual profit after reporting a smaller decline in first-quarter sales than it expected, saying it was too early in the year to change its outlook.British consumers have been squeezed by inflation that hit a 41-year high of 11.1% in October and has remained in double digits since, including March's stronger-than-expected reading of 10.1%.Next, which trades from about 500 stores and online and is considered a good barometer of how British consumers are faring, said on Thursday full price sales fell 0.7% in the 13 weeks to April 29, better than its guidance for a 2% fall.Next shares were up 1.2% in early trading.\"Although our first quarter performance moderately exceeded our sales guidance, we believe it is too early in the year to alter our overall sales expectations for either the half or full year,\" Next said.It stayed cautious, forecasting a 1.5% decline in 2023-24 full-price sales and pretax profit of 795 million pounds ($1.0 billion), down from the 870.4 million pounds made in 2022-23.Next forecast a 5% fall in second quarter full price sales, noting the same period last year benefited from unusually warm weather and pent-up demand for events such as weddings.",
        "It also said some of the first quarter´s success, particularly in holiday clothing sales leading up to Easter, may have been pulled forward from the second quarter.Next has guided to a 7% rise in prices for its spring and summer ranges.The group has shown more resilience than most to Britain's cost-of-living crisis and is considered by analysts to be one of the best run retailers in the country. Its shares are up 12% so far this year.In Next's first quarter, store sales fell 0.6%, online sales were down 1.6%, while finance interest income rose 7.4%.Next's statement made no comment on default rates in its credit business.On Wednesday, British bank Lloyds reported early signs of stress among some borrowers. (Reporting by James Davey, Edited by Paul Sandle and Christina Fincher)"
    ]
}