{
    "articleURL": "/femail/article-12038409/I-two-children-half-brother-trolls-say-burn-hell-want-marry.html",
    "content": [
        "Ana tracked down her half-sibling on Facebook after her father walked outRead More:  I got my lover's name tattooed on my ribcage - we only went out for a month and now he's blocked meA woman who shares two children with her half-brother is fighting for the right to marry her sibling.",
        "Ana Parra, from Barcelona, Spain, was abandoned by her father when she was a child.Growing up, the mother-of-two was aware that she had a half-sibling but didn't meet Daniel until she was 20 years old.She explained: 'My mother told me that my father had left us to start another family and that he had had another child.'Curious to know more about her extended family, Ana - who has not revealed her age - tracked down Daniel on Facebook.",
        "Although the mother-of-two didn't reveal when they met up for the first time, Ana says there were sparks between her and Daniel from the offset.She said: 'We didn't want to realise it, we were angry with ourselves because it was hard to admit and break that taboo: we are siblings even though we didn't feel that way.' Describing their first romantic interaction, the mother said: 'We were partying, we approached each other slowly and gave each other our first kiss.'However, the pair tried to pretend as though nothing had happened at first - but couldn't shake their undeniable chemistry.Ana added: 'We went our separate ways, we were somewhat ashamed of what had just happened.' Looking back on that life-changing night, Daniel said: 'That kiss broke all barriers, marked a before and after, it was like a reality check.'",
        "Despite their best efforts to keep away from each other, the pair met up a few days later - and have been inseparable ever since. 'Imagine liking a girl and, for a moral reason, being forbidden to be with her.' Daniel said. 'It's really hard to deal with.'",
        "While on holiday in London a few years ago, the half-siblings felt comfortable enough acting like a couple in public and decided to come clean about their relationship afterwards.'That was the first time we can say that we behaved, in public, like a real couple,' Ana said. 'We went out to dinner, we took walks. It was like an explosion of freedom.'Earlier this year, Ana and Daniel appeared on Spanish television to share their unlikely love story.She explained: 'We didn't feel like telling everyone our story one by one, so that's why we decided to tell it this way.'",
        "However, the couple were met with widespread criticism from online trolls.Ana explained: 'There are people who have written to us on social media telling us that we're going to burn in hell.' That said, Ana and Daniel say they've not let the criticism affect their relationship.The couple share two children, aged five and three. Although their children are aware that Ana and Daniel are half-siblings, the mother says they're 'too young to understand'. ",
        "Now the couple are fighting for the right to legally marry in Spain. Despite the fact that consensual incest between adults is legal in their country, the Spanish Civil Code prohibits marriage between direct relatives. Ana said: 'Societies must advance and not cling to traditionalism. Homosexuals were also not allowed to marry and now they can.'We love each other and that is what should prevail. We are not harming anyone. That is why we want people to know our story.'"
    ]
}