{
    "articleURL": "/wires/reuters/article-12038661/Kenyan-cult-leader-remain-prison-100-followers-die.html",
    "content": [
        "NAIROBI, May 2 (Reuters) - A Kenyan cult leader accused of ordering his followers to starve themselves to death will be detained by police until a hearing on Friday, a court ruled on Tuesday as investigators searched for more bodies in a forest where 101 corpses have already been unearthed.",
        "Kenyan authorities say the dead were members of the Good News International Church led by Paul Mackenzie, 50, who had predicted the world would end on April 15 and ordered his followers to kill themselves to be the first to go to heaven.The death toll stands at a total of 109 so far, with 101, mostly children, found in mass graves and eight people found alive who later died - but could rise further. The interior ministry said more than 400 people are missing in the surrounding area.Mackenzie, who is in police custody, has not commented publicly on the accusations against him nor been required to enter a plea to any criminal charge. Two lawyers acting for him have declined to comment.An investigator involved in the case, who did not wish to be identified, told Reuters that Mackenzie has denied ordering his followers to fast.Mackenzie and 17 other accused were initially presented before a magistrate's court in the tourist town of Malindi but the case was transferred to a court in the port city of Mombasa, where state prosecutions asked the court to detain all the accused for 90 days to allow for investigations.Prior to his case being moved to the court in Mombasa, Citizen Television showed Mackenzie appearing in court in Malindi, about an hour and a half away by car from the Shakahola forest where the mass graves have been found.",
        "He was wearing a pink shirt and jacket, standing alongside eight other cult members.Police took Mackenzie to his now closed church compound in the Furunzi area of Malindi town on Monday to conduct a search of the premises ordered by the court, one of his lawyers, Elisha Komora, told Reuters.Angry residents gathered and started throwing stones at the compound protected by a high wall and barbed wire on top. They later destroyed the front part of the wall, Komora said, adding that police had to fire teargas to disperse them.Mackenzie faces a number of charges relating to earlier alleged offences, but prosecutors have yet to issue a charge sheet in relation to the mass graves.Mackenzie had previously been arrested on several occasions dating back to 2017, in connection with a range of offences including child neglect and radicalisation, the Kenyan judiciary has said. He was acquitted of some charges while others were either dropped or not pursued, it said, for reasons that were not explained.The government's chief pathologist said on Monday that so far 10 autopsies had taken place, on the bodies of one adult and nine children. Most showed signs of starvation, while two children showed signs of asphyxiation, he said. (Reporting by George Obulutsa, Humphrey Malalo, Duncan Miriri, and Bhargav Acharya; Editing by Angus MacSwan, James Macharia Chege and Sandra Maler)"
    ]
}