{
    "articleURL": "/wires/reuters/article-12052135/US-safety-board-hold-forum-runway-near-miss-incidents.html",
    "content": [
        "By David Shepardson",
        "WASHINGTON, May 5 (Reuters) - The U.S. National Transportation Safety Board (NTSB) will hold a May 23 forum on the danger of runway incursions after a series of close call incidents raised questions about the safety of U.S. aviation.The NTSB is investigating six runway incursion events since just the start of the year. The board said the roundtable will bring together aviation industry, labor and government safety experts to discuss the problem and possible solutions.Last month, the Federal Aviation Administration (FAA) named an independent safety review team to look at ways to boost air safety after a series of near miss incidents in Texas, Boston, Florida as well as a near collision at New York's John F. Kennedy airport when a Delta Air Lines Boeing plane came to a safe stop after air traffic controllers noticed an American Airlines Boeing 777 had errantly crossed from an adjacent taxiway as well.The U.S. has not had a major fatal U.S. passenger airline crash since February 2009.\"We've made this one of our top priorities to move from not just zero fatal accidents, but zero serious near misses as well,\" Acting FAA Administrator Billy Nolen said last month.NTSB Chair Jennifer Homendy said she hoped candid discussions would \"spur meaningful, immediate action on the areas where we´re stalled.\"",
        "In March, the FAA said it was taking steps to improve its air traffic control operations and convened a safety summit. \"There is no question that we are seeing too many close calls,\" FAA Air Traffic Organization Chief Operating Officer Tim Arel said.The FAA in March issued a separate safety alert to airlines, pilots and others citing the \"need for continued vigilance and attention to mitigation of safety risks.Homendy said in February a FedEx cargo plane and a Southwest Airlines plane had come within 100 feet of each other in what could have been a \"terrible tragedy.\"Transportation Secretary Pete Buttigieg said recently the U.S. could not wait for the next \"catastrophic event\" before addressing the uptick in aviation close calls. (Reporting by David Shepardson; Editing by Josie Kao)"
    ]
}