{
    "articleURL": "/news/article-12057357/Tories-swept-Home-Counties-council-Labour-Lib-Dems-formed-progressive-pact.html",
    "content": [
        "Labour seized control of Bracknell Forest Council for first time in 15 years Read more: Starmer does not rule out working with Lib Dems in possible dealThe Tories were swept from power in a Home Counties council after Labour and the Liberal Democrats formed an extraordinary ‘progressive’ pact.",
        "Labour seized control of Bracknell Forest Council, in Berkshire, for the first time in a quarter of a century on Thursday, despite the Tories securing far more votes.The defeat followed an apparent local pact between Labour, the Lib Dems and the Greens, which saw them stand down candidates against each other in order to maximise the anti-Tory vote.Bracknell Forest had previously been a Tory stronghold, with the Conservatives holding 37 of the 42 seats, ahead of Labour on four and the Lib Dems on just one.But the unprecedented pact meant that, despite winning 45 per cent of the vote last Thursday, the Conservatives lost 27 seats on the council, leaving them with just ten.",
        "By contrast, Labour gained 18 seats, allowing it to take control despite securing just 32 per cent of the vote.The Lib Dems gained six seats despite getting only 16 per cent of the vote, while the Greens picked up two seats with a total vote share of just six per cent.",
        "Labour and the Lib Dems did not field candidates against each other in any of the council’s 15 wards, while neither party stood against the Greens in the ward in which it won its two seats against Tory candidates.Local party chiefs have refused to comment publicly on the apparent deal. But one party source told The Observer it reflected frustration at local Tory dominance.",
        "‘It’s really a story about how to make the best of it in a borough which is heavily skewed [towards the Tories],’ the source said. ‘Focus your attention on where you’re going to win. And that’s what’s happened.Lib Dem deputy leader Daisy Cooper said the pact was a ‘decision taken by a single local party’ and did not reflect national policy.Labour insisted it had ‘not done any deals’ nationally.Tory elections expert Robert Hayward said there was no precedent for a ‘progressive alliance’ on the scale seen in Bracknell Forest, but said it was unlikely to work on a national basis."
    ]
}