{
    "articleURL": "/wires/pa/article-12057069/Michael-Beale-frustrated-wasteful-Rangers-narrow-win-Aberdeen.html",
    "content": [
        "Michael Beale described Rangers as the “most wasteful team” he has ever seen after Sunday’s 1-0 home win over Aberdeen.",
        "On the day that Celtic retained the cinch Premiership title with a 2-0 win over Hearts at Tynecastle, midfielder Todd Cantwell gave the Ibrox fans something to cheer about in the 65th minute with his fine volley from a James Tavernier corner.Rangers had an experimental look to their side, partly due to injuries, but the Gers boss returned to a familiar theme as he bemoaned missed chances throughout the game.“We had some good moments with the ball all day,” said the former QPR boss, who revealed defender Ben Davies came off with a hamstring problem which could make him a doubt for next week’s game against Celtic.“Sometimes I feel that we are the most wasteful team in the final third that I have ever seen. We created unbelievable chances and didn’t take them.“We suddenly face two 80-yard dashes to our own goal. On another day we could find ourselves behind.",
        "“In the first 15 minutes of the second half we missed more unbelievable chances, and when the balls hit the bar I thought it wasn’t going to be our day.“I know it was their player who got the last touch (when Aberdeen captain Jonny Hayes inadvertently smashed a Rabbi Matondo cut-back against his own crossbar) but we have two or three players there.",
        "“It is not unlucky when we are missing these chances. After a while it has to be poor play or poor final pass, movement, decision-making.“It has happened in every single day since I came back to the club – we have missed incredible chances.”Asked if the current squad could provide answers or if new attackers were required, Beale appeared unhappy with the contribution of substitute Alfredo Morelos, who is leaving at the end of the season.The Colombia striker came off the bench with Scott Arfield, Glen Kamara and Scott Wright just after Cantwell’s goal.Beale said: “I think you saw a difference when Alfredo came on in terms of energy but not a positive difference as well.“I think we will need a focal point for the team, for sure.“Antonio Colak is not fit at the moment and Alfredo is obviously going to be moving on.“Fashion (Sakala) and Rabbi (Matondo) gave us a different type of front line and it was also nice to see Ianis Hagi get some minutes.“Throughout the game we had some passages of really good play but we have to be more decisive if we want to feel at ease at the end of the game.”It was a first defeat in eight for Aberdeen, who remain in third place, five points ahead of Hearts.",
        "Manager Barry Robson revealed that Ross McCrorie, twin brother of Rangers goalkeeper Robby, missed the game with a hernia injury, saying: “He had surgery, we hope to have him back pretty quick.”Robson was also unhappy with his side’s finishing, especially the two chances Luis ‘Duk’ Lopes  missed in the first half – a shot saved by McCrorie before he chipped the ball over the bar when again he only had the Gers keeper to beat.He said: “First half we should have scored a couple of goals. We had two brilliant chances to get a couple of goals up on Rangers.“You need to take them wherever you are, not just coming here. But it’s probably more important to take them here.“You have those two unbelievable chances in the first half – they don’t come much better than one-on-one chances.”Robson also complained about a first-half incident when Gers defender Connor Goldson tangled with Duk at the edge of the box, with referee John Beaton awarding only a corner.He said: “And then obviously the first half, is it a penalty or a free-kick outside as well? I don’t know.“It was one or the other. Where was VAR? Anyone see it? Where was it? I don’t know. Was it in the building today? I am being serious.”"
    ]
}