{
    "articleURL": "/tvshowbiz/article-12046433/Bec-Judd-ponders-buying-mechanical-cocktail-shaker-7-3m-mansion.html",
    "content": [
        "Bec Judd shares a glamorous $7.3million home in Melbourne with her retired AFL star husband Chris. ",
        "The swanky Brighton mansion certainly fits the couples expensive taste, and the WAG has now questioned whether her kitchen needs a fancy mechanical cocktail shaker. Posting to her Instagram story on Thursday, the 40-year-old shared a video from a bar at Chadstown that showed the fancy cocktail shaker in action. She captioned the clip: 'The cocktail shaker at City Fields at @chadstone_fashion. 'I need a slightly smaller one for home'. ",
        "The couple, who share children Oscar, Billie, Tom and Darcy, have made many renovations to their Spanish Colonial home to make it suitable for their needs. They spent $50,000 to knock out a column in their garage because it didn't fit their large Range Rover.   Last month, the mother-of-four was left distraught after she was refused service at a bottle shop.",
        "She took to Instagram and revealed she was turned away from a liquor store in New Zealand because she did not look 'old enough' to buy a bottle of wine. Posting to her stories, the influencer said she and her sister Kate were refused service because they could not produce identification to prove they were over 18 - the local legal age to purchase liquor. The siblings wanted to purchase a bottle of NZ Wairau River Rosé, when the incident occurred.",
        "Bec posted a picture to her Instagram showing the wine with the caption: 'Was excited to try this...'The glamorous mother-of-four then shared a video of the wine sitting behind the bottle shop counter.'Then she took [the wine] from us because Kate and I didn't have I.D.' she wrote, adding: 'I said we're old enough to have 18-year-old children.'Bec also included a photo of herself posing with her sister and included the caption: 'Just a couple of under-agers trying to get a bottle of Rosé.'"
    ]
}