{
    "articleURL": "/femail/article-12054299/Mike-Tindall-displays-MBE-medals-attends-Kings-coronation-wife-Zara.html",
    "content": [
        "Mike Tindall, 44, joined his wife Zara, 41, at the King's coronation in London CORONATION LIVE BLOG: Click here to follow live updates throughout the day Mike Tindall sported his MBE medal today as he joined some 2,000 guests, including royals, world leaders and celebrities, at the King's coronation.",
        "The former England rugby ace, 44, accompanied his wife, Zara, 41, who is Princess Anne's daughter, to the historic event at Westminster Abbey in London. Mike, who wed Queen Elizabeth II's granddaughter in 2011, was seen wearing three military-style medals for the service as he sat next to his wife among the other British royals.The medals included one shaped like a cross, which is his Member of the British Empire (MBE), which he was awarded in 2007 for his contribution to rugby. The sportsman helped England to World Cup victory against Australia in 2003.He also wore the Diamond Jubilee medal, which was created to mark 60 years of Queen Elizabeth II's reign back in 2012. It is made of silver and is embellished with a portrait of the late Queen, along with the year of the jubilee. ",
        "It was awarded to every member of the Royal Family, as well as members of the Armed Forces who had served for five years or more, emergency services workers, those who already held Victoria and George crosses and operational members of the prison service.Former I'm A Celeb star Mike's third medal was awarded to mark the 2022 Platinum Jubilee, which celebrated the late Queen's 70-year reign. It was handed to the same groups of people as the previous Jubilee medal, with around 400,000 being created by the Worcestershire Medal Service.   ",
        "In September 2022, Mike admitted he 'hates' wearing medals to formal royal engagements after coming under fire for sporting his honours at Queen Elizabeth II's funeral events. The ex-England rugby ace wore his MBE and Diamond and Platinum Jubilee medals as he joined his wife at the late Queen's state funeral. He faced some criticism online from people who questioned why he was wearing medals when he hadn't served time in the military.  Speaking on The Good, The Bad and The Rugby podcast he admitted he 'hates' wearing them but he 'can't control it'.He said: 'It has been an interesting one, we've had this discussion on the fact that I hate wearing them anyway. I think you would be the same because you class medals as a military honour. 'Any serviceman, I am deeply appreciative of your service and I have not served anywhere and actually haven't done anything to achieve those medals apart from being in the family.",
        "'So the Jubilee medals, obviously I got married in 2011, so 2012 was her Diamond Jubilee and you get a medal if you're part of the family.  'The people who work in her household get a medal, and if you've been serving in the armed forces for five years, and you're actively in service you get one too.",
        "'So it's harder for [people in the] military to actually get a Jubilee medal unless they served for a long time.'There's been a lot more as you get a lot more celebrations later in life, so 50, 60, 70, that's where I got one, and the other one was my MBE.'  After his fellow podcast hosts James Haskell and Alex Payne raised the topic of the online controversy surrounding the medals, Mike said it was 'unnecessary' because there is a 'strict dress code' and he 'can't control it.'He said: 'I did get a lot of unnecessary... you don't have to shout at me on social media by the way. You can just ask and if you just ask I'll probably reply to you, as one person did.'I can't control it, you get a uniform list and it says the dress code is strict, you wear a morning suit unless you're military.'For today's service, Zara accessorised her coronation outfit with some very pricey jewellery; the mother-of-three looked elegant in 18ct white gold drop earrings from Calleija, which retail for £29,900.",
        "Zara wore a smart blue and white custom dress by designer Laura Green as she arrived in London. She also donned a pale blue hat with chiffon detailing and wore her golden locks in a stylish updo. ",
        "Zara, who is the King's niece, lives on Princess Anne's Gatcombe Park Estate in Gloucestershire with her husband and their three children, Mia, nine, Lena, four, and Lucas, two. She was accompanied by Mike who picked up the colour of her outfit by donning a matching tie. Zara and Mike entered the Abbey hand-in-hand along with Princess Beatrice, Princess Eugenie, Prince Harry, Jack Brooksbank and Edoardo Mapelli Mozzi. Today's celebration comes after a late night for the couple, who yesterday partied at private members venue The Arts Club until 2am following a royal dinner.Zara and Mike have no official duties but are regulars at royal events, such as church services and the Jubilee.Zara is an accomplished equestrian and Olympian and despite being a granddaughter of the monarch and cousin of a future king, she has kept a relatively low public profile and often spends her weekends at sporting events.Last week the athlete was across the pond in Lexington, Kentucky for an equestrian competition with her steed, Class Affair.",
        "Other members of the Royal Family - including Zara's cousins Princess Beatrice and Princess Eugenie - joined the couple to kick off the celebratory weekend last night. The couple left Mayfair club Oswald's at 11pm after eating with other members of the Royal Family including Prince Andrew, Prince Edward and Princess Anne.",
        "The Tindalls then continued their evening at The Arts Club, where they left at around 2am and were photographed walking in the street looking for a taxi home.They were out just nine hours before the Coronation began at 11am at Westminster Abbey following the procession from Buckingham Palace, which started at 10.20am.One witness told MailOnline: 'After leaving Oswald's they carried on their evening partying at nearby the Arts Club where they left at approximately 2am.'The witness added that the Tindalls were then seen 'stumbling in the street while taking in all the Coronation bunting before getting into a taxi home'. Zara's uncle Charles had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the abbey from 6am to get one of the prime 2,300 seats inside."
    ]
}