{
    "articleURL": "/news/article-12040477/First-Republics-collapse-continues-cause-shockwaves-banking-industry.html",
    "content": [
        "First Republic was seized by California banking regulators Monday, and its assets sold to JP Morgan ChaseIt was hoped the move would calm markets, but by the close of trading on Tuesday some regional banks saw their share price plummetPart of the concern is the Federal Reserve's interest announcement at 3pm ET Wednesday: Many expect rates to rise again and put more stress on the system First Republic Bank's collapse on Monday has continued to cause shockwaves in the financial sector, despite JP Morgan Chase stepping in to calm the turbulence - with several regional banks seeing their share price fall by up to 28 percent on Tuesday.",
        "First Republic was taken over on Monday by the Federal authorities, and its assets sold to JP Morgan Chase.Jamie Dimon, chief executive of JP Morgan Chase, declared: 'This part of the crisis is over.' Yet concerns remained about the stability of numerous other midsize banks, and Wednesday's announcement by the Federal Reserve of a possible interest rate adjustment has only served to heighten anxiety.Some analysts believe the Federal Reserve is likely to raise interest rates once more. If it does, it will lead those with money in the banks to consider withdrawing it  and moving it to other, more lucrative, savings vehicles. ",
        "On Tuesday, shares in Los Angeles-based PacWest closed at $6.55 - down 28 percent in a day.Over the course of five days, PacWest's value dropped by 45 percent.Metropolitan Bank, based in New York City, was also suffering, and closed down 20 percent on Tuesday.In the last five days' trading, 32 percent has been wiped off Metropolitan's value.A third bank, Western Alliance, based in Phoenix, has been affected: their shares closed on Tuesday down 15 percent.The concern was not limited to those three: an index of regional-bank stocks fell more than 5 percent to its lowest close since 2020. Citizens, Trust and U.S. Bank each saw their share price fall by 7 percent on Tuesday. ",
        "The biggest banks also fell, but the declines were less severe.Bank of America closed down 3 percent; Wells Fargo was down 4 percent; and JP Morgan Chase was down nearly 2 percent. While experts have urged calm, saying consumers do not need to worry that we are headed to a similar crisis faced in 2008, there are suggestions that greater instability could mean further grief for midsized firms. Late last month, the credit ratings firm Moody's also downgraded 11 regional banks, including Zions Bank, Western Alliance Bank and Bank of Hawaii. The firm specifically cited fears over commercial real estate portfolios, with midsize banks bearing the brunt of high-interest rates and stress in the market. ",
        "A deal was announced on Monday that allows for an orderly failure of First Republic, following the announcement that JPMorgan Chase purchased the bank.Echoing the failures of Silicon Valley Bank and Signature Bank earlier in the year, the bank collapsed after investors abandoned the institution and pulled their shares in large numbers. While financial markets were calmer as the bank headed towards failure, depositors fled regional lenders on Monday over fears of more banks tanking. The KBW Regional Banking Index, an index of smaller regional lenders in the U.S., shed 2.7 percent, hitting a session low.",
        "Shares of Citizens Financial Group, PNC Financial Services Group, Truist Financial Corp and U.S. Bancorp fell between 3 percent and 7 percent. Valley National Bancorp, which owns Valley National Bank, lost more than 20 percent.",
        "Moody's expressed concerns over regional banks being more exposed to the commercial real estate market, which is being hard-hit by higher interest rates.Midsize banks are the nation's largest lenders for projects like apartment buildings, office towers and shopping centers.According to the New York Times, vacancy rates are climbing nationwide with office blocks empty as more staff work from home.  More than $1 trillion in commercial real estate loans will come due before the end of 2025, and as banks tighten their underwriting, many borrowers may struggle to refinance their debts, the outlet reports. However, some experts believe that any immediate fallout from First Republic is contained. 'Right from the beginning, when Silicon Valley started to collapse, the screens were run and the weak players were identified,' Steve Biggar, an analyst who covers JPMorgan at Argus Research, told the Times. 'I think the conclusion of First Republic at this point should alleviate a lot of the concerns about the banking crisis. All these banks are in stronger hands now.'",
        "Thanks in part to stricter regulations that were put in place in the wake of the Global Financial Crisis, fewer banks have gone under.",
        "But higher interest rates have chipped away at the value of assets on the balance sheets of banks, putting pressure on the financial system and making it more difficult for banks to pay back depositors if they decide they want to withdraw their money.Plus, the three American banks that have failed so far this year are bigger than the 25 that collapsed in 2008, data shows.The three banks held a combined total of $532 billion in assets, which - according to the New York Times and when adjusted for inflation - is more than the $526 billion held by all the US banks that collapsed in 2008 at the peak of the financial crisis.First Republic had approximately $213 billion in total assets and, at the end of last year, the Federal Reserve ranked it 14th in size among US commercial banks.Silicon Valley Bank, meanwhile, had $209 billion in total assets, while Signature bank had $110 billion - taking the combined asset total to $532 billion."
    ]
}