{
    "articleURL": "/wires/reuters/article-12054563/Soccer-Rejuvenated-Milan-Lazio-four-hopes-alive.html",
    "content": [
        "MILAN, May 6 (Reuters) - An early goal by Ismael Bennacer and a Theo Hernandez stunner gave AC Milan a much-needed 2-0 home win over Lazio in Serie A on Saturday, sending Stefano Pioli's side provisionally back into the top four.",
        "Milan, who had drawn four of their previous five league matches, moved up two places to fourth on 61 points, one ahead of fifth-placed Inter Milan and three more than Atalanta in sixth who both have a game in hand.Pioli suffered an early setback when forward Rafael Leao suffered what looked like a muscle injury and had to be substituted by Alexis Saelemaekers in the 11th minute.\"I just saw him, he was calm and feeling good,\" Pioli told DAZN. \"I honestly don't think, based on what he told me, that it's a particularly serious thing.\"If the team play is at a high level, we can do (even) better with (such) individuals, but it's important to play football well. Today we did even without someone as decisive as Rafa.\"Last season's champions took the lead in the 17th minute after Olivier Giroud took advantage of a Lazio defensive error to set up Bennacer inside the box for the midfielder to bundle the ball past goalkeeper Ivan Provedel.Hernandez delighted the San Siro crowd when he lobbed Provedel with a superb shot from distance to double the lead for Milan just before the half-hour mark.The Frenchman sped through the entire pitch to finish off an impressive solo effort, which started right outside Milan's own box.",
        "Disciplined Milan continued to dominate a Lazio after the break and substitute Malick Thiaw could have made it 3-0 after connecting with a corner, but his header went narrowly over the bar.Maurizio Sarri's men showed more intent late in the game, and Luca Pellegrini was close to pulling a goal back but could only find the side-netting with his close-range shot.Powerless Lazio, who suffered their third loss in four Serie A games, ended the clash with no shot on target.\"We gave (the win) away without reacting with conviction, except in the last five minutes of the second half. That was the problem today,\" Sarri told a press conference.Lazio stayed second in the standings and have a one-point advantage over Juventus, who travel to Atalanta on Sunday.Milan, who on Wednesday host Inter Milan in their first Champions League semi-final since they won the trophy in 2006-07, will next face Spezia in their bid to secure a top-four spot. (Reporting by Anita Kobylinska in Gdansk, editing by Ed Osmond and Pritha Sarkar)"
    ]
}