{
    "articleURL": "/wires/reuters/article-12040553/Fed-likely-hike-rates-hint-pause-tightening-cycle.html",
    "content": [
        "Central bank lifts rates by quarter of a percentage point",
        "Benchmark overnight interest rate now in 5.00%-5.25% rangePowell says Fed still sees inflation as too highBy Howard Schneider and Ann SaphirWASHINGTON, May 3 (Reuters) - The Federal Reserve moved its management of the post-pandemic economic recovery into a new phase on Wednesday with what may be the last in a historic series of interest rate hikes and heightened attention to credit and other economic risks.The U.S. central bank raised its benchmark overnight interest rate by a quarter of a percentage point to the 5.00%-5.25% range, as expected by financial markets, but in doing so dropped from its policy statement language saying that it \"anticipates\" further rate increases would be needed.The change doesn't foreclose the central bank's policy-setting committee from hiking rates again when it meets in June, but Fed Chair Jerome Powell said it was now an open question whether further increases will be warranted in an economy still facing high inflation, but also showing signs of a slowdown and with risks of a tough credit crackdown by banks on the horizon.\"We're closer, or maybe even there,\" Powell said of the end-point of rate increases that have boosted the Fed's policy rate by a full 5 percentage points in the 10 meetings since March 2022, a torrid pace for the central bank and one that may now warrant allowing some time for the impact to be felt in full.",
        "Using language reminiscent of when it halted its tightening cycle in 2006, the Fed said that \"in determining the extent to which additional policy firming may be appropriate,\" officials would take into account how the impact of monetary policy was accumulating in the economy.Top of mind: inflation and the impact of a credit tightening Fed officials feel is still evolving in the wake of both higher interest rates and a financial sector rattled by the recent failure of three U.S. banks.At a press conference following the release of the statement, Powell said inflation remains the chief concern, and that it is therefore too soon to say with certainty that the rate-hike cycle is over.\"We are prepared to do more\" he said, with policy decisions from June onward to be made on a \"meeting-by-meeting\" basis.He also pushed back on market expectations that the policy-setting Federal Open Market Committee would cut rates this year, saying such a move was unlikely.\"We on the committee have a view that inflation is going to come down not so quickly, it will take some time,\" he told reporters, and \"in that world, if that forecast is broadly right, it would not be appropriate to cut rates\" this year.'SOFT LANDING'Powell, however, agreed \"policy is tight,\" and said that makes it possible the central bank has done enough with rates, particularly given the developing strains in the economy, the possibility that credit tightening by banks may slow the economy more than expected, and a remaining Fed hope that a recession can be avoided.",
        "The Fed's policy rate is now roughly the same as it was on the eve of a destabilizing financial crisis 16 years ago, and is at the level which a majority of Fed officials projected in March would in fact be \"sufficiently restrictive\" to return inflation to the central bank's 2% target. Inflation is currently still more than twice that target.Economic growth remains modest, but \"recent developments are likely to result in tighter credit conditions for households and businesses and to weigh on economic activity, hiring and inflation,\" the Fed said in its statement.Yet job gains \"have been robust,\" the Fed said, and Powell noted that some recent data on falling job openings and lower earnings growth, coupled with historically low unemployment, supported the idea that the economy could slow without a dramatic rise in joblessness.\"The case of avoiding a recession is in my view more likely than that of having a recession,\" Powell said.Risks around a U.S. debt limit standoff between Republicans in Congress and Democratic President Joe Biden have added to the sense of caution about trying to tighten financial conditions further.The shift in the Fed's approach was reflected in U.S. interest rate futures, which showed broad expectations for no hikes at either of the central bank's next two policy meetings.",
        "U.S. stocks initially held onto gains after the release of the Fed statement, but fell later in the afternoon and closed lower. Yields on U.S. Treasury securities dropped sharply, while the dollar weakened against a basket of trading partner currencies.\"For me the key was a change of a single word, saying that they believe that they will be determining whether future raises are necessary, whereas last time they said that they are anticipating that further rate hikes will be necessary,\" said Sam Stovall, chief investment strategist at CFRA Research. \"With the word 'determining' in place of 'anticipating,' (it) is essentially telling the markets that the Fed is now on pause.\"(Reporting by Howard Schneider, Ann Saphir and Michael S. Derby; Editing by Andrea Ricci and Paul Simao)"
    ]
}