{
    "articleURL": "/wires/reuters/article-12049529/MORNING-BID-EUROPE-German-data-rear-view-mirror.html",
    "content": [
        "A look at the day ahead in European and global markets from Vidya Ranganathan.",
        "The euro is digesting a widely anticipated hawkish quarter-point rate rise from the European Central Bank, and is off its one-year highs. While ECB President Christine Lagarde was clear more tightening will come, markets are paring back their expectations for further rate rises.Preoccupied with the ECB and tightening credit conditions in the region, investors are likely to riffle over a bunch of delayed March indicators in Germany - chiefly industrial orders and consumer goods, both of which have been volatile.In the background, there's also evidence that travellers from a reopened China flocked to Europe during their May Day break early this week.Their luxury shopping has played no mean part in Europe's economies. An index of European luxury retailers is up 30% this year and French luxury firm LVHM has joined the league of top 10 global firms by value and become the first European firm to have a market cap of more than $500 billion.Swiss FX reserves are due too. The franc is at its strongest level in a couple of years as concerns over U.S. banks drive cash into safe havens, meaning there's opportunity here for the Swiss to recoup the reserves they lost to bond market volatility in 2022.Speaking of the Swiss, UBS is reviewing options for Credit Suisse's Swiss bank, including potentially keeping the unit's investment banking operations while selling the rest, Reuters reported.",
        "Non-farm payrolls data is the main thing on the watchlist during U.S. hours. Tightness in the labour market is a given, so the questions are around how the Fed balances falling unemployment with its need to see inflation trend lower.Key developments that could influence markets on Friday: Economic data: German March industrial orders, Swiss forex reserves, UK PMI, US non-farm payrolls.(Editing by Jacqueline Wong)"
    ]
}