{
    "articleURL": "/wires/ap/article-12047489/Review-Lily-James-Shazad-Latif-anchor-charming-rom-com.html",
    "content": [
        "The romantic comedy may be on the endangered genres list in Hollywood, but thankfully our friends in England have continued to concoct and export enjoyable confections at a steady clip. Earlier this year, we were treated to the delightful \"Rye Lane,\" a vibrant and fresh take on the meet cute that´s currently streaming on Hulu. And now we have \" What´s Love Got to Do With It? \" starring Lily James as a documentary filmmaker, Zoe, who turns her lens to the arranged marriage of her childhood friend, Kaz (Shazad Latif).",
        "Within a conventional rom-com package, the ending of which isn´t the slightest of mysteries, tropes are subverted, big questions are asked about marriage and love, and a warm spotlight is shined on Pakistani culture. Also Emma Thompson gets to drink and dance and say mildly offensive things to her daughter (James´ Zoe) and her best friends next door.The film, directed by Shekhar Kapur (\"Elizabeth\"), was written by Jemima Khan, a noted documentarian and an editor at publications like The New Statesman and Vanity Fair. She is also a generally glamorous woman about town who counted Princess Diana among her friends and had a high-profile marriage to Pakistani politician Imran Khan, with whom she shares two children. If not ripped from her own experiences, the film is a thoughtful distillation of her observations about arranged marriages and the common misconception that they are akin to \"a medieval chattel swap\" or a forced marriage, as Zoe pitches to some bro-executives in an attempt to get the greenlight for her next project.Zoe is straight from the rom-com playbook: Good at what she does professionally, bad at choosing boyfriends and partners. The filmmakers do give her the dignity of making her own choices and not requiring her to be adorably clumsy as a character trait.",
        "But her mom is getting anxious about the ticking clock and, meanwhile Kaz, who was born in England to Pakistani immigrants, has thrown her for a loop when he decides to go the traditional route and have his parents involved in choosing a life partner who he doesn´t meet in person until the wedding. While making the film, she starts to see some benefits in not starting with love but ending with it, especially as she sees some of the \"love marriages\" around her crumbling under affairs and disappointment. Latif and James have a subtle, but not insignificant, will-they-won´t-they chemistry that is fun to follow.Importantly, the script is self-aware about its \"white lens.\" Also ample time is given to Kaz´s mother (Shabana Azmi), who gets her own journey and arc with her children, one of whom is estranged for choosing a love marriage to a Caucasian.",
        "The biggest liability is the film's name, which is a straightforward question about marriage but also a very famous Tina Turner song (which is not used) and name of a 1993 biopic starring Angela Bassett. At the very least, it´s a little confusing.And the conclusion is a kind of shrug, at least when it comes to arranged versus \"love marriages.\" I guess it amounts to something along the lines of \"follow your heart\" and \"don´t push people away\" but that´s the sort of frustratingly vague advice that most have been trying to adhere to all along. The real takeaway, probably, is that no one should be turning to romantic comedies for life advice, just comfort and amusement, which this one has plenty of.",
        "\"What´s Love Got to Do With It?,\" a Shout! Studios release in theaters Friday, is rated PG-13 by the Motion Picture Association for \"some suggestive material, brief drug material, a sexual reference, strong language.\" Running time: 108 minutes. Two and a half stars out of four. - MPA Definition of PG-13: Parents strongly cautioned. Some material may be inappropriate for children under 13. - Follow AP Film Writer Lindsey Bahr on Twitter: www.twitter.com/ldbahr."
    ]
}