{
    "articleURL": "/wires/ap/article-12039301/Election-denier-Jim-Marchant-run-Senate-Nevada.html",
    "content": [
        "LAS VEGAS (AP) - Jim Marchant, a Nevada Republican who led a movement of candidates who promoted Donald Trump's lies of a stolen 2020 election, announced Tuesday that he will run for the U.S. Senate against Democratic incumbent Jacky Rosen in the swing state.",
        "The entrance of Marchant, who lost last year's race for Nevada secretary of state, may be another headache for national Republicans who are trying to prevent a repeat of the midterms. Voters in Nevada and other battleground states rejected candidates who ran on election conspiracies, allowing Democrats to increase their hold on the Senate.Democrats face an even tougher environment to keep their slim majority in 2024. Nevada is likely to be one of the nation's most competitive Senate races after hosting the closest contest of 2022. Democratic incumbent Catherine Cortez Masto eked out a narrow victory over another high-profile election denier, Adam Laxalt.Marchant, 66, has been a fierce supporter of Trump and his \"Make America Great Again\" movement and describes himself as a \"MAGA conservative.\" He's the first major Republican to challenge Rosen, a first-term moderate.\"There´s nothing more precious than our freedom and personal liberty,\" Marchant told about 200 invited guests at a suburban Las Vegas church. \"And I´m running for United States Senate to protect Nevadans from the overbearing government, from Silicon Valley, from big media, from labor unions, from the radical gender change advocates.\"Marchant, a former one-term state Assembly member who also lost a bid for Congress three years ago, raised his national profile last year as the organizer of a coalition of 17 GOP candidates who falsely purported that the 2020 presidential election was stolen from Trump. All but one of those candidates lost, including Marchant.",
        "Rosen, 65, was president of a prominent Jewish synagogue before defeating GOP Sen. Dean Heller in 2018. She has not drawn a party challenger since announcing last month that she would seek reelection in the perennial battleground state. Two unknown and nearly unfunded Republicans, Rhonda Kennedy and Stephanie Phillips, and an independent, Bradley Scott Wing, have submitted their names to the Federal Election Commission.\"While far-right candidates like Jim Marchant spread baseless conspiracy theories that undermine our democracy, I´ve always focused on bringing both sides together to solve problems and stand up for hardworking Nevadans,\" Rosen said in a statement.Federal campaign financial reports for the filing period ending March 31 showed Rosen raised more than $10 million for the race and had $6 million to spend. Marchant was not yet listed by the FEC on Tuesday. State election reports showed he spent almost $550,000 on his secretary of state bid.For the 2024 race, national Republicans are recruiting Sam Brown, a retired Army captain who finished second in last year´s GOP Senate primary, according to a GOP strategist who works on Senate races. The strategist, who was not authorized to discuss the effort publicly and spoke on condition of anonymity, said Republicans in Washington like Brown´s ability to raise money from the party´s grassroots and his profile as a war hero. Brown´s face was badly burned in a 2008 explosion in Afghanistan.",
        "Marchant appeared most often during his campaign for secretary of state at remote public places and on far-right media outlets including Steve Bannon´s \"War Room\" podcast, where he endorsed false election claims, including that all Nevada elected officials since 2006 had been \"installed by the deep-state cabal.\"In a brief interview following his Tuesday announcement, with campaign adviser Dick Morris at his side, Marchant did not walk away from his prior claims that the 2020 election was stolen, but said he was now focused on the future.\"I have serious doubts,\" Marchant told The Associated Press. \"I´ve been on record for a long time trying to prove how the election, I believe, was not up-and-up. I think it was probably stolen. There were a lot of ways they were able to figure out how to manipulate the system.\"\"All I want to do is go forward and make sure none of the other ones are stolen,\" he said.Marchant also toured rural Nevada counties last year to encourage local lawmakers to get rid of voting machines and adopt paper ballots. He was the architect of a hand-count in rural Nye County, which became one of the first jurisdictions nationwide to attempt the slower, less reliable method of counting votes.The Nye County effort was ultimately conducted alongside machines due to state regulations, a string of lawsuits and concerns from the Republican Nevada secretary of state, who was censured by the party for pushing back against false claims of widespread election fraud.",
        "Democrat Francisco \"Cisco\" Aguilar defeated Marchant in November, running on a platform of repairing trust in elections and protecting poll workers.Marchant and Laxalt, a former Nevada state attorney general, both lost their midterm races, even as Republican Joe Lombardo won the race for governor. Lombardo distanced himself from Trump at times during his campaign and never offered an endorsement of unfounded claims that the 2020 presidential election was stolen due to widespread fraud.Marchant´s defeat marked a pattern among election conspiracy theorists who sought to gain control of elections in competitive states. Among his coalition of 17 like-minded Republican candidates, only one was elected: Diego Morales, now secretary of state in Indiana. Election deniers lost all top races in swing states.\"I will be a commonsense, America-first, for-the-people senator,\" Marchant told the AP. \"That´s all that they want.\" ___Cooper reported from Phoenix. Associated Press writer Gabe Stern contributed from Reno, Nevada. Stern is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit program that places journalists in local newsrooms to report on undercovered issues. Follow him on Twitter: @gabestern326."
    ]
}