{
    "articleURL": "/wires/ap/article-12054937/Guardians-option-struggling-OF-Oscar-Gonzalez-minors.html",
    "content": [
        "CLEVELAND (AP) - SpongeBob is back in the minor leagues.",
        "Guardians outfielder Oscar Gonzalez, who became a sensation last season for playing the \"SpongeBob SquarePants\" theme song for his walk-up music, was optioned to Triple-A Columbus on Saturday to get more playing time.Infielder Tyler Freeman was recalled to take Gonzalez's roster spot.The 25-year-old Gonzalez has struggled at the plate, batting just .192 with one homer and five RBIs in 25 games. He's been platooning in right field with Will Brennan, and the Guardians are hoping to get him more-at-bats.\"April can be a pretty cruel month here,\" Guardians manager Terry Francona said. \"It can be a tough month and he made it tougher by chasing so much. We tried to tell him last night, we´re not asking him to walk. We just want you to swing at pitches you can handle because we think he´ll do some damage.\"Another component of the Gonzalez move is to get more at-bats for Gabriel Arias. He got the start in right field Saturday.",
        "\"He´s too important to our future,\" Francona said of Arias, batting just .180. \"He hasn´t swung the bat great, but we got to find a way to get him some at-bats, so we´ll work him into that mix in right field too, along with when he plays the infield, just to kind of get him some more at-bats.\"",
        "Gonzalez isn't the only Cleveland hitter not hitting. The Guardians' offense has been sluggish for much of the early season, one of the big reasons the defending AL Central champions are trailing the first-place Twins by 4 1 /2 games.The Guardians are batting just .224 overall and have only 17 homers, the fewest in the majors.Gonzalez was one of the many bright spots last season for the Guardians.As a rookie, he batted .296 with 11 homers and 43 RBIs in 91 games. He was also a postseason hero, connecting for a walk-off homer in the 15th inning to beat Tampa Bay in the wild card round and hitting a two-run single in the ninth inning to beat New York in the Division Series.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}