{
    "articleURL": "/femail/article-12051041/Beauty-fans-crazy-26-facial-tanning-mist-sold-TWICE.html",
    "content": [
        "SHOPPING — Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information.",
        "The Sunny Honey Bali Bronzing Foam from Coco &amp; Eve is so popular that one is sold every 20 seconds, with users claiming it's a 'holiday in a bottle'. Now the cult beauty brand has added a new product to the range, and it promises to make tanning your face effortless and flawless - and it's so popular that it's sold out twice already.   Coco &amp; Eve Antioxidant Face Tanning Micromist, 75ml Unlike oils and creams, which can be tricky to apply without streaks or patches, the Coco &amp; Eve Antioxidant Face Tanning Mist is an ultra-fine mist that evenly disperses over your skin to leave a natural, even glow. Fast-absorbing and lightweight, the mist is packed with hyaluronic acid-like active, which boosts skin's hydration by 40 per cent in only 30 minutes. £26 Shop",
        "Coco &amp; Eve's Antioxidant Face Tanning Micromist is set to end the endless problems associated with tanning your face (hello streaks, orange stains and missed patches).Using micromist technology, the easy-to-use mist allows for fast absorbing, lightweight application for a streak-free glow. Better still, it won't cling to any dry patches as it also promises to boost hydration by 40 per cent in 30 minutes for smooth, plumper-looking skin. It's no wonder why it's sold out twice already. Users of the Coco &amp; Eve Face Tanning Micromist have confessed to wanting to 'buy it in bulk' after raving about the 'flawless' and 'beautiful' results.",
        "Providing 'a beautiful golden glow to the skin', shoppers are faking a post-holiday glow, prepping their face ahead of the summer months.And it's even been given the seal-of-approval from 'serious beginners'. 'I am a serious beginner' wrote one shopper 'I was skeptical that I could apply a mist evenly and not look like a bruised fruit - and after trying I want to buy in bulk. Such a beautiful natural glow, evens out your skin tone - would probably use in place of a concealer!'.Hailed a face tanning 'game-changer', the mist is loaded with Balinese botanicals, passionfruit and HyalurosmoothTM, a hyaluronic acid-like active, which boosts skin's hydration by 40 per cent in only 30 minutes.",
        "Whether you're a beginner to fake tan or have tried and tested plenty of brands, the Coco &amp; Eve Antioxidant Face Tanning Micromist sets itself apart from the crowd thanks to its flawless results. One impressed user raved: 'This tanning mist is a must-have, especially in the winter as a few spritz will have your face looking perfectly sunkissed and glowy! The micro mist is brilliant for the easiest even application with no greasy feeling, obsessed!'.Another agreed, adding: 'By far the best self tanner I've ever used. Doesn't leave you looking orange and it smells amazing!'.",
        "A third penned: 'Adds a nice glow! I also spray my neck and chest and it just gives me a boost of sunshine!'.  "
    ]
}