{
    "articleURL": "/news/royals/article-12049103/One-not-invited-Not-grandchildren-Queen-Elizabeths-cousins-Coronation.html",
    "content": [
        "Grandchildren of Queen Elizabeth's cousins will not be at Coronation on Saturday For all the latest Royal news, pictures and video click hereA generation of young royals have been surprised to discover they were not invited to King Charles and Queen Camilla's Coronation.",
        "The grandchildren of Queen Elizabeth's cousins will not be at Westminster Abbey on Saturday – including Lady Amelia Windsor, who was dubbed the 'most beautiful member of the Royal Family' by Tatler magazine, and the King's godson Lord Nicholas Windsor.This is despite them having been at every other major event - with one even waving from the balcony at Buckingham Palace. And friends claim some are 'furious' at the snub.'They can't understand why they haven't been invited when they were invited to every other state occasion,' one pal said.",
        "In a reference to Prince Harry's attacks on the Royal Family, they added: 'They have never put a foot wrong and been the souls of discretion yet have been cast out. 'It's not right.'",
        "Zenouska Mowatt, the granddaughter of Queen Elizabeth's cousin Princess Alexandra, has also not been invited. The 32-year-old said: 'I'm not going to the Coronation, but I'm really looking forward to watching it [on television].'Zenouska was on the balcony of Buckingham Palace on the last occasion that Meghan Markle appeared, at Trooping the Colour in 2019 - her first public appearance after the birth of Prince Archie.She was so close to the Queen that Her Majesty made a point of being photographed with her at Windsor Castle in March last year when she was in failing health, just six months before her death.",
        "The Queen was pictured inspecting a collection of china made by the Royal Warrant-holding luxury goods business Halcyon Days, for which Zenouska is Head of Marketing.'It was a really lovely event,' she said. 'Everyone had very fond memories [of the Queen]. 'She was a very kind individual. Any time anyone spoke to her, she would make them feel like one in a million.'Zenouska said her mother, Marina Mowatt, 56, is invited to the event alongside her grandmother.Mrs Mowatt became known as the 'royal rebel' in the Eighties when she became pregnant outside marriage.Zenouska insists that she holds no grudges about not being invited herself. 'It's going to be fantastic and everyone is so excited,' she added.'I'll be with family anyway. My street is doing a street party.'",
        "Most of Britain's 24 non-royal dukes have also not been invited to the Coronation, as well as lower ranks of the nobility.The Duke of Rutland was dismayed and bewildered at the revalation. 'I have not been asked,' he said, adding that he did 'not really understand' why. He continued: 'It has been families like mine that have supported the Royal Family over 1,000 years or thereabouts.'"
    ]
}