{
    "articleURL": "/wires/aap/article-12039015/NZ-minister-Whaitiri-set-quit-Labour.html",
    "content": [
        "New Zealand Labour has been stunned by the defection of minister Meka Whaitiri to the Maori Party, strengthening the minor party's hand ahead of the October 14 election.",
        "The veterans affairs minister walked from the government on Wednesday, rebuffing Labour pleas for her to stay.Ms Whaitiri, a Labour MP for 10 years, said she was being \"called home\" by her responsibility to Maori.\"The decision to cross the floor is not an easy one, but it's the right one,\" she said, battling to suppress her emotions during an announcement at Waipatu marae in Hastings.Prime Minister Chris Hipkins was blindsided by the news, which broke as he was travelling to the UK for the King's coronation.\"I've not had any conversations with Meka about it. She's not really raised any concerns with me either,\" he told Radio NZ in London.\"I've left a message for Meka. I would expect if there was anything significant happening in that area that she would give me a call.\"Acting Prime Minister Carmel Sepuloni said everyone in Labour was \"very disappointed\" by Ms Whaitiri's move but the party was \"moving on\".Ms Sepuloni said Ms Whaitiri had not indicated specific problems with the government's record or approach.\"We haven't had a reason,\" she said.After hearing whispers of the move on Tuesday, Labour dispatched Justice Minister Kiritapu Allan to Hawke's Bay to make a last-ditch appeal to Ms Whaitiri.Deputy Labour leader Kelvin Davis said she would \"not be excommunicated\" by her former colleagues.",
        "\"As Maori, we're all related ... we don't want to create bad blood with her,\" he said.Ms Whaitiri said she was joining an \"unapologetic Maori political movement to achieve what was promised to us 183 years ago\" - a reference to the signing of the Treaty of Waitangi.Ms Whaitiri represents the Maori electorate of Ikaroa-Rawhiti, which takes in the east coast of North Island, including many of the communities hardest hit by Cyclone Gabrielle.Ms Whaitiri said she would sit with the Maori Party for the balance of this parliamentary term and stand for the party in October.Her exit sparked a parliamentary debate about whether she was eligible to remain as an MP, given laws that prevent the practice of \"waka jumping\", or changing parties.Speaker Adrian Rurawhe found Ms Whaitiri had not formally indicated she had joined another party, and he could not infer that she had done so, enraging opposition parties ACT and National.Opposition Leader Chris Luxon said the defection showed the government was \"falling apart\".As well as hurting Labour, the defection boosts the Maori Party.Polls have the Maori Party on track to hold the balance of power in the next parliament, meaning it could decide the next government in coalition talks.The party's current MPs, co-leaders Debbie Ngarewa-Packer and Rawiri Waititi, have not outlined whether they would support a Labour or National-led government.",
        "Ms Ngarewa-Packer said Ms Whaitiri's defection was a \"turning point\" for the party, founded in 2004.It supports Indigenous rights, arguing for the full expression of the Treaty of Waitangi, New Zealand's foundation document signed in 1840.Despite having more in common with Labour, the left-wing party supported the centre-right National Party during John Key's three terms as prime minister.Ms Whaitiri, who began her working life as a shearer before becoming a public servant and business leader, is also a former national-level netballer and softballer.She was made customs minister by Jacinda Ardern in 2017 when Labour came to power but was dumped in 2018 after allegations she bullied a staff member.Ms Whaitiri returned as a minister after Labour's 2020 election win but was passed over for a cabinet post during reshuffles by both Ms Ardern and, this year, Mr Hipkins."
    ]
}