{
    "articleURL": "/sciencetech/article-12059815/What-colour-womans-eyes-arent-actually-blue.html",
    "content": [
        "A picture of a woman has gone viral on TikTok, because all is not as it seemsThe eyes appears to be blue, but if you zoom in, they are actually grey Because our brains expect a person's irises to be blue, they appear as suchWhat colour would you say this woman's eyes are? Your brain will probably tell you they are blue.",
        "But it has fallen victim to a mind-boggling optical illusion, as it turns out that the model's irises are actually grey.This is made more obvious when the red filter is removed from the image and a grey bar is placed right next to the eyes.The trick was shared on TikTok by serial illusionist Dean Jackson, or @beatonthebeeb, who explains how it works.'Your brain detects the pigment - the grey area around the pupil - and it assumes that the red filter has trapped the blue light,' he said.",
        "'So it tries to help you out, as your brain should, by putting the blue colour back into the picture for you, and your brain is completely misleading you in the process.'At the back of the human eye are photoreceptors - cells that respond to the light shining in.These come in two types, 'rods' or 'cones', and while rods are sensitive to motion and night vision, the cones that are able to detect colour.Humans have three types of cone cells, and each of these are most sensitive to a particular colour, either red, green or blue. A red filter only lets through red light, so any other colours should appear as grey or black, including green and blue.The original image of the woman is in black and white, and it is only when the red filter is placed over the top that the eye colour appears blue. ",
        "However, if our brain recognises the context of the image and believes it should appear blue, it can interpret the grey light as such.Only about three per cent of the world's population have grey eyes, while between eight and ten per cent have blue. Therefore, when we zoom in to the image and it no longer looks like an eye, the irises appears to be the grey they truly are.",
        "Mr Jackson presented another example of this in a previous video, where he showed an image of a grey Coke can covered with stripes of a cyan filter.The stripes with the filter appear red for the same reason as above - because your eye expects it to be, despite the cyan filter blocking out all red light.However, the grey stripes without the filter also look red because of the principle of 'colour constancy'.This is the phenomenon that allows our eyes and brains to perceive something to be the same colour under different lighting conditions.However this ability can be tricked, and can make a colour appear different from what it truly is if it neighbours another one. In this case, a cyan stripe next to a grey stripe can make the grey appear red.",
        "A mind-boggling optical illusion can trick the brain into thinking a static black hole is expanding, researchers have shown. This 'expanding hole' illusion, which is new to science, has been created by Professor Akiyoshi Kitaoka, a psychologist at Ritsumeikan University in Kobe, Japan. In tests, 86 per cent of volunteers perceived the central black hole to be expanding, as if moving into a dark environment like a tunnel, or falling into a hole.The image is so good at deceiving our brain that it prompts dilation of the pupils, just as would happen if we were really moving into a dark area. Read more here"
    ]
}