{
    "articleURL": "/wires/ap/article-12059571/USAID-chief-Power-heads-Serbia-Kosovo-lower-tensions.html",
    "content": [
        "WASHINGTON (AP) - The United States' top international development chief, Samantha Power, is heading to Serbia and Kosovo this week to meet with leaders there, as U.S. and European leaders work to stabilize relations between those two former wartime enemies at a time of heightened tensions.",
        "Power becomes the first head of the U.S. Agency for International Development to travel to Serbia, which maintains close historical and cultural ties with Russia.Serbia and Kosovo have remained on often hostile terms since Kosovo's 1990s split from Serbia at the end of the Cold War. Frictions between Serbia and Kosovo, which has an ethnic Albanian majority and an ethnic Serb minority, have rebounded in the general tensions since Russia invaded Ukraine last year.Power is to meet with the prime ministers and presidents of both countries, encouraging both to stay on a path of normalizing relations between themselves and to keep moving toward membership in the European Union.She \"will underscore USAID´s support for Serbia´s path to European Union accession through our partnership to foster economic growth and democratic development,\" the USAID said in a statement.Power will be the first senior U.S. government official to travel to the region since the European Union brokered a meeting between heads of the two governments last week in Brussels, encouraging them to get back into peaceful dialogue.",
        "The EU has spent 12 years facilitating negotiations between Serbia and Kosovo. Kosovo declared independence in 2008, but Serbia does not recognize its statehood.Brussels and the United States often intervene to calm down tensions between the two capitals, more so in the past year since Russia attacked Ukraine.",
        "The war in Kosovo erupted when separatist ethnic Albanians rebelled against Serbia´s rule, and Serbia responded with a brutal crackdown. About 13,000 people, mostly ethnic Albanians, died. NATO´s military intervention eventually forced Serbia to pull out of the territory.Power also will meet in Serbia and Kosovo with members of civil society, business leaders, journalists and others, including Serbian former NBA player Vlade Divac and athletes with disabilities.___Semini reported from Tirana, Albania."
    ]
}