{
    "articleURL": "/news/article-12048543/Tennis-legend-Martina-Navratilova-slams-transgender-cyclist-Austin-Killips-win-race.html",
    "content": [
        "Tennis legend Martina Navratilova has slammed transgender cyclist Austin Killips' win at an international women’s road race on SundayMale-born Killips won the women's overall category at the Tour of the Gila event in New Mexico and claimed the Queen of the Mountains jersey The victory has been met with huge backlash and Navratilova has warned that more and more transgender athletes will dominate women's sportsTennis legend Martina Navratilova has slammed transgender cyclist Austin Killips' win at an international women’s road race over the weekend.",
        "Male-born Killips clinched the title in the women's overall category at the Tour of the Gila event in New Mexico on Sunday. She became the first transgender woman to win an official Union Cycliste Internationale (UCI) stage event and claimed the Queen of the Mountains jersey which led to enormous backlash.Navratilova became the latest to hit out at Killips' win with a post on social media and said women's sports 'is not the place for trans identified male athletes'.The former Tennis ace warned more and more transgender athletes will dominate women's sports. ",
        "She shared her thoughts on Twitter alongside an article about Killips' historic victory at the US race. 'This will happen more and more- women’s sports is NOT THE PLACE for trans identified male athletes,' she wrote. Transgender woman Killips finished 89 seconds clear of Italian Marcela Prieto in the general classification and also claimed the Queen of the Mountains jersey.The 27-year-old American was able to compete in the female field under the UCI’s current policy, which allows trans women to participate as long as their testosterone levels have been below 2.5 nanomoles per litre for at least 24 months.The UCI actually tightened their eligibility rules last year – halving the testosterone limit and doubling the transition period – shortly after a row erupted in Britain over the possible participation of Welsh trans woman Emily Bridges in a race with five-time Olympic gold medalist Laura Kenny.",
        "But cycling’s participation policy remains more relaxed than that of athletics and swimming, where all trans women are banned from competing in the female category at an elite level.Cycling's world governing body defended its rules around transgender participation. 'The UCI acknowledges that transgender athletes may wish to compete in accordance with their gender identity,' it said on Tuesday. 'The UCI rules are based on the latest scientific knowledge and have been applied in a consistent manner. 'The UCI continues to follow the evolution of scientific findings and may change its rules in the future as scientific knowledge evolves.'Navratilova has been openly lesbian since 1981 and has been an activist for the gay community but she opposes transgender women competing against biological women in sports.",
        "The nine-time Wimbledon champion, who recently beat breast and throat cancer, praised World Athletics introducing a policy to exclude transgender female athletes from women’s competitions and described it as a 'step in the right direction.''In the wake of World Athletics’ announcement, I think the best idea would be to have \"biological female\" and \"biological girls\" categories and then an \"open’ category,\" she wrote in The Times.'It would be a category for all-comers: men who identify as men; women who identify as women; women who identify as men; men who identify as women; non-binary — it would be a catch-all. This is already being explored in athletics and swimming in Britain.",
        "'Biological females are most likely to compete in the biological female category, as that’s their best shot at winning and it maintains the principle of fairness. With an ‘open’ category there are no question marks, no provisos, no asterisks, no doubts. It’s a simple solution.'Once somebody has gone through male puberty, there is no way to erase that physical advantage. You cannot simply turn back the clock, for instance by trying to lower testosterone levels.'Navratilova added that she hopes the decision will lead other sports to follow in the same direction.Killips competes for the Amy D Foundation - a team formed in memory of former American professional cyclist Amy Dombroski, who died aged 26 in 2013, with the aim of promoting ‘participation, opportunity and equity for women in cycling’.After winning the Tour of the Gila, she wrote on Instagram: ‘This win was possible thanks to the community and connections I've been fortunate enough to build over the years through bikes.‘After a week of nonsense on the internet I'm especially thankful to everyone in the peloton and sport who continue to affirm that Twitter is not real life.‘I love my peers and competitors and am grateful for every opportunity I get to learn and grow as a person and athlete on course together.’",
        "Killips was the subject of controversy last December when she finished third at the USA’s National Cyclocross Championships and was also accused of pushing another competitor off course.Hannah Arensman, a 35-time winner on the cyclocross circuit, finished fourth in that race and later retired from the sport citing the emergence of transgender riders.She said: ‘Over the past few years, I have had to race directly with male cyclists in women’s events.‘As this has become more of a reality, it has become increasingly discouraging to train as hard as I do only to have to lose to a man with the unfair advantage of an androgenized body that intrinsically gives him an obvious advantage over me, no matter how hard I train.’Commenting on the Killips case, former British Olympic swimmer Sharron Davies said: ‘This is beyond disappointing. Those in charge should hang their heads in shame. The UCI is not fit for purpose.’Ex-Canadian world champion cyclist Alison Sydor tweeted: ‘The current UCI rules that allow males to compete in female cycling events are not fair to female athletes.‘Time for UCI to admit this current rule situation is unsustainable and leaving a black mark on cycling as a fair sport for females.’"
    ]
}