{
    "articleURL": "/wires/reuters/article-12050455/Leedss-frail-defence-best-against-Man-City--Allardyce.html",
    "content": [
        "May 5 (Reuters) - Leeds United will have to produce their best defensive performance of the season if they hope to take points off Manchester City as they bid to retain their Premier League status, interim manager Sam Allardyce said on Friday.",
        "Allardyce was parachuted in on Wednesday in a desperate attempt to avert relegation after the Yorkshire club sacked Javi Gracia. Leeds are in 17th place, outside the drop zone on goal difference, and have taken one point from their last five games.He faces a stern test in his first game in charge on Saturday at City, who lead the table by a point with a game in hand over second-placed Arsenal and have won nine straight league matches, scoring at least three goals in six of those.The odds will be stacked against a Leeds side who have the worst defence in the top flight, with 67 goals conceded in 34 games.\"We hope we can find a space or two to cause them some problems,\" the 68-year-old Allardyce, who had never been relegated until taking West Bromwich Albion down in his last top-flight job, told reporters.\"We can't afford to miss any chances, we have to be ruthless and clinical and defensively the team will have to be the best it's been this season. Obviously, the defence has been a bit frail, but we will try to put this right.\"Asked about the problem areas he needs to address, Allardyce said: \"In possession I've always seen them to be very good, but out of possession recently has been, as everybody can see by the goals they've conceded, something that needed most of the work on.",
        "\"We have to balance the two. Carry on with the way you are playing in possession, creating openings, but make sure when you lose the ball you block off the openings. If you don't do that against Manchester City you are going to face big problems.\"Allardyce added that he and his backroom staff had attempted to lighten the mood at Leeds and make their training ground \"a nice place to come to.\"It's been a bit doom and gloom and we have to try to lift that,\" Allardyce said.\"We can do that to a certain degree, but the only way we lift that in the end is to start getting the results. We have to try to do that starting on Saturday because there are only four games left to try to survive in the Premier League.\"... I want the players to show we have made a difference and they are passionate enough to keep fighting all the way to the end.\"Leeds will be without Stuart Dallas, Tyler Adams, Liam Cooper and Luis Sinisterra for the game against City. (Reporting by Aadi Nair in Bengaluru; Editing by Ken Ferris)"
    ]
}