{
    "articleURL": "/wires/ap/article-12041389/UN-humanitarian-chief-arrives-Sudan-day-truce.html",
    "content": [
        "PORT SUDAN, Sudan (AP) - The U.N.'s humanitarian chief arrived in Sudan´s main seaport on Wednesday to seek guarantees for the safe passage of aid deliveries, as thousands of Sudanese and foreign nationals gathered there in hopes of fleeing the conflict-torn east African country.",
        "Martin Griffiths, the under-secretary-general for humanitarian affairs and emergency relief coordinator at the United Nations, tweeted that he came to affirm the U.N.'s commitment to the Sudanese people. He arrived in Port Sudan on the Red Sea on the last day of a shaky truce, meant to expire at midnight, which has not quelled the fighting.However, it is unclear how U.N. agencies can operate with limited staff and supplies amid the chaos, at a time of increasing concern about those trapped and displaced by the battle for control of Sudan. The fighting between forces loyal to two rival generals erupted April 15.Thousands of U.N. workers were evacuated a week into the fighting, and some U.N. agencies paused their services. The World Food Program suspended operations after three of its workers were killed in fighting in southern Sudan, but the agency has since said it will resume its work.The fighting, including unprecedented urban warfare in the capital of Khartoum, was preceded by months of escalating tensions between the military, led by Gen. Abdel-Fattah Burhan, and a rival paramilitary group called the Rapid Support Forces, commanded by Gen. Mohamed Hamdan Dagalo.At a virtual news conference from Port Sudan, Griffiths said he is seeking guarantees from the warring sides for the safe passage of humanitarian aid. He addressed criticism that the U.N. had not been doing enough by saying it was \"extremely difficult\" to work in Sudan.",
        "The World Food Program reported that 17,000 metric tons of food has been looted, including in Khartoum and western Darfour, out of 80,000 metric tons that the Rome-based agency had in Sudan, U.N. deputy spokesman Farhan Haq said.Even before the fighting erupted last month, a third of Sudan's population of more than 45 million relied on humanitarian assistance, according to U.N. agencies, which suffer from funding shortfalls.Six WFP trucks carrying aid to the western region of Darfur were looted on the road, Griffiths said. He singled out Darfur and Khartoum as badly in need of assistance.\"It´s not as if we´re asking for the moon,\" Griffiths said. \"We´re asking for the movement of humanitarian supplies and people. We do this in every other country, even without cease-fires.\"The conflict has so far killed 550 people, including civilians, and wounded more than 4,900. The fighting has displaced at least 334,000 people inside Sudan, and sent tens of thousands more to neighboring countries - Egypt, Chad, South Sudan, the Central African Republic and Ethiopia, according to U.N. agencies.More than 42,000 Sudanese who fled the war in their country have crossed into Egypt along with 2,300 foreign nationals since the crisis began, the U.N. refugee agency said. Aid workers are increasingly concerned about lack of basic services in these areas, and also in Port Sudan, some 830 kilometers (500 miles) from Khartoum.",
        "Early on, some Western countries, including France, Britain and Germany, airlifted hundreds of their citizens and other foreigners from airfields near Khartoum, Since then, the focus has shifted to Port Sudan as a base for those looking to leave. Many are still struggling to find a way out.Hundreds of Syrians, who came to Sudan fleeing their own country's civil war over the past decade, are among the foreigners to leave.One Damascus-bound flight took off Wednesday, a second was to follow later in the day and more flights were scheduled in coming days, said Tariq Abdel-Hameed, a Syrian in Port Sudan, He said priority was given to women, children and the elderly.For thousands of Sudanese and foreigners flocking to Port Sudan, it's the last stop before leaving the country. Saudi warships have been ferrying evacuees across the Red Sea to the Saudi city of Jeddah.\"It feels really sad to be leaving behind a part of your life,\" said Saadiya Abdulrahman, a Sudanese-American woman from Khartoum, while waiting with her daughter for their turn to board a Saudi vessel. When their turn came, they first got into a tugboat with dozens of others, to take them to the Saudi ship.\"Khartoum has become like a ghost town in some neighborhoods because of all the destruction,\" said Salah Suleiman, a Sudanese from Khartoum who was among those sailing to Jeddah.",
        "For those who can't afford to leave Khartoum, the most basic goods have become unavailable or unaffordable. Mercy Corps, an aid organization, said Wednesday that prices of basic goods in the city increased more than 130% on average while fuel prices increased more than ten-fold.On Wednesday, the fighting continued in and around the city. Clouds of smoke were seen over areas of active fighting, and residents hiding in their homes still heard sounds of explosions, with the battles still seemingly centered around key government buildings, such as the Presidential Palace.There were increasing signs of lawlessness in many neighborhoods, with reports that more diplomatic facilities were being targeted. Armed men stormed the building housing the office of Saudi Arabia´s cultural attaché in Sudan, the kingdom said Wednesday.A statement on the state-run Saudi Press Agency said an armed group \"destroyed equipment and cameras, seized some of attaché's property and disrupted the attaché´s systems and servers.\"Speaking from Kenya, U.N Secretary-General Antonio Guterres said the international community needs to come together and put pressure on the warring Sudanese generals to end the conflict.\"All need to use their capacity to put pressure for this horrible and I´d say unjustifiable conflict to stop,\" he said. \"The present situation is totally unacceptable.\"___",
        "ElHennawy reported from Cairo. Associated Press writers Jon Gambrell in Dubai, United Arab Emirates, and Evelyne Musambi in Nairobi, Kenya, contributed to this report."
    ]
}