{
    "articleURL": "/wires/reuters/article-12048191/Tigers-spoil-Justin-Verlander-s-debut-sweep-Mets.html",
    "content": [
        "Eduardo Rodriguez outdueled Justin Verlander in the latter's New York Mets and season debut and the host Detroit Tigers completed a three-game series sweep of the Mets with a 2-0 victory on Thursday afternoon.",
        "Rodriguez (3-2) allowed just two singles and a walk while striking out nine in eight innings. Rodriguez has allowed just two runs in his last five starts, spanning 34 2/3 innings.Alex Lange completed the shutout with a pair of strikeouts in the ninth while collecting his fifth save.Riley Greene and Javier Baez hit back-to-back homers in the first inning and that was all the support Rodriguez needed.Verlander (0-1) opened the season on the injured list with a teres major muscle strain. He signed a two-year contract with the Mets as a free agent this offseason.After the first inning, he settled in and wound up allowing five hits in five innings while recording five strikeouts.Greene pulled a Verlander curveball over the right field wall with one out in the first. The right-handed hitting Baez then drove a fastball to the opposite field to make it 2-0.Detroit had runners on second and third with two out in the third. Verlander got out of that jam by striking out Nick Maton.Andy Ibanez led off the bottom of the fifth with a double but was left stranded, as Verlander struck out the next two batters and induced a groundout from Greene.Rodriguez seemed to get stronger as the game went along. Starling Marte led off the fourth with a single. Rodriguez then retired the next 15 batters.",
        "He struck out Francisco Lindor, Peter Alonso and Tommy Pham in the seventh. He didn't record a strikeout in the eighth but set down Jeff McNeil on a grounder and Mark Canha and Eduardo Escobar on fly balls.Brandon Nimmo had a one-out single against Lange in the ninth but was cut down by catcher Jake Rogers trying to steal second. Lange then struck out Marte to end the game.--Field Level Media"
    ]
}