{
    "articleURL": "/tvshowbiz/article-12048111/Katie-Price-44-details-surrogacy-plans-pines-sixth-child.html",
    "content": [
        "Katie Price has revealed she would like to have another baby and has found a surrogate - who happens to be a fan.",
        "The former glamour model, 44, is already mother to Harvey, 19, Junior, 17, Princess, 15, Jett, nine, and Bunny, eight, but has thought about expanding her brood.Appearing on the Turning Adversity Into An Asset podcast, Katie revealed she doesn't think she could carry another baby herself.She said: 'I have got a surrogate, I haven't got any eggs anymore, I'm 44, I want another baby so what am I supposed to do? I can't pop it out.'When host Lewis Raymond Taylor asked who woud be having the baby, Katie said: 'I have got this lady, it will be my egg - she's been a fan of mine for years and she does do surrogacy.'",
        "Asked who the father would be, Katie replied: 'If I was with someone it would be with them, if not it would be a sperm donor.'Katie is in a relationship with Carl Woods, with the couple currently sunning themselves in Spain.Katie had eldest son Harvey with footballer Dwight Yorke. She shares Princess and Junior with her ex-husband Peter Andre and Jett and Bunny with her ex Kieran Hayler. Elsewhere during the interview, Katie also spoke about her earnings from OnlyFans where she shares racy lingerie snaps with fans who pay a subscription fee.",
        "Katie rubbished claims she had only made £150 in a single month from the site and insisted her earnings are far higher. She said: 'Do you think someone who has been doing that for a career for 25 years is only going to make £150?'Maybe put a couple more zeros on that and you'll be a lot closer. People only hear what they want to hear, and I think that's the damaging thing for more.'I no longer have to justify anything to anyone any more - I'm living proof that I can be knocked down to the gutter and come back up.' ",
        "The model has previously spoken of her desire for another child and was seen going to a fertility clinic with Carl last year.Katie and Carl have had a tumultuous relationship since 2020, including a series of very public bust-ups. They split once again in January but since the start of April their romance has appeared to be sailing smoothly. Earlier this month, Katie again slipped back on her engagement ring as it appeared to be clear that the couple were together.While more hints over recent weeks came in the form of re-following one another on social media, and Carl supporting his estranged partner as she appeared on TV show Jeremy Vine.",
        "Since beginning their relationship in 2020 and getting engaged a year later, the tumultuous couple have had a slew of public bust-ups - with their most recent split at the beginning of the year. Sharing an Instagram Story with her 2.6M followers at the start of the month, Katie snapped a picture of her left hand resting on her inked leg, once again sporting her engagement rock.Holding a glass of wine while appearing to soak up the sun, the TV personality wrote: 'Vibes' over the shot.",
        "Claiming that they are officially together and enjoying an Easter break, a source told The Sun: 'Katie and Carl are officially back together and they're off on holiday tomorrow - they're taking Harvey and want to get away and relax.'A lot of Katie's friends are worried about how on and off their relationship is, and how many rows they have but Katie doesn't want to hear it and just wants to go on holiday.' MailOnline contacted Katie's representatives for comment at the time. There have been many hints that Carl and Katie have rekindled their romance over recent weeks, with the most recent one coming from the latter's son Harvey.Earlier this week, she shared an image of herself and Harvey to Instagram, on which he had scrawled an adorable message. ",
        "Appearing to confirm that his mum was 'on' with Carl, he wrote over the picture: 'To the best family, mummy and Carl Woods.' ",
        "Posting the image on Instagram, Katie explained: 'Harvey just sent this he is so adorable I love him so much only two more sleeps until he comes home for Easter.'While before that, the former glamour model and her on-off fiancé followed each other on Instagram again.Katie and Carl got engaged after a whirlwind 10-month romance with car salesman Carl asking her mother Amy, her father and son Junior for their permission.Speaking to OK! Magazine about their engagement at the time, Katie said: 'It's refreshing to be with a man that if I decided I never wanted to work again, he'd look after me, I just love him.'But the pair have split a number of times since Carl popped the question to Katie, who has been married three times prior. "
    ]
}