{
    "articleURL": "/tvshowbiz/article-12038871/M-S-H-actress-Eileen-Saki-dies-aged-79-star-leads-heartfelt-tribute-sassy-Rosie.html",
    "content": [
        "Actress Eileen Saki – known for her role on the iconic show M*A*S*H – has died at the age of 79, it has been confirmed.",
        "Saki was known to fans for playing bar owner Rosie, the boss of Rose's Bar, on the beloved 70s comedy.Her co-star Jeff Maxwell confirmed the sad the news on his M*A*S*H Matters podcast. ‘Our sweet Eileen. Our sassy Rosie,' he said in a post on the official Facebook page for the podcast. ‘On behalf of her husband Bob, we extend sincere appreciation for the hundreds of M*A*S*H fans who filled Eileen’s final days with peace, encouragement, and love.‘She read every email and responded to as many as she could. Our sweet, sweet Eileen. How we love you. How we will miss you.’",
        "According to TMZ, family sources confirmed that the veteran actress passed away in Los Angeles on Monday after a battle with cancer. Saki's long career in Hollywood also included minor roles in classic comedy films like Splash in 1984 and History of the World, Part I in 1981. Three actresses inhabited the role of Rosie on M*A*S*H throughout its 11-season run from 1972 to 1983. Saki earned the distinction of being the last and longest-running Rosie – a fact which Jeff Maxwell acknowledged in another Facebook tribute. Maxwell – who played Private Igor Straminsky in the classic series – praised Eileen as an individual, lauding her 'energy' and lovable charm. ",
        "Recalling her as a guest on his podcast, Maxwell wrote: 'She was gracious, funny, engaging, insightful, adorable, filled with M*A*S*H stories, and exhibited more energy than I remember having twenty years ago. 'She spoke with great love for all the cast members but was particularly appreciative of her interaction with Executive Producer and director, Burt Metcalfe. The visit with her was pure joy as she filled every word with joy, life, and love.' Concluding his remarks, Maxwell called Saki 'a special woman,' adding: 'Eileen captivated you with a twinkle and smile in her soul.'",
        "Speaking with Maxwell on his M*A*S*H Matters podcast, Eileen opened up about her humble beginnings and her childhood dreams of becoming an actress.'I was raised in Japan, came here, English is my second language, but I knew at the age of four that I was going to be a performer.'The daughter of a gardener, Saki went on to explain how growing up poor inspired her to obtain a 'brighter life' for herself. 'We were very poor, and probably my psyche wanted to be somebody else. To have a brighter life and an entertaining life.'"
    ]
}