{
    "articleURL": "/wires/reuters/article-12055693/FC-Cincinnati-stays-perfect-home-holding-D-C-United.html",
    "content": [
        "Second-half goals by Luciano Acosta and Alvaro Barreal helped FC Cincinnati remain unblemished at home following a 2-1 win against D.C. United on Saturday.",
        "Acosta made it 1-0 in the 59th minute and Barreal added a score 14 minutes later for Cincinnati (7-1-3, 24 points), before Taxi Fountas made it 2-1 in the 90th minute.D.C. (4-5-2, 14 points) had a three-game winning streak end and lost for the first time ever at Cincinnati after three wins and two ties.Cincinnati extended its franchise record with its sixth win in as many home games this season.FCC had been outplayed until Acosta grabbed the lead in a strange manner.His left corner kick curled to the near post and bounced in, possibly off goalkeeper Tyler Miller. It was his second goal of the season and first since April 8 vs. Philadelphia.Acosta set up the second goal with a leading ball down the left flank to Barreal. He dribbled a yard inside the box and unleashed a low strike inside the left post for his first goal of the season.The goal was needed after Fountas got his third goal from the left side after the ball skimmed the head of Cincinnati defender Matt Miazga.FC Cincinnati goalkeeper Roman Celentano came close to his sixth shutout, which would have set a club record for shutouts in a season.He had five in 2022 and Przemyslaw Tyton did likewise in 2020.",
        "Celentano made four saves to become the all-time team leader in career saves with 118, three more than Tyton.D.C. nearly broke the scoreless game in the 24th minute when Ruan fired from the right edge of the penalty area, but Celentano got in front of the shot.Ruan was a last-minute starter after defender Andy Najar picked up an injury in warm-ups.D.C.'s next league match is May 13 vs. Nashville. Cincinnati returns to league play May 17 against Montreal in the second of three straight home matches.--Field Level Media"
    ]
}