{
    "articleURL": "/sport/football/article-12059589/Tranmere-0-1-Northampton-Town-Cobblers-seal-promotion-League-One-Sam-Hoskins-goal.html",
    "content": [
        "Northampton have sealed promotion to League One following a 1-0 victorySam Hoskins scored what proved to be the winner after just five minutes The Cobblers suffered final day heartache to miss out on promotion last year There was no final day heartache for Northampton Town this time around as the Cobblers secured the final automatic League Two promotion spot with a hard-fought 1-0 victory at Tranmere.",
        "With Leyton Orient and Stevenage already promoted to League One, anything less than three points for Northampton on Merseyside would have opened the door for Stockport to capitalise, who drew to relegated Hartlepool 1-1 at home after Hartlepool’s Ben Killip saved an injury time penalty from Callum Camps.This time last year Northampton were dramatically pipped by Joey Barton’s Bristol Rovers, who won 7-0 against Scunthorpe to seal the last automatic promotion place on the final day, by virtue of goals scored.It took just five minutes for Jon Brady’s side to take the lead at Prenton Park thanks to a stunning volley from Sam Hoskins for his 22nd goal of the season and they held on to ensure they returned to the third tier of English football at the second time of asking after they were relegated in 2021.Hartlepool, who were relegated to the non-league football pyramid for only the second time in their 115-year history last weekend, did well to keep the Hatters at bay in the first half but the breakthrough came shortly before half-time when Callum Camps was brought down by former Stockport striker Connor Jennings in the box.",
        "From the resulting spot-kick, Camps smashed it into the top corner, but Stockport were punished for failing to take their chances after the break.",
        "Callum Cooke silenced Edgeley Park with a superb strike from outside the box and though Stockport pressed for a winner, Killip made a terrific save to deny Paddy Madden before denying Camps from the spot in added time much to the delight of the travelling support, many of whom were dressed as cowboys for their annual fancy dress.For Stockport a two-legged tie against Salford City stands between them and a place at Wembley to play either Carlisle or Bradford City, after Mansfield missed out on the play-offs by a goal, despite their 2-0 win at Colchester. "
    ]
}