{
    "articleURL": "/news/article-12046939/BLM-wants-decorated-former-Marine-held-accountable-Jordan-Neely-chokehold-death.html",
    "content": [
        "The Manhattan DA's office is investigating the chokehold death of Jordan NeelyHe died on Monday after being restrained on the subway by another passengerNYC Mayor Eric Adams has urged caution in rushing to judgement, but Democrats including AOC have branded it a 'murder'  Black Lives Matter joined calls for the former Marine who put a schizophrenic homeless man in a chokehold on the subway to be held 'accountable' today as Democrats demanded he be charged with murder. ",
        "Jordan Neely, 30, used to be known as a fun-loving Michael Jackson impersonator who performed on New York City trains to commuters. In recent years, his family say he had suffered severe mental health problems and had 'lost it' after the 2007 murder of his mother. On Monday, Neely - who has 40 prior arrests from 2013 and 2021 including an assault on a 67-year-old woman - was traveling on the F train at around 2.27pm when he began yelling and throwing garbage, according to other passengers. He screamed that he had 'no food, no drink' and wanted to die. The former Marine - described as a 'decorated' sergeant who was an active servicemember until two years ago - put Neely in a chokehold to subdue him.  He and two other men on the train restrained Neely for a total of 15 minutes, according to the witnesses, until police arrived. ",
        "Neely was taken to the hospital, where he was pronounced dead. His prior arrests include multiple incidents of alleged assault, possession of drugs and criminal mischief.  A tweet by NAACP that BLM retweeted said: 'The latest example of inhumane vigilante justice is a complete travesty. Jordan Neely was restrained for 15 minutes, which resulted in the loss of his life, as onlookers watched and recorded. ",
        "'Those involved should be held accountable.' Yesterday, the medical examiner's office ruled Neely's death a homicide. Manhattan DA Alvin Bragg's office is now investigating his death. In a statement to DailyMail.com, a spokesman said: 'This is a solemn and serious matter that ended in the tragic loss of Jordan Neely’s life. 'As part of our rigorous ongoing investigation, we will review the Medical Examiner’s report, assess all available video and photo footage, identify and interview as many witnesses as possible, and obtain additional medical records. 'This investigation is being handled by senior, experienced prosecutors and we will provide an update when there is additional public information to share. 'The Manhattan D.A.’s Office encourages anyone who witnessed or has information about this incident to call 212-335-9040.' NYC Mayor Eric Adams has urged politicians and critics to wait for the DA's investigation before passing comment. ",
        "'There's a lot we don't know about what happened here, so I'm going to refrain from commenting further.' Democrats like AOC and NYC Comptroller Brad Lander have already dubbed the incident a 'murder.'She criticized Adams' statement, tweeting: 'This honestly feels like a new low: not being able to clearly condemn a public murder because the victim was of a social status some would deem “too low” to care about.' ",
        "The Marine was questioned by police but let go without charge. The NYPD officers involved are now working with the DA's office again as part of their investigation. ",
        "The homeless man's father Andre Zachery' said in a tribute today: 'Jordan was a good man. 'He was a good person. He grew up good. He always had a (temper), but he never used to hurt anyone... He wasn’t bad. He was beautiful.' Zachery said that his son began mimicking Michael Jackson at the age of four or five. 'He looked just like him. He used to perform on the block. One day, people were loving him. Michael!,' the grieving father said. Zachery went on to say that he had not seen his son for four years, adding that his son was autistic, rarely taking his medication, making it difficult for him to find work and was a high school drop out. The last contact he had with Neely was a letter that his son sent him from prison. It read in part, 'Dad, I disobeyed you. And I'm sorry.' After Neely's mother was killed by his stepfather, Shawn Southerland, Zachery said his son 'didn't care anymore.''Once his mother died...They were very close. He loved her so much that he just lost it.' "
    ]
}