{
    "articleURL": "/tvshowbiz/article-12042319/Carol-Vorderman-shows-impressive-flexibility-works-gym.html",
    "content": [
        "Carol Vorderman showcased her incredible curves in a pair of black figure leggings and a matching long sleeve crop top as she hit the gym on Wednesday.  ",
        "The TV personality, 62, took to Instagram to give fans a glimpse into her impressive workout in the gym.She showed off her amazing flexibility as she pulled her leg towards her head with a green band while lying on a mat and later stretched out to the side. The I'm A Celebrity South Africa star was all smiles as she posed for a photo in her gym kit and left her long blonde tresses loose while holding a water bottle. She showcased her natural beauty and added a pop of colour to her workout gear with a pair of neon green trainers. ",
        "Carol later trained her arms as she was seen performing pull ups on a rack. The former Countdown star penned: 'I love a gym workout with @meldeane12  BOOOM!'It comes after Carol left viewers in hysterics on Tuesday night's episode of I'm A Celebrity South Africa as she claimed she has 'Britain's most buoyant bottom'.She was taking part in a terrifying underwater challenge 'Tanks of Torment' that saw her swim through sea creatures to gain stars and meals for the camp.She was joined by Olympic athlete Fatima Whitbread, also 62, who showed off her almighty strength by using a lever to raise up trapdoors for Carol to swim through.",
        "Before starting the challenge, Carol confessed that an unusual problem could likely impair her in the task.She told a very amused Ant and Dec: 'The only problem I really have is, right, my bottom always floats to the top.'It's the most buoyant thing in Britain!'",
        "Viewers couldn't contain their laughter at Carol's very naughty confession as they rushed to Twitter.One joked: 'Never need armbands with Carol around!', while another simply exclaimed: 'HAHA Carol.'As Carol unscrewed the stars and added them to her bag, Dec couldn't resist making another reference to her famous behind.The cheeky presenter added: 'That's the problem with having Britain's most buoyant bottom. It's difficult to get down!', while Ant said: 'Very difficult!'But although she managed to win seven meals for camp, ultimately Carol wasn't able to complete the challenge.She appeared shaky from early on as she swam among the alligators, admitting: 'I'm really not happy about this.'Seeing a terrifying snake was the final straw for the TV personality as it forced her to quit the challenge altogether, despite Fatima's words of encouragement.A devastated Carol said: 'I can't do that. I'm not sure I want to do it. I've got this fear of drowning.'I have this real fear of drowning. And it's like my ultimate fear.'"
    ]
}