{
    "articleURL": "/wires/pa/article-12056395/Jim-Goodwin-remains-upbeat-Dundee-United-s-survival-prospects.html",
    "content": [
        "Dundee United boss Jim Goodwin insisted his side are still in a good position in their battle against the drop, despite his side’s 1-0 defeat to St Johnstone at McDiarmid Park.",
        "Saints’ captain Liam Gordon steered home just before half-time after United were unable to clear their lines and the visitors saw Charlie Mulgrew sent off in the second half as they failed to find a leveller.The defeat ended a run of three successive cinch Premiership victories and Goodwin urged perspective as he praised the attitude of his side.He said: “If we’d gone down without a fight then I would be very disappointed, but the character is there in the group.“We are in a decent position if you consider where we were prior to the Hibs game. If I was sitting here still five points adrift, I’d be very concerned. But we’re not.“We are still level on points with Kilmarnock, albeit Ross County have closed that gap.",
        "“It looks like it will be between the three of us at the bottom and we have great belief in the group.”St Johnstone manager Steven MacLean, meanwhile, played down the five point gap his side have opened up ahead of the teams below them as he praised the collective effort of his team.MacLean, who earned a point against Hibs in his first game in interim charge, saw the Saints win at home for the first time since beating Rangers 2-1 in early November.",
        "He said: “It’s massive but it’s only a cushion. I don’t look at other teams. People pointed out last week that teams had won under us but I’m only interested in our club and what we do.“I think you can see that we’re improving and we’re getting better and if win our games then we’ll be fine.“We don’t just defend as a back four. We defend from the front and also Liam Gordon has scored the goal so it’s a collective. We don’t work as individuals – we’ve got to be good as a group. I’m delighted for everybody.”St Johnstone have another home match against Motherwell next week and MacLean – who is relishing his role as interim boss – hopes they can use Saturday’s result to build some momentum and go on a run of wins.He added: “There’s improvement in this team. I think everybody can see that we’re getting there. We’re working hard in training. You can see slight changes that we’re making and hopefully they’re enjoying it as much as I am but I think we can get better too.“I want to keep winning. I’m not just about one or two games. I want to go on a run and I want to make this team better like I know they can be.",
        "“I want to concentrate on Motherwell next week. I’ll watch their games and we’ll work in training for Motherwell and try to win the game.”"
    ]
}