{
    "articleURL": "/tvshowbiz/article-12042631/Where-cast-Breakfast-Club-now.html",
    "content": [
        "READ MORE: The Breakfast Club mini reunion! Molly Ringwald, 54, and Ally Sheedy, 60, reunite for 'early-Christmas present-dinner' Since its release in 1985, The Breakfast Club has gone down as one of the most iconic teen films in history.",
        "The story centered on five teenagers who are brought together to serve a Saturday detention that's overseen by Vice-Principal Richard Vernon, and tackled the social constructs of high schools, and its many cliques, in the 1980s.Given it's been 38 years since the film hit screens, much of the cast look noticeably different to their teenage years, with varying degrees of success.Molly Ringwald also recently revealed that her daughter, 13, wouldn't watch the film with her, because certain scenes are less acceptable in the modern day. Star Anthony Michael Hall is also set to become a father for the first time at 55, as his wife Lucia Oskerova is pregnant with their first child.So, as the Breakfast Club marks 38 years since it hit screens, MailOnline takes a look back at how the cast of The Breakfast Club have changed...",
        "Emilio EstevezEmilio, now 60, was just 23 when he appeared in The Breakfast Club as 'athlete' Andrew Clarke, a high school wrestler pressured relentlessly by his domineering father.He has become one of the biggest stars to emerge from the film, having previously appeared in St Elmo's Fire before his role in The Breakfast Club.And during the 90s, his acting career hit another high with The Mighty Ducks - a popular movie about a children's ice hockey team.",
        "These days, the actor - who is the son of Martin Sheen and brother to Charlie Sheen - has undertaken very little acting work.Instead, he's ventured into directing, working on the 2006 film Bobby and The Way in 2010. In 2021, Emilio also returned to starred a Disney+ revival of The Mighty Ducks called The Mighty Ducks: Game Changers, but left the show after one season.Estevez has two children with his ex and former model, Carey Salley, and was married to Paula Abdul from 1992 to 1994.Molly Ringwald",
        "Molly, now 55, was one of the 80s' biggest teen film stars when she played 'Princess' Claire Standish, who was sentenced to detention for setting off a fire alarm.Despite enjoying success throughout the 1980s in several John Hughes films, including Sixteen Candles and Pretty in Pink, Ringwald was said to have turned down what later became acclaimed lead roles in Pretty Woman and Ghost in the 1990s.In recent years, she has starred in the ABC network's The Secret Life of the American Teenager, and has released a book of short stories - and a jazz record called Except Sometimes.Ringwald married her second husband, writer Panio Gianopoulos, in 2007. The couple have a daughter and twins.More recently, Molly has joined the cast of The CW's Riverdale as Archie Andrews' mother Mary, and is appearing in the show's seventh and final season.",
        "Anthony Michael Hall ",
        "As a child star, Anthony, now 55, grew up in the public eye before starring as 'Brain' Brian Johnson, and went onto take on a diverse range of parts to avoid being typecast due to his character in the film.The film saw Brian candidly discuss his struggles with mental health and constant pressures to perform at school, receiving sympathy from the other teens during detention together. After a successful acting career in his younger days, he went on to work for Saturday Night Live, and took on roles in Edward Scissorhands and The Dark Knight.Most recently, he appeared in the Oscar nominated film Foxcatcher, and next year is due to appear in War Machine alongside Brad Pitt, Will Poulter and Topher Grace - who is most commonly known for his role in That 70s Show.Hall made headlines in 2016 after being charged with assaulting his neighbour. He was subsequently sentenced to three years of probation. Antony married his wife Lucia Oskerova in 2020, and in February 2023 the couple announced they are expecting their first child.Judd Nelson",
        "Judd, now 63, played the 'criminal' John Bender in the film, who after a Saturday spent bonding with his classmates, ends up kissing Claire.His character brought the film to an end with the now-iconic scene, showing him punching the air triumphantly as he walked across the school field.",
        "Judd originally found fame as a member of the legendary Brat Pack, and in later years, Judd appeared in several well known films, such as Jay and Silent Bob Strike Back and the cult comedy Airheads.He's also made dozens of television appearances in series such as CSI: NY, Family Guy, and Two and a Half Men.Most recently, he played Billy Beretti in the TV series Empire alongside Terrence Howard. Ally Sheedy",
        "Ally, 60, starred as 'basket case' Alison Reynolds in the film, who undergoes a stunning transformation before sharing a kiss with athlete Andrew Clarke.She has continued to rack up movie and television acting credits since The Breakfast Club turned her into a star.Alongside with several of her colleagues, she too was considered by the press as members of the Brat Pack, and she later said she considered such a label as 'derogatory'.She has had continuous acting work since finding fame in the 1980s, and in 2022 she returned to TV in the Freeform series Single Drunk Female. In the early 90s, she married actor David Lansbury. The pair had their child, two years later, but divorced in 2008.In 2010, Ally's child Rebecca came out as a lesbian and in 2015 she transitioned to Beckett."
    ]
}