{
    "articleURL": "/wires/reuters/article-12038479/Regional-bank-stocks-plummet-First-Republics-demise-weighs.html",
    "content": [
        "By Niket Nishant and Chibuike Oguh",
        "May 2 (Reuters) - Shares of U.S. regional banks PacWest Bancorp and Western Alliance Bank plunged on Tuesday as the demise of First Republic Bank triggered investor concerns about the financial health of other mid-sized lenders.JPMorgan Chase agreed on Monday to acquire a majority of First Republic's assets in a $10.6 billion deal after regulators seized the lender, which became the largest U.S. bank failure since the 2008 financial crisis.Investors fear the latest turmoil, which began with the failures of Silicon Valley Bank and Signature Bank in March, could spread to other regional banks.The KBW Regional Banking Index fell 5.52%, hitting its lowest since December 2020.\"If a 'confidence crisis' can happen to First Republic, it can happen to any bank in this country,\" said Jake Dollarhide, CEO of Longbow Asset Management.\"This is potentially a big deal, which hopefully won't materialize to anything significant,\" he added.Los Angeles-based PacWest tumbled by more than 27%. It is ranked 53rd among U.S. lenders with $41.2 billion in assets as of the end of last year, according to Federal Reserve data.Phoenix, Arizona-based lender Western Alliance, the No. 40 U.S. bank with $68 billion in assets, sank 15% while Cleveland, Ohio-based KeyCorp, the 20th largest bank with $188 billion in assets, fell 9%.",
        "Comerica, a Dallas, Texas-based bank ranked 37th among U.S. lenders with $86 billion in assets, shed 12%. Columbus, Georgia-based Synovus Financial Corp, with $60 billion in assets and ranked the 42nd U.S. biggest bank, lost nearly 7%.Valley National Bankcorp, which owns Valley National Bank based in Passaic, New Jersey and is the 43rd largest lender with $57 billion in assets, closed 3% lower after shedding more than 20% on Monday.\"Historically, once you see a resolution of one institution, the market tends to go after who they view as the next weakest link,\" said Goldman Sachs regional banks analyst Ryan Nash.The exposure of regional banks to the commercial real estate sector, particularly office buildings that currently have high vacancy rates, has further heightened investor concerns that loan losses could pile up and exacerbate the current crisis amid rising interest rates.Regional banks with up to $250 billion in assets held about $1.1 trillion of commercial real estate loans with maturities through 2027 as of the end of last year, according to real estate data analytics firm Trepp Inc.\"There could be some haircuts on office loans and that's a market where regional banks have a lot of exposure,\" Nash said.JPMorgan Chase's deal for First Republic's assets has ended risks of a contagion, some analysts said. But others noted the deal makes the biggest U.S. bank even bigger, raising the risk of a heightened \"too-big-to-fail\" problem that regulators have been trying to solve for years.",
        "\"While we think this deal underscores all of JPM's key strengths, we can't help but try to read into what it means if our biggest bank is the government's first line of defense,\" analysts at Evercore ISI wrote in a note.The U.S. Federal Reserve is expected to comment on the regional bank crisis at the end of its Federal Open Markets Committee meeting on Wednesday, with markets expecting a 25 basis point hike.The selloff was driven by the threat of higher interest rates making the situation worse, said Phil Blancato, CEO of Ladenburg Thalmann Asset Management. (Reporting by Niket Nishant, Jaiveer Singh Shekhawat, Ankika Biswas, Sruthi Shankar in Bengaluru; Nupur Anand, Matt Tracy and Chibuike Oguh in New York; Editing by Subhranshu Sahu, Deepa Babington and Jamie Freed)"
    ]
}