{
    "articleURL": "/wires/pa/article-12050459/St-Mirren-await-news-Tony-Watt-loan-striker-suffers-ankle-injury.html",
    "content": [
        "Tony Watt’s stint at St Mirren could be over after picking up an ankle injury in training.",
        "The 29-year-old striker has made 11 appearances and scored once for the Buddies since joining on loan from cinch Premiership rivals Dundee United in January.Ahead of the trip to Easter Road to play Hibernian on Saturday, St Mirren boss Stephen Robinson revealed Watt is to have a scan and admitted his concern about the Scotland cap for the five post-split fixtures.The Northern Irishman said: “We had an injury to Tony Watt in training yesterday so he is not going to be available for Saturday.“He went over on it. It was innocuous, just two players came together and he went over the wrong way but we are quite concerned about it at the moment“He is having scans on his ankle today.",
        "“Obviously we spoke to Dundee United, who own Tony, and we will have the results today and see where we go with it, but we are quite worried about it at the moment.”Asked whether it was likely Watt could miss the rest of the campaign, Robinson said: “Potentially, yes. Obviously it’s hard to say without the scans but, on the initial look at it, the medical team weren’t too happy with it.“It reduces our options in the forward areas, with Jonah (Ayunga) already injured, but we have people who have stepped in and done really well before. Alex Greive, young Lewis Jamieson and Greg Kiltie can play in those areas of the pitch as well.",
        "“It is something we are dealing with and we won’t use it as an excuse.”Robinson was happy to see Ryan Flynn and Richard Taylor extend their contracts recently and revealed he has offered a new deal to 30-year-old centre-back Joe Shaughnessy.He said: “I have had conversations with Joe as well and offered him another year.“Joe wants perhaps a wee bit more security than that, which is understandable, and more regular game time but that I can’t guarantee anyone that.“We will keep speaking and see where we go, but on the other hand I am looking at other things as well.”Despite losing 2-0 at home to Kilmarnock in their last fixture, Saints remained in sixth place and are behind the Hibees on goal difference, four behind Hearts and nine behind Aberdeen.Robinson is targeting a European place, with fifth spot being enough if Celtic beat Championship side Inverness in the Scottish Cup final.He said: “We believe we can get into Europe. We have taken points off every team  in the top six so there is certainly not a fear factor. We believe in what we do.“Yes we will probably be the underdogs in every game, I would imagine, but we are used to that I and I think we are better when that is the case.",
        "“We will need to perform better than we did against Kilmarnock, we are very well aware of that, but we will do. We genuinely believe we can get a European spot.”"
    ]
}