{
    "articleURL": "/tvshowbiz/article-12043749/Coronation-Street-viewers-fear-Pauls-life-Damon-makes-ominous-phone-call.html",
    "content": [
        "Coronation Street viewers were left fearing for Paul's life after Wednesday night's episode ended in a shocking cliffhanger. ",
        "As he comes to terms with his Motor Neurone Disease diagnosis, Paul Foreman (Peter Ash) has been left worrying about how to pay for the support he needs as his illness progresses. After considering gaining money off a stolen car, against the advice of his friend and lawyer Dee Dee Bailey (Channique Sterling-Brown), Paul turned to other sources for cash.  Fans will note that, as Paul is still on bail, any sign of getting involved with the wrong side of the law will not be good news. In the end, he decided to blackmail Damon Hay (Ciaran Griffiths), ordering him to bring £25,000 by the following day. ",
        "Damon refused and the episode ended on a terrifying cliffhanger, with Damon making an ominous phone call. He could be heard calling a mysterious contact, saying 'he needs shutting down.'Watchers were then left fearing for Paul's life, worrying that Damon was telling someone to get rid of him altogether.  One fan said: 'Paul’s going to be shut down', while another thought: 'Methinks Damon will ‘euthanise’ Paul.'Another tweeter said: 'uh oh Paul’s in danger now.'A fourth said: 'Paul will be going to hospital faster than he thought,' referring to his MND worries. A fifth added: 'Damon is going to find a way to silence Paul. This won't end well.'",
        "Elsewhere in the episode, serial killer Stephen's murderous plans for Elaine were finally revealed, as he received a text confirming a life insurance payout if she dies. ",
        "However Elaine remained blissfully unaware as she threw herself into wedding preparations for the two of them.   Meanwhile Sarah was put in a sticky situation after her lover Damon crashed the birthday meal for her husband Adam. She was also found out to have protested against the late licence for the bistro as she didn't want Adam and Damon working in close proximity - and to risk others finding out about the scandalous affair.  Coronation Street airs Mondays, Wednesday and Fridays at 8pm on ITV1 and ITVX. "
    ]
}