{
    "articleURL": "/news/article-12060343/Elon-Musk-chats-brunette-flaunting-boob-watching-Miami-Grand-Prix.html",
    "content": [
        "Musk could be seen in photos obtained exclusively by DailyMail.com chatting with an unknown brunetteThe woman was sporting some serious side boob in a strapless black shirtIt is unclear who the woman is and whether she and Musk are dating Elon Musk has been spotted chatting with a mystery woman at the Miami Grand Prix.",
        "The Tesla CEO could be seen in photos obtained exclusively by DailyMail.com chatting with an unknown brunette who was flaunting some serious side boob on Saturday. Her appearance with the Twitter chief has sparked speculation that she is Musk's latest love interest, with pictures showing her in a strapless top and floral pants undoing her bun.But it remains unclear who the woman is and whether she and Musk are dating. It comes just one year after the eccentric 51-year-old was spotted with his then-girlfriend Natasha Bassett having lunch in St. Tropez.",
        "In the photos, Musk could be seen smiling as he chatted and drank beer with the barefoot woman.At one point, it appeared she was adjusting her strapless black shirt, leaving Musk looking stunned. She was also seen fixing her wind-swept hair.Together, they sat and talked at a suite at the Miami Grand Prix before the woman ducked back inside.Musk was at the grand prix as a guest of Red Bull. He was pictured with one of his sons speaking with Sergio Perez of Mexico, Red Bull Racing Team Principal Christian Horner and Max Verstappen of the Netherlands.The spotting comes less than one year after Musk was pictured with his then-girlfriend, Australian actress Natasha Bassett, enjoying a low-key lunch in billionaires paradise St Tropez.",
        "The pair were seen enjoying a meal at the Cheval Blanc hotel, where rooms cost upwards of $1,300-a-night, in July.",
        "Musk and Bassett sat in full view of the hotel's pool and bathers.They sipped on rose, ate French fries and chatted animatedly while waiters fluttered by. The pair then strolled hand-in-hand out of the expensive eatery past other sunseekers on the beach.Bassett, Musk's youngest girlfriend yet, was elegant in a $698 Zadig and Voltaire dress, silver sandals and a matching bag. Musk, who was dressed less suitably for the weather, wore a dark grey t-shirt, black jeans and black leather Chelsea boots. The couple are believed to have started dating in February 2022, when they were spotted getting off Musk's private jet in L.A. ",
        "Musk had earlier welcomed his second child with ex-girlfriend Grimes in December last year via surrogate. They called quits on their romance two months in September.His previous girlfriends include Amber Heard and British actress Talulah Riley.Musk, a father of seven, has also been divorced three times - twice from the same woman.He met his first wife Justine Wilson when the pair were studying together in Ontario. They tied the knot in 2000, moved to Los Angeles and welcomed their first son - Nevada - who died when he was only 10 weeks old from SIDS. ",
        "They went on to have twins and then triplets together; Griffin, Xavier, Damian, Saxon and Kai. She told in a Marie Claire article how she considered herself to be his 'starter wife'. The pair divorced in 2008 after eight years of marriage and five kids. ",
        "Next, Musk married British actress Talulah Riley. The pair married in 2010, then divorced in 2012. They got remarried in 2013 and Musk filed for divorce but withdrew the following year.Eventually, Talulah filed for divorce in 2016. He went public with Amber Heard the following year, after her acrimonious divorce from Johnny Depp. While their relationship was brief (they parted ways after just a year), they seemed to remain friends. After Heard, Musk moved on with the singer Grimes, making their debut as a couple at the 2018 Met Gala. They welcomed a son in May 2020 and named him X Æ A-Xii. By September 2021, the pair had broken up. Musk told Page Six they were still on 'great terms', however. In December 2021, Grimes stunned the world by announcing the pair had welcomed another baby - a daughter who they had via a surrogate. The baby girl's name is Exa Dark Sideræl but they refer to her as 'Y'. ",
        "Justine Wilson, 492000 - 2008 ",
        "Musk met his first wife Justine Wilson when the pair were studying together in Ontario. They tied the knot in 2000, moved to Los Angeles and welcomed their first son - Nevada - who died when he was only 10 weeks old from SIDS. They went on to have twins and then triplets together; Griffin, Xavier, Damian, Saxon and Kai. She told in a Marie Claire article how she considered herself to be his 'starter wife'. The pair divorced in 2008 after eight years of marriage and five kids. They were dating when he made his first millions through Zip2.com, an internet company that made him $20million in the late 1990s. It was while they were dating and engaged that he founded X.com - which later became PayPal. When they divorced in 2008, they had a post-nuptial agreement in place. It's unclear what she received in the way of a settlement. She wrote in her Marie Claire essay that Elon had made her 'disposable'.  Talulah Riley, 362010-2016Musk married British actress Talulah Riley within weeks of meeting her after his divorce from Justine. The pair married in 2010, then divorced in 2012.",
        "They got remarried in 2013 and Musk filed for divorce but withdrew the following year. Eventually, Talulah filed for divorce in 2016. They have always spoken highly of one another publicly and say they are on great terms. Talulah said in a recent interview that they continue to 'look after each other' Amber Heard, 36",
        "2017-2018 He went public with Amber Heard the following year, after her acrimonious divorce from Johnny Depp. While their relationship was brief (they parted ways after just a year), they seemed to remain friends. Musk honored Amber's promised payments to the ACLU that she said she was going to pay using her divorce settlement from Depp. She had pledged to give the full $7million to the charities but revealed under questioning this week that she hadn't been able to, and that Musk made some payments in her name. Grimes, 342018-2021 After Heard, Musk moved on with the singer Grimes, making their debut as a couple at the 2018 Met Gala. They welcomed a son in May 2020 and named him X Æ A-Xii. By September 2021, the pair had broken up. Musk told Page Six they were still on 'great terms', however. In December 2021, Grimes stunned the world by announcing the pair had welcomed another baby - a daughter who they had via a surrogate. The baby girl's name is Exa Dark Sideræl but they refer to her as 'Y'.  ",
        "Natasha Bassett, 27February 2022 Musk was pictured with Australian actress Natasha Bassett in May 2022.The pair were spotted having a romantic lunch in the South of France while both in town for movie premieres and weddings. He did not take her as his guest to the wedding of Hollywood agent Ari Emanuel and designer Sarah Staudinger, but the pair were seen laughing, eating and drinking during their date that was over the same weekend. Bassett, 27, had reportedly taken Musk's mother, Maye, as her date to a film premiere at the Cannes Film Festival. Bassett moved to the US from Australia when she was 19. She first worked in New York then traveled to L.A. It's unclear how she and Musk met.Shivon Zilis, 2021 ",
        "Zilis, who was born in Ontario, Canada, met Musk through OpenAI, the artificial-intelligence research-and-deployment nonprofit Musk cofounded in 2015.She studied economics and philosophy at Yale where she also played goalie on the women's ice-hockey team.In 2015, Zilis was on Forbes' 30 Under 30 list in the venture-capital category and in 2017, got the chance to use her AI expertise at Tesla.Just last year, Zilis posted a nod to Prince Harry's Silicon Valley startup with a throwback picture of the two of them from 2013 when she was asked to brief him on tech startups.Zilis was also the director of operations and special projects for Neuralink, Musk's brain-machine interface company."
    ]
}