{
    "articleURL": "/wires/aap/article-12054189/Bontempelli-magic-helps-Bulldogs-rival-Giants.html",
    "content": [
        "Western Bulldogs coach Luke Beveridge says he \"couldn't believe\" Marcus Bontempelli's phenomenal first half that lifted their side to a 13.8 (86) to 10.11 (71) win against GWS.",
        "The Bulldogs skipper finished with career-high clearances (14) and contested possessions (25), helping himself in a first-half blitz that included 10 clearances, 15 contested possessions, six inside 50s and a goal.It helped the Bulldogs get through a somewhat patchy performance in driving rain at Manuka Oval with a quality win, the Giants again not rolling over but falling short of snapping their eight-game losing run in the capital.Four straight goals to start the second half saw the Dogs burn their opponents off, although the Giants returned the favour in the final term's first 11 minutes to keep themselves in the fight just 10 points down.It set up a grandstand finish, but back-to-back majors from Bulldogs key forward Aaron Naughton iced the game off.Beveridge said the one constant through a mixed bag of a performance had been their captain's brilliance.\"He's had a pretty good year up to date, but I couldn't believe he'd had 10 clearances at halftime ... that's pretty phenomenal,\" he said.\"He's always doing his absolute best to lead the charge and he played a really solid game.\"We had boys bob up and put a stamp on the game here and there, but we just didn't have any fluency.\"To come away with a win against a team that's been ultra competitive and progressing with some of the kids, we walk away happy but there's a bit to work on.\"",
        "But he traded blows with emerging GWS bull Tom Green, who posted his own career highs with 38 touches and three goals back on his home Canberra turf.He looked every bit the Giants' future superstar, particularly with skipper Toby Greene a late withdrawal with an ankle injury.The Bulldogs shared the load up forward with nine individual goalkickers and their power trio of Naughton, Jamarra Ugle-Hagan and Rory Lobb found six between them despite the wet conditions, while a young excitement machine led the way early.Sixth-gamer Arthur Jones kicked two goals in a lively cameo, his high-energy play inside 50 helping them pinch a 10-point quarter-time break.Greene's absence clearly hurt the Giants and they lacked efficiency inside 50, veteran Callan Ward stepping up to kick two goals before Green hit the scoreboard late to give his side a lifeline.In eight games under Kingsley, the Giants haven't sustained a final margin of more than 21 points, but still have a 3-5 record.\"The effort to get back in the game was great, (but) it's pretty disappointing how we let the game slip away,\" Kingsley said.\"We had opportunities to get the ball inside 50, scoring shots might have been similar, we just couldn't finish our work and we couldn't stop them from scoring.",
        "\"The summary of the game is +11 inside 50s, scoring shots the same ... they were fantastic defending our entries and I didn't think we provided our forwards with enough opportunities.\"A potential hamstring injury for midfielder Adam Treloar that saw him immediately subbed out of the game was the only major negative for the Bulldogs."
    ]
}