{
    "articleURL": "/debate/article-12039527/DAILY-MAIL-COMMENT-deafening-silence-political-stitch-up.html",
    "content": [
        "A deafening silence on a political stitch-upSue Gray’s contemptuous refusal to cooperate with the Cabinet Office inquiry into her appointment as Sir Keir Starmer’s chief of staff is not only shameful – it is the height of hypocrisy.",
        "When conducting her own explosive investigation into Partygate, which helped to topple Boris Johnson, she demanded No10 staff answer extensive questions.Many will reasonably conclude that her lack of transparency over when she first held secret talks about jumping ship to Labour means she has something to hide.If she advised Tory ministers on sensitive matters while cooking up a new partnership with Sir Keir, she would have scandalously driven a coach and horses through civil service impartiality and honesty rules.It also raises questions about whether her Partygate report was a politically-motivated hit job for her new boss.",
        "After Dominic Raab was forced to resign over nebulous bullying charges, isn’t this more evidence that Whitehall is starting to resemble a Labour Party branch office?But the biggest impact of this scandal is what it reveals about Sir Keir. He likes nothing more than to lecture others about the importance of standards in public life.By clumsily conniving to offer Ms Gray a place in his inner circle, he has not only exposed his amateurism and woeful lack of judgment – but also that, to him, integrity is simply a politically-expedient soundbite.A leader in duplicityDemocracy works on the basis that the electorate has some idea of what the politicians they vote for actually believe.",
        "Not with Sir Keir. He’s performed so many screeching U-turns, and ditched so many cast-iron pledges, it’s impossible to know.He has back-pedalled on a string of Left-wing promises that propelled him to victory, including to abolish tuition fees and tax the rich until the pips squeak.Perhaps his party is embracing a new-found spirit of fiscal probity. Equally, Sir Keir may be trying to gull floating voters into thinking he’s shed his socialist skin.After all, this is a man who swore to respect Brexit – then fought tooth and nail to overturn it. He tried to ensure Jeremy Corbyn became our PM – while well aware of his unsuitability. And he still struggles to define what a woman is.In the past two years it has sometimes seemed hard to fathom a reason to vote Conservative. Keeping this vacuous hypocrite out of Downing Street must now be at the top of the list.",
        "Sunak’s scam-bustersFraud is Britain’s most common offence. Yet too often it is treated as a minor inconvenience, not a profoundly wicked crime that often ruins lives.Using calls, emails, texts and online scams, callous swindlers steal £2billion a year from unsuspecting Britons.So we welcome Rishi Sunak acting to stamp out a menace that targets not just the elderly, but the digitally-adept young.",
        "Spurred on by the Mail’s Stop the Bank Scammers campaign, he is establishing a National Fraud Squad to blitz the problem, banning financial ‘cold calls’ and introducing longer prison sentences for conmen.The Prime Minister is promising to fight these fraudsters wherever they hide. We wish him every success in tackling this abhorrent scourge.It goes without saying that the recent strikes disrupting the NHS jeopardised the welfare of many patients. So it is a relief that health unions have agreed to accept the Government’s pay offer. Yet the Royal College of Nursing has gone out on a limb – snubbing the deal and threatening a fresh wave of industrial action. Instead of being belligerent, the nurses should pocket the money and strive to ease the suffering of patients languishing on waiting lists."
    ]
}