{
    "articleURL": "/wires/ap/article-12054131/Urawa-beats-Al-Hilal-win-Asian-Champions-League-title.html",
    "content": [
        "SAITAMA, Japan (AP) - Urawa Reds beat Al-Hilal 1-0 on Saturday to win the Asian Champions League title for a third time.",
        "Andre Carrillo's own goal gave the Japanese team a 2-1 aggregate win at Saitama Stadium a week after a 1-1 draw in the first leg in Riyadh.Defending champion Al-Hilal, which was looking for a record fifth continental title, enjoyed most of the possession but was unable to create enough clear chances in the absence of the influential Salem Al-Dawsari. The Saudi Arabia international scored in the first leg before receiving a red card and suspension.The Saudi Arabian team started strongly and in the fourth minute, Urawa´s Danish defender Alexander Scholz cleared Odion Ighalo´s shot from the line. Also in the first half, Mohamed Kanno shot over and Carrillo forced a flying save from Urawa goalkeeper Shusaku Nishikawa.Urawa had little sight of goal but came close after 30 minutes when first-leg goalscorer Shinzo Koroki volleyed against the crossbar from close range.Three minutes after the restart, the majority of the 53,574 fans were brought to their feet. Norwegian defender Marius Hoibraten headed a free-kick across the face of goal. Al-Hilal goalkeeper Abdullah Al-Mayouf missed the ball, swirling in the wind, and it bounced off Carrillo and into the net.",
        "Urawa continued to create chances on the counter-attack as Al-Hilal pushed forward. Tomoaki Okubo fired over with just the goalkeeper to beat and Atsuki Ito also went close.",
        "Al-Hilal´s best chance came in the 90th minute. Ighalo turned and twisted in the area to create space for a shot near the penalty spot that Nishikawa was just able to block to ensure that the Reds hung on for the triumph.\"It was a tough game but the players did a great job to come through against a team like Al-Hilal,\" Urawa coach Maciej Skorza said.Al-Hilal coach Ramon Diaz pointed to the club's hectic schedule this year as a reason for the loss.\"We played better than in the first leg,\" the Argentine said. \"We didn´t have luck and there have been many physical demands on the players in this competition, in the league as well as the World Cup and the Club World Cup.\" ___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}