{
    "articleURL": "/femail/health/article-12045125/Topical-steroid-withdrawal-Mum-saved-MooGoo-eczema-cream.html",
    "content": [
        "Bryony Brew experienced a devastating TSW painWas saved by miracle $19.50 cream A young mum has revealed how a doctor's mistake left her covered in an oozing rash that was so painful she couldn't leave the house or care for her children.  ",
        "Bryony Brew, 30, said her skin condition was 'more painful than childbirth' and left her feeling as though her life was over.Her nightmare started when her eczema, which she had battled for years, became worse during her pregnancy.  She told FEMAIL she was prescribed a steroid cream by her doctor which fixed the problem, so she kept taking it.She used the cream for 13 years, with doctors never warning her about the potential long-term damage.So when a friend told her about dangerous effects of steroid creams, Bryony stopped using it - but what followed left her in so much pain that she was unable to leave the house.She began suffering a severe bout of topical steroid withdrawal which left her 'feeling like a lobster' with foul-smelling oozing sores.Bryony explained at her worst she could barely leave her bed - and had to carry around hot water bottles to help regulate her body temperature. The condition got so bad that she was forced to move back in with her parents, until she discovered a $19.50 miracle cream made by Australian-made MooGoo.",
        "'I had to take time off work and could not look after my kids which was very distressing for them', Bryony said.'I went into a completely depressed state and couldn't sleep. It was horrendous.",
        "'I went cold turkey. It was fine for a couple of weeks, and then my whole body went into withdrawal. It was scary,' Bryony, who is from the Isle of Man, said.",
        "Bryony said that she 'wasn't aware' that 'steroids are only intended to be used thinly' and for no more than two weeks at a time.'I had them on repeat prescription and would use almost daily. I did this for 13 years', she said.'I was put on steroids when I was pregnant. My skin was itchy and dry, so I was prescribed steroids and would use them to relieve my symptoms. 'I also had an undiagnosed gluten intolerance, which I think could have been a factor in bringing on my eczema, but this wasn't explored. I was just prescribed steroid cream. It was so quick,' she explained.The mum-of-four only realised she should stop using it when a friend started going through topical steroid withdrawal.'My friends said to me - \"Bryony you don't realise how much damage long term use of steroids is doing to you? It affects your nerve endings, blood vessels, so many things\".'I hadn't even thought about it before, I would just pick up my monthly prescription and use it on my skin.'",
        "Topical steroid withdrawal (TSW) is a potentially debilitating condition that can arise from the use of topical steroids to treat a skin problem, such as eczema.A recent government review concluded that when used correctly, topical corticosteroid medicines are safe and effective treatments for skin disorders.However, if used very often or continually for a prolonged time, there can be withdrawal reactions (TSW) when stopped.This can lead to skin redness and burning worse than the original condition.",
        "But after she stopped taking the cream, the horrific consequences began.'I had to use a towel on my pillow as my skin was weeping so much. My skin honestly smelt disgusting - like rotten flesh,' she explained.'On top of that, I couldn't regulate my body temperature at all and had to use two hot water bottles just to stop myself from shivering in the summer.'I would rather give birth ten times over then go through the pain of my skin in that state.'With no end in sight and unable to find relief from other treatments, Bryony found solace in a natural baby moisturiser called MooGoo. After initially being hesitant to use the $19.50 cream, she was relieved to see her skin slowly heal and recover its natural moisture. She says the cream saved her skin and hopes her story will help people avoid the same pain and suffering she went through.",
        "'I would post on a Facebook support group, and people kept commenting I should try a cream called MooGoo,' she said.'I was too scared to use it at first. I couldn't use anything on my skin, I couldn't even touch the tube of steroid cream in my bedroom drawer as my skin was that sensitive, and it would react. I tried using just aloe vera at first but it didn't help.'I was scanning every ingredient in products as I was petrified of putting anything potentially containing steroids on my skin.'",
        "'I apprehensively started using the MooGoo Soothing Baby Moisturiser and it immediately took away the flaky skin on my face, but it was still red underneath.'I continued to put it on morning and night and after a few days my skin started to get better. I couldn't believe it, I was so relieved.",
        "'I was in another world during my steroid withdrawal. It took away my life and affected the whole family. As a mum, it was heartbreaking that I couldn't do anything for anyone. It was absolutely shocking what my body went through.'MooGoo Soothing Baby Moisturiser contains all natural ingredients such as honey and aloe vera.MooGoo has earned a reputation for revolutionising skin care for those with sensitive skin. With over 18 years of experience, the brand has a wealth of success stories, showcasing the effectiveness of their products. ",
        "It all started in Australia when founder Craig Jones created the MooGoo Skin Milk Udder Cream for his mother, who suffered from psoriasis. The cream was so successful that it paved the way for a whole range of products designed to soothe and nourish sensitive skin."
    ]
}