{
    "articleURL": "/wires/reuters/article-12044801/Gold-hovers-near-record-high-levels-Fed-hints-rate-hike-pause.html",
    "content": [
        "US dollar down 0.2%",
        "Powell: Won't rule out mild recessionProfit taking to continue in the near-term - analyst(Adds graphics, analyst comments and updates prices)By Ashitha ShivaprasadMay 4 (Reuters) -Gold took a breather on Thursday after surging to a near all-time high after the U.S. Federal Reserve signalled a pause in its rate tightening cycle, with analysts predicting further gains for the safe-haven asset as economic risks persist.Spot gold was steady at $2,038.19 per ounce as of 0704 GMT, after earlier jumping to $2,072.19, just shy of a record high of $2,072.49 in 2020, with analysts attributing the slight pullback to profit-taking.U.S. gold futures rose 0.5% to $2,047.70.\"With the Fed meeting out of the way, focus will remain on any contagion risks from the U.S. banking sector... that'll put a cautious stance in the risk environment, drawing continued safe-haven flows for gold in the event of further fallouts,\" said Yeap Jun Rong, market analyst at IG.\"With more room for yields to be lower and the dollar to fall, it seems the catalysts are in place for gold prices to deliver a new all-time high eventually.\"The Fed raised its benchmark overnight interest rate by 25 basis points, but no longer said that it \"anticipates\" further increases would be needed, and that it will watch incoming data to determine if more hikes \"may be appropriate.\"",
        "Economic uncertainties and lower rates boost demand for the zero-yield bullion.Fed Chair Jerome Powell said the U.S. economy had a greater chance of avoiding a recession, but would not rule out a mild one.Also helping bullion, the dollar index was down 0.2%, making greenback-priced cheaper for overseas buyers. Benchmark U.S. Treasury yields also dropped.While gold could see some profit-taking in the near-term, the outlook is bullish given all the economic risks, said Brian Lan, managing director at Singaporean gold dealer GoldSilver Central.Silver was flat at $25.59 per ounce, platinum gained 0.4% to $1,054.00 while palladium jumped 1.3% to $1,442.05.(Reporting by Ashitha Shivaprasad in Bengaluru; Editing by Sherry Jacob-Phillips, Varun H K and Sonia Cheema)"
    ]
}