{
    "articleURL": "/wires/aap/article-12061369/Titans-teenager-Kini-told-small-NRL.html",
    "content": [
        "Highly rated Gold Coast teenager Keano Kini made his debut at Magic Round after he was overlooked by other NRL clubs for being too small.",
        "The 19-year-old played hooker off the bench in the 26-24 win over Parramatta but is a fullback/half of rare talent. The Titans have re-signed the Auckland-born Kini until the end of 2026.Recruitment manager Ezra Howe said he was looking for a half/fullback on a recruitment trip and hit the jackpot.\"I signed Keano when he was 15 after watching him play in a league tag tournament in Auckland,\" Howe told AAP.\"Kini could step off both feet and was just electric. Put it this way, in the whole tournament I watched him play league tag he never lost a tag. No-one could catch him.\"When I did a bit of research on him it turned out other NRL clubs had knocked him back because they reckoned he was too small.\"Some of the game's greatest players such as Allan Langer and Johnathan Thurston were told the same thing when they were teenagers. Kini, who stands at 177cm and weighs 83kg, may be small in stature but he's big on heart and talent.Howe, who has coached New Zealand youth teams, was quick to swoop and signed Kini within a week of watching him.\"Funny enough his mum said, 'Don't you want to see him make a tackle?' I said, 'No, we'll teach him how to tackle',\" Howe said.",
        "The family relocated to the Gold Coast where Kini attended league powerhouse Palm Beach Currumbin State High School.\"We knew he was going to be special from the first session he did with us,\" Howe said.\"He got off a plane and straight into our 1.2km test. He did it in 4 minutes and 48 seconds which is pretty good for a 15 year-old.\"He worked hard. When he was away we would send him stuff to do and he did everything we asked.\"He comes from a wonderfully supportive family with a real rugby league pedigree.\"Kini has been firing with Burleigh in the Queensland Cup. After his NRL debut he said long-term he wanted to play fullback, but he is not daunted by having AJ Brimson and Jayden Campbell ahead of him in the pecking order.\"The way I look at it, I learn off them every day at training and push them,\" Kini said.\"The main tip they have given me is, 'Keep working hard and your time will come'.\"I'll keep plying my trade in Q Cup if I have to but if I come up here (to NRL) I'll definitely believe in myself.\"(The debut) was pretty different. I have a lot of respect for the hookers now.\"",
        "Kini had no hesitation re-signing with the Titans.\"We have a young team but we are going in the right direction. They have done a lot for my family as well,\" he said."
    ]
}