{
    "articleURL": "/tvshowbiz/article-12057789/The-Weeknd-posts-scenes-snaps-Lily-Rose-Depp-new-HBO-series-Idol.html",
    "content": [
        "With exactly four weeks until his new HBO series The Idol debuts, The Weeknd is offering his fans some behind-the-scenes snaps.",
        "The 33-year-old singer (born Abel Makkonen Tesfaye) took to Instagram on Sunday sharing behind-the-scenes snaps with him and co-stars Lily Rose Depp and Mike Dean.'It’s going to be complete chaos… on June 4th,' Tesfaye said in the first post featuring a snap with him, Depp and Dean, with the hashtag #THEIDOL.The trio were seen hanging out in a recording studio set, immersed in conversation in the first snap.The second post featured an image that showed Tesfaye giving Depp a hug from behind as she stood in front of a microphone, which was simply captioned, '4 weeks.'",
        "Before it debuts on HBO on June 4, The Idol will premiere out of competition at the Cannes Film Festival later this month.The Cannes Film Festival runs from May 16 through May 27 and is considered one of the most prestigious film festivals in the world, along with festivals in Venice, Berlin, Toronto and the Sundance Film Festival in Park City, Utah.According to sources, programmers at Cannes have not yet settled on whether to show two or three episodes of the six-part show.The third episode of the show reportedly ends on a cliff hanger, which may lead them to opt to only screen two episodes instead.Representatives for HBO told the publication that the Cannes Film Festival premiere has not been confirmed. ",
        "The series follows a pop star named Jocelyn (Lily-Rose Depp), who suffered a nervous breakdown on her last tour and is now determined to reclaim her place as the greatest (and sexiest) pop star.Her passions are reignited by Tedros (Abel \"The Weeknd\" Tesfaye), a nightclub impresario with a sordid past who is also the leader of a bizarre cult.The official series description asks, 'Will her romantic awakening take her to glorious new heights or the deepest and darkest depths of her soul?'",
        "Although many of the criticisms over the shows new, darker tone appeared to revolve around Depp's character, she defended Levinson and the current state of the show in a statement to E! News.'Sam is, for so many reasons, the best director I have ever worked with. Never have I felt more supported or respected in a creative space, my input and opinions more valued,' she said.'Working with Sam is a true collaboration in every way — it matters to him, more than anything, not only what his actors think about the work, but how we feel performing it.'Sources also denied claims in the Rolling Stone article that the show's budget had ballooned to $80 million, as they said the reshoots were nowhere near that expensive while speaking to TMZ."
    ]
}