{
    "articleURL": "/wires/ap/article-12049643/Cinco-Mayo-celebrates-Mexican-culture-not-independence.html",
    "content": [
        "PHOENIX (AP) - American bars and restaurants gear up every year for Cinco de Mayo, offering special deals on Mexican food and alcoholic drinks for the May 5 holiday that is barely celebrated south of the border.",
        "In the United States, the date is largely seen as a celebration of Mexican American culture stretching back to the 1800s in California. Typical festivities include parades, street food, block parties, mariachi competitions and baile folklórico, or folkloric ballet, with whirling dancers wearing shiny ribbons and braids and bright, ruffled dresses.For Americans with or without Mexican ancestry, the day has become an excuse to toss back tequila shots with salt and lime and gorge on tortilla chips smothered with melted orange cheddar that's unfamiliar to most people in Mexico.The focus on drinking and eating has brought some criticism of the holiday, especially as beer manufacturers and other marketers have capitalized on its festive nature and some revelers embrace offensive stereotypes, such as fake, droopy mustaches and gigantic straw sombreros.\"Cinco de Mayo is a day to celebrate the resilience, culture, and heritage of generations of Mexican Americans,\" President Joe Biden said Friday in a tweet. \"The story of America is the story of them - and the White House is their house.\"The United Farm Workers paid homage in a tweet Friday to field workers in the U.S., who are overwhelmingly Hispanic, saying that laborers like the woman it pictured are responsible for the avocados \"that make our #CincoDeMayo guacamole.\"",
        "THIS YEAR'S CELEBRATIONSWith May 5 falling at the end of the work week this year, festivities are kicking off Friday evening with happy hours and pub crawls in cities including Hollywood, featuring $4 beers and two-for-one margaritas, and a boozy party aboard a yacht on Chicago´s Lake Michigan with norteño, or northern Mexico music, and ballads called corridos.Celebrations are planned throughout the weekend, especially in places with large Mexican American populations, such as Los Angeles, Houston, New York, San Antonio and Washington, D.C.A Sunday festival in downtown Phoenix will feature performers including Los Lonely Boys, who describe their music as \"Texican rock,\" as well as lucha libre, or wrestling matches with masked adversaries. A Cinco de Mayo parade will take place in Dallas on Saturday, while a Holy Guacamole Cinco de Mayo Run steps off that morning in Palisades Park in Santa Monica, California.WHAT IT ISCinco de Mayo marks the anniversary of the 1862 victory by Mexican troops over invading French forces at the Battle of Puebla. The triumph over the better equipped and more numerous French troops was an enormous emotional boost for the Mexican soldiers led by Gen. Ignacio Zaragoza.Historical reenactments and parades are held annually in the central Mexico city of Puebla to commemorate the inspirational victory over the Europeans, with participants dressed in historical French and Mexican army uniforms.",
        "WHAT IT ISN'TCinco de Mayo is not Mexican Independence Day, Mexico's most important holiday.Mexicans celebrate their country's independence from Spain on the anniversary of the call to arms against the European country issued Sept. 16, 1810, by the Rev. Miguel Hidalgo y Costilla, a priest in Dolores, Mexico.Mexico's president reenacts el Grito de Independencia, or the Cry of Independence, most years on Sept. 15 at about 11 p.m. from the balcony of the country's National Palace, ringing the bell Hidalgo rang.The commemoration typically ends with three cries of \"¡Viva México!\" above a colorful swirl of tens of thousands of people crowded into the Zócalo, or main plaza, in central Mexico City."
    ]
}