{
    "articleURL": "/news/article-12042917/Thatll-use-one-nine-lives-Calico-cat-survives-mailed-China-Canada.html",
    "content": [
        "A cat is believed to have traveled from China to Canada in a box with a hole in itIt is not clear whether the cat was shipped intentionally or found its way in A cat believed to have been shipped from China was found in a box by border officials in Canada.",
        "The cat was first spotted through a 'sizeable' hole in the box, which had been shipped from China, according to the Canada Border Services Agency (CBSA).It is not known whether the cat had been shipped intentionally or whether it was a stowaway that somehow made its way into the package.The cat, named Precious Cargo by border officials, was initially too shy to eat and dehydrated, but after a week of rehabilitation is now set to be adopted, according to the British Columbia Society for the Prevention of Cruelty to Animals (BC SPCA).Officials with the CBSA discovered the calico cat in a box last month at the Vancouver International Mail Center in Richmond, British Columbia.'The officers noticed that the box was damaged and had a sizable hole in its side,' Binder Kooner, chief of operations for the CBSA told CTV.",
        "'When the CBSA officer looked into the box, the officer saw a pair of eyes staring back which blinked,' she added.Officers coaxed the cat into a spare dog kennel with bedding and water. 'The cat appeared healthy but scared,' said Kooner. 'We contacted the Canadian Food Inspection Agency (CFIA) and the BC SPCA, who sent an animal control officer to bring the cat directly to an emergency vet clinic.' ",
        "The cat spent a week with an emergency vet in order to stabilize. Since its origin was unknown it was vaccinated against rabies, rehydrated and tested for foreign parasites and diseases.'No one knows how long the cat spent in transit, so she was kept at the emergency vet clinic for a week to stabilize,' Krista Shaw, manager of the BC SPCA's Richmond community animal center said in a statement.",
        "Shaw said it's possible that the cat hopped into the box somewhere en route, and that the cargo aircraft landed once between China and Canada.It's unclear where the plane stopped.  'We're not sure exactly where the cat came from. there was a hole in the box so it looks like the cat may have somehow got its way into the box,' she told Global News.Shaw said the cat is now in the care of a foster mom who intends to adopt her.'The foster mom tells me that she is slowly starting to eat and drink more and is getting comfortable around her and her home,' Shaw added.'She loves belly rubs and a good stretch on her lap.'"
    ]
}