{
    "articleURL": "/wires/ap/article-12057065/Meronk-makes-solid-statement-Ryder-Cup-Italian-Open.html",
    "content": [
        "GUIDONIA MONTECELIO, Italy (AP) - A morning pep talk from European Ryder Cup captain Luke Donald in the locker room. Then a trophy ceremony in the afternoon at the Marco Simone club outside Rome.",
        "That´s just what Adrian Meronk has been dreaming about, and the Polish golfer´s Ryder Cup ambitions are starting to look like they might become a reality after he won the Italian Open on Sunday less than five months before the sport´s biggest team event is held on the same course.\"I think that´s a solid statement, a solid brick into the wall,\" Meronk said. \"But it´s not over yet. I know that. ... I´ll keep pushing, keep doing what I can to get on the team. But I think that should help a little bit.\"Meronk finished at 13-under overall with a 2-under 69 for a one-stroke victory over Romain Langasque, with third-round leader Julien Guerrier three strokes behind in third.It´s not the first time that Meronk has performed well at Marco Simone, having finished in a tie for second behind Nicolai Hojgaard at the 2021 Italian Open. He also showed his team credentials when he holed a 25-foot putt at No. 18 to claim the clinching point for Continental Europe at the Hero Cup match-play event in January.\"I wanted to play well in front of Luke and to win the tournament is just such a relief,\" Meronk said. \"I saw (Donald) this morning in the locker room. He said, `Keep it going. Good luck.´ So nice, encouraging words from him.\"",
        "The victory - his third on the European tour - will move the 6-foot-5 (1.97-meter) Meronk up to fourth in the Race to Dubai standings.Afterward, Donald tweeted that it was a \"superb win,\" adding that Meronk displayed \"some solid golf played all week and came up with the right shots when he needed them most.\"Starting to make winning a habit. Well done Adrian,\" Donald concluded.Meronk hit his 3-wood to just in front of the green on the drivable par-4 16th to set up a birdie that gave him a one-stroke lead. Then he got up and down on the difficult par-3 17th after hitting his tee shot into the rough right of the green.On 18, Meronk sunk a 7-foot downhill birdie putt, which virtually sealed it with Langasque driving into the high grass right of the fairway in the final pairing behind him.\"It just suits my game,\" Meronk said of the course. \"You have to be careful off the tee. Fairways are crucial here, because if you miss it, then it gets tough. This week my short game was my big advantage. Saved so many shots from tricky positions. ... That makes the game much easier when you´re not playing your best.\"Hojgaard also again showcased his abilities at Marco Simone, finishing with a 6-under 65 to finish in a tie for fifth, six strokes behind Meronk.",
        "From Sept. 29-Oct. 1, Marco Simone will become the third venue in continental Europe to host the Ryder Cup after Valderrama in Spain (1997) and Le Golf National in France (2018).___Andrew Dampf is at https://twitter.com/AndrewDampf___More AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}