{
    "articleURL": "/news/article-12059333/Rishis-dishes-PM-chops-parsnips-wife-Akshata-Murty-prepare-food-Big-Help-event.html",
    "content": [
        "Rishi Sunak and Akshata Murty help prepare fruit and veg at Hertfordshire event Rishi Sunak chopped parsnips in a village hall kitchen today as the Prime Minister and his wife Akshata Murty joined a Big Help Out event.",
        "In the final part of this weekend's Coronation celebrations, Britons have been encouraged to take up volunteering roles on the extra Bank Holiday.The Sunaks joined the initiative by helping to prepare fruit and vegetables at a lunch club event in Hertfordshire.The PM was also shown speaking to an elderly couple as they sat at a table bedecked in Coronation-themed decorations.Labour leader Sir Keir Starmer, Scottish First Minister Humza Yousaf and Welsh First Minister Mark Drakeford are also expected to attend Big Help Out events today.Mr Sunak's visit to Hertfordshire completes a busy weekend of activity for the PM and his wife to mark King Charles's Coronation. ",
        "On Saturday, during the Coronation service at Westminster Abbey, the PM read a Bible passage.He and Ms Murty then hosted a Coronation Big Lunch in Downing Street yesterday, which was attended by US First Lady Jill Biden, before joining an audience of 20,000 at Windsor Castle for the star-studded Coronation concert.Mr Sunak has also held a series of meetings over the past few days with world leaders who travelled to London for the Coronation.Speaking to broadcasters as he volunteered at the lunch club in Hertfordshire, Mr Sunak backed the Metropolitan Police amid criticism over the arrests of protesters during the King's Coronation.",
        "'The police are operationally independent of Government, they'll make these decisions based on what they think is best,' the PM said.'Actually I'm grateful to the police and everyone who played a part in ensuring that this weekend has gone so well, so successfully and so safely.'That was an extraordinary effort by so many people and I'm grateful to them for all their hard work.'He added: 'No other country in the world could put on such a dazzling spectacle and it was a proud expression of our history, our culture, our tradition and also a reflection of the modern character of our country.'It was deeply moving to be in the coronation service and incredibly uplifting and it was an experience I think nobody will forget for the rest of their lives.'Mr Sunak hailed the tens of thousands events taking place today as part of the Big Help Out, which he said would see Britons 'respecting and reflecting His Majesty's long tradition of service'.'It's community spirit like this that binds out country together,' Mr Sunak added.The King and Queen will not be appearing publicly today on the day of the Big Help Out, which is billed as a lasting volunteering legacy to mark Charles's crowning. Other royals will be out and about with the Duke and Duchess of Gloucester visiting the Coptic Orthodox Church in London where young volunteers will be hosting a Coronation street party. ",
        "The Duke and Duchess of Edinburgh will take part in a puppy class at the Guide Dogs for the Blind Association Training Centre in Reading.",
        "The Big Help Out day is organised by The Together Coalition and partners such as The Scouts, the Royal Voluntary Service and faith groups from across the UK.It will highlight the positive impact volunteering has on communities and will encourage people to try volunteering for themselves to create a lasting legacy.The public have been encouraged to take up hundreds of thousands of volunteering roles on the extra Bank Holiday with more than 1,500 charities involved. An app has been created to allow people to search for volunteering opportunities, ranging from helping the elderly to working with environmental charities and supporting animal welfare. A Buckingham Palace spokesperson said: 'While wholly supportive of the Big Help Out initiatives taking place right across Britain on Monday May 7, (the King and Queen) will not be attending any events in-person. 'These will instead be attended by other members of the Royal Family.'Camilla is patron of the Royal Voluntary Service charity and has been patron of the Big Lunch initiative since 2013."
    ]
}