{
    "articleURL": "/news/article-12039231/Anthony-Albanese-sit-interview-Piers-Morgan-meeting-King-Charles-III.html",
    "content": [
        "Australian Prime Minister arrives in LondonGrilled by broadcaster Piers MorganMr Albanese later met with King Charles IIIPrime Minister Anthony Albanese has been asked 'one of the most controversial questions of modern times' before meeting with King Charles in England.",
        "Controversial British broadcaster Piers Morgan tried to put Albanese on the spot during their sit-down interview on London on Tuesday by asking him to define what a woman is.'An adult female,' the prime minister immediately replied.'How difficult was that to answer?,' Morgan then asked the prime minister.'Not too hard. I was asked during the campaign actually, but I think that we need to respect people for whoever they are,' Mr Albanese said.The question has become a hot political topic as calls grow for transgender people to be able to self-identify as whatever sex they wish, with many politicians struggling to answer in fear of upsetting critics or supporters of trans rights. 'I know there is some controversy that can come at times like that,' Mr Albanese continued.'I'm not a fan of some of the campaigns [against transgender issues]. There was recently a very controversial visit in Australia that was designed to stir up issues,' he said, referring to the visit of Posie Parker.'Young people coming to terms with their identity and who they are, I think that they need to be respected as well.'",
        "He was then grilled by Morgan on the issue of transgender athletes in women's sport.'That's an example in that the sporting organisations are dealing with that issue,' Mr Albanese said.",
        "'My view is the sporting organisations should deal with that issue.'He was then asked if he thought it was fair that athletes born biologically male compete against those born female.'Well, in Australia, the sporting codes are able to deal with that and they have,' Mr Albanese said.He reiterated that he had a lot of respect for King Charles III and didn't expect to see an 'imminent' referendum on removing the monarch as head of state.'I think you can be a lifelong republican like I am and still respect the institutions,' the Prime Minister said.'It's a great honour to be here representing all Australians, regardless of the different view people will have about our constitutional arrangements.'When the demand is there, I'm sure a vote will be held.'The wide-ranging interview also touched on relations with China, US President Joe Biden, former president Donald Trump, cancel culture, the Ashes and the late Australian icon Barry Humphries.",
        "The prime minister later had a private audience with King Charles at Buckingham Palace in London on Tuesday local time.It was his second meeting with the King within eight months after they first met last September in the wake of Queen Elizabeth II's death.'It was a pleasure to meet King Charles III again at Buckingham Palace, and an honour to represent Australia at his Coronation,' Mr Albanese said.",
        "The meeting was held just hours before Buckingham Palace went into lockdown after a man reportedly threw shotgun cartridges at the palace.Mr Albanese reiterated during the meeting that the King and other royal family members were welcome to visit Australia.A lifelong Republican, he also vowed to do 'what is entirely appropriate as the representative of Australia' when asked if he would swear the oath of allegiance to the King. The prime minister's decision to publicly swear allegiance to King Charles at his coronation has sparked backlash back home.Former Socceroo and Australian of the Year finalist Craig Foster has branded the move as 'completely unnecessary'.'Politely decline, and make a clear statement for our democratic principles of accountability, representation and the sovereignty of the Australian people,' Foster tweeted.Australians watching the coronation have been asked to join the oath of allegiance, but several prominent government ministers have said they will not take part in the pledge.",
        "Treasurer Jim Chalmers said he was 'unlikely' to pledge allegiance to the King during the coronation or watch the ceremony.The Australian Republican Movement had called for Mr Albanese to stay silent during the oath.The prime minister is among a contingent of Australians invited to the coronation along with Governor-General David Hurley and state governors.",
        "The Australian delegation set to attend the coronation includes Matildas captain and football star Sam Kerr, singer Nick Cave, Aboriginal artist Jasmine Coe, comedian Adam Hills and London-based nurse Emily Regan.In honour of the coronation, the Australian government will contribute $10,000 to the Western Australian conservation charity Friends of the Western Ground Parrot.Mr Albanese said King Charles had long championed conservation and the government was pleased to mark the event by helping to protect the critically endangered bird.The King, who is the monarch of 14 overseas realms including Australia, will host a lunch for prime ministers and governors-general at Buckingham Palace and also attend a Commonwealth Heads of Government Meeting on Friday, the day before his crowning.Mr Albanese said he would be 'meeting with other world leaders to strengthen Australia's relationships around the world' during his visit to the UK."
    ]
}