{
    "articleURL": "/wires/ap/article-12048187/DOJ-Alabama-ignored-sewer-issues-harmed-Black-residents.html",
    "content": [
        "HAYNEVILLE, Ala. (AP) - The U.S. Department of Justice on Thursday said an environmental justice probe found Alabama engaged in a pattern of inaction and neglect regarding the risks of raw sewage for residents in an impoverished Alabama county and announced a settlement agreement with the state.",
        "The federal departments of Justice and Health and Human Services announced the results of the environmental justice probe and a settlement agreement with state health officials to address longstanding wastewater sanitation problems in Lowndes County, a high-poverty county between Selma and Montgomery.The agreement is the result of the department's first environmental justice investigation under Title VI of the Civil Rights Act of 1964. Assistant Attorney General Kristen Clarke of the Justice Department´s Civil Rights Division said it will not be the last, because the \"fight for environmental justice is an urgent one\" and the effects of climate crisis have exacerbated the health risks faced by marginalized communities.\"For generations, Black rural residents of Lowndes County have lacked access to basic sanitation services. And as a result, these residents have been exposed to raw sewage in their neighborhoods, their yards, their playgrounds, schools and even inside their own homes,\" Clarke said.The Department of Justice did not accuse the state of violating federal civil rights law, but it said it found two areas of concern: The potential use of fines to punish people with inadequate home systems and what it called inadequate action to assess and address the potential health risks from raw sewage.The Alabama Department of Public Health agreed to a number of changes, including the creation of a comprehensive plan for the region, and a moratorium on fines. The federal department agreed to suspend their investigation as long as the state complies with the settlement terms.",
        "State Health Officer Scott Harris said Thursday that his department welcomes the agreement, although he disputes the allegation that the problem has been neglected by the state agency.The agreement largely encompasses actions the state was already taking or working toward, he said. Alabama lawmakers agreed to use a portion of the state´s pandemic relief funds through the American Rescue Plan for water and sewage projects, with some funds dedicated for high-needs projects.\"We have been aware of these problems for a long time. They´ve lasted for generations,\" Harris said. \"It´s only just now, thanks to (American Rescue Plan) funding, that the state has had any ability to begin to address them at all.\"Wastewater problems are well-documented in Lowndes County, a county of about 10,000 people where 72% of residents are Black and 28% live in poverty. Before the Civil War, the county was home to cotton plantation owners where wealthy landowners got rich off the labor of enslaved people. The county later became a center of the struggle for voting rights and civil rights in the 1960s.The region is known as the Black Belt because of the dark rich soil, but the type of soil also makes it difficult for traditional septic tanks, in which wastewater filters through the ground, to function properly.",
        "The region´s intense poverty and inadequate municipal infrastructure contribute to the problem. Maintaining septic tanks have typically been the responsibility of a homeowner, while local governments maintain sewage systems. Some homes in the rural county, where the median household income is about $31,000, still have \"straight pipe\" systems, letting sewage run untreated from home to yard.\"Environmental justice is a public health issue, and where you live should not determine whether you get sick from basic environmental hazards not faced in other affluent and white communities,\" Department of Health and Human Services Office for Civil Rights Director Melanie Fontes Rainer said in a statement.Harris said similar wastewater problems exist in other areas of the state.\"Ultimately these are problems on poverty, and we do have poverty in our state,\" he said."
    ]
}