{
    "articleURL": "/news/article-12044321/Christian-ex-teacher-sues-California-school-district-refusing-lie-parents.html",
    "content": [
        "Jessica Tapia claims she was fired from the Jurupa Unified School District when she refused to lie to parents about their child's pronoun preferenceA federal lawsuit claims students discovered her personal social media pages - in which she spoke out against transgenderism - and found it 'offensive'She is seeking unspecified amount of money plus attorneys' fees and a declaratory judgment that the district's directives are unconstitutionalA former gym teacher has sued a California public school district, claiming she was wrongfully fired when she refused to lie to parents about their child's pronoun preference and hide her religious beliefs.",
        "Jessica Tapia, a Christian woman, claims in a new federal lawsuit that she was fired in January from the Jurupa Unified School District after students found posts on her personal social media pages in which she references her faith 'offensive'.The lawsuit filed Wednesday in the Central District of California argued the district, its Superintendent Trenton Hansen and Assistant Superintendent Daniel Brooks violated her First Amendment rights to free exercise of religion.It stated the district also violated California's Fair Employment and Housing Act and violated Title VIII.Tapia is now seeking an unspecified amount of money in addition to the cost of attorneys' fees, as well as a declaratory judgment that the district's directives are unconstitutional.",
        "According to the lawsuit, which was filed by Advocates for Faith and Freedom on Tapia's behalf, the Riverside woman was originally praised for her work after she became a full-time employee at the school district in 2016.It stated that when Tapia was working at the Mira Loma Middle School, the principal once praised her work, writing: 'Her positive attitude and high expectations make her students believe in themselves, and therefore strive to achieve their potential.'But two days after the end of the 2021 - 22 school year, Tapia's career came crashing down when she received disturbing messages and comments on her personal Instagram page from alleged Jurupa Valley High School students.",
        "When she went to work the next day, the suit contended, Tapia was told she had to meet with Assistant Superintendent of Human Resources Daniel Brooks, who told her that the district was aware of her social media posts and she would be put on administrative leave.'The District claimed, as allegedly supported by students, that Ms. Tapia's social media posts were racist, offensive, disrespectful and mocking towards individuals based upon their sexual orientation,' the lawsuit explained.Lawyers for Tapia, however, argue that is a 'mischaracterization' of who Tapia is, noting that her faith requires her to love 'all people, regardless of sexual orientation, race or gender.'But her faith precludes her from endorsing policies that cause her to reject her faith, such as facilitating a student's gender transition or withholding information about it from the student's parents,' it says.The suit explained as a devout Christian, Tapia believes God defines human sexuality, and that men and women are created in God's image.She also believes lying in any form is inconsistent with the Bible's teachings, and has expressed that belief on social media. ",
        "A review of Tapia's Facebook account by DailyMail.com shows that in June of that year, she posted that she 'just felt like speakin' some truth.'Don't twist the beautiful things God has created, and don't twist truthful words into hate,' she wrote.",
        "And in a Twitter post she wrote: 'Truth over transitions.'If you think you're going to break someone's heart by telling them the truth of who they really are, then break their heart.'She then shared that tweet on her Facebook in February, writing: 'We can be as gentle and loving as possible in this, and we should be, but the fact of the matter is that truth still cuts to the core. 'But that’s no reason to lie. Why? To avoid temporary hurt feelings?'Still, the lawsuit contended, the posts were made on her personal profiles and did not list her as an employee of the school district. It also noted that she never proselytized in school, and only spoke about her faith when students asked her directly. ",
        "In the aftermath of her suspension, the lawsuit says, the district allegedly sent Tapia a Notice of Unprofessional Conduct and presented her with 'A Plan of Assistance and Directives' for the following school year.It included a list of written and verbal directives requiring her to 'lie to parents about their children's gender identity, to refrain from posting content that would \"adversely affect\" her relationship with students and banned her from expressing her religious beliefs with students.'Her union representative, John Vigrass, sent back a letter in response on August 15, 2022, warning the district that 'subjecting employees to a political or social litmus test and proposing to discipline them for off-duty legally protected speech has historically proven to be unwise.'",
        "At the same time, she decided to take a medical leave of absence through December 2022.'The directives caused Ms. Tapia to suffer severe mental and emotional anguish because she was torn between agreeing to conditions that caused her to violate her religious beliefs or losing the job she worked her entire life for,' the suit says.'Consequently, she was unable to focus on her job.' Finally, on December 19, 2022, Tapia sent the district a letter saying she would like to return to work but could not comply with the conditions.'Staying true to my faith and beliefs, I can and will only refer to students by the name and gender/pronouns provided by their parents/legal guardians on school paperwork during enrollment,' she wrote.'The lies and confusion that children are fed in terms of \"You aren't who you were created to be\" is based in evil and I will not take part in that,' she continued. 'Therefore, the best thing I can do to support students and equip them for a bright future is to love and encourage them in who they were created to be, and that is what they were born as, either male or female.'She also said she could not 'refrain from publicly posting on [her] social media pages that adversely affects [her] relationships with students' as she does not 'have control over what a student can find on social media and what they will decide to be affected by. ",
        "'I believe we ought to be teaching students what real life looks like: varying beliefs and opinions that don't always match our own, however, that does not mean we have to take someone's belief and allow it to affect us personally.'She added that she could not 'purposely lie and withhold information from parents about their child.'Instead, the suit stated, she proposed a series of solutions: transferring back to the middle school, having the district require students use the locker room that matches the sex on their birth certificate and providing transgender students with a separate changing area, or giving her a position in which she would not interact with students.",
        "But on January 18, 2023, the district determined it could not accommodate Tapia's religious beliefs without violating California and federal law aimed at 'protecting students and providing all students discrimination and harassment free learning environment,' and she was fired.Tapia later sent back another letter to the district, arguing that lying to parents about their child's identity violates board policy, which requires that district employees create and maintain a climate that encourages honesty.She cited Genesis 5:2 in the letter, which stated 'Males and female. He created them and He blessed them and named them man when they were created.'",
        "She also quoted Proverbs 12:22, which read: 'Ling lips are an abomination to the Lord, but those who act faithfully are His delight. In the end, the lawsuit argued, the district never provided evidence that calling students by the name listed on the school roster would impose a burden or disrupt school learning and 'JUSD cannot show that Ms. Tapia has or will discriminate against or harass students.'DailyMail.com has reached out to the school district for comment.But in a statement, Advocates for Faith and Freedom Vice President Mariah Gonderro said: 'People of faith should be allowed to maintain their personal beliefs without fear of losing their job.'Jessica Tapia was not dismissed for any wrongdoing, rather, she was dismissed for her Christian beliefs. This is a clear violation of our Constitutional rights.'She added: 'We need more educators like her who grasp the fact that parents are partners and the final arbiters of their children, not obstacles to work around. Jessica Tapia represents the values and integrity of educators across our country who are standing up for their beliefs, not backing down.'We are proud to stand with Jessica and will continue to advocate for her and her values.'In a statement to FOX News, Tapia said: 'What has happened to me can happen to anybody. My story is not just mine. It is the story of every teacher of morals and faith.'It is the story of every parent whose first priority is protecting their children.' "
    ]
}