{
    "articleURL": "/tvshowbiz/article-12061247/Love-Islands-Millie-Court-Liam-Reardon-confirm-relationship-back.html",
    "content": [
        "Love Island's Millie Court and Liam Reardon appeared to confirm that their relationship is back on Monday after weeks of speculation.",
        "The ITV2 dating show winners have been enjoying a cruise together this week and looked loved-up in a new snap shared by a fan on their social media. Millie, 26, looked happy as she beamed next to Welsh hunk Liam, 23, who she split last July after a year together.Cruise singer on the ship Jessica Yallup shared the picture on her social media page after the famous pair stopped to take a selfie with her. She captioned it: 'Love Island Winners - Liam and Millie are sailing with us around Europe this week - what lovely people! They love live music and I'm a big Love Island fan.'",
        "Millie looked stylish in a white lace dress while Liam dressed casually in a white T-shirt and jeans. Millie has been sharing a glimpse at her cruise trip this week and on Monday took to Instagram as she had lunch with someone beside her in Toulon.She didn't reveal that it was Liam but it appeared to be a man's arm in the corner of her post.Comments under her latest holiday post as they explored France were full of fans saying they were happy she was back with Liam as they wished the pair a happy holiday. One said: 'Hope you and Liam have the best time!' while another wrote: 'So glad u and Liam are back together!'",
        "A third said: 'Where's Liam??' while another penned: 'Hope you and Li have the best time, Luv ya's.'Representatives for Millie and Liam have been contacted by MailOnline for further comment. It comes after last week Liam admitted 'there's someone in my life' after he was rumoured to have reconciled with Millie nine months after they split.",
        "Reality star Liam was said to have reunited with ex-girlfriend Millie last month after they enjoyed a romantic weekend together in the Lake District over the Easter break.And last week Liam confirmed he is seeing someone, although he has not yet named Essex-born Millie as his other half.He told MailOnline: 'I'm just living life at the moment, doing my own thing. I just got back from Wales - I was at home last week with the family.'I'm currently living in Essex - on my own. Obviously, me and Millie broke up last year, and I'm living on my own.'Remaining coy about his romance, he explained: 'There's someone in my life, yes. I'm not naming any names yet.'I already knew them anyway. Just catching up with an old friend. And yes, we've just been dating for now.'When asked if it was serious, he added: 'It's going OK. It's going well.'Liam confirmed his girlfriend was from Essex and she had already met his parents but did not address the rumours surrounding himself and Millie.",
        "Liam and Millie, who ended their relationship in July after a year together, were spotted enjoying a secret romantic weekend together over the Easter break.The pair spent the Bank Holiday in the Lake District, making the most of the countryside and having a cosy takeaway on the Saturday evening.Following the breakdown of their romance a year after they won Love Island in 2021, Liam went on E4 show Celebs Go Dating, while Millie was recently rumoured to be dating Gogglebox star George Baggs.However, a source close to the pair told MailOnline the couple had been talking again, meeting up in secret and are working through their previous issues.An insider said: 'Millie and Liam have been talking again, but it's early days for them.'They weren't expecting to get back together after their breakup was so painful for them both, but months have passed, and they still couldn't stop thinking about each other.'Coming out of Love Island was a whirlwind and now they're just looking to take things slowly and see if they can rebuild their relationship, which may take some time.'The couple were seen arriving at a Domino's in Windermere where they collected their takeaway pizza together.Attempting to go unnoticed, Liam wore his hood up as he exited his Audi while Millie wore jeans and a hoodie with trainers, as well as her designer sunglasses.",
        "Millie posted about her 'wholesome' Easter weekend on Instagram, sharing photos from the couple's reunion, including snaps from romantic countryside walks.Also last week, Chloe Burrows appeared to accidentally confirm her best friend Millie Court had reunited with Liam.The Love Island star, 27, shared a video on her TikTok account which showed her and Millie ordering a Chinese takeaway.As Chloe filmed, Millie was heard asking a mystery man for a drink. His voice was muffled at first, with Millie responding: 'Yeah, I'll have a Coke Zero please.'Then, a voice sounding just like Liam said: 'Chlo?' to which she replied: 'Yeah go on then,' before doing an imitation of a Welsh accent.Fans quickly voiced their suspicions it was Liam in the clip, with one user writing: 'Thanks for the confirmation Chlo.'Another wrote: 'The confirmation we all needed. Thanks Chlo.'A third user added: 'That is def Liam we have the same accent we're from the same town, I know a Merthyr accent when I hear one.'After winning Love Island, Millie and Liam lived together in Essex but went their separate ways after splitting.Millie now lives with former co-star Chloe, whose relationship with Toby Aromolaran ended last April.In July, Millie admitted she was 'gutted' to separate from Liam and explained it had been a 'tough decision' for the couple.",
        "During filming of Celebs Go Dating, Liam discussed his breakup with Millie, saying he had 'instigated' the end of their relationship.He told the show's experts that he needed to 'love himself' to care for Millie, admitting 'the past few months have been a bit… you know… I need to find myself again.'Liam hinted the pair could get back together, adding 'never say never, I feel like in the future we could rekindle.' Speaking on her YouTube channel last month, Millie confirmed she is dating someone, though told her followers she wasn't ready to disclose the identity of her secret suitor.The reality star revealed the reason she and Liam split was because of continuous rumours surrounding his faithfulness, which put pressure on their romance.Meanwhile Liam says he has no plans to return to television and is staying focussed on boxing now.He told MailOnline: 'I've just been carrying on with my boxing, and I'm hoping to fight soon, either in June or July. So I've been full pelt training with that. I've just been knuckling down with my training, and hopefully get a fight date soon.",
        "'I love the training so that's half the battle. But the discipline, obviously I'm eating clean, cutting out the alcohol, and not going out, but that's just part and parcel - you just have to get on with it. Once I have my first fight, I'll be allowed to then.'",
        "And could Liam see himself fighting fellow former Love Island star Tommy Fury in the future? 'If he came up loads and loads of weights, he said: 'We are different weights, but that's the thing for me now, finding an opponent my size.'Tommy is a lot lighter than me, but yeah, one day if he wants to crack on, then great. Tommy is doing well, so fair play to him. He had a great fight with Jake Paul.'We've never actually spoken before. I've never actually met Tommy, but he seems to be doing well, so fair play to him.'"
    ]
}