{
    "articleURL": "/wires/ap/article-12043653/Relatives-Americans-held-abroad-seek-action-Biden.html",
    "content": [
        "WASHINGTON (AP) - Relatives of Americans detained abroad gathered outside the White House on Wednesday to urge the Biden administration to do more to bring their loved ones home. They said they wanted more direct access to President Joe Biden to be able to better make their case.",
        "The meeting unfolded against the backdrop of high-profile prisoner releases over the last year, including of WNBA star Brittney Griner in Russia, civilian contractor Mark Frerichs in Afghanistan, a group of oil executives in Venezuela and Paul Rusesabagina of \"Hotel Rwanda\" fame.But dozens of Americans still remain held overseas by foreign governments, and the recent arrest in Russia of Wall Street Journal reporter Evan Gershkovich has drawn fresh attention to their plight and underscored how hostage diplomacy remains a persistent, national security priority for the U.S.\"Seeing all these people come home in the last year, I think it shows us that it's possible. There just needs to be the will - from the president, from the highest levels of our government - to bring our families home,\" Harrison Li, whose father, Kai Li, has been imprisoned in China since 2016, said in an interview before the event.But he noted that for all the countries where the U.S. has had recent success, China is not one of them.Also attending Wednesday's event were some of the Americans who'd been freed over the last year, including Trevor Reed, a Marine veteran released by Russia in an April 2022 prisoner swap for a Russian pilot convicted in a drug trafficking conspiracy case. In the weeks before Reed's release, his parents scored a meeting with Biden and also demonstrated outside the White House.",
        "\"When he called us,\" said Reed's father, Joey, \"it meant everything to us. I mean, it gave us a complete new perspective and an ability to hang in there until he brought our son home.\"Months after Reed was released, the U.S brought home Griner in a separate one-for-one swap involving convicted arms dealer Viktor Bout. Griner was not present Wednesday, instead participating in a media day for her WNBA team. She has emerged as an ambassador of sorts for the hostage and detainee community, using her star status to raise attention for others left behind, including Gershkovich and another American in Russia, corporate security executive Paul Whelan.Hannah Sharghi, whose father, Emad, has been held in Iran since 2018 on espionage charges her family says are false, pleaded with Biden to bring her father home so that \"he is able to be my dad again,\" instead of a diplomatic \"pawn in a game that is not his to play.\"\"We have asked for a meeting with the president for so long now that I frankly don't know how else to ask or what else to say,\" she said, adding of her father, \"He's an innocent American. He deserves to be here, standing behind me, fighting the fight for all the families.\"",
        "Roger Carstens, the U.S. government's special presidential envoy for hostage affairs, said in an interview on CNN this week that efforts to bring home detained Americans continue regardless of whether a family speaks to Biden. He said that of the 27 people the U.S. has brought home in the last two years, only two have families that have met with the president.\"The real metric, the real measure of success, is whether someone comes home, steps on a tarmac on U.S. soil and falls into the loving arms of their family,\" he said, adding, \"Whether the president speaks to a family or not doesn't stop the machinery of trying to get the job actually done.\"___Find Tucker on Twitter at @etuckerPA"
    ]
}