{
    "articleURL": "/wires/ap/article-12060963/Brewers-reverse-course-decision-extend-beer-sales.html",
    "content": [
        "MILWAUKEE (AP) - The Milwaukee Brewers have changed their minds about extending beer sales beyond the seventh inning of home games.",
        "The Brewers were among a handful of teams that extended beer sales through the eighth inning in response to the shorter games this season following the pitch clock´s arrival. Starting with their game Monday night against the Los Angeles Dodgers, the Brewers are going back to their previous policy of shutting down beer sales after the seventh inning.When the Brewers decided last month to continue beer sales through the eighth inning, they called it an experimental move.The Brewers said Monday their decision to reverse course wasn´t due to any issues with fan behavior. They simply discovered that sales of all concessions drop precipitously in the late innings. Therefore, keeping beer vendors open for another inning wasn´t producing a significant increase in sales.Other teams that had extended alcohol sales through the eighth inning included the Arizona Diamondbacks, Houston Astros, Minnesota Twins and Texas Rangers. The Twins indicated Monday they plan to continue selling beer in the eighth inning.The Baltimore Orioles already had been selling alcohol through the eighth inning or until 3 1/2 hours after the first pitch, whichever came first.",
        "When reports circulated about the trend, Philadelphia Phillies pitcher Matt Strahm criticized the decisions. Strahm said on the \"Baseball Isn´t Boring\" podcast that teams should be moving the cutoff for beer sales up to the sixth inning, rather than stretching to the eighth or later, which would give fans less time to sober up and drive home.",
        "The average game length through Sunday´s action was 2 hours, 39 minutes, a 27-minute drop from last season. MLB hasn´t completed a season with game lengths that short since 1984, when they also were a 2:39 average. ___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}