{
    "articleURL": "/wires/reuters/article-12043713/Venezuelas-oil-exports-stabilize-700-000-bpd-fall.html",
    "content": [
        "By Marianna Parraga and Mircely Guanipa",
        "HOUSTON, May 3 (Reuters) - Venezuela's oil exports topped 700,000 barrels per day (bpd) in April for the second month in a row, according to shipping data, after a wide-ranging audit of state-run oil firm PDVSA led to export delays earlier this year.An anti-corruption probe mainly focused on missing oil cargo payments to PDVSA had hit exports while executives reviewed supply contracts and account receivables. The investigation has shaken Venezuela's oil industry and led to the arrest of more than 60 people.But an increasing number of customers have been cleared by PDVSA in recent months, green-lighting them to resume taking delivery following account reconciliations and the signing of new contracts under firmer payment terms.In April, a total of 43 cargoes departed Venezuelan ports carrying an average of 703,167 bpd of crude and fuel and 609,000 metric tonnes of petrochemicals and byproducts, according to PDVSA documents and Refinitiv Eikon vessel monitoring data.The oil exports were off 9% from the 773,452 bpd shipped in March, but were the second highest monthly average since September.Oil byproducts and petrochemical exports recovered strongly from previous months, reaching the second highest on record after January's 727,000 tonnes.U.S.-based oil major Chevron's exports to the United States, under a license issued by the Treasury Department in November, also contributed to the overall export recovery. The company last month shipped 141,000 bpd to U.S. refiners and a storage terminal in Bahamas.",
        "Exports to Venezuela's political ally Cuba, which is facing an acute fuel scarcity, fell to some 45,000 bpd of crude, fuel oil, gasoline, diesel and liquefied petroleum gas; from 76,200 bpd the previous months.Venezuela last month received a 450,000-barrel cargo of naphtha from Chevron, and 2.14 million barrels of condensate from Iran's Naftiran Intertrade Company (NICO), both for diluting PDVSA's extra heavy oil output. Another Iran-flagged tanker, the Hero II, arrived in Venezuelan waters this week bringing imports, according to TankerTrackers.com(Reporting by Marianna Parraga in Houston and Mircely Guanipa in Punto Fijo, Venezuela; Editing by Chizu Nomiyama)"
    ]
}