{
    "articleURL": "/wires/aap/article-12039443/RAAF-conducts-Sudan-evacuation-dozens-Aussies.html",
    "content": [
        "More than 190 Australians and their families have now fled Sudan after an Australian air force plane helped evacuate citizens.",
        "The RAAF joined the international evacuation effort overnight with a flight carrying 36 Australians as well as citizens from six other nations, safely to Cyprus.Foreign Minister Penny Wong said the security situation was dangerous and volatile and authorities were in contact with registered Australians about further departures.\"We're pleased that's happened safely in what is quite a difficult security situation,\" Senator Wong told ABC Radio on Wednesday.\"Unfortunately, we still have Australians on the ground.\"Defence Minister Richard Marles said he was grateful for defence force personnel conducting the mission to evacuate citizens, including from partner nations.\"Over the last few days, Australia has been the beneficiary of a number of evacuation flights that have been conducted by our friends and partners and we are grateful to them for that,\" he said.\"We were very keen to play our part in this multinational effort to see people being evacuated from the very difficult situation in Sudan.\"Australia does not have an embassy in Sudan, with its closest in Egypt.Extra consular officials have been sent to missions in Djibouti, Jeddah, Cyprus and Cairo and are providing direct advice to more than 100 Australians and their families in Sudan.The government is urging all Australians to leave the nation as soon as possible through Port Sudan.",
        "The Sudanese Australian community is pushing for the government to issue humanitarian visas to Sudanese people left stranded, after similar assistance was granted when Ukraine was invaded.Senator Wong said the government's focus was on evacuation but it would look at aid through the humanitarian assistance budget.The conflict is between the forces of the Sudanese army chief and the head of a paramilitary group, with both leaders agreeing to a seven-day truce as President Salva Kiir stresses the importance of peace talks.War between the two groups has sparked an exodus of 100,000 people, with the conflict in its third week.The bloody fight has left hundreds dead and thousands wounded.with Reuters"
    ]
}