{
    "articleURL": "/news/article-12051393/Madeline-Bills-Ex-boyfriend-charged-suspicious-death-high-school-basketball-star.html",
    "content": [
        "Madeline Bills, 18, was found dead in her home in Moore, Oklahoma on April 22Her ex-boyfriend Chace Cook was arrested on Monday and charged with rapePolice say more charges could be brought pending medical examiner's report A high school basketball star in Oklahoma has been found dead in her home under suspicious circumstances, after police said her ex-boyfriend jumped her backyard fence and filmed himself raping her while she was unconscious.",
        "Madeline Bills, 18, was just weeks away from graduating with a 4.0 GPA, with plans to play college ball for Northeastern A&amp;M, when she was found dead in her bedroom in Moore on April 22.Her ex-boyfriend, 19-year-old Chace A. Cook, was arrested on Monday at the Navy's basic training center in northern Illinois and charged with first-degree rape in connection with the case.Police have yet to release details on how Madeline died, and say more charges could be brought against Cook pending the medical examiner's determination of her cause and manner of death.The a spokesperson for office of Oklahoma's chief medical examiner told DailyMail.com on Friday that the death investigation was still ongoing. ",
        "The shocking case has rocked Moore, a normally quiet community of 63,000 on the southern outskirts of Oklahoma City. 'It's always sad when you have a crime like this one that has occurred and our thoughts and prayers go out to her family and her friends, and we want to make sure we're doing everything we can to find justice for Madeline,' Moor Police Lieutenant Wes Yost told KOCO-TV. Police say Madeline's body was discovered in her bedroom, which was in a pool house detached from her parent's main home. The teenager had talked of moving out of the pool house and into the main home, however, because of her fears about her ex-boyfriend, Cook.",
        "'She was scared of him, and she told some friends she thought about moving back into the residence because of that, but no signs that were given to police at all to let us know to be aware of him,' Yost said. According to an arrest warrant affidavit, video evidence showed Cook jumping the fence several times to gain access to the pool house where Madeline lived.",
        "That evidence led cops to execute several search warrants, collecting Cook’s car, clothes and DNA samples as evidence, along with his cell phone.A search of the cell phone revealed multiple disturbing videos showing him with Madeline on the night of her death, according to the affidavit.Police said one of the videos depicted Cook filming himself sexually assaulting Madeline while she was unconscious.Cook was taken into custody at the Navy's boot camp at Naval Station Great Lakes on the northern outskirts of Chicago.He is currently being held at the Lake County Jail in Illinois pending extradition to Oklahoma. It was not immediately clear whether he had an attorney to speak on his behalf.",
        "Meanwhile, Madeline is being mourned as a standout high school basketball star and young scholar whose future was tragically cut short.'In her short time given here on earth, Madeline made an incredible impact on many lives. She had a personality that would light up any room,' her obituary read.",
        "She was weeks away from graduating from Moore High School with honors, after achieving a 4.0 GPA. She was a member of the Osage Tribe and had signed a letter of intent to play women's basketball at Northeastern A&amp;M in Miami, Oklahoma. "
    ]
}