{
    "articleURL": "/tvshowbiz/article-12039733/Stella-McCartney-roasts-Chloe-Fineman-awkward-red-carpet-Met-Gala-interview.html",
    "content": [
        "An awkward moment between Stella McCartney and Chloe Fineman from the 2023 Met Gala has gone viral.",
        "The designer, 51, was being interviewed by the SNL comedian, 34, who served as Vogue's red carpet co-host for the night, along with Derek Blasberg.They were joined by actresses Aubrey Plaza and Madelyn Cline - whom McCartney dressed for the event - during the livestream, and things quickly got awkward. At one point McCartney called Fineman out for laughing during the interview, and asked, 'Are you not taking this seriously?''I am!' Fineman replied, with McCartney retorting, 'I think it's very serious.'",
        "Many fans called the interview 'cringe' and 'awkward' but others insisted that all the ladies were in on the joke and were simply being sarcastic.  The interview started with Fineman introducing the guests as McCartney and Cline, but did not call the White Lotus star by her real name, and instead introduced Plaza as 'Audrey.'The actress then provided her own made up last name, calling herself, 'Slutburn.'The two have history together and have appeared on Saturday Night Live together on a number of occasions. Fineman then inquired about McCartney's look for the night - a bedazzled structured blazer dress and shimmering silver stockings - to which Stella dryly replied, 'It's a look. And that's about it.'The tense atmosphere persisted after Plaza described her white gown as simply 'Stella McCartney.'",
        "'It's amazing, isn't it?' McCartney replied.Plaza went on, 'That's right, sustainable Stella,' and the British designer added, 'McCartney.'",
        "Following Plaza's response, Fineman and Blasberg began laughing, at which point McCartney called her out and asked if she was not taking the interview 'seriously.''No, I — I'll be more serious,' Fineman replied, as she and Blasberg attempted to change the topic.Fineman proceeded to ask McCartney about the time she took over brand Chloé, following Karl Lagerfeld's departure in 1997.This year, the ball's theme was Karl Lagerfeld: A Line of Beauty. The late German designer was Chanel's long-time creative director. He passed at age 85 in 2019.The atmosphere then eased up, as McCartney — who's the daughter of Beatles legend Paul McCartney and photographer Linda McCartney — recalled an anecdote about Lagerfeld.'My favorite moment about that — and it's when I felt that I truly arrived — is when Karl found out that I had taken over as successor to the brand, his quote was, \"I knew they would take a big name when I left the brand, but I thought it would be a big name in fashion, not in music.\"'Fineman replied with 'burn!' while Blasberg added, 'A king of the one liners!' 'I loved it, I was like, oh, Karl Lagerfeld knows who I am,' McCartney said of the dig. ",
        "Plaza and Cline - who was a first-timer at the event - both looked incredible.Plaza hit the red carpet in a off-shoulder white gown designed by McCartney with an unconventional cutout going diagonally across her chest.The cutout was accented with shimmering silver material that also fell down her back and fell to her hip.The actress had her black hair pulled up in a bun while accessorizing with diamond-encrusted teardrop earrings by EFFY Jewelry.Cline stunned in a shimmery black gown with silver embellishments, while Fineman wowed in a pink dress with a neckline adorned with black roses."
    ]
}