{
    "articleURL": "/wires/reuters/article-12038861/Reid-Hoffmans-new-AI-startup-Inflection-launches-ChatGPT-like-chatbot.html",
    "content": [
        "By Krystal Hu",
        "May 2 (Reuters) - Inflection AI, the AI startup founded by LinkedIn co-founder Reid Hoffman and former Deepmind researcher Mustafa Suleyman, has released its first AI chatbot product, the company said on Tuesday.Similar to the viral chatbot ChatGPT, Inflection's AI chatbot, named Pi, uses generative AI technology to interact with users through conversations, in which people can ask questions and share interests.Inflection AI said it developed the technology in-house and its Pi chatbot is built on prioritizing human conversations with a high level of emotional intelligence.\"We think of Pi as a digital companion on hand whenever you want to learn something new, when you need a sounding board to talk through a tricky moment in your day, or just pass the time with a curious and kind counterpart,\" said Mustafa Suleyman, chief executive and co-founder of Inflection.Users can interact with Pi across platforms including its website, app and social media platforms like Instagram.Pi uses user data, including conversational content, to train its AI systems, according to its terms of service. Inflection said its database was last updated in November 2022 and not currently connected to the internet.Chatbot powered by generative AI technology has become a crowded field since OpenAI's ChatGPT burst into the scene last November. Using large language models, which mine vast amounts of text to summarize information and generate content, chatbots like Google's Bard, and Character.AI enable people to have in-depth conversations for both professional and personal needs.",
        "VC firm Greylock, where Hoffman is a partner, incubated Inflection and led a $250 million investment in the firm. Hoffman, who is also sitting on the board of Microsoft, resigned from the board of OpenAI in March, citing potential conflicts with the AI startups he works with. (Reporting by Krystal Hu and Jeffrey Dastin Editing by Mark Potter)"
    ]
}