{
    "articleURL": "/wires/pa/article-12043389/Strikes-security-guards-Heathrow-ahead-pay-talks-break-down.html",
    "content": [
        "A series of strikes by security guards at Heathrow Airport will go ahead from Thursday after last-minute talks over a pay dispute broke down.",
        "Around 1,400 members of Unite based at Terminal 5 and in campus security will walk out on May 5-6, 9-10 and 25-27.The strikes include the run-up to and the day of the King’s coronation. Unite has given Heathrow Airport every opportunity to make an improved pay offer, which could have led to the strike action being suspended  Wayne King, Unite  Talks at the conciliation service Acas failed to resolve the row, said Unite.The union’s regional co-ordinating officer Wayne King said: “Unite has given Heathrow Airport every opportunity to make an improved pay offer, which could have led to the strike action being suspended.“Sadly, they refused to grasp the opportunity to make an offer which could meet members’ expectations.”",
        " We have asked for the independent and specialist support of Acas to chair further talks with unions and find a resolution  Heathrow spokesperson  A Heathrow spokesperson said: “Passengers can be reassured that they will travel as normal. This is an important time for the country, and we will not let these unnecessary strikes disrupt journeys.“We have activated our contingency plans and deployed 750 additional colleagues and the entire management team who will be on hand in the terminals providing assistance to passengers.“The majority of colleagues do not support strike action. Colleagues could have an inflation-matching pay increase for two years – 10% this year and a CPI-linked increase in 2024, as well as a £1,150 lump sum but instead they’re left empty-handed by Unite’s refusal to allow members to vote on the offer.",
        "“We have therefore asked for the independent and specialist support of Acas to chair further talks with unions and find a resolution.”"
    ]
}