{
    "articleURL": "/news/article-12048319/El-Chapos-sons-claim-NOT-leaders-Sinaloa-Cartel.html",
    "content": [
        "El Chapo's four sons sent a letter to Milenio TV to defend themselves against fentanyl trafficking accusations made by the Drug Enforcement AdministrationThe three-page missive was provide to outlet Wednesday night and in it Los Chapitos claimed they are not the leaders of the Sinaloa CartelThey also dismissed DEA allegations that they traffic fentanyl, indicating: 'We have never worked with fentanyl'The sons of notorious kingpin Joaquín 'El Chapo distanced themselves from flooding the streets of the United States with fentanyl and claimed they are not the leaders of the transnational criminal organization their jailed father co-founded.",
        "The four siblings released a letter to Mexican news outlet Milenio that was read live Wednesday night in which they also attempted to discredit a Drug Enforcement Administration (DEA) allegation that they fed their enemies to their pet tigers.Iván Archivaldo Guzmán Salazar, Jesús Alfredo Guzmán Salazar, Ovidio Guzmán López and Joaquín Guzmán López, otherwise known as 'Los Chapitos,' reportedly were addressing the media for the first time ever in the missive that was delivered by attorney José Rodríguez, who represents them and their father.They alleged that many people and groups were laying claim to being members and leaders of the Sinaloa Cartel, which El Chapo created with Ismael 'El Mayo' Zambada,' who has never been arrested by Mexican authorities and who according to the DEA is one of the leaders of the criminal syndicate.",
        "'We are not the head of the Sinaloa Cartel nor are we interested in being,' Los Chapitos wrote. 'What does exist is a countless number of small and large groups that have their base of operations in the state or are made up of people from Sinaloa and operate in other parts of the country or even in other parts of the world. These groups operate completely independently of others and are not accountable to us, nor do we request them.'",
        "Iván Archivaldo Guzmán Salazar and Jesús Alfredo Guzmán are wanted by the United States government - $10 million rewards for information leading to the arrest and/or conviction of each one of them is being offered. A $5 million is also being offered for Joaquín Guzmán López. Ovidio Guzmán López is currently sitting in a Mexico City prison battling the Mexican judicial system to stop his extradition to the U.S.Los Chapitos slammed the DEA for the April 14 press conference where agency administrator Anne Milgram released details of charges against the Sinaloa Cartel and accused Los Chapitos of being at the forefront of the organization's 'most prolific fentanyl trafficking operation in the world.'According to U.S. prosecutors, under the leadership of El Chapo's sons, the Sinaloa Cartel remains one of the most powerful transnational criminal organizations in the world and is responsible for creating and importing fentanyl to the United States.",
        "The indictment accused Los Chapitos of flooding the streets of the United States with fentanyl over the last eight years, leading to the deaths of hundreds of thousands of Americans. However, DEA agents have managed to infiltrate the Sinaloa Cartel and Los Chapitos over the last year and a half, obtaining 'unprecedented access to the organization's highest levels, and followed them across the world.'",
        "The group has leaned on its connections in China to import precursor materials to Mexico, where fentanyl is manufactured into powder and pills at secret laboratories, according to the DEA. The agency said that Los Chapitos rely on couriers, tunnels and stash houses throughout Mexico and the United States to smuggle the lethal drug to at least 27 American cities.The synthetic drug is considered 50 times stronger than heroin and is blamed as the leading cause of death for Americans between the ages of 18 and 19. Authorities saw a 94 percent spike in fatal overdoses from 2019 to 2021. There were at least 196 fentanyl-related deaths each day during that period.In response, El Chapo's sons denied the charges but admitted that there are individuals who are actively involved with the production and trafficking of the deadly synthetic drug and called on authorities to stop sending only one agent to investigate so that the truth can be uncovered. 'The fame of our name reached an unsuspected position. We have never worked with fentanyl,' the letter read. 'However, in Sinaloa there are many who work it. That is why there are seizures, which have a first and last name, investigate.'It's easy to know who really owns all those seizures. We have never knowingly established relationships with people who traffic fentanyl. We want to make the following clear: Iván will never say or say 'we will flood the streets of the United States with fentanyl.' ",
        "The letter offered a rebuttal to remarks made during the April 14 presser by U.S. Attorney General Merrick, who said that Los Chapitos henchmen 'fed some of their victims dead and alive to two tigers belonging to' the four siblings.'A tiger may kill a person, but eat him? We do not have nor did we have tigers,' the shot back.Los Chapitos also dismissed DEA claims that they had been involved in armed conflicts with rival criminal groups and denied killing any rivals.'We never got involved in war or any difference against the group called Los Zetas, so they cannot say that we have participated in homicide against its members.'"
    ]
}