{
    "articleURL": "/sport/formulaone/article-12045543/Toto-Wolff-insists-Mercedes-remains-100-CENT-committed-Lewis-Hamilton-amid-Leclerc-rumours.html",
    "content": [
        "Speculation has been rife that Hamilton and Leclerc could swap places next yearMercedes will try to ensure next year's car can help Brit mount title challengeHamilton fueled rumours by chatting to Ferrari boss Frederic Vasseur in Baku Toto Wolff snuffed out speculation that Mercedes would be making a move for Charles Leclerc next season, instead stating that the constructor remained '100 per cent committed' to star driver Lewis Hamilton. ",
        "The seven-time world champion's deal with Mercedes is up for renewal at the end of 2023, and amidst frustrations with the W14 this season, rumours have swirled that the storied driver may be looking to move on. Ferrari is said to be the leading front-runner should Hamilton make a move across the paddock and their current driver Charles Leclerc refused to rule out a move in the other direction ahead of Sunday's Azerbaijan Grand Prix. But Hamilton's team principal poured scorn on the stories in an interview with Formula1.com when asked about whether the constructor would make a play for the Monegasque driver ahead of race weekend in Miami. 'I think [Leclerc is] 100 per cent committed and loyal to Ferrari and it's his contract and in the same way, we are 100 per cent committed to putting pen to paper with Lewis,' Wolff began. ",
        "'I think nobody doubts Charles's ability and he's a good guy.'But, Wolff added, no conversations had taken place between the two parties. 'The only time I talked to him was to ask where the gate is in Melbourne to board the plane. No contact otherwise,' the Austrian quipped. When pressed on the topic, Wolff responded that the press 'want that headline'. 'Charles is a super guy, and for the long-term future someone you need to always have on your radar and that's clear. But not for the short or medium-term.' ",
        "Flames were fanned in Baku after Hamilton was spotted talking to Ferrari team principal Frederic Vasseur in the paddock. Whilst the driver is yet to be drawn on the topic, discussions about next year will likely come down to Mercedes' ability to provide Hamilton with a car capable of shattering Red Bull's dominance and allowing him to challenge for a historic eighth world champion. This season's shaky start has seen Hamilton achieve a podium finish just once after placing second in Melbourne, whilst his team-mate George Russell is yet to finish in the top three. The 38-year-old currently sits fourth in the drivers standings, behind Max Verstappen and Sergio Perez of Red Bull, and former team-mate Fernando Alonso, now at Aston Martin.  For his part, Hamilton has said he is 'ready to win' another world championship and that he is in his 'best ever shape' to contest the title. But ahead of the constructor's plans to release an upgraded W14 at the Emilia-Romagna Grand Prix at the end of the month, Wolff has asked his drivers to manage their expectations. ",
        "Instead, the team principal has asked Hamilton to have faith in Mercedes looking forward. 'I think he feels very much that he's strong and we feel the same, that we are not going to race for a drivers' championship this year,' Wolff continued. ",
        "'That is what it looks like at the moment, and we just need to give him a car that can do that and hopefully we can get our package to a winning package this season and have something that can bring him his eighth title, and no doubt he is motivated to achieve this.'That's something he wants to do, that's his ability, we have a great relationship personally, and with the team he's been a strong pillar over the last 10 years, so we are in a really good place.'"
    ]
}