{
    "articleURL": "/sport/football/article-12041361/Petr-Cech-joins-Rio-Ferdinand-inducted-Premier-League-Hall-Fame-2023.html",
    "content": [
        "Petr Cech is the 18th player to be inducted into the Premier League Hall of Fame The ex-goalkeeper holds the record for the most clean sheets in the top flightREAD: Legendary Manchester United defender Rio Ferdinand is also inducted Petr Cech has joined Rio Ferdinand in being inducted into the Premier League Hall of Fame for 2023.",
        "The former goalkeeper - who represented Chelsea and Arsenal in his career - was selected after a vote by fans across the world from a 15 person shortlist.Cech becomes the 18th player to join the Hall of Fame after eight legendary stars were inducted in both 2021 and 2022 and Ferdinand was the first to be added this year.He joins Sir Alex Ferguson, Arsene Wenger and Ferdinand in the 'Class of 2023', with Ferguson and Wenger the first managers to ever be inducted.Cech is one of the greatest goalkeepers in Premier League history, holding the record for the most clean sheets with 202 in 443 top flight appearances.",
        "The former Czech Republic star is the second goalkeeper to be inducted into the Hall of Fame, joining Peter Schmeichel.After growing up in communist Czechoslovakia, Cech moved to Chelsea from Rennes in 2004 and quickly become a fans favourite at Stamford Bridge.In his debut campaign, he conceded just 15 goals and kept 24 clean sheets - both records for a single season - as the Blues won the Premier League title for the first time.This was the first of four titles he won with the club and Cech was the fastest keeper to reach 50 and 100 clean sheets in the top flight, while he also won four Golden Glove awards.",
        "Known as a superb shot stopper, but also an organiser of the defence, Cech had the ability to speak eight different languages.He also showed remarkable courage to recover from a potentially life-threatening injury when he fractured his skull against Reading in 2006.After making 333 Premier League appearances for Chelsea, he lost his place in the team to Thibaut Courtois during the 2014-15 campaign and ended up moving to Arsenal at the end of that season.He racked up 110 league appearances for the Gunners across four years before retiring in 2019 when he moved back to the Blues as a technical and performance advisor - a role he held until June last year.Reflecting on his achievement of being inducted into the Hall of Fame, Cech told the Premier League: 'When I was a child growing up in communist Czechoslovakia, playing in the Premier League was an unimaginable dream. ",
        "'When I look back to where I started, diving on rock solid pitches with stones like golf balls, it has been an amazing journey.'I hope to be known as someone who showed effort, commitment, and consistency to make the Premier League better.'Cech also outlined his pride at having the record for the most clean sheets in top flight history.",
        "He added: 'Making a great save feels the same as scoring a goal and I’m proud of my clean sheet record, but I was even more happy when those clean sheets won matches and points for the team and contributed to titles!.''When I hit 100 clean sheets, and it was the fastest 100 as well, I thought: “OK, that's an achievement in such a tough league.” But I am always thinking of the next milestone: “Can you do 150?”'When that happened, I thought: “Nobody's done 200” and I thought that would be amazing.'I'm proud that I managed to get more than 200 clean sheets and I saved a penalty [for Arsenal] in the Watford game to reach 200, which made it special.'It's not only an achievement for a goalkeeper. You need your teammates to come together and when defenders dive in to block shots for you, it makes it easier.'Cech continued: 'It's an honour for me to be voted into the Hall of Fame in the best league in the world. That's really a special recognition and leaves a legacy. 'I’m proud that fans voted for me and appreciated the way I performed over the years.'I hope it shows that no matter where you come from, you can still do it.'",
        "The Hall of Fame launched in 2021, with inaugural inductees including David Beckham, Dennis Bergkamp, Eric Cantona, Thierry Henry, Roy Keane, Frank Lampard, Steven Gerrard and Alan Shearer.In 2022, Sergio Aguero, Didier Drogba, Vincent Kompany, Wayne Rooney, Peter Schmeichel, Paul Scholes, Patrick Vieira and Ian Wright, were the next group to be inducted into the Hall of Fame.Sir Alex Ferguson, Arsene Wenger, Rio Ferdinand and Cech are the first four individuals to be added in 2023. To be eligible for the Premier League Hall of Fame, individuals must have been retired as of 1 January 2023, and only their Premier League career is considered in their candidacy. It recognises and celebrates individuals who have an exceptional record of success and have made a significant contribution to the Premier League since its inception in 1992. It is the highest individual honour awarded by the league. The 15 person shortlist for 2023 was: Tony Adams, Ashley Cole, Gary Neville, Sol Campbell, Jermain Defoe, Michael Owen, Michael Carrick, Les Ferdinand, John Terry, Petr Cech, Rio Ferdinand, Yaya Toure, Andrew Cole, Robbie Fowler and Nemanja Vidic.One more player will be revealed to be joining Ferdinand and Cech in the Hall of Fame later today, with an event celebrating the 'Class of 23' to be held in London this evening. ",
        "1. Alan Shearer2. Thierry Henry3. Eric Cantona4. Roy Keane5. Frank Lampard6. Dennis Bergkamp7. Steven Gerrard8. David Beckham 9. Patrick Vieira 10. Wayne Rooney11. Paul Scholes12. Didier Drogba13. Peter Schmeichel14. Sergio Aguero15. Vincent Kompany16. Ian Wright17. Sir Alex Ferguson18. Arsene Wenger 19. Rio Ferdinand "
    ]
}