{
    "articleURL": "/news/article-12047415/Is-Asda-open-Coronation-bank-holiday-Opening-times-revealed.html",
    "content": [
        "Asda has published opening times for coronation day and bank holiday Monday Ahead of King Charles' coronation, popular supermarket brand Asda has revealed its opening hours for the upcoming Bank Holiday. ",
        "Different opening hours may be in place at your nearest Asda store, depending upon its size and location. It is the second Bank Holiday to fall in May 2023, after the traditional early May Bank Holiday on 1 May. So, will Asda be open on coronation day? Will hours change due to the occurrence of another Bank Holiday? Read on below for everything you need to know about Asda opening times over the coronation weekend. ",
        "Is Asda open on coronation day? On Saturday, 6 May, Asda superstores will operate between 6am and 7am, before shutting at 10pm. Usually, this will include stores open until midnight and its 24 hour stores.On Sunday, 7 May, most Asda superstores will open from either 10am or 11am, until 4pm or 5pm. Is Asda open on bank holidays? On the bank holiday, the majority of Asda stores will be opening from 7am to 8pm.Asda stores located in Scotland will run under normal trading hours on the Bank Holiday Monday. Asda has more than 600 stores across Britain, meaning that operating hours will vary across the country.If looking for opening times for your local Asda branch, shoppers should check the company's official store locator. What does Asda stand for? In the 1920s, the Asquith family, from Yorkshire, ran a butchers in the small market town of Knottingley.After opening a further seven stores, brothers Peter and Fred Asquith travelled to the US in 1958 - where they visited a Piggly Wiggly, which is considered to be the world's first self-service supermarket.",
        "The pair were so inspired by their business trip that they decided to convert a theatre in Castleford which was once known as 'The Queens' into a super-store in 1963.As they upscaled their business, the brothers decided to hire a new team to oversee their in-store butchers.",
        "Associated Dairies &amp; Farm Stores Ltd had been formed in 1949 and brought together a group local farmers in the West Riding area.While the Asquith brothers were opening their supermarkets in the 50s and 60s, the Associated Dairies team had opened a series of pork butchers along with their Craven Dairies branch of cafes.In 1965, Peter Asquith got in contact with Associated Dairies' Noel Stockdale to discuss merging their businesses.As detailed on the supermarket's website and confirmed by a spokesperson, the team settled on the name Asda for the business - as it combined the 'As' of Asquith and the 'Da' of 'Dairies'."
    ]
}