{
    "articleURL": "/wires/ap/article-12042981/Man-accused-Harvard-bomb-threat-extortion-plan.html",
    "content": [
        "BOSTON (AP) - A man is accused of phoning in bomb threats to Harvard University and demanding a large amount of Bitcoin in return, federal prosecutors said.",
        "William Giordani, of Nashua, New Hampshire, was arrested Tuesday on charges of conspiracy and aiding and abetting extortionate threats. He has a detention hearing scheduled in federal court in Boston on Friday. It wasn't immediately known if he had an attorney.Harvard University's police department received six calls regarding bombs and demand for payment on April 13, according to a campus police officer's affidavit. The caller gave a location and a description of a device, which police found and destroyed. Police, who evacuated the area, said they found no other devices.The device had a metal locking safe, a package of wire, a quantity of fireworks inside the safe, and a small rectangular box with wires attached to it, police said. It also had a yellow Home Depot sticker and another man's name. A Home Depot store said someone by that name had allegedly placed an order for some of supplies found in the device.Police said Giordani was allegedly seen on camera picking up the order at the store, and on surveillance video near where the device was found.Giordani later told police that \"all he did\" was respond to a Craigslist ad and \"just put some fireworks in a safe and put them at Harvard,\" according to the affidavit.",
        "He also said he spoke the person who placed the ad, who said he would be calling police to make a bomb threat to get money and would pay him, the affidavit said.Police allege that Giordani placed a Craigslist ad posing as a parent of a Harvard student saying they needed someone to drop off supplies for their son. A contact number was the same one that Giordani allegedly used later, authorities said. He also allegedly left a receipt with the parent's name inside the bag that police recovered."
    ]
}