{
    "articleURL": "/wires/ap/article-12057387/Arsenal-wins-Man-U-loses-leave-plenty-play-EPL.html",
    "content": [
        "A display of character and resilience from Arsenal has ensured there's plenty of life left in the Premier League title race.",
        "The fight to finish in the Champions League qualification positions is far from over, too, after David De Gea's latest mistake in another away loss for Manchester United.By inflicting a rare home defeat on Newcastle, Arsenal gained redemption for one of its most painful losses under Mikel Arteta and kept the pressure firmly on Manchester City just when it looked like the defending champions might be strolling to the title.Arsenal's 2-0 win in a febrile atmosphere inside St. James' Park left City with a one-point lead with three weeks left in the season. City has a game in hand but the tougher run-in, with three away matches in its remaining four fixtures.\"Let´s keep going and digging and digging, and see what is there,\" said Arteta after a win earned by Martin Odegaard's long-range strike in the 14th minute and an own-goal by Fabian Schar in the 71st.In a physical game, Arsenal's players were shoved and roughed up, while riling the home fans with streetwise tactics that might have pushed the boundaries of gamesmanship.",
        "Anything to keep alive hopes of a first league title since 2004.\"We had to be very smart and to be ugly at times,\" Odegaard said. \"It's a big step for a young team like ours to come here and do the things we did.\"",
        "Away wins are proving much harder to come by for United - and it's keeping the battle for Champions League qualification interesting.It's just one in six road trips for Erik ten Hag's fragile team, which lost 1-0 at West Ham just three days after a defeat by the same score at Brighton on a 99th-minute penalty.West Ham's winner came much earlier, with De Gea somehow allowing a weak shot by Said Benrahma from outside the area to dribble past his outstretched arm and slowly into the net in the 27th.No Premier League player has made more errors leading to goals this season than De Gea's four, according to the competition's stats supplier, Opta. De Gea also made a big mistake at Sevilla as United slumped to defeat in the Europa League quarterfinals last month.United stayed in fourth, two points behind third-place Newcastle.Liverpool, which is in fifth place and a point back from United, was the big winner Sunday, though has played one game more.PRE-MATCH VIDEOBefore making the journey to St. James' Park from the team hotel, Arsenal's players were shown video clips from last season´s 2-0 loss at Newcastle that cost them a chance to finish in the top four and qualify for the Champions League.",
        "They were bullied and outplayed that day, but appeared to have learned their lesson.\"We had to see our faces and understand the emotions, not just the players but the staff also,\" Arteta said of the video. \"You don´t want to be like this anymore, it is a horrible feeling. Today we had to show a different type of competitiveness, desire and then quality.\"Odegaard's goal came against the run of play. Newcastle had already struck the post through Jacob Murphy and seen a penalty overturned following a VAR check by the time the Norway playmaker slammed a low shot through the legs of Newcastle defender Sven Botman and past goalkeeper Nick Pope.Alexander Isak also hit the post with a header and Newcastle paid for its profligacy when Gabriel Martinelli's cross was diverted into his own net by Schar.\"The noise was there today,\" said Newcastle manager Eddie Howe, whose team lost at home for just the second time this season. \"We just needed to score and it would have helped us take off.\"ALMOST SAFEWith its Premier League survival virtually secure, West Ham can maybe afford to focus on winning a European trophy in the final weeks of the season.The win over United lifted West Ham to 37 points, seven above the bottom three with three games left - two of which are against teams lower in the standings in Leeds and Leicester.",
        "West Ham is still involved in the Europa Conference League, with a two-legged semifinal against Dutch club AZ Alkmar starting with the home game on Thursday.___Steve Douglas is at https://twitter.com/sdouglas80___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}