{
    "articleURL": "/news/article-12041475/Madeleine-McCanns-parents-share-heartbreaking-poem-mark-16-years-vanished.html",
    "content": [
        "Madeleine McCann went missing in 2007 during a family holiday in Portugal Madeleine McCann's devastated parents today shared a heartbreaking poem to mark 16 years since their little girl vanished from their holiday villa in Portugal.",
        "Kate and Gerry McCann said they still find it 'hard to find the words' to convey how they feel on the 16th anniversary of Madeleine's disappearance, as they said they are still waiting anxiously for a 'breakthrough' in the case.In a touching tribute, the grieving parents shared a poem by Clare Pollard which includes the heartbreaking line 'please let me hold you'.The McCanns said Pollard's poem The Contradiction 'resonates strongly with us' as it conveys the sheer pain of losing loved ones. They added they 'still very much miss' Madeleine, who would now be 19 if still alive. The British girl, then three, went missing while on holiday with her family in Praia da Luz, Portugal, in May 2007.",
        "Instead, as words failed them, the parents shared Pollard's poem which reads: 'The absence contradicts itself: the missing conjures what we miss. You are not here, I'm not myself, but still talk to you like this.",
        "'You're in the crowd, the news, the glimpse - I make you there when you're not there.'I trace your steps, I map your face, I say your name, see you in air.'The poem continues: 'You're all I know and so unknown. I cannot hold you yet I do: please let me hold you in my head and where are you now, hold me too.",
        "'How can you be so near and far? You are not here. But here you are.'After posting the poem, the McCanns added that as the police investigation into Madeleine's disappearance continues, they 'await a breakthrough'. 'Thank you to everyone for your support - it really helps,' the parents wrote before signing of with their names.The post came two weeks after German prosecutors said are dropping sex offence charges against Christian Brueckner, a suspect in Madeleine's disappearance, as they did not have jurisdiction over him.",
        "Bruecker, 45, is currently serving a seven-year prison sentence in Germany for a rape he committed against a pensioner in Portugal in 2005. Last year he was charged with a number of sex offences – said to have taken place on the Algarve where the three-year-old vanished in 2007 – between 2000 and 2017.But those charges have not been dropped by the Braunschweig court over issues with jurisdiction. But it's believed another court in Germany could take charge of the case.Germany prosecutor Hans Christian Wolters said that nothing has changed in the toddler's case and that the decision by the Braunschweig court will need to be reviewed.Brueckner hasn't been charged in Madeleine's case, in which he is under investigation on suspicion of murder. ",
        "He spent many years in Portugal, including in the resort of Praia da Luz around the time of Madeleine's disappearance there in 2007. He has denied any involvement in her abduction. Madeleine went missing while on holiday with her family in a villa in Praia da Luz, Portugal, in May 2007. Her siblings, twins Sean and Amelie McCann, were in the same room as Madeleine when she vanished.Maddie disappeared from her bed in a holiday villa while Gerry and Kate, from Rothley in Leicestershire, were having dinner with friends at a tapas restaurant just 55 metres away.Kate checked the children at 10pm to find Maddie had disappeared, but the twins, then aged two-years-old, were still sleeping soundly in their cots. Last month, it was revealed that police investigating Madeleine's disappearance are to receive hundreds of thousands of pounds in a new funding effort.A significant sum has been requested by the Met Police and is likely to be approved by the Home Office, reported the Sun. Each year hundreds of thousands of pounds are spent on attempts to find her, with a total of £13million being spent since 2011. "
    ]
}