{
    "articleURL": "/wires/ap/article-12053407/Angels-rally-5-4-victory-Rangers-10th-inning.html",
    "content": [
        "ANAHEIM, Calif. (AP) - After not having a late comeback in their first 30 games, the Los Angeles Angels have two in the past three days.",
        "Zach Neto scored on Josh Sborz´s wild pitch in the 10th inning, and the Angels rallied from a four-run deficit to top the Texas Rangers 5-4 on Friday night for their fifth straight win.The Angels were down 4-3 in the ninth inning Wednesday night at St. Louis before rallying for a 6-4 win.It is the first time Aug. 5, 2015, against Cleveland, that the Halos have a walk-off win due to a wild pitch.\"We're just a bunch of dudes who get after it,\" Neto said. \"We didn't get off to the best start that we wanted, but we came back and fought and came out with a win.\"Neto started the inning on second base as the automatic runner. After Will Smith (0-2) intentionally walked Mike Trout, Neto advanced to third when Trout was forced out at second on Shohei Ohtani's grounder. Sborz relieved Smith and his first-pitch slider got by catcher Jonah Heim to score Neto.",
        "Carlos Estévez (1-1) pitched a scoreless 10th and had a pair of strikeouts. Trout had two hits and drove in a run.The Angels trailed 4-1 in the ninth and were down to their last out before rallying against Smith.Brandon Drury had a base hit to put runners on first and second. Chad Wallach, who came into the game in the top of the ninth as catcher, followed with a two-run double off the wall in right-center. Luis Rengifo's single then drove in Wallach, tying it at 4.",
        "\"It was awesome to hit a double in a situation like that to bring it within one. It got me pumped up and the guys in the dugout too,\" Wallach said.Trout's RBI single in the eighth inning started the comeback.Texas jumped out to a 4-0 lead largely due to mistakes by the Angels. In the third inning, Marcus Semien drew a leadoff walk against Tyler Anderson. He eventually came around to score on Adolis García's sacrifice fly.Anderson added more self-inflicted pain in the fourth. Ezequiel Duran was hit by a pitch and Leody Taveras walked to begin the inning. Semien drove in Duran with a ground-rule double after Angels left fielder Taylor Ward lost track of the ball in the lights. Taveras scored when Nathaniel Lowe reached first on a throwing error by shortstop Neto.Lowe hit a two-out RBI single in the eighth to make it 4-0. The inning was prolonged by a throwing error by third baseman Anthony Rendon.\"We did many good things, but you have to get 27 outs and we couldn´t do it,\" Rangers manager Bruce Bochy said. \"It's another one that we did let get away. We have to keep bouncing back from these tough losses.\"UNSUNG HEROJaime Barría followed Anderson and allowed one unearned run in four innings. The Angels' right-hander gave up three hits and struck out three.",
        "SEMIEN CONTINUES TO PRODUCESemien leads the AL with a .500 average with runners in scoring position. Including the ground-rule double, he is 11 for his last 20 with 15 RBIs dating to April 16.Semien had two hits. He has reached base in 18 of his last 19 games.FOR STARTERSTexas´ Dane Dunning pitched five innings of two-hit ball in his first start of the season.The right-hander - who had made eight appearances out of the bullpen to start the season - moved into the rotation after Jacob deGrom was placed on the injured list due to right elbow inflammation.WEB GEMRendon made a nice diving stop near the foul line on a line drive hit by Duran during the second inning.TRAINER'S ROOMRangers: C Mitch Garver (mild left knee sprain) took batting practice. Bochy said the timeframe for Garver's return is appearing to be around May 23.Angels: LHP José Quijada and RHP Austin Warren will both undergo season-ending Tommy John surgery on May 17. Dr. Keith Meister in Arlington, Texas, will perform both surgeries. ... LHP Aaron Loup was placed on the 15-day injured list due to a right hamstring strain. RHP Andrew Wantz was recalled from from Triple-A Salt Lake.UP NEXTRangers: RHP Nathan Eovaldi (3-2, 3.93 ERA) threw his first complete-game shutout in last Saturday's 2-0 win over the New York Yankees.",
        "Angels: LHP Reid Detmers (0-2, 4.85 ERA) is 1-1 in five career starts against Texas.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}