{
    "articleURL": "/news/article-12058537/Virginia-teacher-suspended-forbidding-Spanish-class.html",
    "content": [
        "A teacher in Virginia told a Spanish-speaking student they had to speak English'Go back to wherever that Spanish-speaking country is and speak it,' they saidThe teacher was placed on leave pending an investigation by the school board A middle school teacher in Virginia has been suspended after being captured on video telling a Hispanic student she was only allowed to speak English in class.",
        "In a leaked recording, which was eventually broadcast on a Hispanic radio station, the unidentified teacher can be heard telling the pupil they were not allowed to speak in Spanish.The incident happened at Boushall Middle School in Richmond, Virginia, where 44 percent of students are Hispanic and 38 percent are learning English, according to local station WRIC.The shocking recording shows the girl telling her teacher Spanish is her native language, before the teacher responds: 'Right, well go back to wherever that Spanish-speaking country is and speak it. 'When you in America you gonna speak English in the classes that are spoken here.' The teacher was suspended from the school last week as the school board has said it is investigating.",
        " 'My native language is Spanish, so I can talk in Spanish,' the student had said before being cut off by her teacher.During the confrontation, the student said she 'didn't know speaking my own language was wrong,' to which the teacher said that other students who speak French or Russian are also required to speak English in the classroom. The teacher's comments first received attention after the video went viral last month on social media groups and was eventually played on the radio.A transcript suggests the teacher told the student that her mother could come to the classroom and that she would also be spoken to in English.",
        "'Your father doesn't pay my salary, the State of Virginia does,' said the teacher, according to the transcript, which was shared by NBC12.After the student says something 'inaudible', the teacher says: 'Well she can come up here all day and I'll speak English when I see her. And she's going to speak English too. Period. You act like your mom own the world, c'mon now.''I didn't say she owned the world,' replied the student.'I know but that is very ignorant of you to throw up your mom as if it's going to change the rules in my class. English is spoken in this class. Period,' said the teacher, according to the transcript.",
        "In an interview since the incident, the student, who wanted to remain anonymous, said she didn't want other Hispanic students to experience the same thing.'I just wanted that no other Hispanic kid would go through the same thing that I did,' she told NBC12.'I told one of my friends, oh, you don't have friends in Spanish because we joke around like that, and that teacher started yelling at me, telling me I couldn't speak Spanish,' the student said.'She just kept saying that it just wasn't allowed in here in America you speak English, and if I wanted to speak Spanish, then to go to wherever that Spanish-speaking country is,' she added. ",
        "The mother of the student said despite the suspension of the teacher she was worried they would be able to come back.'I just don't trust to send my student to a school where a teacher is treating my daughter that way,' the mother told NBC12.",
        "Richmond Public Schools provided a statement on the incident and confirmed the teacher was placed on leave.'Racism, bigotry, and intolerance of any kind will not be tolerated at Richmond Public Schools,' read the statement.'The employee is currently on administrative leave pending the outcome of an internal investigation by the Employee Relations team.'While we can not comment further on personnel matters, please know that RPS happily serves a diverse group of students across many races and nationalities.'We will continue to support and advocate for them all.'"
    ]
}