{
    "articleURL": "/tvshowbiz/article-12058295/Keke-Palmer-stuns-curve-hugging-leopard-print-dress-promotes-upcoming-movie-album.html",
    "content": [
        "Keke Palmer poured her curves into a figure hugging leopard print dress for a series of snaps on Instagram on Sunday.",
        "The Nope actress, 29, is promoting her latest album, Big Boss, which drops on May 12 and includes an accompanying film.She captioned the post: 'Big Boss' the movie and album is here May 12thhhhh!!!!! Get tf into the DOLL. Don't be late to the party.'This is just the latest event in an action packed 2023 for the singer and actress. In February, she welcomed her first child, Leo, with her partner Darius Jackson, 29. And last week, she slayed the red carpet at the Met Gala.",
        "Famous friends took to the comments section to offer their opinions on Keke's look.Orange is the New Black alum Uzo Aduba wrote, 'GURL' and added four flame emojis.Meanwhile singer Keaira LaShae chimed in saying, 'That after baby glow always hit different!!! Love this for you sis,' and included a heart eye emoji.'You look so good!!!!' Lori Harvey quipped while former Miss USA Kenya Moore wrote, 'Never looked more beautiful' and added 11 flame emojis.On May 4, Keke posted the tracklist for her upcoming album on Instagram. She captioned it: 'BIG BOSS TRACKLIST REVEAL! My new film and album is dropping on May 12 and I am beyond excited for you all to experience it! Thank you for joining me on this journey.'",
        "The Big Boss film gives fans a look at the visual album and a behind-the-scenes look at her career.She shared a clip from the movie in March and called it, 'a musical narrative that chronicles my experience in the music industry.'",
        "'I can’t wait for you guys to watch the film and hear the album,' she wrote in the caption.Keke is releasing the album through Amazon Music. The streamer is where she hosts her podcast Baby, This is Keke Palmer.'It costs to be the BOSS!' she wrote on March 22. 'That’s the very fulfilling but harsh truth. To get things done the way YOU want them, you have to invest. Not only your money but your time blood sweat and tears, without certainty that it will come back to you.''Huge thanks to Amazon Music for seeing the heart in this project and giving it a home by introducing it to the world with me exclusively. I’m so thrilled!'"
    ]
}