{
    "articleURL": "/news/article-12050819/San-Francisco-Walgreens-security-guard-shot-unarmed-trans-shoplifter-dead-breaks-silence.html",
    "content": [
        "Banko Brown, 24, was found with gun shot wounds following an altercation at a Walgreens story in San FranciscoMichael-Earl Wayne Anthony, 33, was originally booked for his death but then released without charge The DA's office in San Francisco announced they had dropped the case after Anthony acted in self defense, which caused outrage with activists The Walgreens security guard who shot an unarmed trans shoplifter dead has spoken out for the first time since the incident.",
        "Michael Earl-Wayne Anthony, 33, was working at the drugstore as a security guard when he shot unarmed Banko Brown, 24, last week. A murder charge against him was dropped after the city's DA ruled the killing was self-defense, because Anthony feared being stabbed.Speaking to The San Francisco Standard, Anthony said: '[I'm] still dealing with it, still don't understand and don't have the time to reflect.'It's not like I go through this many times. This is a very life-changing matter.'Anthony pointed to the pressure that security guards are under during these types of confrontations, saying: 'This is important for more people to be more aware of,' he said. It was happening too frequently.'It's a lot to deal with. It's a lot of pressure. A person can only take so much. When you are limited to certain options, something will happen.' 'Who has my back? Nobody. You are left with no support. It's a frightening feeling with a lot of people around you.' ",
        "Brown was found with gunshot wounds and taken to a nearby hospital where he later died following the incident.Anthony was originally booked on suspicion of murder the next day, but then released without charge after the District Attorney Brooke Jenkins said Anthony was in 'mortal danger' and 'acted in self-defense'. ",
        "The decision to drop the charges against Anthony has angered protestors and at a meeting of the San Francisco Board of Supervisors on Tuesday, activists held up signs reading 'Justice for Banko Brown'.One protestor, who identified herself as Lia McGeever, erupted into a scream over the death of Brown. She said: 'I hate a lot of people on this board for the reasons that led up to Banko Brown's death. ",
        "'There's a lot of performative people on this board who will say one thing and support black people, homeless people, trans people, and then immediately stab you in the face — being racist, transphobic, anti-homeless.'I don't have any words prepared today. I just want you to feel our pain.'So, I am going to spend the next minute screaming cause that is what is going on in here.'That is what the trans genocide in this country, in this city, has brought me to.'  Earlier this week, a group of community activists gathered outside the Walgreens in downtown San Francisco for a vigil to honor Brown's memory. ",
        "Floral tributes and candles where left in memory of Brown, with the Young Women's Freedom Center in the city organizing it. In a social media post, they said: 'Our community stands strong together in the face of tragedy. ",
        "'In times like these, we show up for each other and we fight for our folks, especially for our siblings that are taken from us way too soon. 'Thank you to every voice that has spoken, every foot that has marched, and every fist raised in solidarity.'It comes after a number of major chains announced they would be closing their stores in San Francisco due to soaring crime figures.Retailers including Nordstrom, Whole Foods, Office Depot and Anthropologie have all announced they would be closing stores in the city. Nordstrom chief stores officer Jamie Nordstrom blamed the state of San Francisco in recent years for reducing foot traffic 'and our ability to operate successfully.' Remaining stores like Target have been reduced to locking up their entire stock behind glass to deter shoplifters. "
    ]
}