{
    "articleURL": "/sport/tennis/article-12056773/Andy-Murray-wins-title-2019-rallying-beat-Americas-Tommy-Paul.html",
    "content": [
        "Andy Murray has won the Aix-en-Provence ATP Challenger final in FranceThe British star battled back from a set down to beat America's Tommy PaulMurray secured his first title since 2019 by brushing aside the event's top seedAndy Murray turns 36 next week but still his determination to maximise what he has left retains the capacity to surprise.",
        "Having looked bereft of hope for this clay court season, to the point where he was wondering whether the French Open later this month was worth the bother, he went and won his first title on the brown dirt in seven years on Sunday.Not only that, but his triumph over an unusually strong field in Aix-en-Provence represented his first trophy at the Challenger level of the tour since 2005.Murray defeated world No 17 Tommy Paul 2-6, 6-1, 6-2 in an unpredictable final which was in line with his whole season to date.Having started off the year strongly, the Scot had gone into an unforeseen tailspin which, prior to this week, had seen him lose four matches in succession.",
        "Ever prepared to try something different, he travelled from his first round reverse in Madrid to the south of France with other early losers from the Spanish event and found his endeavours well-rewarded.His victory over the 25-year-old American will now see him back up to 42 in the world, and there is the chance that he could get himself a vital seeding for Wimbledon when it comes around.He could further improve his standing by making progress either at the Italian Open this coming week or Roland Garros, which seemed a distant prospect after his recent straight-sets losses that caused much soul-searching.",
        "While only a Challenger, Aix had an unusually decent field, which was partly a consequence of Madrid being elongated to 12 days, leaving players in search of playing opportunities ahead of Rome.By ranking numbers, his match-up against Paul was one of the strongest finals in Challenger history, although the prize pot of £140,000 puts its status not far off one of the lesser events on the main ATP Tour.It became the scene of what is Murray’s first title of any kind since 2019, when he won the European Open in Antwerp, which came nine months after having a metal cap inserted into his hip.Yesterday Murray lost the first four games, struggling with both his serve and return. At the start of the second he abruptly began turning the match around with a strong improvement which drew increasing errors from his opponent.He broke at the beginning of the decider and never looked in danger from there onwards, cantering to his first title on clay since the 2016 Italian Open, where he defeated Novak Djokovic. ",
        "The Serb is expected to return to action in Rome this week, although Rafa Nadal is absent again as he tries to focus on returning for Paris.It was a busy weekend for some of his compatriots with Katie Boulter, returning to action after the Billie Jean King Cup, losing the final of the Challenger in Gifu, Japan, 7-5, 6-3 to Himeno Sakatsume.",
        "There was a brace of British winners at the Nottingham Futures. The women’s trophy went to Harriet Dart while George Loffhagen, once regarded as among the best GB prospects, continued his recent progress by taking the men’s title.Meanwhile, Carlos Alcaraz confirmed his status as early French Open favourite last night when he saw off a spirited challenge from Germany’s world No 65 Jan Lennard Struff to win the Madrid Open having battled to a 6-4, 3-6, 6-3 success."
    ]
}