{
    "articleURL": "/wires/reuters/article-12043979/Soccer-Salah-spot-kick-gives-Liverpool-1-0-win-Fulham.html",
    "content": [
        "May 3 (Reuters) -",
        "Mohamed Salah scored from the penalty spot to keep Liverpool's slim hopes of qualifying for next season's Champions League alive as they secured a 1-0 win over Fulham at Anfield in the Premier League on Wednesday.The win lifts Liverpool to 59 points, four behind fourth-placed Manchester United, who have two games in hand over the Merseysiders, while Fulham are 10th on 45 points.Fulham had the first decent chance of the game when Carlos Vinicius forced Alisson Becker into a save with a stinging shot that was turned behind for a corner in the 14th minute, but a moment of madness from Issa Diop saw them fall behind six minutes before the break.The Fulham centre back looked to be in no danger as he allowed a pass to run across his body, but Darwin Nunez made the most of his indecisiveness to poke the ball away and the defender hacked him down, with the referee immediately pointing to the spot.Salah stepped up and smashed the resulting spot kick straight down the middle to extend his streak of scoring in consecutive games at home to eight.That gave the home side some breathing space, but despite having the likes of Salah, Nunez and Luis Diaz on the pitch, Liverpool struggled to get shots on target as keeper Bernd Leno came quickly off his line to repeatedly snuff out the danger.",
        "Fulham had a superb chance to equalise when Vinicius broke through in the 77th minute but again Alisson thwarted him, using a strong right hand to deflect his close-range shot behind.The visitors had one final chance deep into stoppage time as Daniel James picked out fellow substitute Bobby Decordova-Reid, but Virgil van Dijk was on hand to pressure the striker and he fired his effort wide as Liverpool held on for a fifth straight Premier League win.\"It's always difficult to win games in the Premier League, five on the spin is very good,\" Liverpool captain Jordan Henderson said.Manager Juergen Klopp said he was impressed by his side's fighting spirit, and that the season has become about building momentum for the next campaign.\"(That is) super important... we have to try to do something we can use, something we can build on in the next season. That's exactly what we did and I'm pleased with that,\" he added. (Reporting by Philip O'Connor Editing by Toby Davis and Christian Radnedge)"
    ]
}