{
    "articleURL": "/tvshowbiz/article-12051891/Christine-Quinn-seen-black-outfit-new-H-M-X-Mugler-Collection.html",
    "content": [
        "Christine Quinn, 34, stuns in a black look as she models for the H&amp;M X Mugler Collection.",
        "The former Selling Sunset star was spotted at a photoshoot in Los Angeles on Wednesday.The statuesque blonde wore black pants and a black wrap top, featuring a cape cascading off her right shoulder.The reality television personality's top has a shiny sheen to it. She paired the sophisticated style with a pair of open-toed black high-heeled sandals.The mom of one's signature very long blonde hair was parted in the middle and styled in subtle waves. ",
        "Christine shared two images from the photoshoot to her Instagram Stories.'Coming soon,' she captured it while tagging the @muglerofficial account.The new season of Selling Sunset drops on Netflix on May 19. The sixth season is the first one that will not feature Christine as one of the real estate agents at the Oppenheim Group.And while Jason Oppenheim has commented that the Dallas native left the show at the right time, Christine might not agree. Last month, she shared a screenshot on Instagram a since deleted screenshot of another user’s story, which included a URL to the new Selling Sunset episodes.Someone in the Selling Sunset Reddit thread shared a screenshot of Christine's post, allowing anyone who wanted to watch season six before its premiere.Fans questioned her motives for sharing the URL.",
        "One person commented: ‘Doesn’t Christine have a hot, successful crypto real estate company to run? How does she still have the energy to worry about anything Selling Sunset related?’ ‘I’m just going to wait until it airs. I think she’s s****y for doing this,’ one person wrote. ",
        "Others had a different viewpoint, with one fan writing, 'Y’all really mad because she’s messy? Villains are the lifeblood of reality tv.’'Messy as hell. This is why we stan her,’ another Reddit user said.Others speculated that Christine was working with Netflix on a planned leak of the episodes. Christine has deleted the post and Netflix has not commented on the incident."
    ]
}