{
    "articleURL": "/femail/article-12053973/Coronation-fashion-Celebrity-stylist-MIRANDA-HOLDER-gives-verdict-Queen.html",
    "content": [
        "Celebrity stylist Miranda Holder says the Queen is 'glorious' in her attireCORONATION LIVE BLOG: Click here to follow live updates throughout todayQueen Camilla always looks smart and elegant at royal events, but today the pressure was on to elevate her look from her usual smart coat dresses in shades of blue and green to something showstopping. ",
        "It was no surprise that she went for a dress by Bruce Oldfield, gown, a close friend who also worked with Princess Diana and definitely a safe pair of hands for the momentous occasion. The challenge was to create a look that would allow Camilla to shine, while being appropriate for the solemnity of the occasion.  Here, celebrity stylist Miranda Holder gives her verdict on the Queen's big fashion moment.  ",
        "Camilla looked nervous but resplendent sitting beside her husband in the carriage.The first glimpse of her gown showed a white fabric embellished with silver embroidery, with her robe of state nestled over her shoulders, the gold embroidery looking glorious against the ornate gold of the State carriage.The neckline was the perfect depth to showcase the magnificent Coronation necklace which was made for Queen Victoria and has been traditionally worn at every coronation by the Queen ever since.Once Camilla enters the Abbey the excitement peaks as the world gets a close-up look at her much-anticipated gown, designed by Couturier and close friend Bruce Oldfield, who also worked closely with Diana during her time as a working Royal. The Queen looked nothing short of magnificent, the full-length gown sitting perfectly on her frame, creating a vision that was positively statuesque. ",
        "The almost full-length central pleat extends down the front of the garment adding flattering elongation and just a little bit of drama.",
        "The gown was in Camilla’s signature silhouette, a modest neckline, and an elongated waist which lengthens her torso, softly nipping her in at her middle and extending all the way to the floor with her favourite bracelet sleeves adding a flattering feminine flourish and showing off the slimmest part of her body, her wrists which makes the outfit even more flattering. I thought the Queen looked just glorious and was delighted that she remained faithful to her own personal style - it showed her off perfectly.",
        "Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head.The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen'.The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.",
        "Minutes later Camilla was crowned. As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.The monarch and his wife Queen Camilla had smiled at each other and to the congregation as they walked through the church before and after the Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry."
    ]
}