{
    "articleURL": "/wires/ap/article-12057749/Goldschmidts-3-homers-help-Cardinals-stop-8-game-skid.html",
    "content": [
        "ST. LOUIS (AP) - Paul Goldschmidt homered three times, and the St. Louis Cardinals stopped an eight-game losing streak with a 12-6 win over the Detroit Tigers on Sunday.",
        "Goldschmidt, had four hits and four RBIs in his third three-homer game, the first since March 29, 2019, against Milwaukee. He hit solo homers in the first and third innings off Alex Faedo and a two-run drive in the eighth against Tyler Holton.Brendan Donovan hit a three-run homer off Mason Englert (1-2) for an 8-6 lead in a seven-run sixth.Jake Rogers hit a grand slam in a five-run sixth for the Tigers, whose five-game winning steak was stopped. Spencer Torkelson also homered for Detroit.Drew VerHagen (2-0) pitched two perfect innings.ROCKIES 13, METS 6",
        "NEW YORK (AP) - Brenton Doyle´s first big league home run capped a seven-run fifth inning and the Mets lost for the 11th time in 14 games to fall to 17-18 - dropping under .500 for the first time since they were 3-4.Jurickson Profar and Kris Bryant had RBI hits in the third, and Bryant´s two-run homer sparked the big fifth inning against Jimmy Yacabonis (1-2), who allowed five runs while recording one out. Tovar had a two-run double and Austin Wynns delivered an RBI single before Doyle´s two-run shot.Brent Suter (1-0) allowed one run in 1 2/3 innings.RAYS 8, YANKEES 7, 10 INNINGSNEW YORK (AP) - Gerrit Cole failed to hold a six-run lead, allowing his first two home runs of the season, and Isaac Paredes´ 10th-inning single off Albert Abreu (1-1) gave Tampa Bay two wins in the three-game series.",
        "Anthony Rizzo and Harrison Bader homered for the Yankees (18-17), who led 6-0 before Tampa Bay scored twice in the fifth and five times in the sixth to take an 7-6 lead.Jose Siri and Christian Bethancourt homered as the major league-best Rays (28-7) improved to 19-3 home. Last-place New York has lost 10 of its last 16 games and trails the Rays by 10 games.Jalen Beeks (1-2) won before 32,142, the largest crowd at Tropicana Field since 2016.Cole´s ERA rose to 2.09 from 1.35, which had been tied for the major league lead.BRAVES 3, ORIOLES 2, 12 INNINGSATLANTA (AP) - Michael Harris II hit a game-ending double off Cionel Pérez (1-1) as Atlanta won two of three from Baltimore, which lost consecutive games for the first time since April 8-9.Braves right fielder Ronald Acuña Jr. brought a roar from the sellout crowd of 40,800 at Truist Park in the 11th when he caught Adam Frazier´s 322-foot flyout and made a one-hop throw to third baseman Austin Riley, who tagged Austin Hays for a double play.Michael Tonkin (3-1) pitched two perfect innings.DODGERS 5, PADRES 2, 10 INNINGSSAN DIEGO (AP) - Mookie Betts hit a game-tying homer with two outs in the ninth inning and James Outman hit a two-run shot in the 10th to lead Los Angeles over San Diego.",
        "Dodgers reliever Caleb Ferguson (2-0) earned the win and Evan Phillips earned his fifth save with a scoreless 10th inning. Brent Honeywell (2-1), who pitched the 10th inning for San Diego, took the loss.Manny Machado had three hits and an RBI for the Padres. Fernando Tatis Jr. had a double and made a spectacular sliding catch in the second inning to rob Max Muncy of a hit.PHILLIES 6, RED SOX 1PHILADELPHIA (AP) - Kyle Schwarber homered after being dropped from leadoff to fifth in the batting order, and Philadelphia stopped a six-game skid and ended Boston´s eight-game winning streak.J.T. Realmuto singled twice and drove in two runs for the defending NL champions who won for the first time since Bryce Harper´s return to the lineup on Tuesday.Taijuan Walker (3-2) allowed one run and three hits in six innings with six strikeouts.Nick Castellanos hit a go-ahead grounder off Tanner Houck (3-2).GUARDIANS 2, TWINS 0CLEVELAND (AP) - Cleveland´s Cal Quantrill had a no-hit bid broken up by Alex Kirilloff's two-out single in seventh.Quantrill (2-2) allowed one hit in seven innings, and James Karinchak and Emmanuel Clase finished with hitless relief. Clase got his 12th save.José Ramírez and Josh Bell had RBI singles in the first off Joe Ryan (5-1).",
        "ROYALS 5, ATHLETICS 1KANSAS CITY, Mo. (AP) - Salvador Perez went 3 for 4 with a 462-foot homer over the left-field fountains and Kansas City avoided being swept in the series between teams with the worst records in the major leagues. The Royals (9-26) lost two of three to the A´s (8-27).Ryan Yarbrough (1-4) pitched 5 2/3 innings and allowed one run and three hits. He left getting hit on the face by a liner that was 106.2 mph off the bat of Ryan Noda.Mason Miller (0-2) gave up two runs and five hits in six innings.BLUE JAYS 10, PIRATES 1PITTSBURGH (AP) - Whit Merrifield had four RBIs, three on his first home run this season, and Toronto finished a three-game sweep that extended the Pirates´ losing streak to seven following a 20-8 start.Merrifield put the Blue Jays ahead with a run-scoring infield single in the first following a 95-minute rain delay and opened a 4-0 lead in the third when he sent a hanging curveball from Roansy Contreras (3-3) into the left-field bleachers. TYusei Kikuchi (5-0) allowed four hits in 6 1/3 scoreless innings after giving up five runs in just 4 1/3 innings to the Boston Red Sox on May 2.CUBS 5, MARLINS 4, 14 INNINGS",
        "CHICAGO (AP) - Garrett Hampson scored on a 14th-inning balk by Adbert Alzolay (1-2), ending the longest game in the major leagues this season and stopping Miami's five-game losing streak.Steven Okert (1-0) got three outs for the win, and Andrew Nardi pitched the 14th for his first career save.Yuli Gurriel hit his third homer for Miami, which was outscored 34-12 during its losing streak.WHITE SOX 11, REDS 4CINCINNATI (AP) - Hanser Alberto had four hits with a career-high four RBIs and Chicago opened a big lead with an 11-run second, its biggest inning since an 11-run fifth at Kansas City on Sept. 17, 2007.Alberto and Gavin Sheets homered in the second. Graham Ashcraft (2-1) gave up eight runs and six hits in 1 1/3 innings. The Reds had not allowed that many runs in an inning since a 13-run fourth inning on April 13, 2003.Michael Kopech (1-3) gave up eight hits in six innings, allowing his runs on solo homers by Jonathan India, Jose Barrero, Tyler Stephenson and Wil Myers.MARINERS 3, ASTROS 1SEATTLE (AP) - Bryce Miller (1-0) gave up two hits over six shutout innings for his first major league win, Justin Topa worked around a leadoff single in the ninth for his first big league save and Seattle took two of three from the World Series champions.",
        "First baseman José Abreu made a run-scoring error in a two-run third inning and Matt Gage committed a bases-loaded balk when he relieved Brandon Bielak (0-1) in the fifth. The Astros have lost three straight series and are 17-17.Julio Rodríguez, in a 1-for-18 slide, hit a career-long, 454-foot homer for the Mariners, who have won six of seven.BREWERS 7, GIANTS 3SAN FRANCISCO (AP) - Willy Adames and William Contreras hit two-run homers, and Milwaukee ended a six-game losing streak while stopping San Francisco's four-game winning streak.Joel Payamps (1-0) struck out three in 1 2/3 innings. Ross Stripling (0-2) allowed five runs and seven hits in five innings.RANGERS 16, ANGELS 8ANAHEIM, Calif. (AP) - Leody Taveras had a career-high four hits along with four RBIs and Adolis García hit his team-leading ninth homer as Texas overcame a 3-0 deficit and won its second straight after losing the series opener. Garcia leads the major leagues with 36 RBIs.Ezequiel Duran and Josh H. Smith also went deep. Taveras drove in four runs for the Rangers, who scored 26 runs in the last two games after losing Friday´s series opener 5-4 in 10 innings.Josh Sborz (1-1) pitched two scoreless innings. José Suarez (1-2) gave up seven runs, six hits and three walks in 2 2/3 innings.NATIONALS 9, DIAMONDBACKS 8PHOENIX (AP) - Joey Meneses hit a three-run homer in the ninth inning off Miguel Castro (1-1) and had four RBIs after Washington rallied from a four-run deficit to take an 8-6 lead.Erasmo Ramírez (2-1) didn´t allow a baserunner in 1 1/3 innings and Hunter Harvey worked around a walk in ninth for his first save since 2019 at Double-A Bowie to prevent Arizona´s first sweep of the Nationals since 2009.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}