{
    "articleURL": "/wires/ap/article-12055347/As-broadcaster-suspended-apparent-racial-slur.html",
    "content": [
        "Oakland Athletics broadcaster Glen Kuiper has been suspended after uttering what sounded like a racial slur while describing a trip to the Negro Leagues Baseball Museum.",
        "NBC Sports California said in a statement Saturday that Kuiper will remain off the air until a review of what happened during Friday night's broadcast is completed.In a pregame segment on NBC Sports California before the A´s played the Kansas City Royals on Friday night, Kuiper talked about a trip to the museum with colleague Dallas Braden but seemingly mispronounced the word \"negro,\" making it sound instead like a slur.Later in the game, Kuiper apologized on the air without getting into specifics, saying he said something that \"didn´t come out quite the way I wanted it to.\"\"I could not be more sorry and horrified by what I said,\" Kuiper said Saturday in a statement released by NBC Sports California. \"I hope you will accept my sincerest apologies.\"Bob Kendrick, the president of the Negro Leagues Baseball Museum, issued a statement about Kuiper on Twitter on Saturday.\"I´m aware of the unfortunate slur made by Glen Kuiper,\" Kendrick said. \"I welcomed Glen to the NLBM yesterday and know he was genuinely excited to be here. The word is painful and has no place in our society. And while I don´t pretend to know Glen´s heart I do know that my heart is one of forgiveness. I hope all of you will find it in yourselves to do the same!\"",
        "The A´s later issued a statement Friday night, calling the language used by Kuiper \"unacceptable.\"Kuiper has been calling A´s games in the Bay Area for about 20 years. He is the younger brother of former major leaguer and Giants announcer Duane Kuiper.Radio announcers Johnny Doskow and Vince Controneo will rotate as play-by-play announcers during Kuiper's absence.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}