{
    "articleURL": "/news/article-12054783/Murder-probe-launched-teenager-stabbed-death-outside-London-Tube-station.html",
    "content": [
        "Teenagers were reportedly involved in a machete fight outside a London station An 18-year-old man died after being stabbed and another was taken to hospitalAnother 20-year-old man was arrested on suspicion of murder and is in custodyA murder probe has been launched after a teenager was stabbed to death following a machete fight in London.",
        "Emergency services were called shortly before midnight on Friday as an 18-year-old man was found with stab injuries near to Dagenham Heath station.The man, who remains unnamed, died at the scene despite the best efforts of police and the London Ambulance Service.A second man was taken to hospital with a stab injury, while another 20-year-old man was arrested on suspicion of murder and remains in police custody.Detective Chief Inspector James Shirley at the Metropolitan Police said: 'My thoughts are with the young man's family and friends. ",
        "'I want to offer my full reassurances to them, and the wider community, that despite the significant events taking place in London today, the focus of my team is bringing the person or people responsible to justice.'The detective chief inspector also added that the investigation is 'progressing at pace', and thanked everyone who had already spoken with officer. She continued: 'I would ask anyone who has not yet come forward to do so as a matter of urgency. 'I would also ask local residents to check dash cams and doorbell footage for anything out of the ordinary and share that with us as soon as possible.' A Metropolitan Police statement also read: 'Police were called at 23:47hrs on Friday, 5 May to reports of two groups fighting with machetes near to Dagenham Heath tube station.",
        "'Officers and the London Ambulance Service attended. At the scene an 18-year-old man was found with stab injuries. Despite the efforts of emergency services he sadly died at the scene.'His family have been made aware. A post-mortem will be scheduled in due course.'A second man, was also taken to hospital with a stab injury. His condition is not believed to be life threatening.'",
        " Scotland Yard also confirmed that a 'number of crime scenes' were still in place following the incident.They continued: 'A 20-year-old man was arrested on suspicion of murder and remains in police custody at this time.'MailOnline has approached the Metropolitan Police for further information."
    ]
}