{
    "articleURL": "/news/article-12052291/Thug-donned-Call-Duty-style-skull-mask-murder-18-year-old.html",
    "content": [
        "Timothy Adeoye, now 20, killed with kitchen knife into  in Enfield, north LondonDonavan Allen, 18, died as a result of the single stab wound to the chest in 2022Known as T-Trapz - Adeoye denied being person behind the distinctive skull maskA thug has been found guilty of stabbing an 18-year-old to death while wearing a \"scary\" skull mask popularised by the Call Of Duty video game. ",
        "Timothy Adeoye was 18 when he plunged a large kitchen knife into Donavan Allen at a block of flats in Enfield, north London, on February 7 last year. Mr Allen died as a result of the single stab wound to the chest, the Old Bailey was told. Adeoye, now 20 - who was known as T-Trapz - had denied being the person behind the distinctive skull mask. On Friday a jury at the Old Bailey found him guilty of murder and possession of a knife and making threats to another person with a blade. ",
        "Prosecutor Alan Gardner KC had described how the defendant had travelled from Barking in east London to Enfield on the day of the murder carrying a knife. Just after 2.30pm, the defendant appeared on CCTV footage at Barking Station wearing the 'very distinctive face mask' with a skull design on it. Mr Gardner said: 'That face mask is an important feature in this case, it is something the defendant wore during the course of the afternoon and at the time of the murder.'A police officer trawled through hundreds of hours of video from the area and Adeoye was the only person wearing that style of mask.The court heard he had spent some time walking around the Enfield area looking for the victim's friend. ",
        "A couple of teenagers described being approached by the defendant wearing a 'scary mask or balaclava' asking for information. Learning where he might find the man, Adeoye went to a flat said to be used as a 'drug house' and threatened to 'shank up' the occupants, jurors were told. When Mr Allen and his friend arrived, the defendant grabbed a second larger knife from the kitchen and went to confront them, the court was told. ",
        "Mr Gardner said he had threatened them with the knife but was interrupted by a neighbour. The defendant followed them and confronted them again and, during an exchange, Adeoye stabbed Mr Allen in the chest. Mr Gardner said: 'It was an unprovoked and motiveless attack. There is some evidence that the defendant had an issue with (the victim's friend), likely connected with drugs, but there is no evidence that he had any issue with Donavan Allen.' Mr Allen collapsed in a stairwell nearby and died soon afterwards, the court was told. His friend had handed his mobile phone to a neighbour to ring 999. He was heard in the background to name the attacker, saying: 'It's T-Trapz. I screwed someone, T-Trapz is looking for me.' As Adeoye fled the scene, he dumped the knife in a drain outside the block of flats. It was found the next day and tests linked it by DNA to the victim and defendant.",
        "Jurors were told he sent a text message to the victim's friend saying: 'Better not (rat emoji).' Adeoye left London and travelled to Bristol and Wilshire, where he was arrested three days later. Mr Gardner said the background to the case surrounded the supply of cannabis, in which the defendant, Mr Allen and his friend were alleged to be involved. But he told jurors: 'Whatever the underlying issues or grievances those involved with this case may or may not have had with each other, fundamentally this case is about a young man losing his life due to the actions of this defendant.' Following the verdicts, the defendant was remanded into custody to be sentenced at a later date. Detective Chief Inspector Linda Bradley, of Scotland Yard, said: 'Adeoye is a dangerous individual and while I am pleased with this guilty verdict, there is no court outcome that could return Donovan to his family. My thoughts are very much with them today.' "
    ]
}