{
    "articleURL": "/news/article-12043007/LA-Man-goes-viral-catching-foul-ball-game-holding-baby-beer.html",
    "content": [
        "An LA dad caught a foul ball at the Dodgers game Sunday while multitasking Steve Petit caught the ball with a beer in one hand and his baby on his chestVideo of the catch posted to Twitter has been seen 1.2 million times  A Los Angeles man with his baby strapped to his chest and a beer in one hand went viral over the weekend for catching a foul ball in his free hand at the Dodgers game. ",
        "Steve Pettit, a Glendale Fire Department engineer and father of two, caught the ball during Sunday's game at Dodgers Stadium against the St. Louis Cardinals. The LA baseball team posted the video of the spectacular catch to Twitter, which quickly blew up, receiving hundreds of thousands of views on the app. The dad spoke with FOX 11 and said the whole situation unfolded in 'slow motion' and that he was just doing his best to protect his daughter Kelsey from the ball.  'That was my best protection mechanism,' he said of deciding to go for the ball. 'Just catch the ball. Protect everything: the beer, the baby. It all panned out nicely.' ",
        "The Dodgers posted the astounding video Sunday evening, praising the doting dad for his multitasking skills. 'This dad caught a foul ball while holding his baby and a drink,' the team's post read, accompanied by shocked face emojis. Within minutes, dozens of fans chimed in sharing their awe and applauding the dad for his quick thinking and reflexes. 'Dad power at dodger stadium is insane,' one user responded. 'He's MVP!!!' another person wrote. 'This is the trifecta of baseball and what we all as fathers aspire to. It’s the pinnacle. Triple BBB Baby beer baseball' a Twitter user joked. ",
        "'Not all heroes wear capes!' another commented. Pettit - who was sporting a 'Girl Dad' hat at the time of the catch - told LA outlets that his protective instincts as a dad kicked in at that moment. He also said he was lucky in this instance that the ball came directly to him so that he didn't have to exert too much energy to catch it without spilling his drink. ",
        "Pettit's wife Misty said she also saw the situation unfolding. 'I pulled my camera out and started to record the reaction because the crowd was going wild, which was really fun to see,' Misty told NBC4. It was a good day for all Dodgers fans as the team won over the Cardinals, 6-3. As for Pettit, however, it's a game he said he is not soon to forget. 'It was fun. It was just a fun moment to share with the family for sure,' he said. "
    ]
}