{
    "articleURL": "/wires/ap/article-12055373/Police-responding-reported-shooting-Dallas-area-mall.html",
    "content": [
        "ALLEN, Texas (AP) - A gunman stepped out of a silver sedan and started shooting people at a Dallas-area outlet mall Saturday, killing eight and wounding seven others - three critically - before being killed by a police officer who happened to be nearby, authorities said.",
        "Authorities did not immediately provide details about the victims at Allen Premium Outlets, a sprawling outdoor shopping center, but witnesses reported seeing children among them. Some said they also saw what appeared to be a police officer and a mall security guard unconscious on the ground.The shooting, the latest eruption of what has been an unprecedented pace of mass killings in the U.S., sent hundreds fleeing in panic. Barely a week before, authorities say, a man fatally shot five people in Cleveland, Texas, after a neighbor asked him to stop firing his weapon while a baby slept.A 16-year-old pretzel stand employee, Maxwell Gum, described a virtual stampede of shoppers. He and others sheltered in a storage room.\"We started running. Kids were getting trampled,\" Gum said. \"My co-worker picked up a 4-year-old girl and gave her to her parents.\"Dashcam video that circulated online showed the gunman getting out of a car and shooting at people on the sidewalk. More than three dozen shots could be heard as the vehicle recording the video drove off.",
        "Allen Fire Chief Jonathan Boyd said seven people including the shooter died at the scene. Nine victims were taken to area hospitals, but two of them died.Three of the wounded were in critical condition in the evening, Boyd said, and four were stable.",
        "An Allen Police officer was in the area on an unrelated call when he heard shots at 3:36 p.m., the police department wrote on Facebook.\"The officer engaged the suspect and neutralized the threat. He then called for emergency personnel,\" it added.Mass killings are happening with staggering frequency in the United States this year: an average of about one a week, according to a database maintained by The Associated Press and USA Today in partnership with Northeastern University.The White House said President Biden had been briefed on the shooting and the administration had offered support to local officials. Republican Texas Gov. Greg Abbott, who has signed laws easing firearms restrictions following past mass shootings, called it an \"unspeakable tragedy.\"Fontayne Payton, 35, was at H&amp;M when he heard the sound of gunshots through his headphones.\"It was so loud, it sounded like it was right outside,\" Payton said.People in the store scattered before employees ushered the group into the fitting rooms and then a lockable back room, he said. When they were given the all-clear to leave, Payton saw the store had broken windows and a trail of blood to the door. Discarded sandals and bloodied clothes lay nearby.Once outside, Payton saw bodies.\"I pray it wasn´t kids, but it looked like kids,\" he said. The bodies were covered in white towels, slumped over bags on the ground.",
        "\"It broke me when I walked out to see that,\" he said.Further away, he saw the body of a heavyset man wearing all black. He assumed it was the shooter, Payton said, because unlike the other bodies it had not been covered up.Tarakram Nunna, 25, and Ramakrishna Mullapudi, 26, said they saw what appeared to be three people motionless on the ground, including one who appeared to be a police officer and one who appeared to be a mall security guard.Another shopper, Sharkie Mouli, 24, said he hid in a Banana Republic store during the shooting. As he left, he saw what appeared to be an unconscious police officer lying next to another unconscious person outside the outlet store.\"I have seen his gun lying right next to him and a guy who is like passing out right next to him,\" Mouli said.Stan and Mary Ann Greene were browsing in the Columbia sportswear store when the shooting started.\"We had just gotten in, just a couple minutes earlier, and we just heard a lot of loud popping,\" Mary Ann Greene told The Associated Press.Employees rolled down the security gate and brought everyone to the rear of the store until police arrived and escorted them out, the Greenes said.",
        "Eber Romero was at the Under Armour store when a cashier mentioned that there was a shooting.As he left the store, Romero said, the mall appeared empty, and all the shops had their security gates down. That is when he started seeing broken glass and people who had been shot on the floor.Video shared on social media showed people running through a parking lot amid the sound of gunshots.More than 30 police cruisers with lights flashing were blocking an entrance to the mall, with multiple ambulances on the scene.A live aerial broadcast from a news station showed armored trucks and other law enforcement vehicles outside the mall.Ambulances from several neighboring cities responded.The Dallas office of the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives also responded.Allen, about 25 miles (40 kilometers) north of downtown Dallas, has roughly 105,000 residents.___Associated Press writers Gene Johnson in Seattle and Adam Kealoha Causey in Dallas contributed to this report."
    ]
}