{
    "articleURL": "/wires/reuters/article-12046095/High-wire-act-U-S-Congress-gears-immigration-reform-Title-42-ends.html",
    "content": [
        "By Richard Cowan",
        "WASHINGTON, May 4 (Reuters) - A fresh push for bipartisan immigration reforms, coupled with enhanced border security, is emerging in the U.S. Congress, as thousands of migrants amass across the border in Mexico with the end of Title 42 controls next week.It has been 37 years since Congress passed significant immigration reform, but a persistently high volume of migrants and an acute labor shortage have galvanized lawmakers. At the same time, many Republicans cite the flow of illegal drugs into the United States through ports of entry as reason to harden border areas.The Republican-controlled House of Representatives plans to pass a package of border security measures next week to place tougher constraints on immigrant asylum-seekers, resume construction of a wall along the southwest border with Mexico and expand federal law enforcement.This is timed for the May 11 expiration of the Title 42 order issued under former President Donald Trump at the start of the COVID-19 pandemic. It allows U.S. authorities to expel migrants to Mexico without the chance to seek asylum.On Tuesday, the Biden administration announced it would temporarily deploy an additional 1,500 troops to the U.S.-Mexico border in anticipation of a possible rise in illegal immigration.Despite what some characterize as an \"anti-immigrant\" endeavor, several Democratic and Republican senators said they eagerly await such a bill.",
        "Republican Senator Thom Tillis said the end of Title 42 \"sets the table\" for Congress to craft new border-control laws as Republicans predict a wave of new arrivals.A House-passed bill is \"something we can build on,\" said Tillis, who is working with independent Senator Krysten Sinema of Arizona and others. \"It gives us some room to gain the support we need in the Senate\" for broader legislation.Tillis said it could take two to three months to construct a compromise. Senators had no illusions this would be an easy task.Dick Durbin, the No. 2 Senate Democrat, said the House bill would provide clues on Republicans' intent. He added that in conversations with fellow senators, \"One of the first things they say is 'well if the House starts the conversation I think we can get somewhere.' We'll see.\"Since the 1986 enactment of immigration reforms resulting in some 3 million immigrants winning legal status, Congress repeatedly has failed to update the nation's policies.Around 11 million unauthorized immigrants in the United States could have a stake in the outcome of this latest effort, along with U.S. businesses hungry for workers.To succeed, all 48 Senate Democrats and three independents likely must vote for an immigration deal -- while keeping in mind 2024 re-election prospects -- plus win backing from at least nine Republicans and the support of the Republican-controlled House.",
        "\"A high-wire act,\" is how Republican Senator John Cornyn from border state Texas portrayed it, adding it was \"the only path forward.\"STARS ALIGNINGThe U.S. Chamber of Commerce, the nation's largest business association, has launched a campaign urging Congress to act. It was endorsed by 400 groups, ranging from the American Farm Bureau Federation to the U.S. Travel Association.Several other external pressures beyond Title 42 could boost prospects for a 2023 initiative.Among those issues weighing on lawmakers include the epidemic of deaths from fentanyl, which mainly is transported through U.S. ports. Republicans argue that is where the border security component comes in.Meanwhile, Republican-controlled states see their farming, ranching, food processing and manufacturing businesses begging for workers, a void that immigrants could fill if not for Washington's clunky visa system.Finally, passage of an immigration bill coupled with beefed-up border security could boost President Joe Biden's re-election campaign and give Republican candidates something to cheer too.FIVE BUCKETSThe House bill would deal with some of the five \"buckets\" in the Tillis-Sinema effort, according to a Senate source familiar with their work.Overall, they include a modernization of the plodding asylum system, improvements to how visas are granted and measures to more effectively authorize immigrants, be they laborers and healthcare workers or doctors and engineers, to fill American jobs.",
        "Republican Senator James Lankford characterized the asylum bucket as the linchpin. \"We won't get everything, but we have got to have that part,\" he said. Democratic Senator Chris Coons, placed emphasis on immigrant workforce needs.There is also the fate of 580,000 \"Dreamers\" enrolled in the Deferred Action for Childhood Arrivals (DACA) program. They are the unauthorized minors brought into the United States through no fault of their own.Republicans have blocked their path to citizenship for two decades, arguing that would encourage more to take the dangerous journey to the border.Senators acknowledge some of their goals might have to be abandoned to achieve a \"sweet spot.\" But which ones?Democratic Senator Chris Murphy, who won passage last year of the first major gun control bill in about three decades, did so in part by recognizing that a too ambitious bill is a recipe for failure.Murphy was asked how the difficulty of winning immigration legislation stacks up to other recent battles, such as gun control, gay marriage and infrastructure investments.\"It's an 11 on a scale of 10.\" (Reporting by Richard Cowan; additional reporting by Ted Hesson; Editing by Mary Milliken and Diane Craft)"
    ]
}