{
    "articleURL": "/wires/reuters/article-12049713/Austrias-RBI-triples-profit-Russia-quarter.html",
    "content": [
        "ECB has pressed bank to unwind Russia business",
        "RBI says still pursuing sale or spin-offFigures disclosed in better-than-expected earnings(Updates with CEO comment on Russian exit, share price)By Alexandra Schwarz-Goerlich and Tom SimsVIENNA, May 5 (Reuters) - Austria's Raiffeisen Bank International, one of the banks in Europe most exposed to Russia, said on Friday that its profit in the country more than tripled in the first quarter, partly due to higher interest income.The European Central Bank has pressed RBI to unwind its highly profitable Russian business, people have told Reuters, and the Austrian bank says it has been working on a solution.\"The group will continue to progress potential transactions which would result in the sale or spin-off of Raiffeisenbank Russia,\" RBI said as it released better-than-expected earnings.Johann Strobl, the bank's chief executive, told analysts that he was working \"at full steam\" on both options and could not say which alternative would be favoured.In Russia, profit after tax was 301 million euros ($332 million), up from 96 million euros a year earlier.The higher interest income came despite a 24% fall in loan volumes, RBI said. A stronger rouble also helped lift earnings.Overall, the Russia business generated more than 40% of RBI's in the quarter. Last year, it generated more than half.",
        "RBI has been studying strategic options for the business since Russia's invasion of Ukraine last year but has warned that its effort may take some time.Shares in RBI were 2.2% higher during mid-afternoon trading.The Austrian bank has operated in Russia since the collapse of the Soviet Union and is Russia's 10th-largest bank by assets.Even though its business there has contributed significantly to the group's profit, because of sanctions what it earns in Russia stays with its subsidiary there.The number of Raiffeisen staff in Russia rose in the quarter by 2.3% to 9,890, while customers dropped 13% to 3.2 million. ($1 = 0.9056 euros)(Reporting by Alexandra Schwarz-Goerlich and Tom Sims, Editing by Friederike Heine and Alexander Smith)"
    ]
}