{
    "articleURL": "/wires/aap/article-12049297/Griffin-meet-Lomax-week-selection-call.html",
    "content": [
        "St George Illawarra coach Anthony Griffin will meet with Zac Lomax after Magic Round to explain why he was dropped, believing the strike centre needed time to process the decision first.",
        "Lomax was a shock axing from the Dragons to team face Wests Tigers on Sunday, and will not play reserve grade this weekend after being given the chance to clear his mind.A mainstay at the club since 2019, Lomax was furious with not being picked on Tuesday with St George Illawarra coming off four straight losses.The issue of player feedback has been a common thread at the Dragons in recent years, with multiple players known to have had issues.But Griffin said he fully intended to meet with Lomax next week, and he first wanted the 23-year-old to clear his mind with a weekend away from football.\"That's true. (There's been) no detailed feedback for that reason,\" Griffin said.\"My job as a coach is to care for him, particularly at times like this. For any player who gets dropped, it's hard. I do that with the utmost care on a case-by-case basis.\"I wanted Zac to have a bit of time to process it, and then we will sit down as coach and player and go through it.\"Griffin is, however, adamant that Lomax is a long-term first-grader at the Dragons.Shifted from the right centre to left centre in March, the former NSW State of Origin hopeful has struggled for form this season.",
        "Griffin has not set a timeline on Lomax's return, and whether he will return to the field via reserve grade.\"That is something we will decide what that looks like after we sit down and have a chat,\" Griffin said.\"It comes back to performances, and hopefully for his sake it's not too long.\"Griffin did not believe Lomax's confidence had been knocked by his goal-kicking, which has been the difference in all four of the Dragons tight losses in the past month.Since switching to a lower tee Lomax has kicked at 60.53 per cent this year.Jack Bird will take the tee to start on Sunday, with Jayden Sullivan some chance of claiming it once he comes off the bench after kicking well in reserve grade.The Dragons coach also said Moses Mbye's experience and defence kept him in the side at hooker ahead of Jacob Liddle.Ben Hunt will move to move to dummy-half during the match when Sullivan joins Talatau Amone in the halves."
    ]
}