{
    "articleURL": "/sport/football/article-12042807/Sam-Allardyce-declares-good-Guardiola-Klopp-Arteta-Leeds-unveiling.html",
    "content": [
        "Sam Allardyce's appointment as Leeds manager was confirmed on WednesdayAllardyce rejected the suggestion his methods are 'old and antiquated'The Leeds boss insists he has the same knowledge as the game's elite coaches Sam Allardyce made his return to management after two years away yesterday – and boasted: I am as good as Pep Guardiola and Jurgen Klopp.",
        "The 68-year-old has been tasked with keeping Leeds United in the Premier League after replacing Javi Gracia as the club’s boss for the final four games of the season.Allardyce admits he is taking on the ‘biggest challenge’ of his career and that avoiding relegation would be the greatest of his great escapes given how little time he has to turn things around.But Big Sam said: ‘Far too many people think I am old and antiquated, which is so far from the truth.‘I might be 68 and look old but there's nobody ahead of me in football terms. Not Pep, not Klopp, not Arteta. It's all there with me.",
        "‘They do what they do, I do what I do. But in terms of knowledge and depth of knowledge, I'm up there with them. I'm not saying I'm better than them, but certainly as good as they are.’Guardiola said after City’s win over West Ham last night: ‘He is right. Look at Neil Warnock at Huddersfield, these incredible managers. ‘It looks like the young managers know the tactics and whatever, but they are really good. They help us be who we are. We created football? No. It was already created.’ Allardyce, who will be assisted by ex-Oxford boss Karl Robinson and former Leeds striker Robbie Keane, also hinted he would be keen to stay at Leeds after this season if he kept them up.",
        "‘Never say never,’ he replied when asked if he would want the job long term. ‘It depends what happens at the end of the four matches, what the conversation is all about and how I feel – and more importantly how the wife feels.’",
        "Allardyce's long-time No 2 Sammy Lee will be unable to join him due to being on jury service.The new Leeds boss critcised the judge's decision not to allow Lee to join him at Elland Road.'The judge has left Sammy unemployed. I find that very poor,' Allardyce said. 'The wee man loves being with me.'Allardyce added that Robinson had agreed to join him at the relegation threatened club within 30 minutes of being offered a role, before joking that ex-Tottenham man Keane 'won't stop talking'.",
        "'Trying to shut him [Keane] up in the first place is difficult, he won't stop talking,' Allardyce said.'I've worked with him at Soccer Aid and I really like his personality.'He will come in and give everyone a lift, he's Leeds through and through.'Allardyce took charge of his first training session on Wednesday, as he seeks to preserve their Premier League status. Leeds are languishing in 17th and only goal difference keeping them out of the relegation zone.Allardyce has just three days to prepare his side for a daunting trip to the Etihad to face title chasing Manchester City.",
        "A tough run-in includes hosting a Newcastle United team appearing bound for the Champions League, before matches against West Ham and Tottenham."
    ]
}