{
    "articleURL": "/wires/aap/article-12057051/Robinson-Manu-going-OK-Roosters-spine-issue.html",
    "content": [
        "Sydney Roosters coach Trent Robinson says Joey Manu can become better at five-eighth but insists he knows how to play the position \"inside out\".",
        "Manu had some bright moments in Sunday's 20-6 loss to North Queensland but Roosters captain and fullback James Tedesco admitted the players in the spine positions failed to fire as a collective.Robinson made the call to drop halfback Sam Walker and move Manu from centre to the halves to partner Luke Keary. He has now played three times at No.6 with the Roosters first loss coming at Suncorp Stadium against the Cowboys.\"He has been OK,\" Robinson said.\"I feel like he is defending well. I feel like he has had some good running performances but we can get better there.\"Despite not training in the halves with Keary in the pre-season, Robinson said the Roosters' issues were not about personnel.\"Our system doesn't change, whether it is Luke and Sam (in the halves) or Luke and Joey,\" Robinson said.\"They know our system. It has to adapt to individual players slightly so we can improve that but it still the one we have been running for a while so Joey knows it inside out as well.\"I made a decision about a guy (Walker) I believe in and I am pretty clear about what I want him to improve on and do.\"The issues I feel like we are having, we have been having for most of the year. It is probably less about personnel and more about how we are training them and how we need to run them, and their influence on that.\"",
        "Manu produced two neat grubbers into the in-goal area against the Cowboys but the Roosters' end of sets were not up to scratch.\"Last plays become very important in the wet and we conceded two (tries) and built no pressure at the other end,\" Robinson said.\"That was certainly one of the areas that was quite poor.\"Tedesco said despite the change to the spine, there were no excuses for not firing.\"When you look at our spine it is really strong but it is on us to run our plays well and execute our plays well,\" he said.\"It is round 10 and we have to look at ourselves in the mirror and work hard at training. We can't wait another three or four weeks or it will be too late.\"Robinson said he \"definitely\" felt like his team was taking one step forward and two steps back this season as they oscillate between good wins and poor losses.He said success in the NRL demanded the right mindset each week.\"And we are not there yet,\" he said.\"It is a mindset and that comes from us, all of us, every single week ... walking into a game with the right mindset to go after a game. We weren't there today.\""
    ]
}