{
    "articleURL": "/femail/article-12056261/Stepping-royal-shoes.html",
    "content": [
        "George embarked on his most significant royal duties yet at King's coronation He was one of four Pages of Honour who were tasked with aiding new monarchRead more: Prince George carries King Charles' robes at Westminster AbbeyBeing second-in-line to the British throne comes with countless responsibilities - and the King's Coronation saw Prince George take on his most significant role yet.",
        "George was one of four Pages of Honour for his grandfather, a ceremonial position which required the young boys to attend to King Charles, largely by carrying his heavy robes.It was a long day, but nine-year-old George remained professional throughout, appearing by the King's side for the religious ceremony, the Royal Salute and on the Buckingham Palace balcony.There were even a few poignant moments where Charles was seen whispering to his grandson, who will one day attend the coronation of his father Prince William - and his own.His brother Prince Louis, five, and sister Princess Charlotte, eight, were not so involved in the momentous royal occasion, sitting with their mother and father in the pews inside Westminster Abbey.",
        "Meanwhile, George was stood close to the King as he was crowned - joined by his fellow Pages of Honour: Nicholas Barclay and Lord Oliver Cholmondeley, both 13, and Ralph Tollemache, 12.Page of Honour is a ceremonial position within the Royal Household that only requires attendance on State occasions, like Saturday, when the four boys were tasked with carrying the King's robes.Another four boys - the Queen's grandsons and great-nephew - attended to Camilla. The King's pages looked the part in a traditional style of dress that was first seen at the Coronation of King Edward VII in 1902: scarlet tunics decorated with gold lace trim and blue velvet cuffs.",
        "These specific outfits were designed by Ede and Ravenscroft during the reign of the late Queen.",
        "Prince George began his duties at Westminster Abbey early on Saturday, when he was seen deep in conversation with his grandfather in the moments before they entered the church.He and his fellow Pages of Honour then carried the King's robes through the Abbey, and stayed close by his side to be on hand for whenever Charles needed to move his position.George was the picture of professionalism throughout the coronation ceremony, which kept him on his feet for over two hours. But his duties did not end when the King departed Westminster Abbey.",
        "For the rest of Saturday, wherever King Charles went, his grandson was close behind.He, Nicholas, Oliver and Ralph were on hand as the King received a Royal Salute from the British Army, and later helped Charles navigate the Buckingham Palace balcony.It was a rather relentless day, with one of the young boys telling Sky News they would likely 'all collapse' once their official duties finally came to an end.But Prince George made clear that, at just nine years old, he is more than capable of stepping up into a significant role - and making the Royal Family proud.",
        "His mother, Kate Middleton, Princess of Wales, revealed that her eldest son was looking forward to partaking in the ceremony in the run up to the Coronation.Kate said Prince George was 'excited' about the event and had been taking part in rehearsals as a Page of Honour at the Westminster Abbey service.Asked if he was looking forward to it, she replied:  'He is actually. Having done a few rehearsals, I think everyone is a bit more relaxed.'  Although nine-year-old Prince George has had previous roles within notable royal events, this is by far the biggest responsibility he's been given yet.",
        "Last year, George was part of Queen Elizabeth's funeral procession with his younger sister Princess Charlotte. All eyes were on George and Charlotte, who had recently become the second and third in line for the throne.The siblings were the youngest mourners to attend the funeral of Her Majesty, and followed the coffin ahead of Harry and Meghan, Duke and Duchess of Sussex.George was also visible at the Platinum Jubilee last June, where he rode in a carriage alongside his younger siblings, Charlotte and Louis.The Cambridge trio were pictured waving at onlookers as they continue to be eased into their royal roles.George was also a pageboy at Harry and Meghan's wedding in 2018, when he walked behind bride-to-be Meghan as she made her way down the aisle to marry his uncle.",
        "He stood outside the steps of St George's Chapel while Charlotte - who was a bridesmaid - waved at onlookers.Since this event, it is clear his confidence has grown, as it was reported that George, who was four at the time, hid behind his father's legs when they stood outside.This is a stark contrast to the Prince George we saw yesterday - full of pride, confidence and likely on his way to becoming a great King."
    ]
}