{
    "articleURL": "/wires/reuters/article-12037995/EUs-von-der-Leyen-hails-Infineon-factory-chip-production-milestone-Europe.html",
    "content": [
        "DRESDEN, Germany May 2 (Reuters) - European Commission President Ursula von der Leyen on Tuesday hailed the construction of a new factory by Germany's Infineon a milestone in mass chip production as Europe tries to capture a larger slice of the strategic industry.",
        "Speaking at the groundbreaking ceremony of Infineon's factory in the German city of Dresden, von der Leyen said it was a step in Europe's goal of doubling its share of global chip production to 20% by 2030 by quadrupling its current capacity.But she warned that Europe was still too dependent for raw materials on individual suppliers, citing in particular that China has a 76% share of producing the silicon metals needed in chip production.The European Union wants to catch up with Asia and the United States and reduce its reliance on Asia at a time of heightened tensions between Taipei and Beijing.The bloc last month agreed a 43-billion-euro ($47 billion) chip subsidies plan in a bid to secure supplies of critical components after COVID-19 lockdowns caused shortages that hurt output of everything from phones to cars and refrigerators.\"We are all experiencing how drastically geopolitical risks have grown. This is why it is vital that we in Europe strengthen the supply chains of our most important goods and technologies,\" von der Leyen said in a speech.\"This also means broadening our position when it comes to chips and having more of our own capacity available. For semiconductors, which are so vital, we need more mass production here in Europe.\"",
        "Infineon expects production at the 5-billion-euro semiconductor plant, the largest investment in the company's history, to start in 2026.Other chip manufacturers are also currently investing in Germany. The U.S. group Wolfspeed is building a plant in Saarland, investing 2.75 billion euros. Intel is building a large factory in Magdeburg. ($1 = 0.9127 euros) (Reporting by Christina Amann and Matthias Williams; Editing by Susan Fenton)"
    ]
}