{
    "articleURL": "/wires/reuters/article-12040195/Andrew-Benintendi-White-Sox-edge-Twins-10th.html",
    "content": [
        "Andrew Benintendi delivered a game-ending single with two outs in the 10th inning to lift Chicago to a 3-2 victory against the visiting Minnesota Twins on Tuesday, the White Sox's second straight walk-off win.",
        "The White Sox's Elvis Andrus sacrificed automatic runner Hanser Alberto to third base to start the inning before Tim Anderson grounded out to shortstop. That set the stage for Benintendi, who won the battle against Caleb Thielbar (0-1).Chicago has won back-to-back games for the first time this season on the heels of a 10-game losing streak.Jimmy Lambert (2-1) earned the victory, striking out two in a perfect 10th inning. White Sox pitching limited Minnesota to three hits.Trevor Larnach gave Minnesota a 1-0 lead with a sixth-inning sacrifice fly. The White Sox responded one inning later, as Eloy Jimenez connected against reliever Jorge Lopez for a go-ahead, two-run homer to left-center.The lead was short-lived, though, as Nick Gordon led off the eighth with a pinch-hit solo homer against Chicago's Alex Colome. It was the season debut for Colome, who spent 2019-20 with the White Sox and the following season with the Twins before pitching for the Colorado Rockies last year.White Sox starter Michael Kopech overcame spotty control to pitch six innings of one-run, one-hit ball. The right-hander, who walked five and struck out seven, held the Twins hitless until Byron Buxton grounded a single past a diving Anderson at shortstop with one out in the sixth.Benintendi robbed Carlos Correa of a solo home run to end the first inning, leaping over the left field wall after Kopech had fanned the first two hitters of the game.",
        "Aiming for his sixth win in as many starts to open the season, Twins righty Joe Ryan took a no-decision after yielding one hit and two walks in six scoreless innings. He struck out seven.Ryan retired 11 consecutive White Sox after a two-out walk to Yasmani Grandal in the second. The free pass followed the only hit Ryan allowed, a Gavin Sheets single.Anderson, who returned from the injured list to take his familiar leadoff spot for Chicago, snapped the streak by working a 12-pitch walk with one out in the sixth. Anderson had been sidelined since spraining his left knee during an April 10 win at Minnesota.--Field Level Media"
    ]
}