{
    "articleURL": "/wires/reuters/article-12056821/Giro-d-Italia-Summaries--Stage-2.html",
    "content": [
        "May 7 (Gracenote) - Results from Stage 2, Giro d Italia on Sunday. Stage 2 Teramo to San Salvo, 202 km. Men's elite road race. Average speed: 41.059 km/h. Wind direction: E. Wind speed: 2km/h. Route profile: flat. Finish profile: flat. Stage winners 1. Jonathan Milan (ITA) Bahrain Victorious 4:55:11 2. David Dekker (NED) Team Arkéa - Samsic \" 3. Kaden Groves (AUS) Alpecin - Deceuninck \" 4. Arne Marit (BEL) Intermarché - Circus - \" Wanty 5. Marius Mayrhofer (GER) Team DSM \" 6. Pascal Ackermann (GER) UAE Team Emirates \" 7. Fernando Gaviria (COL) Movistar Team \" 8. Niccolò Bonifazio (ITA) Intermarché - Circus - \" Wanty 9. Jake Stewart (GBR) Groupama - FDJ \" 10. Michael Matthews (AUS) Team Jayco - AlUla \" 11. Simone Consonni (ITA) Cofidis \" 12. Filippo Fiorelli (ITA) Green Project - Bardiani - \" CSF - Faizanè 13. Andrea Vendrame (ITA) AG2R - Citroën Team \" 14. Ryan Gibbons (RSA) UAE Team Emirates \" 15. Clément Russo (FRA) Team Arkéa - Samsic \" 16. Campbell Stewart (NZL) Team Jayco - AlUla \" 17. Martin Marcellusi (ITA) Green Project - Bardiani - \" CSF - Faizanè 18. Davide Gabburo (ITA) Green Project - Bardiani - \" CSF - Faizanè 19. Filippo Ganna (ITA) INEOS Grenadiers \" 20. Damiano Caruso (ITA) Bahrain Victorious \" Overall leaders 1. Remco Evenepoel (BEL) Soudal - Quick-Step 5:16:29 2. Filippo Ganna (ITA) INEOS Grenadiers +22 3. João Almeida (POR) UAE Team Emirates +29 4. Stefan Küng (SUI) Groupama - FDJ +43 5. Primoz Roglic (SLO) Jumbo - Visma \" 6. Geraint Thomas (GBR) INEOS Grenadiers +55 7. Aleksandr Vlasov () BORA - hansgrohe \" 8. Tao Geoghegan Hart (GBR) INEOS Grenadiers +59 9. Brandon McNulty (USA) UAE Team Emirates +1:00 10. Jay Vine (AUS) UAE Team Emirates +1:05 11. Michael Matthews (AUS) Team Jayco - AlUla +1:09 12. Bruno Armirail (FRA) Groupama - FDJ +1:16 13. Jonathan Milan (ITA) Bahrain Victorious +1:17 14. Mads Pedersen (DEN) Trek - Segafredo +1:21 15. Michael Hepburn (AUS) Team Jayco - AlUla \" 16. Mattia Cattaneo (ITA) Soudal - Quick-Step +1:23 17. Lennard Kämna (GER) BORA - hansgrohe \" 18. Nico Denz (GER) BORA - hansgrohe \" 19. Edoardo Affini (ITA) Jumbo - Visma +1:26 20. Damiano Caruso (ITA) Bahrain Victorious +1:28 King of the Mountains 1. Paul Lapeira (FRA) AG2R - Citroën Team 6 2. Thomas Champion (FRA) Cofidis 4 3. Tao Geoghegan Hart (GBR) INEOS Grenadiers 3 4. João Almeida (POR) UAE Team Emirates 2 5. Mattia Bais (ITA) EOLO - Kometa Cycling Team \" 6. Marius Mayrhofer (GER) Team DSM 1 Points leaders 1. Jonathan Milan (ITA) Bahrain Victorious 50 2. David Dekker (NED) Team Arkéa - Samsic 35 3. Kaden Groves (AUS) Alpecin - Deceuninck 25 4. Arne Marit (BEL) Intermarché - Circus - 18 Wanty 5. Remco Evenepoel (BEL) Soudal - Quick-Step 15 6. Marius Mayrhofer (GER) Team DSM 14 7. Fernando Gaviria (COL) Movistar Team \" 8. Stefano Gandin (ITA) Corratec - Selle Italia 12 9. Filippo Ganna (ITA) INEOS Grenadiers \" 10. Pascal Ackermann (GER) UAE Team Emirates \" 11. João Almeida (POR) UAE Team Emirates 9 12. Michael Matthews (AUS) Team Jayco - AlUla \" 13. Mattia Bais (ITA) EOLO - Kometa Cycling Team 8 14. Niccolò Bonifazio (ITA) Intermarché - Circus - \" Wanty 15. Tao Geoghegan Hart (GBR) INEOS Grenadiers 7 16. Jake Stewart (GBR) Groupama - FDJ \" 17. Stefan Küng (SUI) Groupama - FDJ 6 18. Paul Lapeira (FRA) AG2R - Citroën Team \" 19. Primoz Roglic (SLO) Jumbo - Visma 5 20. Simone Consonni (ITA) Cofidis \" Sprint classification 1. Stefano Gandin (ITA) Corratec - Selle Italia 20 2. Mattia Bais (ITA) EOLO - Kometa Cycling Team 12 3. Paul Lapeira (FRA) AG2R - Citroën Team 5 4. Thomas Champion (FRA) Cofidis \" 5. Carlos Verona (ESP) Movistar Team 1 6. Fernando Gaviria (COL) Movistar Team \" Team classification 1. UAE Team Emirates (UAE) 15:51:30 2. INEOS Grenadiers (GBR) +13 3. Soudal - Quick-Step (BEL) +32 4. Groupama - FDJ (FRA) +1:32 5. BORA - hansgrohe (GER) +1:38 6. Team Jayco - AlUla (AUS) +1:40 7. Jumbo - Visma (NED) +2:02 8. Bahrain Victorious (BRN) +2:28 9. Trek - Segafredo (USA) +2:40 10. EF Education - EasyPost (USA) +2:56 11. Team DSM (NED) +3:25 12. Team Arkéa - Samsic (FRA) +3:38 13. Israel - Premier Tech (ISR) +4:01 14. Movistar Team (ESP) +4:09 15. Intermarché - Circus - Wanty (BEL) +4:11 16. EOLO - Kometa Cycling Team (ITA) +4:48 17. AG2R - Citroën Team (FRA) +4:52 18. Alpecin - Deceuninck (BEL) +5:04 19. Astana - Qazaqstan Team (KAZ) +5:27 20. Cofidis (FRA) +6:24 21. Green Project - Bardiani - CSF - Faizanè (ITA) +7:01 22. Corratec - Selle Italia (ITA) +8:15 Youth classification 1. Remco Evenepoel (BEL) Soudal - Quick-Step 5:16:29 2. João Almeida (POR) UAE Team Emirates +29 3. Brandon McNulty (USA) UAE Team Emirates +1:00 4. Jonathan Milan (ITA) Bahrain Victorious +1:17 5. Ilan Van Wilder (BEL) Soudal - Quick-Step +1:31 6. Andreas Leknessund (NOR) Team DSM +1:37 7. Stefano Oldani (ITA) Alpecin - Deceuninck +1:56 8. Michel Heßmann (GER) Jumbo - Visma \" 9. Thymen Arensman (NED) INEOS Grenadiers +2:02 10. Ben Healy (IRL) EF Education - EasyPost +2:04 11. Marco Frigo (ITA) Israel - Premier Tech +2:12 12. Marius Mayrhofer (GER) Team DSM +2:16 13. Campbell Stewart (NZL) Team Jayco - AlUla +2:20 14. Santiago Buitrago (COL) Bahrain Victorious +2:21 15. Filippo Zana (ITA) Team Jayco - AlUla +2:22 16. Giovanni Aleotti (ITA) BORA - hansgrohe +2:32 17. Jefferson Alexander Cepeda EF Education - EasyPost +2:33 (ECU) 18. Alessandro Verre (ITA) Team Arkéa - Samsic +2:36 19. Erik Fetter (HUN) EOLO - Kometa Cycling Team +2:41 20. Arne Marit (BEL) Intermarché - Circus - +2:50 Wanty"
    ]
}