{
    "articleURL": "/wires/ap/article-12052611/Business-Highlights-Resilient-US-jobs-market-Wall-St-rally.html",
    "content": [
        "___",
        "April hiring gains reflect a still-resilient US job marketWASHINGTON (AP) - America´s employers added a healthy 253,000 jobs in April, evidence of a labor market that still shows surprising resilience despite rising interest rates, chronically high inflation and a banking crisis that could weaken the economy. The unemployment rate dipped to 3.4%, matching a 54-year low. The jobless rate fell in part, though, because 43,000 people left the labor force, the first drop since November, and were no longer counted as unemployed. While hiring was solid in April, it was much weaker in February and March than the government had previously estimated. Job gains for those months was downgraded by a combined 149,000.__Stock market today: Apple-juiced rally closes bruising weekNEW YORK (AP) - Apple was at the head of a widespread rally on Wall Street after the stock market´s most influential company reported a better profit than expected. Stocks of beaten-down banks also leapt Friday to recover a smidgen of their sharp losses from a brutal week. The S&amp;P 500 rose 1.8%. The Dow Jones Industrial Average rose nearly 550 points and the Nasdaq composite tacked on 2.2%. Treasury yields jumped in the bond market after a report showed hiring accelerated across the economy by much more than expected last month. The government´s jobs report also showed workers won bigger pay raises than expected.",
        "___Yeezy shoes still stuck in limbo after Adidas split with YeFRANKFURT, Germany (AP) - Adidas still hasn´t figured out what to do with $1.3 billion worth of high-end Yeezy sneakers after splitting with the rapper formerly known as Kanye West. The shoes have been sitting in warehouses for nearly seven months since the German sportswear company ended ties with Ye over his antisemitic and other offensive remarks. CEO Bjorn Gulden said Friday that Adidas is \"getting closer and closer to making a decision.\" He´s declined to say if destroying the shoes had been ruled out, but the company is \"trying to avoid that.\" Adidas reported that the breakup cost it $441 million in lost sales at the start of the year.___Faster IRS offering better picture on looming debt `X-date´WASHINGTON (AP) - That big infusion of cash that Congress approved last year to shape up the beleaguered IRS is having an unexpected side benefit. The funding increase has helped the agency to catch up on processing new and backlogged tax returns. And that, in turn, has allowed federal bean-counters to give policymakers a more precise picture of when the Treasury could run out of money - the so-called X-date. The nation is stepping uncomfortably close to an unprecedented default that could have catastrophic effects on the global economy because it is bumping up against its legal limit for borrowing. Congress and the White House have been unable to agree on a plan to lift or suspend the borrowing limit.",
        "___Germany to ease solar rules as new installations surgeBERLIN (AP) - Germany´s energy minister has announced plans to ease bureaucratic hurdles for solar power as the country set a new record for photovoltaic installations during the first quarter. Europe´s biggest economy added 2.7 gigawatts of solar power capacity during the first three months of 2023. That puts Germany on course to beat the target of 9 GW this year compared with 7 GW in 2022. Energy Minister Robert Habeck said Friday that he hoped Germany would for the first time install new PV capacity in the double-digits this year. It´s an important milestone in the country´s effort to become carbon neutral by 2045.___Could AI pen `Casablanca´? Screenwriters take aim at ChatGPTNEW YORK (AP) - Not six months since the release of ChatGPT, generative artificial intelligence is already prompting widespread unease throughout Hollywood. Concern over chatbots writing or rewriting scripts is one of the leading reasons TV and film screenwriters took to picket lines earlier this week. Though the Writers Guild of America is striking for better pay in an industry where streaming has upended many of the old rules, AI looms as rising anxiety. Experts say the struggle screenwriters are now facing with AI is just the beginning. The World Economic Forum this week released a study predicting that nearly a quarter of all jobs will be disrupted by AI over the next five years.",
        "___FDA weighing 1st over-the-counter birth control pillWASHINGTON (AP) - U.S. health regulators are weighing the first-ever request to make a birth control pill available without a prescription. On Friday, the Food and Drug Administration posted its initial review of a decades-old pill that could become the first drug of its kind to move over the counter. But the agency flagged concerns about the application from drugmaker Perrigo, including problems with the reliability of some of the company´s data and signs women had trouble understanding the labeling instructions. An FDA advisory panel will vote next week on whether it should be approved for over-the-counter use. The meeting is one of the last steps before an FDA decision.___TurboTax customers to receive checks for $141M settlementWASHINGTON (AP) - In a settlement agreement last year, TurboTax´s owner Intuit Inc. was ordered to pay $141 million to low-income consumers who were deceived into paying TurboTax to file their federal returns - despite being eligible for free, federally-supported tax services. Checks to the 4.4 million Americans eligible for for restitution payments will be mailed out starting next week, New York Attorney General Letitia James said Thursday. The amount paid to each eligible consumer ranges from $29 to $85, depending on how many tax years they qualify for.",
        "___Ford recalls some vehicles for air bag inflator installationDETROIT (AP) - Ford Motor Co. is recalling certain 2004 to 2006 Ranger vehicles because replacement front passenger air bag inflators may have been installed incorrectly. The National Highway Traffic Safety Administration said in a letter that the recall includes 231,942 vehicles. The vehicles had received replacement front passenger air bag inflators under a previous recall. The NHTSA said that an incorrectly installed inflator may not properly inflate the passenger air bag, increasing the risk of injury during a crash.___The S&amp;P 500 gained 75.03 points, or 1.8%, to 4,136.25. The Dow Jones Industrial Average rose 546.64 points, or 1.7%, to 33,674.38. The Nasdaq composite added 269.01 points, or 2.2% to 12,235.41. The Russell 2000 index of smaller companies finished up 41.07 points, or 2.4%, to 1,759.88."
    ]
}