{
    "articleURL": "/news/article-12059629/AR-15s-simple-use-cost-little-500-rip-flesh-bone-ease.html",
    "content": [
        "Shorter than an average baseball bat, lighter than a bowling ball, the AR-15 rifle is America’s favorite semi-automatic rifle: 16 million US citizens, who own 22 million between them, can’t be wrong.",
        "It’s affordable. It’s simple to shoot – it’s gentle recoil makes it easy to aim. When customized with high-capacity magazines, its firepower can rival even military arms.Which is what also makes it an absolute killing machine – and, possibly for that very reason, is a dismally regular theme in an epidemic of mass shootings.It’s the AR-15’s high-velocity bullets that make this rifle so horrifyingly deadly. For a victim shot with an AR-15 is quite literally eviscerated by the blast.Perhaps few can more bitterly attest to the utter devastation than the doctors whose emergency rooms are flooded by victims when AR-15s are put to evil use.‘It looks like a body part got blown up,’ said Dr. Lillian Liao, a pediatric trauma surgeon, who treated the casualties of the massacre at Robb Elementary School in Uvalde, Texas on May 24, 2022.In all, 21 innocent people were killed that day – two teachers and 19 children.The county coroner attempted to identify the tiny bodies himself to spare their grieving parents from the horror. But he couldn’t.",
        "The victims’ DNA had to be matched with that of their heartbroken families.In the year since the slaughter in Uvalde, AR-15s have been used in all three of America’s deadliest mass shootings.",
        "Now DailyMail.com investigates the weapon’s almost magnetic attraction, in a bid to explore the familiar dilemma: how to the balance a proud nation’s historic right to bear arms with the instinctive human desire to limit the horror of mass shootings?AR-15’S RESUME OF HORRORIn early May, grisly videos of dead men, women and children piled in heaps outside of a suburban Texas mall shocked a nation that’s grown accustomed to tragedy.In all, eight people were killed and seven more wounded when 33-year-old Mauricio Garcia, armed with an AR-15 and handgun, stepped out of his car at Texas’ Allen Premium Outlets shopping center and immediately opened fire.In April, Connor Sturgeon purchased an AR-15 from a local dealer before his rampage at a Louisville, Kentucky bank that left five of his co-workers dead.Trans-identifying shooter Audrey Hale was armed with an AR-15 and an arsenal of other firearms, when she murdered three nine-year-olds and three adults at a Christian School in Nashville, Tennessee in March.What about these weapons have made them nearly synonymous with mass murder?According to an analysis by The Washington Post, prior to the bloody start of 2023, ten of the 17 deadliest U.S. mass shootings since 2012 involved AR-15s.The killer who rained bullets down on a country music concert on the Las Vegas strip in 2017 used the gun, as did the Sandy Hook Elementary School shooter in Newtown, Connecticut in 2012.",
        "And, of course, the Robb Elementary School gunman, 18-year-old Salvador Ramos was armed with an AR-15.Those three horrific events alone left more than 100 dead. However, to many, that’s still not reason enough to ban a type of firearm that is owned by one in 20 Americans.THE ‘BARBIE FOR MEN’ THAT LEAVES A GAPING EXIT WOUNDDefenders of the AR-15 prize them for their maneuverability and firepower, and bristle at the thought of federal laws limiting their gun rights.After all, variety is one of the AR-15s biggest selling points. In fact, the weapon has been dubbed the ‘barbie for men.’It can be modified to fit nearly any user’s preferences. Websites offer a seemingly endless menu of muzzles, magazines, barrels, and triggers, available in multiple sizes, colors, and specifications.It’s a diversity that firearm aficionados say make the AR-15 so appealing to gun owners participating in marksmanship competitions or interested in home defense.But what makes the weapons particularly good for hunting feral pigs in the American South, or personal protection, also make them effective for storming a shopping mall, bank or a school and killing large numbers of innocent people.The National Shooting Sports Foundation (NSSF), a firearm industry trade group, calls an AR-15 a sporting rifle.",
        "The group stresses that it's a semi-automatic weapon that only fires one round with each pull of the trigger, as opposed to a fully-automatic that continuously chambers and fires rounds.An experienced gunman armed with a typical AR-15 can fire 45 to 100 bullets per minute. Customized with a large capacity ammunition magazine, the AR-15 can reel off 100 bullets or more before its necessary to pause and reload.In the Las Vegas massacre, 64-year-old gunman Stephen Paddock modified his AR-15 with a ‘bump stock’ that made it fire at the rate of a machine gun.",
        "A ‘bump stock’ exploits the rifle’s natural recoil to make the firearm slide back and forth and ‘bump’ against the shooter’s finger, depressing the trigger at a nearly constant pace.Paddock fired at least 90 rounds in just 10 seconds.Following the Vegas slaughter, the Trump administration banned ‘bump stocks,’ but the federal regulation was overturned by a court. The Biden Administration is now appealing.Perhaps the most troubling aspect of the weapon is the lethality of its bullets.The AR-15 takes a relatively small caliber round that contains a comparatively large amount of propellant. When fired these projectiles travel at three times the speed of those shot from handguns. And when the bullets strike, they create a shock wave that shreds body tissue and shatters bones.",
        "Just as devastating, the round leaves a gaping exit wound that causes torrential bleeding.A pistol round could make a two-inch hole in a human liver; one fired from an AR-15 would pulverize the organ entirely.Such an injury is nearly always fatal unless treated immediately, pediatric trauma surgeon Dr. Liao told ABC’s Nightline: ‘A child or an adult can bleed to death in as little as five minutes… a high-velocity firearm will create a giant hole in the body that is with missing tissue.’Critics argue civilians have no need for such terrible weapons that, really, were first designed for the battlefield.A BATTLEFIELD-STYLE WEAPON IN AMERICAN HOMESThe original AR-15 was developed by U.S. firm Armalite in the 1950s. The initials A.R. stand for Armalite Rifle. The number 15 signifies the model number.Iconic firearms manufacturer Colt bought the patent in 1959 and started producing the gun for military and civilian use. In the early 1960’s that the AR-15 became a favorite of the Pentagon during the Vietnam War.",
        "It was later developed into the military’s fully-automatic M16 rifle. And even though the weapons were dogged by complaints that they jammed during firefights they have stood the test of time and are still used by U.S. soldiers today.Colt still holds the trademark for producing AR-15s, but when the patent expired in 1977, competitors, like Remington, Smith &amp; Wesson and Ruger, started making their own versions, sold at various price points.",
        "Pew Pew Tactical, a gun website, ranks the Daniel Defense DDM4 V7 as the best 'high end' AR-15. It sells for $1,730.An 'entry-level' weapon is the Palmetto State Armory Complete AR-15s, which sells for $499.Millions have been sold. But decades ago, customers weren’t interested. Civilians preferred handguns and traditional long rifles, eschewing combat-style weapons.‘We’d have NRA members walk by our booth and give us the finger,’ Randy Luth, the president and founder of gunmaker DPMS, one of the earliest companies to sell AR-15s, told the Washington Post.It wasn’t until the early 2000’s - following a post-9/11 uptick in firearms interest - that AR-15 sales really took off.THE $1 BILLION BUSINESS OF AR-15sThe firearms industry had been struggling with stagnant sales for several years when the federal assault weapons ban expired in 2004.The legislation, signed into law by President Bill Clinton in 1994, prohibited the manufacturing of certain types of semi-automatic firearms, including AR-15s.So, when Congress and President George W Bush’s administration declined to renew the ban there was an opportunity for gunmakers.In 1994, AR-15s made up just 2.2% of all guns manufactured in America. By 2019, that number rose to 25% of all firearms produced, according to data from the NSSF and the Bureau of Alcohol, Tobacco, Firearms, and Explosives.",
        "DPMS president Randy Luth suggested that the military’s use of the weapon during the 2001 invasion of Afghanistan and their marketing efforts made the guns more attractive to consumers.‘We made it look cool,’ Luth told the Washington Post. ‘The same reason you buy a Corvette.’All of that added up to big business.A 2022 House Oversight Committee investigation determined that five major American gunmakers: Daniel Defense, Bushmaster, Sig Sauer, Smith &amp; Wesson Brands, Inc., and Sturm, Ruger &amp; Co., took in a combined total of $1 billion in revenue over 10 years from the sale of AR-15s.Daniel Defense, the maker of the DDM4 rifle, which was used in the Uvalde slaughter, made more than $120 million in AR-15-style rifle sales in 2021, up from $40 million in 2019.Smith &amp; Wesson, saw sales jump over the same period from $108 million to $253 million, while Sturm, Ruger &amp; Co. saw earnings nearly triple from $39 million to more than $103 million.Overall, the gun industry rakes in about $9 billion each year, according to Everytown for Gun Safety, a gun-control advocacy group. AR-15 sales are just a slice of that – but it’s growing.WILL AR-15s BE BANNED?The distinctive outline of AR-15s has become, quite literally, a badge of honor for some pro-Second Amendment lawmakers.Andrew Clyde, a Georgia Congressman and gun store owner, memorably handed out pins in the shape of AR-15s to fellow Republican lawmakers, who’ve worn them on their lapels on the floor of the U.S. House.Following the massacre in Nashville, Tennessee GOP Rep. Andy Ogles was criticized for posing for a 2021 Christmas card with his family in front of their holiday tree while brandishing assault rifles.",
        "To these lawmakers and many of their constituents, efforts to ban or restrict the sale of a certain type of firearms represents an unacceptable infringement on their rights.'The radical Left's ultimate goal is to disarm our nation,' Rep. Clyde posted on social media in April. But that’s not the opinion of a majority of Americans.A Fox News Poll in April indicated that 61 per cent of American voters support banning assault rifles and semi-automatic weapons.Indeed, reflecting growing public sentiment in blue states, Washington joined California, New York, Illinois and six other states last month in banning sales of AR-15s.Not so in red states. In Texas this month, Republican politicians blocked a bill to raise the minimum age for purchasing semi-automatic firearms from 18 to 21.After the mall attack in Allen earlier this month, though, President Biden has again urged members of Congress to tighten gun control measures and bring back the long-expired federal assault weapons ban.However, whether a federal assault weapons ban would actually help stop the scourge of mass shootings is not settled. A 2023, Rand Corporation study determined that there is no conclusive evidence that the 1994 bill actually reduced mass causality events.For all these reasons, the popularity of the AR-15, its significance as a political symbol, and its value to the firearms industry, it seems unlikely that America has seen the last of this killing machine.Sickeningly, it will only be a matter of time before this devastating weapon turns up at the scene of another terrible tragedy."
    ]
}