{
    "articleURL": "/wires/ap/article-12043685/Westwood-Garcia-Poulter-resign-European-tour.html",
    "content": [
        "Lee Westwood, Ian Poulter and Sergio Garcia were among four players with Saudi-backed LIV Golf who resigned from the European tour instead of facing fines of 100,000 pounds ($125,000) for playing LIV events without permission.",
        "The tour said 50-year-old Richard Bland also resigned.They were among those who played the inaugural LIV Golf event outside London last June and violated the conflicting tournament regulation policy.The tour in a statement thanked the four players for their contributions - particularly Westwood, Garcia and Poulter for their roles in Europe's dominance of the Ryder Cup.\"Their resignations, however, along with the sanctions imposed upon them, are a consequence of their own choices,\" the tour said.The decision stems from last month's ruling by Sport Resolutions that a number of players committed serious breaches of the European tour's code of behavior by playing in LIV Golf events last year.",
        "The ruling allowed the tour to impose fines of 100,000 pounds. Instead of paying the fine, the four players chose to resign.That likely is the end of Garcia's record run through the Ryder Cup, which dates to 1999 when he was 19. The Spaniard holds the Ryder Cup record for most matches won (25) and most points contributed (28 1/2) in nine appearances.Poulter is best known for his \"Postman\" performance at Medinah in 2012 when he made five straight birdies in a fourballs match with Rory McIlroy, the spark that carried Europe to the greatest comeback by a visiting team.",
        "Westwood spent three decades on the European tour and remained devoted in the wake of so many stars joining the PGA Tour. He has 25 wins on what now is commercially called the DP World Tour, won the points title three times and reached No. 1 in the world toward the end of 2010. His 11 appearances in the Ryder Cup are the most by a European.Westwood told The Daily Telegraph it was \"a sad day.\"\"I could not really see any other option with all the punishments hanging over me,\" Westwood said, adding that he doesn't agree with the direction European tour CEO Keith Pelley and the tour board \"and I want to move on.\"Bland has one European tour victory.Other European players, such as Graeme McDowell, Martin Kaymer and Bernd Wiesberger, would need to pay the fine if they want to stay on tour.McDowell has only played the BMW PGA Championship at Wentworth since joining LIV, and Wiesberger played the Middle East swing while the European tour sanctions remained under appeal.\"As we have consistently maintained throughout the past year, the Tour has a responsibility to its entire membership to administer the member regulations which each player signs up to,\" the tour's statement said. \"These regulations are in place to protect the collective interests of all DP World Tour members.\"",
        "The tour said an update on other sanctioned players would be provided Thursday. The tour is at the Italian Open this week at Marco Simone, the course that will host the Ryder Cup later this year.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}