{
    "articleURL": "/sport/football/article-12042805/Chelsea-complete-17th-signing-season-star-Matos-joins-Norwich-City-FREE-transfer.html",
    "content": [
        "Chelsea have finalised a deal to sign Norwich City youngster Alex MatosThe 18-year-old will arrive on a free transfer, with add-ons set to be paid alsoChelsea have completed their 17th signing of the season as youngster Alex Matos joins from Norwich City.",
        "As revealed by Fabrizio Romano, the 18-year-old has completed his move to Chelsea, with the final documents and contracts being signed in the last 24 hours. Matos will arrive from Norwich City on a free transfer, with add-ons to be paid as part of the 'Jim Fraser project', with Chelsea pushing to build a top U21 side. It was previously reported that the Blues were in 'advanced talks' for the youngster, with a deal now signed. The move sees Chelsea bring in their 17th player under Todd Boehly and Clearlake Capital's ownership as they head into their third transfer window since taking over. ",
        "Despite the transfer, the Blues remain without a manager in place for next season, with Frank Lampard holding the position of head coach on an interim basis.Mauricio Pochettino has been the most heavily linked with the hotseat at Stamford Bridge but it remains to be seen whether a final agreement can be reached.Julian Nagelsmann and Luis Enrique were previously linked but neither are understood to be under consideration anymore, while Burnley boss Vincent Kompany was also thought to be of interest. Whoever is chosen to lead Chelsea into next season will no doubt have to offload several of the first team players, especially as more signings come through the door.",
        "Matos will be one for the future, having been held in high regard at Norwich City, and the 18-year-old will be hoping to play himself into the plans at Chelsea one day.An official announcement awaits for the right-winger, who will likely join up with his teammates in the Blues' development squad next season. "
    ]
}