{
    "articleURL": "/wires/afp/article-12049657/Thai-parties-financial-bidding-war-election-heats-up.html",
    "content": [
        "In the searing hot sun, Preeya Phunatung toils long hours on a rural Thai construction site to support her family of four.",
        "It is a struggle for Preeya to buy even staples such as rice, fish sauce and cooking oil because her $9-a-day income is not keeping pace with inflation.Thailand goes to the polls on May 14 with major parties promising to ease poverty as low-income households struggle for survival in the face of soaring prices and deep-seated inequality.But analysts warn that the populist policies being bandied about will do little to address structural problems that have left Thai economic growth lagging behind its Southeast Asian neighbours.\"I live from hand to mouth,\" Preeya told AFP at her small house in the eastern province of Sa Kaeo, where the number of people living below the poverty line jumped by almost 25 percent between 2020 and 2021, according to official data.\"Life after the pandemic is very hard.\"Thailand has nearly 30 billionaires, according to Forbes magazine, but it also has one of the highest rates of income inequality in East Asia and the Pacific.In the wake of the 2014 military coup that brought current Prime Minister Prayut Chan-O-Cha to power, momentum in reducing poverty that had built up since the 1990s was lost.The Covid-19 pandemic deepened the stagnation and the kingdom has struggled to bounce back.Thailand is the only country in Southeast Asia apart from coup-hit Myanmar where GDP has not yet recovered to pre-pandemic levels, according to the World Bank.",
        "- 'Suffered enough' -",
        "As the election campaign enters the home straight, parties across the political spectrum are locked in a bidding war to attract the country's millions of low-income voters -- pledging higher wages, pension increases and debt relief.The main opposition Pheu Thai party has promised a $300 handout to every Thai over 16 to stimulate the economy.Srettha Thavisin, a wealthy former real estate mogul and one of Pheu Thai's candidates for prime minister, insists the $16 billion policy can be paid for without tax increases.Pheu Thai, linked to the ultra-rich Shinawatra family whose patriarch Thaksin won two elections on a raft of populist economic pledges, is leading in the polls.The party also wants to boost the minimum daily wage from $10 to $17 by 2027, while Move Forward -- the second-biggest opposition party -- has pledged to increase it to $13 a day immediately, with further hikes each year based on inflation.The embattled incumbent Prayut has warned voters not to fall for populist promises -- though his party has pledged to treble the value of social welfare cards he introduced in 2017.\"We have suffered enough from the negative consequences of election campaigns full of promises,\" the ex-army chief said on a campaign stop in Bangkok.",
        "But many point the finger at Prayut for the economic malaise.Thanathorn Juangroongruangkit, an auto parts tycoon and figurehead of the Move Forward party, said the military-backed government had not done enough to help small businesses thrive.Thailand's economy has long been dominated by well-connected family conglomerates that leverage political connections to boost their businesses.\"We need to eradicate monopolies. We need a more open market society,\" Thanathorn said at a recent rally in Bangkok emphasising the importance of market competition.- Jobs not handouts -",
        "Inequality has been a recurring theme in Thai politics since Thaksin burst onto the scene in the wake of the Asian financial crisis over two decades ago, said Pasuk Phongpaichit, an economics professor at Bangkok's Chulalongkorn University.But now, more than untargeted handouts, the economy requires spending on those who need it and better education to increase earning potential, said Kiatipong Ariyapruchya, World Bank senior country economist for Thailand.\"There are a lot of structural obstacles in the country that, if they were removed, could help people get better jobs and increase their pay,\" he said.\"Education is important to get the right skills but also to make the services sector more competitive.\"And after years of flashy promises, sustainable economic development is appealing to some voters.",
        "Srima Sripibal, 52, earns $13 a day as a security guard in a posh Bangkok neighbourhood.Struggling to pay for his grandchildren's education and borrowing money to get by each month, he wants long-term solutions.\"If they give us money, we spend it and it's gone,\" he said. \"A good job is more sustainable.\""
    ]
}