{
    "articleURL": "/wires/reuters/article-12039355/Wells-Fargo-CEO-says-regional-banks-strong-expects-turmoil.html",
    "content": [
        "By Carolina Mandl and Svea Herbst-Bayliss",
        "BEVERLY HILLS, California, May 2 (Reuters) - Wells Fargo &amp;amp; Co CEO Charlie Scharf said on Tuesday the banking industry is \"extremely strong\" but added he expects more volatility as market participants assess the health of financial institutions.\"Talking about regional banks as one - it just makes absolutely no sense,\" Scharf said at the Milken Institute Global Conference. \"Unfortunately, there will be a lot of volatility and turmoil,\" he said, adding that \"the majority of the banks that we look at are still extremely strong.\"He did not expect more bank failures comparable to the recent collapses of Silicon Valley Bank, Signature Bank and First Republic Bank. Despite the turmoil, consumers and businesses remain in good financial health, Scharf said.Peter Orszag, CEO of financial advisory at Lazard Ltd , called on officials to signal their intentions to guarantee uninsured deposits at banks for a six-month period, echoing actions during the 2008 financial crisis.Such moves would shore up confidence and stop depositors from pulling out money from small and mid-sized banks, said Orszag, who previously served as director of the office of management and budget in the Obama administration.Lazard advised First Republic Bank before it was seized by regulators and sold to JPMorgan on Monday.Protections for bank depositors under the Federal Deposit Insurance Corp should be raised to $25 million from a current $250,000 per person, per bank, former Treasury Secretary Steven Mnuchin said.",
        "Increasing the backstop for bank accounts used for business purposes was a promising potential reform, the FDIC said on Monday.\"I'm all for raising the level of FDIC insurance premium, but I would not go too far,\" Scharf said. \"This insurance that exists, it's not the government insurance, it's the rest of the banking industry coming together and there's no reason why the banks should subsidize the ills that happened at all of the banks across the system unconditionally.\" (Reporting by Carolina Mandl and Svea Herbst-Bayliss in Beverly Hills, California, Writing by Tatiana Bautzer Editing by Chris Reese and Matthew Lewis)"
    ]
}