{
    "articleURL": "/wires/aap/article-12049439/Goals-menu-Darling-Dusty-MCG.html",
    "content": [
        "West Coast spearhead Jack Darling and Richmond star Dustin Martin will be aiming to break out of their goalkicking funks when the two struggling sides lock horns in Saturday's AFL clash at the MCG.",
        "The injury-ravaged Eagles (1-6) copped a 108-point hiding from Carlton last week and are in danger of collecting just the second wooden spoon in the club's proud history.Injuries to stars such as Nic Naitanui, Luke Shuey, Elliot Yeo, Jamie Cripps, Jeremy McGovern and Liam Ryan have extremely hampered West Coast's cause.But the poor form of spearhead Darling has also raised alarm bells.Darling has booted just four goals over the past four games - all of which came when the matches were already dead and buried.The 30-year-old sprayed some early chances in his goalless display against the Blues last week, but Eagles coach Adam Simpson is backing the premiership forward to regain his usual accuracy soon.\"I think where he's frustrated is when he has opportunities, he hasn't taken them,\" Simpson said of Darling, who has booted 9.11 for the season.\"He's normally a pretty good set shot. Sometimes you need that (early goal) to get going early in a game.\"He's working on that. He's one of our best kicks in the team.\"He's an elder in the side, and we need him playing at his best.\"Martin has been solid rather than spectacular at the Tigers this season.But with Richmond posting just a win and a draw across their opening seven games, the Tigers are in desperate need of a dominant display from the three-time North Smith medallist.",
        "Martin's return of 4.4 in front of goal is well down on his usual numbers, especially considering he's spending more time in attack this year.Shai Bolton (7.5) is also markedly down on expectations following his 43-goal campaign last year, but coach Damien Hardwick said it was up to the rest of the team to ensure the forwards were getting better looks.\"Do we wish he (Martin) kicked some more goals up forward? Absolutely,\" Hardwick said.\"But are we helping him? Probably not.\"So I think what you will find is Dustin's a real barometer for us.\"If we're moving the ball and playing the way we want to play, lo and behold guys like Dustin and Shai will become better players because we're giving them an opportunity to play the way we want to play.\"I'm sure those players will respond when we get that right.\"West Coast have been boosted by the return of Dom Sheed (fractured larynx).Richmond welcome back Dion Prestia and Jack Graham, but veteran Trent Cotchin has been rested and ruckman Ivan Soldo (foot) was withdrawn from the team on Friday, replaced by Noah Cumberland."
    ]
}