{
    "articleURL": "/news/article-12056761/Oprah-tells-graduates-alma-mater-Tennessee-State-not-finished-product.html",
    "content": [
        "Oprah Winfrey spoke at her alma mater Tennessee State University on Saturday during graduationWinfrey, 69, discreetly mentioned the Nashville mass shooting and applauded lawmakers Justin Jones and Justin Pearson for protesting for stricter gun lawsThe talk show host also touched on the start of her broadcasting career  Oprah Winfrey delighted graduates at her alma mater Tennessee State University on Saturday, telling them the US is not a 'finished product' as she applauded the expelled state lawmakers for protesting gun laws. ",
        "Winfrey, 69, told the class of 2023 they are living in a difficult time in many ways while discreetly highlighting the recent Covenant School shooting in Nashville that left six dead in March.The former talk show host applauded the actions following the massacre from representatives Justin Jones and Justin Pearson, who were expelled by the Republican majority last month after they breached decorum by protesting for stricter gun laws from the House floor.'Unfortunately, you are going to encounter people who insist that it's not actually possible to make any difference,' she said. But she held up the examples of the two democrat state representatives who used 'their lives to prove the cynics wrong.'The United States is 'not a finished product,' she said. 'Anything is possible. The wheels are still in spin. Saints walk among us. And as Nelson Mandela so brilliantly demonstrated, it's better to be hopeful than fearful, if for no other reason than that hope brings us one step closer to joy.' Jones and Pearson were reinstated on a interim basis by their local city councils within days and now face a special election to regain their seats.",
        "Aside from praising the lawmakers, Winfrey started her inspirational speech by telling the story of how she fell one credit short of graduating as she launched the media career that would make her a household name.",
        "Giving the commencement address at the historically Black university, Winfrey recalled she was living with her father in East Nashville while attending college, helping out in his store, and presenting the weekend news at a Black radio station.That's where the lead anchor of the local CBS television affiliate heard her voice. He called her at school to ask if she wanted a job.'I said, \"No sir. TV? Not really, sir, because my father says I have to finish school, and school is just too important,´\" Winfrey recalled.She then went back to class and related the conversation to her scene design professor who 'looked at me as if I didn't have the brains that God gave lettuce,' Winfrey said.Winfrey spoke to her father, and she took the job. Beginning the second semester of her sophomore year, Winfrey arranged to finish her classes by 2.00pm, so she could work at the television station from 2.30 to 10.30 and be home by her father's 11.00pm curfew.By the end of her senior year in 1975, Winfrey's career was in full swing. So she wasn't terribly distressed to learn that she was one credit short and would not be able to graduate.But her father would not let go of the topic, asking her for years, 'When you going to get that degree?´",
        "Finally, in 1988, she was allowed to write a paper and submit some of her shows for the final credit.'So I got my degree from Tennessee State, right around the time I got my third Emmy,' Winfrey said.Her success in life has come from God's grace and from listening to what she called the 'still, small voice' inside while filtering out the noise of the world. That way 'you begin to know your own heart and figure out what matters most,' Winfrey said. 'Every right move I've made has come from listening deeply and following that still, small voice.'Winfrey was most famously known for her hit talk show, 'The Oprah Winfrey Show,' that first aired in 1986.After nearly three decades, the show came to an end in 2011. But Winfrey's ambition for television continued for several years, including in March 2021 when she sat down with Meghan and Harry for a bombshell interview in which the couple aired a series of very damaging allegations about the royal family."
    ]
}