{
    "articleURL": "/wires/aap/article-12053333/Hunt-affirms-commitment-Dragons-open-hooker-role.html",
    "content": [
        "Ben Hunt is remaining committed to St George Illawarra amid ongoing debate about the future of long-term friend Anthony Griffin and is willing to remain at hooker if the switch plays the Dragons into form.",
        "Hunt became a fully-fledged NRL starter under Griffin at Brisbane nine seasons ago and has been the coach's biggest advocate across a turbulent three seasons with the Dragons, whose board is actively looking at alternative coaching options for 2024.Scrutiny on Griffin has intensified after four consecutive losses, the latest at home to understrength Canterbury, and will reach critical mass if the Dragons fall to the last-placed Wests Tigers at Magic Round.In his contract talks late last season, Hunt's management pushed for a clause that would grant the halfback a release if Griffin were sacked, but the request was knocked back and Hunt nevertheless re-signed through 2025.Through the media, Hunt's management denied claims he was being shopped around as Griffin's coaching situation grew more tenuous this week and, ahead of Magic Round, the 33-year-old reiterated his commitment to the joint venture.\"Nothing's changed,\" Hunt said.\"(Hook's coaching situation) was definitely part of the (contract) discussion and I knew going in what it was going to be like. I'm committed to the Dragons.\"We're here, we're trying to get our season back on track. We've made a few changes and I don't see why we can't turn it around.\"Griffin confirmed this week Hunt would spend time at hooker against the Tigers as part of a personnel shake-up designed to revitalise the Dragons.",
        "Hunt, who plays hooker for Queensland at State of Origin level, will make the switch when Jayden Sullivan comes off the bench to partner Talatau Amone in the halves.Amone and Sullivan have jostled for the five-eighth spot this season but the change will give both promising local juniors the chance to spark the Dragons.Hunt came within a sliver of winning the Dally M Medal at halfback last season and admitted he would prefer to play 80 minutes there than switch to hooker.\"(Griffin) knows I don't like playing there. He could've been a bit nervous about putting it to me,\" Hunt said.\"I've always wanted to play halfback but I'm happy to do what's best for the team.\"If it comes at the price of winning games, I'm pretty happy to play anything. We all play the game because we want to win.\"If Sullivan and Amone show chemistry and steer the Dragons to a win, Hunt conceded the move could become a long-term one.\"If it does work I'll be stuck there,\" he said.\"If we get out and get a good game in against the Tigers, and hopefully get a win, it's probably going to be somewhere I'll be for a while.\"We haven't really looked too far ahead.",
        "\"If we're winning and that's our best brand of footy is me at nine, then I'll do it.\""
    ]
}