{
    "articleURL": "/sport/football/article-12050639/How-Manchester-United-Erik-ten-Hag-improve-dire-away-form.html",
    "content": [
        "Manchester United have struggled against top side away from home this seasonIt's an urgent issue Erik ten Hag must address if they're to compete next yearHis players seem to fold whenever they take a blow playing away from home The good news for Manchester United is that their remaining five Premier League games this season are either at home or away to lower-ranked opponents in the shape of West Ham or Bournemouth.",
        "Erik ten Hag's side have lost just once at Old Trafford in the league all season - and that was back on the opening day to Brighton. They'll be putting turrets on the Stretford End as it becomes a fortress again.But on their travels, United have been far from impressive. Although they have the fifth-best away record in this season's Premier League, six of their seven wins have come against opponents in the bottom half.When they encounter anybody half-decent on their own patch, United tend to capitulate. They have taken just one point from 24 away to the current top nine this season.The one top-half opponent they have beaten - 10th-placed Fulham - only came courtesy of a last-minute winner.",
        "On Thursday night, Brighton, thanks to a 99th-minute Alexis Mac Allister penalty following Luke Shaw's handball, became the latest to get the better of them.Liverpool have since taken advantage of this with their 1-0 win over Brentford moving them just one point behind the Red Devils in the race for the top-four - though United do have two games in hand starting with West Ham.Some of United's defeats have been more scarring than others. Their 7-0 beating at the hands of Liverpool will be spoken about on Merseyside for generations to come, while shipping six goals at Manchester City was also humiliating.",
        "The 4-0 loss at Brentford back in August led to significant changes to Ten Hag's selection, while United have also gone down 3-1 to Aston Villa, 3-2 at Arsenal and 2-0 at Newcastle.The solitary point they have taken against the top nine, in the 2-2 draw at Tottenham, also felt like a defeat because they chucked away a two-goal lead.'It's absolutely true,' said Ten Hag when asked about his team's poor away record. 'But it is to do with personality and character and this is where we need to step up and face this.'It's widely acknowledged that Ten Hag's first season has brought about many improvements but this remains a blind spot that will preclude United from challenging for top honours if not addressed.So what has been going wrong in these games and how can Ten Hag fix it next season?",
        " Result at homeWon 2-1Won 3-1Drew 0-0 Won 2-1 Lost 1-2 Won 2-0 Won 1-0 Won 1-0 OpponentManchester City Arsenal Newcastle UnitedLiverpool Brighton &amp; Hove AlbionTottenham Hotspur Aston Villa Brentford Result awayLost 3-6Lost 2-3Lost 0-2Lost 0-7 Lost 0-1 Drew 2-2 Lost 1-3 Lost 0-4 ",
        "Lingering inferiority complexAll football fans will claim this applies to their team but you can often tell whether United have turned up in a particular game pretty early on.",
        "Early mistakes in possession or defensive wobbles, especially under pressure, will usually tell you what kind of performance you're going to get.In too many big matches away from home, Ten Hag's simply don't have the necessary belief they can win and their spirit drains away after the first setback.As Gary Neville observed after the Newcastle defeat: 'When you really have to turn up and show that spirit, that fight, that courage to play, and have the quality to play, there is more evidence that they are not good enough in these type of matches.'They just do not turn up.'For the players that Ten Hag inherited last summer, it could be a hangover from the preceding years of decline and an absence of confidence United can go toe-to-toe with superior teams like City and Liverpool.",
        "Sunday West Ham (A)May 13 Wolves (H)May 20 Bournemouth (A)May 25 Chelsea (H)May 28 Fulham (H)June 3 Manchester City (Wembley) FA Cup final",
        "That reached its nadir under Ole Gunnar Solskjaer and then interim Ralf Rangnick last season, when United lurched from one disaster to the next.There remains some kind of psychological wrinkle, an inferiority complex or fear factor that needs to be stamped out by Ten Hag if United are to compete for the title.",
        "Last summer's arrivals shouldn't be affected as much and Ten Hag brought in proven winners like Casemiro, as well as Lisandro Martinez and Antony, who won titles with him at Ajax.But there remains a kind of unspoken resignation when United rock up at Anfield or the Etihad that damage limitation is the best they can hope for. It's been the same for several years now.Ten Hag can point to United's home record - they have beaten City, Liverpool, Arsenal and Spurs this season - to convince those doubters in his squad they no longer have anything to fear in these big games.Panic when things go wrongUnited have found themselves very much in contention in some games but heads have dropped and shoulders have slumped after suffering the first blow.The 7-0 loss at Anfield was a prime example. They'd been very much in contention and carved out some decent chances in the first 43 minutes.But undone by one brilliant Andy Robertson through ball and Cody Gakpo's finish just before half-time, admittedly a bad time to concede, they then let in further goals in the 47th and 50th minutes.Instead of resetting minds at half-time, United emerged in chaotic fashion defensively and were quickly out of contention.",
        "At such times, on-pitch leaders like Bruno Fernandes need to step up but instead he moaned and sulked, something he was rightly pilloried for.In the 4-0 loss at Brentford, they conceded 10 minutes in when David de Gea fumbled Josh Dasilva's shot. With 80 minutes to respond, it shouldn't have been an issue.Instead, De Gea made another mistake with a poor pass out and by the 35th minute United were 4-0 down and embarrassed.At Villa in November, they were two goals down inside 11 minutes. Again, it was a long time to come back and United halved the deficit just before the break.Conceding again just four minutes into the second-half killed them off, however.Sometimes they need an on-pitch reset to prevent the panic setting in. They often have the time to respond and the ability to do so. It needs the senior players to take the sting out of the situation and lead the fightback.",
        "Wasted chancesUnited's yearning need for a top class No 9 such as Harry Kane was once again evident at Brighton.They had 16 shots but only five were on target - Antony fired wastefully wide in the second minute, Anthony Martial fired straight at the keeper Jason Steele, who also denied Marcus Rashford.",
        "Rashford has enjoyed a superb season but it's so glaringly obvious United need to sign Kane or someone prolific like him this summer it almost doesn't bear repeating.They have scored 21 times on their travels this season but their xG hovers around the 23 mark. They have created some 167 chances, but score just 12 per cent of them.Another top quality finisher who can assure them of 25 goals will be transformative to United next season. Pepper some of those goals in big games and it could be the difference between taking one point instead of none or three instead of one.",
        "There should be no shortage of service. Fernandes may be petulant sometimes but he's been outstanding creatively this season, Christian Eriksen and Casemiro can pick passes, while Antony and Jadon Sancho will hopefully only improve their service from wide areas.There are concerns Ten Hag might have only £100million to spend this summer so United remain within Financial Fair Play boundaries.That means player sales to raise cash but a new centre forward must be in place by August. If it's Kane, that may well mean blowing the whole budget given Daniel Levy won't let him leave Spurs cheaply.But it's a more pressing need than another midfielder or centre-half if United want to genuinely compete next season.Eliminating the silly errorsShaw's handball at the Amex was just the latest in a string of individual lapses in judgement or concentration that have hindered United on their travels.The fact he didn't even contest the handball verdict was an acknowledgement of guilt with Shaw knowing full well you can't raise your arms in that manner in the box.Errors can be very difficult for a manager to legislate for - you can't control an awkward bounce, miscontrolled touch or costly deflection - but United can still help themselves.",
        "De Gea still doesn't look entirely comfortable playing out from the back and in some games he has simply gone long to avoid trouble. This is a wise strategy.Misplaced passes by defenders and midfielders have often been punished by opponents, as you'd expect when they're of high calibre.Sometimes these are unforced and can be eliminated just by taking the simple option or making the obvious pass, rather than trying something elaborate.As United's players become more and more accustomed to Ten Hag's demands, they should be able to exert a greater control over all games.Another season of a similar line-up - and Ten Hag is often loathe to make too many changes - will increase familiarity of team-mate movements and intentions.United are getting there slowly but their inability to turn up in big away games is something Ten Hag must get to the root cause of."
    ]
}