{
    "articleURL": "/wires/reuters/article-12051439/UK-court-jails-Nigerian-senator-nine-years-kidney-harvesting-plot.html",
    "content": [
        "LONDON, May 5 (Reuters) - A wealthy Nigerian politician, his wife and a doctor were jailed by a London court on Friday for trafficking a street trader from Lagos to Britain to illegally harvest his kidney for a transplant for their seriously ill daughter.",
        "Britain's Crown Prosecution Service (CPS) said Ike Ekweremadu had been sentenced to nine years and eight months in Britain's first illegal organ-harvesting prosecution, while his wife Beatrice, 56, was sentenced to four years and six months.Nigerian doctor Obinna Obeta, 51 - described by prosecutors as a middle man - was jailed for 10 years, the CPS said. All three were convicted in March of conspiring to arrange the travel of a man in order to harvest his organs.President of the Nigerian senate Ahmad Lawan said earlier in the week he had written to the British judicial authorities seeking clemency for Ekweremadu - an opposition senator and former deputy president of Nigeria's senate - on behalf of the senate.He said \"it was the first time our colleague is getting involved in this kind of thing\".Prosecutors said the couple had brought the man to Britain in February last year with the offer of a few thousand pounds for his organ and the promise of work in Britain.The case came to light when the man, who had made a living in Lagos selling telephone parts in a market, went to police saying he had been trafficked and someone was trying to harvest his kidney.The proposed transplant never went ahead as a consultant at London's Royal Free hospital became suspicious about the circumstances surrounding the proposed donor, aged about 21 who cannot be named for legal reasons, who the family had tried to pass off as their daughter's cousin.",
        "Sonia Ekweremadu, the intended recipient of the organ who has a serious and deteriorating kidney condition and requires dialysis, was found not guilty. (Reporting by Muvija M in London and Camillus Eboh in Abuja, Editing by Kylie MacLellan and Mark Potter)"
    ]
}