{
    "articleURL": "/wires/ap/article-12043795/Griner-work-court-whirlwind-trips.html",
    "content": [
        "PHOENIX (AP) - Brittney Griner caught a flight to Washington, D.C., to attend the White House Correspondents´ Association dinner, landed back at Phoenix around 4 a.m. and was up five hours later for the start of training camp.",
        "After going through her first workout with the Phoenix Mercury, she hopped on a plane to New York to attend the Met Gala, schmoozing with Usher, Patrick Mahomes and Dwyane Wade before returning to the desert. Griner didn't get back until after 1 a.m. and was back on the court with the Mercury later that morning.\"It´s been a whirlwind,\" Griner said Wednesday at the Mercury's media day. \"I have a lot of respect for the stars that do that. It´s not me. I don't how they do it. It was amazing, two big honors to be able to go and be there, but I'm taking a big nap today.\"Griner mostly kept a low profile since a nearly 10-month detainment in Russia on drug-related charges ended with a prisoner swap in December. Now that the WNBA season is just around the corner, the Mercury star has been front and center on the court and off it.Griner's return to the Mercury rekindles hope the franchise can make another run to the WNBA Finals. The extra exposure from being detained in Russia for having vape cartridges containing cannabis oil in her luggage has given Griner a platform to advocate for other Americans being detained abroad.\"It´s cool because now I´m able to reach even more people and bring them into the WNBA, but then also keep them aware of other people that are still left behind right now and trying to get home,\" Griner said. \"Just using that bigger outlet to continue to support others that don´t have the spotlight or the media coverage that they should be able to get.\"",
        "Griner has been an LGBTQ+ activist since publicly coming out in 2013 and became the first openly gay athlete to be sponsored by Nike. She made an appearance last month at a women´s empowerment luncheon held during the Rev. Al Sharpton´s National Action Network event and last week said she will use her elevated platform to continue fighting for LGBTQ+ rights during her first news conference since being released.\"That definitely is high on the list of things that I will be fighting for and speaking up against,\" she said. \"Everyone deserves the right to play, everyone deserves the right to come here to sit in these seats and feel safe and not feel like there´s a threat or they can´t be who they are. I think it´s a crime to separate someone for any reason.\"Following her detainment in Russia, Griner has taken an active role in trying to help bring home other Americans detained in foreign countries.Griner announced last week she is working with Bring Our Families Home, a campaign formed in 2022 by the family members of American hostages and wrongful detainees held overseas. She said her team has been in contact with the family of Wall Street Journal reporter Evan Gershkovich, who is being detained in Russia on espionage charges.",
        "\"I would say to everyone that is being wrongly detained across the world: Stay strong. Keep fighting. Don´t give up. Just keep waking up,\" she said. \"Find a little routine and stick to that routine. Just keep pushing, because we´re not going to stop. We´re not going to stop fighting. We´re not going to stop bringing awareness to everyone that´s left behind right now.\"Griner took small steps after her release, reacclimating herself to life at home while rebuilding her body so it will be ready to play basketball again.The activity has ramped up on and off the court as the season has drawn nearer, but little else has changed about Griner.She still is one of the best basketball players in the world, still an active advocate for those who need it, still an ebullient force to those who enter her orbit.\"She looks the same and even when she got back, the first time I saw her it was like, it's still BG,\" Mercury forward Sophie Cunningham said. \"I´m like, why do you still have this vibe about you? I love it, but are you OK? But no, I am super proud of where she´s at. I´m proud of where she´s at mentally, emotionally, and physically.\"___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}