{
    "articleURL": "/wires/reuters/article-12045863/U-S-3-month-Treasury-yield-hits-22-year-high-debt-ceiling-jitters.html",
    "content": [
        "By Harry Robertson",
        "LONDON, May 4 (Reuters) - The yield on the three-month U.S. Treasury bill hit a more than 22-year high on Thursday in the latest sign of investor nerves about the debt ceiling standoff.Two-year yields fell sharply, meanwhile, as investors bet that the Federal Reserve would have to cut interest rates this year after raising them by 25 basis points (bps) on Wednesday.The U.S. three-month T-bill yield soared to 5.55% overnight, its highest level since January 2001, when the Federal Reserve was cutting interest rates during the bursting of the dotcom bubble. It was last up 16 basis points (bps) at 5.415%.Treasury Secretary Janet Yellen said earlier this week that the government could run out of cash as soon as June 1, with Democrats and Republicans currently at an impasse.At the Fed's rate decision on Wednesday, Chair Jerome Powell said the central bank is unlikely to be able to protect the U.S. economy from the damage caused by a failure to raise the federal debt ceiling, saying it is a matter for politicians to resolve.Investors have been dumping bonds that mature in the period in which the United States could run out of money and therefore default on its debts. That has put huge upward pressure on yields, which move inversely to prices.",
        "\"I think they are expected to go literally to the wire time-wise and I think we should not be surprised if we see more nervousness, the closer we come to the deadline,\" said Michael Krautzberger, head of fundamental fixed income in Europe at BlackRock.The two-year U.S. Treasury yield fell 8 bps to 3.864% on Thursday, just shy of its lowest in a month.Investors are expecting the Fed to cut rates this year, even though Powell pushed back explicitly against that prediction on Wednesday. The Fed pushed rates up to between 5% and 5.25%.A sharp drop in the shares of PacWest, another troubled U.S. bank, on Wednesday added to unease about the direction of the economy.The 10-year U.S. Treasury yield was down 4 bps to 3.367% after a 4 bp fall on Wednesday.The European Central Bank sets interest rates on Thursday and is expected to hike by 25 bps to 3.25%.(Reporting by Harry Robertson and Sharon Singleton)"
    ]
}