{
    "articleURL": "/news/article-12042341/Coronation-protesters-expect-swift-action-police-says-chief-11-500-unveiled.html",
    "content": [
        "Met Police said force using facial recognition to spot Coronation troublemakersOp Golden Orb will be one of the largest security operations the force has ledREAD MORE: Man who 'threw shotgun cartridges wanted to speak to a soldier'Protesters who try to disrupt the Coronation can expect 'very swift action' from police who will have 'an extremely low threshold' when dealing with them, a senior officer said.",
        "A massive security and policing operation is under way that will see more than 11,500 police officers on duty on Saturday and 10,000 military personnel taking part in the ceremony.The Metropolitan Police have also said they will use facial recognition technology to spot troublemakers during King Charles' Coronation this weekend.Metropolitan Police Deputy Assistant Commissioner Ade Adelekan said that the force will not tolerate any criminal activity masquerading as protest during the event.This comes after a man who allegedly had a knife threw shotgun cartridges over Buckingham Palace's gates yesterday evening.",
        "The Met said the operation, known as Golden Orb, will be one of the most significant and largest security operations the force has led.",
        "There will be more than 29,000 police officer deployments over the coming week in the lead up to Coronation Day and over the rest of the Bank Holiday weekend.In a statement, The Met said: 'Our tolerance for any disruption, whether through protest or otherwise, will be low. We will deal robustly with anyone intent on undermining this celebration.'A massive security and policing operation is under way that will see 11,500 police officers on duty on Saturday and 10,000 military personnel taking part in the ceremony.Specialist teams have begun scouring the area of central London where events will unfold and will continue monitoring crowds to spot signs of suspicious behaviour.",
        "The policing plan has been re-examined after a security incident outside Buckingham Palace on Tuesday evening when a man who allegedly had a knife threw shotgun cartridges over the palace gates.Mr Adelekan said: 'We've debriefed our plans after that incident just to make sure there are no gaps and we're absolutely confident that we've got a plan that will deliver the coronation in such a manner that everyone will come to London and celebrate and there will be no issues whatsoever.'Asked about how officers will deal with protesters, he said: 'Our priority is around safety and security for everyone that's going to come to this event, and we want to make sure that everyone enjoys it.'We have an extremely low threshold for anybody or anything that will disrupt this event and what you will see is very swift action from us.'New laws to curb protests came into force on Wednesday ahead of Saturday's ceremony but Security minister Tom Tugendhat said the celebrations will 'showcase our liberty and our democracy'.Under the new Public Order Act, protesters who block roads will face up to 12 months behind bars.An official letter warning of the new powers was sent to anti-monarchy group Republic, which said its campaign around the coronation will proceed as planned.",
        "Republic boss Graham Smith said it is 'very odd' the letter came from the Home Office and described it as 'intimidatory'.",
        "He said: 'We've been liaising closely with the police about the protest for weeks. We've had meetings with them.'They've said very clearly that they have no problems with our plans. I just can't understand why the Home Office thinks it's appropriate to send a letter like that, which was anonymous in terms of no person's name on it.'Mr Smith added: 'It struck us as intimidatory in a way.'He said there are plans for 1,700 people to protest in Trafalgar Square on Saturday.Hundreds of thousands of people are expected to travel to central London for the event, including scores of foreign VIPs who need close protection.Commander Karen Findlay, who is Gold Command for the policing operation, said there are more VIPs for the coronation than there were for the Queen's funeral.She said: 'It is an absolutely historic, unprecedented mobilisation for us in terms of scale, but most importantly the nature and specialness of this event to the public, to the service, and all our communities in London and actually the whole of the United Kingdom and globally.'It's such an event of constitutional, spiritual importance for us all to be involved in.'",
        "A total of 29,000 officer shifts will be used during the days around the coronation, with specialist teams including armed police, sniffer dogs, mounted officers and marine officers on the Thames all taking part.There will be an airspace restriction across London on Friday and Saturday as part of 'an extensive security operation'.As well as the coronation itself, there are 1,800 registered events taking place in London over the weekend."
    ]
}