{
    "articleURL": "/tvshowbiz/article-12058089/Tom-Cruise-accepts-MTV-Movie-Award-flying-sky-high-PLANE-love-entertaining-you.html",
    "content": [
        "Tom Cruise took to the skies on Sunday when he won the MTV Award for Best Performance in a Movie for Top Gun: Maverick.",
        "In a pre-recorded video message, the 60-year-old superstar piloted a vintage fighter plane with his golden popcorn trophy and thanked his massive fanbase for the win.'Hi, everyone, thank you so much for this award,' the perennial A-lister declared. 'I make these films for you. I love you. I love entertaining you. How much you enjoy it, how much you appreciate it. There is no better feeling and I hope you enjoy this.Tom went on to plug his new Mission: Impossible film by proclaiming, 'Dead reckoning coming out in July. It's a wild ride. Have a wonderful summer. Thank you again for letting me entertain you. It's an absolute privilege. We'll see you at the movies.'The iconic star bested fellow nominees Austin Butler (Elvis), Florence Pugh (Don’t Worry Darling), KeKe Palmer (Nope) and Michael B. Jordan (Creed III).",
        "The high-flying stunt marks the second time Cruise has employed the gag this weekend, as he also sent King Charles a similar message for his coronation.Piloting the same P-51 Mustang, the War of the Worlds star told the monarch: 'Your Majesty, you can be my wingman anytime!'Fan reaction on Twitter was initially mixed, as some praised the star for his MTV Awards win, while others rolled their eyes at the ploy. ",
        "'Hey this is the same clip from the coronation!' crowed one viewer, while another tweeted: 'WAHHOOOOO CONGRATULATIONS TC.'Some viewers were a bit peeved that Elvis star Austin Butler was 'robbed,' with one fan tweeting: 'Austin should have won!!'But Tom certainly isn't sweating any social media sniping, as the megastar is hard at work on Mission: Impossible – Dead Reckoning Part Two, the grand finale to his blockbuster franchise.Cruise, who is known for doing his own stunts, initially began developing his passion for flying during the production of his 1986 classic hit Top Gun.The action star received his license in 1994, and is believed to own two additional aircrafts in addition to his flashy P-51 Mustang.",
        "The 2023 MTV Movie &amp; TV Awards is one of the first victims of the ongoing dispute between the Alliance of Motion Picture and Television Producers and the Writers Guild of America union.Writers are now on strike and picketing studios, leading the host Drew Barrymore to announce that she was dropping out last Sunday.The actress-turned-talk show host had been set to MC the festivities, but she is now putting her clout behind writers struggling to earn better pay and guarantees on staffing, as studios increasingly try to limit the size of writers' rooms and shrink the number of episodes per series. ",
        "The labor action has also led the awards show to cancel its red carpet festivities, as many other stars also dropped out to support the strikers. ",
        "BEST MOVIEAvatar: The Way of WaterBlack Panther: Wakanda ForeverElvisNopeScream VI (WINNER)SmileTop Gun: MaverickBEST SHOWStranger ThingsThe Last of Us (WINNER)The White LotusWednesdayWolf PackYellowstoneYellowjacketsBEST PERFORMANCE IN A MOVIEAustin Butler — ElvisFlorence Pugh — Don’t Worry DarlingKeKe Palmer — NopeMichael B. Jordan — Creed IIITom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWAubrey Plaza — The White LotusChristina Ricci — YellowjacketsJenna Ortega — Wednesday (WINNER)Riley Keough — Daisy Jones &amp; The SixSadie Sink — Stranger ThingsSelena Gomez — Only Murders in the BuildingBEST HERODiego Luna — AndorJenna Ortega — WednesdayPaul Rudd — Ant-Man &amp; The Wasp: QuantumaniaPedro Pascal — The Last Of Us (WINNER)Tom Cruise — Top Gun: MaverickBEST VILLAINElizabeth Olsen — Doctor Strange in the Multiverse of Madness (WINNER)Harry Styles — Don’t Worry DarlingJamie Campbell Bower — Stranger ThingsM3GAN — M3GANThe Bear — Cocaine BearBEST KISS Anna Torv + Philip Prajoux — The Last Of UsHarry Styles + David Dawson — My PolicemanMadison Bailey + Rudy Pankow — Outer Banks (WINNER)Riley Keough + Sam Claflin — Daisy Jones &amp; The SixSelena Gomez + Cara Delevingne — Only Murders in the BuildingBEST COMEDIC PERFORMANCEAdam Sandler — Murder Mystery 2 (WINNER)Dylan O’Brien — Not OkayJennifer Coolidge — Shotgun WeddingKeKe Palmer — NopeQuinta Brunson — Abbott ElementaryBREAKTHROUGH PERFORMANCEBad Bunny — Bullet TrainBella Ramsey — The Last Of UsEmma D’Arcy — House of the DragonJoseph Quinn — Stranger Things (WINNER)Rachel Sennott — Bodies Bodies BodiesBEST FIGHTBrad Pitt (Ladybug) vs. Bad Bunny (The Wolf) — Bullet TrainCourteney Cox (Gale Weathers) vs. Ghostface — Scream VI (WINNER)Jamie Campbell Bower (Vecna) vs. Millie Bobby Brown (Eleven) — Stranger ThingsKeanu Reeves (John Wick) vs. Everyone — John Wick 4Escape from Narkina 5 — AndorMOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER)Jesse Tyler Ferguson — Cocaine BearJustin Long — BarbarianRachel Sennott — Bodies Bodies BodiesSosie Bacon — SmileBEST DUOCamila Mendes + Maya Hawke — Do RevengeJenna Ortega + Thing — WednesdayPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)Simona Tabasco + Beatrice Grannò — The White LotusTom Cruise + Miles Teller — Top Gun: MaverickBEST KICK-ASS CASTAnt-Man &amp; The Wasp: QuantumaniaBlack Panther: Wakanda ForeverOuter BanksStranger Things (WINNER)Teen Wolf: The MovieBEST SONGDemi Lovato — Still Alive (Scream VI)Doja Cat — Vegas (Elvis)Lady Gaga — Hold My Hand (Top Gun: Maverick)OneRepublic — I Ain’t Worried (Top Gun: Maverick)Rihanna — Lift Me Up (Black Panther: Wakanda Forever)Taylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST DOCU-REALITY SERIESJersey Shore Family VacationThe Real Housewives of Beverly HillsFamily Reunion: Love &amp; Hip Hop EditionThe Kardashians (WINNER)Vanderpump RulesBEST COMPETITION SERIESAll-Star ShoreBig BrotherRuPaul’s Drag Race: All-Stars (WINNER)The Challenge: USAThe TraitorsBEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)Joel Madden — Ink MasterNick Cannon — The Masked SingerRuPaul — RuPaul’s Drag RaceKelly Clarkson — The Kelly Clarkson ShowBEST REALITY ON-SCREEN TEAM (presented by SONIC®)Mike “The Situation” Sorrentino, Vinny Guadagnino, Pauly D (MVP) — Jersey Shore Family VacationTori Deal and Devin Walker — The Challenge: Ride or DiesRuPaul Charles and Michelle Visage — RuPaul’s Drag RaceAriana Madix, Katie Maloney, Scheana Shay, LaLa Kent — Vanderpump Rules (WINNER)Garcelle Beauvais and Sutton Stracke — The Real Housewives of Beverly HillsBEST MUSIC DOCUMENTARYHalftimeLove, LizzoSelena Gomez: My Mind &amp; Me (WINNER)SherylThe Day the Music Died: The Story of Don McLean’s American PieBEST MUSICAL MOMENT Sofia Carson's Come Back Home from the film Purple Hearts (WINNER) COMEDIC GENIUS AWARDJennifer Coolidge (WINNER)"
    ]
}