{
    "articleURL": "/tvshowbiz/article-12039103/Will-Smith-wears-bow-tie-films-Bad-Boys-4-Atlanta.html",
    "content": [
        "Will Smith was spotted while working on the Atlanta set of the upcoming fourth movie in the Bad Boys franchise on Tuesday.",
        "The 54-year-old performer appeared to be making the most of his time at the project's set as he flashed a smile and interacted with the film's crew.The actor, who recently cheered on his children as they performed at the Coachella Festival, will reprise his longstanding role as Detective Mike Lowrey in the new installment in the action-comedy series.Smith looked sharp while wearing a button-up shirt, a bow tie and dress pants as he worked on the set of the film.The performer made his debut as Lowrey in the first Bad Boys feature, which was released in 1995.",
        "He reprised his role in the movie's two sequels, which premiered in 2003 and 2020, respectively.All three of the features saw Smith acting alongside Martin Lawrence, who portrays Detective Marcus Burnett.A spinoff series based on the films, entitled L.A.'s Finest, premiered in 2019 and did not feature participation from either of its longtime stars.The Hollywood Reporter previously confirmed that the fourth Bad Boys movie was officially being developed in 2020. At the time, it was confirmed that both Smith and Lawrence were expected to reprised their longtime roles as Lowrey and Burnett.Performers such as Vanessa Hudgens, Alexander Ludwig and Paola Nunez are also set to appear in the feature.Work on the film was said to have been paused after the Fresh Prince of Bel-Air star became the subject of controversy regarding his slapping of Chris Rock at the 2022 Academy Awards ceremony, when several of his other projects were stalled.",
        "However, Sony Chairman Tom Rothman later spoke to Deadline and confirmed that the project was still being actively developed.",
        "Smith officially confirmed that he would reprise his role alongside Lawrence this past February, when Adil El Arbi and Bilall Fallah were also announced as the project's directors.The filmmaking duo previously directed the third feature in the franchise, which was met with a generally positive reception from audiences.Physical production on the upcoming feature commenced last month, with filming taking place in both Miami and Atlanta.The upcoming fourth Bad Boys movie does not have a scheduled release date as of yet. "
    ]
}