{
    "articleURL": "/wires/aap/article-12053583/Dylan-Edwards-stars-Penrith-halt-NRL-losing-streak.html",
    "content": [
        "Coach Ivan Cleary has breathed a sigh of relief after Dylan Edwards guided Penrith to a hard-fought 18-6 win over the Warriors that brings their two-game skid to an end at Magic Round.",
        "The NRL reigning premiers came into round 10 following their first back-to-back defeats outside of the State of Origin period since 2019, but resembled themselves more closely on Saturday than in their shock loss to Wests Tigers last week.Penrith cleaned the errors out of their game, did a better job suffocating their rivals in defence and won the territory battle thanks to Nathan Cleary's kicking game but were still some way from the clinical best of their premiership seasons.Nevertheless, coach Cleary was glad to avoid a 0-3 slide heading into next week's clash with perennial heavyweights the Sydney Roosters.\"It's a good feeling to get any two points this year. It's a hard battle each and every week, or has been for us,\" he said.\"It was certainly that today. I'm very happy.\"The Panthers were constantly rebuffed by a resilient Warriors outfit that drew first blood and were never out of the fight, despite the physicality and passion of the contest twice reducing them to 12 men.Jackson Ford can expect scrutiny from the match review committee for a hip-drop tackle on Spencer Leniu that forced the back-rower to sit down, and rookie Demitric Sifakula could join him on the charge sheet after running into a fracas to strike Cleary.",
        "Warriors coach Andrew Webster said his side made things hard for itself.\"I thought when we were good, we were really good,\" he said.\"We've got to give ourselves more opportunity to be down there. You can't do that if you don't win your tackles and put some pressure on with your defence.\"Hard-working fullback Edwards helped the Panthers build a 12-6 lead at the half, first by pulling off a try-saving tackle on Dallin Watene-Zelezniak and then by stepping through the line to score at the other end.Warriors winger Edward Kosi picked up a knee injury as he made a bone-crunching tackle on Stephen Crichton and Edwards picked him out. The fullback forced a drop-out by sending a grubber kick Kosi's way, and in the next set, bamboozled him with quick hands to put Brian To'o over.Edwards was his reliable self under the high ball and finished with 237 run metres, only just behind winger To'o (246).\"He continues to deliver,\" coach Cleary said of Edwards.\"Those sorts of games suit Dyl. 'Bizza' (To'o) was another one who was outstanding today. 'Tito' (winger Sunia Turuva) was good too. Those guys do so much work in games like this.\"Warriors captain Tohu Harris made his presence felt on return from a knee injury, sending Addin Fonua-Blake over with a flat ball that helped the Warriors open the scoring.",
        "Kosi eventually succumbed to his injury in the 30th minute, Ford joined him on the sidelines with delayed concussion symptoms and Watene-Zelezniak also spent time on the sidelines for a HIA.But with Harris marshalling the middle and Shaun Johnson cleaning his kicking game up in the second half, the wounded Warriors made sure the Panthers were never comfortable.Tempers threatened to boil over in the last 15 minutes when Cleary floored Warriors forward Josh Curran in a hefty tackle, sparking a fracas between the two sides that culminated in Sifakula's sin-binning.It wasn't until Leniu, returning from a calf injury, burrowed over in the final five minutes that Penrith were home."
    ]
}