{
    "articleURL": "/wires/reuters/article-12042191/Lottomatica-slips-Europes-biggest-IPO-2023-far.html",
    "content": [
        "By Pablo Mayo Cerqueiro",
        "LONDON, May 3 (Reuters) - Shares in Italian gambling firm Lottomatica fell on their first day of trading on the Milan stock exchange on Wednesday, following Europe's largest initial public offering (IPO) this year.Shares opened at 8.50 euros ($9.38), down from the IPO price of 9 euros, and were changing hands at around 8.20 in afternoon trading, emulating other recent European listings.The group and its controlling shareholder Apollo Global Management expect to raise up to 690 million euros in IPO proceeds, which will partly be used to pay down debt.\"We are very happy with this result,\" Lottomatica CEO Guglielmo Angelozzi said in a statement.\"Today opens a new phase for the growth of our group, which will be able to count on an even stronger balance sheet and additional investors to accompany its future development programmes.\"Lottomatica is one of a handful of European companies that have pressed ahead with listing plans after a string of bank failures poured cold water on a much-anticipated recovery in the IPO market.Bankers are hopeful that more companies will follow suit in the second half of the year, encouraged by the likes of Lottomatica and Italian Design Brands (IDB), which plans to start offering shares to investors next week.Lottomatica on Friday priced its IPO at the bottom of its targeted price range.",
        "European stock market listings have slowed significantly due to soaring interest rates and economic and geopolitical uncertainty.In Italy, IPO proceeds dropped to 1.4 billion euros in 2022 from 2.2 billion euros the year before, but were still double the amount raised in 2020 when the COVID-19 pandemic hit, according to Dealogic data.So far this year, Italian IPOs have raised more than 1 billion euros, thanks to Lottomatica and EuroGroup Laminations, an electric motor components maker which listed in the first quarter.Lottomatica is Italy's biggest IPO in terms of proceeds since microelectronics company Technoprobe's listing in February 2022.($1 = 0.9064 euros) (Reporting by Pablo Mayo Cerqueiro in London Editing by Bernadette Baum and Mark Potter)"
    ]
}