{
    "articleURL": "/wires/reuters/article-12038153/US-Democrats-hold-clean-debt-limit-hike-no-spending-cuts-attached-Schumer.html",
    "content": [
        "By David Morgan, Richard Cowan and Katharine Jackson",
        "WASHINGTON, May 2 (Reuters) - Top U.S. Senate Republicans on Tuesday called on President Joe Biden to accept their party's debt-ceiling package or make a counter-offer, while a top Democrat said the Senate might try to advance a \"clean\" debt-ceiling hike next week.With barely a month to go before a possible catastrophic U.S. default, leaders of both parties hardened their standoff over the $31.4 trillion debt ceiling. Republicans in the Senate said Democrats needed to take seriously Speaker Kevin McCarthy's legislation that passed the House of Representatives along party lines last week.\"You've got a choice between accepting the House bill or entering a discussion,\" Senate Republican leader Mitch McConnell told reporters.Senator John Thune, McConnell's top lieutenant, told reporters that there is strong support for the House legislation. \"Everybody wants to see us succeed, and that means getting some legitimate, meaningful reforms as part of this process,\" he said.Democratic Senator Chuck Schumer leads a 51-49 majority, but would need the support of at least nine Republicans to pass a bill lifting the debt ceiling without conditions.House Minority Leader Hakeem Jeffries on Tuesday said his caucus was preparing a possible way to maneuver around Republican opposition, but that tactic could work only if the Senate passed a bill of its own.",
        "Treasury Secretary Janet Yellen informed Congress on Monday that the U.S. government will be unable to meet all its obligations \"potentially as early as June 1\" unless lawmakers act on the debt ceiling.Soon afterward, Biden invited McCarthy, Schumer, McConnell and Jeffries to a White House meeting on May 9.Schumer then began navigating a bill that would suspend the debt ceiling until December 2024 without conditions through the Senate, while the White House said Biden would \"stress that Congress must take action to avoid default without conditions.\"McConnell dismissed the idea of a Senate debt ceiling bill, saying a resolution would have to come from McCarthy and Biden. \"There is no solution in the Senate,\" he said.Schumer told reporters that he would wait until next week's White House meeting before deciding how to move forward.\"We have to stand firm,\" the top Senate Democrat said. \"I look forward to the president explaining in the meeting to the speaker directly the harm that he proposes to cause and I hope it'll cause cooler heads to prevail.\"The failure of Congress to act on the debt ceiling would result in a catastrophic first-ever U.S. default that could cripple the nation's economy and unsettle world global financial markets.(Reporting by Richard Cowan, David Morgan and Katharine Jackson in Washington Editing by Scott Malone, Andy Sullivan and Matthew Lewis)"
    ]
}