{
    "articleURL": "/sport/racing/article-12055135/King-Flat-racing-Frankie-Dettori-dream-land-2-000-Guineas-victory-Chaldean.html",
    "content": [
        "Frankie Dettori questioned whether he was dreaming after Chaldean carried him to a fairytale win on his final ride in the Qipco 2,000 Guineas at a rain-lashed Newmarket.",
        "As the country celebrated the coronation of King Charles, appropriately it was the king of Flat racing who stole the show and wrote another chapter in his remarkable career in the first Classic of the season.No-one should have been surprised. The 52-year-old jockey, who retires at end of this year, has made a habit of penning memorable scripts.Making the result more colourful was the fact Dettori had been unseated from Chaldean shortly after the colt had left the stalls in his trial run at Newbury last month.Saturday’s fourth win in the 2,000 Guineas and 26th British Classic on board the Andrew Balding-trained 7-2 shot was ultimately quite comfortable as he beat 125-1 runner-up Hi Royal a length and three-quarters. ",
        "Dettori said: ‘I’m not dreaming, am I? It is just so surreal. My emotions are all over the place — I want to cry, I want to laugh. It doesn’t feel real.‘To win a Classic any time is great but to do it in my last year is phenomenal. Going into the race I felt very relaxed. Maybe it is because I don’t have to worry anymore. I felt chilled and this was a horse with a chance so I should have been a bag of nerves.Dettori, who had won the Italian 2,000 Guineas for the first time in his career last Monday, added: ‘I’m looking forward to going home, re-watching it and reliving it.’",
        "Two furlongs out in the mile race it looked like Dettori and Chaldean might have a fight on their hands as Oisin Murphy-ridden Hi Royal made a bold bid from the front. But by the furlong pole Chaldean had mastered him.Royal Scotsman finished well for third and was arguably a little unlucky after getting into a tangle with Little Big Bear in the early stages.Chaldean’s win was a second in the 2,000 Guineas for Balding after Kameko (2020). Owned by Juddmonte, Chaldean’s win was a first in the race for his sire and 2011 winner Frankel. He is now likely to head to the St James’s Palace Stakes at Royal Ascot next month. Aside from Dettori’s achievement the most significant aspect of the race was the eclipse of the Aidan O’Brien contenders.Favourite Auguste Rodin, who had carried huge expectations into the race after being touted as a potential Triple Crown winner, faded tamely in the last two furlongs and beat only two of the field home.And stablemate Little Big Bear finished last of the 14 starters."
    ]
}