{
    "articleURL": "/wires/reuters/article-12060975/Slumping-Mets-visit-scuffling-Reds-series-opener.html",
    "content": [
        "Two slumping teams coming off bad blowout home losses will meet when the New York Mets visit the Cincinnati Reds on Tuesday night in the opener of a three-game series.",
        "The Mets were routed 13-6 at home by the Colorado Rockies, losing for the 11th time in 14 games and falling below .500 for just the second time this season.\"We just have to play better. We did score six runs, but we just couldn't seem to hold them,\" Mets manager Buck Showalter said. \"You try to stretch out the good times and shorten up the bad ones. Right now, we're trying to figure out a way to shorten this.\"After opening 14-7, the Mets now stand 17-18 on the season, already seven games behind the first-place Atlanta Braves in the NL East.\"It's probably not going to be the last time that something like this goes on this season,\" Mets designated hitter Daniel Vogelbach said. \"I'm not very good at math, but we have a lot of games left.\"We're starting to get healthy, we're starting to get guys back, so we just have to stick together,\" he added. \"I think that's something that this group does very well; when the game challenges you like this, it's easy to separate and it's easy to start pointing fingers. This group doesn't do that.\"The Reds have followed up a season-best five-game winning streak by dropping five of seven, including Sunday's 17-4 embarrassment at home to the Chicago White Sox. The White Sox scored 11 runs in the second inning to chase starter Graham Ashcraft.",
        "The Mets are 38-22 in 60 games all-time at Great American Ball Park. The .633 winning percentage is the highest of any National League team since the stadium opened in 2003.The Mets will send right-hander Max Scherzer (2-2, 5.56 ERA) to the mound, looking to rebound from his worst start of the season.Last Wednesday, in his return from a 10-game suspension for violating MLB's foreign substance policy, Scherzer was tagged for six earned runs on eight hits over just 3 1/3 innings against Detroit. Scherzer struck out only three batters in an 8-1 loss to the Tigers.Scherzer has had Cincinnati's number over his career. He is 6-2 lifetime with a 1.67 ERA in 10 starts. He is 4-0 with a microscopic 0.27 ERA in five starts in Cincinnati, including last July 5, when he allowed just two hits over six scoreless innings. He struck out 11 but received a no decision in a 1-0 Cincinnati win.The Reds will counter with right-hander Luke Weaver (0-2, 7.88), who will be looking for his first win in his fourth start since being promoted from Triple-A Louisville.In his last start, May 1 in San Diego, Weaver was charged with four runs on nine hits over 4 1/3 innings in an 8-3 loss to the Padres. In three starts with Cincinnati, Weaver has been tagged for 14 runs on 21 hits in just 16 innings.",
        "After Sunday's blowout loss, lefty reliever Reiver Sanmartin said he expects to be placed on the injured list with a sore pitching elbow. He was pulled from Sunday's game in the fifth inning after pitching to a 7.07 ERA through 14 appearances with 13 strikeouts.\"I've felt it for a couple of weeks now,\" Sanmartin said through an interpreter. \"I've tried to pitch through it. I just couldn't push through it anymore.\"--Field Level Media"
    ]
}