{
    "articleURL": "/wires/pa/article-12038421/He-brings--Irish-town-Doonbeg-prepares-Trump-visit.html",
    "content": [
        "Final preparations for the visit of former US president Donald Trump were under way on Tuesday in the west of Ireland.",
        "Following his visit to his property in Scotland, Mr Trump is expected to travel to his golf resort outside the town of Doonbeg in Co Clare after he lands in Ireland on Wednesday.At Trump International Golf Links &amp; Hotel Doonbeg, grass was being cut, flowers were laid out and windows were being cleaned.A security survey was in full swing, with about a dozen gardai visible at the site.Senior staff were in last-minute meetings while service and maintenance staff remained tight-lipped about the agenda.After US President Joe Biden retraced his Irish links to Co Louth and Co Mayo in March, Mr Trump will be inspecting his golf links.",
        "He bought the resort in 2014 and visited the seaside hotel as the 45th US president in 2019. His son Eric Trump has also visited the property.Away from the golf course, hedges and flower beds were being tidied up on the road to nearby Doonbeg.The town was quiet in the hazy sunshine, with streetlamps adorned with miniature US flags blowing in the breeze.Bob Rogers from Doonbeg Community Development was busy pulling weeds.He said the visit is widely welcomed in the town.“Love him or hate him, he brings a show,” Mr Rogers said.That sentiment was shared by business owners who were hopeful members of the Trump entourage may venture into the town during their quick visit.",
        "Tommy Tubridy, of Tubridy’s pub, has practised finishing a pint of Guinness by signing Don into the head.“It is great to have them come back to look at their property, probably to invest more money in it.“It is the biggest employer here in west Clare and we’re all very happy with it.”Mr Tubridy commended the resort continuing the tradition of taking customers to the town on a shuttle service.He said last year was very busy for business and he expected that to increase in 2023 following the visit.“When the golf course is going well, Doonbeg is going well.“It’s all good news. I’m not really into the politics of America, all I’m looking for is people employed and staying in our parish.",
        "“It’s just fantastic what he’s doing for west Clare.”Mr Tubridy said the Trump sons “mixed well with the locals” during a previous visit.Asked about rumours that the Trump sons dodged their bar tabs, he said: “There’s no problem with paying the tabs, everything is very well paid for in Doonbeg.”Shop owner Rita McInerney also took a pragmatic view of the visit.“There’s a mixture of people who are both pro and anti-Trump and then there’s just a few who have more of a focus on the golf.”",
        "She says the town is used to the attention and visits of the Trump family since 2014, including spotting secret service members in the area.“Everyone just takes it in their stride, to be honest. There hasn’t been much of a fuss really.”Ms McInerney said that while Mr Tump is not known to visit the village, she said she was hopeful Eric Trump would find time.“Although it is a business trip, Eric tends to like to come down and talk to the locals.”However, she said Mr Trump’s decision to become more involved in US politics had brought “challenges and opportunities”.“You get the eyes of the world on you. It reflected west Clare very well – the location of the property, those images are very valuable when you’re promoting abroad.“There was a lot of curiosity factor after 2019, we saw a lot of people come to the area because of that.“From an American perspective, we didn’t see the same bounce. It is probably only manifesting itself now after Covid because there was a lot of pent-up demand to Ireland generally.”She said there were some visitors who come specifically because they are supporters of Mr Trump but there are also others who do not visit Doonbeg because of an objection to the former president.",
        "“Then there are those who are indifferent to the politics and come because they love the golf course, west Clare and the beach.”"
    ]
}