{
    "articleURL": "/news/article-12044867/Paul-Broad-Snowy-2-0-executive-slams-Australian-renewable-energy-plan-total-BS.html",
    "content": [
        "Switch to renewable energy will take '80 years' Bowen called 'worst minister since federation' A well-regarded energy executive has dismissed claims the Labor Government will be able to power 80% of Australia by renewable energy in just eight years.",
        "'The notion that we can have 80 per cent renewables by 2030 is bulls***,' the former CEO of Snowy Hydro 2.0, Paul Broad, told Ben Fordham's 2GB radio show on Thursday. 'The truth is... this transition (to renewables), if it ever occurs, it will take 80 years... not eight.'   Fordham's colleague Ray Hadley also had some choice words for the Climate Change and Energy Minister Chris Bowen.'I think Paul (Broad) wasn't tough enough. Chris Bowen is ... in my opinion, the worst federal minister we've had since federation (in 1901),' Hadley said.",
        "Following severe delays, Snowy 2.0 - the $2billion project which is promised to store enough energy to power three million homes - will not be fully operational until December 2029.Mr Broad, who was the chief executive of Snowy 2.0 for almost a decade, said this means Mr Bowen needs to face some 'hard truths'.'The notion that we can have 80 per cent renewables by 2030 is bulls***,' he told host Ben Fordham.'Eraring cannot close … If the lights don't go out I'll be awfully surprised,' Mr Broad said, referring to the Eraring coal power station in NSW, which is set to close in 2025.He said said he resigned as Snowy Hydro CEO last August after nine years in charge because after Mr Bowen became the Energy Minister 'I was dead in the water, so it was only a matter of time before I formally resigned.'",
        "Mr Broad said he and the Minister did not see eye to eye on 'a series of things'.",
        "'Particularly the gas plant at Kurri Kurri (in NSW). (former Coalition energy minister) Angus Taylor and I were very strong that you needed gas to keep the lights on. 'And we had more gas in NSW than we know what to do with. We need gas (for) when the sun's not shining, when the wind's not blowing ... (but) Chris Bowen was against Kurri Kurri. 'Then he said, we're going to run Kurri Kurri 30 per cent on hydrogen. There is no hydrogen ... and there won't be for another 10, 20 years at the earliest,' he said. Mr Broad turned to salty language again when addressing claims by Mr Bowen's office that the former Government and Mr Broad were misleading about the delays to Snowy 2.0.'That is just bulls*** ... when I had the last meeting with Angus (Taylor), which was back in April (2022), when the contractor walked into Angus's office and said that we think there's going to be a delay and a cost increase, Angus kicked him out of the office and said it's got to be delivered on time and on budget. 'That's the truth. I mean, why does (Mr Bowen's) office do this political spin, what is he trying to do? I mean, fair dinkum, why not just tell the truth.",
        "'It's pretty easy. In life, I find, if you tell the truth you remember it and you don't get yourself into too much trouble.'",
        "Mr Broad said the move to renewable energy is going to take a long time. 'We can't make this transition until we are absolutely convinced ... the alternative is going to work and that it's going to be at a price point that it won't kill the economy. 'At the moment, we've got neither of those.' Daily Mail Australia has contacted Chris Bowen for comment. Treasurer Jim Chalmers responded to the claim at a press conference. 'We do not share that view (that it's bulls***),' he said. 'We have plans to get cleaner and cheaper energy into the system. There will be clean and cheaper energy at the very core of our plans to grow the economy. 'Those targets, those measures and policies that we have announced over a period of time now, we have worked through them in a methodical and considered way. 'We are confident we can get more clean and cheap energy in the system and our policies reflect that.'"
    ]
}