{
    "articleURL": "/wires/reuters/article-12046069/Indias-Wadia-Group-Go-First-trouble.html",
    "content": [
        "NEW DELHI, May 4 (Reuters) - India's Wadia Group has survived British colonial rule and fierce business rivalries to create an empire that spans industries, from aviation and real estate to retail, healthcare, engineering and chemicals.",
        "Here are some details about the Mumbai-based conglomerate, whose airline sought bankruptcy protection this week.- Founded in 1736 by Loeji Nusserwanjee Wadia, the group began as a marine construction company that built ships for the British empire, according to its website. Like the Tata conglomerate, Wadia is controlled by a Parsi family.- Chairman Nusli N. Wadia is the grandson of Pakistan's founder, Muhammad Ali Jinnah. Wadia's mother was the only child of Jinnah.- The group has been part of some key moments in history, building a ship named the \"Minden\" on which the American National Anthem was composed. The group also built the \"HMS Cornwallis\" on which the Treaty of Nanking, which ceded Hong Kong to England, was signed.- Between 1863 and 1954, the group created four listed companies that now have a combined market value of nearly $15 billion - food brand Britannia Industries, bedding and garments maker Bombay Dyeing, hydrogen peroxide maker National Peroxide Ltd, and Bombay Burmah Trading Corp Ltd, which has a portfolio that includes plantation and healthcare products.- The group ventured into the aviation business in 2005 when Go Airlines (India) Ltd, recently rebranded as Go First, was launched. The group's website states the airline flew 83.8 million passengers between 2010 and 2020.",
        "- Go First, India's third-largest airline filed for bankruptcy protection blaming \"faulty\" Pratt &amp;amp; Whitney engines for the grounding of about half its fleet. COVID-19 also damaged its business.- India's capital markets regulator in October barred Bombay Dyeing from the securities markets for two years after finding the firm, a sister company and several executives had misrepresented financial statements. The ban also applied to Nusli N. Wadia and his sons, Ness and Jehangir. The Wadia Group said all its transactions had been conducted in compliance with the law. (Reporting by Sakshi Dayal; Editing by Sharon Singleton)"
    ]
}