{
    "articleURL": "/wires/reuters/article-12060339/Ex-Fox-News-producer-dismisses-Delaware-lawsuit-against-Fox-NY-lawsuit-pending.html",
    "content": [
        "By Helen Coster",
        "May 8 (Reuters) - Former Fox News producer Abby Grossberg has dismissed one lawsuit accusing the cable network, parent company Fox Corp and Fox News lawyers of defamation and pressuring her to make false statements in the now-settled Dominion Voting Systems case, a court filing on Friday showed.The Delaware lawsuit was dismissed \"without prejudice,\" meaning it can be brought again. The decision to dismiss the lawsuit does not mean she has settled the case, her lawyer, Tanvir Rahman, said Monday. She is continuing her related lawsuit against Fox in New York.\"This isn't the end-all, be-all of those claims,\" Rahman said. \"We are figuring out the next steps.\"Rahman said one option could be to amend the New York complaint or file a new lawsuit in a different jurisdiction.Grossberg served as head of booking guests on recently fired Fox News host Tucker Carlson's weeknight prime-time show. Prior to that, she was a producer for Fox host Maria Bartiromo's Sunday morning show.She was fired after filing her litigation on March 20 in federal court in Manhattan. Fox said her legal claims were \"riddled with false allegations against Fox and our employees.\"In seeking unspecified monetary damages, Grossberg claimed she was subjected to a hostile and discriminatory work environment. She accused Fox of defamation, gender and religious discrimination, and pay equity violations.",
        "Grossberg also said Fox intimidated her and fraudulently induced her to make false statements in her September 2022 deposition in the Dominion lawsuit.On April 18 Fox agreed to pay Dominion $787.5 million to settle the voting-technology company's defamation lawsuit in Delaware. Less than a week later, Fox announced it had parted ways with Carlson.Grossberg could have been a key witness had the Dominion case gone to trial. (Reporting by Helen Coster; Editing by Richard Chang)"
    ]
}