{
    "articleURL": "/wires/pa/article-12046151/Virgin-tycoon-Branson-feared-losing-Covid-pandemic.html",
    "content": [
        "Sir Richard Branson has revealed his Virgin empire lost £1.5 billion during the coronavirus pandemic as he feared he would “lose everything”.",
        "The British entrepreneur, who is thought to be worth £4.2 billion and lives on a private Caribbean island, defended his decision to ask the Government for a Covid loan.Speaking to Amol Rajan for a BBC documentary, Sir Richard said: “It (the pandemic) cost us a big percentage of our net worth, maybe £1.5 billion.“There was a time where it really looked like we were going to lose everything.",
        "“We have 50, 60 planes all on the ground at Heathrow and Gatwick, Sydney, Melbourne and Brisbane. And the health clubs all closed, the hotels all closed.“The worst would have been 60,000 people out on the streets.”He said the group sold shares in companies that were public to save money, which meant “most jobs were saved as a result”.Sir Richard came under fire in 2020 when he asked the Government for help to keep his airline Virgin Atlantic afloat, in the form of a commercial loan.He insisted he did not have billions in “cash in a bank account ready to withdraw” to save the business, as his net worth was calculated on the value of Virgin businesses prior to the pandemic.But he told the BBC the media coverage at the time was “painful” and re-emphasised that he was not looking for “gifts from Government, but underwriting loans”.",
        "Virgin Atlantic eventually secured a £1.2 billion bailout involving only private funds, including £200 million from the wider Virgin Group.",
        "Earlier this month, Sir Richard’s satellite launch company, Virgin Orbit, filed for bankruptcy and axed 675 jobs – about 85% of the workforce.It came after a rocket failed to complete the first satellite launch from UK soil in January.Other businesses in the Virgin empire have come up against difficulties, with gym chain Virgin Active taking a hit during the pandemic, but raising £88 million from investors last year to help with its recovery.Elsewhere in the BBC interview, Sir Richard said he gives the money he earns to charities. and defended his tax status, with his primary residence being on his Caribbean island meaning he does not have to pay some UK taxes.“All I can say is we have paid billions and billions in taxes over the years, and will continue to do so, and our companies pay taxes in whichever country and whichever jurisdiction they’re based,” he said."
    ]
}