{
    "articleURL": "/wires/reuters/article-12055401/Berkshire-shareholders-reject-climate-diversity-proposals-Buffett-chairman.html",
    "content": [
        "By Jonathan Stempel",
        "OMAHA, Nebraska, May 6 (Reuters) - Berkshire Hathaway Inc shareholders on Saturday overwhelmingly rejected six proposals for environmental, social and governance changes at Warren Buffett's conglomerate, all of which the billionaire investor and his board opposed.By margins of at least 3-to-1, shareholders voted against three proposals that Berkshire disclose more about its climate-related risks or greenhouse gas emissions and efforts to address them, and its efforts to promote diversity.They also voted down by a nearly 10-to-1 margin a renewed call for an independent director to replace Buffett as chairman.And a proposal that Berkshire and its operating units take no positions on controversial social and political issues unless it was necessary for business got less than 1% support.The proponent of the independent chair proposal said it would leave Berkshire \"less identified\" with Buffett's \"political activities.\"He also prompted audience boos by discussing Bill Gates, whose foundation is a big recipient of Buffett's wealth, and his onetime alleged relationship with Jeffrey Epstein, the late financier and sex offender.Buffett said Berkshire's dozens of operating businesses recognize they do not have \"a piggy bank to promote their own views on politics,\" though political contributions at the corporate level \"unfortunately are in a few industries part of the way the world works.\"",
        "\"Generally speaking,\" he added, \"we've had quite a satisfactory experience\" at Berkshire.The votes were not surprising because Buffett owns special shares that give him a nearly 32% voting stake in Berkshire, making it difficult to adopt proposals he opposes.One of the climate disclosure proposals was co-sponsored by the California Public Employees Retirement System (CalPERS), the largest U.S. public pension fund, and was rejected for a third straight year.CalPERS also withheld votes to reelect the three directors on Berkshire's audit committee for allowing inadequate disclosures of environmental risks.Berkshire shareholders also reelected the company's 15-person board. (Reporting by Jonathan Stempel in Omaha, Nebraska, Editing by Franklin Paul)"
    ]
}