{
    "articleURL": "/sport/football/article-12050103/How-coronation-affect-Premier-League-weekend.html",
    "content": [
        "King Charles III's official coronation is set to take place on Saturday at 11am In total, there will be five games that will take place on the day of the coronationGames include Leeds' trip to Manchester City and Liverpool vs Brentford King Charles III's official coronation is due to get underway this weekend, following the death of Queen Elizabeth II back in September 2022.",
        "Despite the coronation, the Premier League is set to go ahead as planned, with seven games set to take place on Saturday and Sunday.It will be the UK’s first royal coronation since 1953. As well as a few tweaks to the Premier League calendar, the final day of the EFL is also set to be affected.Manchester City are set to host Leeds United, Chelsea travel to Bournemouth and Newcastle host Arsenal, to name a few games that will take place this weekend.But how will the Premier League be affected by the coronation? And what are the full fixtures this weekend? Mail Sport provides all the answers below. ",
        "How is the Premier League affected?Half of the Premier League fixtures this weekend will take place either on Sunday or Monday.The coronation will begin at 11am, once the royals have completed their arrival procession from Buckingham Palace. Following the ceremony, a return procession, following the same route back, will begin.In the afternoon, 15 members of the royal family will gather on the balcony of Buckingham Palace for the traditional fly-past to pay homage to Charles and Camilla.The ceremony itself is believed to last about an hour, although exact details on the timings of service and its duration remain unclear. With the ceremony set to get underway at 11am tomorrow, the traditional 12.30pm kick-off slot has been avoided by the Premier League. However, with King Charles's coronation and a lack of police resources, there won't be any games kicking off at that set time.",
        "Instead, there will be four games kicking off at 3pm and one game taking place at 5.30pm.Despite missing out on a televised fixture at 12.30pm, fans will be able to watch one of the 3pm kick-offs. Manchester City's clash with Leeds United on Saturday at 3pm will be broadcast live on TV.",
        "The Premier League has been forced to overrule the blackout regulations, which prohibit fixtures between 2.45pm and 5.15pm from being broadcast on television in the United Kingdom on Saturday afternoons, owing to King Charles III's coronation.Originally, the clash between the two sides was due to take place on the Sunday.It took until March 24 for the league to finalise this weekend's schedule. On the day of the coronation, only one game will take place in London.Tottenham Hotspur's home clash with Crystal Palace will take place tomorrow at 3pm, while West Ham's home clash with Manchester United was moved to Sunday at 7pm. Fulham's home clash with Leicester City is set to be played on bank holiday Monday.In total, five of the 10 games will be played on either Sunday or Monday to avoid disruption. ",
        "What are the full fixtures this weekend?Manchester City will look to go four points clear ahead of Mikel Arteta's Arsenal when they host Sam Allardyce's Leeds. The game will be Allardyce's first since being appointed the club's new manager earlier this week after sacking Javi Gracia. ",
        "Frank Lampard will be looking to pick up his first win since being appointed Chelsea's interim manager. The Blues are set to face Gary O'Neil's Bournemouth on Saturday at 3pm.Liverpool will be looking to pick up their sixth win in a row when they host Thomas Frank's Brentford. Following Manchester United's defeat to Brighton last night, Newcastle United will be looking to go five points clear of the Red Devils when they host Arsenal.The full fixture list for this weekend's action are as followed:Saturday, May 6Bournemouth vs Chelsea - 3pmManchester City vs Leeds United - 3pmTottenham Hotspur vs Crystal Palace - 3pmWolverhampton Wanderers vs Aston Villa - 3pmLiverpool vs Brentford - 5.30pmSunday, May 7Newcastle United vs Arsenal - 4.30pmWest Ham United vs Manchester United - 7pm Monday, May 8 Fulham vs Leicester City - 3pmBrighton vs Everton - 5.30pmNottingham Forest vs Southampton - 8pm "
    ]
}