{
    "articleURL": "/wires/reuters/article-12052423/US-STOCKS-Wall-St-ends-sharply-Apple-jobs-data-suggests-strength.html",
    "content": [
        "Regional banks rebound after bruising selloff",
        "U.S. employers add 253,000 jobs in April(New throughout, updates prices and market activity to close)By Caroline ValetkevitchNEW YORK May 5 (Reuters) - U.S. stocks closed sharply higher on Friday, with shares of Apple Inc rallying after upbeat results, while U.S. jobs data pointed to a resilient labor market.Apple's quarterly results also cheered investors worried about a potential recession. The iPhone maker's shares were the biggest positive influence on all three major U.S. stock indexes.The U.S. Labor Department report showed job growth accelerated in April and wage gains increased solidly, suggesting the labor market has stayed strong despite recent interest rate hikes from the Federal Reserve.With the jobs report, \"it's about the state of the U.S. economy, and what we saw today suggests it's in a better position than previously expected,\" said Kristina Hooper, chief global market Strategist at Invesco in New York.Investors have been worried that the rate hikes may eventually push the economy into recession.Regional bank shares also rebounded after recent weakness tied to the collapse of First Republic Bank. PacWest Bancorp rallied along with Western Alliance Bancorp.According to preliminary data, the S&amp;amp;P 500 gained 74.55 points, or 1.84%, to end at 4,135.77 points, while the Nasdaq Composite gained 264.67 points, or 2.21%, to 12,231.07. The Dow Jones Industrial Average rose 541.01 points, or 1.63%, to 33,668.75.",
        "On Wednesday, the U.S. central bank raised rates by 25 basis points as expected, but Fed Chair Jerome Powell noted it was too early to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.Apple drove gains in other tech shares, but all 11 major S&amp;amp;P sectors were higher on the day.The estimated decline in first-quarter S&amp;amp;P 500 earnings has been getting smaller since the start of the reporting season and is now at just 0.7% year-over-year, Refinitiv data showed on Friday. (Additional reporting by Ankika Biswas and Sruthi Shankar in Bengaluru and Sinead Carew in New York; Editing by Subhranshu Sahu, Shounak Dasgupta and David Gregorio)"
    ]
}