{
    "articleURL": "/wires/aap/article-12039427/Remains-croc-missing-fisherman-search.html",
    "content": [
        "The search for missing fisherman Kevin Darmody has ended in tragedy after human remains were discovered inside a crocodile found upstream from where he disappeared.",
        "Crews had been trying to find the 65-year-old Laura man since Saturday when he disappeared while fishing along the Kennedy River at Rinyirru (Lakefield) National Park northwest of Cape Tribulation.Authorities caught and euthanised two crocodiles measuring 4.1m and 2.8m in length as part of search efforts in the remote part of far north Queensland.Human remains believed to be that of Mr Darmody were found during inspections of the animals, police Inspector Mark Henderson said.\"It's a very tragic end to this search, hopefully it will give some closure to the family,\" he said.\"My thoughts go out to the family and the community of Laura, who are very, very affected by this tragic outcome.\"Mr Darmody was the publican of a local hotel and has been described as well known in the community and a nice fellow.The formal identification process will be completed and police will prepare a report for the coroner.Authorities earlier confirmed \"items of relevance\" were found inside the smaller crocodile, with ongoing search efforts dependant on results of a necropsy of the larger animal.Investigators believe a group of people had to shoo away the smaller crocodile so they could fish by the river bank.\"It appears a short time after that, we suspect an attack has occurred,\" Insp Henderson said.",
        "Witnesses recalled hearing yelling and screaming followed by a large splash in the water.Residents and visitors in central and north Queensland have been reminded that crocodiles can inhabit any body of water in a large part of the state.\"Any water body in croc country, which is from the Boyne River just by Gladstone all the way north ... could contain a crocodile,\" Department of Environment wildlife operations manager Mike Joyce said."
    ]
}