{
    "articleURL": "/wires/ap/article-12040501/Indias-RBI-single-10th-lifts-Reds-Padres-2-1.html",
    "content": [
        "SAN DIEGO (AP) - The Cincinnati Reds had lost their last nine games at Petco Park. Jonathan India and Alexis Díaz made sure the streak didn't reach 10.",
        "India singled in the go-ahead run on Luis Garcia's first pitch of the 10th inning and the Reds beat San Diego 2-1 Tuesday night to snap the Padres' three-game winning streak.India's single to left off Garcia (1-3) brought in automatic runner Matt Reynolds.Díaz then impressively shut the door on the Padres. He walked Trent Grisham opening the bottom of the inning to give the Padres runners on first and second, but then retired superstars Fernando Tatis Jr. on a strikeout, Manny Machado on a fly ball to left and Juan Soto on a called third strike to earn his fifth save.\"I've said so many times, our team is real gritty,\" India said. \"Even the umpire tonight, actually said it to me, in the second inning he came up to me and said, `I love watching your team play.´ I was like, `Thank you for noticing,' because that´s the team we are. We don't stop fighting. We're a gritty team and we'll fight with anyone and we'll fight to the end.\"India said he hasn't been swinging the bat well the last week. \"You can't give up. You've got to keep going, you've got to keep fighting. That's what I'm battling right now. Once I find my swing again, it's going to be really hard to get me out.",
        "\"I had to come up big for my team in that situation. I stepped up and I did my job.\"Manager David Bell said it was enjoyable watching Díaz blow through the heart of the order of the team with baseball's third-highest payroll.\"What a great challenge. I saw it in his face. He wanted to be out there,\" Bell said. \"As a fan of baseball, it was hard for me to watch it that way, but I was. I was enjoying seeing that level of those hitters, great hitters, but Alexis believes in himself, he had to make pitches, he challenged them, threw some great sliders, some great fastballs and came out on top tonight.\"Manager David Bell said Díaz \"wantedDerek Law (1-4) pitched the ninth for the win.Michael Wacha held the Reds to two hits in six shutout innings and Nick Martinez pitched a perfect seventh before Cincinnati tied it 1-1 with two singles in the eighth. TJ Friedl singled with one out, stole second and scored on Jake Fraley's two-out base hit to right.Soto, heating up after a slow start, doubled in Manny Machado with two outs in the third. Soto scorched a ball just fair down the line and and into the right field corner to bring in Machado, who was aboard on a two-out single. Soto hustled into third on the throw home and was stranded.",
        "He doubled again in the sixth, his third straight multi-hit game and ninth this season. He had a two-run double in Monday night's 8-3 win. He has four extra-base hits in his last four games - three doubles and a homer - after having none in his previous seven games. Soto leads the majors with 28 walks.Tatis went 0 for 5 with two strikeouts to end his nine-game hitting streak. He returned April 20 from an 80-game PED suspension.Wacha got in and out of trouble in the first. He retired the side with runners on second and third after Jonathan India reached on Machado's fielding error and Friedl blooped a single to left.Cincinnati's Graham Ashcraft allowed one run and six hits in six innings to lower his ERA from 2.10 to 2.00.PINATA PARTIESStarting with Saturday's 16-11 win against San Francisco in Mexico City, the Padres have celebrated each of their last three wins with clubhouse piñata parties, with the player of the game - Nelson Cruz, Matt Carpenter and Ha-Seong Kim, respectively - taking whacks at papier-mâché figures filled with candy while wearing a sombrero as their teammates dance around. \"It is entertaining to watch,\" manager Bob Melvin said. \"It's great to see because anytime you win a game you should feel good about it. I think we've taken our celebrations maybe to another level.\" Tatis bought the sombrero at the team hotel Friday night and it's placed on the head of any player who hits a home run.",
        "TRAINER'S ROOMPadres: SS Xander Bogaerts got the night off. Melvin tried to give him Monday night off, but \"he wanted to be out there for Tati,\" he said, referring to Tatis' first home game since Sept. 26, 2021.UP NEXTRHP Luis Cessa (1-3, 9.55 ERA) is scheduled to start Wednesday's series finale against Padres RHP Seth Lugo (2-2, 3.58).___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}