{
    "articleURL": "/wires/reuters/article-12050753/Fighting-rages-Khartoum-civilians-say-forgotten.html",
    "content": [
        "Rival sides battle for territory",
        "Smoke rises over Khartoum, Bahri despite supposed truceHospitals wrecked and occupied, food aid lootedU.N. urges countries to let in fleeing civilians(Adds talks in Saudi Arabia, paragraphs 7-8)By Khalid Abdelaziz and Nafisa EltahirPORT SUDAN, Sudan, May 5 (Reuters) - Heavy gunfire echoed around Khartoum on Friday as civilians trapped in the Sudanese capital said the army and rival paramilitary were fighting without regard to their plight.Battles since mid-April have killed hundreds and wounded thousands, disrupted aid supplies, sent 100,000 refugees fleeing abroad and turned residential areas of Khartoum into war zones.\"It's been four days without electricity and our situation is difficult,\" said 48-year-old Othman Hassan from the southern outskirts of the city. \"We are the victims of a war that we aren't a part of. No one cares about the citizen.\"Smoke rose into the air in an area outside Khartoum's presidential palace and across the River Nile in the adjoining city of Bahri, live footage on broadcaster Al Jazeera showed.Despite multiple ceasefire declarations, the army and the paramilitary Rapid Support Forces (RSF) appeared to be fighting for territory ahead of proposed talks.So far, army leader Abdel Fattah al-Burhan, a career military officer, and RSF commander Mohamed Hamdan Dagalo, a former militia leader known as Hemedti who comes from the strife-torn western region of Darfur, have shown little public willingness to negotiate.",
        "Saudi Arabia's foreign minister, Prince Faisal bin Farhan, and U.S. Secretary of State Antony Blinken on Friday discussed a plan for the warring parties to meet in Jeddah in a bid to reduce tensions, Saudi Arabia said.Sudan's armed forces said it sent a delegation to Jeddah on Friday evening as part of the initiative. The RSF did not immediately comment, but both forces have said they will only discuss humanitarian ceasefires and not ending the war.Their power struggle risks dragging in outside countries, further destabilising an already restive region.A group of countries led by Britain, the United States, Germany and Norway is set to request an urgent meeting of the U.N. Human Rights Council on the Sudan crisis next week, a document showed on Friday.Across swathes of Khartoum, factories, banks and shops have been looted or damaged, power and water supplies have been failing and residents have reported steep price rises and shortages of basic goods.Whole neighbourhoods have emptied, leading people to fear for the houses they left behind.Aya Eltahir said she fled with her family to the northern outskirts of the capital after bullets hit their roof.\"I make plans to return every day, even just to grab more essential items, but the situation is too unsafe,\" she said.",
        "The World Health Organization (WHO) said at least 551 civilians had died and 4,926 been wounded, based on data from Sudan, but real tolls were likely much higher due to the difficulty of accessing medical facilities.'RECKLESS DISREGARD' FOR CIVILIANSThe Sudanese Doctors Union said one of the country's main maternity hospitals, Aldayat, in the city of Omdurman that adjoins Khartoum, and the central medical supply warehouse had been looted and occupied by forces on Thursday.In total, it said 17 hospitals had been damaged by fighting and 20 forcibly evacuated since the start of the violence. Sixty of the 88 hospitals in Khartoum are out of service, it said, with many of the rest only offering partial service.\"Sudan's warring armies are showing reckless disregard for civilian lives by using inaccurate weapons in populated urban areas,\" Human Rights Watch Sudan researcher Mohamed Osman said in a report.The army and RSF, which had shared power after a coup in 2021, have accused each other of breaching a string of truces.Their conflict has derailed an internationally backed plan to usher in democracy and civilian rule after a 2019 popular uprising that unseated Islamist strongman Omar al-Bashir.The U.N. has pressed the warring sides to guarantee safe passage of aid after six of its trucks were looted.",
        "The U.N. World Food Programme (WFP) said some $14 million worth of food for the needy has been plundered, while U.N. children's agency UNICEF said more than 1 million polio vaccines were destroyed when cold storages were looted.Fighting has spread across the country, including the western region of Darfur.The U.N. refugee agency UNHCR is estimating an exodus of 860,000 people from Sudan and called on governments to look kindly on fleeing civilians. The agency is calling on countries not to return people to Sudan.\"The humanitarian situation in and around Sudan is tragic - there are food, water and fuel shortages, limited access to transport, communications and electricity, and sky-rocketing prices of basic items,\" said Raouf Mazou, UNHCR's assistant high commissioner for operations.(Additional reporting by Emma Farge and Gabrielle Tétrault-Farbe in Geneva, Adam Makary, Jana Choukeir and Ahmed Elimam in Dubai; Writing by Michael Georgy and Cynthia Osterman; Editing by Andrew Heavens, Andrew Cawthorne and Daniel Wallis)"
    ]
}