{
    "articleURL": "/news/article-12040465/Angry-passenger-reveals-Sydney-cab-drivers-jack-fares-one-telling-photo-taxi-meter.html",
    "content": [
        "Taxi customer calls out 'ridiculous' driverSydney Cab driver charged extra $10The cab had not started journey yet They refused to pay the $17.70 fareAn angry passenger has called out a cab driver after he attempted to charge them a whopping $17.70 as soon as they got into the vehicle. ",
        "The commuter said the driver pressed a button that increased the fare by about $10 after getting into the taxi in Sydney - posting the incident to social media on Tuesday.The irate customer said they had a go at the 'ridiculous' driver about the price before getting out of the taxi and refusing to pay. The online image was captioned, 'the moment we stepped into the cab…' and showed the taxi meter inside the car clocked in at $17.70. 'The taxi driver pressed a button on the fare machine and it automatically added $10,' the passenger said in the post.",
        "'And I asked him what was the button he pressed to add $10 right away and he just told us that’s the normal starting price.'We told him to get f***** and all got out the cab.'The passenger said the meter is normally fixed to $7.20 at night but their driver had added the extra amount in. The person also claimed another taxi driver pulled a similar stunt by 'jacking up' the fare to $20 while arriving home to Sydney's inner west from the city about a month ago.'Lost my s*** at him and then he tried to bargain a price,' they wrote.'Told him to take me to [the cop] shop around the corner so we could sort it out. The taxi drivers are getting ridiculous in Sydney.'",
        "But some social media users did not agree with the disgruntled customer. 'At night that is standard. Have you never caught a taxi before?,' one said. 'I have Uber and the 13Cabs app, I look at whoever is cheaper with a reasonable wait time and use that,' another said. 'I think the [taxi] industry is already on its last legs,' a third wrote. It comes after a similar incident where a Melbourne cab driver charged a man a hefty $468 after the customer fell asleep during the taxi ride.Ryan was so shocked he filmed himself asking the driver about the huge amount and posted the complaint to social media last month.",
        "He had travelled from Melbourne Airport to Berwick, 75km away, a fare that would normally cost a maximum of around $160. It got even worse when the $468 fare became $486.72 after charges were added to the already astronomical price. But Ryan was saved because his bank account was frozen while he was on a trip abroad, so his card was declined and he ended up paying just the $200 cash he had on him. NSW Taxi Council CEO Nick Abrahim encouraged taxi customers to take up any overcharging complaints with the Point to Point Transport Commissioner. 'Fortunately in the majority of cases drivers do the right thing, there are a few that tarnish the brand of taxis across the board,' he told Daily Mail Australia. ",
        "'Passengers should jot down the registration and brand of the taxi so can be investigated so action can be taken against drivers.'If drivers choose to go down this path we want them out of the industry and we make no apologies for that.' The NSW regulator of taxis, rideshares and hire cars hotline can be contacted on 1800 500 410 and is available 24/7."
    ]
}