{
    "articleURL": "/tvshowbiz/article-12055411/Rumours-swirl-Sarah-Harris-dating-Dr-Chris-Brown-following-split-husband-Tom.html",
    "content": [
        "The Project host Sarah Harris is rumoured to be dating celebrity vet Dr Chris Brown.",
        "Harris, 41, has been single since splitting with her husband Tom Ward in 2021 and The Daily Telegraph reported on Sunday she is now dating Brown, 44.'Sources believe the woman who replaced Bickmore at the helm of The Project, the wholesome Harris, has fallen for the chiselled I'm A Celebrity co-host,' they wrote.Brown, who previously dated TV presenter Roz Kelly in 2012 and actress Kassandra Clementi in 2014, is known for keeping his love life under wraps.He was reported to be dating influencer Brooke Meredith from 2020 until 2022 - although they were rarely seen together - and they are believed to have broken up late last year.",
        "Daily Mail Australia has reached out to both Sarah Harris and Dr Chris Brown for comment.Back in April, Chris told the Stellar podcast Something To Talk About that he prefers not to open his love life to public scrutiny.'The challenge is that it's hard enough to meet the right person, anyway,' he said.'That extra layer of speculation and interest… once you're actually in a relationship it's easy, but it's meeting that person at the start that's really hard.'Chris said that media speculation about his romantic interests is 'funny' to him but can be a lot to handle for his loved ones.",
        "Dr Chris signed off on I'm a Celebrity Get Me Out Of Here last month - which he co-hosted with Julia Morris for nine seasons - and is leaving Channel Ten altogether to take up a new role at Seven in July. ",
        "When it comes to looking for love on television, Chris refuted rumours that he would ever appear on The Bachelor.'The idea of trying to meet someone with – you know, conservatively – 10 cameras and about 120 crew around, I'd probably struggle with that,' he said, adding that 'just the thought' of kissing someone on camera repeatedly, 'makes my skin crawl.'Meanwhile, Sarah Harris announced her split from husband Tom Ward back in March 2021, after seven years of marriage.The former couple share sons Paul, seven, and Harry, five. "
    ]
}