{
    "articleURL": "/news/article-12060725/The-hippie-town-Washington-state-bans-drugs-spike-overdoses.html",
    "content": [
        "Bellingham, Washington has seen a significant uptick in crime and overdose deaths since the state decriminalized drug possession two years ago One city council member recounted hearing about the body of a dead man that was left on a bench in public for 12 hours amid the surge in overdose deathsA recent bill that failed before the Washington state legislature would have applied harsher punishments to individuals apprehended for public drug use Bellingham, Washington, once labeled the 'most hippie' town in the state, is now attempting to take drastic action to outlaw public drug usage after statewide decriminalization two years ago led to a spike in crime and overdoses.",
        "The progressive city of 92,000, situated about one hour south of the Canadian border, has seen overdoses become so commonplace that one dead man was left on a bench for 12 hours before his body was cleared away.The city's Fire Department has responded to 223 overdoses - 2.5 overdose calls a day - between January and mid-April of this year. A nearly 100% increase to the rate at which calls came in last year.Among those who have passed are two teenagers, and a 5-year-old girl, who overdosed on fentanyl in March and was found  by authorities foaming at the mouth. The death led to the arrest of the child's parents and another person.",
        "City Council Member Edwin Williams told the New York Post that some of the grisly scenes 'shocked me to my core.''A man was sitting on the curb in a parking lot with his head bowed, right out in the open … and a police officer told me that he had been dead for at least 12 hours,' he said.'I have lived here for 30 years, and no, I haven’t seen anything like this,' he continued. 'I would characterize our city as one that is trying and willing to bend over backwards to help and provide people with programs to address either addiction or homelessness.'",
        "In 2018, Bellingham was named 'the most hippie town in Washington' by OnlyInYourState.com. A title local media bragged about at the time that opened the door for deregulation, which has led to crime spikes and drug casualties.In April, city officials approved an ordinance that would make it illegal to 'inject, ingest or inhale' hard drugs in public. Two years ago, Washington state passed a law that did the opposite - decriminalizing drug possession.Overdose deaths in the county in which Bellingham is situated have exploded in the last several years.In 2018, Whatcom County had 11 overdose deaths. In 2021 that number was 50. And in 2022, it ballooned to 89.The new rule stipulates that those caught using hard drugs, like fentanyl or meth, in public will be arrested, but may only face misdemeanor charges.Seth Fleetwood, the mayor of the city said that the ordinance will also include a 'community court' component, meaning those arrested may be placed on a type of diversion programs, as opposed to in jail. Details of that program remain undeveloped.Bellingham parent Steve and Laurie Satushek told the Post the new ordinance is not enough. Their 29-year-old son died in April after a 10-year battle with drug addiction, during which his grieving parents say authorities and the state failed him.",
        "'The fact that my son overdosed on fentanyl or any drug was just bound to happen because he did not have a chance in our system,' said Laurie. ",
        "'I would consider myself a progressive person, but there just are a lot of laws and things that I don’t think work properly,' said Steve.'I walk around downtown and it’s just awful. I went with my son to some of these homeless camps, and they’re just horrid, filthy places. I feel real strongly that we need to go back to what the New York mayor [Eric Adams] and [California] Gov. Gavin Newsom have said, which is to involuntarily commit people who need that help.' Officials in the city say they saw a nearly immediate uptick in crime and public drug use in 2021, after the state Supreme Court struck down a state law that made simple drug possession a felony. Current state law, which expired on July 1, classifies drug possession as a misdemeanor only on an offender's third arrest. A bill that went before the legislature this year would have provided harsher punishments, including a maximum jail sentence of 364 days and a $5,000 fine.The bill died in the state Senate last month after failing to garner enough votes to move forward.",
        "Following the failed vote, which came after intense negotiation on all sides, progressive Governor Jay Inslee expressed his disappointment and frustration: 'We cannot accept decriminalization in the middle of a fentanyl crisis.'"
    ]
}