{
    "articleURL": "/news/article-12051083/Loved-ones-Lady-Bird-Lake-victims-slam-police-ruling-foul-play.html",
    "content": [
        "Reegan Aparicio told DailyMail.com she believes partner Chris Hays-Clark, 30, was killed before being dumped in Lady Bird Lake, where he was found April 15Hays-Clark was discovered four days after he was last seen alive, making him the fourth person to be pulled from the Austin lake in three monthsPolice have insisted there is no evidence of foul play, however, the friends and family of other victims suspect they were drugged and murdered Reegan Aparicio gazes out over the expanse of lake where long-term partner Chris Hays-Clark was found floating four days after he mysteriously vanished.",
        "'Police insist there was no foul play,' the dental nurse tells DailyMail.com, her voice an animated mixture of anger, grief and frustration. 'Oh no, someone put him in there. I believe he was dead when he went in the water. We're getting nothing from the detectives. But honestly, I believe they know.'Her sentiment is loudly echoed by others who have also tragically lost loved ones in the same location in just three months.The stretch of water is Lady Bird Lake in Austin, Texas, where four men have been discovered floating and dead since mid-February – sparking frenzied speculation that a serial killer is on the loose in one of America's biggest post-Covid boom towns. ",
        "Hays-Clark, a 30-year-old father, was the latest victim to be pulled from the lake on April 15. Before him, it was Jonathan Honey, 33, found on April 1, following dad-of two Cliff Axtell on March 5, and Jason John, 30, on February 13. The Austin Police Department has issued a statement insisting there was no foul play in any of the deaths.However, all four victims vanished in baffling, uncharacteristic but disturbingly similar circumstances – as did Martin Gutierrez, 25, who was found floating face down in the lake in 2018. Another four bodies have been pulled out in the past 10 months, but their identities have not been revealed.",
        "Additionally, in 2019, Christian Pugh, 21, was found alive but severely injured, four years after 22-year-old Julio Santos, 22, was discovered dead in the man-made lake, which is part of the Colorado River that flows through the city.Casting its shadow over the fear and uncertainty now escalating in downtown Austin is Rainey Street, the raucous bar and food truck zone 1.8 miles from the lake and from where at least two of the latest victims – and Gutierrez – wandered off in the early hours to their deaths.Adding to night time unease around the unlit pathways bordering Lady Bird Lake is the ever present threat of crime.Last week a submerged bullet riddle car was hauled from the lake at the Festival Beach boat ramp following reports of shots being fired at 2.30am and a vehicle going underwater.Austin Police Lake and Patrol Dive Team retrieved it at 1pm on May 1, but found nobody inside.",
        "Investigators also found shell casings on the ramp. The location is less than three-quarters of a mile from Rainey Street.Local campaigners for greater safety around the lake have cited the lack of lighting and security surveillance.The chilling unsolved deaths have led true-crime fans and internet sleuths to go into overdrive with theories and speculation, with a private Facebook group called Lady Bird Lake Serial Killer gaining more than 85,000 members. ",
        "But according to Austin Police Chief Joseph Chacon: 'Nothing has come to light that would indicate that there is a serial killer in Austin.'Rainey Street has a long-standing reputation for being an area where revelers are in danger of having their drinks spiked so they can be robbed – or worse.The theories are flying thick and fast. The facts harder to piece together, which is compounding the grief for the families involved.Hays-Clark, a cook, hadn't been to Rainey Street as far as Aparicio is aware – although she admits she doesn't know for sure. The couple, Austin's Memorial High School sweethearts, had recently split and Chris was living with his mother, Christine.On April 11 he told his mom he was heading out. That was the last Christine or any of his other loved ones saw of him. Four days later, at around 1.30pm, walkers along a lakeside path spotted a floating body near Longhorn Dam.'I don't believe Chris was near any bars, but no one has any idea what he was eventually doing down in the area of the lake,' Aparicio, 28, told DailyMail.com. She stood alongside a small shrine she has constructed on the bank near where he was found. She was emotional, but clearly not a woman to crumble.",
        "'It was a long way from his mom's place. He would never go down there normally. There's no surveillance footage, nothing. It is totally baffling.'",
        "Aparicio, who shared 12-year-old son Lashawn with Chris, has been going to the same spot every day since her ex was found dead, desperately trying to look for clues and to reconstruct his final hours.She is doing that because she believes Austin Police Department is failing her – and the families of the other lake victims.'It's taken two weeks for a detective to even get back to me properly,' she said. 'I'd asked the police where is the investigation at and what's going on? And I'm just told it's pending and given very little else.'They haven't told me the cause of death. I've asked, but nothing. Everything is still ''under investigation\". I literally have no answers, only questions.'That makes me angry, I feel upset and I feel like they can do more. I feel like there is more to be told and they are just not saying it.'The mom continued: 'And it's strange to me that they say they are investigating, because I don't really see anything being done.'I've been going to the lake every day since this happened. Just to look for my own, to see if there's anything significant, anyone about who might know something.",
        "'I'm going to keep coming here until I find out what happened. I'm not going to give up on Chris, he deserves justice. Somebody should be able to give me that.'My thing is the police are saying there's no foul play. And telling me it's not being investigated as a homicide because there are no real leads.'Why? How is that even right? If you don't have the leads then get out there and find them. Do the work. 'If you don't have the staff to do it because you're so short-staffed that you can't even get back to a family that's been calling you for two weeks, then find somebody. ",
        "'They shouldn't wash off the case because they don't have any answers or can't find anything.'Clutching a photograph of Chris with baby Leshawn, Aparicio added: 'I don't understand what's so hard about them just telling us the truth? They have to know something.'I think that somebody put him in here and I don't believe that he was alive at the time. And I don't believe that he was under the influence of any substance and that that made him drown. No way.'I am devastated by this, very heartbroken. Chris was super sporty, a great swimmer. This wasn't an accident.'",
        "The young mom did get one last look at Hays-Clark. 'He was in a body bag,' she said. 'I got him released from the medical examiner to a funeral home, where I had just two minutes with him. They unzipped the bag and I only saw his face before they zipped it back up.'Friends and family of the first of the four latest victims also want more answers from the police.Jason John – known as JJ – went missing from Rainey Street at about 2am on February 5 after celebrating with friends because he has been promoted in his sales job at an IT research company. His body turned up eight days later.Originally from New York, he moved to Florida during Covid and settled in Austin in 2021.'I believe JJ was drugged and from there a tragic accident happened or somebody non-violently assaulted him,' his one-time roommate in Austin, Josh Gale, told DailyMail.com.'The early autopsy results show no evidence of defensive wounds, so it appears there wasn't a violent struggle. So I believe he could have been pushed enough to get him in the water, but not enough to leave a bruise.",
        "'He was bar hopping and the group eventually came to Rainey Street where they went into two bars, the last one being La Cantina 512. Then he left without saying goodbye to anyone. And he was walking his normal route home to his apartment near the Colorado River and never made it.'Referring to the other deaths, Gale, 32, said: 'For this to happen again and again and again with the same type of thing happening, where it is not happening in other places makes no sense to me.'I don't know if every one of these is connected. The true pattern is, there are no answers. That is the pattern.'He added: 'Do I think we have a Jeffrey Dahmer walking around Austin? No, I do not.'But I do think we have in Austin a group of people who want to drug people so they can rob them. And I think some of the people they are drugging are getting away but falling into a tragic situation because they are under the influence of these drugs.'Gale was also critical of Austin PD. 'We have four witnesses in JJ's case, not necessarily who saw every little thing. However, the police didn't interview a single one of them.'If you want to consider suicide, you want to get the person's mindset. The police have not interviewed anyone who might help with that. They just say, accidental drowning and we'll wait for the toxicology report.'Father-of-two Cliff Axtell, 40, who was a land specialist for a commercial property company, was last seen on March 5 at Stubb's Barbecue in downtown Austin, slightly farther away from Lady Bird Lake than Rainey Street. He married wife Meghan in 2016 and led worship at his local church.Jonathan Honey was in Austin for a bachelor trip from his home in Washington DC when he vanished on the evening of Friday, March 31, after getting something to eat at a food truck in Rainey Street. His body was found the next day.The tragic case of Martin Gutierrez, despite being more than four years ago, has eerie similarities to the recent cases. And his family is convinced he was drugged, stalked and killed.He had enjoyed an evening meal in downtown Austin on November 19, 2018, with brother Mitch and his sister-in-law Whitney, both former ICU nurses. The married couple left and he continued on with friends, bar hopping in Rainey Street.",
        "'They went to one bar and then went to Luster Pearl. According to his debit card records he only purchased one drink there. And then they moved on to another bar, Alibi,' Mitch told DailyMail.com.'By the time my brother got to Alibi his behavior had completely changed. He was leaning on the bar, he was acting different like he was drugged. The bar tenders didn't even serve him a drink. This was about 1am.'Martin, who lived with his brother and wife a 15 minute drive from downtown Austin, then slipped out of the bar unknown to his friends.'According to the surveillance we've seen, Martin made his way down and went to this bar called Craft Pride,' said Mitch.'He never went inside. But the surveillance shows him taking the corner and walking towards I35. Then the last surveillance we had was him near the Towers of Town Lake apartment complex, walking towards Lady Bird Lake.'That's the last sighting of him alive. November 26 his body was recovered from the water, he was floating down the lake.'There was an apartment complex that overlooks Lady Bird Lake from Riverside and someone went out for their morning coffee on their balcony and saw Martin floating face down and called 911.'The family was told the cause of death was accidental drowning. They are skeptical to say the least.'That's difficult to believe because my brother had a large contusion on the back of his head with bruising. Dead people don't bleed. I remember the cop saying, oh maybe he just fell off the bridge and hit his head when he was already in the water. I was like, you don't bleed if you're dead.'So he was alive long enough to bleed and create a bruise. So I believe he was harmed and placed in the water. I do believe he was drugged and I do believe someone harmed him. By following him and killing him.'DailyMail.com made a formal request for autopsy reports on the four latest lake victims to the Travis County Medical Examiner. In each request, we were told they would not be ready for up to 120 days from the date of the examination. Austin PD responded to our request for an update on the inquiries, saying there was no further information."
    ]
}