{
    "articleURL": "/tvshowbiz/article-12057729/Bindi-Irwin-reunites-second-dad-Beau-Bridges-Los-Angeles.html",
    "content": [
        "Bindi Irwin reunited with her long-time friend Beau Bridges at the star-studded Steve Irwin Gala Dinner in Los Angeles on Saturday.",
        "The 24-year-old conservationist is known to have a close bond with the actor going back more than a decade, and Beau has even been described as her 'second dad'.The Emmy winner, 81, posed for a photo with an excited-looking Bindi after surprising her on the red carpet.Bindi looked glamorous for the occasion in a floral black dress and matching blazer, and completed her look with ballet flats.Beau, who shares the Irwin family's passion for wildlife preservation, opted for a classic black suit which he paired with a cream bow tie.",
        "The pair have a sweet friendship despite their 57-year age gap, which began when they both starred in the 2010 film Free Willy: Escape from Pirates Cove.Beau later spoke of the Irwins in glowing terms, and was particularly effusive in his praise for Bindi's hard-working mother Terri.'My first impression of Terri was as a mum - the mum of the leading actress of our movie. Bindi had a responsibility,' Beau told New Idea magazine in 2011. 'Terri was right there every step of the way making sure the workplace was a safe and happy one so Bindi could do the best job possible.' ",
        "Bindi, Terri and Robert Irwin hosted a gala dinner in honour of the late Steve Irwin at the SLS Hotel in Beverly Hills on Saturday.",
        "The Irwins have proudly carried on the legacy of Steve - known around the world as the Crocodile Hunter - following his tragic death 17 years ago.It follows reports Bindi's own child, two-year-old  Grace Warrior, could soon front the cameras just like her famous mother and grandfather. ",
        "'Grace is an absolute natural in front of the camera,' a source told New Idea in April. 'It's also believed she could be an even greater entertainer than her grandfather Steve Irwin. She's so bright and funny,' they added.While some close to the Irwin family believe Grace is too young for a life in front of the cameras, her mother Bindi was already appearing on TV from the age of two.'You have to remember that Bindi grew up in front of the cameras and was Grace's age when she first started appearing on television,' said a source. "
    ]
}