{
    "articleURL": "/wires/reuters/article-12053273/Hurricanes-Game-2-decisive-win-Devils.html",
    "content": [
        "Jesperi Kotkaniemi scored two goals for the Carolina Hurricanes in a 6-1 win over the New Jersey Devils in Game 2 of their Eastern Conference second-round series on Friday night in Raleigh, N.C.",
        "The Hurricanes lead the best-of-seven series 2-0 heading into Game 3 on Sunday in Newark, N.J.Jordan Martinook had a goal and an assist, Jordan Staal, Martin Necas and Stefan Noesen also scored and Frederik Andersen made 28 saves for Carolina, which scored four goals in the second period.New Jersey goalie Akira Schmid was replaced for the second consecutive game after stopping 21 of 25 shots through two periods. Vitek Vanecek made nine saves on 11 shots in the third.Miles Wood scored for the Devils, who have been outscored 11-2 in the series.The Hurricanes scored on a power play to take a 1-0 lead at 1:35 of the second.Kotkaniemi received a pass from Shayne Gostisbehere above the right circle with room to skate in and score with a wrist shot.Kotkaniemi scored his second goal 2:23 later to stretch the lead to 2-0.Martinook and Jesper Fast teamed up to win the puck on the forecheck and Kotkaniemi shot it past Schmid from in close at 3:58.The Hurricanes moved ahead 3-0 at 17:25 when Jack Drury chipped the puck ahead to Stall who scored on a breakaway.Carolina appeared to score during 4-on-4 play with 55 seconds left in the second period, but the goal was waived off after the officials met and determined there was incidental contact with Schmid.",
        "The Hurricanes scored before the end of the period anyway, as Necas caught Schmid out of position on a rebound and made it 4-0 with 15 seconds left.Michael McLeod lost the puck driving to the Carolina net, but it went to Wood, who scored with a one-timer to trim the lead to 4-1 at 3:50 of the third period.The Hurricanes answered with a breakaway goal by Martinook to make it 5-1 at 12:48, and Noesen's goal made it 6-1 at 13:42.--Field Level Media"
    ]
}