{
    "articleURL": "/tvshowbiz/article-12045585/Gold-Dinner-2023-Candice-Warner-steals-spotlight-flaunts-toned-midriff.html",
    "content": [
        "Candice Warner led the celebrity arrivals at this year's prestigious annual Gold Dinner in Sydney on Thursday.",
        "Five hundred of the city's leading philanthropists and VIPs attended the event, which benefits the Sydney Children's Hospital Foundation.The foundation hopes to achieve a double-digit target this year after the charity gala raised $9million last year. This year's Sydney Children's Hospitals Foundation (SCHF) Gold Dinner is set to raise millions to transform complex paediatric care in Australia. The gala will benefit The Children's Hospital at Westmead Kids Complex Care Centre, to be known as the Kookaburra Centre. ",
        "Candice Warner ensured all eyes were on her when she arrived at the Sydney Town Hall in a sleeveless, floor-length ensemble that flashed her toned midriff.The daring red gown highlighted Candice's stunning physique as she happily worked her best angles at the star-studded affair.The former ironwoman had many doing a double take as she unveiled a stunning hair transformation - ditching her blonde locks of old for a deeper caramel hue.Candice allowed her natural beauty to shine through on the night, and accentuated her flawless features with a matte makeup palette.She accessorised her outfit with a gold bangle and golden clam clutch. ",
        "Elsewhere, former New South Wales premier Kristina Keneally was all smiles as she joined a host of celebrities at the event. Kristina looked sensational in a floor-length metallic gold gown at the event that featured a glittering bejewelled collar. ",
        "She completed the look with statement earrings and heels and carried her belongings in a white mesh purse. Kristina wore a glossy makeup palette for the dinner.",
        "Also putting his best foot forward for charity was actor Lincoln Younes who cut a dapper figure in a tuxedo with a classy bow tie. The Last King of The Cross star looked dashing as he posed for awaiting photographers in the black suit. He finished the look with a pair of patent leather shoes. ",
        "Sunrise star Natalie Barr kept her look glamorous in a textured black gown which featured a sweetheart neckline. Nat opted to wear her brunette tresses down and slightly wavy. The TV veteran chose a natural-looking makeup palette for the soirée and finished the look with a pair of drop diamond earrings. ",
        "Meanwhile, Claudia Karvan opted for a black, high-neck dress adorned with colourful patches. The Bump star completed her look with a yellow clutch and kept her makeup palette simple, allowing her beauty to shine through.Television presenter Tristan MacManus also put his best foot forward in a tuxedo. The Studio Ten star was all smiles as he posed in the tailored suit and bow tie. He finished the look with patent leather shoes.  ",
        "Ex-NRL star Cooper Cronk kept his look handsome in a tux alongside wife, Tara Rushton. ",
        "Tara opted for a glittering top and skirt that featured a plunging neckline. She wore her raven tresses down and opted for a dewy makeup style with dark mascara for the evening.  "
    ]
}