{
    "articleURL": "/wires/ap/article-12040047/Suspected-gunman-caught-5-dead-Texas-mass-shooting.html",
    "content": [
        "CLEVELAND, Texas (AP) - A man suspected of killing five of his neighbors in Texas after they asked him to stop shooting his gun near their house hid out just miles away from the slayings while he and his domestic partner plotted his escape to Mexico, authorities said Wednesday.",
        "Francisco Oropeza showered and slept at the house outside the city of Conroe on Tuesday while Divimara Lamar Nava got him donuts from a nearby store, a prosecutor said. Lamar Nava also acknowledged delivering a message from Oropeza to his cousins in the area asking them to help him get out of the country, the prosecutor said at Lamar Nava´s probable cause hearing. The cousins refused to help.Authorities believe Lamar Nava was talking to investigators at the same time she was trying to help Oropeza, San Jacinto County District Attorney Todd Dillon said at a news conference. She initially told authorities she didn't know where Oropeza was, but later told a federal agent that he showed up at the house about 1:30 a.m. Tuesday, according to the prosecutor at the probable cause hearing.Oropeza, 38, was arrested there on Tuesday evening, just 20 miles (32 kilometers) from the city of Cleveland, where the shootings took place. Acting on a tip, authorities found him hiding under a pile of laundry in a closet after a four-day manhunt. Lamar Nava, 53, was arrested at the house on Wednesday.Authorities identified Lamar Nava as Oropeza's wife, though jail records list her as not being married but sharing a home address with him.The slayings Friday sent shudders through a nation already dealing with a wave of shootings that have put the U.S. on a torrid pace for mass killings this year.",
        "Outside the Conroe-area home, yellow police tape could be seen Wednesday in both the front and back, although the officers were gone. Neighbor Angel Lozano recalled looking up from unloading tools from his truck Tuesday night to see unmarked law enforcement vehicles streaming onto his normally quiet street.\"A bunch of people got out with guns and they went straight to the house and surrounded the area,\" Lozano, 39, said Wednesday, estimating that at least 50 officers surrounded the home two doors down from his. \"It was a really fast job they did. They got him without people getting hurt or another shooting.\"Several others have also been arrested, authorities said, although they only shared details about one of them. Domingo Castilla, a friend of Oropeza, was arrested on Tuesday in the Trail´s End neighborhood where the victims were shot, Dillon said. Castilla was charged with marijuana possession but authorities also expect to charge him with obstructing Oropeza´s apprehension, Dillon said.At a news conference Wednesday, San Jacinto County Chief Deputy Sheriff Tim Kean said he couldn´t go into details about the other people who were arrested, including how many.Oropeza was charged Wednesday with five counts of first-degree murder during a court hearing in jail, said San Jacinto County Justice of the Peace Judge Randy Ellisor. Bond is set at $1.5 million per count, for a total of $7.5 million, Ellisor said. Lamar Nava is being held at the Montgomery County jail on a felony charge of hindering the apprehension or prosecution of a known felon. Her bail has been set at $250,000. Bond for Castilla was set at $5,000, Ellisor said.",
        "Oropeza is a Mexican national who has been deported four times between 2009 and 2016, according to U.S. immigration officials.Police had previously spotted him on Monday afternoon in Montgomery County, prompting several schools to lock down, Kean said at a news conference outside the county jail Wednesday.\"We did confirm that was him on foot, running, but we lost track of him,\" Kean said.Kean declined to comment on the tip that led authorities to the Conroe home, which he said was one that had not been previously checked by authorities.The arrest came after authorities set up a widening dragnet of more than 250 people, drones and search dogs from multiple jurisdictions and offered $80,000 in reward money. The tip that finally ended the chase came at 5:15 p.m. Tuesday. A little more than an hour later, Oropeza was in custody, said FBI Assistant Special Agent in Charge Jimmy Paul.Lozano said he hadn't known the residents of the home where Oropeza was arrested but would sometimes say hi to them if they were walking by his house. \"We never thought he was going to be right next door,\" he said.The victims have been identified as Diana Velásquez Alvarado, 21; Julisa Molina Rivera, 31; Jose Jonathan Casarez, 18; Sonia Argentina Guzman, 25; and Daniel Enrique Laso, 9, all from Honduras. Velásquez Alvarado's father, Osmán Velásquez, said she had recently obtained legal residency in the U.S.",
        "Argentina Guzman's husband, Wilson Garcia, survived the shooting. He said friends and family in the home tried to hide and shield the children after Oropeza walked up to the home and began firing, killing his wife first at the front door.When offering a reward for Oropeza´s capture, Texas Gov. Greg Abbott called the victims \"illegal immigrants,\" which drew widespread backlash. His office apologized on Monday.A government official in Honduras said the remains of four of the victims would be repatriated. Velásquez Alvarado will be buried in the United States at the request of her sister and her husband, said Wilson Paz, general director of Honduras´ migrant protection service.Osmán Velásquez said his daughter had traveled to the United States without documents eight years ago with the help of a sister who was already living there.\"Her sister convinced me to let her take my daughter. She told me the United States is a country of opportunities and that´s true,\" he said. \"But I never imagined it was just for this.\"___This story has been edited to correct Kean's title and to note that Wilson Garcia was Sonia Argentina Guzman's husband, not Diana Velásquez Alvarado's.___Merchant reported from Washington. Associated Press reporters Jake Bleiberg in Dallas; Paul J. Weber in Austin, Texas; Mike Wyke in Coldspring, Texas; Marlon González in Tegucigalpa, Honduras; and AP researcher Rhonda Shafner in New York contributed to this report."
    ]
}