{
    "articleURL": "/wires/pa/article-12054553/Crowds-brave-wet-weather-lifetime-event.html",
    "content": [
        "The weather may have been wet, but that did not dampen the spirits of the crowds who lined the streets of London for a glimpse of the new King.",
        "Some had grabbed their spots along the 1.42 mile processional route between Westminster Abbey and Buckingham Palace in the early hours of the morning – wanting a front-row seat when the newly-crowned monarch appeared.Adorned in patriotic clothing, headwear and waving Union flags, many had prepared for the adverse weather, donning ponchos and popping up umbrellas when the rain began mid-morning.",
        "During the long wait for the first procession, members of the public kept themselves entertained with renditions of God Save The King and pop classic Sweet Caroline, while some of the 10,000-strong crowd poured champagne.At Trafalgar Square, there were spontaneous cheers and applause as a portable toilet on the back of a flatbed truck made its way down the street towards Westminster, while along The Mall chants of “you’re not singing over there” were heard and some started a Mexican wave.A small group of anti-monarchist protesters gathered close to the procession route at the top of Whitehall shouting “not my King” – they were met by boos and opposing chants of “God save the King”.The group – many of whom were dressed in yellow waving placards with slogans including “king parasite” and “abolish the monarchy” – stood shoulder to shoulder with royal supporters bedecked in Union flags.",
        "Applause rang out as the public caught the first glimpse of the King and Queen as they left Buckingham Palace in the Diamond Jubilee State Coach around 10.20am.",
        "People clamoured to catch sight of the royal couple as they travelled up The Mall and towards the Abbey.Many people lining the route watched the proceedings from their phones or listened to a live audiofeed of the ceremony.A 3,800-capacity stand near Buckingham Palace was filled with public servants including NHS and social care workers, military veterans and members of the royal household staff.One, Caitlin Adeniyi-Jones – an emergency department nurse at King’s College Hospital in London, said: “It was incredible to see it unfold, fascinating for someone with no knowledge about the fanfare.“We got very wet, but pushed through.”",
        "Cheers rang out from crowds in Green Park watching on big screens at key moments during the ceremony.And many gasped after hearing the gun salute, which occurred at the moment the King was crowned.Those who bagged a spot along the procession route enjoyed an impressive parade by armed service personnel who accompanied Charles and Camilla as they made their way back to Buckingham Palace in the 260-year-old Gold State Coach.The return procession featured the music of 20 different bands from across the Armed Forces.",
        "The King, sitting on the right-hand side of the carriage, smiled and waved at the crowds as he was driven towards The Mall.A military band played God Save The King as he passed by, drowning out a group of protesters shouting “not my King”.",
        "There was one tense moment just after the King and Queen’s carriage rounded the corner from Whitehall into The Mall when one of the horses in the procession appeared to be spooked, rearing backwards into the barriers separating the public from the route.A female police officer appeared to be given assistance from her colleagues, limping away from the area.People in the grandstand near the Palace caught the final viewing of the Coronation Parade as the King and Queen passed by, with many waving and cheering as other members of the royal family were driven past – including the Prince and Princess of Wales and their three children – George, Charlotte and Louis.As the coronation procession finished, the rain over central London eased and royal watchers emerged from hoods and umbrellas.After the procession ended, people lining The Mall were given the opportunity to move in front of Buckingham Palace to see the family as they appeared on the famous balcony, many running to get a spot.",
        "The crowd roared when the royal family appeared, giving the King three cheers.",
        "People watched in awe as the Red Arrows flew overhead in a scaled-down flypast – leaving streaks of red, white and blue in the sky above the palace.Sodden crowds started to disperse after the family left the balcony, but many turned back after the King and Queen came out for a second appearance.Rachel Casey, who travelled up from Surrey at 5am to watch the occasion, summed up the day, saying: “We got wet and cold but it did not matter. It’s a once in a lifetime event.”"
    ]
}