{
    "articleURL": "/wires/reuters/article-12041291/Israeli-Palestinian-Gaza-truce-holds-hunger-strikers-death.html",
    "content": [
        "Death of Palestinian hunger striker triggered fighting",
        "Palestinian militants fired rockets at IsraelIsraeli jets struck in GazaJewish Power party calls Israel's response 'weak'Adnan had been on hunger strike for 87 daysBy Nidal al-Mughrabi and Maayan LubellGAZA/JERUSALEM, May 3 (Reuters) - A truce along the Israel-Gaza border appeared to be holding on Wednesday morning following a brief bout of fighting triggered by the death of a jailed Palestinian hunger striker.After Palestinian militants fired rockets at Israel through the night and Israeli jets struck in Gaza, a ceasefire mediated by Egypt, Qatar and the United Nations appeared to hold as the sides signalled little interest in further escalation.The exchange began on Tuesday soon after the announcement of the death of Khader Adnan, a political leader of the Islamic Jihad faction, designated by the West and Israel as a terrorist group.Adnan had been on hunger strike for 87 days as he awaited trial on security charges. He was found unconscious in his cell and taken to a hospital, where he was declared dead after efforts to revive him, Israel's Prisons Service said.Palestinian leaders accused Israel of causing the death of Adnan, the first Palestinian hunger striker to die in Israeli custody in more than 30 years.In Gaza, armed Palestinian factions including Hamas and Islamic Jihad claimed responsibility for the rocket salvoes fired towards Israel, where one person was seriously injured.",
        "The Israeli military said that in response it attacked Hamas posts and weaponry sites.'WEAK RESPONSE'A 58-year-old man died in northern Gaza city as a result of an Israeli air strike on a Hamas training camp near his house, the Palestinian Health Ministry said on Wednesday.His son Adam, 16, said a brick that flew dozens of yards away from the bombed site hit the zinc ceiling of one room, where he and his father slept and a large stone fell on his father's chest.\"He was unable to breathe properly. We took him to the hospital, they said he suffered an internal bleeding and died at dawn,\" the son said, pointing at a hole in the ceiling and bricks on the floor.Exacerbating tensions in Israeli Prime Minister Benjamin Netanyahu's coalition government, Jewish Power, the party led by far-right police minister Itamar Ben-Gvir, said the strikes were \"a weak response.\"But with explosions rocking Gaza and rocket sirens sending Israelis fleeing to their bomb shelters, residents on both sides were weary of yet another round of fighting.\"The children were terrified. This makes no sense,\" said Gaza resident Sufian Kaskeen.(Reporting by Nidal al-Mughrabi in Gaza and Maayan Lubell in Jerusalem; Writing by Maayan Lubell; editing by William Maclean)"
    ]
}