{
    "articleURL": "/news/article-12048559/Tucker-Carlson-considering-hosting-2024-debate-Trump.html",
    "content": [
        "Ousted Fox News Channel host Tucker Carlson has floated hosting his own 2024 Republican primary debate, The Washington Post reported Thursday What Carlson pitched would be an unsanctioned debate outside the Republican National Committee debate systemHe reportedly took the idea to former President Donald Trump, the current GOP frontrunner, who said he'd be interested in participating  Ousted Fox News Channel host Tucker Carlson has floated hosting his own 2024 Republican primary debate - and has spoken to former President Donald Trump about putting on a candidate forum.",
        "The Washington Post reported Thursday on what Carlson might do next - writing that he would be willing to walk away from millions of dollars still owed to him in his Fox contract to have a hand in the 2024 election cycle. What Carlson pitched would be an unsanctioned debate outside the Republican National Committee debate system. 'He could go straight to the candidates, stream it live, invite the networks but maintain control over the process,' one source said told The Post. Carlson could potentially get Trump to participate, as the far-and-away frontrunner is reportedly already mulling skipping the first and second official primary debates - the first of which is being sponsored by Carlson's former network, Fox. ",
        "On Tuesday, The New York Times reported that Trump doesn't want to give any of his primary opponents equal footing with him, which is why he might eschew the debates, despite participating in all but one of them during the 2016 cycle.The first GOP primary debate is supposed to take place in Milwaukee in August, with a second planned for the Ronald Reagan Presidential Library in Simi Valley, California.The Real Clear Politics polling average has Trump running 29.2 percentage points Florida Gov. Ron DeSantis, who has yet to officially enter the race. 'I'm up by too many points,' Trump said, according to a source of the Times.",
        "A person familiar with Trump's thinking explained: 'In his mind there's not enough candidates who are polling close enough to him. And that if he does a debate this early with candidates who are polling in the single digits, there's no upside for him.' That being said, The Post reported that Trump said he was interested in a potential candidate forum hosted by Carlson. The two men have been trading compliments lately despite messages from the Dominion Voting Systems lawsuit against Fox revealing that Carlson allegedly expressed glee that Trump was soon leaving office after losing the 2020 election.'We are very, very close to being able to ignore Trump most nights. I truly can't wait,' Carlson allegedly said about Trump, according to the lawsuit. 'I hate him passionately,' the Fox host had texted his producer Alex Pfeiffer on January 4, 2021, the suit said. ",
        "When Carlson's messages were released a Fox spokeperson said Dominion was misattributing quotes. 'Thanks to today’s filings, Dominion has been caught red handed again using more distortions and misinformation in their PR campaign to smear FOX News and trample on free speech and freedom of the press,' a Fox spokesperson said. 'We already know they will say and do anything to try to win this case, but to twist and even misattribute quotes to the highest levels of our company is truly beyond the pale.'",
        "Trump seemingly brushed it off and played nice and did a sit-down interview with Carlson last month. Introducing sections of the interview, Carlson told his audience he found Trump to be 'moderate, sensible and wise' and said they'd view Trump's description of a Mar-a-Lago meeting with Chinese President Xi Jinping to be 'remarkably nuanced and even affectionate.'Later in April, Trump only had kind words to say about Carlson post-Fox News dismissal. 'Well I'm shocked. I'm surprised,' the former president said. 'He's a very good person, a very good man and very talented as you know and he had very high ratings.' 'I don't know if it was voluntary or was - somebody fired, but I think Tucker's been terrific,' Trump continued. 'He's been - especially over the last year or so - he's been terrific to me.' "
    ]
}