{
    "articleURL": "/tvshowbiz/article-12046751/Sasha-Attwood-looks-incredible-green-bikini-soaks-sun-Dubai.html",
    "content": [
        "Sasha Attwood looked incredible as she gave her Instagram followers a glimpse into her lavish Dubai getaway as she soaked up the sun in a green bikini on Thursday. ",
        "The girlfriend of England footballer Jack Grealish, 27, looked incredible in a black bikini and matching skirt as she soaked up the sun on a luxury boat. She left her long brunette locks loose as they cascaded past her shoulders from under a coordinated bucket hat.  The WAG looked effortlessly stylish in a bright green bikini top which she teamed with a coordinated white and green woven cardigan and shorts. The model hid behind a pair of chic sunglasses and accessorised with a number of pieces of gold jewellery as she enjoyed a glass of wine for lunch. ",
        "Sasha styled her dark tresses in a stunning half up do leaving two strands down to frame her face. The beauty later snapped a selfie while topping up her tan in the eye catching green two piece as she raised her arm above her head. In another photo, she enjoyed an iced coffee while relaxing on the beach looking out to sea.  The WAG showcased her natural beauty in another photo as she sat by a pool wearing a blue shirt over a white crop top. She rocked a beige woven Prada bucket hat and toted her belongings around in a matching crossbody bag. Sasha looked stunning as she dressed to impress in the evening donning a blue crop top and matching mini skirt. ",
        "She displayed her toned midriff in the number and turned up the heat by adding inches to her frame in a pair of blue knee high boots. The beauty toted her belongings around in a stylish shoulder bag and styled her long tresses loose. ",
        "The model penned: 'Holiday diaries'.Sasha is often spotted supporting her beau Jack from the side-lines and even flew out to Qatar to support Jack play for England at the World Cup, alongside his family.The smitten couple have been dating since they were teenagers after meeting at St Peter's Roman Catholic Secondary School in Solihull.Last year she signed a rumoured multi-million pound deal as the face of cosmetics giant, L’Oreal.Other stars who have also worked for the brand include Julianne Moore, Helen Mirren, Eva Longoria, Jane Fonda, Jennifer Lopez and Penelope Cruz.Sasha's Instagram boasts 167,000 followers and looks set for more companies hoping to work with her on their products."
    ]
}