{
    "articleURL": "/sport/football/article-12057213/Aaron-Ramsdale-reveals-Mikel-Arteta-showed-Arsenal-players-reaction-Newcastle-defeat-season.html",
    "content": [
        "Arsenal's top four hopes were ended last season when they lost to NewcastleAaron Ramsdale says they watched a clip from Amazon as pre-match motivationREPORT: Newcastle 0-2 Arsenal - Arteta's side maintain Premier League title bidAaron Ramsdale revealed Mikel Arteta used footage from last season's defeat at Newcastle to fuel this 'revenge' mission which keeps alive Arsenal's title hopes.",
        "Martin Odegaard's long-range strike and an own-goal from Fabian Schar secured a 2-0 win at St James' Park.A year ago, defeat here cost Arsenal a Champions League place and prompted a furious rant from their manager.It was all caught on Amazon's All Or Nothing series but goalkeeper Ramsdale said: 'It wasn't mentioned until the meeting before we left the hotel - the manager showed us a clip of the documentary last year, showed us all of our faces and staff included, showed how hurt we were feeling. We had the burning desire that it wouldn't be the same today.'He added: 'We are fighting against Man City to do something special, I think it gave us that extra bit when we had to dig deep.'",
        "Arteta explained his thinking, insisting afterwards: 'We had to feel it. It wasn't enough just to talk about it, we had to feel it, to see it, to recognise our faces… that feeling that we didn't do enough on the day, we had to put it right.''The word was pain and then the desire for revenge. I think they had that today in their bellies.'The manager added: 'When you have the emotions we had last year in that dressing room, you have to feel them again, realise how nasty they are and then find a way to approach the game differently because demands were going to be different from last year. The boys did that extremely well so I'm really proud of them.'",
        "The result means Arsenal are now only a point behind Manchester City – albeit having played a game more.They have three matches left – starting against Brighton on Sunday.Arsenal were handed an early reprieve when VAR helped referee Chris Kavanagh overturn a penalty decision against Jakub Kiwior.Newcastle were in charge until then but Odegaard scored minutes after the let-off.'That could have changed the course of the game,' Arteta conceded.Eddie Howe, meanwhile, was left frustrated by his side's failure to take their chances.",
        "'It was one of those days when it didn't go in for us,' the Newcastle boss said.''I don't think there is any time for negativity to creep into my psychology. I am proud of the players. It was a high quality game, it was open but just missing that X-factor.'The defeat means Newcastle missed the chance to cement their top-four place and Howe hinted that he was unhappy with how Kavanagh allowed Arsenal to slow the game down.'There were lots of breaks in play, it very frustrating for us. We have to look at what we can control - that is the referee's job but we have to look at our chances and maybe defending for the goals.' "
    ]
}