{
    "articleURL": "/tvshowbiz/article-12060397/The-Weeknd-wants-real-Abel-Tesfaye-kill-persona.html",
    "content": [
        "The Weeknd may no longer exist.",
        "In the new issue of W Magazine, the 33-year-old artist said that he wants to 'kill off' his music persona.And in the future, the crooner from Canada wants to go by his birth name Abel Tesfaye.'I'm going through a cathartic path right now,' began the ex beau of Bella Hadid and Selena Gomez.'It's getting to a place and a time where I'm getting ready to close the Weeknd chapter,' he declared before adding he will 'still make music, maybe as Abel, maybe as The Weeknd.'",
        "His full birth name is Abel Makkonen Tesfaye, but he came to fame as The Weeknd with the 2016 album Starboy.However, he is done with the moniker. 'I still want to kill The Weeknd. And I will. Eventually. I'm definitely trying to shed that skin and be reborn.'Tesfaye continued, 'The album I'm working on now is probably my last hurrah as The Weeknd. This is something that I have to do. 'As The Weeknd, I've said everything I can say.'And the performer shared that being both The Weeknd and Abel the actor has not been easy on his health.'I had to take off the Weeknd outfit, put on Tedros's wig, shoot with Jocelyn, then go back to being The Weeknd,' he said.",
        "'Then, after the concert, I lost my voice. No voice came out at all. That's never happened before.'My theory is that I forgot how to sing because I was playing Tedros, a character who doesn't know how to sing. I may be looking too deeply into this, but it was terrifying. ",
        "'As The Weeknd, I've never skipped a concert. I've performed with the flu. I'll die on that stage. But there was something very complicated going on with my mind at that moment.'It was not easy for him to step into acting. 'It was a challenge to redo The Idol, and, in truth, I sacrificed my health and home to make it work. So, let's say it comes out and it's f***ing horrible. I still know I did my absolute best. 'From what I've seen, the show is great. Everything is a risk: When you've done the best you can, I would call that a happy ending.' ",
        "W magazine presented to new covers for Volume 3, The Pop Issue, featuring four-time Tesfaye)alongside actress, model, and co-star of the highly anticipated new series, The Idol, Lily-Rose Depp. Shot on two different continents with the help of FaceTime and Zoom, the creative covers ultimately came to life.W Magazine's Pop Issue is on stands May 23.",
        "Lily was also interviewed for the magazine.She said she never thought she would get the part on The Idol.'I knew there would be many lovely ladies who are more musical than me, but I thought, I'll give it a go. 'I wanted to wear pop-star colors, and I wanted to channel a certain L.A. feeling.'I grew up in L.A., and I'm an L.A. girl, and so is Jocelyn. I wanted to capture the style mix of mischief and shine,' said the daughter of Johnny Depp and Vanessa Paradis.",
        "And she talked her inspiration which was Brigitte Bardot.'As a blonde, Jocelyn could be good; she could be evil. You never know. I grew up watching older films, especially French films. Women like Brigitte Bardot have beauty mixed with an 'I don't give a f**k' energy. I wanted that feeling for Jocelyn.'Series director, Sam Levinson, on how the show came to be: 'Abel came to us with a pitch. 'He said something that I'll always remember: If I wanted to start a cult, I could.'What he meant is that his fans were so loyal and devoted that they would follow him anywhere. That was the germ of the idea for The Idol: what happens when a pop star falls for the wrong guy and no one speaks up.'"
    ]
}