{
    "articleURL": "/femail/article-12056875/Kate-Middleton-steps-Coronation-concert-Windsor.html",
    "content": [
        "Kate Middleton, 41, joined the King, Queen and other members of the Royal Family in Windsor for the concert Follow all the latest royal news and updates on Coronation events on MailOnline's live blog hereThe Princess of Wales appeared ready to celebrate in a vibrant ensemble as she joined Royal Family members at tonight's star-studded Coronation concert in Windsor.",
        "Kate, 41, displayed her sartorial flair in an Alexander McQueen suit as she and the Prince of Wales, 40, arrived at the musical extravaganza with their eldest children, Prince George, nine, and Princess Charlotte, eight. Prince Louis, five, didn't attend.The mother-of-three looked typically stylish in the £2,280 number from one of her favourite British fashion brands, which she teamed with a statement diamond necklace.Over 20,000 people travelled to Windsor to witness the star-studded concert celebrating King Charles' Coronation, with Katy Perry and Lionel Richie amongst the headliners performing. Earlier today, Kate and William surprised royal fans at a Big Lunch gathering in the Berkshire town - a day after attending the King's historic Coronation. ",
        "Kate, who was accompanied by her husband, Prince William, looked effortlessly elegant in her Studio 54-inspired suit with flared trousers, vertiginous heels and chandelier-style earrings.She previously wore the Alexander McQueen suit for the launch of an Early Years campaign at BAFTA earlier this year. The Princess’ has long chosen to wear Alexander McQueen for significant moments in her life.She has worn Alexander McQueen – one of her favourite fashion brands – on numerous occasions, most notably choosing its creative director Sarah Burton to design her wedding dress.Meanwhile she also selected the designer for her Coronation gown, which she opted to wear for the ceremony yesterday.",
        "At today's event, she wore her hair in loose waves across her shoulders and opted for neutral makeup, with a sweep of eyeliner and a touch of blusher.  The concert came after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned. A Palace spokesman said the King and Queen were 'profoundly grateful' for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.The King, Queen and royal family have joined around 20,000 members of the public at the musical extravaganza.Heir to the throne William took to the stage to deliver a speech during the event in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, saw Hollywood star Tom Cruise and adventurer Bear Grylls appear via video message.The series of pre-recorded sketches revealed little-known facts about the monarch. There were also performances by Paloma Faith, Olly Murs, veteran singer Steve Winwood - whose grandson Arthur Eliot was one of Camilla's pages of honour - and Nicole Scherzinger of The Pussycat Dolls.",
        "Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang performed too.",
        "The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art all came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Thousands of street parties have been held across the country with people encouraged to come together for the Coronation Big Lunch.Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.Meanwhile, Camilla asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.The simple posy, including auriculas, the late Queen's favourite lily of the valley, and one of Charles' favourites hellebores, by the King and Queen's go-to florist, Shane Connolly, was laid at the memorial.Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother.Camilla did not carry the flowers on Saturday as it was a coronation not a wedding, the Palace said."
    ]
}