{
    "articleURL": "/wires/ap/article-12049483/Listen-ways-Blind-walkers-winning-safer-road-crossings.html",
    "content": [
        "CHICAGO (AP) - After a retinal disease left him legally blind, architect John Gleichman was struck by a taxicab while walking home near Chicago's Lincoln Park Zoo - at the same intersection where a 4-year-old girl was killed by a hit-and-run driver years earlier.",
        "Although Maya Hirsch's death in 2006 ignited a citywide crusade for pedestrian safety improvements, almost all the electronic upgrades since then have been for people who can see. Nearly 3,000 Chicago intersections are now equipped with visual crossing signals, yet fewer than three dozen include audible cues.A federal judge ruled in March that such disparity in the nation's third-largest city violates the Americans with Disabilities Act, a second landmark victory for blind residents who challenged the accessibility of a major city's signalized crosswalks.\"Every time I go out to go downtown for a meeting, I have to think I could get hit today and not make it home,\" said Gleichman, 65, who has been struck four times times by vehicles while navigating the city with his white cane since being diagnosed as legally blind in 2005. He considers himself fortunate to have escaped serious injury each time.Future court proceedings could decide how many audible crossing signals Chicago must install, but a similar case in New York City suggests it could be substantial. A federal judge there appointed an independent monitor and in December 2021 gave officials a decade to gradually make at least 10,000 of its approximately 13,000 signalized intersections accessible to blind pedestrians. It´s already well ahead of schedule.",
        "\"It's been huge progress. It's a game-changer to the blind and visually impaired community,\" said Terence Page, president of the Greater New York Council of the Blind. \"As new cities begin to build infrastructure, we want accessibility to not be an afterthought but work in parallel with the upgrades.\"",
        "Accessible pedestrian signals, known as APS, have been around for decades, though the technology has evolved.Many of Chicago's few APS-equipped intersections - including on a busy street outside The Chicago Lighthouse, which provides services to blind and low-vision residents - still rely on beeps or cuckoo chirps to announce when it's safe to cross. Newer models actually speak the words \"walk\" or \"don't walk,\" and feature tactical buttons to clarify directions so blind pedestrians don't stray into traffic. Some also convey the time remaining before the light turns red.Sandy Murillo, a lifelong Chicago-area resident who was born with glaucoma and lost her sight at age 2, said she didn't even know about APS until she heard a strange voice say \"walk\" during a childhood family trip to Southern California.\"That kind of made it dawn on me,\" said Murillo, who produces a radio show for The Chicago Lighthouse and writes a blog on issues facing the blind community. \"I thought, 'Oh, so that's what it is. They're there for people like me.'\"",
        "Chicago's Department of Transportation declined to comment on the judge's ruling, citing the ongoing litigation. But spokesperson Erica Schroeder told The Associated Press in an email that APS devices are installed at 35 intersections and \"under construction, in design, or in procurement\" at more than 150 others.The department estimates a $50,000 to $200,000 price tag per intersection to install APS. Grant money is available through the 2021 federal infrastructure law to help cities defray some costs.Advocates for Chicago´s blind residents say they pushed the city for years to add APS with little success before taking legal action.Kathy Austin, a community engagement specialist at Second Sense - a downtown organization serving blind residents - recalls a meeting in 2017 or 2018 in which she and others in the blind community presented a list of the most dangerous intersections, only to be told by city officials that APS was too difficult to install in many of those places.\"There was a laundry list of excuses,\" Austin said.Blind residents know from their mobility training to wait to hear the sounds of parallel traffic before crossing a street. That´s often difficult in noisy downtowns like Chicago´s with its overhead L trains stations and other ambient noises. Then, when the pandemic hit and downtown traffic steeply declined, they encountered the opposite problem - not enough vehicles or even people around to help decipher when to walk or stop.",
        "\"Sometimes I would stand at an intersection for like half a minute and no car would come by,\" Gleichman said. \"So you either ask somebody walking by, `Do I have the light?´ or you just go out in the road and hope you don´t get hit.\"London-based Waymap, which created a smartphone navigation app for blind pedestrians that Washington, D.C.´s subway system uses as an accessibility tool, found in a study that blind people average just 2.5 regular routes - such as from home to the office or grocery store and back - if they use a cane or 3.5 if they use a guide dog. Celso Zuccollo, Waymap´s chief operating officer, said the study found that people who lack independent mobility were far more likely to experience depression.Maureen Reid, a job-placement counselor at The Chicago Lighthouse, said she feels more comfortable than many of her blind friends moving about the city because of her familiarity with its sidewalks and the help of her guide dog, Gaston. But she acknowledges there's room for numerous safety improvements - including more tactile strips at pedestrian crosswalks and transit stations. Her previous dog slipped off a platform edge at an L station and dangled from his harness over the commuter train track as Reid yelled for help. The dog was unharmed.",
        "San Francisco voluntarily entered a settlement with blind residents nearly two decades ago to add APS, and numerous other U.S. cities as well as the state of Maryland require it, said Torie Atkinson, senior staff attorney with Disability Rights Advocates, which represents plaintiffs in both the New York and Chicago cases.Matt Baker, vice president of sales and marketing at Greenville, Texas-based Polara, a leading manufacturer of APS products, said the Chicago market has been one of the toughest to crack - with just a few intersections equipped with Polara devices. Baker said that could change due to the court ruling and expectations that the federal board reviewing public right-of-way issues will eventually require APS at most new or rebuilt signalized intersections nationwide.Either way, Chicago will almost certainly be compelled to include the technology in future construction. Atkinson said the Chicago verdict expanded on the New York ruling in several key areas, reinforcing the need for Chicago to equip all its signalized intersections with APS.\"I would genuinely hope these lawsuits are a wake-up call,\" Atkinson said."
    ]
}