{
    "articleURL": "/wires/aap/article-12052057/Port-big-guns-return-clash-against-Essendon.html",
    "content": [
        "Port Adelaide coach Ken Hinkley says the return of two big guns doesn't minimise the challenge presented by a \"different\" Essendon.",
        "Power captain and fullback Tom Jonas and spearhead Todd Marshall return from suspension and concussion respectively for Sunday's Adelaide Oval clash against the Bombers.Port have had little difficulty defeating Essendon recently, winning their past three encounters by a total of 154 points.But Hinkley says the Bombers under their new coach Brad Scott present a different proposition.\"They are playing a really aggressive game of football,\" Hinkley said.\"We know the challenge that is in front of us ... they are a significant part of the competition this year.\"Brad is certainly coaching a more defensive team than Essendon have been in the past, they're defending the game a bit harder.\"It is a different style of football you are going to face from Essendon this year.\"Hinkley's Power started the round in fifth spot and on a streak of four consecutive victories.The winning stretch has coincided with Hinkley coaching at ground level, rather than from a box in the grandstand as he had in his previous 217 games at the helm of Port.But Hinkley dismissed as \"unaware and uneducated\" suggestions he had relinquished tactical control to his assistant coaches in the box.\"(It's wrong) if you think that is how it operates, by a coach being on the ground that there are any less conversations going on between the coaching staff,\" he said.",
        "\"You need to remember that people try to identify one person, the head coach usually, as the only part of that conversation.\"It has never been that way, whether I am up in the box or down on the ground.\"Hinkley lost wingman Xavier Duursma to a knee injury and dropped Ollie Lord to pave the way for the return of Jonas and Marshall.The Bombers, who began the round in ninth spot with four wins and three losses, recalled ex-captain Dyson Heppell for Sunday's early fixture.Goalsneak Alwyn Davey Jr, Jye Menzie, and Zach Reid have also been added to a team missing the suspended Sam Durham."
    ]
}