{
    "articleURL": "/wires/reuters/article-12049681/Chemicals-maker-Clariant-misses-Q1-profit-forecast-low-volumes-weigh.html",
    "content": [
        "Q1 EBITDA from continuing operations down 24%",
        "Reports slower growth in consumer &amp;amp; additive segmentsSees China demand picking up(Adds comments on pricing, China, share move; paragraphs 2, 4, 8-11, 12)By Marta FrackowiakMay 5 (Reuters) - Swiss specialty chemicals maker Clariant missed first-quarter profit expectations on Friday as customers cut inventories and demand softened in some business areas.The company, which has increased its prices by 7% year-on-year and by 2% since the fourth quarter, said the hikes were not enough to fully offset weaker sales volumes.Clariant warned this year that a soft recession in the first half of the year and one-off payments would weigh on annual sales as it, like many European chemicals firms, grappled with cost inflation.The group said input costs eased in the first quarter from the prior one. However, it flagged slower growth in the consumer-facing care chemicals segment due to destocking, and challenging market conditions in its additives business.The group's core profit (EBITDA) from continuing operations fell 24% to 167 million Swiss francs ($189 million) in the first quarter, below the 176 million Swiss francs expected by analysts in a poll provided by the company.It cited a hit of 13 million Swiss francs due to operational issues at its Sunliquid plant in Romania and a negative one-off fair value adjustment of 11 million francs for the Heubach Group participation.",
        "Its quarterly EBITDA margin fell to 13.9% of sales, missing analysts' estimate of 14.6%.Clariant, whose additives are used in smartphones and electric vehicles (EV), saw a decline of 16% in Chinese volumes in local currency, as people freed up from their homes after the easing of COVID-19 curbs spent less on durable goods.It also said the Chinese subsidy program for EV purchases ended at the end of last year, triggering a slowdown in the first quarter.\"We do not think this will persist, though,\" said Chief Executive Conrad Keijzer, as demand balances and new stimulus is introduced.China accounted for 10% of Clariant's sales in the first quarter.Shares fell as much as 2% at the market open before paring losses. ($1=0.8838 Swiss francs) (Reporting by Marta Frackowiak and Linda Pasquini; Editing by Milla Nissi and Clarence Fernandez)"
    ]
}