{
    "articleURL": "/wires/pa/article-12055225/Eddie-Howe-praises-Callum-Wilson-response-Newcastle-squad-rotation.html",
    "content": [
        "Newcastle boss Eddie Howe has praised Callum Wilson’s emphatic response to the challenge presented to him by record signing Alexander Isak.",
        "The 31-year-old England striker has plundered eight goals in his last seven games, four of them from the bench with Howe having rotated the former Bournemouth frontman and his £60million summer capture in the face of a gruelling schedule.Wilson, whose form was questioned in some quarters following his return from the World Cup finals, has twice been rested in the game after scoring two goals as a starter, but has channelled his frustration in exactly the way Howe hoped he would.The Magpies’ head coach said: “He is certainly in great form. He is very focused at the moment. He knows he has to be because of the competition he has around him.“The biggest compliment I can pay him is that he has always been himself – bubbly, bright, laughing, joking, a really positive character. He is someone that the squad needs to be positive, because he is such a big personality within it.“That has helped him when he has come on the pitch and delivered for us. I’m delighted for him, personally, because he can react two ways to that challenge laid down to him – and he has responded how I hoped he would.”",
        "Wilson made two appearances for his country as a substitute in Qatar without finding the back of the net, and went eight games without a goal on his return.",
        "However asked if it had been foolish to question his ability to continue as the club’s main marksman at that point, Howe said: “It’s natural at this elite level that players are under scrutiny. Their performances are broken down to the ninth degree, and not just by me as the manager, but also by you guys in the press.“I think he will understand that comes with the territory at this level.”Wilson, who helped himself to a double in last Sunday’s 3-1 win over Southampton after being introduced as a second-half substitute, will hope for a chance to repeat the feat against high-flying Arsenal this weekend with Newcastle hoping to ease themselves closer to Champions League qualification.Beyond that, a continuation of his current form could yet earn him a return to the England squad.Asked about his international prospects, Howe said: “That is one for [manager] Gareth [Southgate], but he is certainly doing everything he needs to do. He is scoring goals and that is always going to get you in the headlines.”"
    ]
}