{
    "articleURL": "/wires/ap/article-12042549/Ancient-Knights-Malta-gets-nonaristocratic-head.html",
    "content": [
        "ROME (AP) - A Canadian lawyer who found his vocation caring for AIDS patients in Harlem was elected the grand master of the Knights of Malta on Wednesday, the first non-European and first non-aristocratic head of the ancient lay Catholic order that provides humanitarian aid around the world.",
        "John Dunlap, 66, was elected by an absolute majority of 99 voting members of a Knights body known as \"the council complete of state.\" He immediately informed Pope Francis of his election and was sworn in during a pomp-filled ceremony and procession Wednesday at the Knights´ magnificent villa on Rome´s Aventine hill.The election brings a hoped-for end to a tumultuous few years during which Francis intervened to remove a previous grand master as a result of a governance crisis. Francis then imposed a new set of constitutional reforms on the order, and appointed Dunlap as interim head, in ways that critics said threatened its sovereignty.The Knights of Malta is an ancient chivalric order and sovereign entity that runs hospitals and clinics around the world. It counts 13,500 knights, dames and chaplains, 80,000 permanent volunteers and 42,000 employees, most of them medical personnel who lend first aid in areas of natural disasters and conflict zones.As a sovereign body under international law, the Knights have diplomatic relations with more than 100 countries, which facilitates the delivery of humanitarian aid in war zones and conflict areas. The group participates in the U.N. and other international organizations as an observer state.The order experienced a governance crisis in 2016-2017 sparked by a condom distribution scandal that resulted in Francis ousting the then-grand master and imposing years of Vatican-mandated constitutional reforms. Last year, a now-former top leader of the Knights warned that the proposed reforms risked the order's sovereign status since they implied the Knights were a subject of the Holy See.",
        "The distinction matters to the order because the Knights count on their reputation as a sovereign neutral player to gain access to crisis-hit areas that might be denied to other humanitarian groups.During a recent conversation with journalists before the election, Dunlap denied the Vatican intervention posed a risk of creating confusion or had negatively impacted the Knights' ability to maneuver in conflict zones.\"Absolutely not,\" he said, adding that during the years of turmoil, the Knights had actually opened diplomatic relations with four new countries and that 11 ambassadors from countries that don´t have diplomatic relations showed up for his New Years' greetings this year.\"We´ve had no country that withdrew their ambassador,\" Dunlap said.Dunlap´s election to a 10-year term ends a period of change that including the election of a new governing body in January and the approval of a Vatican-mandated constitution in September.Dunlap´s election was the first under the new constitution, which allows the election of a grand master - the order's head of state - without noble lineage and removes the requirement that he serve for life. The reforms were deemed necessary to broaden the pool of potential leaders down the line.Dunlap was born in Ottawa and practices law in New York. He found his vocation to the Knights in the 1980s while volunteering with AIDS patients at the Cardinal Cooke Medical Center in Harlem, where he has continued to volunteer."
    ]
}