{
    "articleURL": "/news/article-12049575/Masked-man-robs-fast-food-drive-axe-Ingham-restaurant-Queensland.html",
    "content": [
        "Masked man robs drive through restaurant He walked up to the sliding window with an axe The robber pretended to be riding a motorbike A masked man brandishing an axe has robbed a drive-through restaurant after pretending to be a motorbike rider with the bizarre incident captured on CCTV. ",
        "The man was videoed walking up to the sliding windows of the business on Herbert Street, Ingham in North Queensland at 2am on Thursday.He then made gestures in front of one of the windows before approaching another and making off with a wad of cash from the till.Queensland Police released vision of the armed robbery in a bid to find the culprit after patrols failed to locate the man in the area.The footage shot from two different angles first showed him with a black, full face covering approaching one of the windows where cars pull up to order food. ",
        "He was seen with blue plastic gloves doing motorbike handlebar gestures after failing to slide the restaurant window open. The robber, who was sporting a black jumper, blue cargo pants, work boots and a black and white Jack Daniels cap, then shrugged and walked away to another window.He then slid it open before removing an axe from under his jumper and demanding cash from a worker in the store. The figure was then seen trying to squeeze through the window but he was stopped by the barriers set up. The man stretched his arm across into the store in a desperate grab for cash and took out a wad of notes before fleeing on foot. ",
        "He was spotted running down Herbert Street towards Gedge Street. Two staff members in the restaurant complied with the man's demands and were physically unharmed.Investigators are appealing to the public to help identify the man who officers described as Caucasian in appearance with a solid build.Detectives also urged businesses and motorists in the area to check dashcam and CCTV of vision captured between 130am to 230am. "
    ]
}