{
    "articleURL": "/wires/aap/article-12040277/Lee-Green-lead-Australia-LPGA-Tours-team-event.html",
    "content": [
        "History-maker Minjee Lee and in-form Hannah Green will lead a strong Australian line-up as the International Crown teams event returns to the LPGA Tour schedule.",
        "After a five-year absence because of the pandemic, the event is being staged this week at San Francisco's TPC Harding Park, the site the 2020 PGA Championship.The women's tour are playing the course for the first time and, fittingly, it's a crack field.Represented by world No.1 Nelly Korda, Lexi Thompson and Danielle Kang and newly-crowned major champion Lilia Vu, the Americans are top seeds.South Korea, made up of Jin Young Ko, Hyo Joo Kim, In Gee Chun and Hye Jin Choi, are second seeds.Australia are seventh seeds, with world No.6 Lee, the 14th-ranked Green, fresh off her weekend victory at the LA Championship, supported by Steph Kyriacou and Sarah Kemp, who finished tied for 14th in Los Angeles on Sunday.The other nations in the eight-team field are Japan, Sweden, England, Thailand and China.The tournament features four days of four-ball competition, with the semi-finals and final all staged on Sunday.Lee has contested all three previous editions of the event and, at 18 years, one month and 27 days, was the youngest competitor in the tournament's history when she teed it up in 2014 as an amateur.The reigning US Open champion likes the format changes in 2023, when each encounter comprises two singles matches and one foursomes match.",
        "\"I think it'll be a little bit more exciting. I know the foursomes is now one of the matches that they get to play, foursomes and singles,\" Lee said.\"It'll just be a little bit different because the teams can really figure out who will gel together better and maybe there will be a better strategy for the last day.\"The winning team will claim $US500,000 ($A750,000) of the $US2 million ($US3 million) purse.Australia's best result so far has been sixth in South Korea in 2018."
    ]
}