{
    "articleURL": "/wires/afp/article-12040219/At-75-Israels-economy-offers-success-inequality.html",
    "content": [
        "Now 75 years old, Israel models itself as an economic success story, a leader in business, agriculture and advanced technologies -- despite glaring inequalities that have left many Israelis behind.",
        "The country readily describes itself as a \"start-up nation\", and its per capita GDP is higher than that of Germany, France or Britain.But \"there is the start-up nation and the soup kitchen nation,\" says Gilles Darmon, the head of Latet, an Israeli non-profit group working to fight poverty and deliver food aid.According to Darmon, almost 10 percent of families among Israel's population of 9.7 million face \"severe\" food insecurity.The economy offers two opposing images, he said, one side centred on Tel Aviv's hi-tech industries \"where in terms of prosperity you have to be in the richest cities in the world... and on the other side more than 312,000 families are in a situation of severe food insecurity\".",
        "To highlight its commercial successes, Israel, a nation born on May 14, 1948, can point to enviable economic performances.Growth was 6.5 percent in 2022, down from 8.6 percent in 2021 but well above the OECD average of 2.8 percent, and the budget deficit largely contained.Israel's cyber security work has made the sector one of the economy's driving forces, with companies such as Check Point establishing themselves as global leaders in IT security.- 'Commando spirit' -The eastern Mediterranean country is also at the forefront of innovation in biotechnology and agriculture, with firms such as Netafim, which first developed irrigation technology in the Negev desert in the 1960s and grew to supply agribusiness worldwide.",
        "The weapons industry remains an important component of the economy, with Elbit Systems, Israel Aerospace Industries and Rafael Advanced Defense Systems competing for lucrative international arms contracts.Israeli expertise is also found globally in many hi-tech corporations, said Daniel Rouach, president of the Israel France Chamber of Commerce.\"There is Israeli know-how in the components that are found in large multinationals like Intel or Google,\" he said.Waze, a much-used car navigation application, was an Israeli enterprise before Google acquired it.Rouach said these successes stem from Israel's entrepreneurial mentality, \"a commando spirit which consists of maximum use of allocated budgets in minimum time with sometimes enormous risk-taking, the only parameter being the goal to reach\".",
        "But on the margins of this success, which is visibly represented by sprawling housing estates of opulent villas in central Israel, the reality is less flashy.In Shimshon, a suburb of the coastal city of Ashkelon, stand long rows of decrepit concrete buildings.Hastily built in the late 1950s to accommodate massive immigration, mostly from North Africa, they are now largely occupied by Ethiopian and Russian migrants, without having seen significant renovation.- Food or medicine -Yellow facades are strewn with drying clothes hanging from small balconies black with grime, and paper litters back yards.",
        "\"We are all in trouble. The whole neighbourhood! We are barely surviving on public assistance benefits,\" said 73-year-old retiree Esther Benhamou, as she painfully climbed the steps to her apartment.\"I have to choose: eat or buy my medicine,\" she added, once inside her sparsely furnished living room.More than 27 percent of Israel's population lives in poverty, according to figures published by Latet at the end of 2022.And Israel has the third highest poverty rate in the OECD, behind Bulgaria and Costa Rica.\"In just over 30 years, we have gone from one of the most egalitarian societies in the world... to a highly unequal and individualistic society\", Darmon said.",
        "\"The state has ceased to ensure its role, to mitigate the effects of the market and to redistribute wealth.\"Many charitable organisations are working to meet the needs of the poorest. In Kyriat Malakhi, a small town in southern Israel, Nikol Jibril, 72, has provided meals to those in need for 30 years.One of a dozen volunteers in a kitchen, she said the poverty \"situation is only getting worse\".\"As soon as you help a family get out of it, another one arrives,\" she said. \"It never stops, there are always more who are sent to us.\""
    ]
}