{
    "articleURL": "/tvshowbiz/article-12059051/Chloe-Madeley-set-star-reality-mother.html",
    "content": [
        "Chloe Madeley is set to star in her own reality show about the ups and downs of first-time parenthood. ",
        "The fitness trainer, 35, who welcomed daughter Bodhi, nine months, with husband James Haskell, 37, in August 2022, will speak candidly about motherhood.Chloe, whose parents are daytime television royalty Judy Finnigan and Richard Madeley, will also talk about her fitness journey back into her day job.According to the Sun, filming for the four-part ITVBe series has now begun, with Chloe and James opening up their home to cameras as they go about their lives.A source said: 'Chloe is a natural on TV and she and James together are great fun. As well as all the trials and tribulations of parenthood, expect Chloe to open up on her mental health and to share her postpartum journey back to fitness so she can continue her career as a personal trainer, while James juggles life on the road with his ­punditry work and podcasts.'",
        "The television insider revealed that execs hope doting grandparents Richard and Judy will make a cameo in the series, which is as-yet untitled.It is the latest fly-on-the-wall documentary about motherhood, following in the footsteps of shows such as The Mummy Diaries.The source admitted that bosses are hoping Chloe's show attracts a new audience as they work with new talent including Giovanna Fletcher and Kelsey Parker.Giovanna's show for the broadcaster was titled Made In Italy while Kelsey's was called Life After Tom.",
        "It comes after Chloe candidly discussed her postpartum journey on her Instagram.The fitness guru admitted she had no sex drive after giving birth and only regained her libido after she stopped breastfeeding and her cycle returned.Answering a fan who was concerned about their lack of sex drive after three months postpartum, Chloe reassured them that it was 'very common'.She said: 'If you're breastfeeding and or haven't started your menstrual cycle yet this is very common. It's down to low levels of oestrogen and also prolactin circulating the body.Revealing when her own sex drive returned, she said: 'I reduced BF and after a week or 2 knew my cycle was coming back because my libido reappeared.'",
        "Alongside the message, she shared a sweet snap of her breastfeeding her daughter. It comes after Ann Widdecombe hit out at James in March after he revealed that his wife had to leave him a list detailing how to look after their daughter.Appearing on Jeremy Vine On 5, James revealed that he looked after Bodhi, then six months, alone for the first time over the weekend and shared how it went.He gushed that it was 'amazing' and said he had done a 'good job' but admitted that Chloe deserved some of the credit because she left him a parenting 'roadmap'.",
        "However, Ann, who was a panelist on the debate show, was left less than impressed as she slammed James for needing a 'list' to complete his parenting duties.James had explained that Chloe had given him a 'point-by-point list' detailing how to look after their baby.Speaking via video link, he said: 'I was left to look after Bodhi for the first time this weekend on my own. How was it? I'm still around, I haven't lost my mind. She was amazing.'But do you know why right? I'd like to say it's all because of me and my genius but my wife is so organised she wrote me a point-by-point list, a roadmap if you will, that I followed to the letter and absolutely smashed it. ",
        "'First night, bathed her, fed her, creamed her up, put her down. She had a meltdown around 45 minutes later, fed her, put her to bed, white noise on, and she was gone.''I've done such a good job, Chloe suggested I do it a bit more often,' James added, with a wide-eyed concerned look on his face.Returning to the studio, host Jeremy was seen laughing at his comments before asking Ann for her opinion.To which Ann fumed: 'I'm not at all impressed. If your wife had to make a list saying bath, feed, put to bed, cream. Uh honestly! Don't you know that by now?' "
    ]
}