{
    "articleURL": "/wires/reuters/article-12042731/Jon-Jones-retire-soon-Francis-Ngannou-piques-interest.html",
    "content": [
        "Jon Jones envisions he has one last fight left, although there is one potential battle that could change his mind.",
        "The UFC heavyweight champion is expected to make his first title defense against former champ Stipe Miocic in November at Madison Square Garden in New York.While Jones (27-1) is keeping tabs on Miocic (20-4), he also has an eye on perhaps one more bout -- this one against former heavyweight champion Francis Ngannou.\"Right now, my goal is to have one more big fight against Stipe Miocic, Madison Square Garden and then kinda hang it up from there,\" Jones told Fox Sports Australia.Jones, 35, returned from a three-year absence to capture the UFC heavyweight title from Ciryl Gane via submission in the first round at UFC 285 in March. Defeating the 40-year-old Miocic would provide the icing on the cake for a stellar career, Jones contends.\"I think the Stipe fight will be plenty for me,\" Jones said. \"I feel like I don't really have much to prove after beating Stipe Miocic. I've been in the game a long time and in fighter years, I'm an old guy. I've been training for a long time, I've been in the game for a long time and got some small injuries -- I just really want to be around.\"Be around for my family, be around for my kids. I want to be able to play with my kids, and have a good head on my shoulders, and have joints that work. So I can see it coming to an end really soon, and I'm happy with that. I'm really proud of my career.\"",
        "Miocic held the heavyweight crown from May 2016 to January 2018. After losing the belt to Daniel Cormier in July 2018, Miocic won it back in a rematch in August 2019, then beat Cormier again in August 2020.Miocic lost the championship to Ngannou in March 2021 and hasn't fought since.While Jones dismissed promising UFC heavyweight Sergei Pavlovich as a worthy contender in terms of status, the former did acknowledge that a fight versus Ngannou could motivate him to stick around. Ngannou, 36, is moving into boxing after his UFC contract expired in December.\"I do believe a Francis Ngannou fight would be worth entertaining not retiring,\" Jones said. \"I think a Francis fight would come with some serious revenue and that would make it worth my while. Francis is a former champion. He's pretty damn popular here in America and across the world. He's very well known. It would bring in a lot of money and for that I would be willing to come back.\"--Field Level Media"
    ]
}