{
    "articleURL": "/travel/article-12053681/Can-havent-Covid-jab-Holiday-Guru-tackles-travellers-questions.html",
    "content": [
        "READ MORE: Ex-flight attendant reveals disgusting things she's seen in a cabinThe Holiday Guru is here to answer travellers' questions.",
        "This week he tackles queries around the new Covid rules for travelling to the US, the Passport Office strikes, the best books for planning an Interrailing trip, easyJet's hand luggage allowance, and more...Q. I have not been vaccinated against Covid, which has meant I have been unable to visit the United States recently. It’s my favourite country and I love New York City. I hear that the rules are changing, so can I now go?Anne Summerville, GlasgowA. Yes, from Friday you will be able to visit the States whether you’ve been vaccinated or not. This coincides with the US declaring its ‘public health emergency’ regarding Covid is over. The Biden administration says: ‘We are in a different phase of our response to Covid-19 than we were when many of these requirements were put into place.’",
        "Q. Could you confirm that travel to America using an Electronic System for Travel Authorisation (ESTA) is possible if you have visited Cuba before January 2021? There has been confusion about this.Jen Smith, via emailA. If your trip to Cuba was before January 12, 2021, you will be able to get an ESTA (which costs about £17). However, if it was after, then you will need to apply for a tourist visa, which costs about £130. Further information is available at the USA travel page at gov.uk.",
        "Q. What is the latest on the Passport Office strike?Jennifer Bloom, SouthamptonA. Thankfully, the strike over pensions and pay ended on Saturday. The Passport Office says it has been meeting its ten-week target for applications despite the industrial action, but it should now be easier to book in-person appointments for fast-track passports.Q. When are the next train strikes?Mrs Daniels, ManchesterA. The National Union of Rail, Maritime and Transport Workers (RMT) plans to walk out on Saturday, which will hit those planning to visit Liverpool for the Eurovision Song Contest. The Associated Society of Locomotive Engineers and Firemen (Aslef) will be striking on Friday and then on May 31 and June 3, the latter being the date of the FA Cup Final at Wembley Stadium.Q. I’m looking to travel to Turkey in mid-August and for a week in September. My children’s passports expire in May 2024. Is there enough time or will I have to renew them?Emma Pearson, via email",
        "A. The rules are you must have 150 days’ validity on your passport from the day you arrive in Turkey. You must also have at least one page blank for exit and entry stamps. See entry requirements for Turkey at gov.uk.Q. I am thinking of going on an Interrail trip. Can you recommend a book for routes?",
        "Daniel Thomson, WarringtonA. Europe By Rail: The Definitive Guide, by Nicky Gardner and Susanne Kries, covers 50 great journeys (Hidden Europe Publications). It would also be good to get a copy of Rail Map Europe, which shows rail lines (europeanrailtimetable.eu).Q. We’re flying from Bristol to Alicante with easyJet, but we are confused about the hand luggage allowance. EasyJet says measurements are 45cm by 36cm by 20cm, but our bag is 47cm by 20cm by 36cm. Is this OK? Also, can I take my handbag, too?Sylvia Courtney, via emailA. Your bag would be too big under easyJet’s rules and you wouldn’t be allowed an additional handbag. See easyjet.com.WE’RE HERE TO HELPIf you need advice the Holiday Guru is here to answer your questions. Email us at holidayplanner@dailymail.co.uk."
    ]
}