{
    "articleURL": "/wires/pa/article-12047211/Royal-superfans-camping-ahead-coronation-history-making.html",
    "content": [
        "Royal superfans camping out ahead of the coronation are wearing thermals to keep warm and organising shifts to keep their front-row seats to see “history in the making”.",
        "Alongside the tents lining The Mall, Union Flags are draped next to cardboard cut-outs of the late Queen and the occasional inflatable corgi.Their occupants will be close to the action when the coronation procession leaves Buckingham Palace for Westminster Abbey on Saturday.",
        "Clutching a small King figurine, Jenny Smart, from Chiddingfold, Surrey, said: “I’m having a really good time actually. Just taking part in the atmosphere and so I came last night to check it all out. But I came this morning to set up my camp.“The coronation in a way doesn’t mean anything because he’s already our King. He’s already acceded to the throne the moment the Queen died, so actually the coronation doesn’t mean anything. It’s just an enjoyable event and ceremony.“The country I would say is very split between monarchists, anti-monarchists and those who are somewhat indifferent.“So I think for a large part of the country it’s just a nice extra holiday, but there’s certainly a very strong contingent who love everything royal and are doing crazy things like this.”",
        "Alyssa Whaanga, 23, who is originally from New Zealand but lives in London, said she was part of a “really committed” shift system of 20 people.Friends through the Church of Jesus Christ of Latter-Day Saints, the group had been working in shifts since Tuesday to keep their spot.",
        "She said: “I’m going to be here until the coronation for the next two nights, so we’ve got our tents set up here and food supplies coming.“People coming in shifts also, so we’re really committed to it. There’s like 20 of us coming but we’re all coming at different times. Most people will be here on Friday because people have jobs and a life.”",
        "Ms Whaanga added she had also enjoyed meeting the other campers, even though she and her friends were younger than many of their neighbours.She said: “You meet some really cool people, super diverse.“There is a bit of an age demographic going on, so you’ve got to, you know, represent the young’uns.”Gwenda Griffiths, from Swansea, South Wales, was also sharing the experience with friends, who she made at the late Queen’s funeral.Ms Griffiths, a nurse, also visited the capital for the jubilee celebrations last summer and has tickets for the coronation concert in Windsor on Sunday.",
        "She said: “Various friends I made at the Queen’s funeral are joining me later today, hence why we’ve taken up so much space.“Then on Sunday, we’ve been fortunate enough, my sister and I, to get tickets in the ballot for the concert at Windsor Castle. So we’re fully doing the full shebang.”",
        "Although Ms Griffiths said she was “very much” looking forward to the big day, she said the weather had been tricky and she had a raincoat packed for Saturday.She added: “It was very cold last night. But thermals, woolly hat – the only thing I took off was my shoes.”Braden Miller, 17, flew for 10 hours to visit London with his mother Rebecca, from Vacaville, California.",
        "The mother and son have also reunited with a friend they met while camping out for the jubilee last summer.Mr Miller, who is staying on The Mall until Saturday morning, predicted a rise in popularity for the royal family.He said: “I’m looking forward to seeing them on the balcony. It’s a new era really. So I’m really looking forward to seeing history in the making.“I think the royal family is always changing, people’s perception of it is always changing.“I think we’re going to see a growth in popularity honestly, when it comes towards like William and Catherine.“I know a lot of people don’t like Charles and Camilla but I think they’ve really grown on people and clearly a lot of people love them here.”"
    ]
}