{
    "articleURL": "/news/article-12046561/Top-Democrat-Katherine-Clarks-transgender-daughter-gets-PROBATION-hitting-cop-face.html",
    "content": [
        "Katherine Clark's daughter was arrested at an Antifa protest in January Jared 'Riley' Dowell was caught allegedly spray painting 'All Cops Are Bastards'Protestors shouted profanity upon Dowell's arrest while another assaulted a copDowell is now on probation, and could have case dropped after a year Top Democrat Katherine Clark's transgender daughter has been put on probation after she was arrested for allegedly assaulting a cop and spray-painting a monument during a violent anti-cop in Boston protest in January.",
        "Jared 'Riley' Dowell, daughter of the House Minority Whip, has been told to write a letter of apology to the officer, complete 30 hours of community service, continue therapy and pay expenses for the vandalism at Boston Common in January.In a deal with prosecutors her case will be dropped after a year if she completes all the requirements, a Suffolk County Judge said on Wednesday according to the Boston Globe. Police say Dowell spray-painted  'All Cops Are Bast**ds' and 'NO COP CITY' on a Parkman Bandstand Monument on the eastern side of the Boston Common during the Antifa rally on January 21. ",
        "Two days later, Dowell pleaded not guilty and vandalizing a historic monument or marker. Clark addressed Dowell's contentious arrest calling it a 'difficult time.' Dowell is non-binary. She has not yet addressed her daughter's sentence.'Last night, my daughter was arrested in Boston, Massachusetts,' Clark wrote on Twitter. 'I love Riley, and this is a very difficult time in the cycle of joy and pain in parenting. This will be evaluated by the legal system, and I am confident in that process.' About 20 protestors surrounded cops while Dowell was arrested with some shouted profanity through megaphones.The protest led to traffic coming to a complete stop as participants created a scene on the sidewalk, police said. ",
        "One protestor hit an officer in the face causing him to bleed from his nose and mouth, police said.Dowell was charged with Assault by Means of a Dangerous Weapon, Destruction or Injury of Personal Property and Damage of Property by Graffiti. ",
        "Another person was taken into custody for graffiti and resisting arrest in Boston about an hour after Dowell.Andrea Colletti, 27, was caught by officers after a short chase on foot.Colletti gave cops a brief struggle before she was placed in handcuffs. Meanwhile, Antifa protests in Atlanta became violent on Saturday as rioters armed with explosives screamed 'I can't breathe' as they were arrested by police officers after torching cars, hurling fireworks, and smashing windows with hammers.Clad in black hoodies, ski masks, and surgical face masks in order to obscure their identity as they perpetrated acts of wanton vandalism, video footage saw at least three being pinned to the ground by police officers all the while screaming George Floyd's dying words.However, unlike Floyd who died at the hands of Minneapolis Police Officer Derek Chauvin in May 2020, those who were being placed in cuffs on Saturday night were clearly able to breathe and they made their full-throated claims audible, in front of cameras.The six rioters who were arrested have not yet been identified and their charges have not been released. "
    ]
}