{
    "articleURL": "/news/article-12048997/Anheuser-Busch-triple-Bud-Lights-marketing-spending-summer.html",
    "content": [
        "Anheuser-Busch CEO Michel Doukeris said Bud Light employees on the ground level have born the brunt of protests against their Dylan Mulvaney partnershipEmployees such as delivery drivers and sales people will get $500 bonusesBug Light sales are down 26 percent since the Mulvaney ads came out in AprilAnheuser-Busch will triple its marketing budget this summer and give $500 cash bonuses to its drivers, retailers and salespeople as it struggles to regain its footing in the wake of national boycotts against its use of a transgender woman in a promotion.",
        "The company has seen its sales plummet 26 percent since it partnered with Dylan Mulvaney in early April, a loss that has amounted to more than $6billion in revenue.CEO Michel Doukeris disavowed the advertisement in an earnings call Thursday, insisting the ad was 'not a campaign,' and that an outside agency approved it without approval from Bud Light. He also said the boycott had mostly affected their workers who had nothing to do with the Mulvaney advertisement and that the company would provide them with $500 to help them through.Doukeris noted the company would still contribute to LGBTQ+ causes.",
        "Doukeris said Anheuser-Busch's workers on the ground level had faced the backlash from angry customers, with some even fearing for their lives in the face of protest.'The situation impacts really the front-line workers more than anybody else,' he said, according to the Wall Street Journal. 'Think about the truck drivers, the delivery people, the sales reps, merchandisers. Those are people that are the fabric of our business. They are family and neighbors.''Our number-one priority during this entire situation was the safety of our people,' Doukeris said on the call.As a result of the backlash, the company now plans to pay delivery drivers a $500 bonus. The company also plans to increase its marketing spending in the coming months to try and woo customers back to the brand. ",
        "Doukeris was also insistent the disastrous placement was not part of a company advertising campaign.'We need to clarify the facts that this was one camp, one influencer, one post and not a campaign,' he said. 'We will continue to learn, meet the moment in time, all be stronger and we work tirelessly to do what we do best: Bring people together over a beer and creating a future of more cheers.'",
        "Doukeris' comments came as a letter was sent to retailers, bars and restaurants by Grey Eagle – which distributes Anheuser-Busch products around St Louis. 'Anheuser-Busch did not intend to create controversy or make a political statement,' the letter read.'In reality, the Bud Light can posted by a social media influencer that sparked all the conversation was provided by an outside agency without Anheuser-Busch management awareness or approval.''Since that time, the lack of oversight and control over marketing decisions has been addressed and a new VP of Bud Light marketing has been announced.'Bud Light's VP of marketing, Alissa Heinerscheid, took a leave of absence while the VP for Mainstream Brand, Daniel Blake, stepped down some days after.Their sudden departure appears premature in light of the recent comments, which also claim there was no 'management awareness' of the now-infamous campaign. ",
        "The specifics of how the can fiasco erupted remain under wraps. The latest letter claims the Mulvaney can was the brainchild of an outside agency.It is the first time the brewing giant has addressed the backlash in detail, after they were hit with a major dip in Bud Light sales following the paid partnership."
    ]
}