{
    "articleURL": "/wires/afp/article-12047589/BuzzFeed-Vice-woes-signal-crisis-digital-media.html",
    "content": [
        "With the closure of BuzzFeed News and bankruptcy looming at Vice, the once promising world of free digital media finds itself at a crossroads, seeing ad revenues dry up at the same time as disappointed investors begin walking away.",
        "BuzzFeed, one of the OG new media disruptors, announced in late April that it would shutter its news division. Translation: 180 jobs lost.As for Vice, the company -- once a darling that attracted major funding from Disney and Fox, among others -- has canceled its signature show Vice News Tonight, laid off 100 people, and is reportedly on the verge of declaring bankruptcy.The two media groups have different profiles and goals, but one thing they have in common is a reliance on advertising dollars to fund their operations.But in tough economic times, advertising is one of the first things to go, and tech giants now account for 70 percent of all digital ad revenues, with Google and Facebook leading the way.\"I think the free model -- trying to build high volume, and then sell ads on that basis -- hasn't worked out nearly as well as hoped,\" says Rick Edmonds, a media business analyst at the Poynter Institute, a non-profit journalism research organization.Ben Smith, the onetime editor-in-chief of BuzzFeed News, is more unequivocal.\"It's the end of the marriage between social media and news,\" he told The New York Times.At the start of the 2010s, Vice and BuzzFeed -- along with the Daily Beast and the Huffington Post -- were the standard bearers of a new generation of media outlets that were completely online and ready to battle the traditional purveyors of news.",
        "The model quickly seduced investors.\"These outlets expanded way beyond their capacity, because they were attracting an enormous amount of venture capital,\" says Dan Kennedy, a professor of journalism at Northeastern University in Boston.\"Venture capitalists told themselves a fairy tale, which was if Vice and Buzzfeed News and all the rest are going to generate this much traffic, there must be a way to monetize all that traffic.\"In 2017, Vice Media was valued at $5.7 billion -- more than the market capitalization of The New York Times at the time.But when progress is slow in coming, investors \"get impatient,\" Edmonds says.- 'Hard sell' -As interest rates rose over the past year, tighter lending conditions have made venture capitalists more tight-fisted, and \"everybody called in their chips,\" explains Aileen Gallagher, chair of digital journalism at Syracuse University's Newhouse School of Public Communications.Vice and BuzzFeed had already struggled to attract new investments for several years and were forced to resort to taking on debt to stay afloat. Neither was turning a profit.Fortress Investment Group, Vice's main creditor, could take the media company if it declares bankruptcy, according to The New York Times.In 2021, BuzzFeed went public, but the move quickly proved disastrous -- the company, once valued at $1.5 billion, only raised $16 million.",
        "In this tumultuous environment, free news websites attached to major groups like Vox (Vox Media), Mashable (Ziff Davis) and The Daily Beast (IAC) have fared better, helped in part by economies of scale and majority shareholders with long-term vision.BuzzFeed was searching for such a set-up in 2020 when it bought The Huffington Post, which remains part of its group and is even profitable, although with a much smaller footprint than in its heyday, according to CEO Jonah Peretti.Free media sites are the most exposed when the economy is tight, and many legacy media -- including NPR, The Washington Post and CNN -- have proceeded with layoffs.Others, like The Daily Beast, have tried to transition to a paywall model, but for Edmonds, \"that's a fairly hard sell to news consumers, particularly if it's a brand they've gotten used to having free.\"\"You have to really care about something to subscribe to it. And it has to be really valuable to you, in order to pay money for it. And creating value is expensive,\" Gallagher points out.\"There's a lot of middle ground content in the digital world that doesn't have a lot of value. And I think that's the kind of stuff that's going to disappear.\""
    ]
}