{
    "articleURL": "/wires/reuters/article-12045779/U-S-issues-guidelines-defending-Philippines-South-China-Sea-attack.html",
    "content": [
        "Attacks on coast guard would invoke treaty commitment",
        "Treaties should not be used to interfere - ChinaPhilippines, U.S. ties deepen under Marcos'We will always have your back', U.S. defence chief saysBy Karen LemaMANILA, May 4 (Reuters) - The United States has laid out in clear terms the extent of its defence treaty commitments to the Philippines, issuing new guidelines that refer specifically to attacks in the South China Sea, including on its coast guard.The six-page \"bilateral defence guidelines\" agreed in Washington on Wednesday follow a renewed push under President Ferdinand Marcos Jr to update the Mutual Defense Treaty with the former colonial ruler, at a time of increased tension and maritime confrontation with China.The guidelines were a first since the treaty was signed in 1951 and follow scores of Philippine diplomatic protests in the past year over what it calls China's \"aggressive\" actions and threats against its coast guard.The guidelines said the bilateral treaty commitments would be invoked if either is attacked specifically in the South China Sea and also if coast guard vessels were the target.It was also updated to include references to modern forms of warfare, including \"grey zone tactics\", which China is accused of using to assert its claims to sovereignty. The guidelines did not mention China specifically.",
        "\"Recognising that threats may arise in several domains - including land, sea, air, space, and cyberspace - and take the form of asymmetric, hybrid, and irregular warfare and grey-zone tactics, the guidelines chart a way forward to build interoperability in both conventional and non-conventional domains,\" according to the Pentagon.'WARNING' TO CHINAThe South China Sea, a waterway vital to global trade, has become a major flashpoint in the increasingly testy relationship between China and the United States.The guidelines send a \"warning\" to China against targeting the Philippine coast guard said Rommel Ong, former vice commander of the Philippine navy and a professor at the Ateneo School of Government.Julio Amador, head of the Foundation for the National Interest, a Manila-based think-tank focusing on strategic and security issues, said of the security guidelines \"It's clear that it will give China some pause.\"China's foreign ministry on Thursday said it opposed the use of bilateral defence treaties to interfere in the South China Sea, which \"should not be a hunting ground for external forces\".The guidelines were released during visit to Washington this week by Marcos, which included talks with counterpart Joe Biden.Marcos also met Defense Secretary Lloyd Austin, who told him \"we will always have your back, in the South China Sea or elsewhere in the region.\"",
        "Ties with the United States have deepened under Marcos, who in February granted its military access to more of his country's bases, prompting accusations from China that the deal was \"stoking the fire\" of regional tension.(Reporting by Karen Lema; Editing by Martin Petty)"
    ]
}