{
    "articleURL": "/home/books/article-12048691/MUST-READS.html",
    "content": [
        "The Shortest History of the Crownby Stephen Bates",
        "(Old Street £8.99, 288pp)",
        "In the past millennium England has been without a monarch for just 11 years and four months, when Oliver Cromwell ruled as Lord Protector, after the execution of King Charles I.Of the 195 countries in the world, 41 are monarchies. As the Coronation of King Charles approaches, Bates notes that, as an institution, the British monarchy is ‘one of the most respected, least challenged and best-known institutions in the country’.In his entertaining history of Britain’s kings and queens, he tells the stories of monarchs: good, bad and occasionally mad.But while their power has waned, the stability of the institution has remained, thanks to ‘a combination of good works, diligence and — usually — respectability’, along with a dash of ceremony and pageantry.Putinby Philip Short(Vintage £16.99, 880pp)",
        "In meetings with foreign heads of state, Vladimir Putin liked to tell an anecdote from his hardscrabble childhood in Leningrad. The apartment block where his family lived was infested with rats, which young Vladimir and his friends used to chase. One day, a cornered rat turned and attacked him.The memory stayed with him: ‘No one,’ he would declare, ‘should be put in a situation where they have no way out’.Putin was once a Russian leader with whom the West felt it could do business. But after Russia’s invasion of Ukraine in February 2022, Putin was branded a ‘blood-stained aggressor’.",
        "Short’s meticulously researched biography of Putin chronicles his journey from lowly KGB agent to the ruthless instigator of a war that has come to represent a struggle between the forces of autocracy and democracy.Venomous Lumpsuckerby Ned Beauman(Sceptre £9.99, 304pp)",
        "Mark Halyard is on his way to a restaurant in Copenhagen when a lump of flesh crashes into the road ahead of his taxi.Grown using DNA from the world’s last panda, the lump has been lobbed at Mark’s taxi by environmental activists. Mark is the environmental impact coordinator for an Indian mining company, whose devastating environmental impacts are offset by ‘extinction credits’, allowing them to destroy any species they do not deem as ‘intelligent’.Unluckily for Mark, the strikingly unattractive but endangered venomous lumpsucker fish is classified as intelligent by an expert in animal cognition, just as its last remaining habitat is destroyed by one of the mining company’s vessels.Beauman’s fast-moving and witty eco-thriller asks urgent questions about the value we place on the world we live in."
    ]
}