{
    "articleURL": "/tvshowbiz/article-12059689/Kyle-Richards-54-flashes-arm-muscles.html",
    "content": [
        "Bravo beauty Kyle Richards has been hitting the gym more often this year.",
        "And the 54-year-old reality TV star proved it again this weekend with a new social media post.On Sunday evening the Real Housewives Of Beverly Hills star - who showed off her ribs last week - posted an image to her Insta Stories where she flexed her arm muscles.Her arm looked very well defined as if she has been lifting weights daily.The mother of four looked into her cell phone as she took the mirror selfie in the gym while wearing exercise clothing and a cap. ",
        "Kyle had on a black tank top over her black bra that matched her black sports watch as she wore navy blue leggings.Her trucker cap had a green camo theme. 'Serious arm goals,' it read over the photo.Last week she responded on social media to fans concerned about her slimmed down physique.The star caused concern after her The Real Housewives of Beverly Hills co-star Dorit Kemsley, 46, posted a since-deleted photo of the cast in Spain that showed Kyle's ribs protruding.'The picture they're referring to I was sucking in because of the type of dress I had on,' Kyle commented on Instagram about the photo, according to an article on Thursday by Page Six.'Which I see now was not a good look. I am actually a healthy weight. I eat very well &amp; workout every day. Anyone who knows me can attest to that,' she added.",
        "The image sparked concern for Kyle's fans worrying about her recent weight loss, which previously prompted the star to deny using the diabetes drug Ozempic.",
        "'Anyone else concerned for Kyle?' one fan commented.'Kyle needs an intervention,' another voiced.'Kyles ribs. Yikes,' one wrote.'I hope Kyle isn't unwell,' another wrote.Some speculated she was simply holding her breath to appear slimmer: 'Kyle looks odd! Why is she holding her breathe. We get it your thin but this is too much.''Kyle??? Wayyyyy toooo thin. Even if she is sucking in. Intervention time,' another wrote.'Breathe Kyle, not a good look,' another posted.But not everyone was up in arms over the weight loss - one Instagram user defended Kyle and suggested her 'rib flare' was down to an 'awkward' pose she was striking. ",
        "'The body shaming is awful! Get a grip people- @kylerichards18 is extremely petite and her ribs are sticking out from an awkward posture, maybe holding her breath more than likely. Rib flare happens in all types of bodies,' she wrote.Kyle's weight loss journey has faced intense speculation this past year.  She has had to deny using Ozempic, a diabetes drug that does lead to weight loss, several times. 'After gaining weight during the summer — on July 15 — after getting off the boat I said 'That is it. I'm not having any sugar, any carbs, any alcohol,' Richards explained during an appearance on the Two T's In a Pod podcast with Teddi Mellencamp and Tamra Judge in January.",
        "'A lot of people think I've been taking Ozempic. To clarify I've never taken Ozempic,' she said.She added that she also isn't taking Mounjaro, another diabetes medication, or, 'any of the shots' such as Wegovy or Saxenda.Richards explained that she first only planned on cutting sugar, carbs and alcohol for 'maybe two or three weeks,' but she kept going when she saw the benefits.'I started losing weight and I felt so good. I was like 'why would I go back to that?' Richards shared.'So I still have not had alcohol at all, and you know, I'll have a bite of birthday cake here and there but that's it,' she clarified.",
        "She also addressed rumors that she underwent surgery to lose weight, revealing she only went under the knife once for a breast reduction.'I had a breast reduction. I wanted a tummy tuck because of the skin from having four babies, the excess skin,' she added.'Because no matter how much you workout, you always will have that skin, if it's not taken away,' Richards continued.She offered more details on her diet regimen in the comments of a bikini snap she posted back in January. 'NO alcohol, bread, pasta, sugar. I eat protein, fruit and vegetables. Now that I am the weight I want to be, I will have the occasional small amount of pasta etc once in a while. But no alcohol since July 15,' she confirmed.",
        "'I workout every day. Chasing it up between running, cycling, hiking and yoga. Weights &amp; stomach everyday,' she added."
    ]
}