{
    "articleURL": "/news/article-12053133/Art-deco-LA-mansion-owned-widow-Rodney-Dangerfield-hits-market-17-4-million.html",
    "content": [
        "The place was purchased by Dangerfield's wife Joan just after his 2004 deathShe acquired the property in around 2005 for about $6.3million The property is currently being listed for an extreme increase to $17.4million The wife of the legendary late comedian Rodney Dangerfield is hoping for more than a little respect as she puts her stunning art-deco Los Angeles mansion on the market.",
        "Joan Dangerfield listed the property on the Bird Streets of the Hollywood Hills for about $17.4million in February. She acquired the property shortly after the comedian's 2004 death for about $6.3million. The home - which is described as 'rarified art deco contemporary' - has four bedrooms and six baths.It contains 5,400 square feet of living space with floor-to-ceiling walls of glass showing off the views in the Hollywood Hills. ",
        "Joan Dangerfield bought the property after selling the two homes she shared with her husband following his death from complications related to heart surgery.The four-bedroom, six-bath home is a corner property hidden by green spaces throughout the neighborhood. The two-story white home comes with a gated driveway leading into a large court capable of holding several cars, as well as a three-car garage.  The living room contains a fireplace and is lined with glass doors that head out into the backyard.Said backyard includes an infinity-edge pool and spa, as well as a firepit. In a tribute to her late husband, a bust of Dangerfield sits alongside the fire pit. The house also contains a formal dining room, a gourmet kitchen stocked with high-end appliances, a central island and a breakfast nook.On the top floor, there's a master retreat room that contains another fireplace, walk-in closet and a luxury bath. ",
        "The second floor also contains a fancy movie theater and comes with access to the garage.  The listing is held by Marcy Roth and Ella Angel of Douglas Elliman.Rodney and Joan Dangerfield were married in 1991 until the Caddyshack star's death in 2004. Joan was Rodney's second wife and third marriage. Back in 2013, Joan revealed she has a slightly more unusual way of remembering her late husband: The 60-year-old keeps a bottle of Rodney's sweat in her refrigerator.",
        "'Rodney had a eureka moment,' she recalls. 'He said, 'I sweat more than anybody. My sweat has to be as good as Elvis' sweat, right?'' and he would sweat a lot up there on stage. So my job became the sweat collector.'Joan collected Rodney's sweat through the trusty method of sponge and a spoon. 'I'd collect his sweat - about an inch at a time,' she explains. 'I thought we could water it down but he said, 'No, that wouldn't be right.''Born Jacob Rodney Cohen in New York 1921, Rodney became a surprise hit of The Ed Sullivan Show in the 1960s and went on to appear in films Caddyshack and Easy Money in the 1980s. "
    ]
}