{
    "articleURL": "/news/article-12060053/Starbucks-sack-trans-worker-berated-female-customer-confrontation-misgendered.html",
    "content": [
        "A transgender woman was filmed berating a female customer in StarbucksShe then appears to assault a man recording the incident in SouthamptonDo you know the Starbucks worker or the customer? Email tips@dailymail.com A transgender woman has been sacked by Starbucks after footage showed her berating a female customer and allegedly assaulting a man who filmed the incident.",
        "The clash broke out at a Starbucks branch near the ferry terminal of Southampton, Hampshire, on Sunday, April 30. The 56-second clip shows the employee on the same side of the counter as the customer, arguing with her. The person recording the incident said the woman had apparently said something 'transphobic' to upset the employee, who angrily refuses to serve her. Footage shows the female customer saying: 'You're rude, don't ever call me transphobic, ever. You do not know me.'",
        "In response, the transgender woman says: 'You're calling me a man, you're being transphobic, Karen. Now get out.''Karen' is a derisive insult imported from the US, taking aim at white, middle-aged women. Feminists have criticised it as a misogynistic term.The conversation heats up, as the woman insists, 'do not call me transphobic'.The transgender employee then claps in the woman's face and denies her request for a refund, adding: 'You are transphobic, now get out.'Repeatedly, the woman is told to 'get out' and that she is 'trespassing', before the employee appears to notice a man using his smartphone filming the encounter.Without warning, the employee comes forward and lunges for the phone, demanding the man hand it over while appearing to assault him.The footage prompted heavy criticism on social media, with many users copying in Starbucks' Twitter handle and demanding answers.",
        "Australian women's activist Sall Grover shared the clip on Twitter, and wrote: 'When women see men who think they’re women in female spaces, they often get themselves out as quickly as possible.",
        "'[They] say nothing because we all know how men react when we say something they don’t like.'Activist Oli London also shared the video and tweeted: 'Is this an acceptable way for staff to behave Starbucks UK?'Debra Gordon posted: 'This person should be fired! They are there to serve customers - not abuse them.' Annabelle Bond wrote: 'Stop enabling this behaviour. No employee should treat a customer like that.'Transsexual performer Buck Angel added: 'Haha they are crumbling fast! Wingnuts are exposing themselves.'Others branded the employee's behaviour 'entitlement' and 'unacceptable'.  Activist Kellie-Jay Keen, who was recently mobbed by trans rights campaigners in New Zealand, also shared the clip. She said: 'Which branch is this? We should all go'A Starbucks spokesman said: 'The licensee has confirmed that the partner (employee) no longer works at the company. Starbucks has no tolerance for behaviour of this kind and we are very sorry for the experience that this customer had.'"
    ]
}