{
    "articleURL": "/femail/article-12038559/Todays-glorious-cover-royal-appointment.html",
    "content": [
        "Artist Andrew Jamieson designed the official Coronation invitation, but he hasn’t received one himself. ",
        "‘I don’t see why I should,’ he says. ‘Many more deserving people have done amazing things for this country. I hope they have an incredible day.’He says he was ‘stunned’ his design had been chosen by Buckingham Palace, and the result (top) was so impressive we asked him to design an exclusive handpainted version for Daily Mail readers – the glorious cover of today’s Weekend magazine (inset). The initial phone call came from the Art Workers’ Guild – eight members had been asked to submit designs – and so began a month’s painstaking work in secret at his home studio in Fife.Andrew, 61, grew up on a council estate in London, and recalls being excited as a boy when he saw illuminated manuscripts on visits to the British Museum. ",
        "He went on to study heraldic art, calligraphy and manuscript illumination at Reigate School of Art.His concept for the royal invitation included a wildflower meadow and a Green Man motif – a pagan symbol of spring and rebirth – to mark the new reign. ‘It seemed to go down well and Their Majesties gave me free rein.’Like the King’s, our illustration is packed with flowers. ‘The rose, thistle and shamrock are all royal plants and make up the royal badge of the King,’ says Andrew. ",
        "‘Normally a leek is shown as the emblem of Wales but I thought the daffodil more colourful and appropriate.’ Also in the meadow border are dog roses, cornflowers, bluebells, violets, forget-me-nots and wild strawberries.He made a few tweaks for us. The architectural arch suggests the abbey – it’s crowned with a lion crest, has two weather vanes with the letter ‘C’ on them, and a robin and a skylark sit on two of the pinnacles. ",
        "Through the window is Windsor Castle and at the bottom the two shields lean in towards each other, as is a custom in heraldry for marital shields.Playing among the flowers are a lion, a unicorn, a boar and a dragon, as well as a bee, a butterfly and a gold swallow. Andrew has also included a sparrow – ‘a tongue-in-cheek reference to my being a Cockney’.So what will he be doing today? ‘My wife and I will watch it on TV like everyone else,’ he says. ‘Being an American she’ll turn it into a huge celebration!’"
    ]
}