{
    "articleURL": "/sciencetech/article-12038987/Still-better-Bud-Lights-campaign-Realistic-AI-generated-advert-fictional-beer-goes-viral.html",
    "content": [
        "An AI was asked to create an American beer ad based on typical commercialsThe software created a scene of people partying at a backyard barbequeREAD MORE: Can YOU tell the real photos from the fake AI ones?A new American beer commercial might seem like a nightmare, but some say it is still better than Bud Light's latest campaign. ",
        "A London-based company asked AI to generate an advert based on what is seen in a typical US beer commercial - and the public is calling it 'fantastically horrendous.'The clip, dubbed 'Synthetic Summer,' is based at a backyard party where people are enjoying brews from blue labeled cans and bottles, but a look closer and you can see the trademarks of the software. Digital people have giant mouths with too many teeth, alien-like hands with more than five fingers and flailing arms, while others' tongues flail around the rim of cups.",
        "Synthetic Summer was created by London-based Private Island, which said the team spent 12 months making the clip.Director and co-founder Chris Boyle told Stash Media that Private Island used Stable Diffusion, Control Net and Runway Gen 2 to create the creepy commercial.'We are creating a series of in-house experiments that help us figure out how these tools can be used in production,' said Boyle.'Most of our work combines live-action and animation, so this kind of stuff seems like a natural evolution.'The all-American beer commercial starts with a shot of a backyard filled with people partying. The hit 1999 song 'All Star' from Smashmouth plays in the background while you hear the attendees talking and laughing as they sip from blue labeled bottles and cans.",
        "However, some of the guests are seen drinking from the bottom of beers or swishing their tongues on the outside rims of glasses - not ever taking a sip. The AI does capture the essence of a beer commercial, showing flames from the barbeque rising and exploding throughout the party and guests acting like nothing is out of the ordinary.Chris Catchpole shared his thoughts about the video on LinkedIn: 'Ironic it’s a ‘blue’ cola as this is so close to the truth with those clients.",
        "'I almost expected their real logo to appear at the end! 'Every single box ticked except the one which says, ‘would anyone want to watch it again?’'For pure freak show, this is brilliant. Ai is improving exponentially every day.'The iconic blue label is likely in reference to Bug Light, which lost billions of dollars since partnering with transgender influencer Dylan Mulvaney.One TikTok user even said the ad should be played at the Super Bowl with no explanation to see if viewers notice the difference. While another shared: 'I don’t want AI to improve. I want it to stay like this forever.' A Twitter user, in January, conducted a similar experiment with AI, but generated images using Midjourney that look like pictures taken at a party.",
        "The generated images of women smiling at the camera and men raising their cups for a toast. ",
        "The images appear to be candid shots of friends at a party, but a closer look may give you nightmares.The 'people' are grinning with mouths full of teeth, hands are growing from hips and tattoos look like mold growing on their skin.However, the excessive amount of fingers has captivated the internet, with one user saying they look like 'a nest of alien appendages sprouting forth to devour their host.'Midjourney is an AI program that creates images from textual descriptions.This means users type keywords of what they want to be made, and the AI generates the photos based on the theme.Miles shared a thread with the AI party images, the first group showing only women.",
        "Artificial intelligence can now let people invent a social life by creating images that suggest they attended a party that never happened and with friends that do not exist.",
        "Two of the photos suggest the women are taking pictures looking in the mirror - one of them is holding up what appears to be a camera.And the other two snaps show candid shots of three friends smiling and looking forward.The 'mirror pics' are a dead giveaway that AI created the images because the 'people' holding the camera have more than the standard five fingers on their hand.",
        "Along with too many fingers, the women also have too many teeth.The following photographs show men, which could have been taken during a weekend house party.A group of three are raising their cups to cheers, but they not only have an excessive amount of fingers, but one of them has a hand growing out of his arm.And while many users laugh at the mistake, Miles found the AI may be biased when creating 'people.''I had to be specific in order to get male-looking AI people—and even then, variation is a challenge. It definitely defaults to white people when you ask for 'people,' Miles tweeted."
    ]
}