{
    "articleURL": "/tvshowbiz/article-12049057/Peter-Andre-reveals-didnt-sign-Im-Celeb-South-Africa.html",
    "content": [
        "Peter Andre has  insisted he 'couldn't' sign up for I'm A Celeb South Africa - 19 years after meeting ex Katie Price on the show.",
        "The singer, 44, said that while he 'loved' his experience in the series he couldn't bring himself to return, just weeks after Katie revealed that she would be 'interested' in making a comeback despite the lingering memories of their union. Peter first ventured into camp back in 2004 where he met now ex-wife Katie, 44, with whom he shares son Junior, 17, and daughter Princess, 15, before appearing again in 2011.He told Jamie Theakston and Amanda Holden on their Heart Breakfast show: 'I loved it, but once you've done it... I went in twice so I have been in again when [current campmate] Fatima Whitbread was in it.' Katie meanwhile said in an Instagram live last month: 'A lot of people are saying, am I doing I'm A Celeb? No, but I'm interested in this show...",
        "'Apparently they're already out there filming with 'the legends.' I don't think they're legends. Imagine, if they had me and Pete on it? Imagine.\" During her chat with Peter, Amanda interjected: 'Ashley [Roberts] said the same thing, she said she'd never go back.'Peter agreed saying: 'You experience things that are amazing, but I don't think I could go back.' When asked what he thought of the show the Mysterious Girl singer replied: 'I haven't seen it, but I think it's a great line-up'.",
        "Before adding: 'They've got some good people on there.'After meeting in 2004 Peter and Katie went on to tie the knot in a lavish 2005 ceremony before eventually divorcing in 2009.Katie told The Mirror at the time: 'Pete is the love of my life and my life. We have children together and I am devastated and disappointed by his decision to separate and divorce me as I married him for life.'This is not what I want and the decision has been taken out of my hands. I will not comment further or do any interviews regarding the separation but I will always love my Pete.'Last year, Peter discussed his jungle romance on This Morning, and of his eldest children Junior and Princess, he gushed: 'They are the only jungle babies ever my kids!'",
        "When asked who made the best friendships while in the Australian jungle camp, Peter reminisced: 'I mean I fell in love... it was an interesting time!' as he looked back on his romance with Katie. The glamour model is also mother to son Harvey, 20, from her relationship with Dwight Yorke and Jett, nine, and daughter Bunny, eight, with estranged husband Kieran Hayler. Peter went on to marry doctor Emily MacDonagh, 33, with whom he now shares two children, daughter Amelia, eight, and son Theordore, five.",
        "Mother-of-five Katie spoke of their jungle romance during an appearance on ITV's I'm A Celebrity...A Jungle Story in 2020. She admitted: 'I was just fixated on Pete. People saw our relationship develop. Having Pete there in the jungle did make it easier because you'd fall asleep thinking of him and wake up seeing him there.'If you haven't clicked with someone in there, I think it's quite hard and lonely. 'It was a proper love story and I think me and Pete are the only ones who had kids come out of it.'The reality star was then shown footage of herself during her jungle stint ,speaking about her growing feelings for the singer, where she admitted: 'I get on really well with Pete, he'd be the type of guy I'd go for, but I have a boyfriend.'",
        "Hosts Ant McPartlin and Declan Donnelly watched the same clip in a home cinema with Ant admitting: 'She had a boyfriend - I'd forgotten that'.Katie was dating Scott Sullivan at the time but said: 'I know he's not the one', after hitting it off with Pete.Reminiscing on the public interest in Katie and Peter's romance, Ant said: 'People love a romance, they love a love story and it just developed as the series went on.'",
        "Katie went on to have several failed marriages but believes former Love Island star Carl Woods is the one."
    ]
}