{
    "articleURL": "/femail/article-12056275/The-Duke-Duchess-Edinburgh-tuck-Coronation-chicken-pie-Big-Lunch-Surrey.html",
    "content": [
        "The Duke and Duchess of Edinburgh attended a Big Lunch in Surrey todayRead more: Lip reader reveals what the royals said during the Coronation The Duke and Duchess of Edinburgh tucked into a selection of party food today as they attended a Big Lunch event in Cranleigh, Surrey.",
        "Reeling from yesterday's Coronation celebrations, Sophie, 58, stunned in a printed midi dress by Etro which matched the spell of bright weather as she greeted royal fans.She accessorised her look with a delicate pair of blue earrings, a summery straw handbag and brown wedge heels.The Duke of Edinburgh, 59, was snapped digging into a plate of Coronation chicken pie with his wife while well-wishers met them with rows of Union Jack flags. Although it's the dish of the moment, there didn't appear to be any coronation quiche on offer.The pair headed to Cranleigh Village Hall where they visited the Coronation Craft Market, before heading to a fun fair on the high street.",
        "As well as meeting residents, the Duke and Duchess joined representatives from the Royal British Legion, the Scouts and the Guides – of which Her Royal Highness is President.Their visit to the Big Lunch comes after the Duke and Duchess made a regal appearance at the Coronation of King Charles III and Queen Camilla yesterday.They were joined at Westminster Abbey with their two children, Lady Louise and James, Earl of Wessex for the historic first Coronation of a British monarch in 70 years.Sophie donned a regal white Suzannah couture floor-length embroidered gown with a Jane Taylor headpiece and Royal Victorian Order Mantle, while her husband wore morning dress with a Garter Mantle over a black smart suit.",
        "Meanwhile, Lady Louise, 19, who is a university student at St Andrew's, stole the show in a flowing white and blue floral gown and a chic headpiece.James, Earl of Wessex, 15, who rarely makes public appearances, also looked smart in a black suit which he paired with a white shirt and a burgundy tie.",
        "After the ceremony, the family appeared on the Buckingham Palace balcony with a select group of senior royals as The Mall was swamped by tens of thousands of cheering supporters.Lady Louise and James stood beside their royal parents as they waved to gargantuan crowds before an RAF flypast, which had to be scaled back to just helicopters and the Red Arrows because of the heavy rain in London.Over the last two years, Lady Louise has taken on an increasingly public role as her parents Prince Edward and Sophie have been bumped up the royal food chain following the disgrace of Prince Andrew and the departure of the Duke and Duchess of Sussex. She was front and centre in the Platinum Jubilee celebrations, joined her parents at the Commonwealth Games and made her successful TV debut in a documentary about her beloved grandfather the Duke of Edinburgh.Prior to the Coronation, the family turned out for a royal gettogether at a private members' club the night before the big event.",
        "Lady Louise raided her mother's wardrobe and opted for a Mary Katrantzou lace cocktail dress, previously seen on her mother in 2015, for the gathering at Oswald's in Mayfair.The Duchess, meanwhile, sported a £1,350 vibrant floral midi dress from Erdem, which she teamed with a cream coat and matching strappy heels.Oswald's is the most exclusive of London's private members' clubs, with the Queen Consort and Boris Johnson and his wife Carrie among those who frequent the venue.They were joined by other royals including Princess Beatrice and Princess Eugenie and their husbands, Edoardo Mapelli Mozzi and Jack Brooksbank.Zara and Mike Tindall also joined the festivities and were later spotted partying at private members venue The Arts Club until 2am.After the grandeur of the Coronation ceremony, the Coronation Big Lunches are taking place in what a palace spokesperson has described as 'a nationwide act of celebration and friendship'.King Charles and Camilla, Queen Consort have officially chosen a coronation quiche, which features spinach, broad beans and tarragon as the designated dish for the Big Lunch.The new Coronation dish was developed in close conjunction with the King and Queen Consort by the Royal Chef Mark Flanagan, at Buckingham Palace.",
        "Quiche was chosen because it is considered a good 'sharing' dish to take to a street party and can be served hot or cold.",
        "It also suits a wide variety of dietary requirements and preferences and is considered to be 'not too complicated to make or require costly or hard-to-source ingredients'. Members of the public and organisers from a number of charities have expressed their enthusiasm ahead of the event.Lucinda Spelman-Ives, from Wilstock, who raised over £1 million to fund a community hub, hopes the Big Lunch will 'unify and bring everyone together being part of history, making amazing memories, laughing and meeting lots of people who have never met before'.'Everyone is bursting with pride after yesterday's ceremony,' she told the PA news agency.'This will be a very special memory for us all.'Long live the Big Lunches and long live the King.'"
    ]
}