{
    "articleURL": "/wires/reuters/article-12054111/Astros-J-P-France-make-major-league-debut-vs-Mariners.html",
    "content": [
        "Friday was a bad-news day for the Houston Astros' pitching rotation, followed by a bright spot.",
        "General manager Dana Brown announced that Luis Garcia will need Tommy John surgery and will miss the rest of the season.To take Garcia's spot, the Astros called up fellow right-hander J.P. France from Triple-A Sugar Land. France is scheduled to make his major-league debut Saturday night at Seattle in the middle contest of the teams' three-game series.\"It's awesome to be here -- can't wait (to pitch),\" France said at his locker in the visiting clubhouse at T-Mobile Park. \"Been grinding for six years in the minors.\"The Astros' rotation already is thin, with Jose Urquidy on the injured list with right-shoulder discomfort and Lance McCullers Jr. working his way back from a forearm strain he suffered during spring training.That created an opening for France, 28, a 14th-round pick out of Mississippi State in 2018. He was 2-1 with a 2.33 ERA in five appearances (three starts) this season for the Space Cowboys, striking out 26 and walking 11 in 19 1/3 innings.\"That's a tremendous blow,\" Astros manager Dusty Baker said of Garcia's injury. \"I was praying it was something different, something minor. ... He's a strong kid. He's in good spirits. Hopefully, France and the other young guys can give us a lift.\"The Mariners plan to start left-hander Marco Gonzales (2-0, 4.74 ERA) on Saturday. He has struggled against the Astros, going 2-9 with a 4.89 ERA in 14 career appearances (13 starts).",
        "The Astros won the series opener 6-4 Friday night behind Kyle Tucker, who broke out of a 2-for-22 slump with three hits, including a tie-breaking, two-run homer in the ninth inning.\"I mean he was swinging great all night,\" Baker said. \"So hopefully he's about to get hot again.\"Yordan Alvarez added a towering, three-run shot for the Astros, who snapped a two-game skid and ended Seattle's four-game winning streak.It was the Astros' first game in Seattle since the clincher of their American League Division Series last fall. The Astros won that Oct. 15 game 1-0 in 18 innings on Jeremy Pena's home run.On Friday, the Mariners rallied from an early four-run deficit, getting a three-run double from Kolten Wong in the fifth inning and an RBI single by Eugenio Suarez in the eighth.In the ninth inning, the Mariners thought reliever Matt Brash had struck out Tucker on a 2-2 slider on the outside corner, but plate umpire Shane Livensparger called the pitch a ball. Tucker went deep to center on the next pitch.Mariners manager Scott Servais was ejected by Livensparger later in the inning for arguing Brash's 2-2 pitch.\"These are always competitive games,\" Servais said. \"We did execute. We didn't get the call. I hate to say it comes down to one pitch for the outcome of a game, but it really did tonight. He missed it. There's nothing we could do about it now. But unfortunately, it happens. Some of those will go our way, eventually. We needed to get it tonight. ... It's very frustrating.\"",
        "--Field Level Media"
    ]
}