{
    "articleURL": "/news/article-12047999/Burger-King-close-400-stores-end-2023-giant-fails-competition.html",
    "content": [
        "The company says underperforming stores will be the first to go as it announces a historically high number of closuresOne bust franchisee is set to shut 27 locations across seven states this yearChairman Patrick Doyle said the company will slash franchisees who aren't 'dedicated, enthusiastic operators'Burger King has estimated that the fast food giant will have to shutter up to 400 locations across the country this year. ",
        "The iconic burger chain said that underperforming stores will be the first to go. Following the announcement of the company's first quarter results, CEO Joshua Kobza said the chain expects to shut between 300 and 400 locations in 2023.This is a historic high - the company usually closes a couple of hundred stores annually, Kobza said.According to its earnings release, Burger King axed 124 locations in the year up to March, leaving 6,964 restaurants. ",
        "Not all of the 300 to 400 locations closing their doors this year have been revealed, as boss Kobza admitted there is 'a fair degree of uncertainty' around the plans.Sales performance can vary greatly between Burger King locations, and the company said it is seeking additional franchisees with stronger finances this year. Chairman Patrick Doyle said: 'There will always be a minority [of franchisees] who aren't dedicated, enthusiastic operators. We'll work with them to leave the system and move on to do something else. 'There simply is no room for franchisees who are not willing or able to work hard to operate restaurants that are better than the system average over the long term.'It comes after two Burger King franchisees declared bankruptcy earlier this year. For decades, the home of the Whopper has had to live in the shadow of the Golden Arches of McDonald's as America's second-biggest burger chain. In 2020, it lost its second-place spot to Wendy's. ",
        "Last month, an analyst told DailyMail.com that the chain was at risk of entering into a 'death spiral' if it failed to play catch-up with its rivals. Meridian Restaurants Unlimited filed for bankruptcy in March, struggling with rising food costs and poor sales at over 100 locations it operates.It will close 27 locations across seven states including Minnesota, Montana and Utah, having reportedly racked up $14 million in debt. The franchisee said it was 'possible, if not likely' they would be pressed to close more stores as they negotiated rent and operational improvements with landlords.",
        "Another franchisee, EYM King of Michigan, also announced it was closing 26 restaurants across the state in March after the chain missed a deal with the Department of Labor.The fast food giant announced it would lay off 424 members of staff as it geared up to close the restaurants through April. In a letter to the state Department of Labor and Economic Opportunity, EYM King of Michigan LLC said they had failed to reach an agreement with Burger King Corp. 90-unit operator Toms King filed for Chapter 11 bankruptcy protection in January and had to be sold out for $33million.Other struggling locations are expected to be bought out. According to Restaurant Business, 37 stores in Virginia are expected to be bought for $22million by DC Burger. ",
        "Meanwhile Karali Group is reportedly set to pay more than $7million for 27 spots in Ohio and Pittsburgh, Pennsylvania.In its first quarter results, the company reported that despite store closures, its comparable sales rose 8.7 percent. The brand will be hoping that its $400 million 'Reclaim the Flame' turnaround plan may be starting to work.The plan, launched in September 2022, aims to accelerate sales growth, drive franchisee profitability, revive run-down restaurants and streamline overly complicated menus and operations.  ",
        "Michigan2155 Gratiot Ave9871 Livernois 8201 Woodward Ave18021 Kelly Rd20200 Grand River Ave13600 W. McNichols Rd15500 W. Seven Mile20240 Plymouth Rd12661 Mack Ave9239 Gratiot Ave17440 E. Warren16245 Livernois Ave3863 W. Jefferson Ave. 10336 W. 8 Mile Rd3625 South Dort Hwy3801 Clio Rd13324 Woodward Ave28203 Plymouth Rd34835 Plymouth Ave31456 Woodward Ave23660 Telegraph Rd30711 Southfield Rd1113 E. West Maple Rd2411 E. 8 Mile Rd9774 E. M-36Minnesota 209 Nokomis Street, Alexandria 926 Central Avenue Northeast, East Grand Forks  528 Western Ave, Fergus Falls 21 Depot Street, Litchfield 205 Lake Street, Long Prairie 586 Southwest 1st Street, Montevideo 516 East Bridge Street, Redwood Falls 100 21st Street North, Moorhead 1611 US-12, Willmar Montana1422 West Main Street, Lewistown520 North 27th St, Billings1211 9th Street West, Columbia FallsKansas   2201 East Kansas Ave, McPhersonNebraska3627 South Lincoln Avenue, York2504 O St, Lincoln4230 North 27th Street, LincolnNorth Dakota 3765 Gateway Drive, Grand ForksUtah171 East Gateway Dr, Heber7810 South 1300 E, Sandy 10235 South State Street, Sandy729 North Main St, Clearfield1466 East 3500 North, Lehi119 East Crossroads Blvd, Saratoga Springs147 East Bangerter Highway, Draper5390 South 1900 West, Roy1660 West North Temple St, Salt Lake CityWyoming 1902 Mountain View Drive, Cody "
    ]
}