{
    "articleURL": "/news/article-12061265/Vape-sends-two-Whitefriars-College-students-east-Melbourne-Box-Hill-Hospital.html",
    "content": [
        "Two students hospitalised after using vape Both had severe reactions to the productSpent the night in hospital but now released Two teen boys have been rushed from their school to hospital after experiencing severe reactions to a vape.",
        "The students from east Melbourne's Whitefriars College used the vape on Friday before being taken to nearby Box Hill Hospital after suffering the adverse reactions at separate points throughout the day.Two separate ambulances were called after the first boy fell ill at about 9am, and the other at about 12:50pm.They both recovered after being monitored overnight and were discharged on Saturday morning. The independent Catholic school's principal Mark Murphy emailed parents and guardians the following day to say the incident had been reported to Victoria Police and was being investigated. ",
        "'Both students were provided with first aid by a health care centre team and other college staff,' Mr Murphy's email reads.'They were also assessed and taken to hospital by paramedics from Ambulance Victoria.'Fortunately, both students have since recovered and have been discharged from hospital.'Mr Murphy claimed the school had implemented measures to help curb the use of vapes by students, including educational measures and 'environmental sensors' in student amenities. 'We ensure that our young men have a clear understanding of the law in Victoria as it relates to vaping,' he wrote, 'As a school community we need to continue to work in partnership to educate our young men and we encourage all families to engage in conversations with their sons about the dangers of the use of these types of products and to keep them safe.' ",
        "The Herald Sun reports that the vape could have been laced with synthetic cannabis.",
        "The incident comes a week after Health Minister, Mark Butler, announced sweeping changes to the sale and use of vapes.The strict laws will mean Aussies can only purchase vapes in plain packaging with a prescription at pharmacies - not convenience stores, service stations or any other shops.'I am determined to stamp out this public health menace because that's what I think it genuinely is,' Mr Butler said on Q&amp;A last week.'It was not sold as a recreational product targeted at our kids but that's what it has become.'This is a deliberate strategy by the tobacco industry to create a new generation of nicotine addicts and far from being a pathway out of cigarettes, which is what it was promoted to us as, it has become a pathway into cigarettes for young people.' Single use and flavoured vapes will be banned from sale across the nation, while the importation of such vapes will also be outlawed.It is estimated that over a million Australians regularly use vapes, with one in four 18 to 24-year-olds and one in six high school students having tried e-cigarettes. "
    ]
}