{
    "articleURL": "/news/article-12043367/Jesse-Watters-slammed-saying-tell-illegal-immigrant-just-looking-them.html",
    "content": [
        "The host made the comments on top-rated panel show The Five on Tuesday   Jesse Watters is the odds-on favorite to replace Tucker Carlson on the 8pm slot READ MORE: Ron DeSantis can now fly MORE migrants to Democrat-run citiesFox News host Jesse Watters has been blasted for saying he 'can tell' who is an 'illegal immigrant' just by looking at them.",
        "Speaking on talk show The Five on Tuesday, the commentator - who is tipped to replace Tucker Carlson on Fox News' prime-time slot - insisted he can tell because he's a 'city guy.'Watters made the comments during a discussion on the top-rated debate show about how Texas Governor Greg Abbott has been busing migrants into New York City since August. The host's comments went viral, with users taking to social media to express their disgust. One person accused Watters of 'racially profiling', while another called the comments 'sickening'.  One user wrote: 'Now I saw a family desperately seeking out money for food in the trash and my first thought was, \"I bet I can make this a racist segment on my TV show.\"' ",
        "Watters's comments were made during a discussion on The Five about migrants being sent from states such as Texas or Florida to cities such as New York, Chicago and Los Angeles. They come as the pandemic-era policy, known as Title 42, designed to help law enforcement quickly remove illegal migrants at the border, is set to expire on May 11. New York Mayor Eric Adams criticized Governor Abbott for 'targeting' cities with black mayors when busing migrants elsewhere. Watters said: 'This is like a lawyer complaining that all of these people are coming to them with problems. That's what you signed up for. You’re a sanctuary city.'",
        "He continued: 'It has nothing to do with race. Texas is full. Texas doesn't even have a state income tax and they're still paying for all of these illegals. Millions of them. 'The Mayor here is complaining about a couple thousand with more resources than any other city in the entire country? That's ridiculous.'He then made the controversial comments when referring to his journey into work at the Fox News Studios in New York City. 'I saw on the way into work an illegal immigration family digging through the trash looking for recyclables,' he said, prompting co-host Jessica Tarlov to ask him how he knew they were illegal. 'You can tell,' he said. 'I can tell! I’m a city guy. You don’t want me to get into it, but I can tell.' Tarlov could be seen shaking her head and saying: 'For your sake...' before trailing off as Watters continued speaking. He said: 'It’s the saddest thing to see because they’re not able to work here. They came to work, but they’re not able to work here.'The point is this: you have to be able to choose the people that come into the country based on needs. If you need this type of person, bring them in. But to just say everybody come in and then, oops, you know, now people are looking for a five cent bottle, that’s not right. ",
        "'And you can’t blame the guy down in Texas for that. Joe Biden is the common denominator for all of this.'",
        "Watters is the current favorite to replace Tucker Carlson on the Fox News prime-time segment at 8pm, after the former host was abruptly dismissed on April 23.The sharp-tongued conservative currently hosts Jesse Watters Primetime weeknights at 7pm. He has risen through the network's ranks over the last several years, averaging nearly 1.9 million viewers on the Saturday Night show Watters' World, which ended in 2022.  Carlson was fired from Fox last Monday for reasons that have not yet been made entirely clear, but may have had to do with evidence presented to the Fox News board during the Dominion defamation trial last month, or the host's behavior. Fox News funnyman Greg Gutfeld defended his ex-colleague Carlson today as behind-the-scenes clips of Carlson making sexual comments were leaked by the press.'Apparently everyone understands nonsense banter between segments except for hall monitor failures bitterly chronicling the lives of the far more successful,' he wrote.It comes as Fox News' ratings fell behind MSNBC on Monday, a week after Carlson's shock departure.MSNBC beat out its competitors with an average of 1.693million total viewers and 176,000 in the key 25-54 age demographic.Fox News brought in an average of 1.598million total viewers between the 8-11pm hours, and 164,000 viewers in the demo.",
        " In April, New York Mayor Eric Adams said the city was being 'destroyed by the migrant crisis'.The city is among a list of so-called sanctuary cities, and is currently housing 34,800 migrants in 112 shelters. In the last 12 months, more than 56,000 migrants have arrived in the city. According to reports, migrants crossing the southern border into the U.S. are expected to spike between 10,000 and 13,000 per day with the end of Title 42 restrictions.Speaking about the situation in his monologue, Watters said President Biden was 'like a bad manager that doesn't do his job.''Then everybody on the staff is pointing fingers and bitching about the other person,' he said. 'But if the manager would just do their job, everybody could stay in their lane. Texas could focus on Texas, and New York could focus on New York."
    ]
}