{
    "articleURL": "/femail/article-12053781/The-Firm-force.html",
    "content": [
        "Michael of Kent and Princess Alexandra were at Queen's coronation in June 1953They have attended as guests with the Duke and Duchess of Gloucester todayRead more: Dawn breaks on a new era for the Royal FamilyA flurry of lesser known royals have descended on Westminster Abbey today to witness the Coronation of King Charles and Queen Consort Camilla.",
        "Among those to arrive this morning was the Duke of Gloucester, 78, the late Queen's cousin, and his wife of over 50 years, the Duchess of Gloucester, 76.The duke was dressed for the royal occasion, in a morning coat with a Garter Mantle, Garter Collar, Garter Star and his military medals.His wife was in a decadent white dress, with the Royal Victorian Order Mantle.Other arrivals include Prince Michael of Kent, 80, who is another cousin of the late Queen.Michael is also in traditional dress - a morning coat, with Garter Star and the Order of St Michael and St George neck decoration.",
        "He also witnessed the coronation of King Charles' mother, Queen Elizabeth II, in June 1953. Then aged 10, he attended the event with his brother Prince Edward, Duke of Kent. His sister Princess Alexandra, 86, was also at today's Coronation. Alexandra is dressed similarly to the Duchess of Gloucester in a white dress today.She and the late Queen were first cousins through their fathers, King George VI and Prince George, Duke of Kent.",
        "The Mantles worn by members of the Royal Family are made from deep blue silk velvet, with white satin ribbons and a lining of white taffeta. They have been hand-embroidered with a gold badge on the left hand side, with a crimson hood over the right shoulder.   ",
        "Prince Michael of Kent recently recounted his memories of the Queen's coronation in an ITV documentary. The Queen's cousin revealed how he and his friends dubbed it the 'Coronaggot'.The date for the coronation of the Queen was set as June 2 in the hope of fine weather. But the Prince said: 'It was a foul day. It rained the entire day long. It was cold, it was miserable, it was wet.'",
        "The young Prince had to dress up in a kilt, black jacket and white lace jabot for the Royal Family procession into Westminster Abbey.Then a boarder at the exclusive Sunningdale School in Ascot, Berkshire, he remembers the build-up: 'The coronation was the most extraordinarily exciting thing for a small boy. When we all knew the coronation was going to take place I was at prep school and we all talked about the Coronaggot and how splendid it was and what fun it was.'He likely had a very different experience today at the Coronation of King Charles.Some major royals had been left off the guest list today as Charles aimed to condense those in attendance."
    ]
}