{
    "articleURL": "/sport/nba/article-12038283/Mavericks-Timberwolves-set-play-pair-preseason-games-Abu-Dhabi.html",
    "content": [
        "The NBA will play in the UAE once again after 2022's Bucks-Hawks series Minnesota bested Dallas 2-1 in the regular season series between the teams DailyMail.com provides all the latest international sports news Abu Dhabi will stage two NBA preseason games between the Dallas Mavericks and Minnesota Timberwolves in October.",
        "The teams are scheduled to play Oct. 5 and Oct. 7 as part of the annual Abu Dhabi Games, which began in 2022 with the Atlanta Hawks and Milwaukee Bucks.'Following the success of last year's games and events that welcomed fans from across the globe to Abu Dhabi, we're excited to return in the 2023 preseason with two great matchups between the Mavericks and Timberwolves and some of the best players in the world,' said Ralph Rivera, managing director of NBA Middle East and Europe.'Our collaboration with DCT (Department of Culture and Tourism) Abu Dhabi continues to support the NBA's goal of introducing basketball and its values to young boys and girls in the UAE and globally, and that will be the case once again through these games and the surrounding activities.'The games will take place at Etihad Arena on Yas Island in Abu Dhabi, according to Tuesday's announcement from the league.  ",
        "Dallas and Minnesota played three times this season - with the advantage going to the Timberwolves in the series.Minnesota beat Dallas by 10 back on December 19 by a 116-106 score, then lost to the Mavericks two days later by a 104-99 scoreline.In the final match of the series, Minnesota won a nail biter by a 124-121 score.",
        "The two teams had contrasting ends to their seasons. Minnesota was able to win in the NBA Play-In to get into the playoffs, where they lost in five games to Denver.Meanwhile, Dallas swung big to get Kyrie Irving in an attempt to better their playoff chances. But they missed out on the postseason altogether. The first iteration of the Abu Dhabi games in 2022 saw the Hawks beat the Bucks on both occasions. First, Atlanta won 123-113 and then repeated their dominance with a 118-109 performance two days later.NBA games have aired in the UAE since the 1987-88 season."
    ]
}