{
    "articleURL": "/money/investing/article-12054077/FIDELITY-EUROPEAN-TRUST-Fund-delivers-stellar-income.html",
    "content": [
        "Investment trust Fidelity European is a cautiously managed fund with an emphasis on delivering a mix of capital return and dividend growth for shareholders.",
        "Run by longstanding investment manager Sam Morse, with assistance from Marcel Stotzel, the stock market-listed trust has 12 years of dividend growth under its belt. And with more than a year's income tucked away in its reserves, it is likely that 12 will have become a healthy 13 by this time next year.With the £1.4billion trust having the best overall performance record in its peer group over one, three, five and ten years, it should make for a cheery annual general meeting this Wednesday at Fidelity's London offices.",
        "Over the past decade, the trust has generated an overall return of 205 per cent. By contrast, the average European investment trust has delivered 149 per cent, while the FTSE World Europe ex-UK Index has gained 133 per cent.Morse, who has had his firm hand on the trust's tiller for more than 12 years, says caution underpins everything that he and Stotzel do. 'We are interested in companies which are focused on growing their dividends,' he says. 'These businesses tend to reward shareholders with better overall returns than those which maintain or cut their dividends.' He adds: 'But in building the fund's portfolio, we try to ensure these dividend-friendly companies are spread across sectors, providing a degree of balance to the assets we manage. We are also keen to ensure the portfolio is robust enough when inevitable downturns arise.'",
        "The result is a trust comprising companies (currently 44) with durable balance sheets, many of which have been core holdings since Morse came on the scene in early 2011 – the likes of Swiss food giant Nestlé, Danish pharmaceuticals company Novo Nordisk and Dutch computer chip manufacturer ASML.",
        "'It's a low turnover portfolio,' says Morse. 'If we like a stock and the business delivers a growing dividend, we tend to stick with it. We might add to our holding or take a bit of profit from time to time, but we like to hold for the long term.'Among its holdings are stakes in European banks DNB (based in Norway) and KBC (Belgium). Although Morse says the regional banking crisis in the United States is a concern – especially for the health of the US economy – he is confident that contagion can be avoided.'I had a call with DNB the other day,' he adds. 'There are no deposits rushing out of the door. The European regulators seem to be on top of issues, unlike their counterparts in the United States, which allowed the regional banks to operate under a more lax regime.' Both DNB and KBC, says Morse, are providers of attractive dividends and have the potential to deliver future dividend growth. 'They are essentially straightforward retail banks,' he adds. 'They are nothing like Credit Suisse was.'",
        "As an investment trust, Fidelity European can borrow money to increase its exposure to equities. On occasion, it can also use complex financial instruments to make money when equity prices are falling. This flexibility is the main reason why the trust's performance is superior to that of its £4billion sister investment fund Fidelity European over all key time periods. Even though the portfolios are near identical, the latter fund is set up as an investment fund, so is unable to borrow like the investment trust.Annual charges on the trust total 0.92 per cent, the stock market ID code is BK1PKQ9, and the market ticker is FEV. Dividends are paid semi-annually, and in the financial year ending December 31, 2022, totalled 7.7pence a share. The shares trade at just below £3.60.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}