{
    "articleURL": "/wires/ap/article-12055181/MATCHDAY-Arsenal-goes-Newcastle-remain-contender.html",
    "content": [
        "A look at what´s happening in European soccer on Sunday:",
        "ENGLANDThe pressure is on Arsenal to keep the Premier League title race alive after leader Manchester City moved four points clear on Saturday. Mikel Arteta's long-time leader faces a difficult trip to third-placed Newcastle, knowing anything other than a win would hand City a huge advantage in its pursuit of a third straight title. Manchester United is facing pressure of its own after fifth-placed Liverpool moved to within a point of the Champions League qualifying places. United, in fourth, still has two games in hand and travels to relegation-threatened West Ham.FRANCELeague leader Paris Saint-Germain travels to Troyes in crisis mode, facing criticism from fans and pressure from rival contenders. PSG suspended Lionel Messi for making an unauthorized trip to Saudi Arabia. Messi has apologized but is expected to be out for two weeks. In the final weeks of the season, the absences of Messi and an injured Neymar could be detrimental to PSG´s ambition to defend its title, as Marseille and Lens are pressing hard to close the gap.ITALY",
        "The celebrations will continue for Napoli when it plays Fiorentina in its first home match since securing the Serie A title. Napoli clinched on Thursday with five rounds to spare. Juventus could move into third with a win at Atalanta, which also needs the points to boost its hopes of finishing in the Champions League qualifying places. Juventus has won only one of its past six league matches, while Atalanta is bidding for a fourth straight win. At the other end of the table, Hellas Verona is looking to inch away from the relegation zone when it visits fellow struggler Lecce. Also, Torino hosts Monza.",
        "GERMANYBorussia Dortmund needs a win at home to Wolfsburg to keep pace with Bundesliga leader Bayern Munich. Bayern extended its lead to four points by beating Werder Bremen on Saturday. Dortmund is trying to bounce back from losing the standings lead last week following its draw with Bochum. Seventh-placed Wolfsburg has lost only one of its last nine Bundesliga games and is fighting to qualify for the Europa League.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}