{
    "articleURL": "/wires/reuters/article-12039971/U-S-not-extend-deadline-critical-5G-airplane-retrofit.html",
    "content": [
        "By David Shepardson",
        "WASHINGTON, May 2 (Reuters) -The Biden administration does not plan to extend a July 1 deadline for airlines to upgrade airplane altimeters, the measuring instruments that are crucial for bad-weather landings, to address potential interference from 5G wireless technology, Transportation Secretary Pete Buttigieg said.Buttigieg in a call on Tuesday told airlines that the deadline will not be moved. He said airlines had made progress, but urged them to work aggressively to continue retrofitting airplanes, the Transportation Department said.The Federal Aviation Administration (FAA) said last week it did not plan to extend the July 1 deadline before new rules take effect prohibiting certain landings in low-visibility conditions without upgraded altimeters.Tuesday was the first time in recent months Buttigieg has weighed in on the July 1 date after some airlinespressedhard for a deadline extension.The International Air Transport Association, which represents more than 100 carriers that fly to the United States, said on Tuesday, \"Supply chain issues make it unlikely that all aircraft can be upgraded by the 1 July deadline, threatening operational disruptions during the peak northern summer travel season.\"Concerns that 5G service could interfere with airplane altimeters, which measure a plane's height above the ground, led to brief disruptions at some U.S. airports last year as international carriers canceled some flights.",
        "Last year, Verizon and AT&amp;amp;T voluntarily agreed to delay some C-Band 5G usage until July 1 as air carriers worked to retrofit airplane altimeters. IATA said Tuesday that \"more is needed\" and said many airlines will have to retrofit most of their aircraft twice in just five years.On March 31, four major U.S. wireless carriers agreed to some voluntary actions to address aviation safety concerns and allow full use of the C-Band wireless spectrum for 5G use.Acting FAA Administrator Billy Nolen said last week the FAA has \"given airlines until July of this year to retrofit. Now upon we get to July 1st, if they haven't retrofitted, meaning they will not be able to take advantage of lower visibility approaches that may result in a divert.\" Nolen added that if airlines they have not retrofitted by next year \"they will not be able to operate\" in U.S. airspace.The agreement with Verizon, AT&amp;amp;T, T-Mobile US and UScellular followed extensive discussions with the FAA, allowing carriers to increase power levels to get to full C-Band use by July 1.Separately, the FAA on Tuesday proposed seven airworthiness directives for many Boeing aircraft due to the potential for 5G C-band interference.The proposed directives impact 4,800 U.S. registered airplanes and 14,600 worldwide. They require revising aircraft flight manuals by June 30 to prohibit some landings and include specific operating procedures for calculating landing distances and certain approaches when in the presence of 5G C-band interference.",
        "Boeing said Tuesday that it \"continues to work with suppliers, regulators, the airlines and telecom companies to ensure long-term stability and help mitigate operational restrictions where possible.\"(Reporting by David Shepardson; Editing by Leslie Adler)"
    ]
}