{
    "articleURL": "/wires/reuters/article-12040969/More-100-arrested-European-swoop-Ndrangheta-crime-group.html",
    "content": [
        "Raids dealt 'serious blow' to 'Ndrangheta - minister",
        "Several people of 'high value' in group were arrestedInvestigation stretches from Europe to South America'Ndrangheta is the most powerful mafia group in ItalyChinese money brokers helped facilitate drugs trade(Adds details on ice cream parlour, arrests from Germany)ROME/BRUSSELS, May 3 (Reuters) - Police across Europe arrested more than 100 people on Wednesday in a massive crackdown that targeted the Italian 'Ndrangheta mafia, with suspects accused of drugs and weapons trafficking with counterparts in Latin America.\"Today's raids are one of the largest operations carried out so far in the fight against Italian organised crime,\" said German Interior Minister Nancy Faeser, adding they had \"dealt a serious blow to the `Ndrangheta.\"The swoop was part of an investigation spanning Italy, Germany, Belgium, Portugal, Spain, Slovenia, Romania, Brazil and Panama, according to European Union law enforcement agency Europol.The network was devoted primarily to international drug trafficking from South America to both Europe and Australia, Europol said in a statement.The network used Chinese money brokers in Italy and Colombia to arrange for funds to be moved to pay for drug deals, Italian police commander Massimiliano D'Angelantonio told a news conference.The 'Ndrangheta clans were also involved in running weapons from Pakistan to South America, supplying Brazilian criminal group PCC (Primeiro Comando da Capital) in exchange for cocaine shipments, Europol added.",
        "The 'Ndrangheta, which has its roots in the southern Italian region of Calabria, has surpassed Cosa Nostra as the most powerful mafia group in the country, and one of the largest criminal networks in the world.Some of the 'Ndrangheta families targeted have been involved in clan feuds culminating in mass shootings, including the killing of six people in the German city of Duisburg in 2007, according to Europol.ICE CREAM PARLOURProfits were recycled through real estate, restaurants, hotels, car wash companies, supermarkets, and other commercial activities.In Germany, investigators targeted an ice cream parlour in the northwestern town of Siegen, which they suspected was being used to launder money and as a strategic hub for the 'Ndrangheta.Investigator Oliver Huth told reporters they found Italians from Calabria there, some of whom were believed to be involved in drugs while others had links to killings or murders. The cafe has been shut down.Assets worth 25 million euros ($27.6 million) were seized in Italy, Germany, Portugal and France in \"Operation Eureka,\" launched in 2019 initially to investigate drug smuggling between Calabria and the Belgian city of Genk, according to Italian police.\"We think that among the arrests were several persons of a high value who played a huge role in the organisation, not only in Belgium but in other European countries,\" said Belgian federal prosecutor Antoon Schotsaert.",
        "Belgian police said they had arrested 13 people.A total of 108 people were arrested in Italy and other EU countries on the orders of police in the southern city of Reggio Calabria, Italian police said.Related investigations led to the arrest of 24 people in Germany, they said, as well as a further 53 detentions in northern Italy. The interior minister of the German state of North Rhine-Westphalia said 18 of the arrests were made there. ($1 = 0.9076 euros)Read more about the 'Ndrangheta in this FACTBOX.(Reporting by Maria Sheahan, Madeline Chambers, Federico Maccioni, Philip Blenkinsop, Charlotte van Campenhout and Emilio Parodi; Writing by Keith Weir; Editing by Bernadette Baum)"
    ]
}