{
    "articleURL": "/sport/football/article-12058923/Why-Liverpool-end-dour-season-high-qualify-Champions-League.html",
    "content": [
        "Liverpool are just one point behind Man United after their rivals dropped points Jurgen Klopp's side have a chance of top-four despite a miserable seasonLiverpool are keen on signing Mac Allister but are yet to make Brighton an offerIt would have taken the most optimistic of Liverpool fans to believe they had a chance of finishing inside the top four just a matter of weeks ago.",
        "After their 2-2 draw with Arsenal on April 9, the Reds were 12 points behind Newcastle and Manchester United with nine games left to play.Since then they have won six games on the trot and after their slim victory over Brentford at the weekend, are only one point behind their greatest rivals - though the Red Devils do have a game-in-hand.Jurgen Klopp knows the task at hand - 71 points is the magic number. His Liverpool side need to win their remaining three games and hope that Manchester United drop points in two out of their remaining four games.Should the Reds do this and qualify for next season's Champions League, it would salvage a season which looked dead and buried, and give them a massive lift going into what is expected to be a busy summer. ",
        "United boss Erik ten Hag will have concerns following the nature of his side's display in their 1-0 defeat to West Ham on Sunday and the fact that they failed to score for the second game in a row. ",
        "Newcastle - Need to win two out of their remaining four games and maintain their goal difference advantage over Liverpool Manchester United - Due to their inferior goal difference in comparison to Liverpool, they will need nine points from their final four games or hope Jurgen Klopp's side drop pointsLiverpool - Win all three games and hope that United drop points in two games or that Newcastle lose points in three games - including two defeats. Though two defeats for Newcastle could be enough if the Reds overturn their goal difference deficit ",
        "It wasn't just David de Gea's poor reactions for the decisive 27th minute Said Benrahma winner, it was the fact the Hammers deserved to win by more. The Hammers had what appeared to be a stonewall penalty for Victor Lindelof's handball turned down, while the sight of players including Bruno Fernandes pointing and moaning at team mates during the match brought back memories of their miserable year before Ten Hag's arrival.While there is no doubt that the Dutchman has changed things around since he joined the Red Devils, much of his good work is at risk of being undone if they throw away a top-four spot. The fact that United have got themselves in this position at all shows the work that he still needs to do at Old Trafford, despite their Carabao Cup win and place in the FA Cup final papering over the cracks.Fortunately for the Red Devils, three of their final four games are to be played at Old Trafford.Their run looks favourable on paper but all it will take is two draws to undo their season if Klopp's side can make it nine wins in a row to end the season.Next up is Wolves who have won four out of their last six games in the top flight - though they also did suffer a 6-0 thrashing at the hands of Brighton.",
        "The last time these two sides met in the Premier League at Old Trafford it was Wolves who walked away with the victory after an 82nd minute Joao Moutinho strike when they met in January 2022. ",
        "United then travel to Bournemouth where they also suffered a 1-0 defeat on their last trip to the Vitality Stadium back in November 2019 - a season where the Cherries were relegated to the Championship. The Red Devils' penultimate game of the season comes on a Thursday night when they host Chelsea on May 25.Despite their miserable season, Chelsea held United to a 1-1 draw earlier this season, and in fact the two sides have drawn each of their last five meetings.The last time they beat Chelsea was a 2-0 triumph in February 2020, and it would be the perfect time for Ten Hag's side to put that right.United also have a miserable record on Thursday nights recently with their last two Premier League games on that day coming against Tottenham - where they blew a two goal lead - and the 1-0 loss to Brighton.They also were knocked out of the Europa League by Sevilla - a competition which they face the risk of going back to if they can't turn around their form in the final weeks.",
        "The final game of the season could be a high-tempered affair when the Red Devils play Fulham, with Aleksandar Mitrovic back from suspension with a whiff of revenge in the air after the FA Cup bust-up involving both sides. While United are the side most at danger of dropping out the top-four, there is also a small chance that Newcastle could slip out.",
        " MANCHESTER UNITEDWolves (H) May 13 3pmBournemouth (A) May 20 3pm Chelsea (H) May 25 8pmFulham (H) May 28 4.30pm LIVERPOOL Leicester City (A) May 15 8pmAston Villa (H) May 20 3pmSouthampton (A) May 28 4.30pm ",
        "However, it would take an even bigger collapse for the Magpies, who are three points ahead of Liverpool with a game-in-hand.Their superior goal advantage (+32) compared to Liverpool's (+25), means they would likely need to either suffer two heavy defeats, or two losses and a draw to finish behind the Reds.But realistically, two wins out of their remaining games should be enough to finish inside the top-four - whether it is alongside Manchester United or Liverpool.Newcastle's next game is a trip to Leeds before they face what could be a tricky home tie with Brighton.They finish off the season at home against relegation battlers Leicester City, before travelling to Chelsea on the final day of the season.",
        "Liverpool meanwhile have a favourable run-in on paper, though their next two games are potential banana skins. They travel to Leicester on the evening of May 15 at what should be an electric King Power Stadium given their battle to avoid relegation, before they host Aston Villa in the final game of the season at Anfield.The Reds then finish off the season against Southampton, who, unless they are on their way to a Great Escape, could very well already be relegated at this point.Outside those three teams it looks unlikely anybody else will be able to make the top-four.Tottenham will have to win their three remaining games and hope Manchester United take no more than three points from their four games.Brighton have two games in hand which could see them go two points behind United, but it would take an incredible run for them to make the Champions League - especially with matches against Arsenal, Newcastle, Man City and Aston Villa to come.",
        "After Liverpool's 2-2 draw with Arsenal on April 93. Newcastle - 56 points (Played 29)4. Man United - 56 points (P29) 5. Tottenham - 53 points (P30)6. Aston Villa - 47 points (P30)7. Brighton - 46 points (P28)8. Liverpool - 44 points (P29) After Man United's 1-0 loss to West Ham 3. Newcastle - 65 points (P34)4. Man United - 63 points (P34)5. Liverpool - 62 points (P35)6. Tottenham - 57 points (P35)7. Brighton - 55 points (P32)8. Aston Villa - 54 points (P35) ",
        "So it appears to be down to Liverpool who have flown into the mix from nowhere following their six wins on the bounce. And given their ability to rattle off win after win when they do hit their stride under Klopp, it would be no surprise to see them push the teams ahead of them all the way. Though logic would suggest that Manchester United will get enough points from their final games, they are now looking over their shoulders and this will be a real test of character for Ten Hag's side.If they throw away a top-four spot to their biggest rivals - despite facing four teams with little to play for - it will be a huge blow to their progress under Ten Hag and make his job that much bigger this summer. "
    ]
}