{
    "articleURL": "/wires/ap/article-12057261/Hyderabad-wins-IPL-no-ball-drama-Gujarat-control.html",
    "content": [
        "JAIPUR, India (AP) - Abdul Samad stayed calm amid an unexpected ending as Sunrisers Hyderabad beat Rajasthan Royals by four wickets in the Indian Premier League on Sunday.",
        "It was IPL drama at its best as Sandeep Sharma needed to defend 17 off the last six balls at Jaipur. He gave away 12 runs off the first five balls, and then Samad was out caught off the last one, only for it to be deemed a no ball.Samad quickly smacked the free hit for six as Rajasthan lost a game it thought it had won just a minute earlier.Samad finished with a run-a-ball 17 not out, with Glenn Phillips´ 25 off seven balls making the chase possible. Hyderabad finished on 217-6, propelled by Abhishek Sharma´s 55 off 34.Jos Buttler rediscovered his form to score 95 off 59 balls as Rajasthan finished on 214-2.Buttler scored his first half-century after six innings and hit 10 fours and four sixes. It was his fourth half-century of the season.",
        "He put on 54 off 30 balls with in-form Yashasvi Jaiswal (35) and then added 138 off 81 balls with skipper Sanju Samson for the second wicket.Samson scored a half-century after five innings - 66 off 38. He hit four fours and five sixes as Rajasthan recorded its highest total of the season.In reply, Abhishek Sharma put on 51 off 35 balls with Anmolpreet Singh for the opening stand. Sharma hit five fours and two sixes.",
        "Rahul Tripathi egged the chase on with 47 off 29 as he put on 65 with Sharma. Hyderabad seemed to be cruising at 116-1 in 12.3 overs when Sharma fell to Ravichandran Ashwin.Yuzvendra Chahal then picked up three wickets to damage the chase. He dismissed Tripathi, while Heinrich Klaasen was caught for 26. Chahal finished with 4-29 in four overs, including two wickets in the 18th over. He also trapped Aiden Markram lbw for six, shortly after sending back Tripathi.Glenn Phillips smacked 25 off seven balls to keep Hyderabad in the chase.Earlier, Gujarat Titans moved even closer to sealing its place in the knockout stage as it continued a dominant run against Lucknow Super Giants with a 56-run win.The defending champions top the table with 16 points from 11 games.Shubman Gill scored 94 not out off 51 deliveries as Gujurat piled up 227-2, its highest-ever total in the league. It was also the fourth highest total in the 2023 season.In reply, Quinton de Kock scored a 41-ball 70 to lead Lucknow´s chase but the visitors fell far short at 171-7.It was Gujarat´s fourth win against Lucknow since 2022.Gill notched up his second-highest individual score for Gujarat and put on 142 runs off 74 balls for the first wicket with Wriddhiman Saha.",
        "Saha scored 81, including 50 off 20 balls, as Lucknow didn´t have a response to their opening stand.Gill reached 50 off 29 balls, and overall hit seven sixes and two fours. Saha hit 10 fours and four sixes. They put on 100 off 50 balls.Lucknow got the breakthrough in the 13th over, but there was no respite for the bowlers as Gill put on a rapid 42 with Hardik Pandya (25) for the second wicket.David Miller provided the finishing touches with 21 not out as Gujurat easily exceeded the 200-mark.Lucknow made a fiery start in response as de Kock and Kyle Mayers (48) put on 88 off 50 balls for the opening stand.Playing his first game of the season, de Kock hit three sixes and seven fours, reaching 50 off 31 balls.Mayers also played an attacking knock with seven fours and two sixes. Lucknow seemed unstoppable while the pair was together at the crease.Mohit Sharma got the breakthrough for Gujarat as Mayers was out caught with Rashid Khan taking a spectacular running catch at deep fine leg. De Kock took charge and added 26 runs with Deepak Hooda, who scored only 11.The turning point came when T20 superstar Rashid Khan bowled de Kock in the 16th over.",
        "___More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports"
    ]
}