{
    "articleURL": "/tvshowbiz/article-12047697/Chrishell-Stause-shows-toned-physique-denim-minidress-21SEEDS-Tequila-x-Birdies-event.html",
    "content": [
        "Chrishell Stause showcased her toned frame wearing a denim minidress as she made an appearance at the 21SEEDS Tequila x Birdies launch party in LA on Wednesday. ",
        "The TV personality, 41, who recently appeared in the new season six trailer for Netflix's Selling Sunset, joined other celebrities at the fun event, such as former NFL player, Colton Underwood. The reality star opted for stylish comfort in a figure-hugging, strapless dress with a hem that stopped a few inches above her knees and was made of a light blue, denim material. She slipped into a pair of red and white Roadrunner sneakers that are a part of the exclusive collaboration between 21SEEDS Tequila and shoe brand, Birdies. Chrishell donned the Hibiscus color that contains two small tassels on top for a unique flare, and can be purchased at $165, according to the brand's official website. ",
        "Her long locks were parted in the middle and flowed down past her shoulders in light waves, with a few top strands pulled back away from her face. The star's makeup was classically done for the festivities, and comprised of a layer of mascara to her lashes as well as a shimmering shadow around her eyes. A glowy highlighter was added to her cheekbones for a touch of radiance, while a nude-colored, glossy tint was worn on her lips for a finishing touch. The realtor chose to not add any flashy pieces of jewelry to her ensemble to allow the dress and eye-catching sneakers to be the main focal point for the launch party. ",
        "21SEEDS Tequila and Birdies came together for the Top Shelf Sneaker collaboration, which was, 'inspired by empowered women who call the shots,' according to an official statement, per PRNewswire. The two companies, 'have teamed up to create a sneaker collection that embodies the brand's shared entrepreneurial spirit and missions – celebrating the everyday boss, whether she is running her own business, taking care of her friends and family, or tackling any challenge that comes her way.' Chrishell became one of the faces of the campaign, along with media personalities, Cynthia Andrew and Pam Arias. The tequilas which inspired the names of the three shoes, all priced at $165, include: Cucumber Jalapeno, Grapefruit Hibiscus, and Valencia Orange. ",
        "In photos taken at the event, the actress striked a few poses in front of a cocktail bar, and was surrounded by bottles of tequila, as well as mini cacti and a picture of the iconic Hollywood sign that contained hues of pink, orange, and green. She also jumped onto a pink golf cart that contained a hot pink seat and held a cheerful smile on her face while placing one hand on the wheel. Chrishell uploaded a reel on her Instagram stories as she enjoyed her time at the event that showed her spinning a wheel for a game and also toasting drinks with a pal as loud music played in the background. ",
        "'So much fun!!!' she penned in a caption added towards the bottom of the clip, adding, 'Tequila &amp; sneakers?! Best pairing ever!! @birdies + @21seeds #girlscalltheshots.' As a partner of 21SEEDS and a face of the campaign, she also paused for a snap while mixing a drink in a shaker and offered a link to the collection. 'Click for natural infused tequila &amp; cute sneakers-WOMEN created companies!!!' Also in attendance at the launch party was TV personality and former NFL player, Colton Underwood. He striked a pose near a hot pink coach that was covered with colorful, patterned pillows. The star slipped into a pair of light blue, denim jeans as well as a plain, white T-shirt which was layered with a tan-colored jacket that he chose to leave unzipped. He slipped into a pair of white sneakers to complete his ensemble. Colton later joined Hacks actor, Johnny Sibilly, who donned white pants along with a blue-striped, button up. He slipped into a pair of the Valencia sneakers from the collaboration, which are priced at $165. ",
        "Shortly after she attended the event, the new trailer for Selling Sunset season six dropped on Thursday. The show, which brings in new stars, such as Brie Tiesi and Nicole Young, is slated to air on Netflix later this month on May 19. ",
        "The clip, which lasted for over two minutes, teased plenty of drama and heated arguments between the realtors at the Oppenheim Group.   The trailer introduced Bre strutting her stuff in a string of glamorous, busty ensembles and promising to 'show the caliber of houses I can sell.'But it was her unconventional love life that drew attention from Chelsea, who said crisply: 'As a Christian, I find Bre's relationship rather off-putting.'Nick has 12 children with six different women, with five of them arriving in 2022 alone amid his open relationship with Bre. 'Who I have children with is my business,' Bre defiantly said in the new trailer for Selling Sunset. 'I don't need a judge and a jury.'At one point Bre said of one of her co-stars, who remained unnamed in the trailer: 'She just can't take accountability for what comes out of her mouth.' Even early on in the trailer, as Bre is being introduced, Chelsea was seen to remark: 'People say there's something alluring about mystery. I can't stand it.'Nicole on the other hand has entered into a professional rivalry with Chrishell, and over the course of the trailer, tension mounted between the dueling blondes. 'I've been at the Oppenheim Group for over eight years,' Nicole said by way of introduction. 'Real estate's everything for me.' However she swiftly landed in the snake pit of Selling Sunset drama, prefigured by Emma Hernan telling Chelsea: 'We have some bad f***ing eggs in the office!'",
        "'Chrishell will do anything that will benefit her,' Nicole hinted darkly in a confessional over a clip of her nemesis serving up a mischievous grin. Eventually the two women confronted each other over cocktails at the beach and Nicole laid out her grievances to Chrishell directly.Jason, who previously dated Chrishell, is seen moving on with Mary-Lou Nurk, and Mary Fitzgerald was saddled with the task of deputizing for him while he jetted off to Europe amid their blossoming romance. When Mary brought a problem to Jason, he sloughed her off with: 'I'm not handling it,' and when she protested: 'Yes, you are,' he said: 'You're handling it!'Chelsea summed up the ructions to come within the cast, teasing with undisguised excitement: 'Light that fuse - boom!'"
    ]
}