{
    "articleURL": "/wires/reuters/article-12038151/Soccer-Napoli-brink-Serie-A-title-Udinese-trip.html",
    "content": [
        "Napoli could become champions before Thurs Udinese match",
        "Lazio must beat Sassuolo on Weds to keep race aliveDi Maria back in action for JuventusBy Tommy LundMay 2 (Reuters) - Napoli are on the brink of claiming their first Serie A title in 33 years despite failing to win at home last weekend, and they may not even have to play to get their hands on the Scudetto this week and kick off a long-awaited party in Naples.The league leaders are 18 points ahead with only six games left to play, and they will be crowned champions if second-placed Lazio fail to beat Sassuolo at the Stadio Olimpico on Wednesday, a day before Napoli themselves play away at Udinese.Luciano Spalletti emphasised how sluggish his once invincible squad were after a tough month in April where they managed only two wins in seven games in all competitions and crashed out of the Champions League.\"We are currently lacking the sharpness and quality that we had earlier in the season because just like a marathon, the final kilometre is the toughest,\" he said.Depending on the Lazio result, Spalletti said he may rest senior players, while Matteo Politano and Mario Rui will most likely miss the clash due to injuries.Udinese could attempt to spoil Napoli's party just as Salernitana did at the weekend and salvage some points from a lacklustre campaign with the team now 13th, well away from both the relegation zone and the European qualification spots.",
        "Top scorer Beto is expected to return from a back injury for the hosts, giving the home fans hope for a positive outcome.JUVE DRY SPELLAfter having their 15-point deduction overturned in April, Juventus now find themselves in a very different position as they jumped from seventh to third, reigniting their Champions League qualification hopes.But they have taken only one point from their last four matches and lost to Inter in the Coppa Italia semi-final.\"We had won many games in February and March. We were involved in three competitions until last week, which means the season is going well,\" manager Massimiliano Allegri said.On paper they are the favourites again when 16th-placed Lecce visit on Wednesday.In their 1-0 victory against Udinese on Friday, Marco Baroni's Lecce broke an eight-match winless streak but they remain only four points ahead of Hellas Verona in 18th.Juve will welcome back winger Angel Di Maria from an ankle injury which kept him out of Sunday's draw at Bologna as they seek goals, having scored only three in six games.Lazio, who had been exceptionally consistent in the league in recent months, losing just one match since early January, have lost their last two Serie A games and seen their lead over third-placed Juve cut to just one point.",
        "Maurizio Sarri will have an almost complete squad at his disposal against Sassuolo, including striker Ciro Immobile and defender Luca Pellegrini.AS Roma, AC Milan and Inter Milan are all on 57 points as they battle it out for the final Champions League spot.Simone Inzaghi's Inter returned to fourth with a win over Lazio on Sunday and his side travel to Verona on Wednesday, while AC Milan welcome second-to-bottom club Cremonese.Injury-hit AS Roma, who are sixth, travel to 10th-placed Monza on Wednesday while seventh-placed Atalanta host Spezia. (Reporting by Tommy Lund in Gdansk; Editing by Hugh Lawson)"
    ]
}