{
    "articleURL": "/wires/ap/article-12040227/Ramirez-homers-Rays-beat-Pirates-matchup-teams.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Harold Ramírez homered and drove in two runs to lead the Tampa Bay Rays over the Pittsburgh Pirates 4-1 on Tuesday night in a matchup of teams with the top two records in the major leagues.",
        "Ramírez drove in the game´s first run with an RBI single in the fourth and boosted the lead to 4-1 with a solo homer in the sixth against Roansy Contreras (3-2). Contreras allowed four runs and six hits in 5 1/3 innings.Tampa Bay left-hander Josh Fleming left in the fifth after taking Ke´Bryan Hayes´ hard-hit single off his left foot. The Rays said initial images didn´t show a fracture.Colin Poche (3-0) replaced Fleming in the fifth and gave up a double to Bryan Reynolds and Carlos Santana´s tying sacrifice fly. Hayes called safe on a close play at the plate that stood after a video review. Jason Adam worked the ninth for his first save this season.ORIOLES 11, ROYALS 7KANSAS CITY, Mo. (AP) - Ryan Mountcastle hit two-run homers in consecutive innings and finished with five RBIs, Adley Rutschman had four hits and drove in a run, and the streaking Baltimore earned its 16th win in the last 20 games.",
        "Tyler Wells (2-1) allowed three hits over six innings but they were all homers: Bobby Witt Jr.´s leadoff rocket, a two-run homer by MJ Melendez and a solo shot by Salvador Perez. Wells also walked three and struck out four.Ryan Yarbrough (0-4) matched a Royals record by striking out the first five Baltimore batters, including Mountcastle, before things fell apart in the fourth. The power-hitting first baseman followed a double by Rutschman with his first two-run homer, and Yarbrough was pulled after 3 2/3 innings as the Orioles batted through the lineup and scored five times.",
        "Mountcastle added another two-run shot off Jose Cuas in the fifth, his eighth homer of the season, then added a run-scoring double in the sixth.BRAVES 6, MARLINS 0MIAMI (AP) - Bryce Elder outpitched NL Cy Young Award winner Sandy Alcantara by throwing seven innings of three-hit ball and Atlanta shut out Miami.Ozzie Albies homered and doubled, while Ronald Acuña Jr. doubled, drove in a run and stole his NL-leading 14th base for the Braves. Elder (3-0) struck out six and induced 10 groundouts in his longest start of the season.Alcantara (1-3) has a 7.40 ERA and lost three of his four starts since throwing a complete game shutout against Minnesota on April 4.The Braves chased Alcantara after five innings and 103 pitches. Alcantara gave up three runs, six hits, walked three, struck out five and hit two batters.ROCKIES 3, BREWERS 2DENVER (AP) - Elías Díaz homered and drove in the go-ahead run with an eighth-inning single, and Colorado has won its last two home games after dropping seven straight at Coors Field.Rookie shortstop Ezequiel Tovar hit his first major league home run for Colorado.C.J. Cron led off the eighth with a double off Peter Strzelecki (2-1), and Díaz singled to bring home pinch-runner Yonathan Daza.",
        "Justin Lawrence (1-1) worked a scoreless eighth and Pierce Johnson handled the ninth for his fourth save.RANGERS 6, DIAMONDBACKS 4ARLINGTON, Texas (AP) - Ezequiel Duran hit a go-ahead, two-run homer in the sixth inning, and Texas matched its longest winning streak of the season at four.Marcus Semien and Travis Jankowski cut the deficit to 4-3 with RBI singles in the fifth off Zac Gallen, who entered the game with a 28-inning scoreless streak, the longest in the big leagues.Scott McGough (0-3) relieved to start the sixth and allowed a two-out single to Jonah Heim. Duran drove a 1-1 fastball 431 feet to center for his third homer this season and a 5-4 lead. Duran finished a triple shy of the cycle.Brock Burke (2-0) pitched 1 1/3 hitless innings, and Will Smith got four outs for his fourth save.Rangers starter Jon Gray gave up four runs and eight hits in 5 1/3 innings, raising his ERA to 4.40.RED SOX 7, BLUE JAYS 6BOSTON (AP) - Connor Wong hit two homers, including a tie-breaking solo shot in the eighth, to help Boston rally past Toronto.Masataka Yoshida and Christian Arroyo also homered for Boston and the Red Sox tied a season-high for hits with 14, including four by Wong.",
        "Wong also had a double in the second that bounced just below the yellow line at the top of Fenway Park´s iconic left-field wall.Reliever Richard Bleier (1-0) got the win and Josh Winckowski picked up his first save. Erik Swanson (1-1) took the loss.Daulton Varsho hit a three-run homer for the Blue Jays in the sixth and Vladimir Guerrero Jr. finished with a pair of singles and two RBIs.WHITE SOX 3, TWINS 2, 10 INNINGSCHICAGO (AP) - Andrew Benintendi robbed Carlos Correa of a homer and hit a game-ending single in the 10th inning, and Chicago earned its second straight win after a 10-game losing streak.Hanser Alberto opened the 10th on second as the automatic runner and advanced on Elvis Andrus´ sacrifice. Tim Anderson bounced to shortstop and Benintendi lined a clean single into left against Caleb Thielbar (0-1).Eloy Jiménez homered and Michael Kopech pitched six effective innings for the White Sox.Jimmy Lambert (2-1) pitched a scoreless 10th for the win, which came hours after the White Sox made 11 roster moves.Minnesota wasted another stellar performance by Joe Ryan, who pitched six scoreless innings. Ryan allowed one hit, struck out seven and walked two, lowering his ERA to 2.37.DODGERS 13, PHILLIES 1",
        "LOS ANGELES (AP) - Bryce Harper went 0 for 4 with three strikeouts in his return to the Phillies just 160 days after Tommy John surgery, and Philadelphia lost to Los Angeles as Julio Urías allowed one hit and struck out 10 in seven innings.Miguel Vargas had four hits as the Dodgers scored 13 runs for the second straight night and set a season high with 17 hits.The only hit Urías (4-3) allowed was a home run to Trea Turner to lead off the fourth inning.Vargas and Mookie Betts both drove in three runs, and Freddie Freeman had a two-run homer in the eighth.Betts had three hits and is 9 for 21 over the past five games. His two-run single on a full count off Matt Strahm (2-3) in the second inning just got under the glove of Phillies second baseman Bryson Stott and extended the Dodgers´ lead to 3-0. Betts then lined an RBI base hit to center in the fourth to make it 4-1.GIANTS 2, ASTROS 0HOUSTON (AP) - Anthony DeSclafani pitched eight scoreless innings and Camilo Doval completed the three-hitter to lead San Francisco over Houston.Blake Sabol had an RBI double and Thairo Estrada added two hits to help San Francisco snap a four-game skid.",
        "DeSclafani (3-1) had retired 11 in a row after a double by Yanier Diaz with one out in the third before Yordan Alvarez doubled with one out in the seventh.But he was left stranded when DeSclafani retired José Abreu and Kyle Tucker to end the inning.Houston rookie Hunter Brown (3-1) yielded four hits and two runs while walking a career-high five batters for the loss in 4 1/3 innings.REDS 2, PADRES 1, 10 INNINGSSAN DIEGO (AP) - Jonathan India singled in the go-ahead run on Luis Garcia´s first pitch of the 10th inning and Cincinnati snapped San Diego's three-game winning streak.India´s single to left off Garcia (1-3) brought in automatic runner Matt Reynolds.Alexis Diaz walked Trent Grisham opening the bottom of the inning but then struck out Fernando Tatis Jr., retired Manny Machado on a fly ball to left and caught Juan Soto looking at strike three to earn his fifth save.Derek Law (1-4) pitched the ninth for the win.Michael Wacha held the Reds to two hits in six shutout innings and Nick Martinez pitched a perfect seventh before Cincinnati tied it 1-1 with two singles in the eighth. TJ Friedl singled with one out, stole second and scored on Jake Fraley´s two-out base hit to right.ANGELS 5, CARDINALS 1ST. LOUIS (AP) - Taylor Ward capped a four-run first inning with a three-run homer, Patrick Sandoval combined with three relievers on a four-hitter and Los Angeles beat St. Louis to extend the Cardinals´ losing streak to four.Mike Trout walked against Steven Matz (0-4) with one out in the first, Hunter Renfroe singled and Anthony Rendon hit a go-ahead single.Sandoval (3-1), coming off a victory over Oakland, won back-to-back starts for the first time since last May. Making his first appearance against the Cardinals, he allowed three hits and three walks in five-plus innings with four strikeouts.Chris Devenski, making his second appearance since he was brought up from the minors, relieved with two on in the sixth and pitched a perfect seventh.NATIONALS 4, CUBS 1WASHINGTON (AP) - Alex Call hit a two-run double during a three-run seventh inning, and Washington beat Chicago.CJ Abrams had the tiebreaking RBI single in the seventh off Keegan Thompson (1-2) as part of a 3-for-3 night. Victor Robles followed with an infield hit and Call doubled to the gap in left-center to make it 4-1.Trevor Williams, a former Cub, pitched into the sixth inning for Washington and departed with a 1-0 lead. Hunter Harvey (1-1) got the final out of the seventh, then allowed two baserunners in the eighth but got out of the inning when he caught Patrick Wisdom looking with a 98 mph fastball. Kyle Finnegan finished for his sixth save.Cubs right-hander Hayden Wesneski allowed one run on five hits over six innings.YANKEES 4, GUARDIANS 2NEW YORK (AP) - Willie Calhoun snapped a seventh-inning tie with his first home run for New York, which beat Cleveland to stop a four-game slide.Gerrit Cole settled down after a rocky start and rookie Anthony Volpe homered in the sixth to begin New York´s comeback from a two-run deficit.Cole struck out eight in six innings and remained unbeaten in seven starts this season with a 1.35 ERA. The right-hander needed 69 pitches to get through the first three innings but threw only 39 over the next three.With one out in the seventh, Calhoun lined an 0-2 curveball from James Karinchak (0-4) to right field for his first major league home run since April 11 last year with Texas.Wandy Peralta (2-0) got two outs and Michael King worked 1 2/3 hitless innings for his second save, striking out three.MARINERS 2, ATHLETICS 1OAKLAND, Calif. (AP) - AJ Pollock homered to break up a combined no-hit bid with one out in the eighth inning and Jarred Kelenic added an RBI double as Seattle rallied past Oakland.Oakland´s Mason Miller pitched seven no-hit innings in his third major league start. He struck out six and walked four and was removed after 100 pitches.Richard Lovelady (0-1) took over in the eighth with a 1-0 lead but took his his first loss with the A´s.Seattle´s Bryce Miller retired his first 16 batters in his major league debut before Tony Kemp singled on a shoulder-high pitch in the sixth. After a wild pitch and a flyout, Esteury Ruiz hit an RBI double to put Oakland ahead.Bryce Miller struck out 10 in six innings, allowing one run and two hits. His 10 strikeouts were the most in a Mariners debut.Gabe Speier (1-0) struck out the only batter he faced for his first big league win. Paul Sewald struck out two in a perfect ninth to remain perfect in eight save chances.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}