{
    "articleURL": "/sport/football/article-12054433/Tottenham-1-0-Crystal-Palace-Harry-Kane-scores-Premier-Leagues-second-highest-goalscorer.html",
    "content": [
        "Tottenham ended their four-game winless drought beating Crystal Palace 1-0Kane moved to go second in the Premier League's all-time scorers rankings Ryan Mason's side now move up to sixth in the table to keep up European hopes  In this strange season of changing landscapes and extreme instability, some things remain the same and with another goal and another clatter of records toppling, Harry Kane delivered Tottenham a victory to halt their slide.",
        "Kane's winning goal, a header in stoppage time at the end of the first half, was his 26th of the season in the Premier League, and were it not for the magnificence of Erling Haaland at Manchester City we would be saluting his consistency with greater fanfare.Ten of them have been headers, a new Premier League record, and this one against Crystal Palace eased him onto 209 in the competition, clear of Wayne Rooney, into second and one closer to Alan Shearer's 260 at the top of the all-time charts.It damaged the Palace revival under his former England boss Roy Hodgson and produced the first win for Ryan Mason in his second spell as acting Spurs head coach, lifting them up to sixth with three games remaining.Kane even stepped in to assist at the back, clearing from beneath his own bar as Palace generated late pressure, and Tottenham held firm for a clean sheet.",
        "It was desperately needed after conceding 15 in their previous four games.'When you have your captain, leader, your goalscorer and one of the best players, setting that example it's what any coach wants,' said Mason. 'It's the team player, the humility. He's humble, he works hard, fights for the team, he's recovering, working back.",
        "'It probably doesn't get spoken about enough. We put all the attention on his goals. He's a joy to watch and we should appreciate in his country because he's a special, special player.'It was a reminder if required of Tottenham's reliance on their talisman.Mason, whose own playing career came to a premature end when he suffered a fractured skull, did not wish to tempt fate, regarding Kane's pursuit of the record.",
        "'I know from personal experience you can't plan too far ahead in football and in life,' he said but Hodgson, the England manager who gave both Kane and Mason their international debuts, backed him to catch Shearer and claim his place as the greatest goalscorer of the Premier League era.",
        "TOTTENHAM (4-4-2): Forster 6; Royal 7, Romero 7.5, Lenglet 7 (Dier 88'), Davies 7; Porro 7.5, Skipp 6, Hojbjerg 6, Son 6.5 (Danjuma 89'); Richarlison 6.5 (Kulusevski 79'), Kane 8.Subs not used: Austin, Sanchez, Perisic, Moura, Sarr, Bissouma.Goals: Kane 45+1'.Bookings: Davies, Lenglet, ForsterManager: Ryan Mason 7CRYSTAL PALACE (4-3-3): Johnstone 6.5; Ward 6, Andersen 7, Guehi 7, Mitchell 6.5; Eze 6, Doucoure 6, Schlupp 6 (Hughes 74'); Olise 6.5, Ayew 6 (Edouard 84'), Zaha 6.5.Substitutes not used: Guaita, Milivojevic, Lokonga, Mateta, Clyne, Richards, RiedewaldBookings: Schlupp, Ward, Ayew, Zaha, AndersenManager: Roy Hodgson 6Referee: Darren England 6Player of the Match: TBAVenue: The Tottenham Hotspur StadiumAttendance: 61,039",
        "'I would expect it,' said the Palace boss. 'At his age, with several good years ahead, he doesn't seem to be getting injured, touch wood. He's not missed a game this season.'The only thing between him and the record is to avoid serious injury and to get help from teammates, playing in a good team as he has been, if all those things are in place would expect him to get the record.'Ultimately, Kane was the difference and on a day when the Premier League's youngest manager came up against the oldest, Mason could take satisfaction from a decision to tweak his system and revert to a back four.It was a bold move less than a fortnight after the unmitigated disaster at Newcastle, where Spurs also started with four at the back, conceded five within 21 minutes and lost 6-1.Cristian Stellini did not survive that debacle and they have played with three centre halves since, but Emerson Royal and Ben Davies were both available to offer greater solidity and Pedro Porro eased forward onto the right side of midfield.Porro's defensive strengths are questionable but his fine delivery is not and he caused an array of problems for Palace. His was the cross for the only goal of the game at the end of a fairly even first half.",
        "Kane linked up with the move in the style of a classic centre forward, receiving a pass from Davies and hooking it wide to the right, then drifting into the penalty area and springing high behind Joel Ward to score from six yards.Among the assorted records, this was his 50th over in Premier League London derbies.Until then, Tottenham had been at their most threatening from corners. Cristian Romero headed against the bar from a Porro inswinger and went close again on the half-hour. This time he did not connect with the same power but Ward sliced an attempted clearance and it flashed behind his own goal.At the other end, the best openings fell to Michael Olise, who wriggled past Clement Lenglet but could not beat Fraser Forster, and Joachim Andersen who forced another chance over.Wilfried Zaha became more influential in the second half and went close with a snapshot soon after the interval.",
        "Eberechi Eze dragged a chance wide following a swift counterattack, featuring a pass out of defence by Marc Guehi and a run by Zaha, but they rarely penetrated Tottenham's defensive unit.As they took risks, Palace needed their own goalkeeper Sam Johnstone to be alert to stop them slipping further behind.Johnstone made fine saves from a deflected Porro shot and at the feet of Heung-min Son, racing clean through onto a long ball out of defence by Romero.",
        "None of it was especially easy on the eye. One goal settled it and it came from Kane. Some things don't change."
    ]
}