{
    "articleURL": "/wires/pa/article-12061427/Concern-Huntington-s-patients-turned-away-mental-health-support.html",
    "content": [
        "Many people with Huntington’s disease are being turned away from traditional mental health support, a charity has claimed as it called for more to be done to help people with the condition.",
        "Some mental health services have told patients that they do not have the specialist care needed, leading to the Huntington’s Disease Association calling for better help and support for people living with the disease.Huntington’s disease is a condition that stops parts of the brain working properly over time and can lead to problems with movement, cognition (perception, awareness, thinking, judgment) and mental health.Most people with the inherited condition will start to show symptoms between the ages of 30 and 50 and it gradually gets worse for around 10 to 25 years until the person dies. During all this time, my mental health was worsening. I’d seen my uncle commit suicide a few years before after his diagnosis and him not receiving the correct support and I was at a similar point  Daniel Johnston  There is no cure for Huntington’s disease or any way to stop it getting worse.A small new poll of 105 people with the condition, shared with the PA news agency, found that 85% had attempted to access community mental health services.But among this group, 56% claimed they had been denied access to care, the Huntington’s Disease Association said.Daniel Johnston, from Horam, East Sussex, said his local mental health service “didn’t know” where to refer him.",
        "The 41-year-old father of two said: “When I tested positive for Huntington’s, there was no specific pathway from that point for any mental health support.“I was confused, upset and angry about the diagnosis. I didn’t, and still don’t, fully understand my feelings of confusion and anger.“I wasn’t referred to a professional psychologist or anyone who knows how to support someone with a life-changing diagnosis such as Huntington’s.“During all this time, my mental health was worsening. I’d seen my uncle commit suicide a few years before after his diagnosis and him not receiving the correct support and I was at a similar point.“It was only when I explained to my consultant in our six-monthly appointment earlier this year the extent of my thoughts that he contacted the crisis team for me, and they began a course of daily calls for two weeks.“From this point onwards it’s been getting better, but I feel so sad for others who slip through the net so easily.",
        "“It’s as if people get afraid when you mention Huntington’s and there’s confusion around treating Huntington’s and treating mental health.“I’m not surprised by the amount of people being denied access to mental health support services due to having Huntington’s – I have been one of those people and it’s really scary.”",
        "The charity said hurdles often occur for patients after they have been referred by their GP for mental health support.Local mental health teams have told patients that Huntington’s “doesn’t fall under the remit of what they’re able to provide treatment for”.The charity has launched a new campaign, Mindful of Huntington’s, to raise awareness of the cognitive impairment symptoms of the disease, and has called for greater access to mental health support.Cath Stanley, chief executive of the Huntington’s Disease Association, said: “Many people think of Huntington’s as a disease which impacts movement, but that is only half the story, and the non-physical symptoms are often overlooked.“At the Huntington’s Disease Association, we find people will most commonly be referred to mental health services due to cognitive symptoms such as irritability and aggression.“Throughout May, we will be focusing on these cognitive symptoms and the life-changing impact they can have.“The stark findings we’re announcing can’t be ignored – people are asking for much-needed mental health support, being turned away, and their health is deteriorating further. It is disappointing but not surprising to see that there’s still a lot of misunderstanding around Huntington’s.”– To find out more visit: www.hda.org.uk"
    ]
}