{
    "articleURL": "/sport/afl/article-12059155/Collingwood-fans-turn-club-Pies-condemned-booing-Buddy-Franklin.html",
    "content": [
        "Buddy Franklin was loudly booed by Collingwood fans at the MCG on SundayThe club and Pies boss Craig McRae have apologised to the AFL superstarCollingwood legend Nathan Buckley called out the fans for booing  A number of Collingwood fans have criticised the club for apologising to Sydney star Buddy Franklin after he was booed by Pies supporters on Sunday.",
        "Franklin, who finished goalless in the Swans' 29-point loss, was loudly booed and jeered almost every time he touched the Sherrin in the first meeting between the two sides at the MCG in a decade.In a statement on Monday, Collingwood condemned the behaviour of the supporters. 'We apologise to the Sydney Swans and to Lance ‘Buddy’ Franklin,' the statement, which was attributed to captain Darcy Moore, coach Craig McRae and CEO Craig Kelly, said.'The club does not support booing champions of the game.",
        "'Yesterday was the first time we played the Swans at the MCG in a decade – it provided an opportunity to respect a champion of the game and we fell short.'Buddy is a great of Australian Football – what he has achieved on the field over a long period of time demands a high level of respect.'While Collingwood's stance was praised by many on social media, several Pies fans felt the club had overreacted.One supporter suggested Collingwood's approach would 'turn fans off' the game, while several other fans noted booing players was part of the game and not exclusive to the Pies either.'Does this mean we can't boo Toby Greene next week? Or Cripps the week after that. Maybe provide us a list of who we can and can't boo,' a fan said, while another Magpies supporter said the club's statement would only serve to alienate fans.",
        "One supporter suggested the club should 'grow a spine' and noted Swans fans had booed an injured Jack Ginnivan last year.  Collingwood's response came after Magpies great Nathan Buckley and Sydney chief executive Tom Harley joined Swans coach John Longmire in denouncing the supporters who booed Franklin.Collingwood coach Craig McRae also disapproved post-match.",
        "'I love the Collingwood faithful, but I've got a message,\" Buckley told SEN on Monday.'Your team is the toast of the town, and they're handling themselves on and off the field with class and poise.'So, let's try and fall into line on the other side of the fence.'At best, [the booing] was a begrudging acknowledgement of the sustained brilliance Franklin has brought against Collingwood, and at worst, it's ignorance and bigotry.'",
        "Harley backed Longmire, who questioned why anyone would boo Franklin - a likely Australian football Hall Of Fame legend once he retires.'It's just really boorish behaviour and John Longmire's comments were absolutely spot-on,' Harley said.'We at the Swans are privileged to have seen Lance Franklin up close and personal for 10 years and [we're] in furious agreement with John.'When you look at the context of booing in the competition, of any player, unrelated to an incident during a game - it is just mindless and that was certainly the way I thought it played out yesterday.'",
        "Harley said the booing appeared to come from a minority and other fans needed to influence the poor behaviour.'Positive group action is generally the best way to stop this sort of behaviour,' he said.'I would assume the majority of people would think it's pretty boorish behaviour.'Harley was asked about Swans fans booing Collingwood young gun Jack Ginnivan last year during a game.",
        "'I don't think it's a great side of the game,' he said.He also noted the booing of Franklin did not appear related to anything specific that happened during Sunday's match.'He is one player who has given the game so much joy over a long period of time,' he said.Harley was also careful not to draw parallels with the booing of fellow Swans indigenous great Adam Goodes.That behaviour marred the end of Goodes' glittering career and was seen widely as at least partly race-related.Booing has been a hot topic this season, with Port Adelaide coach Ken Hinkley passionate in his support of Power youngster Jason Horne-Francis.",
        "Geelong star Tom Stewart had a different perspective on the issue, saying on Monday he expects 'a lot of noise' from Richmond fans during Friday night's match at the MCG.It will be the first time the two teams have played since Stewart was banned for four matches last June after his heavy hit poleaxed Tigers onballer Dion Prestia.",
        "'I'm not blind or naive to the fact they're a pretty strong supporter base,\" Stewart said of the Richmond faithful.'I will cop a lot of feedback [...] they're probably, fair enough, allowed to boo me. I probably deserve it, in this respect.'"
    ]
}