{
    "articleURL": "/tvshowbiz/article-12058143/Chrissy-Teigen-wows-lavender-cut-outfit.html",
    "content": [
        "  Chrissy Teigen showed she can rock any style from any decade when she slipped into a lavender sequin ensemble for a 1970s party she attended with her husband John Legend.",
        "The couple documented their night out on the disco floor with a slew of photos and videos they posted on their Instagram pages.The model and television personality oozed the era glitz and glamour as she snuggled up next to her leading man decked out in skin-tight pants with a healthy dose of feathers along the legs from her knees on down.In fact, there was enough feathers on the front part of each pant-leg that they actually covered up most of her matching sequin shoes. 'I would have either despised the 70s (dancing/sequins) or flourished (drugs/jello molds) I can't decide…,' she confessed in the caption showing them sharing some seductive stares to each other.'Thank you @dianebuzzetta @rikkigash @alanavanderaa.' ",
        "In another added touch, the fashionista's pants also had a row of white fringe hanging along the front, just below her stomach.That fringe could also be found hanging from the matching, shoulder-less crop top that almost resembled a bra with its small size, which helped showcase her fab figure.Now mind you, the former Sports Illustrated Swimsuit Issue model has only just given birth to their third child, a daughter they named Esti, on January 13, which is just four months ago.The mother of three also accessorized with a purple feathered boa that hung from both of her ams throughout the shoot and the evening.",
        "She would also don a blingy headdress of sorts with small stars over her brown tresses that she wore long, straight and flowing down to her waistline in the front and back.While Legend, 44, went with a white suit that resembled the one John Travolta wore as Tony Manero in the hit dance drama film Saturday Night Fever (1977), it turns out he didn't have to look beyond his own closet to find it.'70’s party last night with my queen,' the musician began in his own Instagram post, 'Since time is a flat circle, my 2023 closet already had this suit.'The You &amp; I star was a perfect match with his wife when he wore a shiny lavender shirt that he left unbutton down past his chest, of course.",
        "In the first video of the post, Teigen briefly looks toward the camera and then quickly turns to face her husband, as the two begin to share seductive looks to each other.Eventually, Legend faces towards the camera, but his lady steals a few more looks before shifting back face-forward.There's also a second clip, a boomerang, that gives a closeup look at Teigen's face, headdress, and feathered boa, which she made sure to get into the shot.By the time the couple made it to the 70s-inspired bash, Teigen met up with some of her gal pals, which she documented with a couple of photos that included Meghan Mackenzie Dillon.",
        "Dillon also through in some feathers into her fashion choice by wearing a black, red and white-patterned mini dress with black feathers along bottom, while their friend checked off a 70s box with bell-bottom pants",
        "While outside the venue of the party, the Delta, Utah native sat down on the curb of the sidewalk and struck a pose all wrapped up in her feathered boa. In a follow-up post, Teigen shared a video of Legend sitting with a couple of their male friends, Luke Dillon and Mike Rosenthal, which showed them sharing some laughs together.For her third Instagram post, the former Lip Sync Battle co-host posed with her two lady friends in the venue and at their table that they appeared to be sharing together.It's likely Teigen and Legend were able to spend a night out alone by using her mother, Vilailuck Teigen, as a baby sitter for little Esti and her sister Luna, seven and brother Miles, four.The happy couple will be celebrating their milestone 10th wedding anniversary on September 14."
    ]
}