{
    "articleURL": "/wires/reuters/article-12043209/US-FDA-approves-RSV-vaccine-GSK.html",
    "content": [
        "May 3 (Reuters) - The U.S. Food and Drug Administration has approved GSK Plc's respiratory syncytial virus (RSV) vaccine, the British drugmaker said on Wednesday, making it the first shot to be cleared for protection against a common respiratory disease that can be fatal for older people.",
        "The vaccine, Arexvy, was approved for people aged 60 and older, the company said.The approval makes GSK, which has been neck-and-neck with Pfizer in RSV vaccine development, the first company to tap into a multi-billion-dollar market and also puts it ahead of rivals such as Moderna Inc and Bavarian Nordic.Analysts have estimated the market for RSV vaccines to surpass $10 billion by 2030. Credit Suisse analysts expect $2.5 billion in peak sales for GSK's RSV vaccine for older adults.GSK expects the vaccine to be available before the next RSV season in the United States, Chief Commercial Officer Luke Miels told Reuters on Wednesday, ahead of the approval.He said the vaccine would be priced above $120 per shot provided the data from a study, which is expected soon, shows that it offers protection for two RSV seasons.RSV cases in the most recent season started last year in June and peaked in November, the U.S. Centers for Disease Control and Prevention (CDC) said.The question on how often the vaccine should be given is to be placed before CDC's panel of advisors on immunization. The RSV vaccination is a topic that is expected to be discussed, when the panel is set to meet in late June, a CDC spokesperson told Reuters.",
        "RSV is responsible for 14,000 deaths in adults aged 65 and older annually in the United States, according to government estimates.GSK's vaccine showed overall efficacy of 82.6% and was about 94% effective against severe lower respiratory tract disease associated with an RSV infection among participants aged 60 and older in its late-stage trial. (Reporting by Mariam Sunny, Raghav Mahobe, Bhanvi Satija and Aditya Samal in Bengaluru and Maggie Fick in London; Editing by Anil D'Silva and Shailesh Kuber)"
    ]
}