{
    "articleURL": "/wires/pa/article-12054239/Gun-salute-marks-coronation-celebrations-Northern-Ireland.html",
    "content": [
        "A 21-gun salute rang out from Hillsborough Castle in Co Down to mark the coronation of the King.",
        "The official ceremony took place in the village of Royal Hillsborough, the home of the royal residence in Northern Ireland.Under grey skies, the rain held off as 2,000 people gathered in the grounds of the castle to watch the coronation service live on a large screen.At the moment Charles was crowned at Westminster Abbey in London, the cannons were sounded by reservists from the 206 (Ulster) Battery of the 105th Regiment of the Royal Artillery.",
        "Assistant Commander Matt Wills, the most senior Army reservist officer in Northern Ireland, said it was a privilege to take part in the ceremony.He said: “Today is a fantastic day, it is the coronation of our new King and we are here celebrating it at Hillsborough Castle.“What a day to celebrate and what a venue to be at.“It is a hugely important day and in particular for the Army reserve in Northern Ireland.“The guns that were firing today at the royal gun salute are provided by the Army reserve from 206 (Ulster) Battery based in Newtownards and Coleraine.“It is an absolute privilege to be here and a privilege for the Army reserve to play such an important role on a day like today.”He said: “There are more than 2,000 people here. I wasn’t expecting that, I thought it would just be us, but they have all enjoyed the royal gun salute.”",
        "Adrian, a captain from 206 (Ulster) battery, described his pride at taking part in the gun salute.He said: “All of our reservists have gathered here today, they have all volunteered to take part in the coronation of his majesty the King and Queen Camilla.“The reservists take great pride in the job that they do. We sounded the gun salute following the death of the Queen – this is the closing of the loop with the coronation of his majesty.“This is now a chance for us to celebrate, rather than sound the gun salute on a sombre occasion.”The RAF and Navy were also represented at the ceremony. It is hugely important that Hillsborough is able to mark this historic occasion  Air Marshal Sean Reynolds  RAF Air Marshal Sean Reynolds, Air Officer for Northern Ireland, a former helicopter pilot, has flown with Charles and the Prince of Wales.He said “I am the RAF’s senior representative in Northern Ireland. I am here representing the RAF at the coronation celebrations here in Hillsborough.“It is hugely important that Hillsborough is able to mark this historic occasion.“This is an amazing place. When you see the history of the castle and the fact that his majesty designed these gardens and inside Hillsborough Castle there are a number of watercolours that he has painted are there.",
        "“He clearly has a lot of affection for the place and it is right that we are here to mark the occasion.”Later, a feu de joie (fire of joy), was sounded and the Royal Irish band played a beating of the retreat.",
        "Also taking part in the ceremony were the warders of the historic Hillsborough Fort Guard, which was first formed in 1660 and has taken part in every coronation event in the village since.Bugler for the Fort Guard Andrew Carlisle sounded the Royal Hillsborough Flourish, which he composed specially for the King, and which was first performed at the proclamation ceremony last year.Mr Carlisle said: “It is a very special day for the guard.“It is through big days like this that provide memories.”When Charles was crowned, a round of applause broke out among those watching the screen.Among them was Richard Shaw, who had taken his family from Belfast.He said: “It is a once-in-a-lifetime experience and we just had to come to be here on the day.“There hasn’t been a coronation for 70 years. It is an event the children will remember forever.”Elsewhere, crowds gathered to watch the ceremony live from public screens across Northern Ireland.The coronation was broadcast to spectators in Belfast City Hall, Antrim Castle Gardens, Jordanstown Loughshore Park, Coleraine town hall and in the Market Square in Lisburn.",
        "The ceremony was broadcast live at People’s Park in Ballymena, Town Park in Larne, Marine Gardens in Carrickfergus and Bessbrook town hall.Street parties and family fun days are also taking place over the bank holiday weekend.",
        "There was a celebratory mood on the loyalist Shankill Road in Belfast on Saturday where the street was bedecked with bunting and union flags.A new mural of the King was unveiled to mark the coronation, across the road from where another mural is dedicated to the late Queen.Local community worker Gary Lenaghan said the community on the street had come together to pay tribute to Charles.He said: “The mural came about because we wanted to do something special for the coronation.“When we saw the success we had of the mural across the road to her late Majesty, we went ahead and put all our efforts into one here.“If you look at the mural of His Majesty the King he is actually looking over at his mother.“If you take a photograph from the far side of the road they are looking at each other – that is deliberate.“It is something that the community wanted, it’s a lasting tribute and all the community can enjoy it.”",
        "Mr Lenaghan said the royal connections with the Shankill Road were deep.",
        "He added: “It’s a fact that the people of the Shankill, probably 90% or more of families here have sons, daughters or some sort of relatives in the armed forces.“So, the connection to the monarchy has always been here, you can see that in the flute bands and the marching tradition which comes from the Shankill.“The links to the monarchy on this road are very, very strong.“On a Saturday afternoon the Shankill is normally a lot, lot busier than it is today.“A lot of people have decided that rather than have their street parties today, most people have decided to stay at home to watch it and you will see the festivities continuing here over the bank holiday weekend.”",
        "In the nearby nationalist Falls Road, around 50 protestors held a white line protest against the coronation.The protestors stood in the middle of the road holding placards which read ‘Not Our King’.Big Lunch celebrations were held at Harpur’s Hill Primary School in Coleraine.David Radcliffe, school principal, said: “We had a fantastic Coronation Big Lunch with over 50 grandparents and senior citizens from our local community.”Northern Ireland was also represented at the ceremony in London, with pupils from Methodist College in Belfast forming part of the choir at Westminster Abbey, and the Church of Ireland Archbishop of Armagh and Primate of All Ireland, Most Rev John McDowell, presenting the Sovereign’s Orb at the service.",
        "Other Northern Ireland churches were represented by Rev David Nixon President of Methodist Church in Ireland, Rev Eamon Martin, Catholic Archbishop of Armagh and Primate of All Ireland and Rev John Kirkpatrick Moderator of the General Assembly of the Presbyterian Church in Ireland.Olympic gold medallist Dame Mary Peters was on parade behind the newly crowned King in her role as Lady Companion of the Order of the Garter.The leaders of all of Stormont’s main political parties attended the coronation service, including Sinn Fein vice president Michelle O’Neill and DUP leader Sir Jeffrey Donaldson.Ms O’Neill said she was attending the event to “represent the whole community” in Northern Ireland.Ms O’Neill tweeted: “My determination is to keep moving forward, and to represent the whole community.“The political landscape across our island is changing.“My focus is on building a shared future for all.”Ms O’Neill’s attendance at the event is seen as another demonstration of the markedly improved relations between the republican movement and the royal family since the peace process."
    ]
}