{
    "articleURL": "/wires/aap/article-12053075/Skywhale-family-soar-NSW-end-national-tour.html",
    "content": [
        "Two floating whales filled the sky at first light in regional NSW in their final stop on a National Gallery of Australia's Every Heart Sings Tour.",
        "Skywhale and Skywhalepapa's hot air balloon flight on Saturday morning in Tamworth marked the end of a three-year trek across far north Queensland and the Northern Territory through to the Adelaide Festival and the heart of Melbourne.Curator of Australian Art at the National Gallery of Australia, Elspeth Pitt, has followed the whales through the highs and lows of an unexpectedly protracted journey.\"It's been such an epic tour,\" Ms Pitt said, \"persevering through fires and floods, being able to visit communities around Australia was so important.\"It's a way to bring joy, excitement and connection to communities that have suffered through traumatic events.\"For Ms Pitt, who grew up in rural South Australia, connecting communities to art is deeply personal.\"We need to find ways to connect with communities across Australia,\" she said.\"It's the remit of the National Gallery to be truly national.\"Artist Patricia Piccinini has followed her creations across the country which have drawn a dedicated following of Skywhale 'superfans' to the flight locations.\"People made comic books, drawings, stickers. People dressed up as Skywhales who had special hats, they have definitely entered the realm of pop culture. They're totally beloved,\" Ms Pitt said.\"It's an amazing testament to Patricia, her passion and generosity.\"I can't think of any other work of art where people get up at 5am.\"",
        "While the flying creatures will soon be transported back to their home in Canberra, Ms Pitt is happy to share that it's not goodbye forever.\"One of the quirks of the Skywhales is they have to be inflated on a regular basis. It's part of the conservation of the work.They'll definitely be getting out into the skies a long way into the future yet.\""
    ]
}