{
    "articleURL": "/sport/nba/article-12061081/Nikola-Jokic-NOT-suspended-NBA-pushing-Phoenix-Suns-owner-Mat-Ishbia.html",
    "content": [
        "Nikola Jokic was unapologetic for pushing Mat Ishbia on Sunday nightHe was bullish for suggestions that he could be suspended for the incident DailyMail.com provides all the latest international sports newsNikola Jokic is free to compete in Game 5 for the Denver Nuggets against the Phoenix Suns, despite pushing Suns owner Mat Ishbia in Game 4 on Sunday.",
        "But while he has not been suspended, Jokic has been fined $25,000 according to ESPN.Jokic was whistled for a technical foul in the second quarter on Sunday when the big man tried to snatch the ball back from Ishbia, who was sitting courtside, and hit the new Suns owner with an elbow. Ishbia, a 5-foot-10 former Michigan State walk-on, flailed back down into his seat after being nudged by the 6-foot-11 Serbian center. As a result, Jokic was whistled for a technical, and the Suns were granted a free throw.Jokic scored 53 points for the Nuggets in Game 4 but the Nuggets were still narrowly beaten by the Suns with the score for the series moving to 2-2.",
        "The incident sparked debates after the Suns beat the Nuggets, 129-124, to even the second-round series at 2-2. Specifically, fans argued whether Ishbia flopped or if Jokic's contact was excessive.But on Monday, Ishbia wrote on Twitter that he hopes the NBA opts against banning the two-time MVP: 'Great win for the Suns last night in an amazing series so far! That should be and is the only story. 'Suspending or fining anyone over last nights (sic) incident would not be right. I have alot (sic) of respect for Jokic and don't want to see anything like that. Excited for game 5! Go Suns!'",
        "Jokic was unapologetic after the game.",
        "'The fan put the hand on me first,' Jokic said. 'I thought the league was supposed to protect us. Maybe I am wrong. I know who he is, but he is a fan. Isn't he?'It's good news for Nuggets coach Mike Malone, who felt that Jokic didn't deserve any punishment over the incident.'I think it's crazy that Nikola [Jokic] got a technical foul,' Malone told reporters. 'He's going to get the ball and some fan is holding onto the ball like he wants to be a part of the game.'Game 5 is on Tuesday night, back in Denver. "
    ]
}