{
    "articleURL": "/wires/ap/article-12044333/As-Haaland-breaks-goals-record-Guardiola-issues-warning.html",
    "content": [
        "MANCHESTER, England (AP) - As if the sight of Erling Haaland scoring his 35th Premier League goal of the season wasn't daunting enough for defenses across Europe, Pep Guardiola delivered an ominous warning to Manchester City's rivals.",
        "The Norwegian goal machine, who set a scoring record in English soccer´s top division on Wednesday, has only just begun.\"Of course this record will be broken sooner or later, maybe by him in the future,\" Guardiola said. \"He will score a lot of goals. His mentality is to score more, more. But when he scores, (he's like) `I want to score in the next action.´\"Haaland's 70th-minute strike in the 3-0 win against West Ham at Etihad Stadium helped fire City back to the top of the standings, one point above Arsenal with a game in hand.He moved clear of Alan Shearer and Andy Cole's previous record of 34 goals in a season - and with five league games still to play, could further extend his new benchmark.\"I have the feeling he will score goals for his mentality,\" Guardiola added. \"When you are anxious in both boxes you are not a good striker or defender and he is so calm.",
        "\"I learn a lot as a manager from this type of mentality.\"Those are telling comments from a manager who has coached some of the greatest goal-scorers of all time at Barcelona, Bayern Munich and City.Guardiola's Barcelona team included Lionel Messi, and at Munich he had Robert Lewandowski.",
        "At City, he inherited a team with Sergio Aguero, who would go on to become the club's all-time leading scorer.Haaland, however, has given a new dimension to a team that has already dominated English soccer since Guardiola took over in 2016.He has now scored 51 goals in all competitions in his first year in English soccer. On Wednesday, his achievement earned him a guard of honor from his teammates as he left the field.\"When there is a special occasion we have to show how special it is,\" Guardiola said. \"Today it was with Erling and to overcome the position of Andy Cole and Alan Shearer. They are incredible top strikers, so it´s special.\"It is not just the Premier League title that Haaland's goals are firing City toward, but the Champions League and FA Cup as well as the club pursues a treble of trophies.Guardiola is yet to win the Champions League without Messi, having won European soccer's elite competition twice with the Argentine great at Barcelona.It feels like Haaland could have a similarly inspirational effect on City to end his manager's search for a first European crown since 2011.\"We cannot achieve if the club does not provide us with great strikers, top quality players upfront. It´s not possible,\" Guardiola said.",
        "Haaland, meanwhile, does not seem to be distracted by his march toward the history books.\"We cannot keep thinking of these records, my head would become crazy so I don´t think of these things,\" he said. \"I will go home, play some video games and then sleep.\"Nathan Ake set City on course for a ninth-straight win in the league, heading in Riyad Mahrez' free kick in the 50th minute.Haaland's set his record when he lifted the ball over Lukasz Fabianski in the 70th and Phil Foden's deflected effort in the 85th sealed the win with the 1,000th goal of Guardiola's time in charge at City.LIVERPOOL CLOSE INLiverpool's Champions League hopes may be slim, but they are not over yet.Despite a disappointing season for the Merseyside club, a run of five league wins has moved it to within four points of fourth-place Manchester United.United has two games in hand, but will be conscious of its position as Liverpool applies the pressure in the final weeks of the campaign.Mohamed Salah's 39th-minute penalty secured a 1-0 win against Fulham as Jurgen Klopp's team finally found some consistency in the latter part of the season.\"We just have to win our games and see where it takes us,\" Klopp said. \"At the moment I´m happy with our direction. We just have to keep going and in the end we´ll look at the table and take what we can get.\"",
        "___James Robson is at https://twitter.com/jamesalanrobson___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}