{
    "articleURL": "/wires/reuters/article-12053437/Mets-face-Rockies-search-momentum.html",
    "content": [
        "The New York Mets have been among the majors' most underachieving teams this season, but general manager Billy Eppler isn't about to push the panic button.",
        "Eppler remains confident in the Mets, who continue a three-game series against the visiting Colorado Rockies on Saturday. New York had lost nine of 11 before winning the series opener 1-0 on Friday.Brandon Nimmo homered and Kodai Senga tossed six scoreless innings to help New York snap a three-game losing streak.Senga's outing provided a much-needed boost for the Mets' injury-plagued rotation. He allowed two hits while throwing a career-high 101 pitches.\"L's don't look good for this team,\" Senga said through an interpreter. \"We don't deserve L's. We shouldn't lose. That was just what I had in mind. To be able to contribute to a win was big for me.\"Players such as Starling Marte, Francisco Lindor and Pete Alonso are all batting under .240, but Eppler said it's only a matter of time before the proven veterans return to form.\"I believe in this roster,\" Eppler said. \"I believe in this team and the players that are here. There's too much track record, there's too much these guys have accomplished, there's too much know-how.\"After Colorado's season-high four-game winning streak came to an end on Friday, the Rockies will turn to left-hander Austin Gomber (2-4, 7.57 ERA). He allowed one run on three hits over six innings in a 12-4 win over the Arizona Diamondbacks last Sunday.",
        "Gomber, 29, lost four consecutive starts to begin the season before winning each of his last two outings.\"It's night and day, for sure,\" Gomber said. \"I can just tell. I'm excited to pitch again waking up on the day I pitch. I'm just really excited to pitch again and compete. That's kind of the biggest tell for me -- I just feel like I'm enjoying baseball again, like I always have. It's definitely way different than where I was a week or two weeks ago.\"Gomber has made two career starts against the Mets, going 1-1 with a 2.40 ERA across 15 innings.New York will counter with right-hander Tylor Megill (3-1, 4.11), who allowed three runs on four hits over 5 2/3 innings in a no-decision against the Atlanta Braves on Monday.Megill, 27, has yielded a total of 10 runs and 17 hits over his last three starts covering 14 2/3 innings after winning each of his first three outings. He is making his first appearance against the Rockies.Megill will face a potent Rockies lineup that includes catcher Elias Diaz, who has bounced back from a disappointing 2022 season by hitting .337 with three homers and 16 RBIs. Diaz credits an improved mindset for his early-season success.",
        "\"The past was crazy,\" Diaz said. \"I'd worry about everything. I'm different right now. If you stay healthy in this job, anything can happen. Stay healthy, stay positive. You control your attitude, your emotions, your work ethic. Don't worry about anything. Just go play.\"--Field Level Media"
    ]
}