{
    "articleURL": "/wires/pa/article-12059953/Steve-Evans-pays-tribute-fantastic-squad-song-Stevenage-end-high.html",
    "content": [
        "Stevenage boss Steve Evans stressed his side were never going to “go through the motions” at Barrow after signing off their promotion-winning campaign with a 1-0 victory.",
        "He also revealed that the Boro team bus had been transformed into a karaoke party for the long trip back south as he paid tribute to his “fantastic to a man” squad.Nearly 600 Stevenage supporters travelled up to see their team, who had already secured automatic promotion, seal second place behind champions Leyton Orient with victory in Cumbria.Jake Reeves’ first goal since December, which came in the club’s 5-0 rout over the Bluebirds, settled the final-day encounter at Holker Street with Barrow unable to find a way past Stevenage keeper Adam Przybek.Evans said: “We were never going to just go through the motions.“We realised early on that last season 32 supporters came to watch Stevenage at Barrow and it was almost 600 today.",
        "“That tells you that we’re indebted to the supporters for travelling.“Adam’s made a few saves in the second half, but if we take our chances it’s as comfortable an away win as we’ve had in a while.“We got a real good shift from everyone. We utilised the squad today.“I would have loved to have got some more of the young lads on, but we didn’t have that freedom unfortunately.“I thanked the players and I told them the team bus doesn’t exist anymore, it’s the karaoke party bus all the way back to Stevenage.",
        "“They deserve it. They have been fantastic to a man, every single one of them.”Pete Wild’s Barrow ended the season in ninth spot, their highest Football League finish since way back in 1970.It has been a huge achievement to lift the club towards the play-offs this season after they just about survived in both previous campaigns since getting promoted from non-league in 2020.Wild said: “We’ve gone toe-to-toe with Stevenage and just not been able to get over the line.“I think that sums our season up. They had one chance and it goes in, we have six or seven chances and they don’t go in.“We all know that’s the area we’ve got to get better at.“The lads have had a go and taken it to Stevenage.“Once the goal went in the place just slumped. We said at half-time that you can stroll around for 45 minutes and it will take forever or you can run around and see where it takes us.“One of my big phrases is ‘judge me after 46 games, not week-by-week’ and my 46-game record is OK.“I’m quite happy with what’s happened this season. Am I happy with ninth? No, I want to be higher.“It’s been tough these last couple of weeks because I’ve never not been playing for something on the last day.",
        "“But there’s a lot of positives to take from this season. We’re all clear with where we need to improve and that’s part of the process.“We’re a work in progress and have travelled a country mile this season and we’ve got to do that again to get to where we want to be.”"
    ]
}