{
    "articleURL": "/wires/ap/article-12055169/Texas-panel-says-lawmaker-expelled-misconduct.html",
    "content": [
        "AUSTIN, Texas (AP) - A Texas legislative committee recommended Saturday that GOP Rep. Bryan Slaton be expelled for inappropriate sexual conduct with a 19-year-old intern. Slaton, from Royse City, could face an expulsion vote by the full House as early as Tuesday.",
        "Slaton, 45, has declined to comment on the allegations, and did not immediately respond to a phone message left by The Associated Press Saturday afternoon, but his attorney last month called the claims \"outrageous\" and \"false.\" The House General Investigative Committee's recommendation was first reported by The Texas Tribune.In the written investigation report, the committee said Slaton gave the 19-year-old intern and another young staffer alcohol at his home, that he had sex with the intern after she was intoxicated, and that he later showed the intern a threatening email but said everything would be fine if the incident was kept quiet. Slaton also asked a fellow lawmaker to keep his behavior secret, the committee said.\"Slaton's misconduct is grave and serious,\" the committee members wrote in a report, and that he furnished alcohol to a minor, violated employment laws, abused his position of power and engaged in harassment.\"The fact that Slaton has not expressed regret or remorse for his conduct is also egregious and unwarranted,\" the committee wrote. \"It is the Committee´s unanimous recommendation that, considering the factors stated above, the only appropriate discipline in this matter is expulsion.\"Slaton´s legislative biography describes him as, \"a proud East Texan with values and principles that represent the great people of East Texas\" that were formed by his participation in church and family gatherings. It also sites his degrees from a Baptist seminary school and his work serving as a youth minister.",
        "Slaton has repeatedly pushed to ban drag shows for kids and has tweeted his support for laws prohibiting gender-affirming healthcare.\"Children don´t need to be focused on sex and sexualization, and we need to let them just grow up to be children and let them do that as they´re getting closer to being an adult,\" Slaton said in an interview last year.The misconduct investigation began after two 19-year-old legislative aides and a 21-year-old legislative intern filed complaints in April. The committee hired a former state judge to conduct the investigation, which confirmed the complaints, Committee Chairman Andrew Murr, a Republican, told the 150-member House on Saturday.Murr said he expects a resolution calling for Slaton´s expulsion on Tuesday. Expelling Slaton would require a two-thirds vote from House members.In the complaints, two of the women said they tried to dissuade the intern from spending time with Slaton and suggested that his behavior was inappropriate. But the intern, who one complainant described as \"naive,\" was not convinced and so agreed to Slaton's request to visit his apartment on the night of March 31. The other women went with her, according to the report, and the lawmaker served them rum and cokes.One of the young women drank enough to vomit; the intern was \"really dizzy\" and had \"split vision\" according to the report. The other women eventually left the home but the intern reportedly stayed. She told her friends that Slaton drove her home the next morning, stopping at a drugstore so she could obtain emergency contraception on the way, according to the report.",
        "The Associated Press found that between 2017 and 2021, at least 120 state lawmakers in 41 states have faced public allegations of sexual misconduct or harassment. Among those cases was an Idaho lawmaker who was eventually convicted in 2022 of raping a legislative intern.Often, lawmakers accused of sexual misconduct run again for office and are re-elected. Efforts to remove them are rarer.But this year, a handful of lawmakers nationwide have been expelled or barred from Statehouses for simply taking part in protests or violating \"decorum\" rules. Montana Rep. Zooey Zephyr, who is transgender, was barred by Republicans from the House floor after she rebuked colleagues supporting a ban on gender-affirming care for children and opposed their efforts to silence her. Two Democratic lawmakers from Tennessee were expelled by Republicans in April for their role in a protest calling for more gun control after a deadly school shooting in Nashville."
    ]
}