{
    "articleURL": "/news/article-12045491/Stan-Grant-feature-ABC-Coronation-coverage-slamming-broadcaster-Queens-death.html",
    "content": [
        "ABC Coronation coverage to include Stan GrantGrant hit out at ABC's Queen's death response  He felt 'betrayed' by the 'obsequious' reverence  Stan Grant has been given a spot in the ABC's coverage of the Coronation of King Charles III after saying he felt 'betrayed' by the broadcaster's 'obsequious' response to the death of Queen Elizabeth II.",
        "Grant will be a studio guest during the marathon telecast, hosted by ABC presenters Julia Baird and Jeremy Fernandez, which begins at 5pm on Saturday and continues through until 11.30pm.The 'visceral anger' Grant felt over his employer's response to the death of Queen Elizabeth last August drove him to write a book, The Queen is Dead, which came out on Wednesday. In an interview with Radio National on Monday morning, the 59-year-old Q+A presenter said he refused to 'put on a black suit' and mourn 'the White Queen', as was the long observed custom at the news organisation.'How dare the Queen just die and this country go into mourning?' Grant, a Wiradjuri, Gurrawin and Dharawal man, told Patricia Karvelas. ",
        "'I felt in my own organisation … a sense of betrayal because the ABC, everyone donned black suits, everyone took on a reverential tone.'We know that the Prime Minister said: 'Now is not the time to talk about empire and colonisation, this is not the time to talk about the republic.' Well, it is always the time.'We saw Aboriginal people being attacked because they voice another view and an angry view and they are entitled to our anger. It was time I thought to open it all up and we didn't.'",
        "Grant says in the new book that at times like the Queen's death 'my role is impossible'.'As journalists, we cling to our objectivity. But that is a lie. Who is objective? What a bloodless idea,' he said.In his book, published by Harper Collins, Grant writes of his experiences in the days following the death of King Charles's mother. 'The White Queen is dead,' he wrote.",
        "'The ABC is nervous. It has circled around these topics all week. The republic. Colonisation. Empire. Genocide. Racism.'Grant admitted at one point it was suggested his own program Q+A wouldn't discuss the Queen's death at all - and would instead opt for a panel discussion about aged care. 'That would be ridiculous. No. We will do it, I say, and I will put black voices front and centre,' he said.However, that panel discussion left him felt 'sorely tested ... wounded, and empty'. Grant told Radio National he had met Queen Elizabeth on a couple of occasions and that she was 'someone who symbolises that power in the Crown, the symbol of the Crown, that my people continue to suffer under ...'Her death was a cathartic moment, I thought, and I wanted to explore that, to really tear open that idea and examine it again,' he said.",
        "The ABC line-up for Saturday includes a number of avowed republicans including co-chair of the Australian Republican Movement Craig Foster along with author Kathy Lette and writer and Wiradjuri and Wailwan woman Teela Reid.Monarchist Liberal MP Julian Leeser will fly the royalist flag.The main action from London begins with the King's Procession, which the ABC will take from a BBC feed.The Coronation ceremony at Westminster Abbey begins 8pm and will go for two hours.Afterwards the ABC will continue to take coverage from London of celebrations with the appearance of the Royal Family on the Balcony at Buckingham Palace expected to be around 10.30pm. "
    ]
}