{
    "articleURL": "/sport/football/article-12039193/Ben-Chilwell-Thiago-Silva-spotted-having-heated-argument-Chelsea-capitulate.html",
    "content": [
        "Pair were part of a shocking defensive effort as Arsenal scored three goalsMartin Odegaard and Gabriel Jesus tore Chelsea's sorry backline to shredsBen Chilwell and Thiago Silva spotted having heated row during the capitulation Ben Chilwell and Thiago Silva were spotted having a heated discussion during Chelsea's first half capitulation at Arsenal.",
        "Goals from Martin Odegaard and Gabriel Jesus saw the title chasers race into a three-goal first half lead, with Frank Lampard's side left to lick their wounds once again.Arsenal looked to be heading back to the summit of the Premier League table as a result of their sparkling attacking efforts as Chelsea continue to be forced to look downwards.Following Odegaard's second of the night, Chilwell and Silva were spotted engaging in what looked to be a blazing row about defensive positioning and other factors which led to Arsenal doubling their lead.Silva appeared to making talking gesture with his hands in extremely animated fashion before Enzo Fernandez, one of the club's many signings of the Todd Boehly-Clearlake Capital ownership, pulled the Brazilian away.",
        "Chilwell seemed to be pointing at the midfield, with much of Arsenal's play starting centrally before being shovelled out wide.Odegaard's second came in similar fashion to his first, with Granit Xhaka being found on the left hand side before pulling it across the box for the unmarked Norwegian to slam home.The incident marks another sorry interval in an appalling first season of ownership for Boehly and Clearlake.Having spent over £600m, they have watched the team collapse at almost every turn while no fewer than four managers, two of which have been interim appointments, have tried to stamp their mark on the side.",
        "They currently sit 12th in the table on 39 points having played 33 games.",
        "Pundits working for Sky Sports blasted the defensive efforts, with both Cesc Fabregas and Jimmy Floyd Hasselbaink bemoaning countless mistakes made at the back.'I don’t know how many times Arsenal have found this ball through the middle,' Fabregas said. 'This cut back they have worked on it and they understand the weaknesses of Chelsea. It’s over, you lose the game because of a lack of concentration.'Meanwhile, Hasselbaink added: ‘They have numbers behind the ball but that is not enough. You need to defend – they have enough people there and they need to block the ball. 'The urgency is not there, it’s too easy from everybody. It’s more than pride. Determination. I don’t think they don’t want it because there are enough people behind the ball, they want to do the right thing but there is no urgency.’"
    ]
}