{
    "articleURL": "/tvshowbiz/article-12053009/Pete-Davidson-passes-free-pizzas-picketers-continues-support-WGA-strike.html",
    "content": [
        "Pete Davidson passed out free pizzas to picketers in New York City on Friday as he continued to support the Writers Guild strike that has brought Hollywood to a standstill.",
        "The 29-year-old comedian – who recently lost his beloved dog Henry – delivered a stack of authentic pizza pies from the landmark Brooklyn eatery Spumoni Gardens.In footage uploaded to Twitter, Davidson strolled up in a black hoodie and matching sweatpants as hungry picketers greeted him with open arms and grateful smiles. 'You got Spumoni's!?' marveled one picketer, to which Davidson replied: 'I got Spumoni for everyone. You gotta support the writers, man. No shows without the writers.'The strike has certainly freed up the funnyman's schedule this week as his SNL hosting gig has reportedly been canceled. ",
        "Saturday Night Live will air reruns for the foreseeable future amid the labor dispute, according to The Hollywood Reporter. The shutdown comes as thousands of Hollywood writers have closed their laptops, leaving viewers to wonder what will happen to their favorite shows.It erupted over writers' low pay in the streaming era could have a significant impact on what millions of viewers watch every day.The Writers Guild of America launched the strike on Tuesday, sending nearly 12,000 unionized screenwriters to the picket line for the first time since 2008.The labor dispute could have a cascading effect on TV and film productions depending on how long the strike lasts, and it comes as streaming services are under growing pressure from Wall Street to show profits. ",
        "The Writers Guild of America's screenwriters prepared to picket after negotiations with studios, which began in March, failed by Monday's deadline to yield a new contract. All script writing is to immediately cease, the guild informed its members.The guild is seeking higher minimum pay, less thinly staffed writing rooms, shorter exclusive contracts and a reworking of residual pay – all conditions the WGA says have been diminished in the content boom driven by streaming.Many celebrities have shown their support, picketing alongside the writers and sending them free food. Late night legend Jay Leno recently brought doughnuts to strikers in Los Angeles. Also on Friday, Mindy Kaling, 43, and Ike Barinholtz, 46, were also seen showing support on day four of the strike at Paramount Studios in Hollywood while screenwriters Damon Lindelof and Robert Town were snapped during the WGA strike at Netflix in Hollywood. ",
        "More late night hosts united on the West Coast this week as Jimmy Fallon, Stephen Colbert, Jimmy Kimmel, Stephen Colbert, Seth Meyers and John Oliver joined forces to sent a gourmet waffle food truck to the cause.On Friday's episode of Late Night, Seth Meyers, a WGA member who said he supported the union's demands, prepared viewers for reruns while lamenting the hardship a strike entails.",
        "'It doesn't just affect the writers, it affects all the incredible non-writing staff on these shows,' Meyers said. 'And it would really be a miserable thing for people to have to go through, especially considering we're on the heels of that awful pandemic that affected, not just show business, but all of us.'"
    ]
}