{
    "articleURL": "/femail/article-12043119/Find-Blind-Date-singles-Elizabeth-Larry-say-other.html",
    "content": [
        "Every week, FEMAIL asks two singletons to report back from their blind dateWould you like us to find you a date? Are you a singleton, or is there someone you'd like to send on a blind date? Email: blinddate@dailymail.co.ukElizabeth ",
        "DATING PAST?I was in a long-term relationship with the father of my daughter, then had a three-year relationship that ended ten months ago.Since then, I’ve been on a few dates, but it’s hard when you’re a single parent.PRE-DATE NERVES?Actually, I was more excited than nervous. I would normally dress up, but I spilt moisturising oil on the outfit I’d planned to wear, so I had to make an emergency change — I wore a long-sleeved top, jeans and trainers. I was gutted as I love getting dressed up.",
        "FIRST IMPRESSIONS?Larry was there first and I was surprised he remained seated and didn’t get up to greet me. He seemed quite shy and quiet, and initially didn’t maintain eye contact.EASY TO TALK TO? He laughed about how much I eat – but I had no appetite for him  Yes, once we got going. Maybe it took my energy to get him to come out of his shell.We chatted away about our work, upbringings and families. We’re both Christian so we related to one another on that level, which I didn’t expect.Even if I meet someone who is religious, we don’t usually delve into a deep conversation about it that quickly.I made him laugh quite a bit, especially when I told him during our meal that I eat a lot — I admitted I would need more food when I got home.",
        "EMBARRASSING MOMENTS?He used his knife and fork in the opposite hands — but I thought it was rather sweet.",
        "DID SPARKS FLY?No. He’s a lovely guy and I could talk to him for ages, but there was no chemistry.He never complimented me, so it was hard to tell what he thought of me.Plus, I’m used to men who can carry the conversation and I felt like I had to pull it out of him. At the end we exchanged social media details and hugged goodbye.SEE HIM AGAIN?I would, but purely on a friendship basis. He lives close to my mum, so I’d happily meet him again as I’m always in his area.WHAT DO YOU THINK HE THOUGHT OF YOU?He thought I was funny, but I’m not sure apart from that.",
        "WOULD YOUR FAMILY LIKE HIM?Yes, definitely. He’d make someone a wonderful partner as he has a lovely spirit and a good heart.Larry DATING PAST?I’ve been single all my life, but would love to have a proper relationship. Although I date on and off, using dating apps, I find people out there can be quite rude. It isn’t always an easy experience.",
        "PRE-DATE NERVES?I wasn’t as nervous as I thought I’d be. I wore smart casual cargo pants and a jumper with white trainers, but when I arrived at the restaurant I wished I’d worn a smart shirt.",
        "FIRST IMPRESSIONS?Elizabeth is very beautiful and not what I’d expected at all. She has a lovely smile and warm eyes and instantly came across as kind.",
        "Elizabeth, 25Single with a daughter, aged five.Current roleWorking in sales.  Would like to meetA man who's confident but doesn't take himself too seriously. I'm not attracted to men who are insecure or rude in any way. Larry, 25 Single. Current role A television and theatre actor.  Would like to meet  Someone who is funny, outgoing and creative. I'm bisexual so would appreciate someone who understands that. ",
        "EASY TO TALK TO?Yes, we discussed our aspirations and careers and where we both grew up. We know the same areas, so I immediately felt like I knew her background.We share a similar taste in music too, loving R&amp;B and gospel. We spoke about religion which I really enjoyed.We were laughing a lot, especially about the funny things we went through growing up with African parents.EMBARRASSING MOMENTS?No, but we did laugh as one of the waiters kept interrupting to check we were enjoying ourselves and we just wanted to talk.DID SPARKS FLY? I didn't get flirty vibes although I made a lot of eye contact'  In a sense I felt that friendship sparks were flying — we got on really well. I didn’t get any flirting vibes from her so I didn’t want to be presumptuous.",
        "I did tell her I only make eye contact with someone I like, and I was making lots of eye contact. But I was also just enjoying her company so didn’t make too big a deal of it.SEE HER AGAIN?I would love to meet her again. We’re connected on social media so I will get in touch with her. We hugged goodbye when we parted ways and it felt like we had both enjoyed the date.",
        "WHAT DO YOU THINK SHE THOUGHT OF YOU?I have no clue what she thought — perhaps that I was a nice man, but more of a friend than a potential partner.WOULD YOUR FAMILY LIKE HER?One hundred per cent. She is very kind and talkative, and has a wide range of interests.Elizabeth's Verdict: 8/10LIKED? He is a good listener, softly spoken, and respectful, too.REGRETS? None at all.COFFEE OR CAB? Friendly coffeeLarry's Verdict: 9/10 LIKED? She’s beautiful,friendly and easy to talk to.REGRETS? I wish I’d dressed better and worn a nice shirt.COFFEE OR CAB? Coffee"
    ]
}