{
    "articleURL": "/wires/reuters/article-12047747/PacWest-Bancorp-US-regional-lender-spotlight.html",
    "content": [
        "May 4 (Reuters) - PacWest Bancorp said late on Wednesday that it was in talks with potential partners and investors about strategic options after shares of the lender and several other U.S. regional banks tumbled amid fears of a worsening banking crisis.",
        "It has not experienced any unusual deposit outflows since the sale of First Republic Bank to JPMorgan Chase &amp;amp; Co was announced on Monday, PacWest said in a statement.Here are some details about the bank:* PacWest is a community bank focused on providing business banking and treasury management services to small, middle-market, and venture-backed businesses.* At its peak in October 2007, the bank was worth $7.52 billion. PacWest's market value has now fallen to $772 million after its shares tumbled 72% this year.* According to data from the U.S. Federal Reserve, PacWest was the 53rd largest U.S. bank, as of Dec 31.* As of March 31, the lender held total deposits of $28.2 billion and total assets of $44.3 billion. Meanwhile, total insured deposits, which have come into focus since the crisis, were about 75% of total deposits as of May 2.* The bank increased its headcount by nearly 10% last year, primarily due to growth in its lending unit, Civic. In February, the company said it would lay off 200 employees at the Civic unit to slim down the business as part of its strategy to focus on core products.* The bank was founded in 1999 and has 67 branches primarily in California. It has one branch each in Denver, Colorado and Durham, North Carolina.",
        "* In the aftermath of the 2008 global financial crisis, PacWest had stepped in with rescue deals for three banks - Los Padres Bank, Security Pacific Bank and Affinity Bank of Ventura - that the Federal Deposit Insurance Corp had taken into receivership. (Reporting by Manya Saini and Niket Nishant in Bengaluru; Editing by Anil D'Silva)"
    ]
}