{
    "articleURL": "/news/article-12044215/University-accused-woke-gobbledegook-cutting-word-woman-maternity-leave-policy.html",
    "content": [
        "The guidance has been put in place by the University of the Arts London (UAL)Critics have slammed the move as 'pathetic woke nonsense' and 'gobbledegook' A university has been accused of 'woke gobbledegook' after it cut the word 'woman' from its maternity leave policy.",
        "Guidance from the University of the Arts London (UAL) tells staff maternity applies to 'all genders'.The university was last night slammed by MPs and free speech campaigners who accused it of 'erasing' the experience of women.Tory MP Jonathan Gullis said: 'It is disturbing that a university does not understand the basics of biology... I hope [it] will stop this pathetic woke nonsense.' Toby Young, director of the Free Speech Union, said the university 'has become so pickled in woke gobbledegook it's becoming a bit of a joke'. ",
        "But UAL said it was 'proud' of its parental leave policy. A spokesman said 'the language used accurately reflects' its inclusive policies.The university has also scrapped the word from its menopause policy - preferring instead to use 'individual', 'person' and 'people'.It reads: 'UAL recognise that menopause may also be experienced by colleagues who do not identify as female, so this guidance and support content is intended to support anyone experiencing menopause, regardless of their gender identity.'Toby Young said: 'Nearly all these institutions are publicly funded, yet all the polling indicates the public are overwhelmingly opposed to this nonsense.'The University of the Arts has become so pickled in woke gobbledegook it's becoming a bit of a joke. I hope it can correct course before it goes bankrupt.'",
        "Ranked among the top 20 best universities in the country by the Guardian University Guide, it raked in £384.9million in 2021/22 - including more than £300,000 in taxpayers' cash in grants and contracts from UK and overseas governments.",
        "James Purnell leads the institution as its newly appointed President and Vice-Chancellor. Boasting a basic salary of £295,000 he joined the institution after a seven-year stint at the BBC.The guidance was discovered by Policy Exchange, the think-tank that is tracking how gender identity ideology is being adopted in the public sphere as part of it's 'biology matters' newsletter.Lottie Moore, research fellow, said: 'The removal of language relating to female biology within the University of Arts London staff policies is yet another example of where gender identity beliefs are taking precedence above all else, including scientific fact.'Language matters, as does biology, and it is important that such examples are exposed. This needs to stop.'The discovery comes after The Mail revealed that more than half of Britain's universities are peddling controversial and radical 'woke' ideologies on students.Dr Richard Norrie, a researcher at the think-tank Civitas, ranked 137 universities after scouring websites, national and local media, and promotional materials for examples of 'campus wokery'.A staggering 62 per cent were found to have had references to trigger warnings or 'content notes', designed to alert students to material deemed potentially harmful or worrying.",
        "Seventy-nine institutions had mentions of 'white privilege' in guidance offered to staff and students or on their website, while 59 per cent were offering training materials or resources on 'anti-racism' online.A university spokesman added: 'The language used accurately reflects the inclusive nature of the policy which applies to all new parents at UAL, regardless of gender, sexual orientation or how people become parents.'Therefore, any woman who becomes a parent is entitled to the benefits of the policy.'Similarly, any woman who is experiencing menopause is also supported through our policies.'We welcome constructive discussions with any other institutions interested in learning more about the value of Equal Parental Leave and our Menopause Policy which not only benefit our staff members individually but also contribute to a more equitable workplace.'"
    ]
}