{
    "articleURL": "/tvshowbiz/article-12041439/David-Beckham-revives-90s-iconic-leather-look-Victoria-birthday.html",
    "content": [
        "Victoria Beckham and husband David harked back to their noughties heyday by stepping out in matching double denim outfits last week. ",
        "And the couple were at it once again on Tuesday night when they headed out for a family dinner in black ensembles to celebrate David's 48th birthday at Araki.David revived his iconic 90s leather look teaming a very similar jacket with black trousers, while his wife, 49,  also wore black but opted to leave her leather catsuit at home. The group looked in high spirits as they left the tiny upmarket restaurant which only seats nine people at a time.Reaching for Victoria's hand, it's fair to say the couple looked very loved up, with Victoria looking incredible in a black mini skirt worn with fishnet tights and heels. ",
        "Eldest son Brooklyn, 24, is currently in New York with his wife Nicola Peltz, 28, where they attended the Met Gala on Monday night, the rest of the family were present. Brooklyn paid tribute to his dad with a throwback snap of them wearing matching clothes, something that David is clearly very keen on. Romeo, 20, wore a patterned khaki shirt and jeans and was pictured smiling as he left the restaurant with his sunglasses on. Cruz, 18,  wore baggy cargo pants with a green and a red colourblock sweatshirt and Harper, 11, wore a pretty summery dress and Nike trainers.",
        "Last week, Victoria sports star David were dressed in near identical light-wash denim shirts and jeans for a movie night, with VB accessorising with a tan leather clutch. The fashion designer write alongside the image: 'I thought those days were over! (I got dressed first FYI),' in a nod to when they famously used to wear matching outfits back in the late 90s and early 2000s. Back in October 2021, Victoria revealed during a visit on The Tonight Show Starring Jimmy Fallon why she and David used to wear matching outfits.'It just seemed like a really good idea at the time,' Victoria said, drawing giggles from the studio audience in New York City.",
        "'It really did. I think there was a naïveté then, we didn't know about fashion,' she added.'We were just having fun with it, which to be honest with you, is kind of the way it should be. I really wish I had the courage to do it more now,' Victoria said.She said they didn't know nor care and just wanted to have fun with their outfits, explaining: 'And we were like, ''Hey, let's wear matching leather...And we did.\"'",
        "In December 2022, speaking in Vogue Visionaries, alongside Edward Enninful, Victoria fondly reminisced: 'Myself and David turning up to a Versace event in matching Gucci leather […] wearing the wrong designer, but you know, owning it.",
        "'Listen, everyone wants to show me them [the images], and everyone wants to know what I think of them.'Back then, I didn’t know any better. I didn’t know the fashion industry. So there was something so sweet and naive about the fact I didn’t care. I just expressed myself in that way.Back in 1999, Posh and Becks opted for a Robin Hood-themed wedding when they got hitched at Dublin's Luttrellstown Castle.They stared down at their very star-studded guests from giant golden thrones while wearing matching purple outfits."
    ]
}