{
    "articleURL": "/wires/reuters/article-12055007/Tens-thousands-join-protests-against-Israeli-judicial-overhaul.html",
    "content": [
        "By Rami Amichai",
        "TEL AVIV, May 6 (Reuters) - Tens of thousands of Israelis joined protests across the country on Saturday against Prime Minister Benjamin Netanyahu's bitterly disputed plans to tighten controls on the Supreme Court.The planned overhaul, which would give the government control over naming judges to the Supreme Court and let parliament override many rulings, was paused after opponents organised some of the biggest street protests ever seen in Israel, now in their 18th consecutive week.The government accuses activist judges of increasingly usurping the role of parliament, and says the overhaul is needed to restore balance between the judiciary and elected politicians.Critics say it will remove vital checks and balances underpinning a democratic state and hand unchecked power to the government.Five months into the far-right coalition's term, 74% of Israelis think the government is functioning poorly, according to a poll released by the Israeli public broadcaster on Friday.Crowds gathered in central Tel Aviv on Saturday in a show of defiance against plans which they see as an existential threat to Israeli democracy.Israel's Channel 12 estimated 110,000 people demonstrated in Tel Aviv alone, with other demonstrations held in cities across the country.\"I'm very worried for my country,\" protester Bental Shamir, a 60-year old teacher told Reuters in Tel Aviv. \"I don't want a corrupted country.\"",
        "The planned overhaul has been put on hold in an attempt to give time for Israeli President Isaac Herzog, who plays a largely ceremonial role, to broker a compromise between the coalition and opposition which could see the legislation softened, but so far compromise talks have not born fruit.\"I'm sure that we are closer than we can imagine,\" lawyer Dor Lasker, 35, told Reuters regarding the compromise talks. \"I'm positive that it could happen.\"Protesters waved the blue and white Israeli flags that have become a hallmark of the protests over the past three months.A statement from the Israeli president's office said King Charles III greeted Herzog after the coronation ceremony in London and commended him for his mediation efforts. (Reporting by Emily Rose; Editing by Mike Harrison)"
    ]
}