{
    "articleURL": "/wires/reuters/article-12043947/Iga-Swiatek-advances-Jessica-Pegula-falls-Madrid-quarters.html",
    "content": [
        "Top-seeded Iga Swiatek of Poland cruised to a 69-minute victory while No. 3 Jessica Pegula lost in three sets in the quarterfinals of the Mutua Madrid Open on Wednesday in Spain.",
        "Swiatek made quick work of Croatia's Petra Martic 6-0, 6-3, while Pegula put up a lengthy fight before falling to 12th-seeded Veronika Kudermetova 6-4, 0-6, 6-4 in two hours and five minutes.Swiatek and Kudermetova will meet in the semis.Swiatek won the first seven games against Martic en route to her dominating victory. Swiatek improved to 2-0 vs. Martic.\"I feel like I'm playing better and better every day,\" Swiatek said afterward. \"This is pretty great, because I didn't know if that was going to be possible at the beginning of the tournament. But I was patient and I was hoping to get that feeling, and today was for sure a good day.\"Kudermetova, on the other hand, had to work much harder to get past Pegula.Kudermetova rebounded after a poor second set in which she committed 15 unforced errors. The Russian laced four aces on the day, the last one on match point to close it out.\"First set was pretty good for myself, but in the second set, I think Jessica start to play a little bit more aggressive,\" Kudermetova said. \"I was maybe a little bit tired, but to be honest, in the second set I started laughing, 'Veronika, you want to kill yourself. Again, three-set battle.'",
        "\"But before the final set, I say to myself, 'Veronika, you need to try to do something, because if you will continue to play like this you will lose for sure. You need to start to play a little bit more aggressive,'\" she added. \"It was very important to break her in the first game.\"Swiatek owns a 3-0 lead in head-to-head vs. Kudermetova.\"For me, it doesn't really matter what our head-to-head is,\" Swiatek said. \"I'm just going to focus on myself and what I want to do on court, tactically. It's never easy to play a semifinal. In semifinals, there are players who've played already a great tournament. ... I'll just be ready.\"--Field Level Media"
    ]
}