{
    "articleURL": "/wires/aap/article-12049705/Bontempelli-Giants-firing-line-Canberra-clash.html",
    "content": [
        "If GWS are to snap their eight-game losing streak at Manuka Oval, shutting down Western Bulldogs superstar Marcus Bontempelli appears to be a must.",
        "Giants coach Adam Kingsley flagged they'd send someone to the Bulldogs skipper in Saturday's Canberra clash, a week after a Hawthorn tag held him to less than 20 disposals for the first time in 15 games.It meant the Dogs had to find other avenues to grind their way past the Hawks, a key for GWS if they're to back up last weekend's thrilling derby win against Sydney.The Giants have traditionally handled Bontempelli well and he only averages less disposals per game against two other clubs, but GWS defender Connor Idun stressed the importance of getting on top of him.\"He's a class player and always plays pretty well against us,\" he said.\"We have to be really physical at contests, they're really good with their hands, so just stopping them at the source and trying to stop his run will be crucial for us.\"It was a massive win last week in the derby, so we want to continue that momentum and go again against another rival and hopefully get a win.\"Not only did the Giants beat the Swans last weekend but they maintained their record of tight games under first-year coach Adam Kingsley, still yet to finish a contest with a margin larger than 21 points either way.",
        "It contrasts with their 2022 form, where they were beaten by 30 points or more on 10 occasions and struggled to run with the competition's elite.\"It's something we were pretty disappointed with last year, teams blew us out a bit too much,\" Idun said.\"To see we're playing a full 120 minutes and hanging in there and continuing to fight, it's something we're really proud of.\"(Winning) just builds momentum and a lot of belief ... to see we can do it against the best sides in the league and that our brand stacks up.\"Idun will notch his 50th AFL game on Saturday, crediting some pointed advice from former coach Leon Cameron with saving his young career from an early finish.\"I was looking like I was gonna get delisted a couple of times and I was a bit off the pace,\" he said.\"Apart from Leon giving me a massive spray and I was too fat, I just played a couple of games in my second year late and I got a taste of what it's like at the top level.\"I really enjoyed it so that off-season I put a lot of work in, changed my diet, but I got my running up to scratch and haven't looked back.\""
    ]
}