{
    "articleURL": "/wires/pa/article-12057575/Pep-Guardiola-hoping-repeat-really-good-Man-City-display-Real-Madrid.html",
    "content": [
        "Pep Guardiola hopes Manchester City can replicate the dominance they showed against Leeds when they face Real Madrid on Tuesday.",
        "Aside from a frantic final five minutes, the Premier League leaders were in a different class to the relegation-threatened Yorkshire side at the Etihad Stadium on Saturday.They eased ahead with two Ilkay Gundogan goals in the opening half-hour and could have scored several more – with Gundogan missing a penalty and Erling Haaland twice hitting the woodwork among their better chances – before an 85th-minute Rodrigo strike left them hanging on for a 2-1 win.",
        "Their next challenge is a lot tougher, as they face holders Real in the first leg of their Champions League semi-final at the Bernabeu, but Guardiola feels his side are in good shape.The City manager said: “I would love to play on Tuesday the way we played Saturday. We played really good.“They played a back six, so you have to read the spaces and pick the right moments to attack.“Erling had two, three or four chances to score. He played an exceptional game, all of them did. I would love to play on Tuesday the way we played Saturday. We played really good.  Pep Guardiola  “Before 2-1 and that situation, it was really good.”Guardiola made seven changes for the game with Jack Grealish, Rodri, Ruben Dias, John Stones and Bernardo Silva along those to get a rest.",
        "That should ensure he can again freshen the team up in Madrid but Guardiola insists it is not a case of prioritising the Champions League now they look to be in command of the domestic title race.He said: “I didn’t rotate the team because I was thinking in Madrid. I rotated because some players told me they are so tired.",
        "“I take the Premier League so seriously. In October, November, December you can drop points but now if you drop points the damage is huge.“I would be naive to prioritise.”Treble-chasing City are unbeaten in 20 matches – 17 of which they have won – and are approaching what could be a glorious end of the season in fine form.Guardiola said: “We have to still be focused but the moment we beat Arsenal, destiny was in our hands.“We have done it against Fulham, West Ham and Leeds. After Madrid we have five days to recover well and go to Goodison Park and win the game.“Every time we win we are closer to doing something exceptional.”Guardiola was clearly annoyed when Gundogan missed from the spot on Saturday. Regular penalty-taker Haaland deferred to the German to allow him to complete a hat-trick but, by hitting the post, he failed to put the result beyond doubt before Leeds scored.",
        "The City boss felt Haaland should have taken it and did not acknowledge Gundogan after substituting him, but he calmed down after the final whistle.Guardiola retains high regard for the 32-year-old and would like to see him recommit after his contract expires at the end of the season.He said: “It is not necessary for him to score two goals to know how I like this player and how I would like to work with him in the future.“He is so intelligent, so clever, so competitive. He is one of the best players I have trained in my career. Top class.”"
    ]
}