{
    "articleURL": "/wires/pa/article-12042467/Bid-overturn-Khan-s-Ulez-paywall-London-introduced-Parliament.html",
    "content": [
        "The Government should be given powers to overturn Labour mayor Sadiq Khan’s “paywall” to drive in London, as well as other transport schemes, a Conservative former minister has said.",
        "Former Cabinet minister Theresa Villiers urged MPs to back her law change, which would allow ministers to intervene on decisions about transport and air quality.Labour mayor Mr Khan intends to expand London’s ultra low emission zone (Ulez) to cover the entirety of outer London. In my 18 years as an MP ... almost nothing has provoked such strong opposition as the Mayor of London's plan to expand the ultra low emission zone  Theresa Villiers MP  Last month, a High Court judge decided five Conservative-led councils could challenge the plan.If it goes ahead, the Ulez expansion will see drivers in outer London pay a £12.50 daily fee from August 29 if their vehicles do not meet required emissions standards.Ms Villiers, who represents Chipping Barnet in outer London, told the Commons: “In my 18 years as an MP … almost nothing has provoked such strong opposition as the Mayor of London’s plan to expand the ultra low emission zone.“It comes up on almost every doorstep and at almost every meeting. People stop me in the street to tell me how strongly they feel about this, and over 50,000 have signed the Conservative petition.",
        "“That is why I am bringing forward this Bill to give the Government power to overrule Mayor Khan and stop Ulez expansion.”",
        "She described the Ulez expansion as “wrong scheme at the wrong time” to improve air quality, citing the mayor’s own impact assessment which suggested the scheme would only have a “minor or negligible” impact on pollution.Ms Villiers suggested the scheme would be bad for small business owners and shoppers alike in outer London, telling MPs: “This scheme could devastate our local town centres in outer London, as their regular customers stop coming because of the paywall Mayor Khan is constructing around our capital.”She urged MPs to back her Greater London Authority Act 1999 (Amendment) Bill, which would give ministers the power to intervene.",
        "The Tory MP said: “If the mayor is allowed to push this scheme through, it is only a matter of time before he hikes up that daily charge and imposes it on an ever wider range of vehicles, as a stepping stone to the pay per mile road charging he would like to inflict on every single driver in London.“That is why we need to stop Ulez expansion now.”The Tory MP also said her proposals could apply to other “anti-car” projects championed across London, including low traffic neighbourhoods and moves to build on station car parks.The mayor’s spokeswoman said: “The mayor has been clear that the decision to expand the ultra low emission zone London-wide was not an easy one, but necessary to tackle toxic air pollution and the climate crisis. It is disappointing that some backbench MPs are wasting parliamentary time playing politics. Both No 10 and the Transport Secretary have been clear this is a matter for the elected mayor.",
        " Nine out of 10 cars in outer London are already Ulez compliant. For those with the most polluting vehicles, the mayor has launched his £110 million vehicle scrappage scheme to help low-income Londoners, disabled Londoners and micro businesses, sole traders and charities to replace their polluting vehicles  Mayor’s spokeswoman  “With around 4,000 Londoners dying prematurely each year due to air pollution, there is no time for inaction and it’s people in outer London, particularly the poorest households, who suffer the most from the damaging health effects.”She added: “Nine out of 10 cars in outer London are already Ulez compliant. For those with the most polluting vehicles, the mayor has launched his £110 million vehicle scrappage scheme – the largest scheme ever launched by any city in the UK – to help low-income Londoners, disabled Londoners and micro businesses, sole traders and charities to replace their polluting vehicles.“The mayor is calling on the Government to match his action on toxic air by funding a targeted national scrappage scheme or providing funding to London and the surrounding areas to support the switch to cleaner vehicles. The Government have given millions of pounds for scrappage schemes in other parts of the country, but not a single penny to London.”Ms Villiers’s Bill has the backing of other Conservative London MPs, including Sir Iain Duncan Smith and Bob Blackman.",
        "It is due to be considered by MPs again on November 24 but is unlikely to progress due to a lack of parliamentary time."
    ]
}