{
    "articleURL": "/sport/football/article-12042675/Frank-Lampard-manager-lose-TEN-successive-games-35-years-Arsenal-defeat.html",
    "content": [
        "Chelsea's all-time leading goalscorer has lost all six of his games since returningThe interim manager, 44, could not have envisaged such a run when he returnedHe looked aghast on the touchline as Arsenal went 3-0 up after just 34 minutesFrank Lampard became the first English manager to lose 10 successive games in charge of a top-flight club for 35 years as Chelsea lost 3-1 to Arsenal. ",
        "Chelsea's all-time leading goalscorer has lost all six of his matches since returning to become interim manager in the wake of Graham Potter's sacking.Having also lost his last four games in charge of Everton he has now matched the sequence Arthur Cox endured as Derby County manager in 1988, albeit with two different clubs.Lampard could not have envisaged such a run when he returned to Stamford Bridge for a second stint in charge, having been sacked in January 2021.He looked aghast on the touchline as Arsenal took advantage of Chelsea's flimsy defending to go 3-0 up after 34 minutes.",
        "While the second half was marginally better, the scale of the job Chelsea's next permanent manager faces was spelt out by Lampard in his post-match assessment.'From what this season tells you, from start to finish, we have to find the reasons quickly,' he said.'It's not an overnight fix. The main answer is simple. We have to do the basics better and then we'll get some progress.'It's clear tonight for me. The first half is nowhere near good enough. But it's the reality. It's what I've come into.'It is easy to feel some sympathy for 44-year-old Lampard who has now won only one of his last 20 games as a manager.",
        "Too many of Chelsea's expensively-assembled squad are under-performing and fans are openly questioning the commitment of some of them - a criticism refuted by Lampard.'The players care, trust me. Chelsea fans may talk about players not caring but I don't believe it,' he added.'The lads want to do well but have to understand what that means every day, from training on Wednesday, Thursday, Friday. How you prepare, maintain yourself.'There can be a lot of reasons and some are very valid - players coming into the Premier League into a team that is having a difficult moment, it is not easy, this is the hardest league in the world.'But there are some things that are the basics, they have to be better.'"
    ]
}