{
    "articleURL": "/wires/reuters/article-12055549/Wyndham-Clark-cards-low-round-Wells-Fargo-jump-lead.html",
    "content": [
        "Wyndham Clark carded the low round of the tournament, an 8-under-par 63, on Saturday to take a two-shot lead after three rounds of the Wells Fargo Championship in Charlotte, N.C.",
        "Clark, who has never won in 133 events on the PGA Tour since 2019, heads into Sunday's final round at 16-under 197 after his season-low round.Xander Schauffele, who is ranked fifth in the Official World Golf Ranking, fired a 64 at Quail Hollow Club to move into second place at 14 under. He is seeking his eighth career PGA Tour victory and first this season.Tied at 11 under in third place are Australia's Adam Scott (67 on Saturday) and England's Tyrrell Hatton (68).Clark's bogey-free round featured eight birdies, with half coming on the front nine at Nos. 2, 6, 7 and 8. He hit his first 17 greens in regulation before his approach at No. 18 came up just short of the putting surface.\"Xander and I played amazing,\" said Clark, whose 28 putts were the low on Saturday. \"For a while I feel like one of us was making a putt on every other hole, so it was a fun round. I'd love for us to do that again tomorrow, that would be a lot of fun.\"Schauffele had an adventurous day with seven birdies and two bogeys. He also sank a 26-foot, 4-inch put at the par-5 15th to tally an eagle.\"I'd say the course is so manicured and it's in such good shape that if you do hit a good putt from 30 feet, you're probably going to make it,\" Schauffele said. \"If you do hit really good chips and good putts, like you get rewarded for it. There are some crazy runoffs on the property, but for the most part I think if you can keep it in the fairway, you open up a lot of the property.\"",
        "Clark, 29, sits at No. 80 in the OWGR. His best finish on the PGA Tour came in a playoff loss to Brian Gay at the 2020 Bermuda Championship.`I'd say then I wasn't as good of a player as I am now,\" Clark responded to a question referencing his finish at Bermuda. \"I also think mentally, mentally I was a lot more impatient and fragile I think out there. I'm excited to see how I handle the pressure tomorrow.\"\"It's going to be a fun challenge. Obviously, it's going to be tough, I've got one of the best players in the world right behind me and a bunch of other good players. I'm just really looking forward to the challenge tomorrow.\"Defending champion Max Homa is tied for ninth at 8 under after Saturday's third-round 68. No player has successfully defended his title in the event's history.--Field Level Media"
    ]
}