{
    "articleURL": "/wires/reuters/article-12044327/Despite-war-sanctions-Russians-London-Commercial-Courts-reach-new-record-report.html",
    "content": [
        "By Kirstin Ridley",
        "LONDON, May 4 (Reuters) - A record number of Russians have appeared in London's Commercial Courts over the last year, despite the war in Ukraine and global sanctions, while the number of Ukrainian litigants sunk to zero, a new report showed on Thursday.The number of Russian litigants in Commercial Court judgments jumped by 41% to 58 in the year to March 2023, second only to 441 British litigants, the annual Commercial Courts Report by consultancy Portland Communications showed.London courts remain a global centre for commercial dispute resolution and have long bustled with well-heeled Russians bringing cases often rooted in a battle for wealth and influence following the fall of the Soviet Union - and providing a lucrative revenue stream for law firms.But many law firms cut ties with Russian clients after the invasion of Ukraine in February 2022, which could yet affect the future number of Russian litigants, the report said.Portland, which compiled the data from 257 judgments, said 38 Russian individuals and 19 companies were among those listed in judgments, including a case involving sanctioned Bank Otkritie and a prominent Russian businessman and his sons.However, no Ukrainian litigants have appeared in Commercial Court judgments since July 2021, although Ukraine ranked among the most common litigant nationalities in previous years.",
        "The invasion had affected Ukrainian parties' ability to access courts but, given the delay between claims being filed and judgments, it was too early to attribute the data to the war, the report said.Sixty percent of litigants appearing in Commercial Courts last year were from overseas - the highest proportion of international litigants ever recorded. Russians were followed by Americans, Indians and Singaporeans, the report showed.Susan Hawley, executive director of pressure group Spotlight on Corruption, said the data suggested it had been \"business as usual\" for Russian litigants.\"It should cause the government to pause for thought about the ways in which UK courts have been a playground for foreign claimants without any real scrutiny of whether the UK should be playing host to some of these claims,\" she said.English courts are under rising pressure from a vast backlog of cases, partly due to the pandemic, shortages of lawyers and judges and an outdated court estate. (Reporting by Kirstin Ridley; Editing by Sandra Maler)"
    ]
}