{
    "articleURL": "/wires/pa/article-12060645/Shaun-Maloney-praises-Wigan-players-hard-week.html",
    "content": [
        "Shaun Maloney was pleased with the way his Wigan players dealt with another “hard…difficult” week by ending their Sky Bet Championship campaign with a 0-0 draw against Rotherham.",
        "With the Millers already safe, there was always going to be an end-of-season feel to this dead rubber.Even more so considering the Wigan players had not been paid on time for a fifth time this season, and half of their regular line-up were not named in the squad.Young Wigan goalkeeper Sam Tickle was the star man on his league debut, but neither side looked capable of troubling the scorers on a miserable afternoon at the DW.“I actually really liked the second half,” said Maloney. “We had to change things slightly at half-time, and I really liked the mentality we had.“The first half was a little bit tentative. In fairness, some of the players hadn’t played for a while – or at least alongside each other for a while.",
        "“I just told them I needed a bit more aggression and belief in that second half, at the end of what has been a very, very difficult few days.“And there were a number of positives to come out of it, especially the performance of a number of young players.”When asked about the off-field situation, Maloney added: “It’s been hard, very hard.“I think we all expected and hoped that these kinds of days were behind us. But, yes, it was very difficult again for everyone to deal with.",
        "“There’s just been a lack of clarity, which makes it difficult for me to manage the team and manage the players individually.“And I have to say a massive thanks again to the squad, five of whom played despite not having been paid.“That’s not to discount any of the other players who did exactly the same earlier this season when this happened before.“It’s just a really special group really, given what they’ve been through.“They’ve gone above and beyond this year for the club, and people shouldn’t forget that.”For Rotherham boss Matt Taylor, it was a case of enjoying the day with the job for the season having already been done.“It was their moment, this, and for the players,” he said. “It was a reward and recognition for what they’ve done over the previous 45 games.“We did what we set out to do, and we achieved that last Monday. This was a celebration of that.“In the first half, I quite liked us as a team, and we created enough openings to probably go ahead in the game.“In the second half, we became a little bit disjointed, along with the game.“But I don’t want to read too much into that, because we’d already done our work for the season. And it was a great moment at the end for the players, to be able to celebrate with the fans.",
        "“I’ve just been told that’s been our best away following for nine years, and I think that shows the connection between the fans and this group of players – and it’s all about trust.“I came in a couple of months into the season, and I’ve started to build that trust with them, as they have with me.“The fans are the same, and they’ll only do that if we achieve our goals – and this year, that was staying in the league.”"
    ]
}