{
    "articleURL": "/news/article-12060619/PICTURED-Mom-dad-son-3-killed-gun-massacre-Texas-outlet-mall.html",
    "content": [
        "Engineer Aishwarya Thatikonda, 27, was shot while shopping for her birthday Security guard Christian LaCour, 20, was killed inside the Allen Premium Outlets Siblings Daniela Mendoza and Sofia Mendoza also died in the incident READ MORE: Who is Mauricio Garcia? What we know so far about the shooterA six-year-old boy was left orphaned days after celebrating his birthday after his parents and younger brother were killed in the Texas mall massacre.",
        "Dentist Cindy Cho,  35, her husband Kyu, 37, and son James, 3, were all shot dead following the rampage in Allen, Texas, on Saturday.The Korean couple's eldest son William had celebrated his sixth birthday just four days before the tragedy and was also rushed to hospital with severe injuries.Family members have now confirmed that the schoolboy has been moved from ICU, and it is thought that he is one of the youngest injured in the attack.A GoFundMe for the family has raised nearly $200,000 of their $50,000 goal, and described their 'deep mourning.'",
        "They said: 'An afternoon that should have been filled with light, love and celebration unfortunately was cut short by another mass shooting massacre that left eight victims dead.'After being released from the ICU, their six-year-old son William is the only surviving member of this horrific event.'Dental colleagues of Cindy paid tribute to her as 'one of the kindest, happiest, most genuine people.'The Korean Consulate in Dallas confirmed to DailyMail.com that the family had passed away in the shooting, adding that they were trying to contact relatives not in the area.Family members told the South Korean consulate in Dallas that the victims are U.S. citizens, according to Myoung Joon Kim, head of the Consulate in Dallas.",
        "He said: ‘The Korean consulate joins the people of the Dallas-Fort Worth area to express our deepest condolences for the victims and their family members.‘We pray for the victims and their family members for their healing and recovery.”It comes after a Superintendent confirmed that two elementary school pupils were shot and killed in the tragedy.",
        "Fourth-grader Daniela Mendoza and second-grader Sofia Mendoza were both shot dead and their mother, Ilda, remains in a critical condition.Both attended Cox elementary school, with Wylie ISD Superintendent David Vinson saying in an email: 'We love your babies, we love them so much. Our love for our kiddos and each other will get us through this.'Daniela and Sofia will not be forgotten. Hug your kids, and tell them you love them.'Engineer Aishwarya Thatikonda, 27, and Christian LaCour, 20, who worked as a security guard at the mall, were also killed in the massacre.Thatikonda, originally from Hyderabad, India, had been shopping for her upcoming birthday when she was one of the nine shot dead - including the shooter.She moved to Dallas two years ago to work as a Project Engineer at Perfect General Contractors, was shopping with her friend at the Allen Premium Outlets on Saturday morning when gunman Mauricio Garcia opened fire.",
        "'She was very friendly and very loving,' a family representative told WFAA, adding that Thatikonda's friend was injured in the shooting and is currently stable in the hospital.LaCour was the first victim of the mass shooting to be identified yesterday, with his grandmother Sandra Montgomery describing him as a 'beautiful soul'.'My beautiful grandson, Christian LaCour, was the security guard killed in the shooting at Allen, Texas. He was such a beautiful soul,' she wrote.",
        "In another tribute post shared Sunday, one person who is friends with LaCour's family said he was a 'very sweet gentleman.'Kellie Smith said she considered herself lucky to have 'watched this sweet young boy turn into a very sweet gentleman,' the woman wrote on Facebook.'Their will forever be a void. Please uplift his family in prayer as they navigate this unimaginable time of their lives. Christian you will always remain close to us because we will keep you in our hearts until we see you in Heaven,' Smith wrote.LaCour was the first of eight victims to be identified publicly and the identification came a full day after the shooting took place.Children were among the eight killed during the rampage, where more than 100 rounds were fired. Seven were pronounced at the scene and two at the hospital.",
        "Additionally, the fire department transported nine victims to hospitals, however, officials say more may have been taken by other agencies.",
        "Garcia was gunned down by a police officer after the shooting on Saturday afternoon and officials are investigating whether he had an interest in white supremacist or neo-Nazi ideologies.A law enforcement official said federal agents had been reviewing social media accounts and believed Garcia had expressed an interest in neo-Nazi views.He reportedly had a patch on his chest reading RWDS - an acronym for Right Wing Death Squad, which is popular among extremists and white supremacy groups.Investigators have searched a home connected to the suspect – believed to be where his parents live - and a Dallas motel near an interstate where Garcia had been staying.The motel room contained multiple weapons, including an AR-15-style rifle and a handgun.",
        "Footage showed the moment those first shots rang out, in which the gunman is seen pulling up to the store.Dashcam video showed the gunman getting out of a car and shooting at people on the sidewalk on Saturday afternoon. More than three dozen shots could be heard as the vehicle that was recording the video drove off.Garcia was using an AR-15-style gun during the mass shooting, and was dressed in full tactical SWAT gear.",
        "Allen Fire Chief Jonathan Boyd confirmed that seven people died at the scene, including the gunman, and then a further two victims died in hospital.Three of the wounded were in critical condition in the evening, and four were stable, Boyd said in an update on Saturday night.A Dallas-area medical group said it was treating victims as young as 5 years old.Investigators confirmed they believe shooter Garcia was working alone, but they have not yet released any motive for the killings."
    ]
}