{
    "articleURL": "/wires/ap/article-12059495/King-Charles-III-makes-virtual-appearance-American-Idol.html",
    "content": [
        "LONDON (AP) - On the third day of his long coronation weekend, King Charles III rested.",
        "Monday was, after all, a holiday declared in honor of his crowning and he had spent several whirlwind days of elaborately choreographed public festivities capped with an off-the-cuff cameo on \"American Idol.\"While Charles, 74, had no public appearances, he sent a note of \"heartfelt thanks\" for the many celebrations in his honor and Buckingham Palace released official portraits of him and working members of the royal family that doesn't include his son, Prince Harry, the disgruntled Duke of Sussex.In one photo, the king was seated on a throne at Buckingham Palace in the regalia he wore when he walked out of Westminster Abbey: the Imperial State Crown, a purple and ermine-trimmed robe and holding the sovereign´s orb and scepter.\"To know that we have your support and encouragement, and to witness your kindness expressed in so many different ways, has been the greatest possible coronation gift, as we now rededicate our lives to serving the people,\" he wrote on behalf of himself and Queen Camilla. Other royals, including one of the youngest, picked up the mantle of service the king had called for Monday in declaring the \"Big Help Out\" that was said to draw millions to volunteer a couple hours on their day off.Prince William, heir to the throne, took controls of a small backhoe with his youngest son, Prince Louis, in his lap as his family helped renovate a Scout hut in Slough.",
        "After his father dumped a load of soil, the 5-year-old Louis, who has become a social media sensation for making fidgety faces during public appearances, wore a look of determination as he shoveled sand and piloted a wheelbarrow under the watchful eye of his mother, Kate, the Princess of Wales.While painting the base of a planter later, he ignored his sister, Princess Charlotte, 8, who told him he had paint in his hair.\"Louis, look at me!\" she said. \"You´ve got to wipe it.\"When someone suggested he may grow up to be a painter, he replied, \"No, a fighter pilot.\"It was the boy's first royal engagement and he was rewarded later with a toasted marshmallow sandwiched between two chocolate biscuits.\"You won´t hear a peep out of him now for about 20 minutes,\" his father quipped.Louis took a bite, rolled his head back and staggered into his sister.The volunteer work came after a weekend of pomp, circumstance and partying for the newly crowned king and queen in an ancient spectacle Saturday. Thousands of public picnics and street parties were held Sunday across the U.K. in honor of Charles before the concert at Windsor Castle.Not everyone was thrilled about the new monarch. Criticism has been lobbed at the government for funding an event with estimates surpassing 100 million pounds ($126 million) and no publicly provided price tag yet. It comes as regular Britons struggle to pay bills during high inflation and heating costs.",
        "Police were criticized for the arrests of 64 people - including many demonstrators who said they were unfairly swept up by heavy handed tactics under a new policy of low-tolerance for protesters.Metropolitan Police had defended the arrests as necessary to prevent disrupting the event and keeping hundreds of thousands of people safe but said Monday it regretted arresting six members of an anti-monarchy republican group, and that no charges would be brought.Graham Smith, the leader of the group Republic who was arrested and held 16 hours Saturday, said officers used a \"flimsy pretext\" to suppress dissent and he would consider taking legal action.\"This has been a disgraceful episode,\" he tweeted.Prime Minister Rishi Sunak had defended the force and said police acted independently, pushing back on Smith's suggestion that the aggressive tactics were politically motivated.Sunak spoke to reporters after serving lamb casserole and wine while volunteering at a community center in Rickmansworth, a commuter town about 30 miles (50 kilometers) north-west of London.Sunak hosted a \"Big Lunch\" the day before at 10 Downing St., serving U.S. first lady Jill Biden, and he sat behind the king at Sunday's concert of eclectic acts.During the show, Charles and Camilla were on their feet swaying to the music at one point. Other members of the royal family, including Charlotte and Prince George, 9, waved Union flags along with a crowd of some 20,000 gathered on the castle´s east terrace.",
        "Charlotte and her mother, Kate, sang along as Katy Perry, dressed in a gold foil ball gown, performed her pop hit \"Roar.\" There were performances by the Royal Ballet, Nicole Scherzinger from the Pussycat Dolls, opera singer Andrea Bocelli and British band Take That. Even Miss Piggy and Kermit the Frog made an appearance.After the big show, Charles and Camilla walked into a room at Windsor Castle on Sunday where \"Idol\" judges Perry and Lionel Richie - who also performed - were appearing virtually on the talent show.The king, wearing a dark blue suit and tie, showed a sense of humor by name-checking one of the signature songs Richie had performed, asking if he was planning to do this \"All Night Long.\"\"I just wanted to check how long you´ll be using this room,\" Charles joked.The audience laughed.Richie and Perry, who are judges on \"Idol,\" and were replaced for the episode by Alanis Morissette and Ed Sheeran, were on camera in a room in the castle with dark red drapes and golden arm chairs when the king and queen entered.Richie feigned surprise at the king's arrival and told the U.S. audience that he and Perry needed to vacate the room immediately.The king thanked Richie and Perry for a \"brilliant performance.\"",
        "\"It´s a great treat to have you both here,\" he said.Camilla, in a bright blue jacket, gave them high marks: \"Fantastic, absolutely fantastic.\"Charles was not the only member of the royal family to crack a joke about one of Richie's most popular tunes.The Prince of Wales, heir to the throne, before delivering a heartfelt speech telling his father, \"Pa, we are all so proud of you,\" had promised the audience that, unlike Richie, he wouldn't go on \"All Night Long.\"___Follow AP´s coverage of King Charles III at https://apnews.com/hub/king-charles-iii"
    ]
}