{
    "articleURL": "/tvshowbiz/article-12055287/Vogue-editor-Edward-Enninful-shares-BTS-snaps-join-Katy-Perry-King-Charles-Coronation.html",
    "content": [
        "Edward Enninful joined pal Katy Perry and fellow VIPs at King Charles' Coronation in Westminster Abbey, London, on Saturday.",
        "The British Vogue editor, 51, took to his Instagram grid following the historic occasion to share a slew of behind the scenes snaps. Edward cut a dapper figure as he arrived in a bespoke Huntsman morning suit and proudly wore his OBE on his left breast pocket. He layered his perfectly tailored black wool single breasted morning coat by the swanky Saville Rowe designer over a blue wool vest and crisp white shirt with tie. The magazine maestro grabbed selfies with pop superstar Katy, 38, who he escorted to the ceremony, as well as fellow fashion big wigs.",
        "The Firework songstress commanded attention in her vintage-style lavender Vivienne Westwood ensemble.Katy showcased her slim frame in a pencil dress teamed with a co-ordinating short-sleeved jacket, boasting a nipped-in waist and matching opera gloves.She accessorised with an enormous dish-style net fascinator, while wearing a Vivienne Westwood necklace and carrying her belongings in a white top-handle bag from the designer. Edward posed for snaps outside the famous Abbey before joining fashion designer Ozwald Boateng and Vogue's Vanessa Kingori OBE inside the venue. He captioned the post: 'An honour to be at Westminster Abbey today to witness the coronation of HM King Charles III'. 'When I arrived in the U.K. as a young boy, I’m not sure I could ever have imagined that I’d see this moment in person. How much this country has changed and how much more change there will be ahead. Today felt like living history'.",
        "Edward was born in Ghana emigrated to England following a government coup in 1985 and settled in London with his parents and five siblings. Earlier in the day, Katy was spotted taking a picture of herself on Westminster Abbey's memorial to Winston Churchill - just hours after being mocked for failing to find her seat - and later tripping in her heels outside.",
        "The California Gurls singer, who will perform at the Coronation Concert at Windsor Castle on Sunday, took a quick snap of her feet while she stood on the stone dedicated to the wartime Prime Minister.Earlier on Saturday, Katy was caught by amused fans looking like a lost lamb searching far and wide for her seat.Unable to see thanks to an impressive fascinator, she was seen cocking her head and spinning around in circles in desperate search for her place.The singer, who was dressed head-to-toe in lilac with in an enormous head piece and Vivienne Westwood choker, comically tweeted following the ceremony that her fans were 'not to worry' as she found her seat.In further antics, the singer was spotted taking selfies with guests in the historic abbey and stumbling in her tall white heels as she left the ceremony with fellow guests. ",
        "Alongside British Vogue editor Edward, the pop star was pictured arriving at the abbey earlier this morning.",
        "It was also revealed that Katy will stay at Windsor Castle tonight before performing tomorrow alongside music legend Lionel Richie, as well as Take That, Italian opera singer Andrea Bocelli and Welsh bass-baritone Sir Bryn Terfel. The event, which will take place in the grounds of Windsor Castle, will be in front of a crowd of 20,000 members of the public and invited guests and broadcast across BBC television and radio stations.As a special honour in return for her performance, Katy is being allowed an exclusive stay in the royal residence of the 1,000-year-old castle."
    ]
}