{
    "articleURL": "/sport/mma/article-12052747/UFC-star-Jorge-Masvidals-father-charged-ATTEMPTED-MURDER-shooting-67-year-old-man.html",
    "content": [
        "Jorge Masvidal Fernandez faces a maximum penalty of 15 years and a $10k fineJorge Masvidal Jr. retired from the UFC in April &amp; wasn't present at the shooting DailyMail.com provides all the latest international sports news Jorge Masvidal's father has been arrested and charged for second-degree attempted murder after allegedly shooting a man during a dispute at Masvidal Jr.'s Miami home. ",
        "In the early hours of Friday, at 1:33am, Jorge Masvidal Fernandez was charged and later transported to Turner Guilford Knight Correction Center in Miami. Masvidal Sr. allegedly shot 'family acquaintance' Luis Lencioni twice, leaving gunshot wounds in both arms. He was transported to HCA Florida Kendall Hospital according to police records.While being questioned over the incident, Masvidal Sr. invoked his constitutional right to remain silent, per the police affidavit. After acquiring a warrant, police found a 38-caliber weapon inside a kitchen cabinet at Masvidal Jr.'s residence. Per Florida law, the maximum punishment for the second-degree felony is a 15-year prison sentence and $10,000 fine.Miami-Dade Police provided Dailymail.com with an update on the situation Friday evening. ",
        "'According to investigators, officers responded to the residence located in the 5800 block of SW 118 avenue after reports of an adult male who had been shot,' the statement read. On the scene, officers found Miami-Dade Fire Rescue personnel rendering aid to the victim who had been shot more than once in his upper extremities. 'The victim and subject were involved in a verbal dispute that escalated when the subject produced a firearm and shot the victim. Shortly thereafter, all the occupants of the residence exited the home. The subject was taken into custody by officers and transported to be interviewed by detectives. Family members present during the shooting confirmed that the subject and victim are acquaintances and share familial ties.'",
        "The younger Masvidal wasn't present and is not a suspect, according to Miami-Dade police, who did not name the suspect, Jorge Masvidal Sr., in Thursday's statement, provided to DailyMail.com. Police were called to Masvidal Jr.'s home around 3pm after a shooting. Upon arrival, officers witnessed an adult male receiving aid from Miami-Dade Fire Rescue. Masvidal Jr. retired following April's loss at UFC 287 in his hometown of Miami. The 38-year-old welterweight suffered a lopsided defeat against Gilbert Burns in the co-main event.The loss by unanimous decision was the fourth straight defeat for Masvidal Jr., who retires with an MMA record of 35-17 dating back to 2003. Before leaving the octagon, Masvisal Jr. famously saluted former President Donald Trump, who was in attendance at the Florida event, along with FL Gov. Ron DeSantis. 'I just want to say, greatest president in the history of the world sitting right there. I love that guy!He then praised DeSantis before urging the crowd to vote out incumbent President Joe Biden in the 2024 election.",
        "'We also have the greatest governor of all time here in Florida. Let's keep Florida free, a red state, and let's take you know who, 'Let's Go Brandon' motherf***** out of power and replace him.'Masvidal Jr. then started a 'Let's Go Brandon' chant before exiting the octagon -- a common phrase used to voice outward criticism of President Biden. ",
        "The slogan was born out of a NASCAR broadcast where an NBC Sports reporter falsely told viewers fans were chanting 'Let's Go Brandon' when they were instead chanting 'F*** Joe Biden' following Brandon Brown's October 2021 Xfinity Series win in Alabama.The signature moment of Masvidal Jr.'s long career in the Octagon was his five-second knockout of Ben Askren with a flying knee at UFC 239 in 2019. It remains the fastest win in UFC history. "
    ]
}