{
    "articleURL": "/wires/reuters/article-12046245/UK-regulator-pledges-improve-whistleblower-feedback.html",
    "content": [
        "By Kirstin Ridley",
        "LONDON, May 4 (Reuters) - Britain's markets regulator pledged on Thursday to share more information with whistleblowers on how it was dealing with their reports and improve how it used tip-offs in an effort to restore confidence in the agency.The Financial Conduct Authority (FCA) said whistleblowers had reported concerns in a survey that they were not taken seriously and listened to because of a lack of fuller feedback.Whistleblowing has been on the public agenda since the financial crisis. But despite tougher rules designed to protect those who highlight potential corporate wrongdoing, they still risk being gagged and ending up unemployed and broke.The FCA stressed that it valued whistleblowers, who had helped it identify and correct problems including the mis-selling of consumers loans, the activities of unauthorised firms and failings in firms' own internal whistleblowing procedures.\"We need the intelligence whistleblowers provide to identify and act on problems in the firms we regulate,\" said Therese Chambers, the FCA's head of enforcement and market oversight, in a statement.\"We want to make sure we're capturing and using the information provided by whistleblowers as effectively as possible, and to give them as much information as the law allows on how we have acted on their concerns.\"But Georgina Halford-Hall, the CEO of WhistleblowersUK, a not-for-profit organisation, said the FCA's announcement was little more than a \"sticking plaster\" while whistleblowers have no proper protection from retaliation.",
        "\"Whistleblowers have almost no confidence in the FCA, borne out by the historical failure to manage the intake, communicate or provide protection to whistleblowers,\" she said.\"If the FCA is serious about whistleblowing and improving its performance, I invite them to meet with us and take us through some of the many cases that we have brought to them for a full explanation of the action they have taken.\"The FCA did not immediately respond to a request for further comment.The regulator, which has a dedicated whistleblowing team, said it was often restricted by legal confidentiality obligations from sharing information about how it has acted on information provided by whistleblowers.But after responses from 24 whistleblowers in a 2022 survey, it has pledged to provide more feedback when cases are closed, including more detail about steps taken or the reasons for taking or not taking action - and information about the outcome.It said it was also engaging with the Department for Business and Trade to support a review of whistleblower legislation. (Reporting by Kirstin Ridley; Editing by Jan Harvey)"
    ]
}