{
    "articleURL": "/wires/afp/article-12060283/Opera-icon-Grace-Bumbry-dies-86.html",
    "content": [
        "Mezzo-soprano Grace Bumbry, a pioneering Black opera singer who blazed trials and broke barriers, has died, her son and publicist announced Monday. She was 86.",
        "The artist died on May 7 at a hospital in Vienna, having suffered a stroke in October, according to her adopted son David Lee Brewer, who was speaking to the press agency APA.The decorated singer made her operatic debut in Paris in 1960, playing Amneris in \"Aida,\" and became a favorite of US first lady Jackie Kennedy.Over a nearly four-decade career, Bumbry received great acclaim for her performances in roles that showcased her wide vocal range and singular star power.Grace-Melzia Bumbry was born in St. Louis on January 4, 1937, to parents hailing from Mississippi.A unique talent in the church choir, she grew up in an era of profound racial segregation, and was barred from entering the local music conservatory.But she went on to study at Boston University and Northwestern University on scholarships, later going with her instructor Lotte Lehmann to the Music Academy of the West in California to hone her operatic and stage skills.",
        "Following fellow pioneering Black artists including Marian Anderson and Leontyne Price, Bumbry was a major figure in breaking down racial barriers entrenched in classical music.She gained international attention in 1961 when she became the first African American to perform at Germany's Bayreuth Festival, an institution dedicated to Richard Wagner, a figure acclaimed for his music but whose anti-Semitism and white supremacist views have complicated his artistic legacy.",
        "Wagnerites voiced some protest that she would perform, but the composer's grandson, Wieland Wagner, said \"I require no ideal Nordic specimens,\" arguing that his grandfather's music was \"for vocal color, not skin color.\"Across her storied career Bumbry gained a reputation for glamour and high-living, wearing dramatic gowns and jewels while sating a penchant for show dogs and luxury cars.In 2009 she was awarded a Kennedy Center Honor, among the highest American arts awards, in the presence of then-president Barack Obama.She lived for years in Switzerland and later settled in Vienna, retiring from opera in 1997 after gracing the world's most prestigious stages for decades.Bumbry remained professionally active as a teacher and concert performer, also founding the Grace Bumbry Black Musical Heritage Ensemble.Austria's Secretary of State, Andrea Mayer, hailed Bumbry as \"a pioneer for generations of opera singers.\"\"With her legendary debut at Bayreuth in the 1960s, she made a decisive contribution to equal rights in the world of opera,\" Mayer said in a statement."
    ]
}