{
    "articleURL": "/sciencetech/article-12041691/The-end-world-Scientists-warn-Earth-swallowed-sun-5-billion-years.html",
    "content": [
        "Astronomers spotted a star swallowing a planet 12,000 light-years away from usWhen our sun runs out of fuel it will engulf Mercury, Venus and possibly Earth tooWe all know the end of the world will come eventually, but fortunately if the apocalypse is triggered by our sun it won't be for some five billion years.",
        "That being said, scientists have had their first look at what it will be like when our star runs out of fuel and engulfs Mercury, Venus and possibly Earth in its wake.That's because they have seen a star swallowing a planet just 12,000 light-years away in our own Milky Way galaxy, near the eagle-like constellation Aquila. Astronomers had previously observed stars just before and shortly after the act of consuming entire planets, but had never caught one in the act until now.It was identified when experts spotted a star becoming more than 100 times brighter over just 10 days, before quickly fading away.",
        "What was even more mysterious was that this white-hot flash was followed by a colder, longer-lasting signal, which led astronomers to their exciting conclusion.",
        "The sun is the star at the heart of the Solar System, a nearly perfect sphere of hot plasma, radiating energy.It has a diameter of 1.39 million km, and is 330,000 times the mass of the Earth. Three quarters of the star is made of hydrogen, followed by helium, oxygen, carbon, neon and iron.It is a G-type main sequence star and is sometimes called a yellow dwarf. The Sun formed from the gravitational collapse of matter in a large molecular cloud that gathered in the centre. The rest flattened into an orbiting disc that formed everything else.Facts and Figures Name: Sun Known planets: EightSpectral type: G2Distance to Earth: 150 million kmDistance from galactic center: 25,800 light-years Mass: 1.9885×10^30 kgRadius: 696,342 kmLuminosity: 3.828×10^26 WTemperature: 9,929 FAge: 4.6 billion years  ",
        "They said the combination of the two events could only have been produced by a star engulfing a nearby planet which was likely a hot, Jupiter-sized world.It would have been pulled into the dying star's atmosphere and then consumed in its core.'We were seeing the end-stage of the swallowing,' said lead author Kishalay De, of MIT's Kavli Institute for Astrophysics and Space Research.Terrifying though it may seem, the observation is a sobering glimpse at Earth's fate. Although this will not happen for billions of years, when the sun does burn up it will swallow the solar system's inner planets as it becomes a white dwarf.This is a small, dense remnant of a star that glows from leftover heat.'We are seeing the future of the Earth,' De said. 'If some other civilisation was observing us from 10,000 light-years away while the sun was engulfing the Earth, they would see the sun suddenly brighten as it ejects some material, then form dust around it, before settling back to what it was.'Researchers from MIT, Harvard University and Caltech discovered the planet-eating star in May 2020, having trawled through data by the Zwicky Transient Facility (ZTF), run at Caltech's Palomar Observatory in California.However, it took another 12 months for them to piece together exactly what was going on.",
        "The ZTF scans the sky for stars that rapidly change in brightness, which can be signatures of supernovae, gamma-ray bursts, and other stellar phenomena.De was looking through ZTF data when he made the discovery.'One night, I noticed a star that brightened by a factor of 100 over the course of a week, out of nowhere,' he said. 'It was unlike any stellar outburst I had seen in my life.'",
        "To confirm exactly what it was he had spotted, De set about comparing it with other observations of the same star taken by the Keck Observatory in Hawaii. However, that only confused him further.He found signs of 'peculiar molecules' that can only exist at very cold temperatures.'These molecules are only seen in stars that are very cold,' De said. 'And when a star brightens, it usually becomes hotter. 'So, low temperatures and brightening stars do not go together.'  It wasn't until around a year after his initial discovery that things began to make sense, when De and his colleagues began analysing data related to the star from an infrared camera at the Palomar Observatory.'That infrared data made me fall off my chair,' he said. 'The source was insanely bright in the near-infrared.'The analysis revealed that after its initial hot flash, the star began throwing out colder energy, which the astronomers say was likely the gas from the star that shot into space and condensed into dust.",
        "This made it cold enough to be detected at infrared wavelengths. At first, De and his colleagues thought it was two stars merging, until data from NASA's infrared space telescope, NEOWISE, help them come to a much more exciting conclusion.",
        "They estimated that since its initial outburst, the star had released a surprisingly small amount of energy — about 1/1,000 the magnitude of any stellar merger previously observed.'That means that whatever merged with the star has to be 1,000 times smaller than any other star we've seen,' De said. 'And it's a happy coincidence that the mass of Jupiter is about 1/1,000 the mass of the sun. That's when we realised: This was a planet, crashing into its star.'The scientists suddenly realised that the bright, hot flash had likely been the final moments of a Jupiter-sized planet being pulled into a dying star's ballooning atmosphere.The cold dust was then caused by the planet falling into the star's core, which blasted away the outer layers of the star. 'For decades, we've been able to see the before and after,' De said. 'Before, when the planets are still orbiting very close to their star, and after, when a planet has already been engulfed, and the star is giant. 'What we were missing was catching the star in the act, where you have a planet undergoing this fate in real-time. That's what makes this discovery really exciting.'",
        "The study has been published in the journal Nature.",
        "Five billion years from now, it's said the Sun will have grown into a red giant star, more than a hundred times larger than its current size. Eventually, it will eject gas and dust to create an 'envelope' accounting for as much as half its mass.The core will become a tiny white dwarf star. This will shine for thousands of years, illuminating the envelope to create a ring-shaped planetary nebula.",
        "While this metamorphosis will change the solar system, scientists are unsure what will happen to the third rock from the Sun.We already know that our Sun will be bigger and brighter, so that it will probably destroy any form of life on our planet.But whether the Earth's rocky core will survive is uncertain. "
    ]
}