{
    "articleURL": "/wires/ap/article-12052377/Chile-choose-constitutional-council-apathy-reigns.html",
    "content": [
        "SANTIAGO, Chile (AP) - Chile will vote Sunday to choose 50 delegates to a council that will draw up a new Constitution, after voters overwhelmingly rejected a proposed charter last year that was widely described as one of the world´s most progressive.",
        "It's the latest step in a process to replace the country´s dictatorship-era charter that began with massive protests in 2019. For the most part, though, Chileans appear to be greeting this latest phase with a collective shrug.\"I´m only going to vote because I don´t want to pay the fine,\" said Patricia Borzone, a 45-year-old architect.Borzone is hardly alone as surveys have shown there´s a general apathy in this South American country regarding the vote while many seem to know little about who is on the ballot. Polls conducted by Criteria and Cadem in late March and April, respectively, indicated that nearly 70% of those surveyed said they had little or no interest in Sunday´s vote.The election Sunday will be a key step in the effort to come up with a new proposal for a Constitution after 62% of voters rejected the previous proposed charter in September, which was the first in the world to be written by a convention split equally between male and female delegates. Critics had said the document was too long, lacked clarity and went too far in some of its measures, which included characterizing Chile as a plurinational state, establishing autonomous Indigenous territories, and prioritizing the environment and gender parity.The overwhelming rejection of the first document is one of the reasons there´s so much disinterest in the process now because it led to \"frustration, discontent and a sense of hopelessness,\" said Gonzalo Muller, head of the Public Policies Center at the University for Development.",
        "In addition, \"there´s been little political mobilization from the candidates,\" who have not done much campaigning \"on the streets,\" leading many to not know any of the 351 people who will be on the ballot Sunday, said Carmen Le Foulon, who coordinates the public opinion division of the Public Studies Center, a local think tank.For many Chileans the idea of rewriting the constitution takes a back seat to more bread-and-butter issues.\"The problems our country is facing in terms of public safety, a profound migration crisis and an economic crisis have led the urgency of the day-to-day to overshadow the interest in constitutional matters,\" Muller added.That is precisely why Borzone is less than enthused about heading to the polls Sunday, saying that she doubts the constitutional process will guarantee concrete improvements in education and healthcare, \"which are fundamental for the country to truly develop.\"\"People want to know how they´re going to be able to buy things, how they can have a better quality of life. And the Constitution, after all, is just a piece of paper. It´s not something that can solve personal problems for you,\" Savka Pollak said in Chile´s capital.Voters will choose delegates for their part of the country, with more populous districts sending more delegates to the council.",
        "Voters generally will choose between five competing political parties or electoral coalitions: the leftist bloc of President Gabriel Boric, a center-left group, a center-right group, the populist Party of the People, and the conservative Republican Party, which has long been opposed to changing the constitution that was imposed by the dictatorship of Gen. Augusto Pinochet.Numerous polls have shown that the opposition, and in particular the Republican Party, is likely to come out on top.Even some close to Boric appear to be getting ready for disappointing results.Sen. Juan Luis Castro, who is a Boric ally, said \"it´s inevitable that the government will suffer a setback because there´s no interest, there´s distrust and there is a high level of disapproval of the government.\" Boric´s approval rating is around 30%.Once elected, the councilors will not start from scratch, but rather work from a preliminary document drafted by 24 experts who were approved by Congress.The experts are working on 12 constitutional frameworks, including Chile as a unitary state, the recognition of indigenous peoples as part of an indivisible nation, the separation of legislative, judicial and executive powers, and the guarantee of respect for rights and freedoms, including the right to life, property, and equality before the law.The councilors will receive the draft on June 6 and will have to submit their final version in October. The document will once again be put up for a plebiscite on Dec. 17.",
        "Chile embarked on a closely watched effort to rewrite its Constitution after the country once seen as a paragon of stability in the region exploded in student-led street protests in 2019. The unrest was sparked by a hike in public transportation prices, but it quickly expanded into broader demands for greater equality and more social protections.Associated Press journalist Daniel Politi contributed to this report from Buenos Aires, Argentina."
    ]
}