{
    "articleURL": "/news/article-12041741/Youtuber-accused-stalking-model-cleared-refuses-evidence-birthday.html",
    "content": [
        "Dialunguna Lema, 26, allegedly stalked model Madia Giwa in north LondonMs Giwa declined to come to court as the hearing was listed on her birthdayA YouTuber has been cleared of stalking a plus-size model who refused to give evidence in court as the hearing fell on her birthday.",
        "Dialunguna Lema, 26, was accused of harassing and stalking neighbour Madia Giwa in Crouch End, north London, between May 2021 and June last year by trying to speak to her about his video-streaming channel.Lema denied stalking and harassment and the charges were thrown out when Ms Giwa today failed to turn up to give evidence against him at Highbury Corner Magistrates’ Court on her birthday.Tom Lambert, defending Lema, told the court that the case had gone on long enough. He said: ‘The overriding objective of this case is not the convenience of the complainant.‘We’re here today to have a fair and just trial.‘The written reasons given for adjourning were not trauma or long-term memory damage, but because she had birthday plans in place.'",
        "Refusing the application to adjourn, Bench Chair Ms Anna Kaposi said: ‘We’ve not heard of any steps by the prosecution to secure the attendance of the witness here today.'Ms Giwa’s 6ft 2in friend and fellow model Aeva Andersson was said to have witnessed one of the alleged incidents.Qadeer Mirza, prosecuting, earlier told the court that giving evidence on her birthday would ‘traumatise every future birthday’ for Ms Giwa.He said: ‘Ms Giwa did not want to give evidence on her birthday. She’s been harassed and stalked by this man, to such a point that it’s caused her severe distress and anxiety.",
        "‘She doesn’t want to give evidence because it will traumatise her. She has other health issues as well. Today her parents fly in from abroad and it’s the only day she will get to stay with her parents.",
        "‘She lives alone in the UK and this is the only day she will see her family. She does not know what plans they have made for her birthday, but it is still a family gathering.‘The application is simple, giving evidence on her birthday will affect her mental health.‘Giving evidence and reliving the incident on her birthday will mean she is traumatised every future birthday.‘Any subsequent birthday she will recall what happened in court, because that day is unique to her.‘She has various personal medical matters which have affected her mental health. She is currently under safeguarding with a counsellor.‘It isn’t just a matter of “oh it’s my birthday and I can’t be bothered” - it’s painful.’Summarising the alleged offences, Mr Mirza said: ‘Remember she lives alone and here we have a grown man.‘On May 2021, Ms Giwa states the defendant approached her address out of the blue, knocked on the door and said: “Hello, my name is Chris, I have a YouTube channel. Do you live alone?”",
        "‘He then stepped inside her property and she had to force him out. She pushed him out - this is someone she never met, someone she doesn’t know.‘She shouted “leave me alone”, and he left.‘Last year, on March 7, she was woken up to loud banging on the front door. The defendant is there and says: “I want to talk to you”.‘He was standing so close that she could see the glass on the door was fogging up from his breath.‘She shouted: “What are you doing here? Get away from my door. Get away from my door or I’ll call the police.” He then runs away.‘Between March 7 and March 14 last year the complainant is at Haringey train station. The defendant walked onto the platform, she walked to the other end of the platform to create some distance from her and the defendant, as much as possible.‘Once she arrived at Finsbury Park station, she got off the train and found the defendant on the platform looking at her directly. She decided to ignore him and make way to her final destination.",
        "‘She’s walking along Ferme Park Road, N8, between seven and eight in the evening, when a male rushed past her from behind.‘He rubbed close to her, he brushed past her. She expresses shock. He turned around and she saw it was the defendant, Chris.",
        "‘In another incident on 4 June last year, the complainant Ms Giwa contacts the police. In that call she states the defendant is following her from the communal bins to her flat, then staring at her aggressively making her feel uncomfortable.’Ms Giwa had previously told the Crown Prosecution Service she was unwilling to give evidence on her birthday.The defence lawyer added: ‘Given that the claimant’s credibility is at issue in this trial, that is something to consider.‘If this trial is delayed again there would be further distress caused to Mr Lema.’In making her ruling, Ms Kaposi said the defendant also had rights in the matter. She added: ‘We know it is the fault of the CPS that there was a delay in notifying the court today. The matter is now almost a year old, indeed some of the incidents are a year old.Lema, of Ridge Road, Crouch End, was arrested on July 12 last year.He denied and was cleared of harassment without violence and stalking without causing fear of violence after the prosecution offered no evidence.Ms Kaposi added: ‘We’re refusing the application for a restraining order. We find it not necessary as we have not heard any clear evidence that the witness needs protection.’",
        "Addressing Lema in the dock, Ms Kaposi said: ‘You were here for a trial today and that trial is not going to take place. That matter is dismissed and you will hear no more about it.‘Your bail conditions are gone and you’re free to go.’"
    ]
}