{
    "articleURL": "/wires/reuters/article-12041631/Chinese-data-provider-tightens-information-access-offshore-users-sources.html",
    "content": [
        "HONG KONG, May 3 (Reuters) - Chinese financial data provider Wind Information Co has blocked some offshore users from accessing certain business and economic data, people with knowledge of the matter said, fuelling concern about information access in the world's second-largest economy.",
        "Wind, one of the biggest Chinese data aggregators, has made part of its data inaccessible for users based outside the Chinese mainland, said six people, who declined to be named as they were not authorised to speak publicly on the matter.Shanghai-based Wind did not immediately respond to a request for comment. The Cyberspace Administration of China (CAC) did not immediately respond to a faxed request for comment during China's \"Golden Week\" holiday period.Offshore users' access to information that has been blocked includes business registry details such as a company shareholding structure and its ultimate controller, as well as macroeconomic data like land sales in certain cities, said the sources.Some Wind data such as home sale numbers that used to be updated regularly has been inaccessible to users outside of the Chinese mainland since last September, one of the sources said.While the reasons for the blocking of access were not known, the move comes amid China sharpening focus on rules related to data usage and security against the backdrop of rising geopolitical tensions and concerns about privacy.Beijing has in recent years issued new cybersecurity, data and privacy laws that require organisations with large user bases to undergo assessments and approvals when handling the data they collect.The CAC pushed through new rules requiring data exports to undergo security reviews last year.",
        "Chinese lawmakers also passed a wide-ranging update to Beijing's anti-espionage legislation late last month, banning the transfer of any information related to national security and broadening the definition of spying.Andrew Collier, managing director at Hong Kong-based Orient Capital Research, said information access tightening had been ongoing for a while, as Chinese security regulators have become more nervous as economic growth slows.\"And the less data the world has, the less comfort they're going to have with dealing with...the Chinese economy.\"Besides users at foreign firms offshore, some Hong Kong branches of Chinese state-owned financial firms have also found themselves being shut out of some Wind business and economic data, according to two of the sources.A third source, a Wind user in Hong Kong, said a salesperson at the data provider had said due to the Chinese law on cross-border data transferring, information on companies' shareholding structure was not accessible.The salesperson also said Wind would make the final decision on whether to open access to the relevant data later this week when the product team was back from holiday on Thursday, said the source.Besides Wind, other Chinese data providers including company databases Qichacha and TianYanCha have stopped opening to offshore users for at least months, according to three of the sources.",
        "The companies did not immediately respond to requests for comment. (Reporting by Xie Yu, Julie Zhu, Summer Zhen in Hong Kong; Editing by Sumeet Chatterjee and Raju Gopalakrishnan)"
    ]
}