{
    "articleURL": "/wires/ap/article-12049795/Kings-coronation-draws-apathy-criticism-former-colonies.html",
    "content": [
        "LONDON (AP) - When King Charles III is crowned on Saturday, soldiers carrying flags from the Bahamas, South Africa, Tuvalu and beyond will march alongside British troops in a spectacular military procession in honor of the monarch.",
        "For some, the scene will affirm the ties that bind Britain and its former colonies. But for many others in the Commonwealth, a group of nations mostly made up of places once claimed by the British Empire, Charles´ coronation is seen with apathy at best.In those countries, the first crowning of a British monarch in 70 years is an occasion to reflect on oppression and colonialism´s bloody past. The displays of pageantry in London will jar especially with growing calls in the Caribbean to sever all ties with the monarchy.\"Interest in British royalty has waned since more Jamaicans are waking to the reality that the survivors of colonialism and the holocaust of slavery are yet to receive reparatory justice,\" the Rev. Sean Major-Campbell, an Anglican priest in the Jamaican capital, Kingston, said.The coronation is \"only relevant in so far as it kicks us in the face with the reality that our head of state is simply so by virtue of biology,\" Major-Campbell added.As British sovereign, Charles is also head of state of 14 other countries, though the role is largely ceremonial. These realms, which include Australia, Canada, Jamaica, Papua New Guinea and New Zealand, represent a minority of the Commonwealth nations: most of the 56 members are republics, even if some still sport the Union Jack on their flags.",
        "Barbados was the most recent Commonwealth country to remove the British monarch as its head of state, replacing Charles´ mother, Queen Elizabeth II, with an elected president in 2021. The decision spurred similar republican movements in neighboring Jamaica, the Bahamas and Belize.Last year, when Jamaican Prime Minister Andrew Holness welcomed Prince William and his wife, Kate, during a royal tour of the Caribbean, he announced that his country intends to become fully independent. It made for an awkward photo with the royal couple, who were also confronted with protests calling for Britain to pay slavery reparations.William, the heir to the throne, observed later in the same trip that the relationship between the monarchy and the Caribbean has evolved. The royal family will \"support with pride and respect your decisions about your future,\" he told a reception in the Bahamas.Rosalea Hamilton, an advocate for changing Jamaica's constitution to get rid of the royals, said she was organizing a coronation day forum to engage more Jamaicans in the process of political reform.The timing of the event is meant to \"signal to the head of state that the priority is to move away from his leadership, rather than focus on his coronation,\" Hamilton said.Two days ahead of Charles´ crowning, campaigners from 12 Commonwealth countries wrote to the monarch urging him to apologize for the legacies of British colonialism.",
        "Among the signatories was Lidia Thorpe, an Australian senator, who said Thursday that Charles should \"begin a process of repairing the damage of colonization, including returning the stolen wealth that has been taken from our people.\"Australian Prime Minister Anthony Albanese, who will attend the coronation and join in an oath of allegiance to the king, favors ditching the monarchy, though he has ruled out holding a referendum during his currrent three-year term.\"I want to see an Australian as Australia´s head of state,\" Albanese told the Australian Broadcasting Corp.Buckingham Palace said last month that Charles supported research into the historical links between Britain´s monarchy and the transatlantic slave trade. The king takes the issue \"profoundly seriously,\" and academics will be given access to the royal collection and archives, the palace said.In India, once the jewel of the British Empire, there´s scant media attention and very little interest in the coronation. Some people living in the country´s vast rural hinterlands may not have even heard of King Charles III.\"India has moved on,\" and most Indians \"have no emotional ties with the royal family,\" Pavan K. Varma, a writer and former diplomat, said. Instead, the royals are seen more like amusing celebrities, he said.And while the country still values its economic and cultural ties with the European country, Varma pointed out that India´s economy has overtaken the U.K.'s.",
        "\"Britain has shrunk globally into a medium-sized power,\" he said. \"This notion needs to be removed, that here is a former colony riveted to the television watching the coronation of Prince Charles. I don´t think this is happening in India.\"Since gaining independence in 1947, India has moved to shed the vestiges of British imperialism. The statue of King George V that used to stand near the India Gate monument in New Delhi was moved in the 1960s to Coronation Park. Once the scene of celebrations honoring Queen Victoria, King Edward VII and George V, the park is now a repository for representations of former monarchs and officials of the British Raj in India.Prime Minister Narendra Modi has led a renewed push to reclaim India´s past and erase \"symbols of slavery\" from the country's time under the British crown. His government has scrubbed away colonial-era street names, some laws and even flag symbols.\"I don´t think we should care much about (the royals),\" Milind Akhade, a photographer in New Delhi, said. \"They enslaved us for so many years.\"In Nairobi, Kenya, motorcycle taxi driver Grahmat Luvisia was similarly dismissive of the idea of following the coronation on TV.\"I will not be interested in watching the news or whatever is happening over there because we have been mistreated back then by those colonizers,\" he said.",
        "Herman Manyora, a political analyst and journalism professor at the University of Nairobi, said memories of Britain´s harsh response to the Mau Mau rebellion in the 1950s are still raw.Many Kenyans will not watch the coronation \"because of the torture during colonialism, because of the oppression, because of detentions, because of killings, because of the alienation of our land,\" Manyora said.Not everyone is as critical. In Uganda, political analyst Asuman Bisiika says British culture continues to have a strong influence on young people in the East African country, especially those who follow English soccer. There is also a lot of goodwill for Queen Elizabeth II, who died in September after 70 years on the throne.\"It´s not about caring for the British monarchy,\" Bisiika said. \"It´s about relating.\"In the South African city of Durban, expat British communities have planned a live screening of the coronation ceremony, complete with trumpeters to announce the moment the archbishop of Canterbury crowns Charles. On Sunday, there will be a special church service followed by a picnic or a \"braai,\" a traditional South African barbecue.\"I think people want to be part of an important moment in history,\" said Illa Thompson, one of the organizers of the festivities.Experts say that despite its flaws, historical baggage and fraying edges, the Commonwealth still holds appeal, especially for poorer nations. Gabon and Togo, which are former French colonies with no colonial links to Britain, became the association's newest members last year. Most observers believe countries like Jamaica that want an elected head of state are likely to retain their memberships.",
        "\"Countries, whether they benefit or not, feel like they need to have this closeness to Britain as an economic entity,\" said Kehinde Andrews, a professor of Black Studies at Birmingham City University. \"As much as there will be still be some dissent - (Charles) is not as popular as his mother - it´s all about the economics.\" ___Myers Jr. reported from Kingston, Jamaica. Pathi reported from New Delhi. AP writers Gerald Imray in Cape Town, South Africa; Khaled Kazziha in Nairobi, Kenya; and Rodney Muhumuza in Kampala, Uganda, contributed to this report."
    ]
}