{
    "articleURL": "/wires/aap/article-12053697/Culley-knee-injury-compounds-West-Coasts-woes.html",
    "content": [
        "West Coast coach Adam Simpson fears the worst for Jai Culley after the young midfielder went down with a suspected torn anterior cruciate ligament during the loss to Richmond.",
        "Culley injured his right knee in a marking contest with Tigers defender Nathan Broad just 12 minutes into the first quarter at the MCG on Saturday and slumped to the turf.The 20-year-old stayed down for some time before eventually hobbling off the field with the assistance of trainers.Culley and coach Adam Simpson cut emotional figures at the quarter-time huddle before the Eagles fell to a 15.14 (104) to 8.10 (58) defeat - their sixth loss in a row.\"It's potentially an ACL. We'll wait and see,\" Simpson told reporters post-match.\"It doesn't look great but nothing's been confirmed. Until we get that we can't tell you but it's not looking good.\"It was Culley's ninth senior appearance since he joined West Coast through last year's mid-season rookie draft.The Dandenong Stingrays product enjoyed a breakout performance two weeks earlier, kicking four goals against Port Adelaide in a display that earned him a Rising Star nomination.\"He's done so much to get to where he is and he's at the start of his career so if it is to be (an ACL), it's going to be a pretty big setback for him,\" Simpson said.\"It's the brutality of our game unfortunately. Sometimes it doesn't go your way.\"Culley joins a long Eagles injury list that features stars such as Nic Naitanui, Luke Shuey, Elliot Yeo, Jamie Cripps, Jeremy McGovern and Liam Ryan.",
        "Simpson is unsure whether he will get any players back for the round-nine clash with Gold Coast, though Campbell Chesser could be ready to return from a knee injury.\"We've just got to be careful,\" Simpson said.\"These kids have missed five weeks of football and just to throw them back in because they're available ... we've got to work through that.\""
    ]
}