{
    "articleURL": "/sport/rugbyunion/article-12055167/Leicester-17-20-Harlequins-Tigers-book-play-Ashton-played-game-red-card.html",
    "content": [
        "Ashton was sent off in what might be his final Premiership appearanceWing was shown a red card following a shoulder to the head of Cadan MurleyPremiership’s all-time record try-scorer announced his retirement last month Chris Ashton’s storied career ended with a flash of red rather than the Ash-splash fans craved following his final-round dismissal.",
        "With Leicester Tigers’ place in the Premiership play-off semi-finals secured ahead of their dead rubber against Harlequins, the former England international was sent to the stands by referee Ian Tempest following a shoulder to the head of Cadan Murley.The Premiership’s all-time record try-scorer, who announced his retirement last month, left the Mattioli Woods Welford Road pitch choked with emotion before half-time. His hopes of featuring in the knockout games and a trip to another of his former clubs, Sale Sharks, next weekend hinge on a successful appeal which Tigers head coach Richard Wigglesworth did not rule out.‘We will see what we can get done there [appeal], hopefully that’s not his last [game],’ Wigglesworth said. ‘He had a wry smile, “only me” he said. That’s been the story of Chris, it’s always headlines, isn’t it?‘We’d have liked them to write them like he did against Exeter but it wasn’t to be.’",
        "The storm surrounding Tempest in hostile Leicestershire waters started with the game’s first score as Harlequins were awarded a penalty try after a rolling maul crumpled.The Tigers response was immediate, even with Cameron Henderson in the sin-bin, as Julian Montoya drove over from close range.A moment of magic from Marcus Smith put Louis Lynagh behind enemy lines before Josh Bassett generously offloaded to his wing partner Murley to strengthen his position as the division’s top tryscorer with his 15th of a prolific campaign.",
        "Mike Brown, playing against the club for which he made a record 351 appearances, was sent tumbling to the ground following an aerial collision with Lynagh.A lengthy TMO check ensued before play was waved on.There was no such reprieve for Ashton as he was red-carded and Smith’s penalty put Quins 10 points up at the break. Handre Pollard’s place kick shortly after the restart closed the gap before Danny Care sportingly conceded he fumbled reaching for the line after Harry Potter hauled him in.Smith’s third successful shot at goal gave Quins a cushion that was needed as Tommy Reffell’s late try cut the gap to three come the final whistle, despite Tigers’ last-ditch attempts to win it."
    ]
}