{
    "articleURL": "/tvshowbiz/article-12052913/Shanti-Fiennes-25-transforms-Princess-Diana.html",
    "content": [
        "Shanti Fiennes has transformed into Princess Diana for a new project reimagining the late Princess of Wales on a road trip to California.",
        "And she has definitely got the look as she becomes the latest actress to play Princess Diana, following in the footsteps of Elizabeth Debicki and Emma Corrin.The niece of Ralph and Joseph Fiennes has the chance to establish herself alongside them as box office royalty with Diana In Love.The project is a fictional re-imagining of Diana on a road trip to California to view a £20million beachside pad in Malibu where she and Dodi Fayed will set up home.Shanti, whose father is composer Magnus Fiennes, told the Daily Mail's Richard Eden of the filming process: 'The documentary style of the filming is incredibly freeing.'",
        "'We filmed on a beautiful yacht in Marina del Rey [and] we'll be filming in California all summer,' she added.Very Diana. But writer-director Brent Roske was inspired by a rather darker cinematic landscape — Quentin Tarantino's Inglourious Basterds.'My friend Omar Doom got to kill Hitler [in that movie],' he tells me. 'I figured if Quentin could rewrite history to make a crowd-pleaser, I could do the same.'Photographs from filming show Shanti looking the spitting image of Princess Diana as she sports her signature blonde bob.In one snap, Shanti sports a coral shirt as she sits on a boat and flashes a huge smile at the camera. ",
        "While another shot shows her relaxing in a dressing gown with a towel wrapped around her head during filming.Shanti is the niece of Ralph - who is known for his roles in The Menu, Harry Potter and Maid In Manhattan - and Joseph, who is best known for The Handmaid's Tale.Shanti will be the next actress to play Princess Diana, following in the footsteps of The Crown's Emma Corrin and Elizabeth Dibicki.Fans are awaiting the release of The Crown's final series later this year, with the show already courting controversy as it plans to depict the tragic death of Princess Diana. "
    ]
}