{
    "articleURL": "/sport/football/article-12057173/Man-United-fans-react-fury-David-Gea-clanger.html",
    "content": [
        "David de Gea produced another goalkeeping error to gift West Ham the leadThe Manchester United first choice allowed Said Benrahma's shot to squirm inErik ten Hag's side face a battle to secure Champions League qualification Manchester United supporters reacted with fury after goalkeeper David de Gea produced another error to allow West Ham to take the lead.",
        "De Gea has found himself increasingly under the spotlight in recent weeks and months with debate raging over whether or not the club should offer him a new contract.The Spaniard did little to help his case to remain as the club's No 1 with another egregious mistake, gifting Said Benrahma a goal.Yet despite the latest mistake, our Sports Agenda column revealed that discussions over De Gea's new contract are progressing positively.Benrahma was released by Michail Antonio and ran at the United backline, though surrounded by a number of defenders he appeared to have a difficult job on his hands finding the back of the net.",
        "Letting off a speculative effort with his right-foot, Benrahma's shot was weak and should have easily been saved by De Gea but the Spain international allowed it to squirm under his arm, sparking wild scenes at the London Stadium as West Ham chase Premier League survival. The goal could have potentially enormous ramifications for United's top four hopes, with Liverpool increasingly breathing down their necks as the season enters its final weeks.De Gea's error was seized upon by the BT Sport pundits, with Peter Crouch saying: 'He's had a shocker. We can't dress it up. If you look at De Gea's position, he can't get on the front foot. It's a terrible mistake.'",
        "Former United defender Rio Ferdinand added: 'No you can't (justify the mistake). It's a bad mistake, I think he'll take full responsibility. 'His left foot does slip slightly but that's no excuse. He's got full contact on the ball, a whole hand on the ball, it's not like he's stretching and getting finger tips, he got a whole hand. 'He misses it completely and it's a big, big mistake.'Afterwards, manager Erik ten Hag insisted he wanted De Gea to sign the new deal.'We want him to stay and we want him to extend his contract,' Ten Hag said. 'He has the most clean sheets in the Premier League. We would not be here in this position without him.'I believe there are no concerns. It happens. As a team, you have to deal with it, show character, be resilient, bounce back and that's what this team will do.'We started well, we dictated the game, we created chances, we didn't take them, and then one mistake. In three days, twice individual mistakes makes us lose games.'",
        "Reacting angrily on social media, United supporters urged the club to act over De Gea's place in Ten Hag's starting XI.'Don't give De Gea any contract to sign, he should go look for another club!' one supporter wrote on social media.",
        "Another echoed that sentiment, commenting: 'If De Gea gets extended and no new keeper is signed and it's starts going wrong next season then it's all on Ten Hag. It'll be entirely his fault if he gets himself sacked.'The mistake is De Gea's fourth error which has directly led to a goal in all competitions this season, with significant question marks regarding his continued suitability as the club's first choice.Sunday evening's mistake follows a poor performance away at Sevilla in the Europa League, where he was culpable for all three of the Spanish side's goals that night as Ten Hag's side were dumped out of the Europa League.'Can't keep making excuses for De Gea man, he's got to step up or lose his place,' a frustrated supporter wrote.'Get out of our club David de Gea,' another wrote, 'I am sorry.'Using few words to emphasise their point, another fan added: 'De Gea it's time to go.'However, others on social media pointed to United's starting team, pointing to De Gea's presence in goal, Casemiro in midfield and Wout Weghorst in attack as responsible for the club's struggles.",
        "'Our spine today is De Gea in net, Casemiro holding, and Wout as a 10. How can you progress the ball with that?' they queried.",
        "Ten Hag has insisted that he backs De Gea to continue as his first choice, despite the 32-year-old's obvious limitations with the ball at his feet. 'He's the one with the most clean sheets in the Premier League, that shows he's a very capable goalkeeper,' he said last month when pressed on his continued selection.His deal is set to expire this summer and as yet no agreement has been reached. United, who are seeking to cut back on the inflated wages handed out to first team squad members in recent weeks, wish to keep him but only on lower weekly terms than his current £350,000."
    ]
}