{
    "articleURL": "/wires/afp/article-12061117/AI-replace-80-jobs-years-expert.html",
    "content": [
        "Artificial intelligence could replace 80 percent of human jobs in the coming years -- but that's a good thing, says US-Brazilian researcher Ben Goertzel, a leading AI guru.",
        "Mathematician, cognitive scientist and famed robot-creator Goertzel, 56, is founder and chief executive of SingularityNET, a research group he launched to create \"Artificial General Intelligence,\" or AGI -- artificial intelligence with human cognitive abilities.With his long hair and leopard-print cowboy hat, Goertzel was in provocateur mode last week at Web Summit in Rio de Janeiro, the world's biggest annual technology conference, where he told AFP in an interview that AGI is just years away and spoke out against recent efforts to curb artificial intelligence research.- As smart as humans? -Q: How far are we from artificial intelligence with human cognitive abilities?\"If we want machines to really be as smart as people and to be as agile in dealing with the unknown, then they need to be able to take big leaps beyond their training and programming. And we're not there yet. But I think there's reason to believe we're years rather than decades from getting there.\"- AI risk -Q: What do you think of the debate around AI such as ChatGPT and its risks? Should there be a six-month research pause, as some people are advocating?",
        "\"I don't think we should pause it because it's like a dangerous superhuman AI... These are very interesting AI systems, but they're not capable of becoming like human level general intelligences, because they can't do complex multi-stage reasoning, like you need to do science. They can't invent wild new things outside the scope of their training data.",
        "\"They can also spread misinformation, and people are saying we should pause them because of this. That's very weird to me. Why haven't we banned the internet? The internet does exactly this. It gives you way more information at your fingertips. And it spreads bullshit and misinformation.\"I think we should have a free society. And just like the internet shouldn't be banned, we shouldn't ban this.\"- Threat to jobs -Q: Isn't their potential to replace people's jobs a threat?\"You could probably obsolete maybe 80 percent of jobs that people do, without having an AGI, by my guess. Not with ChatGPT exactly as a product. But with systems of that nature, which are going to follow in the next few years.\"I don't think it's a threat. I think it's a benefit. People can find better things to do with their life than work for a living... Pretty much every job involving paperwork should be automatable.\"The problem I see is in the interim period, when AIs are obsoleting one human job after another... I don't know how (to) solve all the social issues.\"- AI positives -Q: What can robots do for society today, and what will they be able to do in the future, if AGI is achieved?",
        "\"You can do a lot of good with AI.\"Like Grace, (a robot nurse) we showcased at Web Summit Rio. In the US, a lot of elderly people are sitting lonely in old folks' homes. And they're not bad in terms of physical condition -- you have medical care and food and big-screen TV -- but they're bad in terms of emotional and social support. So if you inject humanoid robots into it, that will answer your questions, listen to your stories, help you place a call with your kids or order something online, then you're improving people's lives. Once you get to an AGI, they'll be even better companions.\"In that case, you're not eliminating human jobs. Because basically, there's not enough people who want to do nursing and nursing assistant jobs.\"I think education will also be an amazing market for humanoid robots, as well as domestic help.\"- Regulation -Q: What regulation do we need for AI to have a positive impact?\"What you need is society to be developing these AIs to do good things. And the governance of the AIs to be somehow participatory among the population. All these things are technically possible. The problem is that the companies funding most of the AI research don't care about doing good things. They care about maximizing shareholder value.\""
    ]
}