{
    "articleURL": "/wires/reuters/article-12056473/Reds-TJ-Friedl-Jonathan-India-look-stay-hot-vs-White-Sox.html",
    "content": [
        "TJ Friedl has tormented the Chicago White Sox the past two nights and Jonathan India also has been quite a pest.",
        "The top two hitters in the Cincinnati lineup will look to create more havoc on Sunday when the Reds and visiting White Sox complete a three-game series.Chicago recorded a 5-4 win in Friday's opener before the Reds bounced back with a 5-3 victory on Saturday.No. 2 hitter Friedl played the starring role with a homer, triple and four RBIs in Saturday's contest. Leadoff hitter India reached base four times on three hits and a walk and scored three times.Friedl delivered the biggest blow in the fifth inning with a go-ahead three-run shot, his third homer of the season. He tacked on a run-scoring triple in the seventh.\"The three-run homer is nice,\" Reds manager David Bell said. \"TJ has plenty of power. He's not trying to hit a home run there. He got the good part of the bat on the ball. Squared up, those are going to come for him without trying.\"Friedl is 4-for-8 with five RBIs in the series. He had a run-scoring double in Friday's game and also robbed Chicago's Andrew Vaughn of a homer with a superb catch.India has scored four times in the series. He homered in Friday's loss.\"We really push each other's energy,\" Friedl said of him and India setting the table. \"Seems like when we rally it's a different guy every night. The opportunity presented itself for me tonight.\"",
        "Cincinnati has won just two of its past six games. Chicago has won four of its past six contests.The White Sox sustained a huge loss Saturday when Eloy Jimenez underwent an appendectomy at a Cincinnati hospital. He is expected to be sidelined four to six weeks.Jimenez was experiencing pain Friday night and it intensified overnight, prompting the White Sox to send him to the hospital on Saturday.\"Life deals you stuff you've got to deal with,\" White Sox manager Pedro Grifol said after Saturday's loss. \"We've got to move on.\"Jimenez, 26, owns an eight-game hitting streak and is batting .258 with four homers and 15 RBIs in 25 games this season.\"It's another hurdle for us,\" outfielder Gavin Sheets said. \"Losing his presence, it's tough, how talented he is and the way he's swinging the bat. It (stinks).\"Chicago's Luis Robert Jr. is 5-for-6 with a homer in the series. He had his third three-hit game of the season on Friday and reached base four times (two hits, two hit by pitches) on Saturday.The White Sox were just 1-for-8 with runners in scoring position on Saturday, with Andrew Benintendi's RBI double accounting for the lone hit.Cincinnati's Luke Fraley (lower-back stiffness) was scratched from Saturday's lineup. However, the Reds activated Wil Myers (COVID-19) off the injured list. Myers was hitless in four at-bats.",
        "Chicago will send right-hander Michael Kopech (0-3, 5.97 ERA) to the mound on Sunday.Kopech has struck out 34 batters in 31 2/3 innings but has been wild with 21 walks. He has served up eight homers.Kopech, 27, received a no-decision in his last turn when he gave up one run and one hit over six innings against the Minnesota Twins. He struck out seven and walked a season-worst five batters.This will be Kopech's first career start against the Reds. He has given up two hits over 4 2/3 innings in two relief efforts against Cincinnati.Graham Ashcraft (2-0, 2.00) will start for the Reds and look to maintain his early-season form.The 25-year-old has allowed two runs or fewer in all six of his starts. He gave up one run and six hits over six innings in a no-decision against the San Diego Padres on Monday.Ashcraft has yet to face the White Sox in his career.--Field Level Media"
    ]
}