{
    "articleURL": "/sport/rugbyunion/article-12039605/Poaching-NRL-stars-like-Suaalii-Andy-Marinos-shock-resignation-Rugby-Australia.html",
    "content": [
        "RA CEO Andy Marinos resigned Butted heads with outspoken chair Comes just months from World Cup A tense relationship with outspoken Rugby Australia (RA) chair Hamish McLennan was one of the reasons behind CEO Andy Marinos' shock resignation just months out from a World Cup. ",
        "Marinos left the rugby community stunned on Monday when he announced his sudden resignation to 'pursue other endeavours' just two years into his tenure at the game's governing body in Australia.Speculation on why it had come with just three months left in a four-year World Cup circle was rife, but one of the major reasons was McLennan's bullish insistence on targeting NRL players, according to the Sydney Morning Herald. Once such example given was the poaching of former schoolboy rugby prodigy Joseph-Aukuso Suaalii from the Roosters for an eye-watering three-year, $1.6million-a-season contract beginning at the end of 2024.It was not a backroom deal either, done out of the prying eyes of the public and a sports media contingent hungry from more drama from Rugby Australia.",
        "This was a high-profile poaching played out in the media that has since degenerated into a slanging match from both sides, and sources told the publication that didn't sit well with Marinos. He believed given astronomical deals to code-hoppers would inflate the market and force much bigger contract requests from existing top tiers players.At a time when a lot of the top Australian rugby talent in playing overseas in places like France and Japan, that is a very real threat to Super Rugby, in particular, where most Australian side have been very uncompetitive this year.  ",
        "That being said, the aggressive pursuit of Suaalii, and continued public targeting of other NRL players, was not the only thing reportedly driving a wedge into an already tense relationship.   As McLennan and rugby league supremo Peter V'landys continue taking immature pot shots at each other and their respective codes, the outspoken RA chair is believed to have become frustrated at Marinos' more conservative approach to rugby league issues. Marinos played one NRL game in addition to his successful career in the 15-man code, which included eight Tests for Wales - but it is his time as CEO at SANZAAR, which overseas rugby in Australia, New Zealand, South Africa and Argentina that has made him a global success. ",
        "But now he'll be leaving to pursue 'other endeavours', but will stay on until mid-June: just two months out from the 2023 Rugby World Cup in France. It means he becomes the Marinos is the third CEO to depart Rugby Australia in just three years, after interim boss Rob Clarke stood in following Raelene Castle's unceremonious axing, and the fifth since the long-serving and highly-respected John O'Neill departed in 2012. Ex-Wallabies Morgan Turinui and Stephen Hoiles referenced O'Neill, who was the figurehead of rugby union in Australia during two stints comprising almost 15 years across the 1990s and 2000s, when discussing the current atmosphere at RA headquarters. ",
        "Hoiles, speaking on Stan Sport show Between Two Posts, pondered: 'Doesn't Hamish sort of act like a CEO at the moment anyway?' 'Andy (Marinos) was not really in the public eye the last few months and Hamish is very much in the public eye, isn't that kind of what a CEO does?'Turinui agreed, saying he was very intrigued to see whether this means the outspoken McLennan will now become even more hands on.",
        "'It's like an executive chairman, the (John) O'Neill days was almost like a combination (of chairman and chief executive),' he said.'I actually think that Andy was a quite a good foil for Hamish, as you mentioned Hamish has that role out there and Andy seemed to be the relationship guy in the background.'Now what Hamish wants to do hands-on wise, I think will predicate what you want from a CEO. 'Is it genuinely like a COO, operational, hands-on, running the exco in at RA and you let Hamish blaze away as he does?'It'll be interesting to see who the candidates are. Rugby Australia don't have a classic chief operating officer that you would think about bringing up.'It is believed that Wallabies legend Phil Waugh, a current RA board member who holds two Masters degrees, is one of the leading candidates to replace Marinos.",
        "Former NRL boss and current chief of the Australian Cricketers Association players union Todd Greenberg is also believed to be in the running.",
        "Wallabies great Phil Kearns and ex-NRL and Football Australia boss David Gallop have already ruled themselves out.While the timing is curious, Hoiles believes the once-poisoned chalice is now an appealing prospect given the turnaround in financial and on-field fortunes. 'It'd be a great time to come into rugby and be involved in the sport,' he said.'You've got a bullish chairman who's out there and he's in market and doing some good things. 'You've got a proven head (Wallabies) coach (Jones). So you're going to want someone that's capable of managing some big personalities.'McLennan praised Marinos in a statement released by RA following the latter's resignation, saying he had achieved an enormous amount during his two-year tenure. ",
        "'We (Rugby Australia' asked Andy to draw upon his impressive career experience and extensive global relationships to re-establish Rugby as a leading code in Australia - he has delivered on this and been fundamental in the turnaround of the business,' he said in a statement.'Andy will leave RA having delivered several key projects, including the finalisation of the 2027 and 2029 Rugby World Cups, locking in the 2025 British and Irish Lions Tour, planning for a new contracting model for the professional game, implementation of strategy to professionalise Women's XVs Rugby, and a new four-year Collective Bargaining Agreement for our professional men's and women's players.'",
        "Turinui echoed those sentiments, saying, in particular, that securing home World Cups (men in 2027, women in 2029) was a 'huge achievement'. the path that was trodden in and out of covid, just getting rugby back on its feet again to be able to push forward (is impressive)'I think the timing is good around the AGM last week, some positive operating financial news.'There's a lot of positives to Andy Marinos' time.'Watch every Super Rugby game and Test match, ad-free, live and on demand on the Home of Rugby, Stan Sport. ",
        "Rugby Australia confirms that Chief Executive Officer (CEO), Andy Marinos, has decided to leave his role in the coming weeks to pursue new opportunities.Marinos joined RA in February 2021, with a specific mandate to secure the immediate and long-term future of Rugby in Australia, at a time when sporting codes globally were grappling with the commercial and operational impacts of COVID-19.In his two years, Marinos has overseen significant change for Rugby in Australia, including the financial turnaround from a $27.1 million loss in 2020 to a $8.2 million profit for 2022, as announced at the recent Annual General Meeting.Chairman Hamish McLennan said Marinos had joined RA at an uncertain time for the sport, with a clear directive from the Board to create a pathway for making Australian Rugby great again.'We asked Andy to draw upon his impressive career experience and extensive global relationships to re-establish Rugby as a leading code in Australia - he has delivered on this and been fundamental in the turnaround of the business,' he said.'Andy will leave RA having delivered several key projects, including the finalisation of the 2027 and 2029 Rugby World Cups, locking in the 2025 British and Irish Lions Tour, planning for a new contracting model for the professional game, implementation of strategy to professionalise Women's XVs Rugby, and a new four-year Collective Bargaining Agreement for our professional men's and women's players.'On behalf of the Board, I would like to thank Andy for his contribution to RA. We wish him well with his future endeavours.'",
        "Mr Marinos said he had enjoyed his tenure at RA and was proud of what he and the team had accomplished in some often-challenging times.'I cannot overstate the commitment and incredible work ethic of the people around me at RA, and the roles they have played in helping drive some critical structural changes for Rugby in this country,' he said.'The foundations have been established and the business is now well-prepared to test the market for private equity investment, making it the right time for me to move on.'Importantly, I will leave with the knowledge that RA is in a stronger position than when I joined, and proud of what has been achieved in my tenure as CEO.'I want to thank the Board for the opportunity to lead this organisation, the Member Unions and the Super Rugby Clubs for their support.'To all our teams in Gold, State, Territory and club colours, the players, the coaches and support staff, it has been a privilege to work alongside you. I will watch with interest, the next Golden Decade of Australian Rugby, and wish you all success, both on and off the pitch.'Rugby Australia has subsequently commenced a recruitment process. Marinos will remain at RA until mid-June to assist with a transition period for the business."
    ]
}