{
    "articleURL": "/tvshowbiz/article-12048929/Jersey-Shore-Family-Vacation-Sammi-Sweetheart-Giancola-shocks-roommates-surprise-return.html",
    "content": [
        " The 36-year-old reality star announced in 2018 that she would not be returning for the reboot Jersey Shore: Family Vacation 'Hey guys, sorry I'm late!,' Sammi hollered as she completely surprised the roommates in a teaser shown at the end of the season six finale The packed teaser also showed the return of Ronnie Ortiz-Magro, 37, who previously was in a rocky relationship with Sammi while they starred on Jersey ShoreSammi 'Sweetheart' Giancola shocked her roommates as she was shown in a teaser returning after an 11 year hiatus on Thursday's episode of Jersey Shore: Family Vacation.",
        "The 36-year-old reality star was an original cast member of the widely popular MTV show Jersey Shore, but announced in 2018 that she would not be returning for its reboot Jersey Shore: Family Vacation.Sammi appeared in a teaser shown at the end of the season six finale titled The Hangover accompanied by Angelina Pivarnick, 36.'Holy s***. Oh, my God,' said Mike 'The Situation' Sorrentino, 40, when he saw Sammi walk in.'Hey guys, sorry I'm late!,' Sammi hollered as she completely surprised the roommates.",
        "The roommates were shown with their jaws dropped in shock at the sight of Sammi.'What the f***!,' shouted Paul 'DJ Pauly D' DelVecchio, 42.'Is this real? Are you a hologram? Is this AI?,' Pauly wondered in a confessional.Sammi appeared to be a new catalyst for drama as she was shown confronting the roommates.'Why are you being messy, coming for me now?,' Sammi said in the kitchen after her surprise arrival.Sammi was next seen sitting at a table and shouting, 'Can you let me f***ing talk?'Nicole 'Snooki' Polizzi, 35, and Deena Cortese, 36, were both shown crying.'I don't wanna be here,' Snooki bawled while on the phone.",
        "'Just shut up!,' Sammi said back at the table.'Just let me go home,' Deena tearfully pleaded.",
        "'Hold on, don't make it messier,' Sammi warned as the preview cut back to the table talk.Sammi was then shown in a confessional and said, 'I am still the sweetest b**** you'll ever meet.'The packed teaser also showed the return of Ronnie Ortiz-Magro, 37, who previously was in a rocky relationship with Sammi while they starred on Jersey Shore from 2009 to 2012.Sammi declined to join the reboot to avoid 'potentially toxic situations'.Ronnie was show arriving at Mike's home in New Jersey.'You're ready to come back?,' Mike asked.",
        "'I'm ready to come back. I feel good, bro,' said Ronnie, who stepped away from the show to work on himself.'How about the squad? It's not easy for me to keep a secret,' Mike said in self-acknowledgement of his loose lips. 'It's not my job to tell your story.''Yeah,' Ronnie replied.The season finale focused on Angelina being angry with Jennifer 'JWoww' Farley, 37, over her reaction to her surprise engagement to Vinny Tortorella during the group trip to New Orleans.Angelina after making up with Mike confided in him that she was upset with Jenni, but asked him to keep quit about.Mike, however, decided to take on a new role as 'The Mediation' and told Jenni that Angelina felt she was not happy about her engagement.",
        "'It's like she settled beef with Mike and then played ping pong in her head to find someone else to have a problem with, like she can't be happy,' Jenni said in a confessional.She was fed up with Angelina as the drama reminded her of the disastrous group speech at Angelina's wedding. ",
        " 'I think I'm going to take my mic off and get my kids and leave. I'm not doing this,' Jenni told Mike.Jenni cried while talking to Mike and insisted that she was happy for Angelina.Angelina and Jenni later talked at the hotel and eventually agreed that it was a misunderstanding.Mike was then blasted by Angelina for causing the drama by sharing their conversation with Jenni.Deena then rallied everyone for an awkward group photo.",
        "Jersey Shore: Family Vacation will return next week with the first part of the two-part reunion.The reboot premiered on MTV in April 2018 with the cast reuniting in Miami, Florida, with the exception of Sammi.A release date for season seven has not yet been released.Ronnie pleaded no contest to one count of domestic battery and one count of resisting arrest related to an October 2019 incident in Los Angeles.He has five-year-old daughter Ariana with his ex Jen Harley."
    ]
}