{
    "articleURL": "/money/markets/article-12046011/Trainline-shares-surge-following-continued-recovery-rail-journeys.html",
    "content": [
        "Trainline swung to a £21.2million profit for the 12 months ending FebruarySales by its UK consumer arm rose by £1billion despite consecutive rail strikes About 200million train tickets were sold by the firm across Europe last year Trainline shares topped the FTSE 350 charts on Thursday, jumping by 13 per cent, as the ticketing firm reported returning to profit last year following a resurgence in train travel.",
        "The company swung to a £21.2million profit for the 12 months ending February, after making an £11.9million loss in 2021 when coronavirus restrictions hit demand for railway journeys.Loosening travel curbs helped the company's operating performance surpass pre-pandemic levels, as did rising foreign travel and carrier competition on European rail routes.",
        "Its revenue climbed by almost three quarters to £327million, as net ticket sales soared amid bumper growth across all markets.Sales by its UK consumer business skyrocketed by £1billion despite successive rail strikes by the Rail, Maritime and Transport (RMT) union costing the firm £5-£6million in lost sales per day.At the same time, ticket purchases shot up by 125 per cent in its international consumer division, partly because of increased marketing spending, and doubled in its business-to-business segment.Trainline achieved exceptionally strong results in Italy, thanks to the launch of new advertising campaigns, and Spain, where ticket sales have multiplied fourfold in the past three years. The London-based company attributed expansion in the latter country to the recent liberalisation of the Spanish high-speed rail network, the world's second longest after China.About 200 million train tickets were sold by the group throughout Europe last year,  chief executive Jody Ford said. For the current financial year, Trainline expects ticket purchases and revenue to be 13 to 22 per cent higher. ",
        "Russ Mould, investment director at AJ Bell, said: 'Like a player of popular board game Ticket to Ride, Trainline has broadened its horizons by buying a European expansion pack. While it has been bedevilled by strikes in its core UK market, on the Continent it is growing rapidly.'Expanding in Europe is a solid move, particularly given many of these territories benefit from better-invested rail infrastructure and more affordable ticket prices, which help drive more people to take the train.' However, the firm's trade could be significantly impacted in the near term by further industrial action across France, which has been beset by strikes since early March over President Emmanuel Marcon's pension reforms.In the UK, meanwhile, drivers working for a dozen train operators are planning 24-hour walkouts for next Friday, 31 May, as well as on 3 June, with the latter date coinciding with the FA Cup Final and Epsom Derby.RMT members are also set to strike on 13 May, the same day as the final of the Eurovision Song Contest in Liverpool.In addition, the UK Government's proposed Great British Railways body, which would set ticket prices, poses a potentially major commercial threat to Trainline's business model.Trainline shares were 13.1 per cent higher at 270.4p just before trading closed on Thursday, although they remain about 48 per cent below their levels two years ago. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}