{
    "articleURL": "/wires/aap/article-12050737/Goodwin-brace-fires-Reds-finals-win-Wellington.html",
    "content": [
        "A classy double from captain Craig Goodwin has fired Adelaide to a 2-0 victory against Wellington Phoenix in their A-League Men elimination final.",
        "Goodwin's Friday night feats at Adelaide's Coopers Stadium ended the Phoenix's season and also the tenure of coach Ufuk Talay, who has opted not to continue.The Socceroos winger scored in open play in the first half and from the penalty spot in the second to steer the Reds into a two-legged semi-final against Central Coast Mariners.The winner of Saturday night's grudge elimination match between Western Sydney Wanderers and Sydney FC will meet table-toppers Melbourne City in the other semi-final.Goodwin's initial strike came in the 19th minute when Wellington defender Callan Elliot failed to clear a speculative Louis D'Arrigo cross.Elliot attempted a glancing header but the ball fell at the dangerous feet of the Reds' star winger.Goodwin shimmied to his left, then swivelled to his right to turn a befuddled Elliot inside-out before thumping a powerful right-footer into the far corner.Wellington's best first-half chance came in stoppage time, when Alex Rufer managed a low left-footer from a corner scramble - the ball struck a post and rebounded to Adelaide goalkeeper Joe Gauci.The Phoenix's fate was settled in the 66th minute when Goodwin scored from the spot after the speediest of counter-attacks.After a Gauci punch from a corner, substitute Nestory Irankunda tore downfield and laid off to Goodwin, who was brought down in a tangle with the hapless Elliot.",
        "From the spot, the Socceroos winger scored his 14th goal of the league campaign, aiming straight as Wellington 'keeper Oli Sail dived right.Reds coach Carl Veart praised the \"discipline and focus\" of his team.\"We were on the front foot, we were aggressive, we didn't give them too many opportunities to play through us, so very pleased with that,\" he said.Phoenix coach Talay - who was coy on his future, saying only there were \"a few things bubbling in the background\" - lamented his side's errors.\"(Adelaide) were clinical in two moments from two big mistakes of ours,\" he said.\"Two mistakes cost us two goals.\"One, we didn't clear the ball; the second one ... it was a silly challenge that we didn't really need to make.\"Adelaide kept their first clean sheet in 14 games to enhance their superb record in finals at home, where they're unbeaten in seven matches dating back to April 2013.Wellington have now lost all seven finals they have played in Australia.Adelaide host the Mariners in their opening semi-final next weekend, the exact date to be determined, with a return bout on the Central Coast on May 20."
    ]
}