{
    "articleURL": "/tvshowbiz/article-12039111/Teyana-Taylor-brings-plate-CHICK-FIL-Met-Gala.html",
    "content": [
        "While Met Gala guests dined on bowls of gourmet pea soup, Teyana Taylor was enjoying a different sort of fare at the A-list event - a plate full of Chick-fil-A she brought herself.",
        "Teyana, 32, was called out by tablemate Pusha T, 45, who joked she was 'embarrassing' him for bringing the fast food to the exclusive bash.'@teyanataylor is embarrassing me. She brought @chicfilausa to the #MetGala. I want her away from me... #HARLEM,' he wrote on an Instagram video capturing her plate full of fries, fried chicken, with a side of dip.Even Usher, 44, tried to interfere - the R&amp;B artist chuckled at the sight of Teyana munching on her fast food.'#HARLEM @teyanataylor @usher tried to stop her...' Pusha T posted, along with a face slapping emoji.",
        "Teyana appeared be teasing Pusha for their different plates as she compared his bowl of partially-consumed pea soup with her own dinner.'It's two types of ppl,' she wrote with crying laughing emojis.Monday night's theme was Karl Lagerfeld: A Line of Beauty, and the menu was curated to pay tribute to the late fashion designer.'This menu was designed to honor the late fashion icon and pay homage to his favorite foods and global palate,' Olivier Cheng, the Vogue special events department and caterer, told the fashion bible.'These dishes were created to maintain seasonality while using some of his favorite ingredients, such as King salmon. There is a sophisticated elegance to these pairings, one we feel that he would have truly enjoyed,' Olivier said.",
        "The dinner menu consisted of 'chilled spring pea soup with baby vegetables, lemon crème fraîche, and truffle snow, followed by Ōra King salmon with vegetable nage, asparagus, pickled strawberries, and radish—all served on vintage china,' reports Vogue.The 2023 Met Gala returned to the Metropolitan Museum of Art in New York City on Monday evening.Since 1948, stars have ascended the majestic staircase into a very exclusive party where no selfies are allowed. ",
        "This year, the ball's theme is Karl Lagerfeld: A Line of Beauty. The late German designer was Chanel's long-time creative director. He passed at age 85 in 2019.His beloved cat, Choupette, has even been invited to the festivities, however the feline was unable to attend.The decision to honor Karl has sparked controversy given the many offensive remarks he has made over the years, from slamming the #MeToo movement to opposing same-sex marriage.'I’m against it for a very simple reason: In the 60s they all said we had the right to the difference. And now, suddenly, they want a bourgeois life,' he told Vice of same-sex marriage. ",
        "'It’s difficult to imagine—one of the papas at work and the other at home with the baby. How would that be for the baby? I don’t know. I see more lesbians married with babies than I see boys married with babies. And I also believe more in the relationship between mother and child than in that between father and child.'",
        "While he ultimately showed his support for same-sex marriage at his spring 2013 Chanel haute couture show, he still said he was 'less keen' on same-sex couples adopting children, according to AP.Along with the Vogue editor-in-chief Anna Wintour, who runs and hosts the annual event, the 2023 MET Gala was also co-hosted by Penelope Cruz, Dua Lipa, Michaela Coel and also Roger Federer.While the show may be known for its glitzy and over-the-top red carpet - with details of what occurs inside often remaining mysterious - at its heart, it is a fundraising event for the Metropolitan Museum of Art's Costume Institute."
    ]
}