{
    "articleURL": "/wires/reuters/article-12053159/Sweden-Thailand-improve-4-0-U-S-3-1-International-Crown.html",
    "content": [
        "Sweden swept China and Thailand held off South Korea to remain unbeaten at the Hanwha LifePlus International Crown on Friday in San Francisco.",
        "Fourth-seeded Sweden now leads Pool A at 4-0 through two days of round-robin play -- locking up a berth in the semifinals -- and the top-seeded United States moved into second at 3-1 after taking both points from England on Friday. Sweden and the U.S. will battle Saturday in the final day of the round-robin stage.In Pool B, sixth-seeded Thailand and seventh-seeded Australia (3-0-1) are guaranteed advancement to the semifinals after Australia won one match and tied the other against Japan on Friday.The International Crown is being played for the first time since 2018 due to the COVID-19 pandemic. The top eight countries in women's golf were determined by last year's Rolex Rankings and each country sent four of its top players to the unique team event.The countries were seeded and split into two pools, with teams competing in four ball (best ball) in a single round-robin format from Thursday to Saturday. One point will be awarded for a win and a half-point for a tie, with the top two countries advancing from each pool.Two semifinal matches will be played Sunday morning, each consisting of two singles matches and one foursomes (alternate-shot) match. The winning semifinal countries will compete in the final match on Sunday afternoon in the semifinal format.",
        "On Friday, Sweden's Madelene Sagstrom and Maja Stark defeated China's Ruoning Yin and Xiyu Lin 2 and 1. The Swedes birdied the par-5 fifth, par-4 seventh and par-4 eighth at TPC Harding Park to go 3 up and held on from there.Anna Nordqvist and Caroline Hedwall doubled the pleasure with a 2-and-1 victory over China's Yu Liu and Ruixin Liu, going 3 up through six and staying the course.\"I'm really proud of my team,\" Nordqvist said. \"I think we've all grown up with a lot of match play, a lot of playing for Sweden in the European team events and the World Amateur Championships. I think we're just very comfortable and very confident.\"There's just something special to it. We fight until the end. It's match play; you never know what's going to happen.\"Thai stars Patty Tavatanakit and Atthaya Thitikul handled South Korea's Jin Young Ko and Hyo-Joo Kim 3 and 2. In the last match of the night, sisters Ariya and Moriya Jutanugarn of Thailand never trailed Hye-Jin Choi and In Gee Chun, leading 3 up with three to play. The Koreans extended the match with Chun's birdie at the par-4 16th, but they halved the next hole to end the match.Second-seeded South Korea, the defending champion, has yet to score a point despite entering the competition with four top-25 golfers in the world, including three ranked in the top 12.",
        "Lilia Vu and Nelly Korda got the Americans on the board Friday by defeating England's Alice Hewson and Liz Young 2 and 1. Danielle Kang and Lexi Thompson then beat Bronte Law and Jodi Ewart Shadoff 3 and 2, Thompson's birdie at the par-4 16th clinching the match.Korda said, \"We were 2-down through 2, and honestly we were just kind of attacking pins. It was kind of cold out there, and then we finally got it back to even. On the back nine, we kind of turned it up where we won three in a row, and then after (that) we lost one, but Lilia made a nice putt on 17 to secure our win.\"Overall I think it was a lot of teamwork out there.\"Australia's Minjee Lee and Stephanie Kyriacou beat Japan's Nasa Hataoka and Ayaka Furue 2 up. Both countries held a lead in the second match, but Hannah Green and Sarah Kemp of Australia parred No. 16 while Hinako Shibuno and Yuka Saso both bogeyed, allowing Australia to draw even. The teams halved the final two holes to split the point.The tournament continues Friday with the following matchups:Saturday Pool ANo. 1 United States vs. No. 4 SwedenNo. 5 England vs. No. 8 China",
        "Saturday Pool BNo. 2 South Korea vs. No. 3 JapanNo. 6 Thailand vs. No. 7 AustraliaStandings (W-L record, points)Pool A1. Sweden 4-0, 4 points2. United States 3-1, 3 points3. China 1-3, 1 point4. England 0-4, 0 pointsPool B1. Thailand 4-0, 4 points2. Australia 3-0-1, 3 1/2 points3. Japan 0-3-1, 1/2 point4. South Korea 0-4, 0 points--Field Level Media"
    ]
}