{
    "articleURL": "/sport/racing/article-12039915/Top-jockey-Jamie-Kah-breaks-silence-return-horse-racing-fall-Flemington-Racecourse.html",
    "content": [
        "Kah was involved in horror race fall Left her sidelined with brain injury Has opened up on potential return Champion jockey Jamie Kah has broken her silence on finally returning to racing after a horror fall that turned her brain to 'mush', revealing the one thing that has kept her sane while she's been out of the saddle.",
        "Kah and fellow champion hoop Craig Williams were involved in a horror fall during the Sires Produce Stakes at Flemington on March 11 after the former's mount, Flyball, clipped the heels of the eventual winner, Veight.It sent her spearing into the turf, with Williams and his runner Dubenenko also brought down approximately 400 metres into the 1400m race. Kah was rushed to hospital in a critical condition after suffering a serious brain injury, while Williams' injury list was also extensive, with a broken collarbone, broken ribs and a broken finger as well as concussion. The 27-year-old nine-time Group 1 winner suffered trauma to her brain that was so bad she remained sedated in hospital for a number of days before undergoing a rehab program after her mind turned to 'mush'.",
        "Back at home on Victoria's Mornington Peninsula with her beloved horses, Kah has been going stir-crazy; but a return to racing is finally on the horizon.  'I have still have lots of doctors' appointments to go and finish, (but) hopefully not too long and a few more months, (and) I can get approved and come back,' Kah said at charity lunch prior to the start of this week's iconic Warrnambool Racing Carnival. 'I am going crazy not riding at home … hopefully it's not too long.'",
        "The South Australian native, who is also a talented equestrian, show jumper and exceptionally gifted horsewoman, is always surrounded by several horses at her farm, Bradlee Park.She has her own horses - favourite Brax has his own section on her Instagram page - re-trains former racers, cutting horses and ponies and also hosts runners that are spelling - so it's have to say horses are her life.And Kah - who has ridden almost 1200 winners in an already superlative career - said horses are the only thing keeping her sane giving she has not yet been cleared for riding.'It's the only thing getting me through, feeding them and looking after the horses. It's been a pretty tough few weeks but it's good being home,' she said. 'Seeing Brax ... (is) the best thing for me and my mushy brain. It's the only thing that has helped.' ",
        "Such was Kah's incredible form before the fall, she remains atop the Melbourne Jockeys Premiership with a lead of 18 wins, despite not riding for almost two months. It comes as Racing Victoria stewards declared on Wednesday the nasty fall involving Kah and Williams was an accident, and cleared all riders involved.'Stewards established that, approaching the 1000m, Flyball, which had been following Veight in a two-wide position, was restrained by its rider Jamie Kah to avoid the heels of Veight, which had settled in a position behind the leading runners,' the stewards' report read.",
        "'When being restrained, Flyball began to race keenly before clipping the heels of Veight and falling. Dubenenko, which was following, was severely checked and almost fell, dislodging Craig Williams, when unable to avoid making contact with the fallen Flyball.'Also, as a result of this incident, Tom Kitten was severely checked and Portorosa and Freakofnature were hampered when attempting to avoid the fallen Flyball.'After considering all the evidence, which included the analysis of all available video footage, the stewards deemed the incident to be accidental and not attributed to the carelessness of any one rider and therefore will take no further action with respect to the matter.'Of course that fall was just one across three successive Saturday meetings that led to multiple serious injuries; with Teo Nugent (fractured vertebrae) and Ethan Brown (internal injuries) also involved in sickening accidents. Then came the tragic death of Dean Holland after a horrifying fall in country Victoria on April 24.",
        "In a twist of fate, Holland won his second Group 1 in the Newmarket Handicap just weeks before his death only after securing Kah's ride on In Secret because she was sidelined following the fall.At the time, Holland was very conscious of the fact he only got the opportunity because Kah was being rushed in hospital, and the ever-modest rider was at pains to point it out despite it being the highlight of his career.",
        "'The last thing I want to do is yahoo too much about me winning the race when Jamie should’ve been on to start with. But look it is an emotional win for myself,' Holland said after the race on March 12. Kah, as many jockeys were and continue to be, was left heartbroken after his death, and paid tribute to the 'amazing' man, who left behind a wife and four children aged under five. 'Makes me appreciate life and still being here after what happened that's for sure. Beautiful tribute to an amazing person we all loved. My condolences to him and his family and everyone that knew him,' she wrote in a tribute. Following the spate of race incidents, Kah's partner, fellow champion rider Ben Melham - who she said had 'gone above and beyond' for her in the wake of her fall - had had enough.",
        "The 18-time Group 1 winner took aim at racing organisers for putting 'turnover' over 'safety' in a stunning broadside. 'The elephant in the room needs to be addressed. Victorian workload on racing participants in far too high,' he wrote on social media.'Turnover and revenue is important, but not at the expense of peoples lives. Fatigue kills! Hopefully three near-death experiences in three weeks is enough.",
        "'Race riding requires mental clarity for split second decisions.'We ride Wednesday twilight, Thursday night, Friday night. [There's] Trackwork and trials four to five days a week.'Racing (is) 24/7 365 days of the year. It's not sustainable.'Daily Mail Australia is in no way suggesting that racing organisers or a lack of safety were involved in Holland's death, or any of the other race incidents."
    ]
}