{
    "articleURL": "/sciencetech/article-12051283/The-simple-swaps-make-Coronation-picnic-eco-friendly.html",
    "content": [
        "MailOnline has compiled some of the easiest 'green' tips in honour of the King Eco-hacks include cooking from scratch and swapping meat for alternativesBritons have already shared their attempts at homemade Coronation creations How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Brits are set to celebrate one of the most historical events of their lifetime with the Coronation of King Charles III on Saturday. ",
        "Although the event would not be complete without a right royal British celebration, mountains of waste will be generated from the numerous street parties and picnics. MailOnline has compiled some of the easiest 'green' tips in honour of the King, who himself has spent a lifetime campaigning for sustainability and the climate.  These include opting for reusable decorations, cooking from scratch and swapping meat for low-carbon alternatives to create dishes such as 'Coronation cauliflower'. Brits have already been sharing their attempts at homemade Coronation food, which can be more eco-friendly than shop-bought versions. ",
        "Coronation cauliflower",
        "Coronation chicken, also known as Poulet Reine Elizabeth, is a famous dish created especially for the Queen's Coronation in June 1953. It consists of curry powder, mayonnaise, mango chutney and dried fruit mixed with cooked chicken.But this last ingredient has a particularly high carbon footprint, according to the 'food carbon footprint calculator', an online tool that gives food items a traffic light-style 'carbon rating'. It ranks each item by CO2 equivalent (CO2e), a unit of measurement that scientists use to standardise the climate effects of various greenhouse gases. According to the tool, one chicken breast has a 'high' carbon footprint of 706g CO2e, while an equivalent weight of cauliflower is just 146g CO2e. Generally, the public can make their Coronation meal low carbon by swapping out meat items for alternatives such as tofu, falafel or brands such as Quorn. ",
        "Mike Berners-Lee, a climate professor at Lancaster University, told MailOnline: 'For a low carbon picnic, the science is crystal clear that for most people, the most important consideration by far will be will be to reduce the amount of meat and dairy.'The second most important thing is to make sure that everything gets eaten – even if it turns into the next day’s leftovers.'",
        "Cook from scratch",
        "A carbon footprint is the total amount of greenhouse gases (including carbon dioxide and methane) that are generated by our actions. From eating food to getting on a bus or buying items online, all of us leave a carbon footprint. The average carbon footprint for a person in the US is high (16 tons) but globally, the average carbon footprint is closer to 4 tons.Source: The Nature Conservancy  ",
        "Supermarket shelves are stacked with delicious Coronation themed delights such as sandwiches, quiche, sausage rolls and cakes. Although convenient and rather tempting, a more environmentally friendly – and potentially cheaper – option is to prepare them yourself from scratch. According to a 2018 study at the University of Manchester, the average climate impact from a home-made option is around two times lower than the impact from the ready-made equivalent with the same ingredients. The researchers carried out the first ever study looking at the carbon footprint of sandwiches, both home-made and pre-packaged. ",
        "Keeping sandwiches chilled in shops also contributes to their carbon footprint – and can account for up to a quarter of their greenhouse gas emission equivalent, according to the study.  Brits have already shared some of their impressive efforts at making their own Coronation creations in the kitchen.While some of these are interpretations of the classics, others such as the Charles 'sausage finger' sandwich are more unusual. ",
        "Compost leftovers ",
        "Rather than stuffing your food waste into the nearest public bin at the park, you can do your bit for Mother Nature by taking it home with you and composting it.Food waste that is disposed in general waste bins goes to landfills or incinerators and emits powerful greenhouse gases such as methane and CO2. But when food waste is composted at home and collected by the council, it's often mixed with garden waste and heated before eventually being used as soil conditioner.Another process uses microorganisms in enclosed systems to break down the food and collect the released methane, which is converted into biogas and used to generate electricity.However, a recent study suggests you should be wary of putting your food waste in a compost bag, as these do not necessarily break down along with the food. Reusable crockery For decades, a stalwart of the British picnic has been single-use paper plates and plastic cutlery – but these are notoriously bad for the environment. ",
        "This waste takes years to break down in landfill and can pollute the environment or end up entering our waterways and the oceans. An easy alternative is packing your dining room crockery in the picnic basket, going 'plate free', or even just taking reusable plastic picnic sets that you can take home and wash afterwards. ",
        "Due to their blight on our planet, single-use plastic plates, trays and cutlery will be banned from October, the British Government has already announced. However, the ban will not apply to plates, trays, and bowls used as packaging in what the Department for the Environment called 'shelf-ready pre-packaged food items'.Reusable buntingReusable bunting provides a much more environmentally friendly option than inflatable balloons, which are used once before being binned. Even if disposed of correctly, single-use plastic balloon sticks may end up in incineration which generates carbon emissions, the Government warns – but their effects can be felt even more widely.  ",
        "Research conducted by Australia's research agency CSIRO has found balloons to be in the top three most harmful pollutants threatening marine wildlife in particular. Shocking photos have shown how harmful they can be for birds and marine life who can mistake them for food. Walk to eventsLastly, you can reduce your carbon footprint by simply walking or cycling to your local Coronation event instead of taking the bus or car. ",
        "This is because the vast majority of vehicles on the UK's roads right now burn petrol or diesel – meaning they belch out carbon emissions. Electric vehicles in comparison are low emissions, but they only make up a small percentage of the vehicles on the roads. The Government is banning the sale of petrol and diesel cars from 2030, in a bid to eliminate greenhouse gas emissions and achieve its net-zero emissions target by 2050.",
        "A target set by the government in June 2019 will require the UK to bring all greenhouse gas emissions to net zero by 2050. Former Prime Minister Theresa May had announced the target, saying the plans were ambitious but crucial for protecting the planet for future generations.The move will require huge changes such as more renewable electricity generation, phasing out new petrol and diesel cars by at least 2035 and a 20 per cent cut in beef and lamb consumption. 'The UK kick-started the Industrial Revolution, which was responsible for economic growth across the globe but also for increasing emissions,' said said Energy and Clean Growth Minister Chris Skidmore at the time.'We’re leading the world yet again in becoming the first major economy to pass new laws to reduce emissions to net zero by 2050 while remaining committed to growing the economy - putting clean growth at the heart of our modern Industrial Strategy.'    Net zero means any emissions would be balanced by schemes to offset an equivalent amount of greenhouse gases from the atmosphere, such as planting trees or using technology like carbon capture and storage."
    ]
}