{
    "articleURL": "/wires/pa/article-12051365/Two-King-s-horses-run-crowned-coronation-day.html",
    "content": [
        "Two of the King’s horses are set to run in races after he is crowned at Westminster Abbey.",
        "After the coronation on Saturday, the royal racing colours will be represented by Candle Of Hope in the William Hill Conqueror Fillies’ Stakes at Goodwood and Saga in Newmarket’s Howden Suffolk Stakes.It was hoped that Charles would have a runner in the 2000 Guineas at Newmarket in scenes reminiscent of 1953 when, just days after her coronation, the late Queen’s Aureole took part in the Derby at Epsom.However, his horse Slipofthepen will instead be preparing for the French version of the one-mile Classic.",
        "It comes after the King’s horse Circle Of Fire, trained by Sir Michael Stoute, came second in the first race at Newmarket on Friday.His racing manager John Warren said: “I simply have no idea whether the King would be able to watch this live, but the good thing is the King and the Queen Consort are loving their involvement with the horses, which is tremendous.“No doubt they’ll be watching the video when they can cram it in and Circle Of Fire is a lovely horse in the making.“I get feedback all the time of how important the royal patronage is to racing. The King takes it seriously and understands the bigger picture of everything he does.“I don’t think the racing is just for him to enjoy his horses alone, I think knowing the effect the royal patronage has doesn’t get lost on the King or the Queen Consort.",
        "“In racing we’re lucky enough to have two members of the royal family keen, so hopefully we can get lucky with a few horses for them to make it even more enjoyable.”",
        "He said Charles and Camilla will be “fully aware” of how the horses are doing on Saturday.Candle Of Hope runs in the 1.55pm at Goodwood and four-year-old Saga will be ridden by Frankie Dettori in the 3.25pm at Newmarket.Newmarket’s Rowley Mile Racecourse is opening its gates early for racegoers to watch the coronation service, while the trackside is to be decorated with bunting.The national anthem will be sung at 1pm."
    ]
}