{
    "articleURL": "/wires/ap/article-12038927/PSG-suspends-Messi-2-weeks-trip-SArabia.html",
    "content": [
        "Lionel Messi was suspended by Paris Saint-Germain for taking a trip to Saudi Arabia without the club's permission, a person with knowledge of the situation told The Associated Press on Tuesday.",
        "The person would not specify the length of the suspension, though French media reported it to be two weeks. The person spoke on condition of anonymity because they were not authorized to publicly discuss the matter.A two-week suspension would mean Messi would miss PSG´s next two games. L'Equipe and RMC Sport both reported the suspension without citing sources.The person told the AP that the World Cup champion won't be allowed to train or play with the team and won't be paid during his suspension.PSG had denied Messi's request to make the trip, the person said.The 35-year-old Messi has a commercial contract with Saudi Arabia to promote tourism in the Middle Eastern country.",
        "The suspension comes at a delicate time as the French club had hoped to extend the Argentine star´s contract beyond this season.Messi's trip followed PSG's surprise 3-1 loss to Lorient on Sunday, leaving the defending champions with a five-point lead over Marseille with five games left in the season. Messi played the full game.L'Equipe had reported that PSG coach Christophe Galtier pledged to give his players two days off - Monday and Tuesday - if they beat Lorient. Instead, the team trained on Monday and had Tuesday off.The forward joined PSG from Barcelona two years ago on hopes he could lead the team to an elusive Champions League title. Instead, the Qatari-backed club was eliminated in the round of 16 in consecutive seasons.",
        "The has been speculation about where he would play next, especially after reports that contract talks with PSG had broken down. Some PSG fans have even booed Messi amid the team's inconsistent campaign.Messi led Argentina to the World Cup title in December. He's scored 15 league goals and leads the French league with 15 assists.Messi hasn't commented publicly about the suspension on his social media accounts.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}