{
    "articleURL": "/wires/pa/article-12057583/Aleksandar-Mitrovic-ban-really-tough-club--Fulham-boss-Marco-Silva.html",
    "content": [
        "Fulham boss Marco Silva admits Aleksandar Mitrovic’s eight-game suspension has affected not just his striker but the whole west London club.",
        "The Serbian will miss Monday’s meeting with Leicester as he serves the final game of his lengthy ban, incurred after he grabbed referee Chris Kavanagh during the Cottagers’ FA Cup defeat at Manchester United in March.Silva said his staff were doing everything they could to ensure Mitrovic was ready to face Southampton on Saturday, but revealed it has not been a straightforward process.",
        "“Of course it’s been a tough period for him, like you expect,” said Silva. “He’s been working hard, it has to be like that with no chance (to play) and the mood in some days is a little bit better than the others.“He knew one month ago that he is going to be out eight games, it’s really tough for any player.“If you have an injury, muscular injury or something that we know, ok, it’s part of life.“But in all this situation, the way it has come for us, the way everything happened as well, the treatment behind all that scenario, it was really tough, not just for Mitro, I have to say for our football club. We felt something that is not good.”The 28-year-old had scored 11 times in 21 appearances for Silva’s side before his suspension.He initially received a standard three-match ban, which was later increased by three games for violent conduct towards a match official, with another two added for using language which was “improper, abusive, insulting and threatening”.",
        "A later appeal by the Football Association to increase the suspensions for Mitrovic and Silva, who was banned for two matches for his own involvement in that clash, was later dismissed by an independent appeal board.Fulham hope Monday’s meeting with relegation-battling Leicester will help them bounce back from consecutive losses to Manchester City and Liverpool before Mitrovic’s return against Saints gives them another boost.Whether he will be ready start that match is still to be determined.",
        "Silva said: “We are here to support Mitro. It is up to him to keep working hard to where he can be as best as he can be from a physical point of view. It will be good to have him again for the next match.“He is working hard and we are doing everything we can to keep him in a very good shape. He is doing his maximum as well to be, and of course when he is going to be available it’s up to me to decide if he’s ready to start the game or not.“But this is another situation for the next match. He’s working hard and we are trying to keep it as best as it can be.”"
    ]
}