{
    "articleURL": "/news/article-12041887/Army-corporal-bit-fellow-soldiers-ears-nose-leaving-covered-blood-Xmas-party-attack.html",
    "content": [
        "Corporal Paul Byron denies a single charge of causing actual bodily harm Lance Corporal Dean Taylor was repeatedly punched in a 'frenzied' attackA British Army corporal bit into a fellow soldier's ears and nose at a formal Christmas party in a brutal 'unprovoked' attack, leaving him covered in blood, a court martial heard.",
        "Corporal Paul Byron allegedly followed Lance Corporal Dean Taylor into toilets at the smart event in December 2021, after he was accused of making a racist slur towards a Muslim colleague.Cpl Byron then hit LCpl Taylor on the back of the head, repeatedly punched him and kneed him in a 'frenzied' attack - leaving the LCpl Taylor with blood 'all down' his face, Bulford Military Court heard.The pair were left tangled on the floor, before Cpl Byron was pulled away from the brutal assault.The hearing was told that before the attack, Cpl Byron was accused of making a racist comment about a fellow Muslim soldier, Lance Corporal Faisal Murtaza. ",
        "LCpl Taylor told the court he had 'no idea' why Cpl Byron had attacked him.But when quizzed by service police, Cpl Byron claimed he had simply been acting in self defence.The Military Court in Wiltshire heard the men - members of the Royal Anglian Regiment - had been wearing 'best dress' during the boozy party at Kendrew Barracks, Rutland.In prospecting, Major James Eveleigh told the trial: '[Cpl Byron and LCpl Taylor] both attended a unit Christmas function.'Everyone was in best dress, nothing out of the ordinary, but of course alcohol was involved.'The defendant became involved in a series of backwards and forwards arguments which culminated in a suggestion of racist behaviour from Cpl Byron [towards LCpl Murtaza].",
        "'These arguments were thought to have been settled in a practical way - but that wasn't the case for Cpl Byron. LCpl Taylor went to the toilets and was standing with his back to the door.'As he stood in that position he was struck on the back of the head and dealt a number of blows all while his body was wedged between the toilet and cubicle wall.'The prosecutor continued to say that he managed to turn around and face Cpl Byron, but he proceeded to brutally attack him as he lay 'helplessly' on the floor.",
        "Major Eveleigh continued: 'Cpl Byron was shouting, swearing and even growling at him in what was a frenzied attack.'He bit him on the back of the head and ears, causing his blood to freely run.'It was unprovoked, extreme violence conducted in drink and only separated by a bystander.'After being separated, details of the incident eventually were reported up the chain of command and Service Police were informed.LCpl Taylor told the court Cpl Byron had threatened him before assaulting him in the toilets, saying: 'He came over to the table and said 'I'll kick your head in' - he was very drunk and angry.'He called LCpl Murtaza a P***.'",
        "The court heard LCpl Murtaza and Cpl Byron had shaken hands after the alleged racist remark, before LCpl Taylor was assaulted.LCpl Taylor continued to say: 'I started going to the toilet in a cubicle and I got punched from behind and fell.'I tried to get him off me but I was being punched and kneed in the face.'He was very angry, swearing, punching, biting. He bit me on the front of my nose, my ear on the back of my head.'I had blood all down my face.'Cpl Byron denies a single charge of causing actual bodily harm at the event in December 2021.The trial continues."
    ]
}