{
    "articleURL": "/news/article-12059573/Met-officer-ignored-slow-marching-Just-Stop-Oil-activists-driver-branded-c-ts.html",
    "content": [
        "Motorists beeped their horns at JSO protesters - but it didn't seem to deter them Do you know the driver? Email tips@dailymail.co.uk or danya.bazaraa@mailonline.co.ukA Met Police officer told a Just Stop Oil protester it was a 'shame' they ignored requests to move from the middle of the road - after a furious driver branded the activists 'c****' in a frustrated rant. ",
        "Protesters were out in Marble Arch and around Piccadilly today, infuriating people trying to travel with their slow march as they returned to the streets of London after the King's Coronation. Footage posted on Twitter showed an officer asking a protester: 'Is there any way we can accommodate you moving to the side, off the road?' But the protester simply said: 'No I don't think so'.The officer told him that was a 'shame' - adding that the police now had 'a lot of resources' while looking behind at his colleagues. 'It's a shame to have to have this conversation when if you were to take 10 steps to the left or right, cars can flow, and we can then still walk alongside you,' the uniformed officer said. ",
        "In another clip posted online from Piccadilly, a furious Range Rover driver with a child in the passenger seat next to him shouted 'c****' at Just Stop Oil activists.Motorists beeped their horns at the JSO protesters - but it did not seem to deter the group who appeared unfazed and carried on strolling while holding their huge banners. Police were seen at the scene, negotiating with demonstrators to get out of the road.  In video footage from Marble Arch a protester called Sophie could be heard blasting out through a megaphone: 'I am 30 years old, I have a niece who is six, I would one day like to have children but the government are not safeguarding our future.'",
        "She accused the government of opening new oil and gas licences, describing it as a 'war against the young'. ",
        "The incidents come after Scotland Yard made 64 arrests on coronation day, with 46 people bailed after being detained on suspicion of causing a public nuisance or breaching the peace. Numerous people were arrested amidst the crowning of His Majesty on Saturday as Scotland Yard clamped down on those suspected of causing trouble. Four charges have been brought, including over a religiously aggravated public order allegation and class A drugs possession.Breach of the peace, sexual assault and conspiracy to cause a public nuisance were among the various grounds for arrest over the course of the Royal event.Several Just Stop Oil protestors were arrested in addition to Animal Rising groups who were also linked to the Grand National chaos last month.Metropolitan Police officers said they arrested three people in Soho on suspicion of conspiracy to commit public nuisance at around 2am on the morning of King Charles' Coronation. The force revealed that numerous rape alarms were seized and the three people were taken to a south London police station for further questioning.A 47-year-old man among the group was also further arrested on suspicion of handling stolen goods.A statement read: 'There was particular concern from military colleagues that this would scare their horses involved in the procession and, as a result, cause significant risk to the safety of the public and the riders.'",
        "Deputy Assistant Commissioner Ade Adelekan also added: 'The intelligence we received led us to be extremely worried about the potential risk to public safety. We are aware of and understand there is public concern over these arrests. However, the matter is still under investigation.'Caroline Russell, who chairs the London Assembly's Police and Crime Committee, suggested that it was 'really worrying' that some arrests had been made. On BBC's Today programme, Ms Russell expressed that some of these arrests were 'very odd'.   She said: 'It seems absolutely extraordinary that those people who were volunteering, they were out there handing out flip flops to people who could no longer walk in their high heels because they'd had a bit too much to drink and handing out rape alarms.'Yesterday however, Chairman of the Metropolitan Police Federation Ken Marsh said he was 'flabbergasted' that officers were facing a backlash on clamping down on those who allegedly sought to 'create havoc' and ruin the historic occasion.He claimed that officers had 'foiled a number of scenarios' - including defacing public monuments with paint, breaching barriers and disrupting official movements.Commander Findlay added: 'We absolutely understand public concern following the arrests we made this morning.'Protest is lawful and it can be disruptive. We have policed numerous protests without intervention in the build-up to the Coronation, and during it.",
        "'Our duty is to do so in a proportionate manner in line with relevant legislation. We also have a duty to intervene when protest becomes criminal and may cause serious disruption.'This depends on the context. The Coronation is a once in a generation event and that is a key consideration in our assessment.'A protest involving large numbers has gone ahead today with police knowledge and no intervention.'",
        "One person has been charged with a religiously aggravated offence under Section 5 of Public Order Act. They are scheduled to appear at Westminster Magistrates' Court on Tuesday, May 9.One person was charged with possession of class A drugs and will appear at Westminster Magistrates' Court on Tuesday, May 9.One person was charged with possession of class A drugs and will appear at Westminster Magistrates' Court on Friday, May 26.One person was charged under Section 5 of the Public Order Act and will appear at Westminster Magistrates' Court on May 26.One person was arrested on a warrant for non-payment of fines and remains in police custody.32 people were arrested for conspiracy to cause a public nuisance and have been bailed.14 people were arrested for a breach of the peace and have been bailed.One person was arrested for conspiracy to cause a public nuisance and possession of noxious spray and has since been bailed.One person was arrested on suspicion of a racially aggravated public order offence and has been bailed.One person was arrested on suspicion of harassment and has been bailed.One person was arrested on suspicion of breaching the peace and possession of class A drugs, and has been bailed.One person was arrested on suspicion of going equipped to steal and has been bailed.One person was arrested for handling stolen goods and has been bailed.One person was arrested on suspicion of sexual assault and has been bailed.One person was arrested for common assault and has been bailed.One person was arrested under Section 5 of the Public Order Act and received a penalty notice.One person was arrested for motor vehicle interference and has been released with no further action.One person was arrested for a breach of the peace, but was released a short time later.Two people were arrested on suspicion of breach of the peace and released without any further action."
    ]
}