{
    "articleURL": "/wires/ap/article-12054455/Jill-Biden-Charles-coronation-just-amazing-see.html",
    "content": [
        "WASHINGTON (AP) - First lady Jill Biden, who represented the United States at Saturday's coronation of Britain's King Charles III, said there was \"such beauty in the pageantry of the ceremony\" and it was \"just amazing to see.\"",
        "\"You can't imagine that moment where you actually see the crown being placed on the head of the king and then on the head on the queen,\" she said during a telephone interview with The Associated Press after the ceremony in London. \"It's really surreal to see and experience that moment.\"Charles' wife, Camilla, also was crowned queen during Britain's first coronation in 70 years. His mother, Queen Elizabeth II, died last September after a seven-decade reign.An American president has never attended a British coronation and President Joe Biden asked the first lady to represent the U.S. in his place. The White House said Jill Biden's appearance marked the first time that a U.S. first lady was present for a British coronation.She brought one of her granddaughters, Finnegan Biden, 24, on the trip.\"It's my honor to represent the people of the United States and I wanted to be here,\" Jill Biden said. \"It was so meaningful to me that I could bring Finnegan here, that we could travel together and experience this together and it's meant a lot to both of us.\"",
        "The first lady spoke as she and Finnegan headed to afternoon tea following the coronation at Westminster Abbey.\"We thought that was something that was so British,\" she said of their tea time. \"It was something we really wanted to do together.\"",
        "She said sitting and watching the ceremony led her to think about the importance of traditions.\"I felt as I sat there, I felt this sense of decorum and civility that binds together people of all nations,\" she said.At the coronation, Jill Biden sat beside Olena Zelenska, the first lady of Ukraine. Jill Biden said they talked about Russia's invasion of Ukraine and that Zelenska thanked her again for the support from the United States.Jill Biden said she paid close attention to Archbishop of Canterbury Justin Welby's message that people everywhere seek hope and joy.\"And I thought that was such strong message because I think that is true,\" she said. \"And it's true for all people everywhere, but I think it was important at this moment that the clergy brought that in to this moment in history.\"The first lady attended a Buckingham Palace reception Friday that was hosted by Charles. She said Charles recounted to her his most recent telephone conversation with President Biden and asked her to \"give my best to your husband.\"She said she and Princess Kate chatted as mothers about the lengths to which they go to keep their children quiet in church, feeding them pieces of candy and such.\"She said she didn't know if her son could sit still for two hours and we just had a good laugh over it,\" Jill Biden said. \"It's just something, I think, that's common to a lot of us.\"",
        "___This story has been corrected to show that Finnegan Biden is 24, not 23."
    ]
}