{
    "articleURL": "/femail/cleaning/article-12040139/Sards-oil-grime-spray-Coles-Woolworths-secret-getting-sneakers-clean.html",
    "content": [
        "Mum used Sard spray on her kid's sneakersThey came up brand new againThe spray is on special at Woolies for $5 A clever mum has shared how she made her toddler's dirty sneakers look like new again with a 'miracle' cleaning spray. ",
        "The woman used Sard's oil and grime spray to clean away dirt on her young child's tiny but well-worn Nike joggers. Sard's Oil and Grime spray is usually $7 at major supermarkets but is currently on special at Woolworths for just $5.  She sprayed the trainers with the cleaner, left it to soak then simply scrubbed the dirt away with a $3 Kmart scrubbing brush.  The mum said she didn't have to put the shoes through the washing machine as the spray worked wonders. ",
        "'How amazing is Sard? **Spending Saturday Sarding for my entire life**' she joked in a post to the Mums Who Clean Facebook page. ",
        "The woman also shared a photo of the grimy sneakers before she cleaned them and one after of them looking sparkling white.  'I used the Sard spray and left it for an hour then used hot water and a brush and lightly went over then rinsed,' she explained adding she put the white laces through the washing machine. Sard's Oil and Grime spray has been formulated to target oily foods, cuff and collar grime, make-up stains and stubborn marks from butters and sauces.  Groups members were wowed by the 'unbelievable' results and shared their own sneaker cleaning hacks. 'They look like a new pair,' one mum replied. ",
        "'Is this for real?? That's almost unbelievable,' a second wrote while a third pointed out Sard is an Australian-owned and made brand. 'There won't be much left on the shelves,' another laughed. 'I know it really does wonders!!! I get a toothbrush, Sard and bucket of water to clean the kids shoes,' someone suggested. "
    ]
}