{
    "articleURL": "/tvshowbiz/devon-windsor/article-12049883/Devon-Windsor-shares-sweet-video-breastfeeding-baby-daughter-Celine.html",
    "content": [
        "Devon Windsor shared a heart-melting clip while cuddling and breastfeeding her newborn baby daughter Celine Blue on Thursday.",
        "The Victoria's Secret supermodel - who gave birth on Monday - posted a video on her TikTok page as she cradled the baby in her arms.The mother of two, 29, appeared to still be in the hospital as she stunned in a silky pink set co-ord to keep it comfortable.She also posted some candid snaps of the days following the birth, as she lay in bed feeding her daughter by while her husband fed her toast. The model - who achieved international fame as a Victoria's Secret Angel - was captured in a sweet video as she cradled and kissed the newborn baby in front of her hospital bed.Devon looked glowing as she appeared to go make up free, and wore her platinum tresses simply loose.",
        "The stunner looks every inch of the excited mum as she rubs her nose against the little one's, kisses her hand cuddles Celine in her arms.She captioned the post 'Celine Blue' with two heart emojis.The Victoria's Secret veteran broke the news on her page on Thursday as she posted another sweet snap in which she cradled her newborn girl and gazed lovingly down at her while sitting in her hospital bed. Devon and her husband Johnny Barbara, who tied the knot in St. Barts in 2019, welcomed their first daughter Enzo in September 2021.",
        "This past November she joyfully announced that she was expecting another little bundle of joy, who arrived this week.Devon went public with her latest pregnancy by posting a breathtaking black and white snap in which she posed topless with Enzo in her arms.Her blossoming baby bump was on full display as she shot the camera a knowing smile, her one-year-old grinning in her arms.'Someone’s becoming a big sister!' the St. Louis native crowed in her caption. 'So excited to announce we are expecting baby #2 next year!'",
        "A few months after she welcomed Enzo, she gave an interview to the Daily Front Row reflecting on the impact that motherhood had on her.'It’s been a roller coaster of change, but definitely all for the better!' she told the publication. 'We named her Enzo Elodie; I’ve always loved masculine names for girls, and I wanted something strong and unique for her.'Becoming a mother, she gushed, 'feels amazing! I have wanted to be a mother my whole life. I loved to babysit, play with dolls, and it’s always been a natural instinct for me to take care of people. Enzo has exceeded all my expectations.'When her interviewer brought up the prospect of expanding her family, Devon replied: 'Yes! I would love more kids! I don’t think right away, though.'",
        "In the same interview Devon revealed that she gave Enzo the French middle name Elodie because she and her husband 'fell in love in Paris, so it seemed fitting.'That piece of family history might also be connected to why Devon and Jonathan decided to give their newborn the French name Celine.During her first pregnancy, Devon told A Pea In The Pod that she had 'learned to go with the flow and to not stress too much about body changes or other things changing in my life. I want to embrace the change and this new time.'She rhapsodized that 'I love having a baby bump! I also love to feel her moving and kicking inside me,' while acknowledging: 'The low points would just be the minor things such as back pains and acid reflux.'As far as pregnancy fashion was concerned, she confessed: 'I honestly have been trying to avoid maternity clothes for as long as possible.'To that end, she said: 'I’ve been wearing flowy piece and lots of workout leggings.... But overall, I have tried to maintain the same style.'"
    ]
}