{
    "articleURL": "/wires/ap/article-12046297/6-soldiers-killed-shootout-militants-NW-Pakistan.html",
    "content": [
        "PESHAWAR, Pakistan (AP) - Gunmen stormed a school in Pakistan's volatile northwest on Thursday, killing seven teachers and gunning down another teacher from the school in a separate attack. Earlier in the day, a shootout with militants elsewhere in the region killed six Pakistani soldiers.",
        "The violence underscores the challenges the government of Prime Minister Shahbaz Sharif is facing amid a surge in militant attacks across the country in recent months.In Kurram, a district in the northwestern Khyber Pakhtunkhwa province that borders Afghanistan, a group of gunmen stormed a government school where students were taking exams. The seven killed teachers were members of Pakistan's minority Shiite community, which is frequently targeted by militants.Another teacher from the same school, a Sunni Muslim, was gunned down on the road in a separate attack earlier in the day in Kurram, according to local police official Abbas Ali.No one immediately claimed responsibility for the attacks and Ali said it was not clear if they were linked.\"We are looking into all aspects, and so far we have no idea who killed the teachers,\" he said. The prime minister condemned the attacks on teachers and ordered a probe into the killings.Earlier on Thursday, six soldiers were killed in a shootout in North Waziristan, another district in Khyber Pakhtunkhwa province. The military provided no details on the shootout but said that three militants were also killed.The region is a former stronghold of the Pakistani Taliban - the outlawed Tehrik-e-Taliban Pakistan, or TTP, as the group is also known - and also other militants. TTP is a separate group but allied with the Afghan Taliban.",
        "The Taliban takeover of Afghanistan in August 2021 has emboldened the TTP, which has stepped up attacks across Pakistan, mainly targeting security forces. The military in recent weeks has also carried out multiple raids on militant hideouts in the northwest, killing and arresting dozens of insurgents.Separately from the surge in militant attacks, Sharif's cash-strapped government is also struggling to revive a bailout package from the International Monetary Fund and recover from last year´s massive flooding that killed hundreds and caused $30 billion in damages."
    ]
}