{
    "articleURL": "/wires/pa/article-12042703/Steven-MacLean-feels-St-Johnstone-ready-relegation-scrap.html",
    "content": [
        "Steven MacLean is confident St Johnstone are up for the battle after being sucked back into relegation trouble in recent months.",
        "The Perth side looked comfortable in mid-table in February but a poor run of form – which cost manager Callum Davidson his job last month – has allowed clubs beneath them to close the gap.Saints – who survived via a play-off last season – go into their post-split fixtures six points ahead of last-placed Ross County and only two points ahead of joint-second-bottom pair Dundee United and Kilmarnock.Defeat at home to resurgent United on Saturday could leave the McDiarmid Park side sitting in the relegation play-off spot, but interim manager MacLean feels they can take encouragement from the fact they are still “in the driving seat”.“I think they are, I think they know that,” he said when asked if the Saints players were fully aware of the gravity of their predicament.“The players know they are in a battle. All we’re concentrating on is ourselves right now. We know what we’ve got to do. We’re in the driving seat, it’s in our own hands. We’re not really looking towards other teams.”",
        "MacLean was handed the reins two and a half weeks ago after the sacking of Davidson. The 40-year-old oversaw a 1-1 draw at home to Hibernian in his first game in charge and – with no fixture last weekend – he arranged a “competitive” friendly against his former club Hearts last Friday to keep his squad ticking over.",
        "MacLean is relishing his first taste of management but insists there is no update with regard to the longer-term managerial situation at Saints.Asked if he had any further discussions about his position, MacLean said: “No, I’m just in charge until I’m told not to be.“I’m enjoying it. It’s hard work. It’s something that’s always been in the back of mind that I wanted to do. I’m just really concentrating on the next five games.“Dundee United is first so I’m just looking at that and putting all my thoughts into that and having the players focused.“The boys have been excellent. They’ve done everything I’ve asked of them and more.”"
    ]
}