{
    "articleURL": "/tvshowbiz/article-12048001/EastEnders-fans-praise-Queen-Sharon-confronts-Ravi-following-brutal-beating-Keanu.html",
    "content": [
        "Eastenders viewers praised Sharon Watts after she confronted nasty Ravi Gulati once he released by police following his brutal beating of Keanu Taylor.",
        "Sharon Watts (Letitia Dean) was furious to see Ravi Panesar (Aaron Thiara) and his father Nish (Navin Chowdhry) enter the Queen Vic bold as brass on Thursday.In the dramatic scenes, she made everyone in the pub know Ravi was fresh from a cell after getting him arrested for the attempted murder of her beau earlier in the week. However after Nish taunted her by saying the police had in fact dropped all charges and closed the investigation, Sharon left no prisoners. She yelled: 'Your family are violent, lying, cheating, scumbags and we don't need you here, neither of you nobody does.'Racing to Twitter fans branded her a 'queen' while other's were 'obsessed' with her iconic character's ferocious 'gob'.",
        "With one writing: 'All hail Queen Sharon Watts'. While another added: ' Sharon standing up to Nish yes queen' and a third cheekily wrote: ' Sharon Watts is a queen. That's it. That's the tweet'.Someone else commented: 'Obsessed with Sharon taking on Ravi' and 'GO ON SHARON YOU TELL HIM'.It comes after viewers were delighted with Sharon as she watched Ravi get arrested on Wednesday.She watched as he got handcuffed and put in the back of a police car after she grassed him up to cops.In the dramatic scenes, Ravi attacked Keanu on a dark Bridge Street by Kathy's café after it was hinted he revealed information about Ravi's criminal activities as part of a deal with police.",
        "With Ravi working for dark drug lords, he ordered Keanu to do the drop, but when it went wrong, Ravi's bosses ordered him to beat up Keanu.After Keanu was left for dead and rushed to hospital with a collapsed lung, a devastated Sharon called the police on Ravi when she learned it was him behind the attack.",
        "After blue-lighting it to Albert Square, cops grabbed Ravi and handcuffed him, while Sharon looked on and smirked.Viewers were delighted after watching Sharon take charge, with many taking to Twitter to praise her for her actions.However, others expressed their concern for the character, suggesting she could have made herself the target for an attack herself. One person wrote: 'The smirk by Sharon. She's in her boss era I'm here for it.'",
        "While someone else shared: ''Icon' is now spelt 'Sharon Watts'.''No one gives a look quite like Sharon Watts. An absolute master,' wrote another viewer, while someone else shared: 'Sharon got Ravi arrested yas queen. That smirk though.''SHARON IS SUCH A BADDIE YES GIRL,' exclaimed another viewer.While someone else posted: 'Absolutely obsessed with Sharon's smirk as she watches Ravi being arrested #eastenders.'"
    ]
}