{
    "articleURL": "/tvshowbiz/article-12061443/Reese-Witherspoons-lookalike-daughter-Ava-Phillippe-23-dazzles-Taylor-Swift-Eras-Tour-concert.html",
    "content": [
        "Reese Witherspoon's lookalike daughter Ava Phillipe was effortlessly stylish in a new Instagram post shared on Monday after attending Taylor Swift's Eras Tour concert in Nashville the night before.",
        "The media personality, 23, who recently put on an elegant display while modeling for the luxurious brand Celine, was also joined by her Oscar-winning mother, who is a major Swiftie.The budding star dressed up for the special night by wearing a strapless pink corset top with glittering details throughout the material.She slipped into a pair of blue, denim shorts that were secured with a white belt that contained a silver buckle for a fashionable flare.Ava completed her overall ensemble for the concert by slipping into a pair of cream-colored cowboy boots that stopped a few inches above her ankles. ",
        "Her blonde locks were parted in the middle, and effortlessly flowed down past her shoulders in light waves. The star accessorized her look with a pair of long, dangly silver earrings but chose to not add any other pieces of flashy jewelry. A small, silver handbag was easily slung over her right shoulder to hold a few items she needed throughout the night. The beauty posed next to her close friend Alex, who also dressed to impress in an all-black tasseled two-piece ensemble. The two posed for a quick photo together before joining the boisterous audience. Ava additionally uploaded a clip that captured her dancing along to Taylor singing her hit track Karma as she performed the song live on stage. ",
        "In her caption, the model reminisced on the exciting night, writing, 'ERAS. some highlights: -crying &amp; holding my bff listening to “Fifteen” during the acoustic set.' She continued, 'gushing about our favorite songs with some younger Swifties &amp; telling them about seeing the Fearless Tour when I was their age. Dancing our absolute hearts out in a sea of love, friendship bracelets, &amp; LOTS of glitter.' Phillippe then gave a shout out to the Grammy winner and added, 'thank you @taylorswift for the most ✨enchanted✨ of nights we’ll never forget!' referencing to her 2010 track titled, Enchanted.   ",
        "The Blank Space hitmaker performed for three nights in Nashville during her Eras Tour, which is slated to come to an end in August. In the comment section, social media users gushed about Ava having the chance to attend the concert, with her mother Reese also recalling the special night. 'Epic Night!! So amazing to share it with you,' the Legally Blonde actress wrote to her oldest child. She shares both Ava and son Deacon, 19, with her ex-husband Ryan Phillippe. The star also shares her son Tennessee with her ex, Jim Toth. The two tied the knot in 2011, but they announced in a joint statement in March that they were divorcing after nearly 12 years of marriage. ",
        "Reese also shared a few memorable moments from the concert on her Instagram stories, including Swift performing in a sparkling red ensemble on the stage. The Walk The Line actress tagged the songstress along with a smiling emoji face with tear-filled eyes. She also filmed from her floor seat and captured her daughter grooving to a song. 'What an extraordinary show! The insanely intricate sets, the stellar song choices, the inspired choreography, the other worldly art design, an incredible night to remember,' the mother of three gushed. On her main page, Reese shared a short video of Taylor singing her tune Bejeweled, further proving she was a major Swiftie. 'What a night to remember!' she wrote. ",
        "'@taylorswift in front of 70,000 incredible fans. The stellar song choices , inspired choreography, other-worldly art design ... an incredible night to dance, sing and feel so much JOY ..' 'thank you @taylorswift and the whole ERAS tour team for shining so bright tonight,' she cheerfully concluded.   Taylor herself has recently been wrapped in romance rumors that she and The 1975 singer Matty Healy have started dating. The British-born star was seen cheering on the songstress from the audience on all three nights of her Nashville stop over the weekend. During night two, Healy hopped onto the stage to perform with opening act, Phoebe Bridgers, wearing a black and white, skeleton ensemble. He also joined Swift's close gal pals Gigi Hadid and Lily Aldridge later in the night to support Taylor. ",
        "On night three, the Somebody Else hitmaker was spotted wearing a 1989 T-shirt as he watched his rumored girlfriend take to the stage once again. To further fuel romance rumors, Matty was seen spending time at the Grammy winner's Nashville condo on Friday as well as the early hours of Sunday following her concert performance. Taylor and Matty's rumored romance first came to light earlier this week on Wednesday, with a separate source telling The Sun, 'She and Matty are madly in love.''It’s super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn’t work out,' the insider added.",
        "In April, it was confirmed that Taylor had split from British actor, Joe Alwyn, after six years of dating. In regards to her ex, the source informed the publication, 'Taylor and Joe actually split up back in February, so there was absolutely no crossover.' 'They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to ‘own’ this romance, and not hide it away.' 'Both Matty and Taylor have been touring over the past few weeks, so it’s been a lot of Face-Timing and texting but she cannot wait to see him again,' and added that the two stars, 'are incredibly supportive of their respective careers.'",
        "Despite the speculation that the two have entered a relationship, both singers have yet to publicly confirm they are dating. "
    ]
}