{
    "articleURL": "/tvshowbiz/article-12053015/Channel-Seven-dominates-television-viewership.html",
    "content": [
        "A new TV ratings system has revealed that Channel Seven is soaring ahead of its commercial competitors.",
        "Called VOZ, the overnight ratings data combines viewers in capital cities, regional areas, and broadcaster on demand services (BVOD) reports TV Blackbox.According to VOZ, Seven scored a massive 42.3 per cent national audience share on Sunday, Monday and Tuesday.Meanwhile, Seven's arch rival, Channel Nine, managed to grab 36.5 per cent of the available audience, while embattled Channel 10 pulled in 21.2 per cent of viewers.According to VOZ, which launched this week, Seven's biggest hits with fans nationally include The Chase Australia, Home and Away and Sunrise.",
        "Farmer Wants a Wife has been revealed as a major ratings blockbuster for Seven under the VOZ system.The long-running dating show scored a massive national average audience of 1.01million viewers.The Chase Australia, meanwhile, was another significant success for the network.The evening favourite pulled in a national average of 924,000 fans.Home and Away also put an impressive performance with 838,000 viewers, while Sunrise scored 394,000 fans as a national average.VOZ surveys 20,000 people every day as well as 16million connected devices, James Warburton, Seven West Media Managing Director and CEO explained.",
        "'What we are already seeing from the new VOZ data is that Seven is the content company the most Australians turn to day in, day out. We are reaching and engaging with more people across multiple screens than anyone else,' Warburton said in a statement.",
        "Meanwhile, Seven dominated Thursday night's metro ratings.The network scored 31 per cent of the available audience, while Nine managed to pull in 27.6 per cent. The ABC finished third with 17.1 per cent. Channel 10 finished in fourth place with a mere 15.2 per cent of viewers."
    ]
}