{
    "articleURL": "/wires/reuters/article-12058521/In-Turkey-election-reckoning-rise-fall-Erdogans-economy.html",
    "content": [
        "Economic strain hit Erdogan's support in recent years",
        "But declines in prosperity, equality began around 2013May 14 vote is president's toughest test in two decadesBy Jonathan SpicerISTANBUL, May 8 (Reuters) - If Turks oust President Tayyip Erdogan in elections this month it will largely be because of an economic reversal that saw their prosperity, equality and ability to meet basic needs start to tumble midway through his two-decade reign.The May 14 vote, which lands during the Turkish Republic's centenary year, is Erdogan's biggest test yet. Some polls show he is trailing an opposition candidate, Kemal Kilicdaroglu, who would reverse his unorthodox and heavy-handed economic policies.Erdogan's support has slipped in the last few years as a series of currency crashes and a deepening cost-of-living crisis were brought on by his policy of slashing interest rates in the face of soaring inflation.But by other measures of economic well-being the decline began earlier, around 2013, which marked a turnaround after a decade of high growth and prosperity under Erdogan and his Islamic-rooted AK Party.That was the year that unprecedented nationwide protests against his government prompted a lasting crackdown on civil liberties. At the same time, a global reversal in market liquidity left Turkey and other emerging markets starved for funding.Starting in 2013, foreign investors began abandoning Turkish assets, eventually leaving FX, credit and debt markets heavily state-managed in the emerging market economy that was once a star among Western fund managers.",
        "\"In the past, Erdogan could deliver for supporters. But the economic crisis was damaging. His supporters still like him, and love him even, but they have been unhappy about having to pay the price for that,\" said Seda Demiralp, chair of the Department of International Relations at Isik University in Istanbul.Erdogan retains strong support among rural and working-class conservatives and nationalists. He and his ruling coalition could yet prevail in the presidential and parliamentary votes, polls show.The government says its rate cuts boosted exports and investments as part of a programme that encouraged lira holdings. It doubled the minimum wage in the last 18 months and spent record levels on social aid, helping keep economic growth strong at above 5% last year.The stimulus helped unemployment dip to 10% from near 14% in the last two years.But by cutting the policy rate to 8.5% from 19% since 2021, authorities sent inflation soaring to its highest level under Erdogan's watch to above 85% last year. The last time annual inflation touched the official target of 5% was in 2011.The year 2011 was also when inequality began rising, according to a Gini index of income and wealth distribution. This trend accelerated in 2013, wiping out big gains made in 2006-2010 during Erdogan's first decade in charge.",
        "The UK-based think tank Legantum Institute ranks Turkey 95th globally in its prosperity index, down 23 places since 2011 due to declines in governance and personal freedom.RISE AND FALLErdogan's emerging AK Party (AKP) won power in 2002 as the economy was rebounding from its worst slump since the 1970s, on a promise to break with the mismanagement and recessions that had long frustrated Turks.He became prime minister just as austerity imposed under a 2001-2 International Monetary Fund programme eased, and he leveraged that rebound and a diplomatic pivot to the West to bring about a decade of prosperity.Poverty and unemployment plunged.Inflation that was in triple digits a decade earlier cooled, boosting the Turkish lira's appeal. Western easy-money policies in the wake of the 2008-09 financial crisis brought a rush of cheap foreign credit and fuelled a Turkish construction boom.Erdogan seemed untouchable.But things started changing in 2013, when protests centred on Istanbul's Gezi Park swept the country, prompting widespread clashes, arrests and incarceration.At the same time, Western easy-money dried up, sparking an exodus of funds from Turkey and curbing its cheap credit boom.The years 2012-2013 marked a turning point for per capita GDP, which measures prosperity in dollar terms, and for employment and other gauges of economic well-being.",
        "It was the high water mark for foreign investment, according to official bond holdings statistics and Turkey Data Monitor. The lira's value has since plunged - including by 80% versus the dollar in the last five years - sapping Turks' purchasing power.Murat Ucer, an advisor to Global Source Partners and lecturer at Istanbul's Koc University, said that advances in productivity seen during the AKP's early years began reversing after the 2008-2009 global financial crisis, with credit becoming the key driver of growth instead.This, combined with the real lira depreciation that later took hold is \"one possible explanation of this turnaround in Turkey's fortunes since 2013 - or why the average Turk started getting poorer in U.S. dollar terms,\" he said.CRACKDOWN AND ISOLATIONErdogan shocked many when his government quashed the 2013 Gezi Park protests.\"The protests were both a response to and a further impetus for the increasing authoritarianism of the AKP government...and led Erdogan to wage an all-out war against his opponents using the entire government apparatus,\" said Ates Altinordu, assistant professor of sociology at Sabanci University.The attempted coup of 2016 by parts of the military and blamed by Ankara on U.S.-based cleric Fethullah Gulen, who denies involvement, then prompted a harsh state of emergency that, Altinordu said, \"formalized Erdogan's personalistic rule supported by a batch of obsequious advisers of questionable credentials\".",
        "\"The confluence of these factors created the perfect political storm for economic failure,\" he added.Yet other key measures such as healthcare, infrastructure and market access remain robust after improving dramatically since Erdogan took office in 2003, helping his AKP win more than a dozen subsequent elections.Erdogan has a \"base of adoring and loyal supporters (because) citizens enjoyed significantly better living standards than...for most of the 20th century,\" wrote Soner Cagaptay in his 2021 book, A Sultan in Autumn.Before Erdogan came to power Turkey's infant mortality rate was comparable to pre-war Syria's, and is now similar to Spain's, he wrote.But over the last decade, political divisions have intensified across the country as Erdogan turned to nationalist allies to secure parliamentary majorities. He later won a tight referendum on adopting the presidential system that concentrated power at his palace.Some key economic officials left the AKP in opposition to the power grab. Analysts say cracks then started emerging in its policies, including pressure on the central bank to slash rates even as the lira tipped into crisis in 2018 and late 2021.\"Everyone remembers the early Erdogan government when he was seen to create an inclusive economy. But really it left unprecedented portions of society fully dependent on the government, and it's unsustainable,\" said Bulent Gultekin, a former Turkish central bank governor who is an associate professor at Wharton University.",
        "\"If Erdogan wins the election and continues his economic policy it will come to a complete crash at one point. It's a pretty dark picture,\" he said. \"You can postpone things for a while, but eventually you need to pay the bill.\"(Reporting by Jonathan Spicer Editing by Alexandra Hudson)"
    ]
}