{
    "articleURL": "/news/article-12049565/Las-Vegas-boy-6-life-support-suffering-major-injuries-hands-drunk-driver.html",
    "content": [
        "Ian Sanchez, 6, was returning from a camping trip with his family when his father hit another car that had been involved in a crashAccording to police, the crash was caused when the driver of the other car, who was drunk, caused a collision along an interstate in Southern CaliforniaSanchez's family issued a heartbreaking update on a GoFundMe page stating that he is unlikely to recover from his injuries  A Las Vegas family is attempting to raise money to bring their 6-year-old son home after he was hospitalized and put on life support when their car hit a drunk driver as they returned from a camping trip in California on Monday. ",
        "According to a GoFundMe page that was set up by Ian Sanchez's family, his body has undergone too much trauma and cannot recover. His family are making the heartbreaking decision about when to take their son off of life support. His father, Moses, told CBS Las Vegas that they were driving along Interstate 215 in Murrieta, 80 miles south east of Los Angeles, when they hit a car whose driver had hit a wall. Police believe the driver of the other car was under the influence. 'I couldn’t stop in time. And I just hit him straight on,' Moses said. The entire family, including Ian's 4-year-old brother, Matthew, was hospitalized with various injuries after the crash, but all except Ian have since recovered. Ian was airlifted to San Diego Children's Hospital where his family say he is receiving the best available care. ",
        "'He was the littlest person in the room. But he would make himself appear as the biggest person. They boy that we knew and loved. He's not there no more,' Moses told the affiliate. 'The ventilators are keeping him alive,' he added. 'I want everyone to remember how beautiful he was. And how he would bring joy to other people,' Moses concluded. Among the injuries suffered by Ian include a critical brain laceration and stroke which resulted in brain hemorrhaging. ",
        "At the time of writing, the crowdfunding page has raised nearly $15,000. The goal of the page is $20,000. 'We kindly ask that you give the family the time and space needed to be together for the remainder of Ian’s life left here on earth with us,' one section of the page reads.The page went on to describe him as a 'true miracle' adding that he has overcome so much since the day he was born.It describes his parents as 'loving him endlessly' adding that the will now have to 'learn how to live life without their precious baby.'",
        "The crash occurred around 3:15 am on Monday. The man who allegedly caused the wreck, Isaiah F. Orona, 26, was taken into custody at the scene, he was also seriously injured in the crash, reports NBC Palm Springs. Orona was arrested by California Highway Patrol officers at a local hospital. He has since been released on a bail of $50,000 from Riverside County jail. Orona will appear in court on June 13. Orona is accused of making an unsafe turn in his 2020 Dodge Charger resulting in him losing control which prompted the three car collision, police said. CHP Officer Mike Lassig initially referred to Ian Sanchez's injuries as 'major.' The Sanchez was family was traveling in their 2017 Kia Sportage, police said. Another person, identified only as a 55-yar-old man, suffered non-life threatening injuries in the crash. ",
        "California has seen an increase in DUIs in recent years, according to California Highway Patrol spokeswoman Fran Clader. Clader said that the increase in the Golden State 'echoes a similar trend occurring nationwide.'The leading causes of series driving-related fatalities are  impaired driving, speeding, and failing to wear a seatbelt, according to the National Highway Traffic Safety Administration.The statistics seem to indicate more deadly results in recent years, though the CHP couldn’t provide an explanation. Both the number of injury crashes and injury victims declined over the four-year period, even as the number of fatalities increased. Last year, the state launched an elaborate 'Don’t Let Drunk Drive/Don’t Let High Drive' campaign. "
    ]
}