{
    "articleURL": "/wires/reuters/article-12055805/Sabalenka-hoping-extend-amazing-rivalry-Swiatek-Madrid-win.html",
    "content": [
        "May 7 (Reuters) - Aryna Sabalenka beat world number one Iga Swiatek to win the Madrid Open in the pair's second clash in a final this year, with the Belarusian saying she hopes their burgeoning rivalry will continue to enthral tennis fans throughout the season.",
        "The world number two had lost all three previous meetings with Swiatek on clay, including a defeat in last month's Stuttgart final, but produced an aggressive performance on Saturday to win 6-3 3-6 6-3 and establish herself as a serious contender at the upcoming French Open.Sabalenka had a 2-5 win-loss record against the Pole prior to Saturday's win, with four of those losses coming in 2022.\"She always pushes me to the limits. I'm really enjoying our battles. Hopefully we can play many more finals this season,\" Sabalenka told reporters.\"I would say that this year's matches are completely different matches than it was last year. I improved a lot, and I really want to win against her, because she's such a great player.\"To have this win, especially on clay, that's something unbelievable. I'm really happy that I'm able to fight against her and get these wins so it's not super boring for people to watch our matches.\"Asked if their rivalry could be beneficial for the sport, Sabalenka said, \"I think women's tennis needs this kind of consistency, to see world number one and world number two in the finals.\"I think it's more enjoyable for fans to watch and it's more intense... I think when people see these kind of finals, it makes them want to see this battle. That's something amazing, and hopefully we can keep doing what we are doing this season.\"",
        "The pair are next in action at the May 9-20 Italian Open in Rome, before travelling to Paris for the French Open, which begins on May 28.(Reporting by Aadi Nair in Bengaluru; Editing by Muralikumar Anantharaman)"
    ]
}