{
    "articleURL": "/news/article-12044915/Bali-holidays-150-expensive-Indonesia-introduces-tourist-tax.html",
    "content": [
        "Holidaymakers to Bali could soon need to pay an extra $150 Tax is designed to raise the quality of visitors to the island Australians going on a Bali holiday could soon be hit with an extra $150 fee as the Indonesian government considers a 'tourist tax' to discourage unruly behaviour. ",
        "The tax being considered by President Joko Widodo's government would be between $45 and $150 and have the dual effect of boosting revenue from the island and lifting the standard of visitors.  The holiday hotspot relies on foreign cash but, after a few quiet years, the Indonesians seem to be losing patience with boisterous and littering tourists flooding back to their shores post-Covid.'Income from the tourism tax would help fund a range of measures and prevent Bali from becoming known only as a cheap destination,' Bali Tourism Board chairman Ida Bagus Agung Partha Adnyana said.'Cheap destinations bring in cheap tourists who tend to cause a lot of problems.'",
        "Indonesian Tourism and Creative Economy Minister Sandiaga Uno confirmed the tax was under consideration but said the government was still in the discussion phase. The levy would apply to all tourists from any country wishing to travel to Bali.In March, the Bali Tourism Board also revealed it was considering other measures to improve the behaviour of visitors such as a tourist handbook and billboards around the island explaining what was considered acceptable. While Bali is less strict than the rest of Indonesia, the country is deeply conservative with many locals frowning upon excessive drinking or scantily-clad social media snaps at temples.",
        "Foreigners acting as tour guides or renting out scooters, taking money away from locals businesses, has also become a problem, according to the Indonesian Hotel General Managers Association. In 2023 there have been 101 foreigners deported from Bali for a mixture of unacceptable behaviour and visa issues.Russians have been the most deported at 27, followed by eight British citizens, seven each from Nigeria and the US, and six from Australia. "
    ]
}