{
    "articleURL": "/wires/ap/article-12055577/Kwans-homer-powers-Guardians-4-3-win-Twins.html",
    "content": [
        "CLEVELAND (AP) - The light-hitting, slimmest-of-margin Guardians finally got a deep drive from a very unlikely power source.",
        "Steven Kwan connected for his first home run since last season - and the longest one of his big league career - to snap a seventh-inning tie, sending Cleveland to a 4-3 win over the Minnesota Twins on Saturday.Kwan muscled a 2-1 pitch from Jorge Alcala (0-1) over the wall in center field for his first homer since Sept. 25 and his seventh in 180 big league games. The surprising, 402-foot shot from their leadoff hitter was just what the Guardians needed with their offense scuffling.\"Definitely a nice little spark,\" Kwan said of his homer, just the club's 18th this season and first since April 29.Runs have been scarce lately for the Guardians, who improved to 11-2 when they score at least four. They also improved to 8-9 in 17 one-run games, the most in the majors this season and the most for Cleveland through 33 games since 1967.Although the Guardians haven't been scoring, manager Terry Francona has kept his club confident.",
        "\"Tito does a really good job of not hitting the panic button and not allowing us to hit the panic button,\" Kwan said. \"It´s just baseball. It´s a small sample size and it´s good to just keep rolling.\"Max Kepler hit a two-run homer and Carlos Correa added a solo shot for the AL Central-leading Twins, who have homered in a team record 18 straight games. Minnesota manager Rocco Baldelli was ejected for arguing in the fourth.",
        "Reliever Trevor Stephan (2-1) picked up the win despite allowing Correa's tying homer in the seventh. Emmanuel Clase pitched a 1-2-3 ninth for his 11th save in 14 chances.Rookie Logan Allen had another strong start for Cleveland (two runs in 5 2/3 innings) and José Ramírez's hustle on the bases helped the Guardians' struggling offense do enough against Sonny Gray to take a 3-0 lead.Allen didn't allow a run until the sixth, when Kepler touched him up for a two-run homer. Making just his third start, Allen outdueled Gray, who came in with the majors' lowest ERA (0.77) but gave up three runs in five innings.Gray had allowed just three runs in 35 innings coming in, and the right-hander held Cleveland scoreless for three innings before the Guardians scored three runs - the first while barely getting a ball out of the infield.Amed Rosario walked leading off and went to third when Ramírez singled off first baseman Donovan Solano's glove. Josh Naylor followed with a smash that third baseman José Miranda stopped with a dive.As Rosario scored, Miranda couldn't make a throw, and while he was still on the ground, Ramírez recognized the bag at third was uncovered and alertly broke for it, eluding the tag with a wide slide.",
        "Baldelli came storming out of the dugout to argue Ramírez should be out and was tossed by crew chief Dan Iassogna.\"I´ve looked at it again,\" said Baldelli. \"It´s a judgment call by the umpire, and I think I´ve seen that play get called both ways in my life and I wanted it to go one way for our team today and we didn´t get that call.\"Josh Bell then hit an RBI single and a rattled Gray walked No. 9 hitter Myles Straw to force in Cleveland's third run. Gray had three walks in the fourth and was called for two pitch-clock violations.\"\"It was just an inning of walks and them putting the ball just out of reach of where we were,\" said Gray. \"I just lost the zone there for one inning.\"MAD MAXKepler has made Progressive Field his personal playground.His 16 homers at the ballpark are the second-most for any visitor (Miguel Cabrera has 26), and his most at any road venue. Kepler has two three-homer games in Cleveland, the only active major league player who has more than one three-homer game as a visitor in any venue.Albert Pujols was the last player to do it, homering three times in games at Wrigley Field in 2004 and 2010.",
        "TRAINER'S ROOMGuardians: RHP Triston McKenzie (shoulder strain) is continuing his rehab in Arizona. McKenzie, who began the season on the injured list, recently began throwing bullpen sessions. He'll be at the team's facility until he's ready to go on a rehab assignment. The club is optimistic he'll be activated on May 29.UP NEXTTwins RHP Joe Ryan (5-0, 3.27 ERA), who is 3-0 in five career starts against Cleveland, take on Guardians RHP Cal Quantrill (1-2, 4.73) in the series finale.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}