{
    "articleURL": "/wires/ap/article-12043435/New-Mexico-St-player-First-hurts-changes-you.html",
    "content": [
        "New Mexico State fans couldn't wait to see if William Benjamin Jr. - the player known as \"Deuce\" - could take the Aggies back to March Madness, and maybe even to the Sweet 16 the way his dad did back in the day.",
        "But the best high school player in the state, and the most celebrated recruit in years at the college where his dad was once a star, never got on the court for the Aggies. Today, he says a violence-filled year at his dream school has left him angry, distrustful and isolated.Benjamin and former teammate Shak Odunewu spoke with The Associated Press on Wednesday about their time at New Mexico State, which led them to file a lawsuit alleging they were ganged up on and sexually assaulted by their teammates.Odunewu, who says he was assaulted himself, also says coaches did nothing when he offered them an eyewitness account of Benjamin being assaulted by three players.\"I used to have respect for people,\" Benjamin told the AP in an interview that came a few hours after an emotional news conference held on the edge of campus to discuss the lawsuit. \"I've lost all that now. Pretty much just a lot of anger. I can't put my trust in people, and I've just come to despise people, really.\"Odunewu recalled seeing Benjamin being attacked shortly before a game last year. He went to an assistant coach to ask him to address it.",
        "\"I'm coming back to the locker room and all I see is one of my teammates getting sexually assaulted,\" Odunewu said. \"Coach was standing over there, so I told him, like, `Yo, can you tell them to stop?´ He just jokingly laughed it off and was like, `What do you want me to do?' And I just left him alone, because that just really blew my mind.\"",
        "Odunewu said his Muslim faith made him hesitant to come forward with his case.\"Even though they did something unforgiveable, they're still human beings with goals and aspirations and dreams,\" he said. \"I didn't want to come out and mess up their futures. But it just got to the point where I just couldn't bear any more.\"Not until some three months after Odunewu was laughed at by the coach did Benjamin, with prodding from his father, go to campus police with details from another episode in which he said he was ganged up on and assaulted. In between, the relationship grew strained between the son and his father, former NMSU star William Benjamin, who is also a plaintiff in the lawsuit.\"I was smoking a lot, just trying to deal with the pain and start forgetting,\" the younger Benjamin said. \"Trying to find an escape route. It got to the point where I didn't even want to live with my pops,\" who remains a well-known figure in the community as coach of the Las Cruces High hoops team.The police report led to the school chancellor canceling the season and firing coach Greg Heiar for what were then termed as \"hazing\" allegations.Before that, the season was going on, mostly business as usual, despite a fatal shooting by an Aggies player who was acting in self-defense when he confronted a University of New Mexico student with whom he had been in a fight in Las Cruces about a month earlier.",
        "The shooting came during an Aggies' road trip to Albuquerque. The player has not been charged with a crime.\"Let's not lose sight: New Mexico State has (that shooting) on the resume,\" Benjamin's dad said in the earlier news conference. \"As a parent, I was never even called about that, just to reassure me that my son´s gonna be OK.\"The shooting and the assault allegations led to multiple investigations, which have been augmented since the lawsuit was filed. In addition to the state attorney general looking at several criminal and civil aspects of the assaults, the state's department of education has demanded New Mexico State review the entire athletic program.That would presumably include a review of the five-year contract extension athletic director Mario Moccia signed on April 7, the final day of chancellor Dan Arvizu's tenure.Arvizu himself has been heavily scrutinized for his leadership during the basketball crisis. The faculty senate will vote later this week on releasing a letter, a copy of which was obtained by AP, calling the extension \"both astonishing and deeply disheartening.\"State regulators also want a review of a specific interaction between Benjamin and the new coach, Jason Hooten. Benjamin says Hooten told him, in so many words, that he would be better off not playing for the Aggies anymore. Benjamin's father and the lawyers feel the entire situation was handled inappropriately.",
        "\"I don´t think you´re supposed to hit the reset button and lump in victims with everyone you´re getting rid of,\" William Benjamin said. \"Deuce was going to be an Aggie if he was good enough.\"New Mexico State spokesman Justin Bannister released a statement saying the school \"continues to regard this matter as extremely important.\"\"The kind of behavior described in those allegations has no place on our campus,\" Bannister said.Both Benjamin and Odunewu are unsure of what they'll do next. They both figure basketball will be part of that plan, in part because it offers something of an escape from the realities of where that sport left them after their troubling stays at New Mexico State. They've been taking classes online and Wednesday is as close to campus as they've been in months.\"I have days where I don't feel like talking to anybody,\" Benjamin said. \"And days where I'm mad at myself. I'm just a real isolated person now. I feel like the only way I'll get better is if I'm playing somewhere and just being where I'm wanted. I haven't been in the right mind space in I don't know how long. I'm not happy.\"___AP college basketball: https://apnews.com/hub/college-basketball and https://apnews.com/hub/ap-top-25-college-basketball-poll and https://twitter.com/AP_Top25"
    ]
}