{
    "articleURL": "/wires/ap/article-12046793/As-oil-boom-transforms-Guyana-scramble-spoils.html",
    "content": [
        "ANN´S GROVE, Guyana (AP) - Villagers in this tiny coastal community lined up on the soggy grass, leaned into the microphone and shared their grievances as someone in the crowd yelled, \"Speak the truth!\"",
        "And so they did. One by one, speakers listed what they wanted: a library, streetlights, school buses, homes, a grocery store, reliable electricity, wider roads and better bridges.\"Please help us,\" said Evadne Pellew-Fomundam - a 70-year-old who lives in Ann´s Grove, one of Guyana´s poorest communities - to the country's prime minister and other officials who organized the meeting to hear people's concerns and boost their party's image ahead of municipal elections.The list of needs is long in this South American country of 791,000 people that is poised to become the world´s fourth-largest offshore oil producer, placing it ahead of Qatar, the United States, Mexico and Norway. The oil boom will generate billions of dollars for this largely impoverished nation. It's also certain to spark bitter fights over how the wealth should be spent in a place where politics is sharply divided along ethnic lines: 29% of the population is of African descent and 40% of East Indian descent, from indentured servants brought to Guyana after slavery was abolished.Change is already visible in this country, which has a rich Caribbean culture and was once known as the \"Venice of the West Indies.\" Guyana is crisscrossed by canals and dotted with villages called \"Now or Never\" and \"Free and Easy\" that now co-exist with gated communities with names like \"Windsor Estates.\" In the capital, Georgetown, buildings made of glass, steel and concrete rise above colonial-era wooden structures, with shuttered sash windows, that are slowly decaying. Farmers are planting broccoli and other new crops, restaurants offer better cuts of meat, and the government has hired a European company to produce local sausages as foreign workers transform Guyana´s consumption profile.",
        "With $1.6 billion in oil revenue so far, the government has launched infrastructure projects including the construction of 12 hospitals, seven hotels, scores of schools, two main highways, its first deep-water port and a $1.9 billion gas-to-energy project that Vice President Bharrat Jagdeo told The Associated Press will double Guyana´s energy output and slash high power bills by half.",
        "And while the projects have created jobs, it´s rare for Guyanese to work directly in the oil industry. The work to dig deep into the ocean floor is highly technical, and the country doesn't offer such training.Experts worry that Guyana lacks the expertise and legal and regulatory framework to handle the influx of wealth. They say it could weaken democratic institutions and lead the country on a path like that of neighboring Venezuela, a petrostate that plunged into political and economic chaos.\"Guyana´s political instability raises concerns that the country is unprepared for its newfound wealth without a plan to manage the new revenue and equitably disburse the financial benefits,\" according to a USAID report that acknowledged the country's deep ethnic rivalries.A consortium led by ExxonMobil discovered the first major oil deposits in May 2015 more than 100 miles (190 kilometers) off Guyana, one of the poorest countries in South America despite its large reserves of gold, diamond and bauxite. More than 40% of the population lived on less than $5.50 a day when production began in December 2019, with some 380,000 barrels a day expected to soar to 1.2 million by 2027.",
        "A single oil block of more than a dozen off Guyana´s coast is valued at $41 billion. Combined with additional oil deposits found nearby, that will generate an estimated $10 billion annually for the government, according to USAID. That figure is expected to jump to $157 billion by 2040, said Rystad Energy, a Norwegian-based independent energy consultancy.Guyana, which has one of the world´s highest emigration rates with more than 55% of the population living abroad, now claims one of the world´s largest shares of oil per capita. It's expected to have one of the world´s fastest-growing economies, too, according to a World Bank report.The transformation has lured back Guyanese such as Andrew Rampersaud, a 50-year-old goldsmith who left Trinidad last July with his wife and four daughters, encouraged by changes he saw in his country.He makes some 20 pairs of earrings and four necklaces a day, mostly with Guyanese gold, but where he's really noticed a difference is in real estate. Rampersaud owns seven rental units, and before the oil discovery, he'd get a query every month or so.Now, three to four people call daily. And, unlike before, they always pay on time in a country where a two-bedroom apartment now costs $900, triple the price in in 2010, according to Guyana´s Real Estate Association.",
        "But many Guyanese, including those living in Ann´s Grove, wonder whether their community will ever see some of that wealth. Here, bleating goats amble down the village´s main road, wide enough for a single car or the occasional horse-drawn cart. Dogs dart through wooden homes with zinc roofs, and the sole marketplace where vendors once sold fruits and vegetables is now a makeshift brothel.\"I expected a better life since the drilling began,\" said Felasha Duncan, a 36-year-old mother of three who spoke as she got bright pink extensions braided into her hair at an open-air salon.Down the road, 31-year-old Ron Collins was busy making cinderblocks and said he didn´t bother attending the recent Saturday morning meeting with officials.\"It makes no sense,\" he said, leaning on his shovel.He doesn´t believe his village will benefit from the ongoing projects that have employed people such as Shaquiel Pereira, who's helping build one of the new highways and earning double what he did three months ago as an electrician. The 25-year-old bought land in western Guyana last month and is now saving to build his first home and buy a new car.\"I feel hopeful,\" he said as he scanned the new highway from his car, pausing before the hourlong drive home.",
        "His boss, engineer Arif Hafeez, said that while people aren't seeing oil money directly in their pockets by way of public wage increases, construction projects are generating jobs and new roads will boost the economy.\"They say it´s going to look like Dubai, but I don´t know about that,\" he said with a laugh.At a job fair at the University of Guyana, excitement and curiosity were in the air as students met with oil companies, support and services firms, and agricultural groups.Greeting students was Sherry Thompson, 43, a former hospital switchboard operator and manager of a local inn who joined a company that provides services such as transportation for vice presidents of major oil companies.\"I felt like my life was going nowhere, and I wanted a future for myself,\" Thompson said.Jobs like hers have become plentiful, but it´s rare to find Guyanese working directly in the oil industry.Richie Bachan, 47, is among the exceptions. As a former construction worker, he had the foundation, with some additional training, to begin working as a roustabout, assembling and repairing equipment in the offshore oil industry two years ago. His salary tripled, and his family benefits: \"We eat better. We dress better. We can keep up with our bills.\"But beyond the slate of infrastructure projects and jobs they´re creating, experts warn the huge windfall could overwhelm Guyana.",
        "\"The country isn´t preparing and wasn´t prepared for the sudden discovery of oil,\" said Lucas Perelló, a political science professor at New York´s Skidmore College.Three years after the 2015 oil discovery, a political crisis erupted in Guyana, which is dominated by two main parties: the Indo-Guyanese People´s Progressive Party and the Afro-Guyanese People´s National Congress, which formed a coalition with other parties.That coalition was dissolved after a no-confidence motion approved by a single vote in 2018 gave way to snap general elections in 2020. Those saw the Indo-Guyanese People´s Progressive Party win by one seat in a race that's still being contested in court.\"That´s why the 2020 elections were so important. Everyone knew what was at stake,\" Perelló said.The USAID report accused the previous administration of a lack of transparency in negotiations and oil deals with investors, adding that the \"tremendous influx of money opens many avenues for corruption.\"When The Associated Press asked Prime Minister Mark Phillips about concerns over corruption, his press officers tried to end the interview before he interjected, saying his party had a zero-tolerance policy: \"Wherever corruption exists, we are committed to rooting it out.\"Guyana signed the deal in 2016 with the ExxonMobil consortium, which includes Hess Corporation and China´s CNOOC, but did not make the contract public until 2017 despite demands to release it immediately.The contract dictates that Guyana would receive 50% of the profits, compared with other deals in which Brazil obtained 61% and the U.S. 40%, according to Rystad Energy. But many have criticized that Guyana would only earn 2% royalties, something Jagdeo said the current government would seek to increase to 10% for future deals.\"The contract is front-loaded, one-sided and riddled with tax, decommissioning and other loopholes that favor the oil companies,\" according to a report from the Ohio-based Institute for Energy Economics and Financial Analysis.Aubrey Norton, leader of the opposition People´s National Congress that was part of the coalition that signed the deal, told AP that it made mistakes: \"I have no doubt about that. And therefore, moving forward, we should rectify those mistakes.\"Activists also have raised concerns that the oil boom will contribute to climate change, given that one barrel of fuel oil produces on average about 940 pounds (about 425 kilograms) of carbon dioxide, according to the U.S. Environmental Protection Agency.AP reached out to ExxonMobil spokeswoman Meghan Macdonald for comment about how the company handled the deal in Guyana and environmental concerns, and unsuccessfully sought to arrange an interview with the company´s top official in the country. Macdonald said in a statement that the terms of the company´s agreement with the government \"are competitive with other countries at a similar stage of resource discovery.\"Norton said he was concerned about the current government´s focus on building infrastructure instead of developing people, adding that he worries the oil wealth will intensify ethnic divisions in Guyana and create other problems: \"It will result in the rich getting richer and the poor getting poorer.\"Jagdeo, the vice president who once served as president, told AP that his party has created a special fund for oil revenues with safeguards to prevent corruption, including appointment of an independent monitor and a board of directors to oversee the fund along with the finance minister.Parliamentary approval also is needed to decide how the funds would be used, he said, adding that oil revenues currently represent only a third of Guyana´s budget and that increases in salaries might happen later: \"At this point in time, we are not awash with money.\"\"We have seen the mistakes made by other countries,\" he said. \"We have to be cautious.\"Despite the oil boom, poverty is deepening for some as the cost of living soars, with goods such as sugar, oranges, cooking oil, peppers and plantains more than doubling in price while salaries have flatlined.Many are still scraping by, like Samuel Arthur, who makes $100 a month selling large, heavy-duty plastic bags in Georgetown and other areas, hauling some 40 pounds of weight every day.\"All we live on is promises,\" he said of the oil boom. \"I have to do this because I don´t have any other way to survive.\"It´s the kind of need familiar to many in Ann´s Grove.When the meeting between residents and officials ended, the prime minister pledged that most requests would be fulfilled.\"Looking forward to your promise,\" resident Clyde Wickham said. Officials nodded and vowed to return with more details on how they'll help Ann's Grove.Hopeful residents clapped. Like Wickham, many say they'll work to hold the government to its word."
    ]
}