{
    "articleURL": "/wires/ap/article-12059077/End-era-Jean-Michel-Aulas-leaves-French-club-Lyon.html",
    "content": [
        "Lyon's iconic president Jean-Michel Aulas is stepping down after nearly 36 years in charge of the French soccer club, handing over duties to American investor John Textor, who became the main shareholder last year.",
        "Lyon won seven league titles under Aulas' tenure, while the women's team established itself as a major European force. The 74-year-old Aulas was initially set to remain in his position for three more years following Textor's takeover in December. But the club issued a statement Monday saying he will instead serve as honorary chairman from now on, with Textor appointed as chief executive officer of OL Group.Textor´s Eagle Football acquired a stake of 77.49% in the club, pledging to provide a capital increase of 86 million euros ($90 million).The American businessman made his fortune in digital media. He also has stakes in Crystal Palace, Belgian second-division club RWD Molenbeek, and Brazilian team Botafogo.Aulas took over Lyon back in 1987, when the club was in debt and played in the second tier of French football. By making astute player signings and developing one of the most renowned youth academies in Europe, Aulas grew the club into a financially successful entity owning its 59,000-seat stadium.Lyon´s run of titles from 2001-08 made it the powerhouse of French soccer as players like Real Madrid great Karim Benzema emerged from its academy. Others like free-scoring Brazil midfielder Juninho and Ghana´s ball-winning Michael Essien made their name at the club at the time.",
        "On the European stage, Lyon twice reached the Champions League semifinals. In contrast, Lyon's women's team became the dominant force in Europe, winning a record eight Champions League titles.\"OL Group sincerely thanks Mr. Jean-Michel Aulas for his commitment and unreserved dedication to Olympique Lyonnais for more than three decades, during which both the men´s and women´s teams won more than 50 titles,\" Lyon said.Lyon striker Ada Hegerberg, who won the 2018 women's Ballon d'Or, paid tribute to Aulas in a message on Twitter.\"Thank you Jean-Michel. Thank you very, very much,\" she wrote.In the years since the last title in 2008, Lyon's men's team has faded as Paris Saint-Germain imposed its dominance under its cash-rich Qatari ownership. Since QSI´s takeover in June 2011, PSG has won eight titles and Lyon has finished runner-up only twice.After Bordeaux ended Lyon´s run in 2009, the club´s fortunes dipped - despite a continuous flow of young talent.The club finished in a dismal eighth place last season and 25 points behind PSG. Ten league losses and 51 goals conceded - the most goals allowed by any club in the top 10 - made for grim statistics.Under coach Laurent Blanc, the club has been going through another mediocre campaign and is struggling to qualify for European competition next season, standing seventh with four games left to play in the French league.",
        "According to L'Equipe newspaper, which broke the news of Aulas' departure, tensions between Textor and the Lyon president have mounted recently, with the new owners determined to change the the club´s sporting structure.\"The priority of the new Chairman and CEO and the Board of Directors will be to strengthen Olympique Lyonnais´ place on the world soccer stage, in line with the highest ambitions of its illustrious history,\" the club said.L'Equipe reported that Aulas, who still owns 9% percent of the club through his holding company Holnest, will receive an exit compensation of 10 million euros ($11 million).___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}