{
    "articleURL": "/wires/pa/article-12057291/Chris-Rushworth-shines-Warwickshire-impress-against-Hampshire.html",
    "content": [
        "Warwickshire bowler Chris Rushworth took seven wickets for 38 runs to help his side to an impressive LV= Insurance County Championship victory over Hampshire by an innings and 84 runs at the Ageas Bowl.",
        "The fast bowler helped skittle Hampshire out for just 97 in their second innings and finished with match figures of 10 for 76.Hampshire totalled 229 in their first innings and Sam Hain (85), Ed Barnard (95) and Michael Burgess (88) all came close to centuries to help them clock up 410, but Rushworth’s high-quality movement helped Warwickshire to a first victory at the venue since 2010.Azhar Ali hit an unbeaten century to guide Worcestershire to a draw with Sussex at New Road despite another stunning performance from England pace bowler Ollie Robinson which saw him pick up career-best match figures.Robinson’s first-innings seven for 59 was matched with another incredible effort of seven for 58 in the second as he took 14 for 117.Azhar batted throughout the day to finish on 103 not out and earned Worcestershire a draw, despite them being 109 behind after the first innings.Sam Whiteman hit his first century for Northamptonshire to earn a draw with Somerset at Taunton.Visitors Northamptonshire extended their overnight score from 66 for one to 311 for eight, with Whiteman leading from the front with an unbeaten 130 off 269 balls – including 14 fours and a six.The Yorkshire-born Aussie left-hander batted throughout the day, anchored excellently by Tom Taylor, who contributed 53 to their eighth-wicket partnership of 79 that tamed a Somerset attack in the end, as both sides shook hands on a draw.",
        "Nottinghamshire’s lower order stood strong to deny Lancashire victory on a dramatic final day at Trent Bridge.The hosts lost their first six wickets for 55 in pursuit of 295 for victory, but a stubborn rearguard action meant they finished nine down for 136, with Lancashire falling just short of the finish line.Lancashire declared on 329 for eight at lunch, giving the hosts 67 overs to defend for a draw.Nottinghamshire looked to be heading for a third defeat in four when George Balderson took three wickets in 11 balls to have them six down but Joe Clarke (42) and seam bowler Brett Hutton blocked for 34 overs to offer a glimmer of a result, and they only lost two more wickets in the remaining 13 overs – the ninth with just four balls remaining – Stuart Broad also seeing out 50 balls.",
        "Jamie Smith stood at the crease for around two-and-a-half hours to help Surrey rescue an unlikely draw at Chelmsford.After Surrey were reduced to 103 for six with 25 overs still to hold out, Smith turned into defensive mode and helped to retain their unbeaten start to the season.Surrey had been set a target of 273 to chase down in 54 overs. But, Surrey’s hopes of victory went up in smoke when Ollie Pope departed on 47, and they played to the close on 153 for seven, Smith finishing the day unbeaten on 39 from 126 balls.",
        "Adam Lyth’s mammoth 174 made sure Yorkshire held on for a draw with Glamorgan after Jonny Bairstow’s promotion up the order backfired with a nine-ball duck.Bairstow was making his senior return this week after eight months out injured when Lyth and Finlay Bean’s 99-run opening stand was broken on the stroke of lunch.Yorkshire’s 492-run target was soon dismissed when the England batter edged to second slip off Timm van der Gugten.Lyth was twice dropped on 48 and 69 and showed intent with his 138-run partnership with George Hill and in the end, Yorkshire were left reeling when they lost seven wickets in the final session.Jordan Thompson (55 not out) blocked out Michael Neser’s final over to salvage a draw."
    ]
}