{
    "articleURL": "/wires/ap/article-12059111/Harper-Verlander-return-Phillies-Mets-funk.html",
    "content": [
        "Bryce Harper and Justin Verlander are back - and not a moment too soon for two struggling NL East teams with high expectations.",
        "The two stars missed the beginning of the season because of injuries - and oddly, it wasn't the pitcher who was coming off Tommy John surgery. Harper had that operation in November and made it back for the Philadelphia Phillies on Tuesday. He homered Saturday.Verlander made his season debut for the New York Mets on Thursday after dealing with a muscle strain in his back. He allowed a couple of solo homers in the first against Detroit before shutting the Tigers out for the next four innings.Although it was nice to have Harper and Verlander, it was not a pleasant week for the Phillies and Mets. Philadelphia had lost six in a row before finally beating Boston on Sunday. The defending National League champions are 16-19 and trail NL East-leading Atlanta by eight games.The high-priced Mets are seven games out of first after losing five of six against the Tigers and Rockies.The Braves overcame a 10 1/2-game deficit last year and beat out the Mets for the division title. This year, Atlanta is the team that is out to a significant early lead.",
        "TRIVIA TIMEThe Braves have won five consecutive NL East titles. When is the last time they were in sole possession of first place at the start of play on June 1?",
        "RISINGThe Boston Red Sox won eight in a row before Sunday's loss to the Phillies. Included in that streak was a four-game sweep of Toronto. Masataka Yoshida is on a 16-game hitting streak and Rafael Devers leads the American League with 11 home runs.FALLINGThe Pittsburgh Pirates were one of baseball's biggest stories when they raced out to a 20-8 record, but they've since lost seven in a row. A tough schedule played some role - they were swept by Tampa Bay and Toronto in three-game series - but Pittsburgh's struggling offense is the main culprit. The Pirates have scored just nine runs during this skid.The reason they're still atop the NL Central is because second-place Milwaukee dropped six straight before beating San Francisco on Sunday.LINE OF THE WEEKThe first few weeks of the season have been a bit of a nightmare for the St. Louis Cardinals, but they snapped an eight-game losing streak Sunday with a 12-6 win over Detroit. Paul Goldschmidt hit three home runs and finished with four hits and four RBIs.COMEBACK OF THE WEEKThere were lots of good candidates this week. On Sunday alone, Tampa Bay won after trailing the Yankees 6-0 in the fifth, Washington won after trailing Arizona 7-3 in the seventh, and the Dodgers won after being down to their last out against San Diego.",
        "But the top comeback was by the Los Angeles Angels, who were down by three runs against Texas with two outs and a man on first in the bottom of the ninth Friday. At that point, the Angels had a 1.4% win probability, according to Baseball Savant.Brandon Drury then hit a single, Chad Wallach added a two-run double and Luis Rengifo tied it with an RBI single. Los Angeles eventually won 5-4 in 10 innings, scoring the winning run on a wild pitch.TRIVIA ANSWERIt hasn't happened since 2014, when Atlanta had a two-game lead over Miami. Washington went on to win the division that year.Since then, on June 1:2015 - Washington led the Mets by a half-game. New York went on to win the division.2016 - Washington led the Mets by two games. The Nationals went on to win the division.2017 - Washington led the Mets by 9 1/2 games. The Nationals went on to win the division.2018 - Atlanta and Washington were tied for first. The Braves went on to win the division.2019 - Philadelphia led Atlanta by three games. The Braves went on to win the division.2020 - There was no baseball in June. The Braves went on to win the division.",
        "2021 - The Mets led Atlanta by four games. The Braves went on to win the division.2022 - The Mets led Atlanta by 10 1/2 games. The teams went on to finish tied for first, with the Braves winning the division on a tiebreaker.___Follow Noah Trister at https://twitter.com/noahtrister___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}