{
    "articleURL": "/tvshowbiz/article-12057547/Chantel-Jeffries-Candice-Swanepoel-rev-glam-Palm-Angels-F1-fashion-party-Miami.html",
    "content": [
        "DJ Chantel Jeffries and Tropic of C founder Candice Swanepoel revved up their glam for the launch party of Palm Angels' fashion collaboration with the MoneyGram Haas F1 racing team, which took place in Miami on Saturday night.",
        "The Cali-born, North Carolina-raised 30-year-old showcased substantial cleavage in a grey cut-out short-sleeve mini-dress featuring crystal embellishments and matching stilettos.Jeffries Instastoried a snap of the seaside setting for the 'beautiful dinner' which featured dishes like nuts-crusted salmon, beef tenderloin carpaccio, trofie alla nerano, and casa tua tiramisu.Chantel's last single was Come Back To Me in 2020.Meanwhile, the 34-year-old South African bombshell opted to flaunt her taut tummy in the $590 Palm Angels 'Lurek Stripes Knit Logo Top' and matching pants.",
        "Candice accessorized her evening attire with the $785 'Lace Up Palm Heels' from the same LA-inspired clothing company.Hairstylist Leah Caso coiffed Swanepoel's partial updo for the fashion festivities.Make-up artist Patrick Ta brought out the Lions Model's brows and baby blues, applying his own brand's foundation and contour duo on her.Candice made sure to pose with the man of the hour, Palm Angels designer Francesco Ragazzi.It's hard to believe Swanepoel has two sons - Ariel, 4; and Anacã, 6 - from her 13-year romance with ex-fiancé Hermann Nicoli, which ended in 2018.Designer Camila Coelho showed off her tiny waist in the black Palm Angels turtleneck crop-top while influencer Alix Ashley Earle rocked a red cut-out pencil dress.Influencer Blake Gray paired a Palm Angels polo-style top with black faded jeans and white sneakers.",
        "Influencer Tessa Brooks toted a $560 black Palm Angels 'Big Palm Nylon Pouch' with a green Sau Lee maxi-dress while The Society Management Model Josephine Skriver looked leggy in a $460 b&amp;w Palm Angels 'Track Dress.'Meanwhile on the F1 race track, The Oppenheim Group CEO Jason Oppenheim chivalrously accompanied his VP Mary Fitzgerald, who broke her foot, to the Alfa Romeo area since her husband Romain Bonnet had to work.The Selling Sunset stars enjoyed a very close encounter with Guardians of the Galaxy Vol. 3 actor Vin Diesel."
    ]
}