{
    "articleURL": "/wires/pa/article-12054899/Malky-Mackay-delighted-impact-substitutes-vital-Ross-County-victory.html",
    "content": [
        "Ross County boss Malky Mackay hailed the impact of his substitutes after the relegation-battling Staggies claimed a potentially vital 2-0 win over Livingston.",
        "Alex Iacovitti put County ahead just before half-time and Alex Samuel added a second on the hour just minutes after coming off the bench as part of a triple change, his first goal for the club.Livi could find no way back after that and finished the game with 10 men after Kurtis Guthrie saw his yellow card changed to red following a VAR review.Mackay believes Samuel’s performance, alongside all of the others he brought on, showed how much of a collective effort went into the vital result.“I was really delighted with the way the substitutes came on and impacted the game,” Mackay said.“Josh Stones and particularly Alex have had to bide their time. They are both boys who are low maintenance that work hard at training every day, for no reward on a Saturday at times.",
        "“I’m delighted for them. Alex scores and I’m so happy because he has been out for a year with a torn cruciate.“We could have scored another couple in the second half, but we really showed that confidence to push on.“Livingston are a team that make it difficult for people, but we showed we could dig it out today.“(Owura) Edwards was dangerous and Josh Stones looked really on it, while Nohan Kenneh came on and added to that midfield as people were getting tired.",
        "“I’m not singling people out, it was a really good team performance here today.”Livingston boss David Martindale, meanwhile, was left bemoaning a lack of responsibility from his players when it came to marking Iacovitti for the first goal.As far as Guthrie’s red card for a clash with Keith Watson, though, he believes the right decision was reached by the video assistant referee.“I thought up until that first goal we had controlled large portions of the game,” Martindale said.“The first goal was a poor one for us to lose. I could see Iacovitti walking into the box unopposed from the technical area, and when you allow that to happen it’s a recipe for disaster.“At that point, the players have to take responsibility. Someone has to pick him up – probably not the two centre-halves, because they’re locked on to the two strikers – but we don’t.“Ross County started nervously, but that goal gave them confidence to grow into the game, and as that happened we grew out of the game.“Going down to 10 men makes it difficult to get anything from the game as well. In real time, I didn’t think it was a red card, but on watching it back I think there was enough momentum in the swing to make it a red card.”"
    ]
}