{
    "articleURL": "/news/article-12052353/Supreme-Court-blocks-execution-Oklahoma-death-row-inmate-Richard-Glossip.html",
    "content": [
        "Supreme Court on Friday blocked Oklahoma from executing Richard GlossipGlossip, 60, had been scheduled to be put to death on May 18 for 1997 murderOklahoma AG said his trial was unfair, but did not argue Glossip is innocent The US Supreme Court has blocked Oklahoma from executing death row inmate Richard Glossip, after the state's attorney general agreed his life should be spared and Kim Kardashian spoke out to oppose the execution.",
        "Glossip, 60, had been scheduled to be put to death on May 18 for his role in the 1997 murder-for-hire of motel owner Barry Van Treese, his former boss, but Friday's ruling puts the execution on pause while the high court reviews the case.'We are very grateful to the US Supreme Court for doing the right thing in stopping Richard Glossip’s unlawful execution,' Glossip's attorney told DailyMail.com in a statement. 'There is nothing more harrowing than the thought of executing a man who the state now admits has never received a fair trial.'Last week, the Oklahoma Pardon and Parole Board voted to reject a clemency recommendation for Glossip, even after new Oklahoma Attorney General Gentner Drummond said that Glossip did not receive a fair trial.In seeking a reprieve, Drummond, a Republican, cited serious concerns about the way prosecutors handled witnesses and evidence at trial, though he said he did not believe Glossip was innocent of the murder.",
        "The Supreme Court ruling puts the execution on hold while the court reviews the case. Justice Neil Gorsuch recused himself from the decision, presumably because he dealt with it earlier as an appeals court judge. Glossip's attorney said that he was hopeful the high court would vacate his conviction.  Attorney General Drummond supported the high-court reprieve for Glossip, telling the justices, 'Glossip's trial was unfair and unreliable.'",
        "Another man, Justin Sneed, admitted robbing and killing Van Treese after Glossip promised to pay him $10,000. Sneed received a life sentence in exchange for his testimony and was the key witness against Glossip.Two investigations have revealed problems with the prosecution's case against Glossip.Drummond said Sneed lied on the stand about his psychiatric condition and his reason for taking the mood-stabilizing drug lithium.Other problems included financial records that were destroyed in late 1999 or early 2000, prior to Glossip's retrial after his first conviction and death sentence were overturned. The records could have disproved the prosecution's theory that Glossip wanted Van Treese killed to hide Glossip's alleged embezzlement from the motel, where he was manager, according to an independent report commissioned by a group of 34 Oklahoma state lawmakers, including 28 Republicans.",
        "'This loss or destruction of evidence appears to be so critical to the defense as to cast serious doubt as to the fundamental fairness of the criminal trial against Glossip,' the report stated.'This most likely (case) was a solitary robbery committed by Sneed who pocketed whatever money he took,' estimated at about $2,800, from Van Treese to fuel a drug addiction, according to the report.The report also cited missing security video from a nearby convenience store allegedly showing a man leaving the motel shortly after the murder.",
        "Glossip's case has been to the Supreme Court before. He was given an earlier reprieve in 2015, although the court later ruled 5-4 against him in a case involving the drugs used in lethal executions. Last month, Kim Kardashian spoke out in support of Glossip, arguing his actual innocence in the case.'Richard Glossip needs our help, urgently! He has been on Oklahoma's death row for 24 years for a crime he did not commit and is now scheduled to be executed on May 18th,' she wrote in a tweet.Kardashian has taken an interest in criminal justice and supported several death row inmates -- but Glossip's support from Oklahoma's top prosecutor was highly unusual. 'I am not aware of an Oklahoma Attorney General ever supporting a clemency application for a death row inmate,' Drummond wrote in a letter the state's Pardon and Parole Board last week. 'In every previous case that has come before this board, the state has maintained full confidence in the integrity of the conviction. That is simply not the case in this matter due to the material evidence that was not disclosed to the jury.' Glossip has been scheduled to be executed three times, only to be spared shortly before the sentence was set to be carried out. ",
        "He was only hours from being executed in September 2015 when prison officials realized they had received the wrong lethal drug, a mix-up that helped prompt a nearly seven-year moratorium on the death penalty in Oklahoma.Prominent death penalty opponent Sister Helen Prejean, whose book 'Dead Man Walking' was turned into a movie, has also spoken out in support of Glossip. Glossip´s case attracted international attention after actress Susan Sarandon - who won an Academy Award for her portrayal of Prejean´s fight to save a man on Louisiana´s death row in the 1995 movie based on Prejean's book - took up his cause in real life. His case also was featured in a 2017 documentary film titled 'Killing Richard Glossip.'Glossip has been twice married behind bars. He married his first wife, Leighta Joy Jurasik, in 2018 when she was 21, and they divorced in 2021.Last year, he married his second wife in prison, 32-year-old Lea Rodger, in Oklahoma State Penitentiary. "
    ]
}