{
    "articleURL": "/usshowbiz/article-12041271/How-Michael-Palin-late-wife-Helen-TVs-enduring-couples-meeting-aged-16.html",
    "content": [
        "Michael Palin's wife Helen was his strength and stay over their 57-year marriageHelen Gibbins died after 'suffering with chronic pain', he announced yesterdaySir Michael Palin's late wife Helen was his strength and stay over their 57-year marriage and as of one of TV's most enduring couples she remained by his side as he rose to fame in the world of showbusiness. ",
        "Describing her as the 'bedrock' of his life, the TV legend announced that Helen Gibbins had died after 'suffering with chronic pain for several years' on Tuesday.Talking about his 'indescribable loss', the Monty Python star turned explorer opened up about their meeting as childhood sweethearts during a summer holiday which lead to nearly six decades of marital bliss.The couple first met when they were 16 years old in the seaside town of Southwold, but thanks a shared sense of humour, Sir Michael said that their relationship 'got better as time went on.'In recent years Sir Michael would regularly be asked in interviews about the secret to a long and happy marriage and his heartwarming answers would usually focus on how well they got on.",
        "'What we liked about each other then we still like now. I can't imagine life without her,' he told the Telegraph in 2018.It was a whirlwind romance which he later used as the basis for his loosely autobiographical 1987 drama East of Ipswich, which is set to air tonight on BBC Four.Speaking on The Jonathan Ross Show in 2019, Sir Michael recounted the sweet moment he first met Helen, who would go on to be his life partner.",
        "He said: 'I met his girl on holiday when I was 15 years old, she was 16. We had a holiday romance. ",
        "'A year later, she was back in the same little Suffolk town and the romance got a bit more intense, we held hands.'And then the third year she wasn’t there, we didn’t see each other during the year because we lived in separate parts of the country.''We did write each other lots of letters and I was very much in love with her.'Despite another chance encounter the following year, the pair lost touch for many years but in a twist of fate, were reunited on Michael's first day at Oxford University, where he studied modern history.He explained that Helen was visiting her friend for the weekend, and as the pair saw each other again rekindled their romance which would lead to five decades of happy marriage.He continued: 'The first man I met there had a girlfriend who worked at a Teacher’s Training College in London and he said, ‘come up to Oxford’.'And she said, ‘can I bring my friend?, she’s called Helen and I think she says 'she knows Michael from way back'.'So she came back and the whole relationship started again and we’ve been married 53 years.'Sir Michael, who rose to fame in Monty Python but is known to younger audiences for his travel documentaries, told how his wife had always been supportive of his career.",
        "His desire to travel the world while he filmed Life Of Brian in Tunisia launched a whole host of travel documentaries, including Around the World in 80 Days and the Himalayas with Michael Palin.Teacher Helen, who went on to be a therapist and bereavement counsellor, even joined him on some of his incredible ventures.She also featured on Around The World in 80 Days, as the couple appeared on screens to explore all corners of the world on the show, based on the book by Jules Verne.",
        "He once joked that Helen was 'always suspiciously tolerant of my trips.'But there was one location which Helen was not happy about his visiting, Michael revealed in 2019, and even urged him not to go.Sir Michael said that Helen was not keen on his trip to North Korea for a inside look of the Hermit Kingdom, which aired on Channel 5 in 2018. He said: 'There was never a moment when I said, ‘I don’t want to do this’.“But there was a time when I thought it would be rather ­foolish and, quite uncharacteristically, my dear wife said, ‘I don’t really want you to do this.’Away from showbusiness, the couple lived in the same house in Hampstead, north London, for more than 50 years, enjoyed watching Scandi detective dramas together and would holiday in Mallorca every year.",
        "Together they welcomed three children, Thomas, 54, William, 52 and Rachel, 48 - and four grandchildren.Talking to the Times in 2020 about how the couple had made it through lockdown while other marriages faltered, he said: 'Helen and I have been married so long, we've long been through the period where you bristle at everything about the other person that irritates you.",
        "'We've learnt over the years just not to go into those areas. So I think we got on amazingly well.'Prior to the pandemic the pair were both 'doing so many things' but lockdown restrictions saw the couple start to enjoy the slowing pace of life.Reflecting on their marriage up until that point, he said: 'She's been brilliant all these years I've been away at rallying the family and keeping things going.'When asked about the key ingredient to an enduring marriage, Sir Michael's answers rarely stray from their shared sense of humour, their want to spend time together and how well the couple got in.Speaking to Sunday Times magazine in 2018, he said that they 'got together largely because we had a similar sense of humour'.",
        "He said: Of course there was love and affection and all that, but it wasn’t the most earth-shatteringly passionate affair, it was simply that we enjoyed things together.'",
        "And in 2015 he told the Telegraph:' What is the really important thing in a relationship, what is the main thing? Sex, or going to the theatre, or having lots of friends, or whatever?''None of that matters, there's something underneath that works, that you're happy to be with somebody for an awful lot of the time.''The more time you spend together, the more things you have to share, the less likely it is that you want to throw all that away,' he poignantly added.",
        "Sir Michael and Helen tied the knot in 1966 after six years together and went on to start a family.As they built upon their romance, Michael then found huge fame in Monty Python, but despite all the huge changes in their lives that came with his fame, they remained steadfast through it all.Sir Michael gave an intimate insight into their married life while speaking to MailOnline in 2012, saying how he would sooner run up and down Oxford Street with his underpants on his head than cheat on Helen.Describing how he balances his work and his family life, Michael said: 'Over the last year, I discovered a rather enjoyable equilibrium, a balance between work and relaxation that for the first time in my life favoured the latter.' ",
        "National treasure Michael soared to fame and quickly got a reputation for being a 'nice' man in the TV and film industry, but the writer confessed it is a term which annoyed his wife Helen.'I have never claimed to be the nicest man in the world. That's a cliché that has somehow come to be widely accepted. It drives Helen mad,' he told The Independent in 2012.'As she and my children will testify, I have a short fuse over certain things. Like if the one-inch nails are not where they should be in the box, and they've been moved to the three-inch section. Who did this?'",
        "Early on in his career, Michael found a way to bring his love for the world into his work, launching his first ever travel documentary - Great Railway Journeys Of The World: Confessions Of A Train Spotter - in 1980.Though his jetting off around the globe could have proved an obstacle for Michael and Helen, as he jetted off for long periods of time to film, Michael told how his wife remained supportive through it all. 'Helen's always been really tolerant of my travels,' he said. 'If she said, 'You've got to stay home' she'd just have a frustrated man kicking chairs in the kitchen and looking at atlases.'So she's always been very happy to let me go. I see no reason to rupture such an extraordinary relationship. I don't like a life that's edgy and uncomfortable. I'm restless in other ways – in terms of work.'",
        "But things haven't always been plain sailing for the couple as the comedy genius recently spoke about how he had to have heart surgery in 2019 and the struggles that came with it.Speaking to Radio Times, he said of his surgery: 'Coming home has always been the best part of the process. We live near Hampstead Heath in London and near friends.''The great surprise is that I've been extremely content to be in the same place for some time,' he added.Bereavement counsellor Helen also suffered with her health in recent years, with Michael telling of her struggles with chronic pain before her death.Sharing his fears for his beloved wife, Michael told how Helen had to be moved into respite care from the London home they had shared for 50 years and told how they 'live life with our fingers crossed'.'I don't think you can cure it, but they will help her manage it,' he told the Telegraph of Helen's condition last September.'It's such a bore. She was so active and still is mentally. But the body is declining. We live life with our fingers crossed.'"
    ]
}