{
    "articleURL": "/sport/football/article-12048335/Jimmy-Montgomery-talks-save-50th-anniversary-Sunderlands-FA-Cup-triumph.html",
    "content": [
        "Jimmy Montgomery was in goal for Sunderland against Leeds in the 1973 finalSunderland triumphed 1-0 at Wembley, with Montgomery making a huge saveThe goalkeeper has sat down with Mail Sport to talk us through that famous save Jimmy Montgomery has in his hands the picture that defines his football career, perhaps even his life. It is those hands that define the picture.",
        "A millisecond of his near 80 years, a moment in time that is today remembered half a century on. Such is the legend, maybe his grandchildren will be asked to reflect in another 50 years.For now, thankfully, we are with the man himself. Montgomery is fighting prostate cancer, but he is winning, thanks to the care of the Sir Bobby Robson Unit in Newcastle.Our picture is in good hands, too. Big hands. Like shovels, you might say. And on that rainy day at Wembley in the FA Cup final of 1973, they certainly dug Second Division Sunderland out of a hole. Had Don Revie's Leeds United equalised to make it 1-1 in the 70th minute, they would have been overwhelming favourites to retain the Cup.",
        "But they did not, and that is why we are sitting here now, at the Durham hotel that marked the start of Sunderland's victory bus parade all those years ago.Fittingly, Montgomery is using his hands to retell the story. He begins by tracing the cross from Leeds defender Paul Reaney, headed on goal by Trevor Cherry.'I remember every little second of it,' he begins. 'When Cherry gets the header in, I've made the save and knocked it back into this vicinity here.'He taps the angle of the six-yard box. It was there that Peter Lorimer fired the loose ball towards an open goal. 'And Lorimer makes it one each… no!' said David Coleman, commentating for the BBC.",
        "'I'm lying on the ground,' says Montgomery. 'I see it going to a white shirt, but I don't know who. My instincts, as a goalkeeper, were that I had to get up. It was the sort of thing you did in every training session of your life.'The only space Peter could hit it was exactly where he did. You get up, see the ball coming, if only for a split-second, and just get your hand to it. Then, as I come down, I've seen the ball hit the crossbar.'When it bounces down, Dick (Malone) volleys it clear. It goes out for a throw, but I can't think about what has just happened. We had another situation to deal with.'It was only when I spoke to the media after the game that I thought, 'There's a lot of interest in my saves'. But at this time (points to picture), I was oblivious to the significance of what I'd done.'What he had done was defy sporting logic — as Coleman confirmed. In flicking the ball up on to the bar, Montgomery had raised the bar by which all other saves are judged. Through the Seventies, fans used to debate which was best — Montgomery or Gordon Banks versus Pele at the 1970 World Cup.",
        "'Me and Banksy used to laugh. We knew we were so fortunate those saves happened on the biggest stage, with the world watching. I'd made an even better save against Hull a few weeks earlier, in front of one man and his dog and no TV cameras! That's the difference.'Sunderland held on to the lead given to them by Ian Porterfield's first-half strike, making them the first post-War FA Cup winners from beyond the top flight. Montgomery is still looking at the picture. What emotions does it stir?'Immortality. It will never happen again. Not a day goes by when I'm not reminded of it. I played golf in Newcastle last week and it's all people want to talk about, no matter who they support.'It is all we want to talk about, too. The picture, he tells us, hangs in the hallway of his home in Sunderland, next to another save he made from George Best.So, what else can he tell us about it? Where is his shirt? His gloves? His boots? The ball?'My next-door neighbour has the shirt and boots, but they've been around the world and were in Australia with another friend for a time. When the boots came back, he must have had them in the garden — they were rock hard from all the sun! ",
        "'It took a full tin of dubbin to get them back in shape. The ball, I still see that every week when I go to the Stadium of Light.",
        "'The gloves, would you believe, were stolen. When we played Sporting Lisbon in the Cup Winners' Cup, I put my cap and gloves next to my goal. Come full time, they'd gone! I hope the Portuguese ball boys who took them realised the significance.'But I'll tell you about those gloves. It was normally bare hands. Then, Peter Bonetti brought these gloves out. They were made from the baize of a snooker table. They were useless, the ball was like a bar of soap! Because of the rain, I couldn't catch it, I just had to punch everything.'On reflection, I suggest, it was a blessing they had no grip. 'Funny you say that, Dick has always said to me I should have held Cherry's header. Maybe… but if I'd done that, we wouldn't be here now!'He is right. Not that Montgomery wants to monopolise the adulation. It is more because, from that one save to deny Lorimer, a lifetime of happiness and friendship has grown.Take his recent visit to the Blacksmiths Arms near York, owned by Lorimer's son, Simon, whose father — Leeds' record goalscorer — died two years ago aged 74. ",
        "'It was lovely, what a smashing lad. It was nice for him to talk about his dad, to show that he hasn't been forgotten. He took me around all the memorabilia he has up. The memories… it was wonderful.'We don't suppose the picture is on the wall? 'It is!' booms Montgomery. 'They've got my save, the Cup final programme and Peter's signed shirt. Peter and I will always be linked by this image, that moment.'We became good friends. A lot of years later we did a re-enactment for a newspaper. I felt great going down for the first save, but it took me 10 minutes to get back up for the second!'But Peter always said, 'Jim, I couldn't have hit it any sweeter. I put it exactly where I wanted to. It was just your day'.'Montgomery has mourned the loss of several of the Leeds team in recent years — Cherry, Paul Madeley and Norman Hunter have passed away since 2018. Captain Billy Bremner died in 1997.'Many of them were taken too early. It's sad, very sad. We have lost Ian (Porterfield) and Billy Hughes to cancer. And Bob, of course.'Bob Stokoe was the Sunderland manager who, on full time, ran across the Wembley pitch in his trilby, mac and bright red tracksuit, making straight for Montgomery in thanks, a moment immortalised by a statue at the Stadium of Light.",
        "He died in 2004 aged 73 — a number not lost on those close to him — after suffering from Alzheimer's disease.'Bobby Kerr (Sunderland captain) and I went to see Bob in a care home in Hartlepool. We took a hamper from all the old players. All the War songs were playing, he was sitting there singing Vera Lynn. But he didn't know Bobby or me, and that destroyed me.'Montgomery's save and Stokoe's dash will be celebrated at the Stadium of Light this evening, where every surviving member of the team will gather for an anniversary dinner. How does that feel — 50 years, Jim?'When we had our 40th, we thought, 'There'll not be a 50th, there won't be anyone around!' But here we are, and we've still got the most amazing rapport.'When they play that footage at the dinner, of Bob running across the pitch, I know my wife will have a tear in her eye. I go back to that day all the time, but when all of us are together, it's different. It's special.'Montgomery, who still works as a club ambassador, smiles at mention of a 60th anniversary. And why not? He is tackling cancer with positivity and humour.'When I transferred from my specialist in Sunderland to the Sir Bobby Robson Unit, she said to me, 'Jimmy, you're my longest-surviving patient'. I said, 'Do I really need to know that!''But I feel good. The Sir Bobby Robson staff are absolutely magnificent. There can be pain, but I have to manage it and not do too much. As long as these hands don't lock up when I'm playing golf, I'm happy!'His hands have been locked on our picture for the best part of an hour. Finally, he passes it back. The memories, though, will be in his grasp for ever."
    ]
}