{
    "articleURL": "/news/article-12049391/Suspect-nabbed-killing-Arizona-esthetician-29-murdered-desert-hiking-trail.html",
    "content": [
        "Lauren Heike, 29, was hiking on the popular Reach 11 trail near her apartment on April 28Her body was discovered the next day, with police confirming she was ambushed from behind Phoenix Police have now arrested a suspect in his early 20s in connection with her deathPolice have arrested a man on suspicion of murdering an esthetician who was 'stabbed multiple times' on a desert hiking trail in Arizona. ",
        "Lauren Heike, 29, was found dead on the Reach 11 trail on April 28, with police launching a week-long manhunt for her killer.Phoenix Police arrested a man in his early 20s on Thursday on suspicion of murdering Heike, who had recently moved to the area from Washington.Sources told local media that she was stabbed 'multiple times' and police tracked down the suspect after finding his 'DNA at the scene'. Authorities have yet to name the man, but his arrest comes after a chilling clip showed a lone figure sprinting on the trail where her body was found.",
        "He was arrested at his home, less than a mile from the trail where Heike's body was found. Police confirmed that the man taken into custody was the same man running in the footage. Pictures of his arrest were captured by Telemundo, with the suspect sitting on the sidewalk calmly talking to police.  He is currently being interviewed by homicide detectives and police will release his name once he is booked into jail. Sergeant Melissa Soliz said: 'Detectives are serving a search warrant at the man's apartment and he was taken into custody this evening at around 6.30pm.'Right now, he is the person that we believe to be responsible or in connection to the murder of Lauren Heike. ",
        "'This is going to take a while for our detectives to sift through all this evidence, process it, collect it and hope to have some more answers later.'With this man taken into custody, I can tell you that he is the same person that was shown on the video clip that we shared with you all a few days ago.'With this information we hope that the community tonight can rest a little easier knowing that this person is off the streets.'",
        "She didn't confirm whether the suspect knew Heike but said more details are expected to be released on Friday. 'Phoenix police have taken a man into custody in connection with the murder of 29-year-old Lauren Heike,' it said in a statement. He was linked to the murder through DNA evidence, according to CBS 5. Amber Winter witnessed the arrest as she was walking past with her pet and recorded the moment.'It was around 6:00 p.m, I was walking my dog, saw about three SWAT trucks come in, 15 undercover vehicles pull up to a building,' she told Fox10 Phoenix. 'They literally blew the door down, went in, screaming 'get on the ground! Get on the ground!'",
        "'They detained the supposed suspect, and brought him out. He sat there for a while, while they went inside and were searching and were interviewing people.'",
        "The arrest comes a day after Heike's mother, Laura Heike, tearfully pleaded with the public and said: 'Somebody knows this person.''Somebody wearing a backpack or a hoodie or whatever the video, it's hard to tell, in a sunny hot day that person will stand out.'When you've done something, you're going to be unusual.' Heike's father, Jeff Heike, added: 'She was my little girl. I'm really going to miss her. 'I know someone knows something and they can help us.'Phoenix police responded to what was described as a 'desert area' near 6500 East Libby Street on April 29 after receiving a report of an injured person.The area is not far from Heike's apartment, which is located in an upscale area of North Phoenix with houses on the market for up to $1.3 million, according to Zillow.Heike's mother gave some insight into what her daughter's last day was like.",
        "'She got up, talked to her friends. It was her day off, she got her coffee, and she went walking and she was happy, happy… that helps us a lot,' Lana said.'We need people's help to tell us what happened after that.'In a press conference Wednesday, Phoenix Homicide Lt. James Hester said investigators believe someone might have seen the suspect before or after the attack and asked the community to come together to help find him.",
        "'We believe someone would have noticed this person either before the attack or after he fled from our scene,' Lt. Hester added.Further details about the murder, including how Heike was killed or if a weapon was used, have not been released as police don't want to harm the investigation.'The behavior, in my opinion, was so heinous that I would imagine that the subject would be displaying symptoms that look out of place,' Lt. Hester added.Loved ones said they just want justice for Heike, who they described as a 'beautiful' person inside and out who loved exercising and being outdoors.",
        "Her mother described her daughter as a beautiful, kindhearted woman who was sweet to everyone she met.'As hard as this is for us, we're grateful because we had such a beautiful child,' she said. 'We will love her every minute that we are on this Earth.'Police have not revealed whether it was a random attack or if it was potentially someone Heike knew. But the Arizona woman, who had moved there from Washington, was described as a kindhearted person who left a lasting impression with everyone she met.Heike's close friend River Hubbell told AZCentral that he spoke to her on Friday morning before her hike and they asked each other what they were thankful for - something he said they did every morning.",
        "'I had asked what we were all thankful for that day and she had specifically just said that she was so thankful to just wake up another day so positive and to be able to go get a coffee and go on a walk,' Hubbell said, as he held back tears.",
        "Heike's boss, Brian Thorne of Troon North Golf Club, where she worked as a server, told local news outlets that their staff is shocked and saddened by her death. He described Heike as a lovely person and said this tragedy has been tough on everyone.Heike had previously worked as an esthetician for Admire Medical Aesthetics in Washington. The company posted a heartfelt tribute on its Facebook page.'It is with a heavy heart that we learned of the passing of Lauren Heike, a former esthetician for Admire Medical Aesthetics. Lauren touched the hearts of many with her kind and sweet nature, and her beloved clients always looked forward to seeing her.'We will always remember the laughter and smiles that Lauren brought to each of us. Her warmth and compassion made her not just a great esthetician, but a wonderful human being. It is a true loss to everyone that she has touched.''Our condolences go out to Lauren's family during this difficult time. We hope that they find some comfort in the knowledge that Lauren's memory will always be cherished by those whose lives she touched.'",
        "Neighbors in the area, and hikers who frequent the trail, said they're now looking over their shoulders.'I just woke up to all the police coming in, and they could actually see all the vehicles in the back, driving around, all the police. I would say the neighborhood is just a little bit somber right now. They're probably a little sketched out, looking over their shoulder. Definitely not something that they saw coming,' one neighbor said.'It's heartbreaking,' hiker Tom Chamberlain told Fox10.'I would not be comfortable if she were hiking alone on this trail now. Before, I thought it was North Scottsdale. It's totally fine.'Some have suggested that warning signs should be posted around the community.'It would be nice. I'm lucky we do this together. If I were to come out here in the morning for a run, it would change my opinion completely about doing this,' Naomi Kight said.",
        "Police have offered advice for hikers and said the safety of the community is their top priority.'The safety of our community is our top priority. We would like to remind everyone to be aware of your surroundings. If a hike or walk is in your plans, do so with a partner. If you see something suspicious call police and be a good witness,' police cautioned.Anyone with information is asked to call Phoenix police. To remain anonymous, you can call Silent Witness at 480-WITNESS (480-948-6377) or 480-TESTIGO (480-837-8446). You can also leave a tip at silentwitness.org.A reward of up to $2,000 was offered for any information related to the case."
    ]
}