{
    "articleURL": "/tvshowbiz/article-12058691/Jameela-Jamil-reveals-called-audition-Netflixs-sex-scenes.html",
    "content": [
        "Jameela Jamil has revealed she was meant to audition for Netflix's You - but ended up dropping out as her character was too 'sexy'.  ",
        "The Good Place actress, 37, was speaking on the Podcrushed Podcast on Thursday with host Penn Badgley, 36, who plays lead character Joe Goldberg in the series. Jameela said that she was meant to audition for series four of the thriller show, where psychopath killer Joe moves to London to start afresh as a professor. You follows Penn's serial killer Joe Goldberg and his obsession with women, and has featured many saucy scenes in seasons past. But Jameela revealed that the idea of the show's sex scenes were actually what put her off joining the show. ",
        "She told Penn: 'I don't do sex scenes. In fact I was supposed to audition for the most recent season of your show and the character was supposed to be quite sexy and I pulled out of the audition because I'm so shy about anything sexy.'In February Penn himself revealed on the same podcast that he had asked for fewer sex scenes in the latest season out of respect for his wife Domino Kirke.  The revelation seemed to imply some regret on Jameela's part for her decision to drop out of the audition. Jameela continued, laughing: 'And then you f***ing came out and was like \"yeah I'm not doing sex scenes anymore and I'm going to protect myself!\"",
        "'F***ing hell, I didn't even know that was a boundary we could draw! That's fantastic. 'But then I was like - I should have gone and done the f***ing show!'Penn suggested she could always join for season five, adding: 'It's not a sex show anymore!' The actress went on to say she winds through sex scenes even when watching them on her own due to her 'shyness' - meaning the thought of acting in one was too much. ",
        "'It's not a shame but I feel like there's an awkwardness around it,' she clarified. Previously, Penn said about his own aversion to the sex scenes: 'This is actually a decision I made before I took the show. I don't think I have ever mentioned it publicly. 'One of the main things was, do I want to put myself back on a career path where I'm always playing the romantic lead?''Fidelity in every relationship, including my marriage, is important to me. It's got to the point where I don't want to do that'.The former Gossip Girl actor went on to say: 'So I said 'my desire would be zero, to go from 100 to zero.''But I signed this contract. I signed up for this show. I know what I did. You can't take this aspect out of the DNA of the concept. So how much less can you make it, was my question to them.",
        "'She didn't even bat an eye. She was really glad that I was that honest. She was sort of almost, I want to say empowered, it had a really positive response. They came back with a phenomenal reduction.'Penn married singer Domino in two separate 2017 ceremonies, which was attended by famous pals Debra Messing, Mariska Hargitay and Zac Posen.",
        "He previously dated Blake Lively and Zoe Kravitz. Domino has a child from a previous relationship. The trailer for season four shows Penn's killer character receive a taste of his own medicine from a  vengeful serial killer as he attempts to keep a low profile under a new identity.After killing ten people over the past three seasons Joe is unable to escape his past once he catches the attention of a murder, who is dubbed the 'Eat the Rich Killer.' Following his move to London, and new life as Professor Jonathan Moore, Joe battles a fresh heartbreak, which he ominously calls the 'catalyst for a new path.' Despite finding fulfillment in his career, Joe admits to wishing he he had 'someone' out there as he stares longingly at a neighbor from his window. As he fights the urge to rebound, Joe ultimately asks why 'the universe' keeps taunting him with beautiful women.But just as he finally feels settled, Joe receives a message from an unknown number, which reads: 'Nice jacket. Brown's your color.' ",
        "'I ran away from this, but one of you is watching me,' he thinks to himself while scrabbling to uncover who is stalking him. 'One of you is hiding in plain sight, so who are' he asks himself. 'I just want my little European holiday back.' "
    ]
}