{
    "articleURL": "/wires/pa/article-12056719/Steve-Cotterill-gutted-Shrewsbury-s-loss-Lincoln.html",
    "content": [
        "An emotional Steve Cotterill revealed his disbelief after 10-man Shrewsbury ended their League One campaign with a 1-0 defeat at Lincoln.",
        "Town dominated for over an hour but saw Luke Leahy and Rob Street hit the woodwork while Chey Dunkley and Jordan Shipley were denied by goalkeeper Carl Rushworth.On-loan City midfielder Matty Virtue rammed home the only goal after 73 minutes, with only their second shot on target.Max Sanders should have doubled the lead at the death but saw his penalty saved by Marko Marosi after Dunkley was sent off for upending Ben House in the box.Cotterill fought back tears as he admitted how disappointed he was to head away from Sincil Bank pointless.He said: “I can’t believe we have been beaten. I thought we were excellent. We were good value for the points, that’s it in a nutshell.",
        "“Their keeper’s made some great saves, we’ve hit the bar twice and I just thought we were the better team by a mile.“It is gut-wrenching because they have put in so much hard work. We wanted to finish in the top 10 and if we had won, which we should have done, it would least have put us up into 11th.“It has, though, been real progression [this season] but it just doesn’t feel like it at the moment. I’m sad, I feel very sad.“I am very proud of them. I am quite emotional – there has been so much adversity that we have had to fight through this season and we fought right up to the last minute.”",
        "Lincoln’s win secured them 11th spot in the table, a position that delighted boss Mark Kennedy, who has just completed his first full season with the Imps.He said: “It is beyond my wildest expectations. I’m not saying my expectations were low, it’s just that there were so many obstacles to overcome, so a huge thank you to the staff, the players, the board and the fans, who have been incredible. I just played a small part.”Kennedy pointed to the introduction of Sanders midway through the second half as the turning point in the match, saying: “Max has been phenomenal this season.“He has been a standout performer which says a lot as he hasn’t played a lot of football and he knows that. He completed changed the dynamics of the game.”On match winner Virtue, he added: “I was quite frustrated with him early on as he was playing far too deep but he was much better in the second half and there was no surprise he got his goal.“He has had an outstanding season and he is someone we are keen to get hold of.”"
    ]
}