{
    "articleURL": "/wires/ap/article-12056059/Lives-immigrants-built-Texas-town-shattered-shooting.html",
    "content": [
        "CLEVELAND, Texas (AP) - Wilson Garcia and his family were among the Latino immigrants who carved out a community inside the thick, piney woods near Cleveland, Texas, through a combination of hard labor, fortitude and love of family, friends and neighbors.",
        "On a 1-acre plot of land bought with a small down payment, Garcia built a home in the Trails End neighborhood that provided nurturing shelter for his family. It was also an inviting space for friends to visit. The lush green space around his home, located about 60 miles (100 kilometers) north of Houston, reminded Garcia of the countryside of his native Honduras.\"Back home in Honduras, he was a country man ... He talked about how beautiful the country is,\" said Johnny Ray Gibbs, who has known Garcia for a decade. \"I asked him, ´How is it up there (in Cleveland)? He said, `Beautiful.´\"That beauty was shattered by gunfire on April 28 when authorities say a neighbor, Francisco Oropeza, responded to a request to stop firing his AR-style rifle late at night by charging into Garcia´s home and killing five people.The shooting victims included Garcia's wife, Sonia Argentina Guzmán; and 9-year-old son, Daniel Enrique Laso; family friends Diana Velásquez Alvarado, 21; Jose Jonathan Cacerez, 18, and Cacerez´s girlfriend, Obdulia Julisa Molina Rivera, 29. All were from Honduras.As the victims were remembered for their efforts to seek better lives in the U.S. or for their bravery in saving children during the shooting, Garcia and his neighbors were uncertain if they and the community they´d worked hard to build would ever recover.",
        "\"I don´t have words to describe what happened. It´s like I am alive but at the same time not. What happened was something horrible, ugly,\" Garcia told reporters following the shooting.Oropeza, 38, was captured after a four-day search and jailed on five murder charges.Weeks before the shooting, Garcia, who works as an electrician, and Guzmán had celebrated the birth of their son. He joined Daniel and a 2½ year old sister in their burgeoning family. Also living in the home was Wilson Garcia's brother-in-law, Ramiro Guzmán, and his wife and 6-month-old son.The others in the home during the shooting were extended family and friends who would often stay on weekends, Garcia said.Shawn Crawford, 52, who lives two houses down, said Garcia and his family \"were just good people.\" Crawford and her grandchildren had attended kids birthday parties and cookouts at Garcia´s home.Guzmán´s brother, Germán Guzmán, 28, said his sister came to the U.S. nine years ago so she could help her family.\"Here in Honduras, there´s no work,\" he told The Associated Press from the central Honduras town of La Misión.Crawford said when Guzmán was pregnant last year, Garcia went to Crawford´s home and asked if he could buy a pink flower growing from her Yucca plant, saying it was \"good for the unborn baby.\" Crawford told him to take one anytime he saw it bloom.",
        "\"That´s the neighborhood we were ... Everybody just helped each other,\" Crawford said.That help among neighbors was valuable because Trails End was not always an easy place to live.Residents have been forced to collect money to fix the potholes that riddle the streets because they´re considered private roads and not under the county´s jurisdiction.The killings highlighted the ongoing problem of residents firing their weapons for fun and slow law enforcement response times to such incidents. Garcia had asked Oropeza if he could fire his weapon farther away because Garcia´s 1½ month old son was trying to sleep.Dale Tiller, who has lived in the neighborhood for 13 years, said despite these difficult circumstances, people live there because of the \"pride in wanting to be a homeowner and live a better life.\"Just a week before the shooting, Garcia had finished converting a carport into another room for his home of three years. The building supplies he had used were still in his front yard days after the shooting.\"Besides the issues we do have, there are really good people here,\" Tiller said.Idalmy Hernandez, 45, said she and the other immigrants in Trails End have fought for the dream of home ownership. When she spoke to Garcia after the shooting, he told her he felt his dream had ended.",
        "\"He is very sad,\" said Hernandez, who is from Honduras.At a vigil in front of Garcia´s home, 10-year-old Guillermo Tobon recalled how he would often play soccer with Garcia´s son, Daniel, as they waited for the morning school bus. Soccer was Daniel´s favorite sport. The last time they played was a day before his death.\"We played about 30 minutes until the bus arrived,\" Tobon said.Among the flowers and stuffed animals placed at a memorial in front of Garcia´s home was a letter addressed to Daniel: \"You were the best friend ever. You were so good at golie in soccer. You were the best teamate. You will always be in our hearts.\"\"It´s very hard because nothing like this has ever happened,\" said Manuela Lara, who would often see Garcia and his family at the neighborhood Mexican food stand that Lara owns.Velásquez Alvarado´s father, Osmán Velásquez, said his daughter had traveled to the United States eight years ago without documents but had recently received U.S. residency status.Jeffrison Rivera, Velásquez Alvarado´s husband, said in a video posted on immigration activist Carlos Eduardo Espina´s Facebook page that Jonathan Cacerez was his nephew and had been like a father to Molina Rivera´s two children. Rivera said Molina Rivera had only arrived in the last year.",
        "Rivera said his two sons - one 9 months old and the other 6 years old - were among the five children that Velásquez Alvarado and Molina Rivera protected in a closet by hiding them under a pile of clothes.Oropeza \"took my heart. He left my two kids with no mother,\" Rivera said.While the remains of four of the victims will be repatriated to Honduras, Velásquez Alvarado will be buried in the U.S.Crawford said she thinks the shooting along with comments from Texas Gov. Greg Abbott, in which he described the five victims as \"illegal immigrants,\" have residents in her neighborhood scared. She´s not sure if things will go back to normal, when neighbors were outside barbecuing, walking around with their families.\"I hope it does because that was the nice part of the neighborhood,\" Crawford said.___Associated Press reporter Marlon González in Tegucigalpa, Honduras, contributed to this report.___Follow Juan A. Lozano on Twitter: https://twitter.com/juanlozano70"
    ]
}