{
    "articleURL": "/money/bills/article-12041199/Why-pay-standing-charges-gas-electricity.html",
    "content": [
        "Can utility providers give a clear and sensible explanation for the rip-off known as standing charges?",
        "Having just received my combination gas and electricity bill, I find the standing charges amount to just over £76 for the quarter.This equates to more than £300 a year added to the accounts of struggling bill payers. Whatever I do to save money by cutting my energy use, these daily charges are going to eat into whatever I have saved.While I appreciate that providers have to maintain networks and infrastructure, why are there such high charges regardless of your circumstances or usage?",
        "The wholesale price of gas and, therefore, of electricity, is coming down. Why can't these iniquitous fees be based on a percentage of a customer's actual usage?Even better, reduce dividends paid to shareholders and pass the savings to customers. Helen Kirrane of This Is Money replies: At a time when many people are trying to cut their energy use to keep soaring energy bills down, it can be frustrating that they still have to pay a flat rate standing charge.Standing charges make up one part of an energy bill.Not only do standing charges have to be paid regardless of whether you use any energy, they have also gone up to 50p a day for electricity and 28p a day for gas.So why do these standing charges exist, and where does all that money go? We put this to some experts. ",
        "Natalie Mathie, energy expert at Uswitch, said: 'Standing charges were introduced as a way of ensuring all energy tariffs follow the same pricing structure — making it easier for consumers to compare deals across the market.'A standardised standing charge means that all households contribute equally to the cost of having gas and electricity supplied to their home, the upkeep of the grid, and other associated costs.'But the rising cost of standing charges has left many households baffled. It is possible to save money on the unit rate - the energy we use - but not on the daily standing charges.But there is a good reason for standing charges, according to Alex Hasty, director at insurance comparison website Compare the Market.Hasty said: 'The charge factors in the complexity of infrastructure needed to get power to your area and local population needs.'Laura Woolsey, lead analyst at Cornwall Insight, said that standing charges are unavoidable costs associated with being connected to the energy grid.'Networks need to be maintained regardless of usage, meter reading and maintenance must also take place regardless of usage,' she said.'The same is also true of things like supplier of last resort charges, as again the total costs that need recovering cannot be reduced by lowering usage,' she continued. ",
        "In other words, that means standing charges are here to stay. Otherwise, energy providers risk not being able to stump up cash for upgrade works, for example if national energy use were to drop. How much are standing charges adding onto bills? The daily standing charge depends on your energy supplier and where you live. Over the course of a year, it can add up to quite a large amount.Regulator Ofgem sets an energy price cap. This limits the unit rate and standing charge a supplier can charge if you are on a default tariff, including standard variable tariffs, or if you have a prepayment meter. Between April and June 2023, average standing charges for customers on default tariffs were capped at 50.4p per day for electricity and 27.7p per day for gas.This works out at around £285 a year for average use - 10 per cent of a typical energy bill.Why have standing charges gone up? Woolsey explained: 'Standing charges have increased for a variety of reasons in the last few years.'Part of this is to do with the energy crisis, notably with respect to the supplier of last resort payments.",
        "The supplier of last resort procedure was set up to ensure that if your electricity or gas supplier ceases trading for any reason you are guaranteed that your lights stay on, gas keeps flowing and you are protected. These costs are passed on to customers through standing charges.  ",
        "'As we've seen lots of supplier failures in the last couple of years, supplier of last resort payments have been notably high in the years 2022-23 and 2023-24' she adds. Where is the money you're paying in standing charges going?Alex Hasty compares standing fees to a line rental, but for your energy use rather than your phone.The standing charge covers several different costs for an energy firm, bundled up into one package. This could include service administration fees, meter reading visits, connecting houses to the energy network and maintenance.Government schemes to help cut carbon emissions and fuel poverty, and the cost of energy suppliers exiting the market, are also covered by standing fees, says Mathie. They are also used to recover pass-through costs, such as supplier of last resort payments and bad debt costs, according to Woolsey.Residual network charges are also included, which recover costs like installing pylons and cables.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}