{
    "articleURL": "/wires/reuters/article-12045171/As-sales-decline-Adidas-faces-pressure-Yeezy-fix.html",
    "content": [
        "Adidas could donate Yeezy shoe proceeds to charity",
        "Anti-Defamation League \"ready to work with Adidas\"Analysts expect Q1 sales to fall 4%By Helen ReidLONDON, May 4 (Reuters) - Adidas is set to update investors on Friday about the unsold Yeezy shoes that have put the German sportswear giant in a predicament since it cut ties with Kanye West over his anti-Semitic comments late last year.Executives are expected to tackle the issue when the company reports first-quarter results on May 5 which will likely show a 4% decline in net sales to $5.07 billion, according to a company-compiled consensus.Investors have high hopes new CEO Bjorn Gulden can turn Adidas around: the stock has gained around 65% since Nov. 4 when the former Puma CEO was first floated as a successor to Kasper Rorsted, despite Adidas warning it could make a $700 million loss this year if it writes the Yeezy shoes off entirely.Adidas has been in discussions over the footwear, including with people who \"have been hurt\" by West's antisemitic comments, Gulden said in March, but there are no easy fixes.The value of Yeezy shoes in the resale market has rocketed since Adidas stopped producing them, with some models more than doubling in price, but the company has yet to decide what to do with its unsold stock.",
        "If Adidas decides to sell the shoes, any proceeds should go towards efforts to fight antisemitism, said Holly Huffnagle, U.S. Director for Combating Antisemitism at the American Jewish Committee, a non-governmental organisation.\"The challenge is if these shoes are going to be out there and be worn by people, we must ensure that the antisemitic messaging of the shoes' creator doesn't spread,\" she said.Gulden in March said the company could donate the proceeds of the Yeezy sale to charities, but Adidas has given no updates since. \"We continue to evaluate options for the use of the existing Yeezy inventory,\" an Adidas spokesperson said, declining to comment on the possible timeline for a decision.The market would welcome a resolution, but it may be too early given the complexities involved, said Geoff Lowery, analyst at Redburn in London, who sees a donation to charities as the most likely outcome.The Anti-Defamation League, an international Jewish non-governmental organisation based in New York, told Reuters it \"stands ready and prepared to work with Adidas\". Adidas in November donated more than $1 million to the organisation.The American Jewish Committee met with Adidas executives in December to discuss their commitment to reject antisemitism.Adidas said it continues to \"stand with the Jewish community in the fight against antisemitism and with all communities around the world facing injustice and discrimination\".",
        "Shareholders want Adidas to draw a line under the Yeezy episode and develop ways to reboot the brand.\"Being successful with Yeezy probably made Adidas lazy on finding other growth drivers,\" said Cedric Rossi, nextgen consumer analyst at Bryan Garnier in Paris. (Reporting by Helen Reid; Editing by Matt Scuffham and Jan Harvey)"
    ]
}