{
    "articleURL": "/wires/aap/article-12057905/Victoria-launch-digital-drivers-licences-2024.html",
    "content": [
        "Victorians will be able to drive with a digital licence as part of a regional trial before a statewide rollout of the technology.",
        "All drivers will be able to carry a digital version of their licence on their smartphone by 2024, the Victorian government has confirmed.A six-month trial of the technology will begin in Ballarat for full licence holders in July before it is rolled out across the state.Drivers will still have the option to use their physical licence.The digital licence will be available through the Service Victoria app and will reflect in real-time whether it has been revoked or suspended.It can still be used as proof of identity as police, businesses and other authorities will be able to verify its authenticity through a timed QR code.Users will have the option to only show certain personal information for privacy reasons.Government Services Minister Danny Pearson said if someone entering a licence venue didn't want to share their address with a bouncer then they'd be able to simply show evidence they were over 18.He said police would also be able to access a person's driving history if they were pulled over.\"We want to give consumers the choice to be able to decide how they control their data, how they use the data and what they're prepared to show or not show,\" Mr Pearson told reporters.Deputy Liberal Leader David Southwick said Victorians had already waited too long to access digital licences and called for everyone to be able to access them immediately.",
        "\"We don't need any more trials with this,\" Mr Southwick told reporters.\"We have the ability, we have the capability and I would say to the Andrews government now let's get on with it.\"South Australia launched digital driver's licences in late 2017, with NSW following suit in October 2019.Queensland is also preparing a second trial of its digital licence app before making it available statewide later this year."
    ]
}