{
    "articleURL": "/wires/ap/article-12047927/Sons-El-Chapo-deny-US-fentanyl-indictment-allegations.html",
    "content": [
        "MEXICO CITY (AP) - Sons of former Sinaloa cartel leader Joaquín \"El Chapo\" Guzmán have denied accusations made by U.S. prosecutors last month, saying in a letter that they have no involvement in the production and trafficking of the potent synthetic opioid fentanyl.",
        "The letter was provided to The Associated Press by José Refugio Rodríguez, a lawyer for the Guzmán family. Despite not being signed, Rodríguez said he could confirm that the letter was from Guzmán´s sons.The Mexican government did not explicitly confirm the letter´s authenticity, but President Andrés Manuel López Obrador said Thursday it had been analyzed by the country´s security council.The sons of Guzmán said \"we have never produced, manufactured or commercialized fentanyl nor any of its derivatives,\" the letter said. \"We are victims of persecution and have been made into scapegoats.\"Milenio Television first reported the letter Wednesday.U.S. prosecutors detailed in court documents last month how the Sinaloa cartel had become the largest exporter of fentanyl to the United States, resulting in tens of thousands of overdose deaths. Guzmán is serving a life sentence in the United States for drug trafficking.",
        "Guzmán's sons are known collectively as the \"Chapitos\". Iván Archivaldo Guzmán Salazar and Jesús Alfredo Guzmán Salazar are the lead defendants among 23 associates charged in a New York indictment. Ovidio Guzmán López, alias \"the Mouse,\" who allegedly pushed the cartel into fentanyl, is charged in another indictment in the same district. Mexico arrested him in January and the U.S. government has requested extradition. Joaquín Guzmán López is charged in the Northern District of Illinois.",
        "U.S. prosecutors say the \"Chapitos\" have tried to concentrate power through violence, including torturing Mexican federal agents and feeding rivals to their pet tigers.The sons deny that too, saying they are not the leaders of the Sinaloa cartel and do not even have tigers. They describe a loose federation of independent drug producers and manufacturers in the state of Sinaloa, many of whom appropriate their name for their own advantage.Mexico arrested Ovidio Guzmán in January and has seized some fentanyl laboratories, but López Obrador has repeatedly denied that Mexico produces the drug and accused U.S. authorities of spying and espionage after the indictments were unsealed."
    ]
}