{
    "articleURL": "/wires/ap/article-12043193/Hawaii-lawmakers-fail-pass-annual-park-fee-tourists.html",
    "content": [
        "HONOLULU (AP) - Hawaii lawmakers failed to pass a bill that would have made tourists help pay for the protection of the state's forests and wildlife even though the idea has widespread public and political support.",
        "Lawmakers in the Democratic-controlled House and Senate did not resolve their differences over the measure's details in time for a deadline at the end of this year's legislative session, which concludes Thursday.The measure would have required tourists to pay for a yearlong license or pass to visit state parks and trails. Revenue would have paid for the maintenance and protection of parks, coral reefs, forests and wildlife such as dolphins.About 10 million visitors come to Hawaii each year, while the state´s population numbers just 1.5 million. Many travelers like to hike in the state´s forests, snorkel over its coral reefs and view wildlife, all of which stress the environment.A bill that passed in the Senate would have set the license fee for tourists at $50, but the House deleted the dollar amount. During the past week, lawmakers discussed appropriating $360,000 for five full-time state employees to implement the plan but failed to reach a final agreement.Testimony overwhelmingly favored a bill. The governor and House and Senate leaders backed the concept. A 2022 public opinion survey conducted by the Hawaii Tourism Authority showed broad support for charging visitors to access state parks and trails.",
        "Democratic state Sen. Chris Lee said the bulk of the discussion at the Legislature had to do with how to have visitors pay for upkeep, improvements and protection of parks and natural resources but not whether to do so.",
        "\"I don´t think the bill failed to pass on the merits of the legislation and of the idea that we ought to be leveraging visitors to pay for these things,\" Lee said. \"I think it was more the question of how and when.\"He expects the bill to come up for consideration again next year and for lawmakers to come together to pass it. He said there's an appetite for steps that will reduce the effects of tourism on the environment and cut costs for residents.A spokesperson for Democratic Gov. Josh Green said his administration views the bill's failure as an opportunity to have a more comprehensive discussion on managing tourism.\"With all the feedback we´ve received from this year´s legislation, we are optimistic that we can develop a detailed bill for the next session that will ensure a more sustainable future for our keiki,\" said Makana McClellan, using the Hawaiian word for children.Carissa Cabrera, project manager for the Hawaii Green Fee, a coalition of nonprofit groups supporting a fee, said the bill got farther this session than previous iterations have in the past and had more support than ever before.\"Just because the bill has died, the idea is not dead,\" she said."
    ]
}