{
    "articleURL": "/tvshowbiz/article-12043765/Christine-McGuinness-showcases-incredible-figure-black-swimsuit.html",
    "content": [
        "Christine McGuinness set pulses racing as she showcased her incredible figure in a sizzling swimsuit snap she shared on Wednesday.",
        "The model, 35, displayed her sun-kissed tan as she relaxed on a balcony during an idyllic sun-soaked getaway.The Real Housewives of Cheshire star slipped into a black one piece with a strap detail along the sides.Christine also sported a pair of sunglasses and let her blonde locks fall loose down her shoulders.  The star recently referenced her split from husband Paddy McGuinness in a social media post about 'starting over' on Tuesday.",
        "Christine and her TV star ex, 49, who share three children together, announced that they were separating after 11 years of marriage last July.Seemingly reflecting on their separation, Christine admitted she now feels 'happy and free' in an Instagram Story shared while away on an exotic getaway.Looking out to sea from her balcony in a new snap, Christine wore a pink bikini and a white linen shirt with a pair of slip on shoes.Alongside the image, she wrote: '35 feeling so alive, happy and free just doing me. It's never too late to start over, change your plans, reinvent yourself as many times as you need too. Make this next chapter abut YOU.'Paddy and Christine took to Instagram to confirm their separation last year, revealing they would continue living together for the sake of their three autistic children. ",
        "She recently broke down in tears as she discussed her and ex-husband Paddy's split, saying she finds it 'petrifying' to start a 'new chapter' on her own.The former couple are parents to twins Penelope and Leo, nine, and Felicity, six, who all have autism.The model and TV star, 34, said during her new BBC documentary, Unmasking My Autism that she was able to leave her marriage following her diagnosis.She said she had previously stayed in the marriage because it felt 'safe' at the time and she 'doesn't like change', but they remain on amicable terms after deciding they were better off alone.",
        "Christine said: 'Starting life on my own is scary, I struggle making decisions. I was only 19 when I met Patrick and for the last 15 years my role has been wife and mum. When I was diagnosed, I set out on a journey to find out who I was.'I have separated from my husband in the process, I'm shedding my old identity and finding out who I am.'She continued: 'I've only ever had this one man in my life, I don't know what it is like to date, I can't imagine being single or with another man. But I'm going into a new chapter on my own which is petrifying for someone who doesn't like change.'",
        "Christine has recently been sharing updates from her current getaway, including snaps where she showcased her toned back as she watched the sunset during her idyllic getaway on Tuesday.She slipped into a black halter neck dress for the Instagram snaps, which perfectly highlighted her slim figure and bronzed tan.Christine was sure to set pulses racing as she showed off a hint of side-boob after going braless beneath the slinky summer dress. In another shot, Christine turned to the camera and beamed away while sitting on a sun bed.The beauty looked radiant as she basked in the sunshine while taking in the stunning view.",
        "She tied her blonde locks into a ponytail for the day, while highlighting her features with a sleek make-up palette. Captioning her snaps, Christine shared a thoughtful quote which read; 'We all have two lives, the second starts when we realise we only have one.'It is unclear who the TV personality is holidaying with, but she was recently pictured putting on a cosy display with her pal Chelcee Grimes.The close friends couldn't hide their excitement as they met up in Liverpool during the Bank Holiday weekend.Christine and Chelcee, who were spotted kissing and walking hand in hand at a night out together in London in December, met up at Ten Streets Socials bank holiday club event and filmed the female dancers there.",
        "The duo, who have been pictured publicly on a number of occasions following Christina's split from husband Paddy, were thrilled to see one another and embraced each other at the event."
    ]
}