{
    "articleURL": "/femail/relationships/article-12042431/How-know-date-according-relationship-expert.html",
    "content": [
        "Relationship coach Tina Wilson revealed how to tell if your date is the real deal READ MORE: Why being a workaholic is the death knell for marriage! Ever struggled to decide whether a potential admirer is truly into you? Well, a dating expert has revealed their ultimate guide to help you figure it out.",
        "British relationship coach Tina Wilson exclusively told FEMAIL how you can tell if someone is into you by reading their facial expressions and taking hints from their reactions.Explaining the benefits to this, the expert said observing your date in this way will perhaps save you heartache down the line if you discover they are lying or not genuine before agreeing to further meet-ups. So, how do you tell if your date is the real deal? Tina has shared what the six most common facial expressions and reactions really mean. These include the positive signs to look out for - meaning your date is really into you - and the negative ones, suggesting they may not be as keen as they claim.  ",
        "POSITIVE SIGNS1. MIRRORING Tina said: 'If they mirror you in either a subtle or obvious manner it's their way of saying they like you, even on a subconscious level. They want to be on your level and in my opinion mirroring is the biggest giveaway that your date is into you.'Mirroring will also make you feel comfortable in their company and it conveys a sort of attentive nature. 'Clues to look out for can be verbal and non-verbal, such as, they will change their facial expression when you do so they match your thoughts/feelings in that moment.",
        "'Also, deliberately using the same words as you is another clear sign they are into you. They want to show they have a lot in common.'Meanwhile she also revealed that a person fiddling with their hair or touching their face could be a positive sign.'If your date is conscious of their appearance when they are with you it shows they want to look their best because they are in your company,' said the expert.'Ultimately this behaviour signifies they are out to impress. Some strong hints include messing with their hair to ensure it is in place or often checking their appearance when they get chance. 'Studies have also shown that people preen more when they meet someone they really like and see a future with (it shows they are looking to settle down) – you heard it here first! 'Fiddling with hair or touching their face also hints they are slightly nervous and want to make a good impression.'2. RAPID EYE BLINKINGTina explained: 'Eyes can give you useful insights into what your date is thinking and rapid eye blinking or constant motions, as well as tons of mutual eye contact shows there is a spark.'It all comes down to love hormones that are surging in the brain and shows they find you desirable. ",
        "'Also look to see if their pupils are dilated, which is another sure fire sign they like you.'NEGATIVE SIGNS3. KEEPING THEIR EYES OPEN A LOT'Pay attention though, as the eyes are not all positive signs,' warned Tina. 'Unfortunately if your date keeps their eyes open then the hidden meaning behind it indicates they are a liar. 'Why? Well your date is trying to prove they are honest and trustworthy by deliberately using their eyes to feel connected to you. 'This also indicates your date is consciously trying to stay focused and concentrate on your conversation as they know they are not genuine, potentially doing so in a calculated way, to appear interested in you, when in fact their could be an ulterior motive – so watch out.'4. RUBBING THEIR NOSE 'When deep in conversation with your date if you notice they keep quickly touching or swiftly rubbing their nose, it’s a red flag,' claimed the relationship expert.'The indication here is they are hiding something. Part of the reason is nerves as they feel conscious their lies may be exposed, which is why they try and keep their hands busy. 'It is also a sign they are uncomfortable and irritated in some way, perhaps as they try and weave around a subject they are not being fully truthful of. ",
        "'A more obvious sign would be to fold your arms as it’s a sign of blocking the other person.'5. RAISING THEIR EYEBROWS 'Eyebrows can tell you a lot about a persons underlining feelings or beliefs,' explained the dating coach. 'It is hard to cover up their internal views because they will automatically reveal themselves. It’s easy enough to spot if something is amiss on your date. It is a good test to judge whether you are compatible or not. 'Watch out for raised eyebrows that express surprise, disbelief or suggest they do not approve or do so in a passive aggressive manner when they don’t agree with you on something.'"
    ]
}