{
    "articleURL": "/wires/afp/article-12038547/New-York-exhibit-reinterprets-Latin-Americas-colonial-history.html",
    "content": [
        "A new exhibition at New York's Museum of Modern Art (MoMA) offers a retelling of the European colonization of Latin America through the eyes of contemporary artists.",
        "The 65 works by 40 artists of different styles take a \"critical\" look at the colonial history of the region as told by cartographers, missionaries, scientists and adventurers.The exhibition, which is entitled \"Chosen Memories,\" includes paintings, photographs and sculptures, and offers a \"revitalization\" of Latin America's cultural heritage, according to MoMA.The artists delved into the past \"as a means to repair histories of dispossession, reconnect with undervalued cultural legacies, and strengthen threads of kinship and belonging,\" curator Ines Katzenstein said in a statement.\"Works in the exhibition take a critical look at the impact of colonialism on the landscape,\" she added to AFP.With \"Looting,\" Guatemalan Regina Jose Galindo uses gold inlays taken from her teeth as a metaphor for the violence over raw material extraction that plagues some communities.Dominican Firelei Baez juxtaposes a European map from the 1540s with a mythical female creature to embody \"the fears and desires of European conquerors\" to unknown cultures.",
        "Argentine artist Leandro Katz used the first lithographs made in the 1830s by explorers John Lloyd Stephens and Frederick Catherwood to reconstruct their expeditions.Elsewhere, Chileans Pedro Mardones Lemebel and Francisco Casas present their photographic version of Mexican painter Frida Kahlo's 1939 oil painting \"The Two Fridas.\"Many of the works on display come from the collection of Venezuelan art collector Patricia Phelps de Cisneros, who has donated some 250 works to MoMA over the past quarter century.",
        "The exhibition runs until September 9.MoMa has more than 5,000 works of modern and contemporary art from Latin America."
    ]
}