{
    "articleURL": "/wires/pa/article-12042139/Animal-welfare-charity-takes-Government-court-Frankenchickens.html",
    "content": [
        "An animal welfare charity has taken the Government to court in an effort to end the practice of breeding “Frankenchickens”.",
        "Up to 90% of chickens sold in the UK are reared through intensive selective breeding to favour faster-growing poultry that can be brought to market sooner.Over one billion chickens a year are bred and slaughtered in this way and they can reach a weight of 2.2kg in 35 days – 12 weeks faster than 50 years ago – while many are kept in unsanitary conditions. We call them Frankenchickens because they're so unnatural. They have suffering hard-coded into their DNA  Sean Gifford, The Humane League  Their rapid growth, with energy directed towards the muscles, can cause severe health problems for the birds such as leg deformities, organ failure and ascites – also known as water belly – where fluid leaks from the liver into the abdomen causing chronic pain and heart attacks.Many birds also spend up to 70% of their life sitting, which causes lesions on the feet and other body parts that are consistently pressed against the floor. Lame birds can spend up to 86% of their life sitting.The Humane League, which has brought the case to the High Court, says the Government has misinterpreted the law in allowing farmers to breed fast-growing chickens and that any adjustment to the birds’ environment would not improve their welfare sufficiently as the health problems come from their genes.",
        "The Department for Environment, Food and Rural Affairs (Defra) says it does not have to set laws on keeping particular breeds and that responsibility lies instead with farmers.Also involved is the RSPCA which has said that fast-growing breeds cannot be kept without detriment to their welfare. All farm animals are protected by robust animal health and welfare legislation. This sets out detailed requirements on how farmed livestock, including meat chickens, must be kept  Defra spokesperson  Sean Gifford, managing director of The Humane League, said: “We call them Frankenchickens because they’re so unnatural. They have suffering hard-coded into their DNA.“They grow four times quicker than they normally would and their bodies collapse from the weight.“Up to 30% of these chickens on farms are suffering from chronic pain or leg deformities, they collapse on the floor of the sheds and have open wounds on their stomachs and legs from living in their own faeces and urine. It’s cruelty to animals, plain and simple.”Edward Brown KC, representing The Humane League, said the charities and the Government disagreed on the interpretation of animal welfare law, specifically one paragraph.It reads: “Animals may only be kept for farming purposes if it can reasonably be expected, on the basis of their genotype or phenotype, that they can be kept without any detrimental effect on their health or welfare.”",
        "Mr Brown said: “There does appear to be a legal uncertainty, possibly a legal no-man’s-land, and the consequences of that is that the policies, practices and enforcement approach of the secretary of state are all based on an anterior legal error as to what the legal obligations are.”Defra argues that fast-growing chicken breeds are not inherently condemned to suffer health problems and that there is no scientific consensus saying so.A spokesperson said: “We are proud to have some of the highest animal welfare standards in the world.“All farm animals are protected by robust animal health and welfare legislation. This sets out detailed requirements on how farmed livestock, including meat chickens, must be kept.“It is also an offence to cause any captive animal unnecessary suffering.” A lot of these industries are not driven by simply feeding people and making a bit of a profit on top. It's making maximum profit, and I can't really think of another word but greed  Benjamin Zephaniah  Outside court, a crowd of animal welfare supporters gathered chanting “justice for chickens” and holding banners.Among them was poet and lifelong vegan Benjamin Zephaniah who said: “I don’t believe in eating animals, but if you are going to, at least let the animal live a life.",
        "“No animal deserves to be bred in a way that gives them muscle pain, joint pain, leg pain, just so they grow 400% bigger over a certain period of time.“A lot of these industries are not driven by simply feeding people and making a bit of a profit on top. It’s making maximum profit, and I can’t really think of another word but greed.“It’s not rocket science. There’s another way, we can treat animals better. You can have better quality meat without all the cruelty.“We should strive to do the least harm and the most good. It really is as simple as that.”"
    ]
}