{
    "articleURL": "/tvshowbiz/article-12058981/Jock-Zonfrillo-says-food-saved-life-one-final-heartbreaking-interviews.html",
    "content": [
        "Jock Zonfrillo shared how food saved him from the streets and revealed he believed there is life after death in one of his final interviews.",
        "The late MasterChef star, who died last week at age 46, sat down for a moving episode of the WILOSOPHY podcast with Wil Anderson at the end of 2021. In a wide ranging interview, he described how his addiction to heroin would have ended his life had he not become a chef.  'Having this obsession with food, food definitely saved my life,' Zonfrillo admitted. 'Imagine for a second I hadn't found kitchens and become a chef, I would have been kicking around the streets, maybe working in the fishing industry, or had a job in a factory. I would have been f***ing dead, or behind bars, no question.' ",
        "He added: 'I would have just gone full excess until someone jailed me or I died. And that happened to a lot of my mates.'For me finding food meant that I was constantly trying to excel, constantly trying to be better. That kept me just on the edge of not falling into jail or anything else.'In one eerie moment, Wil asked Jock what he thinks happens after we die. 'I have seen a lot of ghosts, so I don't know what it is, I think there is something after we die,' the chef said. 'I don't know if it is this f***ing holding room, but I have seen enough weird s**t to know there is something.",
        "'I don't know what it is, but I reckon there is something after we die, without question.'The chef died at age 46, and is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.   Officers who attended Zagame's House at Carlton at about 2am on April 30 found Zonfrillo dead in his bed and saw no signs of anything suspicious or unusual.There was no drug paraphernalia located, no one else in the hotel room and police formed the view the father-of-four had died of natural causes.Zonfrillo was set to star in the latest season of Australia's MasterChef, which had been scheduled to start on the day he was found unresponsive. "
    ]
}