{
    "articleURL": "/femail/article-12045875/King-Charless-goddaughter-suggests-no-hard-feelings-coronation-snub.html",
    "content": [
        "The British designer has been speaking outside Buckingham PalaceREAD MORE: Keeper of Queen’s secrets SNUBBED from Coronation: Lady Pamela Hicks cemented her place in Her Majesty's inner circle as bridesmaid and lady-in-waiting before assassination of her father that rocked royals King Charles's goddaughter has praised her 'considerate' and 'patient' godfather on the eve of his coronation – despite not receiving an invitation.",
        "India Hicks posted photos on her Instagram story showing herself outside Buckingham Palace and she also appeared on Australian TV to discuss all things royal ahead of the ceremony in Westminster Abbey on Saturday.The designer, whose mother is Lady Pamela Hicks, tagged The Prince's Trust, the charity her godfather founded, in a video of herself speaking, with the words: 'Inclusivity, equality, diversity'.The 55-year-old's visit to the UK comes after she posted a photo of herself on Instagram with a caption praising King Charles's invitations to the coronation which are based on 'meritocracy' as she failed to make the list.It recently emerged that her mother, who was the late Queen's bridesmaid at her wedding to Prince Philip in 1947, was also snubbed.",
        "India, who spends much of her time in Barbados, donned a chic cream dress and a matching tweed jacket from Nina Morris as she chatted to the channel about preparations in place for the coronation weekend.On her jacket, she wore a gold brooch with a diamond, which she revealed belonged to her mother. She also posted a video of horses and a carriage travelling through a street in Westminster and joked: 'The traffic's been interesting.'Later, India also sat down with a Canadian interviewer.In a post on her Instagram grid, she added: 'Talking on telly today about The Prince's Trust, the remarkable man behind it, and a very considerate, very patient godfather (with an annoying five-year-old India).'",
        "India's busy day comes after she posted a photo of herself on Instagram with a long caption discussing the commentary over Charles's invitation list. She wrote: 'There has been so much heated discussion about who has, or has not, been invited to this Coronation, why? Surely it’s exciting to see so many invitations based on meritocracy?'Does it not show we have a King who understands both tradition and what it takes to evolve with the times? 'Although this should come as no surprise from a man who upon completing his duty in the Royal Navy, used his severance pay to fund a community of initiatives, which were the founding projects of The Prince’s Trust.'The Prince's Trust has always focused on equality, diversity and inclusion and isn’t that what we are seeing with a guest list mainly awarded on effort, not rank?'India is an ambassador for the charity's Women Supporting Women project and last year raised money for the initiative with a sponsored cycle.Shortly after the death of Queen Elizabeth, when King Charles ascended the throne, she undertook the ride from Buckingham Palace to Windsor Castle.Posting on Instagram, she wrote: 'Tomorrow I am biking from Buckingham Place to Windsor Castle, along with several thousand other people, in the hopes of raising awareness and funds to help transform the lives of youngsters who are facing a frankly s***** future.",
        "'King Charles (still feels strange saying that) set up the charity in 1976 with a few thousand pounds of his severance pay from the Navy, to tackle high youth unemployment which he feared would leave young people marginalised.'"
    ]
}