{
    "articleURL": "/sport/football/article-12043547/CHRIS-SUTTON-six-defeats-Chelsea-stuck-Frank-L-L-L-L-L-Lampard.html",
    "content": [
        "Chelsea are collecting only ‘L’s under caretaker boss Frank LampardThey were pitiful in their defeat by Arsenal despite a star-studded line-up It's been a disaster but Lampard is in too deep to leave with five games to goChelsea hoped they were getting ‘Super Frank’, a romantic homecoming to rejuvenate the club. Six defeats later, they are stuck with ‘Frank L-L-L-L-L-Lampard’. ",
        "Chelsea are collecting only ‘L’s — losses — under their caretaker manager, the latest coming in a pitiful 3-1 defeat at Arsenal. It was enough to make you wonder what they do in training during the week.This was a Chelsea team who included World Cup winners and runners-up, a Premier League Golden Boot winner, Champions League winners, Europa League winners and millions upon millions of pounds’ worth of talent.Yet there was no plan, no pattern to their play, no hope in hell of getting up the pitch. Excluding kick-offs, Pierre-Emerick Aubameyang touched the ball five times for Chelsea. Even Arsenal’s Rob Holding managed six touches and he only came on in the 85th minute.‘Passive’ was the word Lampard used in his post-match interviews. The players have to take responsibility for these pathetic performances, but so too does the manager for the identity crisis this has turned into. I liked Cesc Fabregas’s take on this car crash.",
        "He said: ‘When I was little, I had a coach with 11 olives and he would throw them on the table with no tactics. This is how I see Chelsea.’What started as a supposed ‘free hit’ has turned into a reputation killer for Lampard and after this it is difficult to see how he gets another job in the Premier League.",
        "I don’t blame him for going back to Chelsea. Though it might seem strange for a young coach to agree to act as a gap-filler, I understand why he took it on.He loves the club. He thought he could get a tune out of this talented squad. He hoped it could help him after what happened at Everton. Instead it has been a disaster, as damaging as the appointments of Cristian Stellini at Tottenham and Nathan Jones at Southampton.It has hurt Lampard, but he’s in too deep to leave now. It cannot get worse than losing six on the spin at Chelsea. He needs to stay, if only in the hope that he gets results in the run-in against Bournemouth, Nottingham Forest, Manchester City, United and Newcastle.It is not beyond the realm of possibility that five more defeats will follow to confirm this as the worst interim spell of the modern era.This has turned into a totally regretable situation — for Lampard, for Todd Boehly and for everyone involved at Chelsea."
    ]
}