{
    "articleURL": "/wires/pa/article-12047153/Comedian-Bobby-Davro-s-fiancee-Vicky-Wright-dies-cancer-diagnosis.html",
    "content": [
        "Vicky Wright, who was the fiancee of comedian Bobby Davro and daughter of footballer Billy Wright, has died aged 63.",
        "Her “incredibly devastating” death on Wednesday was announced by her daughter, Kelly.Davro, 64, had revealed his partner’s pancreatic cancer diagnosis to the Daily Star Sunday newspaper in April.His agent confirmed to the PA news agency that she died in St Peter’s Hospital in Chertsey, Surrey, on Wednesday morning, surrounded by her family, including Kelly and Davro.Through Wright’s Twitter account, Kelly wrote: “Hello everyone… Some incredibly devastating news to share…“My wonderful mum Vicky has sadly passed away this morning. I wanted to use this platform to let you all know, as I know how much she valued all your love and support in so many ways.”",
        "Wright’s father was former Wolverhampton Wanderers star Billy, who played for England between September 1946 and May 1959 and was the first Englishman to win 100 caps before retiring and going on to be a TV football pundit.She recently presented The Billy Wright Story, a celebration of her father’s life that gave an insight into his private life and career before his death at the age of 70 in 1994.Her mother was Joy, of The Beverley Sisters, who died in 2015 at the age of 91. The singing trio had hits including I Saw Mommy Kissing Santa Claus and Little Drummer Boy.",
        "Singer Beverley Knight paid tribute to Wright, writing on Twitter: “My god no. I am so, so sorry. Vicky was a gem. Sending love and healing.”In a statement, football club Wolves said: “Our thoughts go out to the friends and family of Vicky Wright.“An inspirational woman and the daughter of a true Wolves legend. She will be dearly missed. The whole pack stands with the Wright family.”BBC Midlands Today presenter Nick Owen wrote: “Oh no. Shattering news. I had known Vicky for more than 40 years and loved her company.“Her dad Billy gave me my first job in television. I feel terribly sad tonight. Thoughts with all the family x.”"
    ]
}