{
    "articleURL": "/wires/reuters/article-12059307/GRAINS-Wheat-corn-rise-concern-Ukraine-shipping-deal.html",
    "content": [
        "Still no agreement to extend Ukrainian export shipping",
        "Ukraine deal expires May 18Concern over Argentine soybean crop continues(Recasts with price rises in European trade, changes dateline)HAMBURG, May 8 (Reuters) - Chicago wheat and corn rose on Monday on uncertainty over whether Ukraine´s safe shipping agreement for grain exports will be extended with the deal set to expire on May 18.Chicago Board of Trade most-active wheat rose 0.3% to $6.62-3/4 a bushel by 1121 GMT, after hitting a two-week high of $6.67-3/4 a bushel.Corn gained 0.3% to $5.98-1/2 a bushel, soybeans rose 0.3% to 14.42 a bushel.The pace of shipments from Ukraine under the U.N.-backed initiative has slowed in case ships get stuck if a deal is not renewed.\"Wheat and corn are rising today because of the lack of agreement on extending the Ukrainian safe shipping corridor which now only has under two weeks left,\" said Matt Ammermann, StoneX commodity risk manager. \"Soybeans are seeing buying interest partly on concerns about South American supplies.\"Russia is still not satisfied with how the issue of Russian agricultural exports is being resolved in talks to extend the deal.\"Russia continues to communicate that they are not happy with how the talks are going on extending Ukraine´s shipping agreement,\" Ammermann said. \"Thoughts simply remain that the corridor will not be extended as we know it, and how long will it take to find an agreement to reopen it is the next thought.\"",
        "Wheat was also underpinned by signs U.S. hard wheat crops may not be in as good condition as hoped, he added.Corn is also reacting to the concern about the Ukrainian shipping deal with Ukraine a large corn exporter.\"Soybeans were supported by talk Argentina's soybean crop could be even smaller than feared following the drought this year,\" he said. \"The market continues to watch how much soybeans Argentina imports from Brazil for its own crushing needs, with talk Brazilian soybean export premiums may have reached their lowest level.\" (Reporting by Michael Hogan in Hamburg, additional reporting by Naveen Thukral in Singapore, editing by Susan Fenton)"
    ]
}