{
    "articleURL": "/tvshowbiz/article-12047783/Khloe-Kardashian-named-son-Tatum-Robert-10-months-born.html",
    "content": [
        "Khloe Kardashian has kept the name of her second child, a son born via surrogate with ex Tristan Thompson, 32, a secret.",
        "But now the US edition of The Sun has claimed that they know the moniker.The site has shared that it is Tatum Robert.Khloe, 38 - who was seen working out on Wednesday -  has said in the past that she wanted a first name that began with a T to match her daughter True, age five.So Tatum is in line with that and the boy's last name will likely be Thompson, not Kardashian.Robert is the name of both Khloe's younger brother Rob, 36, and her late father, attorney Robert Kardashian, who died in 2003.",
        "DailyMail.com has reached out to Khloe's rep for comment. The insider said: 'There was talk about whether it should be Tatum Robert or should it be Robert Tatum.'Some in the family were leaning more towards Robert, because it honors her dad and her brother.The source added that Khloe did not immediately decide the name.'It took Khloe a little while to settle on the name but ultimately she went with Tatum Robert, which is in keeping with Tristan and True's names starting with a T.'Khloe wanted a name that was kind of unusual but not too out there and also keeping with the T theme,' it was added.Tristan also has sons Theo, 16 months, with Maralee Nichols, and Prince, six, with model ex-girlfriend Jordan Craig.",
        "Khloe has not shown too many photos of her baby boy since his arrival almost a year ago.",
        "She has revealed the back of his head while on her family's reality TV show The Kardashians, however.And last month Khloe shared a look at his back as he sat on the floor of her home gym while she had a morning workout. This comes after Khloe said she gets 'so emotional' when she thinks about how quickly time with her kids is passing by.The Good American designer took to social media the day after her eldest turned five in April to explain that she 'prayed' to have the little one for years.",
        "She wrote on Instagram: 'True, you must have heard me from heaven because I prayed for you for years. I must've done something right, because I have been blessed with one of the most gentle, empathetic, loving, happy, grateful and silly little girls. I've dreamt of my daughter for as long as I can remember but my dreams were not even close to the reality that God blessed me with.'Now my sweet baby is 5 I get so emotional when I think about how quickly time is passing us by. At the same time I am so honoured and thankful for every minute. I cherish every single moment and memory I have with you.",
        "The Kardashians star went on to add that she is 'excited' to see what the next year has in store for her daughter and thanked the little one for 'choosing' her as her mother as she declared that her children are her 'entire life.'She added: 'My sweet innocent happy girl, you are my everything. As sad as I am that you're getting older, I am also excited to see what year five has in store. Thank you for choosing me to be your mommy. You and your brother are my heart beat and my happy. You are my entire life!'Mommy and Baby love you TuTu PS I know her birthday was yesterday, but I was too busy being in the moment with my birthday girl.'"
    ]
}