{
    "articleURL": "/wires/reuters/article-12050407/Urawas-Skorza-cautious-Al-Hilal-threat-second-leg-final.html",
    "content": [
        "By Michael Church",
        "TOKYO, May 5 (Reuters) - Urawa Red Diamonds coach Maciej Skorza remains wary of the attacking threat posed by Asian Champions League holders Al Hilal as his side prepare for the second leg of the final at Saitama Stadium on Saturday.Shinzo Koroki's second half goal earned the Japanese side a 1-1 draw in Riyadh's King Fahd International Stadium last week and, with the away goals rule in effect, that means a 0-0 draw would be enough to earn Urawa a third Asian title.But after seeing Al Hilal score seven without reply in their semi-final versus Qatar's Al Duhail in February and strike three times in a 5-3 loss against Real Madrid in the Club World Cup final, Skorza remains cautious ahead of the decisive clash.\"You can't leave such a good team with too much space,\" he said on Friday. \"It wasn't our intention to play so defensively (in the first leg), it was because Al Hilal are such a good team and they didn't let us play offensively.\"It was also our lack of experience playing in games like that. Al Hilal are playing more in games like this, they are more experienced and can stay calm.\"Now we have more experience we can play a little bit more open but the most important (thing) is the result.\"",
        "Urawa will be helped by the absence of Al Hilal forward Salem Al Dawsari, who opened the scoring before being sent off late in the first leg, while there are also doubts over the availability of influential captain Salman Al Faraj.The Reds are aiming to become the first Japanese club to be crowned Asian champions for a third time, having previously won the title in 2007 and 2017.Their last triumph came against Al Hilal when a late goal by Brazilian Rafael Silva secured a 2-1 aggregate victory.Al Hilal avenged that defeat two years later with a 3-0 aggregate win over Urawa, sealing their success with a 2-0 win at Saitama Stadium in the second leg thanks to late goals from Al Dawsari and Bafetimbi Gomis.\"Our target is to win, it doesn't matter how demanding it will be,\" said Skorza. \"Our target is to give our best.\"We have achieved not a bad result in Riyadh, but this week we have stayed humble and focused on our cooperation. We've stayed calm and are waiting for tomorrow's game.\" (Reporting by Michael Church, Editing by Ken Ferris)"
    ]
}