{
    "articleURL": "/wires/afp/article-12056869/Foxconn-founder-vows-preserve-peace-China-elected-Taiwan-president.html",
    "content": [
        "The billionaire founder of Foxconn vowed Sunday at a rally that if elected president of Taiwan, he would be able to \"preserve peace\" between the democratic self-ruled island and China.",
        "Taiwan will elect its next leader in January 2024 to succeed President Tsai Ing-wen, whose two terms in power have been marked by unprecedented tensions with Beijing, which views the island as part of its territory to be reclaimed.Terry Gou -- the founder of Foxconn which is a key supplier of Apple's iPhones -- had announced in April he planned to seek the presidential nomination of Taiwan's China-friendly opposition Kuomintang party.During his first-ever rally, in Taiwan's southern city of Kaohsiung -- traditionally a stronghold of Tsai's ruling Democratic Progressive Party (DPP) -- Gou urged his supporters to \"let me preserve peace\".\"The last two years, what I have seen is a government who cannot see the sufferings of the people,\" the 72-year-old said in a speech to a sea of more than 10,000 supporters.\"What do the people worry about the most now? They are most concerned that war will break out anytime.\"Gou -- who donned a cap with Taiwan's flag -- said he can \"do better than Tsai Ing-wen, or William Lai\", the current Taiwanese vice president who has been nominated as the DPP's candidate.\"Let me, on behalf of everyone, strive for peace. Let me preserve the peace,\" he said.This would not be Gou's first bid at political leadership -- he attempted a run in 2019 before the previous election but lost to populist outsider Han Kuo-yu for the KMT's nomination.",
        "Gou's self-made tale is legendary in Taiwan and mimics the island's phenomenal economic success.But the huge factories built in China under Gou have rattled critics over his perceived cosiness with Beijing's leadership.The KMT tends to advocate warmer ties with China while under Tsai's leadership, relations with Beijing have plummeted.Democratic Taiwan lives under constant threat of invasion by China, which views the island as part of its territory to be reclaimed one day -- by force, if necessary.China has ramped up its sabre-rattling in recent years, sending warplanes near-daily into Taiwan's air defence identification zone.Last month it conducted its latest war games around the island in response to a meeting between Tsai and US House Speaker Kevin McCarthy in California."
    ]
}