{
    "articleURL": "/news/article-12050239/Leeds-mother-wanted-masterminding-104m-Dubai-cash-smuggling-ring-tracked-down.html",
    "content": [
        "Michelle Clarke, who allegedly recruited smugglers, is on the run from the NCAThe 42-year-old mother from Leeds has reportedly been tracked down to Dubai A glamorous mother-of-two fugitive wanted by Britain's 'FBI' for allegedly masterminding a £104million cash smuggling ring has been tracked down to the UAE, it has been reported today.",
        "Michelle Clarke is being hunted by the National Crime Agency over the huge sums of dirty money being flown from Heathrow to the Middle East.The 42-year-old has reportedly been cornered in Dubai, where the plot's money hub was based, and has been banned from leaving while UAE authorities carry out their own investigation.  Clarke, a former Sky TV digital co-ordinator from Leeds, is alleged to have recruited mules including Jo-Emma Larvin - a model ex of Welsh boxer and former super-middleweight world champion Joe Calzaghe.Larvin, 44, was last week convicted of shifting £5million in suitcases between Heathrow and Dubai.",
        "Clarke, who was painted as a kingpin-style figure in the case, is believed to be living on the exclusive Dubai Hills estate, reports The Sun.  The mother-of-two has previously been questioned by authorities in Dubai on behalf of the NCA. The 42-year-old is alleged to have recruited Beatrice Auty, 26, of Fulham, and the others for the £104million plot. Ms Clarke also ran the 'Sunshine and Lollipops' WhatsApp group, allegedly set up to organise the couriers arriving in Dubai.Gang members forked out £3,000 a trip to fly business class so they had more luggage and could check in later, lowering the risk of being caught.  This tactic reportedly helped the crime syndicate move £104million in suitcases on 83 Emirates flights in just 18 months. ",
        "In court it was heard she ordered couriers to use only pay-as-you-go sims on their mobiles.Clarke was said to have insisted: 'Only use these phones for now on and delete everything from your personal phones.'",
        "Earlier in the case Julian Christopher, prosecuting, said couriers were recruited 'directly and through Michelle Clarke'.Referring to her, he said: 'A British national in Dubai became involved in recruiting couriers. She does not appear in the dock because she is outside the jurisdiction.'Calzaghe's glamour model ex-girlfriend Larvin, and others are facing jail for their part in the globe-spanning plot.Larvin made the first trip with Amy Harrison, 27, when they took £2.2million into Dubai in seven suitcases. Her partner Jonathan Johnson, 55, travelled with her on the second occasion. The couple carried £2.8million in September 2020, using ordinary holiday items to disguise the cash stashed in eight suitcases.Larvin denied any wrongdoing and claimed she believed she was flying out millions of pounds for the UAE Embassy.The model said when she and her partner took the job it was the 'worst decision' of their lives.The pair divide their time between a home in Ripon, North Yorkshire and luxury hotels in Dubai, while on her Instagram profile Larvin has posted pictures of glamorous holidays they have enjoyed in the Maldives and Tanzania.",
        "Larvin and Johnson, both of Ripon, North Yorks, along with Harrison, of Worcester Park, Surrey, Beatrice Auty, 26, of Fulham, all denied but were unanimously convicted of removing criminal property from the UK.Judge Sarah Paneth granted the defendants bail ahead of sentence on a date to be fixed and said: 'I do not see any of you as a flight risk, otherwise I would not be granting you bail.'Liam Rabone, 29, of West Kensington, was cleared of removing criminal property after he told jurors: 'I would never have gone to two international airports knowing it was part of a crime syndicate.'The cash smugglers flew business class so they could take more luggage with them. They declared cash once arriving in Dubai, handing over a letter authorising them to carry it from a company called Omnivest.Julian Christopher, KC, prosecuting, told jurors the defendants 'played a significant part in the transportation of very large amounts of cash' to Dubai from Heathrow.Millions of pounds in English and Scottish banknotes were carried in suitcases checked in as luggage, the court heard. Anything over 10,000 Euros leaving the EU has to be declared to HMRC, but the smugglers' suitcases usually contained up to £500,000.The couriers were paid £3,000 and all their expenses for their trips to Dubai befre flying back with 'their very considerably lighter' suitcases.",
        "During her first trip Larvin sent messages to Johnson, saying she was 'in at the deep end'.",
        "Johnson is said to have told her: 'You need to be super careful,' and: 'I like your enterprise but the threat of clink [sic].'Mr Christopher said: 'That's the threat of prison - he's worried about the illegal nature of this.'Johnson also messaged Larvin two days before his first trip to Dubai, and said taking eight suitcases with them was 'taking the p**s'.NCA investigators found couriers carried £104m out of the country on 83 Emirates flights from London Heathrow to Dubai.Kingpin Abdulla Alfalasi, 48, from Dubai, was jailed for more than nine years last July.Recruitment consultant Tara Hanlon, 32, described as a Kim Kardashian lookalike, was locked up for nearly three years in 2022 for money laundering offences.Auty was allegedly recruited as a courier by Michelle Clarke, 42, in July 2020.Hanlon was told to 'reassure' Auty, who was then added by Clarke to the 'Sunshine and Lollipops' WhatsApp group, set up to organise the couriers arriving in Dubai.Money laundering expert and technical adviser from HM Treasury, Lesley Hayton said coffee and air freshener had been secreted in the suitcases to put sniffer dogs off the scent of cash.",
        "She said anything over £13,000 has to be declared on arrival in the Dubai.Ms Hayton added: 'There is a belief that when moving large sums of cash...there is a belief that coffee will put a sniffer dog away from finding the cash.'She added: 'I believe they were travelling with Emirates Airlines, business class has the luxury of a later check in, so that makes the chances of getting caught that much smaller than if you were waiting in an airport for two to three hours.'There is also a higher baggage allowance on business class.'Johnson is said to have told Larvin that their contacts were 'taking the p***', adding: 'How the f*** do two people carry eight cases it's f****** ridiculous, talk about conspicuous.'The couple were arrested in March last year.Auty told the court she was put in contact with Clarke by her ex-partner and told she would be working for the UAE royal family.She said she met a driver called Karim at a Starbucks in Knightsbridge who took her to a town house and gave her suitcases to take to Dubai and told her: 'Have a lovely trip.'",
        "Auty said she did not believe she was doing anything illegal.Larvin and Johnson, both of Ripon, North Yorks, along with Harrison, of Worcester Park, Surrey, and Auty, of Fulham, all denied but were convicted of removing criminal property from the UK.",
        "Alfalasi, from Dubai, was arrested in December 2021 at an apartment in Lowndes Square, Belgravia, where three-bed properties sell for more than £11million.He admitted removing criminal cash from the UK between April 3, 2019 and November 3, 2020.Speaking last week, NCA senior investigating officer Ian Truby said: 'These couriers were important cogs in a large money laundering wheel.'The crime group they belonged to was responsible for smuggling eye-watering amounts of criminal cash out of the UK.'This simply wouldn't have been possible without couriers doing their bidding, in return for a sunshine holiday and a slice of the profit.'Cash is the lifeblood of organised crime groups, which they re-invest into activities such as drug trafficking. 'This fuels violence and insecurity around the world, which is why our investigation into other cash couriers continues.'Adrian Searle, Director of the National Economic Crime Centre in the NCA, added: 'The laundering of such vast quantities of cash around the globe enables organised criminals and corrupt elites to clean or hide their ill-gotten gains.'Cash smugglers typically work on behalf of International Controller Networks, who move the finances of the international drug trade, people traffickers, fraudsters and other criminal groups, making the source of the money difficult to trace.'The criminality this enables costs the UK billions every year, causes misery and ruins lives across the world.'The NCA declined to comment about the search for Clarke, when approached by MailOnline. "
    ]
}