{
    "articleURL": "/femail/article-12050205/The-REAL-reason-Lady-Pamela-Hicks-isnt-invited-Coronation.html",
    "content": [
        "Sarah Vine said Lord Mountbatten stopped Charles and Camilla's marriageRead more: For all the latest Royal news, pictures and video click here A royal expert has claimed the real reason Lady Pamela Hicks isn't invited to the Coronation is because her father prevented Charles from marrying Camilla. ",
        "Lady Pamela Hicks, whose father, the 1st Earl Mountbatten of Burma was Prince Philip's uncle, is one of only two surviving bridesmaids from Queen Elizabeth and Prince Philip's wedding in 1947. However last month she received a telephone call from a secretary at Buckingham Palace, informing her that she had not been invited to the Coronation, to be held at Westminster Abbey this week. Daily Mail columnist Sarah Vine has now claimed this is because her father Mountbatten 'convinced the Queen not to let Charles marry Camilla.'Speaking on Palace Confidential, she said: 'I don't think Charles has forgotten.'",
        "Discussing the Coronation on the programme, she told host Jo Elvin: 'It was Mountbatten, apparently, who convinced the Queen not to let Charles marry Camilla.'Jo said: 'That puts a new perspective on Lady Pamela.'It's not the first time there were accusations that Lord Mountbatten had meddled in the King's romantic life.  Last month in the ITVX show, The Real Crown: Inside the House of Windsor, Charles' bond with his great uncle, known also as Dickie Mountbatten was explored.During the programme, Dickie's desire for the then-Prince of Wales to get together with his granddaughter Amanda Knatchbull is outlined.While the programme says Lord Louis felt that a man in Charles' position should enjoy 'sowing his wild oats' before he settles down, he said it is then important to find a suitable wife.",
        "And Dickie felt that his granddaughter Amanda fit the bill perfectly. After the young heir was linked with a number of young women in the press, he was invited to the Bahamas by his great uncle, who also brought the teenage Amanda.While the pair are thought to have got on well, according to the programme, Prince Philip was concerned that 'this was a classic piece of Mountbatten manoeuvring'.Featuring in the episode is William Evans - who was valet to Lord Mountbatten, who says: 'Prince Philip's attitude is \"keep out of it. He will pick his own wife when he is ready\".'There was a little bit of friction sometimes between Prince Philip and Lord Louis...But the Lord was very determined.'In the meantime, the woman Charles was really in love with - Camilla Parker Bowles - had got married, to a high ranking officer in the cavalry.",
        "When whispers of the couple's ongoing relationship reached the Queen, she is said to have banned Camilla from attending royal events.And Lord Louis was still determined that Charles find the right match, according to the programme, which details how he sent his nephew a 'frank' and critical letter, which warned the young royal he may end up taking the same path as his 'disgraced uncle David' (who abdicated to marry Wallis Simpson).",
        "The programme describes as Charles being 'haunted by the spectre' of this outcome, and taking action to avoid it - by proposing to Amanda.According to William Evans, the pair were fond of each other. But Amanda was not in love with Charles, and wanted to marry based on love. In addition, William Evans says, Amanda was not keen on the idea of royal life.Her refusal of the proposal meant Lord Louis' attempts to matchmake the couple had come to an unsuccessful end.Not long after the proposal, Lord Louis was killed by the IRA after a bomb was planted on his boat in Sligo, Ireland, in 1979.Charles would go on to marry - and divorce - Diana, Princess of Wales, before eventually tying the knot with Camilla, now the Queen Consort, in 2005.It emerged weeks ago that Pamela hadn't been invited to the King's coronation, with her daughter India Hicks explaining they had received a call from the palace to tell them the news.She said: 'One of the King's personal secretaries was passing on a message from the King.'The King was sending his great love and apologies, he was offending many family and friends with the reduced [guest] list.'The palace official 'explained that this Coronation was to be very different to the Queen's' in 1953, when thousands more squeezed into the Abbey.",
        "'Eight thousand guests would be whittled down to 1,000, alleviating the burden on the state.'India, who is a goddaughter of King Charles and was a bridesmaid when he married Lady Diana Spencer, insists: 'My mother was not offended at all.''How very, very sensible,' she said. Invitations based on meritocracy not aristocracy. 'I am going to follow with great interest the events of this new reign'.'After Lady Pamela aattended the funeral of her close friend Queen Elizabeth at Westminster Abbey, India said: 'She might be the only living person to attend three Coronations.'"
    ]
}