{
    "articleURL": "/femail/food/article-12049105/Get-health-doctor-Megan-Rossi-reveals-rid-bad-garlic-bread-eating-apple.html",
    "content": [
        "Dr Megan Rossi said apples can deodorise garlic breath She suggests eating one with garlic-heavy dishesA top doctor has shared a simple trick for getting rid of garlic breath without having to brush your teeth. ",
        "Dr Megan Rossi revealed eating an apple is the most effective way to get rid of bad breath caused by garlic.Adding it is much more effective than 'deoderising' your breath with minty gum because it stops the smell at the source. Dr Megan said garlic can linger on someone's breath for up to a day and to eat an apple with any food or side heavy on the vegetable. 'As the garlic moves through your digestion, the by-products of garlic are absorbed into the bloodstream and carried to the lungs,' she explained in an Instagram post. 'This gives you a 'repeat performance' that chewing gum can't quite get rid of.'She listed four more foods that can freshen up your breath including mint and parsley as well as spinach and lettuce.",
        "The doctor also recommended leaving chopped garlic aside for 10 minutes before cooking with it so more allicin, an active ingredient that supports the immune system, can be released. Hundreds of the popular scientist's fans were relived to learn about the handy hacks and joked they will start carrying an apple around with them everywhere they go.The doc said apples contain plant chemicals that have been shown to interact with sulphur compounds in garlic which deodorises the breath and eliminates that garlicky whiff. ",
        "Dr Megan added mint, parley, lettuce and spinach are also helpful foods to eat to deodorise the breath while supporting gut microbes.  ",
        "Even without eating the apple, Dr Megan said garlic's health benefits are well worth the risk of having smelly breath. 'The main active ingredient is allicin, which supports our immune system to fight viruses,' she said. ",
        "AppleMintLettuceSpinachParsley ",
        "'A 2001 clinical trial demonstrated that taking a garlic supplement daily reduced both the chance of getting a cold and the recovery time.'Dr Megan said to make the most of the flavourful vegetable's benefits to leave crushed or chopped garlic for 10 minutes before eating or cooking. Leaving garlic to stand beforehand will allow the allicin to fully develop before heat from cooking inactivates the enzymes.'What an interesting tip! I'm definitely going to try this,' one follower replied. 'Doing God's work so we can enjoy garlic without the breath side effect,' a second agreed.'Both my teenagers had that smell during the week! Great hack,' a mum wrote. However not everyone will be serving up an apple alongside their garlic bread with one woman laughing: 'Who cares?! I've been smelling of garlic for 40 years. I just assume everyone else does too.' 'That is so interesting, Megan!! But I weirdly like my garlic breath,' a second added. "
    ]
}