{
    "articleURL": "/wires/ap/article-12049453/April-jobs-report-point-US-labor-markets-resilience.html",
    "content": [
        "WASHINGTON (AP) - America´s employers added a healthy 253,000 jobs in April, evidence of a labor market that still shows surprising resilience despite rising interest rates, chronically high inflation and a banking crisis that could weaken the economy.",
        "The unemployment rate dipped to 3.4%, matching a 54-year low, the Labor Department said Friday. The jobless rate fell in part, though, because 43,000 people left the labor force, the first drop since November, and were no longer counted as unemployed.In its report Friday, the government noted that while hiring was solid in April, it was much weaker in February and March than it had previously estimated. Job gains for those months was downgraded by a combined 149,000. And hourly wages rose last month at the fastest pace since July, which may alarm the inflation fighters at the Federal Reserve.April´s hiring gain compares with 165,000 in March and 248,000 in February and is still at a level considered vigorous by historical standards. The job market has remained durable despite the Fed´s aggressive campaign of interest rate hikes over the past year to fight inflation. Layoffs are still relatively low, job openings comparatively high.Job growth was particularly strong last month among health care companies, restaurants and bars and a broad category that includes managers, administrators and technical support workers.In one sign of the benefits of a consistently tight job market, Black unemployment dipped in April to 4.7% - the lowest such level in government records dating to 1972.",
        "Looked at broadly, the nation's job market appears to be easing into a more moderate phase, roughly akin to the pace of hiring that preceded the pandemic recession of 2020. Job gains for February through April marked the weakest three-month average since January 2021 yet still slightly exceeded the pre-pandemic pace.Fed Chair Jerome Powell himself sounded somewhat mystified this week by the job market´s durability. He and other Fed officials have expressed concern that a robust job market exerts upward pressure on wages and prices. They hope to achieve a so-called soft landing - cooling the economy and the labor market just enough to tame inflation yet not so much as to trigger a recession. Most economists doubt that the Fed will succeed and expect a recession to begin sometime this year.Last month, the proportion of Americans who either have a job or are looking for one - the so-called labor force participation rate - was unchanged at 62.6%. The Fed would like to see labor participation grow: More people in the job market would likely put downward pressure on pay growth and help contain inflation.Average hourly wages rose by 0.5% from March to April, nearly twice what economists had expected.\"Wage pressures on inflation are proving persistent,´´ Brian Coulton, chief economist at Fitch Ratings, wrote in a research note. \"And with the participation rate failing to improve, this jobs report will not convince the Fed that they are on top of inflation.\"",
        "The ever-higher borrowing costs the Fed has engineered have weakened some key sectors of the economy, notably the housing market. Pounded by higher mortgage rates, sales of existing homes were down a sharp 22% in March from a year earlier. Investment in housing has cratered over the past year.America´s factories are slumping, too. An index produced by the Institute for Supply Management, an organization of purchasing managers, has signaled a contraction in manufacturing for six straight months.Even consumers, who drive about 70% of economic activity and who have been spending healthily since the pandemic recession ended three years ago, are showing signs of exhaustion: Retail sales fell in February and March after having begun the year with a bang.As the Fed has raised rates - 10 consecutive hikes since March 2022 - inflation has slowed from a year-over-year peak of 9.1% last June to 5% in March. That´s still well above the Fed´s 2% target. But it may signify enough progress, along with signs that the job market is decelerating, to persuade the central bank to pause its rate hikes.\"Everything´s moving in the right direction,´´ said Tom Garretson, senior portfolio strategist at RBC Wealth Management. \"The Fed´s probably done enough.´The Fed´s rate hikes are hardly the economy´s only headwind. Congressional Republicans are threatening to let the federal government default on its debt, by refusing to raise the limit on what it can borrow, if Democrats don´t accept sharp cuts in federal spending. A first-ever default on the federal debt would shatter the market for U.S. Treasurys - the world´s biggest - and possibly cause a global financial crisis.",
        "Since March, America´s financial system has been rattled by three of the four biggest bank failures in U.S. history. Worried that jittery depositors will withdraw their money, banks are likely to reduce lending to conserve cash. Multiplied across the banking industry, that trend could cause a credit crunch that would hobble the economy.Several big technology companies, including Google and Amazon, have announced layoffs this year. Such job cuts, though, haven't been widespread enough across the economy to boost the U.S. jobless rate or the number of people applying for unemployment benefits. One reason is that many tech workers who were laid off have quickly landed new jobs.Pinnacol Assurance, a workers´ compensation insurance firm in Denver, has hired 100 people over the past year and now has a staff of about 700. Some of the newcomers to Pinnacol had been laid off by technology companies.\"They´re double-dipping,´´ said Tim Johnson, the firm´s human resources chief. \"They´re getting severance, and they´re getting a paycheck.´´Mike Trepper, CEO at Pasco Kids First in New Port Richey, Florida, agreed that a sizable number of job seekers still \"have many options.´´His nonprofit, which helps child abuse victims, recently lost two employees, including a therapist who took a higher-paying job in private practice.Some employers, though, report signs that labor shortages might be starting to ease. Gaston Curk, co-founder of OSM Worldwide, an e-commerce parcel carrier based in Glendale Heights, Illinois, has seen a 55% increase in applicants for open positions over the past six months.",
        "Curk attributed the increase, in part, to more people re-entering the labor market as well as an increase in the company's starting pay.Lisa Mason, another Pinnacol human resources executive, has noticed that workers aren´t quite as willing to change jobs as they were a few months ago.\"We are seeing individuals not jumping as much as we had previously seen,´´ she said. \"They´re strapping in a little bit to see what´s happening in the market, what´s going on with the economy.´´____AP Retail Writer Anne D´Innocenzio in New York contributed to this story."
    ]
}