{
    "articleURL": "/wires/reuters/article-12042635/Former-FBI-agent-charged-Jan-6-attack-U-S-Capitol.html",
    "content": [
        "By Sarah N. Lynch",
        "WASHINGTON, May 3 (Reuters) - A former FBI agent has been arrested for his alleged role in the Jan. 6, 2021, attack on the U.S. Capitol and charged with four misdemeanor counts, including unlawfully entering a restricted building and disorderly conduct, according to court filings.Jared Wise, 51, who served as an FBI agent and a supervisory agent from 2004 to 2017, was taken into custody on Monday and released home with conditions, according to court filings. Until last June he resided in New Braunfels, Texas, but he has since moved to Bend, Oregon.Wise was captured on closed-circuit TV footage entering through the U.S. Senate wing door and raising his arms \"in triumph,\" according to a sworn statement filed in federal court.In body-worn camera footage captured by D.C. Metropolitan Police officers, Wise addressed them directly, saying: \"\"You guys are disgusting. I´m former - I´m former law enforcement. You´re disgusting. You are the Nazi. You are the Gestapo. You can´t see it. ... Shame on you! Shame on you! Shame on you!\"The camera footage also captured Wise's reaction as other surrounding protesters began to attack police officers trying to defend the Capitol, the filing added. In the video, he can be heard egging them on by shouting: \"Kill `em! Kill `em! Kill `em!\"",
        "An attorney for Wise could not be immediately reached for comment.A spokesperson for the FBI did not immediately respond to a request for comment about Wise's arrest and prior employment at the bureau.More than 1,000 people have been charged to date for their roles in storming the Capitol on Jan. 6, 2021, in a failed bid to keep Republican then-President Donald Trump in power by blocking Congress from certifying Democrat Joe Biden's 2020 election victory.Five people died during and shortly after the riot, and about 140 police officers were injured. (Reporting by Sarah N. Lynch; additional reporting by Susan Heavey; editing by Jonathan Oatis)"
    ]
}