{
    "articleURL": "/tvshowbiz/article-12047451/Jennifer-Lopez-53-looks-youthful-tinted-sunglasses-plunging-top.html",
    "content": [
        "Jennifer Lopez looked stunning as she stopped by the ABC studios in New York City on Thursday. ",
        "The Shotgun Wedding star, 53, wore a monochromatic look in all grey featuring a long grey coat over a belted grey jumpsuit. Her long, caramel-colored hair was parted in the middle and fell in loose curls down her torso.The Marry Me actress' makeup was warm and sun kissed and featured rosy cheeks, long false eyelashes and nude lips.The Wedding Planner star - who attended the Met Gala on Monday - waved at fans assembled outside of the studio.",
        "On Monday, the Hustlers star attended the Met Gala with her vocal coach Stevie Mackey.Her husband Ben Affleck, 50, could not attend fashion's biggest night due to work commitments that he could not get out of. The Jenny From the Block singer took her sister Lynda Lopez, 51 to the Stella McCartney and Baz Luhrmann’s Met After Party with Casamigos.Lynda posted a photo with her famous sister on Instagram the following day. '#Aboutlastnight Stayed up late wayyyy too many nights this week... #mamasnightout ❤️,' she added in her caption.The Let's Get Loud singer is currently promoting her Netflix film The Mother.The Gigli star plays a deadly female assassin who comes out of hiding in the upcoming film.Netflix describes the film as, 'A female assassin comes out of hiding to protect the daughter she gave up years before.'",
        "'The men after her are dangerous, but she is even more deadly. From director Niki Caro and writers Misha Green &amp; Peter Craig, Jennifer Lopez is THE MOTHER. Premieres May 12.'",
        "Lopez is also executive producing the film, which stars Gael Garcia Bernal, Joseph Fiennes and Lucy Paez.The role is a familiar one for the Monster In Law actress. Back in 2002, she played a terrified mother trying to protect her daughter from her abusive husband in Enough.The multi-talented star is also releasing her new album on July 21, and will have a total of 13 songs.Her ninth studio album, which will have 13 songs, is a sequel to This Is Me...Then (2002) which landed in the top ten on the Billboard 200 list when it was released."
    ]
}