{
    "articleURL": "/wires/reuters/article-12055807/D-backs-blow-4-run-lead-9th-rally-beat-Nationals.html",
    "content": [
        "Lourdes Gurriel Jr. went 4-for-5, including a game-tying, ninth-inning home run, as the Arizona Diamondbacks rallied from coughing up a four-run lead to beat the visiting Washington Nationals 8-7 on Saturday in Phoenix.",
        "Gurriel's solo home run to open the bottom of the ninth forced a 7-7 tie after the Diamondbacks allowed five Nationals runs in the top half of the inning. The round-tripper was Gurriel's third of the season.Christian Walker kept the rally going with a single as part of his 3-for-5 night, then Corbin Carroll drew a walk. An intentional walk to Geraldo Perdomo loaded the bases, and Pavin Smith drew a walk from Kyle Finnegan (1-2) that sent in the winning run.Washington starter MacKenzie Gore struck out nine and allowed two earned runs and eight hits in six innings of work. He walked one.The wild Arizona half of the ninth capped a stretch with 10 combined runs scored over the final two innings, five for each team.Arizona scored three times in the eighth, but home runs from Keibert Ruiz and Lane Thomas powered a five-run Nationals half of the ninth inning.Ruiz kicked it off with a solo blast to right field. Arizona reliever Scott McGough retired the next two batters before walking Alex Call, prompting Diamondbacks manager Torey Lovullo to go to Andrew Chafin out of the bullpen.Chafin then gave up a single to Michael Chavis that moved Call to third and, after Chavis advanced to second on defensive indifference, former Diamondback Ildemaro Vargas drove in both with a single. With CJ Abrams pinch-running, Thomas blasted a hanging pitch to give Washington a 7-6 lead that proved fleeting.",
        "Carroll ignited Arizona's three-run eighth with an RBI single, extending his hitting streak to 11 games.Diamondbacks starter Tommy Henry did not allow a base hit until the fourth inning when he gave up four in a row. Washington plated two in the inning and took a 2-1 lead after Emmanuel Rivera's first-inning home run gave Arizona the initial advantage.The home run was the first of the season for Rivera, who went 2-for-4 on the night.Henry went six innings in the start for Arizona, allowing two runs and six hits. Miguel Castro (1-0), who recorded the final out in the ninth, picked up the win.--Field Level Media"
    ]
}