{
    "articleURL": "/wires/reuters/article-12059475/Ukraine-farms-lose-workers-war-complicating-tough-harvest.html",
    "content": [
        "Ukrainian army signs up experienced farm workers",
        "Farmers say hard to quantify losses by losing qualityKyiv has law to shield key economic sectors from draftUkrainian grain is a driver of economy, world marketsBy Elizabeth Piper and Pavel PolityukKYSHCHENTSI, Ukraine, May 8 (Reuters) - Dutchman Kees Huizinga has faced many challenges in the two decades he has spent as a farmer in Ukraine. Russia's invasion has thrown up one challenge he never expected.Around 40 of his 350 workers have signed up to fight in the war, and the replacements he has found lack their experience. Huizinga fears this could mean a fall in grain and milk yields, and with them a drop in his income.His farm, in a village in the rolling hills and green flat plains of the Cherkasy region in central Ukraine, is not the only one losing valued farmhands to the war.Three farmers, a major farm operator and an agrarian association told Reuters the military call-up had made the most important times of the arable calendar - the sowing and harvesting seasons - even more tough.They said that assessing the impact of staff shortages on output is all but impossible - but just another complication in an already difficult campaign.Ukraine's grain output - long a driver of its export revenues and of global grain markets, is already down sharply because of a war that has disrupted exports, reduced access to fertilisers and made huge swathes of farmland inaccessible.",
        "Steps by Kyiv to ring-fence the key agriculture sector from the military draft have had only a limited impact.Most of the farming sources Reuters spoke to said they can get by with replacement workers and employees doubling up on some jobs, but that nothing replaces experience.\"You lose some efficiency there,\" Huizinga said. \"You lose the quality.\"The 48-year-old, who hails from near the Dutch city of Groningen and moved to Ukraine drawn by its cheaper land prices, said the losses could run to a few hundred thousand dollars or more for his farm.On his 15,000 hectares of land he has 2,000 milking cows plus young stock, and grows a variety of vegetable and grain crops, having withstood unpredictable weather and price fluctuations among other challenges over the years.WAR DRAFT HITS FARM LABOURA new recruitment drive since the start of this year as Ukraine prepares for a widely expected counteroffensive coincided with the annual sowing campaign, which was delayed because of heavy rains.\"Out of the 350 employees, there are 40 in the army, not all of them on the front lines but, yeah, we miss them,\" Huizinga said in front of his fleet of combine harvesters.\"(For) all the farmers all over Ukraine, I think on average they lost like up to 15%, around 15% of their labour force to the army.\"",
        "Huizinga has willingly given machinery and money to the Ukrainian armed forces and says it makes sense for the military to take drivers used to working with heavy machinery such as combine harvesters, trucks or tractors.But he has keenly felt the departure 14 months ago of \"his main guy\", who repaired machinery in the fields.\"So he's very fast in repairing machines, you know ... if a tractor is broken he can find a solution,\" Huizinga said.\"And now a new guy is going to take ... an hour or half an hour, of course he will get the experience but it will take him a couple of years.\"EXEMPTION LAWUkraine has long been known as the breadbasket of Europe. Its fertile black soil, large expanse of flat plains and deep Black Sea ports enabled the country to become a major exporter of grain across the world.Agricultural exports are vital to the economy, making up about 12% of gross domestic product before Russia's invasion and about 60% of all its exports, and are crucial to feeding some parts of the world including the Middle East and Africa.But the invasion has upended much of that. Grain output is likely to have slumped to about 53 million tonnes in clean weight in the 2022 calendar year from a record 86 million in 2021. This year it could drop as low as 44.3 million.",
        "Under a U.N.-brokered deal allowing the safe export of grain from three Ukrainian Black Sea ports that had been blocked after the invasion, Ukraine has been able to export 29.3 million tonnes of agricultural products including grains.However, the deal is in jeopardy as Russia has signalled it will not extend it unless the West facilitates the export of Russian grain and fertiliser, sales which it says have been impeded by Western sanctions imposed on Moscow.Hoping to boost Ukraine's harvest this year, Kyiv has introduced a law that allows some farms to be designated as critically important to the economy, providing some exemptions from the call-up.Last month, the government included more farms on its critically important list, reducing the amount of land required from 1,000 hectares to 500 and the average number of insured workers to at least 20 people rather than 50.The government says it is doing everything to make sure farms can do their jobs.\"The situation is very, very tense,\" Taras Vysotskiy, first deputy agriculture minister, told Reuters. \"But it would be incorrect to say that mobilisation has stopped or significantly slowed down the work needed for the agricultural sector.\"Despite this, two farmers said the \"critically important\" status did not make agricultural producers immune to the call-up, especially as the enlistment drive was redoubled at the start of this year.",
        "The pool of willing and able labour in villages across Ukraine is not vast, they said, with many younger people having left for towns and cities in recent decades.Sometimes, good relations with the local conscription office and offering material support to the armed forces could do more than any law or rules to persuade officials not to sign up too many workers.The Barishevka grain company Grain Alliance, a farm operator in Ukraine that controls 57,000 hectares of land of which 54,000 hectares are cultivated, said 51 of its 1,100 employees were now \"protecting Ukraine\".\"The company's management, the company's board of directors and investors understand the urgency and importance of measures to strengthen Ukraine's defence capabilities. But next to this, there is an acute issue of providing the agricultural sector with qualified personnel,\" it said in a statement.\"Food security of Ukraine and its people is important for victory in the war,\" it said, adding it was working with defence departments to ensure there were enough workers for successful sowing and harvesting campaigns.Denys Marchuk, deputy chair of the Ukrainian Agrarian Council, said he believed the situation this year was \"difficult, but it is not critical\" because of the measures to protect some of the workforce.Marchuk said farmers were prioritising some employees, bringing in more women workers, recruiting those people displaced by the war and by retraining other workers. (Additional reporting by Valentyn Ogirenko and Olena Harmash; editing by Mike Collett-White and Mark Heinrich)"
    ]
}