{
    "articleURL": "/wires/aap/article-12047835/No-Hindley-Vine-shine-Aussies-Giro.html",
    "content": [
        "Jai Hindley may have turned his gaze to a new grand tour challenge but Australian cycling could still enjoy another stirring Giro d'Italia assault even in the absence of the title holder.",
        "Naturally, there's an anti-climactic feel in Australia's second-ever grand tour winner not being at the start in Abruzzo on the Adriatic coast on Saturday as Hindley focuses instead on July's Tour de France.But while this Giro is set to centre on the epic international duel between triple Vuelta champ Primo Roglic and world champ Remo Evenepoel, a blend of the old, the new and the untapped could still still make this a big three weeks for Aussie cycling too.The 'untapped' is Jay Vine, a rider of rare potential, even if his breakthrough season back home, winning the Tour Down Under and the national time trial title, has since been checked by a knee injury that's sidelined him so far in this European campaign.Yet the 27-year-old Townsville-born comet, who emerged from a Zwift Academy program to win two mountain stages at last year's Vuelta, never ceases to surprise and it would be no shock to see him thrive in his debut Giro.\"After this injury, coming out of the Giro with a top ten would be incredible for me,\" Vine told Cyclingnews.His UAE Team Emirates outfit will be throwing its weight behind team leader Joao Almeida, but Vine's ability in the mountains makes him a potentially exciting plan B.",
        "\"My form coming out of the altitude camp will ultimately dictate what the team uses me for - whether they use me aggressively or defensively, or whether I'm there in a supporting role from day one.\"The 'old' - or perhaps evergreen is more accurate - is 32-year-old Michael Matthews.One more stage win and Matthews would join Caleb Ewan (11) and Robbie McEwen (23) as the only Australians ever to get into double figures in grand tours.And the rider from Australia's Team Jayco AlUla, who wore the leader's pink jersey in 2014 and 2015, believes he's in the form to do so.\"I am eager to get back to racing, I have had a bit of a rollercoaster of a season so far after having to recover from a crash at the Tour of Flanders and also being forced to stop for a while due to COVID,\" said Matthews.\"Now I am feeling good and like everything is back on track.\"Two more Aussie thirty-somethings will be in action. Melbourne's Simon Clarke, 36, will be out for another late-career flourish with Israel-Premier Tech, just as at last year's Tour de France where he earned an epic stage win.Adelaide's Rohan Dennis, at 32, will be in his final Giro in his farewell season, looking to help Jumbo-Visma's Slovenian star Roglic in the mountains while also looking to cash in on a time trial-heavy programme.",
        "Queenslander Jack Haig, leading Bahrain-Victorious, has not ruled out a podium finish, having finished third in the recent Tour of the Alps.As to the 'new', the best bet for a stage win among the nine Aussies in action will be Alpecin-Deceuninck's 24-year-old Giro debutant Kaden Groves, a stage winner at last year's Vuelta who's already landed three wins in 2023.AUSTRALIANS AT THE 2023 GIRO D'ITALIASimon Clarke (Israel-Premier Tech)Sebastian Berwick (Israel-Premier Tech)Kaden Groves (Alpecin-Deceuninck)Callum Scotson (Team Jayco AlUla)Michael Hepburn (Team Jayco AlUla)Michael Matthews (Team Jayco AlUla)Jay Vine (UAE Team Emirates)Jack Haig (Bahrain-Victorious)Rohan Dennis (Jumbo-Visma)"
    ]
}