{
    "articleURL": "/wires/pa/article-12051659/Royal-mega-fans-say-rainy-British-weather-not-dampener-coronation.html",
    "content": [
        "Royal mega-fans braving intermittent downpours to camp out ahead of the coronation said the rainy British weather will not put a dampener on their “once-in-a-lifetime opportunity”.",
        "Poncho-clad royalists with umbrellas at the ready, many wearing crowns and clothes adorned with Union flags, bustled about the tents lining The Mall in central London amid occasional heavy showers on Friday.The smiling, albeit soggy, campers arrived early to bag prime viewing spots for when the coronation procession leaves Buckingham Palace for Westminster Abbey on Saturday.Among them was Trisha Hollis, 71, from Hull, who had pitched up on Friday.",
        "She told the PA news agency: “It’s history and I think at my age it’s a once-in-a-lifetime opportunity.“I think I was two when the Queen was crowned but obviously I have no recollection of that.“I admire the royal family, I’m glad we have them. I think the Queen did a sterling job.”On Friday’s rainy showers, she added: “What will be will be.“It’s 24 hours in my life. I will get dry and warm again sometime so I’ll grin and bear it.“If you come back to me at 2am I might not be saying it with such a smile.“Maybe we’ll have a nice day tomorrow but it did rain for the Queen in ’53.”A married mother of four joked that her children think she is “mad” and having a “midlife crisis” because she is camping out for the crowning.",
        "Kim Bilson, 54, from Poole, Dorset, told PA: “It’s too big of an occasion to miss really, don’t want to look back at it and think, why didn’t we do it.“It’s a lovely atmosphere here, meeting people from all over the place.”She arrived at about 6pm on Thursday and said it was a “cold” and “noisy” experience camping out overnight.But she added: “People are just so friendly.“It’s just Britain at its best, everybody nattering to everybody.“There’s no stiff upper lip, everybody’s here for the same reason and it’s just really nice.”On what her children make of her escapades, she added: “They think I’m mad. They think we’re mad. In fact, midlife crisis came up at one point.”Richard Turner, 54, of Southend-on-Sea, Essex, is forgoing a tent and sleeping on a camping chair.",
        "Wearing a Union flag hoodie, the single father of one, who arrived at midnight on Friday, said: “I’m just sleeping in a chair. I don’t want to take up too much space so I thought I would just bring a chair, I’ve got an umbrella if it rains.“I love this kind of thing, I love history, I love the pageantry, I’m a fan of the royal family, it’s all I’ve ever known since I was born.",
        "“I’ve been doing these royal events since I was nine, my first one was 1977, the Silver Jubilee.“This is a big event, I wouldn’t want to miss this.“This is one of those events where you have to be here in person and see it for real because you wouldn’t get the impact on the telly.“You’re not going to get another one of these for some years now, this is the last big royal event.“All those that can be married are married, all those who can pass on have passed on.”Sarah Exner, 29, a nurse who lives in Texas, flew over a few days early for a holiday so she could join the campers.",
        "She said: “It’s always been really fascinating, the monarchy.“We’ve always had a wonderful time keeping up with the events.“It’s just a once-in-a-lifetime opportunity to be able to come out here for the coronation.“They don’t happen very often and we don’t have as much of the pomp and circumstance in the United States and it’s lovely to come out here and see all the traditions.”On how she expects to feel tomorrow, Ms Exner said: “I think it will be very exciting, very interesting to see. We have already had a lot of fun.”"
    ]
}