{
    "articleURL": "/wires/reuters/article-12049355/White-Soxs-Lance-Lynn-Reds-Hunter-Greene-eye-23-win.html",
    "content": [
        "A pair of starting pitchers in search of their first win of the season square off when the Chicago White Sox visit the Cincinnati Reds on Friday night in the opener of a three-game series.",
        "The White Sox had their modest three-game winning streak snapped Thursday while the Reds are coming off a 3-3 road trip through Oakland and San Diego.Right-hander Lance Lynn (0-4, 7.16 ERA) will take the mound for the White Sox for the seventh time. Lynn has lost four of his six starts, including his last three, in which he has allowed 13 runs on 18 hits in 16 2/3 innings to pitch to a 7.02 ERA. The White Sox are 0-6 when Lynn starts this season.In his last start, Lynn appeared to have turned the corner. He threw six no-hit innings against Tampa Bay before allowing a leadoff homer in the seventh and only retiring one more batter.He allowed four runs -- all in the seventh inning -- on three hits, striking out 10 and walking two as Tampa Bay scored 10 in the seventh in a 12-3 Rays' win.\"It wasn't good, and it hasn't been good so far,\" Lynn said of the latest of his six starts. \"We haven't played good baseball. We're losing a lot of games.\"The Reds figure to be an ideal opponent for Lynn to face in his hopes of breaking out of his personal slump. He is 11-4 with a 3.16 ERA in 21 appearances against Cincinnati (18 starts). His 11 wins match his career-best against any team. He also has 11 wins against the Milwaukee Brewers.",
        "Cincinnati will counter with right-hander Hunter Greene (0-1, 2.89), who has had much tougher luck in his six starts to open 2023. Greene has allowed just one earned run over his last three starts, covering 14 innings.Last Saturday in Oakland, he matched his season high with 10 strikeouts over five innings as the Reds rallied in the ninth for a 3-2 win. The Reds are 2-4 in Greene's six starts.Greene will be making his first career start against the White Sox.Cincinnati starters Luis Cessa, Connor Overton and Luke Weaver have struggled, forcing the likes of rookie Casey Legumina to extend themselves to bridge to late-inning relievers Alexis Diaz and Ian Gibaut.In Greene's last start, Legumina pitched a scoreless eighth inning to record his first big league win and extend the Reds' winning streak at the time to five games.\"Any first is always cool, especially for a rookie, especially because you get the lineup card and all the cool things that come with it,\" Legumina said. \"I'm happy it got to be during a good streak of games for us, too.\"Legumina has a 2.25 ERA in five appearances over two stints with the Reds this season, including two scoreless innings Monday against the San Diego Padres.",
        "This weekend marks a homecoming for White Sox outfielder Andrew Benintendi, who played his high school baseball in the Cincinnati suburb of Madeira. He has played just three games at Great American Ball Park, going 1-for-9 in three games with the Boston Red Sox in 2017.The White Sox enter Cincinnati following their first series win, taking two of three from the AL Central-leading Minnesota Twins in Chicago. Before that, the White Sox were 0-8-1 in series play.\"We have some making up to do,\" White Sox reliever Keynan Middleton said. \"We are just starting to get going and rolling together.\"--Field Level Media"
    ]
}