{
    "articleURL": "/sport/football/article-12049735/Victor-Osimhen-plays-talk-Premier-League-winning-Napolis-historic-Scudetto.html",
    "content": [
        "The Nigerian striker broke another Serie A record with his history-making goalHis quality this season has caught the eye of clubs including Chelsea and PSG Naples erupts as fans celebrate the club landing first Serie A title in 33 yearsNapoli striker Victor Osimhen played down rumours that he might leave Naples after scoring the club's historic Scudetto-winning goal against Udinese on Thursday evening.",
        "The Nigerian forward, who is attracting increasingly strong interest from Manchester United, has been talismanic for Luciano Spalletti's side and made history on Thursday night when he became the highest-scoring African player to feature in Serie A in a single season, breaking Samuel Eto'o's record of 21 goals with his 52nd-minute strike.His quality leading the line for the title-winners has caught the eye of a number of big beasts alongside United, with Chelsea, Arsenal, Paris Saint-Germain, and Bayern Munich all said to be watching the player's next move closely. But a move away from the Campania side was the furthest thing from his mind as he drunk in the celebratory atmosphere. Speaking to Sky Sport Italia, Osimhen said he 'couldn't wait' to get back to Naples and enjoy the Scudetto with the fans. ",
        "'I'm thrilled with this victory,' Osimhen said. 'I'm happy for me, for the team and for the fans.'I can't wait to come back in Naples to embrace our fans, even though tonight I already felt the warmth of the people. I'm happy for all the Neapolitans. 'I scored the Scudetto goal, it's true, but anyone else could have scored it.'I feel like a leader and I never give up. Future? Now I want to enjoy this historic moment, this is not the time to think about my future.'",
        "The striker also reserved praise for his manager, who has had a checkered time at the Stadio Diego Armando Maradona since his arrival in 2021. At the end of last season, Spalletti's Fiat Panda was stolen and allegedly held hostage by fans who unfurled a banner that said the car would only be returned if he quit. But after overseeing a hitherto-unimaginable season, and becoming the oldest manager to win a Scudetto, all is likely forgiven.  'Spalletti is a great coach, he asks us a lot but he is like a father to all of us,' Osimhen continued. 'He always manages to motivate us and he deserves this title.'",
        "Osimhen is seen a crucial attacking target for Erik ten Hag's United should the club falter in pursuit of Harry Kane. Should Spurs chairman Daniel Levy refuse to adjust his stance on selling to Premier League rivals, United may look to bid for the Nigerian international as they reshape their squad during the upcoming transfer window. Any English club interested in securing Osimhen's services next season will have been boosted by news that the player's childhood idol and mentor Didier Drogba has advised him against a move to PSG. Speaking to French broadcaster Canal+, the Chelsea legend said that 'PSG is not the club he needs to continue his progress'. "
    ]
}