{
    "articleURL": "/news/article-12042001/Chris-Packham-tells-libel-trial-hes-sent-death-threats-compared-Jimmy-Savile.html",
    "content": [
        "TV presenter says he is 'victim of a campaign of vile and relentless intimidation' He added: 'Random dead animals and human faeces are regularly posted to me'Chris Packham today told a libel trial that he fears a 'psychopath' will 'turn up and kill me' as 'random dead animals and human faeces' are regularly posted to him. ",
        "On the second day of the trial at the High Court in London on Wednesday, the BBC Springwatch presenter began his evidence by saying he was a 'victim of a campaign of vile and relentless intimidation'.The TV naturalist is suing three men for libel over nine articles which included claims he defrauded and 'manipulated' people into donating to a charity to rescue tigers while knowing the animals were well looked after. Mr Packham is also accused of dishonestly raising money for the charity at the start of the Covid-19 pandemic while knowing it was due to receive a £500,000 benefit from its insurance. He revealed 'masked attackers' set fire to a car and burned down the gate to his home in October 2021, which local police are said to believe was carried out by paid professionals.",
        "The 61-year-old later said he fears for his and his family's security. He stated: 'I do go to walk my dogs in the woods and wonder: is today the day that a psychopath fuelled by all this hate turns up and kills me?'Mr Packham also said the men had 'repeatedly picked on and mocked my Asperger's syndrome' as well as comparing him to Jimmy Savile.In a 50-page witness statement, Mr Packham said his 'deeply held views' have attracted criticism from people who shoot and fox hunt - detailing some of the threats he receives. ",
        "'I have become accustomed to the plethora of dead animals people leave at my home,' Mr Packham continued. He added that he believed the 'defendants' unsubstantiated claims have misled, agitated and fuelled a vocal and violent conspiratorial fringe who increasingly post threatening and vile material about me and my family'. 'I genuinely no longer expect to live a long life free from violence and intimidation. Because it may only take the one wrong person to read Country Squire Magazine for things to go horribly wrong.'His barrister Jonathan Price previously said an 'enormous amount of puerile, offensive and damaging material' had been published about the presenter and that in letters between the defendants and his lawyers, he had been described as a bully and accused of 'the commission of rape and other sexual offences'. The presenter called these allegations 'totally unconscionable,' adding: 'They are ridiculous, utterly unfounded, and plainly designed to be as upsetting, threatening and reputationally damaging as possible.' He later denied fraudulently raising money for the charity, adding 'we weren't hopeful that we would be insured against Covid-19 closures'. He continued: 'The insurance payments... ultimately saved the sanctuary in what was a time of dire need. But to be very clear, if we had not launched the fundraising appeal as rapidly as we did then these payments may have arrived too late to make a difference.' ",
        "The strongly denied allegations, repeated in several tweets and videos, relate to Mr Packham's involvement with the Wildheart Trust, which runs a wildlife sanctuary on the Isle of Wight. Dominic Wightman, editor of the online site Country Squire Magazine, is defending the libel claim along with writer Nigel Bean and a third man, Paul Read. Lawyers for Mr Wightman and Mr Bean said the articles in the claim could be defended as true while Mr Read said he was not responsible for the publications as he was a 'mere proofreader'. Nicholas O'Brien, for Mr Wightman and Mr Bean, said the allegations in the articles in the claim were true and could also be defended as under the public interest. In written submissions, the barrister said: 'It is clear that the tigers had not been rescued from a circus, were not then in need of rescue, and were not rescued by Mr Packham.' However, Mr Packham said it was correct to use the word 'rescue' when talking about the tigers moved to the sanctuary. He said: 'They had been mutilated in that circus, teeth sawn off, claws torn out, leaving them with long term health issues. These animals were the victims of systematic long-term abuse and deprivation and thus any movement toward a clearly positive change constitutes a rescue.'",
        "The trial before Mr Justice Saini is due to conclude on May 12, with a decision expected at a later date. "
    ]
}