{
    "articleURL": "/wires/afp/article-12043549/Pakistan-register-ODI-series-win-New-Zealand-12-years.html",
    "content": [
        "Pakistan registered their first one-day international series win over New Zealand in 12 years with a hard-fought 26-run victory in the third match in Karachi on Wednesday.",
        "Imam-ul-Haq scored a 107-ball 90 while Babar Azam made a 62-ball 54 for his 26th ODI half-century to guide Pakistan to 287-6 in their 50 overs.Opener Tom Blundell hit 65 for New Zealand while debutant Cole McConchie struck an undefeated 45-ball 64 but the visitors were bowled out for 261 in 49.1 overs.Pakistan, who won the first two matches by five and seven wickets respectively in Rawalpindi, took an unassailable 3-0 lead in the five-match series.\"It's always a relief when you win a series and it was a good team effort,\" said Azam. \"We put (on) a good total and then (the) bowlers were outstanding.\"The focus is now to not relax and come out strongly for the next two matches and hopefully we can continue to give one hundred percent.\"The last two matches are on Friday and Sunday, also in Karachi.Pakistan's last ODI series win over New Zealand was in 2011 and since then they had lost six of the seven series, with one drawn.New Zealand threatened to run away with a win as Blundell and Will Young (33 off 41 balls) gave them a confident opening stand of 83 in 15.3 overs.Pakistan finally broke through with Young's run out off a direct throw from short third-man, before Mohammad Wasim dismissed Daryl Mitchell for 21 -- the man who had hit successive hundreds in the last two matches.",
        "Fifteen runs later, Blundell was also run out after failing to reach his crease in an attempt to complete a second run. He hit seven boundaries in his knock.Tom Latham, who made 45, and Mark Chapman (13) added 40 for the fourth wicket but pacer Naseem Shah bowled Chapman with a beautiful delivery before Latham was cleaned up by Wasim.McConchie tied valiantly to snatch a victory for New Zealand, smashing two sixes and six fours but ran out of partners.Naseem, Wasim and Shaheen Shah Afridi all took two wickets for Pakistan.\"The pitch probably slowed up a little bit,\" said New Zealand captain Latham. \"If we had a couple of partnerships here and there then things could have been a little different but we were not quite at our best.\"Earlier, New Zealand started well by getting the in-form opener Fakhar Zaman caught off Matt Henry for 19.Zaman, who had scored three hundreds in his last three ODI innings, had shaped up well before his fall, leaving it to Haq and Azam to steady the innings during their 108-run second-wicket stand.Azam hit three fours and a six before he chopped one onto his stumps off Henry.Haq was bowled by pacer Adam Milne in the 38th over.",
        "Abdullah Shafique struggled again as he managed just 19, but Agha Salman (31) helped Mohammad Rizwan (32) add 54 runs for the fifth wicket to lift the total.In the final overs, Mohammad Nawaz and Shadab Khan also chipped in with 11 and 21 not out respectively.Henry was the best bowler for New Zealand, taking 3-54."
    ]
}