{
    "articleURL": "/wires/reuters/article-12049491/Cardinals-staring-6-game-skid-Tigers-come-town.html",
    "content": [
        "The St. Louis Cardinals remain mystified by the season-long slump that has them dead last in the National League at 10-22.",
        "\"There's not one thing that sticks out that, if we would just do that better, that we'd be winning and playing better,\" first baseman Paul Goldschmidt after the Cardinals fell to the visiting Los Angeles Angels 11-7 on Thursday to complete a three-game sweep.\"We all have to look at ourselves and find ways that we can play better as individuals and as a team and make the necessary adjustments. I know everybody is trying to do that and will continue to do that, but it hasn't been nearly good enough so far,\" Goldschmidt added.The Cardinals have lost six straight games and nine of their last 10 as the Detroit Tigers come to town to open a three-game home series on Friday.\"Every coach in that clubhouse loses sleep over how to improve what's going on at the moment. That's the only thing that crosses your mind every minute of the day,\" Cardinals manager Oliver Marmol said. \"That's why this organization has been good for a long time. It's because everyone wakes up with the same thing in mind. We want to deliver for the city.\"Left-hander Jordan Montgomery (2-4, 3.34 ERA) will draw the start for St. Louis in the series opener. He took a hard-luck 1-0 loss to the host Los Angeles Dodgers on Satirday.",
        "Montgomery allowed the one run on five hits and two walks in 6 2/3 innings. He has struck out 13 and walked just three while allowing two runs (one earned) in 12 2/3 innings in his last two starts, and he was the losing pitcher both times.Montgomery is 1-1 with a 2.95 ERA in three career starts against Detroit.The Tigers will start left-hander Matthew Boyd (1-2, 5.47 ERA) while trying to carry the momentum from their three-game sweep of the New York Mets in Detroit.\"A series sweep against (that) team is pretty good,\" Tigers manager A.J. Hinch said. \"Playing as clean as we did, that's the most important thing.\"After starting the season 2-9, the Tigers have gone 11-8. They are coming off a 4-3 homestand.\"Even a couple of the games where we lost in the homestand, we're right in it, had a chance to win,\" Hinch said. \"Obviously we're chipping away at the wins and losses, but the style of the play and the offense warming up is a good sign.\"Boyd was beaten 6-4 by the Baltimore Orioles in his last start, the second game of a doubleheader on Saturday. He allowed all six runs on eight hits and a walk while setting season highs for innings worked (5 2/3) and pitches thrown (102).",
        "Before that loss, Boyd had allowed three runs or fewer while working five innings or fewer in his four starts. He has made one career start against the Cardinals. He allowed one run on two hits over seven innings in a no-decision in 2018.Cardinals infielder Nolan Gorman will be questionable for Friday after exiting Thursday's game with lower back tightness.\"It's something I've been dealing with and will deal with for however long,\" Gorman said. \"I just have to keep staying on top of it.\"--Field Level Media"
    ]
}