{
    "articleURL": "/tvshowbiz/article-12048481/Joy-Corrigan-showcases-incredibly-toned-frame-wearing-skimpy-lime-green-bikini-Miami.html",
    "content": [
        "Joy Corrigan proudly showed off her toned physique wearing a skimpy bikini as she enjoyed time at a beach during a trip to Miami on Thursday. ",
        "The former Sports Illustrated Swimsuit model, 28, who recent flaunted her figure while filling up her car at a gas station, soaked up the warm sun as she spent time on the sandy shore. The media personality, who currently boasts nearly 1million Instagram followers, donned a VDM The Label, lime green bikini bandeau top, which is priced around $45, according to the brand's official website. She additionally slipped into reversible, drawstring cheeky bottoms that were made of the same vibrant color, and can be purchased for nearly $42. The two-piece swimsuit showcased her slim frame as she showed off a few poses while spending time near the ocean.  ",
        "Joy threw on a pair of black shades for a stylish flare to her beachside look, and to also protect her eyes from the sun's rays. Her blonde locks were slightly dampened after she took a dip in the cool water, with the strands falling down naturally past her shoulders. The supermodel opted to not add any pieces of flashy jewelry as she spent the sunny day at the beach during her getaway to Miami. She was spotted strolling along the sand and also striked a few of her favorite poses while modeling the eye-catching swimsuit as the waves crashed down behind her.The Victoria's Secret model has been documenting her trip for her fans and followers, and uploaded a clip on her Instagram stories on Thursday as she relaxed under the shade from an umbrella. ",
        "The beauty angled her smartphone camera towards her as she took a big bite from a tasty sandwich. Crowds of people surrounded the star who were also enjoying time by the shimmering ocean. Joy also shared a short reel as she rested on a lounge chair and could be seen wearing a semi-sheer, neon green sundress that partially covered her bikini. The Alo Yoga ambassador panned the camera to show off her outfit and then tilted her phone upwards towards the crystal clear blue sky. 'Beautiful dayyyyy Miami!' she penned in a caption added towards the bottom of the video.  ",
        "During an interview on the FACTZ podcast last month in April, Joy opened up about confidence and inner beauty. 'For me, inner beauty-beauty from within, for myself, how I feel most beautiful is when I love myself,' she expressed to the host, Nik Richie. 'And when I meet people, too, who I think, \"Wow, that person was radiant, they were stunning, they were glowing,\" it's because I feel like they've discovered to fall in love with themselves.'She further added, 'And when you love yourself, you just shine and you're bright and you're confident and no one can explain it.' The blonde beauty, who is currently dating Ted Dhanik, filtered through a busy schedule before her beach getaway and recently spent time at the Coachella Music Festival last month in April during the first weekend.",
        "She showed off a variety of ensembles during her time in the California desert, such as a hot pink bodysuit while striking a few poses in what appeared to be a backyard. The supermodel later flashed her midriff while attending the Daily Front Row's 7th Annual Fashion Awards wearing a pair of mint green, loose-fitting trousers with a fuzzy trim on each side. Joy also added a cropped, multi-colored cropped top that was secured with buttons on the front. Along with making show-stopping appearances at glitzy events, she also puts her focus on her own clothing brand, Naked Species, which she co-founded with her sister, Gina."
    ]
}