{
    "articleURL": "/tvshowbiz/article-12055895/Jackie-O-Henderson-flaunts-sensational-18kg-weight-loss-party.html",
    "content": [
        "Jackie 'O' Henderson recently shed a whopping 18kg.",
        "And the Sydney radio queen, 48, looked sensational when she slipped into a figure-hugging pink dress for a pal's 40th birthday in Byron Bay over the weekend. Jackie showed off her slimmed-down frame in a low-cut pink dress by designer Rebecca Valance at the bash. The star was all smiles partied with her pal Gemma Jean and fellow radio star, Carrie Bickmore. Jackie opted for a glossy makeup look and wore her trademark blonde tresses in a sleek ponytail. She wore white Louboutin accessories. ",
        "'Weekend in Byron spent celebrating my besties 40th,' Jackie wrote. Jackie's fans went wild over the photos. 'Gorgeous,' wrote Delta Goodrem wrote. 'Divine,' added Jessica Rowe. 'You look incredible Jackie,' yet another added. The mother-of-one recently spoke about her new diet on The Kyle and Jackie O Show and said she often skips breakfast, a practice known as intermittent fasting.",
        "She also avoids carbohydrates, and satiates her hunger throughout the day by snacking on pre-cut pieces of steak.'I cook steak and slice it, and then I'll just have a little sliver of steak if I'm hungry,' Jackie said.She resists splurging on high-calorie foods for lunch, opting to eat just 'three little slivers of steak' and a few Vietnamese rice paper rolls containing fish and cabbage.Her co-host Kyle Sandilands was shocked by her small portion size, telling her: 'A dog would eat more!'",
        "For dinner, Jackie usually eats vegetables and a protein such as chicken or red meat.In between meals, Jackie treats herself to smoothies and Starbucks Frappuccinos, a type of blended ice coffee drink.",
        "Jackie was forced to warn her fans last month to be careful after scammers used her name to promote and sell diet pills.She shared a photo to Instagram of the fake campaign which featured images of her drastically photoshopped body.'Another day another scam!!! If you see me 'advertising' keto gummies, it ain't true. But I'm loving their Photoshopped pics,' she wrote."
    ]
}