{
    "articleURL": "/sport/football/article-12046043/Wrexham-head-Las-Vegas-expenses-paid-trip-Ryan-Reynolds-splashes-out.html",
    "content": [
        "Wrexham's players were promised a trip abroad if they won the National LeaguePhil Parkinson's side did it with 111 points and are now off to Las Vegas on a tripOwners Ryan Reynolds and Rob McElhenney are picking up the tab for four days Wrexham's promotion-winning players could not stop smiling as they boarded a flight for an all-expenses-paid trip to Las Vegas, with co-chairmen Ryan Reynolds and Rob McElhenney picking up the tab. ",
        "The National League champions were told that a 'monster' party lay in wait if they won the league, something they managed in style with a record 111 points to fire them back into League Two. Hollywood pair Reynolds and McElhenney, true to their word, have sorted a luxury four-day trip to Las Vegas, with a packed itinerary awaiting the footballers. Striker Ollie Palmer shared some photos from the airport as players, all decked out in Champions hoodies via his Wxm Clothing brand, prepared for the 10-hour flight to Sin City.Midfielder Jordan Davies and centre back Aaron Hayden were both touch-and-go for the trip as their partners were expecting but both have celebrated the birth of children in time to make Thursday's flight.",
        "It is set to be the trip of a lifetime and best of all, the players are not picking up the tab. 'It became a thing where if we won the league, we'd get a holiday. So we're off to Vegas,' star striker Paul Mullin, who bagged 47 goals this season, told GQ.'Ryan and Rob told us to leave our cards at home, they're sorting the lot. They sent us a full itinerary just now. 'Part of me doesn't want to go, I might be dead by the end of it! But I'd never go to Vegas by my own accord, so I'm buzzing for it.' ",
        "Speaking to CBS Sports, goalkeeper Ben Foster revealed that players have been promised a 'monster' party to blow off some steam.That they can as manager Phil Parkinson did not take up the opportunity to join his charges on the trip, as he focuses on building a squad capable of winning League Two next season.'I didn't make the cut for the Vegas trip, unfortunately,' he told Sky News.'We'll leave that one to the lads and hopefully, they will come back in one piece. I'm sure they will.'Along with Mullin and Palmer, fellow squad members Liam McAlinden, Ryan Barnett, Eoghan O'Connell, Sam Dalby and Max Cleworth, were pictured in the departure lounge this morning. ",
        "The Vegas trip comes just days after thousands of fans lined the streets of the North Wales city for an open-top bus parade, which Reynolds skipped the Met Gala to attend.North Wales Police estimated a turnout of 40,000 as fans roared on the men's and women's teams for their championship-winning seasons. Wrexham's increasing popularity - with more Google searches for the Welsh team than MLS in recent weeks - means players can expect a heroes welcome. Reynolds and McElhenney have arranged four friendlies in the US this summer, too, and so Parkinson's side will be back Stateside in July for games against Chelsea, Manchester United, LA Galaxy II and one unconfirmed team. "
    ]
}