{
    "articleURL": "/wires/reuters/article-12045157/Golden-Knights-hold-Oilers-Game-1.html",
    "content": [
        "Ivan Barbeshev scored twice and Mark Stone and Jack Eichel each had a goal and an assist as the Vegas Golden Knights overcame a four-goal performance by Leon Draisaitl to defeat the Edmonton Oilers, 6-4, in Game 1 of the Western Conference semifinals Wednesday night in Las Vegas.",
        "Game 2 of the best-of-seven series is Saturday afternoon in Las Vegas.Michael Amadio and Chandler Stephenson also scored and Zach Whitecloud added two assists for Vegas, which won its fifth straight playoff game. Laurent Brossoit made 23 saves.Draisaitl, who has 11 goals in seven playoff games, became the first Oilers player to score four goals in a playoff game since Hall of Famer Jari Kurri against Los Angeles on April 9, 1987. Connor McDavid, Zach Hyman, Evan Bouchard and Mattias Ekholm each had two assists and Stuart Skinner finished with 28 saves for Edmonton, which suffered its first regulation loss since a 7-4 setback at Toronto on March 11.Edmonton jumped out to a 1-0 lead at the 3:56 mark of the first period when Draisaitl one-timed a McDavid pass from the right circle past Brossoit's glove side for the Oilers' 10th power-play goal in 17 attempts in the playoffs.But Vegas tied it just 40 seconds later on a spinning wrist shot in the slot by Barbashev during a scramble in front of the net.The Golden Knights then took a 2-1 lead midway through the period on Amadio's second goal of the playoffs off a crossing pass from William Karlsson.Vegas extended its lead to 3-1 at the 18:23 mark on a power-play goal by Stone, who deflected Reilly Smith's shot from the right point past Skinner's blocker side for his fourth playoff goal.",
        "Edmonton cut it to 3-2 with 11 seconds left in the period when Draisaitl banked a shot from below the left goal line off the back of Brossoit into the net.The Oilers tied it at the 1:35 mark of the third period on another power-play goal by Draisaitl, who slapped in a rebound of a Hyman shot into an open right side of the net.But Vegas quickly answered with two goals in 50 seconds to go back in front, 5-3. Barbashev got the first when he deflected a Whitecloud point shot inside the left post. Stephenson followed with what would prove to be the game-winner on a one-timer from the right circle off a Stone pass.Draisaitl cut it to 5-4 at the 8:33 mark when he one-timed a shot off a McDavid pass from the right circle past Brossoit's blocker side.Edmonton, which drew a too many men on the ice penalty with 1:03 remaining while attempting to pull Skinner for an extra attacker, still pulled Skinner a few seconds later and Eichel sealed the win with an empty-netter with 34 seconds to go.--Field Level Media"
    ]
}