{
    "articleURL": "/wires/reuters/article-12044725/FOREX-Dollar-falls-Fed-signals-pause-banking-woes-dent-confidence.html",
    "content": [
        "By Rae Wee",
        "SINGAPORE, May 4 (Reuters) - The dollar slipped against most major currencies on Thursday after the U.S. Federal Reserve opened the door to a pause in its aggressive tightening cycle, though markets were buffeted by risk aversion amid a rout in regional U.S. bank shares.The Fed on Wednesday raised its benchmark overnight interest rate by a quarter of a percentage point, as expected, but in doing so dropped from its policy statement language that it \"anticipates\" further rate increases would be needed.That sent the U.S. dollar down broadly and Treasury yields sliding, with traders taking the comments as a signal for a peak in U.S. rates had been reached and moved to price in rate cuts later this year.In thinned Asian trade on Thursday, the British pound held at a roughly 11-month high of $1.2590, having reached that level in the previous session.Markets in Japan remain closed for a holiday.The euro was last 0.2% higher at $1.1083, flirting with its recent one-year peak.\"The most notable part of (the) statement was the section outlining the outlook for policy going forward, as the FOMC watered down its language regarding the need for additional monetary tightening,\" said Jay Bryson, chief economist at Wells Fargo.\"Additional tightening may be needed ... but the FOMC does not appear to be pre-committing to another rate hike on June 14.\"",
        "The U.S. dollar index was last 0.12% lower at 101.11, after dropping more than 0.6% in the previous session.Money markets are now expecting the Fed to keep interest rates steady at its next meeting in June, and have priced in roughly 80 basis points of rate cuts beginning July through to the end of the year.Adding to expectations that the Fed will soon have to begin easing monetary conditions were lingering fears of a banking sector turmoil, intensified by news that PacWest Bancorp is exploring strategic options, sending its shares and those of other U.S. regional lenders tumbling in after-market trading.The Los Angeles-based lender is hoping to avoid the fate of other regional lenders that were taken over by U.S. regulators in the last two months by proactively finding a solution that bolsters its finances, a source told Reuters.The cautious risk sentiment kept the Japanese yen - a traditional safe haven in times of market turmoil - well supported, with the currency pushing up just over 0.1% against the U.S. dollar to 134.51.It had jumped more than 1% on Wednesday, boosted by a slide in U.S. Treasury yields.The risk-sensitive Australian and New Zealand dollars likewise fell in Asian trade, with the Aussie sliding 0.32% to $0.6649.",
        "The kiwi was last 0.1% lower at $0.62235.\"There are a lot of concerns in the U.S. around the banking sector and the crunch on credit. This is a credit event and that feeds through to the economy quite quickly,\" said Jarrod Kerr, chief economist at Kiwibank.\"So I think central banks, including the Fed, are at or very near the peak in their cash rates.\"The European Central Bank (ECB) comes under the spotlight next, where expectations are for ECB policymakers to raise interest rates for the seventh meeting in a row later on Thursday.(Reporting by Rae Wee Editing by Shri Navaratnam)"
    ]
}