{
    "articleURL": "/wires/ap/article-12058983/What-horse-racing-doing-prevent-catastrophic-injuries.html",
    "content": [
        "The deaths of seven horses at the home of the Kentucky Derby has intensified the debate over the safety of horse racing.",
        "Two of the deaths occurred as the result of race injuries on Derby day, when more than 150,000 people jammed Churchill Downs.\"While each incident reported has been unique, it is important to note that there has been no discernible pattern detected in the injuries sustained,\" the track said in a statement that called the incidents \"unacceptable.\"In recent years, the industry has instituted a series of veterinary and medication reforms, which led to the fatality rate dropping.Here's a look at what horse racing is doing to try to prevent injuries and deaths.HOW COMMON ARE INJURIES AND DEATHS?",
        "The deaths at Churchill Downs gained greater attention because they occurred in the week leading up to the Kentucky Derby.There have been spates of deaths in recent years, most notably 30 at Santa Anita in California in 2019. Those led to a series of safety reforms that spread nationally.Protocol requires a necropsy when a horse dies on-track, and a review of contributing factors, vet records and interviews with stakeholders to learn the cause and what, if anything, could have been done to prevent it.\"It´s hard to explain and say it´s going to happen once in a while,\" said Mike Repole, co-owner of scratched early Kentucky Derby favorite Forte, \"but the reality is, unfortunately, it´s going to happen once in a while.\"",
        "California and New York have public databases that catalogue equine injuries and fatalities; Kentucky does not.According to a database kept by the Jockey Club, which oversees the breed registry for thoroughbreds in the United States and Canada, more than 7,200 horses died in races from 2009-21.A potentially catastrophic injury can occur anytime a horse is racing or even running in a paddock on the farm. The large animals´ spindly legs take a lot of concussive force.WHY ARE HORSES EUTHANIZED AFTER A LIMB INJURY?A leg injury in a horse can lead to complications as the other legs try to bear the pressure of an animal that weighs about 1,100 pounds. The bones in the leg don't just break, they often shatter completely, making it extremely difficult to repair or restore to their original form.Unlike humans who can be put on bedrest, horses are meant to spend most of their time moving. Horses at the track are brought out of their stalls daily to either race, do a timed workout or simply walk several laps around the inside of their barn. They're also bathed and groomed.Besides being resistant to having their legs restricted, horses can develop pressure ulcers if they lie down too long. Horses sleep standing up and don't worry about falling because of a system of tendons and ligaments that allow them to lock the major joints in their legs. If a horse cannot move its legs, the animal's blood circulation diminishes. Being confined to one place for an extended period of time can affect a horse's mental health as well.",
        "ARE THERE TREATMENT ALTERNATIVES?Costs for surgery or other treatments can be considerably high, although deep-pocketed owners of expensive thoroughbreds will often go to extreme lengths to preserve their investment.Even with treatment, a horse's chances of complete recovery can be slim. In order to spare the animal additional pain and stress, it is usually euthanized.WHAT IS RACING DOING TO ADDRESS INJURIES?Whether it's everyday races or the Triple Crown series - Kentucky Derby, Preakness and Belmont - horses undergo multiple, comprehensive vet exams and observations to ensure their fitness to run.Researchers at the University of Kentucky are working to identify a screening tool that can be used before races to identify horses at increased risk of injury. Funding for the study was provided by the Kentucky Horse Racing Commission's Equine Drug Research Council.The research involves analyzing blood samples from racehorses - both injured and non-injured - at tracks nationwide to see if there are changes in messenger RNA and whether there's anything that consistently differentiates horses that suffer a catastrophic injury, according to a 2021 article in Trainer magazine.The Horseracing Integrity and Safety Act - the sport's new national governing body - launched its racetrack safety program last year. Starting May 22, its antidoping and medication control rules take effect, giving the sport uniformity in post-race and out-of-competition testing, rulings and penalties. The new rules replace the patchwork system of standards in the 38 U.S. racing states that can vary by racetrack and location.",
        "WHO WAS BARBARO AND WHY DID HE MATTER?The colt won the 2006 Kentucky Derby and horrifyingly shattered his leg two weeks later in the Preakness, which ended his career.He had surgery for three broken bones in and around the fetlock of his right rear leg. Two months later, Barbaro developed laminitis in his left rear foot. He had five more operations during an extended stay at an equine hospital. Laminitis is common in horses who shift weight to one foot for extended periods to take pressure off an injured foot.Barbaro's initial injury and subsequent health battle endeared him to the public, which sent get-well cards to the hospital. His right leg eventually healed, but he developed laminitis in both front feet. Veterinarians and his owners, Roy and Gretchen Jackson, decided he could not be saved, and he was euthanized in January 2007.His plight led the Jacksons to endow a chair for equine disease research at the University of Pennsylvania's veterinary school, where the Barbaro Fund also was set up to help the treatment and care of large animals. College scholarships were created for students studying veterinary medicine and equine research.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}