{
    "articleURL": "/femail/article-12051163/We-tucked-Greggs-sausage-rolls-straight-wedding.html",
    "content": [
        "Lauren and Nathan Reynard went viral after tying the knot in Crewe last monthREAD MORE:  I'm dating a man who earns TEN TIMES less than I doA newlywed couple have been captured munching on Greggs sausage rolls just moments after saying 'I do' and social media users love the cute snap.",
        "Last month, Lauren, 29, and Nathan Reynard, 35, tied the knot during an intimate ceremony in Crewe and afterwards, came up with the best way to celebrate their new marriage.After exchanging rings, the pair decided to enjoy their favourite savoury snack on the steps of a municipal building.The adorable moment was captured by their wedding photographer, Charlotte Talbot and has since gone viral, even attracting the attention of the Greggs brand, who liked the picture on social media. 'We decided that we wanted something fun to do in the wedding photographs straight after the ceremony,' the snapper said. ",
        "'Due to it being a 9 am ceremony, Greggs was open, so we seized the opportunity and grabbed some Greggs sausage rolls and had some fun on the steps of the municipal buildings in Crewe.'It was so much fun! 'I've captured the couple through their pregnancy, their newborn photoshoot, and now their wedding day.'We know each other really well, so they are completely used to being in front of the camera and we just went for it and had a laugh whilst doing the photoshoot!'We did get some funny looks from people walking past as it's not very often you see a bride and groom eating a sausage roll at 9.30 am!'",
        "Both Nathan and Lauren loved the photos Charlotte managed to capture, and say they are a great addition to their wedding album.Lauren said: 'We really laughed when the photographer sent them over, we felt they perfectly reflected the fun light-heartedness of our relationship.'Charlotte, our photographer, was amazing! She made us feel so at ease and captured some beautiful moments between my husband and I, and our little one on the day.",
        "'We never in a million years expected that the photo of us eating our Greggs on the steps of the municipal buildings would gather so much attention and both Nathan and I, have laughed lots about it since.'After the ceremony finished both my husband and I were super hungry and I just said, 'Let's grab a Greggs before heading home.''We sat on the steps of the registry office eating our sausage rolls and our photographer caught us in the act!'Not exactly your typical wedding breakfast, but very typically us.'After the wedding, which took place on 17 March, Charlotte decided to drop Greggs a note to share the pictures but hadn't expected much to happen with it.",
        "The photographer was left blown away after finding out the British bakery chain had shared her picture on their social media pages.",
        "She said: 'I contacted Greggs to show them what we had got up to and was absolutely over the moon when they asked to share the photograph!'To see that people love it too makes me so happy!'As a wedding photographer, I am always looking for fun and different poses/ideas for couples and can't wait to try new ideas in the future!'Who knows what's next!'",
        "The iconic photo of Lauren and Nathan has received more than 5,000 likes on Instagram and has left people obsessed.Rumitha said: 'This is so perfect.'Someone else wrote: 'Only thing to make this better would be an éclair for dessert…''I mean I would do this too,' someone else wrote.One wrote: 'I had Gregg's for breakfast the morning of my wedding.'Another said: 'True love 100%.'One said: 'As long as they're happy!'One person wrote: 'Chef pulled out last minute. Never settle for second best!!'And another added: 'It's like roulette whether they are stone cold or hot.' [sic]"
    ]
}