{
    "articleURL": "/news/article-12055197/Low-key-fourth-birthday-party-Prince-Archie-Harry-Meghans-home-California.html",
    "content": [
        "Sources said Archie had a lemon cake baked using fruit from their garden Prince Harry rushed to Heathrow Airport straight after the Coronation servicePrince Archie enjoyed a ‘low-key’ fourth birthday party at home yesterday as his cousins took centre stage at the Coronation.",
        "Sources close to the Sussexes confirmed Archie had a ‘private celebration’ on his birthday at the couple’s £11 million mansion in Montecito, California, and a lemon cake baked by the Duchess of Sussex using fruit from their garden.Prince Harry left the Coronation straight after the service and rushed to Heathrow in a blacked-out electric BMW, where he was escorted to the VIP Windsor Suite.‘He was always determined to get back in time to spend part of Archie’s birthday at home,’ a source said.The Duke of Sussex is believed to have boarded a 3.45pm flight which would have seen him land in Los Angeles at 6.55pm local time. The drive to Montecito from Los Angeles airport takes about 90 minutes. The source said: ‘Harry was determined to be back in time to tuck Archie into bed.’",
        "When asked if any of the party guests included celebrity neighbours such as Oprah Winfrey, the source replied: ‘Some of their friends are celebrities, so yes, that’s likely. It will be a small, intimate gathering.’Archie’s grandmother Doria Ragland was expected to be at the party, as well as Meghan’s close friend, make-up mogul Victoria Jackson, 65. Another source told the MoS that Meghan ‘stayed home to celebrate Archie’s birthday because she felt it would be inauthentic to do anything else’. The source added: ‘She wanted to minimise the drama.’",
        "Her estranged father Thomas Markle, 78, told the MoS he believed ‘it was for the best’ that the Duchess stayed at home. ‘There are too many disagreements between Meghan, Harry and the Royals,’ he added.Mr Markle stayed up all night to watch the ceremony on TV at his home in Rosarito, Mexico. ‘It was wonderful to watch the good people of Britain welcome their new King and Queen,’ he said."
    ]
}