{
    "articleURL": "/news/article-12054335/Terrifying-moment-horse-rams-crowd-spooked-Coronation-procession.html",
    "content": [
        "Household cavalry horse was seen backing into a metal barrier in front of crowdsWere you there when the horse reversed? Email elena.salvoni@mailonline.co.ukCORONATION LIVEBLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.ukTerrifying footage shows the moment a spooked horse reversed into crowds lining the route of the King's coronation procession.",
        "The household cavalry charge backs into a metal barrier as it follows behind the carriage of the new monarch and Queen Camilla during their return to Buckingham Palace.The horse's rider, a member of the Life Guards, desperately tries to rein his steed in as it spun across the road. Guards ran to get out of the way as they noticed the horse careering towards them, as shown in the clip shared by the Express.Members of the public behind the barricade, who had lined up to catch a glimpse of the new monarch, also dispersed as they realised the danger they were in. ",
        "While no one appears to have been seriously hurt by the horse, which was quickly brought under control, one officer seems to be limping at the end of the shocking clip.It appears that her foot has been trampled on, and she is helped to her feet by colleagues.The King and Queen were accompanied by the Household Cavalry on their journey to and from Westminster Abbey.They travelled in the Diamond Jubilee State Coach alongside guard members mounted on their horses, the famous Cavalry Blacks. The Life Guards always ride black horses, except Trumpeters who ride grays.They wear scarlet tunics and metal helmets with white plumes, but after his struggle with his horse the rider in the video appears to be missing his.",
        "Were you there when the horse reversed? Email elena.salvoni@mailonline.co.uk "
    ]
}