{
    "articleURL": "/debate/article-12048741/TOM-UTLEY-historic-copies-weekends-Mail.html",
    "content": [
        "One of my few lasting regrets is that I failed to keep up my childhood collection of historically important newspapers, reporting the momentous events of my lifetime as they happened.Born as I was in the year of the last Coronation, it might have grown into a fascinating archive of the history of the New Elizabethan Age as it unfolded, to be passed down to my children and grandchildren.If I remember rightly, the earliest paper I kept recorded the world’s first manned space flight, by the Soviet cosmonaut Yuri Gagarin, which took place in 1961 when I was not yet eight. Other treasures in my collection included editions reporting the Cuban missile crisis of 1962, J. F. Kennedy’s assassination in 1963, the death and funeral of Sir Winston Churchill in 1965, England’s World Cup win in 1966, the Aberfan disaster that same year and the Apollo 11 moon landing in 1969.I also kept special editions, brought out to record General Election results and such royal events as the 1963 wedding of Angus Ogilvy to Princess Alexandra of Kent, granddaughter of George V and Queen Mary.",
        "RescuedAlas, however, I stopped collecting newspapers in the early 1970s, at about the same time as I gave up playing the oboe (another of my regrets). Soon after that, the papers I’d preserved went the same way as my vast collection of free mail-order catalogues and car manufacturers’ brochures — chucked out by my mother when I was away at university, in one of her desperate attempts to de-clutter our poky London flat.Why is it, I wonder, that so many women — including, I’m sorry to say, my own dear wife — have so much trouble distinguishing between their menfolk’s most prized possessions and heaps of old rubbish?Mind you, I can’t really blame my late mother for getting rid of my collection, since it was hardly in pristine condition. Many of the newspapers I’d kept had been torn or otherwise defaced by my schoolmates before I rescued them from the bin in the library at the boarding school I attended between the ages of eight and 13.Others were missing some of the biggest stories of the day, since my prep school’s headmaster would censor the papers before placing them in the library, taking scissors to reports he thought too racy for the boys in his charge.I remember, for example, that throughout the Profumo sex-lies-and-spies scandal of 1963, which precipitated Harold Macmillan’s resignation and Labour’s victory under Harold Wilson the following year, the papers arrived every morning in shreds. Presumably, the head was terrified of being asked: ‘Please, sir, what’s a prostitute?’What a very different age that was from the present day, when teachers are positively encouraged to discuss every imaginable sexual preference and practice with children fresh from the nursery. Some call this progress. I’m far from sure.Anyway, it’s highly unlikely that in its torn, ink-stained and censored state, my collection of old newspapers would have had much monetary value today, had it survived my mother’s decluttering. It might have been a different story, however, if instead I’d collected clean copies, still in mint condition.Indeed, I notice that even for recent editions bearing news of historically important events, the asking price on the internet represents a handsome premium on the sum demanded at the newsagent.Take the special issue of the Daily Mail dated Friday, September 9 last year, the day after the death of our late and much lamented Queen. Copies are already said to be fetching up to £30 on eBay — not a bad return on the 90p cover price at the time.",
        "PurgeGo back further, and you’ll have to fork out some £40 for the edition reporting Churchill’s resignation after his shock election defeat in 1945, which ushered in Clement Attlee’s radical Labour Government.Meanwhile, pristine copies of newspapers reporting the first moon landing have been known to sell for as much as $10,000 in America (call that not far short of £8,000 sterling).But it wasn’t with a view to financial gain that I started collecting papers all those years ago, or that I now regret having stopped.Nor am I claiming for one moment that my mother’s purge of my archive was the slightest loss to historical scholarship. After all, every one of the papers I kept can be read from cover to cover, through electronic libraries all over the world.No, I collected them, and now miss them, simply because there’s nothing quite like the look and feel of a contemporaneous newspaper to bring history alive, and to revive memories of how we felt and lived at the time when the events they reported happened less than 24 hours earlier.I’m not thinking only of the big stories on Page One of those papers I kept in the 1960s and early 1970s. Leaf further back through any newspaper of the time, and you’ll find that everything in it will place the main story of the day firmly in its wider, socio-historical setting.From the fashion and agony columns to the letters and motoring pages, the editorial comment and even the advertisements (or perhaps I should say particularly the advertisements), those yellowing pages conjure up a lost era quite as vividly as even the most scholarly history book or TV documentary.Above all, they bring home how radically society and its attitudes have changed since the first decades of the late Queen’s reign, which began long before the arrival of the first basic pocket calculator and ended at the dawn of the age of Artificial Intelligence.",
        "HandsomeThey remind us that these were the years when there were only two TV channels, all transactions were conducted by cash or cheque, millions still felt safe to leave their doors unlocked and older folk were outraged by the Beatles’ haircuts. Oh, and everyone would have laughed with incredulity had you predicted that one day a Leader of the Opposition would be unable to say with any certainty whether or not women had penises.Indeed, the very holes in my collection of papers, where the headmaster’s scissors had been at work, told part of the story of how radically the way we live has changed in the course of my lifetime, both for the better and, yes, for the worse.As for what will change in the course of the new reign, I can no more predict that than I could have told you back in 1961 — when I started my collection — that one day I would be able to navigate my car by satellite and communicate in an instant with anyone in the world, both in sound and pictures, using a tiny, cordless telephone.But I reckon it’s pretty safe to prophesise that those who buy the Mail and its sister The Mail on Sunday over this bank holiday weekend will see handsome returns on their investment, if they manage to hang on to their copies and keep them in good condition for long enough.Even if I’m wrong, however, I would urge children bitten by the collecting bug to try building their own newspaper archive of the reign of Charles III. Whether or not it appreciates in value, they will find it a rich source of interest in years to come — and where better to start than on the day of the King’s Coronation?Just one word of warning: if you do build a collection, don’t make the same mistake as I did. Be sure to keep it well out of reach of all decluttering mums!"
    ]
}