{
    "articleURL": "/wires/ap/article-12046103/Daughter-ousted-Thai-prime-minister-win-old-job.html",
    "content": [
        "BANGKOK (AP) - She has confidence, she has charisma, but most of all she has the family name and a face that reminds many of her famous father. In the race to become Thailand´s next prime minister, opinion polls show Paetongtarn Shinawatra to be the heavy favorite to take the post after the May 14 general election.",
        "But some fear that victory for the youngest daughter of ousted former Prime Minister Thaksin Shinawatra - the country´s most divisive figure - could plunge Thailand back into a familiar cycle of protest and military intervention.Having the 36-year-old Paetongtarn on the ballot is expected to pay off handsomely for the popular Pheu Thai opposition party. It´s polling so well that it´s hoping for a landslide victory, with enough seats to overcome the ruling party's built-in edge and name the prime minister.While Paetongtarn is the clear vote-getter of her party´s three candidates, any of the three could emerge from post-election wheeling and dealing as Thailand´s new leader.At a registration event for candidates in March, Paetongtarn outlined policies including improving labor conditions, guaranteeing a higher minimum wage, reducing pollution, and turning Thailand into a financial technology hub.Paetongtarn's 73-year-old father was the first Thai politician ever to win an overall majority of seats. Although the billionaire businessman's populist policies built him a powerful political base, they also earned him the enmity of the country´s elite. Thaksin was ousted by a military coup in 2006 and has been in self-imposed exile for over a decade to avoid serving a prison term for abuse of power, a conviction he has decried as politically motivated.",
        "Still, he remains close to the hearts of million of voters, especially the country´s poor and residents of the relatively disadvantaged north.Paetongtarn insists she is not merely a proxy for her father.\"It´s not the shadow of my dad. I am my dad´s daughter, always and forever, but I have my own decisions,\" she told a reporter at a recent rally.Thaksin-backed parties thrived at the polls since Thaksin won his first election in 2001, but were unable to stay in office for long due to legal challenges in the courts - firmly aligned with the conservative establishment - and destabilizing street protests engineered by his die-hard foes.In 2011, Thaksin´s sister Yingluck Shinawatra - Paetongtarn´s aunt - was swept into office with an easy election victory, becoming Thailand´s first female prime minister. But her government was ousted by another coup in 2014 carried out by then-army commander Prayuth Chan-ocha, who led a military government for five years and was then named prime minister after the 2019 general election. Like her brother, she went into exile to avoid legal consequences.Prayuth, 69, is now running for reelection, but he's struggled to compete with Paetongtarn's political savvy. He is generally ranked a distant third in opinion polls for the preferred prime minister candidate, while his United Thai Nation Party has a similar but slightly weaker position with about 10% support.",
        "Paetongtarn has shown her determination by carrying out a busy campaign schedule right until she gave birth to a second child this week. From the hospital where she delivered her newborn son Prutthasin, she told the media she was ready to get right back to the hustings.\"She connects with the electorate, the base. She also has, I think, some talent that may have been inherited from her father in terms of going out on stump speeches, connecting with voters, speaking in front of large crowds, and running a campaign, while being pregnant,\" said Thitinan Pongsudhirak, a professor of political science at Bangkok´s Chulalongkorn University. \"She is definitely prime minister material.\"Under Thailand´s electoral system, even if Pheu Thai wins a majority of seats, it does not automatically name the prime minister. That´s up to a joint vote of both houses of parliament, giving the unelected 250 members of the Senate a major voice. The Senators, appointed under the 2014-2019 military government, are a linchpin of the conservative ruling class, and cast their votes as a bloc in 2019 for Prayuth, the military´s favored candidate.A strong Pheu Thai Party performance would threaten the military´s almost nine-year hold on power and could reignite animosity towards the family that erupted into months of street protests in 2013 and 2014 against the Yingluck government.",
        "For some people, a Shinawatra as prime minister is a step too far, even if fairly elected.\"A lot of people love them but you have a large number of conservative people who are against Thaksin and his family,\" said Prajak Kongkirati, a political scientist from Bangkok´s Thammasat University. \"So the fact that he put his daughter for the candidate, you know, might turn off a lot of conservative people and can stir up emotion from conservative side again.\"Paetongtarn recently downplayed the chances of another coup.\"I´m not the one who invented the coup d´etat or anything but, actually, I have a very high hope that it´s not going to happen again and I believe it´s going to be a lot harder that the coup will happen again,\" she said.There has been widespread speculation that Paetongtarn may be counting on a deal with Prawit Wongsuwan, a 77-year-old former general who is Prayuth´s deputy prime minister, but is competing against him in this year´s election with the military-aligned Palang Pracharath Party.Pheu Thai leaders have denied a deal, but there´s persistent speculation that the Thaksin-supported Pheu Thai Party might bring him into a post-election coalition to calm the establishment.___Find more of AP´s Asia-Pacific coverage at https://apnews.com/hub/asia-pacific"
    ]
}