{
    "articleURL": "/wires/reuters/article-12039485/Turkey-trade-data-reflects-agreement-stop-flow-Western-goods-Russia-US-official.html",
    "content": [
        "By Daphne Psaledakis",
        "WASHINGTON, May 2 (Reuters) - Turkey's trade data has started to reflect that Ankara has stopped allowing the re-exportation of sanctioned Western goods to Russia after repeated warnings from Washington, a senior U.S. Treasury Department official told reporters on Tuesday.Washington has stepped up diplomatic pressure on countries and private companies globally to ensure enforcement of the barrage of sanctions it has unleashed on Moscow over its invasion of Ukraine, warning that it will take action against those helping Russia.Turkey's exports to Russia stood at $730.36 million in April, dropping 19.2% from $904.05 million in March, data from the Turkish Exporters Assembly (TIM) showed. The country's exports to Russia were still up 85.4% in April compared with the same month last year, according to the data.James O´Brien, head of the U.S. State Department´s Office of Sanctions Coordination, said last month that Washington would monitor Ankara's trade data with Moscow in anticipation of a drop after Turkey, under pressure from the G7, agreed to stop the transit to Russia of Western goods prohibited under sanctions.The United States and its allies imposed extensive financial penalties on Russia following its invasion of Ukraine, and Washington has since sought to crack down on sanctions evasion. But supply channels have remained open from Russia's Black Sea neighbor Turkey and other trading hubs, including Hong Kong.",
        "Senior Treasury officials traveled to Europe and Central Asia last month in an effort to improve sanctions enforcement, meeting with government counterparts, financial institutions and private businesses.Assistant Secretary for Terrorist Financing and Financial Crimes Elizabeth Rosenberg will travel to the Netherlands and Germany next week to discuss sanctions, another official said on Tuesday.The trip follows her visits to Kazakhstan and Kyrgyzstan last week, and travel to Switzerland, Italy, Austria and Germany by Under Secretary of the Treasury for Terrorism and Financial Intelligence Brian Nelson.Nelson and Rosenberg at their meetings warned that Russia was using evasive methods to acquire goods.The senior Treasury official on Tuesday said that while Washington generally aims to work with partner countries, the United States will act unilaterally if it sees activity and cannot get partner engagement to take action.A second senior Treasury official said Washington reviews trade and customs data to see where there is an increase in goods being sent to Russia.The Commerce Department also conducts end-user checks, the official said, and the United States sees information in intelligence channels, including from partners and financial transaction records. (Reporting by Daphne Psaledakis in Washington; Additional reporting by Humeyra Pamuk and Ali Kucukgocmen in Istanbul Editing by Don Durfee and Matthew Lewis)"
    ]
}