{
    "articleURL": "/wires/pa/article-12038245/Woman-says-daughter-three-grandchildren-seven-dead-Oklahoma.html",
    "content": [
        "A registered sex offender found dead on a rural Oklahoma property with his wife, her teenage children and two visiting teenagers was quiet but kept the family “under lock and key” and always had to know where they were, the wife’s mother has said.",
        "Janette Mayo, 59, of Westville, said Jesse McFadden’s controlling behaviour was concerning, but the family did not learn about his criminal history until a few months ago.“He lied to my daughter, and he convinced her it was all just a huge mistake,” Ms Mayo told The Associated Press.“He was very demure. He was very standoffish, generally very quiet, but he kept my daughter and the kids basically under lock and key. He had to know where they were at all times, which sent red flags up.”Okmulgee County Sheriff Eddy Rice said on Monday that the bodies found near the town of Henryetta were believed to include those of two missing teenagers, Ivy Webster, 14, and Brittany Brewer, 16, along with McFadden, the felon with whom authorities said the teenagers had been travelling.But Mr Rice said the state medical examiner would have to confirm the victims’ identities.“We are no longer looking,” Mr Rice said, adding: “Our hearts go out to the families and friends, schoolmates and everyone else.”Ms Mayo said the sheriff’s office notified her late on Monday that the other four victims were her daughter, Holly Guess, 35, and her grandchildren, Rylee Elizabeth Allen, 17; Michael James Mayo, 15; and Tiffany Dore Guess, 13.Ms Mayo said Tiffany Guess was close friends with Ivy and Brittany, who were spending the weekend with the family.",
        "While Mr Rice declined to provide details of how they died, Ms Mayo said the sheriff’s office told her that her daughter and grandchildren were all found shot dead on the property.The grim discovery in Oklahoma keeps the US on a torrid pace for mass killings in 2023 and could push the number of people slain in mass killings past 100 for the year.The bodies were found on Monday during a search near the town of Henryetta, a town of about 6,000 people located about 90 miles east of Oklahoma City, Oklahoma State Bureau of Investigation spokesman Gerald Davidson said.A missing endangered person advisory had been issued earlier in the day for the two teenagers before it was cancelled on Monday afternoon by the Oklahoma Highway Patrol.The advisory for Ivy and Brittany had said they were reportedly seen travelling with McFadden, who was on the state’s sex offender registry.Oklahoma Department of Corrections prison records show McFadden was convicted of first-degree rape in 2003 and released in October 2020.Court records show McFadden was scheduled to appear in court on Monday for the start of a jury trial on charges of soliciting sexual conduct with a minor and possession of child pornography.A message left on Monday evening with McFadden’s lawyer in that case was not immediately returned.",
        "Brittany Brewer’s father told KOTV in Tulsa that one of the bodies discovered was his daughter.“Brittany was an outgoing person. She was actually selected to be Miss Henryetta … coming up in July for this Miss National Miss pageant in Tulsa. And now she ain’t gonna make it because she’s dead. She’s gone,” Nathan Brewer said.At a Monday night vigil, Mr Brewer told hundreds of people: “It’s just a parent’s worst nightmare, and I’m living it.”He said his daughter had aspired to be a teacher or a veterinarian.“I am just lost,” he added.Henryetta Public Schools posted on Facebook and its website that it is grieving over the loss of several of its students.“Our hearts are hurting, and we have considered what would be best for our students in the coming days,” the note said.Officials said school would be in session, and mental health professionals and clergy would be on hand to help counsel students.But they said they would understand if families want to keep their children home from school.In a separate Okmulgee County case, the bodies of four men were found on October 14 in the Deep Fork River in Okmulgee, a town of around 11,000 people that is about 40 miles south of Tulsa.",
        "Joseph Kennedy, 68, is facing four counts of first-degree murder in that case."
    ]
}