{
    "articleURL": "/femail/article-12046983/Crown-jewels-Kings-Queens-world-unite-Charles-coronation.html",
    "content": [
        "King Charles broke from 900-year tradition banning crowned royals from coronations for today's eventHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk READ MORE: King Charles Coronation LIVE: Millions tune into Coronation ceremony as King is crowned and Queen Camilla, Harry, Kate and William watch - latest updatesMonarchs from around the world made their way to Westminster Abbey today, to watch the coronation of King Charles.",
        "In a break from tradition, King Charles added crowned royals to the guest list for this coronation, meaning a number of kings and queens were able to take part in the pageantry.For centuries, convention dictated that no other crowned royals should attend the coronation of a British monarch, in a tradition that lasted for 900 years.This was based on the idea that the sacred event should be an intimate exchange between the monarch and their people, in the presence of God. But Charles decided to move on, which marks one of the ways he has tried to modernise the ceremony, meaning his crowned friends, including European royals and rulers from Arab states made it onto the guest list.Among the royals leading the glamour were Princess Charlene of Monaco and Queen Letizia of Spain, among others.Prince Albert of Monaco and Princess Charlene of Monaco",
        "He was the first European royal to confirm his attendance at King Charles' coronation, revealing the news at the end of January. And Prince Albert of Monaco, 64, spoke fondly of the British king, whom he described as 'a very educated man and someone with a great sense of humour'.He also suggested he was looking forward to the event, telling PEOPLE magazine he was 'certain that it's going to be an incredible ceremony and a very moving one'.",
        "He added: 'I'm certain His Majesty will add his own personal touches to the ceremonies, but what those will be, I'm sure I don't know.' Albert was accompanied by his wife Princess Charlene of Monaco.The South-African Olympic swimmer's marriage to Prince Albert has been plagued by controversy in recent times, with Albert admitting to two illegitimate children and Charlene spending a significant amount of time outside of Monaco. However they put on a united front today, and entered the service together.The pair share eight-year-olds Jacques, Hereditary Prince of Monaco and Princess Gabriella, Countess of Carladès, however the twins were not with them today.Princess Charlene was chic on in a two-piece trouser suit in cream. She donned a matching cream hat, worn atop her cropped hair.   King Felipe and Queen Letizia, Spain",
        "Queen Letizia of Spain, who worked as a journalist before she married King Felipe, was in attendance today, with her husband King Felipe of Spain.Felipe is a distant cousin of Charles: his mother, Queen Sofia, was a third cousin of the Queen and a first cousin once removed of the Duke of Edinburgh. Following the death of Queen Elizabeth, who Felipe celled Aunt Lilibet, the Spanish royal wrote a touching letter to Charles.He wrote: 'Your Majesty, dearest Charles,",
        "'Deeply saddened by the sorrowful news of the passing of Her Majesty Queen Elizabeth II, your beloved mother.'I would like to offer Your Majesty and the British people, on my behalf and on the behalf of the Spanish government and people, our most heartfelt condolences.'King Abdullah II and Queen Rania, Jordan",
        "Queen Rania was also typically chic as she arrived at today's ceremony with her husband King Abdullah.Like many of the other royal women in attendance, she wore a monochrome outfit.Her long-sleeved midi-length, which boasted long sleeves and a high neck, were perfectly paired with cream pumps.Following the death of Queen Elizabeth II last year, Rania, 52, paid tribute to the late monarch who she described as 'elegant in the way she lived her life'.At the same time, she spoke warmly of King Charles, describing him as 'incredibly intelligent.' King Willem-Alexander of the Netherlands  and Queen Máxima",
        "Queen Maxima attended alongside her husband King Willem-Alexander. The 51-year-old opted for a pale dress in cream, which fell to just below her knees. The frock was accompanied by matching gloves, and a pale hat.Maxima opted for towering heels, donning nude stiletto pumps, which matched the nude clutch bag she carried in one hand. King Willem-Alexander is distantly related to King Charles - he was the Queen's fifth cousin once removed thanks to an ancient connection in their family tree. ",
        "Willem-Alexander is a descendant of Princess Carolina of Orange-Nassau, who was the daughter of William IV, Prince of Orange, and his wife Anne, the eldest daughter of King George II of Great Britain and his consort Caroline of Ansbach.King Carl XVI Gustav of Sweden and Crown Princess Victoria ",
        "The Swedish royals attending the coronation were King Carl XVI Gustav and his daughter Crown Princess Victoria.At the age of 75, Carl is the longest reigning monarch in Swedish history, having took to the throne in 1973.There are familial ties between the Windsors and the Swedish royals: King Gustav is a great-great-grandson of Queen Victoria and was a third cousin of the late Queen Elizabeth.Crown Princess Victoria looked suitably regal at the coronation, wearing a royal blue fitted midi-dress, with matching shoes and hat. Crown Prince Haakon and Crown Princess Mette-Marit of Norway",
        "There has long been a bond between the British and Norwegian royal families, which intensified after Germany visited Norway in 1940, and the royals came to stay in the UK.Charles was names after the former King Haakon VII, who was known colloquially among friends and family as Carl, and called Uncle Charles by Queen Elizabeth.Crown Prince Haakon is the great grandson of Haakon VII, and represented his family at the coronation today alongside his wife the Crown Princess Mette-Marit.",
        "Haakon donned ceremonial military attire for the event. Meanwhile, Mette-Marit was elegant in pale pink, wearing a monochrome outfit with matching midi-dress, hat, gloves and stiletto pumps.Haakon is heir apparent to the throne of Norway. Despite being older, his sister Princess Märtha Louise of Norway is fourth in line to the throne due to Norway's succession rules.Mette-Marit was born a commoner, to farmers in Norway and was a single mother by the time of her engagement to Crown Prince Haakon in 2000.She became Crown Princess after the couple's marriage in 2001. Mette Marit has spent her reign championing humanitarian projects while joining official visits.Her first official appearance was at the Nobel Peace Prize ceremony at Oslo City Hall on December 10, 2000, following the announcement of the couple's engagement on December 1.Crown Prince Frederik of Denmark and Crown Princess Mary",
        "Crown Prince Frederik of Denmark was in attendance today alongside his wife Crown Princess Mary.Mary opted for a more colourful ensemble than some of the other royal women, opting for a vibrant purple outift.She matched her coat dress, which fell to just below knee length, with a purple fascinator and stiletto heeled pumps. Queen Margrethe - who is the only living European queen since the death of Queen Elizabeth - was unable to attend due to back surgery.",
        "King Philippe of Belgium and Queen Mathilde ",
        "The Queen's distant cousin King Philippe of Belgium also attended the coronation, and was snapped walking in alongside his wife, Queen Mathilde.Philippe is very distantly related to Charles, via King Christian IX of Denmark, known as the 'grandfather of Europe' due to his far-reaching family tree.The late Queen Elizabeth II was the Christian's great-great granddaughter, while Philippe is his great-great-great-grandson.King Philippe and Queen Mathilde attended the service without their four children.Grand Duke Henri of Luxembourg and Grand Duchess Maria Teresa",
        "The Grand Duke of Luxembourg and his wife Maria Teresa were also guests at today's ceremony.Maria Teresa bucked the trend of wearing a midi-dress, and instead, opted for a stylish trouser suit in midnight blue. The garment boasted on-trend flared trousers and a long length blazer.She opted for statement jewellery, opting for silver pieces including a necklace, bracelet, and brooch.Hereditary Prince Alois and Hereditary Princess Sophie, Lichtenstein",
        "Alois, the Hereditary Prince of Liechtenstein was one of the guest royals today, accompanied by his wife Hereditary Princess Sophie of Liechtenstein.The royal, 54, whose father Hans-Adam II, the reigning Prince of Liechtenstein, was an eighth cousin of Queen Elizabeth, donned a classic suit with tails for today's event. Meanwhile, mother-of-four Sophie wore a knee length dark lavender shift dress, with a matching coat and hat. She completed the ensemble with a pair of nude slingbacks and a small clutch bag. King Jigme Khesar Namgyel Wangchuck and Queen Jetsun Pema, Bhutan",
        "King Jigme, the hugely popular fifth Druk Gyalpo, studied in the UK and the US and ascended the throne in 2006, aged just 26 after his own father abdicated.He was accompanied at the coronation today by Queen Jetsun Pema, who wore a purple, full length gown for the occasion, worn with coordinating nude pumps and a clutch bag.He attended a reception hosted by King Charles III at Buckingham Palace following the death of Queen Elizabeth II.King Vajiralongkorn and Queen Suthida, Thailand",
        "The Thai King and Queen were in attendance at Westminister Abbey today.The revealed ahead of the weekend that they would be attending a May 5 reception given by King Charles for invited heads of state and overseas representatives at Buckingham Palace.King Tupou VI and Queen Nanasipau'u, Tonga",
        "Tupou VI, who has reigned as the King of Tonga since 2012, attended the coronation with his wife Nanasipauʻu Tukuʻaho.During his reign, the monarch has nurtured his close links with the British Royal Family.In 2018, Tupou met with the Duke and Duchess of Sussex during their tour of Australia and New Zealand.His brother, Oxford-educated King George Tupou V passed away in a Hong Kong Hospital at the age of 63 in 2012, the cause of death believed to be linked to kidney problems.Yang di-Pertuan Agong and Raja Permaisuri Agong Tunku, Malaysia ",
        "Yang Di-Pertuan Agong XVI and the Raja Permaisuri Agong jetted in from Malaysia to attend the major royal event in London this weekendYang di-Pertuan Agong Abdullah, 63, became the King of Malaysia in 2019. As a young man, he completed his military training in the UK at Royal Military Academy Sandhurst.King Charles held an audience with the couple at Buckingham Palace last October, marking one of his first engagements after the two weeks of mourning for the late Queen ended.Crown Prince Akishino and Crown Princess Kiko, Japan ",
        "Japan's imperial household announced last month that that Crown Prince Fumihito and Crown Princess Kiko would represent Emperor Naruihto, 63, at the coronation. The Crown Prince is the current heir presumptive.During the week, the royal couple were pictured arriving at Claridge's hotel in Mayfair, where they will stay for their three day trip. According to the Imperial Household Agency, Japan received an invitation from the British Royal Family to the coronation in March.Although Emperor Naruhito and his wife Empress Masako attended the Queen's funeral in September 2022, the ruler asked his younger brother Crown Prince Fumihito, 57, to represent him at the coronation. Queen Anne-Marie of Greece, with Crown Prince Pavlos and Crown Princess Marie-Chantal",
        "Queen Anne Marie of Greece was snapped walking into the ceremony with her son Crown Prince Pavlos of Greece and his wife Crown Princess Marie-Chantal.Prince Pavlos is the eldest son and second child of Constantine II, the last King of Greece from 1964 to 1973 and his wife.Despite the Royal Family being abolished in Greece, the British royals still have a close relationship with their distant royals.In the 1990s, Constantine was stripped of his Greek citizenship and the state seized Tatoi and a palace on the island of Corfu - where Britain's Prince Philip was born.Today's two-hour service, pared back Queen Elizabeth's in 1953, is a pivotal moment in the history of the Royal Family, and will balance ancient tradition and a future in the 21st century. More than 100million people around were predicted to watch the historic first coronation of a British monarch in 70 years - with an estimated 2million people taking to the streets of London to watch history unfold. "
    ]
}