{
    "articleURL": "/wires/pa/article-12041833/Train-given-Welcome-Liverpool-makeover-ahead-Eurovision.html",
    "content": [
        "A train has been given a makeover to celebrate the Eurovision Song Contest.",
        "TransPennine Express (TPE) added the Eurovision logo and a “Welcome to Liverpool” message to one of its Nova 2 trains as the city prepares to host the competition.Soprano Morgan Carter performed operatic classics for passengers and railway workers as the new livery was unveiled at Manchester Airport station.",
        "Liverpool is hosting Eurovision on behalf of last year’s winner, war-torn Ukraine.An outdoor welcome party will be held on Sunday night. The semi-finals take place on May 9 and 11, with the final on May 13.TPE provides services into Liverpool Lime Street from cities across northern England and into Scotland.The operator has installed Eurovision song zones at some of its stations to enable local musicians to show off their talents to passengers waiting on platforms. We’re proud that Liverpool and the UK is stepping up in support of Ukraine and we wanted to get into the rhythm of the musical extravaganza by wrapping one of our Nova 2 trains in Eurovision livery  Matthew Golton, TransPennine Express  Managing director Matthew Golton said: “We’re delighted that the Eurovision Song Contest is being held in such an iconic northern city that has music running through its veins.“We’re proud that Liverpool and the UK is stepping up in support of Ukraine and we wanted to get into the rhythm of the musical extravaganza by wrapping one of our Nova 2 trains in Eurovision livery.",
        "“Listening to Morgan serenading the train and passengers as it departed on its first journey across the North was a fantastic experience and certainly built the excitement ahead of the main event.”Hundreds of thousands of people are expected to visit Liverpool for Eurovision.Merseyrail, which runs trains across Merseyside and neighbouring areas, is running extra trains after midnight to enable more people to travel by public transport after events on Sunday and May 13. I'm confident that the plans we have at Merseyrail will ensure that everyone will have a great time and get back to their home or hotel when the partying ends  Jane English, Merseyrail  It warned that central Liverpool stations would be “extremely busy”, with access restricted at certain times to avoid overcrowding.Merseyrail acting managing director Jane English said the operator had worked with Eurovision organisers and local authorities to draw up “comprehensive plans which aim to support this internationally important event”.She went on: “I’m confident that the plans we have at Merseyrail will ensure that everyone will have a great time and get back to their home or hotel when the partying ends.“Travel light if you can. Busy services will mean less room for large items of luggage.“We will get everybody where they need to be, when they need to be there, through the whole week.",
        "“Passengers really need to plan ahead, and check timetables and information on the Merseyrail website, app or Twitter account before travelling.”"
    ]
}