{
    "articleURL": "/tvshowbiz/article-12061367/Georgia-Toffolo-reveals-wanted-normalise-acne.html",
    "content": [
        "Georgia Toffolo has revealed that she wanted to 'normalise' acne as she bared her makeup-free skin on I'm A Celebrity South Africa.",
        "The former Made In Chelsea star, 27, - who was eliminated with Andy Whyment on Monday's episode - told in her exit interview that she was proud for breaking through her urge to cover up with concealer. Toff has been open about her skin struggles over the years and admitted she didn't feel totally herself on the show without her makeup 'war paint' as she suffered a flare up.  She explained: 'If I'm being really honest, I've been on a really big journey with my acne. When I was in there, my skin really flared up and it was really aggressive acne.'There was a part of me that kept on thinking, 'I really want my concealer.' Because I'm being really honest, I'm not totally myself when I haven't got my war paint on. ",
        "'But I've been suffering with it now for 15 years and it was really important to me that I didn't hide behind my concealer. 'There are so many people that struggle with it like I do. And I wanted people to see that a) that's normal and b) that even if you've got every single privilege in life that I do, you can still have it.'She continued: 'It doesn't matter how well off you are, what school you went to or if you're a celebrity - you can still suffer with it. And that's all right. It's not something to hide behind. ",
        "'And I hope that people take that away, that would make me really happy that people look at it and think, 'You know, she normalised it and she went on the telly. Millions of people have watched her twice now and it didn't get her down.' 'So I think that's my biggest takeaway. I'm 27 now and I feel like it's important to show that you can have the spots, but you can also be beautiful at the same time. I had to break through that so I'm really proud of myself.Andy and Georgia were eliminated from I'm A Celeb South Africa on Monday night's episode. The Corrie star, 42, and Toff from the green pride lost out to yellow pride's Jordan Banjo and Myleene Klass. ",
        "The group went head-to-head in the gold mine trial, with the winners earning a luxury picnic, while the losing pair were sent home. As she left Toff said: 'It's been glorious! It has just been amazing. Doing it twice has been really immense.'Andy added: 'Thanks for having me back!', before the pair boarded their boats back to civilisation.Viewers were sad to see the pair both leave as they complained that two entertaining and strong contestants were going home. One said: 'WHY YOU ANDY AND TOFF!', while another said: 'I’m sorry but why are all the best ones going home first Shaun and now Toff.'",
        "Another said: 'Not Toff and Andy going', while a fourth said: 'Kinda don’t wanna carry on watching Toff was my fave.'A fifth said: 'toff was carrying the show can’t wait for absolutely dead content now.'Viewers kicked off on Friday night as the show ended on a dramatic cliffhanger ahead of the double elimination.Fans were far from impressed with the 'cruel' twist as they took to Twitter to vent their fury, with one even asking: 'What are you playing at?!''Making us wait till Monday?!' fumed one person, while another questioned: 'What you mean NEXT TIME ???!''Literally ending it on a cliffhanger like that and we won't even find out until Monday. Nah. Livid' ranted a third.'Leaving it there and making us wait till Monday... cruel' fumed a fourth person.Another angry viewer asked: 'WHAT ARE YOU PLAYING AT?!'With an additional person adding: 'Tell us what's happening as cannot wait until Monday as it will do my head in.'",
        "The four had to take part in the Gold Rush trial, in which they had to find gold nuggets buried inside identical mine shafts. The object of the game was to find the nuggets and place them on scales at entrance to the mine, with each team having to find enough nuggets to tip the scales and win a picnic for their team - with the losers going home. ",
        "It was a closely fought race, with Georgia and Andy initially taking the lead while Myleene struggled to find any nuggets as Jordan ploughed ahead.But things evened up when Myleene began to find her nuggets, with the competition seriously heating up as the stars desperately fought to come out on top."
    ]
}