{
    "articleURL": "/wires/reuters/article-12055509/Alberta-declares-state-emergency-wildfires.html",
    "content": [
        "By Maiya Keidan",
        "TORONTO, May 6 (Reuters) -Alberta on Saturday declared a provincial state of emergency after tens of thousands of Albertans have been forced to evacuate their homes as \"unprecedented\" wildfires rage on in Alberta, Premier Danielle Smith, head of the ruling United Conservative Party (UCP) said at a press conference.By Saturday at 5 p.m. Mountain Time (7 p.m. ET), more than 24,000 Albertans had been evacuated from their homes, with 110 active wildfires across the province, and 36 out of control.\"It has been an extremely challenging day for firefighters here,\" said Christie Tucker, an information unit manager for Alberta Wildfire. \"We were battling very strong winds, hot weather and those winds produced extreme wildfire activity.\"She added that additional firefighters had arrived today from Quebec and Ontario.\"Much of Alberta has been experiencing a hot, dry spring and with so much kindling, all it takes is a few sparks to ignite some truly frightening wildfires,\" said Smith at a press conference earlier in the day. \"These conditions have resulted in the unprecedented situation our province is facing today.\"Among the communities evacuated was Brazeau County, including all 7,000 people living in Drayton Valley, 140 km (87 miles) west of the province's capital Edmonton.The entire community of 3,600 people in Fox Lake was also among the evacuees, where the 1,458-hectare (3609-acre) Fox Lake fire consumed 20 homes and the police station.",
        "\"I don't know that I ever recall seeing multiple communities evacuated all at once in fire season,\" said Smith.She said C$1.5 billion ($1.12 billion) is put aside as a contingency because they know a significant amount could need to be spent on emergency management,Whitecap Resources, an oil producer operating in northwestern and central Alberta, said it has been busy ensuring staff are safe through the evacuation process and assets are unaffected.\"(We are) monitoring closely and praying for rain,\" Grant Fagerheim, Whitecap CEO, said on Saturday.Pembina Pipeline Corp, which runs oil-gathering pipelines in the region, on Friday said it had activated emergency response and incident management processes and is \"evaluating any current or anticipated operational impacts.\"Pembina did not respond to a request for an update on Saturday.So far this year, there have been 43,000 hectares burned from wildfires, Smith said.\"It is very unusual for us to see this much fire activity this early in the season,\" said Tucker earlier on Saturday.Voters in Alberta will go to the polls on May 29 to elect a new government. Smith said people should expect election day will go ahead as planned.($1 = 1.3373 Canadian dollars) (Reporting by Maiya Keidan, additional reporting by Rod Nickel in Winnipeg; Editing by Chizu Nomiyama and Franklin Paul)"
    ]
}