{
    "articleURL": "/tvshowbiz/article-12050929/Coronation-Street-legends-reunite-special-Morning-street-party.html",
    "content": [
        "Coronation Street legends reunited for a special This Morning street party on Friday ahead of the King's Coronation. ",
        "Hosts Alison Hammond and Dermot O'Leary joined cast members including Jack P Shepherd who plays David Platt and Bill Roache who plays Ken Barlow.And Norris Cole, played by Malcolm Hebden, even came back from the dead (on the show) for the knees-up after retiring from the cobbles in 2021. The show began with special pre-recorded titles that merged Coronation Street and This Morning and continued with a series of royal-themed activities. As the hosts grilled stars about their experiences of meeting the firm, Jack opened up about King Charles' visit to the set when he was 12 and revealed the monarch was 'baffled' about who he was, thinking he was the son of a Corrie worker. ",
        "Jack said that he met Charles when he was still the Prince of Wales and added: 'I was 12. We met outside the Rovers Return, and I just remember he was so baffled as to what I was doing there.'He was like, 'Who are you?' I was like, 'I'm an actor, nice to meet you.' And he was like, \"But where are your parents?\"'I was like, 'My mum is about,' but he was like, 'Yes, but what do they do here? He thought I was a friend of the family or something.'I remember my mum saying he will be the King one day, and he is.'",
        "A few years later, Jack met Queen Consort Camilla on the cobbles, another funny meeting for the actor as she said: 'I know you, you're the naughty boy.' Alison said: 'I once said to Charles that I'd like a one to one [interview] with him, and he said 'Would I survive?'...He's great fun!'Meanwhile, fellow Corrie legends Bill, Barbara Knox who plays Rita and Helen Worth who plays Gail Platt, also spoke about meeting royals. Helen said of Queen Elizabeth II's visit to the set: 'It was so obvious she was enjoying herself [here at Corrie], at one point Jack was making her laugh and she loved it!'",
        "And soap legend Bill, who has been on Corrie since the very beginning in 1960, revealed that saw the late Queen seven times.He said: 'I did meet her seven times, and on one occasion I had five minutes on my own with her and they [royalty] love to be amused and are always very friendly and very warm. 'Charles is particularly warm and friendly… The Queen set the example of the perfect monarch and he followed that and he really cares.'The actor also shared that Camilla had once told him she watches Corrie when it is on, saying: 'I remember asking her if she ever watched the Street and she said, 'At 7.30pm on a Monday and a Wednesday, the phone is off the hook.'",
        "Barbara spoke about getting her MBE from the Queen, revealing that she thought she was a 'wonderful lady.'She said: 'Her Majesty was wonderful… she made you feel so relaxed, I could talk to this lady. 'She had that magic! When she was here last year I said 'ma'am' as she was about to leave, and she said 'yes?', I said, 'I want to thank you for this [her MBE] I do love it, thank you very much', and instantly she said, 'Did you have a lovely day?'Alison went on to speak to Barbara about why Corrie is so popular and she admitted: 'I think people believe us. They can love us or hate us and they become very fond of you, and we can make you laugh…' ",
        "The host added: 'And you make us cry as well… so believable', while Michael who plays Kevin Webster interjected: 'You make us laugh!'Later in the show, Alison and Dermot unveiled a new waxwork of King Charles and revealed the results of a surprising poll.Viewers had expressed their wish to see Alison have her own waxwork in Blackpool and she said: 'Oh my god, that'd be amazing! It'd have to have a laugh wouldn't it? I can't believe it - I'm gonna be a waxwork.'",
        "As the episode continued, there was a Coronation cocktail masterclass at the Rovers and a party food tutorial and despite some heavy rain, proceedings carried on.Another funny moment unfolded as Josie Gibson met and hugged her secret crush in person- Michael.Michael laughed: 'I'm a little bit shorter in real life aren't I?' and a blushing Josie replied: 'You're still a fine red wine.'Elsewhere, Dame Maureen Lipman explained later in the show that a golden cobble plaque was set to be put on the cobbles to mark the special episode.It reads: 'Coronation Street and This Morning celebrated the Coronation of HM King Charles III on these cobbles 5th May 2023'. Alison and other stars posted selfies to their social media as they celebrated the Coronation together. 'Coronation Street' was initially called 'Florizel Street', but it was later named after the 1902 Coronation of Charles' great-great grandfather King Edward VII.",
        "It comes after Coronation Street held a special 50th anniversary street party complete with iconic stars in 2010.The cast of the era got together to pose for a huge picture- more than treble the amount that originally appeared in the soap. The only survivor from the original 20 characters in the first episode of Corrie however is Bill. Ken started off on the show as a student who had won a place at university, but found his working-class background on the street something of an embarrassment amongst his more educated peers."
    ]
}