{
    "articleURL": "/wires/ap/article-12055017/McCann-ice-not-ready-return-Kraken.html",
    "content": [
        "SEATTLE (AP) - The Seattle Kraken welcomed leading scorer Jared McCann back to practice on Saturday, but coach Dave Hakstol doesn´t expect the forward to be available for Game 3 of the Western Conference semifinal series against Dallas on Sunday.",
        "McCann has been out since getting hurt early in Game 4 of Seattle´s opening-round series against Colorado on a hit from Cale Makar that drew a one-game suspension. McCann´s injury has not been disclosed, with Hakstol only saying that he´s working through his \"injury protocol.\"Hakstol said McCann skated a couple of times while the team was in Dallas for the first two games against the Stars. But Saturday´s optional skate with McCann in a red no-contact jersey was his first stint back with his teammates.\"We´ll just keep progressing. I don´t really have an update other than the fact that he´s on the ice and he´s able to be out there with the optional skate today, which is a really good step for him,\" Hakstol said. \"We´ll just continue progressing. Nothing imminent in terms of return.\"McCann led Seattle with a career-high 40 goals and 70 points during the regular season. He was held without a goal and had just one point during the series against Colorado before getting injured in the first period of Game 4 against the Avs when he was hit by Makar after the puck had gone out of play.\"He´s going to jump back in at a very high level. So first things first, we´re going to make sure his health is where it needs to be and then he´s got to be ready to get into the lineup,\" Hakstol said. \"Like I said, it´s a step by step process.\"",
        "Tye Kartye was called up from Coachella Valley of the AHL to take McCann´s spot and has scored twice in his five games playing on a line with Jordan Eberle and Matty Beniers. ___AP NHL: https://apnews.com/hub/nhl and https://twitter.com/AP_Sports"
    ]
}