{
    "articleURL": "/wires/reuters/article-12057309/Motor-racing-In-fickle-sporting-world-F1-understands-Entertain-Survive.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 7 (Reuters) - Formula One spent much of the build-up to Sunday's Miami Grand Prix shrugging off criticism it had become boring and uncompetitive with Red Bull in a league of their own winning every race.While Tom Garfinkel, CEO of the Miami Dolphins and Hard Rock Stadium that hosts the race, cannot do anything about the on track product, they have upped their entertainment game by adding new glitzy elements to the total 'fan experience'.It is no coincidence that F1 chose Miami, one of America's major party hubs, to introduce two new fan focused features by rolling out a Formula One theme song and a splashy pre-race showbiz style driver introduction.Interest in Formula One in the U.S. has been supercharged by the hugely popular Netflix series \"Drive to Survive\" that provides an entertaining behind-the-scenes look at the sport.But the reality for every promoter is that in the world of fickle fans you now need to \"Entertain to Survive\".\"I'd say the demand last year was because of the excitement of the first year and this year demand is still very strong,\" Garfinkel told a small group of reporters in the new Paddock Club and garages that line the front straight.\"We didn't have a problem selling tickets, it wasn't an issue,\" he added.",
        "Last year the Miami Grand Prix was the hottest ticket in South Beach and, while resale demand has softened, this year's race is again a sellout with 90,000 attending Sunday's race.While the grand prix is the anchor for a weekend of fun, the races themselves are no longer enough to make the event a financial and commercial success.Nowhere is that concept of 'fan experience' more understood than in South Florida where sports, concerts and the beach are all jockeying for a slice of the entertainment dollar.Hard Rock alone hosts three of Florida's biggest sports - the Miami Grand Prix and the Miami Open tennis as well as being home to the NFL's Dolphins.WIDE CHOICEMiami sports fans have not been short of choice this week on how to spend their money with the NBA's Heat in a playoff battle with the New York Knicks and the Florida Panthers in a Stanley Cup post-season run against the Toronto Maple Leafs.\"They (ticket sales) are basically the same and we had tremendous demand last year and this year,\" said Garfinkel. We held the tickets to about 85,000 last year on purpose.\"It's really important to be able to provide a good experience, get people in and out of here without three hours of traffic and lines at concessions and bathrooms so we tried to hold the number this year.",
        "\"We want to add a little bit so we'll be somewhere around 90,000.\"No sporting event attracts A-listers like Formula One and Miami was again a magnet for celebrities and titans of industry, pulling in some of the world's wealthiest industrialists like Tesla and Twitter owner Elon Musk and Amazon founder Jeff Bezos.Miami debuted a new driver introduction to the grid that F1 says will be used at eight races this season.The U.S. Grand Prix in Austin attempted something similar when famed boxing announcer Michael \"Let's Get Ready to Rumble\" Buffer introduced each driver before the start of the 2017 race and was widely panned.The idea behind the catwalk is to provide more interaction between drivers and fans.The emcee in Miami was rapper LL Cool J who introduced the drivers as they appeared through a line of pom pom waving cheerleaders while a 30-piece orchestra conducted by will.i.am provided the musical backdrop with the new track - The Formula.\"I think the goal though was just to produce a great event, a great experience for people, and if we do that we think over time the demand will stay there,\" said Garfinkel.\"Hopefully that's what's happening this weekend and the demand stays strong next year.\" (Reporting by Steve Keating in Miami; Editing by Ken Ferris)"
    ]
}