{
    "articleURL": "/sport/mma/article-12053069/The-extraordinary-experimental-medical-treatment-Aljamain-Sterling-used-fit-UFC-288.html",
    "content": [
        "Has been battling biceps injury Was facing surgery which would have delayed fight Unconventional treatment got him fit Aljamain Sterling has revealed the extraordinary lengths he went to for UFC 288 this weekend with the bantamweight champion turning to unconventional medical treatment in order to be fit.",
        "'The Funkmaster' will defend his bantamweight against rival Henry Cejudo on Sunday but the New York champion has revealed injury nearly stopped the fight from happening at all.Sterling, who has had a stellar UFC career to date, had been battling a torn bicep for some time. He had already fought through the injury during two title bouts and was determined to make it to UFC 288. However, with the injury not healing as he had hoped, Sterling was faced with the possibility of having to undergo surgery. With only a few months to go before the fight, surgery would have meant that Sterling would have had to delay the fight, possibly for months.So Sterling turned to an unconventional form of medicine – stem cell therapy. ",
        "The unconventional therapy involves using stem cells to treat or prevent diseases or conditions. Stem cells can develop into different types of cells in the body, making them useful for repairing damaged tissue or organs.Sterling decided to go to a stem cell therapy clinic in Colombia, called Bioxcellerator. The clinic is known for its state-of-the-art stem cell procedures and has been used by many athletes, including NFL star Saquon Barkley. However, with only a few months' notice, it was difficult for Sterling to get a booking. The earliest appointment he could get was in late March, which would have been too late for him to fight in May.",
        "Fortunately, with the help of some people from the UFC Performance Institute, Sterling was able to get an earlier booking. He underwent stem cell therapy for his bicep, along with other niggling injuries.'I think it has helped a ton. I'm feeling good. I'm using it pretty well,' Sterling told Channel 7. 'There's still some pain here and there, but it's way better than before, and hopefully it is enough to get me through this fight and get my hand raised.'",
        "Sterling's success with stem cell therapy has led him to call for it to be more widely available throughout the US and other western countries. 'We have it here [in the US], but it's nowhere near the same level as they have in Colombia.'The culturing, the way they do it. It's just the next level over there at Bioxcellerator, and they do a good job.'I think that's why they're one of the best locations to go to.'When you go in the approach of the facility, the hospitality, the cleanliness of the place, it's a really top-notch and I look forward to going back.'Along with Sterling vs Cejudo, the main card at UFC 288 will feature some other highly anticipated bouts, including the heavyweight clash between Francis Ngannou and Derrick Lewis. ",
        "The prelims include the women's flyweight bout between Joanne Calderwood and Lauren Murphy.For UFC fans in Australia, the main card will start at 12 pm AEST on Sunday, with the prelims starting at 10 am AEST. "
    ]
}