{
    "articleURL": "/tvshowbiz/article-12045687/Maggie-Beer-says-terribly-shocked-hear-Jock-Zonfrillos-passing.html",
    "content": [
        "Maggie Beer has paid tribute to the late Jock Zonfrillo. ",
        "The celebrity chef, 78, said she was 'terribly shocked' to hear of the 46-year-old's passing, after she tragically lost her daughter at the same age. Sharing a photo of Zonfrillo in his chef uniform on Thursday to Instagram, Beer captioned it with kind words.'So terribly shocked and so very sad at Jock's passing,' she began. 'A truly unique creative chef with a big heart and big ideas will be so missed by many. My heart goes out to his family and friends. Maggie.' ",
        "The MasterChef star, 46, was found dead by police at Zagame's House hotel in Melbourne at about 2am last Monday.He is believed to have died of natural causes and nothing unusual or suspicious was discovered in the hotel room where he was found dead, Daily Mail Australia understands. Maggie Beer's daughter Saskia also unexpectedly died in her sleep at the age of 46 in February 2020.Her cause of death was not made public. ",
        "Speaking to Woman's Weekly in November 2020, the chef said she was heartbroken but was doing everything to support Saskia's husband Colin and their three children Max, Lily, and Rory. 'I don't know that you do cope. You find things to do, to engage you. I don't know that anyone really copes,' she told the publication at the time.",
        "'Your life is changed forever and this year has been the worst of my life. But you have to turn your trauma into new things.'While Daily Mail Australia understands that Zonfrillo died from natural causes, the Coroner will now determine the celebrity chef's specific cause of death.",
        "Channel 10 postponed the launch of its 15th series of MasterChef Australia after learning of the judge's death, and announced on Wednesday that it will premiere on Sunday, with the full support of the chef's grieving family. There were mixed views from fans on whether the season should go ahead or not, with some praising the network while others said it will be a difficult watch.'This is going to be so hard to watch, but I will. His family will be in my thoughts,' one viewer wrote on Instagram. ",
        "'While it will be sad knowing this is the last we will see of Jock, it'll be a great honour to see him off in his last work on TV,' another said. Production wrapped on the 62-episode season at MasterChef HQ in Flemington, Melbourne, last month.The new season reportedly cost 'millions' to make, and producers are now looking to add a special 'tribute' episode to Zonfrillo before confirming his replacement.Zonfrillo is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried."
    ]
}