{
    "articleURL": "/tvshowbiz/article-12044513/James-Marsden-teams-Lewis-Hamilton-basketball-challenge-ahead-2023-Miami-Grand-Prix.html",
    "content": [
        "James Marsden teamed up with superstar race car driver Lewis Hamilton to play a game of basketball at an IWC event ahead of the 2023 Miami F1 Grand Prix.",
        "The IWC Chrono Challenge is part of the promotional push for the Formula One race that goes off at the Miami International Autodrome in Miami Gardens, Florida.The race begins this weekend on Friday, May 5 and goes through Sunday, May 7, and is the fifth round of the 2023 Formula One World Championship. Being an IWC-sponsored event, Marsden and his fellow players all wore uniforms with the Swiss watchmakers brand name on the front, although they were broken up into two teams: one in white and one in black.The Westworld star, 49, was decked out in an all-white uniform that consisted of shorts with red trim and a matching jersey.",
        "The Stillwater, Oklahoma native, who wore number 23, also donned a pair of white sneakers, and at times sported stylish sunglasses to help block out the glaring sun.Marsden and Hamilton were also teamed up with Antrel Rolle, who is a former football player with the University of Miami and the NFL.Hamilton is among those taking part in this weekend's race.This is the second year in a row that the Miami Grand Prix is being held at the Miami International Autodrome.The team of Marsden, Hamilton and Rolle faced off against a 3-player team in black that consisted of former University of Miami basketball team captain Brandon Okpalobi, Canadian actor Simu Liu and professional skateboarder Jagger Eaton.",
        "Hamilton, 38, who has won a joint-record seven Formula One World Drivers' Championship titles (along with Michael Schumacher), and Marsden could be seen sharing strategy and laughing it up on a number of occasions while on the court.Fans were also encouraged to help take over Jungle Plaza for the IWC Chrono Basketball Challenge, as part of clinic sessions with professional basketball coaches and the Free Throw Challenge, according to Miami Design District. Marsden began his career as an actor as a guest star on the teen sitcom Saved by the Bell: The New Class (1993), as well as Touched By An Angel (1995), Party Of Five (1995) and the mimiseries Bella Mafia (1997).He would go on to gain prominence with roles in the X-Men film series (2000-2014), The Notebook (2004), Superman Returns (2006), 10th &amp; Wolf (2006), 27 Dresses (2008), 30 Rock (2012-2013), The Best Of Me (2014), Sonic The Hedgehog (2020), Sonic the Hedgehog 2 (2022) and Westworld (2016-2022), among others.",
        "Last year's 2022 Miami Grand Prix was won by Max Verstappen, the pole- sitter Charles Leclerc took second place, while his teammate Carlos Sainz Jr. came in third.Hamilton would end up taking sixth in the race, while also hinting that his car was damaged early on, which makes his sixth place finish even more impressive.As reigning champion, Verstappen is the favorite to take home the trophy again this year, as reported by Page Six.",
        "Going into the weekend, Verstappen leads the World Drivers' Championship with 93 points, which is six points ahead of his teammate Sergio Pérez, and 33 ahead of Fernando Alonso in third."
    ]
}