{
    "articleURL": "/wires/ap/article-12043779/Haases-5-RBIs-lift-Tigers-Mets-doubleheader-opener.html",
    "content": [
        "DETROIT (AP) - Eric Haase homered in both games of a doubleheader, driving in six runs, and the Detroit Tigers tagged Max Scherzer in his return from a suspension to sweep the New York Mets with an 8-1 victory Wednesday night.",
        "Haase had five RBIs in the first game, including a go-ahead single in the eighth inning of a 6-5 comeback win, and then added one of Detroit's two homers off Scherzer in the nightcap.\"I've watched him pitch a lot,\" said Haase, who grew up a Tigers fan in Detroit. \"I want to say that was just another homer, but it was obviously pretty cool.\"The slumping Mets have lost eight of 10. They were playing their second consecutive doubleheader in three days after getting rained out three times since Saturday.\"We've got to be a lot better than this, and it isn't just about Max,\" manager Buck Showalter said. \"We only scored one run in the second game, which isn't going to beat many teams.\"New York had gone 25 doubleheaders without getting swept, since Washington took both games from the visiting Mets on Sept. 26, 2020. That was the second-longest such streak of the expansion era. The New York Yankees went 30 doubleheaders without losing both games between 1996-2006.",
        "The Tigers were hosting the Mets for the first time in seven years. The series opener was rained out Tuesday and rescheduled as part of a day-night doubleheader.In the second game, Scherzer struggled against his former team. Detroit scored twice in the first inning, Haase homered in the second and Matt Vierling hit a two-run homer in the fourth.",
        "\"It's always a good feeling when you can knock any starter out early,\" Vierling said. \"It doesn't matter who it is - that's going to give you some momentum.\"Scherzer (2-2) allowed six runs and eight hits in 3 1/3 innings. He was suspended for 10 games by Major League Baseball on April 20 after getting ejected for having a foreign substance on his pitching hand during his April 19 start against the Los Angeles Dodgers.\"I was spraying the ball around, and I wasn't good from the stretch,\" Scherzer said. \"That's what you expect after a layoff.\"Michael Lorenzen (1-1) allowed one run in seven innings to get his first win with Detroit, which is 2-14 against the AL East and 10-3 versus everyone else.\"It's just random,\" manager A.J. Hinch said. \"That's just baseball.\"The Tigers trailed 5-4 in the eighth inning of the first game, but Vierling blooped a single with one out and Adam Ottavino (0-2) hit Javier Báez with a pitch. Riley Greene grounded to first for the second out, advancing both runners, and Haase hit a two-run single to right-center.Tyler Alexander (1-0) got the win by retiring the last batter in the eighth. Alex Lange pitched the ninth for his fourth save.With a strong wind blowing out to left field, the hitters had the advantage in the early innings. Detroit took a 3-0 lead on Haase's first homer of the season in the first, but the Mets came back in the second with solo home runs from Tommy Pham and Mark Canha.",
        "Báez made it 4-2 in the third with a long homer over the first section of seats above the Tigers bullpen in left - his first of the season - but the Mets took the lead in the fifth. Brett Baty singled, went to second on Greene's error in center and then scored when Tomás Nido singled and left fielder Andy Ibanez threw wildly to the plate.Starting pitcher Joey Wentz retired the next two hitters, but Francisco Lindor made it 5-4 with a long homer to left-center.ROSTER MOVESThe Mets brought up RHP José Butto to serve as the 27th man for the doubleheader, and they activated Scherzer from the suspended list. Scherzer entered 2-0 with a 1.59 ERA against Detroit since leaving in 2015, striking out 34 batters in 17 innings without a walk.The Tigers called up RHP Brendan White to be their 27th man.WET SPRINGA cold rain fell off and on during the first game. The Tigers were playing their third doubleheader in their last three home series.UP NEXTThe Tigers are scheduled to face another old friend in Thursday's series finale. Justin Verlander is scheduled to make his Mets debut against Detroit LHP Eduardo Rodriguez (2-2, 2.21 ERA). Verlander has been sidelined all season with a muscle strain in his upper back.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}