{
    "articleURL": "/tvshowbiz/article-12044037/Julianne-Hough-layers-form-obscuring-trench-coat-shopping-trip-New-York-City.html",
    "content": [
        "Julianne Hough enjoyed a spot of shopping in New York City on Wednesday afternoon.",
        "The 34-year-old professional dancer layered up in a bulky outfit as she carried her purchases through the Big Apple.The television personality is currently preparing to co-host season 32 of Dancing With The Stars with Alfonso Ribeiro.Hough wore a dark yellow trench coat that was paired with jet-black leather pants during her shopping trip.The singer also donned a pair of platform boots that matched her bottoms and kept a purse slung over her left shoulder.",
        "The performer's gorgeous blonde hair was tied back into a bun and held back by a black hairband.Hough made her debut as a professional dancer on Dancing With The Stars in 2007 and took home the mirrored ball alongside Apolo Ohno during her first run on the program.The television figure won the competition for a second time during the program's fifth season, in which she danced alongside professional racer Helio Castroneves.She went on to compete as a dancer in three further seasons before she departed the program in 2009.Hough eventually returned to the show in 2014 to serve alongside her brother and fellow competitor, Derek, as one of the series' judges.The dancer remained in her capacity for three years before she left for a second time in 2017. This past March, it was revealed that Hough would be returning to Dancing With The Stars for a third time to serve as its co-host, according to Variety.",
        "The television personality will helm the program alongside Alfonso Ribiero, and she will handle dancer interviews while he will act as the show's MC. ",
        "Hough provided a statement to the media outlet to discuss the enthusiasm she felt about her upcoming return to the show.'It is such an honor to be rejoining Dancing with the Stars as co-host. The show holds such a special place in my heart from the many years and different roles I have had the privilege of being a part of,' she said. The dancer added: 'The energy is magnetic every time you step foot in to the ballroom and I can’t wait to feel it again.'Meanwhile, the DWTS family recently suffered a loss after the death of former head judge Len Goodman, who died at ae 78 following a battle with bone cancer.Hough paid tribute to him on Instagram, expressing her gratitude for 'the many years you influenced my past, present, and future! What an honor it has been to have been a part of your wonderful life. You’re a legend and left a beautiful legacy.'The upcoming 32nd season of Dancing With The Stars will premiere on ABC at an unspecified date this fall."
    ]
}