{
    "articleURL": "/wires/reuters/article-12045265/AB-InBev-profit-jumps-consumer-absorb-higher-beer-prices.html",
    "content": [
        "Q1 core profit up 13.6% vs consensus 5.6%",
        "Beer volumes up 0.4%, buoyed by ChinaRetains 2023 forecast of 4-8% core profit riseCEO says too early to assess Bud Light backlash impact(Updates with CEO on Bud Light backlash)By Philip BlenkinsopBRUSSELS, May 4 (Reuters) - Anheuser-Busch InBev , the world's largest brewer, reported higher than expected first-quarter earnings on Thursday as sharp price increases failed to put customers off.The Belgium-based company, which makes around a quarter of all beer drunk globally, said its results confirmed the resilience of the beer market in the face of economic challenges, notably inflation.The maker of Budweiser, Stella Artois and Corona repeated its 2023 forecast that core profit (EBITDA) would grow in line with its medium term outlook of between 4% and 8%, with revenue to grow ahead of EBITDA.Some analysts said the strong first quarter might have led to raised guidance, but a U.S. conservative backlash against Bud Light over a social media promotion on April 1 with transgender influencer Dylan Mulvaney could be cause for caution.Chief Executive Michel Doukeris said it was too early to assess the full impact, but added the drop-off of Bud Light sales in the first three weeks of April was equivalent to about 1% of global volumes for that period.",
        "He stressed the backlash was against one brand and one social media post, rather than the brewer's overall campaign. He said AB InBev would invest more in Bud Light over the summer.Trevor Stirling, beverage analyst at Bernstein Autonomous, said that the impact on sales was meaningful and appeared to be spreading to other AB InBev brands, but he said the market had already priced in a worst case scenario of the April trend continuing for the whole year.AB InBev shares are down about 4.5% since the start of April, while those of U.S. rival Molson Coors are up about 25%.AB InBev's beer sales were 0.4% higher overall in the first quarter than a year ago, though only because of a sharp rise in the Asia-Pacific region as China steadily rolled back its COVID-19 restrictions. Volumes in all other regions dipped.Revenue, however, rose sharply, as the company pushed through price increases and some consumers switched to more expensive beers or formats.First-quarter results of AB InBev's rivals Heineken and Carlsberg also showed consumer willingness to absorb higher prices.AB InBev's core profit rose by 13.6% on a like-for-like basis to $4.76 billion, compared with the 5.6% average increase expected in a company-compiled poll. (Reporting by Philip Blenkinsop Editing by Kim Coghill and Elaine Hardcastle)"
    ]
}