{
    "articleURL": "/money/cars/article-12051699/RAY-MASSEY-Perked-Peugeot.html",
    "content": [
        "With more power and style, Peugeot's popular compact 2008 SUV has been given a revamp. Unveiled this week, order books open in the summer for first deliveries in the autumn.",
        "It will be available with a range of electric, petrol and, next year, hybrid powertrains — but significantly in the UK, no diesels.From launch, the new fully-electric e-2008 has a larger 54kWh battery and a new electric motor, with maximum power increased by 18 per cent to 156 hp. Range is also increased to 252 miles, up from 214. There are also two types of onboard chargers: a single-phase 7.4kW as standard and an optional three-phase 11kW version.The e-2008 can be recharged from zero to 80 per cent in 30 minutes from a 100kW rapid charger, or 7 ½ hours from a 7.4kW charger.Next year, a new 48V mild hybrid powertrain arrives, comprising a new-generation 136 bhp 1.2-litre PureTech petrol engine linked with a new six-speed dual-clutch electrified gearbox including an electric motor and battery that recharges while driving.",
        "This offers extra pulling power at low engine speeds and up to 15 per cent improved fuel consumption.In urban driving, the hybrid system can operate more than half of the time in electric mode, says Peugeot.Although the diesel option is discontinued in the UK, Peugeot will continue to offer a choice of advanced 1.2-litre three-cylinder petrol engines. The PureTech 100 pairs a six-speed manual gearbox with a new gearshift knob, while the PureTech 130 offers either an eight-speed automatic or six-speed manual.",
        "Promising a more assertive SUV design and enhanced technology, there are three trim levels — Active, Allure and GT. Expect prices from about £25,000 for the petrol version up to £36,000 for the pure electric.Its alloy wheels range from 16 in to 18 in and six body colours include Selenium Grey, Cumulus Grey, Elixir Red and Vertigo Blue.All versions feature gloss black door mirrors.On Active trim versions, the front end is enhanced with a horizontal pattern in gloss black, while on Allure and GT versions, the front end has a vertical pattern in the same colour as the bodywork.",
        "The cockpit has been updated with a new 10-inch digital instrument cluster featuring a 3D display on GT versions, and a 10-inch central touchscreen as standard. The interior has new seat fabrics throughout, including optional Alcantara upholstery on GT versions.Driver assistance features include adaptive cruise control with 'stop &amp; go', automatic emergency braking, traffic sign recognition, lane keeping assist, driver attention alert and blind spot monitoring.Advanced grip control, together with all-season tyres, provides access to three additional driving modes: sand, mud and snow.The launch of the new 2008 coincides with the introduction of three new features to the MyPeugeot app, including a virtual maintenance book which stores all invoices and keeps a record of all work carried out on the car. Journey details can also be sent to the onboard navigation system in advance.",
        "The first generation 2008 was launched at the end of 2019 since when nearly 700,000 have been sold.It has been consistently among the top three best-selling compact SUVs in Europe, topping the list in 2021.The original e-2008 accounted for 17.4 per cent of European 2008 sales in 2022.Bentley taking the lead at 'Goodwoof' festivalThe luxury brand is lead partner in the annual celebration of all things canine on May 20 and 21 on the lawns of the Sussex estate's central clubhouse, The Kennels.The event features world-class competitions, field and trail demonstrations, talks from dog experts and celebrity owners, and plenty of treats for those on both two and four legs.",
        "Working with charity Pets As Therapy, an extended-wheelbase Bentayga EWB will be transformed into a 'pup-arazzi' photo booth.Bentley said the event, at the Duke of Richmond's Goodwood estate would make a 'great Dane out' (goodwood.com/goodwoof).It's sunset for Rolls-Royce's open-topped Dawn as the last one has rolled off the line at Goodwood. Land Rover tribute to King Charles What better way to toast the Coronation of the new Highlands-loving King Charles III than with a good Islay.Not just the legendary single malt whisky, but also a classic reborn Land Rover named after the island which produces it.",
        "Only 30 Defender Works V8 Islay Editions will be built — but they'll cost from £230,000 for the 90, and £245,000 for the larger 110 Station Wagon.",
        "Each is restored, re-engineered and upgraded, using 'donor' vehicles from 2012 to 2016.",
        "It celebrates both Land Rover co-founder, Rover Car Company managing director Spencer Wilks, and the Hebridean island where he tested early prototypes on his Laggan Estate.Powered by a 405hp 5-litre V8 petrol engine linked to an eight-speed ZF automatic transmission, it accelerates from rest to 60 mph in 5.6 seconds up to a top speed of 106mph.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}