{
    "articleURL": "/news/article-12051045/Grizzly-bear-dead-bloodied-Yellowstone-National-Park-sparking-investigation.html",
    "content": [
        "Wildlife photographer Amy Gerber found the dead bear and managed to take photos of it laying near a highwayU.S Fish and Wildlife have confirmed they are now investigating the incidentPenalties for killing a grizzly can be as much as a $50,000 fine or jail timeFederal officials have launched a probe after a huge grizzly bear was found dead and bloodied at Yellowstone National Park, sparking fears it had been illegally shot.  ",
        "Local wildlife photographer Amy Gerber found and captured images of the large bear, which was left near a highway in Wyoming on Monday. She believes the animal may have been shot and killed, because there were no signs of any impact with a car. Gerber says a bear as big as the one she found would have damaged any car that struck it, and left debris across the road.Hunting grizzlies is illegal in Yellowstone because of ongoing conservation efforts to boost the bears' population.  Speaking to Cowboy State Daily, Gerber said: 'That bear can’t die in vain.",
        "'The very few people who are so vehemently hateful toward grizzlies, that doesn’t represent us. That’s not Cody, Wyoming.'It seems like there’s this perception that people here hate wildlife, and particularly predators, and that’s not true. The outcry over this bear being killed is strong.'According to Amy, she had heard rumors that on Monday a grizzly had been struck by a car but said there was 'zero evidence' of road kill.Representatives for the U.S. Fish &amp; Wildlife Service confirmed that they are now investigating the incident. Anyone with information is also urged to contact the Wyoming Game and Fish Department .Wyoming Wildlife Advocates shared an appeal on their social media pages, saying: 'Sometime late last night or early this morning in Wyoming just outside the eastern border of Yellowstone National park, this grizzly bear was illegally killed. ",
        "'Just a bear looking for food doing what bears do.'If you have any information on this illegal killing, please call the Wyoming Game and Fish Department in Cody at 307-527-2175.'",
        "Since September 2018, grizzly bears within the Yellowstone ecosystem have been protected under the Endangered Species Act. Killing a grizzly bear illegally or without a justifiable cause can carry a maximum penalty of a $50,000 fine or a year in prison. In April of last year, father and son Jared and Rex Baum of Ashton, Idaho, were sentenced for killing a radio collared grizzly bear .Rex pleaded guilty to a misdemeanor and was sentenced to 180 days in jail, plus fines including $1,000 and court costs, as well as a $400 civil penalty. His hunting license was also revoked for ten years while his son Jared served 30 days and was landed with fines including a $10,000 civil penalty and a lifetime hunting revocation. The two shot a grizzly sow twelve times on the Little Warm River in Fremont County, Idaho, the year previously.The population of grizzly bears inside Yellowstone was threatened with extinction in the 1970s but their population has grown from 136 in 1975 to around 1,063 in 2021, according to the National Park Service. The park service advises any visitors to the area carry bear spray just incase they come across aggressive bears. "
    ]
}