{
    "articleURL": "/wires/ap/article-12054329/Early-Kentucky-Derby-favorite-Forte-scratched-race.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - The early favorite for the Kentucky Derby was scratched Saturday hours before the race.",
        "Forte was declared out of the 149th Derby, according to Churchill Downs spokesman Darren Rogers. Co-owner Mike Repole said Kentucky Horse Racing Commission veterinarians had concerns about a bruised right front foot.It was the fifth scratch this week from the $3 million race, the first time that many were scratched since 1936. That year 19 horses were entered and 14 ran.The colt stumbled on the track during a workout Thursday, although trainer Todd Pletcher had downplayed it.Five horses have died at Churchill Downs in recent days, including two trained by Saffie Joseph Jr. He was suspended by the track and had his Derby horse, Lord Miles, scratched.State veterinarians were at Pletcher's barn early Saturday to observe and examine Forte, who galloped on the track and then jogged outside the barn.",
        "Forte had a five-race winning streak and was the early 3-1 favorite. His jockey, Irad Ortiz Jr., will now ride Cyclone Mischief.That leaves 18 horses to run in the 1 1/4-mile Derby. The horses will break from posts 1 through 18 in the 20-stall starting gate. Posts 19 and 20 will be empty.It was another pre-Derby disappointment for Repole.He owned Uncle Mo, the early favorite for the 2011 Derby who was scratched the day before the race. The colt had a gastrointestinal infection and was eventually diagnosed with a rare liver disease. He resumed racing before retiring in November of that year.",
        "Other horses that were scratched this week were Practical Move and Skinner, both because of fever, and Continuar.Pletcher, a two-time Derby winner, will still saddle Tapit Trice and Kingsbarns.It's not the first time the favorite has been scratched.In 2019, Omaha Beach missed the race because of an entrapped epiglottis, which affected his breathing. He had surgery and went on to race later that year.In 2009, I Want Revenge was scratched on Derby day after a soft tissue injury to his left front ankle was discovered that morning.Churchill Downs said specific wagers placed before the scratch will revert to the post-time favorite. Other wagers will receive consolation payouts. All other advance wagers on Forte, except for the Derby future wager, will be refunded.Post time for the Derby is shortly before 7 p.m. EDT.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}