{
    "articleURL": "/news/article-12055055/JANE-FRYER-Mum-big-Royalist-weve-brought-ashes-say-Coronation-crowds.html",
    "content": [
        "It's six o'clock in the morning and already a sea of Union Jack flags, inflatable crowns, bunting, lovingly stencilled faces and tiny dogs in red, white and blue capes is flooding Central London. Hyde Park, St James's, The Mall and the 1,099 thoughtfully provided Portaloos are filling up with people who have travelled from all around the world – Singapore, Canada, New Zealand, Dorset, Essex – to celebrate King Charles's Coronation in their own particular way.",
        "A handsome trio of Danish debt collectors – Karyna, 44, René, 34, and Charlotte, 41 – are decked out in luscious ermine-trimmed red velvet cloaks and crowns, festooned in rings and bling and surrounded by bags of M&amp;S food.'We've never dressed up before, but we love the English Crown!' says Rene. 'We love everything Royal. We have a Queen and we hope you'd do the same for us.'Nearby, another threesome – Helen, Lisa and Tallulah from Camden, London – adopt a rather more English approach.",
        "'We've got loo roll, egg sandwiches, flags, white wine and more loo roll,' says Helen, 58. 'And china cups for our tea!'Meanwhile, sisters Dawn Probert, a maths teacher, and Anne O'Connor, a healthcare assistant, have travelled down from near Newcastle, with a rather niche cargo. 'Our parents were both staunch Royalists and they'd have been here if they could. So we bought Mum along with us – in an ashes ring – look!' says Dawn, brandishing her right hand to show a lovely ring with two pretty pink insets.But the most passionate fan by far is 79-year-old Joyce Springer, who was here for the Queen's Coronation back in 1953 – 'it was pouring with rain then, too' – and, this morning, was on the 5.30am red-eye from Haywards Heath. We meet in the enormous queue for a coffee.",
        "'I wanted to camp out, but none of my family fancied it – they're all wimps!' she says. 'All you need is a couple of black sacks for your legs and you're fine.'Joyce should know, she's a veteran. She camped out for the Queen Mother's 95th, her 100th, her funeral, Charles and Diana's wedding – the list goes on. 'I've slept on the pavement outside Clarence House so many times, I know every bump and crack,' she says.She also queued for 14 hours to see the late Queen lying in state last year and gives me a look of murderous thunder when I mention the threats by anti-monarchists to stick a spanner in the processional works.'If anybody kicks off today, I'll be the first to bundle them out. I really will,' she says. 'Because nobody else in the world can do this sort of thing like we can and we do it well.'And as the giant screens set up in St James's Park to broadcast the action inside the Abbey suddenly burst into life, blasting out Gustav Holst's Jupiter, the warm-up music inside the church, and showing the Household Cavalry limbering up for action, you can see what she means.",
        "Because whatever the weather – and it isn't great – there is an extraordinary atmosphere here in Central London. Although no one's had much sleep and nothing much happens for hours, we're all rather excitable.",
        "Every time the Tannoy system politely instructs the campers to clear up their tents nicely, everyone starts clapping.And great cheers go up when members of the police, Army, or even a phalanx of last-minute street cleaners venture out onto The Mall.Of course, one of the joys of waiting for hours in the rain in St James's Park – other than breathing in the smell of wet grass, hot coffee and warm horse manure – is the time to chat.About Camilla being crowned Queen: 'I love Charles and the monarchy, but I will never forgive her for Diana,' says Helen, 60, from Camden. 'I'll never call her Queen.'And Charles: 'Who cares if he talks to plants – we're all a bit mad, aren't we?' says Joyce Springer.And who could forget the Harry-shaped elephant in the room? 'They won't want him too near. If they've any sense, they'll stick him behind a big fat pillar,' says Lisa, 58. 'I really loved him but he's turned into a giant whinge-bag. Though I think we'd all forgive him pretty quickly if he came home – alone.'No one seems to care that when the procession does finally go by, we're likely to see absolutely nothing. For all the prime spaces along the procession route are long gone, snapped up by the hardcore, gritty-eyed campers who beat us all to it.",
        "Right down at the front, I meet Bridget, Mel and Shelby, a very jolly group who arrived at lunchtime on Friday and tell me they're still recovering from last night's 'prosecco binge'.",
        "'Great fun, we couldn't stop laughing!' says Mel, looking impressively fresh. 'Though closer to the Palace they were doing shots and dancing.' While most sensibly brought tents and sleeping bags, Joy and Amelia from Newark in Nottinghamshire couldn't be bothered with all that faff.'It was hailstones when we arrived on Friday morning – a total nightmare,' says Joy, who spent a cold and deeply uncomfortable night in her camping chair, but somehow looks immaculate.But the real diehards are the 'balconers' – the super-fan Royalists who have been arriving all week from all around the globe to snag a spot that might give them prime viewing of the Royal balcony. They've brought with them cooking stoves, heated sleeping bags and enormous suitcases full of snacks – and are treating it as a great Royal camping holiday.Now it's finally 10'clock – just 20 minutes until the 1.4-mile procession sets off – and still people seem to be streaming in. Pink-faced and flustered, clutching flags, bags, umbrellas, makeshift supermarket picnics and soggy rugs – they just want to be part of it.",
        "Quite rightly, because it soon turns out that there's something surprisingly special about standing in a massive crowd, in the rain, craning past sodden umbrellas to watch the events unfold on a giant screen.The audible 'Ooh' as Brigitte Macron teeters in, clasping onto Emmanuel's strong forearm. The ripple of laughter when Liz Truss arrives, intensified by some wag in a Union Jack suit who suggests she should only be allowed to stay ten minutes and be frisked on her way out.There's a small but definite cheer for little Rishi.",
        "And an awkward mix of boos and cheers when Harry walks solo down the aisle and is immediately blocked from view by Princess Anne's giant red feathered hat.But not everyone is glued to the screen. As the rain really sets in, I join a brilliantly bouncy group of seven women who have known each other since they met, aged five, at Holy Trinity Primary school in Weymouth.Forty years on, they're mixing cold champagne with hot outrage about all the dreary naysayers. 'Britain gets a beating, but it's brilliant and diverse and everyone's welcome,' says Amy, 45, from Poole in Dorset.'People moan about the cost of the golden carriage, but they've already got it – so surely it's cheaper than a new car and far more environmentally friendly!'",
        "As I tear myself away from their jolly clutches, I meet Peter, 74, an Army veteran with 35 years of service and a dauntingly long strip of medals pinned to his left breast.Perhaps he explains it best. 'Its history, isn't it? We've been going on like this for 1,000 years since the Saxons,' he says. 'Why would anyone want to throw it away? It's something we're good at.'As he speaks, the cheers are edging towards us down The Mall. The cameras and flags and selfie sticks shoot up in a Mexican wave and we all dash to join the 20-person-deep crowd behind the barriers.The crowd erupts into a frenzy of shouting, flag-waving and unexpected tears.If I jump up and down as high as possible, I can just see the very top of one of the ornate gilded corner trees on top of the golden state coach as it trundles past with King Charles and Queen Camilla inside.And do you know what? It feels incredible."
    ]
}