{
    "articleURL": "/health/article-12038115/My-baby-never-walk-talk-born-rare-brain-disease.html",
    "content": [
        "Lucy Landman, now one, was diagnosed with Mabry Syndromeor PGAP3-CDGCondition leaves her struggling to walk or talk and with intellectual disabilityREAD MORE: Doctors 'cure' girl of deadly disease before she is bornA mother has revealed how her baby will never walk or talk because of a brain disease that affects just 30 people in the world.",
        "Lucy Landman, now one, has been diagnosed with Mabry Syndrome, a genetic condition that leads her development to 'fall off a cliff'.It is caused by 'anchor' proteins failing to form properly, which are essential for effective communication between cells and neurons.The genetic condition means she may permanently have the intellectual ability of an infant. Parents Geri and Zachary, who live in Lafayette, California, said they were 'terrified' when they got the diagnosis because there is no cure for the condition. But they are now fundraising for $2.5million to develop one for the first time.",
        "Mabry Syndrome is caused when someone inherits two faulty copies of the PGAP3 gene, one from each parent.It is caused by a protein not forming correctly on the surface of cells which is used by other proteins to bind to their surface.This disrupts the function of proteins involved in moving substances into cells and, in neurons, those allowing messages to travel down a neuron — leading to problems with movement.There is no treatment available for the condition, but Lucy's parents believe they can 'cure' it using gene therapy to give her a functional copy of the PGAP3 gene. Most patients with Mabry die as children, with the oldest recorded having reached the age of 23 years. The Rare Diseases Clinical Research Network said only 30 cases have been confirmed in history.",
        "Ayla Bashir, a 16-month-old from Ontario, was given an enzyme therapy that was injected into her mother's stomach and traveled to the fetus via the umbilical cord. ",
        "Ms Landman, who works as a pediatrician, said: 'At first, we were in denial, as we looked at Lucy and couldn’t believe she was going to be physically and cognitively disabled.'[When I received the text from her pediatrician], I was terrified.'The neurologist didn't say she wanted to get any intervention started, so I thought she might be concerned about a diagnosis with no cure or treatment – and I was right.'Ms Landman first became concerned about her daughter when she was just two weeks old and constantly slept and wouldn't wake for feeding.Her concerns only grew when Lucy appeared to catch a viral infection and her development started 'falling off a cliff'.'Lucy got some sort of virus, just a mild cold or stomach bug and she just started falling off a cliff,' she said in a video while she tried to hold back tears.'Where she could previously sit for 15 minutes, she was flopping to the side, she stopped making eye contact, she stopped babbling as much, she refused to take solid foods anymore.'When Lucy was about 18 weeks old, her parents took her to hospital for tests.",
        "Doctors carried out an MRI, nerve test and spinal tap in March 2022, with all the results coming back normal.But then doctors ordered a genetic blood test.A day later their pediatrician called and said the results from the test were concerning and asked them to come in within an hour.Mother Geri said: 'I came home from work, I head Lucy, I gave her a bath and I tried to make the minutes pass faster.'When we went to the ER, the doctor told us while we held Lucy in our lap that she would probably have severe intellectual disability, that she might never walk, that she is likely to develop... seizures and that she will never talk and that we will never hear her say mama or her sisters' names.'",
        "The parents went home that night and read every scientific paper they could on the condition, with both having a medical background. Zachary is a physician.They also emailed the scientists behind every paper as they scoured the internet in search of a potential treatment.It was then that they decided to start raising funds for a potential gene therapy for the condition that could give their daughter a functional PGAP3 gene.  Development is already underway, with Lucy having donated stem cells in May, 2022, which are being grown in the lab. ",
        "These are being developed into neurons, which will be studied to learn more about how the disease works. They will also be used to test gene therapies. Medics have chosen to use neurons because these are among cells affected by the condition.They are fundraising under their organization, Moonshot for Unicorns, and have so far raised $450,000 of the $2.5million they need.Talking about her daughter, Ms Landman said that Lucy is currently crawling awkwardly but is also able to pull herself up.'She is so resilient,' said Ms Landman while holding back tears. 'If any other baby fell and hit her head as much as Lucy did but just kept trying to do new things... I am so amazed by her.'Lucy has also now been placed on a ketogenic diet. In the past, this has been used to help with seizures — which are a feature of Lucy's condition.",
        "Ms Landman said her sisters Audrey, eight, and Edna, six, were also supportive of their sister.She added: 'Her sisters are sad and shocked, but they always go out of their way to learn ways to support her.'But they are sad we have less time to devote to them.'I hope that with treatment, she will suffer less from the symptoms that plague her and that she will be able to communicate, so she doesn’t have to be locked inside her own body.",
        "'I want her to continue to be happy and that society will embrace, and include her, even after she outgrows her baby phase.'My advice to any other parents suffering through a similar situation, is to remember that you’re not alone and there are many good people who want to help.'Progress is possible and all boats rise together.'"
    ]
}