{
    "articleURL": "/tvshowbiz/article-12045551/Coleen-Rooney-shares-glam-selfie-lookalike-mother-Colette-theatre.html",
    "content": [
        "Coleen Rooney and her lookalike mother Colette beamed as they took a trip to the theatre on Wednesday.",
        "The WAG, 37, and her mother looked glamorous for the day out, where they went to see Sheridan Smith perform in her West End show, Shirley Valentine - opting not to go and see Wagatha Christie. The mother-of-four looked gorgeous for the day, where she opted for a pair of luxury Chanel sunglasses and a black and beige jersey jacket.She styled her brunette tresses tied back into a ponytail and accessorised with dainty hoop earrings.Colette looked equally as elegant for the day out, rocking a white T-shirt layered with a black blazer.",
        "Covering up from the sun, she also threw on a pair of stylish sunglasses and left her locks in a chic bob.Sharing the sweet snap to her Instagram, Coleen wrote: 'Twice in a week, back with my mum. Amazing show @shirleyonstage @sheridansmithster #ShirleyValentine'.Their outing comes after Coleen Rooney marked her late sister Rosie's birthday with a sweet video, ten years after she passed away aged 14.The WAG, who is married to Wayne Rooney, celebrated what would have been her sisters 24th birthday and said 'love you.'Rosie passed away in 2013 following her lifelong battle with Rett syndrome, a rare brain disorder that causes severe disabilities. In the clip posted to Instagram, Coleen could be seen playing with Rosie as she giggled before planting a kiss on her face. ",
        "Alongside the video, she penned: 'Happy Birthday Rosie. Love you,' which was met by heartfelt comments from her friends and fans. In January, Coleen shared a sweet family photo to Instagram with Rosie cuddled up in her mothers arms as she marked the tenth anniversary of her death.",
        "Coleen captioned the post: '10 years today……We all love and miss you Rosie Mc', with her followers sharing their condolences in the comment section.   Rosie bravely fought a lifelong battle with Rett syndrome – a rare brain disorder that affects physical movement and can bring about many different symptoms in each individual case. Rosie was originally taken in as a foster child by Coleen's parents, bricklayer Tony and Colette, a former nursery nurse, when she was two.Although they were aware she was disabled they did not know the full extent of her condition, which has no cure.In an exclusive article for The Mail on Sunday in 2006, Coleen wrote: 'When Rosie arrived she could crawl, and even though she couldn't use her hands that much she would handle toys on her play mat and she could eat.'But over a period of time she stopped crawling and lost what use of her hands she had. Then she started having problems swallowing her food.",
        "'It took pretty much a year for Rosie to be diagnosed and, looking back, I can see how much Mum pushed to find out what was wrong with her and to try to do what was best for her.'Coleen was said to idolise her adopted sister and chose Rosie as chief bridesmaid when she married Wayne in 2008.",
        "In a statement released shortly after her death, Tony and Colette wrote: 'Sadly our special angel Rosie, our much-loved daughter and sister, went to Heaven at 2.50 this morning at home where she was surrounded by her loving family.'Rosie was just 14 years old and fought a lifelong battle with Rett syndrome. Throughout her life she brought so much love and happiness to all our family and everyone who knew and met her.''She was such a strong little girl and an inspiration to us all. We shall cherish for ever the memories we have shared and the love she showed us each and every day of her life.The couple concluded: 'As a family we are heartbroken but we are blessed to have had her in our lives.'Coleen had been on holiday in Barbados with her younger brothers, Joe and Anthony, but cut short the trip when she heard that Rosie's condition had deteriorated."
    ]
}