{
    "articleURL": "/wires/ap/article-12046409/Bayerns-M-ller-wants-goldfish-mentality-win-Bundesliga.html",
    "content": [
        "BERLIN (AP) - Bayern Munich captain Thomas Müller wants his teammates to adopt a \"goldfish mentality\" to secure a record-extending 11th consecutive Bundesliga title.",
        "\"With a 10-second memory, there´s only looking forward,\" Müller says in his latest newsletter.\"We owe it to ourselves, to our fans and to the DNA of the club to do whatever it takes to give the season a happy end with the championship title. I expect absolute belief, commitment and unity from myself, from our team and everyone around.\"With that, Müller wants his teammates to forget about recent disappointments in a difficult season so far for the Bavarian powerhouse.Bayern was knocked out of the German Cup and Champions League in the quarterfinals last month, and is threatened in an uncharacteristically close Bundesliga race by a hard-charging Borussia Dortmund.Müller, who is captain while Manuel Neuer recovers from his broken leg, acknowledged that April was \"an absolute disappointment\" but said it´s \"not the right moment in time for a full-scale investigation into the causes.\"",
        "That will come later after Bayern this week postponed its quarterly supervisory board meeting from May 22 to May 30.\"With the scheduling of the meeting after the final game of the season at Cologne (on May 27), everyone in the club should focus on the sporting aspect in the decisive phase of the championship race,\" Bayern said in a statement.Bayern leads the Bundesliga by just one point with four games remaining after dropping points in 12 games from 30 so far.",
        "The defending champion also enjoyed a slice of fortune when Dortmund was denied a clear penalty in a 1-1 draw at Bochum last weekend, allowing Bayern to retake the lead on Sunday by beating last-placed Hertha Berlin 2-0.Bayern can stretch its lead to four points on Saturday with a win at Werder Bremen before Dortmund bids to keep pace on Sunday with a win at home over in-form Wolfsburg.Bayern then has home games against Schalke and Leipzig before finishing the season in Cologne, while Dortmund´s last three games are against Borussia Moenchengladbach, Augsburg and Mainz.Once the season is over, Bayern can begin what Müller described as the \"full-scale investigation\" into why it won´t be as successful as expected.Both Bayern chief executive Oliver Kahn and sporting director Hasan Salihamidzi´c are under scrutiny for their decision to fire Julian Nagelsmann as coach and replace him with Thomas Tuchel right before the team´s Champions League and German Cup exits.Only a successful Bundesliga title defense will ease some of the pressure and ensure a more harmonious supervisory board meeting.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}