{
    "articleURL": "/femail/real-life/article-12044957/Australian-rate-increase-Eddie-Dilleen-78-properties-worth-45million.html",
    "content": [
        "Property investor Eddie Dilleen, 31, owns 78 propertiesAt just 31, his impressive portfolio is worth $45millionAmid interest rate increases he's increased rents by 40 per cent A landlord with a $45million property portfolio has revealed how he's had to increase rents on his properties by up to $200 a week to cover his soaring mortgage bill. rising interest rate payments.  ",
        "Eddie Dilleen, 31, owns 78 investment properties across Australia and collects about $33,000 in rent each week and told FEMAIL his clever investment strategies have kept him safe from economic pressures so far.The financially-savvy decision to charge renters more comes as thousands of Australian families complain they can't afford necessities as the cost of living soars.In fact, the father-of-two, has continued to build his property portfolio up over the last six months, adding another 26 homes as most average families struggle just paying one mortgage in the face of 11 consecutive interest rate rises. The RBA's decision to increase rates on Tuesday means the interest rate is now 3.85%, with families paying more than $1,000 extra in repayments in less than a year. However, this hasn't stopped Mr Dilleen from pushing ahead with his goal of having 100 investment properties to his name by 2024, but has seen him increase rent on nearly  half his properties by 30-40 per cent.This equates to between $100 and $200 per week for many of his tenants - but he insists he aims to be a 'nice landlord'. Scroll down for video ",
        "He insists majority of the 78 properties are 'under rented' to keep good tenants happy and prevent them from leaving. 'In most cases the rent has increased because a tenant has moved out and applicants have offered more than the asking price. For other good tenants, I haven't increased the rent where I don't need to to keep them in for longer,' he said.  ",
        "'It's a win-win scenario if the tenant and landlord are happy - so I try to be as nice and respectful at possible.'I could've put up the rent with all of them but haven't.'",
        "On a Reddit forum parents, couples and singles alike have complained about the cost of living and increasing cost of rent. 'Our rent is going up by $375 (per week) … It's just ridiculous. Our generation can't save for a house, pay cash for a car or get out of debt because they're spending WAY more than 30 per cent of their income on rent,' one person wrote. In April one tenant claims their rent increased from $800 to $1580, but the landlord was willing to offer a 2 per cent discount bringing the price to $1550 per week.  'No one renting feels stable, even if rent only costs you around 10-15 per cent of your income, it still is a constant worry of \"will the landlord raise rent, will the send us an eviction\" at any point,' another said. Several others also complained about not being about to afford to buy their first home, and fear they'll be renting for the rest of their lives. One mum added: 'I have two sons living at home with me. Only reason is this... that rent is so high.' ",
        "'$100,000 feels about the wage you need to feel like you're making a 'decent' living now, and live with some dignity,' another said. One person who works both full time and part time still doesn't feel financially stable.'I'm working a full time job and can't afford bills. It's hard out here and all these rich people are judging me for not being able to afford to live on my own,' another said. Some Aussies living abroad also fear they won't be able to afford to return home to live.",
        "Consider your long-term goals Start small and get in as soon as you can  Buy a property with a high-yield return  Buy below market value at a discounted rate  by looking for those who want to sell fastDon't focus on paying off the loan quickly - use any extra cash to buy more properties Be realistic about your finances and speak to an expert for assistance ",
        "Mr Dilleen's investment strategy involves buying properties with a high rental yield between five to nine per cent that have 'good capital growth' in metro regions and ensures the price is below market value. He famously bought his first property while working at McDonald's at age 18 and now owns homes across Queensland, New South Wales, South Australia and Western Australia.",
        "While Mr Dilleen hasn't been feeling the pinch in regards to interest rate rises, it's become more difficult for him to receive further loans from the bank. 'I've had to jump through some hoops with finance by going through different lenders but have have managed to find other ways around it,' he said. In regards to his growing property portfolio, Mr Dilleen said his investments are a small percentage compared to businesses that own thousands of home worldwide.In the last six months, he's bought  26 properties and is an the brink of signing off on another two. Mr Dilleen's most recent purchase was a $210,000 unit in the Western Australian suburb of Mosman Park, which is only 14km from the Perth CBD. Other purchases include a one bedroom unit in Fremantle, WA for $258,000 where he receives $390 per week in rent, and a one bedroom unit in Tuart Hill, WA for $151,000 where he receives $350 per week in rent. He's also bought a duplex property in Collingwood Park, Queensland, for $541,000 and Mr Dilleen receives a combined weekly rent of $800 per week. ",
        "On Tuesday the Reserve Bank of Australia increased the cash rate by 0.25 percentage points, taking the cash rate to an 11-year high of 3.85 per cent. ",
        "The move - the 11th rate rise during the past year - flies in the face of the financial markets, which had almost unanimously predicted the RBA would leave rates on hold.",
        "Amid the housing crisis, Mr Dilleen said Australia needs more investors to help the situation. 'We're in the middle of a crisis where there aren't enough houses for people to live in, and there's only so much the government can do,' he said.",
        " Mr Dilleen's most recent purchases include:Baldives Duplex/Dual Occupancy - $557K property - rent $900pwFremantle WA - 1 bed, 1 bath, 1 car unit - $258K property - rent 390pw Tuart Hill WA - 1 bed, 1 bath, 1 car unit - $151k property - rent 350pwCollingwood Park QLD - Duplex/Dual Occupancy - paid $541k property - combined rent 800pwMosman Park WA - 1 bed, 1 bath, 1 car unit - Paid $210k Rent 370pw Some purchases made in 2022 include:  North Lakes, QLD - $550K property Slacks Creek, QLD - $155K propertyGreenacre, NSW - $1.1M propertyElizabeth Park, SA - $750K propertyRedbank Plains, QLD - $510K propertyKaralee, QLD - $670K propertyBeenleigh, QLD - $700K property",
        "To date Mr Dilleen believes anyone can follow in his footsteps if they're willing to sacrifice little luxuries in the long run and consider personal financial goals.",
        "When choosing his next investment, Mr Dilleen never limits himself to one state and instead looks for opportunities across Australia. Suburbs he has previously invested in include North Lakes in Queensland ($550,000), Slacks Creek in Queensland ($155,000), Greenacre in New South Wales ($1.1million) and Elizabeth Park in South Australia ($750,000).Mr Dilleen said his end goal was to help as many Australians as possible get into the real estate market sooner and pass on his knowledge about investing.",
        "Mr Dilleen previously told FEMAIL he isn't crippled by mortgage stress, and he doesn't fear debt. 'Debt is how money is created. Smart people use debt to create massive amounts of wealth. The most successful people in the world use good tax deductible debt to reach their goals, but unfortunately this isn't taught in schools,' he said.'I definitely believe fear holds a lot of Aussies back when it comes to property, as the average person isn't taught the knowledge that when you buy an investment property the debt and expenses are all tax deductible.' Mr Dilleen also listed some of the 'hottest' suburbs of the moment, including Glenelg and Elizabeth Park in South Australia, and the Ipswich, Logan and Brisbane council regions in southeast Queensland.When he purchased his first four properties, Mr Dilleen was earning $50,000 per year, and bought another four on a $65,000 salary in 2016.'It's all about understanding how the banks lend you money - having a high yield means you can continue to borrow,' he said.'Start small and get in as soon as you can.' Mr Dilleen also suggested purchasing existing properties rather than new builds which are often on small blocks of land. He also encourages 'rentvesting' - a tactic that sees buyers rent a property where they want to live and buy an investment property in a suburb they can afford. ",
        "Mr Dilleen grew up in a housing commission home and became interested in real estate when he started working at McDonald's at 14.Based on conversations had with co-workers and others, he quickly understood buying into real estate was the perfect strategy to build wealth.'From humble beginnings, I grew up in a rough neighbourhood and no one in my family owned a home,' he said.'Mum struggled to put food on the table, we had to buy secondhand clothes from the Salvos, it was very rough financially.'I remember when I was 12 thinking 'this sucks' and wished things were different… I wanted to break out of the cycle.' ",
        "Mr Dilleen quickly wanted to buy more investment properties and eventually be able to live off the rental income.Rather than following the 'old school mentality' of paying off the initial loan first, he decided to leverage the capital gains and bought his second property at 21.'I realised there's another way instead of paying one property off - it's all about looking at the long-term gain,' he said.  Mr Dilleen explained that if he focused on paying off the loan on the first property quickly, he'd be left with the income of a single investment - not enough to live off.'It's about the scalability - instead of paying it off, why not use the funds to buy more investment properties?' he said.'For example, instead of putting in $30,000 a year into the investment, that could be used to buy another property.'Mr Dilleen has just written his first book 30 properties before 30, which shares his tips and tricks for investing in property. "
    ]
}