{
    "articleURL": "/wires/reuters/article-12055623/Blue-Jays-jump-Pirates-early-8-2-win.html",
    "content": [
        "Brandon Belt and Kevin Kiermaier each drove in two runs Saturday to help the visiting Toronto Blue Jays win their second straight, 8-2 over the reeling Pittsburgh Pirates.",
        "Alejandro Kirk added an RBI double and Daulton Varsho an RBI single for the Blue Jays, who entered the series with a five-game losing streak.Toronto starter Jose Berrios (3-3) was perfect into the fifth. He gave up two runs, five hits in 6 1/3 innings, with seven strikeouts and one walk.Jack Suwinski homered and Connor Joe had an RBI single for the Pirates, who lost their sixth in a row.Pittsburgh starter Johan Oviedo (2-3) allowed seven runs, six earned, and 10 hits in five innings, with three walks and three strikeouts.Toronto infielder Vladimir Guererro Jr. was a late lineup scratch because of left wrist discomfort.The Jays plated four runs in the first.George Springer, the game's first batter, singled. Bo Bichette walked on four pitches. Varsho drove in Springer with a base hit for a 1-0 lead. Bichette went to third on Matt Chapman's flyout and, after Whit Merrifield struck out, scored along with Varsho on Belt's double. Kirk drove in Belt with a double to make it 4-0.In the third, Belt walked with two out and Kirk singled. Cavan Biggio reached on an infield hit, with Belt scoring. Biggio moved to second on second baseman Rodolfo Castro's throwing error, with Kirk taking third. Kiermaier singled, driving in Kirk and Biggio for a 7-0 Toronto lead.",
        "In the fifth, Suwinski walked with one out to break up Berrios' perfect game. Ke'Bryan Hayes followed with a single to end the no-hitter.In the sixth, Bryan Reynolds extended his hitting streak to 11 games with a two-out double and scored on Joe's single to end the shutout, 7-1.Kiermaier's double play grounder with the bases loaded in the seventh upped it to 8-1.Suwinski's homer to right, his seventh, made it 8-2 in the bottom of the seventh.Belt got ejected in the eighth for questioning a strike call.--Field Level Media"
    ]
}