{
    "articleURL": "/wires/reuters/article-12039293/Teams-pass-fifth-year-option-nearly-half-2020-rounders.html",
    "content": [
        "Nearly half of the 2020 NFL Draft first-round picks had their team options for 2024 declined ahead of Tuesday's 4 p.m. deadline to exercise the clause included in contracts of the top 32 draft picks.",
        "No. 1 pick and Cincinnati Bengals quarterback Joe Burrow had his fifth-year team option exercised, but the No. 2 pick in 2020, Washington Commanders defensive end Chase Young, was one of three picks in the top 10 to have the option declined.Not exercising Young's option saved the Commanders $17.5 million guaranteed.Burrow's fifth-year option is worth $29.5 million, and fellow quarterbacks Tua Tagovailoa (Dolphins, fifth overall) and Justin Herbert (Chargers, sixth) were also locked up through next season.The number of options declined is in stark contrast to the year prior, when only two players drafted in the top 20 of the 2019 draft had their fifth-year options left on the table. One was ineligible (playing time) No. 10 pick Josh Rosen (drafted by Cardinals, traded to Dolphins), and the other was No. 19 pick Leighton Vander Esch. The Cowboys re-signed Vander Esch in free agency.The following players officially had the fifth-year option for the 2024 season declined by the current club:2, DE Chase Young, Commanders8, LB Isaiah Simmons, Cardinals9, CB C.J. Henderson, Panthers (drafted by Jaguars)11, OT Mekhi Becton, Jets14, DT, Javon Kinlaw, 49ers18, OT Austin Jackson, Dolphins20, DE K'Lavon Chaisson, Jaguars21, WR, Jalen Reagor, Vikings (drafted by Eagles)23, LB, Kenneth Murray, Chargers",
        "24, C, Cesar Ruiz, Saints27, LB, Jordyn Brooks, Seahawks28, LB, Patrick Queen, Ravens30, CB, Noah Igbinoghene, Dolphins32, RB, Clyde Edwards-Helaire, ChiefsThe latest moves made official Tuesday:--The New York Giants exercised the fifth-year option for left tackle Andrew Thomas on Tuesday.Thomas, 24, will earn a guaranteed salary of $14.175 million during the 2024 season.He will earn a base salary of $5.02 million this upcoming season. He started 16 games in 2022 before sitting out the season finale.Thomas has played in 45 games (44 starts) since being selected by the Giants with the fourth overall pick of the 2020 NFL Draft.--The Seattle Seahawks declined their option for linebacker Jordyn Brooks, per multiple reports.Brooks, 25, has recorded 402 tackles, two sacks and two fumble recoveries in 47 games (39 starts).The No. 27 overall pick in 2020, Brooks led the NFL with 109 solo tackles in 2021 and finished sixth with 161 total tackles in 2022.Brooks will be playing for a new contract in 2023 while coming back from a torn ACL sustained in Week 17 last season.--The Kansas City Chiefs did not pick up the fifth-year option for running back Clyde Edwards-Helaire.After gaining 1,100 yards from scrimmage as a rookie in 2020, his production dipped to a combined 1,099 yards over the past two seasons. He rushed for a career-low 302 yards in 10 games (six starts) last season as rookie Isiah Pacheco took over lead-back duties for the Super Bowl LVII champs.",
        "Edwards-Helaire, 24, was the final first-round pick (32nd) in the 2020 draft. He has rushed for 1,622 yards and 11 touchdowns and caught 72 passes for 577 yards and six scores in 33 games (29 starts).--Field Level Media"
    ]
}