{
    "articleURL": "/tvshowbiz/article-12055343/Inside-Roxy-Jacenkos-son-Hunters-50-000-Hawaiian-themed-ninth-birthday-party.html",
    "content": [
        "Roxy Jacenko has splashed a rumoured $50,000 on her son Hunter's extravagant ninth birthday party on a superyacht.",
        "The PR Queen, 43, threw a no-expense-spared Hawaiian-themed party aboard the 122ft charter yacht, Ghost II, which is rented out at $2800 per hour.The youngsters were treated to custom-made slippers, and danced away to a DJ on the cruise around Sydney Harbour.The three-hour event took a month to plan with Hunter even getting a personalised cake with a topper of himself on a surfboard and wearing Hawaiian shorts.Roxy told The Sunday Telegraph, her son chose the theme after looking at albums from a family trip.",
        "'Hunter was looking through old photos from when he was little and came across some images of a trip we went on to Hawaii,' she said. 'It was then he decided he wanted a Hawaiian-themed ninth birthday as he has missed out on celebrating with his friends due to Covid for the past three birthdays.'She also revealed her mum Doreen bought Hunter a traditional Hawaiian shirt during her recent trip to Hawaii.Guests were also treated to hula girl dancers and a poi-ball dancer.It comes almost one year after Roxy raised eyebrows after splashing a rumoured $40,000 on her daughter Pixie's 11th birthday in August last year.She went all out for the bash, splashing the cash on neon lights, a personal hairdresser, a DJ and a professional photographer for Pixie and her friends.",
        "They were also treated to 360 degree photo booth, a custom pizza bar, and fireworks during the flashy event.",
        "Roxy hit back during an interview with the Today Show taking aim at critics who called the party 'too indulgent.''It is not for everyone, but I don't worry about the noise,' she said of the backlash at the time.Roxy, who battled breast cancer in 2016, said she has learned to live her life to the fullest.'I had cancer, we have lived a life that has been under scrutiny a lot, so I want to make the most of my life because you don't know what happens tomorrow,' she said."
    ]
}