{
    "articleURL": "/sport/afl/article-12039963/How-footy-superstar-Nick-Daicos-revealed-stunning-new-deal-global-footwear-giant.html",
    "content": [
        "Collingwood's Nick Daicos has signed a huge deal with NikeWill become one of the biggest off-field earners in the codeThe 20-year-old defender made his AFL debut last seasonCollingwood superstar Nick Daicos has signed a lucrative deal with global footwear giant Nike.",
        "The young gun, 20, only made his AFL debut last season for the Magpies - and is already one of the code's best players with a series of stunning performances making him the favourite to win this season's Brownlow Medal.Daicos is poised to join the likes of Western Bulldogs midfielder Bailey Smith and Richmond Tigers champion Dustin Martin as one of the biggest off-field earners in the game.The young star, whose father Peter Daicos is a Magpies legend, announced his Nike deal in the most modern way possible - via a small change to his Instagram bio, which had '@nike' added to it recently.It comes after Daicos's signed Anzac Day guernsey he wore against Essendon sold for just over $16,000 on Monday night. With the proceeds going to the RSL's Anzac Appeal, the online auction attracted almost 100 bids, with Daicos' gameday attire easily fetching the highest price of all the Collingwood players.",
        "Collingwood fans said the eye-watering amount paid for Daicos jersey was worth the outlay.'I suspect it might be worth 10x that one day. Nick's personal stock has already rallied this year off an already high base last year,' one posted.'A great investment ….will be worth double when he wins the flag &amp; Brownlow,' posted another.",
        "Rising star Daicos recently snared the Anzac Day Medal as best on ground in his side's come-from-behind victory over the Bombers.His electric performances haven't gone unnoticed, with the young gun now the favourite to win the Brownlow, ahead of Melbourne's Clayton Oliver and Western Bulldogs go-to man Marcus Bontempelli.Daicos finished with 40 disposals on Anzac Day and has been a key figure as the Magpies have surged to the top of the AFL ladder after seven rounds.Collingwood are also the comeback kings of the competition, having now won nine of their last 12 games when trailing at three quarter-time."
    ]
}