{
    "articleURL": "/wires/reuters/article-12055207/Cubs-rally-hand-Marlins-fifth-consecutive-loss.html",
    "content": [
        "Nick Madrigal delivered a go-ahead, two-run single during Chicago's three-run eighth inning Saturday, and the Cubs won 4-2 over the visiting Miami Marlins, who have dropped five straight.",
        "Down 2-1 entering the bottom of the eighth, Chicago opened the frame when Cody Bellinger reached on Miami first baseman Yuli Gurriel's error on a low throw from pitcher A.J. Puk (3-1). Bellinger stole second and went to third after right fielder Peyton Burdick lost Trey Mancini's fly ball in the sun that went for a double.Two batters later, Madrigal, who got the start at third base, grounded the ball into right field for a 3-2 Chicago lead. He then scored on Miguel Amaya's chopper up the middle for his first major league hit for the Cubs.Chicago has won the first two games of this set following a 1-6 road trip which began by being swept in three at Miami.Jorge Soler clubbed a solo homer for one of his two hits and Bryan De La Cruz went 2-for-4 with an RBI for the Marlins, who have been outscored 34-12 in the last five games.After managing only a sixth-inning run during Friday's 4-1 series-opening loss, Miami struck in the first on Saturday.A pair of walks by Chicago's Drew Smyly, who threw 36 pitches in the first, cost him a run on De La Cruz's soft RBI single with two outs. Miami made it 2-0 in the third when Soler, a former Cub, went deep into the left-field bleachers for his seventh homer.",
        "Smyly, who allowed a run over seven innings at Washington on Monday, lasted just 3 1/3, while yielding two, three hits, three walks and striking out five on 83 pitches.Chicago cut a 2-0 deficit in half in the fourth when Bellinger doubled off Bryan Hoeing, the scheduled starter who came on in the third after Miami used Matt Barnes, then Andrew Nardi, for one inning apiece. Bellinger scored on an opposite-field single to left by Matt Mervis, who also recorded an RBI hit during his major league debut Friday.Chicago's Keegan Thompson (2-2) allowed one hit over three innings to earn the win.--Field Level Media"
    ]
}