{
    "articleURL": "/news/article-12057995/Partygoers-blast-atrocious-crowd-control-National-Lotterys-Eurovision-launch-Liverpool.html",
    "content": [
        "Fears of overcrowding at National Lottery's Big Eurovision Welcome in LiverpoolDistressed people were seen being helped over barriers as organisers criticised Eurovision revellers attending a 'Big Welcome' event in Liverpool city centre yesterday had to be helped out of the enclosure amid fears of overcrowding, it has been reported.",
        "The pre-launch concert, sponsored by the National Lottery, was held in St George's Plateau a week before the big event - with performances from Conchita Wurst, Frankie Goes to Hollywood, Atomic Kitten and others.But the space in front of St George's Hall was said to become cramped as thousands of people poured in, Liverpool Echo reports.Distressed members of the public were allegedly seen being helped over the barriers in order to get out.An on-stage announcer said more people had turned up than expected and requested the crowd spread out before the show began.",
        "Organisers later clarified that the number of people in attendance was within their estimate, as it was a ticketed event.One attendee named Jess claimed that BBC camera operators had done more to help trapped revellers than security.She tweeted: 'Eurovision National Lottery sort yourselves out! Major health and safety issue going on. Ignored several times then puts a man on the stage telling people to come even closer.'Another user said crowd management at the event was 'atrocious'.Phil Symo added he was so concerned about safety he left the event early. He added: 'I hope they make a better effort with Eurovision because the organisation for this was an absolute s*** show. All the crowds on one side. Dangerous.'",
        "A further partygoer described the festival as 'shockingly organised' and added she had a panic attack. A Liverpool City Council spokesman said: 'Stewards assisted a few people who were uncomfortable in the crowd. The event started on time and is getting a great reception from the audience.''We continue to monitor the situation throughout the show to make sure people are comfortable.'This year's Eurovision Song Contest will see shows at Liverpool Arena starting this week, with semi-finals on Tuesday and Thursday and the final taking place on Saturday.The event, hosted by the UK on behalf of last year's winners Ukraine, is one of the biggest produced by the BBC.",
        "According to the broadcaster, the hair and make-up teams will use more than 100 wigs and hairpieces, 1,000 litres of hairspray, more than 3,000 make-up brushes, and 5,000 hairpins to create looks for every performer.Rails measuring 150m - equivalent to three Olympic-sized swimming pools - will hold the 482 costumes which have been made for the shows using 20,000m of thread.The manufacturing of the costumes was done in the UK and Ukraine, which was unable to host the competition due to the Russian invasion.The show will be watched by 160 million viewers worldwide, with over eight hours of live TV and 50 live feeds.",
        "To stage it, there are more than 600 rigging points, 140 tons of steel ground support structure, and 1km of additional steel truss work being added to the arena.The event will feature eight miles of cabling for lighting, sound, video and special effects, more than 2,000 specialist lighting fixtures, 200 custom staging decks, 950 square metres of staging for the main stage and 500 square metres of staging for the green room.The lighting design includes 23,700 individual light sources and 2,500 automated colour-changing robotic lights, while sound will be captured by 150 microphones.BBC director of unscripted Kate Phillips said: 'As these statistics show this is one of the biggest events the BBC has ever produced.'Coming straight after such a significant and spectacular moment in history, we aim to produce an unforgettable and utterly joyful Eurovision, on behalf of Ukraine.'Like the coronation, Eurovision has so many skilled and talented people from across the BBC working on it.'Our brilliant team in Liverpool are making sure that all three live shows are simply must-see TV, for audiences across the UK, Europe and beyond.'"
    ]
}