{
    "articleURL": "/wires/ap/article-12050339/Chiefs-stretch-streak-10-big-win-Highlanders.html",
    "content": [
        "DUNEDIN, New Zealand (AP) - Flyhalf Damian McKenzie and fullback Shaun Stevenson led the Chiefs counter-attacking game as the Hamilton-based team beat the Dunedin-based Highlanders 52-28 Friday to extend their winning start to the season in Super Rugby Pacific to 10 matches.",
        "McKenzie or Stevenson had a designing hand in five of the six tries scored by the Chiefs in their bonus-point win. Another came from a 90-meter intercept by center Daniel Rona, who scored two tries in his second Super Rugby match.McKenzie also kicked seven conversions and a penalty for 17 point in a flawless performance which saw him surpass 1,000 points in Super Rugby.The magnitude of the Chiefs´ win belied the fact they barely touched the ball in the first 20 minutes. The Highlanders had 85 percent of possession in that period and the few fragments the Chiefs got their hands on they kicked away and kicked badly, allowing the home team to score the first try through prop Ethan de Groot.The Chiefs then scored four tries before halftime, including possibly the best of the season, and conceded another to lead 28-14 at the break. The quality of their counterattack was reflected in the fact they still trailed in the possession stats and rarely built an attack from within the Highlanders´ 22.Ten wins from 10 games \"feels pretty good,\" Chiefs captain Brad Weber said.\"We had to work very, very hard for it,\" Weber said. \"Most of our tries came from counterattack. I wouldn´t say we have free license (to counterattack). We´ve certainly got a plan with our counterattack but also with the back three we've got and when Damian gets back there you want them to express themselves when the situation allows it and we certainly encourage them to do that.\"",
        "Winger Emoni Narawa scored the first of the Chiefs´ seven tries in an action-packed match. McKenzie ignited the counter-attack from a Highlanders´ kick, running cross-field to link with Narawa, who beat several tacklers on a weaving run to the line.Stevenson scored his 10th try of the season, staying atop the try-scoring list. Rona put a chip kick behind the defense and Stevenson was in place to take the ball and score.All Blacks center Anton Lienert-Brown scored next in his 100th match for the Chiefs, which also marked his return after a long injury layoff.The next was the best of the match, finished by prop George Dyer. McKenzie again launched the counter from nothing and was joined by Stevenson and Narawa before Dyer tacked on the end of a sweeping movement to score.Stevenson and McKenzie again had a part in a try for Rona that started the second half. Rona added another in the 60th minute and scrumhalf Weber scored the last while the Highlanders scored tries through De Groot, fullback Sam Gilbert, scrumhalf Aaron Smith and backrower Shannon Frizell.___More AP rugby: https://apnews.com/hub/rugby and https://twitter.com/AP_Sports"
    ]
}