{
    "articleURL": "/wires/ap/article-12060747/Grace-Bumbry-1st-Black-singer-Bayreuth-dies-86.html",
    "content": [
        "NEW YORK (AP) - Grace Bumbry, a pioneering mezzo-soprano who became the first Black singer to perform at Germany's Bayreuth Festival during a career of more than three decades on the world's top stages, has died. She was 86.",
        "Bumbry died Sunday at Evangelisches Krankenhaus, a hospital in Vienna, according to her publicist, David Lee Brewer.She had a stroke on Oct. 20 while on a flight from Vienna to New York to attend her induction into Opera America's Opera Hall of Fame. She was stricken with the plane 15 minutes from landing, was treated at NYC Health + Hospitals/Queens and returned to Vienna on Dec. 8. She had been in and out of facilities since, Brewer said Monday.Bumbry was born Jan. 4, 1937, in St. Louis. Her father, Benjamin, was a railroad porter and her mother, the former Melzia Walker, a school teacher.She sang in the choir at Ville´s Sumner High School and won a talent contest sponsored by radio station KMOX that included a scholarship to the St. Louis Institute of Music, but she was denied admission because she was Black. She sang on CBS´s \"Arthur Godfrey´s Talent Scouts,\" then attended Boston University College of Fine Arts. and Northwestern, where she met soprano Lotte Lehmann, who became her teacher at the Music Academy of the West in Santa Barbara, California, and a mentor.Bumbry, known mostly as a mezzo but who also performed some soprano roles. was inspired when her mother took her to a recital of Marian Anderson, the American contralto who in 1955 became the first Black singer at New York's Metropolitan Opera. Bumbry became part of a generation of acclaimed Black opera singers that included Leontyne Price, Shirley Verrett, George Shirley, Reri Grist and Martina Arroyo.",
        "Bumbry was among the winners of the 1958 Met National Council Auditions. She had a recital debut in Paris that same year and made her Paris Opéra debut in 1960 as Amneris in \"Aida.\"The following year, she was cast by Wieland Wagner, a grandson of the composer, to sing Venus in a new production of \"Tannhäuser\" at the Richard Wagner Festival in Bayreuth. Bumbry's casting in a staging that included stars Wolfang Windgassen, Victoria de los Angeles and Dietrich Fischer-Dieskau resulted in 200 protest letters to the festival.\"I remember being discriminated against in the United States, so why should it be any different in Germany?\" Bumbry told St. Louis Magazine in 2021. \"I knew that I had to get up there and show them what I´m about. When we were in high school, our teachers - and my parents, of course - taught us that you are no different than anybody else. You are not better than anybody, and you are not lesser than anybody. You have to do your best all the time.\"Reviews of her Bayreuth debut on July 23, 1961, were mostly positive.\"A voice of very large size, though a little lacking in color. It is a voice that has not as yet `set,' as the teachers say,\" Harold C. Schonberg wrote in The New York Times. \"She is obviously a singer with a big career ahead of her.\"",
        "As a result of the attention, Bumbry was invited by first lady Jacqueline Kennedy to sing at a White House state dinner the following February. Debuts followed at Carnegie Hall in November 1962, London´s Royal Opera in 1963 and Milan´s Teatro alla Scala in 1964.She appeared at the Met on Oct. 7, 1965, as Princess Eboli in Verdi's \"Don Carlo,\" the first of 216 performances with the company.\"Her assurance, self-possession, and character projection are the kind from which a substantial career can be made,\" Irving Kolodin wrote in the Saturday Review.Bumbry's final full opera at the Met was at Amneris in Verdi's \"Aida\" on Nov. 3, 1986, though she did return a decade later for the James Levine 25th anniversary gala to sing \"Mon coeur s´ouvre à ta voix (Softly awakes my heart)\" from Saint-Saëns´ \"Samson et Dalila.\"Met general manager Peter Gelb said \"opera will be forever in her debt for the pioneering role she played as one of the first great African American stars. \"\"Grace Bumbry was the first opera star I ever heard in person in 1967 when she was singing the role of Carmen at the Met and I was a 13-year-old sitting with my parents in Rudolf Bing´s box,\" Gelb said. \"Hearing and seeing her giving a tour-de-force performance made a big impression on my teenage soul and was an early influence on my decision to pursue a career in the arts, just as she influenced generations of younger singers of all ethnicities to follow in her formidable footsteps.\"",
        "In 1989, she sang in the first fully staged performance on a work at Paris´ Bastille Opéra in Berlioz´s \"Les Troyens (The Trojans).\" In 2009, she was celebrated at the Kennedy Center Honors.Bumbry's 1963 marriage to Polish tenor Erwin Jaeckel ended in divorce in 1972. Bumbry was predeceased by brothers Charles and Benjamin.Brewer said memorials are being planned for Vienna and New York."
    ]
}