{
    "articleURL": "/tvshowbiz/article-12042301/Toni-Collette-shares-moving-quote-broken-exhausted-following-split.html",
    "content": [
        "Toni Collette has turned to art following her heartbreaking split from her husband of 20 years, Dave Galafassi. ",
        "The actress was reportedly devastated by their split, and has shared a poignant quote alongside a painting by expressionist painter Malcom T Liepke. Posting to her Instagram story on Wednesday, the painting depicts a couple sitting on a couch. The man has his head nuzzled into the woman's chest as she has her arms wrapped around him. The quote that Toni shared alongside the painting is by Henry Miller. ",
        "It reads: 'Give me a few days of peace in your arms, I need it badly. 'I feel broken and empty exhausted. Later I can face the world.' The Mafia Mamma actress, 50, reportedly struggled to face work commitments, such as interviews, after her split with Dave made headlines at the end of last year. ",
        "A longtime friend of Toni told Woman's Day two months ago that she was devastated that their split became so public.  'She has not recovered from her split and she is not likely to anytime soon,' the friend told the publication at the time.'Toni's a marvel at how she's able to pull herself together and keep functioning.'The promotional side of movies is something she usually enjoys, but not when her life is a mess.' ",
        "The couple share daughter Sage, 14, and son Arlo, 11, together. ",
        "Dave, who was a drummer in an indie rock band when he met the About a Boy star, confirmed their split in December 2022 when he was pictured passionately kissing chiropractor Shannon Egan at Manly Beach in Sydney. Daily Mail Australia contacted Toni's management about the photos, and hours later she announced the couple had split in a joint statement released on her newly reactivated Instagram account.'It is with grace and gratitude that we announce we are divorcing,' the pair wrote.",
        "'We're united in our decision and part with continuing respect and care for each other.'Our kids are of paramount importance to us and we will continue to thrive as a family, albeit a different shape. We're thankful for the space and love you grant us as we evolve and move through this transition peacefully. Big thanks.'The pair met in 2002 at the launch of Galafassi's band's debut album Metal Detector in Sydney, and their second encounter came just a few days later at a house party.They were married with Buddhist rituals on her property at Berry on the NSW south coast less than a year after they met, in January 2003."
    ]
}