{
    "articleURL": "/wires/aap/article-12050465/Raiders-make-four-row-NRL-Magic-Round-opener.html",
    "content": [
        "Canberra are keen to kick their habit of triumphing in chaotic, close games after withstanding a Canterbury comeback and getting Magic Round off to a high-scoring start with their fourth-straight win.",
        "Friday night's 34-30 victory was perhaps the most entertaining of the Raiders' recent run, which comes after a 1-4 start threatened to end their season before it had truly begun.The injury-ravaged Bulldogs moved closer to full-strength with the inclusion of Jacob Kiraz, Franklin Pele and Max King but were left to rue a slow start that had them behind 22-6 and playing catch-up for the rest of the night.The boots of Jamal Fogarty and Jack Wighton established a first-half lead the Raiders never surrendered but they were never able to shake entirely free of the plucky Bulldogs on a Suncorp Stadium surface already showing signs of wear with seven more games to follow.Two quick Canterbury crosses threatened to make a game of it at 22-18, and a late penalty try to Hayze Perham pulled the Bulldogs back within four points as the minutes ticked down.\"It's pleasing to win but we'd like to win a little bit easier than taking it right to the end,\" Raiders captain Elliott Whitehead said.\"We just need to cut a few more tries out, make those gaps a little bit bigger instead of leaving it until the last minute to get the win.\"While agreeing with his captain, coach Ricky Stuart took confidence from the Raiders' ability to close out tight games.",
        "\"I said to Jack (Wighton) after the game ... 'We're winning, mate. We're learning while we're winning',\" Stuart said.\"We could've been in the same position not winning those games; and we have been.\"A couple of times last year, we were losing those games on the back end.\"Cult hero Corey Horsburgh strengthened his case for a State of Origin debut by running for 174 metres, almost 20 of which came in an enormous opening carry that put the Raiders in position to score from the first set of the night.A Fogarty kick had Jordan Rapana over in the corner during the first 60 seconds and from there the Green Machine went into overdrive, putting on three more tries in eight minutes midway through the opening period.\"To come out and start the game the way we did was terrible. There were just too many people not doing their jobs,\" Bulldogs coach Cameron Ciraldo said.\"The fact that we still had a chance to win it at the end there, we probably didn't deserve that.\"Bulldogs wingers Kiraz and Declan Casey struggled to handle the pressure being thrown their way by the Raiders, with Xavier Savage cashing in on his NRL return thanks to a Wighton kick.Wighton could have had a second try assist but what appeared a pin-point pass to Pasami Saulo in the red zone was called forward shortly after halftime. He had his own long-range effort denied for a knock-on that appeared to have come off his head.",
        "\"Chris (Sutton) has got a tough job as a ref but two (disallowed) tries tonight I thought were tries, which would have showed we were the superior team,\" Stuart said.The Bulldogs looked likeliest on their left edge, where rookie second-rower Jacob Preston burst over for a first-half double.After the break, a trademark Matt Burton bomb sat up perfectly for Kiraz and the winger belted down the right side, throwing an overhand pass to Jake Averillo who completed one of the tries of the season.In the 76th minute, the bunker ruled Josh Papali'i hit Perham without the ball in a tryscoring situation but time was on the Raiders' side."
    ]
}