{
    "articleURL": "/tvshowbiz/article-12042221/Sells-like-teen-spirit-Cobain-guitar-auction.html",
    "content": [
        "A guitar smashed on stage by Nirvana front man Kurt Cobain has been sold off for a jaw-dropping $595,900 at an auction.",
        "The guitar, which was put back together but is no longer playable, was expected to fetch $80,000 before it was sold off at Julien's Auctions this past weekend for the astronomical amount.Cobain was one of the most popular rock musicians of the 1990s thanks to his band Nirvana, which helped lead the grunge revolution until his untimely death. He was married to singer Courtney Love and they welcomed daughter Frances Bean Cobain, now 30, together. Speaking with AFP ahead of the auction, Kody Frederick of Julien's Auctions said: 'You can see here the break that took place as he slammed down the guitar, where the neck here kind of connects, as well as down here on the bottom where he slammed the guitar down.''Kurt Cobain, when he was on stage, when he played, he was a machine. The man was angry, and you could feel that on stage. And you would feel that by the way he would treat his instruments.",
        "'This broken element, in a strange way, from this broken musician, that really defined this rough and tumble era of music.' The busted black Fender Stratocaster was signed by all three members of the Seattle grunge outfit as they rocketed to global fame.It was originally given to the late Mark Lanegan, a member of the the grunge group Screaming Trees and a close friend of Cobain's. ",
        "Nirvana's hits, many of which were penned by Cobain, included Come As You Are, Lithium and the breakout Smells Like Teen Spirit - a track that became anthemic for a generation of alienated teenagers.Cobain struggled with substance addiction and depression, and had a tumultuous relationship with his wife, Courtney Love.He took his own life in April 1994.In total, the auction had six Nirvana items which all sold off. The items included a set list hand-written in pink marker by Nirvana drummer Dave Grohl for an April 1991 gig in Seattle.The gig included an early public performance of Smells Like Teen Spirit, and came months before the release of Nevermind, the multimillion-record selling seminal grunge album. ",
        "It was expected to go for up to $6,000 but sold off for $50,800 after receiving 28 bids. A vocal pressor rackmount road case believed to be used by Cobain during a Nirvana tour was sold off for $5,200, while a copy of the band's 1989 album Bleach signed by Cobain, Grohl and Krist Novoselic was purchased for $5,850. The auction also included memorabilia from the careers of Eddie Van Halen, Elvis Presley, Freddie Mercury and Bill Wyman."
    ]
}