{
    "articleURL": "/sport/football/article-12051013/Napolis-Scudetto-33-years-potential-revitalise-city-Naples.html",
    "content": [
        "Napoli won their first Scudetto in 33 years after drawing with Udinese Luciano Spalletti's side wrapped up the Serie A title with five games still to playHis young team now have the chance to dominate the next era of Italian football Thousands of fans surround the gates and are inside the stadium. Here is Diego Armando Maradona's latest miracle. A sell-out just to watch the decisive Udinese vs Napoli game on a screen inside.",
        "Fans sing, smoke bombs are let off and more. It is Thursday night and by now everyone in Naples is wearing a blue shirt and they will be sleeping in it too.In the shops, Osimhen's shirt, his Zorro mask and blue confetti are being sold.  After 33 years, Napoli have once again won the Scudetto.The new heroes of Naples are now Osimhen, Stanislav Lobotka and Khvicha Kvaratskhelia.Even the renowned Italian film director Paolo Sorrentino is ready to make a documentary all about the club's third ever Serie A triumph, with his cameras already filming the celebrations in the heart of the city.",
        "He told Dazn: 'This day is one of the most exciting things in my life. I seriously thought it could be Napoli's year during AC Milan vs Napoli, with (Giovanni) Simeone's goal (to help them win 2-1 in September) and I realised the team knew how to win even as Juventus did in the past.'33 years of passion, effort, relegations and failures. There have been tears and smiles over recent years for Napoli.Fans throughout Serie A, especially from southern teams, are happy to see a fantastic city embarking on celebrations that will surely go on for several months.The match against Udinese was in truth not completely relevant with the Scudetto long-wrapped up, but Napoli played it as if their lives depended on it.",
        "In reality the Scudetto was over in February when Juventus were reeling after a 15-point deduction, Inter and AC Milan were starting to lose ground and Lazio and Roma were struggling to keep up with the leading sides in the league.",
        "People had begun to celebrate among a sensational atmosphere that enveloped the city from the early hours of Thursday morning, while they just had to undergo a 90-minute wait to officially celebrate a triumph that has been in the pipeline since February.Napoli started the game poorly and it looked as if the nerves had overcome them, before Osimhen equalised after 53 minutes and got his team playing, ensuring the final period of the game was a celebration for those fans who had travelled to watch the team. Luciano Spalletti's side have played 33 games, scoring 69 times, displaying a brilliant and exciting European brand of football.",
        "Napoli's Scudetto is also a spark that can ignite a new golden age in Naples - a city that has become known for its philosophy, history, art, food and wine and geological beauty.More and more people are now coming to visit which has huge economic benefits.The problems of poverty, unemployment and crime are well-documented, but football is giving this city a rebirth. ",
        "Owner Aurelio De Laurentiis has overseen a sporting miracle and it is him that deserves enormous credit for this achievement.On May 30, 2022, he drew a line in the sand with past failures by declaring Napoli would win the Scudetto and this prophecy has come true.The triumph can now transform Napoli into a new capital of Italian football and a golden period that could put them consistently ahead of Juventus, Inter and AC Milan. The party is just getting started in Naples and is likely to continue for the foreseeable future.Every triumph and title has several heroes and the love for Kvaratskhelia is perhaps even bigger than for Osimhen, with an increase in the number of babies being named after the Georgian star.",
        "One father called Armando - named after Diego Armando Maradona - explained how he wanted to continue this tradition with his son by calling him Kvicha, after the Napoli star. Kvaratskhelia is now worth €140m (£123m), having been signed for €15m (£13m) last summer which shows the genius of De Laurentiis in creating a team full of young exciting stars who have developed into top quality players in under a year.  Giovanni di Lorenzo will be the first Napoli captain to lift the Serie A trophy in 33 years in a moment that will summarise 33 years of pain in one roar. ",
        "For this team has revived the careers of players like Hirving Lozano, Mario Rui and Tanguy Ndombele who had previously struggled, while players like Osimhen, Kvaratskhelia and Lobotka have been transformed into stars."
    ]
}