{
    "articleURL": "/news/article-12046529/Man-accused-stalking-Sophie-Monk-explains-sad-reason-showed-door.html",
    "content": [
        "Father-of-two denies stalking Sophie MonkArrived at her home with a single rose last week He claims scammers tricked him into a 'relationship' with SophieA man accused of stalking Sophie Monk after arriving at her door with a red rose claims he believed he was in relationship with the TV star after being 'catfished'.",
        "Brian Rapley, 49, is alleged to have travelled to Sophie's Central Coast home on April 25 with the hope he would be meeting her in person after exchanging loved-up messages online.He claims that a con artist posing as Sophie sent him romantic texts and DMs for four months before scamming him out of $7,000.Sophie's neighbours alerted her manager when Rapley allegedly yelled out for the Love Island star, who has since told police she has never been in contact or known of the man.Rapley was taken to Gosford Police Station before being served a restraining order for the incident.",
        "'I feel like such an idiot,' Rapley told the Daily Telegraph.'But I thought we were in a relationship.'Rapley described the situation as 'belittling and distressing' after being surrounded by police officers who questioned him 'like I was some crazed stalker'.He showed the officers the messages he received asking him to come to Sophie's house.The texts even revealed her exact address prompting the lovestruck admirer to think they were going to meet.",
        "Rapley initially arrived at Sophie's home at about 7.30am.Police immediately questioned why he was at the star's home.Rapley insisted he was visiting her for the first time and that the pair had an online relationship.",
        "He was arrested when he returned to the street later that night.'I had five cop cars around me and I'm being told 'Get out with your hands up',' Rapley said.",
        "According to Rapley, the scammers started to latch onto him shortly after he left a comment under a post on Sophie's Instagram.Soon after he received a message from another account with the same pic as Sophie, saying 'Hey it's Sophie … let's chat here, my manager reads my official account, so this is better',' Rapley said.The scammer and Rapley only ever spoke online with the impersonator insisting 'her phone was broken'.'I did think that was weird, I was like 'If you are who you say you are, you could walk into a shop and get a new phone for free'.'During the four months Rapley was being scammed, he was contacted by a company claiming to be a legal firm urging him to sign a temporary marriage certificate with Sophie although she is already married to Joshua Gross.He was told she had a major windfall coming but needed to be married in order to receive it.Rapley was instructed to send photo ID and sign several documents along with money.Although he questioned the insistent requests for payments from who he believed was Sophie, he said he was 'lonely and I believed her'.",
        "In a police statement Sophie said she do not know any person by the name of Brian Rapley. 'I am not in a relationship with anyone by the name of Brian Rapley. I am currently happily married to my husband Joshua Gross,' she said.Mr Rapley is due to appear in court for the AVO matter on May 16."
    ]
}