{
    "articleURL": "/wires/ap/article-12038057/Russian-defense-chief-wants-wartime-missile-output-doubled.html",
    "content": [
        "KYIV, Ukraine (AP) - Russia´s defense chief on Tuesday urged a state company to double its missile output, as a possible Ukrainian counteroffensive looms and both sides in the 14-month war reportedly experience an ammunition crunch.",
        "Russian Defense Minister Sergei Shoigu, speaking at a meeting with top military brass, said the state-owned Tactical Missiles Corporation had been fulfilling its contracts in a timely manner.But, Shoigu added, \"right now it is necessary to double the production of high-precision weapons in the shortest possible time.\"Analysts have been trying to figure out whether Russia is running low on high-precision ammunition, as its missile barrages against Ukraine have become less frequent and smaller in scale.The U.K. Defense Ministry noted in a Tuesday assessment that \"logistics problems remain at the heart of Russia´s struggling campaign in Ukraine.\"\"Russia does not have enough munitions to achieve success on the offensive,\" it said.",
        "Kremlin spokesman Dmitry Peskov on Tuesday described Washington´s latest estimate of Russia´s losses in Ukraine as \"spun out of thin air.\"The White House said Monday it now estimated that Russia had suffered 100,000 casualties just since December, including more than 20,000 killed, as Ukraine rebuffed a heavy assault by Russian forces in eastern Ukraine.White House National Security Council spokesman John Kirby said the U.S. estimate was based on newly declassified American intelligence. He did not explain how the intelligence community derived the number.\"Washington doesn´t have the opportunity to give any correct numbers. They don´t have such data,\" Peskov said.",
        "Later Tuesday, the Ukrainian military reported that Russian forces launched 30 airstrikes, three missile strikes and eight attacks from multiple rocket launchers, resulting in casualties among the civilian population and damage to civilian infrastructure.The General Staff of Ukraine's armed forces said Russia was continuing to concentrate its efforts on offensive operations in Ukraine´s industrial east, focusing attacks around Lyman, Bakhmut, Avdiivka and Marinka in the country´s Donetsk province.The prosecutor´s office in Ukraine´s southern Kherson province reported that Russian shelling in the regional capital, also called Kherson, and several villages killed three people and wounded five.Ukrainian forces, meanwhile, say they are readying their own counteroffensive - and stockpiling ammunition to sustain it along potentially long supply lines.Ukrainian Defense Minister Oleksiy Reznikov said Monday that the \"key things\" for the assault´s success were \"the availability of weapons, prepared, trained people, our defenders and defenders who know their plan at their level, as well as providing this offensive with all the necessary things - shells, ammunition, fuel, protection, etc.\"\"As of today, we are entering the home stretch, when we can say: `Yes, everything is ready,´\" Reznikov said in televised comments.In Russia´s Bryansk region, which borders northern Ukraine, an \"unidentified explosive device\" derailed a freight train, Gov. Alexander Bogomaz said Tuesday evening.",
        "Russian Railways confirmed that \"illegal interference\" caused 20 cars of the freight train to derail. No casualties were reported.An explosive device also derailed a freight train in Bryansk on Monday.There were no immediate indications who set off the explosives, but Bryansk has received sporadic cross-border shelling during the war. In March, two people were reported killed in what regional officials described as an incursion by Ukrainian saboteurs.In recent months, amid winter weather, the conflict has become bogged down in a war of attrition that has depleted ammunition stocks.The Kremlin´s forces took aim at Ukraine´s critical infrastructure with long-range strikes, while Kyiv zeroed in on Russian targets with precision artillery provided by its Western allies.In February, NATO Secretary-General Jens Stoltenberg warned that Ukraine was using up ammunition far faster than its allies could provide it.According to some estimates, Ukraine was at that time firing up to 6,000-7,000 artillery shells each day, around a third of the daily amount that Russia was using almost one year into the war.Sporadic nighttime Russian shelling continued to hit Ukrainian areas early Tuesday, officials said. At least seven civilians were wounded, authorities said.As Ukraine's military prepares for a counteroffensive to take back Russian-occupied territory, Denmark said Tuesday that it was donating 1.7 billion kroner ($251 million) in aid to Ukraine, including mine clearance vehicles, munition, field bridges and money for air defenses.",
        "\"We know that the Russians have entrenched themselves in the occupied territories of Ukraine with trenches, minefields and other obstacles to stop a Ukrainian offensive,\" acting Danish Defense Minister Troels Lund Poulsen said.\"The material in the donation package is important to pave the way for Ukrainian tanks and the armored infantry in the front line.\"Amid growing Russian influence in Africa, with Russian Foreign Minister Sergey Lavrov visiting the continent twice this year, Ukrainian President Volodymyr Zelenskyy said in his nightly address that he had spoken with chairperson of the African Union and President of the Comoros Azali Assoumani on Tuesday.In the video update, Zelenskyy said he had invited Assoumani to join the implementation of Ukraine´s \"Peace Formula,\" and assured Assoumani that Ukraine was \"ready to be a reliable guarantor of food security.\" ___Follow AP´s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
    ]
}