{
    "articleURL": "/wires/ap/article-12051771/Alcaraz-celebrates-20th-birthday-return-Madrid-final.html",
    "content": [
        "MADRID (AP) - On the attack during most of his semifinal win at the Madrid Open, Carlos Alcaraz produced his best slice after the match.",
        "Alcaraz was presented with a cake on center court to celebrate his 20th birthday on Friday after beating 17th-seeded Borna Coric 6-4, 6-3.After staring at the gargantuan cake whose top was shaped like a tennis ball crowned by the number 20, Alcaraz took a knife and deftly cleaved off a thin piece to give it a try.After the crowd sung \"Happy Birthday\" in Spanish, the defending champion told the packed Manolo Santana Stadium, \"It truly is incredible to celebrate my birthday with all of you. Each year I celebrate my birthday here. When I turned 18, I played Rafael Nadal (in a loss), when I turned 19 I played (Cameron) Norrie (in a win), and now at 20 I advance to the final.\"The second-ranked Alcaraz will face 65th-ranked Jan-Lennard Struff in Sunday's final after the German fought back from a set down to beat Aslan Karatsev.Alcaraz is aiming for his fourth title of the season after triumphs in Buenos Aires, Indian Wells, and Barcelona. He is also preparing for the French Open this month.",
        "If Alcaraz successfully defends his title in Madrid, he will recover his world No. 1 ranking by playing one match in Rome next week.In his first matchup with Alcaraz, Coric surprised early with his ability to counter his drop shots, so Alcaraz changed tactics and just battered the Croat into submission. He took a 3-2 break lead and didn't look back.",
        "Alcaraz has dropped only one set - the first in his opener against Emil Ruusuvuori - at the tournament he won for the first time last year en route to becoming the U.S. Open and the youngest year-end No. 1 in ATP history.After that comeback win over Ruusuvouri, Alcaraz made quick work of Grigor Dimitrov, Alexander Zverev and Karen Khachanov to reach the semifinals.\"It means a lot to me, playing a final again here in Madrid,\" Alcaraz said. \"It´s such a special place for me and I have great memories since I came here to play (when I was) under 12. Of course last year was amazing. Turning 20 like that is special, so I will enjoy the final here and I will try to make all of Spain happy.\"Alcaraz has won his last 20 matches in Spain.Women´s No. 1 Iga Swiatek and No. 2 Aryna Sabalenka will meet for the title on Saturday.Ten days ago, Struff lost to Karatsev in qualifying, but he joined the draw as a lucky loser and made the most of it reach his first career final.His 4-6, 6-3, 6-4 victory over Karatsev also meant Struff was the first lucky loser to reach an Masters 1000 final.Struff struck 15 aces and will hope his big serve helps him dethrone Alcaraz. Struff already upset fourth-seeded Stefanos Tsitsipas in the quarterfinals.",
        "The final will be his ninth match at the tournament, compared to six for the top-seeded Alcaraz.Struff beat Alcaraz on clay at the French Open in 2021, while Alcaraz needed five sets to down Struff at Wimbledon last year.\"This is going to be different,\" Struff said. \"This is in Spain, in Madrid. He is 20-0 on Spanish clay courts, so it is going to be very tough. I have to go for it otherwise I will have no chance. I will try my best to beat him and win my first title.\"___AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}