{
    "articleURL": "/tvshowbiz/article-12047735/Drew-Barrymore-PULLS-hosting-MTV-Movie-TV-Awards-support-WGA-strike.html",
    "content": [
        "Drew Barrymore dramatically withdrew from her hosting gig at the MTV Movie &amp; TV Awards in solidarity with the Hollywood writers strike.",
        "The decision threw the event into chaos just three days before it airs on Sunday, with organizers now scrambling to hold the event without any host at all.However Drew, 48, has already signed on to compere next year's MTV Movie &amp; TV Awards in an olive branch to the network, Variety reports.Plans for Sunday's ceremony remain up in the air, with producers left on tenterhooks to see if any of the other celebrities involved in the broadcast will follow in Drew's footsteps and pull out in support of the union.The Writers Guild Of America began its strike Tuesday night after its negotiations with the studios fell apart, with sticking points that included residual payments in the evolving climate of streaming, as well as staffing requirements.",
        "As a result, Sunday night's award show has had to fall back on contingency measures such as scrapping its red carpet portion. 'I have listened to the writers, and in order to truly respect them, I will pivot from hosting the MTV Movie &amp; TV Awards live in solidarity with the strike,' said Drew.'Everything we celebrate and honor about movies and television is born out of their creation. And until a solution is reached, I am choosing to wait but I’ll be watching from home and hope you will join me,' she declared.",
        "'I thank MTV, who has truly been some of the best partners I have ever worked with. And I can’t wait to be a part of this next year, when I can truly celebrate everything that MTV has created, which is a show that allows fans to choose who the awards go to and is truly inclusive,' her statement concluded.Meanwhile her talk-show, The Drew Barrymore Show, has already finished filming its present season, which as a consequence will presumably be able to air unimpeded, The Hollywood Reporter revealed.While many daytime series do not have union writers on staff, The Talk does, and consequently will not air throughout the strike.Kelly Clarkson's daytime show also has a union writing staff, but has a number of pre-taped episodes it can fall back at the moment.Other series like The View, Tamron Hall and Live With Kelly And Mark have been able to proceed as usual this week.",
        "Insiders have pointed out that while The View's writers have gone on strike, the long-running morning show largely rumbles along without a script.Meanwhile, although Drew will not appear live at Sunday's awards show, her pre-taped segments will still likely be broadcast.Paramount Global executive Bruce Gillmer, who is serving as an executive producer on the MTV Movie &amp; TV Awards, shed further light on its turbulent circumstances.",
        "One of Drew's pre-taped clips might be deployed as the opener for the show, he said, but the final decision on how to kick-start the event has yet to be made.Evidently some of the prospective winners have also pre-taped their acceptance speeches, which may in that case be able to be used.'We’re going to be super respectful of the talents’ decisions to either be involved in pre tapes, show up or not show up, whatever they decide. We’ve got backup plans and coverage just in case, so I guess the short answer is, I’m not sure yet…,' he said.'There’s also athletes and celebrity chefs and all kinds of other talent that are not squarely affected,' he noted, teasing: 'We will be looking for some live talent in the room to help tell the story, but not host segments per se. We also have a very charismatic VO artist with us, so stay tuned.'Some of the celebrities who were originally slated to appear include Jamie Lee Curtis, Tiffany Haddish, Sarah Michelle Gellar and Gal Gadot.",
        "Cindy Crawford's daughter Kaia Gerber, Leonardo DiCaprio's ex Camila Morrone, Robert Pattinson's girlfriend Suki Waterhouse, Elvis Presley's granddaughter Riley Keough and singing star Halle Bailey were also on the initial roster.Despite Drew's decision to quit this year's show, Bruce had nothing but warm words for her while commenting on the proceedings in public.",
        "'Drew, without question, she’s been incredible. It’s hard to imagine that we’ve ever had a better experience with a host. She’s more of a partner really, she’s in it every day, just super passionate and super engaged and creative. She even bought some of her own team along for the journey,' he said.'So when this all reared its head, we started to prepare for what could be. She is not surprisingly, standing in solidarity with the writers, which we have full respect for. She has our full support,' Bruce assured Variety."
    ]
}