{
    "articleURL": "/wires/aap/article-12057617/Triple-treat-Titan-Lofi-new-goal-Eel-blitz.html",
    "content": [
        "Gold Coast speed demon Alofiana Khan-Pereira has scored five try doubles this season but he's not satisfied with that.",
        "\"I haven't had a triple yet this year in the NRL. That's what I want,\" he told AAP.The 21-year-old rookie winger was speaking after scoring two tries in the 26-24 win over Parramatta in the final game of Magic Round to lift the Titans to seventh position on the NRL ladder.In nine games the Lismore-born flyer has scored 11 tries but he has one gripe.\"I am sick of hearing everyone telling me that I am a doubles-only winger,\" he said.\"I am definitely itching for that triple. It will come.\"At Burleigh Bears in the Queensland Cup last year Khan-Pereira - known as 'Lofi' - scored 25 tries in 19 games under the coaching of Rick Stone.That tally included three hat-tricks and a four-try display against the Mackay Cutters.The flyer credits former Newcastle Knights coach Stone for his try-scoring ways.\"Rick Stone was the guy who did everything for my development. He was awesome for me,\" he said.\"He trusted me as a player and he trusted my speed. He would always tell me to stay right out wide and let the ball come to me.\"There were games where I was getting 300m. I had a good combination with all of the Burleigh players.\"Veteran five-eighth Kieran Foran scored a double himself against the Eels on Sunday, and could have had a triple if Khan-Pereira had passed him the ball.",
        "Instead the confident speedster chipped ahead and scored himself.\"Looking back ... I should have passed it to Foz (Foran),\" he grinned.\"He backed me, so it was good.\"Khan-Pereira said he had been clocked at 37 km/h, which, while not up with Bulldogs winger Josh Addo-Carr's 38.7km/h recorded last year against the Titans, is still seriously quick.It is one of the reasons the left edge attack of the Titans is so lethal, with No.6 Foran and second-rower David Fifita promoting Khan-PereiraThe rookie said there was a lot of improvement still left in him.\"It is only my (ninth) game and I still want to try and improve myself every week and not get too comfortable,\" he said.\"I had a good year last year and that really set my platform. More doors opened up after that and I got closer to the NRL dream.I pushed it more ... and happy days now.\""
    ]
}