{
    "articleURL": "/wires/reuters/article-12053817/Police-arrest-anti-monarchy-protesters-ahead-King-Charles-coronation.html",
    "content": [
        "By Andrew MacAskill",
        "LONDON, May 6 (Reuters) - Police arrested the leader of the anti-monarchy group Republic hours before King Charles' coronation on Saturday and a number of other protesters who had gathered among the crowds lining the procession route in central London.Republic had earlier said it would mount the biggest protest against a British monarch in modern history. But London police chief Mark Rowley warned on Friday that police would take action if protesters tried to \"obstruct the enjoyment and celebration\" of people.Protesters, dressed in yellow t-shirts to make themselves stand out, were demanding an elected head of state and say that the royal family has no place in a modern constitutional democracy and is staggeringly expensive to maintain.A spokesperson for the group said police had arrested its leader Graham Smith on Saturday morning. A photo posted on Twitter showed Smith sitting on the ground surrounded by police officers.Police did not confirm Smith's arrest but said they had arrested four people on suspicion of causing a public nuisance and three people on suspicion of possessing articles to cause criminal damage in what they called a \"significant police operation\".An officer at the scene near Trafalgar Square said three republican protesters had been arrested for carrying paint.Republic said five of its supporters had been arrested and hundreds of its placards seized. A Reuters photographer said a number of Just Stop Oil protesters were also arrested.",
        "Kevin John, 57, a salesman from Devon who was among the protesters, said of the arrests: \"It is disgusting and massively over the top.\"\"It is also hugely counterproductive by the police because all it has done is create a massive amount of publicity for us. It is completely crazy.\"\"NOT MY KING\"Some anti-monarchy protesters had held up signs saying \"privatise them\" and \"abolish the monarchy, not the right to protest\", and \"Not My King\".Others signs featured a picture of Meghan, the wife of Charles' son Prince Harry, with the words \"the people's princess\", and \"God Save the King\" with a picture of the late soccer great Pele.Most of the anti-monarchy protesters on Saturday had congregated in Trafalgar Square next to the bronze statue of King Charles I, who was beheaded in 1649, leading to a short-lived republic.Although they were in a minority compared with the tens of thousands gathered on London´s streets to support the king, polls suggest support for the monarchy is declining and is weakest among young people.With the crown passing from Queen Elizabeth to her less popular son, republican activists hope Charles will be the last British monarch to be crowned.Since Charles became king last September, there have been protests at royal events. He was heckled at a Commonwealth Day event at Westminster Abbey in March and targeted with eggs in York in November.",
        "The death of the queen has also reignited debate in other parts of the world, such as Australia and Jamaica, about the need to retain Charles as their head of state.While many other European monarchies have come and gone, or are far diminished in scale and importance, the British royal family has remained remarkably resilient.In Britain, polls show the majority of the population still want the royal family, but there is a long-term trend of declining support.A poll by YouGov last month found 64% of people in Britain said they had little or no interest in the coronation. Among those aged 18 to 24, the number voicing little or no interest rose to 75%.More than 11,000 police officers are on patrol for the coronation, the biggest ceremonial event staged in the British capital for 70 years. (Reporting by Andrew MacAskill, Editing by Angus MacSwan, Alexandra Hudson)"
    ]
}