{
    "articleURL": "/sport/afl/article-12057939/AFL-Magpies-legend-Nathan-Buckley-accuses-Collingwood-fans-bigots-booing-Lance-Franklin.html",
    "content": [
        "Champion Swan is reaching the end of his career Coaches were  baffled at the booingCalls for Franklin to be celebrated Collingwood great Nathan Buckley has called out the 'ignorance and bigotry' of Magpies fans who booed Sydney superstar Lance Franklin after being baffled by the treatment the superstar copped at the MCG.",
        "Swans coach John Longmire was perplexed by the anti-Franklin sentiment from Magpie fans on Sunday and Collingwood coach Craig McRae said 'we don't boo', declaring it against the vibe of what he's trying to build.Franklin, 36, was potentially playing his second-last game at the MCG, with his team only taking to the famous ground once more this regular season - and the Swans won't play Collingwood again at all this year unless they meet in the AFL finals.Buckley, also a former Magpies coach, said fans should have 'celebrated' Franklin as a champion of the game and those who 'aren't bigots' should drown out any boos with cheers if they get the chance again.'If we get another chance, I hope Collingwood fans that aren't ignorant and that aren't bigots - because there will be some booing - stand up and applaud every time he gets a touch and try and drown that [booing] out,' he said on Monday morning.'That's exactly what the stars of the game and his status in the game deserves.'We were gifted an opportunity to celebrate this undisputed champion and a section of the faithful chose to denigrate. I don't think that we took the opportunity to do the right thing and take the higher ground.'",
        "Buckley said with Collingwood on top of the ladder, Magpies fans didn't need to boo Franklin.'I love the Collingwood faithful, but I've got a message (for them),' Buckley told SEN.'Your team is the toast of the town and they're handling themselves on and off the field with class and poise.'So, let's try and fall into line on the other side of the fence.'At best, it was a begrudging acknowledgment of the sustained brilliance Franklin has brought against Collingwood and at worst, it's ignorance and bigotry.'It's been 10 years since he played Collingwood here. Why would you boo one of the champions of the game? It doesn't make sense.'",
        "Longmire just couldn't understand why Franklin was booed.'Why would you boo him?' Longmire said.'You'd probably celebrate a 36-year-old, wouldn't you, who's been a champion of the game.'It's been 10 years since he played Collingwood here. Why would you boo one of the champions of the game? It doesn't make sense.'McRae's response was succinct when he was asked what he thought of the crowd's behaviour.'We just don't boo,' he replied after Collingwood's 29-point win."
    ]
}