{
    "articleURL": "/wires/reuters/article-12040177/After-Jays-6-run-inning-Red-Sox-storm-win.html",
    "content": [
        "Connor Wong went 4-for-4 with two home runs and a double as the Boston Red Sox edged past the visiting Toronto Blue Jays 7-6 on Tuesday night.",
        "After Toronto took the lead in a six-run fifth inning, Wong broke a 6-6 tie with a leadoff solo homer into the Green Monster Seats off Jays reliever Erik Swanson (0-1) in the eighth.Christian Arroyo and Masataka Yoshida also homered while Alex Verdugo hit two doubles for Boston, which banged out 14 hits and won its second straight to begin the four-game series.After starter Tanner Houck worked six innings, John Schreiber and Richard Bleier (1-0) followed with scoreless frames in relief. Josh Winckowski retired George Springer on a game-ending double play ball to record his first MLB save.Daulton Varsho hit a three-run homer during Toronto's big inning.Varsho, Vladimir Guerrero Jr., and Kevin Kiermaier all finished 2-for-4.After wasting Verdugo's leadoff double in the first, the Sox scored in each of the next three innings to take a 3-0 lead. Arroyo opened the scoring by crushing a two-out solo homer over the Green Monster in left-center field in the second.Verdugo hit another two-bagger to begin the third and scored after Rob Refsnyder crushed one of his own two batters later.Yoshida ran his hit streak to 12 games and upped Boston's lead to 3-0 with a fourth-inning homer into the right-center field bullpen.Meanwhile, Houck faced little trouble through the first four frames, walking only two and pitching no-hit ball until Varsho's two-out double to center in the fourth.",
        "The Blue Jays turned the score with six runs while batting around in the fifth. After Danny Jansen and Kiermaier hit back-to-back singles with one out, a two-out walk loaded the bases and Guerrero lined a two-run single to left.A passed ball then scored Bo Bichette with the tying run before Varsho launched a three-run homer to put Toronto in front for the first time at 6-3.During the last of the fifth, Boston got two runs back as Refsnyder and Yoshida sent hard singles through the left side.An inning later, Wong launched a solo homer just over the Monster, making it a 6-6 game after six.Houck allowed more than three earned runs in a start for the first time in his career. He was charged with six while striking out five, walking three and giving up six hits in six innings.Toronto counterpart Yusei Kikuchi gave up five runs on nine hits in 4 1/3 with two strikeouts.--Field Level Media"
    ]
}