{
    "articleURL": "/femail/article-12052501/Would-shell-7-000-holiday-private-jet-pet.html",
    "content": [
        "It's 11am and I'm relaxing in my plush leather seat, waiting for a private jet to take off. Sitting across the aisle from me is one of my fellow travellers: eight-year-old Maggie, who's just had a trim before her transatlantic trip to look nice for 'Daddy'.",
        "'She's Daddy's little girl,' her 'mum' Rhonda Copher explains. 'When we get home, she's going to be so excited to see him.'Maggie growls every now and then, but she's easily placated by a pat on the head or a bone-shaped biscuit.That's because Maggie is a cute yet feisty Cairn terrier — and she is one of five very privileged pooches accompanying their devoted owners to New York today.They're the VIP passengers of a new service, K9 Jets, billed as the world's first pay-per-seat private charter service for pets, which had its official launch at the end of January.",
        "As air travel gets ever-more expensive and chaotic for humans, it's much the same story for our four-legged companions.Post-Covid, cancelled flights and crew and ground staff shortages have made transporting pets fraught with difficulty.Even before the pandemic, they faced a stressful journey in a cage in the aircraft hold. Some owners would baulk at the expense and trouble, and rehome or even abandon their animals.Now, for the price of a first-class single ticket (around £7,000), pets can travel seated next to their owners in the cabin (though cats must stay in their carriers), hassle-free to Paris, Nice, Lisbon, Dubai, New Jersey and Los Angeles.Today, I'm travelling on the inaugural London to New York flight. In about seven hours' time, we'll touch down at Teterboro Airport in New Jersey — just 30 minutes from Manhattan — where private jet habitues including Miley Cyrus and Oprah Winfrey are to be spotted.",
        " One lady wants to take her four parrots to Lisbon With fingers and paws crossed, our plane — a Gulfstream IVSP, with a cruise speed of 528mph — carrying four paying passengers and five dogs takes off from Farnborough Airport in Hampshire.I'll admit, I'm apprehensive about travelling with dogs — will they be noisy?'People have this image of a dog party on the plane, that they're all going crazy,' says Adam Golder, co-founder of K9. 'But it's not like that.'And, ahem, what if the dogs should need to do their business?'We provide puppy pads in case of emergencies,' Adam explains. 'But the animals usually sleep throughout the flight. 'And private jets fly at a higher altitude [up to 44,000ft compared to 38,000ft for a commercial planes] so there's less turbulence.'The 42-year-old, who has a pilot's licence, and his wife, Kirsty, 39, a former executive assistant, set up a boutique private jet brokerage in 2021, G6 Aviation, after they were furloughed during lockdown by the media company where they worked.G6 caters for high-net-worth (HNW) families, pop stars, footballers and foreign royalty. In 2022, the company received an extraordinary request for a flight to New York for ten passengers — and ten dogs.",
        "Adam and Kirsty found a Facebook group where people had discussed chipping in for a private jet (which costs from around £5,000 per hour) so their pets could travel with them, and the Golders saw an opportunity.",
        "They set up K9 Jets — a brokerage with flights operated by a licenced carrier in the U.S. — solely for people travelling with their pets, and have since flown more than 100 — including dogs, cats and rabbits, but definitely no snakes.Have there been any unusual demands? 'One lady, who lives in Arizona in the U.S., wants to take her four parrots to Lisbon. That's a new one, but it's doable,' laughs Adam. 'Another wanted only fresh Scottish salmon for her two cats.'On board today is Rhonda, 50, who flew her pets in the other direction from New York to London last July. She and her husband had relocated to Budapest — where Rhonda, a writer, was researching her family history — from North Carolina with two pooches: Zach, a 14-year-old Australian cattle dog, and terrier Maggie.'Having our dogs go in cargo was not an option,' she says. 'With Zach's age, he might have been frightened by the experience. It was the best decision; it was stress free.'So how does it all work?Once you register online, your flight will be confirmed when the 75 per cent passenger and pet threshold is reached. K9 then requests the pet's documentation — including a fit-to-fly certificate and a rabies jab — which must be pre-cleared by the relevant authorities at the destination.",
        "On arrival, the aircraft will be met by the ground handling team who'll scan the pets' microchips and check paperwork. Luggage is off-loaded, collected and, within minutes, you and Fido can be on your way. Simples!Before our flight, the dogs had time to socialise and relieve themselves before we were whizzed through security in minutes.There is no meal service, but we're served afternoon tea and an endless supply of snacks and drinks, as and when required.The dogs are surprisingly well behaved. We only hear a few growls throughout the flight and they are easily pacified by one of K9's bespoke bone-shaped biscuits.Throughout the flight, one of our two pilots emerges from the cockpit to check all is well. Flight attendant Virginia Cummings, 25, tells me she recently flew out with a very famous American performer — but she can't name him. How does she feel about pooches as passengers?'I'm a big dog person, so getting to be in a cabin with them is a dream come true,' she says. 'Usually, there are more dogs than this. Sometimes, they can get a bit sick, but we have cleaning supplies on board.'Right on cue, a bit of turbulence upsets poor Zach and he vomits on his blanket.",
        "For Emma Wilde, a 45-year-old writer, producer and actor from Norfolk, this is her first trip on a private jet. Her French bulldog, Storm, is a two-year-old rescue wearing a blingy pink collar. 'I got her from Battersea Dogs Home,' says Emma. 'She's my world.'They are heading to LA for several months and Emma had long-searched for ways to get Storm into the U.S. She says none of the commercial airlines will let her fly because she is a flat-nosed breed and could suffer with more breathing problems in the air.",
        "She considered the Queen Mary, but that would mean putting Storm in a kennel on board for the seven-day voyage across the Atlantic.'I thought K9 was reasonable. It's not far off the price of a first-class ticket on a commercial plane.'Fair enough, but tickets aren't exactly cheap, starting at £7,100. That includes a ticket for one person and either two pets under 50lb or one pet at 51lb and over, as well as private terminal fees, luggage (a 20kg bag) and all taxes.But in a cost-of-living crisis, can spending thousands of pounds to fly a pet on a private jet be justified?'It's not like lots of people are doing this week in, week out,' Adam explains. 'It's usually a one-off. For pet owners, these animals are like their children, and they think it's a reasonable price to pay with the experience they get.'",
        "A first-class ticket on British Airways to New York, for example, will set you back just shy of £11,000; dogs can only fly as cargo. Putting pets in the hold can cost as much as £6,000, depending on the animal's size. And there are some horror stories doing the rounds.HR worker Jaimie Klepper, 29, and her husband, Jeff, 32, relocated from Germany to the U.S. in July last year. She went with her large, 16-month-old Leonberger, Lenny, on the K9 jet, but flew her golden retriever Bailey on a commercial airline, at a cost of £4,300.Bailey had a bad flight and suffered a twisted stomach. She needed life-saving surgery costing £8,000.'It was very stressful,' says Jaimie. 'I felt so bad that we were trying to save money and that it was our fault we put her through that.'The highest demand for K9's services so far is from people relocating to the States. Kathleen Saxton, 50, is moving from London to New York for work. Sitting quietly on her lap is first-time flyer Humphrey, a four-year-old malt-brown cockapoo. I never want to fly commercial ever again 'Putting him in the hold would be terrifying,' she says. 'Maybe airlines should do flights that are pet only. I wonder if that time will come.'It might. But all those flights can't be good for the environment. A Greenpeace report found that a private jet took off from the UK every six minutes last year, with flights between London and Paris being the most popular — and most polluting — route.",
        "To address these worries, K9 offsets the carbon emissions on its flights, as well as donating a percentage of ticket costs towards an animal sanctuary in Sri Lanka.'We're really conscious of the effect on the environment,' says Kirsty. 'We don't fly empty planes either — it's a waste.'Kirsty and Adam insist they don't live the jet-set life themselves. 'I've been on a few of these flights to make sure everything goes well. But that's about it,' says Adam.Nor do they have any pets — for now. 'My eldest daughter has started her, 'I would like a puppy' campaign, so I'm sure it's coming,' Kirsty adds.Our flight is smooth and clearing customs only takes minutes. 'I've been spoiled!' says Emma. 'I never want to fly commercial again.'Indeed, as it taken almost an hour to clear security on my return flight from JFK Airport back to London, I can't help but long for the comfort of a private jet — and even the company of canine companions."
    ]
}