{
    "articleURL": "/femail/fashionfinder/article-12046283/The-best-chainmail-dresses-2023.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Fashion Finder article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information. ",
        "The 90s delivered a plethora of fashion trends that made a lasting impression on the industry. From butterfly hair clips to denim overalls, these standout pieces have all made a comeback.This season, the chainmail dress has returned to reign supreme. And we're coming at you with our favourite picks from brands like EGO, Karen Millen, Misspap and 8 Other Reasons - and prices start at just £12.It first gained prominence during Versace’s Autumn/Winter 1994 show, when veteran supermodels Naomi Campbell, Helena Christensen, Linda Evangelista, Claudia Schiffer and Kate Moss rocked co-ordinating gold designs on the catwalk.",
        "Since then, these slinky dresses have continued to grow in popularity, being donned by numerous celebrities over the years – most recently Paris Hilton, Vick Hope, Emily Ratajkowski and Amanda Seyfried, who wore a gold chainmail mini dress to the 2023 Met Gala.It is safe to say the iconic chainmail mini is back with a vengeance. Current styles are racier than ever, typically incorporating a cowl neckline, low back and thigh-high slit. Whether you're looking to make a statement at a formal event or simply want to add some edge to your everyday wardrobe, a chainmail dress is sure to turn heads. And with a variety of styles and colors to choose from, there's something for everyone. ",
        "The best chainmail dresses   ASYOU chainmail dress Thanks to its one-shoulder neckline and charming fuchsia hue, this option from ASYOU is ideal for dipping your toe in the water.  £12 (save £17.99) Shop  Misspap Chainmail Dress Misspap’s red dress is far from subtle. With its fiery shade and flesh-flashing silhouette, it is certain to make an entrance.  £32 (save £7) Shop  EGO Chainmail Dress  Prepare to champion the trend in this classic silver dress from EGO. It incorporates all the expected elements, including a cowl neckline and low back.  £34  Shop  Karen Millen chainmail dress Karen Millen has brought a delicate touch to the trend with their latest collection. The iridescent green dress is our top pick, but there are further pastel colourways stocked online.  £95.20 (save £23.80) Shop  8 Other Reasons Chainmail Dress  For the fashion-forward, this semi-sheer design by 8 Other Reasons is a bold choice. Love Island’s Faye Winters is a fan of the brand, so you will be in great company.  £316 Shop"
    ]
}