{
    "articleURL": "/tvshowbiz/article-12053871/Jerry-Maguire-child-star-Jonathan-Lipnicki-looks-unrecognisable-Tom-Cruise-comedy.html",
    "content": [
        "Jerry Maguire child star Jonathan Lipnicki looked unrecognisable almost three decades since starring in the Tom Cruise smash hit. ",
        "The actor, who was known for his role as Renee Zellweger's son, Ray Boyd, made his screen debut in the Oscar-winning classic just at the age of six. He went on to land the lead role as George Little in the popular children's film franchise, Stuart Little.Jonathan, now 32, looks worlds away from the cheeky platinum blond haired child from the 1996 blockbuster. In recent photos shared to Instagram, he sported much longer curly locks and ditched the circular framed glasses as he gave a sneak peak of his recent work. ",
        "Alongside the behind-the-scenes snap from a film he is working on, Jonathan showcases his passion for martial arts, revealing his is a Brazilian Jiu-Jitsu blackbelt.As a child, after featuring in Jerry Maguire, he then landed roles in The Single Guy, The Jeff Foxworthy Show and episodes of Dawson's Creek.After, he appeared in the sitcom Meego and became a hit all over again when he starred in the popular film Stuart Little in 1999.He played a boy whose family adopts a talking mouse. Stuart was voiced by fellow former child star Michael J.Fox.In 2002, he reprised the role in the film's sequel, also taking roles in 2000's The Little Vampire and Bow Wow in 2002's Like Mike. In 2016, Jonathan revealed to DailyMail.com that it has been hard since Jerry Maguire to get movie directors and producers to view him as anything other than that cute kid from the film.",
        "He said being an actor is a constant hustle and counted himself fortunate to have a mentor in his former co-star Tom Cruise, who he’s still in touch with to this day.Jonathan trains diligently in martial arts and says staying in tip top physical shape keeps him centred and mentally strong in the dog-eat-dog world of Hollywood - plus having a six pack helps book more jobs too.",
        "Recalling life on the film set as a five-year-old, Lipnicki said: 'Every year the memories get less and less, but Tom and Renee were really great to work with. Everyone was really a pleasure to work with, and I got lucky that that was my first role with such a positive environment. What I remember was how warm everyone was to me.'Lipnicki describes Cruise in the highest regard, and calls him his role model. He also admires how Cruise does all his own stunts, something he admits he’d love to do more of himself.He explained: 'I would love to [do more stunts], I just haven’t had the chance to do anything too crazy. I had a fight scene with Danny Trejo in Bad Ass 2 a few years ago which was fun. I’d love to do more of that.'Talking about how Cruise has been there for him to give career advice, he went on: 'If I have a question he’s been very open if I need advice. He’s always said if you have any questions the door’s always open and he’s always been really responsive and helpful.'"
    ]
}