{
    "articleURL": "/wires/reuters/article-12056035/Boxing-Home-hero-Alvarez-seals-unanimous-victory-Ryder-retain-titles.html",
    "content": [
        "May 6 (Reuters) - Undisputed super middleweight champion Saul 'Canelo' Alvarez retained his titles in style with a unanimous victory over Britain's John Ryder in front of a home crowd in Guadalajara, Mexico, on Saturday.",
        "Alvarez was the significantly busier fighter in the early exchanges, leaving Ryder with blood seeping from his nose in the third round before sending the Briton to the canvas in the fifth with a big left-right combination.Ryder grew into the contest as it wore on but was unable to offset the punishment he was dealt in the first half of the bout, with Alvarez receiving scores of 120-107, 118-109 and 118-109 from the three judges to seal the win.\"It's a historic moment for me. I'm blessed to be here with my people who have supported me from the beginning,\" said Alvarez, who was born in Guadalajara and grew up in the neighbouring town of Juanacatlan.\"He's a very strong fighter, man. When they're going for everything (all the championship belts), they turn it on. They become more difficult than usual. But I know that. I'm in this position a long time and I know.\"I respect my opponents because I know they're coming for everything.\"Saturday's fight, which bettered Alvarez's record to 59-2-2, was the 32-year-old's first since undergoing hand surgery after beating rival Gennady Golovkin last year.Asked about his hand, Alvarez said it felt good, adding: \"Not in the beginning. I needed a couple rounds, three rounds, to start punching to know I was good with the hand.\"",
        "Right after his win, Alvarez called for a rematch with Dmitry Bivol, who inflicted the second of only two losses on Alvarez's resume when the pair clashed in a light heavyweight bout last year.\"Everybody knows we want the rematch with Bivol,\" Alvarez said. \"If the fight with Bivol doesn't happen then we'll see. I'm able to fight everybody.\"Alvarez added that any future rematch with Bivol would take place at 175 pounds.(Reporting by Aadi Nair in Bengaluru; Editing by Kim Coghill)"
    ]
}