{
    "articleURL": "/wires/reuters/article-12040211/FOREX-Dollar-defensive-mood-jobs-data-Fed-focus.html",
    "content": [
        "By Ankur Banerjee",
        "SINGAPORE, May 3 (Reuters) - The dollar was subdued on Wednesday, weighed by bearish U.S. labour market data as investors fretted over the U.S. debt ceiling and banking sector risks, while waiting for the Federal Reserve's policy decision later in the day.U.S. job openings fell for a third straight month in March and layoffs increased to the highest in more than two years, data showed on Tuesday, offering some hope that softening in the labour market could aid the Fed's fight against inflation.The dollar index, which measures the U.S. currency against six rivals, eased 0.029% to 101.820 after sliding 0.245% on Tuesday.The U.S. central bank is widely expected to raise interest rates by 25 basis points when it concludes a two-day meeting on Wednesday and investor focus will be on whether the Fed hints at a pause or further tightening.\"The reaction by currencies will come from whether the post-meeting statement and press conference are deemed 'hawkish' or 'dovish',\" said Joseph Capurso, head of international and sustainable economics at Commonwealth Bank of Australia.\"We expect FOMC chair Powell to be hawkish compared to market expectations because inflation is too high and the labour market is too tight, although both indicators have moved in the right direction recently.\"Markets have priced in an 86% chance of a 25 bp hike on Wednesday, CME FedWatch tool showed, but expects the central bank to cut rates towards the end of the year.",
        "The Fed's meeting comes as U.S financial markets are reeling from the weekend failure of San Francisco-based First Republic Bank as well as worries that the government could run out of cash after June 1 without a debt ceiling hike.The yield on 10-year Treasury notes slid 13.3 basis points to 3.440% on Tuesday, while the yield on the 30-year Treasury bond dropped 8.5 basis points. With Japan closed for holiday, Treasuries were untraded early Wednesday.Meanwhile, the euro was up 0.12% at $1.1012 after rising 0.2% overnight ahead of the European Central Bank's regular policy meeting on Thursday.Data on Tuesday showed euro zone inflation accelerated last month but underlying price growth eased unexpectedly, adding to arguments for a smaller interest rate hike from the ECB.According to pricing in derivatives markets, traders think there is roughly an 85% chance of a 25 bp ECB hike on Thursday, and a 15% chance of 50 bps.Ryota Abe, an economist in global markets and treasury department at Sumitomo Mitsui Banking Corporation, said markets have priced in more rate hikes in the euro area than in the United States.\"If the difference in rates between the two regions become clearer, DXY (dollar index) may fall below the 100 mark.\"Elsewhere, the Australian dollar rose 0.06% to $0.667, a day after the Reserve Bank of Australia surprised markets by lifting the cash rate to 3.85% and said further tightening may be required to tame inflation.",
        "The kiwi rose 0.35% versus the greenback to $0.623,while sterling was last trading at $1.2479, up 0.12% on the day.The Japanese yen strengthened 0.11% to 136.40 per dollar, clawing back some of its losses from last week when the Bank of Japan stuck to its ultra-loose monetary policy.(Reporting by Ankur Banerjee in Singapore; Editing by Jacqueline Wong)"
    ]
}