{
    "articleURL": "/wires/reuters/article-12041467/Flutter-Q1-revenues-jump-29-U-S-races-ahead-UK-bounces-back.html",
    "content": [
        "U.S revenue jumps 92%, firmly on track for 2023 profit",
        "Product improvements helps outperform UK market - CEONewly acquired Italian unit performing exceptionally well(Adds details, CEO quotes; paragraphs 4-8,10,12)By Padraic HalpinDUBLIN, May 3 (Reuters) - Flutter grew its revenue by 29% on a pro-forma basis in the first quarter, driven by a near doubling in its fast growing U.S. unit and a sharp recovery in Britain and Ireland, the world's largest online betting company said.Led by its Fanduel brand, Flutter maintained its leading 50% share of the U.S. sports betting market after revenue jumped 92% year-on-year on a constant currency basis.The Paddy Power, Betfair and Sky Bet owner also expanded its revenue by 17% and average monthly players by 11% in Britain and Ireland (UKI), which it said reflected the reshaping of its second-largest division to draw more recreational gamblers.UKI revenue had fallen sharply in the same period last year, partly due to the impact of measures to curb gambling addiction.Chief Executive Peter Jackson put about half the growth down to product improvements and said competitors belatedly adopting safer gambling measures may also have helped Flutter outperform the market, which he estimated was flat year-on-year.\"I said back in March I felt like we had our mojo back and you can see why I was talking about the (UKI) business so positively,\" Jackson told an analyst call.",
        "Last week Flutter said new British government plans to fight problem gambling would cost about 50 to 100 million pounds in lost revenue from 2024, on top of the 150 million already forgone due to existing measures.The latest hit will come from a combination of new stake limits on online slot gaming products, a statutory levy on betting firms and the impact of increased affordability checks, depending on the final proposal details, Flutter said.Revenue also rose 69% on a constant currency basis in its international division, where Flutter said the recently acquired Italian gaming operator Sisal performed exceptionally well. Revenue fell 4% in Australia.Flutter said it is firmly on track this year to become the first U.S. operator to turn a profit following the lifting in 2018 of a nationwide ban on sports betting. The U.S. business made an investment-driven loss of $313 million last year.The Dublin-based firm forecast in November that Fanduel's revenue would jump to around $15 billion over the long term - twice Flutter's entire revenue last year.Flutter's shares, up 37% this year, were 0.8% lower at 15,660 pence by 0915 GMT. (Reporting by Padraic Halpin; Editing by Stephen Coates and Clarence Fernandez)"
    ]
}