{
    "articleURL": "/wires/ap/article-12040637/US-defense-contractors-want-deeper-cooperation-Taiwan.html",
    "content": [
        "TAIPEI, Taiwan (AP) - A delegation of United States defense contractors and a former senior leader of the U.S. Marine Corps pledged the beginning of deeper cooperation with Taiwan on Wednesday.",
        "Taiwan has faced increasing pressure from China in the years since Tsai Ing-wen was elected president. China, which claims the island as its territory, has poached Taiwan´s diplomatic allies and sent military planes and ships toward the island on a near-daily basis. It also held large-scale drills modeling a blockade and simulated strikes on important targets on the island twice within the past year.Speaking at a public forum in Taiwan's capital Taipei, retired Lt. Gen. Steven Rudder said the U.S. wants to be part of the defense capabilities of Taiwan and improve the supply chain resilience of the island. He also emphasized how critical the island's position is for security.\"For the Asia-Pacific, I would offer there´s not another more important area in the world to maintain peace,\" Rudder said Wednesday morning at the Taiwan-U.S. Defense Industry Forum. \"So (when) you hear `a free and open Indo-Pacific,´ this is a small part of ensuring that shared vision remains intact.\"\"We want to be part of the self-defense capabilities of Taiwan,\" he said.U.S. Congress members have called on the Biden administration to follow through on the nearly $19 billion in military sales items they say have been approved but not yet delivered to Taiwan.",
        "Rudder, who was in charge of Marines operations in the Pacific, said the visit was within the U.S.' multiple agreements with China and laws related to Taiwan, such as the Taiwan Relations Act, which requires Washington to ensure Taiwan can defend itself. The legislation was enacted decades ago when the U.S. administration first recognized China and broke off official diplomatic relations with Taipei.",
        "The event was co-hosted by a trade group from the U.S. and another from Taiwan as the public-facing portion of the defense contractors' visit.Although it's unclear whether the groups will sign specific deals, local media reported that the United States was looking at cooperation in production of certain products. Part of that cooperation would be ensuring both sides can work together to use the weapons systems Taiwan bought alongside the island's existing self-produced defense capabilities. Washington is Taipei's largest unofficial partner and the supplier of a vast majority of Taiwan's defense purchases.\"I´ll say it very simply: The endgame is joint interoperability,\" Rudder said.A group of about 20 activists protested outside. \"American warmongers are a scourge on Taiwan,\" read one of the banners.\"They sell all sorts of outdated ammunition to Taiwan and make tens of billions of U.S. dollars from Taiwan every year,\" said David T. Chien, vice-chair of the Blue Sky Action Alliance, which supports unification with China.Between 6 a.m. Tuesday and 6 a.m. Wednesday, 27 Chinese warplanes and a drone flew toward Taiwan, according to Taiwan´s Ministry of National Defense. The drone encircled the island, according to a flight map from the defense ministry, while seven navy vessels sailed the waters close by. It was the second time in the past week that a drone circled the island, in what appears to be a new tactic for China to exert military pressure on Taiwan.",
        "___Find more of AP´s Asia-Pacific coverage at https://apnews.com/hub/asia-pacific"
    ]
}