{
    "articleURL": "/news/article-12060929/Karine-Jean-Pierre-insists-Biden-stop-gun-violence.html",
    "content": [
        "White House Press Secretary said the issue of gun violence is out of President Biden's hands, and repeatedly called on Congress to pass gun reform legislationComes after the latest mass shooting at a mall in Allen, Texas that left eight deadBiden released a statement after the shooting demanding Congress send him an assault weapons banGun violence issues are out of President Joe Biden's hands now, his press secretary claimed on Monday as she said it's now on Congress to act to address the 'epidemic'.",
        "Karine Jean-Pierre repeatedly deflected inquiries related to Biden's call for Congress to send him an assault weapons ban in the wake of the most recent mass shooting, with several reporters raising questions about perceived inaction on the issue.The White House press secretary shot back and listed Biden's 22 executive orders related to gun reform and addressing the rise in mass shootings in America.It comes after nine people, including children and the gunman, were left dead from a mass shooting at a mall in Allen, Texas on Saturday.",
        "The shooting occurred nearly one year after another mass shooting at an elementary school in Uvalde, Texas in May 2022 that left 19 students and two teachers dead.The president sent a statement denouncing Republicans for not playing ball when it comes to negotiations on gun reform, and called on Congress to send an assault weapons ban to his desk for signature.Jean-Pierre suggested that there isn't much more the president can do rather than issue these statements, and said his repeated calls for Congress to act is indicative of that.'The president is asking for Congress to act because we need legislation,' she insisted during her daily briefing on Monday. 'We need federal legislation to deal with this issue.''The president has taken action as president in taking executive action – more than two dozen, because he's taken this very seriously,' she assured. 'More than any other president – historic amount of actions.'",
        "Biden's top spokesperson concluded: 'I think that should tell you how seriously this president takes it. I think that should show you how he has made this a priority. I think this also should show you that he sees this as an epidemic – gun violence that is happening across the country and in our communities and in our schools.'While Democrats have pushed for stricter gun laws, Republicans see most legislation related to firearms as an infringement on Second Amendment Rights.One reporter pushed Jean-Pierre on if Biden is 'fully using the bully pulpit to push for these actions he keeps saying he wants Congress to move forward on.'",
        "'Yes,' Jean-Pierre said matter-of-factly. 'I think two dozen executive actions, speaking on it over-and-over again, he's been very clear about the epidemic that we see in gun violence across the country.''We have used the full weight of the administration to do all that we can, use the tools that we have to deal with this issue. But the fact remains, we need legislation.'The press secretary noted that President Biden, first last Jill Biden, Vice President Kamala Harris and second gentlemen Doug Emhoff are all frustrated that the instances of gun violence is only increasing the more effects are made to crack-down on the issue."
    ]
}