{
    "articleURL": "/sport/football/article-12048797/Ex-Socceroo-Robbie-Slater-explains-Ange-Postecoglou-wont-leave-Celtic-Premier-League-job.html",
    "content": [
        "Ange Postecoglou is tipped to stay at CelticSpeculation he may move to Premier League Robbie Slater confident 'Aussie Ange' will stay putPointed to lure of Champions League next season Former Socceroo Robbie Slater doesn't believe Ange Postecoglou will leave Celtic and chase a 'deserved' managerial role in the Premier League.",
        "With the Hoops on the verge of a treble of domestic trophies in Scotland, Slater pointed to unfinished business 'Aussie Ange' has in the UEFA Champions League.It comes as Postecoglou has been linked to roles at Tottenham and Chelsea.'I think the interest is deserved. I think he's grown a great reputation ... it's not just his success, it's the way it's happening. It's the style of football,' Slater said on the Fox Football Podcast.'It's certainly rarely been seen [in Scotland], this style of football that Ange has brought. ",
        "'And he's done it with every club he's been to, to be fair to him. He is the king at Celtic.'Aside from the rumoured interest from Spurs and the Blues, the likes of Brighton, Wolves, Everton, Leeds United and Leicester City are also said to be impressed with Postecoglou's eye for talent.Celtic finished bottom of their group in the Champions League this year - but with experience gained against the likes of Real Madrid, better results may follow next season.Slater also can't see Celtic losing the Scottish Cup final against second-tier Inverness Caledonian Thistle on June 4, feeling a defeat would be the 'biggest boilover in world football history'.Another league title appears to be a formality at Celtic Park, with the Hoops losing just once in 33 outings on the domestic front.",
        "They are currently 13 points clear of bitter rivals Rangers. Postecoglou, 57, began his managerial career with South Melbourne in the National Soccer League before going onto coach Brisbane Roar and Melbourne Victory in the A-League.He then spent three years in Japan with Yokohama F. Marinos before he was appointed boss of Celtic in 2021.Postecoglou also coached the Socceroos from 2013-2017, with the highlight winning the Asian Cup in 2015 on home soil."
    ]
}