{
    "articleURL": "/news/article-12049345/Delta-airlines-plane-gets-stuck-tarmac-hours-swarm-bees.html",
    "content": [
        "A Delta flight bound for Atlanta was grounded in Houston for hours after a swarm of bees took up residence on one of the aircraft's wingsMultiple attempts were made to move the bees along, including bringing in a bee keeper and pest control, both of which failed Eventually, the flight got going when the captain turned the engines on and the bees flew away  Passengers on board a Delta Air Lines flight bound for Atlanta were stuck on the tarmac for four hours at Houston Bush Intercontinental Airport after a swarm of bees latched themselves to the airplane's wing, causing the captain to delay takeoff. ",
        "According to the airline, the Airbus A320 was due to leave at 12:25 pm Wednesday but didn't actually leave until 4:30 pm as ground staff tried to figure out a way to move the insects along. Journalist Anjali Enjeti posted a photo of the epic swarm on Twitter. 'My flight leaving Houston is delayed because bees have congregated on the tip of one of the wings. They won’t let us board until they remove the bees. But how on earth will this happen? Won’t they leave the wing when we take off,' she wrote. Delta brought in pest control and later a bee keeper to deal with the swarm, Enjeti said on Twitter. The reporter said that the pest control was not permitted to spray a plane and the bee keeper wasn't allowed to touch aircraft. ",
        "Enjeti added that for some reason, the fire department couldn't come to deal with issue. 'Wish you could hear people on the phone here trying to explain why our flight is delayed,' she tweeted. Photos posted by Enjeti showed ground crews talking about ways in which the bees could be removed.  The saga ended when the captain simply turned the engines on. 'Entire flight crew deplaned. Delta decided to give our gate to another flight. As soon as our plane’s engine turned on, THE BEES LEFT!!! All Delta had to do was TURN ON THE PLANE,' Enjeti wrote. ",
        "From there, the flight went off without a hitch and all 92 passengers arrived in Atlanta around 7:30pm local time, according to Flight Radar. Delta leaned into the hilarity of the incident in its statement. 'Bee-lieve it or not, Delta flight 1682 from Houston-Bush to Atlanta took a delay this afternoon after a friendly group of bees evidently wanted to talk shop with the winglet of our airplanes, no doubt to share the latest about flying conditions at the airport.' ",
        "'We are told this kind of swarming is rare but not unheard of occurrence and can occur on virtually any outdoor structure in climates/environments where bees are found in nature,' an airline spokesperson told KHOU. It's not clear if the bees could have jammed the mechanisms on the aircraft's wings.  Bee keeper Mike Sexton, who goes by the moniker, The Bee Man, told KHOU that he has 'taken bee swarms off of tugboats, airplanes, concrete walls' in the past. Sexton said that the bees are becoming more active as the weather warms up. 'They usually start in the South and they move towards the North.'He said that it's likely that the bees were resting when they landed on the Delta wing. 'Whenever bee swarms start, they’re going to gorge themselves with a bunch of honey and the old queen is going to take off with a bunch of workers so they’re not going to eat again until they actually get to a new home, so in the meantime they rest and conserve their energy, so they land on anything,' he added. ",
        "Coincidentally, in nearby Sugar Land Regional Airport, located on the outskirts of Houston, beehives are maintained by the staff there on undeveloped parts of the airport, reports KHOU.  A spokesperson for Houston's airport said that the they are looking into taking part in a program initiated by the Federal Aviation Administration to avoid incidents such as the one that took place on Wednesday.  "
    ]
}