{
    "articleURL": "/news/article-12047607/Armed-stalker-cut-hole-patio-screen-watch-WWE-wrestler-Sonya-Deville-jailed-15-years.html",
    "content": [
        "Philip Thomas, 27, traveled from South Carolina to Florida to break into the property He sent threatening messages to the star for several years, which got more aggressive the more she ignored themDeville said that it was 'amazing to finally get closure' three years after the terrifying incident  An obsessed fan accused of stalking and plotting to kidnap a WWE wrestler has taken a plea deal that will see him put behind bars for 15 years.",
        "Philip Thomas, 27, cut a hole in Sonya Deville's patio screen before sending her a chilling message moments before breaking into her home.Deville, real name Daria Berenato, received dozens of threatening messages from Thomas before the incident at 3am on August 2020.Prosecutors say Thomas was 'obsessed' with the wrestler and threatened to kill her girlfriend at the time in a stream of Instagram messages – which got increasingly more agitated with Deville didn't respond.Surveillance footage catches the moment Deville spots Thomas, who traveled from South Carolina to Tampa, checking the sliding door.",
        "She then turned and ran, with Thomas walking through her home with a 'blank look' on his face as he followed her. When officers arrived he was still inside the property.The wrestler described him as being dressed in black and having a black mask on, and 'stared at her' until she started screaming.Deville said she ignored most of the messages Thomas sent until he broke into her home, checking outside the property after her alarm system was triggered.She told a judge at his bail hearing: 'He had black clothing on, and a black mask and he was just standing there staring at me. I looked up I saw him.'I was terrified! I started screaming I don't even know what I said what the 'f' are you doing here? What do you want?'",
        "Thomas sent her messages saying: 'I'm going to summer slam with you as your boyfriend' and 'Im going to force you to do what I want, You're gonna give me what I want.'Another said: 'When I get my hands on you I'll make sure you understand what pain you have put me through.'The final message she received before Thomas broke into her home said: 'Hey baby look outside, I'm by your pool and I'm going to kill that little b***h that's inside with you.'",
        "Thomas even threatened Berenato's then-girlfriend, telling her she did not 'deserve' the wrestler, according to documents in the case.When he was arrested, Thomas was carrying a knife, plastic zip ties, duct tape, mace, and other personal items.He was charged with aggravated stalking, armed burglary of a dwelling, attempted armed kidnapping, and criminal mischief.Thomas pleaded guilty to the charges and was handed a 15-year prison sentence, and will remain on probation for 15 years once he is released.He also has to do 50 hours of community service after release from prison – but has received 975 days credit for time served, so he is set for release in 2035, records show.",
        "In a statement released after his sentence, Deville said: 'Thank you to everyone who has reached out today. ",
        "'After almost three years we finally got some closure last week. I am happy and healthy and have amazing people by my side.'To say it's over feels odd but I am beyond grateful for the support and help I received over the past three years from HCSO, Tampa PD, to everyone in the courts, attorneys, friends, security and so so many more.'I have a lot to say pertaining to this situation which I feel can help a lot of people in similar situations now that the legalities are over. BUT for now thank you.'"
    ]
}