{
    "articleURL": "/sport/football/article-12054847/Jamie-Carragher-claims-Trent-Alexander-Arnold-save-Liverpool-100MILLION.html",
    "content": [
        "Trent Alexander-Arnold has impressed in his new role as an inverted full-back  Carragher believes the England international can be a permanent midfielder REPORT: Liverpool 1-0 Brentford - Mohamed Salah bags first half winnerJamie Carragher has claimed Trent Alexander-Arnold can 'save Liverpool £100million' if he plays in midfield permanently. ",
        "Alexander-Arnold has enjoyed a resurgence since moving into a new role as an inverted full-back, with six assists in his last seven appearances. Reports claim Klopp is on the hunt for new midfielders ahead of the summer transfer window, with Brighton's Alexis Mac Allister emerging as a top target, yet Carragher believes he may already have one at his disposal.Speaking during the commentary of the Reds' clash with Brentford on Sky, the former defender said: 'If Trent plays midfield, he probably saves Liverpool £100m.'One thing we haven't seen a lot from Trent Alexander Arnold during his career is goals from outside the box. But, if he keeps playing in midfield he will get 5-10 goals a season. We've seen it from set pieces.'",
        "Alexander-Arnold almost got yet another assist against the Bees in the first half after delivering a superb cross into the box, but Darwin Nunez was unable to make full use of it. The England international has drawn criticism in recent years for a number of defensive mishaps, which have cost Liverpool dearly on several occasions.There is no disputing the 24-year-old's quality going forward, however, given he has already produced 53 assists in just 194 league outings for the Reds.Alexander-Arnold has displayed his quality going forward since moving into the inverted role against Arsenal last month. ",
        "He has the most assists, chances created, passes in the opposition's half, penalty area entries, possession won and touches in the Premier League since the 2-2 draw with the Gunners. Alexander-Arnold recently revealed the mood at Liverpool remains low despite their recent upturn in form boosting hopes of European football next season.The 1-0 win over Brentford has put Jurgen Klopp's side a point behind fourth-placed Manchester United having played two games more.  "
    ]
}