{
    "articleURL": "/wires/reuters/article-12055921/Austin-FC-tally-stoppage-time-earn-tie-vs-Timbers.html",
    "content": [
        "Substitute Will Bruin headed home Owen Wolff's out-swinging cross in the second minute of second-half stoppage time to lift Austin FC to a 2-2 draw at the Portland Timbers on Saturday night.",
        "Bruin's goal marked the second time Austin leveled the match after going behind. Jon Gallagher previously knotted the match at 1-1 earlier in the second half with his team-leading fourth goal of the season.Austin (2-4-4, 10 points) still saw its winless run stretch to seven games, but it also snapped a three-match losing streak. And it did so on a night news surfaced that last year's leading scorer Sebastian Driussi will miss roughly a month with a groin injury.After enduring a 395-minute stretch without scoring, the Verde now have four goals in their last two games.Claudio Bravo and Dario Zuparic both scored the first goals of their MLS careers for Portland (3-5-3, 12 points), which was seeking its first consecutive victories of the season.Bravo gave the Timbers a 2-1 lead with an excellent low strike from 25 yards in the 71st minute. Zuparic opened the scoring 12 minutes before halftime.Evander picked up his first two MLS assists in his eighth appearance since signing this offseason from FC Midtjylland in Denmark's top flight.But the Timbers conceded two or more goals for the fourth time this season and the second time at home.Bruin's equalizer came only eight minutes after he entered the game for struggling Austin starter Gyasi Zardes.",
        "It was a textbook center forward's finish, as he managed to create space between himself and defender Larrys Mabiala, then expertly faded his run into the path of Wolff's out-swinging cross from the right flank.It was one of only a couple of promising attacking sequences for Austin all evening.Gallagher scored on another. Julio Cascante, Rodney Redes and Wolff all connected before Emiliano Rigoni curled an out-swinging cross from the left.Zardes failed to meet it in stride, but Gallagher was lurking at the back post and headed it across the line from close range for a simple finish.--Field Level Media"
    ]
}