{
    "articleURL": "/wires/reuters/article-12050027/IMF-Pakistan-bailout-review-conclude-financing-place.html",
    "content": [
        "IMF to support Pakistan in FY2024 budget making",
        "China, Saudi Arabia, UAE have pledged financingNot clear whether IMF wants more on top of itInflation fuelled by IMF measures on record high(Adds financing needs, analyst comment on budget talks; paragraphs 8-13)By Gibran Naiyyar Peshimam and Asif ShahzadISLAMABAD, May 5 (Reuters) - The International Monetary Fund (IMF) is working with Pakistan to conclude a ninth review of a bailout programme, its mission chief said on Friday of the funding critical for the cash-strapped nation to avert an economic collapse.Pakistan and the IMF have been discussing fiscal policy measures in the review since February, aiming to resume stalled funding of $1.1 billion due in November from a $6.5-billion programme agreed in 2019.The measures have fuelled highest ever inflation, posted at 36.4% in April.The IMF funding is crucial for Pakistan to avert default on its external payment obligations during a balance of payment crisis, in which foreign exchange reserves have shrunk to just four weeks of controlled imports.\"The IMF continues to work with the Pakistani authorities to bring the ninth review to conclusion once the necessary financing is in place and the agreement is finalised,\" mission chief Nathan Porter said in a statement to Reuters.\"The IMF supports the authorities in the implementation of policies in the period ahead.\"",
        "This included technical work to prepare the budget for fiscal year 2024, set to be passed by the National Assembly before end-June, he added.As part of the conditions, Pakistan has given an assurance that its balance of payments gap this fiscal year, which ends in June, is fully funded.Pakistan has announced pledges worth $3 billion in financing support from Saudi Arabia and UAE, but the funds have yet to come through. Longtime ally China has rolled over and refinanced its loans.Islamabad and the IMF have had differences over the gap. It was not clear if the Saudi, UAE and Chinese financing would be sufficient, or if more external support would be needed.It was also not immediately clear why the lender wanted to work on the technical preparation of the budget, which is not covered by the programme.The step could be linked to a possible new IMF lending plan, said Yousuf Nazar, an economist and former head of equities and investments at Citigroup.\"I think it is unavoidable that they would like to ensure the government will meet its commitments particularly, when it is in no position to repay the debt, which will inevitably need a new programme,\" he told Reuters.Pakistan's finance ministry and the IMF did not immediately respond to a request for a comment.",
        "The current IMF programme aims to disburse an additional $1.4 billion for Pakistan before it concludes in June. (Reporting by Gibran Peshimam and Asif Shahzad; Editing by Sonali Paul and Clarence Fernandez)"
    ]
}