{
    "articleURL": "/wires/aap/article-12044211/Greigs-eight-week-audition-new-Eels-contract.html",
    "content": [
        "Front-rower Wiremu Greig is determined to use his stint filling in for the injured Reagan Campbell-Gillard to prove he deserves to remain at Parramatta long-term.",
        "In round eight, a hip-drop-style tackle from Brisbane's Payne Haas left Campbell-Gillard preparing for a two-month spell on the sidelines with a groin injury and opened up an opportunity for Greig to become a regular starter.The 23-year-old played only one game on the run to the grand final last year but has become a mainstay of Brad Arthur's bench this season now that middle forwards Oregon Kaufusi, Ray Stone and Nathan Brown have left the club.Greig passed the first test of his new mission; Campbell-Gillard worded him up about starting with intensity against Newcastle last week and the big Kiwi did just that, finishing with 134 run metres - 58 of them post-contact.\"(Campbell-Gillard) is just tipping me up on where I can be better,\" Greig said.\"He's been doing that, which has been helping me, where I can use my energy better and what to do out there.\"We're unstoppable when we start powering through that middle as a team and start pushing for each other.\"Greig has the chance to start at least seven more games while Campbell-Gillard is out, beginning with a mouth-watering clash against Tino Fa'asuamaleaui and the Gold Coast forward pack on Sunday.With his contract expiring at the end of the season, the young Eel knows the next two months could determine whether he remains at the club long-term.",
        "He and second-rower Bryce Cartwright are the only two regular members of the Eels' 17 who are without deals beyond this campaign.\"Definitely (it's a good chance),\" Greig said.\"I'm just improving from week-to-week, getting better and showing Brad. He's already trusting in me more than he has been, which is good, building Brad's trust week-to-week.\"I'd be happy just to stay here if it comes up.\"Greig's workload has impressed State of Origin prop Junior Paulo, whom he is partnering in the front row at club level.\"He's certainly been doing a good job every time he gets an opportunity,\" Paulo said.\"Over the next couple of weeks that Reg is going to be out, it's certainly going to be good practice for him and he's certainly looking forward to the challenge.\""
    ]
}