{
    "articleURL": "/femail/article-12051689/Queen-Letizia-Spain-attends-Buckingham-Palace-reception-King-Felipe-VI.html",
    "content": [
        "Queen Letizia of Spain cut an elegant figure in £850 Victoria Beckham dressREAD MORE: For all the latest Royal news, pictures and video click hereShe's known for her fashion prowess - and Queen Letizia of Spain didn't disappoint today as she stepped out at Buckingham Palace for a reception hosted by King Charles.",
        "The Spanish royal, 50, joined her husband King Felipe VI, 55, at the lavish occasion ahead of attending the British monarch's coronation in London tomorrow.Dressed to impress, Letizia, who was also joined at the reception by other foreign royals, including Princess Charlene of Monaco, oozed elegance in a green Victoria Beckham midi dress, costing £850, teamed with navy heels and a black clutch.The frock featured a gathered front, tulip sleeve detail and a slight V-neck at the back, according to the British designer's website. 'Softy shaped around the waist to fit and flatter, and with a gently flared skirt, it exudes a modern refinement,' the description added.  ",
        "Adding a touch of glitz to her ensemble, Letizia completed her look with a dazzling diamond brooch and an emerald and silver bracelet.The mother-of-two kept her locks down and added a smattering of glamorous makeup to her features. Her husband looked equally sophisticated for this evening's event in a suit with a red patterned tie.It's been a busy week for the Spanish royals - with King Felipe and Queen Letizia hosting Colombian President Gustavo Petro and his wife Verónica Alcocer in Madrid.Following a state dinner last night, the Colombian couple are returning home to today while the Spanish royals jetted out to London. Felipe is a distant cousin of Charles: his mother, Queen Sofia, was a third cousin of the Queen and a first cousin once removed of the Duke of Edinburgh. ",
        "Following the death of Queen Elizabeth, who Felipe celled Aunt Lilibet, the Spanish royal wrote a touching letter to Charles.He wrote: 'Your Majesty, dearest Charles. Deeply saddened by the sorrowful news of the passing of Her Majesty Queen Elizabeth II, your beloved mother.",
        "'I would like to offer Your Majesty and the British people, on my behalf and on the behalf of the Spanish government and people, our most heartfelt condolences.'Earlier today, the King and the Prince and Princess of Wales thrilled royal fans at The Mall as they made a surprise appearance to greet well-wishers less than 24 hours before the coronation.The road leading to Buckingham Palace was cleared and royal fans eagerly lined the route, having likely figured out that they may well catch a glimpse of the new King due to the security and media presence.People cheered and could be heard shouting 'God Save the King' as the senior figures of the monarchy arrived to shake hands with well-wishers. Royal superfans were left blown away by the visit, which came just hours after a downpour soaked thousands of people camped out at The Mall, with one person telling Sky News: 'This is the happiest moment in my life.'",
        "The King went to one side of The Mall while William and Kate went to another to greet well-wishers. One woman told Charles 'Love you Charlie' while others passed on their congratulations to him.",
        "Kate and William posed for selfies with fans, while Kate even appeared to join one person in a video call before also speaking on another fan's phone before handing it back. ",
        "This morning the King took part in a final coronation rehearsal at Westminster Abbey, where a 2,300-strong congregation, and a television audience likely to be in the tens of millions, will watch him being crowned on Saturday. As excitement ramps for Britain's first coronation in 70 years, Charles and Kate joined a lunch for VIPs at Buckingham Palace.His Majesty was joined by working royals at a special event for prime ministers and governors general at the Palace from midday, just after the heavens opened on London.The Prince and Princess of Wales, the Duke and Duchess of Edinburgh, the Princess Royal and Vice Admiral Sir Tim Laurence were at the event. Completing the royal contingent were the Duke and Duchess of Gloucester and the Duke of Kent. But there was no invite for Prince Andrew, who was seen driving around Windsor this lunchtime. There were 42 attendees in total, including UK Prime Minister Rishi Sunak, Australia's republican Prime Minister Anthony Albanese, and Prime Minister of New Zealand Chris Hipkins. Charles, Queen Consort Camilla and Prince William had been at Westminster Abbey this morning for final rehearsals ahead of the Coronation tomorrow, around the time Prince Harry may have landed in the UK. ",
        "His Majesty and his wife waved to crowds as he was driven down The Mall to the church for further preparations, before a run of diplomatic duties including hosting a Buckingham Palace lunch for VIPs. ",
        "But the monarch looked shocked by the heavy rain as he passed thousands of people who are camped out along the route from the Abbey to the Palace including the packed Mall, dubbed Chaztonbury due to the huge numbers camped out there.Meanwhile Prince Harry may have already landed in the UK for his 24-hour visit for the Coronation - leaving his wife and two children at home.The Duke of Sussex is intending to fly back to California straight after the historic ceremony ends tomorrow afternoon so he can make it back to see Archie on his fourth birthday.This morning a private jet from Van Nuys airport in California landed at Farnborough, the airport closest to Windsor Castle. Van Nuys is just an hour from Harry and Meghan's Montecito mansion, but it is not yet known if he was on board.Some 100 heads of state are descending on London for the coronation on Saturday, with representatives from 203 countries due to attend. "
    ]
}