{
    "articleURL": "/femail/article-12046819/Untold-story-dangerous-man-Britain-Mark-Ripley-faced-20-men-one-day.html",
    "content": [
        "Mark Ripley, from Kent, passed away at the age of 34 in 1982Read More:  Man who was given 25% chance of survival after being hit by a van on the way from school celebrates 10 years since horror accidentA boxer who was dubbed the 'most dangerous man in Britain' is said to have faced off with 20 men in one afternoon is also said to have given Bartley Gorman the 'hardest fight' of his career.",
        "Mark 'The Ripper' Ripley, from Kent, became one of the 'most respected and feared fighters' in the UK before his death at the age of 34 in 1982.In his 2002 biography King of the Gypsies, the undefeated bareknuckle champion Bartley Gorman described how Mark would easily 'fight against 100 men' and 'never back down'.Describing his first interaction with 'The Ripper', the Irish traveller said he was also part of the 'new generation' of fighters in the late 1960s.Bartley explained: 'I fought Mark Ripley down in Kent in the late Sixties. He was a few years younger than me but utterly fearless and by the Seventies, he was known as a man to avoid.'",
        "The pair fought one another in a car park in Kent for the first time. Although Bartley was victorious, he later described Mark as 'the hardest man he ever faced'.He added: 'I do know that in a street fight, Ripley would have eaten most men alive.' In his 2011 memoir On The Cobbles, gypsy boxer Jimmy Stockin explained how Mark was feared in his community.He explained: 'He was respected and feared in equal measure by gypsies and gorgers alike.' What's more, Mark's niece Rosie Smith described Mark as a 'gypsy man known to be very, very wary of.'",
        "She added: 'He would never back down.'Before his untimely death, Mark reportedly faced off with 20 men in his local area after his beloved dog went missing.In his latest YouTube video, UK boxer Matt Legg shared Mark's story with his 24,900 subscribers. ",
        "Detailing the alleged incident, Matt explained: '[Mark] said, \"if I don't get my dog back by the time I get back from the shop with my wife, then there's going to be trouble.\"'Apparently he went off to the shop and, by the time he got back, the dog was back.' However, Mark's boxing career was cut short when he was reportedly killed in a domestic dispute.Heavyweight champion Tyson Fury is a distant relation of Mark's peer Bartley Gorman.Tyson's traveller heritage is something of which he is proud (his Twitter name is Gipsy King). 'I'm proud of what I am,' Fury said in 2015. 'I'll tell you what makes a traveller: you're born one, like you're born black. To me it is irrelevant whether I live in a house, a caravan or a tent.' "
    ]
}