{
    "articleURL": "/wires/ap/article-12052207/MATCHDAY-Man-City-hosts-Leeds-Copa-del-Rey-final.html",
    "content": [
        "A look at what´s happening in European soccer on Saturday:",
        "ENGLANDManchester City can improve its lead over second-placed Arsenal when it hosts relegation-threatened Leeds in one of five Premier League games. It's a tough first opponent for new Leeds manager Sam Allardyce, who is up for the challenge after saying midweek there's \"nobody ahead of me in football terms,\" including City manager Pep Guardiola. City has a one-point lead over Arsenal with one game in hand. Liverpool has won five in a row and will try to keep its Champions League hopes alive when it hosts Brentford. Chelsea takes a six-game losing streak to Bournemouth. Crystal Palace is at Tottenham. Wolverhampton hosts Aston Villa.SPAINReal Madrid plays Osasuna in the Copa del Rey final at Seville´s La Cartuja Stadium. Madrid has struggled recently in the league. Osasuna is seeking the first major trophy for the club based in Pamplona. Madrid's 19th and last Copa triumph was in 2014.ITALYAC Milan and Inter Milan face big tests ahead of their Champions League semifinal. Milan hosts second-placed Lazio at the San Siro and Inter visits Roma. The results are key in terms of deciding which teams qualify for next season´s Champions League. Then the first leg of the Milan derby is scheduled for Wednesday. Inter is fourth in Serie A and holds the last Champions League spot. Milan and Roma are two points further back. Also, Cremonese hosts Spezia in a matchup of clubs trying to avoid relegation.",
        "GERMANYBayern Munich can stretch its Bundesliga lead to four points with a win over Werder Bremen before title rival Borussia Dortmund plays on Sunday. History is in Bayern's favor though injuries in defense and a suspension for midfielder Leon Goretzka limit coach Thomas Tuchel's options. The champion has not lost to Werder since 2008 and won the first meeting this season 6-1 in November. Bremen is 12th and likely safe from relegation. Elsewhere, third-placed Union Berlin's bid to qualify for the Champions League for the first time continues at Augsburg, and fourth-placed Freiburg hosts Leipzig, a key rival for a Champions League spot. Hertha Berlin is adrift in last place and desperately needs a win against Stuttgart. Borussia Moenchengladbach plays Bochum and Hoffenheim hosts Eintracht Frankfurt.FRANCESecond-placed Marseille travels to Lens just one point above its northern rival in the fight for the second automatic Champions League spot. Marseille has the best record on the road in Ligue 1 and will be trying to extend its unbeaten run away from home to 12 matches. Igor Tudor's players take on the side with the best home record. Lens has lost just once and won 14 league games at Stade Bollaert-Delelis. Lens will be without suspended midfielder Salis Abdul Samed and injured forward Wesley Saïd. Reims hosts Lille and Rennes travels to Nice in the other games.",
        "___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}