{
    "articleURL": "/wires/aap/article-12049305/Budget-funding-boost-projects-tackling-disadvantage.html",
    "content": [
        "Tackling entrenched disadvantage will be a key feature of the upcoming federal budget with funds promised for local leaders and community organisations.",
        "A package of almost $200 million will be allocated to help improve services and establish partnerships with philanthropists to grow programs to help break the cycle of disadvantage.The funding will establish a new strategy to partner with philanthropists to allow the government to coordinate efforts, improve data collection and distribution to help guide local decision making and embed place-based initiatives.Intergenerational disadvantage and child and family wellbeing will be the primary focus of the package, including action in the early years.A new $100 million outcomes fund will establish a partnership between the Commonwealth and states, territories and social enterprises to deliver projects designed to tackle entrenched disadvantage.Social Services Minister Amanda Rishworth said disadvantage was a complex problem that couldn't be solved by a single policy, government department, organisation or entity.\"Regularly I hear through consultations ... how important coordinated services that communities want are in making a difference,\" she said.She insisted the package would not add another layer of bureaucracy to establishing important programs and would rather focus on delivering outcomes.\"This is actually an exciting opportunity where ... a one-size-fits-all approach doesn't occur (and) we're actually working with communities on the ground,\" she told ABC News.\"(It's) a new way of working with communities to ensure they are involved in the local decision-making ... and to provide them with the architecture and the empowerment to decide the programs that will deliver the outcomes they need.\"",
        "Treasurer Jim Chalmers said the package was about supporting local leaders and investing in organisations to make it easier for them to improve outcomes for their communities.\"In order to build the kind of economy that we want, we have got to align what we want to see in our economy with what we want to see in our society and in our communities,\" he said on Friday.\"All of my adult life, one of the things that hasn't made a lot of sense is how a country like ours, which generates the most remarkable opportunities for people in the broad, needs to do a much better job of putting those opportunities within reach of more people.\""
    ]
}