{
    "articleURL": "/wires/reuters/article-12043017/US-STOCKS-Wall-Street-subdued-caution-ahead-Fed-meeting-outcome.html",
    "content": [
        "Federal Reserve decision at 2 p.m. ET",
        "Eli Lilly up as its Alzheimer's drug succeeds in studyAMD slumps after weak forecastIndexes: Dow down 0.11%, S&amp;amp;P flat, Nasdaq up 0.18%(Updates prices throughout; adds analyst comments in paragraphs 5 and 6)By Ankika Biswas and Sruthi ShankarMay 3 (Reuters) - Wall Street's main indexes were muted on Wednesday as investors steered clear of big bets ahead of the Federal Reserve's policy decision later in the day, while regional banks took a breather after a steep selloff in the previous session.Major U.S. stock indexes dropped more than 1% on Tuesday as regional bank shares tumbled on renewed fears over the financial system and as investors tried to gauge how much longer the Fed may need to hike interest rates.Regional lender PacWest Bancorp, one of the worst hit stocks in the previous session, gained 4.1% on Wednesday, while the KBW Regional Banking index advanced 1.4%.While the Fed is widely expected to deliver a 25-basis point interest rate hike, investor focus will be on cues if further hikes are on the cards given inflation remains above the U.S. central bank's 2% target level.\"The Fed is still stuck between a rock and a hard place,\" said Joshua Chastant, senior investment analyst at GuideStone Financial Resources.",
        "\"Inflation is still elevated and unemployment is very low, so they're trying to walk the tightrope of not sending a signal that they're completely done hiking rates, but also not necessarily wanting to send the economy in a downcycle.\"Major global central banks have embarked on an aggressive interest rate hike campaign to tackle sticky inflation, with the Fed already having hiked its benchmark rates nine times by 475 basis points to a range of 4.75%-5.00% since March 2022.Data on Wednesday showed U.S. private employers boosted hiring in April, but there are signs that the labor market is slowing amid higher interest rates.A separate report showed U.S. services sector maintained a steady pace of growth in April, but higher input prices indicated inflation could remain elevated for some time.At 11:35 a.m. ET, the Dow Jones Industrial Average was down 35.48 points, or 0.11%, at 33,649.05, the S&amp;amp;P 500 was up 0.58 point, or 0.01%, at 4,120.16, and the Nasdaq Composite was up 22.13 points, or 0.18%, at 12,102.64.Energy stocks were the worst hit, falling 1.6%, as oil prices extended losses.The S&amp;amp;P 500 hit a three-month high earlier this week, boosted by upbeat results from megacap companies such as Amazon.com Inc and Microsoft Corp.Analysts expect earnings for S&amp;amp;P 500 companies to decline 1.1% in the first quarter from a year earlier, according to Refinitiv data, a sharp improvement from the 5.1% drop expected at the start of April.",
        "Eli Lilly and Co gained 4.9% to hit a record high as the company's experimental Alzheimer's drug slowed cognitive decline by 35% in a closely watched late-stage trial.Advanced Micro Devices slumped 8.3% after the chipmaker forecast quarterly sales below estimates due to a weak PC market, pushing rival Intel Corp up 2.2%.Estee Lauder Cos Inc slid 16.9% as the MAC lipstick maker forecast a bigger drop in full-year sales and profit.Advancing issues outnumbered decliners for a 1.40-to-1 ratio on the NYSE and a 1.70-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded 22 new 52-week highs and six new lows, while the Nasdaq recorded 48 new highs and 138 new lows.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru, Additional reporting by Amruta Khandekar; Editing by Shounak Dasgupta)"
    ]
}