{
    "articleURL": "/wires/ap/article-12046515/Explosion-rips-roof-pharmaceutical-plant-worker-missing.html",
    "content": [
        "NEWBURYPORT, Mass. (AP) - A worker was killed Thursday after a powerful explosion tore through a pharmaceutical chemical plant in Massachusetts, ripping the roof off the building and prompting a U.S. senator to demand accountability from the plant's owners.",
        "Acting Newburyport Fire Chief Stephen Bradbury did not publicly identify the person who died, but said crews recovered the body from the building. Initially, the search was hampered by concern about the plant's structural integrity following the blast that sent flames leaping high above the building and scattering industrial debris nearby.Bradbury described the blast as a \"seven-alarm hazardous materials\" event.Four other workers were sent to the hospital as a precaution, but were uninjured and released.The explosion prompted U.S. Sen. Edward Markey to demand greater accountability from the troubled facility.Authorities said there was no threat to the local population or to homes near the Newburyport building, but fire officials told employees who work in the industrial park where the facility lies to stay away. One woman who didn´t get the message said she could taste chemicals on her lips.",
        "The explosion happened around 1 a.m. at the Sequens/PCI Synthesis plant, officials said. Video showed most of the roof torn off a building, and the blast blew a vat from the building 30 feet (9 meters) into a parking lot, acting Fire Chief Stephen Bradbur said in a news release.Markey said the company needs to provide answers, given the facility's history of accidents and violations.\"Today´s chemical explosion in Newburyport is devastating,\" the Massachusetts Democrat said in a tweet. \"This disaster is the facility´s third accident since 2020. We can´t keep excusing companies´ flagrant disregard for worker safety. I´ll be calling on PCI Synthesis and federal regulators to explain what happened.\"",
        "It wasn´t immediately known what caused the explosion, or what - if any - chemicals were involved. It was also unclear what role, if any, the vat played in the explosion.Smoke from the fire blew over the industrial park and into a largely unpopulated area, according to officials from the state Department of Environmental Protection. They added that there was some runoff from firefighting foam, but officials worked to block additional runoff.Initial monitoring found no evidence of significant impacts to the air, according to DEP officials who said agency staff are collecting air samples for analysis.Nancy Gero, 58, who works next door to the plant, said she saw emergency vehicles packing the parking lot with foam and debris everywhere when she pulled in Thursday.\"I could smell chemicals in the air,\" she said. \"I could taste it on my lips.\"\"All our attention is focused on the situation of our employees,\" PCI Synthesis said in a statement.Dangerous conditions in the building prevented firefighters from searching for the missing worker at first, Bradbury said at an earlier news conference. Fire crews met with a demolition company, the city's structural engineer and a building inspector.Chemists from the company and a technical rescue crew have responded. A spokesperson for the federal Occupational Safety and Health Administration said that agency was also involved.",
        "The plant lies a little more than 30 miles (50 kilometers) north of Boston in an industrial park with other businesses. Residential neighborhoods, schools and churches are near the commercial area.A chemical fire in the building in June 2021 sent smoke pouring out of roof vents and prompted a hazardous materials team to respond, according to a fire department statement at the time. Sprinklers controlled the fire within about 20 minutes, but the city suspended the factory´s permits during the investigation.In 2020, authorities said a chemical reaction caused a series of explosions at the plant. That happened a year after OSHA found \"serious\" violations in how the company managed highly hazardous chemicals, according to online agency records. There were no serious injuries cited in those events.The factory has also been cited by OSHA for workplace safety violations and in 2019 paid a more than $50,000 penalty to settle Environmental Protection Agency charges that it violated of hazardous waste laws.Also in 2019, the EPA signed an agreement with the company, then known as Polycarbon Industries, aimed at making the facility safer. The settlement included a $50,210 fine and $152,000 dedicated to \"protect human health and the environment.\"The company agreed to install a monitoring system for hazardous waste and other gas emissions inside its facility.",
        "The EPA said at the time that the plant generated hazardous waste including toluene, methylene chloride, acetone and methanol. The company was cited for failing to comply with regulations to prevent releasing hazardous chemicals from four waste tanks and failing to meet hazardous waste air emission standards.Gero has worked near the plant for a little more than a year, but was unaware of its past problems until Thursday.\"A lot of people work there,\" she said. \"If that had happened during the day, it would have been a disaster.\""
    ]
}