{
    "articleURL": "/news/article-12041815/Fury-Navys-digital-ambassador-non-binary-drag-queen-Harpy-Daniels.html",
    "content": [
        "Joshua Kelley, aka Harpy Daniels, is one of five digital ambassadors for the NavyDaniels was appointed to help plug the Navy's worsening recruitment crisis READ MORE: 'I can't believe I fought for this bulls**t' says Navy SEAL who helped kill Osama Bin LadenThe Navy's appointment of a non-binary drag queen as its first 'digital ambassador' has sparked fury, disbelief and mockery of the Department of Defense. ",
        "Yeoman 2nd Class Joshua Kelley, whose stage name is Harpy Daniels, announced on TikTok in November that she would be the Navy's first 'digital ambassador,' highlighting her journey from performing on board beginning in 2018 and growing to become an 'advocate' for those who 'were oppressed for years in the service.'A Navy spokesman tells DailyMail.com the digital ambassador program was a pilot that ended in March 2023. Kelley's involvement attracted fresh criticism this week.  ",
        "On her now deleted Instagram page, she listed her pronouns as 'she/her' but also called herself non-binary. While Kelley's appointment is not new, and she is not the only digital ambassador (she is one of five), her role has only recently attracted criticism. Many have compared her to Dylan Mulvaney, the trans activist whose association with Bud Light sparked a PR crisis for the brand and sent sales plummeting. Now, some veterans and conservatives are slamming the Navy for trying to solve a recruiting crisis by appointing a drag queen.Kelley has a large following on TikTok where she has been sharing videos of her drag performances on-board Navy ships for years. ",
        "In November last year, as part of an effort to boost recruitment, she and four others were given the non-paid, digital ambassador roles. While her performances and non-binary identification have been applauded by many - including some vets -  others are furious that the Navy believes this may solve the answer to its recruiting crisis. ",
        "They say the decision will only make America's enemies mock its capabilities and strategy. 'US Navy are now using Drag Queen Joshua Kelley (AKA Harpy Daniels) to attract new enlistment. 'This must strike fear in our enemies,' quipped one critic. ",
        "'So the US military misses recruitment goals by a mile.. and instead of getting a clue their strategy is to enlist a drag queen influencer that goes by the name of Harpy Daniels to meet recruiting goals?'I'm sure China is terrified!' said another. In her video, Daniels described standing up for LGBTQ causes in the military. She hit back at some critics online, labeling them 'homophobic'.Kelley said she began dressing in drag and performing in shows years before she joined the Navy, drawing on inspiration from the queens on RuPaul's Drag Race — which he started watching at the age of 16. She then first started performing on ships after a sanctioned MWR (Morale. Welfare and Recreation) lip-syncing contest in 2017, while deployed on the USS Ronald Reagan, and became a regular in the competitions, according to NBC News.The officer insists she never experienced harassment in the Navy, but when she was scheduled to perform at a diversity, equity and inclusion event at Langley Joint Air Force Base in the summer of 2022, it 'caused an uproar to many conservatives and Christian extremists.'",
        "A recent survey found that only 13 percent of  18-29-year-olds are 'highly willing' to join the Navy, while 25 percent are 'somewhat willing.'"
    ]
}