{
    "articleURL": "/wires/reuters/article-12052881/Engineers-reduce-risk-dam-bursting-near-Russian-held-Ukraine-nuclear-plant-TASS.html",
    "content": [
        "May 5 (Reuters) - Engineers have reduced the risk of a dam bursting and damaging a large Russian-held Zaporizhzhia nuclear power station in Ukraine, a senior Russian official was quoted as saying by TASS news agency on Friday.",
        "Renat Karchaa, an adviser to the general director of energy engineering firm Rosenergoatom, said specialists had begun discharging water from the Kakhovka hydroelectric dam on the Dnipro River in southern Ukraine, according to TASS.\"As we anticipated, a technical solution to the problem has been found,\" Karchaa told TASS, quoting regional officials in Kherson region, where the dam is located.\"A gate of the Kakhovka hydropower plant has been opened and repair works have begun at the Kakhovka canal. Pumps and pipes are being repaired. Water is being discharged. The risks of flooding have reduced considerably.\"The risk would be eliminated once water levels returned to normal, Karchaa said.He had earlier told TASS that a possible breach of the dam owing to high water levels could flood the cable line for the Zaporizhzhia nuclear power plant further east and cause nuclear safety risks. Nearby towns could also be affected.Russian troops seized the plant, Europe's largest nuclear station, as they invaded parts of Ukraine last year. It is the focus of a nuclear security crisis due to frequent nearby shelling, which Kyiv and Moscow blame on each other.Last November, after Russian forces withdrew from the nearby southern Ukrainian city of Kherson, satellite imagery showed significant new damage to the dam.",
        "Ukraine and Russia have accused each other of planning to breach the dam using explosives, which would flood much of the area downstream and likely cause destruction around Kherson.Karchaa's comments contrasted with warnings made in March by Ukrainian officials, who feared the Zaporizhzhia plant could run short of water to cool reactors by summer as Russian forces had let water out of a reservoir that supplied the station. (Reporting by Ron Popeski; editing by Grant McCool)"
    ]
}