{
    "articleURL": "/femail/article-12047247/Im-astrology-expert-Im-not-surprised-Victoria-Beckham-Nicola-Peltz-clash.html",
    "content": [
        "Astrologer Michelle Bell reveals the reason behind the feud speculationRead More: Astrology expert reveals why Meghan Markle is skipping coronation An astrologer has claimed to know the reason behind the feud speculation between Victoria Beckham and her eldest son's wife Nicola Peltz.",
        "The fashion designer, 48, and actress, 28, came together over the Easter weekend for a family dinner, which was dubbed a 'peace summit', however the pair still appeared to keep a slight distance from one another.The cold war began when Victoria and Nicola clashed over her wedding dress and the Transformers star accused her new mother-in-law of stealing the limelight at her wedding.Victoria is an Aries Wood Tiger in Western and Chinese astrology, while Nicola is a Capricorn Wood Dog.Astrology expert Michelle Bell - founder of Cosmic Fusion - told FEMAIL how their star signs could play a part in their character clash. ",
        "Michelle said: 'When it comes to their Western star signs, these two characters clash quite significantly. 'Aries like Victoria and Capricorn like Nicola just can't seem to see eye to eye in many areas of life. 'Aries are like a wildfire, always impulsive, impatient, and erratic, never wanting to be held down by anyone or anything. But Capricorns are more like a sturdy mountain, less emotional than Aries and a lot more cautious and reserved. 'As an earth sign, Capricorns are more grounded and less emotional than the fiery Aries.'These two signs can also clash because Aries, with their feisty nature, might find Capricorn to be a little boring and too rigid for their taste. ",
        "Meanwhile, Capricorn, with their practical mindset, might see Aries as being overly reckless and irresponsible. He continued: 'Aries just want to go out and live their wildest dreams, but Capricorn is always assessing the situation before taking action. It's a classic case of yin and yang.",
        "'On the flip side, their Chinese zodiac signs do actually gel quite well together. They are both Wood elements in Chinese astrology and therefore share a lot of the same qualities. 'They share the same creativity and innovation, and they thrive in environments that allow them to express themselves freely. 'Similarly, the Tiger and Dog are pretty compatible too. They both share a strong sense of loyalty and honesty. They both value independence and freedom.'If they’re able to find a balance between their Aries and Capricorn signs, there’s a chance for a healthy compatibility but it will require a lot of effort from both sides. 'Aries and Capricorn can both be stubborn, they can be incredibly determined when they have their sights set on something, which can make it difficult for them to back down or change their minds.'Cosmic Fusion is available on Apple and Android."
    ]
}