{
    "articleURL": "/tvshowbiz/article-12045693/Paul-Hollywoods-ex-Summer-Monteys-Fullam-shares-health-update-having-surgery.html",
    "content": [
        "Paul Hollywood's ex Summer Monteys-Fullam has revealed she underwent keyhole surgery after a cyst burst in her ovary, leaving her in excruciating pain. ",
        "The former barmaid, 27, took to Instagram to reveal the health news, explaining the procedure she had.She told followers that the cyst had filled a sac behind her womb with fluid which needed to be drained. Summer added that doctors at Gloucester Royal were concerned her ovary had twisted and would die off but all went well with the operation. The beauty revealed that she was on the road to recovery and was ready to get home and go back to work after three days and two nights at hospital. ",
        "Before the surgery, she took to her Instagram story to post a picture of herself making a peace sign and wrote: 'Hey guys I'm off to surgery now will update you all when I'm on the other side.'Summer dated Paul after his 20-year marriage to wife Alex ended in 2017 and was seeing him until August 2019.However, Alex later claimed Paul's relationship with Summer started before their split- something which Summer has always vehemently denied. Alex hit out at Paul last year, claiming their marriage was 'over seasoned with extra marital affairs'.  The television show judge previously admitted to cheating on Alex with chef Marcela Valladolid, 43, in 2013, and Alex, who shares a teenage son with Paul, insisted she is finally happy being single but said some people struggle to believe that's true. ",
        "She wrote on Instagram: 'It’s taken me a while to get here and it hasn’t been easy, but I love the woman I am now. 'I know only too well that not every marriage/partnership is a recipe for happiness and success.",
        "'My own marriage was too over seasoned with extra marital affairs for my taste and so I opted out and chose the single menu instead. It wasn’t easy and it took some getting used to.'I wasn’t even sure I liked it much at first, but as I regained my confidence, my freedom and myself after so long, I discovered that it really isn’t a cliché to say happiness really does comes from within.'She added: 'I still get the occasional well-meaning comment — that I’ll get \"snapped up soon\" rather like a supermarket meal deal. People don’t like to believe that a woman can be happier single.'MailOnline contacted a representative for Paul for comment at the time.Alex split from Paul over his affair with Marcela who worked on the American version of Bake Off.They got back together but finally went their separate ways in 2017, with Alex citing infidelity as the reason for the split.",
        "Most ovarian cysts occur naturally and go away in a few months without needing any treatment.An ovarian cyst is a fluid-filled sac that develops on an ovary. They're very common and do not usually cause any symptoms.Ovarian cysts may affect both ovaries at the same time, or only one. An ovarian cyst usually only causes symptoms if it splits (ruptures), is very large or blocks the blood supply to the ovaries.In these cases, you may have: pelvic pain, pain during sex, difficulty emptying your bowels, a frequent need to urinate, heavy periods, irregular periods or lighter periods than normal, bloating and a swollen tummy, feeling very full after only eating a little or difficulty getting pregnant – although fertility is usually unaffected by ovarian cysts.The two main types of ovarian cyst are: functional ovarian cysts – cysts that develop as part of the menstrual cycle and are usually harmless and short-lived; these are the most common type or pathological ovarian cysts – cysts that form as a result of abnormal cell growth; these are much less common.Source: NHS "
    ]
}