{
    "articleURL": "/wires/reuters/article-12056291/Russias-Wagner-group-signals-stay-Bakhmut-threat-quit.html",
    "content": [
        "May 7 (Reuters) - The head of Russia's Wagner mercenary group appeared on Sunday to ditch plans to withdraw his forces from Bakhmut in eastern Ukraine after receiving promises overnight that they would get all the arms needed to capture the devastated city.",
        "Yevgeny Prigozhin announced on Friday that his fighters, who have spearheaded the months-long assault on Bakhmut, would pull out because he said his men had been starved of ammunition and had suffered \"useless and unjustified\" losses as a result.Prigozhin, who has publicly heaped scorn on Russia's Defence Minister Sergei Shoigu and the top army brass over their conduct of the war in Ukraine, said officials in Moscow consumed by \"petty jealousy\" were holding back crucial supplies to his men.However in an audio message posted on his Telegram channel on Sunday, Prigozhin said: \"Overnight we received a combat order, for the first time in all this time.\"\"We have been promised as much ammunition and weapons as we need to continue further operations. We have been promised that everything needed to prevent the enemy from cutting us off (from supplies) will be deployed on the flank,\" he added.The battle for Bakhmut, which Russia sees as a stepping stone to other cities in Ukraine's Donbas region still beyond its control, has been the most intense of the conflict, costing thousands of lives on both sides in months of grinding warfare.Ukrainian troops have been pushed back in recent weeks but have clung on in the city to inflict as many Russian losses as possible ahead of Kyiv's planned big push against the invading forces along the 1,000 km (620 mile) front line.",
        "Prigozhin also said on Sunday that Russia's Defence Ministry had assigned General Sergei Surovikin to work alongside Wagner.\"This is the only man with the star of an army general who knows how to fight,\" he added.Surovikin commanded Russia's Ukraine campaign for several months before the chief of the General Staff, Army Army General Valery Gerasimov, was given overall operational command above him. (Reporting by Caleb Davis Editing by Gareth Jones)"
    ]
}