{
    "articleURL": "/tvshowbiz/article-12057219/Take-Thats-Howard-Donald-relaxes-face-massage-ahead-Coronation-Concert-performance.html",
    "content": [
        "Howard Donald enjoyed a face massage ahead of his headline performance with Take That at King Charles's Coronation Concert at Windsor Castle on Sunday. ",
        "The singer, 55, who will be taking to the stage with the band for the first time in four years, made sure to get some last minute relaxation in.Sharing a behind-the-scenes clip to his Instagram Story, Howard closed his eyes while his hair stylist Liz Taw worked her magic. After massaging his face she then rubbed his neck, leaving him glowing in preparation for the musical extravaganza. The musician wore a black T-shirt and sported a groomed beard and had his long hair in natural curls.  ",
        "Take That will join Katy Perry and Lionel Richie, while other performers include Freya Ridings and Andrea Bocelli. The band are also to release their first new music in five years as they have re-recorded their hit 2008 single Greatest Day - which is coming out on Friday.The trio - Gary Barlow, Mark Owen and Howard Donald - have re-worked their beloved number one track with the help of singer Calum Scott.Calum told The Sun: 'I was really nervous about jumping on a song that was already such a smash and recording on my vocal in there but it was also such an honour.'Gary and I hit the studio together for a day working on a new section and doing new vocals and then we went it to the boys [Mark and Howard] to rerecord their parts.'",
        "Calum also chatted to Gary about writing some new, original music together, he said: 'We said after this track we want to get in the studio together and write original music.'I'm in the middle of working on my third album so hopefully we can do something for that.'I'm excited to be able to work with him. Even being linked to a band like Take That is wild.'",
        "DJ Robin Schulz has added some dance influence to the stripped-back, anthemic number, which will also appear in the musical. Speaking about the new song, Take That said: 'Greatest Day is a special song for us - it was one of our biggest singles, and our 11th No.1.'It's been fantastic being in the studio working on the new version of the track with Calum and Robin, both such talented artists.'With the movie Greatest Days coming out this summer we wanted to do something special with the title track and we were really excited that Calum and Robin agreed to be involved. They have been brilliant! We're really excited for everyone to hear it.'"
    ]
}