{
    "articleURL": "/wires/afp/article-12056531/Wagner-says-Russia-promises-ammo-stay-Bakhmut.html",
    "content": [
        "The head of the Wagner mercenary group said on Sunday that Russia had promised his fighters enough ammunition to stay in the eastern Ukrainian city of Bakhmut, after threatening to pull out in scathing videos.",
        "Rivalries between Yevgeny Prigozhin and the conventional army had boiled over during the battle for the now-devastated flashpoint, where Wagner is leading the assault.\"Overnight we received a combat order... they promised to give us all the ammunition and armaments we need to continue the operations\" in Bakhmut, Prigozhin said.His group has been assured \"that everything necessary will be provided\", he added.On Friday, he had threatened to pull out of Bakhmut on May 10, blaming Defence Minister Sergei Shoigu and Chief of General Staff Valery Gerasimov for \"tens of thousands\" of Russian casualties in a series of blistering, profanity-laced videos.\"Their unprofessionalism is destroying tens of thousands of Russian guys and that is unforgivable,\" he said.",
        "The internal row comes as Russia has reported increasing drone strikes and sabotage inside its territory ahead of an expected spring counteroffensive from Ukraine.Ukraine also reported casualties early Monday morning from fresh Russian strikes on Kyiv overnight.Kyiv Mayor Vitali Klitschko said at least four people in two separate districts had been injured in the drone attack, while the city's military administration reported that suspected falling debris had also hit a two-story building, with information on potential victims still \"being clarified\".In Odessa, the district military administration reported an airstrike hitting a warehouse, adding that \"there has not been any information about victims\".",
        "- 'Dying so you can get fat' -In one of his previous video broadsides against the Russian army, Prigozhin stood before what he said were rows of dead Wagner fighters.\"They came here as volunteers and they are dying so you can get fat in your wood-panelled offices,\" he said.On Saturday, he asked Moscow to let him hand over his positions to Chechen strongman Ramzan Kadyrov, who had said that his forces were \"ready to move\" toward Bakhmut.",
        "Prigozhin has for months accused the conventional army of refusing to deliver ammunition to his men.Nevertheless, the emotive language used in Friday's videos and the ferocity of his attack on the leaders of Russia's campaign in Ukraine were unprecedented.On Sunday, Prigozhin said Russian General Sergei Surovikin, one of Gerasimov's deputies, would oversee Wagner's operations.\"He is the only decorated general that knows how to fight,\" Prigozhin said in a fresh dig at Russia's other army chiefs.Surovikin was named military commander in Ukraine in October.Three months later, he was replaced by Gerasimov, whom Prigozhin regularly criticises.- 'Everything possible' -Russian troops have battled since last summer to capture Bakhmut, the political importance of which has come to surpass any strategic value.On Saturday, the commander of Ukraine's ground forces, Oleksandr Syrsky, visited the eastern front.",
        "\"The enemy is not going to change its plans and is doing everything possible to take control of Bakhmut,\" Syrsky said in a statement published on Sunday.Ukraine has been gearing up for a counteroffensive, with some experts suggesting that the drone strikes and acts of sabotage on Russian-held territory are part of its preparations.The strikes precede Russia's May 9 public holiday, a central event under President Vladimir Putin that celebrates the Soviet victory over the Nazis in World War II.On Sunday, the Russian army said it had repelled 22 Ukrainian drones over the Black Sea.Shortly before, authorities in Russian-annexed Crimea, surrounded by the Black Sea and the Sea of Azov, said they had downed more than 10 drones over the southern peninsula.The Russian security services also said they thwarted a drone attack on an airfield in the Ivanovo region.- 'Unpredictable' -As the counteroffensive looms, Moscow has ordered families with children and elderly members to temporarily evacuate a slew of Russian-held areas in southern Ukraine.More than 1,500 people have been evacuated, including 632 minors, the governor of the southern Zaporizhzhia region said Sunday.The partial evacuations concern at least 18 towns and settlements, including the town near Europe's largest nuclear plant.\"The general situation in the area near the Zaporizhzhia nuclear power plant is becoming increasingly unpredictable and potentially dangerous,\" UN nuclear watchdog chief Rafael Grossi said on Saturday.",
        "\"I'm extremely concerned about the very real nuclear safety and security risks facing the plant.\"Meanwhile, Russian pro-Kremlin writer Zakhar Prilepin issued a defiant message on Sunday, a day after being wounded in an attack on his car that killed his assistant.\"I tell the demons: you will not intimidate anyone,\" Prilepin wrote on Telegram in his first message since the attack.Moscow has blamed Ukraine and the United States for the car attack, which Kyiv has suggested was due to in-fighting between rival Russian factions."
    ]
}