{
    "articleURL": "/news/article-12055739/Julie-Bishop-slammed-taking-selfie-Lionel-Ritchie-Coronation-King-Charles-III.html",
    "content": [
        "Julie Bishop posted selfies with singer Lionel Ritchie Not everyone thought her photos were 'inappropriate'Julie Bishop has been slammed by a prominent Australian reporter for taking selfies with Lionel Ritchie inside Westminster Abbey at the Coronation of King Charles III.",
        "The former Australian Minister of Foreign Affairs attended the historic event in London on Saturday alongside Prime Minister Anthony Albanese and other state leaders from around the world.Once inside the church, she took photos with the American 'All Night Long' singer and shared them with her 100,000 Instagram followers.",
        "'A magnificent Coronation Service of great beauty, solemnity and historical significance,' she wrote in the caption.'As chair of Prince's Trust Australia it was an honour to be present alongside Lionel Ritchie, Global Ambassador for Prince's Trust.'Entertainment reporter Peter Ford blasted Ms Bishop's post as 'inappropriate' in a tweet on Sunday.'So inappropriate to be doing selfies inside the Abbey,' he wrote.Mr Ford explained the historic church, which dates back to the 13th Century, is a 'place of worship not a red carpet'.'Do what you choose outside but not once you enter the sacred place,' he said.His tweet sparked a Twitter firestorm with social media users swooping in to defend Ms Bishop. One Twitter user pointed out that other guests were also posting selfies, but Mr Ford said Ms Bishop 'should have known better'.",
        "Another user quoted the Abbey's official website, which says visitors are welcome to take photographs in the church, but Mr Ford said: 'I suspect the invitation to do that was to capture pictures of the actual Abbey. ",
        "'Not selfies with celebrities.'Others pointed out the coronation was a celebration, rather than a sombre event, and said they didn't see an issue with the former Liberal minister's post. After the service, Ritchie shared Ms Bishop's Instagram post with his 1.4million followers.Ms Bishop was also mocked for her elaborate beige dress, which included floral motifs and a matching hat which towered on her head.Some viewers said her outfit reminded them of a 'toilet dolly' - a type of decorative doll that was popularly used as a toilet roll holder in the 1970s.'Julie Bishop dressed as a toilet dolly. Pomp now getting underway' one person joked on Twitter. ",
        "'Julie Bishop's stylist is as effective as Morrison's empathy coach' someone else chimed in while another said the outfit looked like a 'hazmat suit'.Others liked the look, with one writing: 'Julie Bishop at the coronation looking riveting… with a touch of welding a bit of panel beating and some spray painting!'Ms Bishop, Nick Cave and soccer superstar Sam Kerr are among a handful of Australians invited to King Charles III's Coronation.Prime Minister Anthony Albanese and his partner Jodie Haydon will lead the group of Australians attending the ceremony at Westminster Abbey, in London.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year.",
        "At Saturday's coronation, he and Queen Consort Camilla will be officially crowned by the Archbishop of Canterbury, Justin Welby."
    ]
}