{
    "articleURL": "/wires/ap/article-12044487/Shattuck-wins-PGA-Professional-20-club-pros-head-PGA.html",
    "content": [
        "SANTA ANA PUEBLO, N.M. (AP) - Pennsylvania club pro Braden Shattuck capped off his PGA Professional Championship debut by making a 12-foot par putt on the final hole for a 2-under 70 and a one-shot victory that sends him and 19 others to the PGA Championship in two weeks.",
        "Shattuck won by one shot over Matt Cahill (68) and Michael Block (69) at Twin Warriors Golf Club. The top 20 are exempt to the PGA Championship on May 18-21 at Oak Hill.Alex Beach tied for 11th and will be going to the PGA Championship for the fifth straight year. Block, Wyatt Worthington II and Colin Inglis all played last year at Southern Hills.Shattuck is the director of instruction at Rolling Greens Golf Club in Springfield, Pennsylvania, and he considers himself fortunate to be playing. He was in a car accident four years ago that severely injured his back. After taking a few years away from golf, he changed his swing and equipment to compensate for the injuries.\"I came into the week hoping I'd made the cut,\" Shattuck said. \"I didn't know what to expect. To walk away with the trophy and a spot in a major, I'm really fortunate.\"And it helped to have a hot putter. Shattuck took the lead with an 18-foot birdie putt on the par-5 16th hole and then missed a 4-foot birdie putt on the par-3 17th that would have given him a cushion. On the closing hole, he pushed his approach well to the right, and with the pin on the right side of the green, the best he could do was to pitch it 12 feet by the hole.",
        "\"My eyes were pulsating over that putt,\" he said. \"I could barely see straight.\"But he made it to finish at 9-under 279, pose with the crystal Walter Hagen Cup and start making plans for Oak Hill in Pittsford, New York, and what typically is the strongest field of all the majors.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}