{
    "articleURL": "/wires/reuters/article-12056009/Seeking-9th-straight-win-Red-Sox-gear-series-finale-vs-Phillies.html",
    "content": [
        "The Boston Red Sox look to keep their high-octane offense clicking on all cylinders Sunday when they vie for a three-game sweep of the host Philadelphia Phillies.",
        "The white-hot Red Sox have scored 59 runs during their eight-game winning streak following a 7-4 victory on Saturday.Boston, which has scored at least five runs in each game during its winning streak, is bidding to win nine in a row for the first time since April 5-14, 2021.Rafael Devers highlighted his second three-hit performance in his last three games on Saturday with a two-run double that ignited a five-run fourth inning. Devers is 8-for-18 (.444) with one homer, seven RBIs and three runs during his four-game hitting streak.Speaking of hitting streaks, Masataka Yoshida hopes to benefit from Saturday's scheduled day off when he carries a 15-game run into the series finale.The Red Sox will look to continue their winning ways on Sunday afternoon when they send Tanner Houck (3-1, 5.34 ERA) to the mound against Philadelphia's Taijuan Walker (2-2, 6.91) in a battle of right-handers.Houck, 26, has been inserted into the starting rotation for the time being with left-hander James Paxton working his way back from a hamstring injury.Houck won his first three decisions before allowing four runs (three earned) in five innings of a 6-2 setback to the Baltimore Orioles on April 26. He followed that up by permitting six runs on as many hits in six innings of a no-decision versus the Toronto Blue Jays on Tuesday.",
        "\"I got cute,\" Houck told the Boston Globe. \"In general, I wouldn't say I had the best command. I didn't throw a lot of strikes and didn't get ahead of guys early.\"Houck will be facing Philadelphia for the first time in his career.Should Houck handle his business on Sunday, the Red Sox could be in line to turn to Kenley Jansen for the third time this series. He picked up the save in the previous two encounters with the Phillies to push his career total to 399.Walker, 30, will look to atone for a brutal outing in his last trip to the mound. He yielded eight runs on as many hits -- including three homers -- in 3 1/3 innings of a 13-4 shellacking by the Los Angeles Dodgers on Monday.Signed to a four-year, $72 million contract in the offseason, Walker has permitted five homers and 13 runs over his last two starts.\"I'd like to just be aggressive in the zone, and really trust my stuff,\" Walker told the Philadelphia Inquirer. \"I think I was trying to do too much with too many pitches. Instead, I'd like to just have the catcher set down the middle and throw the (heck) out of the ball.\"Walker is 0-1 with a 5.68 ERA and 1.737 WHIP in three career starts versus the Red Sox.",
        "While on the subject of struggling Phillies, Kyle Schwarber takes the cake. He is 0-for-19 with seven strikeouts in his last four games.Two-time National League MVP Bryce Harper, however, launched a solo shot in the fifth inning on Saturday for his first homer of the season.--Field Level Media"
    ]
}