{
    "articleURL": "/femail/article-12038749/Selena-Gomez-Instagrams-followed-woman.html",
    "content": [
        "To her fans, Gomez is a modern-day Diana, a flawed diamond who's all the more beloved for those flawsREAD MORE: Selena Gomez praises 'best friend' for donating kidney to herTen years ago, I was watching my favourite Disney film with my then young daughters. ",
        "They always wanted to watch it right to the end, not because they gave a stuff about the credits, but because the DVD (yes, it was that long ago) contained a bonus video. Truly, they preferred the bonus video to the film.  It was me who loved 101 Dalmatians: their love was reserved for the shiny-brown-haired girl who popped up at the end singing 'Cruella De Vil'. And that, dear reader, was the first time I encountered Selena Gomez.In the intervening years, her fame has risen to a stratosphere that even my obsessed little girls couldn't have predicted. Let's first cut to the numbers. Now 30, the former child actress turned singer, producer and businesswoman (her net worth is heading towards $100 million) has 67 million Twitter followers and is the most followed woman on Instagram (412 million), ahead of Kim Kardashian (353 million) and Beyoncé (306 million), and the third most-followed person on the site.",
        "The only people with more Instagram followers than her are Cristiano Ronaldo (578 million) and Lionel Messi (457 million). Anyone thinking, 'Yeah, but they're world-famous footballers' is missing the point. To her fans, Gomez is the winning goal. They feel how Ronaldo fans feel when he holds up a trophy. Only Gomez's currency isn't a gold cup: it's more nebulous than that. ",
        "If Ronaldo gains adulation because he's good at playing football, Gomez is adored because she's good at being real.Partly this is because she has a relatable back story. Gomez was born on 22 July 1992 in Grand Prairie, Texas, to a Mexican-American father, Ricardo Gomez, and American mother, Mandy Teefey, who divorced when she was five. Mandy was 16 and still in high school when she had Gomez, and the family had financial troubles throughout her childhood. 'Having me at 16 had to have been a big responsibility,' Gomez noted in an interview. 'She gave up everything for me, had three jobs, supported me, sacrificed her life for me.'As well as being relatable, the star also seems genuinely kind, and not just in a performative way. A recent example: her attempt to halt the hatred directed towards Hailey Bieber, wife of the pop star Justin Bieber, whom Gomez dated on and off for eight years. ",
        "Some fans have never recovered from their break-up, and blame Hailey for it. 'Hailey Bieber reached out to me and let me know that she has been receiving death threats and such hateful negativity,' Gomez wrote on Instagram in March. 'This isn't what I stand for. No one should have to experience hate or bullying. I've always advocated for kindness and really want this all to stop.'",
        " SHE’S BEEN OPEN ABOUT HER MENTAL HEALTH AND STRUGGLES WITH LUPUS  What Gomez stands for is both significant and unique. She's at the top of her game, a former child star who has successfully parlayed her early fame into a business empire. Launched in 2020, her make-up range, Rare Beauty, made $60 million in its first year, which is an impressive figure, given how overcrowded the market is with celebrity beauty brands.Gomez's circle of celebrity friends is loyal. Her best friend is Taylor Swift. Her current boyfriend is rumoured to be former One Direction member Zayn Malik. Earlier this year she was pictured on a yacht with Brooklyn Beckham and Nicola Peltz. A recent Instagram post shows her hugging Meryl Streep. Her fans are just as fiercely protective of her: Kylie Jenner lost almost a million Instagram followers after being accused of 'mocking' Gomez's eyebrows, one of many online spats involving women with the surname Jenner, Hadid and Bieber.Even by A-list celebrity standards, Gomez has a surfeit of fan sites devoted to her every move, where her health, clothes and love life are analysed by 'selenators', as her fans call themselves. 'You have all the qualities that make you wonder how a person can be so perfect!' is a typical comment under one of her recent Instagram posts. ",
        "'You are the most spectacular, amazing, talented, beautiful angel on earth who inspires me to be strong and not let anyone tell me I can't do something,' says another. She's particularly loved by the Latin community. 'I'm always very vocal about my background, as far as me talking about immigration, and my grandparents having to come across the border illegally,' Gomez said in a 2020 interview. 'I have such an appreciation for my last name. I've released a lot of music in Spanish as well.'",
        "Everybody loves Gomez. If you're a tween, it's likely to be for her make-up and her music: between 2009 and 2020, she recorded three dance-pop albums with her band The Scene, and three solo albums, for which she's won a host of awards including 16 Guinness World Records (many of the early ones featured Nickelodeon Kids' Choice Awards while later records coalesced around social media).If you're a teen, it's likely to be her acting: maybe you grew up watching her on the Disney Channel in Hannah Montana (2007) or Wizards of Waverly Place, in which Gomez starred as Alex Russo, the role that catapulted her into the mainstream. I DON’T WANT TO BE SUPER-FAMOUS BUT I DO KNOW I HAVE TO USE IT FOR GOOD  ",
        " If you're an adult, you'll likely know her for her humanitarian work: in 2009, aged 17, she became the youngest ambassador for Unicef, and has since raised millions for good causes all over the world. If you're a parent, you may even (somehow) have managed to avoid her throughout your offspring's childhood until 2021, when you stumbled into the living room and saw to your surprise that they were watching something quite good, actually, in which Gomez starred. For many parents of teens, Only Murders in the Building, on Disney+, is one of the few TV programmes (see also: Jane the Virgin, Schitt's Creek) that they can watch together and enjoy equally.Only Murders in the Building has been a ratings success and an eagerly anticipated third season has just finished filming although as yet there's no release date (it's likely to be sometime this summer). If you haven't yet watched it, prepare to be charmed. Gomez stars alongside Steve Martin and Martin Short, neighbours in a grand New York apartment block who turn amateur sleuths and launch a podcast after another neighbour is found dead.",
        " If the plot doesn't grab you (it's much funnier than it sounds) the cameos will: Meryl Streep, Shirley MacLaine, Paul Rudd, Cara Delevingne and Sting. 'There's a magic element, and it's Selena,' is how Martin explained the show's success to The Hollywood Reporter. ",
        "'The absolute ease, the joyfulness she brings to the set, was a pure delight,' added Short.As comedy veterans who've worked together for more than 40 years (most memorably on the 1991 film Father of the Bride), it's high praise indeed when the pair call Gomez a comic genius. But her global appeal is rooted in something deeper and darker than the shiny carapace that is her talent. It's rooted in her flaws.In 2016, she was in the middle of a world tour in support of her 2015 album, Revival, when she checked herself into a psychiatric facility to receive treatment for 'an emotional breakdown'. The Revival tour was cancelled after 55 performances. Three years of tumult followed. In 2017 she received a kidney transplant from her best friend, Francia Raisa, due to complications from the autoimmune disease lupus, a debilitating illness she's always been open about (one of its side effects, arthritis, prompted her to package Rare Beauty to be user-friendly for those with mobility issues). Gomez has been equally open about her mental health issues, entering rehab twice in 2018, having struggled after a diagnosis of a low white blood cell count. 'Depression was my life for five years straight. Depression and anxiety were at the forefront of everything I did in my life,' she said in an Instagram Live in 2018. 'I just wanted to tell you guys to be real with you.'This realness is what makes Gomez so relatable to her fans. While those of a similar age enjoy feeling as though they've grown up with her, for Gen Z, a demographic whose mental health has suffered immeasurably due to the pandemic, she's something of a lodestar. Gomez talked about her bipolar disorder diagnosis in 2020, a move that did much to destigmatise the condition and open up the conversation.As did last year's documentary, My Mind &amp; Me, an in-depth look at her life and the factors that contributed to her breakdown. Directed by Alek Keshishian, most famous for his 1991 documentary Madonna: Truth or Dare, the film captures Gomez at her most vulnerable.",
        "It also captures the claustrophobic relentlessness of modern fame. 'Those were some weird-ass questions,' says one of her team after particularly inane queries during a press interview in London.'It just seems like a waste of time,' says Gomez. 'I haven't done promo in two years – it's my least favourite thing in the world,' she adds, sitting in a chair having her make-up retouched for the umpteenth time. An ambulance goes past, siren blaring. 'Here's my ride,' she deadpans.'Vulnerable' is how Keshishian described Gomez in an interview with The Guardian. 'I have met every celebrity known to man. Most of them have developed a kind of armour to present themselves to the world. For someone who's been doing this since she was seven, it doesn't feel like Selena's got all these layers of façade.'Some viewers complained that Gomez sounded ungrateful in the documentary. To me, she sounded more exhausted than ungrateful. It portrayed her, like Amy Winehouse or Britney Spears, as being too much at the behest of others, a paradox of a woman whose wealth and power should give her more control over her own life than it seems to. Whenever she said she was tired, she was persuaded into doing one more interview or trip. 'Although it's hard, it allows you the platform to do the Kenya stuff,' one of her inner circle reminds her, the 'Kenya' in question being a 2019 trip undertaken with the WE Charity. The film shows her visiting a Kenyan school and chatting with some pupils. 'I finished eighth grade then for ninth to 12th grade I was home schooled by a computer,' she tells them. It's a throwaway comment that speaks volumes because it could be argued that Gomez sacrificed her childhood.",
        "That she has been working with the grim diligence of a pit pony since the age of seven is, some would opine, part of the reason her mental health is so parlous. She was nine when she won her first big TV role, on the hit US TV show Barney &amp; Friends, and a tween when she and her mother moved to Los Angeles to further pursue her acting career. The move paid off: Gomez went from Barney to working back-to-back for the Disney Channel. But being the family breadwinner at such a young age can't have been without its stresses. 'My whole life since I was a kid, I've been working,' she says ruefully in My Mind &amp; Me. 'I don't want to be super-famous, but I do know if I'm here, I have to use that for good.'That's the problem with mega fame: you can't escape it. One wonders how Princess Diana, that other super-famous woman who tried to use her platform for good, would have coped with modern celebrity, where smartphones are stuck in your face even more relentlessly than paparazzi lenses.To her fans, Gomez is a modern-day Diana, a flawed diamond who's all the more beloved for those flaws. Like Diana, she has a genuine ability to connect with people. Unlike Diana, she seems to be protected: by her fans as well as her famous friends.'You can't be afraid of what people are going to say, because you're never going to make everyone happy,' she once said. True, but she does bring happiness to millions. In an increasingly divisive world, Gomez has a rare ability to unite people. She's football, without the politics. Long may she keep achieving her goals."
    ]
}