{
    "articleURL": "/news/article-12039881/The-Windsor-spares-alike-theyd-admit.html",
    "content": [
        "Hard to imagine now, but Prince Andrew was once a favourite with his rascally young nephew Prince Harry.",
        "No longer. These days, just about the only thing that unites them is their status as royal outcasts — albeit for very different reasons.The depth of the public’s disapproval of its two errant ‘spares’ to the throne was revealed by the Mail yesterday. In a poll of 11,450 people commissioned by former Conservative deputy chairman Lord Ashcroft, only 22 per cent had a ‘favourable’ view of Harry, while just seven per cent could bear to favour Andrew. The survey ranked the two princes among the three least popular royals (the Duchess of Sussex had an 18 per cent rating).It’s easy to forget it now, but there had been a time when they were both liked by the public and were close to each other.When Harry was a boy they bonded over their mutual interest in military feats. Time and again, he’d get his uncle to talk about his heroics as a helicopter pilot in the Falklands war — which Andrew, of course, was only too willing to do. Doubtless those stories made a great impression on the young prince, who’d later have his own tales to recount about shooting Afghan insurgents from a helicopter.",
        "Some of the parallels between them are uncanny. Both fell in love with minor American actresses — Meghan Markle and Koo Stark.",
        "In their youth, both led rackety lives — dating strings of beautiful women and revelling in their reputation as handsome playboys.Tales abounded, meanwhile, of the rudeness of both uncle and nephew, and of their sense of entitlement. And, of course, much of this goes back to their over-indulged childhoods.The first thing to be said is they were both Mummy’s boys. In Andrew’s case, he was always the Queen’s favourite child — to the point that he was encouraged to kiss her on both cheeks, while Prince Charles just bowed.Like the Queen with her spare, Princess Diana indulged her own by allowing him to run wild. Although she didn’t claim to have favourites, she also went to considerable lengths to make him feel important, even calling him Good King Harry.From early childhood, both spares were much naughtier than their siblings. ‘The baby is adorable. All in all, he’s going to be terribly spoilt by all of us, I’m sure,’ the Queen wrote presciently about Andrew in a letter to a cousin.Adorable-looking, perhaps, but his nanny called him ‘Baby Grumpling’ for his temper tantrums and Prince Philip called him ‘The Boss’ — a reference to Andrew’s determination to get his own way. Appearing at a film premiere with a black eye, Philip confided that ‘The Boss’ had done it. At the time, everyone thought he meant the Queen.",
        "Rarely punished, Andrew hid the knives and forks when a footman was laying the table and tied a sentry’s shoelaces together. He snuck a whoopee cushion under the Queen Mother, sprinkled itching powder in his mother’s bed and climbed onto the roof of Buckingham Palace to bend the TV aerial. Despite being unable to watch one of her favourite horse races on television, the Queen thought her second son was hilarious.",
        "For the most part, Diana was equally indulgent. She just laughed when Harry tugged at his music teacher’s trousers and piped up: ‘I can see your willy!’And neither she nor Prince Charles intervened when Harry and his brother tackled their royal protection officer Inspector Ken Wharfe. One of them, said Wharfe, would land ‘punches towards my groin, which, if they connected, would make me kneel over in agony.’ No prizes for guessing which prince he meant.Whenever Harry’s 60-year-old nanny Olga Powell tried to reprimand him, he’d snap back: ‘Go to your room, Olga.’And, of course, it was Harry’s idea to run a go-kart track across his father’s pristine lawn at Highgrove.‘We can’t do that because Papa will go mad,’ warned Prince William.‘It doesn’t matter about that,’ said his irrepressible little brother. Indeed, whenever William tried to restrain him, Harry would say: ‘I can do what I like, because I’m not going to be King. You can’t because you are.’",
        "At school, neither Harry nor Andrew were the sharpest pencils. Indeed, Harry famously managed to score only two A-levels at Eton — a D in geography and a B in art — though at least he was good at games.Not Andrew: as well as failing to impress in the classroom, he did little to distinguish himself on the sports fields of Gordonstoun, his Scottish boarding school. Not that he seemed to mind.",
        "And here we come to the first big difference between uncle and nephew. Coddled by his mother, Andrew seemed to view himself as the centre of the universe.Nothing much knocked his large ego off course, not even his relative unpopularity at school. Fellow pupils remember him as ‘boastful’ and ‘big-headed’. One recalled: ‘He had a bit of the “I am the Prince” about him when he arrived . . . The ribbings he got were unmerciful.’In his last year at Gordonstoun, according to former fellow-pupil Lucilla Houseman, ‘he didn’t shine at anything. Well, not quite — he loved having a good time. In fact, the story that went round the school was that he failed some O-levels because he spent all his time reading trashy magazines and comics.’And Harry? At Eton, which he entered at 14, he was more focused on rebellion. Always competitive with his older brother, he reflected later that he’d felt like a ‘nullity’, an ‘unbrilliant boy’ who was second-best.",
        "Some of Harry’s pranks were extremely childish, like balancing a book on the top of a door so that it fell on a teacher’s head. But he also got into trouble for having a hair-trigger temper, once kicking in a window during a dispute with another boy over a girl they both fancied.‘Harry was like a firecracker,’ said one teacher. ‘When other pupils saw him coming, they used to pass a by-now familiar warning: “Don’t light the blue touch paper”. In other words: don’t give him the slightest excuse to vent his spleen.’Summer holidays were taken with the family of his friend Henry van Straubenzee at their house near Rock in Cornwall — which attracted so many public-school teenagers that it became known as ‘Sloane Square-on-Sea’. The place was awash with booze and pretty young girls.On one occasion, Harry got drunk, and started throwing around cider bottles. ‘He was vomiting behind the wall,’ said one girl.",
        "‘He’s one of the most revolting people I’ve ever come across’.The teenaged Harry embraced his status as a bad boy. In pubs around Highgrove, he not only developed a taste for vodka but also started smoking marijuana. And, at Eton, he soon became known as ‘Hash Harry’ or ‘His Royal High-ness’.",
        "He could also be rude and offensive. He got into at least one fight in a pub, and was thrown out for calling its French chef a ‘f***ing frog’.Andrew was rather more careful whom he insulted. But staff and protection officers appear to have been fair game. Ken Wharfe recalled he was once moved from a window seat on a plane because he was obstructing Andrew’s view. ‘His manners,’ Wharfe said, ‘are just awful.’And an aide claimed: ‘He treats his staff in a shocking, appalling way. He’s been incredibly rude to his personal protection officers, literally throwing things on the ground and demanding they “f***ing pick them up”.’There’s no denying that Andrew and Harry were girl-magnets in their late teens and 20s. As we now know from Harry himself, he lost his virginity at 16 to a woman three years his senior in a field.At the same age, Andrew — or Prince Heartthrob as he was dubbed — was visiting the Montreal Olympics in Canada with his parents, and being bombarded with telephone numbers and requests for dates. Certainly, Andrew didn’t have to make much effort to have pretty girls tumbling into his arms.Nor did Harry, who used to employ the chat-up line: ‘How would you like to come back to my palace for a drink?’",
        "At 21, Andrew was named one of the world’s most eligible bachelors by People magazine. Soon his long roster of girlfriends, often ravishing blondes, had earned him yet another nickname: Randy Andy.As the author Margaret Holder commented: ‘The playboy image is not one Prince Andrew discourages. He’s been seen many times on party yachts, and he thinks it enhances his reputation. Attracting luscious young ladies makes him feel young.’He may have winced, however, when topless model Vicki Hodge earned £40,000 from the News of the World for details of their brief fling in Barbados, as well as for a photograph of 23-year-old Andrew standing naked in the surf, swinging his swimming trunks over his head.Vicki said she’d discovered why his previous affairs had been so brief: he finished far too quickly. She’d told him to slow things down by counting to himself, but he’d put her off by counting out loud.While Harry tended to pick girls sensible enough to shun the limelight, Andrew went for a very different sort — often models and actresses. Then, in 1981, he had his first real love affair.American starlet Koo Stark had met him in Tramp nightclub in London. Koo had approached Andrew and his friends, who were making a racket on the dance floor, and asked them to turn down the volume. ‘Stop being so boring,’ said the prince. ‘We’re having a great time — come and join us.’The affair eventually petered out in 1983. His subsequent marriage to Fergie, in 1986, was passionate at first but foundered within six years.Harry also had many flings, but — unlike Andrew — went to some length to keep them out of the headlines. He was also better at choosing bed-mates who didn’t kiss and tell, and had serious relationships with at least two of them.",
        "Sometimes, however, the media got wind of sleazy antics he’d have preferred to keep secret. In 2012, pictures emerged of him playing strip billiards in Las Vegas.It was reminiscent of an incident in 2001, when Andrew was photographed on board a luxury yacht off the Thai island of Phuket, surrounded by a group of topless young women.He also toured the red-light district of Phuket. In one go-go bar — bearing the motto ‘good food, cold drinks, hot girls’ — he danced with half-naked young women.A regular said: ‘You certainly wouldn’t get a member of the Thai royal family in a place like this. The area is very raunchy and many of the girls are prostitutes.’What does a royal spare actually do? For Harry and Andrew, there was an obvious answer: join the military. In Harry’s case, this was what he’d always wanted to do anyway, ever since Diana had introduced her lover Major James Hewitt into the household. From the beginning, Harry was enthralled by ‘Uncle James’ and his tales of Army life.Hewitt also had his regimental tailor run up a little camouflage uniform for the prince, which he hardly ever took off. And he took Harry to Combermere Barracks, home of the Household Cavalry. There, he clambered on a tank and announced: ‘I’m going to be a soldier when I grow up.’And Andrew? Predictably he did what was expected and joined the Navy.Both Andrew and Harry did well in their military careers. But after these ended, they once again had to find something to occupy their time.",
        "Attempts to deploy Andrew as an asset for the royal Firm were not always a success. On a trip to the U.S., his behaviour was so bad that he was dubbed the Duke of Yob by the British Press.The American media called it ‘the most unpleasant royal visit since they burned the White House in 1812’.A chance to redeem himself came when he was appointed Britain’s roving trade ambassador, but he proved to be a disaster. Too often, the Foreign Office said, he refused to stick to the agreed itinerary and ‘left a trail of glass in his wake’.Andrew was also burning through hundreds of thousands a year of taxpayers’ money. Living up to his latest nickname — Airmiles Andy —he criss-crossed the globe to attend golf tournaments and various social occasions.The rest, of course, is recent history. Andrew’s disgrace, already under way when he gave that ruinous Newsnight interview about his friendship with Jeffrey Epstein, was compounded when he paid millions to Virginia Giuffre.Harry fared rather better than his uncle. As he took on more royal duties in his early 30s, he seemed to show signs of maturing from spoiled prince to cheeky charmer. And then came Meghan.While Andrew was demoted by his mother, Harry quit voluntarily — then treated the world to an increasingly tiresome whinge-fest about how poorly he’d been treated.Since his autobiography, his popularity has plummeted. But as yesterday’s poll of how the public rates its royals shows, there is one prince who will seemingly always curry less favour, his uncle Andrew.Adapted from Windsor Spares: The Prince Harry and Prince Andrew’s Soap Opera! by Nigel Cawthorne, to be published by Gibson Square on May 4 at £9.99. © Nigel Cawthorne 2023. To order a copy for £8.99 (offer valid to 14/05/23; UK P&amp;P free on orders over £25), visit mailshop.co.uk/books or call 020 3176 2937."
    ]
}