{
    "articleURL": "/tvshowbiz/article-12058653/Brooklyn-Beckham-Nicola-Peltz-stylish-pair-Carbone-Beach-supper-club-event-Miami.html",
    "content": [
        "Brooklyn Beckham and his wife, Nicola Peltz, were spotted at the final night of Carbone Beach in Miami, Florida on Sunday.",
        "The 24-year-old media personality and the actress, 28, were a stylish pair as they donned matching black outfits for the exclusive supper club event during F1 Miami Grand Prix weekend.The lovebirds — who were spotted in similar outfits in New York City earlier this week — arrived to the star-studded event hand-in-hand.For the special occasion, the former model put on a casual display in a gray sweatshirt worn over a gray T-shirt and teamed the comfortable top with a pair of black jeans.His other half looked stunning in a one-shoulder top paired with a quilted leather miniskirt and platform boots.",
        "The son of Victoria and David Beckham accessorized with a black, flat bill cap worn backwards as well as a dainty gold jewelry pieces on his wrists.And for a bit of contrast, he sported a pair of all-white Vans sneakers. By his side, the Bates Motel alum donned a chic, one-shoulder top adorned with a rose on one shoulder and another on the side of her hip.The daughter of billionaire businessman Nelson Peltz wore a low-waisted, black miniskirt with a quilted diamond pattern.She was seen toting around a black, rectangular shoulder bag and also sported a pair of mid-calf platform boots.For jewelry, she modeled a pair of silver hoop earrings and her dazzling wedding ring. ",
        "She looked radiant in a glamorous, cut-crease eyeshadow look and coral pink blush for a subtly flushed appearance.She finished off the look with a muted pink glossy lip and slicked back her brunette tresses into a sleek, polished updo.",
        "Previously, the cute couple met at Coachella Music Festival in 2017 but were seeing other people at the time. In 2019, the pair crossed paths at Leonardo DiCaprio's Halloween party and started dating. After six months together, Brooklyn and Nicola announced their engagement and tied the knot in April 2022. Earlier in the day, Nicola shared photos of herself in a sexy, red ensemble while posing in the mirror with her pal Andie Jane. She sported a bright red miniskirt and the matching blazer with only the middle button done up to reveal her black bralette.She looked stunning in a minimal makeup look to accentuate her features and showcase her natural beauty."
    ]
}