{
    "articleURL": "/news/article-12046467/Leith-Dianne-Woods-female-teacher-42-Perth-convicted-having-sex-16-year-old-student.html",
    "content": [
        "Leith Dianne Woods convicted of child sex offencesThe ex-teacher sexually penetrated girl, 16A female ex-teacher and footy coach has been convicted of child sex offences against a teen student who she considered her 'little sister'.",
        "Leith Dianne Woods was on trial in the WA District Court defending claims she committed multiple child sex offences, including indecently dealing and sexually penetrating the 16-year-old while she was a teacher at a regional school in 2012.The court was told the pair first met outside of school when the girl was in Year 10 and Woods was a former coach for the Swan Districts Football Club's women's team. Woods became her teacher at school later that year. ",
        "But it wasn't until 2012 — after they went away on a non-school sporting trip to the South West and Woods was no longer her direct teacher — that things changed and the pair began a 'secret relationship of sorts', reported the West Australian. Prosecutors alleged the relationship could not be considered consensual because Woods was in a position of authority, being a teacher at the girl's school.The jury was told the pair became close after the teen began experiencing difficulties at home, with Woods testifying she first saw the girl as a 'little sister' and began to mentor her because she viewed her as a talented sportsperson.She admitted to the court she knew her actions were wrong but continued with the relationship because had never had feelings for a female before.",
        "'I've had several male partners. But I felt companionship with her. I felt love,' Woods said.In her evidence, the victim, who is now in her 20s, said after their first sexual encounter on the South West trip she called Woods to apologise because she knew the position she had placed her in.She then testified Woods replied 'don't be silly' and that she did not regret it.The victim said from that after that point the pair 'engaged in sexual activity wherever we could' and detailed the various encounters she claimed took place over the course of her final year at school.",
        "These included Woods' car, home, other regional towns and on two school camping trips.Woods denied the pair met weekly to engage in sexual activity or that any of it took place on school camps, claiming she did not want to risk getting caught by other teachers or students.Woods was originally charged with 16 offences and admitted to six of them on the first day of her trial.However, she denied the remaining 10, claiming they did not take place at the time alleged. She was then acquitted of three of those charges during the trial.After three hours of deliberation on Thursday, the jury acquitted Woods of six more of those charges — five counts of sexually penetrating a child under her authority and indecently dealing.",
        "However, they found her guilty of one further charge — another sexual penetration offence that occurred at Woods' home.She will be sentenced next week."
    ]
}