{
    "articleURL": "/sport/nfl/article-12040123/Former-Titans-star-Taylor-Lewan-reveals-suing-entities-involved-2020-ACL-surgery.html",
    "content": [
        "Taylor Lewan was released by the Titans organization back in late February He posted a photo of his gear being dropped on his doorstep in garbage bags DailyMail.com provides all the latest international sports news Former Tennessee Titans O-lineman Taylor Lewan has revealed he is suing those involved in the repair of his torn right ACL in October 2020. ",
        "Lewan, who was released by Tennessee in February, shared the news on his podcast, Bussin' With The Boys. 'I am in an unfortunate circumstance where I have had to file a lawsuit against the people and entities that are involved with my surgery from October of 2020,' Lewan said.'I wanted to take this opportunity on this podcast to let all of you know what is kind of going on in my life. Fans that have followed my career, seeing those years before the ACL surgery and obviously after the ACL surgery, kind of wondering 'What the hell is happening with Lewan?'' 'Since 2020, it's sucked. It's been tough. I would love to sit here and vent… but the reality is, I just can't right now. When I can I will definitely share more when I'm able to.'",
        "Lewan underwent surgery in the days following the injury which he suffered against AFC South rivals, Houston on October 18, 2020. He spoke on the matter during an October 2022 episode of his podcast with former NFL player, Will Compton. 'When I tore my ACL in October 2020, I was on this f****** mission to get back as fast as possible and do everything I possibly could do right,' Lewan continued.'Last year during the season I had issues. My knee was swelling I was always feeling pain in there and I was like, \"I don't know what the deal is.\"",
        "'It turns out this year, I found out there are things with my knee going on now that are a direct correlation to what happened when I got my knee done [in 2020].",
        "'So, I have to go and get my knee fixed to be able to play football or to live a normal life just in general. There is not a whole lot I can go into for reasons I can’t talk about right now.'Lewan played in just two games last season, tearing the ACL in his right knee once more. The former Pro Bowl left tackle went viral in March following his departure from Tennessee after the team dropped off his belongings in garbage bags following his release.Despite outrage on social media, Lewan soon clarified that he wasn't upset and claimed those who felt that way were 'overreacting.'Lewan is yet to make a decision on his NFL future -- whether to retire or seek a 10th season in the league."
    ]
}