{
    "articleURL": "/wires/pa/article-12051059/Malik-Tillman-loan-ended-injury-Michael-Beale-hints-permanent-move.html",
    "content": [
        "Malik Tillman’s loan spell at Rangers has ended through injury as boss Michael Beale revealed Alfredo Morelos and Ryan Kent have not been offered new deals.",
        "The 20-year-old attacking midfielder joined the Ibrox club on loan from German giants Bayern Munich last summer with the cinch Premiership outfit having the first option to buy with the fee reported to be around £5million.Tillman had to come off in last week’s Scottish Cup semi-final defeat by Celtic at Hampden Park which effectively ended hopes of silverware, with the hamstring injury which rules him out of the last five fixtures.Ahead of the cinch Premiership game against Aberdeen at Ibrox on Sunday, Beale said: “Unfortunately that is the end of Malik’s season.“He has got a hamstring injury, he has gone back to Bayern for them to have a look at him as well.“He has had his scan. It is a hugely sad ending to the season for him because he is obviously a fine young player and he has performed well for the club so far this season.",
        "“That (talk of permanent deal) is all still on-going in the background as well.“Me and Malik are in a great place on a personal level.“He’s been brilliant for the club and I think brilliant for me in my time here.“He’s a player I think has a really high ceiling – as high as anyone I’ve worked with in my time here at Rangers.",
        "“There’s areas of his game that at 20 years old he certainly has to brush up on but that’s why he’s come on loan.“We said we’d park the conversation until the middle of May because there’s a lot around it. We want to get to end of the season.“And Malik has got a say in this as well. Obviously the two clubs have been talking back and forth and there’s agreements between them.“But the most important person is Malik. If Malik wants to be here in Glasgow then it’s something we can make happen.“Likewise if he’s unsure…“We’d said we’d park the conversation until the middle of May and nothing has changed on that.”After the Hoops defeat Beale promised the “biggest rebuild in years” and gave a strong hint that striker Morelos and Kent, both out of contract in the summer, would depart the club.The former QPR boss said: “They have been two fantastic players for the club.“We haven’t come forward with a contract offer, both have been free to speak to other clubs for a while now.“But in terms of the next five games they are Rangers players and they will continue to be so until anything announced officially.”"
    ]
}