{
    "articleURL": "/wires/aap/article-12045141/Rio-Tinto-paints-bright-future-energy-transition.html",
    "content": [
        "Rio Tinto has a critical role to play in enabling the global energy transition by supplying essential minerals for the renewable technologies needed, the mining giant's shareholders have been told.",
        "Addressing the group's annual general meeting in Perth on Thursday, board chair Dominic Barton said the future of the company was \"looking bright\" as it marked 150 years of operation.Having emerged from a challenging period, Rio Tinto had laid the foundations to become \"the global mining company of choice\", he said.The energy transition and the drive to net zero, coupled with a renewed focus on security of supply, provided further opportunities for Rio Tinto, Mr Barton said.He said if the world was to meet the Paris climate accord goals it would need 700 billion tonnes of copper over the next 20 years, while by 2050 windpower capacity would have to increase eightfold.\"To put that into perspective, one wind turbine of three megawatts requires 300 tonnes of steel, five tonnes of copper, three tonnes of aluminium and two tonnes of rare earths.\"Mr Barton said electric vehicles and battery storage would raise lithium demand more than 40 times by 2040 while 20 times more cobalt and nickel would be needed.\"So we have a critical role to play in enabling this energy transition, supplying essential minerals ... all of which are vital for the transition to a low-carbon economy.\"Mr Barton said Rio Tinto delivered strong financial results in 2022 with the momentum continuing into 2023.",
        "It declared total dividends of $US8 billion ($A12 billion) to shareholders last year, \"our second-largest ordinary dividend in our 150-year history\" and paid $US10.8 billion in taxes and royalties.\"Building trust with our key stakeholders and strengthening our social licence was also a key focus of 2022,\" Mr Barton said.\"While it's for others to judge our progress on those points, I'm proud of some recent achievements, particularly agreements reached with Indigenous peoples.\"Mr Barton said the industry was at an \"inflection point\" with balanced decision-making required to meet the needs of the energy transition and continued global growth.\"How do we fulfil our role in the energy transition in a way that is socially and environmentally responsible and yet sufficiently commercial to attract the investment required?\"Mr Barton said he believed Rio Tinto was up to the challenge to reduce its own emissions by 50 per cent by 2030 and to meet a net-zero target by 2050.In response to a question from the floor he said the company supported the proposed voice to parliament but was not telling its employees which way to vote in the referendum later this year.Chief executive Jakob Stausholm said the company had underlying earnings of $US13.3 billion last year and a return on capital employed of 25 per cent.",
        "Profit after tax attributable to Rio Tinto shareholders was $US12.4 billion and balance sheets remained strong with net debt of $US4.2 billion.Mr Stausholm said 2022 was the fourth consecutive fatality-free year for the company but it continued to strengthen its safety culture.Rio Tinto was also changing the way it partnered with communities, especially with Indigenous peoples, he said.\"Moving to a model of co-management of country and improving our agreements will deliver more enduring socio-economic heritage and environmental outcomes and in turn greater certainty for mine development.\"Mr Stausholm said a highlight was creating with local Aboriginal people the Juukan Gorge Legacy Foundation as part of the remedy to the destruction by Rio Tinto of rock shelters in the gorge in May 2020.\"But we know it will be a long journey to rebuild trust.\""
    ]
}