{
    "articleURL": "/news/article-12056955/Who-Mauricio-Garcia-know-far-Texas-mall-shooter.html",
    "content": [
        "Mauricio Garcia, 33, shot dead eight people before being gunned down himselfChildren were among those killed outside Allen Premium Outlets in Dallas on Saturday, May 6, during the massacre. The victims' names have been releasedREAD MORE: Texas mall massacre gunman Garcia 'had neo-Nazi beliefs' At least eight people died and multiple others were injured after a gunman opened fire at a mall in Allen, Texas on Saturday, May 6, 2023.",
        "Police confirmed that the gunman - named as 33-year-old Mauricio Garcia - was killed on the scene by a police officer following his massacre. But they are still investigating what his motive was.It has since transpired that Garcia allegedly had neo-Nazi and white supremacist beliefs, and had planned his bloodbath for weeks beforehand. Here is what we know so far about the mall shooting and the killer Garcia.",
        "What happened at Allen Premium Outlets?Around 3.30pm on May 6, 2023, multiple rounds of gunfire erupted at Allen Premium Outlets in Allen, Texas. The outdoor mall has more than 120 stores - and it was a busy Saturday afternoon.A video showed a man, who is now named as Mauricio Garcia, getting out of a silver car in the parking lot before opening fire on innocent passersby and shoppers.As gunshots were heard, many scrambled away from the scene and others dropped to the ground with serious or fatal wounds. Eight people died during the shooting.Six of these died at the scene, including the gunman, who was killed by a cop.Two other people were rushed to hospital, but succumbed to their injuries and died. ",
        "How many victims were there?Eight people died following the shooting in Allen, Texas.The gunman also died at the scene after being neutralized by a police officer.",
        "But there were multiple others who were rushed to hospital with injuries after the gunman opened fire.Significantly, some of the victims were children.A spokesman for Medical City Healthcare said the injured ranged in age from 5 to 61.Korean family Cindy Cho, 35, her husband Kyu, 37, and son James, 3, were all shot dead following the rampage in Allen, Texas.Two sisters Daniela Mendoza, 10, and eight-year-old Sofia were also victims in the massacre. Engineer Aishwarya Thatikonda, 27, and Christian LaCour, 20, who worked as a security guard at the mall, were also killed in the massacre.The final victim's name was confirmed as Elio Cumana-Rivas, 32, from Dallas. ",
        "Who is the gunman?The gunman's identity was revealed as Mauricio Garcia.He was a 33-year-old, living in Dallas, Texas.  Authorities believe he was acting alone when he opened fire at the mall.He worked as a security guard, and had scoped out the scene of his crime to track when it would be busiest three weeks before the bloodbath. A social media account linked to Mauricio Garcia, 33, is littered with photos of Nazis, guns and ammunition as well as extremist rants about Jews, women and racial minorities, according to Bellingcat researcher.Another post appears to show the receipt for the guns and ammunition he bought in 2020, which he ultimately used to carry out the shootings. ",
        "Other photos include a bulletproof vest that appears to match the one described by witnesses to the shooting, which is emblazoned with an acronym for 'Right Wing Death Squad' - a popular meme among far-right extremist groups. Posts also show a series of shirtless pictures with white power tattoos on his body, including SS Lightning Bolts and a swastika. Police and the FBI have raided the home in Dallas where his parents.He drove a gray Charger, which was seen at the scene, and also was often parked outside his parents' home address. Investigators now believe he may have been a white supremacist or neo-Nazi, who followed extremists ideologies. According to the Washington Post, Garcia wore a patch on his chest which may have alluded to his ideologies - although no formal motive has been released. ",
        "What has President Biden said? In a statement, Joe Biden said: 'Eight Americans — including children — were killed yesterday in the latest act of gun violence to devastate our nation. Jill and I are praying for their families and for others critically injured, and we are grateful to the first responders who acted quickly and courageously to save lives. 'Yesterday, an assailant in tactical gear armed with an AR-15 style assault weapon gunned down innocent people in a shopping mall, and not for the first time. Such an attack is too shocking to be so familiar. And yet, American communities have suffered roughly 200 mass shootings already this year, according to leading counts. More than 14,000 of our fellow citizens have lost their lives, credible estimates show. The leading cause of death for American kids is gun violence. ",
        "'Since I signed the Bipartisan Safer Communities Act into law and took two dozen executive actions to stem the tide of gun violence, we have made some progress. States are banning assault weapons, expanding red flag laws and more — but it’s not enough. We need more action, faster to save lives.'Too many families have empty chairs at their dinner tables. Republican Members of Congress cannot continue to meet this epidemic with a shrug. Tweeted thoughts and prayers are not enough.'Once again I ask Congress to send me a bill banning assault weapons and high-capacity magazines. Enacting universal background checks. Requiring safe storage. Ending immunity for gun manufacturers. I will sign it immediately. We need nothing less to keep our streets safe.'",
        "What did witnesses see?Multiple witnesses and survivors have come forward to detail their experience.  A mother-of-two who survived the Dallas mall shooting has revealed a hero store worker sacrificed her life to save a dozen shoppers who she hid inside a closet.Racquel Lee was one of thousands present at Allen Premium Outlets Saturday when 33-year-old gunman Mauricio Garcia shot dead eight victims.She began her impromptu shopping trip by pulling up to the same H&amp;M store where Garcia would arrive in his own car moments later and open fire. Lee said it 'sounded like a warzone' as frantic shoppers started fleeing from the hail of bullets.",
        "In the chaos that ensued, the unnamed store associate gathered a frantic Lee and 12 others, including several children, and hid them inside the store's bathroom closet. The worker then left the group, and Lee hours later was escorted out by police.On her way out, Lee recalled realizing that among the mass of 'bullets and bodies' outside, was the same store worker that hid her barely an hour before.'The store associate saved our lives,' Lee tearfully told CBS News Texas Sunday, ultimately cutting the interview short after becoming too emotional.'I was crouching down, like, \"I hope we don't get hit by a bullet,\"' the near-victim added of when the gunfire began.'Earlier in the interview, Lee explained how she parked her White SUV in front of the H&amp;M where the gunman was seen arriving and opening fire on a group that included children.Lee said that immediately, even inside the store, she and other shoppers recognized they were gun shots and ran for cover.'The gunshots – it sounded like a warzone,' she recalled. 'It was horrifying and it felt like you were in a dream.'",
        "Fontayne Payton, 35, was at H&amp;M when he heard the sound of gunshots through his headphones. He said: 'It was so loud, it sounded like it was right outside.",
        "'I pray it wasn't kids, but it looked like kids,' he said. The bodies were covered in white towels, slumped over bags on the ground. 'It broke me when I walked out to see that.'Payton then saw the body of the dead shooter - which was the only one not covered, he recalled. Another witness, Kimberly Blakey, said she and her daughter, 14, were among the crowd of people rushing to flee the parking lot after the gunfire started.She said the raining bullets were 'non-stop.' Her car got shot at during the ordeal as she tried to escape. Blakey told CNN: 'I told my daughter to get down. I could hear her start praying.' Another witness, Sheliza Ramlall, who was in the Nike store when the violence broke out, said: 'I had the most horrifying experience earlier. I was standing in line at the Nike store when all of a sudden people started to scream and run. ",
        "'The people in the doorway saw the man with the gun outside and raised the alarm. All of us in line dropped to the floor and started to crawl looking for a hiding place while falling over each other. 'I crawled behind the counter. At that moment, I realized that we were right in plain sight and and figured that I needed to get away from the front. 'As I looked to the back of the store, I heard someone saying ‘get to the back, get to the back’ and everyone started running at that point. An employee opened the back door and let us out. We are standing by the roadside shaken, crying, and hugging each other.'Not knowing where the gunman was or what was happening on the other side was terrifying but I wanted to get out of there so I left the crowd and started to flag the cars down to give me a lift. 'An elderly woman stopped and I hopped in a panic. She started to tell me about the gunshots she heard and drove me to my car. I raced out of there with an elevated heartbeat. 'I am grateful for our brave first responders who stopped the shooter and helped the people to safety.'"
    ]
}