{
    "articleURL": "/wires/reuters/article-12045295/BMW-cars-segment-sees-earnings-boost-higher-pricing-EV-sales.html",
    "content": [
        "By Victoria Waldersee",
        "BERLIN, May 4 (Reuters) - BMW reported a higher earnings margin for its cars segment on Thursday, with a rise to 12.1% in the first quarter from 8.9% a year earlier, but kept its outlook unchanged in the face of ongoing high costs and rising competition.The German carmaker attributed a drop in group earnings before tax to 5.1 billion euros ($5.65 billion) from 12.2 billion last year to the impact of last year's full consolidation of its Chinese joint venture, BMW Brilliance Automotive.\"The geopolitical and macroeconomic situation remains unpredictable and tense. Inflation and interest rates in key markets are high. The same applies to material and commodity prices,\" BMW Chief Financial Officer Nicolas Peter said.Sales were down 1.9% in Europe and 6.6% in China, attributed to inflation and the after-effects of the coronavirus pandemic - but an upward trend was visible in March and April, BMW said.It continues to expect slight growth in Europe, robust sales in the United States, and a stabilising economy in China.Daniel Roeska of Bernstein Research wrote in a note that markets may question why BMW had not raised its outlook in light of the cars margin being well above the 2023 forecast of 8-10%.\"BMW has a reputation for guiding extremely conservatively ... the top question for most investors, as with peer Mercedes-Benz, will be whether a guidance raise needs to occur some time later this year,\" Roeska said.",
        "Mercedes-Benz, which last week beat quarterly earnings forecasts, said it now expected to hit the higher end of its cars margin forecast of 12-14% but did not raise it.BMW's financing and leasing business suffered in line with that of other carmakers like Porsche under persistently high interest rates and price increases, with the volume of new business dropping 14% and earnings down 6.2%. (Reporting by Victoria Waldersee; Editing by Maria Sheahan and Alexander Smith)"
    ]
}