{
    "articleURL": "/news/article-12052071/Blind-army-veteran-66-says-kicked-pub-having-guide-dog-him.html",
    "content": [
        "John Hardy, 66, and labrador stopped for a drink at the Tynte Arms, SomersetA blind army veteran claims he was left 'humiliated, belittled and dehumanised' after being kicked out of a pub for having his guide dog with him.",
        "John Hardy, 66, said he stopped in for a drink at the Tynte Arms in Somerset with his seven-year-old labrador Sidney when he was immediately ordered to leave because the pub did not allow dogs.And after the veteran explained that the animal was a guide dog, he claims he was told that the pub was closed.  Mr Hardy, from Bridgwater, Somerset, says he left and used special software on his phone to try and call his son Dominic to collect him. He claims that the man who ordered him out - thought to be the landlord - then approached him again and said: 'Oh, you can read that then'.The veteran, who served as an army medic in Northern Ireland and the first Gulf War, said: 'It's humiliating and belittling. I was treated like not even a second class citizen, like not even a human being, it's horrible.'If I'd gone in the pub drunk or rowdy and they'd refused to serve me, fine. If I'd gone in with just an ordinary dog not a guide dog and they say we can't have animals then I'd accept that but Sidney is how I get around.",
        "'It left me with this pent-up anger and frustration inside, that just churns you up. I'm a veteran and I'm quite used to a battle and I'm not going to let somebody turn me away when I have a right to be there.'",
        "After leaving the army, Mr Hardy continued to work as a nurse until 2014 when a retinal artery occlusion - a blockage of blood to the retina - caused sudden sight loss in one eye, followed by the other.He was paired with guide dog Sidney six years ago who he credits with giving him the confidence to do everyday things others take for granted.Mr Hardy said: 'I am totally dependent on Sid for getting around. I do manage with a white stick but I'm a lot slower and more limited. Sid gives me confidence that I'm going to get around and he keeps me safe.'",
        "Hospitality businesses are required under the Equality Act 2010 to make reasonable adjustments to not put people with disabilities at a disadvantage, with guide dogs classed as one such adjustment.When MailOnline contacted the Tynte Arms about the incident last Friday, a spokesman claimed they had been closed at the time and had accidentally left the front door open - despite the pub's website saying they are open all day - but declined to give any further details.It is not the first time Mr Hardy claims he has been denied service because of his guide dog.Earlier this year he successfully sued Indian restaurant Bengal Spice in Somerset for £2,000 after he couldn't come in with dog Sidney because it would be 'unhygienic'.",
        "Speaking about whether he plans to pursue similar legal action against the pub, Mr Hardy said: 'I just want him to follow his responsibilities under the law. He has a responsibility to treat everybody equally.'You can't discriminate against somebody if they're a person of colour or because of their gender or sexuality and they shouldn't be discriminating against people with a disability.'"
    ]
}