{
    "articleURL": "/wires/reuters/article-12048767/DoorDash-rides-delivery-demand-raise-2023-core-profit-forecast.html",
    "content": [
        "Company says consumer engagement remains very strong",
        "Raises 2023 adjusted EBITDA and gross order value forecastsBeats quarterly revenue estimates(Adds analyst comment in paragraph 8, details from earnings call in paragraph 6, updates shares in paragraph 2)By Granth VanaikMay 4 (Reuters) - DoorDash Inc raised its annual core profit forecast after beating quarterly revenue expectations on Thursday, benefiting from an increase in orders for food, groceries and convenience products despite stubbornly high inflation.The food delivery company's shares rose 4% in extended trading.DoorDash and its competitors such as UberEats have gained from a pandemic-driven trend of consumers ordering from the comfort of their homes that has continued to thrive as the companies offer deals and free deliveries with membership passes.DoorDash now projects annual adjusted EBITDA, a measure of profitability, between $600 million and $900 million, compared to its previous outlook range of $500 million to $800 million.As part of its cost-saving initiatives, the firm in November decided to cut about 1,250 jobs, or 6% of its total workforce.\"Consumer engagement and spending on the platform continues to be very strong,\" said finance chief Ravi Inukonda, adding \"(customer) retention this past quarter is higher than the prior quarter.\"In the first quarter, total orders surged 27% to 512 million from the prior year.",
        "\"We believe (total order volumes in Q1 2023) reflects continued market share gains by DoorDash across categories,\" Northcoast Research analyst Jim Sanderson said.DoorDash now expects gross order value, a key industry metric which is a total value of all app orders and subscription fees, to be between $63 billion and $64.5 billion for 2023, compared to previous forecast of $60 billion to $63 billion.On Tuesday, Uber Technologies said it expected \"strong growth\" in its food delivery unit over the next few quarters.DoorDash's revenue rose 40% to $2.04 billion in the quarter ended March 31, compared to analysts' estimate of about $1.93 billion.Net loss attributable to DoorDash narrowed to $161 million, or 41 cents per share, from $167 million, or 48 cents, a year earlier. (Reporting by Granth Vanaik in Bengaluru; Editing by Maju Samuel)"
    ]
}