{
    "articleURL": "/wires/pa/article-12056681/MK-Dons-boss-Mark-Jackson-says-relegation-heartbreaking.html",
    "content": [
        "MK Dons head coach Mark Jackson said it was “heartbreaking” to experience relegation from Sky Bet League One.",
        "His side threw everything at hosts Burton but could not grab a winner in a tense final day contest that finished 0-0, meaning his side were relegated.Jackson said: “It’s really raw and emotional right now. Heartbreaking. Words can’t describe how we feel and how we feel for the supporters and the club.”Dons dominated but were kept out by a resilient Burton defence and also the woodwork, substitute Dawson Devoy going closest with a shot that cannoned back off the post.Jackson continued: “We knew we had to come here and win the game. From minute one we went after the game, created opportunities and chances.“They (Burton) had to defend for their lives and make blocks on the line. We took the game to them and the only thing we couldn’t do today was put the ball in the back of the net.”",
        "Jackson’s team only lost two of their final eight games but six draws in that run ultimately cost them dearly in a season of fine margins at the bottom of the table.The Dons boss reflected: “There is a lot of work to do and take stock of. Reflection is a big part of football.“There were crucial moments over that run, drawing at Cheltenham and at home to Barnsley last week but we knew we had to come here today and win to secure our survival and the boys left everything out on the pitch.",
        "“They did everything we asked of them. You can look at today’s game but we are in the position we are in not due to one game but over the whole of the season.”Burton boss Dino Maamria was relieved that his side had been safe with three games to go and reflected on a big turnaround that saw the Brewers remain in League One for another season.“It has been an unbelievable six months,” Maamria said. “We have stuck together as a group and as a club. It has been a massive turnaround.”Maamria saw his side have a big influence on relegation in the final week of the season and had some sympathies with Jackson’s side.He explained: “It has been a tough two games against Cambridge and MK Dons this week. Both well-run clubs and we have had to show honest performances in both games.“I felt we deserved to beat Cambridge on Wednesday but I thought MK Dons were very unlucky today. We defended really well, led by John Brayford who was immense again.Burton at one point had looked certainties to be relegated themselves but Maamria’s transformation means they can look ahead to next season with optimism.He added: “We are always in games now. Teams have to work really hard to beat us now.",
        "“That comes from the confidence we have put into the players and all the hard work we have done with them. We have a big rebuilding job now for next season.”"
    ]
}