{
    "articleURL": "/tvshowbiz/article-12057891/Ciara-showcases-toned-frame-cleavage-revealing-ensembles.html",
    "content": [
        "Ciara turned up the heat on Instagram with 10 photos she shared after doing a 'natural' makeup tutorial with her makeup artist over FaceTime.",
        "The 37-year-old looked incredibly sexy in three different barely there outfits while showing off her makeup skills.She captioned the post: 'Y’all Yoli @yolandafrederick gave me a natural makeup look tutorial over FaceTime:) Sometimes I get nervous with doing my makeup. How did I do?'In the snaps, the Level Up singer looked busty, sultry and ready for sex, showing off plenty of cleavage, smoldering eyes and a perfect pout.In the first look, the Body Party songstress - who took two of her three kids to Coachella last month - wore a baby blue bikini top that appeared to be fashioned out of a towel and showed plenty of cleavage.",
        "She appeared to have a towel of the same color wrapped around her lower half.The mom of three's long black hair was down and straight with blunt bangs.Her makeup was natural and fresh faced, as she intended. The wife of Russell Wilson layered several gold necklaces.In the second outfit, the Like a Boy hitmaker wore a white t-shirt with a black and white image of a mouth sucking on a lollipop on the front. She added a collar-style necklace in black and gold with her name spelled out in gold. In the final look, Ciara wore a pair of silky black pajamas featuring a cropped top with a plunging v-neck that tied just below her breasts and long sleeves.",
        "The Da Girls singer paired the top with a pair of silky black shorts.She wore the same layered gold necklaces and the Ciara collar and added stacks of gold bangles to each wrist.  ",
        "In one closeup, she playfully winked and stuck her tongue out. In another snap she made a kiss face.The singer also shared a closeup of her necklaces revealing one that had her three children's names on it.She shares son Future, who will be 9 on May 19, with her ex, rapper Future and daughter Sienna, 6, and son Win, 2, with husband Russell Wilson.The final photo in the series was a look at the products and makeup brushes she used to achieve her natural look. "
    ]
}