{
    "articleURL": "/wires/reuters/article-12058087/Promising-moon-Oslo-falls-short-bold-climate-pledges.html",
    "content": [
        "Oslo missed 2016 target to halve emissions by 2020",
        "UN urges all to 'walk the talk' and set realistic goalsNorth European cities ranked as environmental leadersBy Alister DoyleOSLO, May 8 (Thomson Reuters Foundation) - Oslo's 2016 goal to combat climate change was as radical as it was unprecedented: to halve greenhouse gas emissions within four years.Having called its plan \"demanding yet achievable\", Oslo won global plaudits as a model for bold urban action and went on to be crowned the European Green Capital of 2019, a prestigious annual award from the European Commission.Without doubt, the Norwegian capital of almost 700,000 people has made huge strides in electrifying public transport, restricting diesel and petrol cars, and building parks and dozens of kilometres of cycle lanes.Yet Oslo has fallen well short of its 2016 target - to halve emissions from 1990 levels by 2020 - according to interviews with officials and researchers and data analysed by Context.A newer goal - cutting emissions by 95% from 2009 levels by 2030 - is similarly now in jeopardy.Oslo is far from unique. Some of Europe's other leading green cities are struggling to fulfil similar high ambitions, and have revised or dropped climate targets in recent years.With more than half the world´s population now living in urban areas, concerns are growing about cities' climate policies, including net-zero pledges, with analysts pointing to a lack of monitoring and scrutiny compared to pledges made by governments and businesses.",
        "\"In 2016 I thought: 'I will eat my hat if they (Oslo) achieve that goal',\" said Borgar Aamaas, a senior researcher at CICERO, the Center for International Climate Research in Oslo.In response to questions, the city council said it could not evaluate its performance against the 2016 target because government agencies had upgraded their methodologies for tracking greenhouse gases, which it said meant statistics from before 2009 were unreliable.Oslo's emissions totalled 1.1 million tonnes in 2020 under the new accounting method, about 10% below the 1.2 million tonnes in 1990 that was calculated through the former system.The goal under the 2016 plan had been to halve emissions to 600,000 tonnes by 2020.According to the new data, emissions in 2020 were 25% below a peak of 1.5 million tonnes in 2009, the first year calculated under the updated measurements, the council said.That leaves Oslo far off its former target of a 50% cut, though it is still considered a top environmental performer overall.The jury for the European Green Capital award placed the city top in eight of 12 categories when it won in 2019, including local transport, air quality and biodiversity.Oslo is \"doing an amazing job\" by the standards of any major capital, said Stig Schjølset of Norwegian environmental group Zero, praising the city's policies such as having emissions-free building sites which use electric diggers and cranes.",
        "\"But the targets (Oslo) set are extremely ambitious,\" Schjølset said, adding that the city was \"doomed to fail if you compare them to their ambition\".BALANCE OF REALISM AND AMBITIONThe United Nations has warned cities against promising the moon on climate change, urging a balance of realism and ambition.In a 2022 climate action report, U.N. Secretary-General António Guterres said every business, investor, city, state and region must urgently \"walk the talk on their net-zero promises\".\"We cannot afford slow movers, fake movers or any form of greenwashing,\" he said in the report by a U.N. expert group. Cities are responsible for more than 70% of emissions, making them a vital part of efforts to combat global warming, he said.An analysis by research consortium Net Zero Tracker released last November found that of the 241 cities it identified as having net-zero pledges, more than half had no reporting mechanism via which to track those goals and report progress.Northern European cities are on the leading edge of the green push, studies have found, with the environment often a priority for citizens.For example, Oslo topped a 2022 sustainability ranking of 100 cities in 47 countries by Dutch engineering firm Arcadis - ahead of Stockholm, Tokyo, Copenhagen and Berlin.Sirin Hellvin Stav, Oslo's vice mayor for environment and transport and a member of the Green Party, said the city's 2016 goals were set in line with the 2015 Paris Agreement, which aims to limit global warming to 1.5 degrees Celsius above pre-industrial levels.",
        "However, in doing so, she said, the Norwegian government \"has not been either ambitious enough or honest enough\".\"We have done our bit to follow up the Paris Agreement, but we are totally dependent that Norway at the national level does its part to help councils and counties,\" Stav added.She noted that, in its 2016 plan, Oslo's city council said a condition for halving emissions was quick government investment to capture carbon dioxide at the capital's waste incineration plant, which accounts for 17% of the city's emissions.The then centre-right government did not comply, but a new centre-left government last year promised to help fund the 9 billion crown ($840 million) project. It is set to start in 2027 at the earliest.Among its green successes, Oslo will this year become the first capital city with an emissions-free public transport system, Stav said.Oslo also has hefty congestion charges for fossil-fuel vehicles, in a nation where 79% of new cars sold in 2022 were fully battery-powered - a global high share.STOCKHOLM'S SUCCESS, COPENHAGEN'S CHALLENGEAmong other European Green Capitals, Stockholm, the inaugural winner in 2010, is on track to meet a goal of cutting emissions to 1.5 tonnes per capita by 2030, down from 5.4 in 1990, said Björn Hugosson, the city's chief climate officer.",
        "Emissions in Hamburg, the 2011 winner, fell about 36% from 1990 levels by 2020, slightly short of its goal of 40%. It now aims to cut emissions by 70% by 2030, city officials said.Meanwhile, Copenhagen, the victor in 2014, had planned to be the world´s first carbon neutral city by 2025, but dropped that target last year after a municipal waste plant failed to win state funding for capturing carbon dioxide.The C40 group - a network of mayors of almost 100 major cities including Los Angeles, Mumbai and Shanghai, all seeking green policies - said 75% of C40 cities are decreasing per capita emissions faster than their respective national governments.Worried about pie-in-the-sky pledges, however, C40 is tightening its standards to demand that each member has to remain in 2024 \"on track to deliver its climate action plan, contributing to increased resilience, equitable outcomes and halving C40's overall emissions by 2030\".In Oslo's case, the newer target to reduce its emissions by 95% by 2030 from 2009 levels means it would have to emit under 75,000 tonnes annually by the end of the decade.However, the city's climate budget suggests it is unlikely to meet a 52% interim reduction goal set for 2023. The latest available data - for 2021 - shows that Oslo emitted 1 million tonnes of emissions, a 30% cut from 2009 levels.",
        "\"Emissions will fall quite substantially, but 95% is a very impressive number,\" said Aamaas of CICERO, adding that the left-wing city council's 2030 goal - as with its 2016 target - relied on unrealistic assumptions of funding from the national government, and new technologies such as carbon capture.Having joked about eating his hat if Oslo achieved the 2016 target, Aamaas said he would go one step further if the 2030 goal was met.\"I will eat my bunad (Norwegian national costume) hat if they manage it,\" he said. (Reporting by Alister Doyle; Editing by Kieran Guilbert and Laurie Goering. The Thomson Reuters Foundation is the charitable arm of Thomson Reuters. Visit https://www.context.news/)"
    ]
}