{
    "articleURL": "/news/article-12052199/White-House-swallow-short-term-debt-ceiling-extension.html",
    "content": [
        "The White House is considering a short-term extension to lift the debt ceiling, CNBC reported Friday Sources characterized the move as a 'last resort' or a 'fallback' to prevent the country from going into a devastating default The president ripped 'MAGA' Republicans at a meeting Friday, calling them out for creating a 'manufactured crisis'  The White House is considering a short-term extension to lift the debt ceiling so negotations between the Biden administration and Congressional Republicans won't throw the country off a fiscal cliff. ",
        "CNBC reported Friday on the administration's thinking, citing four sources familiar with the matter. They characterized the move as being a 'last resort' or a 'fallback' option as Biden continues to demand that Republicans in Congress send a clean debt ceiling bill to his desk before June 1, when Treasury Secretary Janet Yellen said the U.S. would default on its loans.That's not, however, what the GOP-controlled House of Representatives passed - instead tying lifting the debt ceiling to hefty spending cuts. On Friday, Biden again chided 'MAGA' Republicans for playing chicken with him, telling reporters at his meeting with the Investing in America Cabinet that GOP lawmakers were responsible for creating a 'manufactured crisis.' ",
        "At the meeting, Biden highlighted Friday morning's better-than-expected jobs report. 'Just today they're reporting 250,000 new jobs,' Biden said. 'The last thing this country needs after all we've been through is a manufactured crisis and that's what this is: A manufactured crisis. That's what it is from beginning to end, it's a manufactured crisis driven by MAGA Republicans in the Congress.' The economy added 253,000 jobs in April, according to the Bureau of Labor Statistics. 'Unfortunately, our - now I won't say Republican because I think they're pretty well divided - but the MAGA Republicans in Congress are threatening to undo all this progress by letting us \"default on the debt\" unless we agree to their demands,'  Biden said. ",
        "'The two are totally unrelated,' Biden complained. 'Whether you pay the debt or not, it doesn't have a damn thing to do what your budget is.' Biden blasted the GOP for 'trying to hold the debt hostage' to usher in 'draconian' and 'damaging' cuts. ",
        "He also made a baffling claim about the age of the United States.'They say we're not going to increase the debt that every president's done for the last six million years here,' Biden said. 'Unless you pass our budget we're proposing.' Biden again said: 'We're not a deadbeat nation, we pay our bills.'He told reporters that he knew a lot of them covered foreign policy. 'You know that this is becoming an issue in other countries. What's the United States going to do? Are they really fooling around with not paying their debt?' he mused.Biden has a planned meeting Tuesday with House Speaker Kevin McCarthy, Senate Minority Leader Mitch McConnell, Senate Majority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries. Biden did not take questions at Friday's meeting and thus couldn't confirm the CNBC report on whether a short-term extension was on the table. Instead he teased that he was doing a 'major press conference this afternoon' - in reality meaning a sit-down interview with MSNBC's Stephanie Ruhle. "
    ]
}