{
    "articleURL": "/wires/aap/article-12045795/WA-public-hospitals-transformed-1-2b-spend.html",
    "content": [
        "Western Australia will spend more than a billion dollars to transform public hospital infrastructure across the state, providing more beds and additional services.",
        "The $1.2 billion of state government funding, to be included in May's budget, also provides $99.4 million to improve medical records following the preventable death of Aishwarya Aswath.Premier Mark McGowan said the rollout of the first stage of the electronic medical record system would help health workers provide patients with medical treatment more quickly.\"(It's) about making sure our health professionals more quickly pull up people's records and more quickly access those records and provide services to people in hospital,\" he told reporters on Thursday.The funding will also be used to expand the capacity of WA public hospitals and reduce waiting times.This includes buying and transferring existing services from private hospitals to the public system, improving patient flow and building new infrastructure.\"We're transforming the health system around WA to make sure people have the best opportunities for care in the best environments possible,\" Mr McGowan said.It also includes $75m to build a new surgical centre in Bentley and $81.1m for an extra 60 public hospital beds and three operating rooms at St John of God Public Hospital in Midland.Over $55m will be allocated for medical equipment upgrades and $12.9m will be budgeted for a new CT scanner for Sir Charles Gairdner Hospital.The funding promise also includes an extra $12.7m for the Joondalup Health Campus redevelopment and $6.5m to return privatised services back to the government at Peel Health Campus.",
        "The Albany Health Campus will also be upgraded, along with WA Country Health Service staff accommodation.\"We're rebuilding hospitals around the state - Bunbury, Joondalup, Geraldton, Peel and Laverton and others,\" Mr McGowan said.The funding for stage one of an electronic medical record system follows a coroner's recommendations at the inquest of Aishwarya Aswath.The seven-year-old girl died on Easter Saturday 2021, hours after presenting to the Perth Children's Hospital emergency department with a fever and unusually cold hands.Deputy State Coroner Sarah Linton found Aishwarya could still be alive if not for stretched Perth hospital staff failing to realise the girl was experiencing sepsis.She had been left in a waiting room for more than 90 minutes, despite her parents pleading with staff - who they described as rude and dismissive - to escalate care as her condition deteriorated.Electronic medical records have reduced preventable patient deaths, increased staff productivity and improved patient flow through the emergency department, with reduced unplanned readmissions in other jurisdictions"
    ]
}