{
    "articleURL": "/wires/ap/article-12045037/This-May-Fourth-Carrie-Fisher-gets-Walk-Fame-star.html",
    "content": [
        "LOS ANGELES (AP) - Carrie Fisher received a star on the Hollywood Walk of Fame on Thursday, a May the Fourth tribute to a beloved \"Star Wars\" actor that had a touch of stardust.",
        "The late star´s daughter, Billie Lourd, wearing her mother´s portrait printed on her metallic dress, accepted the star on behalf of Fisher. She threw glitter, her mother's favorite, on the newly unveiled star.\"My mom used to say you weren´t actually famous until you became a Pez dispenser. Well, people eat candy out of her neck every day. I say you aren´t actually famous until you get a star on the Hollywood Walk of Fame,\" she said. \"My mom is a double-whammy - a Pez dispenser and has a star on the Hollywood Walk of Fame now. Mama, you´ve made it.\"Mark Hamill, who played Fisher's space brother, Luke Skywalker, was also on hand, and recalled meeting the young actor when she was just 19.\"She played such a crucial role in my personal and professional life and both would have been far emptier without her. Was she a handful? Was she high-maintenance? No doubt! But everything would have been drabber and less interesting if she hadn´t been the friend that she was,\" Hamill said.Several in the crowd were dressed as characters from the space franchise and C-3P0 and R2-D2 were present for the unveiling. \"Never forget the droids!\" Lourd said on a wet day that gave way to sun.",
        "Fisher - who died in 2016 - joins \"Star Wars\" co-stars Harrison Ford and Hamill on the Hollywood tourist attraction that recognizes luminaries from film, television, music and other entertainment industries. The trio's stars are all located on the 6,800 block of Hollywood Boulevard, near where the original film debuted in 1977.Fisher played Leia Organa, who over six films morphed from a princess to a general leading the forces of good in its fight against oppressive regimes aiming to control a galaxy far, far away.\"No one will ever be as hot or as cool as Princess Leia,\" said Lourd. \"Leia is more than just a character. She´s a feeling. She is strength. She is grace. She is wit. She is femininity at its finest. She knows what she wants and gets it. She doesn´t need anyone to rescue her because she rescures herself and even rescues the rescurers. And no one could have played her like my mother.\"Fans had long campaigned for her to receive a Walk of Fame star. The honor comes on May the Fourth, essentially an official holiday for Star Wars fans that's a play on a line that Fisher said often in the films, \"May the Force be with you.\"Devotees worldwide celebrate with a variety of tributes, while retailers hold special sales on Star Wars merchandise.",
        "Fisher was given the 2,754th star on the Walk of Fame. Ford received his star in 2003 and Hamill was similarly honored in 2018.Walk of Fame stars are given to performers who are nominated and a $75,000 fee is now required to create the star and maintain it.___This story corrects the day of the week to Thursday."
    ]
}