{
    "articleURL": "/tvshowbiz/article-12047155/Anna-Faris-looks-low-key-goes-sightseeing-husband-Venice.html",
    "content": [
        "Anna Faris went for a low-key look as she went sightseeing with her husband Michael Barrett in Venice on Thursday during a day off from filming her new movie. ",
        "The actress, 46, who is currently working on My Spy 2 in the Italian city, shielded her face with a North Face cap and a pair of aviator sunglasses.She slipped into a casual blue boiler suit, nipped in at the waist with a brown leather belt and carried a quilted jacket over her arm. Anna's blonde hair peaked out from beneath her hat and she topped her look off with a pair of black converse.  Michael, 52, also donned a black cap that he teamed with a green T-shirt and dark blue washed jeans. ",
        "He layered a button up shirt over the top and sported a pair of sunglasses as the couple embarked on boat ride along the Grand Canal.  Anna's new film, My Spy 2 is the sequel to 2020's comedy My Spy, which starred Dave Bautista and Chloe Coleman. In February Deadline broke news that Prime Video had reenlisted Bautista, Coleman, Kristen Schaal, and Ken Jeong for the part two.The original movie told the story of JJ (played by Bautista), a CIA operative who crossed paths with Sophie (Coleman), an astute nine-year-old girl.They met after JJ was assigned to monitor Sophie's family.Schaal portrayed the role of Bobbi, JJ's tech specialist colleague, and Jeong played David, his boss.",
        "My Spy was written by Jon Hoeber &amp; Erich Hoeber and directed by Peter Segal.Anna signed with mega-agency CAA, which boasts A-list clients like Tom Hanks, Steven Spielberg, and Reese Witherspoon following a break from acting. ",
        "She has signed with the agency in the past and is putting her trust in them again to further her career after a two-year acting hiatus and a recent flop at the box office with The Estate. Faris starred alongside Allison Janney in the hit CBS sitcom Mom from 2013 to 2020 playing a newly sober single mom trying to get her life back together after moving in with her own mom (Janney). The actress left the series in a shock exit after seven seasons and CBS cancelled the show shortly after, it received poor reviews and has a 29 percent rating on Rotten Tomatoes.Besides her film and television career, she also hosts a successful podcast called Unqualified."
    ]
}