{
    "articleURL": "/tvshowbiz/article-12041455/Im-Celebrity-Star-fans-react-Joe-Swashs-new-hair.html",
    "content": [
        "I'm A Celebrity All Star viewers couldn't resist remarking on Joe Swash and Dean Gaffney's chaning appearances as they returned to the show for a second stint.",
        "Fans were convinced that TV presenter Joe, 41, had changed his hair in the time since his last appearance on the reality show in 2008.Viewers commented that the former EastEnder's mop was 'fuller' and deeper in colour, compared to when he originally appeared on the programme.However it is no surprise Joe and Dean's appearances have changed considering they competed on the show 15 years and 17 years ago respectively.While some fans noted Joe's enhanced head of hair, others claimed that Dean, 45, has 'aged well' and insisted he was looking 'hotter than ever'.",
        "Making light of Joe's new look, one person wrote: 'Whose hair has Joe Swash borrowed? #ImACeleb.'Another noted the altered colour, and said: 'Wait Joe Swash has dyed his hair?'A third penned: 'Blimey. Joe Swash's hair has flourished.'Another said that Joe's hair looked like 'action man's', while one other was convinced that it had 'never looked that full before'. People were perhaps more complementary about Dean, who viewers claimed was aging like a fine wine compared to his original appearance. One said: 'Watching the current series of I'm A Celebrity Get Me Outta Here South Africa and I can't help but think that Dean Gaffney is just getting hotter with age...'Yes please and many times over!'",
        "Another added: 'I don't watch EastEnders but Dean Gaffney has certainly grown into his looks!'",
        "One other person agreed, and said: 'Dean Gaffney has grown into his face, if that makes sense?' On Tuesday night, viewers were in hysterics as they watched newcomers Dean and Joe vomit and splutter gruesome cocktails of animal  innards just minutes after arriving.Former I'm A Celebrity winner Joe, who was voted champion by the public on his first run and Dean, 45, who finished fifth, were tasked with drinking a variety of concoctions made from various parts of animals, insects and vile tasting natural foods in a bid to win treats for each existing member of camp.Dean, who played Robbie Jackson on the BBC soap EastEnders from 1993 to 2003, did not fair well with his Bushtucker Trials during his first time in the jungle, when he screamed and dry heaved his way through the challenges, with not much changing this time.And while Joe - who also was also in EastEnders as Mickey Miller from 2003 to 2008 - forced himself through his I'm A Celeb trials and also tried out many more as the host of former ITV2 spin-off show I'm a Celebrity... Extra Camp, he didn't have an easy ride this week either.The pair were told by hosts Ant McPartlin and Declan Donnelly to stand in front of a table and choose a log to turn over, with Dean first picking the log named 'Helen Fanny-gan', before he was tasked with drinking a glass of blended cow vagina.",
        "Before he had even picked up the glass, a bright red Dean was shuddering and screaming.He tipped half the contents of the glass into his mouth, slopping much of it down his top, before attempting to swallow it, with Dean visibly bringing the drink back up into his mouth and spraying it out onto the table despite having his lips tightly closed.Dean proceeded to vomit much of what he had swallowed onto the table as Joe yelled at him to 'drink it like a shot', while signalling for him to quickly tip the glass back, instructing Dean to: 'Bang it!'The screen star gulped the rest of the glass and managed to keep it down, successfully winning a prize of some lemonade for Helen Flanagan.Joe selected the log named 'Phil Tough-hell' and he was given a glass of blended maggots to consume.Describing it as 'a real thicky' Joe looked repulsed before he picked the glass up and took a gulp before instantly vomiting the grey smoothie back up into the glass, to which Dec observed: 'Oh! It's going back in,' while Dean looked on, crying with laughter, spraying saliva as he was unable to contain his guffaws.A sweaty Joe eventually managed to down the majority of the drink, winning some wine gums for campmate Phil Tufnell.",
        "The pair went on the heave and reach for each of the abundance of specially prepared items, much to the delight of viewers, with many taking to Twitter to comment on the trial. ",
        "'Dean Gaffney and Joe Swash doing a drinking trial together is something I didn’t know I needed,' wrote one viewer.Someone else shared: 'This is absolute sheer gold from Dean Gaffney,' while another person wrote: 'Loving these two together .. but omg this trial is disgusting.'Noting Dean comforted himself by swaying backwards and forwards, someone commented: 'The level of rocking from Dean Gaffney is SEVERE.'While another viewer shared: 'Joe Swash and Dean Gaffney doing a trial together is the BEST, we do not deserve this series of #ImACeleb.''Joe Swash and Dean Gaffney doing a drinking trial is everything I was hoping for and more,' wrote another viewer, while someone else shared: 'I would pay to watch @joeswash and @deangaffney1 on a weekly challenge show we are in hysterics watching @imacelebrity.''Joe Swash drinking these drinks is the best TV I’ve seen so far in 2023,' declared another show fan.While someone else noted: 'Joe Swash has expressed more emotions with his face, in 30 seconds, than I have in 52 years.'And another person wrote: 'Dean Gaffney and Joe Swash are literally the best two people that could’ve entered the jungle right now! Creasing!'",
        "It comes after Amir Khan was voted off I'm A Celebrity...South Africa earlier in the show.The 36-year-old sports star has become the third celebrity to leave the ITV show, after being voted off in a secret ballot.Before announcing the latest departure, Dec told the campmates: 'You all know why we’re here this morning - last night we left you with the news that someone would be leaving camp as a result of a secret ballot...'Amir was then announced as the latest celebrity to leave the camp.The former boxer - who retired from the sport in 2022 - insisted appearing on the show has been one of the 'best experiences' of his life.However, Amir also admitted that he felt ready to leave the camp and return home to his family.He said: 'It was one of the best experiences I’ve ever had. It’s like I got to be with a new family in South Africa. ",
        "'I’m always going to compare it with my first time in Australia but this one, for me, was way better. Great camp, the campmates were amazing.'Even though I would have loved to have stayed in a little bit longer, sometimes what can happen is, if you stay longer, you can outstay your welcome.",
        "'It was just a great experience and I’m just glad I had the opportunity.'"
    ]
}