{
    "articleURL": "/wires/ap/article-12038469/No-cancer-risk-nuclear-bases-far-Air-Force-says.html",
    "content": [
        "WASHINGTON (AP) - A review of a Montana nuclear missile base where an unusual number of troops have been diagnosed with blood cancer has found no current risk factors that could explain it, the Air Force says.",
        "The service has been investigating the issue since reports surfaced in January of at least nine missileers who had served at Malmstrom Air Force Base who were diagnosed with non-Hodgkin lymphoma. In the months since, more than 30 cancer cases at Malmstrom and the nation's other nuclear missile facilities, including F.E. Warren Air Force Base in Wyoming, Minot Air Force Base in North Dakota and Vandenberg Air Force Base in California have come to light.But the medical review found that \"overall, there were no factors identified that would be considered immediate concerns for acute cancer risks,\" the Air Force´s 711th Human Performance Wing said in a report obtained by the Associated Press.\"Additionally, there was nothing specifically noted at Malmstrom´s main base or operational missile sites that would indicate a specific reason for increased cancer,\" the report said.The findings by the Air Force - which do not mean it will stop investigating the issue - are bringing both frustration and renewed grief to the families whose service members are fighting cancer, or have already died.But some also hope a spotlight on the issue will at least result in the Air Force carrying out a full cancer study of all the men and women who have worked with the nation's nuclear warheads, and hopefully an easier path to medical care.",
        "Rhonda Wesolowski´s son Air Force Capt. Jason Jenness was a senior missile launch officer in the 1990s with the now-deactivated 564th missile squadron at Malmstrom. He died from non-Hodgkin lymphoma in 2001 at the age of 31.Even back then, his mother says, she was concerned his cancer had to do with his service, \"and his friends were concerned, because there were rumors.\" But when she reached out to the Air Force, \"I got a form letter,\" she said. To her, the letter left her feeling that the cancers were \"being swept under the rug.\"Her son, Jason Jenness, died five months after his diagnosis.\"I knew it was too big. Too big a fight,\" she said of trying to push the Air Force to figure out why her son and other missileers were getting sick. \"I still think its too big a fight. I´m very happy that there´s some spotlight being put on it, because then it will make people more aware, and kids who are going into the service may ask more questions, and it may help in that regard.\"Jeff Fawcett Jr.´s father also served with 564th missile squadron at Malmstrom, from 1988 to 1992. He died in 2016 at Walter Reed Army Medical Center of acute lymphoblastic leukemia and and chronic myelomonocytic leukemia, both types of blood cancers. He was 56.",
        "Jeff Fawcett Sr. served for 25 years - and if he was alive now, \"would never be able to bring himself to the conclusion\" that his missileer service might have been connected to his cancer, his son said. \"He loved the military,\" Fawcett Jr. said.But the son is hoping the Air Force will do more to look for possible causes. Because the elder Fawcett served a 20-year military career, he received lifetime military medical care. Walter Reed doctors said his six-month battle could have cost more than $1 million if the family had to go through a private hospital and insurance, Fawcett Jr. said.\"His care didn´t bankrupt my family,\" the son said. \"But what if you´re a young lieutenant who did four years and got out, and 15 years later you have an awful blood cancer and you are paying God knows how much?\"Missileers are young military officers who monitor, operate and stand ready to fire the nation's nuclear warheads - sitting alert in underground launch control centers for shifts that can last from 24 to 48 hours.But both the launch control centers and the missile silos they oversee were built more than 60 years ago. In the decades since, as the facilities have aged, former and current missileers have worried about asbestos in the hardened facilities, about ventilation of the air they have breathed from old duct systems while underground, about the water they have drunk and emissions from equipment they used.",
        "The review did make recommendations to address some of those concerns, including that the Air Force consider a deep clean of each launch control center, that it clearly mark safe boundaries for radio frequency sources, and to cease the practice of burning classified documents while locked inside the launch control center.The Air Force is committed to continuing to investigate the issue and will conduct an epidemiological study of cancers within the missile community, the service said.To conduct the initial review, the Air Force sent medical teams to Malmstrom, to F.E. Warren and to Minot from Feb. 27 to March 7 to talk to crews and assess each facility.Dean Shockley was a young enlisted man at Malmstrom serving in the base's 341st maintenance group, where he worked on the missile silos from 1987 to 1989 - the same time frame that Fawcett Sr. was an officer there. In 2022, also at the age of 56, Shockley was diagnosed with an inoperable glioblastoma, a brain tumor.Shockley, like most enlisted members, did not serve a full 20-year military career. He left after five years of military service.It took his wife Garlanda Shockley \"a month of constant calls daily, several times a day\" to get the Department of Veterans Affairs to cover some of the medical costs, she said. Their insurance to date has covered most of the rest. But the potential that the coverage could stop, and the costs that would create, weighs on her.",
        "\"I have so much to worry about, I would like to know that he is cared for,\" Garlanda Shockley said."
    ]
}