{
    "articleURL": "/news/article-12055465/California-panel-approves-reparations-proposal-life-long-black-residents-1-2million.html",
    "content": [
        "California’s reparations task force approved recommendations which could give black residents $1.2million each as compensation for slavery and discrimination But activists believe it is 'nowhere near enough' and demanded $200million as some called it a 'further injustice' and others called for direct cash paymentsPrevious calculations from economists predicted the reparations could cost around $800billion- more than twice California’s $300 billion annual budgetCalifornia’s reparations task force has approved recommendations which could give black residents $1.2million each as compensation for slavery and discrimination.",
        "The nine-member committee voted Saturday to approve proposals on how the state can compensate and apologize for generations of harm caused by discriminatory policies. A black resident in California who has lived in the state their whole life until the age of 71 could receive more than $1.2million in compensation, if the recommendations are forged into law. But residents who attended the official meeting in Oakland hit out at the estimated costs of reparations, which some believe it is 'nowhere near enough,' demanding $200million direct cash payments to individuals instead.California became the first state to form a reparations task force in September 2020 following national protests over the death of George Floyd who was killed by a white Minneapolis Police officer.",
        "Its final report is to be sent to lawmakers before July 1 where it will forecast compensation estimates calculated by several economists the group is working with.The amount these reparations would cost the state were not outlined in the report but previous calculations from economists predicted it could cost around $800billion- more than twice California’s approximate $300 billion annual budget.The report suggests that the amounts, based on what has been lost to specific types of racial discrimination, should be paid back to black residents.This includes $2,352 lost per person per year for the over-policing and mass incarceration of black communities and $3,366 per person per year of residence between 1933 and 1977 for 'discriminatory lending and zoning'.",
        "And $13,619 per person per year of residence in California for 'injustices and discrimination in health' and $77,000 per person for black-owned business losses and devaluations is included in the figure. This means a lifelong black California resident aged at least 71 could receive more than $1.2million in compensation. But the 100 residents and activists who gathered at the meeting were not impressed with the calculations in the report.Reverend Tony Pierce aired his frustration and pointed to the country's 'broken promise' to offer 40 acres and a mule to newly freed slaves.He said: 'You know that the numbers should be equivocal to what an acre was back then. We were given 40, OK? We were given 40 acres. 'You know what that number is. You keep trying to talk about now, yet you research back to slavery and you say nothing about slavery, nothing.'So, the equivocal number from the 1860s for 40 acres to today is $200 million for each and every African-American.'He then hit out at the panel for not being ambitious enough with the reparations plan.'You're not supposed to be afraid,' he added. 'You're just supposed to tell the truth. You're not supposed to be the gatekeepers. You're supposed to say what the people want and hear from the people.'",
        "While one woman said: '$1.2million is nowhere near enough. It should be starting at least $5million like San Francisco.'We want direct cash payments just like how the stimulus [checks] were sent out. It's our inheritance, and we can handle it.'And another resident added: 'This million dollars we're hearing on the news is just inadequate and a further injustice if that's what this task force is going to recommend for Black Americans for 400-plus years and continuing of slavery and injustice that we have been forced to endure.'To even throw a million dollars at us is just an injustice.'And Elaine Brown, former Black Panther Party chairwoman, urged people to express their frustrations through demonstrations.The report insisted the figures are just estimates and that lawmakers would have to conduct additional research to work out the specifics.Panel members recommended direct payments for those eligible in the report.‘The initial down payment is the beginning of a process of addressing historical injustices not the end of it,’ it read.The reparations task force has also asked for those eligible to receive cash 'down payments' as soon as any recommendations are forged into law while they wait for the amount of compensation they are entitled to is calculated.The task force, made up of elected officials, academics and lawyers, decided on the eligibility criteria last year.",
        "It determined that any descendant of enslaved African Americans or of a ‘free Black person living in the United States prior to the end of the 19th century’ should be entitled to reparations.If legislation is passed for the payments, the committee suggested that a state agency be created to process claims and make payments with elderly black residents being the priority.Around 1.8 million people in California identify as black or African American. ",
        "While voting on its final report, the panel also recommended that state legislators formally apologize to its black residents.A preliminary report published last year highlighted how enslaved black people were sent to California during the Gold Rush era.And in the 1950s and 60s racially restrictive covenants and redlining segregated them in many of California's largest cities.A point of confusion in the discourse on reparations has been whether the amount the task force recommends will be a literal suggestion to the Legislature or rather a broader estimation of losses incurred by black people due to decades of inequality.'We want to make sure that this is presented out in a way that does not reinforce the preoccupation with a dollar figure, which is the least important piece of this,' Cheryl Grills, a member of the state task force, previously told CalMatters.",
        "'It's important, but it's the least important in terms of being able to get to a point in our country's history and in California's history where we recognize that the harm cuts across multiple areas and domains and that the repair needs to align with that.'It's really unfortunate. I'm actually sad to see that our news media is not able to nuance better. It's almost like, \"What's going to be sensational\" as opposed to what's important,' she said.But during a task force meeting in March, state Sen. Steven Bradford said it would be an 'uphill fight' to get the Legislature to pass any recommendations. Kamilah Moore, a reparatory justice scholar and an attorney, chaired the task force and previously stated she plans to be as 'radical as possible' when it comes to deciding who will receive reparations and how much.  "
    ]
}