{
    "articleURL": "/wires/reuters/article-12056037/Mets-battle-consistency-continues-meeting-Rockies.html",
    "content": [
        "Buck Showalter used a track and field analogy to describe how the New York Mets' offense should optimally operate.",
        "But the Mets are having a hard time getting out of the starting blocks lately.The Mets will look to snap an extended slump Sunday afternoon, when they host the Colorado Rockies in the rubber match of a three-game series.Left-hander Joey Lucchesi (1-0, 3.86 ERA) is expected to start on three days rest for the Mets against Rockies right-hander Ryan Feltner (2-2, 4.45).The Mets' offensive struggles continued Saturday afternoon, when Rockies starter Austin Gomber and two relievers combined on a seven-hitter in Colorado's 5-2 win.The Mets had just one extra-base hit Saturday, when RBI groundouts by Pete Alonso and Francisco Lindor produced their lone runs. New York has scored a total of just four runs in its last four games and has been outscored 66-40 in going 3-10 since April 22.Overall this season, the Mets are tied for seventh in the National League in runs with 144. But they're just five runs ahead of the 13th-place Rockies.In addition, the Mets have been shut out six times after being blanked eight times in 2022 -- when they finished tied for third in the NL with 772 runs scored. That was a 136-run improvement from 2021, when New York finished ahead of just the Miami Marlins and Pittsburgh Pirates.",
        "\"Guys are pushing, sometimes to a fault -- you can want something too much,\" Showalter said. \"When we're at our best, we're kind of passing the baton and grinding at-bats and making them work for everything.\"The last 11 games have been encouraging for the Rockies, who own the second-worst record and second-worst run differential in the NL. Colorado is 7-4 since April 24, a span in which it has outscored the opposition 53-41.The Rockies are hitting .273 and have posted a 3.62 ERA over the last 11 games. They opened the season by hitting .245 and recording a 5.57 ERA over the first 23 games.Colorado also played error-free baseball Saturday for the sixth straight game. The Rockies' 21 errors this season were tied for third most in the NL entering Saturday.\"We have to keep going, we can't stop -- we need right-hander Ryan Feltner to pitch a good game on Sunday,\" Rockies manager Bud Black said. \"The defense is a component that has shown up the last couple of weeks. If you do that (and) you pitch, you are going to be in games.\"Lucchesi didn't factor into the decision in his most recent start Wednesday, when he gave up four runs over four innings as the Mets fell to the Detroit Tigers, 6-5, in the first game of a doubleheader. The 29-year-old threw just 46 pitches before Showalter pulled him with an eye on starting him Sunday.",
        "Feltner didn't factor into the decision Tuesday, when he allowed two runs over 5 1/3 innings in the Rockies' 3-2 win over the Milwaukee Brewers.Lucchesi is 2-4 with a 4.47 ERA in 11 career starts against the Rockies. Feltner lost his lone start and appearance against the Mets last Aug. 25 when he surrendered three runs over 4 2/3 innings as Colorado fell 3-1 in New York.--Field Level Media"
    ]
}