{
    "articleURL": "/news/article-12039189/Decision-Hunter-Biden-charged-close-prosecutors-close-in.html",
    "content": [
        "Prosecutors are nearing a decision on whether to charge Hunter BidenCharges will be related to his taxes and his attempt to purchase a gun U.S. Attorney David Weiss has been investigating Hunter for four years Prosecutors are nearing a decision on whether to charge Hunter Biden on violations related to his taxes and his attempt to purchase a gun, according to a new report Wednesday.",
        "U.S. Attorney David Weiss of Delaware, a Donald Trump appointee tasked with leading the Hunter probe, is nearing the end of process, the Washington Post reported, citing sources familiar. Hunter Biden's attorneys met with Weiss at Justice Department headquarters in Washington D.C. last week in a sign that things are wrapping up. There is no timetable for any final decision from Weiss, who has been investigating President Joe Biden's son for four years. Republicans have used the probe to paint the Biden family as corrupt. There have been no charges against President Biden. Hunter Biden says he's not guilty. ",
        "Weiss and his federal prosecutors are weighing four charges against Hunter, three related to tax crimes and a felony charge related to a gun purchase.The possible charges are two misdemeanor counts for failure to file taxes, a single felony count of tax evasion related to a business expense for one year of taxes, and the gun charge, also a potential felony.Prosecutors are examining whether Hunter paid adequate taxes on millions of dollars of his income, including money he made from multiple overseas business ventures. And, when purchasing a .38 caliber gun in 2018, Hunter wrote on the Firearm Transaction Record that he did not use unlawful drugs, but admitted in his memoir that he was a crack addict at the time. Intentionally providing misleading information while making a gun purchase is a felony.",
        "Hunter Biden filled out a federal form related to the purchase in which he allegedly answered 'no' to the question whether he was 'an unlawful user of, or addicted to, marijuana or any depressant, stimulant, narcotic drug, or any other controlled substance?'",
        "Such cases are called 'lying and buying.'Additionally, Hunter borrowed $2 million from his lawyer and confidant Kevin Morris to pay the IRS for back taxes, penalties and liens that he owed, according to reports. The Hunter Biden probe began in 2018 during the Trump presidency. The former president used Hunter Biden as a rallying cry for his base in his unsuccessful 2020 re-election campaign.The initial investigation focused on Hunter Biden's finances related to his overseas business ventures. Over time, it focused on whether or not he reported all of his income and whether he lied on gun purchase paperwork in 2018.House Republicans are also investigating Hunter Biden and his businesses. The first son is fighting GOP attempts to garner his communications with intelligence agencies, travel and financial records since the time President Biden served as vice president.House Oversight Chairman James Comer, a Republican congressman from Kentucky, said: 'The Committee is investigating President Biden's knowledge of and role in these foreign business deals to assess whether he has compromised our national security at the expense of the American people.' ",
        "A federal indictment of Hunter Biden could shut the GOP investigation down. In the Justice Department probe, there have been reports of frustration inside the FBI because the bulk of its investigative work was finished last year while the IRS finished its tax investigation more than a year ago. But prosecutors make the decisions on when and if to charge and the Hunter Biden investigation is fraught with political landmines.Any decision by Weiss will be used by Republicans, who have sought to tie Hunter's troubles to his father. ",
        "Biden announced last week he will seek another term in the White House, meaning, if charges are filed, his son Hunter could be on trial during his re-election campaign.Questions about Hunter Biden's business dealings - particularly his overseas work in the Ukraine and China - have dogged Biden's presidential campaigns.Attorney General Merrick Garland left Weiss - a holdover from the Trump administration - in charge of the case, gave him complete authority to run the investigation, and to make the final decision on filing charges. Garland was asked at a news conference about the status of the investigation: 'I stand by my testimony, and I refer you to the U.S. attorney for the District of Delaware, who is in charge of this case and capable of making any decisions that he feels are appropriate.' ",
        "Hunter Biden has gotten more aggressive in his response to the probes, engaging a new legal team to fight back led by lawyer Abbe Lowell.The first son also has been appearing in public more. He joined President Biden on a trip to Northern Ireland and the Republican of Ireland last month.Meanwhile, Hunter Biden was in court in Arkansas this week on a judge's orders in an ongoing case between him and the mother of a 4-year-old child that they had together. Hunter Biden's lawyers have been trying to lower childcare payments that they say for years have been $20,000 per month. The judge ordered Hunter to produce more financial documents to back his claim that he should be allowed to reduce the amount he gives Lunden Roberts each month. Roberts, 32, and Biden, 53, came face to face for the first time since she gave birth to his daughter, Navy Joan, now four. "
    ]
}