{
    "articleURL": "/wires/reuters/article-12058797/Rare-earths-producer-Lynas-Malaysian-licence-extended-January.html",
    "content": [
        "License extended amid concern about global supply",
        "Lynas shares jump 12% to two-month highLynas to continue legal review of conditions(Adds Malaysian government comment)May 8 (Reuters) - Australia's Lynas Rare Earths Ltd said on Monday its operating license in Malaysia to import and process rare earths is now valid until Jan. 1 next year, but added it will continue to seek legal review of conditions that threaten its permit.Malaysia's Science, Technology and Innovation Minister Chang Lih Kang said the six-month extension was allowed after taking into account the potential impact of a processing halt on the global supply of rare earths, essential for making magnets used in products from cars to missiles.Shares of the world's biggest rare earths producer outside of China shot up 12% to close at a two-month high on Monday, making Lynas the top gainer on the ASX 200 benchmark index .Lynas' Malaysian unit will now be allowed to import and process lanthanide concentrate until Jan. 1, by when it will need to fulfil certain conditions to continue import of rare earths, including having a cracking and leaching plant outside Malaysia.\"The licence variation allows the Lynas Malaysia cracking and leaching plant to continue to operate until Jan. 1, 2024 and will remove the requirement for a shutdown at the Lynas Malaysia plant prior to Jan. 1, 2024,\" the rare earths producer said.",
        "Lynas added that it would continue to seek review of certain conditions to ensure that it was \"treated fairly and equitably as a foreign direct investor\".Malaysia's government has raised concerns about radiation levels from the process of cracking and leaching at the plant, but Lynas noted that two International Atomic Energy Agency reviews had found the plant to be low-risk and compliant with all relevant regulations.Minister Chang said in a statement he had rejected a request by Lynas to drop four conditions imposed as part of its operating license.\"As such, effective Jan. 1, 2024, Lynas must ensure that its cracking and leaching plant abroad is operational and Lynas will no longer be allowed to import raw materials containing natural radioactive elements to Malaysia,\" Chang said.With the Malaysian plant now operational until Jan. 1, analysts at Citi expect the rare earths miner to maintain its recent production output for the remainder of calendar 2023, they said in a note. (Reporting by Sameer Manekar in Bengaluru and Rozanna Latiff in Kuala Lumpur; Editing by Sandra Maler, Uttaresh Venkateshwaran and Sonali Paul)"
    ]
}