{
    "articleURL": "/money/comment/article-12057273/RUTH-SUNDERLAND-green-money.html",
    "content": [
        "ESG investment has become a multi-trillion-pound crazeMost of us would rather not invest in companies harming the worldBut there are no standard ESG kitemarksESG investment – for the uninitiated, deploying your money in line with environmental, social and governance principles – has become a multi-trillion-pound craze.Its standard bearers are billionaire titans of Wall Street such as Larry Fink, the boss of BlackRock, the world's biggest fund manager. Sometimes it is forgotten that the King was a pioneer in the field.Forty years ago, long before it was fashionable, His Majesty became Royal founding patron of Business in the Community (BITC), a charity devoted to nudging firms to help build a fairer, greener world.BITC is still going today, and is marking the Coronation by urging bosses to encourage their staff into volunteering.When the then Prince Charles first took up the cause of responsible business, it was seen as a well-meaning, but rather batty, fringe activity. Four decades on, ESG has evolved into a huge, fast growing – and controversial – industry in its own right, at the heart of the City and Wall Street.",
        "In the US, it has become a flashpoint in the culture wars. Some Republicans are leading a backlash against ESG investing and so-called 'woke capitalism,' particularly in oil states such as Texas.The politicisation of ESG has even dragged in Mickey Mouse. Entertainment giant Disney, which is due to report its results this week, is locked in bitter conflict with Ron DeSantis, Florida's governor and a possible contender for the White House.De Santis took on Disney after its bosses attacked legislation to ban schools from teaching young children about sexual orientation and gender identity – known as the 'Don't Say Gay' law to its opponents.Some states are blacklisting firms that are seen as anti-fossil fuel from running their retirement funds. As the biggest player in the ESG market, this has put BlackRock and Larry Fink in the firing line.The irony of an arch-capitalist like Fink being pilloried, not for being too rich, but too green, is exquisite. Not least because BlackRock still invests in fossil fuels.The fact that the Republicans, the party of free markets, are trying to remove states' liberty to invest along ESG lines is also quite odd.So far, Fink and co are winning. BlackRock lost around $4billion in assets under management due to the backlash. But that barely made a dent in the $230billion the firm took in from US clients last year.Green investment opportunities abound in the UK, Europe and the US, where President Biden's Inflation Reduction Act is pouring billions into environmentally friendly projects. So Wall Street is doing what it does best: following the money.Which takes us to another critique of ESG: that it is little more than a cynical marketing exercise, by which investment firms can extract higher fees from gullible investors.At best, under this reading, much ESG investment is virtue signalling, that does little to help the planet's problems. Worse, it might cause harm, by creating the illusion that private sector investors can solve problems that only governments can tackle.These questions go to the heart of what companies are for: pure profit, or a deeper purpose? Most of us would rather not invest in companies harming the world. But there are no standard ESG kitemarks. Ratings tend to assess the risk ESG poses to a company's profits and reputation, not the danger the company presents to the planet.Business, as the King recognised, can be a powerful force for good. But as the ESG industry matures, savers need clarity and protection against the greenwashers.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}