{
    "articleURL": "/wires/reuters/article-12043503/Soccer-Juve-second-2-1-win-Lecce.html",
    "content": [
        "TURIN, May 3 (Reuters) - Juventus regained second place in Serie A with goals from midfielder Leandro Paredes and striker Dusan Vlahovic, giving them a 2-1 win over Lecce on Wednesday.",
        "Juve have 63 points from 33 games, putting pressure on third-placed Lazio, on 61 points, to respond against Sassuolo later on Wednesday.\"It doesn´t matter if we are against Atalanta, (AC) Milan, Lecce or Cremonese, the important thing is to get a certain number of points. I think if you don´t get 72 or 73 points, you are unlikely to finish in the top four,\" Juve manager Massimiliano Allegri told DAZN.Lecce, 16th in the standings, thought they had taken the lead after three minutes through Assan Ceesay, but his effort was ruled out for offside after a lengthy VAR review.It took 15 minutes before Paredes gave the hosts the lead with a well-placed free-kick from outside the box that found a gap in the Lecce wall and slipped into the lower left corner.Lecce equalised in the 37th minute through Ceesay, who converted from the spot after Danilo gave away a penalty for handball. Vlahovic restored Juve's lead three minutes later with a left-foot half-volley from the edge of the box.Juve had an opportunity to increase their lead in the 63rd minute when Danilo reached Paredes' corner ahead of his marker but the Brazilian defender's header hit the post.Ceesay almost drew the visitors level near the end of the match when he was unmarked at close range and sent a header towards the goal. However, the effort and the following rebound were saved by Juve goalkeeper Wojciech Szczesny.",
        "\"Lecce are a tough side to play against, they have caused problems for a lot of opponents and we risked conceding an equaliser,\" Allegri said. \"We allowed too much in defence, even from non-existent situations, and we have to improve.\"Meanwhile, Atalanta secured a 3-2 win at home against Spezia with goals by Marten de Roon, Davide Zappacosta and Luis Muriel. The Bergamo side moved up to fourth in the standings on 58 points. (Reporting by Tommy Lund in Gdansk Editing by Christian Radnedge)"
    ]
}