{
    "articleURL": "/femail/article-12051327/What-Queens-ring-Camilla-anointed-public-view.html",
    "content": [
        "Queen Camilla will be anointed with holy oil without being hidden by canopy - unlike her husband King CharlesFor all the latest Royal news, pictures and video click here How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Queen Camilla is being anointed in full public view and presented with a ring which 'marries' her as consort to the King in today's Coronation ceremony.",
        "The Queen Consort will be consecrated with holy oil without being hidden under a canopy, in contrast to the late Queen Mother's coronation. The King, as is custom, will be shielded during his sacred anointing.As details were revealed of the coronation liturgy, Lambeth Palace described the role played by a key element in the ceremony - the Queen's Ring.An octagonal mixed-cut ruby surrounded by 14 diamonds, it bears the symbolism of a ring exchanged in marriage.A spokesman for the office of the Archbishop of Canterbury said: 'It signifies covenant and agreement, an unbroken bond, without end.",
        "'It 'marries' Consort to King, and them both to God in duty and to the people in loving service, and in turn acts as an assurance of God's unfailing love.'Lambeth Palace said the uncovered anointing symbolises Camilla's role as a consort rather than a reigning monarch.But it marks a change from the coronation of the last Queen consort - Queen Elizabeth the Queen Mother - in 1937 who was anointed under a canopy.The Lambeth Palace spokesman said: 'The only distinction this time is that there won't be anything that will obscure the view.'The Palace said that, in comparison to the King: 'This anointing will happen without a screen or canopy to demonstrate the different nature of anointing a consort compared to a reigning sovereign, as this anointing is at the permission of the sovereign.'",
        "Archbishop Justin Welby, writing in the official coronation souvenir programme, said Charles will swap his 'robes of status and honour' for a simple white shirt for the private anointing during the May 6 ceremony.Camilla is wearing a Robe of State, decorated with the King's favourite flowers, delphiniums, and lily of the valley, a favourite bloom of the late Queen Elizabeth II. He wrote that the historic occasion will be one of 'magnificence and pomp' but also, in the midst of the ceremony, one of 'stillness and simplicity' when the King is anointed with holy oil in private under a canopy, in the most sacred part of the coronation.Elizabeth II was also anointed in private as per tradition. The new King will be concealed behind a new 2.6-metre high, three-sided, embroidered screen as he is anointed, to ensure the privacy of the moment.",
        "God of compassion and mercywhose Son was sent not to be served but to serve,give grace that I may find in thy service perfect freedomand in that freedom knowledge of thy truth.Grant that I may be a blessing to all thy children, of every faith and conviction,that together we may discover the ways of gentlenessand be led into the paths of peace. through Jesus Christ our Lord.Amen.",
        "Buckingham Palace described the new approach for Camilla's anointing as 'just one of a number of ways in which the service has been adapted, evolved, simplified without losing any of its magic and majesty'. A 14-year-old chorister will also play a key role in proceedings. As part of the theme, 'Called to Serve', Samuel Strachan will welcome the new monarch in the name of the 'King of Kings' - a reference to Jesus Christ.And, for the first time in British history, the Coronation will feature members of different faith groups, with leaders from the Jewish, Hindu, Sikh, Muslim and Buddhist communities set to deliver a greeting to the King.The Archbishop of Canterbury described the service as 'foremost an act of Christian worship' but said new elements reflected the 'diversity of our contemporary society'. New ground has been broken in other areas, from the inclusion of female Bishops the first time, to the use of Welsh, Scottish Gaelic and Irish Gaelic languages and the opportunity for those watching around the globe to join in and pay homage to the King. While Justin Welby will anoint and crown King Charles, various other faith leaders will greet the King in unison, which the new monarch will acknowledge.A Greek Choir has also been invited to sing a psalm during the service to pay tribute to the King's late father, Prince Philip.",
        "In another significant first, the King will become the first monarch to pray aloud in front of a coronation congregation, reading out a prayer written especially for him, in a 'powerful' new addition to the service. Charles, 74, will speak the words directly to 14-year-old Samuel, the longest-serving chorister of the choir of the Chapel Royal, St James's Palace.The teenager will welcome the King and Charles will reply: 'In his name, and after his example, I come not to be served, but to serve.' Millions around the world have also been asked to speak aloud, with another new addition to the proceedings involving people swearing allegiance to the King.In many ways, the event will be in keeping with tradition. For one, Camilla's ring - made for Queen Adelaide in 1831 - will be presented to her.However, as with other regalia, the Queen will acknowledge it before it is placed back on the altar, in contrast to the Queen Mother, who had it placed on the fourth finger of her right hand and wore it for the rest of the ceremony.The King will not wear the Sovereign's Ring either, as is the usual custom.This ring - a large sapphire and diamond cluster with baguette-cut rubies in the form of a cross, made for William IV in 1831 - is known as the Wedding Ring of England and it marries the monarch to God in duty and to the people in service.",
        "Camilla will only touch the Queen Consort's Rod with Dove - controversial as it is made from ivory - as well as the gold Queen Consort's Sceptre with Cross, rather than holding them like the Queen Mother. In 1937, Queen Elizabeth, later the Queen Mother, was presented with the sceptre in her right hand and the ivory rod in her left.Camilla instead will acknowledge the historic items by touching them, Buckingham Palace said."
    ]
}