{
    "articleURL": "/wires/ap/article-12057505/Lakers-Heat-surging-series-defensive-superiority.html",
    "content": [
        "EL SEGUNDO, Calif. (AP) - The NBA just completed its highest-scoring regular season in 53 years, its teams scoring 282,127 points while a record 20 players made at least 200 3-pointers.",
        "And now two low-seeded playoff teams are surging toward the conference finals with dominant defense.The Lakers and the Heat are widely considered to be two of the best defensive teams in a league that has rarely been more offense-oriented, and both veteran-led groups turned in sterling defensive performances to take 2-1 series leads in the second round.Miami hosts the Knicks and Los Angeles hosts the Warriors on Monday night with a chance to seize control of both series largely because they´ve been better defensively.\"We're playing the way we envisioned the Lakers to play,\" LeBron James said. \"No matter what goes on, we hang our hats on our defense.\"Eighth-seeded Miami held New York to 86 points while winning Game 3 on Saturday, and the seventh-seeded Lakers held Golden State under 100 points for only the fifth time all season in a 30-point blowout win. The victories didn't decide either series, but they clearly showed the direction both winners want to go - and how they want to get there.",
        "The Lakers´ opponents are shooting an NBA-low 41.3% in the postseason, and they give most of the credit to Anthony Davis. The big man has blocked a whopping 37 shots in LA's nine playoff games while altering countless others and playing with the defensive fire of his best NBA seasons, including the Lakers' 2020 championship run in the bubble.",
        "\"The biggest thing for me is for us to come out with a mindset to just defend,\" Lakers coach Darvin Ham said Sunday after practice. \"Everything that happens offensively, that's more who has it going, which actions are working. I'm not worried about how we're going to score as long as we're on point defensively, starting with (Davis).\"The Heat went to work late Sunday morning to watch film, before players scattered their separate ways for some semblance of an off day. And there were tons of options: some were going to the Formula 1 race in Miami Gardens, others were making the trip north to Sunrise to watch the Tampa Bay Lightning host Game 3 of their NHL playoff series.\"The guys all understand that we have to get a rest, get off your feet,\" Heat coach Erik Spoelstra said. \"They´re not going to be standing around, doing that kind of stuff, but I also don´t want them just obsessing about the game (Monday). We have to rest up, recover, let your mind kind of wander to other things. ... It´s a fun time right now in South Florida. It really is.\"For Miami, Jimmy Butler - even with his right ankle at less than 100% - is on a tear like only one other player in Heat playoff history.",
        "He´s scored at least 25 points in all seven of his appearances in this postseason. That´s the second-longest such streak in Heat history; James had 15 games of at least 25 points on the way to his first championship in 2012.\"He´s on his run right now,\" Heat center Bam Adebayo said. \"He´s playing at an all-time high.\"He´s shooting 56% so far in these playoffs, 60% from 2-point range. But as far as \"at an all-time high,\" Butler would disagree, sort of.\"I think if you´d have watched me at Tomball High School, you would say that I was way better than I am now because I was very, very dominant then,\" Butler said. \"I´m comfortable. I´m confident. I work extremely hard at my craft and I´m very grateful to be able to play for an organization and a city like Miami.\"KNICKS AT HEATMiami leads 2-1. Game 4, 7:30 p.m. EDT, Monday, TNT- NEED TO KNOW: New York shot 34% on Saturday, its second-worst effort of the season, and regressed from going 16 for 40 on 3s in Game 2 to 8 for 40 in Game 3. On the plus side, it can´t get much worse. On the other side, Miami didn´t exactly sizzle offensively in Game 3 either - 39% from the field, 22% from 3-point range.",
        "- KEEP AN EYE ON: Julius Randle. A game-high 14 rebounds in Game 3 was a good thing, but he shot only 4 of 15 from the field and missed all five of his 3-point tries. He shot 30% in his playoff debut in 2021, is shooting just under 35% in this year´s playoffs, and clearly needs to do more on the offensive end.- INJURY WATCH: Butler made it through Game 3 with his ankle, which still needs treatment. Knicks point guard Jalen Brunson is toughing out an ankle problem, and his backup, Immanuel Quickley, turned an ankle midway through the fourth quarter of Game 3. Quickley is \"day to day,\" coach Tom Thibodeau said.- PRESSURE IS ON: Miami. The Heat have to expect that New York will be better offensively in Game 4, and all the Knicks have to do to reclaim the home-court edge is simply win one game. Miami can´t let the momentum pendulum swing back New York´s way now.WARRIORS AT LAKERSLos Angeles leads 2-1. Game 4, 10 p.m. EDT, Monday, TNT- NEED TO KNOW: The Lakers are unbeaten in their downtown arena since March, going 7-0 with four playoff wins and a play-in victory. They've won 10 of 11 at home overall as part of their overall 16-5 surge since St. Patrick's Day.",
        "- KEEP AN EYE ON: The whistles. The Lakers have shot 83 free throws in the series to the Warriors' 39, which isn't really a surprise given these teams' sharply contrasting offensive styles. Yet the Warriors and their fans are crying foul over the officials' decisions - even though Golden State was called for 22 fouls to the Lakers' 21 in Game 3 - and the momentum could shift if Golden State gets to the line more or limits the Lakers' free throws.- INJURY WATCH: Neither team is significantly limited by injuries, and Davis' continued good health is the Lakers' greatest asset. After missing big chunks of the past three seasons, he's close to full strength - even if Lakers fans hold their collective breath each time he takes one of his many awkward falls to the court.- PRESSURE IS ON: Golden State. They've rallied from a 3-1 series deficit only once in their playoff history, beating Oklahoma City in the 2016 Western Conference finals - right before that 73-win team infamously blew a 3-1 series lead to James' Cleveland Cavaliers in the NBA Finals.___AP Basketball Writer Tim Reynolds contributed.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}