{
    "articleURL": "/wires/ap/article-12052609/Medicaid-expansion-new-moms-wins-approval-Missouri.html",
    "content": [
        "JEFFERSON CITY, Mo. (AP) - Lower-income new mothers could gain a full year of Medicaid health-care coverage in Missouri under legislation given final approval Friday as part of a national push to improve maternal health.",
        "The legislation, which now goes to Gov. Mike Parson, would add Missouri to a growing list of Republican-led states that have previously balked at Medicaid expansions but which are now joining Democratic states in providing 12 months of coverage - instead of the typical 60 days - after women give birth.\"If we want healthy babies, we have to have healthy mammas - and that is so important,\" said Republican state Sen. Elaine Gannon, one of the sponsors of the Missouri legislation.The option for longer Medicaid coverage was made possible under a pandemic relief law signed by President Joe Biden in 2021. About two-thirds of states already have implemented 12 months of postpartum care, according to the Kaiser Family Foundation.The Alaska Legislature on Friday passed legislation extending postpartum Medicaid coverage for new mothers from 60 days to 12 months.\"Postpartum health issues occur far beyond 60 days, and I am pleased the Legislature passed this long overdue bill,\" Alaska Republican Gov. Mike Dunleavy said in a statement.Some Republican-led states didn't act upon the Medicaid expansion until after the U.S. Supreme Court used a Mississippi case last June to overturn a constitutional right to abortion. When Mississippi Gov. Tate Reeves, a Republican, signed legislation in March expanding postpartum Medicaid coverage, he described it as part of a \"new pro-life agenda\" to help mothers now that abortion access is restricted.",
        "When signing a similar bill in March, Republican Gov. Mark Gordon of Wyoming also described it as a \"signature piece of pro-life legislation.\"In Missouri, where abortion is banned except in certain medical emergencies, Senate President Pro Tem Caleb Rowden opened this year's session by saying he wanted broaden the definition of \"pro-life\" policies - citing longer postpartum Medicaid coverage as one example.When the Senate initially passed the legislation earlier this year, conservative Republicans attached a provision intended to exclude women who get elective abortions. But that was stripped from the final version after other lawmakers raised concerns that an anti-abortion provision could jeopardize needed approval from the federal Centers for Medicare &amp; Medicaid.Missouri has the nation's seventh highest maternal mortality rate, according to the state Department of Health and Senior Services. A department report released last year found that an average of 61 Missouri women died while pregnant or within one year of their pregnancy during 2017-2019, and about three-fourths of those deaths were preventable. The report also found that Black women were more than three times as likely to die of pregnancy-related causes as white women."
    ]
}