{
    "articleURL": "/wires/ap/article-12045047/Ban-social-media-kids-Fed-parents-Senate-say-yes.html",
    "content": [
        "WASHINGTON (AP) - Sen. Katie Britt says she hears about it constantly when she is at home in Alabama - at school track meets, basketball tournaments and on her regular morning walks with friends. And when she was running for the Senate last year, Britt says, \"parent after parent\" came up to her wanting to discuss the way social media was harming their kids.",
        "Britt also navigates the issue in her own home, as the mother of a 13-year-old and a 14-year-old.\"Enough is enough,\" says Britt, a Republican who last week introduced bipartisan legislation with three other senators - all parents of young children and teenagers - to try to better protect children online. \"The time to act is now.\"Connecticut Sen. Chris Murphy, too, deals with it firsthand as a father to an 11-year-old and a 14-year-old. Murphy says he´s seen the upsides to social media, like connection during the coronavirus pandemic and silly videos that bring them joy. But he´s also seen the downsides, including children he knows who he says have ventured into dark corners of the online world.\"I just feel like we´ve reached this point where doing nothing is not an option,\" says Murphy, a Democrat. \"And increasingly, when members of Congress go home, this is one of the first or second issues that they´re hearing about from their constituents.\"Legislation introduced by Britt and Murphy, along with Sens. Brian Schatz, D-Hawaii, and Tom Cotton, R-Ark., aims to prohibit all children under the age of 13 from using social media and would require permission from a guardian for users under 18 to create an account. While it is one of several proposals in Congress seeking to make the internet safer for children and teens, the four senators said in a joint interview with The Associated Press that they believe they are representative of millions of American parents who are gravely worried that social media companies are largely unchecked in what they can serve up to their children.",
        "\"The idea that an algorithm has some sort of First Amendment right to get into your kid´s brain is preposterous,\" says Schatz, who initially brought the bipartisan group of four together. \"And the idea that a 13-year-old has some First Amendment right to have an algorithm shove upsetting content down their throat is also preposterous.\"Along with the age restrictions, the legislation would prohibit social media companies from using algorithms to recommend content to users under 18. It would also require the companies to try and verify the ages of users, based on the latest technology.The bipartisan bill comes at a time when there is increasing appetite in Congress for regulating social media companies - and as those companies have for years eluded stricter regulation in Washington. Some states like Utah and Arkansas have enacted their own laws, creating an even bigger challenge on the federal level.This time, the four senators said they believe there is an unusual bipartisan momentum around the issue as parents grapple with a burgeoning post-pandemic mental health crisis among young people. Recent data from the Centers for Disease Control and Prevention, for example, showed that 60% of teen girls reported feelings of persistent sadness or hopelessness, and 30% said they seriously considered attempting suicide.",
        "\"This is an issue that unites parents all across the country, no matter what their political views on other matters might be,\" Cotton said.Still, any legislation proposing to regulate technology and social media companies faces major challenges, and not only because of the companies´ deep pockets. While the European Union has enacted much stricter privacy and safety protections online, Congress has so far been unable to agree on a way to regulate the behemoth industry. Past legislation has failed amid disagreements about overregulation and civil liberties.And despite the widespread bipartisan interest in taking action, it remains to be seen if any legislation could successfully move through the Democratic-majority Senate and the Republican-controlled House. The two parties have various and sometimes conflicting priorities over what should be done about tech companies.Senate Majority Leader Chuck Schumer, D-N.Y., said Tuesday that \"I believe we need some kind of child protections\" online, but did not specify legislation.A separate bill on child safety by Sens. Richard Blumenthal, D-Conn., and Marsha Blackburn, R-Tenn., was approved by the Senate Commerce Committee last year. It takes a different approach, requiring social media companies to abide by a \"duty of care\" to make their platforms safer and more transparent by design. That bill, which the two reintroduced this week, would force the companies to give minors the option to disable addictive product features and algorithms and enable child safety settings by default.",
        "Another bill introduced Wednesday by Sens. Ed Markey, D-Mass., and Sen. Bill Cassidy, R-La., would expand child privacy protections online, prohibiting companies from collecting personal data from younger teenagers and banning targeted advertising to children and teens. Republicans and Democrats on the House Energy and Commerce Committee, too, have been working on a more expansive online privacy bill that would give adults as well as children more control over their data.Other bills would aim to ban TikTok or give the government more leeway to review foreign-owned platforms deemed a possible security threat.Industry groups have criticized the child safety bills, warning of overreach. They say the rules could backfire and prevent some teenagers from finding helpful resources on suicide or LBGTQ+ issues, in particular.\"Being a parent in the twenty-first century is hard, but inserting the government between parents and their teens is the wrong approach,\" said Carl Szabo of NetChoice, an advocacy group that counts Meta, TikTok, Google and Amazon among its members.Another industry-aligned group, Chamber of Progress, said the prohibition on algorithmically targeted content would actually make it harder for teenagers to find age-appropriate material. \"We should listen to teens, who are saying that social media is mostly playing a positive role in their lives,\" said CEO Adam Kovacevich.",
        "Blumenthal also criticized the four senators´ bill, saying this week that he has \"strong concerns\" that the legislation would put more of a burden on parents than the technology companies and potentially give industry the opportunity to collect more data as parents attempt to verify their children's ages.\"Our bill in effect puts the burden on big tech\" rather than parents, Blumenthal said about his legislation with Blackburn.Schatz defended their legislation as \"elegant in its simplicity.\"\"We simply say kids 12 and under shouldn´t be on a social media platform at all,\" Schatz says. \"That´s a policy call. That´s within the purview of the Congress. And I think most people agree with us.\"Cotton says that most social media companies are already collecting data on children, and that their bill does not pose any additional risk. The fact that there are several bills out there, he says, highlights \"a lot of energy and enthusiasm about putting some reasonable guardrails around social media.\"Many teenagers want some regulation as well, Murphy says.\"When I talk to the kids that hang around my house, they know that they´re not being protected and looked after,\" he says. \"They know that sometimes these sites are sending them into places where they shouldn´t be.\"Britt says some of her friends and fellow parents in her walking group texted her news reports about her bill after they introduced it.",
        "\"This is what we need,\" they told her.___Follow the AP's coverage of social media at https://apnews.com/hub/social-media."
    ]
}