{
    "articleURL": "/news/article-12059991/Theranos-fraudster-Elizabeth-Holmes-reveals-spent-six-months-sleeping-husband-RV.html",
    "content": [
        "Elizabeth Holmes shared how she and her husband, Billy Evans, were sleeping in campgrounds and at Walmart parking lots in 2019The 39-year-old convicted fraudster is trying to revamp her image ahead of her prison sentenceMany online are now calling out the New York Times for its favorable portrayal of the convicted fraudster Convicted fraudster Elizabeth Holmes has revealed she spent six months traveling the country in an RV with her husband as she prepared her defense.",
        "In a series of interviews with the New York Times as the 39-year-old tries to revamp her image ahead of her prison sentence, Holmes shared how she and her husband, Billy Evans, were sleeping in campgrounds and at Walmart parking lots for half the year in 2019.She also told how she spent some of the past year volunteering at a rape crisis center in an attempt to portray herself in a more relatable light whilst defending her actions while promoting her future as a health-tech innovator. Federal court documents submitted by Holmes ahead of her sentencing showed the conwoman and Evans enjoying their trip, which appears to span much of the lower 48 states.  Speaking of Theranos, Holmes acknowledged she made numerous mistakes due to her lack of knowledge and understanding at the time.But the New York Times is now being slammed online for its favorable portrayal of the mother-of-two who scammed people out of millions of dollars as she promoted a blood testing service that never actually worked.",
        "In the May 7 profile, Holmes claimed she built a persona that was not 'authentic' when trying to promote Theranos and becoming heralded as an innovator.She said she is not actually the kind of person that would wear black turtlenecks, red lipstick and use an authoritative voice. ",
        "Instead, Holmes portrayed herself as a loving mother of two who wears a 'bucket hat and sunglasses' and enjoys walks around the San Diego Zoo.In fact, she said, when District Judge Edward J. Davilla set a date for her criminal fraud trial in 2019, she and Evans spent six months traveling around the United States in an RV while prosecutors worked to convict her.Before the trial began, Holmes said, she and Evans were sleeping at campgrounds and Walmart parking lots.'Even though that period was a crisis, and Theranos was my life and like my child, I gave everything I had to it,' she said.Once it was gone, though, 'I also became free.'And, speaking of her relationship with Evans, Holmes said, 'Finding your person in the middle of all of this and experiencing that love when you're going through hell is the most beautiful thing I've ever experienced.'She had previously claimed her former partner and ex-Theranos COO Ramesh 'Sunny' Balwani physically and emotionally abused her, and disclosed that she had been a victim of sexual assault during her time at Stanford University. Those experiences, she said, prompted her to start volunteering at a rape crisis hotline.",
        "Holmes also acknowledged in the interviews that she made 'so many mistakes,' claiming 'there was so much I didn't know and understand, and I feel like when you do it wrong, it's like you really internalize it in a deep way.",
        "Still, she said, the company could have changed the health care industry for good if it had actually worked as she thought.",
        "Her so-called Edison machine had promised to be able to test a tiny amount of blood in minutes to detect dozens of medical issues.Banking on this promise, pharmacy giant Walgreens decided to partner with Theranos to offer in-store blood collection centers.By 2014 the company was said to be worth $9 billion and Forbes ranked Holmes as the youngest self-made billionaire in the world.But the following year the exhaustive investigation by WSJ, it was claimed Theranos's system provided false reports and revealed the company had been using commercially available machines from other companies for most of its testing. Lawsuits started flooding in and Theranos collapsed in scandal, eventually shuttering in 2018. Holmes was then convicted in January 2022 on four counts of fraud and conspiracy.'We would've seen through our vision,' she insists and reveals she is even working on new inventions. The Times describes Holmes view as 'idealistic delusion'. 'I still dream about being able to contribute in that space,' Holmes said. 'I still feel the same calling to it as I always did and I still think the need is there.' ",
        "Holmes has been accused of getting pregnant in order to get a lighter sentence and avoid prison time.",
        "She had a child shortly before her trial and has had a second since her conviction which some have seen as a cynical ploy to obtain a reduced sentence following her trial. Now, many are criticizing the New York Times for its favorable portrayal of the convict, in which Amy Chozik says she was 'admittedly swept up in Liz as an authentic and sympathetic person. 'She's gentle and charismatic in a quiet way,' Chozik writes of her conversations with Holmes. 'If you are in her presence, it is impossible not to believe her, not to be taken with her and be taken in by her.'Former CNN host Soledad O'Brien tweeted that it must be 'nice to be a pretty white lady working your charm on a NYT reporter,' and political consultant Matt Dowd suggested, 'Maybe this article would have been served more by a discussion of sociopaths.'Communications director Keith Edwards also told Chozik 'the con artist conned you,' and another Twitter user suggested the Times was suggesting 'committing fraud actually isn't that bad.' "
    ]
}