{
    "articleURL": "/wires/pa/article-12042109/Erik-ten-Hag-urges-Alejandro-Garnacho-kick-meet-higher-demands.html",
    "content": [
        "Erik ten Hag wants Alejandro Garnacho to kick on and challenge for a regular starting spot after the 18-year-old committed his long-term future to Manchester United.",
        "The talented winger arrived at Old Trafford from Atletico Madrid in 2020, in the last wave of international signings before the Brexit regulations changed.Garnacho was named last season’s Jimmy Murphy Young Player of the Year after playing a key role in United’s FA Youth Cup triumph and went on to make his first-team debut in April.The Argentina youth international did not appear on the pre-season tour of Thailand and Australia after frustrating Ten Hag, but has since won the Dutchman over and has signed a new deal until 2028.“First of all, I think he has the prize and it’s a prize,” the United manager said of Garnacho. “He also shows he can make the final step – not only in talent but also, he made it.“But now it’s a new start, a restart, because now the expectations will be higher, the demands definitely will be higher.“He is on his way, he is a strong character and that’s why he’s there in the moment on this level, and he did it by himself.“But now is coming more work to go because the demands are higher, we expect more from him. For Alejandro, he is that step beyond but now the demands will be even more because he has now to compete for a starting XI position.  Erik ten Hag  ",
        "“But it’s great he made it because it tells we will give young players opportunities, but they have to deserve it.“When I say ‘give’, translate it to ‘deserve’ and they have to deserve with their feet, they have to show it on the pitch and that means you have to invest a lot and deserve it by training performances, by performance in the under-21s, then wait for your moment and prove it again.“For Alejandro, he is that step beyond but now the demands will be even more because he has now to compete for a starting XI position.“So, every time is the same: you have to cross limits and every time you have to go in the next level.“We go with him in that challenge but most important is the player has to do it.”",
        "Garnacho has been laid low for the last seven weeks with an ankle injury sustained against Southampton – an issue that also saw him miss the chance to link up with the Argentina senior team in March.But the teenager has made good progress and is closing in on a return to action, albeit Thursday’s Premier League trip to Brighton comes too soon.“We have one training but I think it’s too soon to be available,” Ten Hag said. “I think he’s short, I think he needs some training and then short notice he will be available.”",
        "Raphael Varane is also making good progress on his return to fitness.",
        "The 30-year-old went off injured in last month’s Europa League quarter-final first leg against Sevilla, when fellow centre-back Lisandro Martinez suffered a season-ending metatarsal injury.Varane will be unavailable at Brighton and then at West Ham on Sunday, but Ten Hag suggested he could return in United’s home match against Wolves on May 13.“The prognosis, I think Rapha is closer than Scott McTominay in this moment,” the United boss said. “But still for the coming two games, they are not available.”United have the chance to strengthen their grip on a Champions League qualification spot when they head to the high-flying Seagulls on Thursday.",
        "Brighton are the only away team to have won at Old Trafford in the league this term but are reeling from their recent FA Cup semi-final penalty shoot-out loss to the Red Devils at Wembley.“I think everyone involved in top, top sport, if you get beaten you want to have revenge and that is normal that they have a huge motivation to beat us,” Ten Hag added.“But we have to match that and not only match that – we have to do more.“We have to show we have more hunger than them to win this game and willingness – that is the word for (Thursday).”"
    ]
}