{
    "articleURL": "/news/article-12045619/Google-staff-slam-boss-Sundar-Pichais-massive-226million-pay-deal.html",
    "content": [
        "It also comes after a $70 billion buyback deal by Google parent, AlphabetThe cuts come as the tech industry accounted for 38% of all layoffs in 2023 Employees at tech giant Google have slammed CEO Sundar Pichai after a document released in April showed that his salary shot to $226 million last year, making him one of the highest paid CEOs in America, according to CNBC.",
        "Workers were frustrated that Pichai refused to take a pay cut while Google's parent company, Alphabet, announced plans to eliminate 12,000 jobs as part of a cost-cutting campaign in January. This was followed by the company's announcement in April that its first quarter revenue was $68.01 billion, missing its projected target by $100 million, sending the firm's stock plunging by 4 percent.It comes after Google also authorized the decision to spend $70 billion on buying back its own shares - further irritating employees in a sign that the company is sufficiently well-funded to cover all its operations. After it was revealed that Pichai received $218 million in equities last year by a securities report filed by Alphabet on April 21, internal Google forums began producing memes - viewed exclusively by CNBC - lambasting the CEO for taking the pay bump while cutting other costs. The memes mocked Pichai by unfavorably contrasting him to Apple CEO Tim Cook, who had his pay reduced by over 40% from his 2022 compensation.",
        "Similarly, Zoom CEO Eric Yuan said he would take a 98% pay cut while refusing his bonus as the company cut 1,300 jobs.One meme - which received 1,200 likes by members of the workforce - made reference to comments from finance chief Ruth Porat, who sent out an email last month to announce that the company was making 'multi-year' cuts to employee services. ",
        "The cuts included limited use of employee laptops as well as fitness classes and café items.'Ruth's cost savings applied to everyone… except our hardworking VPS and CEO,' the meme said. ",
        "According to Securities and Exchange Commission (SEC) filings last year, Pichai's $226 million pay stub consisted primarily of a $218 million stock award, which he receives every three years. He last received the award in 2019 for $276.6 million with a total compensation of $280.6 million.",
        "The remainder of his 2022 salary was made up of £6 million for personal security and a $2 million base salary.Pichai has come under fire on several occasions for his corporate decisions - even forgoing his bonus in January following pressure from employees during a meeting in which workers asked him why they were receiving such drastic pay cuts.It came after he declared he took 'full responsibility' for the companywide layoffs that month. Another meme - showing 2001's Shrek villain Lord Farquaad, a tyrant who exiles fairytale characters to a swamp - appeared with an image of Farquaad and the caption: 'Sundar accepting $226 million while laying off 12k Googlers, cutting perks, and destroying morale and culture.'A quote from the character read: 'Some of you may die, but that is a sacrifice I am willing to make.'",
        "Another meme was directed at Google: '$70 billion in buybacks shows we respect external shareholders more than Googlers.'Among other major layoff announcements in the tech sector were cuts at Amazon, which on January 5 said it was eliminating more than 18,000 roles in an extension of previously announced layoffs.Mark Zuckerberg also famously declared 2023 would be the 'Year of Efficiency' at Facebook parent company Meta, saying in March that the company plans to cut 10,000 more jobs after a slightly larger round of layoffs in November.From January to March, companies announced 270,416 job cuts - with the technology sector accounting for more than a third of the cuts in the first quarter at 102,391 layoffs."
    ]
}