{
    "articleURL": "/tvshowbiz/article-12059513/Kym-Marsh-46-seen-TIME-split-Scott-Ratcliff-34.html",
    "content": [
        "Kym Marsh was seen for the first time since the dissolution of her marriage was reported, as she stepped out on Sunday. ",
        "The former Hear'Say star, 46, cut a low-key figure during a day out with her supportive daughter Emilie, 26, in the wake of the news that she has split from her soldier husband Scott Ratcliff, 34, after 19 months of marriage.Last week it was reported by The Sun, that Kym and Scott decided to end their marriage due to the strain of work, but 'cracks' had been present for some time.Kym, who spoke in the past of the 'grim' reality of being an army wife, flitted between looking pensive and laughing with the group as they stepped out with her blingy engagement and wedding ring notably absent. While Kym was still sporting a very thin band on her ring finger, her engagement ring and chunky diamond wedding band were no longer on her hand. ",
        "It comes after it was reported Kym split from her third husband Scott after they married at a lavish ceremony in October 2021. After 19 months as husband and wife, they are said to have broken up following a trial separation, due to work keeping them apart.A source told The Sun: 'They both really tried to make it work, but the cracks have been there for a while and they were only getting to see each other for one or two days a week at the very most.",
        "'Kym's been so busy, and last year (being on Strictly Come Dancing) meant even her weekends were stacked up along with weekdays rehearsing.'More recently she's been filming all over the place and rehearsing for a new theatre run.'",
        "Adding about how Army Major Scott's work drove a wedge between him and Kym, the insider said: 'Scott is based in barracks down south – he's got a very busy career as well. Kym's still a working mum, too, and lives up in Cheshire with her family. 'In the end it was the fact they lived so far away from each other that just made it impossible.'The source said the pair 'had a trial separation earlier this year' and were 'hoping to get things back on track', but added they have decided 'it's best to go their separate ways'.They added: 'It's very sad for all involved, but they've decided it's time to tell their family and friends and focus on the future – which means filing for divorce. They're hoping to keep things as amicable as possible.'Hopefully time will help to heal things.'",
        "In January last year, Kym revealed that two days after their wedding in October 2021 he was sent away for a fortnight - something she 'was not expecting' and branded life as an army wife 'pretty grim' due to the distance. ",
        "As well as the stress of their distance, she admitted the danger of his job added to the problem as she was worried about war. She said: 'There is always anxiety, it is always stressful when he goes away. There may not be an actual war threat currently but there's always a risk when you're in these dangerous places.'As well as her assessment of the distance in their lives, she also spoke about how Strictly exacerbated her anxiety - with training falling in line with Scott's time away with the Parachute Regiment - leaving the couple barely seeing one another. ",
        "Speaking to OK! in January 2022, she said: 'It's been really good. Well, I say that, but we got married and then two days later Scott was sent away for two weeks and we weren't expecting that! That was a bit grim, but it's just part of being an army wife...'It felt like on the honeymoon I could properly celebrate being Mrs Ratcliff!'Scott detailed why he had to leave his new wife for work so soon after the wedding, adding: 'I do three terms per year at (military academy) Sandhurst and every term I'll go away for two weeks to run an overseas training exercise.'Aside from her life as an army WAG, she also spoke about how her time on Strictly increased her anxiety - just four months before her split was announced. ",
        "Kym's first husband was former EastEnders actor Jack Ryder, 41, who she married in 2002 but divorced seven years later.In 2012 she married Hollyoaks star Jamie Lomas, 48, but they divorced in 2014, and she met Scott in 2018.Kym has children David, 28, and Emilie from an earlier relationship as well as daughter Polly, 12, with Jamie, with whom she also had son Archie in 2009, who died moments after he was born.",
        "DAVE CUNLIFFE - 1994-1999Kym met Dave, a builder and the father of her children, David, 27, and Emilie, 26- in a karaoke pub in her home town in 1994 and were engaged until 1999.JACK RYDER - 2001-2009 Kym met EastEnders star Jack in the BBC canteen in 2001 after performing on Top Of The Pops while he was starring as Jamie Mitchell on the soap. They wed at St. Albans Parish Church in Hertford, in August 2002 and sold the pictures to OK for a reported £300,000.Their split was announced in March 2008 and they announced their divorce in August 2009. JAMIE LOMAS - 2009- 2014Kym and Hollyoaks' Jamie began dating in 2009, before she fell pregnant the following year, Tragically, at just 21 weeks Kym went into labour due to a condition that meant her body was rejecting the baby. Baby Archie died minutes after being born.The couple had happier news when they welcomed daughter Polly in March 2011. They wed in September 2012 but were divorced by 2014.OLIVER MELLOR - 2013In 2013, she dated her co-star Oliver, who is now married to Rhian Sugden, however they split soon after. He said after the romance: 'We planned a future together. We loved each other and we weren’t afraid to say it. It wasn’t something we intended to happen, but we couldn’t stop our feelings.'DAN HOOPER 2015-2015Kym began dating personal trainer Dan Hooper in April 2014. In whirlwind romance, they became engaged by the December the same year.Just five months later however they split in May 2015.Scott Ratcliff - 2019-2023Kym met her third husband Scott in 2019, before he asked for her hand in marriage in 2021 while ringing in her birthday.The married the same year however their split was announced in May 2023. "
    ]
}