{
    "articleURL": "/money/comment/article-12054101/Rules-shake-just-step-says-HAMISH-MCRAE.html",
    "content": [
        "About time too! At last we may be starting to correct some of the absurdities in the way this country regulates financial activities, to encourage UK companies to list in London, and for UK investors to put their money into enterprises here, rather than shipping their savings abroad.",
        "The Financial Conduct Authority has just proposed changes to rules for companies seeking a quote on the London Stock Exchange. The reason is simple. Companies are choosing New York instead.The high-profile example is Arm, the Cambridge-based designer of the microchips in 95 per cent of the world's smartphones. It was a member of the FTSE 100 until 2016, when it was bought by the Japanese group, SoftBank. Now it is being sold back to the public but, despite a vigorous campaign by Rishi Sunak, is doing so on Nasdaq, the US high-tech exchange.We are not even getting a secondary listing. The reason: it is expected to get a much higher valuation in New York. But why? Rationally, the same company should be valued at the same price wherever it is listed. But London-listed big oil companies such as Shell are on lower valuations than Exxon, despite being broadly similar businesses.Foreign investors buy into the UK, with more than half the shares on the Footsie owned aboard. By contrast, UK institutional investors have sold almost all their shares. Whereas 25 years ago they owned more than half the UK market, now it is about 5 per cent.",
        "So what's to be done? It is partly a matter of listing requirements, so tackling them is a start. Since there has been a 40 per cent fall in the number of listed companies since 2008 the FCA had to act.",
        "It has also said it will change rules on secondary trading to cut the cost of buying and selling shares of companies already quoted. But we really need a change of attitude to enterprise and investment, rather than pecking away at failed regulations.There are good principles behind what we have done: protection of the investor, trying to ensure one share gets one vote, monitoring board composition so directors don't serve too long. All that stuff.But if companies move headquarters abroad investors are not likely to be protected by UK regulations. And if firms stay private they can't invest in them anyway.Take our two most successful big commercial enterprises founded in the past 25 years, Dyson and Ineos. A lot of people would like to invest in them. But both are private companies, and while Ineos is still headquartered in London, Dyson has moved to Singapore.This is a disaster at many levels. Making London more attractive as a place to list is a start, but we must make being a quoted company more attractive than being a private one so ordinary investors can share in the wealth created.We also have to figure out why our pension regulations have made it so unattractive for UK institutions to hold UK shares.",
        "This is not just a money issue, though I suspect most people with private pensions would be aghast if they knew their savings were mostly sent abroad or stuffed into gilts. It is also a governance issue. Our institutions used to scrutinise corporate behaviour, voting against boards that neglected their duties. Now they don't own enough shares to matter. It gets worse. Several big institutional investors are merging or have just done so.A few months ago Smith &amp; Williamson and Tilney became Evelyn Partners. Last week Rathbones said it would buy the wealth business of Investec. Why? Well, the general reason is that compliance costs have made it hard for smaller managers to remain competitive.Consolidation is a polite way of putting it, but the effect will be less competition, fewer new fund management enterprises, and fewer decision points in the investment process. This cannot be in the long-term interest of savers.In a way, fixing listing requirements is the easy bit. We should simply follow American practice. The US accounts for more than half of global equities by market value, so that is the global system. Why should we expect to do better with our 5 per cent market share?Much harder is to see what investors really want. Anyone who buys Bitcoin has rejected financial regulation. But most of us do want protection against mismanagement. Holders of the Woodford Equity Income Fund are getting just 77 per cent of their cash back. And we all want lower costs.",
        "So let's see the FCA reforms as a first step. There is a long and difficult path ahead to fix the mess we have made of regulation.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}