{
    "articleURL": "/wires/aap/article-12055357/Indigenous-womens-voices-elevated-summit.html",
    "content": [
        "Indigenous women's voices matter to Aboriginal and Torres Strait Islander Social Justice Commissioner June Oscar.",
        "But, she believes, too often they are not heard.More than 800 Indigenous women from across Australia will meet in Canberra for the Wiyi Yani U Thangani (or women's voices, in Bunuba language) national summit, from Tuesday to Thursday.The summit, which has a theme of \"We are the change\", aims to provide Aboriginal and Torres Strait Islander women and girls an opportunity to get together and discuss the matters that affect them.\"When I travelled around this country speaking with women and girls for the Wiyi Yani U Thangani project, they told me they would like a shared space with those who hold positions within government agencies and other people of influence,\" Ms Oscar told AAP.\"First Nations women want to connect with them and inform the decisions they make that affect their communities and families.\"They would like to guide how governments and others can work better and far more effectively with them.\"The sessions cover a wide range of topics, from change-making and political engagement, to language, law and culture and include a Yolngu women's presentation about pregnancy and birthing on country.\"It's always a beautiful thing to remind ourselves that First Nations women in our country have had holistic supportive ways of providing care and love and respect to mums and expectant mums for millennia,\" Ms Oscar said.",
        "\"Indigenous women are already knowledge holders of holistic maternal frameworks and knowledge systems that support maternal care.\"Ms Oscar said Yolngu women from Arnhem Land, through the Djakamirr program, will talk about the aspirations of remote Indigenous communities to reclaim their birthing culture from the stronghold of Western medicine.\"From an Indigenous perspective, maternal care, support structures and ways of working have never been included in mainstream Western thinking,\" she said.\"There is such depth of knowledge that Indigenous women have around culturally-safe maternal care.\"I think it's so important to remind people that women have the wisdom and the knowledge of these holistic ways of being and doing and providing support to each other.\"Building on previous work by the Human Rights Commission and its partners under the broader Wiyi Yani U Thangani Project, the key outcome of the summit will be the development of a landmark National Framework for Action and an Institute for First Nations Gender Justice and Equality.On the day before the summit, Monday, there will be a youth forum.\"It is absolutely critical to me that we create this space for young First Nations women and girls to elevate their voices around the very things that impact their lives,\" Ms Oscar said.\"These are the leaders of tomorrow and we need to ensure that they are provided a safe and supportive space to raise the issues that they want to speak about.\"",
        "Speakers at the summit include Minister for Indigenous Australians Linda Burney, human rights lawyer Dr Hannah McGlade, and video messages from international female leaders including former prime minister Julia Gillard, New Zealand's Foreign Affairs Minister Nanaia Mahuta, and Reem Alsalem, the UN Special Rapporteur on violence against women and girls, its causes and consequences."
    ]
}