{
    "articleURL": "/news/article-12050113/Is-Post-Office-open-Coronation-bank-holiday-Opening-times-revealed.html",
    "content": [
        "Post Office opening times confirmed for coronation day, Bank Holiday Monday Opening hours for post offices across the UK are set to be affected by the Bank Holiday weekend, which is taking place to mark the coronation of King Charles III.",
        "The Post Office is primed to operate with altered operating times on the upcoming Bank Holiday, which will fall on Monday, 8 May, 2023. The extra Bank Holiday has been called by the government to allow Brits to celebrate King Charles' coronation. Ahead of the next Bank Holiday, which comes just a week after May Day, here is everything you need to know about post office opening times.  ",
        "Is the post office open on coronation day?On the day of King Charles' coronation, some postcodes in London will not receive post due to security operations being in place for the event.Access in the EC4V, SE1 7, SE1 8, SW1, W1J, W1K, WC2N and WC2R postcode areas will be restricted until after the coronation clear-up on Saturday, 6 May. In addition, the Royal Mail customer service point at 9 Howick Place, SW1P 1AA, will also be closed on Saturday, 6 May. Are post offices open on Bank Holiday Monday?As Monday, 8 May, has been designated as another Bank Holiday by the government, no post offices will be open. Furthermore, there will no post delivered on the day as staff enjoy a well-earned break on the extra Bank Holiday. Royal Mail is marking the Coronation with a set of four new stamps, each approved by King Charles III, which have been unveiled in time for the Coronation.",
        "The four stamps depict the King being crowned and celebrate the Commonwealth, Britain's multi-faith society and biodiversity, a cause close to Charles' heart.",
        "The set is based on newly-commissioned wood engravings by artist Andrew Davidson.One imagines St Edward's Crown being lowered onto Charles' head by the Archbishop of Canterbury at the moment of the Coronation on 6 May.The 1st class stamp shows a likeness of the monarch holding the Sceptre with Dove and the Sceptre with Cross and sitting in the Coronation Chair.The other three stamps depict Diversity and Community, The Commonwealth, and Sustainability and Biodiversity."
    ]
}