{
    "articleURL": "/sport/football/article-12058059/SIX-players-sent-Superclasico-massive-River-Plate-Boca-Juniors-fight.html",
    "content": [
        "The Superclasico is one of the fiercest rivalries in the global football calendarBut scenes on Sunday night even left some players regretting the fury on showDailyMail.com provides all the latest international sports newsEven by Superclasico standards, it was a hysterical ending to one of the fiercest rivalries in all of football on Sunday night between Boca Juniors and River Plate in Argentina.",
        "Six players were sent off in added time - three from each team - when a huge brawl erupted shortly after a late and ultimately decisive River penalty had put them 1-0 up against Boca.Stewards and riot police had to intervene to help split the teams up and when things finally cooled down, the referee sent off three players from each side as well as the Boca coach, Jorge Almiron.River, coached by Martin Demichelis, held on for victory thanks to Miguel Borja's spot-kick at home at the Estadio Monumental.Borja kept his nerve in the most intense of circumstances, sending former Manchester United goalkeeper Sergio Romero the wrong way in the 93rd minute and it appears the brawl may have began, in part, due to Romero's response.",
        "The stadium, packed with 83,000 supporters, erupted into sheer euphoria and most of Borja's teammates mobbed him as if it was a World Cup final winning goal.The goalkeeper claimed he was goaded by Agustin Palavecino and Romero responded by trying to move him out of his way when the Boca team jumped to his defence.As the celebrations on the field continued, some of Borja's teammates were distracted by the clash with the Boca team and it soon consumed almost everyone on both squads.",
        "'We leave with a very bitter and sad feeling,' Romero said after the game. 'Palavecino came to shout the goal in our faces. I reacted well, I went to grab him by the waist and tell him why I was doing that. My teammates thought I was going to fight and they all came.'CBS Sports suggested on commentary that the scrap may have escalated by Romero also coming to blows with Uruguay international midfielder Nicolas de la Cruz of River, but in a mere matter of seconds everyone was involved. Added time ended up lasting an incredible 19 minutes, with the referee sending off Agustin Palavecino, Ezequiel Ignacio Centurion and Elias Gomez of River and Miguel Merentiel, Ezequiel Fernandez and Nicolas Valentini of Boca.River captain Enzo Perez regretted the scenes at the end, saying: 'Terrible madness came out from all sides, and luckily we were able to keep three important points in a Superclasico.'It is not good for the show. There were a lot of people who got involved from both sides, the coaching staff, players who were not in the squad. 'We try to separate, calm down, so that some go one way and others the other, but when there are so many people who don't have to be on the pitch, with the nervousness from outside, it's difficult.'",
        "Demichelis, meanwhile, rejected Romero's words after the game.'I appreciate Sergio (Romero) and I love him very much,' Demichelis said. 'He knows me a lot as a person on the pitch and off it.",
        "'I don't know what he was referring to with what he said. Sometimes the passion overcomes everything because of how the result was given. In Argentina we can't stand losing - (we'd rather) let them kill us.'The penalty that won the game for River was given when Agustin Sanchez fouled Pablo Solari. Borja's successful penalty mean that River and Demichelis hold a nine-point lead at the summit of the Argentina Primera Division, although second-place Ssn Lorenza have played a game less.Boca, meanwhile, are languishing down in 13th place in the standings. "
    ]
}