{
    "articleURL": "/sport/football/article-12056255/Diego-Costa-not-scoring-hes-played-pivotal-role-Wolves-pitch-backstage.html",
    "content": [
        "Diego Costa has played a key role in Wolves' bid for Premier League survival Toti Gomes scored the only goal early on Saturday in 1-0 win over Aston Villa The win takes Wolves to 40 points for the season, virtually ensuring their safety Diego Costa might have scored only once in 21 matches but the old warhorse’s role in Wolves’ survival bid cannot be underestimated.",
        "When Costa arrived at Molineux last September, it was a desperate move for a desperate situation. The transfer window had closed and Wolves had no senior centre-forward available, with Sasa Kalajdzic injured on his debut and Raul Jimenez also unavailable.The 34-year-old had not played competitively since leaving Atletico Mineiro in January 2022 and from his rusty early displays, it was impossible to imagine the former Atletico Madrid and Chelsea man playing a key role in Julen Lopetegui’s efforts to keep Wolves in the Premier League.Yet there was Costa in the moments after Wolves’ 1-0 win over Aston Villa, giving Lopetegui a bear hug to celebrate reaching the 40-point total that should guarantee survival, and conducting the crowd as they chanted ‘Diego, Diego’. While he is no longer as sharp as in his greatest days, Costa was a constant menace for Tyrone Mings and Ezri Konsa – one of the best centre-back pairings in the league in recent times. His revival is testament to his fitness and dedication.",
        "Costa is one of the hardest trainers at Wolves and goes through a ferocious gym routine virtually every day at the club’s base at Compton, on the outskirts of the city.That has helped him regain condition while his presence in the dressing room is hugely valued by Lopetegui.",
        "His mentality has rubbed off on some of the younger players, with Brazilian midfielder Joao Gomes particularly grateful to Costa for helping him settle into English football.Sportsmail reported last week that Wolves were weighing whether to give Costa a contract for next season and there will be discussions at the end of this campaign.While his goal record does not match his status as one of Wolves’ highest-paid players, Lopetegui would like to keep Costa around.",
        "Given the financial power of their billionaire owners Nassef Sawiris and Wes Edens, Villa will be setting their sights a little higher as they approach a busy summer. Unai Emery has done a superb job at Villa and the imminent arrival of Barcelona director of football Mateu Alemany indicates an ambitious transfer campaign ahead.Before that, Villa will try to revive their fading European hopes by beating Tottenham on Saturday. ‘We are three points behind Tottenham but we play them at home next week and we will try to keep the European chance still open,’ said Emery. ‘That match is our final.’",
        "Wolves (4-4-2): Sa 7; Semedo 6.5, Dawson 7.5, Kilman 7.5, *TOTI 8*; Nunes 6.5 (Moutinho 90min), Neves 7, Lemina 7.5, Neto 6.5 (A Traore 84); Costa 7.5 (Collins 83), Cunha 7 (Hwang 68, 6)Scorer: Toti 9Booked: Costa, Toti, SemedoManager: Julen Lopetegui 8Aston Villa (4-4-1-1): Martinez 7; Young 7 (Carlos 65, 6), Konsa 5.5, Mings 5.5, Moreno 6 (Digne 85); B Traore 4.5 (Bailey 46, 6), Luiz 6 (Kamara 86), McGinn 6.5, Ramsey 7; Buendia 7.5 (Duran 81); Watkins 5.5Booked: Mings, Watkins, LuizManager: Unai Emery 6Referee: S Attwell (Warwickshire) 6Attendance: 31,651"
    ]
}