{
    "articleURL": "/tvshowbiz/article-12044971/Jackie-O-shocks-listeners-shares-lazy-rich-person-confession.html",
    "content": [
        "Kyle Sandilands and Jackie 'O' Henderson each earn at least $5million a year hosting Sydney's No. 1 FM breakfast show ",
        "And on Thursday, Kyle was left stunned after his co-host shared her 'lazy rich person' confession.The 48-year-old's long-time assistant Brittany revealed on KIIS FM's The Kyle and Jackie O Show that Jackie used to make her go shopping and take photos of outfits she wanted to buy.'Jackie got so lazy at one point she used to make me go shopping for her clothes, take photos of me in them and text them to her to see if she wanted to buy them or not,' Brittany said.Jackie burst into laughter before admitting: 'I did go through such a lazy period at one point and I feel so bad I did that.'",
        "The radio host then revealed how her co-host Kyle recently made his assistant Bruno drive for over one hour to move his car out of the garage.Jackie O explained: 'On our recent holiday, Kyle had nothing to do and he decided he wanted to drive the Rolls Royce.''But Kyle has many cars and the Rolls Royce was parked in front of some vehicles so there were two or three cars that had to be moved to get the Rolls Royce out.''You called your manager Bruno who lives over an hour away to move those cars and then drive back home because you couldn't be bothered walking to the garage to do it yourself. Don't you feel bad calling Bruno to come do something little like that?'",
        "Kyle responded: 'No... I own the management company [he works for] so he doesn't really get a choice.''He still showed up and we managed to move the cars... but we didn't take the Rolls that day, we ended up taking Tegan's car because she has the baby seat.'",
        "It comes after Jackie opened up about how she got her start on Australian radio.The KIIS FM star told her fellow co-host Kyle that her foot in the door was all thanks to her ex-husband and radio DJ, 'Ugly Phil' O'Neil.The ex-couple met when an 18-year-old Jackie called into the radio show Phil was hosting at the time to enter a competition, and they were married just a year later.Jackie explained that while she was living on the Gold Coast as a teen, she would ring up Sea FM in the early 90s in a bid to score Guns N' Roses concert tickets.'I never worked at Sea FM,' she said, adding that Ugly Phil took her out 'on a date' after asking her to come and visit the radio station and collect the concert tickets.",
        "Jackie recalled the pair had only been together for three months before he was offered a radio job in Canberra.'I moved with him because we were in a relationship,' she added.",
        "They then relocated to Adelaide where Jackie got offered a job 'on the phones' at the station where Phil hosted - after an employee got fired for 's**t-canning' staff members in her diary that someone found on her desk and read.'The rest is history,' Jackie said."
    ]
}