{
    "articleURL": "/wires/reuters/article-12061221/California-banking-regulator-says-SVB-oversight-inadequate.html",
    "content": [
        "May 8 (Reuters) - California's financial regulator failed to press leadership at Silicon Valley Bank to address known problems quickly enough before the lender imploded in March, according to a report released Monday in which the agency pledged to do better in the future.",
        "The post-mortem by California's Department of Financial Protection and Innovation (DFPI) follows a scathing Federal Reserve report released last month in which the U.S. central bank blamed its own poor oversight, reckless bank management and loosened regulations for contributing to SVB's failure, which now ranks as the third-largest in U.S. history.Regulators have since pledged tougher oversight of the banking sector while lawmakers have also complained that officials were too slow to address its poor risk management. Former SVB chief executive Gregory Becker is due to testify before Congress next week.According to the report released Monday, DFPI played a supporting role, with primary oversight for SVB conducted by the Federal Reserve Bank of San Francisco, which could devote more staff to supervision.SVB \"was slow to remediate regulator-identified deficiencies, and regulators did not take adequate steps to ensure SVB resolved problems as fast as possible,\" according to the report.Time was of the essence in part because of meteoric growth in the bank's assets, which had quadrupled in four years to over $200 billion by 2021, according to the report, which said that in future the California regulator would apply heightened scrutiny to banks with $50 billion or more in assets and high levels of uninsured deposits -- a factor that encouraged the bank run.",
        "The report noted however that in previous times, large amounts of uninsured deposits did not necessarily signal heightened risk since accounts with large deposits were often held by corporate clients who tended to change banks infrequently.The report also said DFPI planned to require banks to consider how to manage risks created by social media and real-time withdrawals, which can intensify and accelerate bank runs. In just one eight-hour period on March 9, SVB depositors submitted withdrawal requests amounting to about $42 billion. (Reporting by Douglas Gillison; Editing by Aurora Ellis)"
    ]
}