{
    "articleURL": "/wires/pa/article-12056557/King-Queen-thanks-William-Kate-greet-wishers-Windsor.html",
    "content": [
        "The Prince and Princess of Wales surprised fans in Windsor with a walkabout as the King and Queen thanked well-wishers for their support.",
        "William and Kate made the unannounced appearance ahead of Sunday’s star-studded coronation concert at Windsor Castle and were seen shaking hands and chatting to revellers.Scores of people crowded around the couple, with William crouching down to chat to a boy and girl wearing golden crowns.The prince and princess looked relaxed, with William telling one group of well-wishers: “Enjoy the concert tonight”.",
        "At one point, Kate comforted a little girl who appeared overcome with emotion to meet her.She gave the teary youngster, who was wearing a headband with union flag deely boppers and navy dress covered in patriotic motifs, a long hug and the girl burst into tears.The princess, who had crouched down to speak to her, continued chatting to the girl, who nodded her head and gave a small shrug as Kate patted her back.It came shortly after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were “deeply touched” by the nation’s celebration of their historic coronation.",
        "“Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion – and to the very many who turned out to show their support in such numbers in London and further afield,” he said.",
        "Heir to the throne William is to take to the stage to deliver a speech during the musical extravaganza in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The King, Queen and royal family will join around 20,000 members of the public at the musical extravaganza to see performances by Take That, Katy Perry and Lionel Richie.Tens of thousands turned out in central London on Saturday to see the pomp and pageantry of the coronation, with Charles and Camilla processing through the streets in the Gold State Coach and taking to the Palace balcony in their glittering crowns.More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen’s funeral in September.",
        "A Palace spokesman said: “Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion – and to the very many who turned out to show their support in such numbers in London and further afield.”Camilla meanwhile asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.",
        "The simple posy, including auriculas, the late Queen’s favourite lily of the valley, and one of Charles’s favourites hellebores, by the King and Queen’s go-to florist, Shane Connolly, was laid at the memorial.Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother.Camilla did not carry the flowers on Saturday as it was a coronation not a wedding, the Palace said.",
        "In Windsor, royal fans – some draped in Union flags or wearing Union flag dresses – started arriving hours before the concert was due to begin at 8pm.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, will see Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls and singer Sir Tom Jones appear via video message.The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh – seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.There will also be performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will perform too.",
        "The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Thousands of street parties were also being held across the country with people encouraged to come together for the Coronation Big Lunch.Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.",
        "The Duke and Duchess of Edinburgh will attend a Big Lunch in Cranleigh, Surrey, the Princess Royal and Vice Admiral Sir Tim Laurence will be guests at a community street party in Swindon, Wiltshire, and Princesses Beatrice and Eugenie will visit a Big Lunch in Windsor.Meanwhile, as part of the Coronation Concert, choreographed lasers, projections and drone displays will radiate over historic bridges and buildings.Seven of the 10 locations involved in the event, Lighting Up The Nation, have been disclosed so far, including Blackpool seafront in Lancashire, where people can join a viewing party from Blackpool Tower.Sheffield Town Hall will showcase a display in the Peace Gardens, while Newcastle’s Tyne Bridge and Gateshead’s Millennium Bridge lights will cast riverside reflections for an audience stretching between the quays.",
        "A drone show will light up the sky above the Eden Project in Cornwall, and its biomes will become multicoloured for spectators invited from the local volunteer community.Light shows will also brighten up Belfast, Edinburgh and Cardiff at various locations.The remaining three locations will be revealed during the concert.– The Coronation Concert will be broadcast on BBC One, BBC iPlayer, BBC Radio 2 and BBC Sounds from 8pm."
    ]
}