{
    "articleURL": "/wires/aap/article-12053537/Western-Force-feel-sting-Crusaders-tail.html",
    "content": [
        "The Crusaders have put a big dent in the Western Force's Super Rugby Pacific finals hopes with a clinical 48-13 bounce-back win in Christchurch.",
        "The defending champions delivered a set-piece masterclass to put the Force to the sword with an eight-tries-to-one drubbing at Orangetheory Stadium.The Crusaders dominated the scrum and lineout, made hay with their deadly driving maul and dazzled their home fans with some beautifully executed tries from a backline brimming with class.All Blacks five-eighth Richie Mo'unga typically pulled the strings but some lovely touches from star fullback Will Jordan in his long-awaited return from an inner-ear vestibular issue would have most pleased Crusaders coach Scott Robertson.Jordan hasn't played since last September and, with 21 tries from as many Tests, the attacking sensation's successful comeback would also have been a huge relief for embattled All Blacks coach Ian Foster five months out from the World Cup.The Force briefly led through a pair of penalty goals from debutant flyhalf Max Burey but Jordan put the Crusaders back in control after slicing through the defence to put winger Leicester Fainga'anuku over in the 25th minute.The 11-times champion were never headed again.A Macca Springer try a minute from halftime was a coach killer for Force mentor Simon Cron and vaulted the Crusaders out to a 24-6 lead at the break.Any hopes of a comeback were extinguished a minute after halftime when hooker Brodie McAlister completed a try-scoring hat-trick with his third driving maul five-pointer.",
        "Stung by last week's loss to the table-topping Chiefs, the Crusaders continued piling on the tries with Fainga'anuku and Springer both collecting doubles and hooker Codie Taylor also crossing.The Crusaders would have won even more handsomely had Mo'unga not missed five conversion attempts, mostly from out wide.\"We were outclassed in every aspect of the game and the scoreline shows that so well done to the Crusaders,\" said dejected Force captain Michael Wells.With the Hurricanes suffering a surprise 27-24 loss to the Fiji Drua earlier on Saturday, the Crusaders surged into second spot with the bonus-point victory.\"We put in a lot of work during the week after last week's performance, especially the scrum and happy to see that,\" McAlister said.The injury-hit Force are at the other end of the table, languishing in second-last position above only the winless Moana Pasifika and probably needing to win three of their last four games to scrape into the finals for a first time after missing out last year by one competition point.They host the Drua next week before having further home games against heavyweights the Chiefs and Brumbies plus a trip to Melbourne to face the Rebels.Wells said the Force couldn't rely on their three-from-three record in 2023 at nib Stadium against the dangerous Drua.",
        "\"Obviously the Drua are a fast-flying team on attack,\" Wells said.\"If our defence doesn't turn up, doesn't force turnovers and lets them dictate territory and the speed of the game, that's going to be an issue for us.\""
    ]
}