{
    "articleURL": "/femail/article-12041661/As-Kevin-Costners-wife-filed-divorce-worked-deal-workaholics.html",
    "content": [
        "Christine Baumgartner, 49, called it quits from Kevin Costner, 68, on MondayREAD MORE: Costner's Untouchable wealth? Star's $250M estate is reportedly protected by a pre-nupKevin Costner's wife has called it quits following 18 years of marriage - six months after she reportedly told him to quit hit series Yellowstone because his busy filming schedule was impacting their family. ",
        "Now, relationship experts have told FEMAIL how it's not just the obvious betrayals like cheating that can be toxic to a partnership - but being career obsessed can lead to negative impacts too.British dating coach Tina Wilson suggested that those, like the Hollywood star, who are 'consciously putting their careers first' invite 'relationship disaster' if they do not 'compromise and prioritise' their partner.Christine Baumgartner filed a petition to separate from the Oscar-winning actor on Monday, listing the reason for the split as 'irreconcilable differences' and asking for joint custody of their three children - Cayden, 15, Hayes, 14, and Grace, 12.But in October, Ms Baumgartner reportedly gave Mr Costner, who she wed in 2004, an ultimatum to quit the neo-Western show, Yellowstone, because he would be filming in Montana for months at a time and away from their Los Angeles-based family.",
        "'It's really knocked a hole in their family life,' a friend of hers told Radar. 'She wants a firm commitment this is his last season — or he might have to hit the dusty trail!'  However, Mr Costner continued to lead a busy lifestyle.Hope Flynn, founder of FeedMeFemale, said: 'When someone is a workaholic it can feel like they are choosing to go to work rather than be with their partner. ",
        "'Dating a workaholic can make people feel disconnected from their partners which in turn can make that person feel less desirable and less attractive as they are not a priority. 'And this can be frustrating for the person in the relationship \"outside of work\". If work and work’s demands are causing them to continually be stressed, this impacts the persons wellbeing and in turn, can impact their partner and their family.'Also being in a relationship with someone that doesn’t know how to leave work at the door can be difficult as it’s like they are not emotionally present with you and their mind is still on work. Relationship coach Kate Mansfield added, however: 'We need to be aware of who someone is when we meet them. Getting involved with a famous actor or celebrity is always going to involve sacrificing time together. It’s just the reality of their job.'Celebrities have always had this problem, it’s an unfortunate part of being extremely successful and I think as the partner you need to accept it or find a partner with a less consuming career.'Discussing how best to work through the issue, relationship expert and founder of Wingman, Tina Wilson, said: 'I would suggest a couple going through this situation talk openly about what it is they are ready for and what future lifestyle they envision. ",
        "'It could be they love each other but if their lives are no longer compatible then they are ultimately drifting apart and one will resent the other. 'Perhaps one feels there is unfinished business in their professional life and are not ready for a \"quiet life\" or there could be unaddressed issues in the relationship that need attention, and the other party is using being busy as a tool to avoid a problem.'If like Tom Brady and Kevin Costner one party is consciously putting their careers first, it can indicate they do not prioritise their relationship and it is a recipe for relationship disaster if compromises are not made by both parties, because a relationship is all about give and take.'",
        "Hope echoed this, adding: 'Communication is key to a healthy relationship and when a problem such as work gets in the way a healthy line of communication needs to open up.'Couples should be able to work through this if they keep in mind these factors: emotional well-being, trust, respect and friendship.'If couples still care about true love, it will not be over. Both partners need to be proactive about a lifestyle change and figure out how to manage a healthy work life balance that works for them both.",
        "'Boundaries need to be created and they can be done so in small ways such as not bringing any laptops or work related things into the bedroom, scheduling time together at least once a week like a date night and taking a specified time to talk to your partner about their work as it’s something that’s important to them but keep within a time frame.'But Mr Costner's not the only celebrity whose hectic schedule or work ethic has impacted their relationship - with Taylor Swift and Joe Alwyn's romance struggling over their career differences. The Anti-Hero hitmaker, 33, and the British actor, 32, shocked fans with the revelation they had gone their separate ways after six years last month - with a source close to the star saying Joe had struggled to get his career off the ground, driving a wedge between the pair, especially as Taylor headed back on tour.The source told DailyMail.com: ‘The bottom line for the difficulties in their relationship was that Taylor’s career took priority over Joe’s – which can be awkward for a couple when it’s not balanced. 'This drove them apart and ultimately, they both realized they were not on the same page anymore. It’s been hard for Joe trying to make it in Hollywood and not quite becoming leading man material while dating one of the most famous women in the world over the last six years.",
        "‘It was easier during the pandemic when it was just the two of them, but once things returned to normal, Taylor Swift the superstar emerged, and their differences were even more apparent. 'They really made a go of it and tried everything they could but ultimately were unable to save the relationship.Taylor has thrown herself back into her career of late, releasing acclaimed new album Midnights and heading back on the road for The Eras Tour.",
        "Elsewhere, Reese Witherspoon and husband Jim Toth reportedly lived separate lives for months before their divorce, which was said to be fuelled by the actress' busy schedule that led her to earn a reputation as one of the most in demand women in Hollywood.The star announced her divorce in March, just two days before her 12-year wedding anniversary, however she and Mr Toth had not been seen in public together for months.Insiders revealed to RadarOnline that the couple would 'go days without interacting' in the lead up to their split, which some put down to the actress' hectic lifestyle.The duo, who share son Tennessee, 10, would reportedly only speak to discuss their family, while Mr Toth would consistently miss important events in her life. Friends of the actress revealed his behaviour had been 'raising eyebrows' long before their split.",
        "'Jim is hardly ever with her,' a source told the outlet. 'It's always like that'. Despite saying they enjoyed 'many wonderful years together' as they announced their split, insiders also claimed that the marriage had steadily become platonic. 'There's no big scandal or drama, just two people who essentially became co-parents and don't really have any romantic feelings for each other anymore,' a source told PageSix. Meanwhile, in one of the most shocking celebrity splits of 2022, supermodel Gisele Bundchen, 42, and NFL legend Tom Brady, 45, went their separate ways after 13 years of marriage and two children.The NFL superstar and Brazilian supermodel confirmed their split on October 28 following weeks of speculation.Gisele filed for divorce because she felt her partner 'wasn't as attentive as he should've been' - after he quit the NFL, before announcing his return to the sport just one month later.'That's what [Gisele] wanted: to be heard. And he wasn't hearing her,' an insider noted to PEOPLE.As Bundchen, a native of Brazil, raised their two children — Benjamin, twelve, and Vivian, nine — the athlete was 'busy following his passion.'Brady also shares 15-year-old son Jack with ex Bridget Moynahan.Someone familiar with the quarterback dished, 'When he's in the middle of a season, [Brady] does what most NFL players do: live, breathe, eat and sleep football,' adding, 'Tom is more like that than anyone.'Another source countered: 'He was always there for her and the kids. Even during football. He's an anomaly because he's played for so long. Yes, he worked just like any parent worked, but he always spends a great deal of time with his family.'"
    ]
}