{
    "articleURL": "/tvshowbiz/article-12060589/Olivia-Wilde-SIX-PACK-six-months-splitting-Harry-Styles.html",
    "content": [
        "Olivia Wilde has been putting in the hard hours at her favorite gym in Studio City, California all year long.",
        "And the Hollywood actress' reward is a six pack of abs. The Don't Worry Darling star and director - who was seen with her son over the weekend - showed off her toned midsection as she modeled a small black sports bra outside the gym on Monday.Her puffy off white jacket was worn open to offer a generous view of her toned tummy. The 39-year-old New York native added skintight leggings also in black and white sneakers. The star was seen post workout as she was sweaty from her exercises and pulled her hair up. She carried a canvas book bag as well as a one gallon TOBA water bottle with a pink beverage inside.",
        "The House actress, born Olivia Jane Cockburn, has been visiting the gym daily since she split from singer Harry Styles in November.The beauty seems to be working off her frustration over the failed romance at the gym, which has proved to be a great idea.Though she has always been slender, now Olivia is incredibly toned with not only a flat tummy, but also sculpted arms and strong legs.Wilde does not seem to have moved on romantically, however, as she has yet to romance a new man.Meanwhile, Style has been seeing Olivia's friend Emily Ratajkowski as the two were seen kissing in Japan last month.",
        "But Olivia has other things to focus on these days.She has been repairing her relationship with estranged husband Jason Sudeikis.Last week they were seen hugging at their son Otis' soccer game in Los Angeles.",
        "The star dressed down for the match as she joined the Ted Lasso actor, 47, on the sidelines.The former couple, who officially split back in November 2020, have been involved in a child custody battle over their two children: nine-year-old Otis and daughter Daisy, six. The Hollywood stars have also been thrust back in the spotlight amid their former nanny's wrongful termination lawsuit. However, both Wilde and Sudeikis put aside their issues to attend their oldest child's soccer match over the weekend. ",
        "Jason also kept his look simplistic for the outing, and donned a pair of dark navy trousers along with a vibrant, blue hooded sweatshirt with a Nike logo on the upper right side. As the formerly engaged couple arrived to watch the soccer game on Saturday, they flashed smiles. The stars stood side-by-side as they proudly cheered on their son, Otis, and held a light-hearted conversation on the side of the field. The outing comes shortly after Jason and Olivia claimed in new legal documents, per TMZ, that their former nanny, Ericka Gernaro, did not file her wrongful termination lawsuit correctly in California as a civil lawsuit. ",
        "They further claim that the lawsuit should have been filed in the state of New York as a private arbitration. The former couple informed TMZ in a statement published on Thursday that, 'It is unfortunate that this private matter continues to play out in the press.' 'Our focus has been and will continue to be to steadfastly protect our family in the face of harassment of any kind. We are confident that the evidence brought forward will affirm our position to summarily dismiss this case and bring our family peace.' Ericka, who had worked for the Hollywood stars from 2018 until 2021, claimed earlier this year in February that she was fired after asking for a three day medical leave due to the stress of the job. However, both Jason and Olivia allege that she was not fired, but that she actually resigned. ",
        "The former couple says Genaro had her salary doubled in 2020 and that she was 'taken care of by the family.'In one instance, they say that they paid for her and her dog to stay in London's Rosewood Hotel, after she left her job. The final bill came for over $22,000 thanks in-part to food and booze room service. They further claim that travel expenses of around $17,000 for Ericka to move from London to the United States was also reimbursed. ",
        "They also allege that Genaro was in breach of her working agreement by going to the media about the couple's intimate problems as well as lying about her criminal record. They are quoted as saying that Genaro has described herself as 'ruthless.'"
    ]
}