{
    "articleURL": "/wires/reuters/article-12054317/Italys-Berlusconi-sends-video-message-Forza-party-hospital.html",
    "content": [
        "MILAN, May 6 (Reuters) - Former Italian prime minister Silvio Berlusconi sent a video message to his Forza Italia party on Saturday in his first appearance since being hospitalised a month ago, saying he is ready to return to work.",
        "Wearing a blue shirt and suit and heavy make-up, Berlusconi, 86, appeared sitting at a desk with the Italian and European flags behind him next to a Forza Italia banner.\"I never stopped, not even in the past few weeks. I worked on the party's new structure and I'm ready to return to work with you and fight alongside you our fights for freedom,\" he said.Berlusconi recorded the message from his hospital room after doctors and relatives prevented his discharge out of fear he would try to attend in person a two-day convention of his Forza Italia party in Milan, according to daily La Repubblica.The four-times prime minister was hospitalised on April 5 and spent nearly two weeks in intensive care, stirring speculation that his life might be in danger and drawing a stream of family and friends to his bedside.Treated for a lung infection linked to chronic leukaemia, Berlusconi came out of intensive care on April 16 and his condition has steadily improved, doctors' statements say.\"In the past few weeks I've felt the affection ... of so many people, including my political opponents and I obviously thank them, but it's your affection, it was your embrace that helped me overcome a really dangerous pneumonia,\" he said.",
        "Speaking for around 20 minutes, Berlusconi recounted at length his decision to relinquish executive roles at his business empire 30 years ago to enter politics \"to save Italy from communism.\"\"We're the essential and loyal pillar of this majority, we're the backbone of this government,\" he said, referring to the right-wing administration of Prime Minister Giorgia Meloni. (Reporting by Valentina Za; Editing by Mike Harrison)"
    ]
}