{
    "articleURL": "/columnists/article-12050543/JASON-GROVES-Rishi-Sunaks-just-given-rudest-wake-calls-local-elections.html",
    "content": [
        "By 8am today, the Conservatives had already lost more than 200 seats If Rishi Sunak was in any doubt about the scale of the challenge he faces then the local election results have given him the rudest of wake up calls.",
        "By 8am the Conservatives had already lost more than 200 seats. By the end of the day that number could well rise to 1,000 or more – very much at the worse end of expectations.Across the country, angry Conservative councillors were blaming the Government for their woes – and there were signs that that the Tory Right will make a fresh bid to force the Prime Minister to change direction on issues like tax.No one expected these results to be good for the Tories. After 13 years in power it would be hard for any Government to generate much excitement at this point in the electoral cycle. Throw in the cost of living crisis, the political turmoil of the last 12 months and the highest taxes since the Second World War and it is not hard to see why many former Tory voters have switched sides in protest or simply stayed away.",
        "But there will be deep concern that Conservative support is collapsing in parts of the country like Stoke-on-Trent and Boston, in Lincolnshire, where support for Brexit was strongest.Conservative MPs in the traditional Tory heartlands of the Home Counties will also be alarmed to see the Liberal Democrats making significant inroads in True Blue areas like Windsor and Maidenhead.",
        "Alan Jarrett, outgoing Tory leader of Medway council, in Kent, where Labour seized control for the first time in 20 years, summed up the mood by saying the government needs to 'get its act together'.Yet despite Labour excitement at gains in key target areas such as Stoke, Plymouth and Medway, it is far from clear that Labour has sealed the deal with the electorate in the way Tony Blair did in the local elections ahead of his 1997 landslide.In the early results, Labour was picking up barely half of the seats lost by the Conservatives, with the rest spread between the Liberal Democrats, Greens and local independents.The swing to Labour looks to be roughly in line with that achieved by Ed Miliband ahead of the 2015 election, which he went on to lose.Labour sources suggest that improved prospects in Scotland mean this kind of swing is enough to put Sir Keir Starmer on course for No 10 next year.But the failure to secure a decisive breakthrough will make it easier for the Tories to stoke fears of a Lib-Lab pact – and fuel questions about whether the public will ever embrace Labour’s stuffy leader.",
        "It will also give Mr Sunak a glimmer of hope that all is not lost.",
        "The fact he is not facing more outspoken criticism this morning is testament to the effort he has put in to calming his fractious party in recent months.But the uneasy truce with the Tory Right is set to be tested in the coming weeks.David Campbell-Bannerman, chairman of the broadly pro-Boris Conservative Democratic Organisation, said the results showed there was a ‘price to be paid’ for pushing up taxes to record levels and suggested that a return for Mr Johnson ‘should not be ruled out as an option for the longer term’.Mr Sunak will try to ‘move on’ swiftly next week by unveiling long awaited plans to ease access to GP appointments.But he now faces a renewed challenge to persuade his jittery party to hold its nerve and stick with his programme."
    ]
}