{
    "articleURL": "/wires/reuters/article-12047421/GRAINS-Chicago-grains-pare-gains-pressured-China-corn-cancellations.html",
    "content": [
        "Wheat touches 1-week high before paring gains",
        "Cancelled China sales weigh on corn pricesRenewed Russia-Ukraine tensions cast doubts on Black Sea deal(Updates prices, changes headline, changes lead, adds quotes, changes byline, changes dateline from previous SINGAPORE/PARIS)By Cassandra GarrisonMEXICO CITY, May 4 (Reuters) -Chicago grains and soybean futures pared gains on Thursday, as planting progress in the U.S. and cancelled sales to China weighed on prices.Meanwhile, wheat futures hit a one-week high earlier in the session on Black Sea doubts.U.S. export sales of corn fell to theirlowest weekly totalon record, government data showed on Thursday, as overseas buyers cancelled purchases made earlier in the year. The U.S. Department of Agriculture reported corn export sales were a net -194,600 tonnes, largely due to cancellations by China.Wheat and soybean export sales were in line with expectations.\"It's the lack of exports that we're seeing going forward,\" said Dan Smith, a senior risk manager at U.S. consultancy Top Third Ag Marketing.Markets also had eyes towards the USDA's monthly World Agricultural Supply and Demand Estimates (WASDE) coming on May 12, with an expected decrease in exports.The most-active wheat contract on the Chicago Board of Trade (CBOT) was down 0.27% at $6.38 a bushel, as of 0952 CDT (1452 GMT), after climbing earlier in the session to its highest since April 26 at $6.47-1/2. The market hit its lowest since April 2021 at $6.04 a bushel on Wednesday.",
        "Corn fell 0.93% to $5.83 a bushel and soybeans lost 0.83% to $14.05-3/4 a bushel.Ukraine President Volodymyr Zelenskiy said Russia did not appear to be interested in extending the Black Sea grain deal, but that Kyiv was focused on looking for partners to fulfill the deal and was not looking for Russian interest.However, Russia said Wednesday it will keep talking to the United Nations about the future of the deal that allows the safe Black Sea export of Ukraine grain, but would not do anything to harm its own interests.\"It will probably go down to the 23rd or 24th hour before a decision is reached,\" Smith added, noting continued market anticipation. (Reporting by Cassandra Garrison in Mexico City, Naveen Thukral; Editing by Sherry Jacob-Phillips, Sohini Goswami and Andrea Ricci)"
    ]
}