{
    "articleURL": "/news/article-12047897/My-living-hell-hands-violent-ex-five-words-taxi-driver-saved-life.html",
    "content": [
        "Daniel Little, 33, of Warrington, Cheshire, beat up ex-partner Rosie Frankish, 26Mother-of-two had severe cuts and bruises, reduced hearing in left ear, 10cm bruise over shoulder to elbow, 5cm bruise over chest, swelling to head and scalpAfter six hours of 'torture', she managed to escape with the help of a taxi driverA young mother whose life was saved after she whispered five words to a taxi driver has shared details of the appalling abuse she suffered at the hands of her ex-partner.",
        "Mother-of-two Rosie Frankish was battered and beaten by her ex-partner Daniel Little in a six-hour attack during which he smeared dog faeces on her face and threw hair conditioner into her eyes.He then dragged the 26-year-old into a taxi, but quick-thinking Rosie managed to secretly alert the driver and he drove her to safety.Little, 34, was jailed at Liverpool Crown Court last week after admitting assault occasioning actual bodily harm and false imprisonment. He was jailed for three years and seven months.Rosie from Warrington, Cheshire, revealed the years of horrendous abuse from Little, including him cutting up all her clothes, her passport, and forcing her to stay awake all night.",
        "Little was so jealous that he attacked a man he believed had once spoken to Rosie and sent her a picture of his bloodied hands to prove the assault.Rosie said: 'He was immensely controlling to the point where I was completely brainwashed. I thought my world started and ended with him.'If you are trapped in a violent relationship, it isn't enough for people just to say you should walk away. You feel a loyalty and a dependency on that person, and you can't see the reality of what they are.'You always believe they will change, that this attack will be the last one.'",
        "Rosie met Little seven and a half years ago, in Warrington, Cheshire.Rosie said: 'I was pregnant and had split with the baby's father. Daniel was eight years older and seemed to offer friendship and security. 'He paid me lots of compliments, he was lovely, very jokey and confident.'When the baby came, he was really supportive and loving.'",
        "The couple moved in together and the following year they had a child together. But during the pregnancy, Daniel changed.Rosie said: 'I was three months pregnant when he grabbed my hair in an argument.'Rosie was determined to make their relationship work for the sake of their two children. But Daniel became increasingly controlling and violent.She said: 'He was obsessed with me having affairs, even though I was never once unfaithful.'When we went out, I had to have my eyes down, at the pram, so I couldn't look at other men. When I was home, I had to hand him my phone and keys. 'He alienated me from all my friends and family. I was in lockdown way before lockdown was ever thought of.",
        "'He went through every single message on my phone and would lose his temper over the slightest thing.'He'd go out all night and come home in the early hours and force me to stay awake whilst he grilled me about me seeing other men, about my text messages, about my shopping list, about every single aspect of my life. Then I had to get up with the children whilst he slept all day. ",
        "'It was emotional torture, and it was exhausting.'He hit me in the face with his mobile phone one day and I have a scar above my eye. Another time he threw me against a kitchen cupboard and knocked me out cold.'He timed me going to the shops and if I was late back I was in trouble because he presumed I'd been having affairs on my way home.'Another night, after he'd been on a bender, he made me pile my clothes up in the middle of the room and then he cut them all up. 'He cut my passport up too. He didn't want me going anywhere without him.'I tried to leave him, after he'd gone to bed, and I went to my family. They called the police but, in the end, I couldn't go through with the charges. 'I felt as though I had to stay with him, as though he was my whole world.'Rosie said she finally found the strength to walk away in 2020, after Little went away on a package holiday with his friends.",
        "She said: 'I really loved it whilst he was away. For the first time, I felt I could breathe. I could message my mum, without panicking I'd be in trouble for it.",
        "'When he came home, he lost his temper within five minutes of walking through the door, and he began punching me in the head. I was wearing a white crop top and it was soaked with blood. I've kept the top as a reminder of what he put me through.'Mum and I began planning for me to leave him and I started getting clothes together in a big washing basket, just making small changes, so I could leave him in secret.'Six weeks on, Rosie left Little, luring him out of the house with a trip to the bookies, before arranging for her mother to come and collect her and her children. She rebuilt her life, but two years on Little made contact asking to see the children.Rosie said: 'I felt very torn. I didn't want to deprive my children of their father, but I was wary of him. 'Daniel insisted he had changed, telling me he had a job and he had calmed down and saying he deserved to see his kids.'I agreed to days out with the children and it went well at first for all of us.'",
        "But she noticed he was again becoming increasingly possessive and controlling and decided to take a step back.",
        "She said: 'After all I had been through, I was not about to let him worm his way back into my life. I told him he could still see the children, under supervision, but I would not be there.'Daniel did not take the news well and he spiraled over a period of days, eventually ending up under arrest for attacking a stranger. When he was released in December last year, he went immediately to where Rosie and her children were living.She said: 'I was woken about 11.30pm by a loud banging. I went down to open the back door and he barged in from the garden.'He was telling me it was all my fault, that I taken away his family, and I would have to pay for it.'I knew the attack was coming. His eyes were completely dead. I had no way of getting through to him.'Little pinned her against the fridge freezer by her throat before throwing her against the kitchen units. The attack continued upstairs, and into the bedroom, where he punched, kicked and slapped her repeatedly.",
        "Rosie said: 'He kept telling me I needed to learn my lesson. 'Every now and again he stopped hitting me and made me hug him, and he'd say: \"I pinkie promise I won't hit you again\" - then he'd start hitting me, like it was all part of some sick game. It was torture.",
        "'He ran himself a bath but made me sit on the toilet so he could keep an eye on me. I thought about making a run for it, but I was worried he'd catch me.'He picked up a full bottle of hair conditioner and tipped it all over my head, into my eyes, and then threw the bottle at me and laughed.'The dog came upstairs. He was very frightened, he hadn't been out for a poo because I wasn't allowed to take him and he pooed on the tiles. 'Daniel smeared the faeces right into my face, grinding it into my cheeks and my hair with a towel.'I was so upset and frightened that I wet myself and he wouldn't let me get changed. I thought he was going to kill me.'Rosie saw her chance of escape when, almost six hours later, Daniel announced he wanted to return to his home to get some clothes.",
        "She said: 'I called him a taxi and I thought I might be able to persuade him to leave. But he booted me hard and forced me into the taxi with him.'All through the journey, I was wondering about throwing myself out on to the road. I wanted to tell the taxi driver but wasn't sure if he'd help me.'When the taxi stopped, Little got out for a cigarette and Rosie seized her chance.She said: 'I knew Daniel was looking at me, expecting me to get out after him, so I said very quietly, without moving my face: 'Please drive. Just go. Now.''The cab driver said: \"Where do you want me to go?\" and I saw Daniel's hand reach for the door handle. It was like it happened in slow motion.'I yelled, and the driver just put his foot down and we were off. Daniel was trying the door handle as we left him behind. 'I couldn't believe it was over. He took me to the police station and I got help.'Rosie was taken to hospital with severe cuts and bruises, including a black eye, reduced hearing in her left ear, a 10cm bruise over her shoulder to elbow, a 5cm bruise over her chest, and swelling to her head and scalp.",
        "Officers arrested Little shortly after. He appeared before Liverpool Crown Court last week and admitted assaults and false imprisonment.In her impact statement, Rosie told the court: 'Psychologically this has affected me. I cannot sleep properly.'I feel like I cannot talk to anyone but my family. I feel vulnerable as a result.'When I close my eyes, I can see his face from that night. I used to love being on my own but now I cannot do that.'In mitigation, the court heard how Little is 'deeply ashamed' of his behaviour.His barrister said: 'He accepts that he needs to be in prison. He knows he must be punished.'Little has a lengthy record of 17 previous convictions for 34 offences, including for violence.Concluding, recorder Michael Blakey described the attack as a 'prolonged and persistent assault'.'There is serious psychological harm. You humiliated that lady,' he said.Little was sentenced to three years and seven months in prison, of which he will serve half of before being released on licence.Rosie said: 'I think his sentence should have been much longer. He could have killed me that night and perhaps he would have, if it wasn't for the taxi ride.'I feel deeply traumatised by what he did.'It was Daniel's aim to ruin me but that won't happen. I won't let him win. 'I'm building a new life for me and my children, and our love is far stronger than his hatred.'"
    ]
}