{
    "articleURL": "/femail/article-12054023/Prince-Louis-stole-spotlight-appeared-disinterested-King-Charless-coronation.html",
    "content": [
        "Prince Louis, five, offered another of his hilarious animated displays during the Coronation - following his antics at Platinum Jubilee last yearHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.ukCORONATION LIVEBLOG: Click here to follow live updates throughout today Prince Louis always manages to steal the show at royal engagements, from sticking his tongue out at his mother or dramatically covering his ears on the Buckingham Palace balcony - and he didn't let his fans down today. ",
        "The Prince and the Princess of Wales's youngest son Louis - who turned five on St George's Day on April 23rd - melted hearts again today at Westminster Abbey for the King's Coronation.As the Wales children departed the Abbey after the ceremony, the youngster was spotted cheering for his grandfather from the royal carriage, exclaiming: 'Yaaaay Say king. Yaaaay king,' lip reading expert Jacqui Press told Femail. He was also seen excitedly pointing at royal fans and whispering to his sister Charlotte as they departed.  The fourth in line to the throne, who looked regal in a bespoke outfit by a Savile Row tailor, appeared disinterested earlier in the day, as he yawned throughout the ceremony. The cheeky prince looked around the Abbey and pointed at things as he sat next to his older sister Princess Charlotte during the opening moments of the historic service. ",
        "When his sister tried to hold up the order of service for him to have a look at, he looked the other way and was seen yawning as he entered the Abbey while holding hands with Charlotte. During the national broadcast, Louis was seen kicking his feet around, forcing his mother Kate to whisper to him.The adorable prince later grumpily slumped back in his seat proving that the long service was possibly too much for a five-year-old. ",
        "The prince was not initially supposed to attend the Coronation, however it appears that at the last minute the family decided to include him in the service.Later on Louis gave an animated display on the Buckingham Palace balcony as The Mall was swamped by tens of thousands of cheering patriots.The prince pulled silly faces during the RAF flypast, which had to be scaled back to just helicopters and the Red Arrows because of the heavy rain in London.The cheeky royal stuck out his tongue and looked astonished as the red arrows flew over the palace which was caught on the national broadcast.  It is thought that Prince Louis won't attend tomorrow's concert in Windsor.  ",
        "Previously, Prince Louis stole the show at the Trooping the Colour celebrations in June last year, where he pulled a series of hilarious faces - including covering his ears in front of the Queen when the sound of the roaring plane engines became too much.Today, the siblings arrived without their older brother Prince George, nine, who is a Page of Honour for his grandfather and following in the procession behind the King. Princess Charlotte is wearing an Alexander McQueen dress and cape in ivory silk crepe with ivory stitch embroidery featuring rose, thistle, daffodil and shamrock motifs, to signify the four nations.   ",
        "Charlotte is also wearing a Jess Collett x Alexander McQueen headpiece with silver bullion, crystal and silver thread work, similar to the headpiece the Princess of Wales is wearing.",
        "Meanwhile, younger brother Louis looked regal in a bespoke outfit. For the historic occasion, the young Prince is wearing an outfit made by Savile Row tailors Dege and Skinner which consists of a Hainsworth Garter Blue Doeskin Tunic with specially designed lace embellishment to the collar, cuffs and fronts. The leg garment is black complete with Garter Blue stripe.His parents are aware of the responsibility on his young shoulders, and it is thought that Prince Louis won't attend tomorrow's concert in Windsor.The youngsters reunited for the grand carriage procession back to Buckingham Palace after witnessing King Charles being crowned at the Abbey.This morning, the siblings watched as Charles became the 40th reigning sovereign to be crowned at Westminster Abbey when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head, in a ceremony dating back to William the Conqueror in 1066."
    ]
}