{
    "articleURL": "/wires/pa/article-12061415/Disabled-people-facing-cost-breathing-crisis-amid-energy-bills-TV-ad-warns.html",
    "content": [
        "Many disabled people are facing a cost-of-breathing crisis amid higher energy bills, a new television advert has warned.",
        "Disabled people who rely on energy to move around, speak and breathe risk losing their independence, health and wellbeing, a charity said as it revealed a quarter of the callers to its helpline who rely on medical equipment have had to switch it off to save money.Scope, a disability equality charity, said that while much of the population is looking forward to using less energy as the weather warms up in the summer, many disabled people will not have that option. As the spiralling cost of living forces many people to cut down their energy use, for disabled people, it can be life and death  Toby Greaves, Scope  The charity’s advice lines have supported almost 38,000 disabled people over the past year and more than a third (38%) of callers to its energy helpline are in energy debt – on average by more than £1,000.Scope said two in five calls to its helpline have medical equipment and that almost a quarter of these people (23%) have had to switch medical equipment off to cut costs.In research published last month, the charity said that, on average, disabled households need an additional £975 a month to have the same standard of living as non-disabled households.",
        "The new advertising campaign will air on ITV throughout May and June to highlight how disabled people are being affected by the cost-of-living crisis.",
        "Featuring six disabled actors, it shows disabled people relying on electrical equipment such as CPAP (continuous positive airway pressure) machines to breathe, hoists to get in and out of bed, and communication devices to speak.The charity said its disability energy support service has saved disabled people almost £2 million over the past year through advice and support.Toby Greaves, head of services at Scope, said: “As the spiralling cost of living forces many people to cut down their energy use, for disabled people, it can be life and death.“With summer on the horizon, many people will be turning their thermostats down and hoping to see their energy bills drop.“But for disabled people who rely on energy to stay alive, going without isn’t an option.“Our helplines are being inundated with heart-wrenching calls from disabled people and their families, who have switched everything off and have nothing left to cut back.”He encouraged anyone who is in need of help to contact Scope for free, practical and accessible advice.He added: “We can help you navigate benefits, manage your energy bills, access grants and claim the financial support you’re entitled to.”Susie Braun, ITV’s director of social purpose said: “Our partnership with Scope seeks to highlight the support available to disabled people who are dealing with the life-changing impact of additional increased costs. We’re delighted to partner with Scope once again on such an important initiative.”"
    ]
}