{
    "articleURL": "/news/article-12049629/Texas-rancher-hammering-Biden-administration-border-situation.html",
    "content": [
        "Rancher Stephanie Canales called Biden's treatment of the border 'a joke'Migrants lined up at the border Thursday ahead of Title 42 expiring May 11Republicans in the Senate have begged Biden to extend Title 42 further As migrants lined up at the U.S.-Mexico border on Thursday ahead of Title 42 expiring, a Texas rancher says the situation has not improved at all and the Biden administration has made it worse.",
        "Hundreds of would-be asylum-seekers await their chance to sneak into the country illegally ahead of the expiry on May 11 of a Trump-era COVID policy that makes it easier to boot out immigrants.Title 42, the COVID-19 pandemic-era policy that helped law enforcement quickly remove illegal migrants at the border, is set to expire on May 11.The Biden administration will send an extra 1,500 troops to the southern frontier to join the 2,500 already battling to stem the flow of people crossing over. However, Texas rancher Stephanie Canales called the Biden administration's treatment of the situation 'a joke.' ",
        "'You want to laugh, it's a joke. And those of us that live down here every day that are dealing with this, it has not improved at all,' Canales told Fox Business. 'It just continues to get worse. And I don't care what lies they spew to the American people. They are lies because it's only gotten worse every day.' Her comments came after White House spokeswoman Karine Jean-Pierre said the Biden administration has made efforts to address the 'broken' immigration system. Canales says she constantly has to battle against migrants crossing through her ranch every day. 'When they drive through our property, that's fence damage. So we're constantly repairing fences, we're constantly replacing gates that they will blow through on their vehicles when they're being chased by law enforcement,' Canales said.",
        "She noted inflation under President Biden has only exacerbated her family's troubles. 'We've also had to install cameras throughout our property... but the cameras allow us to see who's on our property at any given time, so then we can alert the patrol. But it's come at a huge cost to us and it's very, very frustrating. And no, we don't feel safe at all.' Canales said sending troops to the border was a good decision but one that may have come too late.'God bless our troops, I'm sure they will be a big help to the Border Patrol and to our state troopers that are down here. But, where were they a long time ago? They need to shut the border because people are just coming over here. It's nonstop.' ",
        "Republican senators wrote in a letter to Biden signed by members of the Judiciary Committee and Minority Leader Mitch McConnell Wednesday that Title 42 is imperative to keeping order at the border.But Title 42, a CDC policy, will end with the Covid-19 emergency, and it's not clear if there is any legal authority to keep the rule in place beyond the emergency. South Carolina Senator Lindsey Graham called on Biden to find an 'adequate substitute' for Title 42 if he could not keep in place the current public health rule. ",
        "Graham said migrant caravans are camping out along the border because they don't believe other border policies - namely Title 8 - will provide an 'adequate substitute' to Title 42. 'The reason 10,000 people are in one city waiting for May the 12 is because they don't see an adequate substitute,' he said. ",
        "'We write today to implore you to reverse your decision to end the Title 42 public health order, set to expire on May 11. According to the Department of Homeland Security's own estimates, border surges in response to the termination of the Title 42 order could reach 13,000 encounters with illegal immigrants a day,' the letter says. So far the president has ignored Republican pleas to extend the emergency powers that allow authorities to deport migrants without hearing their asylum case.   Ken Cuccinelli, who served as Deputy Secretary of Homeland Security in the Trump administration, told Fox News the US will face a surge in asylum claims he branded 'an invasion.' 'A good chunk of the southern hemisphere is lining up at the border,' he said. 'They are going to dash into the country.''This administration doesn't care,' the former lawyer added. ",
        "A deal was struck with Mexico on Thursday for the country to take back Cubans, Haitians, Nicaraguans and Venezuelans who are rejected from the US border from next week.  ",
        "'This is a hemispheric challenge that demands hemispheric solutions,' DHS Secretary Alejandro Mayorkas said.'Working with our neighbors in the region, we can and will reduce the number of migrants who reach our southern border,' he added. But the Republican-led House of Representatives, the lower chamber of Congress, is planning to pass tougher immigration laws Thom Tillis, the Republican senator from North Carolina, said the end of Title 42 'sets the table' for Congress to craft new legislation amid predictions of a surge in arrivals.",
        "More than 2.3 million migrants tried to illegally sneak into the United States across the Mexican border last year, according to U.S. Customs and Border Protection.That is up from 1.7 million people in 2021 and just over 450,000 the previous year when much of the world was locked down during the coronavirus pandemic.Emergency powers to remove migrants, known as Title 42, come from a 79-year-old federal law that Trump used from the start of the coronavirus pandemic.Republicans are also angry that Joe Biden axed his predecessor's flagship anti-immigration policy: a $16.6-billion border barrier along the frontier with Mexico. Some border towns, including El Paso in Texas, have already declared a state of emergency.The administration stated it will use different legal tools to try and stem the amount of people trying to cross.",
        "Those powers, known as Title 8, will mean undocumented migrants detained inside the United States will be punished in such a way that will render them ineligible to come to the country legally."
    ]
}