{
    "articleURL": "/wires/reuters/article-12059377/PacWest-rallies-dividend-cut-bolster-capital.html",
    "content": [
        "By Niket Nishant and Chibuike Oguh",
        "May 8 (Reuters) -PacWest Bancorp shares pared early gains on Monday, dragging down other U.S. regional banking stocks, as the Los Angeles-based lender's decision to slash its quarterly dividend failed to stem worries about its financial stability.PacWest announced on Friday it would pay a dividend of just 1 cent per common share, instead of its regular 25 cents, citing economic uncertainty and banking volatility.\"The dividend cut is not a good sign,\" said Jamie Cox, managing partner at Harris Financial Group. \"We're going to be having this back and forth with regional banks until the FDIC explicitly guarantees bank deposits and the Fed helps them repair their balance sheet.\"The Federal Deposit Insurance Corp, which insures $250,000 in deposits per person per bank, said last week it saw merits inincreasing that backstopfor business accounts.Treasury Secretary Janet Yellensaidon Monday the U.S. banking system had adequate capital and liquidity and that regulators are prepared to step in with tools used in the past if current pressures led to a contagion.Yellen also said the Treasury Department is reviewing the FDIC's report on increasing its deposit insurance coverage and is ready to work with Congress to make changes to the current limits, if needed.PacWest shares soared on Friday, rebounding from a record low last week, after the bank also said it was exploring strategic options, including a potential sale or capital raise. Its stock jumped more than 30% on Monday before closing 3.7% higher.",
        "Other U.S. regional banks also retreated. Western Alliance Bancorp, which had surged 11%, edged up 0.59% while Comerica Inc lost 0.8% after gaining 7%. Valley National Bancorp shed 5.39% and KeyCorp fell 1.53%.The KBW Regional Banking index fell 2.82% after gaining nearly 4.7%. The index is still down more than 26% since worries about a banking crisis emerged in March.First Horizon Corp shares fell 2.19%, extending a sell-off sparked by last week's termination of the Memphis, Tennessee-based bank's proposed $13.4 billion merger with Canada's Toronto-Dominion Bank.\"Friday was a bit of a reprieve, but we continue to believe that equity manipulation, if unabated, presents a risk to the confidence needed for the U.S. banking system to function,\" Piper Sandler analyst Mark Fitzgibbon wrote in a note.Short sellers have so far reaped $455.9 million in paper profits betting against regional banks, with First Horizon topping the list of gainers on Monday, data from analytics firm Ortex showed.Regional lenders had urged U.S. Securities and Exchange Commission Chair Gary Gensler last week to probe short sellers, whose trades were causing bank stocks to be \"disconnected from the underlying financial realities.\"But hedge funds, which often engage in short selling, pushed back on Monday, saying in a letter to Gensler that a ban would be counterproductive. \"Banning short selling will only increase market volatility, hurt price discovery, and delay a recovery in regional banks' prices,\" wrote Bryan Corbett, chief executive of the Managed Funds Association trade group.",
        "Yellen said it is in the SEC's purview to regulate short selling although there is a high bar for any controls if evidence of market manipulation was found.The regional bank crisis stems from the Federal Reserve's steep interest rate hikes over the past year, and the situation could worsen for lenders, the main funders of small businesses, said Sean Kouplen, chairman and chief executive of Oklahoma-based Regent Bank, in an interview.\"I have a general fear that smaller banks are going to disappear, and we're going to end up with just a few large banks,\" Kouplen said.(Reporting by Niket Nishant in Bengaluru and Chibuike Oguh in New York; Additional reporting by Svea Herbst, Andrea Shalal, Siddarth S and Susan Mathew; Editing by Anil D'Silva and Richard Chang)"
    ]
}