{
    "articleURL": "/tvshowbiz/article-12039797/Hailey-Bieber-steps-LA-skipping-Met-Gala.html",
    "content": [
        "Hailey Bieber looked effortlessly chic while stepping out in Los Angeles on Tuesday.",
        "The 26-year-old model — who opted to skip the star-studded Met Gala with her husband, Justin Bieber, 29, for the first time in eight years — put on a casual display in an oversized, zip-up hoodie paired with track pants. She wore the black outerwear off of one shoulder to reveal the strap of black camisole and also shielded her eyes from the sun with a pair of razor-thin shades.The Rhode Skin founder looked comfortable for her busy day in Beverly Hills and was seen leaving an office building with a cup of coffee as well as a box of donuts.Before loading up her car, she was also seen carrying a cream and leather purse. ",
        "On her feet, she sported a pair of chunky black sneakers with a yellow stripe to match the design on her forest green pants. The media personality slicked back her light brunette tresses into a polished and stylish updo to highlight a pair of gold hoop earrings.Hailey also accessorized with a chunky gold chain necklace as well as, of course, the stunning and massive diamond on her ring finger.She also rocked a bright blue manicure inspired by Tiffany &amp; Co. from her look for the luxury jewelry house's grand reopening event of their flagship store on Fifth Avenue in New York City last week.",
        "The socialite donned a light and radiant makeup look featuring pink blush and coral lip gloss to showcase her natural beauty.Over the weekend, Hailey was seen with her husband leaving a café after a pop-up promoting her skincare brand.The entrepreneur and the Justice singer dressed casually for the event held at coffee shop Community Goods.On Monday, the pair were noticeably absent from the Met Gala — after she previously opened up about having a 'hard time' this year and being emotionally 'fragile'.",
        "According to an unverified screenshot obtained by Cosmopolitan, she opted instead to focus on work but intends to go to next year's fete.A few weeks prior, however, she shared a vulnerable, candid post to social media about how difficult the past year has been for her.'I like to make jokes about how I feel because sometimes it's easier than admitting I'm having a hard time,' she wrote on an Instagram Story.She then continued: 'But truthfully since 2023 started I have had some of the saddest, hardest moments I've ever had in my adult life and my mind and emotions have been fragile to say the least.'"
    ]
}