{
    "articleURL": "/femail/fashion/article-12039985/Tiktok-Italian-Nonna-dishes-criticism-2023-Met-Gala-looks-like-circus-worker.html",
    "content": [
        "An online famous Italian Nonna rated outfits at the 2023 Met GalaMaddie, from Sydney, asked her Nonna to rate each look a score out of ten An Italian-Australian nonna made famous on TikTok for her very honest reviews has dished out her criticism of the fashion at this year's Met Gala.",
        "Celebrities walking the red carpet for this year's event were asked to pay homage to Karl Lagerfeld, but their outfits left Nonna Fina less than impressed.Nonna Fina was shown pictures of the celebrities walking the red carpet by her granddaughter Maddie.She was then asked to rate each outfit out of ten - and she didn't hold back with her opinions.Model Miranda Kerr and actress Penelope Cruz earned top marks from Nonna Fina in their Dior and Chanel ensembles, while Lil Nas X and Rihanna were a let down.",
        "Kim Kardashian stunned in 50,000 pearls and shapewear at this year's gala - but Nonna had a different interpretation of the look.'I don't like it at all, she looks like she’s got chains around her and she’s going to jail,' the Nonna said before rating the outfit a five out of ten.The Nonna liked Kendall and Kylie Jenner's slightly more than their sister's - rating them each a seven out of ten.'I like Kendall's from the front but not the back - and Kylie's dress is a nice colour but it looks like rats nibbled on one half.' Dua Lipa, who was a co-host at the 2023 gala, was dressed as an iconic Chanel Bride from the 90s - but only scored seven out of ten for her look.",
        "'I really like her dress, but I don't,' the Nonna changed her opinion immediately. 'It looks like [an underskirt] you have to put another dress on top of.' ",
        "The Nonna was scandalised by Doja Cat's 'strange' outfit - scoring it a mere six out of ten.",
        "The popular singer dressed up as Karl Lagerfeld's pet cat - Choupette - complete with facial prosthetics and cat ears.'You make me laugh,' Fina said. 'This is so strange - she looks like a rabbit. You shouldn't put animals in fashion.' Lil Nas X was painted silver from head-to-toe and bejewelled with sparkling gemstones - but his 'horrific' outfit gave Nonna a fright.'This is rubbish, he looks like a statue,' she said before bestowing him a mere four out of ten. The Nonna also thought Janelle Monáe looked like she was wearing a hula hoop and that Ashley Graham looked like a 'circus worker'.'This is all so strange, if this is fashion - I don't like it,' Fina said.The only two people to score a perfect ten were Penelope Cruz and Miranda Kerr - with Nonna calling the women 'beautiful' in their radiant dresses. ",
        "Lil Nas X - 4/10Kim Kardashian - 5/10Rihanna - 5/10Ashley Graham - 5/10 Janelle Monáe - 6/10Doja Cat - 6/10Anna Wintour - 6/10Dua Lipa - 7/10Kendall Jenner - 7/10Kylie Jenner - 7/10Penelope Cruz - 10/10Miranda Kerr - 10/10 ",
        "Thousands were left in stitches at the Nonna's harsh remarks.'Nonna speaks the truth,' one woman said.'I love Nonna and I agree with her 100 per cent.' added another.A third wrote: 'This is golden Nonna content - all her opinions are right.' "
    ]
}