{
    "articleURL": "/sport/rudi-garcia/article-12051927/Bristols-King-Charles-leaves-throne-Piutau-admits-hell-emotional-game-Bears.html",
    "content": [
        "Bristol full back Charles Piutau has been one of the league’s true superstarsHe is the latest international star to depart the Premiership due to financial crisisThe 31-year-old will head off to Japan after playing his last game for the Bears King Charles III will be the centre of the nation’s attention on Saturday when he is crowned Monarch but 120 miles from Westminster Abbey, a man with the same name is ready for a big occasion of his own.",
        "Charles Piutau – known as ‘King Charles’ to his Bristol team-mates – will depart English rugby, heading off into the sunset after lighting up the Premiership.First with Wasps and then the Bears with a spell at Ulster in between, former All Black Piutau has been one of the league’s true superstars, earning lucrative and fully deserved contracts at a time when English rugby was going through a boom phase.Now feast has turned to famine for Premiership players amid a landscape of financial crisis and a reduced salary cap, Piutau, 31, is bidding farewell. Japan is set to be his next destination.So, what will he miss most after just under five years in Bristol?",
        "‘The ciders have been good,’ Piutau says, a huge smile spreading across his face.‘There’s cider in New Zealand but it’s not as big as it is here!’Piutau, who won 17 All Blacks caps, arrived in England in 2015, turning his back on international rugby in favour of Premiership riches. He signed a contract worth close to £1million-a-season when joining Bristol in 2018. The eye-watering fee was a recognition of his world-class ability.Five years on, the reality is there is now simply not that level of money in English domestic rugby, as Piutau readily acknowledges. He would have liked to have stayed in Bristol, where he and his wife Lineti have made a home and raised three young children.",
        "Two-year-old Zion, one-year-old Grace and Leo, who is just two months, were all born in England. ‘Three under three mate,’ Piutau says, his smile now more of a grimace.‘If my eyes look tired, it's because of a lack of sleep! If I’d told myself as a young kid growing up in New Zealand I would play this long in England, I probably wouldn’t have believed it. Coming over to start with I was finding my feet as a person away from home. Living abroad was a good challenge.‘Bringing my partner to Bristol and having three kids here is something that is special for me. When the kids are older I would love for them to come back and see Bristol knowing they were born here.‘I probably didn’t know my career would pan out this way when I left New Zealand, but I am definitely grateful with the clubs I’ve been able to be a part of and the contracts I’ve had.‘I’ll miss everyone at Bristol and the people where I live, but not the weather!’Piutau laughs when it is pointed out to him his children could one day play for England. If they have even half the talent of their father, they have a chance.Piutau is the latest international star to depart the Premiership. Not only are foreign players quitting the league, but so too are a host of England internationals.",
        "‘I’ve loved Bristol and would definitely have liked to have stayed on, but with where the competition is at and for us as a family we’re excited for something different,’ Piutau said.‘It’s the cards we’ve been dealt. I’ll still be keeping an eye on the guys here and the competition and I hope it gets back with teams recovering – the likes of Wasps and Worcester.’This season both Piutau’s former club Wasps and Worcester have fallen out of existence. Jobs in English rugby are scarce and money is tight.",
        "Does a loss of stardust detract from the Premiership’s marketability?‘If I’m being honest about it, yes, to a certain extent,’ Piutau said. ‘Covid probably highlighted some of the problems in the models at some clubs which were not the best.‘It probably has brought that forward and has meant certain clubs and the competition in general have got to look at how they run things.‘I was talking to another Wasps player and we were saying “Man, over the next generation some people might grow up not knowing what Wasps was” if they’re no longer in the league.‘That’s quite sad, knowing the legendary players that have come through the club and the championships they’ve won in the past.’",
        "It is fitting Piutau’s last Bristol game will come at home. Pat Lam’s Bears must beat Gloucester at Ashton Gate to seal a place in next season’s Champions Cup.Piutau won’t be around next term. Neither will his fellow big-money Bristol signing Semi Radradra.Both will wave goodbye to the Bears on what promises to be an emotional occasion.Piutau and Radradra will play for a World XV against the Barbarians at Twickenham on May 28 and then also feature at the World Cup in France.The Auckland-born Piutau will represent Tonga, the country of his parents, at the tournament after benefitting from World Rugby’s change in eligibility rules which now allow for a player to switch nations after a three-year standdown period.",
        "‘I’m the youngest of 10 so I’ve always grown up being the youngest, or the most spoilt, so I felt like coming here has helped in terms of my personal development, Piutau says.‘As I’ve grown, I’ve become a more senior player. In New Zealand I was always a younger guy coming through. I’ve always enjoyed helping younger guys off the back of my experiences.‘If I think about the Gloucester game and what it’ll be like, I feel quite emotional. I know the emotion will come.‘Once the whistle blows, it’ll be about challenging those emotions into gameday.’"
    ]
}