{
    "articleURL": "/news/article-12039167/Oregon-Secretary-State-Shemia-Fagan-resigns-10k-month-second-job-weed-firm.html",
    "content": [
        "Shemia Fagan resigns after apologizing for 'poor judgment' and 'harming trust'She was working with an affiliate of La Mota, a weed firm owing millions in tax La Mota and its owners had also donated around $250,000 to Fagan's campaign Oregon Secretary of State Shemia Fagan has resigned less than a week after it emerged she was moonlighting as a consultant for an embattled cannabis firm that donated around $250,000 to her campaign.",
        "The mother-of-two said Tuesday she took the $10,000 a month job - on top of her $77,000 annual salary as Secretary of State - to 'make ends meet' for her family.Her resignation came a day after she terminated her contract with Veriede Holdings, an affiliate of legal cannabis company La Mota, apologizing to voters for her 'poor judgment by contracting a company that is owned by my significant donors and is regulated by an agency that was under audit by my Audits Division'.There is no suggestion the Secretary of State has broken any rules, but her work for La Mota had sparked concerns over her judgment.Its owners, Rosa Cazares and Aaron Mitchell, and their businesses owe more than $7million in unpaid state and federal taxes and have been sued in Oregon courts 30 times, often over the alleged nonpayment of bills.",
        "Cazares and Mitchell have donated generously to top Oregon Democrats, including Fagan, Governor Tina Kotek and Congresswoman Val Hoyle.La Mota and a political action committee controlled by Cazares have contributed more than $200,000 to Democratic politicians since 2019 and Mitchell has given $45,000 to Fagan since 2020, according to Willamette Week.Auditors in the Secretary of State's office are set to release an audit of Oregon's cannabis regulatory system Friday. Fagan recused herself from any involvement in February.",
        "In her resignation statement, Fagan referred to an ethics investigation into her contract with Veriede Holdings.'While I am confident that the ethics investigation will show that I followed the state's legal and ethical guidelines in trying to make ends meet for my family, it is clear that my actions have become a distraction from the important and critical work of the Secretary of State's office,' she said. 'Protecting our state's democracy and ensuring faith in our elected leaders – these are the reasons I ran for this office. 'They are also the reasons I will be submitting my resignation today. I want to thank the incredible staff in the Secretary of State's office for their hard work and Oregonians for the opportunity to serve them. 'It has been a true honor to serve the people of Oregon.'Public officials in Oregon are allowed to have outside jobs as long as they don't use their positions for personal gain.But Fagan admitted Monday that her work with La Mota had been responsible for 'harming the trust' between her and the public.",
        "Oregon Governor Tina Kotek said she supported Fagan's decision to step down. 'It is essential that Oregonians have trust in their government,' she said. 'I believe this is a first step in restoring that trust.'",
        "Fagan, 41, who was elected in 2020, has made much of her working class background, claiming to have grown up 'in and out of poverty in Dufur and The Dalles' and admitting to struggling 'early on both at home and at school'.She said her life was transformed when her elementary school teacher introduced her to chess and she became the first girl in Oregon to win the statewide chess championship.Her decision to step aside from the audit of the state's cannabis industry appeared to be in conflict with a promise made to voters on her LinkedIn page, which says she 'will use the power of the audits department to…ensure our state's tax dollars go to where they're supposed to: helping Oregonians in our schools, our health care system, our small businesses and our environment'.Mitchell had also been in the news last week after he was accused by neighbors of allowing his Portland property to be turned into a squat rife with drug use, gun fights and explosions.The weed tycoon is alleged to have bought the property in the Hazelwood district in 2020 with the intention of turning it into a cannabis dispensary.But when he put those plans on ice, it descended into chaos.Public records obtained by KOIN 6 News showed emergency crews were called to the house 36 times since Mitchell bought it, and 911 records show firefighters put out at least six fires at the abandoned house."
    ]
}