{
    "articleURL": "/wires/reuters/article-12058169/OT-win-gives-Panthers-3-0-lead-Maple-Leafs.html",
    "content": [
        "Sam Reinhart scored 3:02 into overtime as the Florida Panthers defeated the Toronto Maple Leafs 3-2 on Sunday in Sunrise, Fla., and moved to the verge of sweeping their Eastern Conference semifinal series.",
        "The Panthers, who lead the best-of-seven set 3-0, would advance with a home win on Wednesday.Florida, 3-0 in overtime in the 2023 playoffs, got the winner when Reinhart tucked a wraparound between the legs of off-the-bench goalie Joseph Woll.The Panthers registered their sixth straight playoff victory, a franchise record.Toronto, after winning three games at Tampa Bay in the opening round, lost on the road for the first time in the 2023 playoffs.Florida also got goals from Anthony Duclair and Carter Verhaeghe, and Aaron Ekblad had two assists. Sergei Bobrovsky made 22 saves for the win.Maple Leafs goalie Ilya Samsonov, who stopped eight saves and allowed no goals, was injured 37 seconds into the second period. Woll replaced him with the Panthers on a power play.Woll, a 24-year-old rookie from Boston College, entered Sunday with just 12 games of NHL experience, including a playoff relief outing on April 18. He saved 18 of the 21 shots he faced on Sunday.Toronto got goals from Erik Gustafsson, who played just his second playoff game with the Maple Leafs after he was a healthy scratch seven times, and Sam Lafferty, who scored his first ever in the playoffs.The Maple Leafs had two odd-man rushes in the first two-plus minutes. On the first one, Auston Matthews hit the left post with a shot.",
        "On the second, Lafferty, skating on the left side, took a cross-ice pass from David Kampf and beat Bobrovsky stick-side at 2:26.Toronto nearly scored late in the opening period on another two-on-one rush. This time, Bobrovsky made a stellar glove save on Jake McCabe.Thirty seconds into the second period, Duclair got free for a breakaway. Samsonov made the save, but Toronto's Luke Schenn tripped Verhaeghe, who was rushing in for the rebound. Schenn then tumbled into Samsonov, who appeared to sustain an upper-body injury, prompting his exit from the game.On the ensuing power play, Duclair got free again, this time off a stretch pass from Ekblad. Duclair made a forehand-backhand-forehand move, beating Woll with one second left on the man advantage.Toronto took a 2-1 lead at 7:32 of the second as Gustafson's cross-ice pass to Kampf instead went in off the stick of Panthers defenseman Marc Staal.Florida tied the score at 12:28 of the middle period as a Radko Gudas' shot from the point changed directions after bouncing off Verhaeghe's body.--Field Level Media"
    ]
}