{
    "articleURL": "/news/article-12056621/Poll-Americans-think-Trump-76-fit-serve-president-gaffe-prone-Biden-80.html",
    "content": [
        "Poll shows Americans think Trump is more fit to serve as president than Biden Head-to-head match-ups show that both Trump and Florida Gov. Ron DeSantis would win in a 2024 general election against BidenThe poll released shortly after Biden announced his reelection campaign shows the president's approval at an all-time-low of  36%Donald Trump has an edge over Joe Biden in the 2024 election with a new poll showing the former president with a 6 percent higher chance of getting another four years in the White House.",
        "Additionally, a large number of Americans think that Trump, 76, is more physically fit and mentally sharp to serve another term over those who feel the same way about Biden.At 80-years-old, Biden is already the oldest-ever elected president in U.S. history – and would be 82 on his second inauguration if reelected in 2024.With his announcement of his reelection campaign last month, it seems that Trump and Biden are set for a rematch of 2020 in the next presidential election, which most Americans have expressed in recent polling that they do not want.A new Washington Post/ABC News poll released Sunday shows Biden's favorability at the survey's all-time low at just 36 percent approval and 56 percent disapproval less than a month after announcing he is running for a second term.",
        "Forty-four percent of the 1,006 people surveyed said that in a hypothetical match-up they would 'definitely' or 'probably' vote for Trump in 2024, while 38 percent said they would vote for Biden. Another 18 percent said they are undecided or gave a different answer than the two candidates.When Ron DeSantis was also put up against Biden in a head-to-head 2024 race, the Florida governor was shown ahead of the president by 5 percent – just one percent less than Trump's lead.",
        "DeSantis has not yet announced a bid for president in 2024, but is expected to do so in coming weeks.Trump said it would be very 'disloyal' if the governor were to enter the primary race against him.When asked about six different announced or potential GOP candidates, 51 percent support Trump and just half at 25 percent say they would back DeSantis. No other candidate earned double-digit support. When asked if Trump is physically fit for office, 64 percent said he is, while only 33 percent feel the same way about Biden, who has faced criticism over his shuffling gait and his perceived declining health.On the side of mental sharpness, 54 percent of survey respondents said that Trump is mentally fit to 'effectively serve as president' and 32 percent say the same about the gaffe-prone president.Biden often stumbles over his words and makes confusing statements – something he has long contributed to his childhood stutter while critics claim it's indicative of dementia or a sign of a mental decline in old age.Presidential candidate Nikki Haley has said there should be an age-limit put on political candidates. The former South Carolina governor and once-Trump's Ambassador to the UN thinks that 76 – the exact same age of Trump – is too old to be running the country."
    ]
}