{
    "articleURL": "/wires/ap/article-12048125/Forte-Japans-Derma-Sotogake-Ky-Derby-horses-watch.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - The Kentucky Derby is up for grabs.",
        "The starting gate will contain 19 horses vying to wear the garland of red roses.Most of the 3-year-olds will be running 1 1/4 miles for the first time on Saturday. Besides the distance, the traffic-choked conditions typically eliminate half the field in the opening quarter-mile.Here are some horses to watch: FORTEComes into the Derby on a five-race winning streak and is the early 3-1 favorite. Rallied in the Florida Derby to win by a length after being ninth in the early going. Lost just once in seven career races, as a 2-year-old. He´s trying to become just the fourth 2-year-old champion since 1980 to go on and win the Derby. Forte is one of three horses in the race trained by Todd Pletcher, a two-time Derby winner. Jockey Irad Ortiz Jr. knows the colt well, having ridden him in all of his races. Forte is co-owned by Mike Repole, whose Uncle Mo was the early favorite for the 2011 Derby but scratched the day before because of illness. His other owner is Vincent Viola, who owns the NHL´s Florida Panthers and co-owned Always Dreaming, the 2017 Derby winner trained by Pletcher.ANGEL OF EMPIRE",
        "Comes off a 4 1/4-length victory in the Arkansas Derby, where Derby rival Reincarnate finished third. His running style is from off the pace. If he can negotiate heavy traffic in front, he could be a threat in the late going. One of four Derby horses for trainer Brad Cox, a Louisville native. Flavien Prat will be aboard, the fifth different jockey for the colt. He´s one of three Derby contenders with at least $1 million in earnings. The bay colt is owned by Albaugh Family Stables, based in Des Moines, Iowa. The outfit also co-owns Jace´s Road, who has yet to win as a 3-year-old and got into the Derby after another horse dropped out. Would be the third Pennsylvania-bred to win.",
        "TAPIT TRICEThe Blue Grass winner brings a four-race winning streak into the Derby. The gray colt is a powerful late runner and one of trainer Todd Pletcher´s three entries. He didn't break sharply from the starting gate in his Blue Grass and Tampa Bay Derby victories, but if he can get in position by the top of the stretch, he´ll have a shot to win. Luis Saez has been aboard for the colt´s last three wins.DERMA SOTOGAKEOne of two Japanese horses in the field, along with Mandarin Hero. They´re just the third and fourth Japan-bred entries in Derby history. Derma Sotogake is coming off a wire-to-wire victory by 5 1/2 lengths in the UAE Derby. Owner Hiroyuki Asanuma is a dermatologist in Hokkaido who uses the word derma as the first part of all his horses´ names. Sotogake is an outside leg trip in sumo wrestling. Continuar was scratched Thursday after his trainer said the colt was not in peak physical condition. That opened up a spot for another Japanese horse, Mandarin Hero, who finished second by a nose in the Santa Anita Derby.CONFIDENCE GAMEThe horse comes off a 10-week layoff, much longer than most contenders. He won the Rebel Stakes by a length on Feb. 25. The dark bay colt was purchased for $25,000, making him the cheapest horse in the field. Perhaps tellingly, his other two career victories came at Churchill Downs as a 2-year-old. His sire is Candy Ride, who also produced 2017 Horse of the Year Gun Runner. Trainer Keith Desormeaux is the brother of Hall of Fame jockey Kent Desormeaux.",
        "___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}