{
    "articleURL": "/wires/reuters/article-12053667/Braves-Spencer-Strider-series-vs-Orioles.html",
    "content": [
        "Spencer Strider will put his unbeaten record on the line Saturday when the Atlanta Braves host the Baltimore Orioles in the second game of a three-game series.",
        "The Orioles, behind a pair of homers from Anthony Santander -- one of them a grand slam -- won the Friday opener 9-4.Strider (4-0, 2.57 ERA) will be opposed by Baltimore right-hander Kyle Bradish (1-1, 6-14).Strider enters the game tied with the Arizona Diamondbacks' Zac Gallen for the National League lead with 57 strikeouts, although Gallen has had one more start. Strider had his franchise record run of nine consecutive starts with nine-plus strikeouts end in on Monday against the New York Mets.He fanned eight in that contest, the opener of a doubleheader, and emerged with a win despite allowing a season-high four runs in five innings. Strider yielded five hits and three walks.\"I'm just glad we won,\" he said. \"I didn't really put us in a good position to win. First half of a doubleheader, I can't go out and get quick outs. Credit to the bullpen and our offense, of course, for hitting the way they always do.\"Strider's pitch count was elevated, but he was able to get through five innings while throwing a season-high 107 pitches. The last inning was valued by Atlanta manager Brian Snitker.\"He came in after the fourth and was like, 'I can throw all day,'\" Snitker said. \"They get over that hump sometimes and get their rhythm. Just kind of shows he's going to be one of those guys. He's going to mature right in front of you.\"",
        "Strider will be making his first career appearance against the Orioles.Bradish is set to make his fifth start of the season. He did not receive a decision in his latest outing on Sunday against the Detroit Tigers, when he worked 4 2/3 innings and gave up three runs on six hits and a walk with five strikeouts. The Orioles would up winning 5-3.\"I just got out of the zone,\" Bradish said. \"I think I threw the ball well the first four innings. It's hard to overlook the fifth inning, but we got the win and that's what's important. The big thing was being out of the zone.\"Bradish has never faced the Braves. He is 1-0 against teams from the National League East, having beaten the Washington Nationals on April 19.Both teams made roster moves ahead of the series opener. The Braves recalled shortstop Braden Shewmake from Triple-A Gwinnett, and he went 0-for-4 in his major league debut on Friday. Closer Raisel Iglesias returned from his rehab assignment, having recovered from right shoulder inflammation.The Braves optioned left-hander Dylan Dodd, who won Wednesday's game against the Miami Marlins, back to Gwinnett and placed utility infielder Ehire Adrianza on the 10-day injured list due to right elbow inflammation.Atlanta center fielder Michael Harris II, who has missed the past two games, is day-to-day with a sore knee and could play Sunday.",
        "The Orioles acquired catcher Luis Torrens from the Chicago Cubs for cash considerations and optioned first baseman Ryan O'Hearn to Triple-A Norfolk. Torrens, who was hitting .250 with three RBI in 13 games, gives the team three catchers and the freedom to play Adley Rutschman and James McCann in the same lineup.--Field Level Media"
    ]
}