{
    "articleURL": "/wires/ap/article-12055955/20-Indonesian-trafficking-victims-freed-Myanmar.html",
    "content": [
        "JAKARTA, Indonesia (AP) - Indonesian officials said Sunday they freed 20 of their nationals who were trafficked to Myanmar as part of a cyber scam, amid an increase in human trafficking cases in Southeast Asia.",
        "Indonesia´s Foreign Affairs Ministry said in a statement that its embassy in Yangon with help from local networks had managed to release the victims from Myawaddy township and brought them to the Thai border on Saturday.The Indonesian Embassy in Bangkok will work closely with Thai authorities to repatriate the victims to Indonesia, the statement said. Myawaddy is in eastern Kayin state along the Thai border and is the site of an armed conflict between Myanmar´s military and ethnic Karen rebels.Fake recruiters had offered the Indonesians high-paying jobs in Thailand but instead trafficked them to Myawaddy, about 567 kilometers (352 miles) south of Naypyidaw, the capital, to perform cyber scams for crypto websites or apps, said Judha Nugraha, an official in Indonesia´s Foreign Affairs Ministry.The situation drew a national outcry in Indonesia after a video made by one of the victims went viral on social media last month. It showed dozens of grim-faced Indonesian workers in a dormitory room, asking their government to help them out of \"the war zone\" where they see violence almost every day.\"Please help us back to Indonesia, because our life here is very miserable and threatened,\" one person said, describing how they had been transferred from one company to other companies over the past eight months before being stranded in Myawaddy. The victim said they were tortured when they failed to reach certain work targets, receiving beatings, electrocutions and other physical punishments.",
        "Authorities said the victims were likely trafficked to Myanmar by illegal means since no records were found of their arrival in Myanmar´s immigration system.The case had prompted Indonesian President Joko Widodo to order the Foreign Affairs Ministry to make an \"all out\" effort to help rescue the victims, telling a news conference on Thursday: \"They have been deceived and taken to an unwanted place by the traffickers.\"It was unclear how their release was secured, but National Police spokesperson Sandi Nugroho said negotiations were held with the company that employed them.Indonesia´s Foreign Minister Retno Marsudi told a news conference on Friday that the government is also working to help Indonesian victims of online scams in Myanmar, Cambodia, Thailand, Vietnam, Laos and the Philippines.She said the Indonesian Embassy in Manila said Friday that Philippine authorities have rescued more than 1,000 trafficking victims from 10 countries, including 143 Indonesians, who will be repatriated to their countries of origin.\"As the chair of ASEAN this year, Indonesia is trying to raise this issue at the 42nd ASEAN Summit,\" Marsudi said.ASEAN includes Brunei, Cambodia, Vietnam, Indonesia, Laos, Malaysia, Myanmar, Philippine, Singapore and Thailand. Indonesia will host the bloc´s leaders´ meeting on May 10-11 in Labuan Bajo on Flores island."
    ]
}