{
    "articleURL": "/wires/pa/article-12060469/Neil-Warnock-happy-finish-high-Huddersfield-defeat-relegated-Reading.html",
    "content": [
        "Neil Warnock hailed Huddersfield’s “unbelievable” final points tally of 53 after overseeing a 2-0 Sky Bet Championship win over relegated Reading in his last match before returning to retirement.",
        "The Terriers’ great escape from the drop was confirmed courtesy of last week’s victory over Sheffield United, with Monday’s triumph – the seventh under Warnock’s temporary charge – the cherry on the top for the 74-year-old.Prospective American owner Kevin M Nagle was in attendance at the John Smith’s Stadium for the match, with the points secured by stunning second-half goals from Josh Koroma and substitute Joseph Hungbo.Koroma broke the deadlock after 49 minutes before Watford loanee Hungbo came off the bench to seal matters six minutes from time.“I was pleased I could leave him (Nagle) a Championship club,” said Warnock, whose side ended the campaign in 18th spot, nine points clear of the relegation zone.“I wanted to finish on a win and to get 53 points is unbelievable.",
        "“These times you have to treasure. I told the players that because they don’t come along very often.“You would have thought we had got promotion to the Premier League, with the crowd. You can’t tell me it would have been any more vociferous.“But the fans know what a job it has been to turn it round. To see everyone stay behind at the end, I can’t put it into words.”Asked what he might be doing when the Championship kicks off again next season, the south-west-based veteran suggested he might be watching League One champions Plymouth.",
        "“It is great because me and my daughter go to all the home matches,” he said. “If Plymouth play Huddersfield first match, I might be watching Huddersfield again.“I can sit down, have a nice meal, a nice glass of wine, no pressure, no worry about substitutions, get driven home… it’s perfect… until February.”Huddersfield fans pleaded for one more year from Warnock, but he said: “You can’t do this for 10 months.“I hate the motorways, I hate the hotels, I don’t need that at my age. But I don’t mind for 10-12 weeks!”Noel Hunt, who could not mastermind a win during his tenure as interim Reading boss, admitted his own future remains unsure but reckons the future is bright for the Royals despite relegation.“I have not even thought about it,” the Irishman responded when asked if he would like the role permanently.“As far as I was told, this was until the end of the season and then who knows?“I was pretty sure I was probably going back to the under-23s. But I have not had that conversation. So your guess is as good as mine.”On Reading’s fall into the game’s third tier, Hunt said: “I have seen teams go down to League One and two years later be in the Premier League. Norwich and Southampton did it.",
        "“Maybe a reset is going to be good and what the club needs. But we have a lot of good players signed here and a lot of good young boys coming through.“So the future is bright, no matter what.”"
    ]
}