{
    "articleURL": "/wires/aap/article-12053123/Australian-Olympic-committee-backs-voice-yes-vote.html",
    "content": [
        "The Australian Olympic Committee executive has thrown its support behind the 'yes' vote ahead of the Indigenous voice referendum.",
        "AOC President Ian Chesterman announced the decision on Saturday, saying the organisation believed a successful 'yes' vote would lead to reconciliation with First Nations people.\"We did not take this decision lightly as we know there will be those within the Olympic movement who will vote 'no' and we respect their right to do so,\" he said.The committee's decision was guided by its Indigenous advisory group.Group chair Patrick Johnson said it had considered both referendum campaigns before coming to its position to back the yes vote.\"Respect for the opinions of others was very important to us,\" he said.\"Most importantly we wanted to ensure there was a full appreciation and knowledge of the issues before we were in a position to offer our view.\"The AOC Athletes' Commission has also backed the 'yes' vote, with chair Cate Campbell saying the stance could make a difference across the country.\"What was key to our consideration was that commitment to first, acknowledging our First Nations' people and second, the desire for practical measures to improve the lives of Indigenous Australians,\" she said.The Olympic committee is one of the first sporting bodies to declare their position on the voice referendum.AFL clubs Collingwood and West Coast have said they will back the 'yes' vote, while there are reports a coalition of other sporting bodies will announce their support later this year.",
        "The referendum, to be held sometime between October and December, is looking to enshrine an Indigenous voice in the Australian constitution.It will be Australia's first referendum since 1999 and the first for about 6.4 million Australians.Changing the constitution requires a double majority of voters, either at a national level from all states and territories or in at least four of the six states."
    ]
}