{
    "articleURL": "/femail/article-12053611/Queen-Camilla-crowned-sister-close-friend-side.html",
    "content": [
        "Annabel Elliot and Lady Lansdowne looked glamorous of ever as they joined the Queen for today's ceremonyCORONATION LIVEBLOG: Click here to follow live updates throughout the dayQueen Camilla was joined by two elegant companions as she walked alongside her sister Annabel Elliot and close friend The Marchioness of Lansdowne during today's Coronation ceremony.",
        "The royal, 75, axed the centuries-old tradition of having ladies-in-waiting as part of her retinue last September - instead opting for a smaller number of 'Queen's companions'.It's evident that both have an eye for fashion and aesthetics -  having worked in interior design - as the two women struck the perfect chord between sophistication and glamour with their gowns.Fiona Clare created two long, ivory dresses for Her Majesty's Companions, designed to complement each other whilst retaining individual touches in terms of the embroidery and choice of fabric.Silver edging features on The Marchioness's, whilst Annabel's has a standing collar and hand-embroidered detail.",
        "Camilla has today been crowned with Queen Mary’s Crown by the Archbishop of Canterbury in Westminster Abbey, as Buckingham Palace officially confirmed her title.Archbishop of Canterbury Justin Welby placed the 112-year-old crown on her head following the anointment of her husband. As he did so, he recited an open prayer: 'May thy servant Camilla, who wears this crown, be filled by thine abundant grace and with all princely virtues.'Reign in her heart, oh king of love. That being certain of thy protection, she may be crowned with thy gracious favour. Through Jesus Christ our Lord.'The Queen was then handed the royal sceptre as the archbishop completed his proclamation.",
        "The monarch and his wife smiled to the congregation as they walked through the church for a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry.The royal had her two confidantes by her side throughout in the festive ceremony.  In an interview with The Sunday Times, Fiona, the Marchioness of Lansdowne, said Prince Harry's comments had 'hurt' the Queen.",
        "She said: 'Of course it bothers her, of course it hurts. But she doesn't let it get to her. 'Her philosophy is always, \"Don't make a thing of it and it will settle down – least said, soonest mended.\"'Marchioness Lansdowne has long been a friend of the Queen's and supported her during the 1990s when details of her relationship with Charles emerged. In March, King Charles and Queen Camilla were also by her sister Annabel's side for the funeral of her husband Simon.The businessman was married to Annabel for over 50 years and passed away at the age of 82 in March.Camilla was known to have a close relationship with the businessman, who Annabel wed in 1972 at the age of 23 - and the couple even joined the royal on her honeymoon with Charles in 2005. The late Queen had around seven devoted ladies-in-waiting – affectionately dubbed the head girls – at the time of her death, some of whom had been by her side for more than 60 years. ",
        "They dealt with everything from public and personal correspondence and organising the royal diary to accompanying the monarch on engagements, collecting flowers and arranging private family events. ",
        "They were also loyal companions to the monarch and operated as her eyes and ears in the Palace.The roles were unpaid and holders were almost always picked from the upper echelons of the aristocracy as there are few wealthy enough to be able to afford to take on such a demanding position simply out of loyalty to the Crown.But with most of the existing holders of the roles due to retire, Camilla has decided to organise things 'a little differently'.One source previously told the Daily Mail: 'When she got married and set up her own office for the first time she got two brilliant private secretaries, Amanda Macmanus and Joy Camm. 'But they were very much \"two for the price of one\". Not only did they arrange all her engagements and projects, but they also acted as ladies-in-waiting if needed, accompanying her on official duties, collecting bouquets of flowers and the like.'No one stands on ceremony in her office, everyone mucks in. The feeling is that although things have changed dramatically in many respects, she won't take on an official line-up of ladies-in-waiting.'",
        "Camilla currently has two loyal and extremely capable female private secretaries, Sophie Densham, and her deputy, Belinda Kim.As well as organising Camilla's diary and public engagements, they already accompany her on official visits and will continue to do the same at Buckingham Palace, sources say.And this morning King Charles III's day of destiny has arrived as the world enjoys the historic first coronation of a UK monarch in 70 years at Westminster Abbey - where Britain and the Commonwealth hailed its new monarch today.The royal had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the Abbey from 6am to get one of the prime 2,300 seats inside.On the the streets of London today - including on a packed Mall - there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations. ",
        "Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning.She chose not to attend any of the other public engagements by his side, preferring to 'pace herself' and also ensure 'the day was about her husband', sources said.'She loves him unconditionally and always wants him to shine,' a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.'The calm before the storm – perhaps metaphorically as well as literally', a friend said with a nod to the dismal weather forecast, something the new King and Queen's celebrations have in common with the late Queen's Coronation in 1953.The Coronation bank holiday weekend will conclude on Monday with The Big Help Out, when members of the Royal Family will join volunteers working with local community organisations as part of an initiative to create a lasting legacy from the celebrations. Charles and Camilla, however, will leave for their Sandringham estate in Norfolk for a well-earned break.The Duke of Norfolk, who is organising the ceremony, said: 'The Coronation is an opportunity to bring our great nation, the realms and the Commonwealth closer together, plugging into the power of the past and promoting our shared values to the wider world with all that we have to offer.'",
        "Mr Sunak said the weekend would be a chance to reflect on the 'enduring nature of monarchy' and urged the nation to celebrate its history and culture.The Prime Minister added: 'Let's celebrate this weekend with pride in who we are and what we stand for. Let's look to the future with hope and optimism. And let's make new memories, so we can tell our grandchildren of the day we came together to sing God Save The King.'"
    ]
}