{
    "articleURL": "/femail/article-12040943/Fizzy-drink-addict-tenant-buried-home-piles-bottles-horrendous-smelling-rubbish.html",
    "content": [
        "Grimebusters Wayne Moran and cousin Lee Moran cleaned the Wigan homeREAD MORE:  Professional cleaner, 20, who cleans hoarders' homes for a living reveals what she sees every day - and the eye watering amount she makesA property was left in such grimy condition by its fizzy drink addict tenant that professional grimebusters had to be called in to haul away 3ft piles of empty bottles and other waste.",
        "Wayne Moran and cousin Lee Moran were dispatched to clear out a two-bed terraced house near Wigan, Greater Manchester.But the duo were stunned and they realised the enormity of the task when they were unable to get through the front door, and were forced to tunnel their way in.The co-owners of ASAP Clearances had to wade through the waist-deep mess throughout the property, consisting of bottles, clothing, household items and rotting food.The mounds of 'horrendous-smelling' rubbish were so overwhelming in the living room that the sofa was almost completely submerged, with just the headrest peeking out.",
        "After two days of back-breaking work that involved hauling rubbish to the tip in four van trips, the pair said they were 'relieved' to see the floor and go home for hot baths.Wayne, from Wythenshawe, Greater Manchester, said: 'The landlord had let it out to somebody and [when they] came back that was in the state it was in.'I don't know how long they rented it out for. We couldn't get in the front door, we just had to squeeze in. 'We had to start from outside the house and pass things out just to make a space to get in.'We had to wade our way through each room. [On the sofa] they just left a small gap so they could sit on one seat I think. ",
        "'It was up to our waists – about 3ft deep.",
        "'There were a lot of different kinds of bottles knocking around - alcoholic ones and fizzy pop ones.'There was also general food waste, clothes and general household items.'It wasn't just the living room that was a dumping ground, shocking photos show the kitchen, bathroom and two bedrooms filled to the brim with teetering piles of rubbish.Wayne said: 'The kitchen sink was piled up, there's no way anyone could be washing dishes in there.'In the bathroom the bath was full of clothes and food. The food was full of flies, it smelt horrendous.",
        "'The landlord didn't even want to walk in there and waited at the door.'The kitchen was the worst room, the floor was thick with cat food wrappers and food waste that had just been walked all over.'It looks like there was an adult bedroom and a kid's bedroom but I don't know whether there were children staying in there or not.'It was fairly back-breaking work to get it all out, it was a big job and very hard work. 'It took four full vans to clear it.'Cleaning expert Wayne said the duo were proud of what they had achieved and once it's undergone a deep clean it can go back on the market.",
        "Wayne said: 'This is probably up there in one of the top five that we've done.'There was a real sense of satisfaction of getting it clean.'It was great when the owner came in, she was just so excited that she could put her house on the market.'We've put her in touch with a company that does deep cleans and they're going to sort it all out for her.'At the end of the day it was a relief to see the floor and then getting home for a nice hot bath.'"
    ]
}