{
    "articleURL": "/news/article-12061395/Queensland-Police-Commissioner-warning-vigilantes-targeting-alleged-thugs-Rockhampton.html",
    "content": [
        "Queenslanders fed up with crimeVigilantes knocked on doors of alleged theivesPolice boss warned someone could get killed A police boss has warned vigilantes who are descending onto the homes of alleged criminals trying to take the law into their own hands that someone will end up killed.",
        "Queensland Police Commissioner Katarina Carroll has urged those fed up with crime in their neighbourhoods to leave it to police to handle.On Sunday a mob of more than 100 people turned up at the doorsteps of alleged thugs in Rockhampton, in the state's central-east.The group, led by kickboxer turned One Nation candidate Torin O'Brien, were targeting the homes of alleged thieves following a spate of recent break-ins in the area.Mr O'Brien had got the addresses of the alleged criminals off social media but Ms Carroll warned the information was 'pure speculation'.",
        "'What we have is a group of people going to people's houses for this issue, and the information is wrong,' she said on Monday.'So be careful. What we'll end up with is a death. We've seen that before. 'What you see on social media is not evidence and the people feeding this don't have the skills or the knowledge or the information that police have in doing their jobs.'The commissioner pleaded with residents to bring the matter to police, and not rely on social media to try and bring someone to justice.'This is what we do – talk to us about this,' she said.'It's incredibly important that you do because we've seen a lot of stuff on social media and a lot of people just putting information out there that … is not correct and it's extraordinarily dangerous.'",
        "Police had arrived at the home where Mr O'Brien's group was within minutes.",
        "'If you looked at the amount of police that were there yesterday (in Rockhampton), they would be better off spending time investigating that themselves and working in the community,' Ms Carroll said.Mr O'Brien said his own sister allegedly had her home broken into.'There's clearly been zero leadership surrounding this crime wave of gross little ferals,' the gym owner had posted online urging people to support the demonstration.'The town is angry and the police are worried… good, maybe they can feel our fear and will do more, but we all know it's the government and court system letting us down….'However, if one guy on Facebook can find literally all the info from their entire crew the police can stand side by side and demand change from the top. Stop being so gutless and take a stand WITH US.'Members of the mob confronted the officers, with some shouting 'you won't do your job properly', while others knocked on the doors of alleged thugs.By 4pm on Sunday, Mr O'Brien told everyone to go home and said he'd meet with police to discuss the issue in the coming days.",
        "But some people refused to leave, demanding immediate action.",
        "This led to the arrival of more police, with dogs, with more than a dozen officers and eight police vehicles at the tense scene.Police issued a 'move on' direction, effective immediately and lasting for 12 hours.The remaining 18 protestors left at that point, rather than facing getting arrested for ignoring the direction.In order to get the addresses of alleged offenders, Mr O'Brien had offered a $5000 reward for anyone to give up names on social media.But Mr O'Brien denies that he and the group are violent vigilantes, insisting they are just law abiding citizens who won't put up with the surging rate of crime any longer.In another vigilante incident in March, a Housing Commission property where a 13-year-old was allegedly tortured by three teens in Tewantin, west of Noosa, was burnt down.Jennifer Board, 22, was killed in an alleged vigilante car chase in February, 2021.She'd been riding her motorbike when a man allegedly chasing a stolen car ran into her. "
    ]
}