{
    "articleURL": "/news/article-12042839/The-deadliest-places-Brits-countries-likely-suffer-fatal-accident.html",
    "content": [
        "More than 160 Britons drowned, suffered fatal accidents or died in fatal road crashes last year, figures showEvery year, millions of Britons pack their suitcases to spend a holiday relaxing by sandy beaches or skiing down mountains - but for some, the vacations have a tragic end.",
        "Scores of Britons have never come home to their families, with more than 160 people drowning, suffering fatal accidents or meeting their end in road crashes last year alone.For the past three years, Spain has consistently been the deadliest country for Britons, with the gap-year hotspot Thailand coming a close second, according to UK Foreign Office figures.Last year, 24 Britons died in a fatal accident, while 16 drowned and another 11 died in a road traffic accident in Spain - far more than other countries explored by Brits.Here MailOnline takes a look at the countries where Britons have suffered lethal misfortune.FATAL ACCIDENTS",
        "Britons are more likely to suffer a fatal accident in Spain than any other county in the world, figures show. Last year, the number of British victims who died as a result of an accident in Spain more than doubled, with 24 people dying in 2022 compared to ten in 2021.Meanwhile, France had the second-highest number of deaths last year, with 16 people losing their lives after suffering fatal accidents, the foreign office figures show.In Turkey, an increasingly popular holiday destination for Brits wanting to see some sun, 13 people were killed in accidents. And in the United States and Australia, 12 Britons suffered the same tragic end.",
        "In Thailand, which is known for stunning beaches and a popular spot for Gap Year students, and Italy, eight people died last year in accidents. And in Egypt, six people suffered the same fate.The figures also reveal that in 47 countries, including Greece, Germany, Canada and Norway, between one and five people have died as a result of a fatal accident.",
        "DROWNINGS",
        "Millions of Britons each year travel to have a relaxing holiday by a beach or pool - but for some, their vacation can turn fatal.At least 60 Brits drowned in countries across the world last year - the highest number being in Spain with 16 losing their lives.Greece had the second-highest number of drownings with seven Brits dying last year, while six others drowned in France. The Foreign Office figures also show that in 32 countries, including Cyprus, Thailand, Turkey and Portugal, between and five Britons drowned last year.ROAD CRASHES ",
        "The figures also show that Spain is again the deadliest country for Brits to visit in terms of dying in a crash on the road.Some 11 Britons died in a road traffic accident while visiting Spain last year, which is double the number killed in 2020.Thailand - a country that is popular with British tourists - was the second deadliest location, with ten Britons dying there last year in crashes.",
        "Meanwhile, ten Britons also died in the United States in road crashes. The Foreign Office figures also showed that in 18 countries, including Italy, Cyprus, Turkey and the Philippines, there were between one to five Britons who were killed in road traffic accidents.",
        "Figures show the number of Britons killed in fatal accidents in 2022(Country - Number killed)Spain - 24 France - 16Turkey - 13United States - 12Thailand - 8Australia - 12Italy - 8Egypt - 6Greece - Fewer than 5 Germany - Fewer than 5 Cyprus - Fewer than 5South Africa - Fewer than 5Netherlands - Fewer than 5New Zealand - Fewer than 5Ireland - Fewer than 5Belgium - Fewer than 5Ukraine - Fewer than 5Ecuador - Fewer than 5Portugal - Fewer than 5United Arab Emirates - Fewer than 5Bulgaria - Fewer than 5Mexico - Fewer than 5Malta - Fewer than 5Saudi Arabia - Fewer than 5Sri Lanka - Fewer than 5Canada - Fewer than 5Switzerland - Fewer than 5Norway - Fewer than 5Tanzania - Fewer than 5Peru - Fewer than 5Bangladesh - Fewer than 5Jordan - Fewer than 5Albania - Fewer than 5India - Fewer than 5Indonesia - Fewer than 5Barbados - Fewer than 5Japan - Fewer than 5Vietnam - Fewer than 5Cambodia - Fewer than 5China - Fewer than 5Morocco - Fewer than 5Austria - Fewer than 5Hong Kong - Fewer than 5Czech Republic - Fewer than 5Ghana - Fewer than 5Nigeria - Fewer than 5Croatia - Fewer than 5Iraq - Fewer than 5Oman - Fewer than 5St Lucia - Fewer than 5Sweden - Fewer than 5Angola - Fewer than 5Botswana - Fewer than 5Finland - Fewer than 5Georgia - Fewer than 5",
        "Figures show the number of Britons who drowned while abroad in 2022(Country - Number killed)Spain - 16Greece - 7France - 6Germany - Fewer than 5Cyprus - Fewer than 5South Africa - Fewer than 5Netherlands - Fewer than 5New Zealand - Fewer than 5Turkey - Fewer than 5Australia - Fewer than 5Italy - Fewer than 5Philippines - Fewer than 5Zimbabwe - Fewer than 5Thailand - Fewer than 5Portugal - Fewer than 5United Arab Emirates - Fewer than 5Bulgaria - Fewer than 5Mexico - Fewer than 5Malta - Fewer than 5Saudi Arabia - Fewer than 5Sri Lanka - Fewer than 5Canada - Fewer than 5Switzerland - Fewer than 5Norway - Fewer than 5Tanzania - Fewer than 5Peru - Fewer than 5Bangladesh - Fewer than 5Jordan - Fewer than 5Albania - Fewer than 5Egypt - Fewer than 5Denmark - Fewer than 5Mauritius - Fewer than 5Dominican Republic - Fewer than 5Uganda - Fewer than 5Algeria - Fewer than 5",
        "Figures show the number of Britons killed in fatal road crashes in 2022(Country - Number killed)Spain - 11Thailand - 10 United States - 10Germany - Fewer than 5Cyprus - Fewer than 5South Africa - Fewer than 5Netherlands - Fewer than 5New Zealand - Fewer than 5Turkey - Fewer than 5Australia - Fewer than 5Italy - Fewer than 5Philippines - Fewer than 5Zimbabwe - Fewer than 5Greece - Fewer than 5France - Fewer than 5Ireland - Fewer than 5Belgium - Fewer than 5Ukraine - Fewer than 5Ecuador - Fewer than 5Jamaica - Fewer than 5Nepal - Fewer than 5"
    ]
}