{
    "articleURL": "/news/article-12038187/Barbie-movie-used-homeless-people-background-actors-paid-NOTHING.html",
    "content": [
        "Homeless people were filmed in the background of the upcoming Barbie movie but were not paid, DailyMail.com can reveal Extras were paid to dress as homeless people to reinforce the scene which was shot at Tongva Park in Santa Monica, which is notorious for vagrancy problems'Normally, movie production units might pay between $300 and $1,500 to individuals – street vendors or homeless people,' a source told DailyMail.com Crew filming mega-budget movie Barbie have been accused of filming homeless people in the background of a park scene – and not paying them.",
        "The destitute bench dwellers were even discussed in radio chatter on the set about exactly where they were in relation to filming, DailyMail.com can reveal.Meanwhile, extras were paid to dress as homeless people to reinforce the scene, shot at Tongva Park opposite Santa Monica City Hall in California, which is notorious for its vagrancy problems.Millions of parents are expected to take their children to see Barbie after its July 21 release and amid an expected a $1billion bonanza at the box office.",
        "Directed and co-written by Greta Gerwig, it stars Margot Robbie as a super-strident version of the iconic doll with Ryan Gosling as put-upon and ineffectual Ken.'I never saw any of the crew go up to the genuine homeless and offer them money,' a seasoned photographer who has been covering movie shoots for 15 years told DailyMail.com.'There were up to 20 of them at one time. Some were moved on by the production people, but others were left alone. So those left were kind of moving in an out, walking around, sitting around, doing something.'The photographer, who has a scanner to listen to radio chatter while working, continued: 'The genuine homeless people were there the whole day, the whole entire shoot which was a couple of weeks ago.",
        "'Normally, movie production units might pay between $300 and $1,500 to individuals – street vendors or homeless people – whose cooperation they want to either move out of the shot or stay in one place.",
        "The day started with Robbie, 32, reshooting scenes at a bus stop waiting for Ken before production moved to Tongva Park, where her and Gosling's stunt doubles were filmed on inline skates.Gerwig, 39, was present in the park to direct the action. 'They spent pretty much the rest of the day doing establishment shots,' said the photographer.",
        "'And as well as the homeless situation, I'd say nearly every kind of woke ideology was peppered into the scenes.'Everything you could imagine. Gay couples, female or male, mixed race couples. They would pull other background out and put them in, specifically saying on the radio, \"we need to make this a little more real world\" or more \"diverse\".'I have been doing this for 15 years and I've never seen anything like this before. All the scenes seemed forced.'Gerwig's politically charged script is reported to tackle a wide range of social issues, including feminism and misogyny.But the photographer, who previously covered other shoots for the movie in the Los Angeles area, said he has been left with the overriding impression of it having an all-out 'sexist' agenda.",
        "'I witnessed scenes that I felt were blatantly sexist,' he said. 'In one, Barbie and Ken were skating along Venice Boardwalk and came across groups of men.'One was like frat boys, another was construction workers. And both seemed to mimic groups of misogynistic men. They were commenting to Barbie and she would come across and confront them.'Ken would come up behind her and say \"Hey Barbie, relax\" or something like that and she would respond \"Shut up Ken, you just stay back there. Let me handle this\".'Ken just seemed to be a really stupid man in the background at all times trying to establish himself, but she would constantly belittle him.'Australian actress Robbie has said of her role: 'I think people had a preconceived idea about what the movie would be. Then, it was announced Greta was directing, all ideas went out the window.'Bringing Barbie to life was something I just couldn't say no to.'It's a fun movie, a comedy, but it's also going to have aspects people don't expect.'I don't think Barbie can be accused of being a dumb blonde as she has been a surgeon a vet, and a pilot, so if anything, she is a pioneer.'",
        "Gosling, 42, has said of his Ken: 'Nobody plays with Ken. He's an accessory and not even one of the cool ones.'",
        "Warner Bros, which acquired the rights to the movie in 2018, has not responded to DailyMail.com’s request for a comment on the genuine homeless people. Mattel Films, which is jointly involved, has also not come back to us.The plot of the movie revolves around Barbie leaving Barbie Land to cross over into the 'real world' with Ken, where she is stunned to discover misogyny and other injustices.Oscar-winner Helen Mirren narrates the movie while Anchorman star Will Ferrell features as the boss of toy company Mattel, which launched the Barbie doll in 1959.Robbie is reported to be earning more than $13million for her role, molded by Gerwig who has written the script with her partner Noah Baumbach.The press launch took place at the CinemaCon trade show in Las Vegas a week ago as the publicity machine ramps up for the summer. Robbie, dressed in pink, told the crowd that being on set was a 'dopamine hit'.Gerwig has a history of directing strong female characters, with an Oscar nomination for best picture for Lady Bird in 2017 and for her 2019 version of Louisa May Alcott novel Little Women, which starred Saoirse Ronan and Emma Watson.She told CinemaCon about writing the screenplay with Baumbach: 'We were making each other laugh and then we started to make each other cry.",
        "'He thought it was very good and was maybe wanting to direct it. And I said \"step aside\". There was a point I was so in love with it that I couldn't imagine anyone else doing it.'"
    ]
}