{
    "articleURL": "/sport/othersports/article-12048267/Alabama-fires-baseball-coach-Brad-Bohannon-amid-suspicious-gambling-team.html",
    "content": [
        "Pitching coach Jason Jackson will serve as interim head coach vs. Vanderbilt The NCAA bars pro and college athletes and athletic employees from gamblingDailyMail.com provides all the latest international sports news Alabama fired baseball coach Brad Bohannon after several reports of suspicious bets on his team, with the school saying he violated 'the standards, duties and responsibilities expected of university employees.'",
        "ESPN has been told by multiple sources that a sportsbook surveillance video captured one bettor communicating with Bohannon at the time bets were made.The school announced that athletic director Greg Byrne has \"initiated the termination process\" for Bohannon for \"among other things, violating the standards, duties, and responsibilities expected of University employees.\"The 47-year-old firing came three days after a report warning of suspicious wagers prompted Ohio's top gambling regulator to bar licensed sportsbooks in the state from accepting bets on Alabama baseball games. Pennsylvania and New Jersey also have halted bets on Alabama baseball.Alabama said in a statement that athletic director Greg Byrne has initiated the process of firing Bohannon 'for, among other things, violating the standards, duties, and responsibilities expected of university employees.' ",
        "Pitching coach Jason Jackson will serve as interim head coach beginning with Thursday night's home game against Vanderbilt. The university said there would be no further comment 'pending an ongoing review.' Alabama had said Tuesday that it was looking into the report.'There is no reason to believe at this time that any student-athletes are involved,' a person familiar with the investigation told The Associated Press. The person spoke on condition of anonymity because of the ongoing investigation.Matthew Schuler, executive director of the Ohio Casino Control Commission, issued an emergency order Monday 'prohibiting the acceptance of any wagers on University of Alabama Baseball effective immediately.'",
        "The order said that one of the state's 'certified independent integrity monitors' notified the state about the wagers.The Pennsylvania Gaming Control Board has issued a similar warning.'We've, out of an abundance of caution, asked our operators not to offer wagers on Alabama baseball,' spokesman Doug Harbach said Thursday.He said the board received a report from Las Vegas-based U.S. Integrity warning sportsbooks of suspicious wagering activity involving Friday night's Alabama-LSU game. Alabama scored five runs in the ninth inning of an 8-6 loss to LSU, which was ranked No. 1 in the major college baseball polls while Alabama was unranked.The New Jersey Division of Gaming Enforcement also told sportsbooks to 'suspend wagering on all contests involving the University of Alabama baseball team and associated players, including future wagers,' a spokesman for the state Attorney General's Office said in an email.Spokesman Dan Prochilo said there has been no suspicious wagering on Alabama baseball detected in New Jersey. US Integrity declined to comment. The company monitors data 'to see if discrepancies coincide with notable player or coaching events, reveal officiating abnormalities or are indicative of the misuse of insider information.'",
        "NCAA rules bar athletes and athletic employees from betting on games 'and from providing information to individuals involved in or associated with any type of sports wagering activities concerning intercollegiate, amateur or professional athletics competition.'",
        "The NCAA said it was aware of the situation and gathering additional information but said it couldn't comment 'on current, pending or potential investigations.' Alabama has said it became aware of the situation Monday evening.Ronnie Johns, chairman of the Louisiana Gaming Control Board, said in an emailed statement that state officials 'did not see any irregular activity in betting on the LSU/Alabama baseball series.''The operators of all the national sports book platforms did not report any suspicious activity in Louisiana,' he wrote Wednesday. 'The issue at hand originated in Ohio alone and the Ohio Gaming Commission took action to shut down any bets involving Alabama. LSU baseball has absolutely not been implicated in any suspicious betting activity and therefore there is no investigation of any sort involving LSU.'Bohannon went 166-124 in five-plus seasons, including a 30-15 record this season. In 2021, he led Alabama to its first NCAA regional since 2014."
    ]
}