{
    "articleURL": "/tvshowbiz/article-12054841/Joy-Corrigan-showcases-impressively-toned-physique-bikini-beach-trip-Miami.html",
    "content": [
        "Joy Corrigan showed off her eye-catching physique while spending time at a beach in Miami on Friday afternoon.",
        "The 28-year-old model appeared to be making the most of her time on the sand as she wore a barely there swimsuit and soaked up the tropical sun.The fashion industry personality, who was recently spotted on a date night with her boyfriend Ted Dhanik, also showed off her look for the day in several photos and videos that were shared to her Instagram Story.Corrigan wore a gray bikini top that placed her washboard abs and impressively toned arms on full display.The runway regular also donned a matching bottom that exposed her chiseled legs and curvy thighs.",
        "The social media personality accessorized with a pair of clear-frame sunglasses and a single necklace during her time on the beach.The model's bright blonde hair fell onto her shoulders and chest and contrasted perfectly with the neutral tone of her clothing.She was also seen while wearing flowing white shorts and matching sandals in the snaps that were shared on her Story.The entrepreneur contrasted the color of her bottoms with a stylish black purse.Corrigan is no stranger to showing off her incredible body in form-revealing swimsuits, and she also offers various pieces of swimwear through her clothing brand Naked Species.The fashion industry personality previously launched the brand alongside her sister, Gina Corrigan Smith, in 2019.",
        "In addition to bikinis, Naked Species also offers various T-shirts, hoodies and bottoms. She wears form-revealing swimwear, among other items, in her company's promotional photos.",
        "Corrigan previously spoke about showing off her body during an interview with Maxim, where she expressed that she had grown fond of putting her toned physique on display.'I love to be sexy and I love to show skin 'cause I work out really hard to get the body that I have. I've always been very free-spirited about it,' she said. The model went on to discuss her personal approach to posing during photoshoots.'I try to keep every shot I do very classy and a visual showcase of the beauty of what a woman can look like. That's my goal,' she stated. "
    ]
}