{
    "articleURL": "/tvshowbiz/article-12054285/Molly-Mae-Hague-shares-adorable-photo-smiling-baby-daughter-Bambi-four-months.html",
    "content": [
        "Molly-Mae Hague shared an adorable photo of her daughter Bambi on Saturday morning as the influencer celebrated the King's Coronation.",
        "Taking to Instagram, the former Love Island star, 23, who shares Bambi, four months, with boyfriend Tommy Fury, said that their child was a 'happy girl.'The snap she posted showed Bambi dressed in a comfy brown baby grow as she lay in a bouncer smiling.Molly-Mae wrote: 'Good morning happy girl' as a caption to the sweet Instagram story post. Meanwhile, the reality star revealed that she was watching the Coronation festivities and took a photograph of her television, adding a crown emoji. ",
        "It comes after Molly-Mae took to Instagram to showcase the stylish outfit she wore earlier in the week, including a £9k Chanel bag and £700 Loewe shirt having previously set tongues wagging over 'flaunting her wealth'.Captioning her snap, she penned: 'Not everyday tracksuit. Much to my sadness.' While Molly-Mae looked comfortable in her pricey ensemble, she recently divided her social media followers, who accused her of flaunting her wealth by posing in an airport terminal surrounded by her £4,000 designer luggage. Having just returned from a lavish family holiday in Dubai, the star cut a casual figure in a black T-shirt, matching leggings and an oversized blazer as she sat outside a Hermes boutique in a post shared on Sunday.  She styled her long blonde tresses pulled back in a claw clip leaving strands to frame her face as she leaned on her hand. ",
        "The reality star seemed less than impressed in the picture as she sat next to her £2,200 Louis Vuitton suitcase and her matching £1,790 travel bag.Molly-Mae looked ready for her flight as she kept her AirPod Max headphones, which are worth over £500, around her neck. Referencing her surroundings in the accompanying caption, she wrote: '5 star airport shopping.'However the post, shared in the midst of a cost-of-living crisis, prompted an inevitably divided response from followers.Replying to her latest update, one  quipped: 'If there ever was a caption to humble the working class.'",
        "Elsewhere a second quickly added: 'Thanks for reminding me to work harder,' while a third remarked: 'the caption is a little controversial ha…' Another simply added: 'Read the room.'  However others defended the influencer, with one fan writing: 'she isn't pictured with Hermes shopping bags though. 'She's saying 5* shopping and has a tiny paper bag from purchases... working class can walk round all shops at an airport too... people have a choice how they spend their hard earned money.' While another added: 'Stop taking offence ffs.' "
    ]
}