{
    "articleURL": "/news/article-12043039/Who-siding-Putin-Graphic-shows-countries-switched-allegiance-Ukraine-war.html",
    "content": [
        "Report says number of nations condemning Russia's invasion of Ukraine fell from 131 to 122 over the last yearIt shows a number of nations have become more sympathetic to Russia seeking to keep economic tiesMore than 14 months ago, Vladimir Putin's shocking invasion of Ukraine sparked horror and outrage from the international community, with many leaders lining up to condemn Moscow's actions.",
        "NATO, the EU and other Western allies have also been providing vast numbers of weapons and military hardware to Ukraine while imposing sanctions on Russia.While this support from many countries has grown as Ukraine demonstrates its ability to not just hold out against Russia, but also push its armies back, many others still refuse to condemn the military action which has cost thousands of lives.Some have decided to remain neutral in public while preserving their own historic or trade links with Russia, while others have parroted the Kremlin lies about Ukraine and the West being responsible for Moscow's aggression.Despite Ukraine's Western allies countering this on the world stage, saying Russia's invasion is illegal and nothing but an imperialistic land grab, the number of countries actively condemning Russia on the world stage has fallen over the last year.",
        "According to a report from the Economist Intelligence Unit in March 2023, the number of countries condemning Russia fell from 131 to 122 from the previous year.It showed that pockets of support for Russia were growing in the developing world, with countries such as South Africa, Uganda and Botswana now leaning towards Russia having been neutral just one year ago.Meanwhile, the report says, others including Iran, Mali and Burkina Faso, have moved from being Russian-leaning to showing full-blown support for Putin's actions. Iran, for example, has been providing arms to Moscow's armies.",
        "Western leaders have been pushing for some of the world's biggest players outside of western alliances, such as India and Brazil, to take a tough stance against Russia, to no avail. Instead, they choose to remain neutral.This is despite the International Criminal Court charging Putin with war crimes, and for the UN voting overwhelmingly to condemn Russia last year.At the same time, Russia has worked to solidify its relationship with China, the biggest kingmaker in the eastern hemisphere, with president Xi Jinping visiting Moscow in March in a propaganda coup for the Kremlin.Here, MailOnline looks at the countries that have publicly aligned with Russia, and those who have so far not condemned it for its barbaric actions.Putin's backersBelarusThe neighbouring countries of Belarus and Russia share more than just a land border.The former Soviet nations have important economic and political ties, with Russia accounting for 48 per cent of Belarus' external trade in 2021.The two nations also share similarly-minded strongmen at the helm, with Alexander Lukashenko enjoying the role of Putin's war-mongering sidekick.He owes him loyalty after Putin backed the then-beleaguered Belarusian leader when protests from May 2020 to March 2021 nearly ousted him from power.Lukashenko has since allowed Russian forces to engage in war games on his territory in the lead-up to the invasion and to take part in joint military drills while amassing troops on the Ukraine border.",
        "He then allowed his country to be used as a launchpad for Russia forces to invade Ukraine from the north. The armies that flooded down from Belarus were the ones to reach Kyiv, and occupied areas around the capital for more than a month.Fears have grown that Belarus could get involved in the conflict itself, sending its own armies into Ukraine to assist Putin's struggling forces.Lukashenko has repeatedly warned Ukraine that in the unlikely event that it attacked his country, it would be seen as an act of provocation - and we would respond.More recently, in March this year, Belarus said it would host Russian tactical nuclear weapons on its territory, saying it was the result of years of Western pressure.SyriaBashar al-Assad has praised Putin for his deadly invasion, while at the same time denouncing Western 'hysteria' over the manoeuvre.The Syrian leader, who himself has been accused of war crimes for the use of chemical weapons, said events in Ukraine are 'a correction of history and restoration of balance which was lost in the world after the breakup of the Soviet Union'.He added: 'Syria stands with the Russian Federation based on its conviction that its position is correct and because confronting NATO expansionism is a right for Russia.'",
        "Russia and Syria have enjoyed strong relations with the Soviet Union previously supporting Syrian independence.The alliance was strengthened between the two leaders when Putin entered the Syrian civil war in support of the government.The decision to join the war was Moscow's first military action outside the former Soviet Union since the federation's collapse.It saved Assad's government and turned the tide of the war in his favour, enabling the Syrian leader to brutally reassert control over much of Syria.Russian airstrikes often indiscriminately hit hospitals, schools and markets.The war-ravaged country became a testing ground for Russian weapons and tactics that it can now bring to bear in Ukraine.Within Syria, Russia added a soft power campaign. ",
        "In some areas, festivals were put on to popularise Russian culture, Russian national songs were played on Syrian television, self-serving propaganda was churned out and hot meals were served to civilians.Assad owes much to Putin for his intervention, and he has now returned the favour to Russia. Syria has regularly joined Putin's other allies - including Belarus, North Korea and Nicaragua in voting against motions at the UN to condemn Russia.Assad is understood to have provided hundreds of Syrian troops to Russia's war efforts, although while observers feared this could be a significant boon to Putin's forces fighting in Ukraine, little ever came of their intervention.",
        "Iran Since mid-2022, Iran has been Russia's top military backer, according to the US.Tehran's decision to support Russia in the war in Ukraine is reflected in the growing strategic alliance between the two countries.Iran has supplied hundreds of drones - including the the Shahed-136 suicide drone and the Mohajer-6 reconnaissance and strike drone - which have been used to wreak havoc on Ukraine's civilian population for around six months.Several people have been killed in drone strikes on buildings. November also saw Iran ship artillery and tank rounds to Russia. According to the Wall Street Journal, Iran shipped 300,000 artillery shells and one million rounds of ammunition via the Caspian Sea between October 2022 and April 2023.In exchange for the massive supply of arms, 'Russia has been offering Iran unprecedented defensive cooperation, including on missiles, electronics and air defence,' John Kirby of the US National Security Council has said.Tehran has also been looking to purchase Russian fighter jets, reports have said, with Iranian pilots having started training to fly them in spring 2022.",
        "North KoreaNorth Korea sided with Russia and its invasion of Ukraine in the early phases of the war, blaming the 'hegemonic policy' and 'high-handedness' of the US and the West.In its first official statement on Russia's attack - just days after the invasion - the Foreign Ministry said that the West was guilty of 'abuse of power'.",
        "'The root cause of the Ukraine crisis totally lies in the hegemonic policy of the U.S. and the West, which enforce themselves in high-handedness and abuse of power against other countries,' the North's official KCNA news agency said, citing an unnamed foreign ministry spokesperson.North Korea accused Washington and its allies of 'ignoring Russia's reasonable and legitimate demands' for guaranteeing legally backed security assurances.They 'systematically undercut the European security environment by pursuing the North Atlantic Treaty Organisation's expansion towards the east, including blatantly deploying attack weapons systems,' KCNA said.'The reality proves once again that as long as the U.S. unilateral and double-dealing policy that threatens a sovereign country's peace and safety exists, there will never be peace in the world.'The Soviet-era allies who share an 11-mile-long border are both motivated by anti-West and anti-NATO sentiments and have nuclear capabilities.When Putin in September ordered the annexation of four Ukrainian regions - Donetsk, Kherson, Luhansk, and Zaporizhzhia - North Korea was one of the few nations to recognise the move.And amid dwindling Russian supplies of ammunition and weapons, reports have said North Korea is supplying arms to Russia. Meanwhile, Pyongyang condemned the US and other western nations for sending main battle tanks to Ukraine.",
        "VenezuelaAccording to the Kremlin, Venezuela's leader Nicolas Maduro offered 'strong support' to Putin in the early days of the war.The authoritarian pair discussed an increasing strategic partnership in a phone call after Maduro denounced 'the perverse plans that seek to surround Russia militarily and strategically' - parroting the Kremlin line about western expansionism.Venezuela's foreign ministry also blamed the US for the violence perpetrated by Russia after Putin launched his invasion.They said in a statement: 'The Bolivarian Republic of Venezuela expresses its worry over the worsening of the crisis in Ukraine, and laments the mockery and violation of the Minsk accords on the part of NATO, encouraged by the United States of America.The derailment of these accords has violated international law and created strong threats against the Russian Federation, its territorial integrity and sovereignty, as well as impeded good relations between neighbouring countries.'Venezuela is Russia's most important trading ally in Latin America as an anti-US left-wing state.During the Soviet Union, relations were established between the two countries and these continued under Hugo Chavez who bought billions of pounds worth of arms from his ally.During the current presidential crisis in Venezuela, Putin has pledged his support to Maduro and recognised his election wins which others have deemed fraudulent.The two nations have carried out joint military exercises and share an opposition to the West, worsened by sanctions imposed against Maduro's perceived illegitimate government.CubaLike Venezuela, Cuba pledged allegiance to Russia and placed the blame with the US and the West as the war broke out.The nation criticised the US for imposing 'the progressive expansion of NATO towards the borders of the Russian Federation' while calling for a diplomatic solution to the conflict, which on Russian terms would mean Ukraine giving up territory.Cuba and Russia have had close relations since the Soviet Union when ballistic missiles were placed there by Nikita Khrushchev, sparking the Cuban Missile Crisis.After the 1959 Cuban Revolution led by Fidel Castro, the new Marxist-Leninist administration sought a close alliance with the Soviets.The resulting sanctions and embargoes from the US moved Cuba further into the Soviet sphere and the countries have maintained their strong relations following the collapse of the superpower.Cuba also recognised Crimea as part of Russia during the 2014 annexation.MyanmarMyanmar's military government has also expressed support for Putin and his territorial ambitions in Ukraine.General Zaw Min Tun, a spokesperson for the junta's council, said: 'Number one is that Russia has worked to consolidate its sovereignty. I think this is the right thing to do. Number two is to show the world that Russia is a world power.'",
        "The government in exile has backed Ukraine, saying in a Twitter statement it condemned Russia's actions.The support from the junta came as a result of Russia and China's military backing.Reports have said the two powers are providing Myanmar's military junta with fighter jets that are being used to slaughter civilians.A UN report has said Russia had supplied drones, two types of fighter jets, and two kinds of armoured vehicles, one with air defence systems.Russia has been the generals' closest international allies amid efforts by the West to isolate them following the overthrow of the government.Sitting on the fence ChinaAs Western sanctions clamped down on the Russian economy, China was the most powerful country to throw Vladimir Putin a lifeline.Just weeks before the war, Putin travelled to China ahead of the 2022 Beijing Winter Olympics amid a massive build up of Russian troops on Ukraine's border.There, the two leaders met and agreed to a 'no limits' relationship, and after troops marched into Ukraine, China refused to condemn Russia's actions - despite China having a friendly relationship with Ukraine in previous years.China also repeated Kremlin propaganda about the war, opposed sanctions against Russia, and even increased its imports of Russian oil - greatly helping the Russian economy as it was suffering from sanctions. At one stage, around 30 percent of all oil and gas produced in Russia was being sold to China.In the early phases of the invasion, China also threw Moscow another sanctions-busting lifeline by lifting wheat import restrictions from Russia.Despite this, China has publicly stated that it is neutral in the conflict, and while it has refused to condemn Russia's actions, it has stopped short of supporting them.",
        "Instead, it has worked to position itself as a neutral in the conflict, criticising the West for supplying arms to Ukraine while calling for a peaceful resolution.In February, Beijing put forward a twelve-point peace plan, calling for a ceasefire in Ukraine and for peace talks to be held between Moscow and Kyiv.While Ukraine's president Volodymyr Zelensky indicated he might consider parts of the proposal, it was on a whole rejected on account of it suggesting that Ukraine would have to give up some of its territory over to Russia.This has always been seen as a red line for Ukraine, which has shown that it has the capabilities to push Russia back and liberate regions seized by Moscow.The US Secretary of State questioned China's proposal, saying 'the world should not be fooled by any tactical move by Russia, supported by China or any other country, to freeze the war on its own terms.' Ultimately, Putin's spokesperson Dmitry Peskov also rejected the deal saying that new 'territorial realities could not be ignored'.A month later, Xi Jinping visited Moscow in both an official and unofficial capacity. It was the first meeting Putin held with an international leader after the ICC issued a warrant for his arrest, and was seen as a strengthening of ties between the pair.They called each other 'dear friends' and shared a toast. 'Change is coming that hasn't happened in 100 years. And we are driving this change together,' Xi told Putin via his interpreter during the meeting – words that set alarm bells ringing in the West. 'Please, take care, dear friend,' he added, gripping the Kremlin leader's hand warmly before being waved off by the Russian despot, who bid Xi a 'safe journey'.",
        "IndiaNarendra Modi's government has also been trying to perform a balancing act. India has not explicitly condemned Russia's actions, nor voiced support for Putin.Modi has been resistant to calls from the west to put pressure on Russia, and during a meeting with Putin in September, called their relationship 'unbreakable'.While the Indian leader told Putin that it's 'not a time for war,' he still refuses to assign blame for the conflict - instead voicing concern over rising food costs than for the thousands of people being killed on Ukrainian battlegrounds.Like China, India has doubled down on buying Russian oil at bargain prices.India, now the world's most populated country, has one of the fastest growing economies in the world. This needs fuel.By 2030, it is forecast to be the third biggest in the world, after the United States and China. It is also the third biggest oil consumer in the world. Meanwhile, Russia continues to be India's biggest arms suppliers and the two vast nations were close during the Soviet era. Following the dissolution, the pair continue to enjoy a 'special and privileged strategic partnership' and much of India's army is still equipped with soviet weapons.However, these weapons are now starting to deteriorate.As a result, India's government is looking to modernise with western upgrades. Despite this, Moscow continues to supply India with the majority of its arms.",
        "South Africa and other African nations According to the EIU, South Africa was one of the countries to have shifted from being neutral in the conflict in Ukraine, to taking a Russia-leaning stance. In January 2023, supposedly neutral South Africa sparked fury by inviting Russia and China for war games.The move was a strong indication of the strengthening relationship between South Africa, whose governing ANC party is allegedly in the pocket of a sanctioned Moscow oligarch, and the anti-West authoritarian regimes of China and Russia. The 'multinational maritime exercise' was slammed by South Africa's leading Daily Maverick newspaper as 'immoral, stupid and impractical'. Further signs that South Africa was sympathetic towards Russia came after the ICC announced it had issued the arrest warrant for Putin.South Africa is a member of the ICC, and therefore would in theory be obligated to arrest the Russian despot should he step foot on the country's soil.However, President Cyril Ramaphosa said in April that his ruling ANC party had resolved that South Africa should quit the 'unfair' International Criminal Court.'Yes, the governing party... has taken that decision that it is prudent that South Africa should pull out of the ICC,' Ramaphosa said during a press conference co-hosted with the visiting President of Finland Sauli Niinisto. Ramaphosa said the decision, which followed a weekend meeting of the African National Congress (ANC), was reached 'largely' because of what is perceived as the court's unfair treatment of certain countries.This was understood to mean Russia. Pretoria has close ties with Moscow dating back decades to when the Kremlin supported the ANC's fight against apartheid.The continental powerhouse has refused to condemn the invasion of Ukraine, which has largely isolated Moscow on the international stage, saying it wants to stay neutral and prefers dialogue to end the war.",
        "South Africa has 'adopted this stance of being non-aligned to ensure that we are able, as a country, to play a role in helping conflict to come to an end,' said Ramaphosa. He said he had spoken to Putin several times and sent a clear message that 'there needs to be negotiation'.Mali and Burkina Faso have also moved closer towards Russia. This has been put down to the presence of the Wagner Group of mercenaries fighting in the region.Wagner's appearance in Mali was one of the reasons given by French president Emmanuel Macron for his decision to pull out 2,400 troops from the country, where they had been fighting jihadists.Mr Macron suspected the mercenaries had struck a deal with Mali's ruling junta.South Africa, Mali and Burkina Faso all demonstrate Russia's growing influence on the continent of Africa.BrazilSince Putin invaded Ukraine in February 2022, Brazil underwent a seismic change in leadership. However, this did not shift its position on the war too dramatically.Former president Jair Bolsonaro had opposed sanctions on Russia following the invasion, and stated that Russia in-turn backed Brazil's position on the Amazon.That being said, in February 2022 Brazil did vote in favour of a draft UN resolution condemning Russia's invasion - despite Bolsonaro declining to condemn it himself.'Brazil will not take sides,' he said of the war.In October 2022, however, Bolsonaro was voted out of office, with Luiz Inácio Lula da Silva becoming president in a result seen as a positive step in the West after Bolsonaro's shift towards authoritarianism.But while Lula has been hailed as a positive step for Brazil by many, his views on Ukraine before his victory had been criticised on account of him appearing sympathetic towards the Kremlin claims over the causes of the conflict. Nevertheless, in March, Brazilian Foreign Minister Mauro Vieira said Putin would face arrest if he entered Brazil.In April Lula condemned Russia's violation of Ukraine's borders - calling on Putin to pull all his forces out of territory it has occupied since February 2022He called for a 'negotiated political solution to the conflict', but suggested that Ukraine could 'give up Crimea' in exchange for peace. Ukraine has always been angered at such suggestions, saying that it will not appease Russia which annexed the Ukrainian territory in 2014.Turkey, Colombia &amp; QatarThree other countries that shifted from being western-leaning to neutral over the last year, according to the EIU, have been Turkey, Colombia and Qatar.",
        "The trio are seen as doing so more to benefit their economy by playing both sides.Turkey in particular has been a major player in the conflict. As a member of NATO, it is engaged with Ukraine and its western allies. But due to Ankara's close ties with Moscow, it has been in a unique position to have an open dialogue with Russia.On a number of occasions, Turkey has worked to orchestrate peace talks between Ukraine and Russia, and was also integral in the Black Sea Grain Initiative - that persuaded Russia to allow shipments of Ukrainian grain to leave its ports.Colombia, meanwhile, has refused US requests to send weapons to Ukraine - drawing praise from Russia. In the middle east, Qatar has seen the war as an opportunity to capitalise on the EU ceasing its Russian oil imports."
    ]
}