{
    "articleURL": "/tvshowbiz/article-12039173/Nicolas-Cage-reveals-memory-inside-MOTHERS-WOMB-faces-dark.html",
    "content": [
        "Nicolas age's first memory is being inside his mother's womb.",
        "The 59-year-old actor has claimed that he can recall seeing 'faces in the dark' while he was still in his mom's womb when asked about his earliest childhood memory on The Late Show With Stephen Colbert.The Hollywood star explained: 'Let me think. Listen, I know this sounds really far out and I don’t know if it’s real or not, but sometimes I think I can go all the way back to in-utero and feeling like I could see faces in the dark or something.'I know that sounds powerfully abstract, but that somehow seems like maybe it happened.'On the other hand, Nicolas conceded that his supposed memories may have just been triggered by 'vocal vibrations'.",
        "The actor said: 'Now that I am no longer in utero, I would have to imagine it was perhaps vocal vibrations resonating through to me at that stage. That’s going way back. I don’t know. That comes to mind … I don’t even know if I remember being in utero, but that thought has crossed my mind.'The veteran actor's mother was dancer Joy Vogelsang who passed away at age 85 in May 2021. His academic and film executive father August Coppola passed away in 2009.Nicolas was also asked whether he believes in life after death.",
        "The movie star - who has won a host of accolades during his career, including an Academy Award and a Golden Globe - suggested that his 'spark' will continue even after he passes away.He said: 'Oh, wow. Nobody really knows, I don’t know.'They say that electricity is forever eternal. That the spark keeps going. I like to think whatever spark is animating our bodies, once the body passes on, that the spark continues to go.'But whether or not that electricity has consciousness or not, who can really say?'Just last week Cage opened up about a darker time in his life when he took on a number of 'crummy' movie roles to get himself out of debut.",
        "Cage won an Oscar for his 1995 drama Leaving Las Vegas and proceeded to take on a number of big-budget action films that made him one of the highest-paid actors of the late 1990s.The actor was promoting his new movie Renfield when he opened up about his past financial troubles in a wide-ranging interview with 60 Minutes, where he admitted that his financial troubles spawned from real estate.When asked about the castles he purchased in England and Germany, a mansion in New Orleans and even a private island, Cage admitted, 'I was overinvested in real estate. It wasn't because I spent 80 dollars on an octopus.'",
        "'The real estate market crashed and I couldn’t get out in time. I paid them all back, but it was about $6 million. I never filed for bankruptcy,' he said.Instead of filing for bankruptcy, he moved to Las Vegas and started working non-stop, filming three or four movies a year to pay off his debts.Cage added it was, 'a dark time, for sure,' though he admitted, 'work was always my guardian angel.''It may not have been blue chip, but it was still work,' he said, while addressing talk that he only took on a myriad of less-than-prestige roles solely for a paycheck, and 'phoning it in.''Even if the movie turns out to be crummy, they know I'm not phoning it in, that I care, every time,' Cage insisted.",
        "'But there are those folks that are probably thinking that the only good acting I can do is the acting I chose to do by design, which is more operatic and larger-than-life,' and so-called Cage rage and all that, Cage continued.'But you're not gonna get that every time,' the actor admitted, as he was asked about his 'Cage rage' approach being compared to 'going for the triple axel every time and sometimes you land it and sometimes you don't.'",
        "'Well not every time. There are times I have a vision for and I do (go for it), including his critically-acclaimed role in 2021's Pig.'When I played Rob in Pig, I felt I entered the room. I felt I was closer to me than maybe I had ever been before, in film performance,' Cage admitted.",
        "When asked to elaborate, he said, 'That I wasn't acting. I felt that I was doing exactly what I care about.'He added that Pig is, 'probably my best movie,' even stating he would put that up against his Oscar-winning role in Leaving Las Vegas.Cage also discussed his most recently role, the iconic vampire Dracula in Renfield, which hit theaters earlier this month.'Dracula is daunting because it's a legacy. Dracula is a character that has been done well many times. He's also a character who has been done poorly many times,' Cage said.He added that Christopher Lee's performance in the 1958 film Dracula is the one he looks to the most, adding, 'He makes Dracula scary."
    ]
}