{
    "articleURL": "/wires/aap/article-12058883/Doctors-record-COVID-frontline-experience-posterity.html",
    "content": [
        "When the Ruby Princess cruise ship docked in Sydney in March 2020, many of its 2700 passengers headed interstate and some unknowingly dispersed the potentially fatal coronavirus.",
        "Among them were three Tasmanians who headed to Burnie. Two later died and a subsequent COVID-19 outbreak at two local hospitals led to 13 deaths.As the hospitals were shut down in mid-April, patients were sent elsewhere and staff forced to quarantine with the army called in to take control.\"We were all terrified of getting COVID because the international data was showing anaesthetists and medical professionals were dying,\" said associate professor Debbie Wilson, who was then head of the anaesthetic department at Burnie's North West Regional Hospital.Dr Wilson is among scores of doctors who are recording their experience at the front line of the COVID-19 pandemic at the Australian and New Zealand College of Anaesthetists conference for a museum audio archive.Managed by the college, the Geoffrey Kaye Museum of Anaesthetic History in Melbourne formed the project after hearing reports from anaesthetists and specialist pain physicians working in hospitals in Australia, New Zealand and the UK.\"I felt we'd failed to protect our patients, our staff and our community,\" Dr Wilson said.\"Five thousand people - staff and their families - ended up in furlough for two weeks.\"Many staff contracted the virus and were in isolation, prompting critical healthcare shortages while international staff were unable to attend funerals of loved ones.",
        "Scathing of a huge disconnect from Hobart's Health Department, Dr Wilson said: \"An email was sent saying the Burnie hospital was perfectly safe.\"\"There was anger about the fact the health department did not recognise that staff needed masks and proper PPE. There was a complete lack of recognition that it (the virus) was in the air,\" she said.\"It took me a long time before I could talk about it because I felt we failed so badly. You put your heart and soul into the health service and the one time you wanted something back, they just said 'you're difficult'.\"That was instrumental in her decision to step back from her leadership role.The museum, showcasing more than 170 years of advances in anaesthesia and pain medicine, organised a 1950s-themed caravan named Matilda to be refitted as a mobile sound recording studio for the project, launched on Saturday at Sydney's International Convention Centre.Honorary curator Chris Ball, an anaesthetist at Melbourne's Alfred Hospital and associate professor at Monash University, described the COVID period as one of high anxiety mixed with fear and panic.\"It was really scary. The first couple of weeks were the worst. Patients in intensive care struggled; they were often COVID deniers and they would refuse treatment until they were critically ill. It was frustrating and it took up a large part of the workload.\"",
        "A surge in trauma was equally challenging with time devoted to trying to reassure people, she said.\"But I worked through HIV so I used my past experience to try to protect staff. We missed the corridor conversations and camaraderie.\"The archive gathering team is headed by museum curator Monica Cronin who hopes the 1700-plus delegates will share their pandemic experiences.\"This archive will help us and future generations better understand the personal experiences of our medical specialists,\" Ms Cronin said.\"One of the great difficulties in studying, understanding and interpreting the 1918 flu pandemic has been that records weren't deliberately amassed and kept. So this is a great opportunity to capture these personal recollections.\"The archive would be useful for understanding for future pandemic planning, she said.College president Chris Cokis said it is important the pandemic reflections are preserved for scholars and the wider community.\"These short oral histories will enrich and enhance our understanding of what it was like to be on the hospital front line from 2020 to the present,\" Dr Cokis said."
    ]
}