{
    "articleURL": "/sport/football/article-12049669/Reiss-Nelson-REJECTS-contract-offer-Arsenal-current-deal-end-season.html",
    "content": [
        "Nelson has not started a Premier League game for Arsenal since December 2019 The 23-year-old has managed three goals and as many assists in all competitionsThe Gunners are set to lose the player for free with no agreement on a new dealReiss Nelson has reportedly turned down a contract extension at Arsenal, casting further doubt over his future in north London. ",
        "The Gunners star has found game time limited in 2022-23, having struggled with injury and been overlooked amidst the stunning form of fellow wide attackers Bukayo Saka and Gabriel Martinelli. However, the club were still thought to be keen on tying him down to a longer contract, with his current deal at the Emirates up at the end of the season, only for their extension offer to be rejected, according to Fabrizio Romano. Interest in Nelson is thought to be high as a number of teams monitor the situation, with Brighton among the reported suitors, while Serie A giants AC Milan are also believed to be circling. The 23-year-old has not made a single Premier League start this term, although he has starred off the bench on occasion; notably scoring a dramatic late winner against Bournemouth to complete a 3-2 comeback in the 96th minute. ",
        "In fact, Nelson is without a single start in the Premier League since December 2019, with six substitute appearances coming this term. Yet the rejection of a contract offer is not thought to be the end of the road in negotiations with Mikel Arteta's side, as talks are expected to continue until the end of the season. Should no agreement materialise, however, Nelson would become a free agent and the Gunners would miss out on a fee for the highly-regarded youngster. ",
        "In recent years Arsenal have allowed several players to leave for nothing, such as Hector Bellerin, Alexandre Lacazette, Henrikh Mkhitaryan, Mesut Ozil, Shkodran Mustafi, Jack Wilshere and Aaron Ramsey. Nelson is set to be joined by fellow academy graduate Ainsley Maitland-Niles in departing the Gunners for free, with the English utility player, who is currently on loan at Southampton, also out of contract this summer. Nelson has spent his entire career on Arsenal's books, leaving only on loan to Hoffenheim in 2018-19 and Feyenoord in 2021-22.So far this season, the right winger has three Premier League goals and two assists, while also teeing up Eddie Nketiah in a 3-1 Carabao Cup defeat by Brighton in November.The Gunners could also lose loanee Charlie Patino, who has impressed at Blackpool this term but is not thought to feature in Arteta's first-team plans next season.  "
    ]
}