{
    "articleURL": "/health/article-12045575/Earn-130-000-year-20-days-month-ad-tempting-NHS-doctors-Australia.html",
    "content": [
        "The advert, from Blugibbon recruitment, promises A$2,000 (£1,058) per shift This compares to some NHS doctors who make less than £2,000 per month Junior doctors are being lured to Australia with a near-£130,000 a year salary and 20 days off a month to 'travel, swim and surf'.",
        "A job advert from Blugibbon Medical Recruitment, looking for medics with A&amp;E experience, promises rates of more than £1,000 per shift — of which you only have to work 10 each month.As well as this, doctors who take up the offer are to be given a two-bedroom furnished apartment, use of a car and a bonus of up to £10,000 after one year.The advert, which is currently on the British Medical Journal (BMJ) careers website, notes that the salary would put the successful candidates in the top 5 per cent of Australian earners.It comes after tens of thousands of NHS junior doctors in England took to picket lines last month in pursuit of 'pay restoration', with many warning that medics in their droves are leaving the NHS to work for better pay, terms and conditions in Australia. ",
        "In reference to former doctor Adam Kay's popular book and TV series This Is Going To Hurt, the online advert states: 'A&amp;E Registrar sick of the NHS? This isn't going to hurt…'. And a picture of a paper advert, shared by Dr Kay on Twitter, also references his piece, saying: 'Got that Dr Adam K feeling? Come to Australia!'The advert says it is looking for 'a couple or two friends' for the jobs on offer who have had four years' experience, including in accident and emergency, since graduating from medical school. ",
        "It states that the 'best part' about the job is only working five night shifts in a row, twice a month — meaning the successful candidate is off the rest of the time to 'travel or enjoy one of the world's most liveable (and cost-effective) cities'. Dr Kay called the advert 'depressing' and suggested that the Government address junior doctors' pay concerns or face them leaving the NHS.He wrote: 'How depressing to see this in the BMJ. It's hard to say those figures don't present a compelling argument. ",
        "'It all leads to a big question for the govt: if you don't address doctors' very reasonable pay concerns, alongside their conditions and wellbeing, guess where they're going?'On the BMJcareers website, the job posting promises an annual salary of A$240,000 (£127,600) and requires medics to commit to the role for 12 months. This includes A$2,000 (£1,064) per shift and a A$10,000 (£5,2899) to A$20,000 (£10,632) bonus after one year. The positions would be based at private hospital Brisbane Northside Emergency — which is located in the northern suburbs of Brisbane, Queensland. Those who are successful will work five night shifts (9pm to 7pm) in a row twice a month and the rest of the month they will be off. There are no on-call requirements but optional extra shifts are available if wanted. ",
        "The ad claims wait times at the emergency department are just four minutes per patient. For comaprison, one in five patients in England were waiting more than 12 hours to be seen by an NHS doctor in April, latest official figures show.The attractive Aussie offer comes weeks after junior doctors carried out a four-day strike over the 26 per cent real terms pay cut they have faced over the last 15 years.One junior doctor shared his payslip on Twitter amid the strikes, showing his take home at the end of his second year was just £1,823 for the month — less than just two shifts alone at the Australian private medical centre.",
        "British Medical Association (BMA) chiefs, who organised the unprecedented four-day walk-out, are demanding a 35 per cent pay rise, which could be worth up to £20,000 extra for some medics. The Government has branded current demands 'ridiculous'. Downing Street has insisted there will be no talks unless junior doctors abandon their starting position of a 35 per cent pay rise and call off the strikes. However, the BMA, which represents 45,000 junior doctors in England, has countered that Government should 'get into the room and discuss pay restoration – whether that means 35 per cent or not'.",
        "Ministers have been urged to make sweeping changes to the way NHS wages are agreed after a long-running row over pay.Government officials and many NHS unions have largely agreed to a revised pay offer after months of industrial action.But union GMB said it will not engage with the NHS Pay Review Body in the future.The body advises on pay of staff on the Agenda for Change contract which includes all NHS staff apart from doctors, dentists and very senior managers.In a letter to Health Secretary Steve Barclay, GMB said the body needs 'significant reform'.The letter from GMB national secretary Rachel Harrison says: 'The Pay Review Body (PRB), as it currently stands, is clearly unfit for purpose.'We are calling for significant reform to ensure that proper pay rises, with full pay restoration to make up for over a decade of lost earnings, can be fulfilled as soon as possible.'We will not be participating in the PRB process until it is reformed.'The letter also calls for action to tackle violence in the workplace, a change on unsocial hours payments for ambulance workers, work to examine the early retirement of many ambulance staff and better funding for mental health and social care.Ms Harrison added: 'While today's acceptance of the improved pay offer represents progress, much more needs to be done restore NHS workers' decade of lost earnings and provide the public with the health service they deserve.'",
        "Ministers have not publicly set an acceptable pay increase but the i reported that 17 to 19 per cent would be 'seen as a basis for meaningful talks'.Unions say junior doctors are striking as while the cost of living crisis sees food and energy prices soar, NHS wages have not risen with inflation — leaving medics facing a 'real-terms pay cut'. Officials estimate caving in to unions' demands would cost £2billion, which they say is 'unaffordable'. But the BMA compared the amount to a quarter of the cost of unusable PPE bought by the Government, '137th of the money that was wasted on a test and trace system' and the amount given to rail companies to 'not settle the rail dispute'. At the end of last year, the BMA surveyed nearly 4,000 members on whether they are looking to leave the NHS.Results show that four in 10 plan to quit the health service 'as soon as they can find another job', while a third plan to move abroad. The union blamed poor pay and working conditions as the reason behind the trend.The BMA, which surveyed its junior doctor members in November and December, asked to what extent they agreed they would leave the NHS 'as soon as they could find another job'. Forty per cent agreed. ",
        "When this group were asked why they were eager to leave, around eight in 10 blamed pay, specifically the 'pay erosion' over the last 15 years, their two per cent rise for 2022/23 and their current salary level. Some 83 per cent also pointed to deteriorating working conditions. Australia was the top destination, with 42 per cent of the cohort planning to move there.New Zealand (20 per cent), the Middle East, Canada and Europe, excluding the UK, (each 9 per cent) were also popular. One in 20 said they planned to go to the US.Dr Vivek Trivedi, co-chair of the BMA junior doctors committee, said at the time: 'These figures are hugely concerning. 'If the Government wants \"move to Australia\" to stay off the New Year's resolution lists of junior doctors this year, it is going to have to start by reversing the 26 per cent real terms pay cut they have endured since 2008 – or at the very least start speaking with us and stop ignoring our repeated calls to address our pay.' ",
        "And several medics have already made the move to escape 'horrendous shifts' in the 'pressure cooker' NHS. In January, junior doctor Edward Bridge told the i how he and his partner, who is also a doctor, moved to Brisbane in 2018 in search of a 'better work-life balance'.",
        "The 29-year-old said they had become 'fed up' with low pay, antisocial working hours and feeling burnt out.'The only way to incentivise people to come back is to make working conditions better and safer for doctors,' he said. 'Part of that is also paying them more.'He added that it is 'pretty horrendous' working in an under-staffed A&amp;E, and described working in the NHS as 'difficult, frustrating and demoralising'. ",
        "Dr Bridge said he had never intended to move to Australia as he resonates with the values the NHS was built upon, however the 'traumatic' experiences he had as a junior doctor in the UK changed that.'You look at your paycheck after a couple of difficult months when you’ve been doing nights, weekends and suddenly you’re like, \"why am I doing this to myself when there is a better option, there is a better lifestyle out there\",' he added.That same month it was revealed a husband-wife doctor duo had also made the move because of pay and the fact the NHS is a 'pressure cooker'.Dr Arpita Ghosh and Dr Amit Saha left the UK for Perth, Australia, in 2018 - tempted by better pay and working conditions. They the Evening Standard that Australia offers autonomy and flexibility, which is 'important for someone who has a family'.Dr Ghosh, a consultant obstetrician and gynaecologist who trained at Kings College London, thanked the NHS for #making me the doctor I am' but admitted it is now 'crunched'.'The NHS is a pressure cooker,' Dr Ghosh added. 'There is no comparison between your work-life balance in the Australian system compared to Britain. 'Pay also matters and there is a huge disparity between what is offered in both countries.'It's not just doctors that are fleeing the UK in search of attracting Australian job offers though, as Scottish nurses revealed they have tripled their wage since moving there.Laurel Dyer, 28, from the Isle of Mull, Scotland, moved to Australia last year and has undertaken roles in Western Australia and New South Wales - while fulfilling her love for the outdoors. Ms Dyer, who is employed by a nursing agency, told The Times her income was around triple what she earned back home and revealed some of her Scottish nursing colleagues have followed her lead. 'They came at a very similar time to me and are loving it out in Australia,' she said. 'I think the friends that are still at home are more settled in their life, but they are very envious of the job, the money, the lifestyle of Australia.'I think if it wasn't for those roots there, they would probably be out in a heartbeat.' "
    ]
}