{
    "articleURL": "/wires/aap/article-12053281/Lyon-faces-Clarkson-battle-Saints-eye-Kangaroos.html",
    "content": [
        "Ross Lyon doesn't look at the St Kilda-North Melbourne clash as a head-to-head battle with rival coach Alastair Clarkson.",
        "Perhaps that's wise, given the record doesn't make for pleasant reading.Lyon has lined up in more than five games against 22 different coaches over his 14 seasons as coach of the Saints and Fremantle and has winning records against 15 of them.Only two have a better than 70 per cent ratio against Lyon's sides: Kangaroos mentor Clarkson (13-1-4), previously with Hawthorn, and West Coast's Adam Simpson (9-0-3).Clarkson's success against Lyon makes for an intriguing back-drop to Sunday's encounter at Marvel Stadium, where the Saints (5-2) will start strong favourites against North Melbourne (2-5).\"I sort of never really understood (the view) you're coaching against a coach,\" Lyon said.\"You're coaching against (players) and their system.\"But what you know is (Clarkson) is formidable and he'll work hard to pull your system apart.\"Lyon expects a \"fierce\" response from North Melbourne after they were dismantled in a humiliating 90-point thrashing from Melbourne last week.St Kilda sat top of the ladder after round six but slipped to third with last week's loss to Port Adelaide - their second defeat in three matches.\"(North Melbourne) shouldn't be any more fired up than us to play their best football,\" Lyon said.\"We've only won one out of our last three, admittedly they've been close.",
        "\"I don't feel comfortable. I've never felt comfortable going into an AFL game.\"Even when I've won 13 or 14 in a row I feel like we're going to lose this week.\"The edge is on, the fire's in the belly and we're all chasing the best team in the competition in Geelong.\"St Kilda have made just one change to their side, recalling Cooper Sharman at the expense of Zaine Cordy, while North Melbourne have made five after losing Charlie Comben, Callum Coleman-Jones and Tom Powell to injury.Aaron Hall and Kayne Turner have been dropped while tough midfielder Luke Davies-Uniacke returns, and Blake Drury will make his debut.Flynn Perez, Miles Bergman and Jack Mahony have also been recalled.Lyon is wary of Davies-Uniacke, who started the season in fine form before sitting out round seven with a heel injury.\"LDU comes back, he's explosive, and our mids didn't deal with (Port Adelaide's Jason) Horne-Francis last week,\" Lyon said.\"Our mids have got a big challenge with what they've got going on in there.\"I don't think we're at a stage where we take any complacency anywhere and that's not the type of coach I am really.\""
    ]
}