{
    "articleURL": "/sport/nrl/article-12053057/The-missing-games-Wayne-Bennetts-coaching-career-NRL-refuses-recognise.html",
    "content": [
        "Wayne Bennett has coached 899 games in the NRL Game 900 is on Saturday night at Suncorp Stadium Believes his coaching in Brisbane comp should also countWas in charge of Brothers and Souths in 1970s and 1980sHas coached at NRL level since 1987, won seven titles In a remarkable record unlikely to be ever beaten, Wayne Bennett will chalk up 900 career games as an NRL coach when the Dolphins take on the Sharks during Magic Round on Saturday night.",
        "Suncorp Stadium will be the venue, appropriate given it is the scene of many Brisbane Broncos triumphs with the supercoach at the helm across two stints (1988-2008 and 2015-2018).Bennett was also a first grade coach well before entering the NRL with the Raiders in 1987.The 73-year-old was in charge of Souths and Brothers in the Brisbane Rugby League competition during the 1970s and 1980s, with the highlight the 1985 grand final triumph over Wynnum-Manly.Speaking ahead of his milestone match, Bennett is adamant the NRL should also formally recognise the 180-odd games from the BRL to his coaching record.",
        "'Well if you put all those [competitions] in there, I'm well over 900 games, I coached 180 at least in Brisbane before I went into the NRL,' he said on Friday.'I don't see why they shouldn't be (counted) but unless you're in the NRL, life doesn't really exist outside of it - that's in their minds.'There is a lot of existence outside of it, and a lot of players [like Wally Lewis] that have done a lot things in those competitions prior to the NRL.'Famously cryptic, Bennett went onto state 'I never thought about being a coach, it's not something that I kind of wanted to do, and I'm still not sure if I want to be a coach.'",
        "At NRL level, Bennett was in charge at Raiders in 1987 [28 matches], with further stints at the Broncos [631 matches, 1988-2008 and 2015-2018], Dragons [79 matches, 2009-2011], Knights [75 matches, 2012-2014] Rabbitohs [77 matches, 2019-2021], and as the inaugural coach of the Dolphins [eight matches]. Bennett's career record so far stands at 562 wins, 323 losses and 14 draws, for a winning percentage of 62.5 - and seven premierships along the way.The former policeman has also coached Queensland, England, Great Britain, New Zealand and the NRL All Stars. ",
        "ARLC chairman Peter V'landys doesn't believe Bennett's coaching numbers will be surpassed.'I can only marvel at the career of Wayne Bennett – what he has done for the game and what he has been able to achieve out of the game is phenomenal,' he said. 'Records may be meant to be broken, but it's almost certain this one will not be.'"
    ]
}