{
    "articleURL": "/tvshowbiz/article-12044967/Gia-Giudice-says-aunt-Melissa-Gorga-blocked-social-media-amid-rift-mother-Teresa.html",
    "content": [
        "Teresa Giudice's daughter Gia Giudice says that her aunt Melissa Gorga has blocked her across social media platforms amid family problems involving her mother which have been documented on The Real Housewives of New Jersey.",
        "Gia, 22, appeared Wednesday on her mother's podcast Namaste B$tches, where she revealed that Melissa, 44, had blocked her on three Instagram accounts amid the family feud.'She blocked me on my public account, my private account and my clothing line account,' said Gia, who is a senior at Rutgers University.Gia said of the situation: 'It was just weird; one day, I guess, somebody told me she posted something about me, so I went to go look, and I was like, \"I'm blocked on everything,\" so I'm blocked from everything from her.'Gia said she learned that the key incident that factored into her aunt blocking from on the social platforms occurred in February. (Neither follow the other on Instagram.)",
        "At the time, she exchanged words with her uncle - Melissa's husband Joe Gorga, 43 - accusing him of using her father Joe Giudice, 50, to garner attention on social media.Gia at the time called Joe an 'opportunist' for posing with her father after years of publicly badmouthing him.Joe Gorga had ran into his one-time brother-in-law during a weekend getaway to the Bahamas, where Joe Giudice has been residing as of late. (Joe was deported out of the U.S. in October 2019 to his native Italy after a 41-month stint in prison, and further time at an ICE facility, following his 2014 fraud conviction.)",
        "In a clip Joe Gorga posted to his page, he was seen in a hug with Joe Giudice, with both men smiling, at what appeared to be an island resort.'Both walked into the same bar at the same time,' Joe Gorga said. 'A lot of history there. We have memories since we were kids. I’m happy he’s doing well and looks good. We were both happy to see each other and catch up.'Joe Gorga said that the meeting was by chance and that he was 'glad someone caught it.'The sentimental tone in Joe Gorga's post did not sway Gia, who said that the exchange was her uncle's attempt at getting social media attention, and using her father to do it.'This is honestly comical,' Gia said in response to Gorga's clip. 'Knowing you were with him for not even 5 minutes and we’re able to have somebody take a video of the interaction meanwhile all you have done is talked so poorly about my father.'",
        "Gia told her uncle that he was 'such a opportunist to take advantage of the once in a lifetime opportunity to see my father and use it for a post.'Gorga fired back in the comments, 'We both said horrible things about each other. It was a nice moment. We have a lot of history. Get the hate out of your heart.'",
        "An insider told People Wednesday that 'Gia actually unfollowed Melissa first after writing her critical comment when they ran into her father in the Bahamas.'Gia made it clear she doesn't want a relationship with her aunt and uncle; Melissa and Joe are just trying to protect themselves from the negativity.'The Real Housewives of New Jersey can be seen on Bravo Tuesdays at 9/8c."
    ]
}