{
    "articleURL": "/wires/reuters/article-12039589/Heat-without-Jimmy-Butler-vs-Knicks-Game-2.html",
    "content": [
        "Injury concerns remain at the forefront for both the Miami Heat and host New York Knicks heading into Game 2 of their Eastern Conference semifinal series on Tuesday.",
        "Heat star Jimmy has been ruled out for Game 2 with an ankle injury.Butler rolled his right ankle and tumbled to the floor after a foul by Josh Hart with 5:05 remaining in the fourth quarter of the series opener. Butler remained in Sunday's game and gutted his way through most of the rest of the contest in eighth-seeded Miami's 108-101 victory over fifth-seeded New York.\"You just don't know with ankle sprains,\" Heat coach Erik Spoelstra said after the game. \"I don't even know if we'll know more by (Monday). We'll just have to see. It'll be a waiting game.\"The waiting game wasn't a long one with a quick turnaround to Game 2 of the best-of-seven series, although there are three days off before Game 3 on Saturday in Miami.Butler collected team highs in points (25) and rebounds (11) to go along with four assists and two steals in the series opener. He is averaging 35.5 points per game in the playoffs -- more than double his nearest teammate (Bam Adebayo, 17.2).\"That's our guy. He's our star. He's our franchise player,\" Kyle Lowry said of Butler. \"We always want him to get up and the thoughts are hopefully he's OK but if he's not, we got to find, hold it down. ... But this is what he does. He finished the game and he's a tough dude.\"",
        "While Butler was able to finish Game 1, New York's star forward Julius Randle was unable to start it due to a sprained left ankle. He aggravated the injury in Game 5 of the first-round series against the Cleveland Cavaliers on Wednesday.Randle boasted team-best averages in points (25.1) and rebounds (10.0) to go along with 4.1 assists in the regular season.\"Any time you're down, especially an All-Star like him, you're going to miss him and we did (on Sunday),\" said RJ Barrett, who finished with 26 points, nine rebounds and seven assists.With Obi Toppin starting in place of Randle, the Knicks shot just 20.6 percent from 3-point range (7-for-34) on Sunday and were outscored 39-21 from beyond the arc. They also misfired on eight of 20 free-throw attempts.\"They picked up the intensity, played hard and made shots. We didn't,\" Barrett said.Jalen Brunson, who averaged 24.0 points per game in the first round, finished with 25 on Sunday -- albeit on 23 field-goal attempts. He was 0-for-7 from 3-point range, while Barrett (1-for-5) and Hart (0-for-4) also had their struggles from beyond the arc.\"I was horrific,\" said Brunson, who committed a team-high five turnovers. \"Very uncharacteristic by me and this one's on me. I've got to be better.\"",
        "Gabe Vincent had a strong night for the Heat, draining five of Miami's 13 3-pointers and finishing with 20 points. Lowry added 18 points off the bench and Adebayo collected 16 points and eight rebounds for the Heat.--Field Level Media"
    ]
}