{
    "articleURL": "/wires/ap/article-12041111/Israeli-airstrike-Gaza-kills-1-prisoners-death.html",
    "content": [
        "JERUSALEM (AP) - Israeli airstrikes on the Gaza Strip killed a 58-year-old man and wounded five others on Wednesday, Palestinian health officials said, even as the latest spasm of violence between Israel and Palestinian militants in the enclave appeared to ebb.",
        "Israeli fighter jets struck targets in Gaza in response to salvos of rockets launched by Palestinian militants at Israeli territory on Tuesday. But after sunrise, the violence seemed to subside as both sides signaled they wanted to avoid a wider conflict.The exchange erupted when a prominent Palestinian detainee died in Israeli custody after an 87-day hunger strike. The death of Khader Adnan, 45, a leader of the Palestinian Islamic Jihad militant group credited with popularizing hunger strikes as an effective form of activism, reverberated across the occupied West Bank and Gaza Strip, where he is revered as a national hero.Protests erupted at Israeli military checkpoints and a general strike shuttered stores across the territories. Palestinians and rights groups have blamed Israel for his death, accusing prison authorities of medical negligence.London-based Amnesty International on Wednesday described Adnan's treatment in Israeli prison as \"inhumane\" and \"degrading,\" citing a doctor who visited his cell and said authorities rebuffed his requests for medical attention. Israel's prison service claims Adnan refused medical treatment until it was too late.Palestinian militants in Gaza fired 100 rockets into southern Israel late Tuesday, seriously wounding a foreign worker at a construction site. The Israeli military said its warplanes struck tunnels, arms production sites and military installations belonging to the ruling Hamas militant group in Gaza.",
        "The Israeli strikes sent shrapnel slicing through the house of 58-year-old Hashil Mubarak in Gaza City, his son Hatem said. As their roof collapsed, shards of metal struck Mubarak´s chest, killing him, according to the Palestinian Health Ministry. Mubarak was rushed to the hospital and could not be resuscitated.\"We were sleeping at home safe and sound when we heard a giant explosion from a missile,\" Hatem recalled as mourners filled his neighborhood mosque and took turns bending down to kiss his father's forehead.\"He was martyred,\" he said.After a quiet few hours, the Israeli military announced that residents in southern towns no longer needed to remain close to bomb shelters. Hamas spokesman Hazem Qasem thanked Palestinian militants for \"confronting Israeli aggression and concluding the round of the conflict.\"The U.N.'s envoy to the Mideast, Tor Wennesland, said he welcomed \"the restoration of calm\" after a violent 12 hours. \"Had our efforts failed, we would risk being in the midst of another deadly escalation,\" he said.But not everyone welcomed the calm. Israel's far-right National Security Minister Itamar Ben-Gvir lambasted Prime Minister Benjamin Netanyahu over what he described as a weak response to the rocket fire from Gaza.Ultranationalist lawmakers in Netanyahu´s coalition, including Ben-Gvir, won a record number of seats in the general election in November, after campaigning on a pledge to reduce terrorist threats and take a hard-line against the Palestinians. The latest rocket attacks have already heightened calls from the politicians' right-wing supporters to make good on their promises.",
        "Ben-Gvir's party, called Jewish Power, announced its members would boycott all parliament voting on Wednesday in protest.Netanyahu hit back at Ben-Gvir, saying that only the prime minister, defense minister and security forces are tasked with handling \"the sensitive and complex security events\" in Israel.\"If this is not acceptable to Minister Ben-Gvir, he does not have to stay in the government,\" Netanyahu's Likud party said in a statement.The spike in violence comes at a time of heightened tensions in the occupied West Bank under Israel's most right-wing government in history. On Wednesday, Israeli security forces demolished the family houses of two Palestinians who carried out deadly attacks against Israelis last fall.Israel defends its decades-old policy of leveling family homes of attackers as a deterrent. The practice has long drawn criticism from human rights groups that call it collective punishment, forbidden by international law. Some also question its effectiveness in preventing future attacks, saying such demolitions only exacerbate tensions and fuel hatred in Palestinian communities.The military said it entered the northern West Bank town of Haris and destroyed the home of 18-year-old Mohammed Souf, who killed three Israelis in a stabbing and car-ramming attack last November before being killed. The military also leveled the home of Younes Hilan, who was arrested on suspicion of fatally stabbing an Israeli man in October.",
        "Also in the West Bank on Wednesday, Israeli forces shot and seriously wounded a Palestinian outside the city of Bethlehem. The Israeli military alleged that the Palestinian refused to cooperate at a checkpoint and tried to attack soldiers. Security forces responded first by firing into the air and then shooting the suspected assailant, the military said.Israel-Palestinian fighting has surged over the past year. Roughly 250 Palestinians have been killed by Israeli fire and 49 people have been killed in Palestinian attacks against Israelis.___Associated Press writer Mohammad Jahjouh in Gaza City, Gaza Strip, contributed to this report."
    ]
}