{
    "articleURL": "/femail/fashionfinder/article-12048625/best-leopard-print-dresses-inspired-Jennifer-Lopez.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Fashion Finder article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information. ",
        "If you were impressed by Jennifer Lopez's Ralph Lauren look at this year's Met Gala, her latest ensemble by Valentino is certain to leave you stunned.With an impressive portfolio spanning over a decade, Jennifer has been dominating the fashion scene like never before – no doubt that is partly attributable to her stylists, Rob Zangardi and Mariel Haen.",
        "While promoting her new film, The Mother, Jennifer showcased her sartorial prowess in head-to-toe leopard print, designed by Valentino exclusively for the occasion. Instantly captivating, it featured an embellished mini dress, teamed with matching tights and court shoes.Leopard print has been a mainstay trend since its rise to fame in the 60s, thanks to First Lady Jackie Kennedy. Since then, it has been worn by countless celebrities over the years, including Joan Collins, Kate Moss, Kim Kardashian and even the Princess of Wales.",
        "Jennifer's look proves that when it comes to animal print, more is more, and there is nothing subtle about this craze. Whether you're curvy or slim, tall or short, there is an animal print dress out there that will look great on you.Are you ready to take a walk on the wild side? Ahead, we've curated a list of the best animal print dresses available to buy now that are perfect for any budget.",
        "Get the look: Animal print dresses   Pretty Little Thing Leopard Print Strappy Cup Detail Midi Dress  Got a big night out? Add flair to your wardrobe with this figure-flattering and affordable midi dress from Pretty Little Thing.  £17 (save £3) Shop  Chi Chi London Metallic Dress  Chi Chi London's premium line presents a jacquard design with a demure high neck and trumpet sleeves.  £45 (save £30) Shop  River Island Metallic Wrap Dress Perfect for a night of dancing, this metallic River Island dress catches the light beautifully.  £55 Shop  Never Fully Dressed Plus Slip Midaxi Dress  Don't be afraid to play with prints. This slip dress with spaghetti straps will flatter your curves and make you feel confident.  £79 Shop  Kitri 'Mimi' Dress  Kitri puts a unique spin on the trend with a Cheongsam-inspired mini that will undoubtedly make you the centre of attention.  £155 Shop  De La Vali 'Wolfie' Dress  The De La Valli 'Wolfie' style oozes playfulness with its leopard print and feather combination.  £450 Shop  Valentino Leopard Brocade Dress  This glamorous style from Valentino's ready-to-wear collection will do the trick. Crafted in Italy from wool and silk brocade, the scanty silhouette is cinched at the waist and finished with fluted sleeves.  £1,284 (save £551)  Shop"
    ]
}