{
    "articleURL": "/wires/ap/article-12051583/Biden-said-pick-Air-Force-general-Joint-Chiefs-chair.html",
    "content": [
        "WASHINGTON (AP) - President Joe Biden is expected to nominate a history-making Air Force fighter pilot with years of experience in shaping U.S. defenses to meet China's rise to serve as the nation's next top military officer, according to two U.S. officials familiar with the decision.",
        "If confirmed by the Senate, Air Force Gen. CQ Brown Jr. would replace the current chairman of the Joint Chiefs of Staff, Army Gen. Mark Milley, whose term ends in October.Brown has long been considered a front-runner for the position and Biden is likely to announce his nomination shortly, according to the officials, who spoke Friday on the condition of anonymity in order to discuss sensitive matters.While Brown would not be the first Black chairman - the late Army Gen. Colin Powell was the first - it would be the first time that both the Pentagon´s top military and civilian positions were held by African Americans. Defense Secretary Lloyd Austin, the first Black Pentagon chief, has been in the job since the beginning of the administration.Brown, 61, is a career F-16 fighter pilot with more than 3,000 flight hours and command experience at all levels. For the last year he's been widely viewed as the front-runner to replace Milley, as the Pentagon shifts from preparing for the major land wars of the past to deterring a potential future conflict with Beijing.That effort could depend heavily upon the military's ability to rapidly meet China's rise in cyberwar, space, nuclear weapons and hypersonics, all areas Brown has sharply focused on for the last several years as the Air Force's top military leader, in order to modernize U.S. airpower for a 21st century fight.",
        "Brown has broken barriers throughout his career. He served as the military´s first Black Pacific Air Forces commander, where he led the nation´s air strategy to counter China in the Indo-Pacific as Beijing rapidly militarized islands in the South China Sea and tested its bomber reach with flights near Guam.Three years ago he became the first Black Air Force chief of staff, the service´s top military officer, which also made him the first African American to lead any of the military branches.The Joint Chiefs chairman is the highest-ranking officer in the country and serves as the senior military adviser to the president, the defense secretary and the National Security Council. The chairman commands no troops and is not formally in the chain of command. But the chairman plays a critical role in all major military issues, from policy decisions to advice on major combat operations, and leads meetings with all the joints chiefs who head the various armed services.Arnold Punaro, a retired major general and former staff director for the Senate Armed Services Committee who has worked with many nominees through the confirmation process, said Brown has the credibility and experience to push the services onto a modern warfare footing.\"We have not yet made the needed adjustments to deal with the threat posed by China,\" Punaro said in a statement, calling Brown the \"perfect nominee\" for this point in history.",
        "As Air Force chief, Brown has pushed to modernize U.S. nuclear capabilities, including the soon-to-fly next-generation stealth bomber, and led the effort to shed aging warplanes so there´s funding to move forward with a new fleet of unmanned systems. He´s also supported the development of the U.S. Space Force, which received many of its first Guardians and capabilities from the Air Force.Rep. Mikie Sherrill, D-N.J., said she hasn´t been formally told of the announcement, but said Brown is a good choice.\"I do think it´s really important that the next person in charge have that (Indo-Pacific) experience,\" Sherrill said. \"I just think that´s so critical.\"Brown is private and deliberate and seen as a polar opposite to Milley, whose four-year tour has been tumultuous at times. Milley's big personality and blunt talk may have helped propel him to the top job under former President Donald Trump, but that same outspokenness eventually infuriated Trump.Milley´s past two years under Biden have been much calmer, and he has assumed a lower profile as well as he has been consumed with U.S. efforts to provide military aid to Ukraine.Brown is expected to maintain that lower profile."
    ]
}