{
    "articleURL": "/wires/reuters/article-12049525/Excited-rookie-Zach-Neto-Angels-home-face-Rangers.html",
    "content": [
        "The Los Angeles Angels return home to begin a three-game series against the American League West-leading Texas Rangers Friday night in Anaheim, Calif.",
        "Angels manager Phil Nevin continues to go with 22-year-old rookie Zach Neto not only as his starting shortstop, but now also as his leadoff hitter.Despite having to leave Wednesday's game early after being hit by a pitch on his right hand, Neto was back in the starting lineup and hitting leadoff for the fifth game in a row in Thursday's 11-7 win over the St. Louis Cardinals -- the Angels' fourth straight win.A year ago at this time Neto was still in college at Campbell University in North Carolina before being drafted in the first round (13th overall pick) by the Angels in last year's MLB draft.But despite only 30 games at Double-A Rocket City last year and seven games at Rocket City this year, the Angels thought enough of Neto to call him up on April 15, sending infielder David Fletcher to the minors.Initially Neto batted ninth, but with Taylor Ward struggling in the leadoff spot at the time, Neto was moved atop the lineup. His on-base percentage of .342 ranks fifth among regulars on the team behind Anthony Rendon (.396), Mike Trout (.388), Shohei Ohtani (.374) and Luis Rengifo (.351) -- and a big part of Neto's success has to do with his propensity to be hit by a pitch.",
        "He's been hit seven times in 73 plate appearances, ranking second highest in the majors, behind only Oakland's Esteury Ruiz's nine HBPs in 134 times at bat. It's not an accident -- Neto was hit 27 times in 100 games at Campbell University.\"When I was in college, they kind of just embedded in our head (to) just not move our feet,\" he said. \"I get pretty close to the plate and when the ball is coming at me, it's just embedded in my head not to move. At the end of the day, on-base percentage goes up and I get in position to score and help the lineup turn back over. I got hit a lot in college, so it's nothing new.\"Left-hander Tyler Anderson (1-0, 5.74 ERA) will make his sixth start of the season for Los Angeles. He is 1-0 with a 2.45 ERA in five career games (four starts) against Texas.The Rangers also are getting production from an unexpected source in catcher Jonah Heim. Acquired by the Rangers in a trade in 2021 from the Oakland A's, Heim was a defense-first catcher with the idea he could prove a solid backup. But he's taken over the starting duties for Rangers manager Bruce Bochy, thanks to his ability to contribute offense as well.",
        "Heim, a switch-hitter, is batting .294 with seven doubles, six homers, 23 RBIs and a team-leading .959 OPS.\"This guy does a terrific job behind the plate,\" Bochy said. \"Metrics show that he's a good framer, good catcher, good blocker and a good thrower. He's hitting (close to) .300 now with power that keeps on both sides of the plate. He's emerging as one of the better catchers in the game. That's how good I think he is.\"The Rangers, who have won four of their last five games, had not yet announced a starting pitcher for Friday's game as of Thursday evening.--Field Level Media"
    ]
}