{
    "articleURL": "/wires/pa/article-12046153/Stuart-Kettlewell-comfortable-waiting-answers-Motherwell-players-future.html",
    "content": [
        "Motherwell manager Stuart Kettlewell has assured supporters the club have done all they can to keep out-of-contract players such as Max Johnston and Dean Cornelius – and is comfortable with waiting for answers.",
        "Kettlewell insists there has been no negative impact of working without a chief executive and he has also made offers to other players outside the club.Academy players Johnston and Cornelius have been an integral part of Kettlewell’s team since he took over in February but have both been linked with moves under freedom of contract, although Motherwell would be entitled to compensation.Speaking ahead of Saturday’s cinch Premiership match against Kilmarnock, Kettlewell said: “We have been really proactive, as much as we possibly can, in a number of situations and I have always been a person who is very, very calm in these situations.“I hear people start to worry and panic and all the rest of it. When you as a football club and a manager have taken every step you possibly can, make it known what players you want, put offers down in front of them, try to make that as lucrative as you can in relation to what your club can offer, then I think there comes a point where you have to step back and just be calm about it and allow players to make their decisions and take advice from the relevant people.“I believe in development, I believe in trying to hit milestones as a player, being on the park, becoming a better player and a better person as well. If you think Motherwell is the place where you will become both a better player and a better person, then this is the right place for you.",
        "“If it’s not, then it’s not, so I don’t ever get too caught up in it.“There has to be a point where we take a step back. We have done absolutely everything we possibly can.“I am really comfortable with that, and we will find out what the decisions are through time.”Kettlewell earlier stated that he had spent Wednesday “covering absolutely everything across the football club”.Motherwell have gone through March and April without a chief executive since Alan Burrows left for Aberdeen, and potential appointments have fallen through but Kettlewell declared that had not been a problem for him.“We have an interim process and I am working very, very closely with one of the board members that has a wealth of experience in a number of different fields,” he said.“So that has been a terrific support to me and that’s been a terrific support to the football club.“That is going to be a shorter-term process which allows the club to make the correct appointment at the end of it.“There is no point in us elaborating on it too much because it is that interim, short-term process, but it is 100 per cent being done for the right reasons and there is no stone being unturned off the back of it.",
        "“But there will be a process that hopefully we have that longer-term plan.”"
    ]
}