{
    "articleURL": "/news/article-12057193/Bookies-bump-Penny-Mordaunt-second-favourite-replace-Rishi-Sunak.html",
    "content": [
        "It comes after her sword-carrying role at the coronation boosted her profileAfter a show-stealing Coronation performance, Penny Mordaunt was yesterday bumped up to being second favourite to succeed Rishi Sunak.",
        "Bookmakers slashed the odds on her becoming the next Conservative Party leader after her sword-carrying role boosted her profile.Ladbrokes put the Commons Leader and Lord President of the Privy Council at 13/2 second favourite – behind Business Secretary Kemi Badenoch at 7/2 but well ahead of former Prime Minister Boris Johnson at 7/1.Ms Mordaunt, 50, received plaudits from across the political spectrum after holding aloft the 4ft Great Sword of State for much of Saturday's two-hour service. She carried the 17th-century weapon into Westminster Abbey – the first time a woman has performed this role.She was then presented with the Jewelled Sword of Offering, a smaller item decorated with silver, diamonds, rubies and emeralds. The sword was blessed by the Archbishop of Canterbury before Ms Mordaunt then presented it to the King, who clipped it into his girdle.",
        "It was eventually returned to Ms Mordaunt – who in 2014 featured on ITV's diving show Splash! and was named 'Britain's sexiest MP' in a poll – and she carried it again as she walked ahead of the King following his crowning. Ms Mordaunt narrowly failed to make the ballot paper for the final run-off in last summer's Tory leadership contest following a backlash over her 'woke' views.Liz Truss then installed her in the relatively lowly Cabinet position of Commons leader in a bid to keep her out of the limelight. ",
        "But the plan backfired after the Queen's death in September, when her secondary Privy Council role came to the fore.She played a central part in the accession council when Charles was formally acclaimed as King. And she starred again on Saturday, when she dazzled in a custom-made teal dress emblazoned with the golden fern motif of the Privy Council.Miss Mordaunt revealed she had undergone a training regime involving press-ups, as well as practising with a weighted replica of the 7lb 5oz sword originally made for Charles II.She pushed for promotion to Foreign Secretary when Mr Sunak became PM in October, but asked to stay as Commons leader when the move was refused."
    ]
}