{
    "articleURL": "/tvshowbiz/article-12038887/Post-Malone-shows-new-slimmed-physique-following-recent-dramatic-weight-loss.html",
    "content": [
        "Post Malone showed off his new slimmed-down physique on Tuesday as he enjoyed a shopping spree at Tom Ford in London ahead of his shows at the O2 Arena. ",
        "The rapper, 27, recently admitted he's 'never felt healthier' after transforming his lifestyle since becoming a father in May 2022. Malone looked happier than ever as he donned camouflage cargo pants, which he paired with an ivory bomber jacket and brown T-Shirt.   He appeared in cheerful spirits as he beamed and gave the cameras a thumbs up while he got into a taxi. The American musician looked fantastic after buying some new clothes, as he prepares to perform in the UK.  ",
        "Post Malone, real name Austin Post, recently set the record straight about his weight loss, taking to his Instagram to dispel any rumours that he is using narcotics. 'I wanted to say that I’m not doing drugs, I’ve had a lot of people ask me about my weight loss and I’d suppose, performance on stage,' he said, nodding to the pounds he shed and high energy during his concerts. 'I’m having a lot of fun performing, and have never felt healthier.'The rapper proceeded to guess that 'dad life' helped him commit to kicking soda and 'eating better' so he 'can be around for a long time' for his baby girl, whose name has not been publicly revealed.'Next up is smokes and brews, but I like to consider myself a patient man,' he said of his final vices. ",
        "The father-of-one concluded his lengthy caption by stating that he's been spending time in the 'studio lately working on new music' and that his 'brain is in a super dope place.' The 10-time Grammy nominee also raved that he is the 'happiest' he's 'been in a long time' and thanked his fans for their patience and support.In February, the performer shocked fans with his slimmed-down figure during his recent performance in Sydney, Australia. ",
        "At the time, sources told TMZ that Post had gained weight for a movie role and since then, has been working out and following a strict diet.His touring schedule is also said to have contributed to his weight loss.Malone confirmed that he and his girlfriend - now fiancée - were expecting their first child in an interview with TMZ on May 3.'I'm excited for this next chapter in my life, I'm the happiest I've ever been, and for since I could remember I was sad. Time to take care of my body and my family and friends, and spread as much love as we can every day,' he said at the time.The couple ended up holding a private party in Southern California, in celebration of the happy baby news.Malone has tried to keep his personal life out of the public's eye, so he has not yet confirmed the identity of his wife-to-be, although he's been rumored to be dating Korean rapper MLMA, which stands for MeLoveMeALot.",
        "In June 2022, Malone subtly revealed that he recently welcomed his first child while appearing on The Howard Stern Show.While answering a question Howard had posed on the SiriusXM series, Malone described his morning routine and said he 'kissed his baby girl' before leaving the house. ",
        "Now that the Better Now singer is a father, he is also ready to be a husband. Malone told Stern that he is engaged to the mother of his daughter.'I went and I kissed my baby girl,' Post Malone told Howard Stern while explaining how he began his day.Howard questioned whether the Rockstar rapper was referring to a girlfriend or an actual baby to which he responded: 'Nah, that's my daughter.'Ahead of his first child's birth, the rapper admitted that he's 'pumped beyond belief' for fatherhood during an interview with Apple Music's Zane Lowe. But, Malone also expressed concern over the current state of the world and how it's 'a crazy place to raise a kid.'Malone has tried to keep his personal life out of the public's eye, so he has not yet confirmed the identity of his wife-to-be, although he's been rumored to be dating Korean rapper MLMA, which stands for MeLoveMeALot.The star is also gearing up for the impending release of his fourth studio album, Twelve Carat Toothache. ",
        "It will contain 14 tracks and includes guest appearances from The Weeknd, Doja Cat, Roddy Ricch, Gunna and The Kid Laroi.The first single, One Right Now, a collaboration with The Weeknd, was released last November and peaked at number six on the Billboard Hot 100."
    ]
}