{
    "articleURL": "/wires/reuters/article-12059913/Uber-rival-Bolt-seeks-turn-profitable-year-IPO-2025.html",
    "content": [
        "By Supantha Mukherjee",
        "STOCKHOLM, May 8 (Reuters) - Estonian ride-hailing and food delivery startup Bolt expects to turn profitable in the next 12 months and be ready for an initial public offering in 2025, its Chief Executive Officer Markus Villig said in an interview.The company, a rival of Uber, was valued at over $8 billion when it raised 628 million euros from investors in January last year.\"We expect to be the first European mobility platform that will be fully profitable over the next 12 months,\" said Villig, who doesn't have a driving license.Uber is also expecting to post operating income profitability this year.Bolt, run by 29-year-old Villig, does not plan to raise external capital through another funding round but will get ready for an IPO instead.\"We are planning to be ready to go public in 2025,\" he said, adding that a final decision will depend on market conditions at that time.The startup, which also offers electric scooter rentals, car-sharing and grocery delivery service, has a focus on Africa from where it gets 50 million of its 150 million customers.\"Out of all the African countries, we've so far only launched in seven... over the next 10 years Africa remains a massive opportunity for us,\" Villig said.Bolt is also evaluating whether it could fix the payment landscape in Africa where many people are more likely to have a mobile phone than a bank account.",
        "\"Maybe we should go into that one day,\" he said.The company has not publicly disclosed its revenue but Villig said the company is doing single-digit billions of dollars of transactions on the platform every year.It also expects its grocery business to break even or turn profitable in two or three years.Grocery delivery is a highly competitive area as companies like Bolt, Just Eat Takeaway.com and Uber Eats are charging more for delivery to cover the costs of higher wages as some countries crack down on the gig industry.The food delivery sector was among those boosted by the COVID-19 pandemic, but the effect has waned as consumers, faced with surging prices, have cut discretionary spending.Ride-hailing is Bolt's largest business. It charges a commission of between 20% to 23% of the fare which can go as low as 10% if drivers choose to opt for promotions such as putting a Bolt sticker on their cars.\"Our philosophy is not always to be the cheapest rider ... the mistake that some platforms make is that if you only focus on the lowest prices, you can end up with very bad availability of cars because drivers will not be happy,\" Villig said. (Reporting by Supantha Mukherjee in Stockholm Editing by Christina Fincher)"
    ]
}