{
    "articleURL": "/wires/aap/article-12044061/Right-place-right-time--big-winner-Kerr.html",
    "content": [
        "Once more in the right place at the right moment, Sam Kerr's sixth sense for goal has again proved priceless for Chelsea.",
        "Australia's master striker had endured a quiet, somewhat frustrating game on Wednesday evening at Kingsmeadow as the Women's Super League champions Chelsea looked set to drop crucial points on their home patch against Liverpool, locked at 1-1 with just four minutes left.But scenting exactly the right spot to snap up any unconsidered trifle, Kerr, typically, reacted quicker than anyone when Jessie Fleming's brilliant curling shot from just outside the box rattled off the crossbar.You would say it was luck if it didn't happen so often - but Kerr had somehow manoeuvred herself into position to be ahead of the slower-reacting Liverpool defenders and in the ideal spot to bundle the ball home on the rebound, even if she didn't make the sweetest contact.\"It was critical - Sam did what she's done so many, many times for this team and popped up with the winner,\" said a relieved Chelsea boss Emma Hayes, happy that the 2-1 win still keeps the WSL title destiny in her players' hands.Chelsea are now four points behind leaders Manchester United, and just a point adrift of Manchester City but they have two games in hand on both teams, who also still have to play each other in a derby.It was the Matildas captain Kerr's ninth league goal of the WSL campaign and perhaps her most important, lifting Chelsea to victory on a night when they had looked flat and a bit uninspired after the disappointment of their Champions League exit in Barcelona.",
        "\"I know we can produce better performances than we have done but when you get to this stage of this season, you've got to dig out the results - and that's what we did,\" said Hayes.It had always promised to be an awkward night for Chelsea after Emma Koivisto had shocked the champions by volleying home after just two minutes.Kerr was thwarted twice by some excellent defending, with debutant goalkeeper Faye Kirby working wonders to palm away Kerr's 22nd-minute glancing header.Chelsea did equalise four minutes before the break but looked vulnerable until the introduction of Pernille Harder and Jelena Cankovic after halftime seemed to energise them, and there was something inevitable about Kerr eventually pouncing for her 26th goal in all competitions for Chelsea this season."
    ]
}