{
    "articleURL": "/wires/reuters/article-12050399/Investors-cautious-tightening-path-smaller-ECB-hike.html",
    "content": [
        "By Harry Robertson and Stefano Rebaudo",
        "May 5 (Reuters) - Euro zone government bond yields rose on Friday after data showed that U.S. employment and wages rose by more than economists expected in April.The strong jobs and wage data could complicate the Federal Reserve's fight against inflation, potentially leading to more interest rate hikes.U.S. bond yields rose and their European peers, which had already been trading higher on the day, followed suit.Germany's 2-year bond yield, which is highly sensitive to interest rate expectations, was last up 7 basis points at 2.6%, 2 bps higher than before the data.That was not enough to undo Thursday's 15 bp fall, however, which was triggered by the European Central Bank stepping down the pace of its interest rate hikes and appearing more \"dovish\" about inflation than many had expected.\"There are nuances in there,\" Antoine Bouvet, senior rates strategist at ING, said of the U.S. data.\"It's not a home-run hawkish report. But it clearly runs counter to the prevailing narrative this week, that the Fed is at the end of the cycle.\"Germany's 10-year yield was last up 8 bps at 2.277%, 2 bps higher than before the data. It remains well below the almost 12-year high of 2.77% it reached in early March, before the turbulence in the global banking system.",
        "The U.S. data showed that non-farm payrolls increased by 253,000 jobs last month, more than the 180,000 expected by economists.Data for March was revised lower to show 165,000 jobs added instead of 236,000 as previously reported.Wages increased 4.4% on a year-on-year basis in April, after climbing 4.3% in March.The Italian 10-year yield was last up 6 bps to 4.187%. That caused the closely watched gap between German and Italian 10-year yields to narrow to 190 bps.The strength and importance of the American economy and the dollar mean U.S. data has a major bearing on Europe. If the U.S. economy remains strong, global growth is likely to as well.On Wednesday, theFed raised ratesby 25 bps to a range of 5% to 5.25%, and signalled that rate hikes could soon be over.Next Wednesday's U.S. inflation data will provide more information on whether the Fed can stop there, and will be hugely important for markets.In Europe, pricing in derivatives markets shows that traders currently expect the ECB to raise interest rates by 25 bps one more time, but are less certain about whether another 25-bp increase will follow.Before the ECB's meeting on Thursday, further hikes in June and July were widely expected.French ECB policymaker Francois Villeroy de Galhau said on Friday that \"the essence of the effort has been done, although there will probably (be) a few more rate hikes\".",
        "Lithuanian policymaker Gediminas Simkus also said that ECB rates will still had to rise further.(Reporting by Harry Robertson and Stefano Rebaudo Editing by Keith Weir, Mark Potter, Alexander Smith and Nick Macfie)"
    ]
}