{
    "articleURL": "/news/article-12048825/JPMorgan-CEO-Google-founder-deposed-two-days-banks-links-Epstein.html",
    "content": [
        "JPMorgan Chase's CEO will be deposed at the end of this month over his bank's links to pedophile financier Jeffrey Epstein, who died awaiting trial in 2019Investigators are looking into whether the bank can be held liable for profiting from Epstein's illegal actsThe investigators have also subpoenaed Google's founder Larry Page: Epstein allegedly courted Page as a client for JPMorgan Chase The CEO of JPMorgan Chase and co-founder of Google are both being asked to testify about Jeffrey Epstein's financial interests, as prosecutors in the U.S. Virgin Islands continue to try and unravel the late pedophile's financial web.",
        "Epstein, 66, died in a Manhattan jail in August 2019, awaiting trial for sex trafficking. His accomplice Ghislaine Maxwell was sentenced in June 2022.The attorney general of the U.S. Virgin Islands, where he had a home on a private island, is overseeing distribution of funds from a compensation scheme set up to help his dozens of victims.Denise George has requested that Jamie Dimon, the JPMorgan CEO, testify about his bank's dealings with Epstein, and sources close to the enquiry confirmed to CNN on Thursday that Dimon will testify on May 26 and 27.The U.S. Virgin Islands is seeking unspecified damages from the largest U.S. bank for Epstein's alleged abuse of young girls and women on Little St. James, a private island he owned. George is also seeking testimony from Larry Page, who co-founded Google.",
        "Epstein reportedly sought to recruit Page as a client of JPMorgan.The subpoena, obtained by The Daily Beast, also requests correspondence between Page and Epstein, and Page and JPMorgan; documents showing fees Page paid to Epstein or JPMorgan; and records touching on 'Epstein's involvement in human trafficking and/or his procurement of girls or women for commercial sex.' On Thursday, George sought permission to subpoena Page by 'alternative service' - usually mail, or via a public notice - because they had spent the last month unsuccessfully trying to track him down and subpoena him in person. George said they had hired private investigators, but still couldn't find him. ",
        "In 2021 the reclusive billionaire was said to be living off-the-grid in Fiji; some reports said he had since moved to New Zealand.Last month, Page's Google co-founder Sergey Brin was subpoenaed by George, along with billionaires Mortimer Zuckerman and Thomas Pritzker.Dimon has for several years faced questions about his bank's dealings with Epstein.Last month, a complaint filed in New York alleged that JPMorgan Chase executives were aware of numerous sex abuse and trafficking allegations against Epstein, and overlooked them for years.Epstein was investigated over his sexual abuse of children in 2005, by prosecutors in Miami.",
        "In 2008, Epstein pleaded guilty to a felony charge of solicitation of prostitution involving a minor, and was sentenced to 18 months in prison; he served 13, under extremely lenient conditions.JPMorgan did not severe ties with Epstein for five more years, until 2013. 'JPMorgan's relationship with Epstein in allowing his sex-trafficking venture to access large sums of cash each year went far beyond a normal (and lawful) banking relationship,' the filing said. The complaint detailed internal warnings that the financier 'should go,' that there was 'lots of smoke. Lots of questions,' and that anti-money laundering officials asked that the bank 'exit this relationship.' The complaint added an additional count alleging that JPMorgan obstructed federal law enforcement and prosecuting agencies that were pursuing Epstein.",
        "Dimon, asked last month whether his bank should have cut off Epstein sooner, told CNN: 'Hindsight is a fabulous gift.' "
    ]
}