{
    "articleURL": "/wires/reuters/article-12047419/Portuguese-president-address-nation-govt-crisis-looms.html",
    "content": [
        "By Sergio Goncalves and Andrei Khalip",
        "LISBON, May 4 (Reuters) - Portugal President Marcelo Rebelo de Sousa issued a dire new warning on Thursday to the prime minister after their rift put the country on the verge of a full-blown political crisis, but refrained from using his power to dissolve parliament.\"All things considered, I will continue to prefer the guarantee of institutional stability\" as Portuguese struggle with high inflation and interest rates, the conservative president told the nation in a televised address.The prospect of any snap election producing a hung parliament and unstable government has likely prevented the president from using more drastic measures, analysts say.But he said the Socialist majority government had work to do to preserve its credibility, and that he would be more assertive in his relationship with the administration.Opposition parties on Wednesday called on the president to use his power to dissolve parliament after Prime Minister Antonio Costa rejected an offer by Infrastructure Minister Joao Galamba to resign in a deepening scandal around state-owned airline TAP, snubbing Rebelo de Sousa.\"The government did not assume the responsibility as it should have by replacing the infrastructure minister,\" Rebelo de Sousa said.\"Political and administrative responsibility is essential for the Portuguese to believe in those who govern them ... What happened will have other effects in the future, I'll have to be more attentive to the question of political and administrative responsibility\" of the government, he said.",
        "The president has cooperated with the premier since he was first elected president in 2016, just a few months after Costa took office.However, since Costa's third consecutive term started in January 2022, Rebelo de Sousa has shown growing discomfort, criticising a lack of new faces in his government, which he said appeared \"worn out and tired,\" and their divergence deepened this year.With growth already slowing down across Europe, a government crisis would also complicate the distribution of vital EU pandemic recovery funds in Portugal.Costa's Socialists won an outright parliamentary majority in January 2022, but his third government in a row has been plagued by problems.More than 10 ministers and secretaries of state have left their posts in the past year, at least two of them linked to a scandal at airline TAP set off by an irregular severance payment to a board member that has snowballed to reveal what critics say are failures in government communication and decision-making.That included the use of the secret service to retrieve the laptop of a fired ministry employee after he threatened to reveal some confidential information from the TAP file.The president said he will scrutinise the government to avoid \"greater deterioration of institutions\" and degradation of democracy.There was no immediate reaction from the prime minister.",
        "Rebelo de Sousa, a law professor, former political commentator and ex-leader of the Social Democratic Party - the main rival to the Socialists - won re-election in 2021 by a landslide.In November 2021, after a hung parliament rejected Costa's budget for 2022, the president dissolved parliament. Costa won a full majority in a snap election that followed.Only once in Portugal's democratic history has a majority administration been dismissed and parliament disbanded.In 2005, President Jorge Sampaio concluded that premier Pedro Santana Lopes' government was failing to tackle a rising deficit and economic slump and lacked overall credibility, so he used the power, often dubbed the Atomic Bomb in Portugal.Costa, however, boasts a solid record as a deficit-buster and has achieved some of the strongest economic expansions in Europe in recent years. (Reporting by Sergio Goncalves and Andrei Khalip in Lisbon Editing by Matthew Lewis)"
    ]
}