{
    "articleURL": "/wires/ap/article-12040269/Mountcastles-pair-2-run-HRs-sends-Os-11-7-win-KC.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - Tyler Wells was just hoping to hang around long enough to save the Baltimore bullpen, and maybe give the Orioles' hot-hitting lineup a chance to get them back in the game against the Kansas City Royals on Tuesday night.",
        "\"Whenever I say there's no quit in this team,\" Wells said later, \"there's no quit in this offense.\"That was evident by the fourth inning, when Ryan Mountcastle hit a two-run homer to help the Orioles wipe out an early three-run deficit with a five-run outburst. Mountcastle added another two-run homer the next inning and finished with five RBIs, helping the Orioles to an 11-7 victory over the Royals - and a 10th consecutive series-opening win.\"Just a great game offensively,\" Orioles manager Brandon Hyde said. \"Mountcastle was a huge part of our lineup.\"He wasn't the only part, though. Adley Rutschman had four hits and an RBI, James McCann had three hits and also drove in a run, and the Orioles finished with 15 hits to go with eight walks against Kansas City pitching.\"They have a lot of ways to beat you,\" Royals manager Matt Quatraro said.",
        "Wells (2-1) allowed three hits over six innings but they were all homers: Bobby Witt Jr.'s leadoff rocket, a two-run homer by MJ Melendez and a solo shot by Salvador Perez. Wells also walked three and struck out four.Perez, who added a two-run homer in the seventh, left in the eighth inning when Anthony Santander's follow-through hit the catcher on his glove. Perez bruised his middle finger and Freddy Fermin handled the rest of the game.",
        "Ryan Yarbrough (0-4) matched a Royals record by striking out the first five Baltimore batters, including Mountcastle, before things fell apart in the fourth. The power-hitting first baseman followed a double by Rutschman with his first two-run homer, and Yarbrough was pulled after 3 2/3 innings as the Orioles batted through the lineup and scored five times.Mountcastle added another two-run shot off Jose Cuas in the fifth, his eighth homer of the season, then added a run-scoring double in the sixth, before the Orioles cruised the rest of the way to their 16th win in their last 20 games.The Royals have lost 10 straight at Kauffman Stadium to match the third-longest streak in franchise history. They also had a pair of 11-game streaks end in 2012 and 2013, the year before they won the first of back-to-back AL pennants.This bunch appears to be a long way from such lofty heights. The Royals fell to 7-23 under Quatraro, matching the 2005 team that lost 106 games for the worst 30-game start in franchise history.\"It's not where we want to be right now,\" Witt said. \"You're in the big leagues. You can't stay away from that.\"Things started well for Kansas City on Tuesday night when Witt hit his first career leadoff homer and Melendez sent an 85 mph changeup deep to right field for a 3-0 lead. But after Yarbrough joined Gil Meche and Brady Singer as the only Royals to begin a game with five strikeouts, the Orioles quickly erased their deficit.",
        "Mountcastle's first homer took care of most of it, an RBI single by McCann tied the game, and Cedric Mullins added a two-run single later in the fourth. Mountcastle's second two-run shot gave him his eighth career multi-homer game, and he helped the Orioles tack on three more runs in the sixth to put the game out of reach.\"I'm happy that we opened up another series with a win,\" Hyde said.THIS AND THATOn the at-bat that forced Perez out of the game, Santander eventually singled after seeing 16 pitches, including 12 consecutive foul balls. ... Orioles RHP Yennier Cano allowed a single in the ninth to end a club-record 32 straight hitless at-bats to start the season. ... The Negro Leagues Baseball Museum announced Tuesday it was planning to build a new 30,000-square foot facility in the 18th &amp; Vine section of Kansas City. The museum is a popular attraction for teams visiting the Royals.MAKING MOVESThe Royals recalled INF Maikel Garcia, one of their top prospects, along with Fermin from Triple-A Omaha. DH Franmil Reyes was optioned to the same club and INF Nicky Lopez (appendicitis) placed on the 10-day IL.TRAINER'S ROOMOrioles: RHP Dillon Tate (flexor strain) allowed two runs in 1 1/3 innings in a rehab stint for Double-A Bowie on Tuesday. RHP Mychal Givens (left knee inflammation) pitched a scoreless inning in the same game against Erie.",
        "UP NEXTRHP Kyle Gibson (3.93 ERA) tries to become the first Orioles pitcher to start 5-0 since Jimmy Key won his first eight decisions in 1997 as the series continues on Wednesday night. RHP Zack Greinke (0-4, 6.10) gets the start for the Royals.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}