{
    "articleURL": "/wires/aap/article-12040163/Raiders-look-forwards-three-game-NRL-win-streak.html",
    "content": [
        "Canberra's top-notch forward pack is finding its feet and has helped the Raiders steer their 2023 NRL campaign back on track.",
        "Having driven their back-half redemption last season and carried them to a semi-final appearance, they've already helped avert an early-season calamity and turn their poor start into a 4-4 record after nine rounds.Second-phase football appears vital to a pack featuring heavy-hitters such as Joe Tapine, Josh Papali'i, Corey Horsburgh, Hudson Young and Emre Guler, with the Raiders producing 13 offloads a game in wins compared with just seven per game in losses.They found a whopping 24 offloads in their 31-30 win against the Dolphins last weekend, the most by a team in any single game this season by some margin.\"It's good, but we got to mix it up. We first run hard and then you get offloads,\" Tapine said.\"When you're on the run, the offloads become easy, obviously running hard first creates the opportunity.\"You don't go out to do it, but if it presents itself it helps the team.\"The biggest shift in the Raiders' fortunes might be Horsburgh's move to lock, boasting a 3-0 record since he moved to No.13 when they'd slumped to their 1-4 start.Horsburgh's personal form has also benefited to the point he's put himself on the Queensland State of Origin radar, churning out 112m a game at No.13 compared with just 65m in his bench role.",
        "\"Big Red has been huge this year as well, he's dynamic and the way he's playing has changed the team,\" Tapine said.\"It's been exciting seeing him, and he's got a bit of a bounce in his step walking around too.\"He's just got a nice little bit of ball-playing ... it's got a good mixture of what he's been doing. His chat and confidence has been high so if we keep him in that form, it's gonna do us good.\"Tapine's high work rate has almost snuck under the radar given his elite consistency, again inside the league's top-three forwards for metres per game, backing up a huge 2022 where he earned a monster four-year contract extension.He admitted it was tough to see star five-eighth Jack Wighton announce his departure given his long-term commitment to the club, but wouldn't fault him taking the best decision for his family.\"You sign to stay at a club with players like that, but it's footy,\" Tapine said.\"A lot of people leave and a lot of great mates have left this club already, so we'll still keep in touch.\"Nothing's changed with us and Jacko, he's a close mate before a footy player ... it's tough but we support him 100 per cent. Him and his family will always be part of the Raiders family.\""
    ]
}