{
    "articleURL": "/wires/ap/article-12052475/No-child-deserves-says-godmother-slain-6-year-old.html",
    "content": [
        "KANSAS CITY, Kan. (AP) - Relatives are demanding justice for a 6-year-old boy who was killed outside his Kansas home in a drive-by shooting that police said doesn't appear to be random.",
        "Kansas City, Kansas, police spokeswoman Nancy Chartrand confirmed Friday that the boy was Sir´Antonio Brown and said there was no new information to share about the search for suspects.\"I just want the people that did this brought to justice,\" his godmother, Shyneisha Hill, told KCTV-TV. \"Sir deserves justice. No 6-year-old deserves that. No child deserves that. No parent deserves what my cousin is going through.\"One or more shooters opened fire on Sir on Wednesday as he played in the front yard of a home, killing him. Police announced Thursday that they had found the vehicle used in the attack and asked for tips.Chartrand told The Associated Press that police believe that the suspects came to the neighborhood with the intention of targeting someone, although she didn't know the reason behind it.\"This wasn´t like they were just joyriding in the area without intent to basically shoot and kill somebody. That´s what they came to do,\" Chartrand said. \"Unfortunately, Sir, was there and he was the one that was shot and killed.\"She said that sometimes a stray bullet fired in a shootout a block away claims the life of a child. But she said this was different.\"When they pulled up and let loose with gunfire, they saw that child there. We don´t believe that there´s any way that they didn´t,\" she said. \"And they shot anyway, showing no regard for his life, much less whoever it was that they were intending to be shooting at.\"",
        "The loss was reverberating around the community. Sir's kindergarten teacher, Amanda Mynatt, told KSHB-TV that she joked that Sir was her \"school son.\"\"He was so charismatic, he never sat still, he would be doing cartwheels across the carpet, and everyone loved him,\" she said."
    ]
}