{
    "articleURL": "/wires/pa/article-12051005/More-workers-Amazon-balloted-possible-industrial-action.html",
    "content": [
        "More workers at online giant Amazon are to be balloted for strikes over pay.",
        "The GMB said its members at Rugeley, in Staffordshire, and Mansfield, Nottinghamshire, will vote in the next few weeks on whether to launch a campaign of industrial action.The GMB has already held a series of strikes at Amazon’s site in Coventry, which the union said is having a “domino effect” in other areas. This escalation will see workers in two further fulfilment centres asked to have their say on downing tools and walking out to deliver pay justice  Amanda Gearing, GMB  Workers have since submitted a request for union recognition after the GMB reached the membership threshold for mandatory recognition, which it said could mark Amazon’s first union recognition in Europe.The ballots at Rugely and Mansfield will run until June 9.Amanda Gearing, GMB Senior Organiser, said: “This is no time for sound bites; but Amazon workers are fighting back against a pay rise of pennies from one of the world’s wealthiest corporations.",
        "“This escalation will see workers in two further fulfilment centres asked to have their say on downing tools and walking out to deliver pay justice.“We’ve already seen enormous enthusiasm from workers at Mansfield and Rugeley to take action, now it’ll be up to them how their union moves forward with the campaign. We regularly review our pay to ensure we offer competitive wages, and recently announced another increase for our UK teams  Amazon  ",
        "“We warned Amazon that this could fast become a summer of strike chaos if they refused to sit down and talk pay. Amazon Coventry workers have risen up, now we are seeing a domino effect.“With strike action escalating and historical union recognition on the horizon, it’s time for Amazon to get real and get around the table”.An Amazon spokesperson said: “We regularly review our pay to ensure we offer competitive wages, and recently announced another increase for our UK teams.“Over the past seven months, our minimum pay has risen by 10% and by more than 37% since 2018. We also work hard to provide great benefits, a positive work environment and excellent career opportunities.“These are just some of the reasons people want to come and work at Amazon, whether it’s their first job, a seasonal role or an opportunity for them to advance their career.”"
    ]
}