{
    "articleURL": "/wires/ap/article-12049967/Strong-earthquake-hits-Japan-no-tsunami-threat.html",
    "content": [
        "TOKYO (AP) - A strong, shallow earthquake hit central Japan on Friday afternoon, killing at least one person and injuring more than 20 others and disrupting plans for holidaymakers.",
        "The magnitude 6.2 quake struck Ishikawa prefecture on the west coast of Japan's main island of Honshu, the U.S. Geological Survey said. The Japan Meteorological Agency measured the quake at 6.5 and said it was centered at a depth of about 12 kilometers (7.5 miles).More than 50 aftershocks strong enough to be felt have been recorded since, including one at 5.8 magnitude on Friday night.Most injuries and damages were reported in Suzu city at the northern tip of Noto Peninsula in Ishikawa prefecture. One person died after falling from a ladder, and 22 others were injured in the prefecture, two of them seriously. The rest were mild injuries.Some 100 residents took refuge at evacuation centers Friday night, according to the prefectural crisis management department. One injury was reported in the neighboring prefecture of Toyama, according to the Fire and Disaster Management Agency.Several homes were also damaged. On Saturday morning, some residents placed blue plastic tarps over damaged parts of their houses ahead of rain forecasted to begin in the evening.",
        "A video broadcast by NHK public television showed a section of a hill that had crumbled and fallen on a house. It also broadcast a video taken by a staff member visiting a relative in Ishikawa prefecture that showed a room shaking for nearly half a minute, with picture frames rattling on the walls. Japan is celebrating several national holidays this week.",
        "Prime Minister Fumio Kishida, who returned from a multinational trip to Africa and Singapore on Friday night, expressed condolences to quake victims and urged residents to \"use ample caution\" amid possible strong aftershocks and secondary mudslides.East Japan Railway Co. said bullet trains connecting Tokyo and Kanazawa in Ishikawa prefecture were temporarily halted for safety checks but resumed normal operations, with some delays.There were no abnormalities at nuclear power plants in the area, according to the Nuclear Regulation Authority.Japan is one of the world's most earthquake-prone nations. A massive 2011 quake in the country's northeast caused a devastating tsunami and nuclear plant meltdown.___This story has been corrected to say the quake did not occur offshore."
    ]
}