{
    "articleURL": "/news/article-12054075/How-media-covered-King-Charles-ascendance-throne-official-coronation-ceremony.html",
    "content": [
        "Newspapers and broadcasters from coast to coast have dedicated their coverage to the new King and QueenCNN, ABC, Fox News, CBS and NBC all canceled their usual coverage to follow the procession the entire way through CORONATION LIVEBLOG: Click here to follow live updates throughout todayAmericans joined together to mark the star of a new era for the British monarchy as King Charles ascended to the throne.",
        "Many US publications had a live stream of the official coronation ceremony, as the majority had wall-to-wall coverage of the historic occasion.They showed the Royals coming together to mark the historic moment, with Prince Harry jetting back from California to see his father become King.First Lady Jill Biden, 71, joined her daughter Finnegan, 24, at the ceremony after her husband Joe declined the invitation because he has 'a lot going on'.However, the President was quick to thank his wife for representing the US, tweeting: 'Congratulations to King Charles III and Queen Camilla on their Coronation. The enduring friendship between the US and the UK is a source of strength for both our peoples.",
        "'I am proud the First Lady is representing the United States for this historic occasion.'Thousands lined the streets to pay their respects, as millions tuned in across the globe to watch the ceremony, which was described by the LA Times as being a show of 'pomp and pageantry'.The Washington Post led the coverage from inside of Westminster Abbey for the procession, with the New York Times and New York Post also having footage from the event.CNN, ABC, Fox News, CBS and NBC all canceled their usual coverage to follow the procession the entire way through, with royal commentators covering the build-up to the occasion.",
        "CBS, CNBC, Spectrum News, and MSNBC also all carried their own special guests throughout the morning to mark the event – with Piers Morgan leading the coverage for Fox News.Many were quick to point out that the ceremony appeared lavish, despite attempts but the palace to create a pared-down coronation.Buckingham Palace does not provide an official figure for the cost of the coronation, but estimates put it at between £50 million and £100 million. The Wall Street Journal pointed out that despite the star-studded guest list the event 'celebrated a millennium of history and reflects a more modern, diverse Britain.'",
        "The Washington Post covered the movement of the royal procession through London to Buckingham Palace with experts, as well as describing the Gold State Coach as a 'bumpy ride'. Others pointed out that Prince Harry struck a lonely figure after traveling from California for the occasion, with the New York Post calling him the 'lone prince'.Princess Charlotte and Prince Louis also stole part of the show by holding hands throughout the coronation, with the eight-year-old princess donning an encrusted flower crown to match her mother.The New York Times also had a live stream of the event, after toning down criticism of the coronation after receiving a huge backlash when they slammed the costs of the late Queen Elizabeth's funeral.",
        "However they were quick to say that Charles was walking a 'tightrope', and cover anti-monarchist protests which made a small blip on the big day.Other publications continued to report on the 'special relationship' between the two countries, as thousands of world leaders and hundreds of members of the public began filing into the Abbey.",
        "Host of CNN's coverage Anderson Cooper was also mocked online following the coverage, where he failed to recognize Prince George.The lead anchor was quickly cut off by Max Foster and Christiane Amanpour after saying 'we haven't seen George' as the third in line to the throne was on the screen.Cooper pointed out the next few occasions the nine-year-old prince was on the screen, but not before his blunder was picked up by the millions watching the coronation.Foster quickly cuts across Cooper saying: 'No we did see him, he's holding the robe behind the King.'Cooper then goes: 'George is there in the back left', but is ignored by the other two, who continue to discuss the crowns the new King will wear."
    ]
}