{
    "articleURL": "/wires/pa/article-12059237/It-s-hands--Erik-Ten-Hag-not-panicking-Man-Utd-s-four-hopes.html",
    "content": [
        "Erik Ten Hag shrugged off the threat of Liverpool and insisted Manchester United’s top-four bid is still in their own hands.",
        "Fourth-placed United have slipped to back-to-back 1-0 defeats against Brighton and West Ham to allow Liverpool, who have won six straight matches, to close to within a point of the final Champions League spot.Ten Hag’s side do have a game in hand, however, and three wins from their remaining games at home to Wolves, Chelsea and Fulham and a trip to Bournemouth will guarantee finishing above Jurgen Klopp’s team.",
        "“It’s not about Liverpool, it’s about us and because of the table we have everything in our hands,” said Ten Hag.“If we bring our performance and our standards we’ll win games. We don’t have to look to others, we have to look at ourselves and find a way to win and get back to our levels.”Said Benrahma’s first-half goal, aided by an awful gaffe from United goalkeeper David De Gea, lifted West Ham seven points above the relegation zone.",
        "The Hammers spent £160million on eight new signings last summer, and another £12million on Danny Ings in January, but have endured a tough season in the Premier League.However, full-back Aaron Cresswell believes the new faces are finally beginning to click.“It’s always a tough transition when you bring in eight or nine players and, certainly for the boys who have come from abroad, it takes time for them to settle in,” Cresswell told West Ham TV.",
        "“It’s a new language, a new team, a new everything.“We knew it would be tough but I think in this game, some of the performances from the new lads – Thilo Kehrer was excellent, as were Lucas Paqueta and Nayef Aguerd. All the new boys who have come in were excellent.“Everyone played their part. That atmosphere was special too, especially in the last 10 minutes when you’re digging deep and everyone is cramping up.“But what a night, and it’s a massive three points. We’re not completely safe but we’re getting close to being mathematically safe.”"
    ]
}