{
    "articleURL": "/femail/article-12055565/Princess-Kate-mastered-power-glamour-Coronation-Charlotte-stole-show.html",
    "content": [
        "As the Coronation procession made its way up the aisle of Westminster Abbey yesterday, the female under the most pressure fashion-wise was the Princess of Wales.",
        "All eyes were on this woman who has evolved into a staggering beauty with world class style and who has honed her taste over the years into something exquisite. 'Royal' dressing can sometimes lead to a stiff, bourgeois look. Kate has elegantly avoided this and next to her European peers, she stands out as a lesson in grown-up glamour.I was asked a million times over the last few weeks which designer Kate would choose to wear for the Coronation. For me it was a no-brainer. I was sure it would be Sarah Burton at Alexander McQueen.",
        "Burton is the British designer Kate has put her faith in for so many of her most important moments. It was Burton who designed her mesmerisingly beautiful wedding dress. She has dressed the Princess of Wales for state visits and numerous daytime functions. The McQueen signature style – that tailored, structured, nipped-in waist, flared skirt and narrow arm – exaggerates Kate's incredible figure. It gives her a silhouette to die for.I was lucky enough at the start of my fashion career to work with the late Alexander McQueen and was dressed by him many times. He designed my wedding dress, when Sarah Burton was his chief assistant, helping to execute his vision with the seamstresses at the studio in London's Hoxton.",
        "Alexander was typically blunt when I suggested, at my first fitting, that perhaps I could have a very trendy wedding dress in silver lace, as I loved the way he worked with lace. He retorted that this was a dreadful idea – 'You're not supposed to look ''trendy'' on your wedding day. The dress must be white,' he admonished me. 'You've got to look immaculate.'For all his East End roguishness, Alexander was a sophisticate underneath who understood that fashion needed to be appropriate for the occasion. He believed that a considered silhouette, and the construction of it, made for great clothes, and imbued the wearer with an innate confidence. He was trained as a tailor in Savile Row before attending Saint Martin's School of Art, and whether he was designing a jacket or an evening gown, every piece was founded on serious construction. Seams for him were the invisible architecture that supported a garment like the walls of a building.He often said that his clothes were like armour for a woman, a sartorial protection. And everything Sarah Burton has done since she took over as creative director of the brand has honoured that principle.",
        "The Alexander McQueen dress Kate wore yesterday – beneath her red, white and deep blue Royal Victorian Order Mantle – delivered the Princess of Wales all the protection she needed.",
        "Made of ivory silk crepe, with its silver bullion and thread-work embroidery incorporating rose, thistle, daffodil and shamrock motifs – signifying the four nations of the United Kingdom – the dress was a work of art that ticked both the chic and the grand box. It was fitting for the pomp and seriousness of the occasion without being stuffy or old-fashioned.The extraordinary headpiece, made by British milliner Jess Collett for Alexander McQueen, with its crystal and silver three-dimensional leaf embroidery – you could call it a non-tiara tiara – was an ultra-modern touch.Combined with the pearl and diamond earrings that belonged to Diana, Princess of Wales, and the glittering George VI Festoon necklace made in 1950 at the request of King George VI for his daughter Princess Elizabeth, Kate was a vision of power glamour. But among the velvets and ermines, the sashes and garters, there was an unexpected fashion moment that I won't forget.That was the sight of little Princess Charlotte, walking into the Abbey behind her parents. She was clad in a three-quarter length, ivory silk Alexander McQueen dress, with its matching cape, and wearing charming white ballet flats along with her own silver Jess Collett headpiece – all echoing her mother's outfit.It was a vision of purity, of childlike innocence, and, yet, chic.",
        "When it comes to red carpet rankings, Charlotte stole the show.Plum Sykes is a novelist and a contributing editor at American Vogue "
    ]
}