{
    "articleURL": "/wires/aap/article-12044961/School-curriculum-rollout-delay-relieves-teacher-burden.html",
    "content": [
        "The rollout of a new curriculum across NSW classrooms will be delayed to give teachers more time to focus on quality learning after the previous timeline was deemed unmanageable and unworkable.",
        "Announcing the change at a teachers' conference in Sydney on Thursday, Minister for Education and Early Learning Prue Car said she had followed feedback from teachers, principals, school sectors and unions.\"This announcement is not made in a vacuum,\" Ms Car said.\"This decision has been made in the environment of a crippling chronic shortage of teachers and teachers that are chronically overworked and overburdened with administrative tasks.\"Ms Car said the timeline originally proposed was unworkable, too challenging and was putting more pressure on teachers when the workforce was already grappling with a teacher shortage crisis.\"The previous government's timeline was driving teachers to the brink of the edge,\" she said.Instead of teachers having to learn and prepare for 100 new syllabuses over the next two years, the new syllabuses will be staggered over five years, with core subjects such as english and maths to be prioritised.\"If we are to give students the strongest foundations for success in life then we need to give their teachers time to get to know the english and maths curriculum and implement them well,\" Ms Car said.The minister said the release of dozens of new syllabuses per term this year was unworkable.\"Each new syllabus requires teachers to undertake professional learning, develop new lessons and assessments, and ensure consistent reporting to parents - all of which takes time.",
        "\"A strategic rollout will mean teachers have adequate time to consult and get to know the new syllabuses and the time to implement them well.\"Paul Martin, chief of NSW Education Standards Authority, said teachers could now focus on \"the best english and maths syllabuses we've ever seen in this state\".\"It's about time, it's about priority, and it's about making sure that the young students of the state get the best teaching that they possibly can,\" he said.Independent Education Union NSW secretary Mark Northam said teachers had been warning for months that the previous timeframe was unnecessary and unmanageable.\"It is important to get it right rather than just get it done quickly,\" he said.The rollout extension would also enable teachers to focus on depth in the syllabus, rather than just the breadth of content.\"To be able to do that they need time,\" Kelly Borg from the Association of Independent Schools of NSW said.The syllabus reforms follow the first comprehensive review in more than three decades.The shift in timeframes means all new syllabuses will be delivered to teachers by 2027 - in line with the intent of the Masters Curriculum Review, that outlined a 10-year delivery timeframe."
    ]
}