{
    "articleURL": "/femail/relationships/article-12056969/What-happened-husband-went-green-refused-jet-abroad-holiday-me.html",
    "content": [
        "Marion McGilvary says her husband now refuses to travel via airplane with herREAD MORE: The Brits starting their very own vineyards - and producing wine to rival the FrenchAfter 13 years together, my partner and I recently parted ways. It was not my decision and I admit I was shocked.",
        "The future I had planned for myself vanished overnight: I was unceremoniously dumped.Well, sort of. We didn't actually break up. Instead, he announced he wasn't going to travel by plane any more and if I wanted to go overseas, I was basically on my own. What?!As people in our early 60s, who have a little spare dosh and independent children, when my partner retired early, I'd imagined a footloose, fancy-free future tootling hand in hand round the world.I certainly didn't imagine a future of single room supplements and lonely solo nights.'Why?' I wailed, stunned by this unilateral decision.'Oh, the planet, global warming, fossil fuels, take your pick,' he said, shaking his head at my lack of understanding and regard for the climate crisis. Cripes. Suddenly I was not only Marion No Mates, but a shameful eco-terrorist to boot.",
        "How did this happen? I mean, you meet a man later in life when you imagine his habits are pretty much already ingrained.Then, before your eyes, he morphs from a harmless vegetarian who supports Friends Of The Earth into a crusading vegan who rarely drinks and buys an Extinction Rebellion T-shirt.I went along with this, of course. He's a grown man with his own very worthy convictions, which I respect. But there are limits.",
        "I suppose air travel is famously bad for the environment, but it wasn't as if we were frequently jetting around the globe. Which, unfortunately, was his reasoning.'Well, we're not big flyers so I thought it would be an easy thing to give up,' he said.Easy? Easy?That's your criteria for being a bold, crusading eco-warrior? I confess my inner Presbyterian shrieked at his lack of rigour.I mean, why couldn't he do something positive, like volunteer for tree-planting or cleaning up the local nature reserve?If you're going to make a sacrifice, to my mind giving up something you rarely do is a bit like giving up sugar for lent when you're diabetic. It felt like I was the one making the sacrifice here.Don't get me wrong, I too am worried about the planet. But as a household we have a fairly low carbon footprint.I don't eat meat and I keep the thermostat low — to save money and to avoid wasting energy. I want solar panels, I recycle, I avoid all unnecessary plastic.I offset my travel by paying for trees, and I hardly thought two flights a year would have a huge impact on the dwindling ice cap.",
        "To be honest, there's a bit of me that thinks we're probably doomed anyway, so it makes little sense to sit in a caravan in Skegness while we wait for the end of days.",
        "We are not prolific travellers. Cheap flights for a weekend away on a whim are not for us.We are not people who must lie on a beach at every opportunity but still, I had dreams. I raised four children with a mostly absentee partner, who I could only rarely accompany to the many conferences he attended alone (well not always, as it turns out, which is what put the 'ex' before the word husband).He would come back complaining about the soullessness of the hotels I longed to stay in, and I hoped the two of us could add on a few days to his European trips — maybe drive across France, or take a month in Italy — and I'd have him all to myself.Well, divorce put paid to that, but then I met George and it was all going to be different. He'd been to India and Thailand, so obviously had a sense of adventure and curiosity about the world.He was outgoing. He wasn't stuck in his boring old ways, as so many men of his generation are. We would be liberated. It was going to be my third act. But no. The play had a limited run.It started so well: Budapest, Crete, Spain, Sweden, Puglia, Morocco. But I guess I should have known everything was going to go a bit pear-shaped when — on his suggestion — we backpacked around Norway staying in youth hostels.",
        "Readers, I am not a woman who can carry, or carry off, a rucksack. And my idea of comfort isn't a dorm shared with five Australians.Then, back home, he became fixated on 're-wilding' the garden.He strewed wildflower seeds across the lawn and refused to cut it. Weeds, he insisted, were just flowers nobody wants. Exactly. Like bindweed, for instance, which sprang up instead of the poppies and cornflowers I had been promised.Staycations are not enjoyable when you are surrounded by a weed-ridden wilderness, complete with a thick hedge with thorns that would defeat Prince Charming, that he cossets to provide berries for the birds. No wonder I want to get away.He did agree to travel by train. But it's a lot more expensive, and is not time-effective unless you go for an extended period.This brings me to the football. As a keen, nay obsessive, footie fan, he says he can't be away when there's a match — which gives us even less time to travel together.Therefore, my only option is solo travelling. I am fated to be that odd woman on holiday who you think must be an old spinster but who, in my case at least, has got a perfectly good, younger, handsome chap at home, planting weeds in the garden.",
        "So far, I've been the third wheel with married friends in Cyprus for a week, and thrown myself on friends in America.Most recently, after deciding that I can't just let my life speed past sitting at home, I spent a month in Greece.I had friends in Athens who took pity on me with regular outings — but by the end we were all bored of me. It wasn't what I'd planned for myself.Travel is not the same without someone to share the experience. Posting your exploits on social media isn't the same as having a companion with you.But I got a taste of local life, and the joy of meeting old friends and having no distractions.And there were some more upsides. My partner is a good planner, almost too good, so it was actually rather nice not being yomped from one pre-planned excursion to another.I confess I enjoyed not having to eat at vegan restaurants all the time, too.But these benefits don't make up for the negatives.Inevitably, I'll get used to living these foreign experiences through my own eyes only, and it's a shame that we are no longer building memories together.I'm trying to stay positive. I've realised it's so much easier to travel solo if you are doing something practical and you all have the same interest in common, so there will be singing holidays and painting holidays, I expect.",
        "And in February I've signed up for the dreaded luxury tour of India — where I'll join the widows and old bachelors in my version of the Marigold Hotel, I hope.But I can't say I'm not sad that this is what it's come to.You have a partner in order to have someone to do things with, not to do those things alone.Still, we'll always have the garden to argue over."
    ]
}