{
    "articleURL": "/tvshowbiz/article-12047113/Marie-Osmond-63-shares-RARE-photo-husband-celebrate-12th-wedding-anniversary.html",
    "content": [
        "Marie Osmond shared a rare photo to Instagram with her husband Steve Craig on Thursday.",
        "The 64-year-old singer and Dancing With The Stars vet posed next to her spouse while on a boat while at sea.The former Talk cohost shared that they were celebrating their 12th wedding anniversary.'We chose May 4th, (my son Michael and my Moms birthday) to symbolically have them with us in spirit when we remarried. Happy 12 Anniversary to the love of my life! #heavenlybirthdays,' she shared.  The two have been wed twice: the first time was in 1982, but they divorced in 1985, and the second time was in 2011. In between the performer was married to Brian Blosil from 1986 until 2007.",
        "After she divorced Blosil in 2007, she got back together with Steve.'Nothing is an accident,' she told People in 2019 about finding love again with her ex. 'I am a spiritual person. So [I believe] God has his timing.' Marie and Steve wed again in 2011 and it has been bliss ever since 'I'm enjoying being alone with my husband,' she wrote on Instagram in March 2020.'It has been a blessing to have [time] together, especially after being apart for over 25 years.'In the new image at sea, Marie had on a black top with her black hair worn down in a flirty shag.And her better half was in a cherry red top as he put his arm around his lady love.",
        "  In December the two were seen at Disney World with her grandchildren.She shared two photos from the amusement park after performing there over Christmas.'After we finished the #CandlightCelebration at Epcot, I've been blessed to spend the week with my family here at Walt Disney World! I hope you have all had a relaxing and wonderful week!' she said.She also talked about performing over the holidays.",
        "Marie had to work in Disneyland at Christmas, as she is leading this year's Candlelight Procession narration at the resort's Epcott park but decided to fly out with her husband Steve Craig and all their family - including her children Rachael, Matthew, Stephen, Jessica, Brandon, Brianna and Abigail – to enjoy an extended break there afterwards.She said: 'My husband and I are flying all of our children and grandchildren to Disney World, and we're all going to celebrate Christmas there.'I'll host the processional, and then I will stay a little longer and just be Grandma and Mama. We're going to spoil everyone rotten.'The ex Donny and Marie star labelled her first Christmas without her son Michael Blosil- who took his own life aged 18 - as 'tough but joyous' as she celebrated the 'little miracles' like performing a festive show and seeing the 'first steps' of her grandson.",
        "Marie said: 'I got to see his first steps and see how amazing God is.'And she also talked about love. Osmond says 'people need love' at Christmas.The hitmaker insisted it is more important to use the time off during the festive season to connect with one another rather than marry about material things.The singer told the US edition of Closer magazine: 'I want to get out to the people and thank them for the six decades they've given me. People need love during the holidays. They don't need stuff. They need to be together. Music is power, love, celebration, and I just want to spread the joy.'",
        "Marie has been vocal about how in love she is with Steve this second time around.'I'm in love for the first time in my life, like really in love, and it's probably the most wonderful experience I've had,' the former Talk host gushed to Closer Weekly in October 2019.'Truly in love.'The couple call Utah home which is perfect for them as they have been enjoying the slower pace.'We sit and watch TV and eat popcorn,' she explained. 'We're very low-key. Really, we're both just kind of easy, mellow. We're best friends. He really is an amazing man.'",
        "She is most often asked about her incredible weight loss. She lost 50lbs 15 years ago.",
        "The singer has told DailyMail.com exclusively earlier this year how she manages to keep the weight off with some of the premium meals - like ravioli, potstickers, ice cream and lemon chicken - from Nutrisystem, a company she is a spokesperson for.'I don't call it a diet, I call it a lifestyle,' the former Dancing With The Stars contestant  shared. 'It's not about being skinny, it's about being healthy.'The new options for 2022 have made the star - who went from 170lbs to 120lbs in 2007 - happy. 'They now have premium meals that are amazing and taste like you've been cooking in the kitchen all day,' Marie told DailyMail.com. 'They also offer entrees that are Restaurant Favorites and taste just like what you'd order at your favorite restaurant. You don't have to sacrifice flavor with this program,' she added.Osmond said some of her favorite premium meals are the potstickers ('They are the bomb, and you can add low sodium soy sauce and onions), ravioli, burritos and lemon caper chicken. She also likes the ice cream sandwiches.'I've tried every fad diet out there, they don't work. If you starve yourself, you're going to mess up your metabolism,' she said.",
        "'You have to eat food. That's why Nutrisystem is great. You never feel hungry. You don't have to think about what you're going to eat - it's easy and it's done for you. No weighing food or counting points,' she said.",
        "For years she dieted and did not find her groove until she stumbled on Nutrisystem. 'They helped me to have a healthier relationship with food and taught me how to be healthy. And as a result, I have kept the weight off for 14 years,' said the Paper Roses crooner.'Maintaining a healthy weight also helps manage blood pressure, cholesterol and sugar levels – which all have to do with how I feel inside, not how I look outside.'Eating right is about more than appearance. When I was 50 pounds heavier, I didn't have the energy for my career or life with my grandchildren.' "
    ]
}