{
    "articleURL": "/tvshowbiz/article-12052593/Im-Celeb-South-Africa-fans-kick-ends-dramatic-CLIFFHANGER-tense-trial.html",
    "content": [
        "I'm A Celebrity South Africa viewers kicked off on Friday night as the show ended on a dramatic cliffhanger ahead of a double elimination.",
        "The latest instalment wrapped up during a tense trial in which yellow pride's Jordan Banjo and Myleene Klass and green pride's Andy Whyment and Georgia Toffolo battled for their place in camp.The group were going head-to-head in the gold mine trial, with the winners earning a luxury picnic, while the losing pair would be sent home.However, just as things began to heat up with the competition closely fought, the show abruptly ended, with the result not being announced until Monday.And viewers were far from impressed with the 'cruel' twist as they took to Twitter to vent their fury, with one even asking: 'What are you playing at?!'",
        "'Making us wait till Monday?!' fumed one person, while another questioned: 'What you mean NEXT TIME ???!''Literally ending it on a cliffhanger like that and we won't even find out until Monday. Nah. Livid' ranted a third.'Leaving it there and making us wait till monday..cruel' fumed a fourth person.Another angry viewer asked: 'WHAT ARE YOU PLAYING AT?!'With an additional person adding: 'Tell us what's happening as cannot wait until Monday as it will do my head in.'The four had to take part in the Gold Rush trial, in which they had to find gold nuggets buried inside identical mine shafts. ",
        "The object of the game was to find the nuggets and place them on scales at entrance to the mine, with each team having to find enough nuggets to tip the scales and win a picnic for their team - with the losers going home. It was a closely fought race, with Georgia and Andy initially taking the lead while Myleene struggled to find any nuggets as Jordan ploughed ahead.",
        "But things evened up when Myleene began to find her nuggets, with the competition seriously heating up as the stars desperately fought to come out on top.However, viewers will have to wait and see which two stars would be packing their bags.  Earlier, hosts Ant and Dec revealed that team captains Dean Gaffney and Joe Swash had to pick two members each from their teams to go head-to-head in a trial.And while the winning team would get a luxury picnic with bubbles, the losing duo would be sent straight home. The vote caused tension among the camp as some celebrities were up for the challenge, while others were clearly reluctant to put their names forward.Joe had a rather easy job as Georgia immediately volunteered, followed by Andy who said he was up for it.But Dean had a more difficult choice as his team didn't appear to put their heads above the parapet, before eventually Myleene put herself forward declaring she was there to win.",
        "However, Jordan was somewhat more reluctant after Dean noted that he was one of the stronger competitors and he'd do well.",
        "The Diversity star expressed his fears that there'd be snakes, before sharing his worry about being responsible for Myleene's exit. Meanwhile, Paul Burrell, later said that Joe should have picked himself and Janice Dickinson to do the trial as they were the 'weakest' and 'oldest' team members - despite not stepping forward during the vote.While Carol Vorderman, who also didn't volunteer, said she was 'not happy' with  choice as it could mean the exit of two strong team members. I'm A Celebrity...South Africa continues Monday at 9pm on ITV1 and ITVX. "
    ]
}