{
    "articleURL": "/wires/ap/article-12044013/City-regains-spot-Haaland-breaks-EPL-scoring-record.html",
    "content": [
        "MANCHESTER, England (AP) - A new Premier League goals record for Erling Haaland and three more points for title-chasing Manchester City.",
        "The Norway striker has scored 35 times in his first season playing in English soccer's top division - surpassing the previous single-season record that was jointly held by Alan Shearer and Andy Cole.Haaland still has five more games to add to his remarkable total and left the field to a guard of honor from his teammates after the final whistle.\"He´s a unique person and he´s so special,\" City manager Pep Guardiola said. \"He deserved the guard of honor because it´s an incredible milestone. Another day he might break his own record. He´s scored a lot of goals\"While the Golden Boot for the country's leading scorer is certain to come Haaland's way, bigger prizes are also in sight, with City edging closer to a third straight title after a 3-0 win against West Ham.Haaland's goal in the 70th-minute put City 2-0 up after Nathan Ake had opened the scoring in the 50th.",
        "Substitute Phil Foden added a third with a deflected effort in the 85th.The win moved City back to the top of the standings, a point above Arsenal, which had gone to the summit after a 3-1 win against Chelsea on Tuesday.Guardiola's defending champions also have a game in hand on their title rival.While the result suggested a routine win for City, West Ham proved to be frustrating opponents for the opening 45 minutes, limiting the home team to just a few chances.",
        "On the rare occasions City did create clear openings, Jack Grealish and Rodri hit the post.After struggling in the first half, City took just five minutes after the restart to find the breakthrough.Riyad Mahrez´ free kick was played to the far post, where Ake met it and headed down past Lukasz Fabianski.Haaland, who had been relatively quiet, put the game beyond doubt when he ran on to Grealish´s through ball and lifted his shot over the goalkeeper and into the back of the net to make history.City still had time to add another when Foden came off the bench to shoot from distance, with the ball taking a deflection and wrong-footing Fabianski.It was the 1,000th goal of Guardiola´s City reign.City is in ominous form, recording nine straight wins in the league and extending its unbeaten run in all competitions to 19 games.\"We dropped a little tonight but not much and we managed to create some chances,\" Guardiola said. \"It´s another three points and we keep going.\"West Ham remains in a struggle for Premier League survival, just four points above the relegation zone.\"You´ve got to pick up some points. Performances don´t matter at this time of the season,\" said manager David Moyes.___",
        "James Robson is at https://twitter.com/jamesalanrobson___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}