{
    "articleURL": "/money/markets/article-12049823/British-Airways-owner-IAG-raises-profit-forecast.html",
    "content": [
        "International Airlines Group reported a €9million first-quarter operating profit The business saw better-than-expected performance across all of its airlines Last year, the Omicron variant sent the company to €718million lossBritish Airways' parent company has increased its profit forecast due to a strong recovery in demand for leisure travel. ",
        "IAG now expects underlying profits for 2023 to surpass the top end of its €1.8billion to €2.3billion (£1.6billion to £2billion) prior outlook, supported by lower fuel costs, rising ticket prices and higher demand on long and short-haul flights. The company bounced back to a small first-quarter operating profit for the first time since before the pandemic, thanks to the continued recovery in leisure travel.International Airlines Group (IAG), which also runs Aer Lingus, Vueling and Iberia, reported an operating profit of €9million (£7.8million) for the opening three months of 2023.In the equivalent period last year, the Anglo-Spanish firm made a €718 million loss due to governments reintroducing travel restrictions in response to the emergence of the Omicron variant of Covid-19. ",
        "Revenue climbed by 71.4 per cent to €5.9billion between January and March thanks to a surge in passengers across all regions and better-than-expected performances in all of IAG's divisions.Aer Lingus and Vueling's results were buoyed by strong demand for flights to the United States, with the latter also benefiting from travel to Spain and Latin America and a faster rebound in business customers relative to other airlines.The company forecasts full-year capacity to be at 97 per cent of 2019 volumes, helped by the resumption of British Airways services to Shanghai and Beijing this summer.",
        "Chief executive Luis Gallego said: 'We are seeing healthy forward bookings with leisure demand particularly strong while business travel continues to recover more slowly.'As we return to more normal operations, we continue to invest in sustainability, including more fuel-efficient aircraft, and in customer experience, updating the business cabins for British Airways and Iberia.'Over the past year, we have recruited thousands of new employees across the Group and strengthened our operations so that we are ready to deliver for our customers during the summer peak.'IAG and other airline groups were severely impacted by delays and cancellations last year as employee shortages left them struggling to cope with the exceptional resurgence in demand.The industry has also been affected by a wave of strike action, causing thousands more flights across Europe to be axed.Security officers at Heathrow Airport are currently staging the first of three planned walkouts in a dispute over pay, having just completed a 10-day strike that hit travellers over Easter.Richard Hunter, the head of markets at stockbroker Interactive Investor, said: 'The headwinds which have blighted the sector are never far away, meaning that airline stocks have long been a traditionally hazardous investment, variously affected by virus outbreaks, industrial action, volcanic dust clouds and higher fuel costs.",
        "'The pandemic added another level of issues, while current macroeconomic and geopolitical concerns add to a potentially dangerous mix.'International Airlines Group shares were 2 per cent up at £1.50 just before trading closed on Friday. However, they remain about two-thirds below their value in January 2020.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}