{
    "articleURL": "/tvshowbiz/arabella-chi/article-12053919/Arabella-Chi-exhibits-sizzling-figure-halter-bodycon-dress-SHEIN-fashion-Ibiza.html",
    "content": [
        "Arabella Chi looked sensational as she attended the exclusive SHEIN fashion show at Ocean Beach in Ibiza on Friday along with other celebrities.",
        "The model, 32, showcased her jaw-dropping figure as she slipped into a coloured-print plunging halter bodycon dress. She nailed the perfect beach look as she put on a very leggy display and showed off her cleavage with a racy deep neckline.The influencer wore dainty earrings and a slew of silver necklaces, one displaying her name in bold.She wore chunky espadrille wedges and accessorised with more jewellery including bracelets, a golden watch and rings.",
        "The former Love Island star showed off her tan and wore her golden locks loose with a side parting.Arabella looked glowing as she opted for a bronze but light make up palette, displaying her stunning features.She donned a shimmery golden eyeshadow and mascara, and finished off with glossy lipstick.The bombshell posed with Love Island co-star and pal Molly Smith as she finished off the glamorous look with a pink quilted purse and black shades.Meanwhile Molly, 29, flashed her washboard abs in a chic beach ensemble.The model donned a skimpy black bikini with diamonds decorations - and left little to the imagination in a pair of sheer flared trousers.The bombshell exhibited her enviable physique as she gave herself some extra inches with a pair of towering beach heels with straps, featuring golden rhinestones decorations.",
        "Molly accessorised the glamorous look with purple-tinted shades and carried the essentials for the event in an embroidered handbag.",
        "She looked glowing as she styled her blonde locks in perfect waves with a side parting.The former Love Island beauty donned a bronze eyeshadow, with nude lipstick, peachy blush and filled in eyebrows.Love Island sensation Olivia Hawkins looked sensational in a green net cut-out dress, and wore a skimpy white bikini underneath.The beauty donned a natural make up look, and kept her brown tresses in a half-up ponytail.OIivia posed up with Lucinda Strafford - who stunned in a beige bikini top and white mini skirt, teamed with grey flip flops.Elsewhere, Nicole O'Brien showcased her physique in a skimpy black bikini featuring cherry prints, and wore black and white Nike Dunk Low.The Too Hot To Handle star, 27,  donned a bold eyeliner and bronze tones on her eyelids, finishing off with a rouge lipstick.The TV personality wore her dyed lilac tresses in a high ponytail with two locks down her face to frame her features.She opted for eye-catching large golden earrings and a chain necklace.TikTok star Chiara Verzella was also in attendance as she posed with Italian actress Giulia Izzo.Chiara, 26, donned a printed bikini top and a matching beach mini-skirt, and wore a black net long-sleeve top on it.",
        "She carried a black embroidered purse - and donned a glamorous baby blue eyeshadow to match her ensemble.Meanwhile Giulia, 19, looked stunning in a green cut-out bodycon midi dress, toted with a cropped white denim jacket and a matching croque handbag.The actress showcased her natural feature with only a touch of blush and mascara, adding pearl earrings and a necklace to her look.Kendall Rae Knight looked fabulous in a one-shoulder crinkled white swimsuit, teamed with an orange sarong with fringes.The former Love Island star, 26, embraced the sun-soaking look and rocked a pair of brown-tinted shades.She wore her long chocolate tresses loose, as she showed off a big smile for the camera.TikTok sensation Brisida Shkreli also attended the event.She displayed her ample cleavage in a skimpy black bikini top, and kept it cosy with a pair of matching shorts.",
        "Brisida wore a red and yellow cover-up for the beach - as she carried a embroidered  purse and oversized shades in her hand.The beauty slicked her chocolate locks back into a ponytail and wore dainty jewellery.The TikTok star donned a bronze palette and showcased a shimmery golden eyeshadow, and finally pouted her lips with a caramel nude lipgloss.Meanwhile, Lou Pernaut oozed chic in an oversized green co-ord featuring a blazer jacket and matching trousers.",
        "Georgia Steel displayed her sizzling figure in a sheer white dress, and wore a tiny white bikini set underneath.The British TV personality, 25, accessorised with a white shoulder bag and a chain necklace.She wore her ginger locks loose with her fringe down, and showed off her beauty with a light make up palette and rouge lipstick.Georgia Harrison stole the scene as she displayed her jaw-dropping physique in a white bikini set with cherry prints.The TOWIE sensation, 28, showed off her toned abs as she wore a belly chain featuring a cherry pendant, and painted her nails with cherries to perfectly nail the ensemble.The bombshell styled her blonde locks in a half-up do with a chic red ribbon.  The Celebrity Ghost Hunted star donned dainty golden jewellery as was captured posing while pal Nicole O'Brien took some sizzling snaps of her.Love Island star Liberty Poole showed off her ample assets in a baby pink strapless bra with a fabric train in the middle, and a matching midi skirt.The model, 23, wore her long brown tresses loose and donned pink blush and matching lipstick.Eve Gale was also in attendance as she slipped into a racy black cut-out swuimsuit.The TV personality, 23, showed off her curves and donned a bronze palette, pouting her lips with a eye-catching pink lipgloss.",
        "Enisa Bukvic and Elaine Victoria Neunzig were also in attendance.Elaine looked stunning as she donned a pink printed long-sleeves top and a white pleated mini skirt.She slicked her golden locks back in a long braid and did a light make up palette, with baby pink lipstick.Meanwhile Enisa donned denim shorts and a white bikini top, as she wore her long raven locks loose with a centre parting.The Youtuber hid behind black shades as she pouted her lips with a nude lipstick.The duo posed along with other celebrity pals by the pool including Leonie Balys, Nolwen Ibt and Elena Miras.Elsewhere, Spanish model Sofia Suescun opted for a electric blue ensemble with a bikini bra and a matching skirt with fringes.The influencer styled her brown tresses in a towering up-do, and left two locks to frame her features.The fashion show and pop up took place at Ocean Beach in Ibiza, where they announced their first sponsorship of weekly pool parties at the iconic beach club. "
    ]
}