{
    "articleURL": "/wires/reuters/article-12059091/US-Plains-farmers-brace-historically-poor-winter-wheat-harvest.html",
    "content": [
        "By Julie Ingwersen",
        "CHICAGO, May 8 (Reuters) - Production prospects for the U.S. winter wheat crop are the worst in recent memory in core areas of the Great Plains following a three-year drought, farmers and crop experts said.\"I don't know how to put it into words how bad it is,\" said farmer Gary Millershaski in southwest Kansas, among the areas hit hardest by drought. He expects to abandon 85% of his wheat acres and said this year's harvest will be his farm's smallest ever. Some seeds planted last fall barely emerged from parched, cracked soils.A historically poor crop from the No. 5 wheat exporter leaves the world more vulnerable to shortages, with the futureuncertainfor a deal allowing the Black Sea export of Ukraine's grain. U.S. wheat stocks are projected to fall to a nine-year low by June, and a smaller crop could result in higher bread and staple food prices.Rains in the last week arrived too late to significantly benefit stunted wheat in western Kansas, Oklahoma and Texas, prompting some growers to write off part of their crop. More acres could be abandoned before harvest begins in June.High winds compounded problems, sand-blasting dry fields in many areas, including the Texas Panhandle. \"It's really just tragic to see the erosion from wind injury,\" said Jourdan Bell, an agronomist with Texas A&amp;amp;M AgriLife Extension Service in Amarillo.",
        "Kansas and Oklahoma are the biggest producers of hard red winter wheat, the largest U.S. wheat class, which is milled into flour for bread.Weekly wheat condition ratings from the U.S. Department of Agriculture (USDA) are among the worst for this time of year in records dating to 1986, with less than 30% considered good or excellent.Even so, benchmark Chicago Board of Trade wheat futures are down 17% since the start of the calendar year. Last week they touched a two-year low. K.C. hard red winter wheat futures, representing the class of wheat grown in the Plains, are down 6%. The price slump partly reflects ample global wheat supplies for now, following a bumper harvest from top global exporter Russia last year.However, overall global wheat production is expected to be smaller in 2023. Global importers have been working through supplies, leaving less margin for error this year, said Matt Herrington, an analyst with consulting firm World Perspectives Inc. The USDA has projected world wheat stocks to fall to a seven-year low by the end of the 2022/23 marketing year.\"We are essentially at a tipping point where if we do end up with bigger production problems somewhere - say, a massive drought in Australia - we could be at a point where wheat supplies globally start to tighten,\" Herrington said.",
        "Some observers say falling futures prices have masked the gravity of problems with the U.S. crop.\"I just don't think in the last 25 to 30 years, we have seen anything quite like this in the southern Plains,\" said Mike Schulte, executive director of the Oklahoma Wheat Commission. \"The market does not seem to be reflecting the seriousness of it right now,\" Schulte said.The USDA will release its first official U.S. winter wheat production forecasts for 2023 on May 12.A key unknown is how many acres are abandoned, or won't be harvested at all. In Kansas, abandonment topped 25% in the drought years of 1996 and 1989, and neared 50% in 1935 during the \"Dust Bowl\" era.Meanwhile, domestic mills face another year of challenges finding the wheat needed to produce consistent flour. The shortfall in the southern Plains magnifies the need for a strong crop of hard red spring wheat, a high-quality class grown in the northern Plains and Canada that millers can blend with winter wheat.While Canadian farmers are expected to plant the most wheat acres since 2021, the USDA forecasts U.S. spring wheat plantings will drop 2% from last year, and spring wheat planting is already off to a slow start.\"With the short crop, mills in the U.S. are going to pay up for what they need,\" Herrington said. (Reporting by Julie Ingwersen; Editing by Caroline Stauffer and David Gregorio)"
    ]
}