{
    "articleURL": "/sport/football/article-12041767/Lionel-Messi-poses-newly-released-photos-unauthorised-Saudi-Arabia-holiday.html",
    "content": [
        "Lionel Messi has been suspended for two weeks by Paris Saint-GermainThe Argentine went on an unsanctioned trip to the country early this weekThe Saudi Tourism Authority has released new photos of the star on the visit New photos have been released of Lionel Messi and his family from their holiday in Saudi Arabia, with the unauthorised trip having resulted in the star being suspended for two weeks by Paris Saint-Germain.",
        "The World Cup winner had pre-arranged the visit for one of his commercial commitments as ambassador for tourism there.PSG players were supposed to be off on Monday, however, following their 3-1 defeat to Lorient on Sunday, manager Christophe Galtier called the squad in for training instead. Messi, though, was already in transit to Saudi Arabia and unable to turn back. The Saudi Tourism Authority has released new photos of Messi and his family, hours after news that he will be sanctioned by the Ligue 1 leaders.",
        "Messi, his wife Antonella Roccuzzo and their sons Mateo and Ciro were pictured on guided tour of the town of Diriyah, the original home of the Saudi royal family.The family were also taken to the city of At-Turaif, on the outskirts of the capital Riyadh, with photos showing the family at the Arabian Horse Museum.Messi was also seen posing with a white falcon resting on his arm.The Saudi Tourism Authority added that the Messi family had visited the AlUla nature reserve, where he was seen feeding gazelles with Mateo and Ciro.The second day of the trip saw the family visit Riyadh’s entertainment and retail districts.Messi signed a lucrative £25m-a-year deal with Saudi Arabia to promote the kingdom in May last year as a tourism ambassador.",
        "The holiday marked his second trip in the role, having previously visited Jeddah shortly after the deal was agreed.Messi's two-week suspension for the unauthorised trip will see him miss PSG's next two games against Troyes this Sunday, and against Ajaccio on Saturday May 13.",
        "The 35-year-old has been offered a new contract by PSG on the same financial terms, but doubt remains on his side about the sporting project. French newspaper L'Equipe has reported that there are doubt on PSG's side whether their relationship with the Argentine extends beyond the summer.They add that PSG's decision to suspend Messi has caused an 'explosion' which could have a 'planetary impact'.Those around Messi say the trip was previously postponed twice and it was difficult to do so at short notice for a third time.Barcelona want him to return, while there is interest from the Middle East and MLS clubs. However, he has still to open concrete negotiations with any other club. "
    ]
}