{
    "articleURL": "/news/article-12047745/Brazilian-congresswoman-asks-revoke-visa-former-President-Bolsonaro-vaccine-scandal.html",
    "content": [
        "São Paulo Federal Deputy Erika Hilton called on the United States to take away visas that were provided to former Brazil President Jair Bolsonaro and his wife Bolsonaro's home was raided and six people were arrested including his top aide as part of an investigation into forged vaccine documentsDuque de Caxias municipal secretary João de Souza allegedly changed vaccine records despite Bolsonaro confirming he had never received a COVID jabA congresswoman from Brazil is calling on the United States to revoke the visa of former President Jair Bolsonaro and his wife in wake of the COVID-19 vaccine card scandal.",
        "São Paulo Federal Deputy Erika Hilton's request comes a day after six people were taken into custody as part of the Federal Police's investigation into the alleged falsification of vaccine information in the government's health data base.Bolsonaro's Brasilia residence was raided on Wednesday with authorities confiscating his cellphone before arresting his top aide Mauricio Cid.Hilton confirmed her petition on Twitter and claimed the former far-right commander-in-chief and his wife Michelle should have their visas revoked. ",
        "'That's why I sent a letter to the US Embassy to suspend Bolsonaro, Michelle and advisors' visas,' Hilton said. 'In addition to the deaths from their inaction and lies during the pandemic, Bolsonaro and aides may have deliberately spread the coronavirus while pretending to be vaccinated.'Federal Police Investigators learned through a city employee from the Rio de Janeiro municipality of Duque de Caxias that she was forced into providing the password for the city's vaccination data base.City Hall workers were able to input the false vaccine data for the former far-right president, his 12-year-old daughter, Laura Bolsonaro, two advisors and Federal Deputy Gutemberg Reis.Bolsonaro distanced himself from the scandal after his home was searched but confirmed to reporters that he had never been vaccinated.'There was no adulteration on my part, it didn't happen,' he said. 'I didn't take the vaccine, period. I never denied that.' ",
        "However, authorities found that the National Health Data Network showed that he and his daughter had each received two Pfizer shots. ",
        "The former president got his first shot August 13, 2022 and the second one came October 14, 2022.His daughter received the first dose July 24, 2022 and got the second shot August 13, 2022.The bogus shots would have been administered at the Municipal Health Center in Duque de Caxias.The Federal Police said the vaccine data was entered into the system December 21 by Duque de Caxias municipal secretary João de Souza. The vaccine records were removed December 27.Bolsonaro and his daughter flew to the United States on December 30, a day before his presidential term ended. De Souza was among the six people apprehended Wednesday."
    ]
}