{
    "articleURL": "/wires/reuters/article-12050633/Asia-Gold-Price-surge-stifles-demand-major-markets.html",
    "content": [
        "Indian prices hit all-time high of 61,845 rupees per 10 grams",
        "More buying likely at $1,900 level in Singapore - analystGold sold at $4 discount to $1 premium in ChinaIndian demand to stay subdued in June, September quarters- WGCBy Rajendra Jadhav and Kavya GuduruMay 5 (Reuters) - Physical gold dealers in major trading centre China offered discounts this week for the first time in more than a month as elevated prices kept retail buyers away, while a record surge in local rates also hammered demand in India.In China, gold changed hands at anywhere between a discount of $4 and a $1 premium &amp;lt;XAU-CH-PREM&gt; to global prices, which surged to a near-record on Thursday.\"Gold in RMB will continue to climb at healthy pace, physical demand will flinch to plateau and the premium will quietly trade about parity level,\" said Bernard Sin, regional director, Greater China at MKS PAMP. \"Investors are likely to remain in 'buy the dips mode' as uncertainties around U.S. debt ceiling and banking sector grow.\"Indian prices hit an all-time high of 61,845 rupees per 10 grams on Thursday.The record prices prompted some consumers to book profits by liquidating jewellery and coins, said a New-Delhi-based bullion dealer.This prompted dealers to increase discounts &amp;lt;XAU-IN-PREM&gt; to $23 an ounce on official domestic prices - inclusive of 15% import and 3% sales levies - from $12 last week.",
        "\"Prices have moved up too much and too fast. Consumers are confused. They don't know whether to buy at this level or wait for the correction,\" said a Mumbai-based dealer with a bullion bank.The World Gold Council forecast Indian demand to stay subdued in June and September quarters after sliding 17% during the March quarter on record-high prices.Traders said activity could be subdued across key Asian centres near term.In Singapore, premiums of $1-$2 &amp;lt;XAU-SG-PREM&gt; were charged. Some are now booking profits and a price retreat to $1,900 an ounce could spur more buying, said Brian Lan, managing director at dealer GoldSilver Central.Hong Kong &amp;lt;XAU-HK-PREM&gt; dealers charged $0.50-$2 premiums, while in Japan, gold was sold at par with the benchmark. (Reporting by Kavya Guduru and Ashitha Shivaprasad in Bengaluru and Rajendra Jadhav in Mumbai; editing by Arpan Varghese and Jane Merriman)"
    ]
}