{
    "articleURL": "/sport/formulaone/article-12052969/2023-Miami-Grand-Prix-Max-Verstappen-dominates-second-practice-Miami-Gardens.html",
    "content": [
        "Max Verstappen ended Friday in Miami as the best driver in second practice Lando Norris was the most improved from the first practice while last session's fastest driver George Russell saw the biggest setback - finishing P15 DailyMail.com provides all the latest international sports news With much more of the field choosing to work with the medium and hard compound tires for the second free practice in Miami, the defending champion topped the rest of the field.",
        "After just missing out on the top three spots in free practice 1, Max Verstappen took the top spot in the second practice of the day in Miami Gardens.The reigning world driver's champion - and current points leader - took the top spot after doing four laps around the Miami International Autodrome.He set a time of 1:27.930 - over two seconds faster than the previous session's victor George Russell.It's an indication that last year's Miami Grand Prix champion is set for a repeat in 2023 as Red Bull look poised to run away with the title hopes again.",
        "Elsewhere in the field, Ferrari's Carlos Sainz showed improvement from his first practice session, finishing just under three-tenths of a second behind the leader.Sainz's Ferrari teammate Charles Leclerc finished in the same position he did in the first practice after a crash late in the session.Verstappen's teammate, Sergio Perez, showed significant improvement - jumping up seven spots from his first practice result.Rounding out the top five was Aston Martin's Fernando Alonso - who moved up from seventh in the earlier practice.The biggest improvement from the last practice went to Lando Norris of McLaren, finishing just eight tenths of a second behind Verstappen.Lewis Hamilton suffered a setback from his older time on soft tires, finishing P7 and as the last driver to finish less than a second behind Verstappen.",
        "Other significant improvements in this session included Alex Albon, who moved up five spots to P10 and Zhou Guanyu who jumped up four placed to P13.The biggest decline was from last session's winner: Mercedes' George Russell - who went from P1 to P15. Haas driver Nico Hulkenberg also suffered a big setback, falling down to P17 in the afternoon session.Saturday will play host to the third and final practice session before the drivers hit the track for qualifying. Then Sunday will bring the grand prix at 3:30pm local time."
    ]
}