{
    "articleURL": "/wires/reuters/article-12048623/Epstein-accuser-suing-JPMorgan-seeks-disqualify-banks-law-firm.html",
    "content": [
        "By Andrew Goudsward",
        "May 4 (Reuters) - A Jeffrey Epstein accuser suing JPMorgan Chase &amp;amp; Co for allegedly aiding the late financier's sex trafficking of girls and women asked a judge to disqualify the bank´s law firm on Thursday, arguing it has a conflict of interest.Lawyers for the woman, who claims she was a victim of Epstein and is not named in court papers, said the judge should bar law firm Wilmer Cutler Pickering Hale and Dorr from representing JPMorgan because it previously represented an anti-sex trafficking organization that supported a different Epstein accuser.A spokesperson for the firm did not immediately respond to a request for comment.The accuser's attorneys argued that WilmerHale had learned confidential information about the case of Courtney Wild, an alleged victim of Epstein who is also a potential member of the class suing JPMorgan, according to a court filing.WilmerHale represented the anti-trafficking organization ECPAT-USA in a legal brief urging the U.S. Supreme Court to accept Wild's appeal to invalidate a 2007 non-prosecution deal between Epstein and U.S. prosecutors. The court ultimately did not take the case.A lead WilmerHale lawyer on JPMorgan´s defense team, Felicia Ellsworth, signed the Supreme Court brief. Wild´s attorneys also consulted with WilmerHale attorneys on legal strategy, Thursday's filing said.\"WilmerHale is obviously undertaking a representation in which JPMorgan´s interests are materially adverse to ECPAT´s (as well as Ms. Wild´s),\" the filing said.",
        "WilmerHale, a prominent Washington, D.C.-headquartered firm, is one of two firms currently defending JPMorgan in the unnamed accuser´s case and a separate lawsuit brought by the U.S. Virgin Islands, where Epstein allegedly abused women on his private island Little St. James.Earlier on Thursday, the judge in that case allowed the U.S. Virgin Islands to serve legal papers on Google co-founder Larry Page, who has been linked to Epstein. (Reporting by Andrew Goudsward Editing by David Bario and Josie Kao)"
    ]
}