{
    "articleURL": "/wires/reuters/article-12054699/Buffett-says-debt-default-spark-turmoil-confidence-U-S.html",
    "content": [
        "By Jonathan Stempel, Carolina Mandl and John McCrank",
        "OMAHA/NEW YORK, May 6 (Reuters) - Warren Buffett on Saturday criticized the handling of recent tumult in the banking sector and said a debt ceiling showdown could bring \"turmoil\" to the financial system, even as he offered a vote of confidence in the United States and his conglomerate Berkshire Hathaway Inc .Speaking at Berkshire's annual shareholder meeting, Buffett criticized how politicians, regulators and the press have handled the recent failures of Silicon Valley Bank, Signature Bank and First Republic Bank, saying their \"very poor\" messaging has unnecessarily frightened depositors.\"Fear is contagious,\" he said, adding that \"you can't run an economy\" when people worry if their money is safe in banks.Buffett also warned of a growing \"tribalism\" in Washington where partisanship causes people to talk past each other.\"We have to refine, in a certain way, our democracy as we go along. But if I still had a choice, I would want to be born in the United States. It is a better world than we've ever had.\"Buffett spoke hours after Berkshire posted a $35.5 billion quarterly profit and said it bought back $4.4 billion of its own stock, a sign it considered the shares undervalued.In contrast, it sold $13.3 billion of other companies' stocks, in a quarter where the S&amp;amp;P 500 Index rose 7%.",
        "The world's sixth-richest person, Buffett has since 1965 run Berkshire, whose dozens of businesses include Geico car insurance, the BNSF railroad and consumer names such as Dairy Queen and Fruit of the Loom.Berkshire also owns $328 billion of stocks, close to half in Apple Inc.The meeting featured Buffett, 92, who is Berkshire's chairman and chief executive, and Vice Chairman Charlie Munger, 99, answering five hours of shareholder questions. Vice Chairmen Greg Abel, 60, and Ajit Jain, 71, joined in the morning.Buffett reiterated on Saturday that Abel would succeed him as CEO, while adding he had no plan if Abel could not.LIGHTED MATCHBuffett said regulators were right to guarantee depositors of Silicon Valley Bank, saying that not doing so \"would have been catastrophic.\"He also said bank shareholders and executives should bear the risks of mismanagement, with Munger criticizing executives concerned more with getting rich than with customers.\"A lighted match can be turned into a conflagration or can be blown out,\" Buffett said. \"You have to have punishment for people who do the wrong thing.\"Buffett also said he could not imagine politicians or regulators being willing to \"disrupt the world's financial system,\" including if Washington failed to break its impasse on raising the debt ceiling, or how much the government could borrow.",
        "Anticipating questions on banking, Buffett prompted laughter by putting in front of him a sign reading \"AVAILABLE FOR SALE\" and one reading \"HELD-TO-MATURITY\" before Munger.These referred to how lenders account for their securities, a central issue in the recent banking crisis.Buffett said Berkshire is cautious about banks and sold some bank stocks in the past six months.Saturday's meeting is the centerpiece of a weekend Buffett calls \"Woodstock for Capitalists\" that draws tens of thousands of people to Omaha, Nebraska, its hometown.Attendance surged from 2022. Unlike last year the downtown arena hosting the meeting was filled to capacity.BUFFETT: \"APPLE IS A BETTER BUSINESS\"In discussing Berkshire's performance, Buffett said perhaps a majority of its operating businesses may fare worse in 2023 than in 2022 as economic activity slows.But he said Berkshire can offset this with more income from investments, including $7 billion of Treasury bills bought in April.Buffett defended the size of Berkshire's $151 billion Apple investment, saying consumers are less likely to shed their $1,500 iPhones than, for example, their $35,000 second cars.\"Apple is different than the other businesses we own,\" Buffett said. \"It just happens to be a better business.\"Berkshire has recently held a 5.6% stake in Apple, and Buffett said it could buy more.",
        "\"Portfolio management practices would suggested there is definitely concentration risk with having so much Apple in that portfolio,\" said Cathy Seifert, vice-president at CFRA Research.He also said that while Berkshire owns nearly one-fourth of Occidental Petroleum Corp, it has no plans to take control of the company.Munger, a longtime China bull who spearheaded Berkshire's investment in electric car company BYD Co, called for lowered tensions and increased trade between that country and the United States.Buffett cited those tensions in saying he ismore comfortabledeploying capital in Japan than in Taiwan.WAITING ON LINEPrior to the meeting, dozens of uniform-clad pilots at Berkshire-owned NetJets demonstrated outside the arena, protesting low pay and long hours.Thousands of shareholders, meanwhile, lined up outside the arena before it opened at 7 a.m. CDT (1200 GMT). Many recognized it could be one of their last chances to see Buffett and Munger, given their ages.Vidhya Vivekananda, an investment associate from Vancouver, Canada, said she and her husband showed up 30 minutes earlier for their first meeting.\"It has been on our bucket list for a long time,\" she said. \"We don't know how long it will be with Warren and Charlie before they pass it on.\"Yongsheng Zhao, who lives in Shanghai and is a researcher for an asset management firm, said he showed up at midnight with a chair to see Buffett and Munger for the eighth time.",
        "\"I am inspired by their passion and normalcy,\" he said. \"I would hope they can go another five years, or more.\"(Reporting by Jonathan Stempel in Omaha, Nebraska; additional reporting by Carolina Mandl and John McCrank in New York; Editing by Megan Davies, Ira Iosebashvili, Diane Craft, Chizu Nomiyama and Kim Coghill)"
    ]
}