{
    "articleURL": "/wires/reuters/article-12046275/UniCredit-use-300-mln-euro-charges-staff-exits-sources.html",
    "content": [
        "MILAN, May 3 (Reuters) - UniCredit will use restructuring charges to help fund voluntary exits for some of the additional 1,000 employees who asked to leave under an early retirement scheme launched last year, two people close to the matter said.",
        "In reporting stronger-than-expected quarterly results, UniCredit on Wednesday raised its 2023 profit goal above 6.5 billion euros ($7.2 billion) and said the figure included 300 million euros in restructuring charges it would book mostly in the second quarter.It did not provide further details.The bank plans to use the money to cut staff costs by axing jobs in central offices and hiring young people to strengthen its commercial franchise and boost its digital capabilities, the sources said.UniCredit last year invited applications from staff who wanted to retire early and were within five years of qualifying for a pension.On Dec. 1 it signed an accord with unions and booked 239 million euros in charges to fund voluntary exits to be replaced by younger hires.It had envisaged cutting some 800 jobs, a figure which it then raised to 925, but it was unable to meet another 1,000 requests from employees willing to leave, one source said.Eager to protect its branch network, UniCredit allocated 80% of the 2022 early retirement packages to people from its central offices, raising complaints from unions, the source added.UniCredit underwent years of restructuring under CEO Jean Pierre Mustier, but cost cuts remain a key plank of new CEO Andrea Orcel's strategy.Costs stood at 39.2% of income at the end of March, down 7.4 percentage points from a year before. Full-time staff totalled 75,040 at end of 2022, down by 3,531 over the year.",
        "In Italy banks lay off staff through a voluntary scheme funded by individual lenders which allows employees to retire early and receive up to 80-90% of their salary until they qualify for a state pension. ($1 = 0.9054 euros) (Reporting by Valentina Za)"
    ]
}