{
    "articleURL": "/wires/pa/article-12048545/Gunman-shoots-two-relatives-McDonald-s-worker-killing-himself.html",
    "content": [
        "A Georgia man shot two of his relatives and a fast food worker dead before killing himself on Thursday in rural south Georgia, the local coroner has said.",
        "The shooter killed his mother and grandmother at two neighbouring homes and killed a woman at a McDonald’s restaurant in downtown Moultrie, Colquitt County coroner C Verlyn Brock told the Associated Press.He said the gunman then shot himself.Mr Brock did not provide the identities of the shooter or the victims. He said he did not know whether the gunman and the McDonald’s worker knew each other. A killing is pretty rare in our neck of the woods. It’s surprising. But this day and time, our jail’s at capacity, our local prison’s at capacity. There’s a lot of folks breaking the law, unfortunately  Chas Cannon, county official  The Georgia Bureau of Investigation said in a statement only that there had been “multiple fatalities” at different crime scenes in the area.As the state’s leading law enforcement agency, the GBI said the Moultrie Police Department requested its assistance, as is typical in major crimes in Georgia.",
        "“We are working to learn more information and track down some additional witnesses,” GBI special-agent-in-charge Jamy Steinberg wrote in an email.Sabrina Holweger, who works at an adjoining optometrist’s office, said she and a co-worker arrived at work before 8am to find police swarming the McDonald’s and a woman’s body gunned down and lying in a doorway of the restaurant.",
        "“It was really just scary not knowing if they had shot themselves,” Ms Holweger said.She said police blocked off a main street that runs in front of the McDonald’s in the city of 15,000 and told employees in her office that they would be questioned if they crossed the property line into the McDonald’s parking lot.Ms Holweger said the woman who died at the restaurant was the early morning manager, and that the shooter had been an employee there.Ms Holweger said it appeared that the man killed the woman when she unlocked the door to let him in for an early-morning shift.The killings in Moultrie, located in rural Colquitt County about 60 miles north east of Tallahassee, Florida, came a day after a gunman in Atlanta killed one person and wounded four others at a medical office.Chas Cannon, Colquitt County’s government administrator, said he was driving his daughter to school on Thursday morning when he passed the McDonald’s blocked off by police tape and patrol cars.“A killing is pretty rare in our neck of the woods,” Mr Cannon said. “It’s surprising. But this day and time, our jail’s at capacity, our local prison’s at capacity. There’s a lot of folks breaking the law, unfortunately.”McDonald’s did not immediately respond to an email seeking comment on Thursday."
    ]
}