{
    "articleURL": "/news/article-12054475/Katy-Perrys-risks-backlash-Coronation-antics.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Katy Perry was today spotted taking a picture of herself on Westminster Abbey's memorial to Winston Churchill - just hours after being mocked for failing to find her seat - and later tripping in her heels outside.",
        "The 'California Gurls' singer, who will perform at the Coronation Concert at Windsor Castle tomorrow, took a quick snap of her feet while she stood on the stone dedicated to the wartime Prime Minister.Earlier today, Perry was caught by amused fans looking like a lost lamb searching far and wide for her seat.Unable to see thanks to an impressive fascinator, she was seen cocking her head and spinning around in circles in desperate search for her place.The singer, who was dressed head-to-toe in lilac with in an enormous head piece and Vivienne Westwood choker, comically tweeted following the ceremony that her fans were 'not to worry' as she found her seat.In further antics, the singer was spotted taking selfies with guests in the historic abbey and stumbling in her tall white heels as she left the ceremony with fellow guests. ",
        "Alongside British Vogue editor Edward Enninful, the pop star was pictured arriving at the abbey earlier this morning. It was also revealed today that she will stay at Windsor Castle tonight before performing tomorrow alongside music legend Lionel Richie, as well as Take That, Italian opera singer Andrea Bocelli and Welsh bass-baritone Sir Bryn Terfel. The event, which will take place in the grounds of Windsor Castle, will be in front of a crowd of 20,000 members of the public and invited guests and broadcast across BBC television and radio stations.",
        "As a special honour in return for her performance, Katy is being allowed an exclusive stay in the royal residence of the 1,000-year-old castle.Perry said she is 'really excited' for her 'wild' sleepover at the royal residence. 'I'm really excited… I might be posting a lot because I'm gonna be in a castle, for real. This is wild,' she told Extra TV. Asked about her Coronation invite, she said: 'It was very regal. It was like a cursive I have never seen [before]… I loved it.'",
        "The 38-year-old paid homage to Vivienne Westwood in her lilac outfit from the late designer.She showcased her slim frame in a pencil dress teamed with a co-ordinating short-sleeved jacket, boasting a nipped-in waist, and matching opera gloves.She accessorised with an enormous dish-style net fascinator, while wearing a Vivienne Westwood necklace and carrying her belongings in a white top-handle bag from the designer.Perry arrived alongside VIP guests who since 6am were queuing for a mile to get one of the prime 2,300 seats inside. The Abbey was full at just before 9am.Stars seen taking their seats in the church included Katy Perry, Lionel Richie, Sir Andrew Lloyd Webber, Stephen Fry, Nick Cave and magician Dynamo, while Dame Emma Thompson gave a thumbs up in excitement.",
        "TV favourites Ant and Dec, along with Repair Shop star Jay Blades, were also in attendance at the service, which is set to be seen by more than 100million people around the world. They watched Charles be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. It also shone a spotlight on Britain’s place on the world stage in the UK's biggest ceremonial military operation since the state funeral of Sir Winston Churchill in 1965 with 7,000 servicemen and women marching with the King and Queen."
    ]
}