{
    "articleURL": "/wires/aap/article-12056241/Snapshot-round-eight-AFL-season.html",
    "content": [
        "THEY SAID IT: \"Confidence and belief comes from repetition, and we're now producing repetition in these types of games and that should give the boys great confidence and great belief.\" - Port Adelaide coach Ken Hinkley after a fifth consecutive win, four of them by 14 points or less.",
        "PLAYER(S) OF THE ROUND: Brisbane coach Chris Fagan described Josh Dunkley's outing against Carlton as one of the best games he had ever seen. Not only did Dunkley pick up 33 possessions and lay 13 tackles, but he kept reigning Brownlow medallist Patrick Cripps quiet in a brilliant shutdown role. Dunkley's former Western Bulldogs teammate Marcus Bontempelli also had a huge week, leading his side to victory over GWS with 32 disposals, seven tackles and career-high tallies for clearances (14) and contested possessions (25).THE MOMENT: Gold Coast could have snatched a share of the spoils and forced the season's second draw but Darcy Macpherson's set shot from 40 metres never looked on target. It floated to the right of the big sticks with less than 20 seconds left on the clock, leaving Melbourne five points in front. Jack Viney cut off the Suns' final kick forward to seal the Demons' narrow win.TALKING POINT: Will Carlton get it together under Michael Voss? After missing the top-eight in heartbreaking fashion last year, the Blues seemed primed to end their finals drought this season. But Carlton have slumped to three defeats from their last four starts - all against finals contenders. The heat will be on at Ikon Park this week with a tough run of fixtures ahead.",
        "STATS THAT MATTER: North Melbourne were held goalless for the entire first half of a game for the first time in almost 44 years as they suffered a 30-point loss to St Kilda. The Kangaroos managed 0.7 in the opening two terms at Marvel Stadium on Sunday - the same score they posted against Essendon at Windy Hill in round 12, 1979.TRIBUNAL WATCH: Carlton defender Nic Newman capped a dirty night on the exhilarating Charlie Cameron by being offered a one-game ban for striking the Lions' Lachie Neale. Melbourne young gun Jacob van Rooyen's clumsy spoil on Charlie Ballard cost him a two-week suspension, while Geelong's Brad Close and Hawthorn's Tyler Brockman are facing one-match rough conduct bans because of dangerous tackles. Port Adelaide's Junior Rioli faces scrutiny for behind-play contact which concussed Essendon's Jordan Ridley, though Rioli wasn't looking at the Bomber defender when he tried to make a block.INJURIES: J Culley (WC, knee), P Dangerfield (Geel, hamstring), N Murray (Ade, concussion), C Ballard (GC, concussion), A Treloar (WB, hamstring), L Schultz (Frem, shoulder). J Ridley (Ess, concussion), T Jonas (PA, chest)WHAT'S NEXT: Richmond's resurgence will be tested in a Friday night blockbuster against Geelong and North Melbourne host Port Adelaide in Hobart in the first game in Tasmania since the island state was awarded the competition's 19th licence. Saturday night's Brisbane-Essendon and Carlton-Bulldogs encounters look spicy, while the Crows host St Kilda in Adelaide and ladder leaders Collingwood take on GWS."
    ]
}