{
    "articleURL": "/news/article-12049009/BRIAN-VINER-Rocket-fuelled-farewell-Guardians-Galaxy-blast.html",
    "content": [
        "Guardians of the Galaxy Vol3 (12A, 150 mins)",
        "Verdict: Marvellously bonkers  Rating:Peter Pan &amp; Wendy (PG, 106 mins)Verdict: A very PC PanRating:Since 2017 the Marvel Cinematic Universe (MCU) has been cranking out blockbusters at the remarkable rate of three a year, basically with the same aim as its own super-villains: namely, to take over the world, or at least the cinema-going part of it.The latest, following the disappointing Ant-Man And The Wasp: Quantumania into the multiplexes, is the third and, we’re assured, final film in the Guardians Of The Galaxy mini-franchise.James Gunn, who wrote and directed the first two instalments, is back in charge despite having fallen victim to cancel culture for sending ‘offensive’ tweets. He was ignominiously fired, then grudgingly reinstated, and duly makes the most of his resurrection by crafting a movie that is, frankly, nuts.",
        "At the heart of a deeply weird story even by Marvel standards is Rocket, the doughty raccoon voiced by Bradley Cooper. The self-styled master of the universe, a mad scientist reverently known as the High Evolutionary (Chukwudi Iwuji), is convinced that the intricacies of Rocket’s genetic engineering will help him create a master race. His malign interest puts our furry hero in mortal danger, so Quill (Chris Pratt), Quill’s former love Gamora (Zoe Saldana), and the rest of the Guardians must save him.",
        "That’s the essence of it, and of course the film generally adheres to an old fashioned formula that long pre-dates the MCU. Indeed, Sean Connery’s James Bond would be quite at home with the idea of thwarting a crazed megalomaniac.But at least Blofeld loved his white pussy. There is a conspicuous Nazi sub-text to the behaviour of the High Evolutionary, who sees both animals and children only as expendable fodder for his experiments.Gunn goes the whole hog with the animals in this film, from cute talking dogs to mutant pigs and even heart-rending scenes in a jail cell featuring a raccoon, a walrus and an otter.",
        "And when I say heart-rending . . . I saw it on Tuesday evening at a packed Cineworld Leicester Square and honestly clocked quite a few tear-streaked faces when — spoiler alert — the otter got clipped. Imagine a wild sci-fi version of Ring Of Bright Water and you’ve got the picture.Moreover, if cruelty to animals and Nazi ideology weren’t enough, Gunn also makes repeated nods to the Old Testament. The eventual salvation of the animals is the story of Noah’s Ark, more or less, and the director even reproduces Michelangelo’s Creation Of Adam in a moment between Quill and a reformed baddie amusingly played by Will Poulter as a sociopathic mummy’s boy.",
        "Mummy, incidentally, is played by Elizabeth Debicki with just the same plummy vowels she uses as Diana, Princess of Wales, in The Crown. The difference is that here she’s painted gold, which, who knows, might well be Gunn playing homage to Goldfinger (1964). Certainly, the myriad cultural reference points in this movie could sustain an entire PhD, should there be anyone willing to take it that seriously.Needless to add, it’s not meant to be taken remotely seriously, although at times it tries a little too hard to be funny. Come to think of it, the forced humour of all three Guardians films could make another academic thesis.",
        "I saw it with my 24-year-old son, exactly the target audience, but he winced every time the amiable dimwit Drax (Dave Bautista) and the psychic Mantis (Pom Klementieff) provoked screams of laughter with their ‘banter’. Sometimes, seeing a Marvel film surrounded by adoring Marvel fans can be a trying experience.That said, I loved a passage when the Guardians visit ‘Counter-Earth’, presented as a bland, 1950s-style American suburbia populated by humanoids with long ears and ravaged faces who otherwise behave just as their Eisenhower-era counterparts might on encountering a spaceship.There’s a priceless moment when Nebula (Karen Gillan) can’t work out how to get into a battered old car, which reminded me of that great cartoon of Daleks arriving at the foot of a flight of stairs, and realising that their mission to conquer the planet has hit an insurmountable stumbling block.",
        "That moment, by the way, also provokes Marvel’s very first F-word, which, it has to be said, is perfectly timed. So, more broadly, is this movie.It’s a cherishable oxymoron that superheroes have had a distinctly mediocre year so far. This sees them back nearer the top of their game.",
        "Music played a pivotal role in the first two Guardians Of The Galaxy films, and the tradition is just as strong in the third chapter of the cosmic caper. In the earlier movies, displaced earthling Peter Quill listened to 1960s pop and 1970s soul on battered cassettes compiled for him by his mum. This time, the ‘Awesome Mix’ comes from a Microsoft Zune, a long-gone rival to Apple’s iPod, and the selection is broader.Director James Gunn is clearly a music connoisseur, and this 17-song soundtrack again works brilliantly well as a playlist.",
        "Gunn’s choices are eclectic, but the overall feel is energetic. Rainbow’s Since You Been Gone, Faith No More’s We Care A Lot, and the Beastie Boys’ rap classic No Sleep Till Brooklyn are all mixed to sound loud and punchy on screen.There’s a more contemporary edge than before, too, with Florence + The Machine’s Dog Days Are Over and The Flaming Lips’ Do You Realize?? both included. (The latter, taken from the Oklahoma band’s 2002 album Yoshimi Battles The Pink Robots, is perfect for a sci-fi film.)There’s also a welcome reprise for Redbone’s feel-good hit Come And Get Your Love, a long-term Peter Quill pick.Awesome Mix Vol. 3 is out now on CD, double vinyl LP and digitally. A cassette version follows on July 7.ADRIAN THRILLS",
        "Captain Hook? He's just a pirate with a lot of issuesThe Disney project to turn its classic animations into live-action films has yielded both triumphs and disappointments. My hope is that The Little Mermaid, arriving at the end of this month, will be one of the former. Peter Pan &amp; Wendy, streaming now on Disney+ and broadly speaking a live remake of the 1953 feature-length cartoon, nudges closer to the latter.The problem is that American writer-director David Lowery has chosen to give the story a very 2023 makeover, not least by empathetically handing Hook (played by Jude Law) a set of mental health issues. Don’t expect villainy for villainy’s sake.",
        "At times, watching this film is like sitting in on a therapy session as a deeply disturbed pirate confronts his repressed memories. All of which will fly over the heads of its intended young audience as surely as Peter does over the rooftops of Edwardian London.Lowery’s finely tuned modern sensibilities make it almost surprising that Hook does not sport a prosthetic hand and a disability badge. The director was accused of ‘wokeism’ as soon as the news broke that his Lost Boys would include, er, girls. They also include an actor who has Down’s Syndrome (which I’m all for, personally, and it’s worth remembering that Barrie gave the Peter Pan rights to Great Ormond Street Hospital).",
        "But they are such a pointedly multi-ethnic band that one is reminded of the late, great Victoria Wood poking fun at the way Mia Farrow adopted children, like someone choosing letters on Countdown until they had a sufficiently diverse collection.Beyond all this, the story follows a pretty familiar trajectory. As night falls on their affluent London home, Wendy Darling (nicely played by Ever Anderson) and her two younger brothers are visited by Peter (Alexander Molony) and the mute fairy Tinker Bell (Yara Shahidi).",
        "Like Peter, Wendy doesn’t much want to grow up, which in her case is represented by the imminent prospect of boarding school. Peter saves her from it, by whisking her and her siblings off to Neverland, where, of course, it isn’t long before they fall foul of Hook, Mr Smee (Jim Gaffigan) and the rest of the dastardly, dim-witted pirate crew.There are some impressive special effects and a few dashes of wit that I enjoyed. Moreover, Law is jolly good as the tortured Hook. But, ultimately, this film adds nothing worthwhile to the mighty heap of Peter Pan screen adaptations (12 at the latest count). James Barrie’s story is often referred to as ‘timeless’, but I’m not convinced. It was a cracking yarn in 1904 that, surely, no longer needs recycling.A longer review of Peter Pan &amp; Wendy ran in last Saturday’s paper. Also showing... The poet Robert Graves, whose extensive literary credits also included the remarkable I, Claudius, was a troubled soul with what might be termed unconventional domestic arrangements. In the late 1920s, he and his wife, the painter Nancy Nicholson, entered a menage-a-trois with the American writer Laura Riding, which then became a ‘menage-a-quatre’ with the Irish poet Geoffrey Phibbs.",
        "The Laureate (15, 104 mins, **) tells this story, which sounds anything but dreary, and yet in writer-director William Nunez’s over-earnest drama somehow manages to be just that.Tom Hughes plays Graves as a moody narcissist, assailed both by shellshock and writer’s block. It’s easier to empathise with Laura Haddock’s long-suffering Nancy, while as the vampish Riding, who seduced both husband and wife, Dianna Agron is plain annoying.The dialogue suffers from too much exposition, with Nancy reminding her man just how many brilliant volumes of poetry he’s written, and no literary party unfolding without TS Eliot chatting to Siegfried Sassoon in a corner while someone else tells Graves that they’ve just received a cable from ‘your friend’ TE Lawrence.Still, if nothing else The Laureate made me want to know more about Graves, so it wasn’t entirely a waste of time."
    ]
}