{
    "articleURL": "/tvshowbiz/article-12051143/Emily-Atack-celebrates-close-pal-Laura-Whitmores-38th-birthday-London.html",
    "content": [
        "Emily Atack cut a stylish figure as she celebrated pal Laura Whitmore's 38th birthday on Thursday evening at a Chinese restaurant in London.",
        "The actress, 33, looked incredible in a blue patterned top which she tucked into a pair of crisp white wide legged trousers. She draped a pale green blazer over her shoulders and elevated her frame in a pair of towering white heels. The TV personality toted her belongings around in a cream bag and styled her long blonde tresses loose. Emily stepped out with the birthday girl Laura who was all smiles in a stylish green corduroy jumpsuit after enjoying food and karaoke during the night.   ",
        "The figure hugging short sleeved one piece boasted a plunging zip front neckline and cropped trousers. The former Love Island host rocked a pair of crisp white designer trainers and accessorized by layering several gold necklaces. The blonde beauty carried her belongings in a black crossbody bag and draped a leather jacket over her arm. Laura left her long blonde locks loose as they cascaded past her shoulders and applied a glamorous palette of makeup including a swipe of bold red lipstick. Celebrity Juice host Keith Lemon gave the camera a thumbs up as he exited the restaurant Lan Kwai Fong following the celebrations. The presenter seemed in high spirits in a navy jacket and matching trousers which he donned over a colourful T-shirt.Keith carried his belongings in a colourful rucksack and opted for a pair of comfy white trainers while accessorising with a smart black hat. ",
        "Also in attendance was Great British Bake Off Star Candice Brown who put on a loved-up display with boyfriend Nicky Mercer. ",
        "The baker, who split from husband Liam Macauley back in 2020, after less than two years of marriage, put on a leggy display in a pair of green shorts. She tucked a white scoop neck vest into the shorts and rocked a pair of beige sandals. Candice was all smiles as she held hands with her beau who looked dapper in a leather jacket and jeans. It comes after Emily was shocked to discover her link to actor turned football club owner Ryan Reynolds earlier this week.During an upcoming appearance on BBC ancestry show Who Do You Think You Are? the comedian finds out that her great-grandfather was the first to put Wrexham on the map.Ryan, 46, and fellow Hollywood star Rob McElhenney purchased the then non-league Welsh football team Wrexham back in 2020 - gaining a promotion into League Two this week.According to The Sun, Emily finds out how her ancestor Edward Robbins became famed for his involvement in Welsh football.Edward, known as Ted, was the longest serving secretary of the Football Association of Wales, he clashed with the English Football League over their reluctance to free up their players for international duty.",
        "Through his campaigning, the rule was eventually scraped, meaning Welsh-born players, who were playing for English clubs, could still represent their country.A source told the publication: 'Emily could not believe the link to Wrexham, particularly as the name is now so associated with Hollywood stars Ryan Reynolds and Rob McElhenney, who co-own the club.'She is in no way sporty either, so to hear her family had this pedigree came as a big surprise.'It comes as Wrexham's promotion winners have begun in Las Vegas for their 'monster' party holiday three days after celebrating the club's move up to League Two with an open-top bus parade through the city.The National League champions have been gifted an all-expenses-paid four-day trip to celebrate their record-breaking 111-point season by their co-chairmen Ryan and Rob."
    ]
}