{
    "articleURL": "/tvshowbiz/article-12045275/Watch-Happens-Live-Kristen-Doute-reveals-Ariana-Madix-learned-affair.html",
    "content": [
        "The 40-year-old former star of Vanderpump Rules while visiting the Bravo talk show was asked by host Andy Cohen, 54, if she felt vindicated I was there the night when the phone fell out of the pocket. I was sitting next to Ariana,' Kristen revealed 'It's the same thing he said about me,' Kristen said of her ex-boyfriend Sandoval. 'Be a man and if you want to break up, break up'Kristen Doute revealed that she was with good friend Ariana Madix when she discovered the 'Scandoval' affair during an appearance Wednesday on WWHL.",
        "The 40-year-old former star of Vanderpump Rules while visiting the Bravo talk show was asked by host Andy Cohen, 54, if she felt vindicated after previously splitting with Tom amid rumors of his infidelity with Ariana.'No, I don't,' Kristen said. 'It's really sad. Tom and I were together for almost six years. We should have broken up after year two. He and Ariana have been together almost a decade. They own a home together. I was there the night when the phone fell out of the pocket. I was sitting next to Ariana.''Did you find out that night?' Andy asked.'Ariana disappeared and her phone and purse were sitting on the chair next to me, a lot of fans were around,' Kristen said of the scene at Sandoval's show. 'I grabbed them. Couldn't find her for 20 minutes. I wanted to leave. Gave it to a friend of hers and then didn't talk to her till Friday morning.'",
        "Kristen said she started to get numerous texts the next morning, but told everyone she had been with Ariana and Sandoval the previous night. She told people 'no way' until she spoke to Ariana the next day.Watch What Happens Live aired after the latest episode of Vanderpump Rules and Kristen said watching events unfold was 'crazy' and gave her a pit in her stomach.",
        "Kristen dated Sandoval until he started seeing Ariana and she went through an eerily similar situation when she was on the show. Tom also initially denied the allegations at the time that he hooked up with Ariana while he was dating Kristen.'It seemed like the wheels were starting to fall off the bus tonight on Vanderpump Rules,' Andy said. 'The walls are closing in on Sandoval a little bit.''It was crazy to watch,' said Kristen, wearing a red plunging suit. 'A pit in my stomach.'Andy asked her what percentage of her was shocked that Sandoval had cheated and that it was with Raquel Leviss.'Cheated in general, I thought that years ago, but with Raquel I was completely shocked,' Kristen said.",
        "Andy asked her what she thought of some fans saying Ariana had it coming because she began a relationship with Sandoval when they were still dating.'It is not the same thing,' Kristen said. 'She didn't deserve it.'Andy said he got a lot of tweets like this 'you slept with your best friend's boyfriend and then lied about it to her face for a period of time. Why do you get to judge Raquel so much when you did the same thing that she did?''It was 12, 13 years ago, everyone just get on move past it and I also apologized,' Kristen said. 'As you know, I sat in the mud for almost two years begging for apologies waiting for my actions to speak louder than my words.'",
        "Andy asked her if the speculation about Raquel and Sandoval had made its way to her.'Yes,' Kristen said. 'Honestly what I thought was that [Tom] Schwartz and the girl Jo were hanging out and the only friends they had were Tom [Sandoval] and Raquel. So the four of them were constantly hanging out, but it did start to make me feel a little weird. This looks like a double date.'Kristen said she thought Schwartz should have done more to push Sandoval to come clean. Kristen also shared she had been close to Ariana now for seven years.Kristen said she thought Sandoval and Raquel were just 'deeply infatuated' and that Sandoval 'brought her home for Christmas.'",
        "Andy asked her if she had met Ariana's new love interest, but she said she hadn't.'But I've heard wonderful things,' Kristen said.Andy asked her reaction to Sandoval's claim that he tried to end things with Ariana but that she was in denial.'It's the same thing he said about me,' Kristen said. 'Be a man and if you want to break up, break up.'Andy asked since she famously uncovered 'Miami girl' if she had heard of other instances of Sandoval cheating on Ariana.'Since the Raquel news broke, I have heard multiple things that are now coming out of the woodwork,' Kristen said. 'Specifically, when he and Schwartz were doing appearances together a friend of a friend hooked up with him.'",
        "Andy asked Kristen what it was like for her to return to filming.'I asked Ariana if she really, really wanted me to do it and she said so I did,' Kristen said of returning for the upcoming season 10 reunion.Kristen said she also didn't think James Kennedy and Ally Lewber would last because she was 'too smart' and stood up for herself.Two fans asked Kristen what she thought about Sandoval using the lack of intimacy with Ariana as an excuse for him cheating especially when he used the same excuse on her.'It's just an excuse,' Kristen said. 'It's what he does. He reaches for anything. He's been gaslighting Ariana the whole time. Why can't you just say ''I'm sorry;' …just say I'm sorry I'm a trash human being and when you're better show it.'",
        "Kristen said she never sees James and believed that he was just 'faking it' when he said he wasn't partying.'B.S.' Kristen said.Kristen said she was also happy to be back in the fray. Andy asked what was her reaction to Sandoval back pedaling on the show when confronted by Ariana.'For once I don't have words,' Kristen said."
    ]
}