{
    "articleURL": "/wires/aap/article-12045537/Drug-trial-slows-Alzheimers-progression-35-cent.html",
    "content": [
        "A new drug given to Alzheimer's patients slowed the disease's progress by 35 per cent, the latest trial has revealed.",
        "Patients with early stages of Alzheimer's who were given the drug donanemab showed significantly slowed cognitive and functional decline over an 18-month phase three trial, according to results published by pharmacutical company Eli Lilly on Thursday.The trial looked at how the drug impacted cognition and ability to partake in daily living activities such as managing finances, driving, engaging in hobbies, and conversing about current events, also known as the Alzheimer's Disease Rating Scale.It found people with early stages of the disease had a 35 per cent slowing of decline on the scale over 18 months.Participants on donanemab also had 40 per cent less decline in ability to perform activities of daily living at 18 months and experienced a 39 per cent lower risk of progressing to the next stage of disease compared to those on a placebo.Alzheimer's, a debilitating and progressive neurodegenerative disease, affects up to one in 10 Australians over 65 years of age and three in 10 Australians over 85 years.It is the second leading cause of death in Australia, according to the Australian Alzheimer's Research Foundation.Senior lecturer in pharmacology at the University of Adelaide Ian Musgrave said the results were greatly encouraging and showed clinically significant reductions in disease progression.\"Despite near total removal of amyloid plaque, the disease still did progress, although at a much slower rate than without treatment,\" Dr Musgrave said.",
        "Professor Bruce James Brew AM consultant physician and neurologist at the University of NSW said the drug could allow patients more quality time with loved ones and hoped it would be available in the not too distant future.However, adverse effects noted in some trial patients concerned Professor Lyndsey Collins-Praino, head of the Cognition, Ageing and Neurodegenerative Disease Laboratory in the School of Biomedicine at the University of Adelaide.Prof Collins-Praino said while she was cautiously optimistic, key questions remained.\"Despite early promise, full evaluation will not be possible until a comprehensive profile of results, particularly safety data, is released for peer review,\" she said.Based on the results, Eli Lilly said it will apply for global regulatory submissions and anticipates making a submission to the US Food and Drug Administration this quarter.\"Donanemab, if approved, may represent a significant step forward for people with early symptomatic Alzheimer's disease, and allow them to continue to participate in activities that are meaningful to them,\" executive vice president Anne White said."
    ]
}