{
    "articleURL": "/femail/article-12057203/Beat-heat-breezy-26-tank-dress-cool-classy-summer-long.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, DailyMail.com will earn an affiliate commission. Click here for more information.",
        "Nothing beats a casual summer dress that you can wear all season long. Make it the Camisunny tank dress and you can be confident you’ll always have something cool, classy, and comfortable to wear — even when it’s steamy outside.Available in a multitude of colors and patterns, this effortless dress is currently reduced to just $25.99, a savings of 28% off the original price. Snap up one, two, or more and get set to make it an integral part of your warm-weather wardrobe.  Camisunny Tank Dress  Stay cool and comfortable in this breezy tank dress that's so effortless, you can just throw it on and go.Available in a multitude of colors and patterns that range from subtle and neutral to bright and adventurous, this dress is an easy pick for almost any occasion.Great for date nights, boardwalk strolls, Sunday brunches, lakeside adventures, family outings, special occasions, and more, this dress can be dressed up or down with a few accessories.You can even wear it as a swim coverup, whether you're hanging out by the pool or lounging on the sand. It features a touch of spandex, which lends it its signature stretch that takes its comfort factor to the next level. And it's available in sizes S to XXL, so it's designed to fit and flatter a wide range of body types.  $25.99 (save 28%)  Shop",
        "This lightweight dress features a hint of spandex, which lends it just enough stretch to enhance its comfort. You’ll love the pull-on style, too — it makes getting dressed quick on days when you just want to head out and enjoy the sunshine.Throw on a solid-colored dress with your favorite sandals, slides, or wedges, add a few accessories, and you’re ready to go. Or let your pattern do the work instead. The Camisunny tank dress is available in everything from brilliant florals to vivid paisleys.",
        "With thousands of five-star ratings, the dress is easily one of the most popular available on Amazon. People love everything from its soft feel to its flattering silhouette to the extended size selection, with options ranging from S to XXL.‘This dress is as cute in as the models show,’ shares one buyer. ‘It is very comfortable and breathable. I live in Florida so need something that isn’t suffocating fabric. And I get so many compliments!’",
        "Another raves, ‘This dress is really cute on. I was surprised how flattering it is. I got to wear it on vacation and have worn it a lot more than just the resort.’‘So happy, what a great dress! Nice length, lightweight but not sheer, very flattering, neck line is perfect, does not dip to low. I'm going to order several more in different patterns for my vacation!’ exclaimed another.",
        "Between the positive praise, the flattering style, and the selection of 28 different colors and prints, the Camisunny tank dress is poised to be the dress you turn to whenever you need something that’s laid-back, yet still just pulled together enough."
    ]
}