{
    "articleURL": "/wires/reuters/article-12051865/Slovak-foreign-minister-quits-fresh-blow-ailing-cabinet.html",
    "content": [
        "May 5 (Reuters) - Slovakia's foreign minister offered his resignation on Friday, the president said, dealing a fresh blow to the centre-right cabinet which has already been serving in a caretaker capacity ahead of elections in September.",
        "Rastislav Kacer's departure follows a string of other ministerial resignations and piles pressure on Prime Minister Eduard Heger, who had been facing mounting opposition calls to quit and make way for a technocrat government.The wrangling has all but paralysed politics in the NATO and EU member which has been a strong backer of its neighbour Ukraine since Russia's invasion.\"Foreign Minister Kacer has ... informally delivered an expression of will to be relieved of his duties,\" President Zuzana Caputova said in a live TV address from London, where she will attend Saturday's coronation of Britain's King Charles.Caputova, whose role gives her the power to appoint a new prime minister, said she would discuss the situation with Heger and parliament speaker Boris Kollar on her return.Kacer, who is travelling in Italy, was not immediately available to comment on his reasons.The ruling coalition has been struggling since it lost its majority in September last year when the libertarian SaS party quit.SaS joined a leftist opposition party in voting through a no-confidence motion in December, accusing the government of not helping people cope with the higher energy costs.Parliament voted to hold early elections in September this year. Several minister have left, citing a variety of reasons, most recently the farm minister this week following a scandal over a subsidy for a firm he owns. He denied any wrongdoing.",
        "Heger has had to take on the responsibility for each department after each resignation, as the posts can not be filled while the government is serving in a caretaker capacity.The prime minister said he would not comment until he meets the president. (Reporting by Jan Lopatka and Robert Muller in Prague; Editing by Andrew Heavens)"
    ]
}