{
    "articleURL": "/femail/beauty/article-12058477/Pia-Cuerquis-Woman-finds-perfect-headband-makes-hair-look-like-sunglasses-on.html",
    "content": [
        "Pia Cuerquis found the perfect headband that gives her an effortless lookThe product has the effect of using sunglasses to push hair out of your face A young woman has gone viral after discovering the 'perfect headband'. ",
        "Pia Cuerquis, a podcast host and brand-owner, said she looked for months to find a headband which replicated the 'chicness' of having a pair of sunglasses on pushed through the hair.'I've been looking for something like this all my life,' she said in a video.Women are sick of the tight prongs that are attached to normal headbands because they give off a 'juvenile' look and frequently cause headaches.Many often use their sunglasses or reading glasses to pull their hair back in a relaxed manner, but find it difficult when they're indoors or need to use the frames.",
        "'Guys, this might be my greatest purchase to this day,' Pia said in a video.The headbands are from Zazzy Bandz and retail from $25AUD.Pia explained that she loved pulling her hair back with her sunglasses because of the way it looks - and has spent years trying to find a headband that achieved the same effect.'I am their target audience, I am who they made this for, I got them in multiple colours,' Pia said.The product gives Pia the effortless look of slightly pushed back hair and keeps her locks out of her face. 'Please tell me I'm not alone with how amazing this is.' Millions were similarly obsessed with the headbands, and expressed their relief at someone finally inventing the 'perfect' hair piece.",
        "'I thought I was the only one who wears sunglasses just to put them on top of my head!!' a woman exclaimed. 'They're just for styling - I don't even like them on my eyes.'",
        "Another said, 'This is so niche and I love you for it because I know exactly what you mean, I only use my sunglasses to keep my hair up.''Finally!' wrote a third. 'I hate normal headbands because they're too tight and give me a headache, but this seems to have such a relaxed fit.' 'I've never been influenced faster. I hate when the sunglasses start yanking my hair but the look is elite,' said another woman.But some were already seasoned shoppers.'The bands are great for those with curly hair because it doesn't dent it! It keeps the hair out of my face - wear it all the time around the house,' a woman said.Another echoed: 'I love these - I used to buy sunglasses for the sole purpose of holding my hair up, but now I just use my headband.'"
    ]
}