{
    "articleURL": "/news/article-12054041/Royal-fans-celebrate-performance-Alleluia-Ascension-gospel-choir.html",
    "content": [
        "Royal fans have applauded the Gospel choir who performed at the Coronation Follow MailOnline's Coronation Live Blog for all the latest updates Royal fans have gone wild for the Gospel choir that performed at King Charles' coronation ceremony this afternoon - with some saying it was 'the best part'.",
        "During the historic service a second Alleluia, written by Debbie Wiseman, was performed by the Ascension choir.Those members of the singing group had been handpicked for the historic occasion. People watching the Coronation at home have applauded the group of singers praising their talents, saying the performance was both 'unexpected and awesome'.One person wrote on Twitter: 'The gospel choir was glorious.'",
        "Another added: 'The Gospel choir was the best part of the Coronation.'A third said: 'Was it just me who really wanted to applaud the Gospel choir?'TV presenter Dan Walker applauded the singers, writing that the Gospel Choir was 'amazing'.Labour MP Jess Phillips also paid tribute to the group, adding: 'Cried at the gospel choir, felt a bit overwhelmed. Funny old thing patriotism, grabs you in a weird way.'Others were quick to point out that a gospel choir had also performed at another royal occasion - at Prince Harry and Meghan Markle, the Duke and Duchess of Sussex, wedding.The group at their 2018 nuptials famously performed a rendition of Ben E King's Stand By Me. ",
        "One said: 'The Ascension Choir is a handpicked gospel choir especially brought together for the Coronation.'Gospel music also featured, of course, in the wedding of Prince Harry and Meghan.'",
        "Another said: 'A Gospel choir at the Coronation for the first time. I think it's the influence of Harry &amp; Meghan's wedding. Almost forgot what I was watching.' As well as the Gospel choir, another choir joined by opera and concert singer Sir Bryn Terfel, performed the Kyrie - which was sung in Welsh for the first time.While King Charles took the oath the opera singer sang an anthem by 17th century composer William Byrd.The choir then sang a different version of Alleluia, also by Wiseman, when St Augustine's Gospel Book, dating back to the sixth century, was carried to the nave.This afternoon Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head. The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign. "
    ]
}