{
    "articleURL": "/wires/pa/article-12043083/Critics-hit-police-plan-use-facial-recognition-coronation-crowds.html",
    "content": [
        "Human rights campaigners have heavily criticised potential police use of facial recognition on crowds attending the coronation.",
        "The Metropolitan Police is considering using the technology over the weekend, with a watch list of people that officers believe pose a risk to public safety.This could include wanted criminals or offenders under strict licence conditions, the force said.",
        "But human rights campaigners have hit out at the use of the technology.Emmanuelle Andrews, policy and campaigns manager at Liberty, said: “Facial recognition is a dystopian tool that violates our rights and threatens our liberty.“We all have the right to go about our lives without being surveilled and monitored – but this weekend, anyone in the vicinity of the King’s coronation is at risk of having their face scanned by this oppressive technology.“In 2020, we won a ground-breaking case against facial recognition – with a judge ruling that this tool breaches our privacy rights, data protection laws and equality laws.“This use of facial recognition will have a huge impact on all of our right to protest.“We have already seen a huge crackdown on protest ahead of the coronation, with new measures brought in this week to further restrict the ways in which people can make their voices heard.“Now it’s likely that facial recognition will be used to monitor anyone who wants to exercise their right to protest – an extremely worrying development. Facial recognition is a threat to our freedom – it needs to be banned.”",
        "Last month, research showed there were minimal discrepancies for race and sex when the technology was used at certain settings. It was also found to correctly identify between identical twins.But it was less accurate at other settings for black people, and also those under the age of 20.Previous false positive identifications when the Met has deployed the technology have included a 14-year-old black schoolboy in uniform, and a French exchange student who had only been in the country for a few days.Big Brother Watch’s legal and policy officer Madeleine Stone said: “This Orwellian technology may be used in China and Russia but has no place on the streets of Britain, least not during the coronation.“The hundreds of thousands of innocent people attending this historic event must not be treated like suspects in a line-up and subjected to biometric police identity checks. This dystopian technology should not be anywhere near the coronation. The Home Secretary should urgently ban police use of live facial recognition  Madeleine Stone, Big Brother Watch  “The use of live facial recognition would have a serious chilling effect on the right to free speech on a day when thousands will be considering celebrating or protesting.”There is a dispute between police and campaigners over how many people are incorrectly identified using the technology.",
        "Ms Stone added: “If this dangerously inaccurate technology is deployed at the coronation it is unlikely to have any policing benefits but would have a serious cost to police resources and the public’s privacy rights, meaning many people will be wrongly flagged as criminals and forced to prove their innocence.“Live facial recognition is not referenced in a single UK law, has never been debated in Parliament, and is one of the most privacy-intrusive technologies ever used in British policing. The watch list will be focused on those whose attendance on Coronation Day would raise public protection concerns  Met Police  “This dystopian technology should not be anywhere near the coronation. The Home Secretary should urgently ban police use of live facial recognition.”Deputy Assistant Commissioner Ade Adelekan told journalists on Wednesday that the Metropolitan Police was considering using facial recognition during the coronation.In a further statement, the force said: “We intend to use facial recognition technology in central London.“The watch list will be focused on those whose attendance on Coronation Day would raise public protection concerns, including those wanted for offences or have an outstanding warrant for arrest issued by the courts, or those under relevant offender management programmes in order to keep the public safe.”"
    ]
}