{
    "articleURL": "/wires/aap/article-12045971/NRL-not-trying-silence-Phil-Gould-CEO-Andrew-Abdo.html",
    "content": [
        "CEO Andrew Abdo insists the NRL is not trying to silence Phil Gould after warning Canterbury their general manager of football must not comment on matters facing decisions in his role as a media pundit.",
        "Gould has long been known for his pointed analysis of the NRL on Channel Nine's 100% Footy and as a commentator during games.But a perceived conflict of interest emerges when the former coach uses his media position to weigh into refereeing calls, judiciary matters and rule disputes that involve the Bulldogs.On 100% Footy in March, Gould lashed the NRL for forcing the Bulldogs to include $200,000 of Josh Jackson's salary in their cap for this year after the former captain retired in late 2022 with a season to run on his contract.On the same program, Gould labelled the NRL's introduction of the bunker independent doctor \"the greatest abomination\" in the history of rugby league.He also criticised match officials for sin-binning Bulldogs second-rower Jacob Preston for what he claimed was not a hip-drop tackle in the Good Friday clash with South Sydney.Gould received media scrutiny this week for questioning Newcastle's decision to sign off on an overseas holiday for players during their bye this week, which comes after three consecutive losses.But Abdo said the NRL was less concerned with Gould's penchant for strong opinions and more with accredited personnel following the rules.\"My conversation with the Bulldogs was just around registered club officials not breaching the rules,\" Abdo said.",
        "\"If there's a matter that's live, for example either a matter that relates to the match review or the judiciary or an integrity matter, the rules don't permit players or officials accredited under those rules to talk openly about it. That's what the conversation was about.\"Abdo insisted the NRL had no intentions of muzzling Gould.\"This is definitely not about silencing anyone in the media, he said.\"It's important everyone have their opinions.\"You guys (the media) do a great job for us, telling the stories to the fans. This is not about not wanting criticism, this is just about the rules that the NRL has for everyone accredited in the game.\"There's a reason why club officials aren't able to comment when a matter is live because we don't want the perception of that influencing the decision-makers.\"All eight NRL games this weekend will be played at Suncorp Stadium as part of Magic Round and Abdo was confident the venue could handle the extra workload, despite criticism of its turf earlier in the season.Suncorp Stadium general manager Alan Graham confirmed on Wednesday that an independent consultant had given the turf a green light, with good weather expected to help the surface remain respectable.\"We'll all be relieved on Sunday after the last game,\" Abdo said.",
        "\"But from all reports, we're confident that the turf will be in great shape and will offer a great surface for fast and exciting football.\""
    ]
}