{
    "articleURL": "/health/article-12059525/Fentanyl-deaths-children-teens-spiked-40-FOLD-2013.html",
    "content": [
        "Youngster deaths from fentanyl surged from nine to 1,550 over two decadesScientists warned children may be ingesting the drug in illicit medicationsREAD MORE: New report shows fentanyl kills an American every eight minutesFentanyl deaths among children and teenagers have surged 40-fold over the last two decades, shocking figures show.",
        "Analysis of official overdose data show there were just nine fatalities from fentanyl among those aged 20 years and under in 1999. But by 2021, this had jumped to 1,550. The rise has pushed the mortality rate from 0.05 fentanyl deaths per 100,000 youngsters to 1.92 — or a 3,740 percent increase.Dr Julie Gaither, a pediatrician at Yale School of Medicine who carried out the analysis, called for parents to hide drugs or drug residue that could be laced with fentanyl. This includes storing drugs in cabinets out of reach of children and cleaning surfaces that drugs were used on such as mirrors or counters. She also said that more homes should stock up on naloxone, an over-the-counter drug that can reverse a fatal fentanyl overdose.",
        "Fentanyl is up to 50 times stronger than heroin and extremely lethal — with just two milligrams able to kill an adult.Many black market drug suppliers are mixing it with other drugs such as heroin, cocaine and methamphetamines, leaving users unaware they are taking it.In recent years, there have been several fatalities reported involving children who ingested the drug after touching contaminated surfaces.Last month, it was revealed that 19-month-old Enora Lavenir died after ingesting fentanyl while staying at an Airbnb property in Florida.",
        "An American now dies from fentanyl every eight mintues, a new Government report shows. ",
        "Her parents have sued the company for advertising the property as 'peaceful', arguing it was being regularly used as a party house.Dr Gaither warned in the journal JAMA Pediatrics: 'Findings from this study suggest that the pediatric opioid crisis is changing in ways that will make it harder to combat.'Commonsense solutions (e.g. safe storage and disposal) are still needed to prevent pediatric exposures to opioids.'But a greater emphasis on harm reduction strategies is necessary, including parental and adolescent treatment for opioid use disorder and improving access to naloxone in homes, which is where most pediatric deaths from fentanyl occur.'For her research, she searched the CDC database for opioid deaths in individuals aged 20 and under between 1999 and 2021.Deaths were converted into rates per 100,000 to account for population growth.In total, there were 13,862 opioid deaths in youngsters of which 5,194 (37 percent) involved fentanyl.The majority of the fatalities (89.6 percent) were among adolescents aged 15 to 19 years and children aged 0 to 4 years (6.6 percent).",
        "Some 87.5 percent of the fatalities were unintentional, while 43.8 percent had occurred while the child was at home.During the two decades covered by the research, America's opioid epidemic has shifted to a fentanyl crisis.",
        "The opioid crisis began in the 1990s when pharmaceutical companies began aggressively marketing opioid painkillers as a safe and effective way to treat chronic pain.The companies convinced doctors that the risk of addiction was low, prompting them to write prescriptions for millions of Americans.Many patients then eventually turned to the black market to keep taking the drugs after becoming addicted, with many turning to heroin as a cheaper and more accessible alternative.The fentanyl crisis began in the early 2010s when the powerful tranquilizer was mixed into other synthetic opioids in the US to boost their potency.But this also made the drugs much more dangerous, as even small amounts can be lethal, raising the risk of death from taking the drugs.The data revealed that fatalities from fentanyl and all opioid drugs among youngsters remained reasonably steady until 2013, around the time that fentanyl started to appear in the US drug supply.But they have since jumped more than 30-fold, with the rise blamed on the increasing use of the drug in the black market trade.In 1999, there were 175 deaths from opioid drugs — including fentanyl — in children and adolescents. But by 2021 this had jumped to 1,657.The proportion linked to fentanyl rose from five percent to 94 percent over the period.",
        "In terms of mortality rates, those for children under four years old rose six-fold between 2018 and 2021 — from 0.1 to 0.69 fentanyl deaths per 100,000 fatalities.In 2021, fentanyl was responsible for the deaths of 40 infants and 93 children aged one to four years old. For adolescents aged 15 to 19 years old, the rate jumped three-fold from 1.67 to 6.51 over the same period."
    ]
}