{
    "articleURL": "/wires/pa/article-12038359/England-suffer-World-Cup-blow-Fran-Kirby-ruled-tournament.html",
    "content": [
        "Chelsea and England forward Fran Kirby says she is “absolutely gutted” to miss the World Cup after learning she requires surgery on a knee injury that will keep her out of action for a “significant period”.",
        "Kirby, 29, who was unavailable for Sarina Wiegman’s most recent England squad in April, will also miss Chelsea’s challenge for a fourth consecutive Women’s Super League title and this month’s FA Cup final against Manchester United.The news comes as another blow to the Lionesses and their head coach Wiegman, less than two weeks after captain Leah Williamson was ruled out of the World Cup after rupturing her ACL, while a timely recovery for Euro 2022 player of the tournament and Golden Boot winner Beth Mead from the same injury looks unlikely.In a tweet posted following an official statement from her club, Kirby revealed efforts to rehabilitate the injury, sustained in Chelsea’s Continental League Cup semi-final win over West Ham in February, had failed to restore her fitness.She wrote: “Unfortunately after a few months of rehab the decision has made that I will require surgery on my knee. I have been trying my best to not have to undergo this but unfortunately my progress has been limited due to the issue in my knee.“I’m absolutely gutted to announce my season is over and I will not be able to make the World Cup in the summer.“I’m going to be doing everything possible to be ready for the start of next season and want to wish my team-mates at Chelsea the best of luck for the rest of the season and my Lioness team-mates the best of luck for the summer.”",
        "Kirby’s statement followed one posted to the official Chelsea website, which read:  “Following an injury sustained during our Continental League Cup semi-final against West Ham, Fran has been reviewed at Cobham by the Chelsea medical team.“Following that review and further discussion with a specialist, Fran is set to undergo surgery and is expected to be sidelined for a significant period.“Fran will begin a rehabilitation programme with support from the club’s medical team. Everyone at Chelsea sends their best wishes to Fran in her recovery.”Kirby netted twice for England during last summer’s Euro 2022 triumph, against Northern Ireland in the group stage and Sweden in the semi-finals and has scored seven times for Chelsea in 13 appearances across all competitions this season.Her absence means Wiegman will have to cope without another established player at the tournament in Australia and New Zealand.Kirby, a key member of England’s attack, has won 65 caps and scored 17 goals for her country.",
        "Williamson was ruled out of the tournament after getting injured in Arsenal’s WSL defeat to Manchester United last month, while her club-mate Mead has not played since November and Wiegman said in March it would take a “miracle” for her to be fit in time.There are also concerns over Williamson’s fellow defender Millie Bright, who has not played since the first leg of Chelsea’s Champions League quarter-final against Lyon in March due to a knee problem.",
        "Wiegman revealed her sympathy for Kirby.She said on the England Football website: “It is horrible for her and disappointing for the team. But, on the other hand, it gives other players the opportunity to show their quality.“That is the tough thing and the ruthlessness thing about top sport, where we have to move on and not focus on who isn’t there, but instead concentrate on who will be there and who is available, as we try to reach the highest level that we can.”Wiegman is set to announce her squad for the World Cup in late May."
    ]
}