{
    "articleURL": "/wires/aap/article-12044753/Frustrated-Hardwick-feels-Richmond-faithful.html",
    "content": [
        "Damien Hardwick says he shares the frustration of Richmond supporters in the club's horror start to the AFL season but the coach insists he and the players are up to the challenge of turning things around.",
        "The Tigers are in unfamiliar ladder territory, just two spots ahead of last-placed West Coast who they face on Saturday afternoon at the MCG.Richmond have banked just the one win and a draw from seven rounds and are on a five-game losing streak - representing the worst start since Hardwick's first year in 2010.The 24-point loss to Gold Coast last round prompted murmurings about the future of the three-time premiership coach, who is contracted until the end of 2024, but Hardwick said he still had energy and passion for the top job.\"I do - it was just one of those games where we just couldn't seem to get anything to go or anything to work and our players felt it as well,\" Hardwick said on Thursday.\"I was probably like all our supporters in our organisation, feeling incredibly flat and frustrated about where we're at but once I sit down in the cold hard light of day, review the tape and work through a few things I feel a hell of a lot better.\"So whilst there are some dark times at the moment in the win-loss column, there's been some little sprinkles of gold along the way - Samson Ryan, some of our younger players getting opportunities they wouldn't previously get which we think will hold us in good stead.",
        "\"But we've just got to make sure we start to tick over a few wins along the way.\"Hardwick said he felt the list was capable of rising up the ladder, as they did back in 2014 when they were two and five but strung together nine wins at the back-end to make the finals.\"Our list is well and truly capable - many people go, 'You're kidding yourself' but I've got incredible belief in this group of players,\" he said.\"We're not anywhere near where we need to be, but I certainly think we're capable when we get our game up and going and we get some players back into the side.\"Former skipper Trent Cotchin will sit out the match as the Tigers manage the 33-year-old, however they welcome back gritty midfielder Jack Graham after a hamstring injury while Dion Prestia returns from a rest due to soreness.Hardwick said exciting youngster Josh Gibcus (hamstring) and fellow defender Robbie Tarrant (hip) could play a half in the VFL next week.He added that co-captain and ruckman Toby Nankervis (ankle) had started running again and could return in two to three games, while key forward Tom Lynch (foot) was out of his moon boot."
    ]
}