{
    "articleURL": "/tvshowbiz/article-12046951/EastEnders-SPOILERS-Terminally-ill-Lola-enjoys-day-seaside-husband-Jay.html",
    "content": [
        "Lola Branning-Pearce's condition is set to deteriorate even further on next week's EastEnders, as she receives even more devastating news.",
        "For months, viewers have seen Lola battling a terminal brain tumour, and she has been told she has just six months to live.And in upcoming episodes, Lola begins suffer from speech and mobility impairment and is rushed to hospital, where doctors deliver a shocking prognosis.Determined to live out her final months to the fullest, Lola pleads with Jay to break her out of the hospital take her to the seaside for the day, where the pair enjoy a bittersweet outing. On the seafront the couple share a moving heart-to-heart over the coming weeks, that will no doubt leave viewers in tears.",
        "In the coming episodes, Kim (Tameka Empson) organises a leaving karaoke party for Lola (Danielle Harold) at the salon, but with her anxiety mounting, Kim forgets to hire a karaoke machine. After bonding with Ben (Max Bowden), Elaine saves the day with her swanky machine, but the events of the day become too much for Lola and she secretly retreats outside.Denise (Diane Parish), Honey (Emma Barton) and Kathy (Gillian Tayleforth) soon realise that Lola is missing and begin to panic when they can't find her. As Jay (Jamie Borthwick) and Billy (Perry Fenwick) join the search, Billy finds a confused Lola on the floor outside the gym. Later at home, Lola panics as her speech and mobility is impaired, and she's quickly rushed to hospital.",
        "A weak Lola wakes up in hospital with Ben, Jay and Billy at her side and learns the devastating news that her palliative chemotherapy treatment hasn't worked.Vowing to live her final months to the fullest, Jay breaks Lola out of the hospital to enjoy a fun-filled day at the seaside, and she spots a ruby necklace which she hopes to buy for Lexi as a 16th birthday presentWhilst at the sea front, Lola and Jay share a heart-to-heart over their future together, but as they prepare to leave but are interrupted by the police officer and the shopkeeper as it transpires that Lola stole the £60 necklace.Will Lola face yet more woes on top of her heartbreaking prognosis?",
        "Lola's emotional final scenes have already been filmed, and will air in the coming weeks, after viewers saw Lola learn she had less than six months to live.It comes after last month Danielle broke her silence on her impending departure from EastEnders after she filmed some of her final scenes for the soap.The actress took to Instagram to share a heartfelt message of thanks to everyone who has helped tell Lola's story.The character has a terminal brain tumour and was recently given only months to live, with her final scenes expected to air later this year.",
        "On the show, Ben Mitchell's mental health will continue to plunge to new depths as Lola drops the bombshell after learning she has months to live.Recent episodes have seen Ben struggle to cope with his ex's prognosis, and in upcoming scenes, he decides to ignore his feelings by fighting in a boxing match.After some unexpected news from the police, things get even worse for Ben as he continues to bottle his feelings.And after sharing her prognosis with her father Billy, Lola realises she needs to get things in order, and tells Jay she wants him to adopt her daughter Lexi.EastEnders airs Mondays to Thursdays at 7:30pm on BBC One and iPlayer. "
    ]
}