{
    "articleURL": "/news/article-12047547/Man-59-threw-shotgun-cartridges-Buckingham-Palace-detained-Mental-Health-Act.html",
    "content": [
        "The man, previously named as dog breeder David Huber, is now in hospitalHe allegedly approached police outside Buckingham Palace and had a knifeIt comes as police prepare to close a 'ring of steel' of security for the Coronation A 59-year-old man who was arrested this week after he threw shotgun cartridges into the grounds of Buckingham Palace has been detained under the mental health act, police have said.",
        "The man, previously named as dog breeder David Huber from Cumbria, approached officers asking to see a soldier at around 7.15pm on Tuesday, Deputy Assistant Commissioner for the Metropolitan Police Ade Adelekan said.When they said that was not possible, the man allegedly began throwing shotgun cartridges over the gates. He was searched and allegedly found to be in possession of a lock knife, and was arrested on suspicion of possession of a knife and ammunition.It was confirmed today that he was detained under the Mental Health Act on Wednesday and taken to hospital, where he will remain on bail while receiving medical care. Scotland Yard is not treating the incident as terror-related, and it understood it is being treated as an isolated mental health incident.",
        "The suspicious bag that was found held two passports, a phone, wallet, keys, bank cards, laptop case, picture of a child, and a large brown letter, according to The Sun. There was also a copy of the book The Happiness Advantage by Harvard lecturer Shawn Achor. During the arrest, the man told officers they should handle his rucksack with care, which led to a controlled explosion being carried out. Scotland Yard announced it was not treating the incident as terror-related, and it understood it is being treated as an isolated mental health incident.",
        "The suspicious bag that was found held two passports, a phone, wallet, keys, bank cards, laptop case, a picture of a child, and a large brown letter, according to The Sun. There was also a copy of the book The Happiness Advantage by Harvard lecturer Shawn Achor. Though neither the King nor Queen were in residence, Camilla's grandchildren had been seen arriving at Buckingham Palace hours before - while Charles had held an audience with Australian Prime Minister Anthony Albanese earlier in the day. It came just days before King Charles III's Coronation, which is due to take place on Saturday, May 6.Police have warned of a huge security operation in place for the weekend, involving some 11,500 officers - many of whom will be armed.Anti-monarchist activists will be permitted to peacefully protest against the Coronation along the procession route, with more than 1,000 expected to gather in Trafalgar Square on Saturday. ",
        "There are also fears other protest groups such as Just Stop Oil may be planning some form of disruption. The procession route will be lined by thousands of police officers watching the crowd, with plain clothes colleagues also mixing with members of the public.",
        "Facial recognition technology will also be deployed to flag to police any individuals on watch lists or who have outstanding warrants.",
        "A Met Police statement released on Wednesday said: 'Operation Golden Orb is one of the most significant and largest security operations the Met has led. 'On Coronation Day we will have the largest one day mobilisation of officers seen in decades with over 11,500 officers on duty. 29,000+ deployments during the operation.'It added: 'Our tolerance for any disruption, whether through protest or otherwise, will be low. We will deal robustly with anyone intent on undermining this celebration.'Speaking after Mr Huber's arrest on Tuesday, a former head of Royal Protection Dai Davies warned the threat of an attack is 'as high now as it's ever been' and said 'you can never drop your guard' when working for the Royal Family.Mr Davies told MailOnline: 'As we saw the police's response was adequate - but if he's been there for days, I would have hoped someone would have noticed him. It is essential to watch the characteristics of people and to take action immediately. I would be very very angry to anyone who didn't do that.'He added: 'If a police officer heard him, he would have had a duty to catch him and detain him under the Mental Health Act.'Mr Davies also issued a warning that the risk for a potential terror attack is very high, saying not just the palace could be targeted but also railway and Tube stations. ",
        "'Of course, for hundreds of years you might expect protesters at events such as this but never before have activists been able to organise on the scale of groups such as Just Stop Oil and Extinction Rebellion,' he added.'There are considerable groups that pose a threat. Often it is the lone wolf that wants publicity. This incident indicates that the police are on full alert.'"
    ]
}