{
    "articleURL": "/wires/reuters/article-12045611/Rugby-Try-machine-Jordan-returns-Crusaders-run-Super-playoffs.html",
    "content": [
        "MELBOURNE, May 4 (Reuters) - Prolific try-scorer Will Jordan will make his long-awaited return to elite rugby when he lines up for champions Canterbury Crusaders in Super Rugby Pacific this weekend after a long battle with a migraine-related illness.",
        "Jordan missed the All Blacks' season-ending tour of the northern hemisphere last year and his struggles have kept him out of the Crusaders lineup for the season to date.Crusaders fans have missed the explosive 25-year-old's finishing skills and will welcome him back to Rugby League Park on Saturday as the starting fullback in an afternoon clash against Western Force.\"He's got better and better and chose this game after having a couple of good training weeks,\" coach Scott Robertson said.\"He's ready to play the full 80 if needed.\"After slumping to their third loss of an injury-plagued season, and second defeat against the unbeaten Waikato Chiefs last weekend, the Crusaders' dynasty is on shaky ground as they lie fifth on the table with five weeks before the playoffs.The Chiefs, however, look unstoppable and will bid for a 10th successive win when they head south to the struggling Otago Highlanders, who return home from a winless tour of Australia.The Chiefs will be without injured lock Brodie Retallick but welcome back another All Black in Anton Lienert-Brown, who slots back into the midfield for his first match since a serious ankle injury in the season-opener against the Crusaders.The ACT Brumbies also welcome back reinforcements for Sunday's match against the Melbourne Rebels as they look to bounce back from another fruitless trip to New Zealand.",
        "Wallabies loose forward Pete Samu and centre Len Ikitau return for the Brumbies, who are clinging to second spot after suffering a deflating defeat to the Wellington Hurricanes.One point behind the Brumbies, the third-placed Hurricanes travel to Suva to meet Fijian Drua on Saturday.The Auckland Blues (6-3) breathed new life into their season with an emphatic 30-14 win away to the Drua last week and return home to take on winless Moana Pasifika on Saturday.Rugby league convert and dual code international Roger Tuivasa-Sheck will line up at inside centre and make a long-awaited return from a hand injury for the Blues.Beauden Barrett will have a week off from the ongoing debate about the All Blacks' starting flyhalf at the World Cup, with Blues coach Leon MacDonald shifting him to fullback and giving Harry Plummer a run at number 10.After a dreadful first half of the season, the Queensland Reds will look for a third win in succession against the New South Wales Waratahs in the steamy northern city of Townsville on Saturday.The match is the second part of a double-header which will see the women's Reds bid for their first Super W title in the final against Fijiana Drua. (Reporting by Ian Ransom in Melbourne; Editing by Peter Rutherford)"
    ]
}