{
    "articleURL": "/wires/ap/article-12049531/Dog-Show-101-Whats-Westminster-Kennel-Club.html",
    "content": [
        "NEW YORK (AP) - To the casual viewer, competing at the Westminster Kennel Club dog show might look pretty simple: Get a dog. Groom it. Pose it. Lead it around a ring.",
        "But there's a lot more than that to getting to and exhibiting in the United States' most prestigious canine event, now in its 147th year.So here are the ins and outs of the show, which starts Saturday at the USTA Billie Jean King National Tennis Center in New York.HOW MANY DOGS COMPETE?Twenty-five hundred dogs from 210 different breeds and varieties signed up to vie for the best in show trophy that gets awarded Tuesday night. (Varieties are subsets of breeds. Think smooth, longhaired and wirehaired dachshunds.)Hailing from 49 states and 13 countries, contestants range from tiny Chihuahuas to giant Great Danes. They include familiar breeds like Labrador retrievers, rarities such as the sloughi, and a newcomer, the bracco Italiano. Agility and obedience contests Saturday involve a few hundred more dogs, including some mixed-breed ones.",
        "HOW DO DOGS GET INTO THE SHOW?All the dogs are champions, meaning they've racked up a certain amount of prior accolades. Certain top dogs in the sport's complicated rankings are invited, but other pooches also can enter.The process of becoming a potential best in show begins when breeders suss out which puppies in a litter have the physical attributes and disposition to shine in what's known as \"conformation\" competition.Some pups eventually get to Westminster with owners who learned the ropes after getting a show-quality dog. Other canine contestants crisscross the country by road or even air, hitting shows every weekend with big-name professional handlers and a strategy that can entail gathering intel about rivals' schedules, pondering judges' past picks and even running ads to celebrate the animal's accomplishments and boost its profile. They don't call it \"campaigning a dog\" for nothing!",
        "WHAT´S A DOG SHOW DOING AT A TENNIS FACILITY?It´s a new venue for Westminster, which was held for decades all or partly at Madison Square Garden. The pandemic prompted a move to outdoor digs at an estate in suburban Tarrytown, New York, for the past two years. Organizers were keen to return to New York City this year. Amid construction plans at a pier building that used to house the show´s early rounds, organizers linked up with the U.S. Open tennis tournament´s base in Flushing Meadows. \"An iconic dog show event in an iconic venue,\" Westminster President Donald Sturz enthuses.HOW DOES IT WORK?\"Conformation\" dogs first face off against others of their breed - sometimes dozens of others, sometimes few or even none. Each breed's winner moves on to a semifinal round of judging against others in its \"group,\" such as hounds, herding dogs or terriers. In the final round, the seven group winners compete for best in show.WHAT DO JUDGES LOOK FOR?They're tasked with determining which dog best matches the ideal, or \"standard,\" for its breed.The standard is derived from the breed´s original function and may speak to anything from teeth to tail to temperament. For example, a hound developed to hunt in rough terrain might be required to have thick paw pads. A herding dog might need proportions that allow for quick, tight turns.",
        "Judges do hands-on examinations and watch the dogs in motion, taking in each dog's assets and imperfections. Especially in the finals, distinctions can be very subtle. Show folk often say that victory can go to \"the dog on the day\" - or as the rest of us might say, the one that just brings it.WHAT BREEDS HAVE WON THE MOST?In records going back to 1907, Wire fox terriers have scampered away with the top prize 15 times, most recently in 2019. Scottish terriers, English springer spaniels, standard poodles and Pekingeses all have five or more wins.Many breeds have yet to triumph, including such popular ones as the Labrador retriever. But winless breeds should never say never: A bloodhound took best in show for the first time just last year.Westminster's agility and obedience competitions were added only within the last decade. So far, almost all the agility championships have gone to border collies, and nearly all the obedience titles to Labs. One Lab, named Heart, won five times in a row.HAS A MIXED-BREED DOG EVER WON?While Westminster has said there a few mixed-breed entrants in early shows, the best in show prize wasn't awarded until 1907 and has gone only to purebreds. The pedigreed set also has won all the agility and obedience trials to date, but there's a special prize every year for the top mix (or \"all American dog,\" in show parlance).",
        "The focus on purebreds irks groups such as People for the Ethical Treatment of Animals, which regularly protests Westminster as a reprehensible canine beauty pageant. The kennel club says it celebrates all dogs while highlighting \"preservation breeding\" of those with skills and traits that have been honed over generations.WHAT DO WINNERS GET?Bragging rights and trophies. There are no cash prizes, though the agility and obedience winners each get to direct a $5,000 Westminster donation to a training club or to the American Kennel Club Humane Fund.SO WHAT´S THE POINT?Showcasing dogs, particularly breeds that many people don't see regularly, participants say. Many also value the friendships that develop at shows that bring dog lovers together across miles and backgrounds.\"We can all talk about dogs,\" says dog expert David Frei, who hosted the Westminster telecast for over two decades. \"That's the beauty of the sport, and the beauty of dogs.\"___ New York-based Associated Press journalist Jennifer Peltz has covered the Westminster dog show since 2013."
    ]
}