{
    "articleURL": "/sport/football/article-12047447/Micah-Richards-reveals-confrontation-s-bag-Mark-Hughes-Man-City.html",
    "content": [
        "Mark Hughes was Micah Richards' manager at Man City for an 18-month periodRichards said Hughes was a 'nice guy' but also described him as being a 's***bag'The two men had a confrontation after a match in which City suffered a defeatMicah Richards has opened up on a confrontation he had with his former Man City boss Mark Hughes - saying the Welshman could be 'a bit of a s***bag'.",
        "Hughes coached City from June 2008 to December 2009, with Richards playing a regular part in his starting XI.However, during the Welshman's reign, Richards was annoyed with how Hughes spoke to him following a defeat.Richards was a guest on the Filthy Fellas podcast, in which he opened up on what happened between them.He said: 'Hughes is such a good guy, he's a nice humble guy, unbelievable player you've got to have respect for him but he was just a bit of a s***bag. ",
        "'He was a top player and that's why I had so much respect for him but I don't remember if I've told this story before but we lost the game and we was in a huddle like this and we're talking about it.'Because I'm always lively and all that sort of stuff, I might have just had a smile on my face and he just says \"what the f*** you laughing at?\"'I was like \"no it can't happen\" that and then his assistant, Mark Bowen, he was giving it all this and he sent me in. And then I went into the manager's office after and I said \"gaffa what was that all about?\" And he didn't say nothing 'At least If you're going to try and embarrass me in front of people, if it's me and you, then tell me how you really feel and he didn't like that confrontation.'",
        "Man City finished tenth in the only full season that Mark Hughes was in charge during the 2008-09 campaign.Hughes was replaced by Roberto Mancini after his sacking, and Man City went on to win their first Premier League title in 2012.  ",
        "Richards meanwhile also described former Aston Villa boss Remi Garde as 'awful'.Garde was Villa manager from November 2015 to March 2016, in a miserable season for the club where they were relegated to the Championship after taking just 17 points in 38 games.Richards said: 'The first training session it was just basic drills and he said don't stop the ball with your studs only do one-two passing.'It was then we knew we were going down.'"
    ]
}