{
    "articleURL": "/news/article-12046031/NANA-AKUA-Realms-want-ditch-King-know-enduring-power-Commonwealth.html",
    "content": [
        " A Daily Mail poll of the 14 Commonwealth countries where King Charles is head of state yesterday revealed that six of them would vote to become a republicBut none is in favour of leaving the Commonwealth - and it’s not hard to see whyDisturbing figures from a Daily Mail poll of the 14 Commonwealth countries where King Charles is head of state yesterday revealed that six of them would vote to become a republic.",
        "While it’s distressing to hear this news in the week of the Coronation, the poll results contain a silver lining: not one of the would-be republics is in favour of leaving the Commonwealth.And it’s not hard to see why.Countless millions around the planet benefit from their trade links and historic ties with Britain and its Royal Family. Severing those would do nothing but damage.And you don’t have to take my word for it, let’s look at the figures.",
        "A study published last year by the Commonwealth Secretariat showed just how tough the past decade has been for the world’s poorest nations, the ones designated Least Developed Countries (LDCs) by economists.But 14 of those countries – a sample unrelated to the 14 countries mentioned above which have Charles as head of state - are bucking the trend. And all of them are members of the Commonwealth.The stats are complex but incontrovertible. Skip this bit if numbers make your head swim: trade for all 47 LDCs during the eight years between 2011 and 2019 grew slowly, by about 12 per cent, from $215billion to $241billion.But for the 14 LDCs that enjoy Commonwealth status, that growth was more than three times higher, at 41 per cent — from $57billion to $80billion.",
        "That’s huge. And the pattern was repeated even when global trade dipped during the pandemic, because Commonwealth trading partners kept doing business with each other while the rest of the world shut up shop.The club of nations with the King at its head is more than an ideal. It’s a real force for changing the lives of millions of poorer people for the better, in the real world.Anti-monarchists have always hated the Commonwealth, claiming it perpetuates the British Empire. In Meghan and Harry’s Netflix documentary last December, the historian Afua Hirsch described it as ‘Empire 2.0’, meaning it was the second generation of British colonialism: ‘son of empire’.",
        "She also scoffed at the perception of it as ‘a club of friends who share common values’, calling that ‘problematic’... which is woke code for ‘racist’.What the Commonwealth’s detractors fail to point out is that as the British Empire contracted as our former colonies asserted their independence, the Commonwealth grew like Topsy.In 1953, the year of the Coronation of our late Queen, it had just eight members, including the UK.Today 56 countries are members of the Commonwealth, including Mozambique, Rwanda, Gabon and Togo, which have no colonial or historical ties to Britain.So why did they join? Because they valued being in an organisation that, in an increasingly English-speaking world, acts as a useful network of diplomatic and cultural influence, and exercises ‘soft power’ on the global stage.",
        "We can all be proud of the Commonwealth. It does so much good, something that the Ghanaian members of my extended family have witnessed first hand.Take just one example — the Queen Elizabeth Diamond Jubilee Trust, which has worked to combat avoidable causes of blindness, providing 26.6million antibiotic eye treatments and 102,400 sight-saving operations to help eliminate trachoma in seven Commonwealth countries.If anyone thinks that is ‘problematic’, I despair of them. I really do."
    ]
}