{
    "articleURL": "/wires/afp/article-12050835/HSBC-seeks-bank-intact-shareholders-vote-split.html",
    "content": [
        "HSBC on Friday overwhelmingly defeated an activist proposal supported by its largest stakeholder, Chinese insurer Ping An, to spin off the bank's Asia business in a search of better returns.",
        "Of the shareholders who voted, more than 80 percent opposed the call to break up the Asia-focused bank, HSBC said in a statement.The vote took place during HSBC's annual general meeting in Birmingham, central England, which faced disruption from climate protesters.The AGM came at the end of a week in which the London-headquartered bank posted a surge in quarterly net profit, boosted by rising interest rates and its rescue of the UK arm of failed US lender Silicon Valley Bank.\"A large majority of HSBC shareholders voted overwhelmingly to support the board,\" HSBC chairman Mark Tucker told the meeting.\"That draws a line (under) the debate over the structure of the bank.\"Speaking earlier at the meeting, Tucker insisted the proposal to split the bank was not beneficial.\"We concluded that the alternative structural options would materially destroy value for shareholders, including putting your dividends at risk. This remains our unanimous view today,\" he said.But Ping An, which owns more than eight percent of HSBC, argued that the lender lags behind international peers and that a recent improvement in performance was tied mainly to rising interest rates, which it claims have peaked.The US Federal Reserve this week hinted that it would pause a policy of lifting borrowing costs aimed at cooling inflation.",
        "The European Central Bank on Thursday delivered a smaller interest rate increase than recently as higher borrowing costs begin to take their toll, but said it had \"more ground to cover\" in fighting red-hot price increases.\"It is necessary for HSBC to push for structural reform to fundamentally address HSBC's underlying market competitiveness issues,\" Michael Huang, chairman and CEO of Ping An Asset Management, said recently.- Hong Kong HQ? -Ping An had called on HSBC to engage in a \"strategic restructuring\" that would see it create a separately-listed bank headquartered in Hong Kong.Huang said the proposal would allow the bank to retain control over a separate Asia business, adding that management had \"exaggerated many of the costs and risks\" associated with a split.HSBC was among a number of major banks to cancel dividends early in the Covid-19 pandemic after an order from the Bank of England, a move that riled some Hong Kong investors.Some retail investors had cited the dividends cancellation as a reason to back the spin-off proposal.Friday's shareholder meeting faced disruption from climate protesters, a common feature this year at annual general meetings being held by major UK companies.\"You are happy to profit while the world burns. HSBC stop the greenwash,\" one protester shouted as the meeting got underway and before security removed some demonstrators.",
        "Environmentalists are pushing for banks to stop funding fossil fuel projects, arguing that while they continue to do, their pledges to help tackle climate change are acts of \"greenwashing\".burs-bcp/rl"
    ]
}