{
    "articleURL": "/news/article-12054037/Prime-Minister-delivers-reading-King-s-coronation.html",
    "content": [
        "The PM, who is Hindu, read from the Epistle to the Colossians during the serviceHistorian Mr Starkey criticised the PM for being 'invisible' during preparationsRishi Sunak read from the Bible at the King's Coronation today, just days after a prominent historian sparked a race row by claiming he was 'not fully grounded in our culture'.",
        "The Prime Minister, who is a Hindu, had a prominent role in Westminster Abbey with a reading from the Epistle to the Colossians.Mr Sunak's reading included the lines: 'For by him were all things created, that are in heaven, and that are in earth, visible and invisible, whether they be thrones, or dominions, or principalities, or powers: all things were created by him, and for him: and he is before all things, and by him all things consist.'In the lead-up to the King's coronation, historian David Starkey claimed Mr Sunak was 'not fully grounded in our culture'.Asked to explain his comment, made as he criticised the PM for being 'invisible' in preparations for the coronation, he said: 'In terms of religion.'",
        "Dr Starkey later insisted his remarks on GB News were not racist, saying he was referring to the Prime Minister being a 'typical international liberal' with no interest in British 'values'.Mr Sunak tweeted this morning: 'Today's #Coronation is a moment of extraordinary national pride. No other country could put on such a dazzling display. 'But it is not just a spectacle. It's a proud expression of our history, culture, and traditions. 'It is a vivid demonstration of the modern character of our country. And a cherished ritual through which a new era is born. God Save The King.'",
        "It came as a number of Mr Sunak's predecessors at No10 were also in attendance at the Westminster Abbey service today, including Boris Johnson, Tony Blair and John Major. Mr Johnson arrived holding his wife Carrie's hand as Theresa May and her husband Philip walked ahead of them and Liz Truss trailed behind with her spouse Hugh. Mr Major, 80, was seen talking to Mr Blair's wife Cherie as he arrived without his other half Norma, 81, who had been set to attend but is unwell.Gordon Brown, 72, was joined by his wife Sarah, while David and Samantha Cameron rounded off the line of Britain's seven surviving former leaders and their spouses. The group went to take their seats after current PM Mr Sunak had also arrived with his wife Akshata Murthy.Mr Sunak replaced Ms Truss as PM last October after her disastrous short-lived stint in Downing Street. Ms Truss was PM when Her Late Majesty The Queen died aged 96.She became PM after Mr Johnson was forced to step down by his own MPs following a string of scandals. ",
        "He had replaced Mrs May as PM in 2019 after the failure of her attempts to get her Brexit deal through Parliament. And Mr Cameron, 56, served as PM from 2010 until 2016, when he resigned after Britain voted to leave the EU.",
        "Mr Brown, the most recent Labour PM, was in Downing Street from 2007 until 2010 after replacing Mr Blair, who served for a decade from 1997.  "
    ]
}