{
    "articleURL": "/wires/reuters/article-12042257/Tunisian-journalists-union-say-president-No-1-enemy-press-freedom.html",
    "content": [
        "By Tarek Amara",
        "TUNIS, May 3 (Reuters) - Tunisia's main journalists' union accused President Kais Saied on Wednesday of becoming the number one enemy of press freedom since he seized almost all powers in 2021, a move that the opposition described as a coup.A free press was a key gain that Tunisians won from the 2011 revolution that ended the autocratic rule of the late President Zine El Abidine Ben Ali. But journalists complain now that those freedoms have been eroded.Reporters Without Borders said on Wednesday that press freedoms had declined significantly in Tunisia in the last year, with the country falling from 94th to 121st on its list.Mahdi Jlassi, head of the National Syndicate of Tunisian Journalists, said that state television had become \"a trivial propaganda mouthpiece that excludes all opposition voices\", after remaining a pluralistic voice over the past decade.Saied in September decreed a law imposing prison terms for spreading false information or rumours online, a move immediately denounced by journalists as an assault on freedom of speech.Jlassi said several journalists had been tried under the law, which was \"the biggest setback to expression freedom since 2011\".Saied has rejected accusations of restricting press freedom and says no journalist was imprisoned for his opinion. Saied has defended the law as necessary to save Tunisia from years of crisis.",
        "The interior ministry says that there have been no deliberate attacks on journalists' rights but that there may have been \"individual mistakes\".Last year, journalist Saleh Attia was jailed for three months for criticising the the role of the army in politics. Journalist Ameur Ayad was jailed for two months for criticising the president. Journalist Nizar Bahloul is facing trial for an article generally critical of the authorities.Police are currently investigating journalists Mohamed Bougaleb and Monia Arfaoui for defamation after they criticised the minister of religious affairs.This year, Nourredine Boutar, head of Radio Mosaique, Tunisia's main news outlet, was jailed on charges of conspiracy against the state and money laundering, according to his lawyer, who said that investigators asked him mainly about the radio's editorial line.The journalists' union says many activists and other citizens had also been imprisoned for social media posts critical of the president and other officials. (Reporting by Tarek Amara; Editing by Nick Macfie)"
    ]
}