{
    "articleURL": "/wires/aap/article-12038605/Future-uncertain-Cronullas-fit-firing-Graham.html",
    "content": [
        "Cronulla veteran Wade Graham will make a call on his playing future later in the year but says early signs are good that his body is holding up in his 16th NRL campaign.",
        "Graham is off-contract at the season's end and was in a similar situation last year, weighing-up his options before eventually signing a one-year deal to remain with the Sharks for 2023.The 32-year-old will front up for his fourth game of the season when Cronulla take on the Dolphins in Magic Round.Since returning from suspension in round seven, he has been carefully managed by the Sharks' coaching staff.\"I'm probably not as banged up as a few of the other boys who have played every game,\" Graham said.\"But I've only been playing 30-minute stints so the body's feeling pretty good.\"The back-rower's career has been stymied by multiple concussions and injuries but neither his fitness nor his future were on Graham's mind during his most recent stint on the sidelines.And with Braden Hamlin-Uele, Matt Moylan, Toby Rudolf and Royce Hunt among the players able to negotiate with rivals from November 1, Graham acknowledged there were bigger fish to fry at Cronulla.\"I haven't really thought about it,\" he said. \"Since the suspension I've been coming in and just trying to help the team find that consistency.\"The talk will come in the back end of the season. We're in no rush. I'm probably one of the lowest priorities.\"",
        "The premiership player remains in open dialogue with coach Craig Fitzgibbon and general manager of football Darren Mooney.\"I've been here a long time, so it's an easy conversation,\" he said.In addition to playing, Graham appears regularly on Triple M's NRL coverage and is completing his coaching accreditation.\"What if I was to finish up in footy, what does life after footy look like for me?\" he asked.\"It's a big decision there, but we've got a few balls in the air.\"As the season progresses and we get towards the back end of the year, that picture will become clearer.\""
    ]
}