{
    "articleURL": "/news/article-12047183/Pictures-Prince-Philip-spent-nearly-6-000-hours-sky-59-different-aircraft.html",
    "content": [
        "Exactly 70 years ago today, Prince Philip obtained his RAF wings after trainingPlanes he flew included Concorde, an Avro Vulcan and a Boeing StratocruiserFor all the latest Royal news, pictures and video click here In 45 years as a qualified pilot, Prince Philip amassed nearly 6,000 hours in 59 different types of aircraft. ",
        "Exactly 70 years ago today, the late Duke of Edinburgh's formal time as a pilot began when he gained his wings after training with the RAF.Three years later, he obtained his helicopter wings and then gained his private pilot's license in 1959. Planes he flew included Concorde, an Avro Vulcan and a Boeing Stratocruiser. His final flight was at the age of 76, when he flew from Carlisle to Islay on August 11, 1997.",
        "Philip - who had been forced to give up his career in the Royal Navy after the Queen had succeeded her father George VI as monarch in 1952 - began training in a De Havilland Chipmunk before moving on to a North American Harvard.Both aircraft were produced for training would-be pilots. Much of his training - which began on November 12, 1952 - took place at White Waltham Airfield in Maidenhead under instructor Flight Lieutenant Caryl Ramsay Gordon. He was awarded his wings at a private ceremony at Buckingham Palace by Chief of the Air Staff Air Chief Marshall Sir William Dickson.The Prince's desire to fly came despite the death of his sister Cecile in a plane crash when he was just 16.Cecilie, who was eight months pregnant at the time, died along with her husband and two sons.",
        "There was initially concern in government that it would be too risky to allow Philip to carry out solo flights.Declassified documents released this year revealed how the then Prime Minister Harold Macmillan gave Philip permission to take the risk of flying in light aircraft after accepting that he could not stop the Duke from doing so.In 1960, Mr Macmillan approved a set of rules that set out how the Duke's flights should take place.The guidelines, which were approved by the PM, suggested that Philip should only fly in daylight, with a minimum visibility of three nautical miles and 'steps should be taken to minimise air traffic over the airfield or airfield concerned.'In his tours around the world, Philip regularly piloted aircraft of the Queen's Flight. Several of his patronages also reflected his love of aircraft. He was Royal Aeronautical Society Honorary Fellow, Honorary Life Member of the Royal Aero Club and a Grand Master of the Guild of Air Pilots and Air Navigators (now the Honourable Company of Air Pilots).",
        "Philip's time in the air was famously depicted in Netflix series The Crown. In an episode set following the 1969 moon landing, Philip was seen flying a plane alongside a co-pilot.Spotting the distant moon, he took the controls and flew straight towards it, much to his companion's terror.",
        "After eventually levelling off once more, he said, 'we've also lived… just for a minute'.  "
    ]
}