{
    "articleURL": "/news/royals/article-12052803/Abbey-glorious-Royal-family-reveal-stunning-scenes-inside-Westminster-Abbey.html",
    "content": [
        "Anticipation hangs in air in the royal church as its country sits expectant - waiting for monarch to be crownedBlooming with flowers, the empty halls are shown off in all their glory in a poignant series of panning shotsThe first Coronation of a British monarch in more than half a century, the Abbey will play host to 2,300 guestsThis is the stunning video of Westminster just hours before it hosts King Charles III's Coronation as the country holds its breath for the new monarch later today.",
        "Anticipation hangs in the air in the royal church as its country sits expectant - waiting for the monarch to be crowned in the moment his whole life has been leading towards.Blooming with flowers and with Britain's most sacred artefacts taking pride of place, the empty halls are shown off in all their glory in a poignant series of panning shots. Posting the video on social media, the Royal Family simply captioned it: 'Westminster Abbey is ready for the Coronation of King Charles III and Queen Camilla.'The first Coronation of a British monarch in more than half a century, the Abbey will play host to 2,300 guests while huge crowds are ready to line the streets outside.",
        "Footage starts off looking through foliage and flower displays towards the stunning Great West Window in the distance - showing Abraham, Isaac and Jacob with the Twelve Tribes of Israel.",
        "Dating back to 1735, it looks over the nave, containing the graves of Sir Isaac Newton, Stephen Hawking and the Unknown Warrior alongside memorials to the likes of Sir Winston Churchill.The arrangements will feature hellebores – a particular favourite of the King – as well as honeysuckle, tulips, blossom, jasmine, ranunculus and aquilegia – an ancient symbol of the Holy Spirit.",
        "They will also include foliage of rosemary, birch, bay and hazel and wild broom grown on the Isle of Skye.The plants have all been chosen because they are in season and will be donated to Floral Angels, which repurposes arrangements from events into bouquets to share with care homes, hospices and shelters. Camilla is the charity's patron.Florist Shane Connolly, who is in charge of the arrangements, said that at the late Queen's 1953 coronation there were no flowers in the Abbey, only on the processional route.'The Abbey was so full of people, and everyone wearing scarlet robes, that there was no place for flowers,' he said.By contrast, the guest list for Charles's ceremony today has been cut down from Queen Elizabeth's 8,000 – leaving room for a spectacle of colour.",
        "They have been provided by Flowers from the Farm, a non-profit association that champions artisan growers, with foliage from the Royal Horticultural Society (RHS) at the High Altar.",
        "Britain's other national landmarks have also recieved the Royal treatment ahead of the Coronation, with Big Ben lit up in a stunning display in honour of the King.In a touching display of unity ahead of the event images of the national plants of England, Scotland, Wales and Northern Ireland - the rose, thistle, daffodil and shamrock - were projected on to the 160-year-old building.",
        "In line with the King's passion for 'sustainability', the flowers and foliage will be arranged without single-use plastics or floral foam.The arrangements will reflect Their Majesties' deep affection for the natural world and their shared passion for gardening, and showcase the 'best of the British countryside in the spring'.The King is known for his love of nature and the environment.When the invitations for the ceremony were sent out last month, they were adorned with images of flowers, birds, insects and the Green Man - while the royal couple's thrones are being re-used rather than made new, as would be customary.The Princess of Wales is even set to wear a floral headpiece instead of a tiara, while an ornate, three-sided screen shielding Charles as he is anointed King depicts a tree with 56 leaves representing the Commonwealth nations.As it pans down, the video reveals the scene of the Coronation waiting expectantly.With the Coronation Chair at its centrepiece,holding the Stone of Destiny, the Throne Chairs are just behind, the Chairs of Estate are to the left and the Cosmati Pavement provides a stunning backdrop.The Coronation Chair - which has been at the heart of the ceremony for over 700 years - is where the King will sit to be anointed by the Archbishop of Canterbury.",
        " While seated here, Charles III will also recieve the regalia and be crowned.Made of oak and originally covered in gold leaf with elaborate decorations of coloured glass, the throne is considered an unparalleled surviving example of medieval art – although its back is scarred with graffiti from the 18th and 19th centuries.",
        "The Stone of Destiny sits beneath the chair - which was specially designed to hold the sacred rock. It was specially transported under tight security from Scotland last week.Also known as the Stone of Scone, the ancient symbol of Scotland's monarchy has been used for centuries to inaugurate kings. Its earliest origins unknown, it was said to be used by the biblical Jacob as a pillow and later kept in King Solomon's temple.",
        "The Chairs of Estate will be positioned to the south side of the High Altar, and will be the focus of most of the ceremony - and will also be where the Queen Consort, Camilla, is crowned.The King and Queen decided to use existing chairs held by the Royal Collection as the Chairs of Estate, which were made in 1953 by the London firm White, Allom and Company for the coronation of Queen Elizabeth II. One was used by the Queen during the ceremony, with a matching ‘companion’ chair later made for the late Duke of Edinburgh.",
        "Made from carved and gilded beechwood in 17th century style, they bore the cyphers of Elizabeth and Philip, as well as the national emblems of a rose, thistle and shamrock.Conservators have cleaned and restored the seats to the same pattern in which they were originally upholstered. However, the cyphers of the King and Queen Consort have replaced those of Elizabeth and Philip, which will be kept in the Royal Collection.The new cyphers have been hand-embroidered by the Royal School of Needlework using cloth of gold and matching metallic thread, but the original braid and trimmings have been reused.",
        "The King and Queen's Throne Chairs - which are also known as the Chairs of State - sit behind the Coronation Chair.",
        "The BBC will have 150 cameras covering the coronation festivities, including the procession to Westminster Abbey and the ceremony itself.Broadcasting from temporary studios in London and Windsor, the corporation will also be at the ten sites of its Lighting Up The Nation event.There will be choreographed lasers, projections and drone displays over historic bridges and buildings, including Blackpool seafront in Lancashire, as part of the Coronation Concert.In addition to its fixed operations, there will be 19 separate outside broadcasts from Windsor, London and across the rest of the UK.",
        "Here, the King will recieve homage from the Archbishop of Canterbury and the Prince of Wales.They were first used by King George VI and his wife, Queen Elizabeth, in 1937.The King has recycled the original royal coats of arms that were on the front and back of the chair for King George VI in a touching nod to his grandfather. The Queen Consort has an identical chair, used by Queen Elizabeth, but her own coats of arms have replaced those of the Queen Mother.Caroline de Guitaut, of the King’s Works of Art at the Royal Collection Trust, praised the King’s ‘incredibly efficient and sustainable’ way of doing things. Alongside the famous seats, the King has commissioned 100 chairs using sustainable British oak for members of the Royal Family and VIP guests, as well as ‘ordinary’ members of the congregation. In a first, these chairs will be auctioned off later this year for several charities close to Their Majesties’ hearts including ones supporting the homeless and victims of domestic violence.And the ceremony will take place on the stunning Cosmati Pavement - which was laid in 1258 by order of Henry III - who is entombed in Westminster Abbey.",
        "Vistitors to the royal church after the Coronation will be allowed to stand in the same spot that the King will be crowned - but they will have to take their shoes off.It will be the first time the public will be able to access the medieval treasure, which is usually roped off.The elaborate mosaic inspired elements of the design for the King's Anointing Screen.The specially commissioned an ornate, three-sided screen will offer more privacy for his moment of solemnity than any sovereign before him. Depicting a tree with 56 leaves representing the Commonwealth nations, the hand-sewn design on the front of the screen bears the King’s cypher at the base of the trunk showing the sovereign as a servant of the ‘family of nations’.The video then switches to seeing the throne from behind, looking up at the High Altar from the choir's pews.",
        "Westminster Abbey was designed in the 13th century to not just be a place of worship - but a place for kings to be crowned and entombed.The current building stands on the site of a monastry Edward the Confessor endowed and enlarged.  It became known as the \"west minster\" to distinguish it from St Paul's Cathedral (the east minster).It survived for two centuries before being rebuilt by King Henry III.Every monarch since William the Conquerer have been crowned in the Abbey, with the exception of Edward V and Edward VIII.There are 3,300 buriels throughout the church and over 600 monuments and wall tablets.The newest addition to the historic site is The Queen's Window, installed to celebrate the reign of the late monarch and designed by David Hockney.",
        "Above the Coronation Throne, you can see what will be the King's view - a passionate display of flowers and foliage.It is set off against the royal blue carpets - which become yellow where the King and Queen Consort will be crowned. To the left of the King will be the Royal tombs - where 30 kings and queens including King Edward the Confessor have their final resting place.Alongside the Saint are Henry V, who won victory over the French in the Battle of Agincourt on St Crispin's Day in 1415, and Edward III, who reigned for fifty years.Also buried nearby are Queen Elizabeth I and James I, who is buried under the tomb of Henry VII in the Lady Chapel.The video steadily zooms in on the High Alter and throne - which sit rapt in anticipation ahead of their big moment today, where they will play host to another crowning broadcast live to the nation.In a final shot, the true scale of the Abbey is revealed - as the camera looks down from the rafters upon the stunning scene.The height reveals the true magnitude of the incredible arches, which cascade towards the light of the Apostled windows in the far distance.From this viewpoint, as the video fades to black and the thrones seem tiny against the grand scale of the Abbey - with today's Coronation poised to write itself  Briton's history.",
        "The big day, May 6, begins today with viewing areas opening along the procession route at 6am and guests for Westminster Abbey beginning to arrive at security checkpoints in Victoria Tower Gardens between 7.15am and 8.30am.",
        "9am - Congregation to be seated inside the Abbey.9.30-10.45am - Heads of state, overseas government representatives, Government ministers, First Ministers, former PMs, foreign royals and members of the royal family arrive.9.45am - The Sovereign's Escort of the Household Cavalry begin to gather ready for the procession from Buckingham Palace.10.20am - The King and Queen Consort's procession sets off from the Palace.10.53am - The King and Queen Consort arrive at Westminster Abbey.11am - Charles and Camilla enter the Abbey through the Great West Door and the service begins.12pm - The King is crowned. The Archbishop of Canterbury places the St Edward's Crown on Charles's head. Trumpets will sound and gun salutes will be fired across the UK.1pm - The service ends and the newly crowned King and Queen begin their coronation procession.1.33pm - Charles and Camilla are expected to enter Buckingham Palace through the Centre Arch.1.45pm - The King and Queen Consort receive a royal salute from the military in the Palace gardensAround 2.15pm - Members of the royal family appear on the Palace balcony to watch the flypast.",
        "Heads of state, overseas government representatives, Government ministers, first ministers, former PMs, foreign royals and members of the royal family will arrive between 9.30am and 10.45am.Despite his attempts to 'slim down' the occasion, the guestlist for the Coronation of King Charles III at Westminster Abbey on May 6 is believed to be around 2,000-people strong.The list - as of very recently - includes Prince Harry, who will be flying in from Montecito, California, leaving behind his wife Meghan Markle and their two children Archie and Lilibet.",
        "Some of those expected to be among the 2,300 guests include US first lady Jill Biden, French president Emmanuel Macron, Chinese vice-president Han Zheng, Sinn Fein's leader in Northern Ireland Michelle O'Neill, Australian prime minister Anthony Albanese and Pakistani prime minister Shehbaz Sharif.Prime Minister Rishi Sunak and all his living predecessors are expected to be there alongside Cabinet ministers and leader of the Opposition Sir Keir Starmer.Others expected to be in the congregation are TV presenters Anthony McPartlin and Declan Donnelly, British Vogue editor-in-chief Edward Enninful and singer-songwriter Lionel Richie.The King and Queen Consort's procession will set off from Buckingham Palace at 10.20am and arrive at Westminster Abbey at 10.53am.",
        "Charles and Camilla will receive a royal salute from the military in the palace gardens at 1.45pm.",
        "Roadworks on major roads across England have been lifted and train services will be beefed up to cope with demand. People arriving in the capital tomorrow are being urged to consider walking to viewing areas as public transport will be very busy.Road closures will be enforced in large parts of central London, affecting motorists and bus users.National Highways has lifted more than 700 miles of roadworks on England's motorways and major A roads ahead of the weekend, meaning 96 per cent of its network is fully open. These include routes which will be used by thousands of people driving to London for the coronation.Eleven miles of roadworks were lifted on the M1 around Hemel Hempstead and Dunstable, and 12.5 miles of works were removed from the M11 around Cambridge and Harlow.The cones will not be put back until after Monday.Some train operators will run additional services and longer trains.Great Western Railway has added extra services to London Paddington from major stations in South Wales, south-west England and the Thames Valley area on Saturday morning.Southeastern will run additional trains between Dartford and London Charing Cross, and longer trains on the Maidstone East Line and between London Victoria and Gillingham.Govia Thameslink Railway - which operates Gatwick Express, Great Northern, Southern and Thameslink - said some of its services will have more carriages than normal.Transport for London (TfL) advised people to 'avoid driving in central London if you possibly can', and 'if you travel into London by national rail, consider walking to the viewing areas if you are able to'.It warned that safety measures on London Underground such as queuing, closures, trains not stopping or changes to the way people enter or leave stations 'are likely to be necessary, especially in central London' on Saturday.Some Tube stations are expected to be 'very busy', including Westminster, Green Park, Charing Cross, Embankment, Victoria, Hyde Park Corner, Knightsbridge, Leicester Square, Piccadilly Circus, Temple and Marble Arch.St James's Park station will be closed and Hyde Park Corner station will be exit-only until the crowds disperse.",
        "The service will begin at 11am and last for two hours, with the key moment coming at midday when the King is crowned.The Archbishop of Canterbury will place the St Edward's Crown on Charles's head. Trumpets will sound and gun salutes will be fired across the UK.The service will include the first Homage of the People - a modern addition to the ancient ceremony that will see people across the UK and overseas realms invited to swear an oath of allegiance to Charles.When the service ends, the newly crowned King and Queen will embark on their coronation procession back to Buckingham Palace in the Gold State Coach via the tried and tested route of Parliament Square, along Whitehall, around Trafalgar Square, through Admiralty Arch and down The Mall, arriving back at Buckingham Palace at 1.33pm.The King's Coronation Procession stretches to just 1.3 miles - around a quarter of the length of the late Queen's five-mile celebratory journey.Thousands of members of the armed forces will take part on the day of the coronation - the largest military ceremonial operation for 70 years - staging gun salutes and a flypast, and parading in the processions.This will be followed by a balcony moment when the couple will be joined by other members of the royal family to watch a flypast at around 2.15pm.Aircraft involved in the coronation flypast will jet over large parts of eastern and southern England, giving millions of people the chance to view them. More than 60 aircraft from the Royal Navy, British Army and Royal Air Force - including the Red Arrows - are scheduled to fly over Buckingham Palace.But many people outside London will be able to see them as they fly to and from the capital.The exact routes of the aircraft are not being published in advance for security reasons.But airspace restrictions relating to the flypast have been announced, revealing the areas being flown over.The restrictions have been split into eight zones, each with a specific time slot to prevent the aircraft being disrupted by other pilots.However, Royal Air Force (RAF) Air Chief Marshal Sir Michael Wigston has said 'it's 50/50' as to whether the flypast will go ahead due to the poor weather forecast, and the final decision will be made just one or two hours before it is due to start.Forecasters expect conditions in London to be cloudy and wet today, which could hamper the ability of pilots to fly safely.The King and Queen Consort are due to appear on the palace balcony with other members of the royal family to watch the six-minute flypast.",
        "For those who do not plan on venturing out for the celebrations, they can watch it all on television from the comfort of their sofa.",
        "Kirsty Young and Huw Edwards are among the BBC's presenting team and the coronation programme, which will cover the lead-up to the Westminster Abbey service, the ceremony, the return procession to Buckingham Palace and the King's balcony appearance, will see former Desert Island Discs presenter Young in a studio at Buckingham Palace on the day.Edwards will provide commentary as the Westminster Abbey doors open to greet those arriving for the ceremony.Meanwhile Sophie Raworth, Clare Balding, Anita Rani and JJ Chalmers will also be contributing to the day's coverage.ITV News At Ten anchor Tom Bradby, a close friend of the Duke of Sussex, will front ITV's coverage alongside Julie Etchingham.Presenters Mary Nightingale, Nina Hossain, Charlene White and James Mates will also be stationed at key locations during the six hour-plus broadcast.Coronation fever has already taken a hold across the country as large crowds have gathered on the procession route near Buckingham Palace.Security has been on high-alert for days after a suspected knifeman sparked a scare by allegedly throwing shotgun cartridges outside the palace earlier this week. Royal enthusiasts who have been staying along the Mall for days, politely allowed police to search through their tents and suitcases this afternoon.",
        "Several days before Coronation Day, a sea of tents appeared on the Mall and with just one night left to wait, the royalists they still said they 'wouldn't want to be anywhere else'.Patriotic campers swathed in Union Flags and stocked up with food, booze and bunting, many of whom also camped out for the Queen's funeral in September, are settled in for Saturday.Yesterday the King, 74, the Princess of Wales, 41, and the Prince of Wales, 40, made a surprise appearance on the Mall to greet well-wishers less than 24 hours before the coronation.People cheered and could be heard shouting 'God Save the King' as the senior figures of the monarchy arrived to shake hands with well-wishers. The King went to one side of The Mall while William and Kate went to another to greet well-wishers. One woman told Charles 'Love you Charlie' while others passed on their congratulations to him.Meanwhile, alongside Kate, a beaming William posed for selfies with the adoring crowd.Joan, 70, has been camping out since Wednesday and burst into tears after shaking King Charles' hand, she said: 'Charles stepped out of the car and walked towards us and he said has anybody over nighted and he was shaking a few hands.'I said yes I did and he looked and he could see that my hair is really sticking up, and yes I am sleeping one the pavement, he leaned forward purposefully and shook my hand.",
        "'It was just so beautiful, I am proud of being here today. I burst into tears afterwards.'I have been here for William’s wedding, Harry’s wedding, the jubilee and now I’ve come for the coronation. I wish himself and Camilla the very best. I think they’re both good people.' On the route to Buckingham Palace yesterday, MailOnline met people from all over the UK and across the globe, including the United States, Canada and Commonwealth nations.Many are sleeping in tents – one man has had two stolen already – but some are just sleeping on the floor. With rain and thunder forecast in the coming days, many are likely to get very wet but vowed not to let Britain's spring weather dampen their spirits."
    ]
}