{
    "articleURL": "/femail/article-12056993/How-new-SPFs-fight-wrinkles-fronts-HANNAH-BETTS-Better-not-younger.html",
    "content": [
        "UK beauty expert Hannah Betts explains which SPFs help keep wrinkles at bay READ MORE: Revealed, the sun creams that WON'T protect youIf you hold any regard for your skin whatsoever, then you — like me — will have merrily been sporting SPF50 all winter. However, the emergence of the spring-into-summer sun does rather focus the mind.",
        "Happily, we are spoilt for choice these days when it comes to brilliant, competitively priced facial sunscreens from the likes of Vichy, La Roche-Posay, L'Oréal and CeraVe.The one I'll rely on this summer is Garnier Ambre Solaire Anti-Age Super UV Protection Cream SPF50 (£9.99, superdrug.com). It's a complete cracker: nourishing, yet light in feel, it takes foundation beautifully, won't irritate your eyes and is cherished by all skin types.That said, as someone committed to wearing a full face of slap daily, I love a high SPF with still more magic. I don't just want to be protected to the max — I crave added value by way of priming, a supernatural gleam, being mistaken for 30 and the like.All of which means that — taking perfume and foundation out of the equation — my greatest beauty extravagance is an SPF wardrobe, which allows me to pick and choose my factor 50s according to mood and desired effect. As addictions go, it's fairly benign, and healthier than my former obsession with the perfect martini.",
        "If I want to feel fabulous, I'll opt for a ritzy beauty big-hitter. La Mer's The SPF 50 UV Protecting Fluid (£95, cremedelamer.co.uk) is bliss — more akin to a lavish treat than a defensive barrier.",
        "Another feels-like-skin cream joy is Guerlain's Abeille Royale UV Skin Defence SPF50 (£70, guerlain.com).Chanel has just launched its revamped Chanel UV Essentiel Complete Protection SPF50 (£48, chanel.com). It has a less fluid, more gel-like texture than the previous incarnation. It's also less luminously lustrous, a shame for me as I used to buy its predecessor in bulk so I could use it as a pre-base illuminator. Still, most people don't actually crave an Elizabeth I-style pearly sheen and will be delighted.There is a family of Factor 50 primers for those occasions when one's slap must be both perfectly on point and last an age. Bobbi Brown's Primer Plus Protection SPF50 (now £22.40, bobbibrown.co.uk) is as business-like as one would expect in this department, not least in warm weather. Charlotte Tilbury Invisible UV Flawless Poreless Primer (£40, charlottetilbury.com) is rightly adored by make-up fanatics.Tilbury worked with the best Asian labs to come up with a Factor 50 that primes, blurs, firms and hydrates, while also working as the most beautiful base.If you're looking for a High Street homage, seek out E.L.F. Suntouchable! Whoa Glow SPF30 (£13.99, superdrug.com). It boasts a similar moist peachiness and some of the same complexion boosters (hyaluronic acid and aloe) — although don't forget it's just a Factor 30.",
        "Then, there are the high SPF gleam-givers. Hello Sunday The Illuminating One Glow Primer SPF50 (now £17.60, boots.com) contains shimmering micro particles to impart a pinky pearlescent glow, plus plushness via vitamin C and hyaluronic acid.In contrast, Saltee's ultra-light City Serum SPF50 (now £28.50, sephora.co.uk) is ultra-sheer, yet creates fresh-faced radiance.The award-winning Supergoop! Glowscreen SPF30 (from £17, cultbeauty.co.uk) is the dewier, juicier version of the cult suncare specialist's celebrated Supergoop! Unseen Sunscreen SPF30 (from £17), which bestows more of a velvety matte effect. Glowscreen lives up to its name by creating a supple, bouncy, radiant finish that gleams with health.For shiny-skinned women who read all this talk of gleam with horror, there is the new Supergoop! Mineral Mattescreen (£34) offering a mousse-like texture with an impressive, zinc-powered sebum-controlling — thus grease-eliminating — formula. At the same time, it blurs pores for a smoother-looking complexion.My oily-skinned friend is a devotee of Paula's Choice Super-Light Daily Wrinkle Defense SPF30 (£37, paulaschoice.co.uk).However, she has recently had her head turned by French favourite Typology SPF 50 Face Sunscreen with Hyaluronic Acid + Aloe Vera (£31.50, uk.typology.com). More than 80 per cent naturally derived (quite the coup when it comes to sunscreen), it claims to be 'texture optimised to resist temperature variations throughout the summer' and delivers.",
        "Believe it or not, this isn't even the end of my Factor 50 wardrobe, but I'll stop there and save my favourite all-rounders for when it really hots up!SPRING HAIR FLAIR  Aveda Nutriplenish Replenishing Overnight Serum  Aveda Nutriplenish Replenishing Overnight Serum (£42, aveda.co.uk)A naturallyderived overnight hair replenisher, great on curls and coils £42.00 Shop  Arkive The Veil Hairspray  Arkive The Veil Hairspray (now £8.67, boots.com) Lightweight in feel but heavyweight in maintaining style, the brand's signature baobab oil lends lovely shine. £8.67 Shop  Philip Kingsley Bluebell Woods Elasticizer Therapies Deep Conditioning Treatment  Philip Kingsley Bluebell Woods Elasticizer Therapies Deep Conditioning Treatment (£38, philipkingsley.co.uk)A fragrant, limitededition update on Audrey Hepburn's beloved hair mask. £38.00 Shop  Bumble and bumble Seaweed Air Dry Cream  Bumble and bumble Seaweed Air Dry Cream (£27, bumbleandbumble.co.uk)A leave-in, frizzreducing kelp conditioner for low-key health and hold. £27.00 Shop  Charles Worthington Sunshine Protect UV Protection Leave-In Spray  Charles Worthington Sunshine Protect UV Protection Leave-In Spray (£2.99, boots.com)A UV shield rich in smoothing active ingredients to make you ready for the year's first heatwave. £2.99 ShopMY ICON OF THE WEEK NICOLE KIDMAN ",
        "The star, who will be 55 in June, credits U.S. hit Seratopical Revolution DNA Complex for her Met Gala girlish look. Make-up artist Angela Levin used Chanel cosmetics to complement Nicole's frock, including Chanel N°1 de Chanel Revitalizing Foundation (£57, chanel.com) and Chanel N°1 de Chanel Lip And Cheek Balm in Healthy Pink (£38).RACE YOU TO IT!   Product title The Women's Balance blend is Neal's Yard's bestselling aroma blend, meaning there is terrific excitement over its new Women's Balance Balm (£32, nealsyardremedies.com).Earthily soothing yet uplifting with sweet almond oil, macadamia oil and beeswax, it reduces stretch marks and improves firmness and elasticity. £32.00 Shop",
        "COSMETIC CRAVING   Chanel Le Vernis Immortelle 135 and Chanel Le Vernis Ovni 129  If the sheer talon trend has failed to beguile you and you continue to crave colour, Chanel is relaunching its nail range. This is thrilling news because the house basically invented the cult nail colour — from Uma Thurman gothing it up in Rouge Noir in Pulp Fiction back in 1994, to the edgy putty Particulière that caused such a sensation in spring 2010.Both shades feature in the new line-up. However, this season's modish hues are Chanel Le Vernis Immortelle 135, a moody lilac suiting cool-skinned types, and Chanel Le Vernis Ovni 129, a pale primrose which is great for warmer skin tones (£29 each, chanel.com). Both are pure spring chic. £29.00 each Shop"
    ]
}