{
    "articleURL": "/wires/reuters/article-12057991/Motor-racing-Verstappen-leads-rampaging-Red-Bulls-one-two-finish-Miami.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 7 (Reuters) - Max Verstappen won the Miami Grand Prix from ninth on the starting grid with a masterful display of tyre management on Sunday to extend his Formula One championship lead over Red Bull team mate Sergio Perez.Red Bull's fourth one-two finish in five races dealt a blow to Mexican Perez's hopes of wresting the overall lead from the double world champion in Miami after securing pole position on Saturday.Aston Martin's Fernando Alonso finished a distant third, for the fourth time this season, after starting on the front row.Verstappen, six points clear of Perez at the start of the day, is now 14 ahead of him in the championship standings, on 119. Alonso is third on 75.It was Verstappen's 38th career win tying him with Sebastian Vettel for most victories for Red Bull.\"To be honest with you today, I think with the pace he (Verstappen) had it wouldn't have mattered if he'd started on the soft, the medium or the hard tyre,\" offered Red Bull team principal Christian Horner. \"It made it an interesting race because he had to manage that tyre early on but his pace as it has been all weekend has been just outstanding.\"Verstappen, winner of last year's inaugural Miami Grand Prix, suffered a setback in qualifying when Ferrari's Charles Leclerc crashed and denied the Dutchman a final flying lap that almost certainly would have put him on pole after he dominated the practice sessions.",
        "But he was immediately on the charge, moving up into fourth after 10 laps.Alonso had predicted that Verstappen would be filling his mirrors after 25 laps.That guess proved wildly wrong as Verstappen blitzed past Alonso's Aston Martin on the 15th to once again leave the fight for top spot on the podium between the two Red Bulls.Perez was the first to pit, allowing Verstappen to put in an extended run at the front before finally stopping for new tyres with just 11 laps to go and handing back the lead briefly to his Mexican team mate.On fresher rubber, Verstappen was immediately on the prowl and two laps later he was in front of Perez.From there it was business as usual, with the two Red Bulls easing through the final laps unchallenged for another one-two result.\"Once we pitted I had the fresher tyres to the end,\" said Verstappen, who completed a superb day by also clocking the day's fastest lap. \"Then I had good battle with Checo.\"We were free to race and we had a good go at it but of course most importantly we don't touch but that all worked out really well.\"Mercedes team principal Toto Wolff, who on Saturday criticised the German outfit's car as \"a nasty piece of work\", was surely better pleased with the cars' performance on Sunday, with George Russell finishing fourth and seven-times world champion Lewis Hamilton coming from 13th to grab sixth.",
        "Ferrari's Carlos Sainz was fifth, between the two Britons, while Leclerc was seventh in the other Ferrari.Logan Sargeant, the only American on the grid, started last and found himself dropping further back after an early incident brought the Williams rookie into the pits for a new front wing. He finished last.It was also a disappointing day for Haas, the only U.S.-bankrolled outfit, with Kevin Magnussen finishing 10th and Nico Hulkenberg 15th.Red Bull now lead the constructors' championship with 224 points with Aston Martin second on 102 and Mercedes third on 96.There was just enough action on the 3.36-mile (5.41-km) temporary street circuit around Hard Rock Stadium to keep fans happy and quieten some of the criticism that Formula One was getting boring.But as the circuit heads back to Europe for three grand prix in Imola, Monaco and Spain, the Red Bulls remain in a league of their own and Formula One is sure to face more talk of boring racing.At the next race in two weeks in Imola many teams are expected to introduce upgrades to their cars but Verstappen is not expecting much to change.\"I think we have a decent advantage especially in the race,\" said Verstappen. \"I think over one lap at some tracks some cars will definitely be close or in front but that race pace advantage is quite big at the moment.",
        "\"It is not like the others are bringing new bits and we are standing still so hopefully we can keep it going like we are going now.\" (Reporting by Steve Keating; Editing by Clare Fallon and Christopher Cushing)"
    ]
}