{
    "articleURL": "/wires/pa/article-12061407/Thousands-companies-facing-failure-without-new-energy-contracts-FSB-warns.html",
    "content": [
        "More than one in 10 small companies signed up to a fixed-price energy deal during peak prices last summer leaving them with bills well ahead of what the market is offering today, an influential group has said.",
        "The Federation of Small Businesses said that around 93,000 small companies now say they might be forced to close down, downsize their business or radically restructure, and called on some of them to be given new contracts.Last year, when prices were at their highest, companies were encouraged by the Government to sign up to fixed-term energy deals which locked in the price of the day for a year or more.This was designed to allow businesses to benefit from the Government’s energy support scheme, which significantly cut bills for these companies. The least energy suppliers should do is to allow small businesses who signed up to fixed tariffs last year to ‘blend and extend’ their energy contracts, so that their bills are closer to current market rates  Tina McKenzie, FSB  But that support was abolished after six months and replaced by a different, much less generous programme.This has saddled some companies with bills they simply cannot pay. These firms should be given new options, the FSB said.",
        "The FSB said it thinks around 13% of its members fixed their energy bills in the second half of last year, around one in 10 of these now think they might have to close or otherwise change their business.The FSB said that energy suppliers should allow these companies to extend their fixed contracts, but at a lower rate, somewhere between their original price and the lower current market price.",
        "FSB policy chair Tina McKenzie said: “Many small businesses agreed to lock in energy contracts last year to ensure they qualified for the maximum level of Government support.“Now, with that support largely disappearing, they are once again faced with massive energy bill hikes as rates go back to pre-Energy Bill Relief Scheme level.“If ending the successful support scheme is on the basis that wholesale energy prices have gone down, then our research sheds light on just how many small businesses have been overlooked as they are entangled in high fixed tariffs.She added: “The least energy suppliers should do is to allow small businesses who signed up to fixed tariffs last year to ‘blend and extend’ their energy contracts, so that their bills are closer to current market rates. We’d also like to see the Government and Ofgem support this initiative.“There are signs that small businesses may be about to turn a corner after last year’s downturn. Giving small firms a way out of last year’s market peak rates will accelerate the progress to recovery.”"
    ]
}