{
    "articleURL": "/money/markets/article-12047475/MARKET-REPORT-Trainline-returns-profit-despite-railway-strikes.html",
    "content": [
        "Train and coach ticketing app Trainline overcame rail strikes as it made bumper sales and swung back into profit.",
        "It handled sales of £4.3billion in the year to the end of February – up 72 per cent on the previous 12 months and 16 per cent above the same period before the pandemic struck.This helped its own revenues rise 74 per cent year-on-year to £327million.Trainline also swung back into a profit of £22million, having made a loss of £15.5million a year earlier.Its UK business reported higher sales following a surge in shorter distance and commuter travel alongside increased use of etickets. But ",
        "it remained weighed down by rail strikes, which were estimated to have hit ticket sales by £5million to £6million a day.They are set to wreak further havoc, with strikes targeting the FA Cup final, the Epsom Derby and the Eurovision Song Contest in Liverpool.Business boomed elsewhere, with ticket sales in Spain and Italy sharply ahead of pre-pandemic levels. Jody Ford, the chief executive, said it sold around 200m train tickets across Europe last year as it looks to increase investment in the continent.The industry took a significant hit during the pandemic, as commuters had to work from home.But in a sign of its continued recovery, Trainline expects revenue to grow between 13 per cent and 22 per cent for the year to the end of February 2024.",
        "That means it should beat the 14 per cent revenue growth pencilled in by analysts. Shares soared 13 per cent, or 31p, to 270p.The FTSE 100 fell 1.1 per cent, or 85.73 points, to 7702.64 and the FTSE 250 was down 0.6 per cent, or 120.69 points, to 19,244.91. ",
        "Mothercare has entered talks with its lenders to renegotiate or refinance its debts in the face of higher interest rates.The baby goods retailer, which has a £12.3million debt pile, said that the interest rate on the loan now stands at around 18.2 per cent.Together with a delay in returning to pre-pandemic sales levels, particularly in the Middle East, its finances are now stretched.Shares plunged 22.4 per cent, or 1.97p, to 6.83p.",
        "Hargreaves Lansdown was among the top blue-chip risers after Britain’s biggest investment firm posted higher revenues and net inflows.Its revenues of £188.1million in the three months to the end of March were 28 per cent higher than the same period a year ago and above the £178million expected.Assets under administration rose 4 per cent to £132billion, and the shares rose 1.1 per cent, or 8.6p, to 800.4p.Liontrust Asset Management is to buy Swiss fund manager GAM for £96million. The deal, expected to be completed between October and December, will create a global fund manager with £53billionn in assets under management and administration. ",
        "The stock fell 7.5 per cent, or 64.5p, to 801.5p.Three mid-cap firms were at the centre of an investor backlash concerning fat cat pay at their annual general meetings.Hammerson, the owner of the Bullring shopping centre in Birmingham, saw 39 per cent of participating shareholders reject its pay report for 2022. There were also revolts on the re-election of five directors as shares fell 2.5 per cent, or 0.7p, to 26.92p.Spirent Communications, which tests 5G mobile and wifi networks, saw nearly a third of shareholders who took part in the vote reject its pay policy. Proxy adviser Institutional Shareholder Services said little explanation was given as to why the base salary of chief executive Eric Updyke has been hiked by 15 per cent for 2023.The company reported a 20 per cent fall in revenue for the first three months of the year, compared to the same period in 2022. And it launched a share buyback programme for up to £56million. Spirent rose 0.8 per cent, or 1.4p, to 178.4p.There was a slightly smaller rebellion at Morgan Sindall.The construction group’s pay policy passed as 22 per cent of participating shareholders voted against the resolution.The firm said its workload rose 4 per cent to £8.8billion in the three months to the end of March, compared with the previous quarter. Shares rose 4.1 per cent, or 70p, to 1764p.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}