{
    "articleURL": "/tvshowbiz/article-12048697/Jessica-Biel-cuts-casual-figure-does-little-retail-therapy-L-s-Melrose-Avenue.html",
    "content": [
        "Jessica Biel was spotted out shopping on Los Angeles' Melrose Avenue with a friend on Wednesday.",
        "The Candy star, 41 wore a pair of light wash, boyfriend cut jeans with a cropped black top and a slightly darker wash denim jacket.The 7th Heaven alum carried a black crossbody handbag and slipped some white trainers onto her feet.The mom of two - who had lunch as celeb hot spot the San Vicente Bungalows on Tuesday - had her long, thick, brunette locks pulled into a sleek high ponytail. The Sinner actress layered several delicate necklaces on her neck, wore a bracelet on one wrist and sunglasses on her face.",
        "The shopping outing comes a handful of days after Jessica had a mini 7th Heaven reunion at L.A.'s Sofi Stadium for the Monster Jam.Jessica reunited with Beverley Mitchell, 42. The two actresses played sisters Mary and Lucy Camden on the CW drama.They met up with friends including Sarah Michelle Gellar, 46, and Nikki DeLoach, 43. Mitchell snapped a photo of the 90s television stars and posted it to her Instagram.'The 90's but now mom edition!' Mitchell, 42, wrote Sunday on Instagram with a photo of the three women in a luxury suite. 'So fun hanging out as badass moms at @monsterjam Mom points for the win!!! @sarahmgellar @jessicabiel I love you always and forever! Such a fun night!'",
        "'Thank you @marquecomm for giving us cool points!' she added.The Buffy the Vampire star took to the comments to add: 'The best.'",
        "Jessica is mom to sons Silas, 8, and Phineas, 2, with her husband Justin Timberlake, 42. Mitchell is mom to three kids - Mayzel, 10, Hutton, 8, and Kenzie, 2, with husband Michael Cameron.Meanwhile, Gellar shares Charlotte, 13, and Rocky, 10, with her husband Freddie Prinze, Jr., 47. DeLoach shared a photo from the event of herself with Mitchell and Monster Truck racer Cynthia Gauthier. 'Cheering you on!,' she captioned the post and tagged the racer."
    ]
}