{
    "articleURL": "/news/article-12044787/Piano-scam-woman-posing-bereaved-widow-fools-Hush-charity-founder-Victoria.html",
    "content": [
        "Scammers target hospital charity'Widow' wanted to donate piano They wanted $800 'delivery fee' Cruel scammers posing as a widow have targeted a charity after promising to provide a grand piano for a hospital, before demanding an upfront $800 'delivery fee'.",
        "Professor Catherine Crock, who chairs the Hush Foundation in Melbourne, Victoria, got an email from a woman called 'Veronica' earlier this year who claimed she wanted to donate the piano.The Hush Foundation brings music and arts into Victorian hospitals, and hoped to give the instrument to a health facility at Box Hill, in the city's east.The scammer claimed her husband had died and she wanted to donate his 'beautiful' grand piano to the charity. Ms Crock told 3AW she was thrilled with the offer, and staff started clearing a space in the foyer for the instrument's arrival. ",
        "The charity even organised a concert with a composer to come and play the piano at the hospital for patients and staff.But when she tried to sort its delivery, the scammer put her in touch with a man named 'Fidel' from a logistics company - who she was told had the piano in storage. 'So I start dealing with them and we've had months of emails back and forth, this is quite an elaborate scam where they keep you going until they try and get you to pay for the delivery,' Ms Crock said. The scammers then demanded the hospital pay an upfront delivery fee of $800. After Ms Crock told them it was impossible to pay the money the criminals said the hospital could pay half the amount. ",
        "But as she tried to organise to go pick the piano up herself, her son pointed out the scammer's email didn't look genuine. After doing a quick look on the internet she found the 'piano scam' was rampant across the world.'I feel a bit foolish for not picking it up sooner but I had Googled the company that they are using the name of, and that exists and they do move things around the world,' Ms Crock said. ",
        "'These scammers are persistent because this has gone on for three months.'Ms Crock said she was guttered by the fraud as her organisation is working hard to help patients by bringing music into hospitals. It has given pianos to facilities at Monash, Albury-Wodonga and a women's mental health unit in a bid to reduce anxiety and stress for patients as well as visitors and staff.After the professor's story was aired, a string of callers inundated the radio station to offer their pianos to the charity. One of the callers, Jenny, who had many surgeries done at Box Hill, hospital offered her piano that had been in her family for years. Ms Crock said the news of people donating their pianos had made her day because they can play a huge role in lifting people's spirits in hospitals. ",
        "'Hush Foundation would like to have pianos across Australia in all hospitals, aged care and other health settings,' she said. A charity spokeswoman said the organisation was overwhelmed over the good will of listeners who tuned into the story on Thursday.  'The community who, on listening this morning, are donating several pianos for us to distribute to hospitals. The kindness of our community is outstanding,' she said. "
    ]
}