{
    "articleURL": "/wires/aap/article-12056083/Vixens-knock-Fever-thrilling-finish.html",
    "content": [
        "Kiera Austin has drilled a two-point Super shot on the final siren to hand Melbourne Vixens a pulsating 74-73 victory over West Coast Fever, giving co-captain Kate Moloney a 150th Super Netball appearance to remember.",
        "After suffering a gut-wrenching one-goal loss to the Fever in the opening round of the season, the Vixens returned the favour at John Cain Arena on Sunday to record back-to-back home wins and remain firmly entrenched in the top four.The defending champions looked destined to break Melbourne's hearts again when Sasha Glasgow collected a rebound from a Jhaniele Fowler miss and sank a two-point shot to put her side ahead 73-72 lead with 30 seconds to play.But Austin saved the day by scrambling to keep Melbourne's final possession alive when a loose pass appeared to be headed out of bounds, then coolly slotting the game-winner as time expired to trigger wild celebrations for the home side.The victory sees the Vixens consolidate third spot on the ladder and snap a run of three straight losses to the Fever.\"This competition is so close and every game counts so much. The Fever are the benchmark of this competition and we knew we were going to have to bring it today, I'm just so proud of the fight in every single one of these girls,\" said Moloney.West Coast overcame an early five-goal deficit thanks to Glasgow's deadly shooting from two-point range, the 24-year-old shooter finishing with eight Super shots for the match, while Fowler connected on two Super shots in the final quarter to keep the Fever in front.",
        "Mwai Kumwenda hit timely two-pointers at the close of the second and third quarters for the Vixens before Austin won the match with her first successful Super shot attempt of the game.Melbourne grabbed the early advantage thanks to intercepts from Kate Eddy and Liv Lewis but saw their five-goal advantage disappear when strong defensive work from Courtney Bruce allowed Glasgow to connect on back-to-back Super shots.Leading 18-16 after one quarter, the Vixens continued to pressure the Fever into errors in the second term with Moloney swooping on an errant Fowler pass to put the home side back on top by four goals.But Glasgow's long-range shooting helped negate Melbourne's additional time in possession as West Coast cut the margin to 37-35 by halftime.The Fever scored five of the first six goals of the third quarter to hit the front for the first time in the match but Kumwenda's late two-pointer trimmed the visitors' lead to one heading into the pivotal final quarter.The result saw the Fever concede top spot on the ladder to the resurgent Adelaide Thunderbirds."
    ]
}