{
    "articleURL": "/wires/aap/article-12058319/Conditions-good-business-risks-brewing.html",
    "content": [
        "Economic storm clouds have the private sector nervous but conditions for doing business do not yet reflect this heightened concern.",
        "Business conditions are still robust, as measured in NAB's monthly survey, but are gradually losing steam.The conditions gauge, which includes trading conditions, profitability and employment, fell two points to 14 index points in April.NAB chief economist Alan Oster said the survey pointed to ongoing resilience in the economy despite higher inflation and interest rates.\"Demand is still very strong, as demonstrated by elevated trading conditions, and employment is also holding up, reflecting the strength of the labour market,\" Mr Oster said.\"We continue to expect consumption growth to slow as the effect of higher rates further impacts households, but how quickly and how sharply this occurs remains uncertain.\"Confidence among the business community, which is also measured in the survey, remains depressed but has stabilised - picking up one point to 0 index points.\"A zero reading for confidence in the survey indicates that an equal share of firms are optimistic as pessimistic, which highlights how the outlook is finely balanced,\" Mr Oster said.The survey pointed to mixed price and cost growth indicators, with purchase cost growth picking up and labour costs remaining elevated but overall price growth weakening.ANZ economists Madeline Dunk, Catherine Birch and Adelaide Timbrell said the price signals aligned with other evidence of inflation that's cooling but was still too high for the Reserve Bank to comfortably bring back within the two-three target band.",
        "\"We think stickiness in services and non-tradables inflation will prompt the RBA to lift the cash rate a final 25 basis points to 4.1 per cent in August,\" they wrote in a report.Separately, higher interest rates continue to keep building approvals in the doldrums.New data from the Australian Bureau of Statistics showed building approvals staying relatively flat in March, dipping 0.1 per cent.Sign-off on private sector houses were the chief driver of the lower March result, falling 2.8 per cent over the month after an 11.3 per cent lift in February.Higher density approvals lifted 5.6 per cent over the month but over the course of 2023, have recorded their lowest levels since 2012.While the index has been swinging around over the past few months, new home building is clearly subdued.Housing Industry Association senior economist Tom Devitt said surging population growth and disappointing approvals numbers would deepen the housing affordability crisis.\"The adverse impact of last year's cash rate increases is still to fully flow through to the official data,\" he added, suggesting approvals may decline further."
    ]
}