{
    "articleURL": "/wires/ap/article-12058019/Aussie-Slingsby-beats-Kiwi-rival-Burling-1M-SailGP-final.html",
    "content": [
        "Tom Slingsby of Team Australia held on through a few tense moments after his catamaran fell off its foils and then prevailed over rival Peter Burling of New Zealand in a short dash to the finish to claim his third straight $1 million, winner-take-all SailGP season championship Sunday on San Francisco Bay.",
        "Slingsby, who has dominated tech tycoon Larry Ellison's global league since it debuted in 2019, dodged what could have been a huge embarrassment when he recovered and kept his 50-foot Flying Roo - nicknamed for the giant yellow kangaroo on the wingsail - ahead of Burling for the thrilling victory.British star Sir Ben Ainslie finished a distant third in the Grand Final.\"That was not the plan. I thought we lost it,\" a relieved Slingsby said right after the race. \"We had it the whole way. That was crazy. I was very scared. I was thinking this could be the biggest choke of all time right now, but fortunately we were able to get it over the line. What a race.\"Slingsby and his four-man, one-woman crew celebrated by spraying each other with Champagne and unfurling an Australian flag.A few minutes earlier, it looked as though they might have been left devastated.",
        "Slingsby led at every mark after pushing the British back during the pre-start and then forcing the Kiwis wide at the first mark. The Aussies had a lead of about 100 meters approaching the fifth mark but came off their foils after a tack and slowed considerably, allowing the Kiwis to close within 30 meters. Slingsby crossed just ahead of Burling and then tacked.",
        "He stayed barely ahead into controlling position rounding the mark and then sped across the short reach to the finish.\"We had such a comfortable lead and then I decided that I wanted to sort of shut the race down a bit and do extra maneuvers to make sure they don't get different wind,\" Slingsby said. \"In the end, they didn't really get different wind but they were tacking in better positions and they were able to foil out of the tacks a bit better than we were. We were tacking in less wind and they just kept gaining, kept gaining and fortunately we did the tack just enough room in the last move and were able to hold on to the finish.\"Slingsby is an Olympic gold medalist and was crewmates with Ainslie on the Ellison-owned Oracle Team USA that successfully defended the America's Cup in 2013 with a stunning comeback against Emirates Team New Zealand on the same waters they sailed on Sunday. Ainslie is the most-decorated Olympic sailor of all time, with four gold medals and one silver. Burling is the two-time reigning America's Cup champion helmsman who has won one gold and two silver Olympic medals.Slingsby's crew is full of America's Cup and Olympic veterans.\"The fact that we got the job done today is a huge testament to these people,\" he said. \"I´m so thankful to have such an amazing team. Our run is going to come to an end eventually, but we just want to extend it for as long as we can.\""
    ]
}