{
    "articleURL": "/health/article-12037971/Woman-discovers-mark-thought-birthmark-cancer.html",
    "content": [
        "Ilia Smith, 42, of Dallas, Texas, said she thought her spot was a birthmark In 2020 she learned that it was actually melanoma and had to get it removedREAD MORE: Doctors warn of unexpected places where skin cancer can emerge A woman was shocked to learn a spot on her hip she thought was a birthmark was a deadly cancer.",
        "Ilia Smith, 42, from Dallas, Texas, did not think much of the black mark until it began to itch and bleed in 2020. After getting it examined by a doctor, she learned it was 2b melanoma — a form of the most dangerous type of skin cancer.Ms Smith's friend pointed out the mark to her in 2009, worrying it was cancerous, but she believed that because she was African-America, her risk was minimal.Only one in every 100,000 black people develop skin cancer — compared to 30 per 100,000 white people. This is because of the protection that comes with extra melanin, the pigment that gives darker skin its color.",
        "Ms Smith, who works as a nurse, says she now takes caution when heading into the sun. 'That was my thing. I just loved being out in the sun and getting that vitamin D and that relaxation with my headphones,' Ms Smith told TODAY.In late 2020, the spot became itchy. One day, Ms Smith scratched the spot and a part of it broke off and she began bleeding.She remembered a warning she received from her friend Tracee Blackburn over a decade ago.Ms Blackburn had a background in dermatology and pointed out to Ms Smith that the mole looked dangerous.",
        "Doctors warn people should be aware of the other locations the disease can form.",
        "The nurse wrote off the warning, though. She had always believed it was an innocuous birthmark. Bleeding from the mark worried her and she chose to get it checked out by a doctor.A biopsy, a test where a small piece of tissue is examined in the lab, was performed and the woman was diagnosed with stage 2 melanoma.In total, there are around 5.4 million skin cancer cases in the US each year, with the disease killing 9,500 people. These cases often develop in existing moles. White people, the elderly and those that do not use sunscreen are at most risk — because of their weaker immune system and lighter pigment.Melanoma accounts for around 8,000 of these deaths each year despite making up just 90,000 cases.The cancer forms when melanocytes in the skin begin to grow out of control, creating a tumor that can disrupt bodily functions.This often occurs as a result of excess UV radiation from the sun damaging the DNA of melanocytes — opening the door for a cancerous mutation.If caught early, the cancer is relatively harmless and can quickly be removed.But melanoma can spread if left undetected. Cancerous cells can find their way into the bloodstream and embed themselves in other parts of the body.",
        "When this occurs, the cancer will begin to spread to other parts of the body — called metastasis. At this point, removing the cancer surgically is a challenge. A person will instead be subject to treatment such as chemotherapy, which comes with severe side-effects. ",
        "Luckily for Ms Smith, her cancer had not spread. She required surgery to remove a piece of skin 3 centimeters in size and 1.5 inches deep, ridding her of the disease.She required plastic surgery to repair the removed skin. But, she will now live the rest of her having to take caution in the sun as she is at an increased risk of the disease returning, according to the American Cancer Society.Ms Smith says she now gets checked for spots and other signs of skin cancer four times per year.She wears SPF 50 sunscreen and protective clothing whenever she goes on her regular runs.On top of sunscreen, she also wears a hat and sunglasses when at the pool. Now, she wants others to take some of the same steps to make sure they avoid a similar run-in with cancer. “Look at yourself. Make sure those little moles or birthmarks or freckles are not changing because those are the things that you want to watch out for,' Ms Smith said."
    ]
}