{
    "articleURL": "/tvshowbiz/article-12049631/Blackpinks-Jennie-Kim-flaunts-cleavage-racy-Calvin-Klein-campaign.html",
    "content": [
        "K-pop fans have followed Jennie Kim as a member of South Korean girl group BLACKPINK for years.",
        "But the 27-year-old showed fans a completely different side of herself by stripping down to promote her new capsule collection with Calvin Klein.In sizzling photos, the songstress flaunts her cleavage and slender curves in a skimpy bra and panties set.In one racy image, Jennie stares suggestively at the camera while tugging on the side of her underwear.The Solo singer has been the face of Calvin Klein for years, but this is the first time she's designed her own collection for the popular brand.",
        "'This collection reflects my everyday style and is based on many of the Calvin Klein essentials that have become staples in my wardrobe,' she said in a statement.'I wanted to bring a personal touch to these pieces, which you’ll see reflected in the fit, the color palette and the details. My aspiration for this collection is that everyone will feel as happy and confident in these pieces as I do.'Calvin Klein's global marketing chief Jonathan Bottomley added: 'Having worked with Jennie on several campaigns, we know firsthand that she is a cultural powerhouse. Her persona, talent and distinctive style have a major global impact.'Jennie's racy campaign has shocked some of her longtime fans on social media.'I'm opening Twitter in public and it’s full of Jennie's Calvin Klein pictures so they’re probably thinking I like seeing naked girls or something,' wrote one.",
        "'Jennie is so beautiful that trolls had to resort to calling her pictures Photoshopped,' tweeted another. ",
        "Last month, Jennie's group BLACKPINK made history by becoming the first ever South Korean act to headline the Coachella music festival.The reaction from fans in the crowd and on social media was wildly enthusiastic after the South Korean girl group took the stage.BLACKPINK holds the title of the most-subscribed act on YouTube, with over 82 million subscribers, and has won two MTV Video Music AwardsDuring their six-year career, they have released two studio albums. Their first release, The Album, was released in 2020 and reached number two on the UK album charts.",
        "Their follow-up album, Born Pink, was released in 2022 and topped the UK charts.They have collaborated with several global superstars, including Lady Gaga, Selena Gomez, and Dua Lipa.The group is currently on the road for their 2022/2023 Born Pink tour and added four stadium shows to their list of upcoming North American tour dates: East Rutherford, New Jersey’s MetLife Stadium (Aug. 12), Las Vegas’ Allegiant Stadium (Aug. 18), San Francisco’s Oracle Park (Aug. 22) and Los Angeles’ Dodger Stadium (Aug. 26)."
    ]
}