{
    "articleURL": "/wires/ap/article-12039121/Another-Met-Gala-books-did-theme.html",
    "content": [
        "NEW YORK (AP) - In vintage couture and a world of Chanel-inspired camellias. In pearls, chains and black ties, especially those worn by women, the A-list crowd at the Met Gala largely passed muster in embracing Karl Lagerfeld, the man of the evening on fashion´s biggest night.",
        "Most. Not all. Over-the-top dressing on the first Monday in May isn't dead. Misinterpreting or outright ignoring the night's dress code isn't buried. But this time around, there was an air of respect, a nod to authenticity \"in honor of Karl,\" as the fundraising party's visionary, Anna Wintour, requested.\"Because the theme was so specific, it practically demanded elegance, which is why so many looked so good. But what was most surprising was to see how other designers paid homage to the master with riffs on his iconic trademarks,\" said Hal Rubenstein, a fashion writer, designer and one of the founding editors of InStyle magazine.Lagerfeld, the man, the photographer, the publisher, the designer for hire at Chanel, Fendi, Chloé and more, died in February 2019 after 65 years in fashion. Few designers have made the deep cultural impact he did, especially within the confines of carrying on historic heritage legacies.He was \"about elegance and craftsmanship, a total 180 from the Hollywood parade the Met Ball had become in the last few years,\" Rubenstein said.And Lagerfeld did it in his own unique uniform: white powdered low ponytail, skinny black pants and jackets, black fingerless gloves, high crisp white collars and black ties. And dark glasses. Always dark glasses.",
        "Other critics and fashion insiders agreed with Rubenstein. Let´s not forget the muddled gala theme \"Punk: Chaos to Couture\" in 2013 with a fashion vibe that managed to offend actual punks, or the two galas last year and the year before that honored American fashion with a slew of guests dressed by European and other non-American brands.",
        "But some fashion watchers weren't altogether bothered by this year's stunts, many aimed at Lagerfeld's beloved cat, Choupette.Jared Leto was a furry human (sweaty) Choupette in a Disney-worthy costume. Doja Cat was an actual cat, thanks to facial prosthetics. Lil Nas X was, well, Lil Nas X, slathered in silver paint wearing a chunky pearl and jeweled cat face mask, thong and boots - and nothing else, thanks to makeup legend Pat McGrath and Dior Men.And some fans of the celebrities lucky enough to score invitations this year were often delighted, regardless. The \"Last of Us\" star Pedro Pascal sent his stans into a Valentino frenzy with his black short-shorts, high socks, fire engine red shirt and long matching overcoat. He got Lagerfeld's signature black tie and combat boots right.\"In general, celebrities and designers adhered pretty religiously to the theme, much more than in recent years, sticking closely to the designer´s unwavering vision and signature design codes - tweed, black and white, ribbons, brides, rosettes, cats, suits,\" said Madeline Hirsch, news director for InStyle and Byrdie.There was much to play with, she said.\"He had a distinct vision and particular love for all things `fancy´ - and it was fun to see what everyone could do in a black and white color palette,\" Hirsch said.",
        "Cassidy Zachary, a fashion historian and host of the podcast \"Dressed: The History of Fashion,\" put it this way:\"While most guests were on theme, I would overall label this year´s red carpet as beautiful but boring. Karl had such an extensive and expansive design vocabulary to pull from and the breadth of his work was overwhelmingly absent. Most guests fell into a Karl Lagerfeld trope trap, largely defined by Chanel and Chanel aesthetics: black and white, camellias, boucle and pearls.\"Chanel is not only a fashion house where Lagerfeld worked for 36 years, but was a sponsor of this year's Met Gala. Lagerfeld's contributions to fashion history and the modern fashion lexicon, Zachary said, were so much more, though she had some notable exceptions to her criticism.One of the highlights of the night was Nicole Kidman, Zachary said, a vision in the pale pink befeathered and bejeweled gown she wore in the 2004 Baz Luhrmann-directed Chanel No. 5 fashion short film. At 180 seconds, it cost $33 million to make, she said.There were other elegant vintage wins that fueled the Chanel engine: Penélope Cruz in an archival look from the spring 1998 haute couture collection and Jennie Kim in a vintage look from fall 1990.The gala, which raised $17.4 million last year for the Metropolitan Museum of Art's Costume Institute, is driven by the museum's spring exhibition each year, this time around called \"Karl Lagerfeld: A Line of Beauty.\"",
        "As the show, sure to be a blockbuster, attests, Lagerfeld´s design lexicon extended well beyond his tenure at Chanel. Yet his years at Jean Patou, Balmain and Chloé were barely there or absent on the museum's Grand Staircase.The gala carpet, Zachary said, would have been more colorful and lively had more guests looked to Lagerfeld's years at Chloé, where he worked from 1963 to 1983, and again from 1992 to 1997.\"His work for Chloé was decidedly more playful, whimsical and surrealist than his work at Chanel, as most famously embodied by his 1983 shower dress and his 1984 violin dress, which was reissued by Chloé in 2013,\" she said.Zachary was pleased to see all three on the carpet, worn by Vanessa Kirby, Margaret Zhang and Olivia Wilde, respectively.Rubenstein lauded others who went directly to Lagerfeld-related sources: Kidman and Penélope Cruz in vintage Chanel, along with Naomi Campbell's goddess pink Chanel look from 2010 and Cara Delevingne in a shirt dress from Lagerfeld's eponymous brand.And he was impressed by the Lagerfeld symbols and silhouettes embodied by Vera Wang for Lily Collins, Loewe for Karlie Kloss, Gucci for Julia Garner and Thom Browne for Jenna Ortega. Still, he said, there were moments that might have made Lagerfeld clench.",
        "\"I don´t think anyone was out to make a mockery of the night. No one came to be disrespectful. But there were those who evidently didn´t make the attempt to honor the designer´s parameters,\" Rubenstein said. \"Lagerfeld clothes were never overtly sexy. He rarely showed plunging necklines, backless dresses, lots of midriff or skirts slit to the hip. So those who did show up blatantly showing off with swaths of exposed skin, like Mary J Blige, Jennifer Lopez and Lil Nas X looked awkwardly out of place.\"Zachary, too, sees designers who did well by Lagerfeld, blending the honoree's aesthetic with their own. Anne Hathaway is the shining star of that moment, she said, in custom Versace with founder Gianni's famous safety pins in a Chanel boucle.Sergio Hudson's form-fitting pink boucle stunner worn by Kiki Palmer honored both Josephine Baker and Lagerfeld's work in the 1950s, Zachary said. Less subtle was Wang's massive ballgown for Collins with \"Karl\" emblazoned across the train.If Collins was less subtle, Jeremy Pope was a bullhorn in a 32-foot cape with a black-and-white Lagerfeld portrait, thanks to Balmain's Olivier Rousteing.William Middleton, who wrote this year's biography \"Paradise Now: The Extraordinary Life of Karl Lagerfeld,\" sees deeper connections to his subject than meet the eye.",
        "Kidman's dress, for instance: \"One of the fittings for this dress, in London at the Dorchester Hotel, was one of the few times in Karl´s life that he showed up on time.\"Take the note Rihanna and A$ap Rocky (who were 90 minutes late). \"She wore a spectacular evening gown by Pier Paolo Piccioli, who had worked with Karl at Fendi, fusing his Valentino aesthetic with Karl´s, particularly with the oversized camellias,\" Middleton said. \"And he was wearing a kilt-like skirt with a black jacket, by Gucci, like Karl had worn in Tokyo in 2004.\"Fans who raved on social media clearly considered the couple worth waiting for.___Find Leanne Italie on Twitter at http://twitter.com/litalie"
    ]
}