{
    "articleURL": "/wires/aap/article-12058609/Ice-cold-Whaitiri-leaves-NZ-PM-Hipkins-read.html",
    "content": [
        "Five days after New Zealand MP Meka Whaitiri's shock defection, Prime Minister Chris Hipkins has still not roused her into a conversation.",
        "The Ikaroa-Rawhiti MP stunned Mr Hipkins - and Kiwi politics - last week by leaving her post as customs minister to align herself with the far-left opposition Maori Party.Adding to the feeling of shock and betrayal among Labour ranks, Ms Whaitiri announced her decision to quit the government while Mr Hipkins was on a plane to the King's Coronation.Returning to Wellington on Monday, Mr Hipkins said he had stopped trying to get in touch with his former MP.\"I left her several messages while I was in London,\" Mr Hipkins said.\"The time has passed really in the sense that she's made and announced her decision.\"Whilst I regret that and I'm disappointed by that, ultimately, it's happened now.\"I'm not sure that there would be a lot to be gained from a conversation between the two of us.\"Mr Hipkins was forced into a light reshuffle by Ms Whaitiri's departure, promoting Canterbury-based MP Jo Luxton into the outer ministry with the vacated customs portfolio.Peeni Henare has taken veterans, while Rachel Brooking is now food safety minister.While Labour has picked up the pieces, people in the party - as well as Kiwi voters - are still waiting to learn why Ms Whaitiri defected.The 58-year-old gave a short, emotional speech at a marae in Hastings last Wednesday when she said she had been \"called home\", referring to her departure as an \"emancipation\".",
        "She has not responded to requests from journalists or Labour colleagues since.Her invoking of slavery has rankled many in Labour, especially given in this term it has promoted more Maori to ministries (eight) and into cabinet (six) than ever before.Labour's Maori caucus chair Willie Jackson told TVNZ he suspected Ms Whaitiri had wanted a promotion.\"We know why she left even though it hasn't been made clear ... it's obvious that she probably wanted to be promoted into cabinet and she's a very, very capable minister,\" he said.Mr Jackson said he had told Mr Hipkins and the Labour caucus he felt some responsibility for her departure, saying he didn't check in with her after she was passed over for promotion.A second MP left their political home last week, with Greens health spokeswoman Elizabeth Kerekere resigning after bullying allegations forced an inquiry into her conduct.Ms Kerekere has become an independent MP."
    ]
}