{
    "articleURL": "/wires/pa/article-12052711/Jurgen-Klopp-Liverpool-not-prepared-pay-odds-new-players.html",
    "content": [
        "Liverpool manager Jurgen Klopp insists the club will not be held to ransom over transfer targets and are not prepared to pay over-inflated prices.",
        "The club have already pulled out of the running for their primary option Jude Bellingham with Borussia Dortmund likely to ask for a fee around £130million.With a midfield rebuild required it was decided to spread their limited resources wider rather than going for a megabucks marquee signing, with Brighton’s Alexis Mac Allister near the top of their alternatives.Liverpool’s issues in midfield could lead to selling clubs upping the price knowing the rival’s need to sign players and, more specifically, secure them early in the summer.",
        "But Klopp said they were not prepared to pay over the odds and have a list of targets which he feels provides the club with options if they should encounter a stumbling block in negotiations.“We cannot buy the player then. If they are overpriced we cannot do it,” he said.“I am pretty sure we will bring in the players we want and those who will help us. I am pretty confident of that.“You never know 100 per cent until they are signed but that (bumping up prices) is not new that some clubs might try that.“Let me say it like this: you identify a position and you have not only one option on the position. That means they should all be good.",
        "“You might have a favourite but if the other club doesn’t want to sell or someone else will pay the price then we cannot go with it.“But usually we got the players we wanted. The one thing is can we afford them and then they are here.”Liverpool’s five-match winning run, lifting them to within four points of fourth-placed Manchester United but with only an outside chance of making the top four because their rivals have played two matches fewer, has put a better spin on a season which had the club lingering between eighth and 10th for long periods.Klopp knows he cannot “replace the whole team” with his summer transfers but does not believe their final league position will have much effect on the success of the business he does, although he thinks it may be of assistance to the players he currently has.“Each performance we have now helps us and helps the players,” he added.“We cannot replace the whole team. How I understand life is if you have a problem you sort it better now because if you just move on you have the same problem. You might have a favourite but if the other club doesn’t want to sell or someone else will pay the price then we cannot go with it  Liverpool manager Jurgen Klopp on transfers  ",
        "“We have to give the boys a frame where they can perform because I see them every day, I know they want to perform.“It is not that they say ‘I cannot do that anymore’. We were not able to do it that is true for a long period, but we will find a frame where the boys can shine again.“Everything we do well now will help us for next season. These five games I liked the reaction in moments, it is not full games, but the signs I saw are really promising and I am happy with that.“Another four games, a break, then a proper pre-season and we will be strong.”"
    ]
}