{
    "articleURL": "/sport/football/article-12041663/Embarrassing-Pierre-Emerick-Aubameyang-not-wear-Chelsea-shirt-says-Craig-Burley.html",
    "content": [
        "Striker Pierre-Emerick Aubameyang managed just nine touches against Arsenal  He was booed whenever he touched the ball by the fans form his former clubChelsea are eyeing a summer swoop for Crystal Palace forward Wilfried Zaha Pierre-Emerick Aubameyang's below par performance on Tuesday night against Arsenal has drawn the irate eye of former Chelsea star Craig Burley. ",
        "The Blues were handed a further blow in what has been a nightmare season by their bitter rivals, who inflicted a 3-1 defeat over them at the Emirates. Martin Odegaard struck twice before a third from Gabriel Jesus put the hosts 3-0 before half-time, and although Noni Madueke pulled one back in the second half, Frank Lampard's side suffered a 14th loss of the campaign. Aubameyang was making his return to the club were he was once captain, but failed to have the desired impact on the game in what was a largely anonymous performance for Chelsea. And Burley believes that his showing should mark the end of his career in west London, and claimed that he should not even be allowed back to the club's training ground.  ",
        "'Pierre-Emerick Aubameyang should not wear a Chelsea shirt again, he should not even be allowed to the training ground,' Burley began'It wasn't [about a lack of] service — he walked around for 45 minutes. It's embarrassing.'Quite frankly, if I'm on the bench and I'm not playing because of Pierre-Emerick Aubameyang, what is that telling me?'I'm thinking about a different sport. He doesn't care, he's a liability. It's embarrassing.'Aubameyang was hooked at half-time against his former club, where he scored 92 goals in 163 games between 2018 and 2022. ",
        "At the Emirates the Gabonese striker managed just nine touches of the ball, with four of those coming from kick-offs in his first Chelsea start this year.And when he did get his foot on the ball, he was treated to a hostile welcome of boos from the fans of a club he left in acrimonious circumstances after falling out with Mikel Arteta. He managed just one touch in the opponent's box on Tuesday night, failing to win a single duel in the air or on the ground as Chelsea struggled to threaten in the opening salvo. ",
        "Aubameyang's return to the Premier League has been notorious for his lack of goals, after a spell at Barcelona following his Arsenal departure. In 21 games for the Stamford Bridge outlet, he has managed just three goals and an assist in all competitions, as the Blues continue to struggle in front of goal. Despite being one of the only recognised centre forwards at the club, he has often been overlooked in the starting XI, with Thomas Tuchel, Graham Potter and Lampard regularly preferring attacking midfielder Kai Havertz.Lampard has now lost all six of his games in charge at Stamford Bridge having taken on the role of interim boss until the end of the season, with the Blues just nine points above relegation with four games to play. "
    ]
}