{
    "articleURL": "/sport/football/article-12051555/GRAEME-SOUNESS-Liverpool-boss-Jurgen-Klopp-sore-loser-aggression-NOT-good-look.html",
    "content": [
        "It's good Sam Allardyce is self-confident but there's a reason he has Leeds jobThe former England boss was mainly appointed due to Roy Hodgson's successBelow, Mail Sport columnist Graeme Souness also has his say on Jurgen Klopp I have no problem with Sam Allardyce saying he is as good as Pep Guardiola and Jurgen Klopp, even though a lot of the footballing world would disagree. But the single biggest reason he was offered the Leeds job? That is Roy Hodgson.",
        "It is not because of what Sam did two years ago at West Bromwich Albion, who were relegated from the Premier League. It is because Leeds have looked at the impact Roy has made at Crystal Palace and it has served as an advert for older, British managers.That is not to say I disagree with Sam's appointment. I wrote in this column in February that Leeds should go for someone like him or Harry Redknapp. It makes sense. He knows the demands of the Premier League and the players he'll be working with.But these owners are often swayed by what is happening elsewhere. Leeds' last three coaches have been Marcelo Bielsa, Jesse Marsch and Javi Gracia, all very different to Sam.Roy, though, has gone in at Palace and all of a sudden it looks like they've got an extra yard. They're winning games and are now safe. Sam, as well as Dean Smith at Leicester, have profited from that.",
        "Sam feels he should have had one of the big club jobs earlier in his career. It's tremendous to have that confidence. People will laugh at his comments, but that's Sam, that's his personality. He rates himself. There is nothing wrong with that belief.We'll never know if he could have achieved what Guardiola and Klopp have done. He didn't get one of those jobs and it won't happen now. But I don't go along with the idea of a prejudice against British managers.",
        "Sam says he has been perceived incorrectly as a long-ball merchant. In his time at Bolton, though, I believe the priority was to get the ball forward as quickly as they could. I also recall one night at the Reebok when Jay-Jay Okocha, their most creative player, was running back and forth across the pitch taking long throw-ins. His arms and shoulders must have been sore the next morning. When within range, he'd hurl balls into the box for Kevin Davies to create chaos. It was frustrating because it slowed everything down. It was direct, but it got results.What he has to do now is work out a way to nick some points with the players he has been given. He doesn't have enough time to impose any style of play. Leeds might not even need another point, or one win could be enough. If that is the case, I think it will still go down to the wire. They're at Manchester City on Saturday and at home to Newcastle next Saturday. Anything from those two is a bonus. After that it's West Ham away, who may still need something to be safe. Spurs at a noisy Elland Road is their best hope for victory — but that's the last day of the season. ",
        "It feels like they're going to need results elsewhere to go their way, and that could happen, because none of the teams down there look particularly capable of saving themselves. Either way, it's a no-lose situation for Sam. I don't think he'll be criticised if they go down. He has four matches and they've taken one point from their last five.He has the chance to be a hero and, if they do stay up, he'll probably get a two-year contract. For Leeds, it's a wise move in their situation. If only they'd taken that decision in February when I first suggested it.Klopp's a sore loser and that aggression is not a good lookWhat Jurgen Klopp did on Sunday, by running up to the fourth official and getting in his face, overstepped the mark. I have been a manager and I know there have been times when I was embarrassed by my actions. When you're that aggressive towards an official, it is not a good look. It is not an argument you're going to win and it will end up getting you in trouble, like Klopp has.I have sat behind Liverpool's dugout in an empty stadium, the game at home to Chelsea when they won the league three years ago. I learnt that night that their bench is up for an argument, and it's not just Klopp, they're all at it. They're very confrontational.",
        "I later read Mark Clattenburg's autobiography and I recall him saying that Klopp was the worst of all the managers when it came to being a sore loser. That is what we are seeing.When you're a manager, you're two different people. If Liverpool are having a great season and Klopp's team are playing really well, that incident with the official doesn't happen.Last week against Spurs captured their season in 90 minutes — the good and bad. That frustration has shown itself in a negative way for Klopp, and he'll know that. He will try to make sure it won't happen again, but you can't guarantee it.He's a passionate man and Liverpool will have to improve on the field before he is happy and feeling calmer within himself.",
        "I celebrate my 70th birthday on Saturday. Would you believe, there are still nights when I dream I am a footballer. I occasionally have to apologise for kicking my wife when I'm asleep! It happens once a month, when I wake up and, for a nano-second, I think I'm going to training.What does this tell me? I'm still in love with the game. I always will be. It is why me leaving Sky Sports this week is not the end of anything. It is just the start of a new chapter. I've not hung up my boots and I'm very much open for business.",
        "I really enjoy doing this column and I have always worked on the premise, 'If you don't use it, you'll lose it'. I like to feel I'm still taking part in the game of life. It's a good thing that you get out of your comfort zone on a regular basis, and I'll never allow myself to get cosy.But I have to say, the messages I have had this week have really surprised me, in the nicest possible way. Football guys and ex-players who aren't necessarily friends have gone out of their way to get my number. That means a lot.I look back on my Sky years as just fantastic. I was getting my football fix by going to great stadiums, seeing great games and enjoying great atmospheres. Once off air, I could go home and sleep at night. It was all the good bits from football without the bad bits.I realised after leaving Newcastle in 2006 that management was no longer for me, because of my type of personality. I couldn't let things go if I thought someone was not giving me everything. People will say I was too confrontational, and I'll accept that criticism. That was the way I learned my football from true greats of the game.",
        "The likes of Jock Stein, Bob Paisley, Joe Fagan, Ronnie Moran, Jack Charlton and Sir Alex Ferguson. I went to football's equivalent of Cambridge and Oxford. But that doesn't work anymore. You have to be a diplomat more than I could ever hope to be in my lifetime. I've had to apply the same discipline to my media work, although sometimes you end up being a tad aggressive in making your point. I must apologise if I ever went too far!",
        "Other than Manchester City, the one place you don't want to go needing a result right now is Newcastle.Arsenal will find that out on Sunday and this a real test of their ability to stay in the title race. Their last away game, at City, they were beaten up. They were lucky not to concede seven.They were better in midweek at home to Chelsea, but the visitors were woeful. Newcastle will be the opposite of that.I hear their fans are planning another display with their flags and scarves. It looks like a special place to be playing your football. I have managed there. On the occasions we got it going, St James' Park really is unique. For me, it is right up there with Anfield."
    ]
}