{
    "articleURL": "/news/article-12040953/This-week-royal-history-Births-Princess-Charlotte-Sarah-Chatto-Queen-Victorias-son.html",
    "content": [
        "Princess Charlotte was born at St Mary's Hospital in Paddington on May 2, 2015Princess Margaret's daughter Lady Sarah Chatto arrived on May 1, 1964This week in royal history saw the births of two royal princesses and the third son of Queen Victoria. ",
        "On May 2, 2015, Prince William's daughter Princess Charlotte arrived into the world at St Mary's Hospital in Paddington.Her birth came 51 years and a day after Princess Margaret's daughter Lady Sarah Chatto was born at Kensington Palace in 1964.And on May 1, 1850, Prince Arthur, the Duke of Connaught, the seventh of Queen Victoria's ninth children, was born at Buckingham Palace. On May 2, 1969, the majestic QE2 ocean liner embarked on its maiden voyage to New York, after being launched by the Queen at Southampton two years earlier. Birth of Princess Charlotte - May 2, 2015 ",
        "When she was born, Princess Charlotte, the second child and only daughter of the Prince and Princess of Wales, weight 8lb 3oz.Thanks to the Succession to the Crown Act 2013, Charlotte became the first British princess not to be overtaken in the line of succession by her younger brother Prince Louis, when he was born in 2018. The Princess's full name, Charlotte Elizabeth Diana, was a touching nod to both her grandfather, grandmother and great-grandmother.In line with royal tradition, Prince William and Kate showed off Charlotte to the world outside the Lindo Wing at St Mary's Hospital. A picture released to mark Charlotte's eighth birthday this week showed her cuddling up to the family dog, Orla.",
        "Whilst the Princess of Wales has taken many family photographs that have been shown to the public, this image captured by professional Millie Pilkington.",
        "Birth of Princess Margaret’s daughter, Lady Sarah Chatto - May 1, 1964When she was born at Kensington Palace on May 1, 1964, Lady Sarah was seventh in the line of succession.Weighing 6lb and 2oz, she was the first direct descendant of a sovereign in 145 years - since Queen Victoria's birth in 1819 - to have been born at Kensington Palace.Her father, Anthony Armstrong-Jones, was not present for the birth but arrived an hour afterwards. Beaming, he then told the press: 'She's a super baby'.Sarah was two-and-a-half years younger than her brother, David Armstrong-Jones.",
        "Her grandmothers - the Queen Mother and Lady Rosse - were among the first relatives to see her. Other family visitors included the Queen and Angus Ogilvy, the husband of Princess Alexandra, Margaret's cousin.Lady Sarah was the fourth royal baby of the year, after the births of the Queen's youngest son, Prince Edward, Princess Alexandra's son James, and the Duchess of Kent's daughter Lady Helen Taylor.Lady Sarah, now 59, is not a working royal but is regularly seen at family events and is expected to be at the King's Coronation on Saturday. ",
        "Birth of Prince Arthur, Queen Victoria's third son - May 1, 1850Queen Victoria's seventh child and third son, Prince Arthur, was born on May 1, 1850.Her Majesty wrote in her journal: 'The child is dear, dearer than any of the others put together, the dearest and most precious object to me on earth.' Prince Arthur, the Duke of Connaught, went on to marry Princess Luise Margarete of Prussia. They had three children together.",
        "In 1911, Arthur was appointed the Governor-General of Canada, the first member of the Royal Family to hold the position. The move was made in the hope of strengthening links between the monarchy and Canada.He retired from public life in 1928 but retained an interest in military matters until his death aged 91 in January 1942, after the Second World War had been raging for more than two years.  ",
        "Japan's Naruhito ascends the throne after abdication of his father Akihito - May 1, 2019On May 1, 2019, Japan's Emperor Naruhito ascended the throne after the abdication of his father, Akihito.Akihito's decision to give up his crown was put down to his advancing years and failing health.The former emperor, now 89, is still seen in public with his wife, Michiko, and wider family. In 1953, when he was Japan's Crown Prince, Akihito - then aged just 19 - was among the foreign guests at the Queen's Coronation.",
        "The current emperor studied English at Oxford University. During his time in the UK, Naruhito went on a jaunt to the Scottish Highlands to search for the Loch Ness monster and climb Ben Nevis, the UK's highest mountain.He also had tea with the Queen and was shocked to discover that she poured her own tea and served the sandwiches herself. Naruhito and his wife Masako will not be at the Coronation but will be represented at the ceremony by Crown Prince Fumihito and his wife Princess Kiko. British liner Queen Elizabeth II leaves Southampton on maiden voyage to New York - May 2, 1969The Queen Elizabeth 2, better known simply as the QE2, embarked on its maiden voyage from Southampton to New York on May 2, 1969.",
        "The 70,000-tonne ship, which was the last of the great traditional ocean liners, took four days, 16 hours and 35 minutes to cross the Atlantic.",
        "King Charles I surrenders in Scotland - May 5, 1646 Act of Union joining Kingdoms of England and Scotland comes into force - May 1, 1707Birth of Catherine the Great - May 2, 1729King Edward VII of Great Britain visits Paris - May 1, 1903 Death of John Campbell, husband of Queen Victoria's daughter Princess Louise - May 2, 1914Hussein I installed as King of Jordan after regency period - May 2, 1953Faisal II installed as King of Iraq after regency period - May 2, 1953 ",
        "The 963ft long and 171ft high ship was the first British liner to offer ensuite facilities in every cabin and to site restaurants high up with panoramic views of the ocean.The vessel's maiden voyage came just over 18 months after it had been launched by the Queen in front of a crowd of 30,000 people at the Clyde shipyard in Scotland.",
        "She used the same pair of golden scissors that her mother had used to launch the Queen Elizabeth and her grandmother used to launch the Queen Mary.The naming of the ship proved controversial, with many Scottish nationalists upset that it paid homage to Her Majesty.The ship sailed 4,648,050 miles in her first three decades of service. She was said to get through 19 tons of lobster a year, along with more than 12,000 gallons of champagne and one ton of caviar. Each day, her passengers consumed 2,500 tea bags. Whenever she docked, 575lb of coffee and 15,000 cocktail stirrers were picked up.In 1982, the QE2 was used to carry 3,000 troops to the Falklands War. With them were 650 crew who had volunteered for the task.In 1995, the vessel was hit by a freak 95 wave caused by Hurricane Luis, an incident which damaged part of the superstructure.After she was retired in 2008, plans were announced to turn the ship into a floating hotel in Dubai.The project was completed in 2018. The vessel now boasts 447 rooms and suites, a gym and indoor pool, restaurants and a theatre. "
    ]
}