{
    "articleURL": "/news/article-12038277/Nine-ten-teachers-negative-view-Ofsted-following-Ruth-Perry-suicide-YouGov-poll-finds.html",
    "content": [
        "67% have a very unfavourable view and 23% have somewhat unfavourable view Ms Perry took her own life in January while awaiting the results of Ofsted report Nine in ten teachers have a 'negative' view of Ofsted following a backlash over the watchdog's role in the suicide of headteacher Ruth Perry, a new YouGov poll has found.",
        "Ms Perry took her own life in January while awaiting the results of an Ofsted report for the Caversham Primary School in Reading.The inspection, published in March, found Ms Perry's school to be 'good' in every category apart from leadership and management, where it was judged to be 'inadequate'. The results of a new YouGov Teacher Track survey of more than a thousand teachers show that 67 per cent have a very unfavourable view of the schools inspection body and 23 per cent hold a somewhat unfavourable view.The figures also show that 6 per cent have a somewhat favourable view and 1 per cent have a very favourable view.",
        "The Department for Education and education secretary Gillian Keegan are also highly unpopular, with 81 per cent and 69 per cent respectively holding a negative view of them.Last week, Ms Perry's sister said Ofsted inspectors should refuse to be complicit in the watchdog's 'reign of terror'. Professor Julia Waters is calling on Ofsted inspectors to 'hand in their badges', amid criticisms over the watchdog's single-word assessment.'Ruth was not an inadequate headteacher,' she said.'We had to speak out because we want no other family to experience the pain that we have felt.'We had to speak out because a terrible injustice has been done to my sister.'",
        "Professor Water's thoughts come as pressure mounts on the school watchdog, with campaigners suggesting its single-word rankings are 'too simplistic' and 'deeply harmful'.",
        "But Ofsted chief inspector Amanda Spielman has defended this system, arguing that it is easier for parents to understand.She also previously said that there was 'no reason to doubt' the assessment at Ms Perry's school and insisted that its findings were secure.Last Sunday, she told the BBC's Laura Kuenssberg On Sunday programme: 'I think the findings were secure and I think the inspection team worked with the professionalism and sensitivity that I would expect from our inspectors.'From what I've seen, I don't have any reason to doubt the inspection.'Inspection is a sensitive process. We are there looking for children, looking for whether education is right for children, looking at whether protecting children's welfare is happening the way it should.'Education secretary Gillian Keegan has also backed the one-word rating system to help inform parents' decisions.Last week, Professor Waters addressed hundreds of school leaders at the National Association of Head Teachers in Telford (NAHT), slamming its system as 'flawed' and inhumane'.'We all know parents deserve better than misleading, dangerous single-word judgments,' she said. 'So stop promoting them.'How many of you in this room serve as Ofsted inspectors as well as being headteachers?",
        "'No doubt you're doing your best, but you're working within a flawed, inhumane system.'So follow the examples of Martin Hanbury, Andrew Morrish, and others.'Hand in your badges. Refuse to be complicit in Ofsted's reign of terror.'NAHT will ask school leaders to stop working as Ofsted inspectors until a pay dispute with the Government is resolved.Delegates passed an emergency motion calling on the union's executive to reach out to members who serve as inspectors and request that they consider refraining from inspecting for a period.",
        "Professor Waters continued: 'Publicly my family has been offered condolences from the very same people who continue to defend the indefensible system that destroyed Ruth. 'We don't want warm words, thoughts and sympathies.'My family wants and deserves sincere answers to our legitimate questions and concerns.'My family wants and deserves urgent meaningful actions.'We're not placated with the few tweaks around the edges that have been offered so far.'She added: 'I call again on Ofsted and the Government to show some humanity and sensitivity, to recognise the urgency and the severity of our concerns.'If Ofsted and the Government continue to refuse to pause inspections, and certainly the optimal moment for doing that has passed, then I call on them to commission an urgent independent review of Ofsted's framework, systems and culture.'",
        "Delegates at the NAHT's conference observed a one-minute silence in memory of Ms Perry ahead of her sister's speech.Shadow education secretary Bridget Phillipson extended her 'personal condolences' to Ms Perry's family, friends and colleagues on Saturday.In a speech to school leaders at the conference, she said: 'Ruth was by so many accounts a passionate and hardworking headteacher, epitomising the dedication that you all show each and every day to give our children and young people the best start in life.'The weeks that have followed the public news of her death have seen an unprecedented light shone on the pressures school leaders, teachers and staff are facing.'You and your colleagues have made your voices heard loud and clear and Labour is listening.'Ms Phillipson added: 'The wellbeing of school staff must be a concern for everyone right across society, for all of you, for yourselves, for your colleagues, your peers and friends, for parents and also for children. For those who inspect schools, and of course for politicians, for ministers and for Government.'She said if the country does not take the wellbeing of teachers and school leaders seriously 'then we don't take our children's education seriously and we don't take our future seriously'.",
        "In March, the shadow education secretary set out plans by Labour to move away from the four headline grades that Ofsted awards to schools to a 'new report card' for parents.",
        "Ms Keegan said: 'My heart goes out to Ruth's family, friends, and school community.'Just as with schools, we expect Ofsted to make improvements where they can.'I know they're currently undergoing a review, including on how safeguarding is considered proportionally in overall school judgments.'I fully support our approach of providing a clear rating that parents can trust to inform their decisions. Ofsted has been central to our success in driving up school standards, with 88 per cent of our schools now rated good or outstanding, up from 68 per cent when this Government came into office.'An Ofsted spokesman said: 'Our inspections are first and foremost for children and their parents, looking in depth at the quality of education, behaviour, and how well and safely schools are run.'We always want inspections to be constructive and collaborative and in the vast majority of cases school leaders agree that they are.'For confidential support call the Samaritans on 116123 or go to samaritans.org. "
    ]
}