{
    "articleURL": "/sport/tennis/article-12042921/Emma-Raducanu-ruled-Wimbledon-French-Open-wrist-injury.html",
    "content": [
        "Emma Raducanu has been ruled out of both Wimbledon and the French Open The British tennis star has been forced to undergo surgery on both her hands She said it 'pained her' to miss out on the tournaments due to the wrist injury Emma Raducanu will miss the French Open and Wimbledon as she tries to finally resolve the wrist issues which have been troubling her since last year.",
        "The 2021 US Open champion has undergone what she described as minor surgery to shave off bone spurs on her wrists which are likely to have been the source of discomfort for the past eight months.She will also have a small procedure on her ankle in an attempt to solve the repeat problems which have dogged her since the extraordinary triumph in New York.It means she is certain not to be at the next two Grand Slams and probably September’s US Open, too, with an extended break from the game needed before she can be back on court.However, the 20 year-old from Kent has been assured that the problems are fixable, and that it ought not to be a long-term threat to her career.",
        "Raducanu has made no secret of the fact that she has been trying to manage the problem, and last week pulled out of the Madrid Open due to the related effects.‘It is safe to say the last ten months have been difficult as I dealt with a recurring injury on a bone of both hands,’ she said. ‘I tried my best to manage the pain and play through it for most of this year and end of last year by reducing practice load dramatically, missing weeks of training as well as cutting last season short to try to heal it. Unfortunately it is not enough. I’m having a minor procedure done on both hands to resolve the issues. ",
        "‘I am disappointed to share I will be out for the next few months and while I am at it I will have another minor procedure that is due on my ankle. 'It pains me that I will miss the summer events and I tried to downplay the issues so I thank all my fans who continued to support me when you did not know the facts. Looking forward to seeing you all back out there.’The hand injury goes back to late last summer, and caused an early end to her 2022 season. This year has not brought the prolonged spell of good health and momentum she was hoping for, although there have been more flashes of ability.",
        "It is safe to say the last ten months have been difficult as I dealt with a recurring injury on a bone of both hands. I tried my best to manage the pain and play through it for most of this year and end of last year by reducing practice load dramatically, missing weeks of training as well as cutting last season short to try to heal it. Unfortunately it is not enough. I’m having a minor procedure done on both hands to resolve the issues. I am disappointed to share I will be out for the next few months and while I am at it I will have another minor procedure that is due on my ankle. It pains me that I will miss the summer events and I tried to downplay the issues so I thank all my fans who continued to support me when you did not know the facts. Looking forward to seeing you all back out there.",
        "After a defeat at the Miami Open on March 22 she referred to her ongoing wrist troubles, saying: ‘We have been managing it, keeping on top of it. I'm able to play in the short-term.‘But the current solutions aren't very viable long-term. I'm doing the right things day to day, which brings me confidence. I feel like this year has been difficult in the sense that I have been managing a few existing injuries. That has been annoying and frustrating because I've been working as best as I can.’Raducanu has had ongoing treatment to keep it at bay and until last week was able to play sporadically, but it is known that the problem has been severely restricting the hours she can spend on the practice court.That in turn has made technical improvements in her game difficult, and next week will see her drop out the world’s top 100 after a season which has so far seen her play ten matches with an even split of victories and defeats.",
        "Anything to do with the wrist is a serious issue for any tennis player, but as with anything there are degrees of how bad it is.If, as well-placed sources maintain is the case, this is something known as a Carpal Boss then it should be at the less bleak end of the scale with the expectation of making a full recovery.",
        "It would require around three to four months of rehab before being able to hit again. That in itself would mean, realistically, that there would be no chance of a return until the autumn, and by then it might be tempting to focus more on a return for the start of 2024.Wrist injuries are not uncommon in tennis players and vary in their levels of seriousness. Juan Martin Del Potro, Laura Robson and Dominic Thiem have been among the sufferers, and Thiem, while playing, is finding himself on a long comeback trail to where he was in winning the 2020 US Open.Britain’s Liam Broady and young American star Sebastian Korda are among the more recently afflicted, but no two injuries are the same, especially in this part of the body."
    ]
}