{
    "articleURL": "/femail/real-life/article-12058509/Australian-mum-outraged-expensive-Kmart-delivery-fee-online-soft-play-set.html",
    "content": [
        "Mum outraged by hefty Kmart delivery fee She incurred a $91.38 charge on a $139 toySome said it was because the play set was bulky A mum was left in disbelief after she was quoted a $91 shipping fee on a popular $139 Kmart toy.",
        "The woman wanted to buy the soft play tunnel set which is only available on the Kmart website but was shocked when she saw the huge delivery fee.Items over $65 are usually delivered for free, adding to her frustration. 'Has anyone successfully bought the Soft Play Tunnel Set from Kmart? When I try it says it costs $91.38 shipping!' the mum wrote in a post to the Markdown Addicts Australia Facebook page. Shoppers were outraged by the hefty delivery charge and said they had been given even higher shipping fees. ",
        "'Delivery for this to me is $138, a $1 less the the actual product, so frustrating,' one woman said.  'We tried to get a bike delivered and it wanted $100,' another added. 'At that price you may as well buy a better set from Catch of the Day. Slightly pricier but free delivery and more for the money,' suggested a third.   '$52.70 to Port Melbourne, maybe it's based on how far I am from their warehouse,' a fourth guessed. Some pointed out bulky items can cost more to deliver and one said to try the Click and Collect if it's available. ",
        "'I had the same thing when purchasing their soft play mat, had to pay shipping despite it being part of a large order. To save money, try Click and Collect if there is a store close to you,' she said.",
        "'I believe you can potentially also get it delivered for Click and Collect to a Target if there's one close.'One group member said she had only incurred a $10 delivery fee for the grey version of the tunnel set while another said she had found the individual pieces stocked at her nearest Kmart. 'I wanted this set too but $52 delivery so I went to the store and got individual pieces but there weren't any tunnel pieces,' she explained. 'Our local Kmart did have some stackable/squishy cushion type things that are for similar play/making cubbies etc. But I doubt it'd have a slide attached,' another woman added.'They were sold in individual pieces and not bright colours. Might save the postage if you have a store nearby.'The mum pointed out the individual pieces available in store are 10cm shorter than the ones in the set she wanted to ordered. 'Stairs and triangle available in store are smaller at 21cm high, verse the set at 32cm high,' she said.  The Daily Mail Australia has contacted Kmart for comment. The Kmart website states large orders are subject to additional fees and bulky items are ineligible for free shipping as they cost carriers more to deliver. 'A large order is approximately the size of a bookshelf or storage unit. If your order is over this size, we add a cost per volumetric kilogram to our standard delivery fee,' the site reads. ",
        "'This cost is based on your location and varies from state to state, in line with our carrier fees. Large items, like outdoor play equipment, furniture, prams and bikes will likely incur additional fees.' "
    ]
}