{
    "articleURL": "/news/article-12040621/Lottery-winner-north-Melbourne-reveals-missed-European-Millions-prize.html",
    "content": [
        "Mystery man almost hung up on lotteryHe'd won third division prize worth $55kA lottery winner has revealed how he almost missed out on claiming his prize because he thought it was a scam.",
        "The north Melbourne man, 42, had won $55,564 in the third division jackpot of the European Millions draw last Wednesday.The Lottery office had tried to contact him by phone but the man almost didn't answer because he thought it was from con-artists. ",
        "He had to double-check his account before realising he had actually won. 'It was so unexpected, I thought someone had to be scamming me,' he said.'I logged into my account while on the phone to check if my \"My Draws\" had been updated and sure enough, it was real.''I couldn't believe my luck.' The punter said that he'd use the money to repay his wife back who had recently financed a major surgery that had put him out of work. He said that whatever is left over after the hospital bill had been paid off will be spent on his family.'I work in the hospitality industry but just had surgery so I'm at home recovering at the moment,' he said.'With this money, I'll be able to pay back my wife who paid for all my surgery.'My wife and I can't wait to celebrate with the rest of our family.'The man, who wishes to remain anonymous, said that he began playing international lotteries while in the US eight years ago. ",
        "The Lottery Office CEO Jaclyn Wood said that she was happy to see an Australian in need have their bills cleared.'It's fantastic to see a local cash in a life-changing prize from an international lottery and to be able to use the money to pay off surgery fees,' Ms Wood said. 'We feel privileged to have facilitated this win.' ",
        "Ms Wood said the benefit of selling international tickets meant that she could help people play for huge international prize pools from Australia.'The US Powerball, which is matched to our USA Power Lotto, holds the world record for the biggest prize ever at $2.9 billion while the largest ever Australian lotto payout was $160 million,' she said.The first division European Millions prize has yet to be won and is valued at about  AUD$261 million. "
    ]
}