{
    "articleURL": "/wires/reuters/article-12042815/Czech-rates-hold-central-bankers-hike.html",
    "content": [
        "Two-week repo rate stays at 7.00%, board vote 4-3",
        "Governor: market bets on timing of rate cuts prematureFiscal policy, wages were factors for those backing rate hike(Adds further quotes, details, market reaction)By Jan Lopatka and Robert MullerPRAGUE, May 3 (Reuters) - The Czech National Bank (CNB) came close to raising interest rates on Wednesday, with a slim majority backing continued policy stability while keeping an eye on inflation risks from loose fiscal policy and tight labour markets.The bank's board voted 4-3 to leave the main two-week repo rate at 7.00%, where it has sat since June 2022 following a year-long hiking cycle totalling 675 basis points. The minority voted for a 25 basis point increase.The bank, which voted 6-1 for stability in March, has kept the option of a rate hike on the table since it turned to steady policy when Governor Ales Michl took the helm in the middle of last year.Markets, though, have focused this year on the timing of future rate cuts, and the close vote on Wednesday caused short-term rates to jump. Pricing now sees some chance of a hike next meeting while maintaining the likelihood of 50 basis points cuts by year-end.The shift came after Michl, for a second meeting in a row, called market expectations on the timing of the first rate cut \"premature\" and said rates may not have peaked.",
        "He said the board would continue to debate stability or a hike, adding those who voted in favour of a rise were swayed by wage pressures and the government's loose fiscal policy, calling for a credible government reform package.The government is currently seeking agreement on budget-saving measures among its five coalition parties.\"If no long-term credible consolidation package is announced, then it will simply create pro-inflationary pressures in the future and we will probably have to raise interest rates,\" Michl said.\"We will proceed meeting to meeting, and will decide based on data... We are not considering at all lowering rates.\"Central European policymakers started tightening policy in 2021 to get ahead of price pressures from the end of COVID pandemic lockdowns and start of global supply snags. War in Ukraine has pushed up energy prices and food costs, adding to the surge.Inflation stood at 15.0% in March, just off a peak.** Click here for an interactive graphic:TIGHT LABOUR MARKETThe meeting came after data this week showed the Czech economy emerged from a mild recession in the first quarter.Industrial wages rose at a double-digit pace in the first two months of 2023, as the lowest unemployment rate in the European Union puts pressure on employers.",
        "The state budget deficit doubled year-on-year between January and April and has already hit two-thirds of the government's full-year target.The bank's new outlook forecast growth of 0.5% this year, after previously seeing a decline. The bank forecast average inflation at a rate of 11.2%, and it expects a strong crown, which hit a 15-year high of 23.233 to the euro last month.\"One of the reasons behind the current stance of the (central bank) may be the effort to support the crown, which may be crucial from (its) point of view,\" Erste Group Bank said.(Reporting by Jan Lopatka and Robert Muller; Writing by Jason Hovet; Editing by Christina Fincher and Jonathan Oatis)"
    ]
}