{
    "articleURL": "/news/article-12045473/Israeli-forces-kill-two-Palestinian-gunmen-shot-dead-British-mother-two-daughters.html",
    "content": [
        "British mother and her two daughters, 15 and 20, were killed in an attack in April A joint operation in the West Bank today killed those responsible for the attack A rabbi has praised Israel's security forces after they today shot dead three Palestinian militants wanted in connection with the killing of his British wife and two of their daughters last month.",
        "Prime Minister Benjamin Netanyahu declared 'we made the murderers pay' for the deaths of Lucy Dee, 45, and her daughters Maia, 20, and Rina, 15, who were killed when their car was attacked in West Bank near the settlement of Hamra.Rabbi Leo Dee, husband of Lucy, said his family were 'tremendously comforted' that the men had been 'apprehended and eliminated,' adding: 'Everybody in the Western World can sleep safer in their beds tonight.'After weeks of searching for the two men who fired on the family's car on April 7, Israeli forces stormed a safe house in the city of Nablus – 10 miles from Hamra – early this morning.In the rare daytime incursion, the Israeli army, police and Shin Bet security service exchanged gunfire with the suspects. Three men were killed and a number of assault rifles were recovered.",
        "In addition to the two men responsible for the attack, the third man killed in the fighting was alleged to have aided the gunmen.He was described as a senior operative who had assisted the other suspects.They have been named as Hassan Katan, Maad Mitzri and Ibrahim Hura, and were identified as the 'murderers of Leah, Maia and Rina Dee' in a statement from Shin Bet, which used the women's Hebrew names.'This morning we made the murderers of Lucy, Maia and Rina Dee, of blessed memory, pay,' Netanyahu said. He praised the efforts of forces who he said had 'settled accounts with the murderers'.",
        "Shin Bet said all three were members of the Palestinian Islamist armed group Hamas, which Hamas confirmed. The group described the killing of the three men as an 'assassination' of the 'heroes of resistance in the city of Nablus'.Speaking to Sky News, Rabbi Dee praised the Israeli security forces.'The Israeli army has done a tremendous kindness to the world by taking out two people who could theoretically go and bomb New York, London, Paris, Tel Aviv and kill many more innocent civilians,' he told the broadcaster.Asked how his family was coping after the attack, he said: 'The fact that it's now four of us, it was seven, is very poignant in this house.'",
        "The joint operation of military and police forces entered Nablus in the early morning and raided an apartment where the men were located.An AFP correspondent heard gunfire erupt near the Old City around 7am local time (4am GMT) as dozens of Israeli army vehicles swooped in.According to the Jerusalem Post, the IDF used an explosive drone in the raid.A fourth Palestinian bystander was also reportedly killed in the operation.In a statement, Shin Bet said: 'Following targeted intelligence from the Shin Bet, in the early morning the Shin Bet, IDF and IDF fighters raided the apartment and in the exchange of fire the two murderers were killed. ",
        "'In addition, Ibrahim Hura, a senior aide to the wanted men, was killed. Two M16 rifles and a Kalashnikov were found in the apartment of the wanted persons.'The security forces will continue to act with determination to thwart any terrorist threat directed against civilians and IDF soldiers.'Netanyahu hailed the successful conclusion of the weeks-long manhunt for the men behind the killings that shocked and angered many in Israel and Britain.'We settled accounts with the murderers of Lucy, Maia and Rina Dee,' he said in his statement. 'Our message to those who harm us, and those who want to harm us, is that whether it takes a day, a week or a month - you can be certain that we will settle accounts with you.' A statement from the Palestinian health ministry confirmed three people had been killed by Israeli troops in Thursday's raid.It said: 'Two of the martyrs have completely distorted features due to the intensity of the shooting, which makes it difficult to identify them.'",
        "After the raid, the scene was one of near total destruction.Israeli shells had ripped through the roof of the gunmen's safe house in the heart of Nablus' Old City, leaving nothing but twisted metal, cement blocks and torn mattresses stained with blood scattered over the rubble. ",
        "One witness suggested the three people had been killed in an initial blast before the raid, although this could not be independently verified. Nablus, the West Bank's commercial capital and second-largest city, has been the scene of repeated Israeli raids over the past year.However, few have been conducted during the day because of the increased risk of friction with local residents. Residents have been caught up in previous fighting.Manal Abu Safiyeh, 57, said she woke up at 7am to the sounds of the Israeli army vehicles rumbling through the city. Although it wasn't new to her after a year of intense violence in the Old City, the gunfire sounded closer than she'd ever heard it before. An explosion suddenly blew up her neighbour's house, she said, killing three people. She told Associated Press that she didn't know much about her neighbours other than that Ibrahim Jabr had cancer.A man who identified himself only as Kareem for fear of reprisals told the news agency that he spotted older men and a woman in a long overgarment worn by Muslim women who he had never seen before walking through the limestone alleys.He knew instantly they were Israeli special forces, he said.He ran to his house and sheltered there until he heard the gunfire stop.",
        "'So many men from the city have been killed,' he said. 'We are used to these raids. That's the story of life in Nablus.'After the military pulled out, young men collected scores of ejected bullet shell casings from the narrow alleys, and dozens of masked men paraded through the city while shooting into the air, waving Palestinian flags as onlookers honked in support. Residents were seen carrying the bodies of the slain gunmen, wrapped in white cloth and draped in flags, through the streets during a funeral. A sea of mourners at the men's funeral chanted 'God is great.'",
        "In the attack, the two sisters were killed in the shooting itself, while their mother suffered critical injuries and was taken to hospital by helicopter after then-unknown attackers opened fire with a Kalashnikov-style weapon.She later died from her injuries on April 11. ",
        "Rabbi Leo Dee had been driving ahead in a separate car when his wife and daughters were attacked. The family were from London and had emigrated to Efrat, an Israeli settlement in the West Bank.The settlement is considered illegal under international law, a source of conflict for Palestinian and Israeli factions. Israel disputes the status. In response to the shooting, Israel Police commissioner Kobi Shabtai called on all Israelis with firearms licences to start carrying their weapons.",
        "Israeli Major General Yehuda Fuchs said they were reinforcing in all sectors and would find those responsible.The attacks came as part of a wider spate of violence between Israeli and Palestinian factions in April, which has flared up again in May.Last month, violence spiralled after groups clashed at the Al Aqsa mosque in East Jerusalem during Ramadan and Passover.Israeli forces stormed the mosque with tear gas and stun grenades to confront Palestinians barricaded inside with fireworks and stones. Muslim worshippers were demanding the right to pray overnight inside the mosque, which authorities typically only permit during the last 10 days of the month-long Ramadan holiday.After rockets then landed in Israel from Lebanon, which Israel blamed on pro-Palestinian forces, Prime Minister Netanyahu gave the green light for bombing of targets in Lebanon and Gaza on April 6.Also on April 7, British holidaymakers were among the wounded in a separate 'terror attack' in Tel Aviv, which saw a car mount the pavement and drive through pedestrians.Violence has continued, flared up by the death of a prominent Palestinian detainee  in Israeli custody on Tuesday May 2 after an 87-day hunger strike. The death of Khader Adnan, 45, reverberated across the occupied West Bank and Gaza Strip, where he is revered as a national hero.",
        "Adnan was a leader of the Palestinian Islamic Jihad militant group credited with popularising hunger strikes as an effective form of activism.He was the 237th Palestinian prisoner to die in Israeli detention since 1967. He had been held several times on terror-related charges, or without charge.Adnan was first arrested in 1999 and spent his life in and out of Israeli jail, rising to significance in 2012 after a 66-day hunger strike which is said to have revived the peaceful act as a legitimate form of protest in Palestine.The 2012 protest also exposed the conditions of his detention, which rights groups went on to condemn. "
    ]
}