{
    "articleURL": "/sport/rugbyunion/article-12043309/Northampton-stalwart-Lawes-says-rugby-needs-people-run-like-proper-business.html",
    "content": [
        "Lawes is staying at Northampton but wants to see change in the gameNumber of national players are leaving England for international contracts Doubts over future of London Irish after collapse of Worcester and WaspsAs he reflected on his decision to stay at Northampton and revealed hopes of creating a legacy as a one-club man, Courtney Lawes couldn’t help but survey the wreckage of the English rugby landscape around him.",
        "Lawes last week signed a one-year contract extension with the Saints, bucking the trend of England stars who have quit the Gallagher Premiership for lucrative moves abroad.Like Manu Tuilagi, Lawes is staying put but wants to see change in his country’s game after a season which has seen both Worcester and Wasps fall out of existence. Worries over the future of London Irish continue, with Lawes speaking on the day their players were waiting for late wages to arrive.‘It's just so disappointing how we got here,’ said Lawes.‘Five years ago we were probably the fastest growing sport in the country. We have to get some people in who understand how we're going to make this game a proper business so it continues to grow and the players are financially compensated for what they're doing to themselves.",
        "'All avenues should be explored. We need to explore everything to find out what is going to be the best solution. At the minute it feels like no one's on the same page.’Lawes has played his entire club career with Northampton and turned down attractive financial offers in both France and Japan to remain a Saint.After an injury-interrupted season at both domestic and international level, the 34-year-old didn’t want to end with a whimper at Saints. ",
        "Instead, he will be a key figure for Phil Dowson’s side in the end-of-season Premiership play-offs before almost certainly going to the World Cup with England.Next term, he plans to hold a testimonial year with Northampton.‘I was pretty keen to stay because I didn’t want to end on a season like I’ve just had,’ Lawes added.‘There were times when you have to think financially. But luckily Saints have always been able to respond and that’s meant I’ve always been able to stay a one-club man.‘I’m delighted to be that. The main reason I stayed is that the club means a lot to me. I think they’re going to need me next season. My legacy here is important to me.’Lawes is entering the final stage of his career, but his legacy with Northampton is already secure. He will surely be remembered forever as one of the club’s true greats.",
        "A foreign move would have ended Lawes’ England career under the RFU’s controversial selection ruling.He admitted he can see why many of his Test team-mates have chosen that route.Thankfully for Northampton and England, Lawes hasn’t done so.‘I completely understand if the offers are that much better in another country then you’ve got to make that work,’ he added.",
        "‘It’s a finite career and it’s important you do look after yourself as when it’s all over, that money is stopping. Do what is best for you is my advice for the young lads.’"
    ]
}