{
    "articleURL": "/news/article-12060033/I-exasperated-Prince-Harrys-Spare-ghostwriter-J-R-Moehringer-tells-tensions-them.html",
    "content": [
        "Tensions between the Duke of Sussex and the rest of his family are so bad that Mike Tindall once publicly joked that the royals would like to throw a few punches at him.",
        "Now, Prince Harry's ghostwriter, J. R. Moehringer, has revealed that their relationship became so fraught while they were working on the book Spare that he started shouting at the King's younger son at one point.'I was exasperated with Prince Harry,' Moehringer admits, 'My head was pounding, my jaw was clenched, and I was starting to raise my voice. 'And yet some part of me was still able to step outside the situation and think, ''This is so weird. I'm shouting at Prince Harry''.'Then, as Harry started going back at me, as his cheeks flushed and his eyes narrowed, a more pressing thought occurred: ''Whoa, it could all end right here''.'",
        "The incident last summer is recalled in a new article that Moehringer has written for the New Yorker magazine. He explains that the dispute came as they discussed an incident in which the Duke of Sussex was captured by pretend terrorists during military exercises.Harry's captors screamed insults at him, 'culminating in a vile dig at Princess Diana'. One of the participants later apologised to him.'Harry always wanted to end this scene with a thing he said to his captors, a comeback that struck me as unnecessary, and somewhat inane,' Moehringer discloses. 'For months, I'd been crossing out the comeback, and for months Harry had been pleading for it to go back in. Now he wasn't pleading, he was insisting, and it was 2am and I was starting to lose it.",
        "'Although this wasn't the first time that Harry and I had argued, it felt different; it felt as if we were hurtling toward some kind of decisive rupture, in part because Harry was no longer saying anything. He was just glaring into the camera. 'Finally, he exhaled and calmly explained that, all his life, people had belittled his intellectual capabilities, and this flash of cleverness proved that, even after being kicked and punched and deprived of sleep and food, he had his wits about him.'''Oh,'' I said. ''O.K.'' It made sense now. But I still refused. ''Why?'' Because, I told him, everything you just said is about you. 'You want the world to know that you did a good job, that you were smart. But, strange as it may seem, memoir isn't about you. ",
        "'It's not even the story of your life. It's a story carved from your life, a particular series of events chosen because they have the greatest resonance for the widest range of people, and at this point in the story those people don't need to know anything more than that your captors said a cruel thing about your mom.'After finally accepting the writer's explanation, he shot me a mischievous grin. ''I really enjoy getting you worked up like that''. ",
        "'I burst into laughter and shook my head, and we moved on to his next set of edits.'"
    ]
}