{
    "articleURL": "/sport/othersports/article-12039583/Great-Britain-remain-course-World-Championships-promotion-beating-minnows-Lithuania.html",
    "content": [
        "Great Britain stayed on course for World Championships promotionGB rarely at their best against Lithuania team heading towards relegationGoals by Cade Neilson, Robert Dowd and Nathanael Halbert secured victoryGreat Britain stayed on course for World Championships promotion in Nottingham but had to work hard to defeat minnows Lithuania and record their third successive win.",
        "Britain won 3-0 to go top in this Division One Group A tournament following earlier victories against Korea and Poland but rarely looked at their best against a Lithuania team heading towards relegation after their earlier defeats against Poland and Romania.GB scored two goals in the first period, Cade Neilson opening the scoring in the second minute with a fine individual goal and Robert Dowd adding a second on the power-play.But that was it for a lacklustre Britain who appeared to be conserving energy for their final two matches against Romania and Italy until Nathanael Halbert registered a late empty net goal when Lithuania gambled by pulling goalie Mantas Armatis for an extra attacker.GB coach Pete Russell took the opportunity to switch up his forward lines and experiment but this was a little too close for comfort for a GB side looking to hit back at the first attempt after their relegation from the highest level last year.",
        "Lithuania’s outstanding goalie Armatis, who plays in the Swedish elite league, was the equal to everything else Britain could throw at him but it was host goalie Ben Bowns who claimed his second shut-out of this second tier tournament with 28 saves.Cardiff’s Bowns was much busier than when he shut-out Korea in GB’s first match with 17 saves but a measure of the difficulty of the hosts task on Tuesday was emphasised by the fact that they were out-shot by Lithuania by four shots.",
        "'The first two minutes were our best of the game,' admitted Bowns afterwards. 'This was our worst game of the tournament so far and maybe we took them too lightly. We made it hard for ourselves and we have to be a lot more keyed in going forward. We need to get back to our high intensity now.'The top two teams will be promoted back to the elite level of the sport but Poland’s victory over Italy earlier on Tuesday means GB can afford no slip ups in those final two matches on Wednesday and Friday if they are to make the most of home advantage."
    ]
}