{
    "articleURL": "/wires/pa/article-12057401/Coronation-concert-spectacular-honours-artist-known-prince.html",
    "content": [
        "A star-studded night of entertainment celebrating the King’s coronation began with Charles being thanked for making the event possible – by “weeding” his back garden at Windsor Castle.",
        "Charles and Queen Camilla got into the party spirit waving union flags after being welcomed by a 20,000-strong audience – accommodated on the castle’s east terrace.They received the cheers of the crowds as they took their seats in the royal box and were joined by the royal family, including the Prince and Princess of Wales and their children Prince George, who had played a starring role in the coronation, Princess Charlotte.",
        "Host and Downton Abbey actor Hugh Bonneville kicked off the show by telling the televised global audience: “Tonight we’re getting the party started across the world, over 100 countries are watching and celebrating with us here in what has been the royal family’s back garden for almost 1,000 years.“And doesn’t it look pristine and beautiful tonight, all thanks to His Majesty who was out here weeding at seven this morning.“And we are of course delighted and honoured to be joined by newly crowned King Charles III. Whose lifelong passion for the arts we will be celebrating throughout the show – he himself of course is a painter, an artist – the artist formerly known as prince.”",
        "Charles could be seen laughing as he heard the word “prince” and his wife beside him smiled.He also appeared to enjoy a skit with Bonneville and The Muppet Show stars Kermit the Frog and Miss Piggy, who said “King Charlesy Warlesy” was “expecting” them in the royal box.",
        "Princess Charlotte and Prince George smiled as they watched on intently.",
        "The audience heard from the King at the top of the show, but not in a way expected – mixed into Pete Tong Ibiza Classics, featuring Vula and Jerub.Speaking to the PA news agency backstage ahead of the event, Tong said: “He wanted Ibiza classics, that was very specific.”A fragment of his televised address to the nation the day after the Queen died was played as the performance began.Charles said: “And wherever you may live in the United Kingdom, or in the realms and territories across the world, and whatever may be your background or beliefs, I shall endeavour to serve you with loyalty, respect and love, as I have throughout my life.”"
    ]
}