{
    "articleURL": "/news/article-12044781/Treasurer-Jim-Chalmers-says-10-000-pay-rises-250-000-aged-care-workers-wont-add-inflation.html",
    "content": [
        " Treasurer asked about pay rises on inflation Plan to spend $11.3billion boosting wages Treasurer Jim Chalmers has denied 15 per cent pay rises of up to $10,000 for 250,000 aged care workers will add to Australia's inflationary pressures.",
        "The federal Labor government is committing $11.3billion, over four years, in the Budget so low-paid workers in the predominately female care sector will get decent pay rises during a cost of living crisis.This funding will put into effect the Fair Work Commission's November decision to boost minimum wages for aged care workers, nurses and personal care workers from July 1.At a media conference with Aged Care Minister Anika Wells, Dr Chalmers was asked if this would add to inflation, which remains at a level more than double the Reserve Bank's two to three per cent target.",
        "But the Treasurer was adamant it wouldn't, as he also defended Labor's multi-employer bargaining policies that will see wage rises replicated across an industry.'When it comes to the inflationary impact, decent wages for working people, that's part of the solution when it comes to cost of living pressures, not part of the problem,' he said.'The advice that we've received when it comes to this aged care change, for example, from the Treasury is that the inflationary impact will be negligible.'We want to see people get decent wages outcomes.'The announcement was made on Thursday, two days after the RBA surprised financial markets by raising interest rates by another quarter of a percentage point to an 11-year high of 3.85 per cent.",
        "Following April's pause, this was the 11th rate increase in a year.Inflation in March eased to 7 per cent, down from a 32-year high annual pace of 7.8 per cent in December.",
        "But it is still more than double the RBA's two to three per cent target, with Reserve Bank Governor Philip Lowe noting it was still too high. 'Inflation in Australia has passed its peak, but at 7 per cent is still too high and it will be some time yet before it is back in the target range,' he said on Tuesday.Headline inflation, also known as the consumer price index, is significantly higher than last year's wage price index of 3.3 per cent, which means workers are effectively suffering a cut in real wages. Dr Lowe also expressed concerned about higher wages growth, following a decade of below-average increases, with unemployment at a 48-year low of 3.5 per cent.'Wages growth has picked up in response to the tight labour market and high inflation,' he said. As part of Labor's policy, a registered nurse on a level 2.3 award wage will get an extra $196.08 a week, or more than $10,000 more a year.",
        "REGISTERED NURSE: $196.08 a week or more than $10,000 a year on 2.3 award wageENROLLED NURSE:  $145.54 a week or more than $7,500 a year on level 2 awardASSISTANT IN NURSING: $136.68 a week or more than $7,100 a year on level 3 awardPERSONAL CARE WORKER: $141.10 a week or more than $7300 a year on level 4 aged care awardRECREATIONAL ACTIVITY OFFICER: $139.54 a week or more than $7,200 a year on level 3 aged care awardHEAD CHEF OR COOK:  $141.12 a week or more than $7,300 a year on level 4 aged care award"
    ]
}