{
    "articleURL": "/wires/pa/article-12060481/Carlos-Corberan-proud-West-Brom-turnaround-despite-missing-play-offs.html",
    "content": [
        "Carlos Corberan expressed his pride at turning around West Brom’s season despite a 3-2 final-day loss at Swansea as they fell short of the Sky Bet Championship play-offs.",
        "West Brom had started the final day of the regular season as play-off outsiders, needing to beat Swansea and hope for favourable results elsewhere.The Baggies ultimately finished ninth, as Sunderland and Coventry claimed the final two play-off places, after Corberan took over in October with the club second bottom of the Championship.“The target we had was difficult, to change the momentum of the season,” said Corberan, whose side won only three of their final 10 games.“It was very uncomfortable. We moved fast, we focused on the possibilities and I feel very proud.“It’s a pity we didn’t achieve the play-off positions, but the team has put in a lot of effort.",
        "“We arrived to the last moment of the competition and the players did not stop to believe, to try and make their best.”On summer squad strengthening, Corberan added: “I do not know the limitations or the situation (of the club), but from tomorrow I will guarantee to work as in football there is no time to waste.“As fast as we know our possibilities and resources the better for us to play the team that West Bromwich needs to have.”Corberan was unhappy with Swansea’s stoppage-time winner, Joel Piroe curling home a free-kick for his 20th goal of the season.",
        "He said: “I am very disappointed that we didn’t get something from the game, at least a point.“I don’t think we deserved a defeat with all the things we have done well, especially in the second half.“We should avoid a foul where we concede the free-kick but there was a foul on (Jayson) Molumby. That increases the frustration.”Swansea, for whom Luke Cundle and Olivier Ntcham cancelled out goals from Okay Yokuslu and Semi Ajayi, finished below West Brom on goal difference in 10th.Fresh investment is arriving at the Welsh club this summer and new chairman Andy Coleman’s in-tray will include tying manager Russell Martin down to a new contract.Martin, appointed Swansea manager in August 2021, has one year left on his current deal and has been linked with a potential summer vacancy at Leicester.“He (Coleman) said he likes what we’re doing,” said Martin. “There’s maybe other priorities at the moment but we’ll see.“He’s said the ownership group have expressed an interest in trying to extend the contract.“We’ve got guys out of contract, so that’s got to be a real priority.“Whatever comes first, I don’t know. We’ll just have to wait and see.”"
    ]
}