{
    "articleURL": "/wires/reuters/article-12044389/USAID-pauses-food-assistance-Tigray-region-Ethiopia.html",
    "content": [
        "By Jasper Ward",
        "WASHINGTON, May 3 (Reuters) - The United States Agency for International Development (USAID) announced on Wednesday the temporary suspension of its food assistance to the Tigray region of Ethiopia.While describing the move as a \"difficult decision\", USAID Administrator Samantha Power said the agency recently discovered that food aid intended for people of the region, who are suffering under famine-like condition, was being diverted and sold on the local market.The agency referred the matter to its Office of the Inspector General, which launched an investigation, and sent leaders from its Bureau for Humanitarian Assistance to Ethiopia before deciding to on a temporary pause in food aid, she said.Power said the U.S. government has raised its concerns with officials from Ethiopian federal government and the Tigray Interim Regional Administration, and that the officials have expressed willingness to work with the U.S. to identify and hold those responsible accountable.She said USAID \"stands ready\" to restart the program once strong oversight measures are in place and it has confidence that assistance will reach the intended vulnerable populations.A two-year war that broke out in November 2020 between the federal government and forces led by the Tigray People's Liberation Front (TPLF), the party that dominates the region, killed tens of thousands of people, created famine-like conditions for hundreds of thousands, and displaced millions.",
        "The government and Tigray forces agreed to end the hostilities in November, which has allowed additional aid to reach the region and for some services to be restored.Power said the pause has dealt another blow to already suffering civilians and reiterated the United States' commitment to the Ethiopian people.\"While food aid to the Tigray Region is paused, other vital assistance not implicated in the diversion scheme will continue, including life-saving nutritional supplements, safe drinking water, and support for agricultural activities and development,\" she said. (Reporting by Jasper Ward; Editing by Lincoln Feast)"
    ]
}