{
    "articleURL": "/wires/aap/article-12061115/Whaitiri-backs-Maori-gut-NZ-Labour-defection.html",
    "content": [
        "It's the Kiwi power play which has captivated New Zealand politics and has the potential to turn the October 14 election.",
        "But defecting Labour MP Meka Whaitiri has denied plotting revenge or playing politics with her bombshell move, instead saying she joined the Maori Party simply because of a feeling in her gut.Ms Whaitiri, a Labour MP for a decade and twice promoted into the outer ministry, astonished politics-watchers by leaving the government last Wednesday.The low-profile Ikaroa-Rawhiti MP's defection was the first by a sitting minister in decades.Pointedly, she announced her move while Prime Minister Chris Hipkins was mid-flight to London for the King's coronation.She then went to ground, leaving her Labour colleagues none the wiser as to her reasons - until Tuesday morning, when she used the Maori word for stomach to explain.\"It was a calling deep in my 'puku' that I had to do this,\" she told TVNZ.\"It was a calling that was very strong to me ... many of your viewers may not understand that. But as a Maori they will understand that calling, that beckoning.\"She denied leaving due to any policy gripes, instead saying she had been \"shackled\" inside the Labour government.\"I didn't think I was heard. I've now joined a party that I know my voice,\" she said.Supporters of the Maori Party and Ms Whaitiri packed the public galleries in parliament for her arrival on Tuesday afternoon.",
        "They were denied a show-stopping moment as speaker Adrian Rurawhe threw out the party's co-leaders Rawiri Waititi and Debbie Ngarewa-Packer for interrupting debate to sing in the house to herald the arrival for the new MP.Singing 'waiata', or Maori song, on major occasions is common in New Zealand's parliament.Mr Waititi later told reporters their ejection - during tributes to King Charles III after his coronation - showed parliament was hostile to Maori customs.\"This place is not a safe place for our people,\" he said.While Labour retains a majority in the house despite Ms Whaitiri's defection, it has been rattled by the affair.Mr Hipkins was interviewed shortly after Ms Whaitiri on the same TVNZ program on Tuesday morning, disagreeing that Labour had blunted her.\"I went back through my messages thinking 'Gosh did I miss something from her' ... at no point did she reach out to me indicating she had anything to say,\" he said.In this term, Labour has appointed more Maori ministers (eight), including six in cabinet, than any government.Maori ministers will press on without Ms Whaitiri, but in an election tipped to be razor-tight, the defection could play out in a number of ways.New Zealand's electoral system is designed to produce minority governments, with parties needing to work together to form coalitions to govern.",
        "On current polling, Labour's path to a third term relies upon the Maori Party's support.Ms Whaitiri's move to the Maori Party, a left-wing party founded by another Labour defection two decades ago, reshapes the ties between the two parties.On one hand, it gives Labour a familiar face to negotiate with - but on the other, it has created tension which may linger.Ms Whaitiri's move also gives the Maori Party a stronger shot at winning the electorate of Ikaroa-Rawhiti, held by Labour since it was created in 1999.The more seats the Maori Party win, the more likely it is to play the role of kingmaker after the poll.The move also allows the centre-right opposition National party to run a campaign suggesting the far-left Maori Party is in cahoots with Labour.\"It's a total shambles and mess and it's a government that's falling apart,\" National leader Chris Luxon said.\"You've got a Labour, Greens, te Pati Maori bloc that's together and that's what you're going to get if you vote for any of those three parties.\""
    ]
}