{
    "articleURL": "/tvshowbiz/dakota-fanning/article-12056171/Dakota-Fanning-looks-effortlessly-chic-stylish-white-ord.html",
    "content": [
        "Elle Fanning enjoyed some down time on Saturday as she was spotted leaving the new Chanel store on Rodeo Drive in Beverly Hills.",
        "The actress, 25, looked effortlessly chic in a summery white top and a matching maxi skirt.She completed the look with a pair of white sandals and shielded her eyes from the sun with black Ray-Ban sunglasses.Elle opted for a light palette of makeup as she showed off her natural beauty during the outing, while her blonde locks were styled straight.The star recently revealed that she is currently single after confirming her split from Max Minghella earlier this month during a cover story for Harper's Bazaar U.K. ",
        "The former couple, who had mainly kept their relationship on the private side, first met on set of Teen Spirit (2018), with Fanning taking on the leading role and Minghella directing. Despite going their separate ways, the beauty expressed to the outlet, 'But I’m a hopeless romantic. I believe in love at first sight. Call me crazy, but I believe in those things. I feel that it’s my destiny.' The actress had previously hinted at the split when she uploaded a few reels onto her main TikTok page where she tried to predict her love life shortly before Valentine's Day. Both Elle and Max were last publicly seen together in December 2022 while attending the Babylon premiere.The Neon Demon star has been looking to the future and will turn 25-years-old later this week on Sunday. 'I do sense I’m in another transformation phase right now... sometimes you can just feel you’re growing another layer.'",
        "Fanning has been filtering through a busy schedule and will soon appear as Catherine the Great once again in the hit Hulu series, The Great, with the third season slated to premiere on May 12.On tackling the big role, the star expressed to Harper's Bazaar, 'I’ve been playing Catherine in such formative years of my life. I’ve grown as a woman alongside her.'However, initially, she had been 'scared' of portraying a more comedic role, which was something she hadn't done too often. 'I hadn’t really done much [comedy], and was very scared at the start.''But I’m not embarrassed any more, you just have to try, no matter how outrageous something is.'The star-studded cast in the Emmy-nominated series also includes Nicholas Hoult, Phoebe Fox, and Adam Godley.During the series, Elle became pregnant with Peter III's child, and she opened up about how the experience had made her want children of her own in the future.",
        "'I was obsessed with it. I had a bespoke bump with boobs molded onto me that went all the way up to my neck,' the star explained.The actress added, 'The costume team told me that this is pretty accurately what my body will look like when I’m pregnant... which did feel quite crazy. 'I loved the way it looked. It made me want to do it, to be pregnant.'",
        "Aside from the Hulu show, Fanning has a number of other projects up her sleeve, such as starring alongside her sister, Dakota Fanning, in an adaptation of the novel titled, Nightingale, written by Kristin Hannah.The official premise follows, 'The lives of two sisters living in France are torn apart at the onset of World War II,' according to an IMDB synopsis. The project, however, has been pushed back since 2021 and is currently still in its pre-production stages."
    ]
}