{
    "articleURL": "/wires/reuters/article-12060985/Western-Digital-Corp-sees-weak-fourth-quarter-slower-recovery-memory-chips.html",
    "content": [
        "May 8 (Reuters) - Memory chip firm Western Digital Corp forecast fourth-quarter revenue below Wall Street estimates and a bigger current-quarter loss, signaling that memory chip demand will take longer to recover as cloud spending also shrinks.",
        "The company's shares fell about 1% in extended trading.Chipmakers across the board including Intel Corp have said cloud spending is weakening.Seagate Technology Holdings, which makes hard disks for storage like Western Digital, last month said it was seeing a \"more elongated customer inventory correction\" and that it expects demand recovery to begin only towards the end of 2023.The memory industry, which was the first to flag a chip supply glut last year, was slammed by falling chip prices due to the combined impact of falling demand for electronics and oversupply.While memory chipmakers have been cutting production to alleviate oversupply and prop up memory chip pricing, a weak global economic outlook has clouded the hopes for a quicker recovery.Western Digital expects fourth-quarter revenue between $2.40 billion and $2.60 billion. Analysts expect revenue of $2.86 billion, according to Refinitiv data.On an adjusted basis, the company expects a fourth-quarter loss between $1.90 per share and $2.20 per share, compared with analysts' estimates of a loss of $1.22.Western Digital, which is exploring the splitting of its flash-memory and hard-drive business after activist investor Elliott Management pushed for a separation, said revenue from those units in the third quarter fell about 42% and 30%, respectively, from a year earlier.",
        "Cloud segment revenue in the third quarter fell 32% to $1.21 billion.However, Western Digital reported third-quarter revenue of $2.80 billion, beating estimates of $2.70 billion. (Reporting by Chavi Mehta and Ananya Mariam Rajesh in Bengaluru; Editing by Shounak Dasgupta)"
    ]
}