{
    "articleURL": "/tvshowbiz/article-12048135/Take-attend-screening-Greatest-Days-ahead-performing-Coronation-Concert.html",
    "content": [
        "Take That attended a special screening of Greatest Days on Thursday at Soho Hotel in London. ",
        "They showed no sign of nerves as they made an appearance ahead of their headline performance at King Charles's Coronation Concert on Sunday - which will be their first live performance in four years.  The band formed in 1990 with the original line-up consisting of Barlow, Williams, Mark Owen, Howard Donald and Jason Orange. Williams quit the band to pursue a solo career in 1995, while Orange left in 2014. The musical, which will be released on June 16, follows five best friends who have the night of their lives seeing their favourite boy band in concert. Twenty-five years later, their lives have changed in many different ways as they reunite for one more epic show by their beloved band, to relight their friendship and discover that maybe their greatest days are ahead of them. ",
        "Take That agreed to perform at the Coronation Concert at Windsor Castle on May 7 and it will be their first live show in four years.  It comes after Adele, Ed Sheeran and the Spice Girls all turned down appearing at the event. Take That will join Katy Perry and Lionel Richie, while other performers include Freya Ridings and Andrea Bocelli. The band are also to release their first new music in five years as they have re-recorded their hit 2008 single Greatest Day - which is coming out on Friday.",
        "The trio - Gary Barlow, Mark Owen and Howard Donald - have re-worked their beloved number one track with the help of singer Calum Scott.Calum told The Sun: 'I was really nervous about jumping on a song that was already such a smash and recording on my vocal in there but it was also such an honour.'Gary and I hit the studio together for a day working on a new section and doing new vocals and then we went it to the boys [Mark and Howard] to rerecord their parts.'Calum also chatted to Gary about writing some new, original music together.'",
        "He said: 'We said after this track we want to get in the studio together and write original music.'I'm in the middle of working on my third album so hopefully we can do something for that.'I'm excited to be able to work with him. Even being linked to a band like Take That is wild.'DJ Robin Schulz has added some dance influence to the stripped-back, anthemic number, which will also appear in the musical. Speaking about the new song, Take That said: 'Greatest Day is a special song for us - it was one of our biggest singles, and our 11th No.1.'It's been fantastic being in the studio working on the new version of the track with Calum and Robin, both such talented artists.",
        "'With the movie Greatest Days coming out this summer we wanted to do something special with the title track and we were really excited that Calum and Robin agreed to be involved.'They have been brilliant! We're really excited for everyone to hear it.'",
        "It comes after Take That teased all five members will return to the stage 'sometime soon' after posting a throwback video of the original lineup singing Never Forget.Gary, Howard and Mark have been rehearsing for their upcoming performance at Hyde Park on July 1 in recent weeks and fans are already gearing up for that.The men were recently in Spain where they all met up to record and Mark posted pictures online of them making their way to the studio, cups of tea in hand.Howard also posted a video of himself last week sporting a large beard before a DJ performance with Judge Jules ahead of his forthcoming appearance at Ingliston Country Club in Scotland.The post on the Take That page got everyone excited, with all five boys - including Robbie Williams and Jason Orange - on stage in a video alongside a caption that said: 'Never forget we will have fun like this again... someday soon.'"
    ]
}