{
    "articleURL": "/wires/reuters/article-12039511/76ers-Celtics-scramble-mode-heading-Game-2.html",
    "content": [
        "A better brand of defense will be on the mind of the Boston Celtics when they try to rebound from a series-opening defeat on their home court against the Philadelphia 76ers on Wednesday.",
        "The Celtics' Al Horford admitted that team defensive intensity was lacking when they played the 76ers in Game 1 of the Eastern Conference semifinals on Monday night. Now, Boston has to win Game 2 at home to avoid falling into a 2-0 hole in the best-of-seven series.Although they played without MVP candidate Joel Embiid (knee), Philadelphia prevailed 119-115 in the series opener. James Harden poured in a game-high 45 points, but the 76ers also received plenty of offense from their supporting cast.Philadelphia's Tyrese Maxey scored 26 points, Tobias Harris finished with 18 and De'Anthony Melton came off the bench to toss in 17.In addition, Philadelphia received 10 points and 13 rebounds from Paul Reed, who started at center in Embiid's absence.\"We didn't do as good a job defensively as we could,\" Horford said, alluding to an inability to adjust defensive strategies. \"As much as you don't want to say (Embiid's absence) wasn't a factor, I think it was. We have to be better. We have to understand that we have to be able to play with whatever happens, whatever variables.\"Embiid's status for Game 2 remained unchanged as of Tuesday afternoon, according to head coach Doc Rivers. He hasn't played in Philadelphia's last two games after injuring his knee in Game 3 of the team's first-round series victory against the Brooklyn Nets.",
        "\"In a lot of ways, when Embiid doesn't play everybody else is empowered,\" Boston's Malcolm Brogdon said. \"Everybody else has the green light and guys are gonna step up, and I thought that's what happened. I think we expected that, guys to step up, but we still struggled with it. We just gotta be prepared.\"Boston had a 115-114 lead after Jayson Tatum made two free throws with 26.1 seconds left, but Harden sank a 3-pointer - his seventh of the game on 14 attempts - that put Philadelphia in front for good with 8.4 seconds to play.Harden's 45 points matched his career-high in a playoff game. He also scored 45 points when he played for Houston in a victory over Golden State in the 2015 Western Conference finals.\"We didn't come into this game expecting to lose,\" Harden said. \"We're here to win. Even after this one I told guys, `Don't get too happy.' We're even-keeled. We're coming in here to get Game 2 as well. That's the mindset we have as a unit and whether (Embiid) comes back or not we're going to be ready to go.\"Boston received 39 points from Tatum and 23 from Jaylen Brown in the loss, but Harden alone outscored Tatum and Brown 15-10 in the fourth quarter. Philadelphia was better down the stretch, ending the game on a 12-4 run.",
        "The Celtics had a 66-42 advantage in points in the paint, but that wasn't enough to overcome Harden's 17-for-30 (56.7 percent) overall shooting performance.\"(Harden) was phenomenal for us,\" Harris said. \"He had a huge amount of confidence in his game and what he works on. He's been doing it for so long and it was an amazing time to come out and just dominate.\"He dominated the whole game and carried us to the victory. It was a team effort, but he did an amazing job of having his composure all throughout the game to help us win.\"--Field Level Media"
    ]
}