{
    "articleURL": "/wires/ap/article-12054511/Milan-beats-Lazio-2-0-boost-4-hopes-loses-Le-o.html",
    "content": [
        "MILAN (AP) - Both Milan teams remained in the Serie A fight to qualify for next season's Champions League ahead of their showdown in this season's competition.",
        "Inter Milan won at Roma 2-0, shortly after AC Milan beat Lazio by the same scoreline. The Rossoneri could be counting the cost of that match, however, as key forward Rafael Leão limped off injured just four days before the Champions League semifinal.Milan closed the gap to second-placed Lazio to three points after an Ismaël Bennacer strike and a stunning Théo Hernandez goal. Milan was one point behind Inter and Juventus, which plays at Atalanta on Sunday.\"I´m happy with the performance and for the win, it was too important a match for us,\" Milan coach Stefano Pioli said. \"What was important was to play well and we did that even without Leão.\"I don´t think it´s serious but we´ll evaluate it tomorrow. He stopped in time, he was very calm and that gives me good hope.\"Atalanta and Roma were five points below fourth-placed Inter.",
        "The two Milan clubs meet in the first leg of the Champions League semifinals on Wednesday. The return leg is the following Tuesday.Leão limped off in the 11th minute shortly after pulling up and clutching the top of his right thigh.Milan nevertheless took the lead six minutes later. Lazio defender Nicolò Casale attempted to pass out from his area but Bennacer stole the ball and played a one-two with Olivier Giroud before firing past Ivan Provedel.",
        "Milan doubled its lead in stunning fashion in the 29th when Hernández collected a pass inside his own area from goalkeeper Mike Maignan and raced almost the whole length of the field before unleashing a shot into the top right corner.WINNING STREAKInter Milan recorded its fifth consecutive win in all competitions. It has also conceded just one goal in that run.Inter broke the deadlock in Rome in the 33rd minute. Denzel Dumfries ran onto a fantastic Marcelo Brozovi´c throughball and whipped in a cross from the right that Federico Dimarco fired in from a tricky angle. Roma midfielder Bryan Cristante got the last touch on the ball as he desperately tried to keep it from going in but the goal was awarded to Dimarco.There was a bit of fortune for Inter's second in the 74th. Roma defender Roger Ibañez intercepted a long ball over the top but accidentally gave it back to Lautaro Martínez and he sent Romelu Lukaku through for a relatively straightforward finish into the bottom left corner.Martínez also hit the crossbar late on.RELEGATION BATTLECremonese gave itself hope of survival by beating Spezia 2-0.Daniel Ciofani struck the opener shortly before halftime and Johan Vásquez all but sealed the result from a header with 13 minutes remaining.",
        "Cremonese remained second from last but moved to within three points of safety and 17th-placed Hellas Verona, which plays at Lecce on Sunday.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}