{
    "articleURL": "/wires/ap/article-12054789/Tennis-terriers-US-Opens-home-hosts-famed-dog-show.html",
    "content": [
        "NEW YORK (AP) - They´re at the top of their sport. They´re primed to run down tennis balls. So perhaps it´s perfectly natural that about 3,000 top-flight canines are converging on the grounds of the U.S. Open tennis tournament, where the Westminster Kennel Club dog show began Saturday.",
        "It's a new venue for the nearly 150-year-old event, now back in New York City after a two-year, pandemic-induced sojourn in the suburbs.As the show began Saturday with an agility competition and other events, there were a few double-takes, if not double-faults.Barks, not the pock of tennis balls, were heard across the sunny, 40-acre (16-hectare) grounds of the USTA Billie Jean King National Tennis Center. Westminster's traditional green carpet had been rolled out in Arthur Ashe Stadium for fleet-footed - but four-footed - competitors.Dogs relaxed in their crates on a tented practice court. The fan-friendly South Plaza was set up with a 27,000-gallon (102,200-liter) pool for a canine dock-diving demonstration. Turn in any direction, and a dog of some sort was likely to pass by.\"It's kind of weird to see them out and about at a place where you don't usually see dogs,\" spectator Haili Menard said as she watched in the dock diving to pick up pointers for her Dalmatian back at home in Bristol, Connecticut. Menard had been to the U.S. Open but never to the Westminster show.",
        "\"The sport of it is highlighted\" by the environs, she said.Meanwhile, Fletcher the Malinois took the plunge.\"We're never going to get to Westminster any other way,\" laughed owner Jenine Wech of Schellsburg, Pa. When not doing dock diving or other sports, Fletcher works as a bedbug-detection dog.",
        "Stella competed in agility in 2021 but was back Saturday as dock diving, her favorite blow-off-steam sport, got a toe in the Westminster water.\"The experience is so neat, to get to come with your dog ... and to even just show a healthy bulldog,\" said owner Lucy Hayes of Dayton, Ohio, who taught Stella to swim years ago (she dives in a life jacket for safety).For most of its history, Westminster was held in Manhattan, where generations of best in show dogs were anointed at Madison Square Garden. In order to hold the event outdoors during the COVID-19 crisis, organizers moved it to the grounds of an estate in suburban Tarrytown, New York, for the last two years.The club sought to return to New York City, while assessing factors including construction plans at a Manhattan pier building that formerly hosted part of the show. The tennis center emerged as an alternative.Besides hosting one of tennis's Grand Slam tournaments, the facility in Queens has been trying to position itself in recent years as a flexible, festive event venue. It has welcomed wrestling, video gaming and BIG3 3-on-3 basketball competitions and embraced letting dogs have their day.\"From the biggest stars in tennis to the biggest stars in the canine world,\" said Chris Studley, the facility's senior director for event services. Westminster President Donald Sturz was equally upbeat about the prospect of \"an iconic dog show event in an iconic venue.\"",
        "To be sure, Manhattan offered a certain allure to some participants who travel from around the country. But the spacious tennis center allows for holding all the events in one place, adding new ones and giving dogs and people more elbow room.While dogs aren't usually the main attraction at the tennis center, there are plenty of players known for bringing their pooches on tour.Serena Williams had a pooch courtside in Arthur Ashe Stadium when she practiced ahead of last year´s U.S. Open, her final event before retirement. Her older sister, Venus, also has been spotted with a dog at tournaments. Bianca Andreescu´s pet, Coco, is often found with Andreescu´s mother in the stands during matches. Alexander Zverev adopted a dog while in Miami ahead of the Miami Open a few years ago.Some vendors had tennis balls on hand Saturday, but dogs like Leslie Wilk's had other activities on their minds. The border collie-Staffordshire bull terrier mix rocketed through the agility course as if determined to live up to her name, Champion.\"Every time she steps up to the line,\" said Wilk, of Camarillo, California, \"she just gives it her best.\"Look at it that way, and the human and canine athletes of the tennis center aren't so different.",
        "___AP Tennis Writer Howard Fendrich contributed from Washington. New York-based Associated Press journalist Jennifer Peltz has covered the Westminster dog show since 2013."
    ]
}