{
    "articleURL": "/wires/ap/article-12048673/Federal-officials-unveil-flood-plan-Mississippi-Delta.html",
    "content": [
        "JACKSON, Miss. (AP) - Federal officials presented a proposal Thursday to further control flooding in the Mississippi Delta, a move that comes after months of work from government agencies and decades of delays amid disputes over potential environmental impacts.",
        "The south Delta's Yazoo Backwater area covers thousands of square miles, starting just north of Vicksburg and going up to where Mississippi Highway 12 bisects the Delta. The area has experienced significant flooding for many years, including a damaging 2019 flood that lasted several months, according to the U.S. Army Corps of Engineers.Farmers, rural shopkeepers and Mississippi politicians from both major parties have long pushed for a proposed project to mitigate flooding that involves pumping water from parts of the south Delta. Flooding often occurs after rainfall feeds high waters in the Mississippi River.Environmental groups have opposed the project for decades, arguing it would be too expensive and hurt wetlands to help agribusiness.At a public meeting on Thursday in Onward, Mississippi, experts from the Corps and the Environmental Protection Agency presented what they called a \"preferred approach\" to water management in the Yazoo Backwater area.The proposal would include the installation and operation of pumping stations, support for voluntary buy-outs for at-risk homes and help to elevate homes and build ring levees, according to a news release from the offices of Mississippi´s two Republican U.S. senators, Roger Wicker and Cindy Hyde-Smith.",
        "\"It´s a major step forward for South Delta residents who have been waiting decades for the federal government to keep its promise, and also, to protect them from flooding,\" Wicker said in the news release. \"This water management plan would help prevent nearly all the flooding that has destroyed homes and businesses, ruined crops, and devastated wildlife.\"",
        "The proposal is a recommendation from the Corps and EPA that will be presented to the public for comment.\"The overall approach is a major inter-agency effort that aims to provide flood risk reduction through a water management solution,\" Anna Owens, a spokesperson for the Corps' Vicksburg District, said in an email. \"The plan also considers affected communities, agriculture, and the needs of fish, wildlife, and wetlands.\"After a public comment period, officials will revise the proposal before they unveil a finalized plan on June 30, she said.The EPA vetoed an earlier version of the Yazoo Backwater Project project in 2008 under Republican President George W. Bush, which would have also included pumping water. The agency said \"adverse impacts on wetlands and their associated fisheries and wildlife resources are unacceptable.\"The late Sen. John McCain, a Republican from Arizona, once called the pumps \"one of the worst projects ever conceived by Congress,\" and opponents have said pushing water out of the south Delta could cause worse flooding downstream along the Mississippi River.Former EPA Administrator Andrew Wheeler said in April 2019 that the agency would reconsider the decision that blocked the project. But in 2021, the EPA overturned the project´s approval, saying it was erroneously greenlit in the final days of the Trump administration.",
        "Radhika Fox, assistant administrator for water at the EPA, had said the federal government wanted to work with the Corps and others to develop a proposal to address \"flooding concerns in an environmentally protective manner.\"Mississippi Gov. Tate Reeves, a Republican, celebrated the new proposal in a news release Thursday.\"I don´t need to tell Mississippi what this means for the Delta and for Mississippi,\" Reeves said. \"Once it´s implemented, this plan will be a big victory for Mississippians.\"___Michael Goldberg is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow him on Twitter: https://twitter.com/mikergoldberg."
    ]
}