{
    "articleURL": "/tvshowbiz/article-12053685/Dr-Chris-Brown-appears-relaxed-arrives-Sydney-Airport-quitting-Im-Celebrity.html",
    "content": [
        "Dr Chris Brown is back in Australia as he prepares for a career change. ",
        "The 44-year-old flew in to Sydney from Johannesburg on Saturday afternoon after finishing the latest series of I'm A Celebrity...Get Me Out Of Here! Australia. The vet looked relaxed and happy, smiling as he wheeled his pile of luggage through the terminal at Sydney Airport following his final stint in the South African jungle. Chris was dressed comfortably in a plain black T-shirt and grey jeans, as well as a brown cap. He beamed as he left the airport, with a backpack strapped on and a number of bags on his trolley, including a guitar case. ",
        "Chris is on gardening leave at Network Ten ahead of his move to Channel Seven in July.Rumours of his first project at Seven are starting to ramp up, with The Australian reporting he will kick off his contract by hosting a home improvement show.The as-yet-untitled reno series will be made by production company Endemol Shine and will begin filming this year, but won't air until early 2024.Seven's last renovation program, House Rules, was axed three years ago and network executives are hoping the new format will be a hit.",
        "Chris, who signed off from Ten's I'm a Celebrity last Sunday night, inked a multi-year deal with Seven in February to produce unspecified 'new projects' for the station.Chris first joined Ten in 2008 to host Bondi Vet, which became a surprise ratings hit and was syndicated around the world.",
        "The factual series was based on his real-life experience as a vet at the Bondi Junction Veterinary Hospital in Sydney's east.He went on to become a part-time panelist on The Project and also co-hosted I'm a Celebrity... Get Me Out of Here! and The Living Room, which was axed last year.",
        "The move to Seven is a homecoming of sorts for Dr Chris.He started his TV career in 2003 as a presenter on Harry's Practice on Seven, a role that earned him a Logie nomination for Most Popular New Talent.The Sydney University graduate never planned to work in the media, but was discovered by a talent scout telling animal stories over a few beers in a pub.His passion for animals started as a child growing up in Newcastle where his father Graeme was the local vet.In between working for Seven and Ten, Dr Chris did a stint at Nine hosting segments for Burke's Backyard, and was also a contributor to the Today show."
    ]
}