{
    "articleURL": "/news/article-12053051/Bombed-suffragettes-covered-graffiti-secrets-700-year-old-Coronation-chair.html",
    "content": [
        "The high-backed seat of majesty was commissioned by King Edward I in 1296The chair is the most ancient artefact involved in King Charles III's Coronation How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk For over seven centuries, it has been the chair on which history is made. Today, it will be so again.",
        "Made of oak, and with a lion at each of its feet, this high-backed seat of majesty, commissioned by King Edward I in 1296, is the most ancient artefact involved in King Charles III's Coronation: the Coronation Chair.King Edward's (or Saint Edward's) Chair, to give it its correct name (it was named in honour of the 11th century monarch Edward the Confessor), is the oldest piece of furniture in the United Kingdom still used for its original purpose. It's also the oldest we have a named craftsman for — the painter and carpenter Master Walter of Durham.Walter decorated the chair with gilding, stained glass, and decorations of foliage, animals and a king — believed to be either Edward I or Edward the Confessor. Today, these details have been all but lost.",
        "The intervening centuries have not always proved kind. 'It wouldn't look out of place in the Steptoes' junkyard,' commented a recent visitor to Westminster Abbey of the throne's appearance.The chair was originally commissioned by Edward I to house the Stone of Scone, also known as the Stone of Destiny, a highly significant spoil of his wars in Scotland. The stories of the throne and the stone have become so intertwined it is impossible to separate them.Before Edward got his rapacious royal hands on it, what looks like an ordinary rectangular block of sandstone had for centuries been used as the seat upon which kings of Scotland were crowned.",
        "The Stone of Destiny had been housed at Scone Abbey, in Perthshire, before Edward removed it during one of his campaigns and had it taken to London as a potent symbol of Scottish submission.It was, after all, his successful warring north of the border which won the King the epithet 'Hammer of the Scots'. His tomb in Westminster Abbey bears that inscription in Latin.The first king whom historians are confident was crowned on the coronation chair is Edward I's great-great-grandson, Henry IV, in 1399.From then onwards, the coronations of English monarchs (and from 1603 that also meant Scottish monarchs, and since 1707 British monarchs) took place on the throne and the stone. For two inanimate objects, they have had a lively and dramatic history.",
        "In the 1650s, during the short-lived republic that followed the English Civil War, throne and stone were taken to Westminster Hall where the military dictator Oliver Cromwell sat upon them for his installation as Lord Protector of England.Cromwell's is not the only common posterior to have rested upon the chair. Until the 1850s, members of the public were allowed to sit on it briefly, if they paid a few pence for the privilege.Over time it has suffered at the hands of initial-carving vandals, leading to regular restoration work. ",
        "In the 18th and 19th centuries, the chair suffered particularly badly from graffiti. One impudent visitor carved: 'P. Abbott slept in this chair 5-6 July 1800'.After a thick brown varnish was added in 1887 for Queen Victoria's golden jubilee — wrecking the remaining gilding in the process — it's no wonder the great Gothic Revival architect Sir Giles Gilbert Scott described the chair early in the 20th century as 'mutilated'.In June 1914, on the eve of World War I, militant suffragettes fighting for women's right to vote exploded a bomb in the Abbey.No one was injured, but it damaged a corner of a lion leg. In World War II, fears of a German invasion — or damage from the Blitz that was raining bombs on London — led to the chair being removed for safe keeping to the crypt of Gloucester Cathedral for the war's duration.The presence of the Stone of Destiny in Westminster Abbey was a source of contention for Scottish nationalists, and on Christmas Day 1950, four students from Glasgow University broke into the Abbey and retook the stone. While struggling to get it out, they dropped it, breaking it in two.The students gave the two pieces to the Scottish Covenant Association, who were campaigning for a Scottish Parliament, and they had it repaired. Four months later, they handed it over to the police, who returned it to Westminster.",
        "There it remained until 1996, when, on the 700th anniversary of Edward seizing it, John Major's government returned the stone. It is now on display in Edinburgh Castle along with the Scottish Crown Jewels. Major returned the stone to its native land on one condition: that it would come back to Westminster whenever it was needed for a coronation.Today it takes its former place beneath the Coronation Chair as His Majesty Charles III prepares to sit where so many of his predecessors have sat before."
    ]
}