{
    "articleURL": "/wires/reuters/article-12049443/Klay-Thompson-grabs-spotlight-Warriors-series-Lakers.html",
    "content": [
        "Klay Thompson poured in a game-high 30 points in 31 minutes, the Golden State Warriors held Anthony Davis to 11 and the defending champions evened their Western Conference semifinal series against the Los Angeles Lakers at one win apiece with a 127-100 shellacking Thursday night in San Francisco.",
        "The best-of-seven now moves 400 miles to the south, with the seventh-seeded Lakers hosting Game 3 and 4, beginning Saturday night.Dominated by Davis and a huge disparity at the free-throw line in Game 1, the sixth-seeded Warriors left no doubt in the rematch, following up a 41-point second-quarter explosion with an even bigger bang -- a 43-point third quarter.After being harassed into 9-for-25 shooting overall and 6-for-16 on 3-pointers on Tuesday, Thompson drilled 11 of his 18 shots, including 8 of 11 3-point attempts, in a much better Game 2 performance.The 30-point night was the 17th of Thompson's postseason career and he made at least eight 3-pointers for the sixth time, which extended an NBA record.Stephen Curry backed Thompson with 20 points and a game-high 12 assists, the third-most he's ever had in a playoff game. He took just 12 shots, making seven, and added to Golden State's 21-for-42 effort on 3-pointers by shooting 3-for-5.Pressed into starting duty with Kevon Looney limited by an illness, JaMychal Green hit three 3-pointers and contributed 15 points to the Golden State cause. Draymond Green chipped in with 11 points, a game-high 11 rebounds and nine assists, while Andrew Wiggins had 11 points and Moses Moody 10.The Warriors, who trailed by as many as seven in the first quarter, not only outscored the Lakers 63-30 on 3-pointers but also matched them 10-10 in free throw points. Los Angeles had run up a 25-5 dominance in points at the line in Game 1.",
        "Green also drew the bulk of the defensive assignment on Davis, who shot 5-for-11 and finished with the third-fewest points of his postseason career to go with seven rebounds. Davis led the way in the Lakers' Game 1 win with 30 points and 23 rebounds.LeBron James paced the visitors with 23 points and Rui Hachimura, bombing in 4 of 6 from beyond the arc, had 21. D'Angelo Russell added 10 points and a team-high eight assists for the Lakers, who lost just two games in the first round against Memphis, and responded to each with a double-digit victory.--Field Level Media"
    ]
}