{
    "articleURL": "/sport/nba/article-12051147/Patrick-Beverley-Russell-Westbrook-want-NBA-championship-rings-LA-Lakers-win-2023-title.html",
    "content": [
        "Patrick Beverley and Russell Westbrook were traded out of LA in FebruaryThe team has been thriving without them, and is in the second round of playoffsDailyMail.com provides all the latest international sports newsSince the Lakers traded away Patrick Beverley and Russell Westbrook this February, the team has been objectively better.",
        "Nonetheless, if LA goes the distance this postseason, the pair think they deserve some hardware.Speaking on his eponymous 'Pat Bev Pod' this week, Beverley said he ran into Westbrook at the gym and the pair agreed that they should be recognized if the Lakers' season ends in a championship.'Russy goes, 'Hey, Pat. Lakers win, I want my ring,'' Beverley said.'I ain't gonna lie, Russ. We're going to be suited and booted, boy,' Beverley recalled himself saying. 'I'm going to be right there, waiting on that ring.'",
        "The Lakers went just 25-30 before Beverley and Westbrook were dealt away in separate deals, but finished the regular season 18-9 without them, earning the No. 7 seed in the Western conference before qualifying for the playoffs via the play-in.  That success has carried into the postseason, where the Lakers beat the Grizzlies in the first round and are now tied 1-1 with Golden State after two games on the road.While Beverley and Westbrook played heavy minutes for LA, the results were mixed at best.Beverley averaged just 6.4 points on 40.2 percent from the field this season in 45 contests, while Westbrook averaged a similarly inefficient 15.9 points (41.7 percent) while leading the team in turnovers.Ultimately, sending Beverley and Westbrook away and replacing them with the shooting of D'Angelo Russell in the backcourt - among other moves - certainly played a role in keeping the Lakers alive.",
        "The pair ended their seasons with the Bulls and Clippers respectively after both were bought out following their trades away from LA.After getting blown out 127-100 on Thursday in Game 2, the Lakers will host Game 3 at home on Saturday. "
    ]
}