{
    "articleURL": "/wires/ap/article-12047341/Spain-expresses-backing-Colombia-peace-plan.html",
    "content": [
        "MADRID (AP) - Spanish Prime Minister Pedro Sánchez on Thursday gave his full backing to Colombian President Gustavo Petro´s peace plan aimed at reaching a cease-fire with the National Liberation Army (ELN) guerrilla organization.",
        "Speaking after talks with Petro, who is on a state visit to Spain, Sánchez said he had conveyed Spain's commitment \"to support his ambitious plan and courageous project for total peace\" in Colombia.Spain is a third party in Colombia's ongoing talks with the ELN, a communist-inspired military force that remained active after the dissolution in 2017 of the FARC, a larger group that spent decades in conflict with the government.Colombia and the ELN started talks in November, shortly after Petro, an ex-rebel, was elected as Colombia's first leftist president.Petro has called the talks a cornerstone of his effort to resolve a conflict that dates back to the 1960s.Last week, ELN militants killed nine Colombian soldiers in an attack, complicating negotiations. Talks restarted in Havana on Tuesday.",
        "Petro said that depending completely on how the talks go and what progress is made in establishing a lasting cease-fire, Spain might be able to help persuade the European Union to consider taking the ELN off the terrorist lists.He said this could help the ELN to \"acquire a genuinely political status, obviously maintaining more and more secure negotiations towards the definitive abandonment of violence.\"Sánchez, a Socialist, said the two also discussed the summit between the EU and Latin American countries in July in Brussels.",
        "The summit will come in the early days of Spain taking charge of the EU´s rotating presidency, a six-month period in which Madrid aims to revitalize Europe´s relations with Latin America.Petro said it was important that the summit \"should not be just one more meeting, but rather a milestone, a change of phase in the economic and political relations between the two regions.\"Spain and Colombia also signed a series of accords in areas including rail infrastructure, aeronautics, digital connectivity, crime cooperation and education during the visit.Sánchez said Spain would make 1 billon euros ($1.1 billion) available for financing projects involving Spanish companies in Colombia.The two also discussed the need to step up the global fight against climate change. Sánchez said the battle was \"a priority for both governments\" and welcomed Colombia's decision to join the International Drought Resilience Alliance.The alliance, promoted by Spain and Senegal in the COP27 meeting last November in Egypt, now has more than 30 nation members and works toward shifting from crises management to drought preparedness.Spain is in the middle of a prolonged drought after a record-hot 2022."
    ]
}