{
    "articleURL": "/sport/racing/article-12054291/Kentucky-Derby-favorite-Forte-SCRATCHED-just-hours-big-race.html",
    "content": [
        "Forte was listed as a 4-1 favorite before being pulled out on Saturday morningThe decision to pull him was made at around 9am ET, just hours before the raceDailyMail.com provides all the latest international sports newsKentucky Derby favorite Forte has been scratched from Saturday's race after a tumultuous week at Churchill Downs.",
        "Four other horses were previously pulled out, bringing the total in the field to just 18.Forte, who stumbled during training on Thursday, was seen in video this morning from ACCN reporter Will Clark having his leg looked at by a state racing commission vet.Separately, four horses died in the leadup to the race, with the track calling the deaths 'unusual and unacceptable.'Forte was listed as a 4-1 favorite before he was scratched. ",
        "Forte owner Mike Repole and trainer Todd Pletcher were seen in discussion with the state racing commission this morning as a decision loomed.And the decision to scratch Forte was made around 9am ET following a morning workout Saturday.Four horses died in five days in the buildup to the race.Derby entry Wild on Ice suffered a fatal hind leg injury and two horses died Tuesday after collapsing as part of the same race card: Take Charge Briana, trained by D. Wayne Lukas, and Chasing Artie. Parents Pride had a leg injury and was euthanized on Saturday.Churchill Downs ordered full necropsies of the deceased horses and said Trainer Saffie Joseph Jr.'s  horses died suddenly of unknown causes while the other two died as the result of 'musculoskeletal injuries from which they could not recover.''We take this very seriously and acknowledge that these troubling incidents are alarming and must be addressed,' a statement from Churchill Downs said. ",
        "'We feel a tremendous responsibility to our fans, the participants in our sport and the entire industry to be a leader in safety and continue to make significant investments to eliminate risk to our athletes.'"
    ]
}