{
    "articleURL": "/tvshowbiz/article-12045453/Chelseas-Ben-Chilwell-appears-split-Cartia-Mallan.html",
    "content": [
        "Glamorous Australian model Cartia Mallan and her Chelsea football star boyfriend Ben Chilwell are at the centre of split rumours. ",
        "This comes just three months after the couple publicly confirmed their relationship on Valentine's Day. Rumours have been swirling that they are no longer together after claims that the influencer, 24, wiped all photos of him from her Instagram page. The $89m football player, 26, was also rumoured to have deleted all photos of her from his account, according to the Influencer Updates Instagram page. However on closer inspection, photos of the pair together remain on their social media.  ",
        "Cartia also posted a TikTok video on Wednesday showcasing her new bleach blonde hair. In the clip, she is lip syncing to Taylor Swift's Look What You Made Me Do as her hair transforms from a dark brown to blonde.The couple went Instagram official three months ago when Cartia posted a photo of them kissing to celebrate Valentine's Day.",
        "The image was taken in front of a fire during what appears to be a romantic getaway.Mallan also showed off a giant bunch of pink and red roses, presumably given to her by the 26-year-old left-back.A few days after this, the Chelsea Premier League star posted a shot of him kissing his partner on the cheek in what appears to be a restaurant or bar.He captioned the photo: 'Recently' - with Mallan quickly replying with her nickname for him as she commented, 'I love you Benjaween.'",
        "Despite only going public with their relationship in February, their romance was first rumoured last October.Mallan was seen wearing her man's checked shirt while they partied in a Dubai nightclub in footage posted on the Instagram page of one of the footballer's friends.The Aussie was also seen admitting to being nervous while dressing up for a date with the star in a separate clip.And when Mallan shared a video of her new life in London in October, shortly after moving to the English capital, fans pointed out that she was visiting Chilwell's home in Leicester for a private dinner, where the football star treated them to homemade cocktails.Chilwell previously dated Scott Disick's model ex Holly Scarfone.The pair were spotted holding hands in June at popular Los Angeles restaurant Nice Guy before taking the party to local nightspot Bootsy Bellows.",
        "He was also previously linked to Lewis Hamilton's former flame Camila Kendra after eagle-eyed fans spotted her at at his house.Meanwhile, Mallan was recently linked to Raff Law, son of Jude Law and Sadie Frost and Australian Rules Football star Bailey Smith.In February 2020, Mallan announced that she and model-turned-Netflix star Josh Heuston were going their separate ways after two years together.She said that she was mentally exhausted with all the fighting and said they both felt it was the best thing to do."
    ]
}