{
    "articleURL": "/news/article-12046421/Banker-accused-voyeurism-says-looked-toilet-cubicle-make-sure-no-one-there.html",
    "content": [
        "Alexey Ostapchuk, 32, said he went into the women's toilets to vomit in privateThe banker said he went into Cannon Street Station toilets while drunkA Russian banker accused of spying on a woman in a railway station toilet told a court he only looked over the cubicle partition to make sure no one was in there.",
        "Alexey Ostapchuk, 32, explained that on December 10, he had drunk so much he needed to be sick - and entered a toilet in Cannon Street Station to do so in private.He told jurors at Inner London Crown Court he had drunk a bottle of red wine and three double shots of whiskey before the alleged incident.Yesterday the court heard how the terrified woman fled the busy station in a panic after 'catching a Russian banker staring at her from over the cubicle'.Ostapchuk, who lives in a £850,000 City of London apartment, said on Thursday: ‘I had a conference call at 7:15am. I then left work much earlier than normal, at around 5:30 in the evening.",
        "‘It was a busy period and I wanted to relax and I decided to have some wine. It was red wine, a sweet red wine, which I opened. I drank the full bottle of wine.‘I’m not a heavy drinker, or a usual drinker, but on that specific evening I just wanted to unwind after a very stressful and busy period I had in the weeks before.’Ostapchuk said he had consumed the bottle in ‘around 90 minutes’.He added: ‘When I finished the bottle of wine, I also had some whiskey. It was a pretty old bottle - the end of the bottle - which I drank up.",
        "‘I think it was around three double portions, something like that.‘I was quite drunk. Then I thought I would go for a walk.’Ostapchuk confirmed that he was originally born in Ukraine and moved to Moscow when he was four years old with his father.He first became a resident in the UK in 2011 to do a one-year master’s degree in financial accounting at a business school at the University of Oxford.The banker returned to Moscow to work at the Swiss bank UBS as a financial analyst, before being promoted and working in their London offices in Liverpool Street from mid-2017.During the lockdown period Ostapchuk said he had developed a habit of walking around Aldgate East, where he lived, and the central London area.‘I left my home address shortly after 8pm. I bought a bottle of Jack Daniel’s and had some of the bottle.‘I started to feel sick, I realise I was about to vomit. So I realised that I need to use the washroom and I went to the station to be sick.‘I just ran into the door that was there without paying attention to my surroundings. I just went into the cubicle. I vomited quite intensely.‘I didn’t go there intentionally, I just rushed to the first open door there and I went straight in the cubicle to be sick there.",
        "‘I was first sick and then I passed out after being sick. I just remember waking up at a later time in that cubicle. I don’t have any recollection.‘I found myself in that cubicle, I saw that I vomited on myself and on the floor and that made me embarrassed and worried.‘So, I wanted to be alone then and also walk out without encountering anybody. I tried to clear up a bit.‘I thought I’d better check if there is anyone [around me]. I was embarrassed because I vomited on the floor in that cubicle so I thought I could get in trouble with the cleaners.‘I tried to look over the top of the cubicle door and over the main area of the washroom to be able to go out without being seen by anyone.",
        "‘I stood on my tiptoes and tried to peer over as best I could.‘It seemed to me that there was some person very briefly who was there, I left very briefly. It was only some figure, things were quite blurry for me.‘I didn’t see that person clearly, I didn’t understand.‘I didn’t look in the adjacent cubicles at any time. I didn’t notice anything. At the time I didn’t realise someone was there.",
        "‘I didn’t look at her [the complainant] doing a private act at any stage, I wasn’t aware that she was there in that washroom.‘I might have also jumped a little bit [standing on the toilet seat].‘Then I walked out and I was still not well, I washed my hands, I washed my face and headed out of the station.’After exiting Cannon Street station to have a cigarette, Ostapchuk went back into the women’s toilet, he claims, to alleviate himself.He said: ‘I went back to the toilet to pee.‘I went back into the toilet, I just went automatically back to the same toilet I had used earlier and went into a cubicle and started peeing there, a different one to before, a cleaner one.‘I didn’t want to go to the one I was escaping from just before.‘In the middle of taking a piss, I heard someone shouting something and it seemed to me knocking on my cubicle door. I went out straight after I was done using the facilities.‘I’m not sure I could understand at the time what was shouting. I think they told me I had entered the wrong toilet‘I was ashamed of finding myself in this situation.’At the time of his arrest at Cannon Street station, bodycam footage showed Ostapchuk apologising a number of times for being in the wrong bathroom.",
        "He told officers: ‘I’m sorry I keep getting a mistake. I made a mistake to go to the bathroom. I am extremely sorry. I was not aware that this was like * I don’t know.’The arresting officer replied: ‘There’s quite an obvious sign.’Ostapchuk said: ‘I’m drunk. I’m super sorry. It’s my first experience with police. For now I’m going to be super, super careful.’He confirmed that he had not taken any illegal drugs, ‘just alcohol’.Denying ever being in trouble with the police before, Ostapchuk said ‘I’m super sorry’.He claimed to have been drinking mostly at his home in Aldgate.When asked what brought him to Cannon Street, he replied: ‘Just walking around, looking for a pub’.Commenting on his behaviour with the police, Ostapchuk told the court: ‘I realised I had entered the wrong toilets and I accepted that. I explained I would be ready to take responsibility for that and pay the fine.‘I wanted to cooperate as best I could.‘I didn’t understand what they [the police] were referring to. I was still quite drunk, but having been surrounded by police woke me up a little bit.‘I didn’t watch anyone at all. I did not watch, did not try to watch, did not want to watch, anyone there at any other time.’",
        "Ostapchuk, of Allie Street, Aldgate, denies voyeurism.Friends and ex-colleagues of former UBS banker Alexey Ostapchuk gave a series of character references in court.Natalia Shchukina said: 'He is a good friend of mine.'I feel he is a very trustworthy person. I do not have any doubts about his character.'He is quite traditional. He is educated. He is a little shy.'He is not much of a drinker.'He's got a very good heart. I can only say good things about this person.Asked how she reacted when she learnt about the allegation against Ostapchuk she said she was 'surprised' and 'shocked'.'It is not something I ever thought he would do. He has only ever been a gentleman to everyone I know.'Anastasia Solonitsyna, who worked with Ostapchuk at the Swiss investment bank UBS, said: 'He is an exceptional friend. I cannot think of a friend whose selflessness matches his.''I have never seen him drunk or anything like that. He might have had a couple of glasses and that's it.'I trust him completely.'Asked how she reacted when she was told that he had been charged with voyeurism, Ms Solonitsyna said: 'I was stunned, and I'm still stunned.''He is shy, but a very respectful and romantic person.''I believe I know him very well.'James Malcolm, who was Ostapchuk's line manager at UBS up until he lost his job after the allegation was made, said the banker asked to come and see him at his home.'He was very distressed. I was completely taken aback.'I had no qualms about Alexey being around my family,' Mr Malcolm continued.'He is introverted, socially awkward, but very generous. He would always bring gifts around even when we told him not to bring gifts.''He was always very happy to put in extra hours. He was very diligent. He was one of those employees I needed to tell to do less rather than more.'I felt a responsibility towards him.'He was in a very unfortunate position. He was particularly vulnerable as a non-UK national.''He's a very decent character. Someone you would want to help.'The trial continues."
    ]
}