{
    "articleURL": "/femail/article-12052083/Steve-Bland-says-late-wife-cancer-podcaster-Rachael-want-happy-new-family.html",
    "content": [
        "Radio 5 Live presenter Rachael Bland died in 2018 after breast cancer battleHer husband Steve Bland has since remarried and had twins with new wife AmyWith a newborn twin apiece, sitting on the huge sofa overlooking their Cheshire garden in full spring bloom, Steve Bland and his wife of nine months could not be happier.",
        "The babies were conceived on their wedding night last August — an incredible blessing, given that Amy was almost 40 and Steve 41.Both were delivered healthy, by planned Caesarean section, at Wythenshawe Hospital, Manchester, on April 17, with Ruby weighing 6lb 10oz and Luca an equally robust 6lb.Despite having survived on next to no sleep for more than two weeks, the couple are beaming with happiness... until the conversation turns to Steve's first wife, who died when their son, Freddie, was just three.'I have so much empathy now for how she must have felt towards the end,' says Amy, gazing at little Luca, asleep in her arms. 'Knowing that she was leaving her son... I could burst into tears just thinking about it.'",
        "Steve's first wife, the much-loved Radio 5 Live presenter Rachael Bland, died in September 2018 following a very public journey with breast cancer. She was one of the creators of the hugely popular BBC podcast You, Me And The Big C, which she launched with Deborah James, who died from bowel cancer last year, and Lauren Mahon, the only one of the trio to survive her cancer diagnosis.The first time I met Steve was a few months after Rachael's death, and a pall of grief and sadness hung over him as he admitted that Freddie, who was playing quietly on the floor with his Lego, was the only reason he dragged himself out of bed most days.",
        "Now, the scene that greets me on arrival at the light and airy home that he and Amy bought last year, with a football net in the garden and a double buggy in the kitchen, couldn't be a bigger contrast.Amy opens the door wrapped in a bath towel, laughing: 'This is what you get when you visit someone who gave birth to twins just a fortnight ago.'Lively, loving, funny and clever — she is an advanced nurse practitioner in oncology with a string of academic papers to her name — and now stepmum to seven-year-old Freddie, who's relishing being a big brother. You don't need to be religious to wonder whether Rachael had a hand to play in all this.Does Steve feel any guilt? Not that he has cause to, but we have little control over our subconscious minds. 'I get quite annoyed when I'm asked about guilt because the question implies I should feel guilty,' he says.'And I absolutely don't, and never have, because all I've ever done is try to be happy. Rachael wanted me and Fred to be happy and we are, so there's nothing whatsoever to feel guilty about.'Acutely aware that Rachael would have given anything to see her son grow up, Amy, who met Steve at a cancer conference in Manchester in 2019, where he was speaking about his late wife, takes her role as Freddie's stepmum seriously.",
        "'It's a real privilege but I try not to overthink how I am with him,' she says. 'I didn't know Rachael so I've no idea how she would react in any given situation. Though from what I have heard I think, like me, she was a firmer parent than Steve, who is a big softie. I can ask myself, \"What would Rachael do?\" but I'm never going to know, so I just have to do what I feel is right.'Steve never compares me to her as a mum because he says that wouldn't be fair on me.'Sadly, but totally understandably, Freddie's memories of his mother are fading and, on occasions, even though Amy and Steve talk to him about Rachael often, he slips and calls Amy 'Mummy'.Amy anticipates that might happen more often as the twins start talking and saying 'Mummy' themselves, but she is happy to go along with whatever he decides he wants to call her.Freddie, it turns out, has quite set ideas about things. He'd been asking his dad and Amy for a sibling for some time and, like everyone, he thought they were joking when they told him he was actually getting two.'Then he said: \"Thank you! Thank you so much!\" ' remembers Amy.",
        "Tearing up, Steve adds: 'I took him to the hospital on the day they were born and he leaned over them, held their hands and whispered: \"I'll always look after you\". It was adorable, which is his favourite word for them.' Although life at the spacious, four-bedroom family home in Knutsford, Cheshire, now inevitably revolves around feeding and changing times, Freddie — for now — seems delighted with his new siblings.Amy and Steve are, however, realistic and anticipate the novelty will wear off soon enough. 'It's really difficult,' says Steve. 'For all the best reasons he's been doted on by everyone — for years he was an only child and had my undivided attention.'After Rachael died people we didn't even know sent him presents and all of a sudden he has to share us with two babies who are, by their very nature, incredibly demanding. It wouldn't be weird if we saw some behaviour changes.'Amy agrees: 'It's really important he still gets time alone with Daddy, because that's what he's used to.'So much has changed for Freddie. I'm breastfeeding and expressing milk around him and, of course because he's not biologically mine, that feels like a different boundary. I hope Rachael isn't looking down on me and thinking: \"Don't flash my son!\".'",
        "Steve laughs uproariously at this — a wonderful scene that I would have found impossible to imagine when I first met him. Freddie has a wide and loving extended family nearby and still sees his grandma, Rachael's mother Gayna, as often as possible. She was a guest at Steve and Amy's wedding and one of the first people they told when they learned that they were expecting twins.'Gayna has gone through the worst thing anyone could experience and is very much part of our family,' says Amy. 'She's excited about meeting the twins... it'll be lovely to see her.'Spending time with his maternal grandmother, who lives in Wales, is one of the many ways of ensuring Freddie still feels close to Rachael.He has the awards she won for her podcast, and the awareness-raising work she did, in his bedroom, where Steve and Amy also put up a framed photograph of the two of them together.'When we went into his room one day he'd faced the picture down,' says Amy. 'He said it made him feel sad.'We told him he didn't have to keep it in there if he didn't want to, and we will just revisit the subject with him another time. His school has been really good, too. He has time out of the classroom every fortnight when he can talk with the pastoral lead about Mummy, the twins, whatever he wants.'",
        "Freddie is not the only one to experience challenges getting his head around having not one but two new babies in the house. Steve confesses that, of all the things that crossed his mind before that first scan, multiple babies wasn't one of them.'Afterwards, we just sat in the car in stunned silence until one of us said: \"What just happened?\".'Steve had not been too concerned about their chances of conceiving, taking the view that what would be would be — a legacy, he says, of dealing with Rachael's illness after she was first diagnosed in 2016. 'I've learnt to focus on the stuff I can control and not worry too much about the stuff I can't,' he says.Two weeks after their wedding — and just before they went on honeymoon to South Africa — they found out Amy was pregnant. 'The land of wine and steak, and I couldn't have either, because I like my steak very rare,' says Amy wryly.'I expected it to take a while to conceive and feel quite guilty that it happened without trying, because I know so many people go through lots of IVF.'But I'm so, so happy and grateful. Every night when we go to bed I think \"Thank you, whoever, for this incredible blessing\" because I just feel so lucky to have my wonderful family.'It's tiring, obviously, but it's amazing how you get used to living on no sleep. A sentence I never thought I'd utter, because I loved a lie in, is: \"I had a full three hours last night — and I feel great!\".'Other than nausea in the first trimester and a 'hellish 48 hours' at 36 weeks, when a scan detected water around Luca's heart — which could have indicated a heart problem or Down's syndrome, but turned out to be 'insignificant' — the pregnancy was straightforward.Steve would have liked to have found out the gender of their babies before the birth, but Amy insisted on it being a surprise — and they were both ecstatic to get 'one of each'.At the moment, neither parent is thinking much beyond the next feed or nappy change, but Steve is due back at work, doing PR for a rugby club and producing podcasts, in a week's time.After being widowed, Steve took over presenting the You, Me And The Big C podcast, talking about navigating life with cancer and loss from his perspective, but its future has been up in the air since Deborah's death, from bowel cancer, last June.'It felt like the right time for Lauren and me to stop talking about our experiences,' says Steve. 'Lauren is five years clear [of breast cancer] now and it's nearly five years since Rachael died, so we're not in the trenches any longer. The podcast needs new blood, so we're chatting to 5 Live about what they want to do next.'",
        "Lauren is one of the many friends who supported Steve through the darkest times and are thrilled to see his life now transformed.'One mate told me how unwell I'd looked when Rachael was ill, and for a year after she died, so unhealthy, with no spark,' he says. 'He told me how happy he is to see me get some of it back.' Amy looks at him in mock outrage. 'Some of it back? Back in abundance, more like!' she says, laughing.Easy in each other's company, the couple say they have no strict parenting regime at the moment: 'We'll just be doing the \"Keeping them alive and healthy regime\",' says Amy, and from what she knows of Rachael, she believes the two women are likely to have had similar approaches to raising Freddie'Last night, for example, he didn't eat something, so Steve thought he didn't want it and put it in the bin. Then Freddie got in a big huff and ran off to sit by the window.'I said: \"Freddie, that's not an OK reaction, we'll just get you something else to eat.\" And he snapped straight out of it and was fine.Steve admits that, with their shared passion for sport and history — their first trip as a trio, with Amy, was to the Titanic museum in Belfast — the strong bond he and Freddie formed in the aftermath of Rachael's death can be more like a friendship at times, so he can struggle to play the role of disciplinarian.One thing they're both agreed on, however, is that there's nothing 'half' about Freddie's relationship with Luca and Ruby. Amy reminds Freddie that, while his eyes aren't blue, like the rest of the family's, they are 'special, beautiful brown eyes, a gift from his mummy'. She would never dream of referring to the twins as his 'half-siblings'.'There's no \"dummies' guide\" to being a step-parent to a bereaved child or marrying a widower,' she says. 'You just have to work on instinct — and we're all one family now.'Steve agrees: 'We've definitely not nailed this; we're not some gurus at dealing with this situation. We're just trying to do the best that we can, aware that it might turn out not to be enough.''I'm going to cry now,' he says, reaching for a tissue. 'There's a picture of the twins, taken on their first day lying next to each other, and when I looked at it I thought \"How on earth, five years on from Rachael's death, am I so lucky to have these little bundles of joy? After everything I've been through?\"'That's why I want to share this experience, so someone in the position I was in five years ago — isolated, lonely, and in a tunnel with no light at the end — can have hope.'I'd love people in that situation to look at a photograph of us and think: \"Life can be happy again\".'"
    ]
}