{
    "articleURL": "/money/investing/article-12052067/What-Black-Scholes-Investing-Explained.html",
    "content": [
        "In this series, we bust the jargon and explain a popular investing term or theme. Here it's Black-Scholes. ",
        "What is this?The Black-Scholes model – its full name is the Black-Scholes-Merton model – is an equation widely used by hedge funds and others to estimate the value of a derivative – a security that derives its value from an underlying entity, such as a share. Options are the best-known derivative. A call option gives the holder the right to buy a share at a specific 'strike' price by a certain date; a put option gives the right to sell.Despite the huge level of risk involved, trading in options can exceed trading in stock on some days in the US, and Black-Scholes helped spark this revolution.Why are we reading about it now?This month is the 50th anniversary of the controversial equation's first appearance.It was outlined in an article published around the time of the opening of the Chicago Board Options Exchange in 1973.",
        "The authors were US economists: Fischer Black, Myron Scholes and Robert C Merton, son of sociologist Robert K Merton, the academic who coined the phrase 'self-fulfilling prophecy'. Traders on the exchange soon began to use the equation.Such was the speed of adoption that the perception of options, previously regarded as the worst kind of gambling, altered.Investors forgot the risks, which sowed the seeds for subsequent crises that threatened the global financial system. In 1997, Merton and Scholes scooped the Nobel prize for economics (Black died in 1995).",
        "How does it work?The equation is complex, with various factors being taken into account in the valuation of an options contract: the current price of the shares, the dividends that will be paid out, the strike price of the option, the time to the expiration of the contract, interest rates and expected volatility.Traders use online calculators rather than doing the maths.Did Merton and Scholes make money from this?They joined Connecticut hedge fund Long-Term Capital Management (LTCM). The fund's rise and catastrophic fall – at its height it had $100bn worth of investors' cash – is chronicled in the book When Genius Failed by Roger Lowenstein.For a period, LTCM provided returns of 40 per cent-plus a year. But in 1998 losses mounted as a result of exposure to the Russian debt crisis and the fund's absurdly high levels of borrowing. Such were the concerns about banks' exposure to LTCM's options contracts that the Federal Reserve of New York organised a bail-out by creditor banks.Merton and Scholes were not traders, but they were considered to be the fund's philosophical fathers.Did this discredit the model?Investors wanted to believe a surefire way to make money had been invented.As one bank put it, LTCM's lenders were 'mesmerised by the supermen' behind the fund. It is a cautionary tale but subsequent crises show lessons have been learnt.",
        "The Black-Scholes model has its shortcomings, but it remains popular because it is held to be an effective means of calculating value. Since some of the funds in which you have your savings are likely to invest in options as a way of optimising returns, you must hope that the managers are taking steps to lessen the risks.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}