{
    "articleURL": "/sport/racing/article-12056305/Jockey-Libby-Hopwood-slams-racing-industry-ahead-Dean-Hollands-Flemington-funeral.html",
    "content": [
        "Jockey Libby Hopwood is in mourning Dean Holland died in a fall on April 24 Left frustrated at the 'racing machine' Former top jockey Libby Hopwood has mourned people being 'eaten up' by the relentless 'racing machine' in the wake of her fellow rider and close friend Dean Holland's tragic death last month.  ",
        "Holland died after a sickening fall in country Victoria on April 24, leaving behind wife Lucy and four children under five: Harley, Luca, Frankie and Lily. He is set to be farewelled at a funeral at Flemington Racecourse at 2pm on Monday. Hopwood, who became a respected commentator with Sky Racing after an early retirement, rode alongside the South Australian native for many years and is struggling to comprehend the tragedy.The 36-year-old has worked in many facets of racing and told Daily Mail Australia she is growing sick and tired of the industry chewing up and spitting out participants - or in the worst case, continuing to plough ahead despite horrific deaths like Holland's.  ",
        "'I'm having a love-hate moment with racing again. I've sort of taken a bit more of a step back, as much as I can whilst doing the form that I need to do, because of Dean's passing,' said Hopwood, who runs as tipping service as well as her regular work with horses. 'It's weird because I love racing, I've given everything I can to racing and I'm grateful for racing because I'm on my fifth iteration of careers within racing. 'But I just don't like that people can literally die just going to work and leave behind an entire family - and the industry just continues like it's just a small blip.",
        "'Horses just have a different rider put on and it's just back to business; but there's a whole family and friends that have been absolutely devastated, and four little kids that aren't going to know their father by the time they grow up.'That's been my hardest thing to reconcile ... the machine just continues on. I've had four friends now that have just been eaten up [died in racing] and it keeps going. 'What's the dollar value of someone's life? So $1.7million [the amount a GoFundMe has raised for Holland's family], yes, the racing industry has given and given and it's been amazing, but it's still not enough.'",
        "Making it even tougher for many to comprehend was the fact Holland was in the form of his life.He'd won his second Group 1 in the Newmarket just weeks prior - though in a twist of fate that only came about after original jockey Jamie Kah was seriously injured in a fall just hours prior - and won 82 races for the season in Victoria.Holland's coach and mentor, ex-rider James Winks, even revealed that hours before tragedy unfolded he was in the process of applying for a dream gig in the glamorous Hong Kong racing industry. After years of toiling around country and metropolitan tracks all across South Australia and Victoria, the sky was the limit.",
        "Hopwood, like many others, is heartbroken not just about the loss of her mate, but the fate of a jockey ready to take the world by storm. 'Dean was the sweetest, funniest, hard-working guy. He was he was a bit of a battler, and he f***ing worked hard,' she said. 'One of the thoughts that I struggled with, is that he got the ride on Jamie's [Kah] horse [In Secret] and rode it beautifully and could showcase his ability and things were going to kick on again for him because he would have been given the opportunity because he's he's suddenly back on people's radar.'He was an absolute sweetheart and just a f***ing legend.'",
        "Ex-South Australian jockey Scott Bailey, who is now a race caller in Singapore, echoed those sentiments after Holland's death with a touching tribute to a man loved and respected by so many. 'He was naturally talented from the start, even though the saddles weighed twice what he did,' he told Racing.com.'He was just the nicest person too. He always offered support and I was so proud to see him win his Group 1s after the times we would ride around the non-TABs and celebrate a country cup like it was a Melbourne Cup ... but his best accomplishment was his partner Lucy and their four beautiful children.'",
        "Unfortunately, Hopwood knows the tragic side of racing all too well. On October 15, 2014 at Murray Bridge, Hopwood was riding the Grant Young-trained runner Barigan Boy alongside close friend Caitlin Forrest when the latter's mount buckled, sending the pair into the turf, as well as senior jockeys Adrian Patterson and Justin Potter, who were both physically uninjured. Tragically Forest, a 19-year-old apprentice, died as a result of the horrific fall, while Hopwood was seriously injured: suffering bleeding on the brain, broken collarbone, fractured shoulder, fractured vertebrae and a punctured long.That tragedy came just over a year after another South Australian jockey, Simone Montgomerie, died after a race fall in the famed Darwin Cup meeting, leaving the Adelaide and Northern Territory jockey rooms reeling. Montgomerie left behind a then five-year-old daughter, Kodah. Despite a desperate battle to return to racing, Hopwood's brain injury did not improve enough for her to be cleared by racing officials, and she was eventually forced to retire. ",
        "But it is the scars from losing two very close mates that will never heal for Hopwood, and are opened up again every time a jockey is lost just going about their day job like any other person would do. She isn't sure how she would react to Holland's passing if she was currently riding, but points to the fact that all people grieve differently.",
        "While Patterson was relatively unscathed physically after the fall that claimed Forrest's life and ended Hopwood's career, the burden eventually became too great for him to continue on after he suffered another fall just months later. At the time he said he was 'lucky' because he 'got to go back home to my family' while Forrest, heartbreakingly, didn't. It's a stark reminder of how much jockeys go through just to give fans something to watch and punt on.   'Obviously the fall that I was involved in, I was not in the right mind and wasn't going back to work, and I wasn't up in Darwin when Simone passed away,' Hopwood said of how she would react as a current rider to Holland's death.  'I guess everybody's going to have their different opinions (on how to grieve and how racing moves on). 'Even after our fall, one of the jockeys that was totally fine retired afterwards, because he couldn't reconcile the fact that he walked away when Caitlin (Forrest) didn't.'That being said, Holland's death has also highlighted one of the good things about racing: the community.That tight-knit racing fraternity immediately rallied around Holland's family and fellow jockeys to wrap their arms around them in support, and also insure wife Lucy and their four young children were taken care of, financially. ",
        "Hopwood said being involved in the racing industry was all-encompassing and like a second family, but she admitted it was still a struggle to wrap her head around the fact that lives are literally at stake.  'I love going into work and seeing my horses and the people that love the industry: I see all of the good side of it,' she said.'It's the community which is the good side of racing, and why the $1.7million has been raised so quickly, because they've stepped up for Dean's family.'Maybe it's a little bit of Stockholm Syndrome too, because you're only interacting with other racing participants. Your whole life is about racing. 'Trackwork all morning, you go home and you talk to your friends, who also ride track work, about the horses, and what they were doing that day. It's really hard to see life outside of racing until you're actually outside of it.'But it's really hard to reconcile the dichotomy of the awesome side of racing versus people literally dying to chase ponies around in circles.' There's a growing sense amongst jockeys that something simply must change in the wake of Holland's death, which was on the back of three very serious falls over successive weekends in Melbourne involving Hopwood's long-time friend Jamie Kah, Craig Williams, Ethan Brown and Teo Nugent.",
        "Kah is still recovering from bleeding to the brain, which left her in an induced coma for almost a week, and her partner, fellow top hoop Ben Melham, slammed racing organisers for putting 'turnover and revenue' above riders lives. Many jockeys and other participants in the industry praised Melham's comments, but for Hopwood, there were two main elements she would dearly love to see change.'Highlighting the people on the ground and the horses ... we know them so well that they're almost like people themselves. That's probably the biggest thing that needs to make racing more enjoyable,' she said.'The trolls are a huge thing as well. There has been one guy who has been posting on social media and messaging jockeys having a go at them and telling them that he hopes they fall and die like Dean Holland, all because they cost him 20 bucks. 'It would be great if you could have put those sort of people on a blanket ban with all bookies and then they just couldn't get the money out anywhere. That would be fantastic.'When I was riding, we copped it on the chin, but I'm liking the fact that riders now are putting them on blast and calling them out and saying it is unacceptable.'She's not copping it on the chin anymore.Hopwood presents raunchy tips on a popular OnlyFans page, runs a hugely successful tipping and form service as well as working with horses everyday - but is clearly enjoying not being entirely wrapped up in the cut-throat racing industry.",
        "'I've still got good friends in racing, but it's really great to be out of racing and on the periphery and go home to do other cool things instead of getting up early in the morning for bloody trackwork,' she said.  'I hope I'm introducing people to the good side of racing. I'm really trying to be a good racing ambassador, despite, like us all, having moments of absolutely hating it.'It's (tipping service) just cooled off a little bit, but it's going well. The website's still ticking over and the strike rate is over 7 per cent, which is very good. 'There's obviously a few other platforms that are doing it and some of those people have probably got bigger names than me, but I'm quite cheap, and consider myself just like a battler, and for the everyman (and woman) punter.' The fundraiser for Holland's family continues, and has now raised more than $1.7million for his wife Lucy and four young children. You can donate here."
    ]
}