{
    "articleURL": "/tvshowbiz/article-12056699/John-Legend-enjoys-quality-time-son-Miles-park.html",
    "content": [
        "He is an EGOT winning star but John Legend's top priority has always been with his family.",
        "The Ordinary People singer, 44, enjoyed some quality time with his son Miles, four, as they headed to the park on Saturday morning. The Green Light singer adorably held his youngster's hand as they made their way back to their car from a baseball game. It comes after Legend defended his wife Chrissy Teigen after Megyn Kelly shared her scathing reaction to the outfit she wore to the White House Correspondents Dinner. Legend kept it casual in a graphic-printed white hoodie and a pair of slim-fitting black pants.",
        "The Grammy Award-winning performer finished off his look for the day with a pair of sneakers and kept a duffel bag slung over his right shoulder.The singer and Teigen, 37, initially met while working on a music video in 2006, and they went on to tie the knot in 2013.Legend and his wife started a family with the birth of their daughter Luna, aged seven, in 2016, and Miles arrived two years later.The social media personality revealed that she had become pregnant for the third time in 2020, although she ultimately had to undergo an abortion in order to save her life.The influencer and her husband went on to welcome a daughter named Esti, aged three months, this past January.",
        "Kelly recently criticized the dress that Teigen wore to the White House Correspondents' Dinner during an episode of her self-titled SiriusXM show that aired this past week, during which the talk show host described the assistants who held up the train of the model's 'nonexistent dress' as 'minions.'Legend later spoke to TMZ and detailed his opinion of the former television personality's commentary. He stated: 'Megyn, you know, she likes attention. She needs it after she got fired from Fox. She has to do what she can do to get attention.'The singer went on to stated that Kelly had a politically-minded motivation for making her comments.",
        "'She pissed all the conservatives off when she asked Trump a tough question so now she's trying to figure out a way to win him back,' he said.The La La Land actor went on to describe the actions of the conservative journalist as 'desperate.' When asked if he had any recommendations for how Kelly could potentially change her behavior, he stated: 'She can just shut up.'The former television personality has not made any public responses to Legend's comments as of yet. "
    ]
}