{
    "articleURL": "/news/article-12039829/Bruce-Wassersteins-mistress-says-daughter-cut-familys-billions.html",
    "content": [
        "Lawyers representing Sky, the 15-year-old daughter of deceased billionaire Bruce Wasserstein, say his other kids are cheating her out of her inheritanceThe attorney's call the five children 'evil stepsisters'The legal war between the children of deceased billionaire Bruce Wasserstein's children and his mistress rages on, 14 years after he died following a short illness. ",
        "Lawyers representing Sky, the 15-year-old daughter that Wasserstein shared with his partner, Erin McCarthy, filed paperwork in court Tuesday accusing his five legitimate children of cheating the teen out of her birthright, reports Page Six.  In 2015, Forbes valued the Wasserstein's holdings at $2.4 billion. In the new lawsuit, McCarthy's lawyers call the five children 'evil stepsisters' in reference to Cinderella. A section of the suit reads: 'There is no Prince Charming in the Wasserstein family coming to save Sky.'The suit accuses the children of 'continuing conspiracy, through psychological and economic bullying... to deprive Sky of her rightful share of her father's multi-billion dollar estate and to ostracize her from the Wasserstein family.' According to the Page Six report, Sky has been receiving $30,000 in child support payments and also has a trust earmarked for her worth millions. ",
        "Following the filing of the suit, a statement from Wasserstein family called the legal action 'meritless' and said that the estate has been 'divided into portions of equal value for each of his six heirs, and a judge signed off on the framework of the division of assets years ago.'Wasserstein, an investment banking mogul, had a stellar career on Wall Street where he made his name as a corporate raider in the 1980s. He used some of the earnings to acquire New York Magazine.",
        "The billions he earned were poured into breathtaking property including a Manhattan duplex penthouse on Fifth Avenue and a sprawling mansion in the Hamptons.There is also a Santa Barbara ranch in California and a Parisian apartment along with the vast 26-acre Hamptons estate known as Cranberry Dune, where wealthy neighbors include Jerry Seinfeld.After he died, Wasserstein's children were ordered to split the values of the properties.But according to the papers filed in New York's Surrogate's Court on Tuesday, Sky's half-sister Pamela Wasserstein — the 45-year-old president of Vox Media — schemed with her siblings to prevent her from getting her full inheritance.The suit stated, 'This campaign against Sky has been pursued with particular zeal by Pam who serves as Sky's trustee despite a plethora of conflicts and self-dealing.'Pam, by her bullying, ostracizing and neglecting Sky … makes even the behavior of Cinderella's evil stepsisters Drizella and Anastasia seem mild.'It argued that 'contrary to Bruce's desires and intentions, the Sibling Trustees have rejected Sky's attempts to build a relationship with them' and have 'gone so far as to try to erase her from the Wasserstein family tree.'It added the siblings have never turned over the $1million Wasserstein left  Sky in his will.The filing on Tuesday marks the second time Sky has sued for her share o the inheritance.",
        "In 2019, her lawyers claimed her five half-siblings were trying to cheat her out of the value of her father's Hamptons home as they divvied up the $2.3billion estate.McCarthy, who gave birth to Sky in 2008 when Wasserstein was still married to his third wife, has claimed her half-siblings only agreed to give Sky her share of his properties if she and the girl promised never to visit the homes.Pam Wasserstein said in a 2012 court affidavit that sharing Cranberry Dune with McCarthy and Sky 'would be a source of unimaginable stress and trauma for my brothers and me.'We would rather sell these homes than live under those circumstances.'The Wasserstein children are said to believe McCarthy split up their family, and have accused her of breaking into Cranberry Dune one night when Sky was an infant. McCarthy has denied these claims.In a statement to Page Six, Sky's attorney William D. Zabel said: 'No amount of money can undo the psychological damage to a young woman who since age 3 (she is now 14) has been the target of an insidious, relentless conspiracy to ostracize her from her family.'Her co-attorney Taleah Jennings also said, 'We are seeking damages for Sky in an amount no less than $100 million, which is a small fraction of what her father left for his children to share equally.'",
        "Meanwhile, a spokesperson for the executors of the estate and the trustees of his family trust said, 'Mr. Wasserstein's estate and the family trusts were divided into portions of equal value for each of his six heirs, and a judge signed off on the framework of the division of assets years ago. 'The executors and trustees have at all times acted in accordance with their fiduciary duties. We regret that this matter continues to be litigated and will vigorously defend against these meritless objections.'"
    ]
}