{
    "articleURL": "/wires/reuters/article-12053103/Return-injured-players-buoy-Timbers-vs-Austin-FC.html",
    "content": [
        "The Portland Timbers will look for their first back-to-back wins of the season on Saturday night when they host an Austin FC team that is winless in its last six.",
        "Portland (3-5-2, 11 points) earned its first away win of the season last weekend, 2-1 over St. Louis, in a game decided by Yimmi Chara's 82nd-minute goal.And the Timbers could get a boost in their attack if Dairon Asprilla and Sebastian Blanco return from injuries.Blanco -- who earned the MLS is Back Tournament MVP honors in 2020 -- has missed the entire season with chronic knee pain, but was medically cleared to return late last month.Asprilla has been in and out of the Timbers' lineup with more minor knee issues, but he is one of three players tied for the team lead with two goals despite making only four appearances.Speaking on Thursday, Portland coach Giovanni Savarese said both were still uncertain for the contest.\"I wouldn't be able to tell you that both are going to be part of it or they are not going to be part of it. There's a good chance that they could be, so we'll see how they feel tomorrow morning, and then upon that we'll make the decisions,\" Savarese said.Austin FC (2-4-3, 9 points) had back-to-back MLS wins on March 4 and 11, but they haven't earned a victory since as they try to live up to their surprising second-place Western Conference finish in 2022.",
        "Coach Josh Wolff believes last weekend's 2-2 home draw against the San Jose Earthquakes was a step closer to returning to winning ways.Emiliano Rigoni scored his long-awaited first MLS goal, and Sebastian Driussi added his second of the season as the Verdes twice fought from a goal down to share the points.Rigoni's goal snapped Austin's scoreless run at 395 minutes.\"We certainly generated many more chances, many more clear-cut chances than them, and we've got to take those chances a little bit more cleanly,\" Wolff said. \"But progress was made, and we've got to reward ourselves with three points.\"--Field Level Media"
    ]
}