{
    "articleURL": "/wires/pa/article-12041697/Mirror-publisher-Reach-sees-online-revenues-hit-Facebook-changes.html",
    "content": [
        "Daily Mirror publisher Reach has blamed changes to the way Facebook displays news content for a drop in its digital turnover.",
        "The group – which also owns the Express newspapers, the Daily Star and regional newspapers across the UK including the Manchester Evening News – revealed a 5.9% drop in overall revenues over the four months to April 23.Digital revenues tumbled 14.5% since January.The group said the Facebook news changes has led to fewer page views from online readers and a fall in traffic across the sector. External factors continue to impact digital revenue, delivery of the customer value strategy is driving a higher quality mix, underpinned by the strength of print  Jim Mullen, Reach chief executive  The figures come as the group slashes £30 million in costs this year in the face of soaring cost pressures and weaker advertising demand.Reach last month announced plans to put 420 jobs in the UK and Ireland at risk of redundancy, including those of around 190 of its journalists.",
        "In its latest update, it said the overall market for digital advertising was “challenging”.The group said moves to deliver the cost savings were “well advanced” and it was taking “strategic action” to tackle the drop in website page views.It said revenues from print titles remained strong, falling by 3% in the four months to April 23, with sales from circulation up 2.1% due to cover price hikes in the last financial year.",
        "Print advertising revenues tumbled 19.2% but Reach said this was slightly better than it expected.Jim Mullen, chief executive of Reach, said: “External factors continue to impact digital revenue, delivery of the customer value strategy is driving a higher quality mix, underpinned by the strength of print.”The group said it expects to benefit from investment in its digital plans to tap into the US market, with almost 100 full-time roles in place and plans to launch US websites for The Express and Mirror over the next few months."
    ]
}