{
    "articleURL": "/wires/aap/article-12040773/Parents-inform-SA-cochlear-implant-review.html",
    "content": [
        "South Australian families impacted by incorrect programming of cochlear ear implants in their children will be asked to contribute to an investigation into what went wrong.",
        "SA Health on Wednesday said consultant Amanda Singleton had been appointed to head up the review which will also involve clinical expert Jamie Leigh from the Victorian Cochlear Implant Program.The review will look at why mapping issues occurred in as many as 30 children who received the implants at Adelaide's Women's and Children's Hospital.The mapping problems left the children unable to hear all the sounds necessary for learning and speech.\"We need to learn exactly how and why this issue occurred to ensure it is not repeated in the future,\" SA Health Chief Executive Robyn Lawrence said.\"It's important that the families affected have their voices heard and the opportunity to contribute to this review.\"The independent investigation will look at the systems and processes that were in place at the time, the notification and disclosure process following the discovery of the error and consider what system changes could be implemented.South Australians will have until the end of June to contribute, with the report to be made public.The children involved were under the care of South Australia's Women's and Children's Health Network (WCHN) which became aware of problems with some implants last year.A check of all 117 families in the program identified issues in about 30 children who had lived with incorrectly programmed implants for periods of up to five years.",
        "Testing showed their implants were programmed in a way that they could not hear speech sounds at a level that would allow them to learn to listen and speak.WCHN Chief Executive Lindsey Gough said the review of the cochlear implant program was welcomed.\"It's important to our health network and all of our staff that this does not occur again in the future,\" Ms Gough said."
    ]
}