{
    "articleURL": "/tvshowbiz/article-12058629/Kaley-Cuoco-gushes-natural-Tom-Pelphrey-father-daughter-Matilda.html",
    "content": [
        "Just over a month after welcoming their first child Matilda, Kaley Cuoco is opening up about how 'natural' her partner Tom Pelphrey is as a father.",
        "The 37-year-old actress started dating the 40-year-old actor in May 2022, and just five months later, the couple announced they were expecting their first child.They announced in early April that Cuoco had given birth to their daughter Matilda, and Cuoco raved about his parenting skills to People on Saturday at the Rock4EB event in Malibu, California.'I cannot believe how natural he is, how much he loves it,' Cuoco said of her partner's parenting skills.'I mean, when we were in the hospital, he did everything — every diaper, he's the swaddle king,' the actress added.",
        "'All the nurses said, \"Oh my God, you're the best guy swaddler we've ever seen,\"' Cuoco boasted.She added that Pelphrey, 'just loves\" Matilda,' while adding that, 'she looks exactly like him.;'And he has a very distinct voice, so when he talks to her, she's like 360. Her head turns around, and she's like, \"I know that voice.\" It's very sweet,' she added.The couple celebrated their one-year anniversary just a few weeks ago, with Cuoco sharing two snaps on Instagram.One image showed her wearing a white cable knit sweater and was being hugged by Pelphrey in a brown sweater.The second snap featured the actress holding the couple's newborn daughter, with Cuoco wearing overalls and a grey t-shirt and Pelphrey in a black t-shirt.",
        "'How it started how it’s going! Cheers to a year with you @tommypelphrey,' Cuoco began her caption. She added that she was 'eternally grateful for you and what we have. I love you ,bub!'Pelphrey also took to Instagram on Saturday to share two snaps of the couple himself, one black-and-white photo with Cuoco in a striped sweater and a knit hat leaning against Pelphrey in a flannel shirt, and a color photo of the couple sharing a kiss while holding 'mama bear' and 'papa bear' coffee mugs.'Happy One Year bud… best year ever. Love you more each day,' Pelphrey said in his post, adding a number of emojis and tagging Cuoco.",
        "Just over three weeks ago Cuoco took to Instagram to welcome her first child with a first snap of the newborn.'3-30-23 Introducing, Matilda Carmine Richie Pelphrey, the new light of our lives! We are overjoyed and grateful for this little miracle,' Cuoco began. 'Thank you to the doctors , nurses , family and friends who have helped us immensely over the last few days,' she added.'We are blessed beyond belief. @tommypelphrey didn’t think I could fall even more in love with you , but I did,' she concluded."
    ]
}