{
    "articleURL": "/wires/reuters/article-12048383/Greens-sue-California-changes-rooftop-solar-incentives.html",
    "content": [
        "Policies reduce credits given to solar panel owners",
        "Groups say the policy changes violate state lawBy Clark MindockMay 4 - Environmental groups have sued California regulators over new rules they say will discourage the growth of rooftop solar installations, in violation of state law.Three groups filed a petition on Wednesday asking a state court in San Francisco to review and set aside the California Public Utilities Commission´s policy changes, which reduce the money credited to rooftop solar panel owners for sending excess power they generate into the grid.The reforms were adopted in December after critics including utilities and ratepayer advocates successfully argued the perk is unfair to those without panels.The environmental groups said Wednesday that the policy changes, which went into effect last month, will \"devastate solar adoption rates\" in violation of a 2013 state law requiring the commission to encourage the growth of rooftop solar in the state. Failing to encourage growth undermines efforts to meet state climate goals, they said.The petition filed by the Center for Biological Diversity, the Environmental Working Group and the Protect Our Communities Foundation also said the new rules failed to establish a legally required fund to support solar adoption in disadvantaged communities.The Commission did not immediately respond to a request for comment Thursday.Solar industry trade groups including the California Solar &amp;amp; Storage Association have been critical of the rules changes, calling them a \"step backwards\" shortly after the Commission voted last year.",
        "A representative for utility Southern California Edison Co., one of three utilities impacted by the rules, declined to comment Thursday. San Diego Gas &amp;amp; Electric Co. and Pacific Gas and Electric, the other two, didn't immediately respond to requests for comment Thursday.The state´s old rules for so-called \"net metering\" compensated customers at or near the full retail electricity rate when they sent excess power their solar panels produced to the grid.The new rules only apply to newly enrolled solar customers and lower the compensation to match the rate utilities would have to pay to buy clean power elsewhere. The groups said the new rules slash customer credits by up to 80%, though prices vary by utility and time of day.According to the petition, the changes came amid a multi-state campaign by for-profit utilities to \"gut\" net metering programs by arguing they shift costs from wealthier solar power owners onto individuals without the panels. They claim that net metering unfairly shifts most of the costs associated with electric grid upkeep to those without solar panels, since solar panel owners have smaller bills and pay smaller fees as a result.The environmental groups said those arguments ignore benefits of the programs, including from reduced greenhouse gas emissions and increased resiliency from distributed energy production.",
        "The case is Center for Biological Diversity et al. v. Public Utilities Commission of the State of California, in the Court of Appeal of the State of California, First Appellate District, case number not immediately available.For the environmental plaintiffs: Ellison Folk and Aaron Stanton of Shute Mihaly &amp;amp; Weinberger, Caroline Leary of the Environmental Working Group and Roger Lin, Anchun Jean Su and Howard Crystal of the Center for Biological DiversityFor the state: counsel not immediately available"
    ]
}