{
    "articleURL": "/femail/article-12053851/Here-come-ladies.html",
    "content": [
        "Jill Biden, Akshata Murty and Olena Zelenska lead the arrival of first ladies as they travelled to the AbbeyREAD MORE: Follow the King's Coronation LIVE throughout the day How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk First ladies from around have turned out world turned out in force for the Coronation. ",
        "Jill Biden, 71, attended without her husband, and sported a smart blue two-piece with matching elegant gloves and a pale clutch and matching stilettos.   Her greying hair was worn down with a cheerful blue bow accessorising it.  The first lady of Ukraine, Olena Zelenska, also arrived with the Prime minister of Ukraine, Denys Shmyhal.The mother of two wore a pale blue coat over a matching dress and white stilettos and smiled as she entered the abbey.",
        "She seemed happy, despite her husband being absent and staying in Ukraine as the war continues. She topped off her classy outfit with simple pearl drop earrings and matching necklace. Her hair was slicky styled and she wore minimal make-up with a slick of dark lipstick.  Akshata Murthy, 43, also arrived on the arm of her husband, British prime minister Rishi Sunak, who spoke at the significant event.She wore a Claire Mischevani pale blue dress and a small black hat and tall black heels, with elegant earrings.With no coat, she smiled and seemed to be enjoying the occasion even as she got wet from the rain. Pippa Middleton was also sporting an elegant yellow Claire Mischevani gown as she arrived at the Abbey with her brother James and parents Carole and Michael. Meanwhile, Brigitte Macron, 70, wore a pale pink dress with a matching coat and pink shoes as she joined the crowd with her husband Emmanuel Macron, the president of France.",
        "She carried a  matching clutch bag and wore her hair swept up as she walked into the abbey clutching her husband's arm. ",
        "While Michal Herzog - the first lady of Israel - donned a more practical outfit.The Canadian first lady, Sophie Grégoire Trudeau, 48, also wore a pretty pink dress  and pink stilettos. She sported one of the largest hats and wore her brunette hair loose over her shoulders.She wore a long blue coat decorated with an intricate flower pattern over matching blue trousers and a white top.The sixty-one-year-old also sported flat shoes and minimal make-up, and smiled as she entered the abbey. "
    ]
}