{
    "articleURL": "/wires/pa/article-12061165/Starmer-warns-team-hardest-lies-ahead-Labour-s-elections-boost.html",
    "content": [
        "Sir Keir Starmer will warn his shadow cabinet the “hardest part lies ahead” as he welcomes signs that voters are returning to Labour after leaving over Brexit and Jeremy Corbyn.",
        "The Labour leader will tell his top team on Tuesday they must demonstrate how Labour would create a “big reforming government” rather than relying on the Conservatives’ unpopularity.But he will acknowledge there is “a lot of scepticism” about politics and tell them they must show they have plans that offer “not just reassurance, but the hope the country needs”.In the coming weeks, Labour will unveil missions on education reform, clean power and making the NHS fit for the future as it seeks to bolster support.Sir Keir believes the Prime Minister has made a strategic error by thinking that voters are more concerned with “woke” issues than the cost of living and the NHS.Labour gained 635 councillors across England in last week’s polls as the Conservatives lost 960 seats under Rishi Sunak’s leadership.",
        "The Opposition was particularly buoyed by winning control of councils in the Brexit-backing areas of Dover, Blackpool, Medway, Erewash, and Stoke.But pollsters suggested the Opposition may fall short of winning an overall majority in the Commons without progress ahead of the general election, expected next year.Sir Keir will issue the warning to the regular meeting of his shadow cabinet.“The hardest part lies ahead,” he is expected to say.“The fact that Labour won in all parts of the country was a sign of the strides we have made. People who turned away from us during the Corbyn years and the Brexit years are coming back.",
        "“But there is understandably a lot of scepticism about politics out there and now we need to go from reassurance to hope. We need to show that we will be a big reforming government bringing hope of a better life for working people.”Mr Sunak has promised to work “night and day” to deliver on the priorities he has set for the nation as he comes under pressure over the election results.Former levelling up secretary Simon Clarke said the Prime Minister’s “major mistake” of dropping housebuilding had played a role in the poor performance.Sir Keir argues that the Conservatives are “doing too little, too late to repair the damage they have done” to the health service.“The NHS trumps ‘woke’ every day of the week,” Sir Keir will tell his shadow cabinet.He is also considering putting higher taxes on foreign buyers of UK homes as the party seeks to pressure the Government on the housing crisis.The Opposition was understood to be adapting policy to increase the 2% surcharge on stamp duty for overseas buyers and banning them purchasing more than 50% of homes in a development.They could also introduce a rule allowing first-time buyers first access to new developments.Sir Keir will also speak to the 22 new Labour council leaders on Tuesday."
    ]
}