{
    "articleURL": "/sport/football/article-12055151/West-Ham-manager-David-Moyes-fuming-sides-late-kick-against-Manchester-United.html",
    "content": [
        "West Ham manager David Moyes is fuming that his side are playing Man UnitedHe said the kick-off time for the Man Utd fixture will not help them on ThursdayNevertheless, Moyes was full of praise when it came to United boss Erik ten Hag West Ham manager David Moyes is fuming that his side are playing Manchester United on Monday, just four days before their big night in Europe against AZ Alkmaar.",
        "The Hammers kick off at the unusual time of 7pm against Erik ten Hag's high-fliers in the Premier League.And Moyes moaned: 'The kick-off time isn't exactly going to help us when it comes to our preparations for our game on a Thursday.'Despite West Ham sitting four points above the relegation zone, Moyes insists the mood around the club is positive, largely thanks to their run to the last four of the Europa Conference League.Victory over two legs against Dutch side AZ Alkmaar will put the Hammers into their first European final in 58 years and make up for last season's near-miss in the Europa League where they lost in the semis.",
        "'Yes the mood has been good,' Moyes said. 'I think European football has kept everybody buoyant, it has kept our heads above the water.'I think it's always going to distract us, as we are in another European semi-final and still have league games to win.'This evening's opponents have enjoyed a successful first season under Ten Hag and Moyes, a former United manager, has been impressed by his Dutch counterpart.'I think Erik ten Hag is doing a really good job,' he added.'I think it's a club that can nearly run itself. They are used to winning, they have great traditions and are a club full of great honour.",
        "'I don't think it's just one man, I think it's always been in the club. Someone was eventually going to take them back to the top or near the top.'"
    ]
}