{
    "articleURL": "/wires/aap/article-12045253/Door-open-Flanagan-play-NRL-Dogs-utility.html",
    "content": [
        "Canterbury coach Cameron Ciraldo sees a future for Kyle Flanagan as a Bulldogs utility, with the halfback to again start at hooker in NSW Cup.",
        "Flanagan has been a key talking point this week, with Canterbury and Manly both denying he is set for an immediate switch to Brookvale.Flanagan's father Shane, an assistant at Manly, has said there was some truth to the rumour and also admitted he felt it unlikely Kyle would stay at Belmore.The Bulldogs' first-choice halfback at the start of the year, Flanagan now finds himself behind 18-year-old whiz-kid Karl Oloapu.The 24-year-old is also long odds to regain his spot in the full-strength Bulldogs spine, with Matt Burton and Oloapu expected to be Canterbury's long-term halves.Ciraldo, though, is adamant there is a future role for Flanagan.When asked if the player could be a bench utility at No.14, Ciraldo concurred.\"We wanted to see if we get a bit more utility value out of him,\" the coach said.\"He definitely showed that on the weekend. He went there late in a game a couple of weeks ago as well, and there were some really good signs.\"It is a new challenge for Kyle, he embraced it. He enjoyed it on the weekend and (we're) excited to see how he goes this weekend.\"Ciraldo said Flanagan had handled the focus on his future well this week.\"He hasn't said anything about it,\" Ciraldo said.",
        "\"He has just handled it like he normally does. Comes in every day and works hard. Played well in NSW Cup in a new position.\"He hasn't let the pressure get to him.\"Flanagan's best chance is most likely to come once Oloapu graduates into a full-time starting player, after coming on after 30 minutes on debut against St George Illawarra last week.Josh Reynolds will serve as a starting five-eighth for the second straight week against Canberra on Friday, before Oloapu takes his place during the first half.At some point Oloapu will begin starting, potentially opening the door for Flanagan to take that spot on the bench.\"We were really happy with how it worked last week,\" Ciraldo said.\"Josh set the game up for us really well, does what Josh does and competes really hard on each play. That really fed into our team.\"I was really happy when Karl came on, he played his natural game and wasn't overawed by the situation.\""
    ]
}