{
    "articleURL": "/wires/ap/article-12048579/Espanyol-closer-relegation-Spain-loss-Sevilla.html",
    "content": [
        "MADRID (AP) - Espanyol slipped closer to relegation in the Spanish league after a 3-2 loss at Sevilla on Thursday.",
        "It was Espanyol's eighth defeat in its past 10 games, leaving the club in second-to-last-place and three points from safety with five games remaining.Espanyol led 2-1 at halftime after an own-goal by Karim Rekik in the 29th minute and Javi Puado's goal in the 43rd. Bryan Gil had opened the scoring for Sevilla in 22nd, and the visitors equalized with Lucas Ocampos' penalty kick in the 69th and took the lead with an 88th-minute winner by Pape Gueye.Espanyol had boosted its hopes of escaping relegation after beating 18th-place Getafe in the previous round, a result that ended its eight-match winless streak. But the outlook going forward looks grim, with its next match against leader Barcelona and with second-place Atletico Madrid also on its schedule.\"We have to keep working and keep believing,\" said Espanyol coach Luis García, the former player who was hired recently to try to help the team avoid demotion. \"We will fight until the last second of the last match. We can't throw in the towel.\"Espanyol was relegated in 2020 for the first time in nearly three decades. It returned to the top flight in its first attempt as second-division champion.Sevilla, sitting in 11th place, got back to winning after a home loss to Girona in the previous round had halted its streak of four consecutive victories in all competitions. It next faces Juventus in the semifinals of the Europa League.",
        "VALLADOLID IN DANGERValladolid lost 2-1 at Rayo Vallecano to stay in 16th place, only one point clear from the relegation zone.It was the third straight loss for the club owned by former Brazil striker Ronaldo.Raúl de Tomás and Sergio Camello scored for Rayo, which moved to ninth to preserve hopes of grabbing one of the European places. It has won three of its last five games.It was De Tomás' first goal since joining Rayo in January.BETIS REBOUNDSWillian José scored six minutes into the match to give Real Betis a 1-0 win at Athletic Bilbao, leaving Manuel Pellegrini's team two points from fifth-place Villarreal in the final Europa League place. It is nine from fourth-place Real Sociedad in the final Champions League spot.The result ended Betis' three-match winless streak. It hadn't won in its last five away matches, since February.Athletic, which dropped to eighth place, is winless in three consecutive games.___Tales Azzoni on Twitter: http://twitter.com/tazzoni___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}