{
    "articleURL": "/wires/ap/article-12058405/AP-News-Brief-12-04-m-EDT.html",
    "content": [
        "Prize-winning AP team served as world's eyes in Mariupol",
        "NEW YORK (AP) - Instincts about the strategic significance of the Ukrainian port city of Mariupol led a team of Associated Press journalists there just as Russians were about to lay siege. It proved to be a fateful decision.For nearly three weeks last year, Mstyslav Chernov, Evgeniy Maloletka and Vasilisa Stepanenko were the only journalists in Mariupol, serving as the world's eyes and ears amid the horrors of the Russian onslaught.Together they helped expose the extent of the suffering Ukrainians endured, served as a counterweight to Russian disinformation and contributed to the opening of a humanitarian corridor out of Mariupol. They also had to elude capture by Kremlin forces that were hunting for the team.On Monday, Pulitzer Prize judges cited the work of the three Ukrainian journalists, along with Paris-based Lori Hinnant, in giving The Associated Press the prestigious award for public service.Seven AP photographers, including Maloletka, also won a breaking news Pulitzer for their coverage of the war, including in Mariupol. The AP was also a finalist for a third award for work in Ukraine, this time for photography focused on the war's impact on the elderly.___Texas shooter's 'RWDS' patch linked to far-right extremistsThe shooter who killed eight people at a Dallas-area mall was wearing a patch that read \"RWDS\" - short for \"Right Wing Death Squad\" - a phrase that has been embraced in recent years by far-right extremists who glorify violence against their political enemies.",
        "Authorities have not said what they believe might have motivated 33-year-old Mauricio Garcia, who was killed by a police officer who happened to be near the mall Saturday when Garcia opened fire.Social media accounts authorities believe were used by Mauricio Garcia also appear to have expressed interest in white supremacist and neo-Nazi views, according to an official who spoke to The Associated Press on the condition of anonymity because they could not discuss details of the investigation publicly. The official cautioned that the investigation is in the early stages.Here is a look at the term \"Right Wing Death Squad\" and how it became a popular symbol among violent extremists:WHAT´S THE HISTORY OF THE TERM?___Jury hears final arguments in writer's claims against TrumpNEW YORK (AP) - Donald Trump should be held accountable for sexually attacking an advice columnist in 1996 because even a former president is not above the law, a lawyer for the columnist told a jury Monday in closing arguments in the lawsuit that accuses Trump of rape.A lawyer for Trump responded by calling the accuser's account \"unbelievable\" and \"outrageous.\"Once the final arguments were complete, the judge sent the jury home with instructions to return Tuesday to hear about an hour of instructions before beginning deliberations. Jurors will be asked to decide whether Trump committed battery and defamed writer E. Jean Carroll and whether damages should be awarded.",
        "In recapping Carroll's case, attorney Roberta Kaplan showed jurors video clips of Trump from his October deposition and replayed the \"Access Hollywood\" video from 2005 in which Trump said into a hot mic that celebrities can grab women's genitals without asking.Kaplan recalled Trump's comment that \"stars like him can get away with sexually assaulting women.\"___Driver in deadly Texas crash charged with manslaughterBROWNSVILLE, Texas (AP) - An SUV driver who killed eight people when he slammed into a group waiting at a bus stop in Brownsville, Texas, was charged with manslaughter, police said Monday as investigators tried to determine if the crash was intentional.Authorities believe driver George Alvarez, 34, of Brownsville, lost control after running a red light Sunday morning, and plowed into a crowd outside a migrant center in the city, which has long been an epicenter for migration across the U.S.-Mexico border.Police Chief Felix Sauceda said Alvarez was charged with eight counts of manslaughter and 10 counts of aggravated assault with a deadly weapon. Officials are awaiting toxicology reports to determine whether Alvarez was intoxicated, Sauceda said, adding that there was no motive that he could discuss. Asked about reports from witnesses that Alvarez was cursing at them, Sauceda said there was nothing to confirm that yet.",
        "The SUV ran a red light, lost control, flipped on its side and hit 18 people, Sauceda told reporters Monday morning. Six people died on the scene and 12 people were critically injured, he said. Officials have said the death toll rose later.Alvarez tried to flee, but was held down by several people on the scene, he said. His bail was set at $3.6 million.___Warming-stoked tides eating huge holes in Greenland glacierDaily tides stoked with increasingly warmer water ate a hole taller than the Washington Monument at the bottom of one of Greenland's major glaciers in the last couple years, accelerating the retreat of a crucial part of the glacier, a new study found.And scientists worry that the phenomenon isn't limited to this one glacier, raising questions about previous projections of melting rates on the world's vulnerable ice sheets.The rapid melt seen in this study was in the far northwest of Greenland on Petermann Glacier. If it is happening in the rest of Greenland and the even bigger Antarctic ice sheet, then global ice loss and the sea level rise could jump as much as twice as fast as previously thought, according to the study in Monday's Proceedings of the National Academy of Sciences.\"It's bad news,\" said study author Eric Rignot, a glaciologist at University of California Irvine. \"We know the current projections are too conservative. We know that they have a really hard time matching the current record'' of melt.",
        "He said this newly found consequence of tidal activity \"could potentially double the projections\" of global melt.___Tanked Biden pick highlights escalation of dark-money forcesWASHINGTON (AP) - When President Joe Biden nominated Gigi Sohn to serve on the Federal Communications Commission, the longtime consumer advocate expected to face criticism over her desire to expand free internet access and improve competition among broadband providers.Instead, Sohn found herself the target of an aggressive campaign funded by a conservative group that doesn´t have to disclose its donors. The American Accountability Foundation called Sohn too partisan, anti-police and soft on sex trafficking. The attacks landed - to the point that even some Democrats abandoned her. Sohn withdrew her nomination, ditching her fight for a five-year term as an FCC commissioner.\"Look, I´m not naive. I´ve been a consumer advocate my whole career. I knew I was going to get some opposition,\" Sohn told The Associated Press. \"Now, did I expect what was to come - the dark money, the lies, the caricatures? No.\"The battle over the nomination is the latest example of how organizations with political and financial agendas have been able to sway public opinion by deploying donations that are impossible to trace. It is also emblematic of how nominees' missteps - even on matters wholly unrelated to their prospective jobs - can become fodder for attacks.",
        "In Sohn´s case, the stakes were high. Her confirmation would´ve ended a 2-2 split on the commission, enabling Biden's administration to pursue its agenda of making communication networks more equitable. Sohn has been a vocal advocate of such regulations, which have been aggressively opposed by the telecom industry.___Facebook has 3 billion users. Many of them are old.Facebook says it is not dead. Facebook also wants you to know that it is not just for \"old people,\" as young people have been saying for years.Now, with the biggest thorn in its side - TikTok - facing heightened government scrutiny amid growing tensions between the U.S. and China, Facebook could, perhaps, position itself as a viable, domestic-bred alternative.There's just one problem: young adults like Devin Walsh have moved on.\"I don´t even remember the last time I logged in. It must have been years ago,\" said Walsh, 24, who lives in Manhattan and works in public relations.Instead, she checks Instagram, which is also owned by Facebook parent company Meta, about five or six times a day. Then there's TikTok, of course, where she spends about an hour each day scrolling, letting the algorithm find things \"I didn't even know I was interested in.\"___At this Westminster, King Charles is the spaniel sortNEW YORK (AP) - At Westminster Abbey, Britain's King Charles III was crowned Saturday. At the Westminster Kennel Club dog show this week, a cavalier King Charles spaniel won't be as lucky.The affectionate toy dogs are having a moment amid the monarchical fanfare. Over 100 King Charles spaniels marched in a parade in London Saturday to celebrate the coronation, some sporting miniature crowns, perhaps politely signaling to Pembroke Welsh corgis to move over after decades of attention as the late Queen Elizabeth II's beloved pets.Across the pond in New York, Chester the cavalier won his breed, then got eliminated in the semifinals Monday at the Westminster show, the United States' premier canine event.Cavalier King Charles spaniels are named not for the current sovereign but for 17th-century predecessors Charles I and especially Charles II, who was known for his fondness for wee spaniels. (A similar breed, known in the U.S. as the English toy spaniel, comes in both \"Prince Charles\" and \"King Charles\" varieties; the difference is in the coat colors.)\"Cavs,\" as they often are called for short, are renowned for their soft-eyed, sweet expression and attachment to their people.___Ex-girlfriend: Tiger Woods used lawyer to break up with meTiger Woods' ex-girlfriend said in an August 2017 email her only concern about signing a nondisclosure agreement was losing her job in Woods' restaurant if the relationship ended and having control of her future in the business.\"I don't have any problems with what's in the document because I wouldn't go public or use anything I know to hurt him or the kids,\" Erica Herman wrote in the email to the CFO of Tiger Woods Ventures.\"But with my whole life in his hands now I would want to have some control over my future in the business. If something happened 5-10 years down the road I don't want to be in my 40's heartbroken and jobless.\"The email exchange was part of documents filed Sunday evening in advance of a Tuesday hearing. Woods' attorneys are expected to ask Circuit Judge Elizabeth Metzger to halt Herman´s lawsuit against their billionaire client. They say the former couple´s NDA requires all disputes be settled privately by an arbitrator, not in court.Herman has filed a lawsuit against Woods, accusing golf's biggest star of beginning their sexual relationship when she was his employee and threatening to fire her if she didn't sign the NDA she now wants voided.___Bills' Hamlin will put the millions raised into his charityNEW YORK (AP) - Buffalo Bills safety Damar Hamlin will use the $10 million given to online fundraising campaigns by well-wishers after his on-field collapse to fund his own nonprofit, the Chasing M's Foundation.The decision, first shared with The Associated Press Monday, begins the 25-year-old's plan for the unprecedented outpouring of support that he received after his heart stopped following a tackle during a \"Monday Night Football\" game in January.\"We have been very deliberate and intentional about taking our time to set my charity up properly,\" Hamlin said in a statement. \"I´m excited to begin sharing news about programs we are creating to impact a generation of youth and give back to others.\"That people continue to give weekly, if not daily, to the fundraiser is just one measure of the emotional power and connection that Hamlin has with so many. So far, they've given more than $9 million to a GoFundMe campaign and nearly a million to a second online fundraiser set up by The Giving Back Fund, a nonprofit which helps athletes and celebrities manage their charitable giving, according to Kelley Denny, a spokesperson for Hamlin's charity.Hamlin´s marketing representative said in January that his family had arranged for The Giving Back Fund to act as a fiscal sponsor for the funds given to GoFundMe, which allowed Hamlin's team to fundraise as a charitable entity. At the time, Hamlin's team said the millions given to the GoFundMe would eventually be transferred to The Giving Back Fund, but they have not been."
    ]
}