{
    "articleURL": "/wires/reuters/article-12050177/Turkey-set-strong-Russia-ties-wins-election.html",
    "content": [
        "Personal ties will still define Erdogan's foreign policy",
        "Opposition pledges to put foreign ministry back in chargeEconomic crisis forced Turkey to revive Russia tiesBy Ece Toksabay and Huseyin HayatseverANKARA, May 5 (Reuters) - Whoever wins Turkey's elections this month, the NATO-member is expected to maintain cordial relations with Russia that have already endured several years of dramatic change in Ankara's foreign policy.What prompted that change was Turkey's severe economic crisis, which forced President Tayyip Erdogan to mend strained relations with nations such as the United Arab Emirates, Saudi Arabia and Israel, which he had previously vehemently criticized, analysts said.Russia's war against Ukraine and the impact on the global economy also hammered home that now was not the time for Ankara to pick international fights, a feature of Erdogan's two decades in power.Rapprochement with Egypt and even a bid to normalize ties with Syria are also underway, just 12 years after the start of the Syrian war.\"The U-turns were out of necessity, rather than a deliberate choice,\" said Fatih Ceylan, head of the Ankara Policy Centre, a think tank based in the Turkish capital.Russia, meanwhile, was a neighbour Turkey had to work with, he said.Turkey has conducted a diplomatic balancing act since Russia invaded Ukraine on Feb. 24, 2022. Ankara opposes Western sanctions on Russia and has close ties with both Moscow and Kyiv, its Black Sea neighbours. It has also criticised Russia's invasion and sent armed drones to Ukraine.",
        "\"Turkey cannot put Russia aside, it is a powerful neighbour and we have some strong economic and commercial ties that are directly related to our national interests,\" Ceylan added.Russian President Vladimir Putin and Erdogan took part virtually in a ceremony inaugurating Turkey's first nuclear power plant last month, built by Russia's state nuclear energy company Rosatom.Putin called it a flagship project that helped \"strengthen the multi-faceted partnership between our two states.\"Turkey holds presidential and parliamentary votes on May 14, which are seen as perhaps the most consequential in the country's modern history.An inflation-driven cost of living crisis eroded Erdogan's support in recent years and opinion polls show him trailing his main opponent Kemal Kilicdaroglu.\"Any extended foreign policy crisis might further harm Turkey's economy,\" said Birgul Demirtas, an international relations professor at Istanbul's Turkish-German University.NEW STANCE?Moscow is concerned that a change in government could lead to a more pro-Western stance by Turkey, said Ahmet Kamil Erozan, deputy head of the IYI party, part of a six party opposition alliance.\"We need to engage in stock taking with both Russia and the United States on the first day of the job because Erdogan's foreign policy was personal relationship-based,\" said Erozan, seen as one of the contenders for the foreign minister job if the opposition wins.",
        "Turkey would seek to decrease its energy dependency on Russia from 50% to 30%, if the opposition wins the elections, added Erozan, who is also a former diplomat.Turkey upheld cordial relations with Russia despite the war in Ukraine and last year, Ankara and the United Nations brokered a deal that allowed the resumption of Ukrainian grain exports from Black Sea ports.Turkey's balanced approach towards Russia would not change if Kilicdaroglu replaces Erdogan, said Ceylan, who also served as Turkey's NATO envoy.Turkey has close economic ties with Russia including in tourism, gas supplies, grain and other agricultural trade.Kilicdaroglu himself pledged a \"sound and credible continuation of Turkey-Russia relations,\" if he is elected president.The opposition alliance, which has pledged to roll back many of Erdogan's policies, has also said it would prioritise diplomacy and abandon the confrontational style that has marked Turkish foreign policy in the past decade.The alliance wants the foreign ministry back in charge and pledges to build relations with the United States and Russia based on mutual trust.The changes in Turkey's foreign policy have been welcomed by its regional rivals, but Ankara's relationship with the European Union remains complicated.Erozan said the opposition alliance saw full accession to the EU as a solid goal, and said EU values of human rights, democracy, and the rule of law were in line with its vision.",
        "The opposition intends to go back to traditional parameters of Turkish foreign policy anchored in orientation to the West, Demirtas said.\"However, their emphasis on equality in Turkey's international relations with all international actors, including the EU, the U.S. and Russia should be noted,\" she added. (Editing by Alexandra Hudson)"
    ]
}