{
    "articleURL": "/wires/pa/article-12054355/Charles-relaxed-genuine-smile-coronation-says-body-language-expert.html",
    "content": [
        "The King displayed “self-comforting” gestures while maintaining his poise during the coronation ceremony, according to a body language expert.",
        "Charles was crowned at Westminster Abbey, as Archbishop of Canterbury Justin Welby placed St Edward’s Crown on his head.With 2,300 guests at the abbey and the world watching, the body language of the senior members of the royal family was under scrutiny.",
        "“Charles interlaces his fingers when he relaxes his hands, showing a mild self-comforting and relaxing gesture,” communications coach and media trainer Sonia Beldom told the PA news agency.She said the King showed dignity from the moment he entered the abbey.“Charles’s face shows immense poise and his slightly open mouth displays a genuine smile for everyone he greets on his way in,” she said.The newly-crowned Queen’s body language was more at ease than her husband’s.",
        "Camilla “looks relaxed and very happy, with her chin slightly tilted down to convey respect and humility”, Ms Beldom added.The couple’s bond was evident in their body language, the expert also said.“His deep connection to Camilla is clear as he looks towards her at key moments – this is a sign of bonding even though they are feet apart,” she continued, while Camilla’s “level chin, gentle smile and alert eyes” are a sign of “poise and confidence”.When Charles delivered a King’s Prayer, the first time a monarch has spoken words to God aloud during a coronation, Ms Beldom said: “His voice tone is clear, resonant and dignified in its pace, conveying great authority and gives us a sense of having a strong and dignified man as our King.",
        "“His voice is comforting in its tone and presence. His voice commands respect and it’s a voice you want to listen to.”However some aspects of the King’s body language might have betrayed his inner thoughts, Ms Beldom noted.During the service, she said the King’s blink rate would occasionally increase: “This can often be a signal of increased emotion.”Plus, when the Prince of Wales kissed his father’s cheek, Ms Beldom suggested the King was “visibly moved”.",
        "When he “looks down, this signals that he is accessing a deep internal dialogue”, she suggested. “He is literally ‘feeling’ what is going on around him in his thinking.”Much can also be gleaned from other family members’ body language.The Duke of Sussex was “looking a little nervous”, Ms Beldom said.",
        "“His head gestures are a little jerky.“He is more relaxed when he’s inside the abbey,” she added, noting that his body language became “more fluid” after this point.Ms Beldom continued: “The Prince and Princess of Wales are characteristically very professional as they move together and are perfectly synchronised, showing kindred spirits and of like mind.”"
    ]
}