{
    "articleURL": "/health/article-12061241/Research-group-linked-Covid-lab-leak-fears-receive-2m-taxpayer-cash.html",
    "content": [
        "The NIH has renewed a previously suspended grant to EcoHealth AllianceThe nonprofit is at the center of the lab leak theory after sending funds to WIV READ MORE: Fauci-linked experts link Covid's origins to raccoon dogs The National Institutes of Health (NIH) is under fire after renewing its grant to research bat coronaviruses with EcoHealth Alliance — the non-profit at the center of the Covid lab leak theory.",
        "New York City-based EcoHealth — run by the British zoologist Peter Daszak — announced today that the research will resume nearly three years after it was 'terminated' by then-president Donald Trump. Under the terms of the grant, the organization will recieve $2.3million, funded by US taxpayers, evenly spaced over the next four years to work on 'bat-origin coronaviruses'.However, EcoHealth has agreed not to subcontract work to China, collect new virus samples from the wild or carry out 'gain of function' research - the intentional alteration of viruses to make them more infectious or deadly.The move has already drawn fierce criticism. Experts told DailyMail.com that the move 'betrays the trust of US taxpayers'.",
        "Some speculate that the research into bat viruses at the Wuhan Institute of Virology sparked the pandemic.EcoHealth Alliance President Dr Daszak told DailyMail.com the funding would be used purely for lab work and to analyze samples that were already collected and sequences at the WIV and other institutes worldwide.As part of the grant, EcoHealth will receive $576,290 each year for the next four years for its grant title 'Understanding the Risk of Bat Coronavirus Emergence'.In total, the non-profit has received $4.3million as part of this grant, with 1.1million being distributed to the Wuhan Institute of Virology (WIV) ",
        "The NIH terminated the grant with EcoHealth in April 2020, under Trump, who endorsed the lab leak theory.It was later reinstated but suspended indefinitely as the intelligence community searched for Covid's origins. Duke-National University of Singapore Medical School, on the southern tip of the island nation is southeast Asia, will be the only recipient of the grant in the next four years, Dr Daszak said.'They've got real expertise in understanding how different viruses can bind to human cells,' he said about the school.Their work will investigate hundreds of samples of bat coronaviruses collected from Asian countries such as China.These researchers will not go into the field and collect new samples, just work with what already exists in their databases.'What we want to know is could [one of these viruses] actually infect a human and they have a way to do this just using computers, or just using simple lab work,' Dr Daszak continued.'[This work] doesn't create an infectious virus. It just uses the proteins from the viruses to see if they bite.'",
        "Lab leak skeptics seize upon study weeks after US said virus did come from Wuhan research facility.",
        "The native Briton said that the recombinant virus experiments performed at the WIV — that 'everybody has been so concerned about' — will not be performed.",
        "These experiments combine traits from multiple virus strains to create a new strain. Some have criticized these types of experiments as dangerous 'gain of function' research which is heavily restricted worldwide.Dr Daszak denies that the WIV performed gain-of-function research using EcoHealth funds.However, he said the current political situation and discussion around a potential lab leak have made it unwise to continue this research in the short term.'We actually said we were proposing to not do those experiments because I think that right now, there is so much discussion about them. So much controversy over them,' he explained.'We're in a situation where the public hasn't really decided yet whether those experiments should happen, and what the value is and what the risk is. 'So we're going to, for the next four years, not do that type of experiment with these viruses. And I think, politically, it's a very charged situation in the US, and we felt it was the best way forward to get on with the work.'He claimed that the NIH did not force EcoHealth to drop this type of research, and instead, the nonprofit did so of its own volition. This grant will come with more requirements than is typical of NIH grants.Dr Daszak said that EcoHealth and its partner must now update the NIH twice a year with the current status of its research and how the experiments push them towards the grant's goal.",
        "Typically, this report is only needed once a year. EcoHealth will also be required to receive approval for all of its spending using NIH funds before receiving the money.'Normally, you spend the money and then invoice NIH, just like any contractual invoice,' Dr Daszak explained.'Now we have to send an explanation of what we're going to spend the money on the NIH approves it, then we spend the money then we invoice them.'He said that he 'understands' why the NIH would put such requirements in place.However, when asked by DailyMail.com to explain why the NIH would put such guardrails on EcoHealth, he would not answer and referred questions to the agency.As part of the renewal agreements, EcoHealth will also not be allowed to continue research in China. The decision to renew the nonprofit's grant was met with backlash from parts of the scientific community.",
        "Dr Richard Ebright, a biologist at Rutgers University and longtime lab leak proponent, told DailyMail.com: 'It is an outrage that EcoHealth Alliance — an organization that potentially shares culpability for the origin of the COVID-19 pandemic ... continues to receive US-government grants and contracts.'A report by the Office of the Inspector General published January found the organization had misused around $89,000 in funding. ",
        "He noted the non-profit could not hand over lab notebooks and other records of research being conducted at the lab when asked by US officials.Dr Daszak denied that this record-keeping failure was linked to the suspension of EcoHealth's grant. He said EcoHealth had no role in obstructing data related to the pandemic's origins and information collected at the WIV.He said the misuse in funding was a small portion of its overall grant.'The violations were flagrant, were repeated, and damaged US health security and US national security, potentially being causal factors in the origin of Covid, and definitely being causal factors in the obstruction of investigation of the origin of Covid,' Dr Ebright continued.Dr Bryce Nickels, a genetics professor at Rutgers, told DailyMail.com, referencing the previous termination of the grant: 'The US House Energy &amp; Commerce Committee have documented multiple serious violations by EcoHealth Alliance of the contractual terms and conditions of the NIH grant that was just renewed. 'This decision betrays the trust of US taxpayers and completely undermines the stated goals of the NIH to 'exemplify and promote the highest level of scientific integrity, public accountability, and social responsibility in the conduct of science.''Justin Goodman, senior vice president at the White Coat Waste Project, said:  'The batty taxpayer-funded grant that bankrolled EcoHealth Alliance's dangerous animal experiments in Wuhan that probably prompted the pandemic should be de-funded, not refunded.",
        "'Taxpayers should not be forced to fund this reckless, rogue lab contractor that wastes money, breaks the law, abuses animals, and places public health in peril, and we're working with Congress now to permanently cut the purse strings. 'Stop the money. Stop the madness.' While the lab leak theory was initially dismissed as conspiracy and xenophobic, many scientists have come around to the idea that the virus may have escaped during an accident at the WIV.The research facility is less than 10 miles from an animal slaughter market where the first human case series was clustered.The FBI and US Department of Energy both currently believe the pandemic has man-made origins, according to recent reports.Some experts also claim that Covid's unique spike protein, which it uses to infect people, shows hallmarks of human engineering.Direct and conclusive evidence for a natural or man-made origin has yet to emerge, but the lack of proof has allowed the fierce debate to proliferate.Chinese officials, including the WIV, have refused to cooperate with the hunt for Covid's origins."
    ]
}