{
    "articleURL": "/tvshowbiz/article-12038693/Vanessa-Kirby-opens-overcoming-self-doubt-childhood.html",
    "content": [
        "Vanessa Kirby has opened up about overcoming 'self-doubt' in her childhood, and starring as a villain in the latest Mission: Impossible film.",
        "The Crown star spoke to Harper's Bazaar about finding confidence through acting, as she prepares to play White Widow in the American action franchise.Kirby, 35, who played Princess Margaret in The Crown's first and second series, said she knew she wanted to act from a young age.She told the magazine: 'I was very sensitive. I had no idea how I would become an actress, but I knew it was what I wanted to do; it was what made me feel happiest, it was what made me feel most free, least judged somehow.'I had so much self-doubt growing up - oh my goodness, I still do. I have made peace with the fact that it is there.",
        "'It's the practice of letting it be in the passenger seat. You have to say: \"You are not going to drive but you can be here\".'Vanessa looked sensational as she modelled a series of striking looks in a photoshoot for the magazine.In one image, she stood out in a bold, azure blue gown which featured a ruching design and perfectly clung to her curves.While another image sees her opting for a more simplistic black vest, with her make-up adding a touch of drama with dark red lips and lashings of mascara.",
        "The film star dazzled in several other elegant looks, including eye-catching black and white snaps.  Meanwhile in the interview, the Bafta-winning actress went on to add that Christopher McQuarrie, director of Mission: Impossible - Dead Reckoning Part One, gave her 'loads of books on power' to prepare for her role as the villain.Speaking about White Widow, she said: 'She comes from an underground crime family, so I wanted to know, how did they get into arms?'I did all sorts of research, and Christopher McQuarrie gave me loads of books on power and how to transmit power, how calm is the thing that is most powerful - the more you reel it in, the more intimidating it is.'",
        "Kirby said her co-star Tom Cruise is 'the most passionate actor'.He knows more about cinema, cares more about it, than anyone I have ever met,' she said.'He also believes anything is possible, and that really inspires everyone around him to believe in what their own mission is.'Mission: Impossible - Dead Reckoning Part One will be released by Paramount Pictures on July 12 in the US and two days later in the UK.It comes as Vanessa was the epitome of chic as she arrived at the 2023 Met Gala at New York's Metropolitan Museum of Art on Monday.",
        "She looked sensational  in a black bejewelled gown and was joined on the red carpet by fellow actors Olivia Wilde, 39, and Maude Apatow, 25, as well as designer Gabriela Hearst, 46. Vanessa teased a hint of sideboob in the Art Dec inspired frock that featured intricate silver embellishments across the back, which she showed off in it's full glory.The dress hugged every inch of her jaw-dropping figure and she appeared braless beneath, teasing a hint of side boob as she posed up a storm for the cameras.Opting for a dewey make-up look Vanessa completed the 1920s theme by styling her bleached tresses into loose waves. "
    ]
}