{
    "articleURL": "/sport/racing/article-12055479/Winning-Kentucky-Derby-jockey-Javier-Castellano-thanks-Jesus-Christ-victory-16th-attempt.html",
    "content": [
        "Mage was at 15-1 odds prior to the 149th edition of the 2023 Kentucky DerbyThe 4-foot-11 Venezuelan jockey had never won during his previous 15 Derbys DailyMail.com provides all the latest international sports news Victorious Kentucky Derby jockey Javier Castellano thanked His Lord and Savior Jesus Christ following Mage's stunning win at the racing showpiece. ",
        "The 4-foot-11 Venezuelan was in a gracious mood during a heartfelt interview as he trotted around the track following the life-changing result. 'First of all, Lord Jesus Christ for giving me the opportunity to win the Derby - the dream trip for any jockey, trainer, any horses in the industry of racing.'I never give up, I always try hard, do the right thing. It took me a little while to get there but finally I got it. I've been blessed.'Patience had been a virtue for Castellano, who had ridden in 15 Kentucky Derbys prior to taking out Saturday's spectacle. ",
        "'And truly, to give me the opportunity, the horse, the way he did it today. The little Mage, he did really well today. He's got a lot of heart. It's a little horse but big heart.'The Gustavo Delgado-trained stallion had 15-1 odds prior to the 149th edition of the $3million race. Mage won the Derby, ahead of Two Phil's and favorite Angel Of Empire at Churchill Downs in Louisville.He started in the rear of the field at the start before Castellano pulled Mage out wide to make a challenge heading into the turn. Mage responded and produced a turn of foot to challenge Two Phil's and kicked on with a furlong to go. ",
        "Castellano's brother, Abel, posted a message to Twitter also gratifying God for His assistance in the shock victory. 'My Brother Won’t the Kentucky Derby wow!!,' he wrote. God is great. [Praise] lord Jesus.'The premier event was inevitably criticized by some given the death of seven horses in the build-up to the first race of the Triple Crown.  "
    ]
}