{
    "articleURL": "/wires/reuters/article-12052303/Nashville-SC-remain-offensive-minded-vs-Fire.html",
    "content": [
        "Nashville SC are still trying to win back-to-back MLS games for the first time this season, while victories remain hard to come by for the Chicago Fire.",
        "Looking to build on an impressive home triumph, Nashville tries to stay undefeated against the visiting Fire on Saturday night.Nashville (4-3-3, 15 points) was amid an 0-1-2 stretch when it broke out for its highest-scoring MLS game of the season, winning 3-1 over Atlanta United last weekend. Star Hany Mukhtar assisted on two goals, while Fafa Picault scored for the second time in 2023, and Jacob Shaffelburg increased his overall goal total to three.Nashville last won consecutive league games during a four-game winning streak spanning August and September of last season. Mukhtar, meanwhile, has just three goals after posting 23 during his 2022 MVP season, but does have five assists.According to MLS, Mukhtar has contributed toward multiple goals in a home game 11 times since the start of the 2021 season.\"I think, in general, I can score goals,\" Mukhtar said. \"But, I think it's also important to help the team with assists, with being creative, with putting the guys in action.\"Mukhtar has faced Chicago just once, and posted a hat trick during a 5-1 home victory on July 17, 2021. Nashville is 1-0-2 all-time against the Fire, but the teams last met in September 2021.Chicago (2-2-5, 11 points) has certainly been competitive through the first two months of the season, but has only a couple of wins to show for the effort. After Kei Kamara scored his team-leading fourth goal in the 34th minute last weekend, the Fire conceded an 89th-minute equalizer for a 1-1 home draw with the New York Red Bulls.",
        "The Fire have allowed a league-high six goals in the final 15 minutes of contests this season.\"We just have to get people on the pitch who are going to man up in situations like this -- when the game is on the line,\" Chicago coach Ezra Hendrickson said. \"It's just ridiculous and it has to stop.\"Chicago is 1-2-0 on the road this season.--Field Level Media"
    ]
}