{
    "articleURL": "/news/article-12041441/Meet-new-ASBO-Kids-baby-faced-members-Young-Deadly-gang-aged-13-17.html",
    "content": [
        "A gang of baby-faced teenagers called 'Young and Deadly' have been named and shamed by police and banned from meeting up in public for two years.",
        "The group - some as as young as 13 - have plagued a town's streets with violence and anti-social behaviour towards their victims.One school even wrote to parents to warn that 'Young and Deadly' gang members were targeting vulnerable pupils with attacks.But six members - from 13 to 17 - have been named and pictured by police after being issued with Criminal Behaviour Orders (CBOs).Jackson Price, 13, Archie McCarthy, 14, Cody Bond, 15, Charlie Pearce, 16, Daniel Watkins, 16, and Tyler Hammonds, 17, have been banned from meeting up with other people in public.It comes after the MailOnline recently tracked down some of the baby-faced troublemakers who were given Asbos, the predecessor to CBOs, after they were introduced by the Labour Party in 1998.",
        "CBOs are used to punish antisocial behaviour and replaced Antisocial Behaviour Orders (Asbos) in England, Wales and Northern Ireland. Asbos are still used in Scotland. The provisions relating to the CBO are in Part 2 of the Anti-social Behaviour, Crime and Policing Act 2014. The provisions come into force on 20 October 2014. The main differences between the Asbo on conviction and the CBO are: The behaviour (first limb of the test for imposing an order) only need to cause or be likely to cause harassment, alarm or distress to any person (removing the 'not of the same household' requirement)The 'necessity' test becomes a 'helpfulness' test (as with that for Football Banning Orders); and The court may impose requirements as well as prohibitions.",
        "The Young and Deadly gang, all from Merthyr Tydfil, South Wales, must abide by the order for two years and cannot meet up with more than two other people under the age of 21.",
        "The gang has spread fear and caused chaos in the town, according to previous press reports.One woman claimed her mum has been left too scared to walk her dog. She said: 'My 60-year-old mum was terrified to walk her dog down the river - something she does every day.'[Recently] they were harassing people. Enough is enough. Sort these wannabe gangsters out before they stab someone for a laugh,' she said.Another mother said her 13-year-old son was attacked and left bleeding in the street. The boy was alone when he was left bleeding from the mouth and filmed on Snapchat helplessly wiping blood from his face with his hands.His mum, choosing to remain anonymous, revealed how she made the rare decision to allow her son to walk into the town centre alone to meet a girl from school.She explained: 'My son was left covered in blood, on his own with a girl against all those boys. Look at the blood pouring out of his mouth, it was literally him and that girl with about 10 boys. I never let him go to town either. I only let him go because he was meeting a girl from school.'The furious mum said she was told about other attacks on vulnerable people in the town centre after contacting police.",
        "She added: 'Even the police have actually informed me that they've attacked women, homeless people and men. They are very dangerous, carrying knives around too.'I have video evidence of them all attacking children, pictures of all the children and their parents. I have Snapchat conversations between them all. I've contacted all their parents but nobody will do anything. The children are of all ages from 12-17.'",
        "Local Policing Inspector Jon Duckham said: 'Criminal Behaviour Orders [CBO] enable us to deal with persistent troublemakers quickly - either they comply, and accept the help available to them, or they breach the CBO and find themselves arrested and back in court. 'It's really unfortunate that the repetitive nature of the offending meant that we were compelled to take such action as a preventative measure.'I hope the issuing of these orders offers reassurance to the community, along with a level of safeguarding and a chance to improve the behaviour of the boys concerned.'",
        "Earlier this year, Afon Taf high school wrote to parents warning of the group, saying: 'As you may be aware, within the Merthyr area, there have been ongoing incidents. involving a group of young people who refer to themselves as YAD (Young and Deadly).'These incidents generally involve acts of intimidation and/or violence towards individuals - many of whom are vulnerable.",
        "'As a result of these incidents the police are regularly dealing with members of the group.'Up until now, thankfully, there has been no suggestion that any pupils who attend Afon Taf have been involved with this group and it has not had any impact on our school. However, towards the end of the school day [recently], two males who are known to have links with the group appeared outside the school gates.'They were seen immediately by our office staff who contacted police.'"
    ]
}