{
    "articleURL": "/wires/pa/article-12050941/He-wasn-t-moaning-substituted-Roy-Hodgson-defends-Wilfried-Zaha.html",
    "content": [
        "Roy Hodgson rubbished “insulting” reports of Wilfried Zaha being unhappy at his substitution against West Ham last week as he defended the player ahead of Crystal Palace’s trip to Tottenham.",
        "The Ivory Coast forward appeared to cut a frustrated figure when he was brought off during Palace’s 4-3 win over the Hammers.However, Palace manager Hodgson has since refuted suggestions it was as a result of being taken off the pitch, instead claiming the attacker’s unhappiness was in response to another player on the pitch.“He’s fine, he’s a good captain. I’m irritated to some extent,” Hodgson said.“The press are reporting that Wilf was angry at being taken off, how do the press feel they have the right to report that?“He wasn’t angry at being taken off at all. In fact he and I discussed him playing an extra 10 minutes when I’d been thinking about taking him off 10 minutes earlier.",
        "“I hear that he was going on about one of the other players in the game, he certainly wasn’t moaning about being taken off.”Zaha returned to the line-up against West Ham after a spell out with injury and scored Palace’s second on a day where he was named captain of the side.And Hodgson alluded to his leadership qualities in a team of young players as Palace prepare to face an out-of-form Spurs on Saturday.“It’s an insult really as we are talking about someone who I made captain of the team, and he was working hard to show an example to the team, saying this is what’s needed,” the manager said.",
        "“For him to read that Wilf Zaha throws his toys out the pram is totally and utterly untrue, I think that’s unfair. I think that’s bad journalism. Hopefully you guys weren’t responsible, one b****** was that’s for sure.”Palace’s resurgence in form under Hodgson has seen them pick up four wins in six and hit the 40-point-mark for the season – a tally the Eagles boss believes has secured their Premier League status for next season.He said: “Forty is always a target. I didn’t go down and set that target and speak to the players about it. We keep getting points where we can and let’s in every game try and come away with something, that’s probably been the only real, serious aim.“Now we have got to 40 we can say the job is done in the sense that we aren’t going to get relegated. These last four games, I think, are an ideal opportunity to get extra points and hopefully win other games and get ourselves, if possible, higher up the table.”"
    ]
}