{
    "articleURL": "/wires/ap/article-12051097/Messi-PSG-talk-suspension-Galtier-says.html",
    "content": [
        "PARIS (AP) - Lionel Messi apologized to Paris Saint-Germain and his teammates on Friday for going to Saudi Arabia on an unauthorized trip that resulted in his suspension.",
        "Messi posted a short video on Instagram to ask for forgiveness and chalk up the controversy to a scheduling misunderstanding.He missed practice on Monday while he was on a promotional trip to Saudi Arabia, and a day later the French club announced it suspended the World Cup winner.Messi said he thought the team had Monday off.\"Hello, I wanted to make this video about what is happening. First of all, ask for forgiveness from my teammates and the club. Honestly, I thought we were going to have an off day as it had been the case in the weeks prior. I had this trip to (Saudi) Arabia organized, which I had canceled before, and this time I couldn´t cancel. Again, ask for forgiveness from what I did and I will be waiting for whatever the club decides. Hugs.\"Earlier on Friday, coach Christophe Galtier said the club and Messi will wait until the end of his suspension to discuss how he finishes the season.",
        "Messi is not expected to extend his contract, and there are only five games remaining.Galtier was asked at a news conference if he'll be able to count on Messi returning to the field after the suspension.\"We'll see when Leo returns what will happen,\" Galtier said. \"Obviously, there will be discussions with the entire club but also with Leo, who is the primary person involved.\"",
        "The club hasn't confirmed the length of the Argentina great's suspension but French media reported it to be two weeks, which would mean he'd miss two games. PSG has a five-point lead over second-placed Marseille in Ligue 1.Galtier said the club told him that Messi was suspended, and he declined to say if he endorsed the decision.\"I did not have to make the decision,\" the coach said. \"I was informed of the decision.\"Messi joined PSG in 2021 after winning every major honor with Barcelona. The Catalan club that Messi called home from the age of 13 couldn't afford to keep him because of large debts and Spanish league financial regulations.The French club and its fans hoped Messi's arrival would result in an elusive Champions League title. Instead, the Qatari-backed club was eliminated in the round of 16 in consecutive seasons.Messi was welcomed into Paris with a police escort. His exit is sure to be less glorious. Reports have linked Messi to Inter Miami in Major League Soccer, a return to Barcelona, and a lucrative move to Saudi Arabia.Some PSG fans are also urging forward Neymar to leave the club.For Galtier, though, fans crossed the line when they protested outside the Brazil international's residence this week.",
        "\"Private life must remain private,\" he said. \"I can understand the anger, the disappointment of our fans. I can understand protesting here at our workplace, in front of PSG's headquarters, after a match at Parc des Princes.\"But going to private homes is \"out of control and dangerous,\" he said.Neymar had season-ending surgery on his right ankle in March.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}