{
    "articleURL": "/wires/reuters/article-12049167/Red-Sox-bats-deliver-11-5-rout-4-game-sweep-Jays.html",
    "content": [
        "Masataka Yoshida went 3-for-5 with a first-inning home run, three RBIs and three runs while Rafael Devers also went deep to help the Boston Red Sox complete a four-game sweep of the visiting Toronto Blue Jays with an 11-5 win on Thursday.",
        "Boston led 6-0 and 8-1 through two and four innings, respectively, en route to its sixth straight win.The Red Sox put up a series-high 16 hits -- delivering one more hit in each successive game of the series after 13 on Monday. Justin Turner, Devers and Jarren Duran added three apiece as the Nos. 2 through 5 spots in Boston's lineup went a combined 12-for-20 with nine RBIs.Devers had four RBIs, including hitting his 150th career homer and American League-leading 11th this season to highlight the team's three-run eighth. Raimel Tapia and Yoshida each scored three runs.Winning pitcher Brayan Bello (1-1) struck out five and walked one while allowing four runs (two earned) on six hits over five innings.Bo Bichette, Vladimir Guerrero Jr. (double, home run, two RBIs) and Daulton Varsho had two hits apiece for Toronto.The Red Sox teed off on Toronto starter Kevin Gausman (2-3), who was charged with eight runs on 10 hits in 3 1/3 innings. The right-hander had pitched seven scoreless innings in his each of his previous two outings with 24 strikeouts in 14 innings.Yoshida opened the scoring with a one-out solo shot into the center-field bullpen in the first.Boston blew the game open with a five-run, six-hit second inning that moved Gausman over the 60-pitch mark. Reese McGuire's one-out RBI single started the barrage to make it 2-0. After Tapia reached on a run-scoring fielder's choice, he stole second, advanced to third on a wild pitch and scored on Yoshida's sharp single to right. A Turner single moved Yoshida to third and Devers scored both on a double that was inches shy of clearing the fence in deep right.",
        "In the fourth, the visitors got on the board on a Guerrero homer to center, but Boston made it 8-1 after Yoshida and Duran each hit RBI singles with Gausman exiting in between.Toronto cut its deficit to 8-4 in the fifth. Bichette grounded a hit to right before Guerrero's ground-rule double over Tapia's head plated another run. Varsho capped the three-batter scoring span with a sacrifice fly to left.In the eighth, an RBI single by Turner preceded the Devers bomb to right.The Jays got a run back on George Springer's one-out single in the final frame.Toronto reliever Zach Pop exited with two outs in the eighth due to an apparent leg injury.--Field Level Media"
    ]
}