{
    "articleURL": "/wires/pa/article-12043267/Statue-Manchester-United-great-Jimmy-Murphy-unveiled-Old-Trafford.html",
    "content": [
        "Jimmy Murphy, one of the most important figures in Manchester United’s history, has been immortalised in a statue outside Old Trafford.",
        "Family members, senior club leaders, former players and fan representatives were in attendance on Wednesday as the tribute was unveiled outside the Stretford End.Murphy was Sir Matt Busby’s right-hand man and his statue is located close to where he used to coach the Busby Babes on a cinder training pitch.The Welshman, who died in 1989, served as United’s chief coach and then assistant manager between 1945 and 1971.Murphy was also Wales manager and international duty meant he missed United’s match in Belgrade in 1958 and the tragic return flight.He remarkably kept the side going after the Munich air disaster, taking temporary charge until the end of the season with Busby hospitalised.Murphy even led United to the FA Cup final against Bolton – a match that took place on this day 65 years ago.Murphy managed Wales at the World Cup in Sweden the following month – the national team’s only appearance on the world stage until last year.Current boss Rob Page was another in attendance at Wednesday’s ceremony, where Murphy’s son – Jim Murphy Jr – and United chief executive Richard Arnold were among the speakers.",
        "Sir Alex Ferguson recorded a video tribute as he was unable to attend.The statue is deserved recognition for Murphy, who is already commemorated with the naming of a building at Carrington and the club’s young player of the year award.",
        "Erik ten Hag was unable to attend the ceremony due to Thursday’s Premier League match at Brighton but his admiration for Murphy could not have been clearer.“I think it’s very good that the club gives so much honour and recognition to a main person in the history of Manchester United,” the Dutchman said in the Jimmy Murphy Centre.“He stands for more symbols – symbol of youth, youth development. He stands for resilience and determination.",
        "“They are the standards for Manchester United. It’s driven by this person after the Munich (air disaster).“A manager fell away, many players fell away and the club was devastated. They bounced back and this person played a main role, so it is totally deserved he gets honoured for this.“The club is doing that with the Jimmy Murphy Centre, the Jimmy Murphy Player of the Year and now a statue. It’s fantastic.”Brian Kidd, who came through the United academy to score in the 1968 European Cup triumph, paid tribute to Murphy.“The Babes were something special with me being a young lad and it is so fitting with Jimmy because I think he is one of the most important people,” Kidd, Ferguson’s former assistant, said. The Babes were something special with me being a young lad and it is so fitting with Jimmy because I think he is one of the most important people  Brian Kidd  ",
        "“His legacy in Manchester United’s history, there is no doubt about it.“He was demanding and challenging but on the other side of the coin, he was so supportive and always there for you.“It was something Jimmy and Sir Matt went for, a youth policy, which in those days was unheard of.“Again from the outside looking in, it looks that for Erik, if the kids are good enough, he’ll play them and that was the mantra of Sir Matt and Jimmy Murphy.”European Cup winner Alex Stepney added: “The youth policy they had here back then was incredible and it has kept rolling and rolling. Everyone that comes through, it goes back to Jimmy Murphy.",
        "“A practice match at the Cliff would be a first-team defence and a youth or reserve forward line versus the first team forward line and the reserve team defence.“What Jimmy used to do was go along the touchline. He knew what we could do but it was the young kids coming through and playing with Denis (Law), George (Best), Bobby (Charlton).“He was telling them how to get on with that situation and when they were good enough, they came through.”Murphy Jr reflected: “I didn’t think it would happen. When I had a (heart) bypass when I was 46, two years later my wife organised a charity match with ex-United players so we are going back to 1986, 1987, 1988 and they were trying then to get either the scoreboard end named after Jimmy Murphy or a statue up and finally it is up.",
        "“I am just sorry people like Bobby Charlton and Wilf McGuinness can’t be here.”"
    ]
}