{
    "articleURL": "/wires/reuters/article-12050945/Markets-brace-one-two-US-credit-conditions-punch-McGeever.html",
    "content": [
        "By Jamie McGeever",
        "ORLANDO, Florida, May 5 (Reuters) - The gulf between financial markets' and Federal Reserve Chair Jerome Powell's view of the U.S. economy could not be wider, but two national credit conditions and lending surveys within 24 hours of each other could narrow the chasm.The Fed releases its quarterly Senior Loan Officer Opinion Survey, or 'SLOOS', on Monday May 8, and the National Federation of Independent Business's April survey of small businesses will be released the following day.They come at a critical time - after 500 basis points of interest rates hikes in little over a year, turmoil in the regional U.S. banking sector is intensifying and claiming more victims.Lending standards, which were already at levels consistent with past recessions, according to several indicators in the most recent 'SLOOS' and NFIB surveys, will only tighten further.The question is how much more - enough to actually tip the economy into recession and force the Fed to cut rates in the second half of the year, as futures markets are aggressively pricing? Or not?Powell and his colleagues have seen the 'SLOOS' report. Speaking to reporters after the Fed raised rates to a 16-year high on Wednesday, Powell said it is \"broadly consistent\" with the recent tightening in lending standards, and will show that \"lending has continued to grow but the pace has been slowing since the second half of last year.\"",
        "Although tighter credit conditions will weigh on economic activity, hiring and inflation, recession can still be avoided. \"It's possible that this time is really different. The case of avoiding a recession is, in my view, more likely than having a recession,\" Powell said.CALIFORNIA SCREAMIN'If U.S. rates futures are the barometer, however, financial markets could not disagree more. Secured Overnight Financing Rate (SOFR) futures on Thursday priced in as much as 100 basis points of easing by year-end, and Fed funds futures indicated the first cut could be as early as July.That would be a quick pivot to rate cuts from hikes, but not unusual. In fact, it would be in line with historical trends - according to Joe Lavorgna at SMBC Nikko Securities, the median pivot over the last 18 tightening cycles going back to the 1950s is two months, and the average is three.It remains to be seen if the Fed will turn tail so quickly this time. As Powell stressed, inflation remains well above its 2% goal and the labor market is surprisingly resilient.But weaker lending and banking conditions will take their toll.\"We are in the midst of a full-fledged California bank crisis,\" Phil Suttle, founder of consultancy Suttle Economics, wrote on Thursday. \"The resulting national headwind from bank lending ... will push the economy into recession by year end,\" allowing the Fed to cut rates to 3% by the end of next year, he said.",
        "RECESSION WATCHThe Fed's last SLOOS in February showed that the net percentage of banks reporting tightening standards for commercial and industrial loans in the fourth quarter jumped above 40%.That is consistent with levels reached before or during the last four recessions - 1990-91, 2001, 2007-09 and early 2020. Similarly, demand for these loans also slumped to previous recession levels.The NFIB's last survey, meanwhile, showed that credit conditions for small firms measured by the Loan Availability Compared to Three Months Ago index deteriorated sharply to the worst in over a decade.This index's four-point increase to 9 from February - a higher print means credit is harder to access - was the biggest month-on-month rise in over 20 years. It will be closely watched on Tuesday.A separate NFIB banking survey published this week shows small business owners are not hitting the panic button just yet, but concern is growing.Asked last month how concerned they are about the health of the bank they use for business purposes in light of the recent bank failures, 19% said very concerned, 23% said moderately concerned and 28% slightly concerned.\"Small business owners are, not surprisingly, concerned about the stability of the banking system. A strong small business banking system is essential for small business owners to operate and grow their business,\" Holly Wade, executive director of NFIB's Research Center said.",
        "Perhaps the most ominous signal from the NFIB's banking survey published this week was more than half of small business owners - 55% - reckon the United States is already in a recession.That's certainly not what Jerome Powell thinks.(The opinions expressed here are those of the author, a columnist for Reuters.)Related columns:- Small U.S. banks and businesses make for big problem- US money supply falling at fastest rate since 1930s- Inequality and 'deposit glut' sowed bank instability(By Jamie McGeever; Editing by Emelia Sithole-Matarise)"
    ]
}