{
    "articleURL": "/tvshowbiz/olivia-bentley/article-12051335/Olivia-Bentley-Tristan-Phipps-SPLIT-moving-discussing-marriage.html",
    "content": [
        "Olivia Bentley took to Instagram with a statement on Thursday announcing her split from Tristan Phipps again - as they remain 'amicable'.",
        "The Made In Chelsea star, 27, shared the news with her followers, just months after the rocky couple moved in together.'Just to clear this up and put a stop to all the comments and messages. Tristan and I are no longer together.'It ended very amicably and I do wish him all the best,' she penned her story.Meanwhile Tristan, 24, hasn't discussed the split yet.",
        "Although the couple appeared to be doing great as they moved into Olivia's lavish pad in Chelsea last year - it didn't last too long. In an exclusive interview for MailOnline last year Olivia confessed the pair nearly split when he moved into her flat last summer - but children and marriage were still 'on the cards' for the future.The actress had said that while she was not ready to get pregnant just yet, she'd 'love' for her co-star to put a ring on her finger very soon. Olivia, who dated Tristan between 2020 and 2021, previously said of their living arrangement: 'It's actually been really good, shockingly. I mean... the day we moved in, there was nearly a break up!'He just needs things from his... like he's trying to move all his tinfoil and his cling film. And I was like, 'We don't need that!' Lots of strange things.",
        "'But then he does hold onto very sweet things. Like if I've ever written him a little note. He'll hold on to it.'She elaborated: 'I write little notes just saying I'm sorry because I've probably done something. I'm trying to think... finishing the milk. Just silly things.'The pair also made a first attempt at living together. During lockdown, they gave it a go but admitted they 'struggled' due to not being able to 'escape' one another.",
        "But things improved for a while, with the influencer revealing wedding bells could be just around the corner.She gushed back then: 'I'd love a ring on my finger. We do speak about it. I don't know if I'm in a rush to have kids yet. I do want them, but probably not in the next year. But I mean, I'd love to get engaged.'I think some some guys get a bit nervous talking about that sort of thing but we've very much discussed our future. We'll be together and marriage and kids will be on the cards.'Her best friend Ollie Locke and his husband Gareth voiced concern about the re-coupling earlier last year, however Olivia's claimed it's all water under the bridge.When asked if Ollie has come around to supporting them, she said: 'Yes, massively. I think him and Gareth are big fans of me and Tristan. It was just a tricky time.'",
        "One might imagine having their relationship filmed for the purposes of entertainment could add some strain, however Olivia revealed it only helps them to talk over their issues.She said: 'I think sometimes there are certain things that we discuss on Chelsea which… that's what we're there to do.'It sometimes can make it harder, but sometimes it can be better because then certain issues that you may not discuss… they do come to light and then you sort it out a bit quicker because of filming about it.'I think it's more the trolling side of it that doesn't help, like people on Instagram giving their two cents worth.'Last August, Olivia and Tristan announced they were back together, having rekindled their romance during a boozy night out at Raffles nightclub in London, involving a racy lap dance. She told new! magazine: 'It's our own terms now, so it's been a lot more exciting. It would take a serious amount of arguing to break us up now - even if there's always an abundance of laundry around our flat, or I leave my hair clips everywhere.Tristan added: 'Being almost forced to live together during the pandemic - when we were also filming the show together - meant we couldn't learn to love each other naturally. Any normal lovers' tiff was heightened in that environment.'",
        "Speaking to the publication in March 2021 before their first split, Olivia said she feared her relationship with Tristan wouldn't make it through the last series of Made In Chelsea.The couple's romance was put to the test as they moved into a luxury mansion in the Cotswolds with the rest of the cast of the E4 reality show.Asked if she feared her relationship wouldn't last, Olivia said: 'I did. It must be the same for so many couples in lockdown.'I know so many people where it's completely ruined their relationship. I've never lived with a boyfriend before so to go from that to living together is a huge step.'She added: 'We've gone from dating to living together, which is so intense in a short space of time. We have ups and downs. It's a lot more eventful than I thought it would be.'Olivia revealed there are a lot more arguments than usual on the new series as the cast had to come to grips with not being able to have space from each other.The former Celebs Go Dating star noted that she and Tristan were not the only couple who found living together tough, adding: 'everyone really struggled with it'.Olivia said her friends in the mansion witnessed a lot of her squabbles with Tristan and felt the rest of the cast were 'making their own judgements'.",
        "Olivia recently underwent a crash course in everything mariachi before going head-to-head with Love Island's Faye Winter in a bid to be crowned Jose Cuervo’s ‘Dame of the Dead’.The celebs were challenged by the Mexican tequila brand to celebrate the beauty and culture of Mexico’s Day of the Dead festival.Olivia said: 'At first I didn’t realise how out of my comfort zone I would be as a mariachi, but after that I was all-in and I have to say I’m a natural.'Training Faye, however, must have tested the band’s patience to breaking point. At the end of the day there can only be one Dame of The Dead… and she’s definitely made in Chelsea.'"
    ]
}