{
    "articleURL": "/wires/reuters/article-12046599/ECB-raises-rates-25-bps-inflation-fight.html",
    "content": [
        "\"We are not pausing,\" ECB chief Lagarde says",
        "Decision in line with market, analyst expectationsInflation remains too high and stubbornHike was 7th straight, but so far the smallest move(Adds material from sources)By Balazs Koranyi and Francesco CanepaFRANKFURT, May 4 (Reuters) - The European Central Bank slowed the pace of its interest rate increases on Thursday but signalled more tightening to come in what markets expect to be the final stage of its fight against inflation.All ECB policymakers but one, Austria's Robert Holzmann, backed the 25-basis-point increase in the ECB's main deposit rate to 3.25%, which follows an unprecedented series of 75 and 50 basis point increases since last July.Having raised rates by the most in its 25-year history, the ECB is moderating the pace of monetary policy tightening in light of data showing the euro zone economy is barely growing and that banks are turning off the credit taps.But with inflation across the 20 countries that share the euro still stubbornly high, the ECB was at pains to say that borrowing costs will have to rise further.\"We are not pausing - that is very clear,\" ECB President Christine Lagarde told a press conference. \"We know that we have more ground to cover.\"She added that interest rates were not yet \"sufficiently restrictive\" to get inflation down to the ECB's 2% target and made reference to future \"policy decisions\", suggesting that more than one additional rate rise could be on the cards.",
        "Some policymakers who spoke to Reuters after the meeting expected two or even three further hikes.The ECB's shift in gear came just a day after the U.S. Federal Reserve also raised its benchmark rate by a quarter of a percentage point, which it hinted could be the last in its own historic series of increases.\"We continue to expect the ECB to hike rates by 25 bps in June, bringing the deposit rate to a peak of 3.50%, with risks of a final 25 bps hike in July depending on future developments in the U.S. banking system,\" Frederik Ducrozet at Pictet Wealth Management said.Interest rate-sensitive two-year German bond yields and the euro fell on Thursday and money markets slightly trimmed their bets on the ECB's peak rate, which they now see at 3.65%.Lagarde said there were still big upside risks to inflation, notably from recent wage deals and high corporate profit margins, and that financial conditions were still not sufficiently tight.NOT FED DEPENDENTShe also dismissed the notion that the ECB would have to pause if its U.S. counterpart did so, saying the ECB was \"not Fed-dependent\".Markets which had bet on rates peaking at 3.75% by September pared back their expectations. Investors now see the terminal rate at around 3.65%, indicating that one more hike is fully priced in but that opinion is split on a second move.",
        "\"In a nod to the hawks, the ECB hinted at 'future decisions' in the plural,\" Holger Schmieding at Berenberg said. \"This somewhat vague guidance supports the call that the ECB will likely lift rates again by 25 bps on 15 June and on 27 July, to a peak deposit rate of 3.75%.\"The slowdown in the pace of monetary policy tightening comes only days after euro zone banking data showed the biggest drop in demand for loans in over a decade.This suggests that previous rate rises are being transmitted \"forcefully\" to the economy but with the usual lags, the ECB said, a comment economists took as a key justification for slowing the pace of hikes.Further supporting the case for a smaller move, the euro zone economy barely grew last quarter, while banks were tightening access to credit, raising the risk that such a trend could morph into a credit crunch and drag further on growth.Underlying inflation has also stopped rising - at least for the time being, and food inflation may have also peaked.On Thursday, the ECB also said it would stop reinvesting cash from maturing debt in its 3.2 trillion euro ($3.5 trillion) Asset Purchase Programme from July.But some policy hawks still worry that underlying price pressures are building, even if overall inflation has fallen sharply from last autumn's double-digit readings.",
        "Giving a nod to these worries, Lagarde said \"significant upside risks\" to inflation remained and that recent wage deals had added to these risks.The euro zone's labour market is especially tight as employment is at an all-time-high and the jobless rate at a record low, despite the near-recessionary environment.Firms in the services sector especially have complained of labour shortages, suggesting that more wage pressures could come this summer.\"We think that today's message is quite well in line with our forecast of two further 25 bp rate hikes, in June and July, respectively,\" Nordea's Jan von Gerich said. ($1 = 0.9062 euros)(Editing by Catherine Evans)"
    ]
}