{
    "articleURL": "/sport/football/article-12047191/Man-United-Mail-Sports-predicted-XI-Sheikh-Jassims-5bn-takeover-successful.html",
    "content": [
        "Sheikh Jassim bin Hamad Al Thani will target three French international signingsThe Qatari bidder for Manchester United reportedly wants PSG's Kylian Mbappe REVEALED: Man United's transfer budget 'will ONLY be £100m' this summer Sheikh Jassim bin Hamad Al Thani sent shockwaves through the transfer market after reports emerged that he was targeting a stunning move for Kylian Mbappe, should the Qatari's £5billion takeover bid for Manchester United be successful. ",
        "And Mbappe was not the only high profile target to appear on his radar, with a potential bumper transfer window on the horizon for the Red Devils. However, whatever optimism was generated by the rumour was perhaps stymied by the fact that the club's war chest will be limited to just £100million, due to Financial Fair Play (FFP) constraints.As a result, a clear out of the squad will likely be required if the club are to invest heavily over the break - with a number of United stars potentially heading for the exit if Sheikh Jassim is to land his transfer targets. Here, Mail Sport takes you through the potential casualties at the end of the season, and suggests how Erik ten Hag's side might line-up in 2023-24 if the Qatari fends off Sir Jim Ratcliffe to take ownership of the club.",
        "United's defence require urgent attention in the previous window, and the addition of Martinez to the back four has provided much needed stability and tenacity at the heart of the defensive unit. The Argentine World Cup winner has formed a superb, solid central defensive partnership with Raphael Varane and when both are fit, there is no questioning their credentials.Luke Shaw remains at left back, and though there is reported interest in right backs like Denzel Dumfries of Inter Milan and Bayer Leverkusen's Jeremie Frimpong, those deals may have to wait until future transfer windows, given FFP restrictions.",
        "As such, the back four would likely remain similar to Ten Hag's current first-choice, with Aaron Wan-Bissaka put in at right back for his defensive solidity, compared to Diogo Dalot's more attack-minded mentality.Spanish goalkeeper David de Gea continues to divide opinion but has bailed the side out on many occasions this season and, provided he signs a (reduced) contract, will stay as a short- to medium-term option between the sticks.So, the back five remains the same. Further forward is where things could get interesting. There is one midfield spot likely up for grabs next season, with defensive midfielder Casemiro and No 10 Bruno Fernandes locked in.A player is needed to provide an upgrade on the likes of Scott McTominay, Fred and loanee Marcel Sabitzer - and the perfect candidate could be Real Madrid's Eduardo Camavinga.The 20-year-old has struggled to secure a regular starting spot in his favoured central midfield position this season, often being used as an impact substitute or at left-back.",
        "With Jude Bellingham potentially joining Aurelien Tchouameni in a young midfield, plus the evergreen Luka Modric and Toni Kroos still going strong, Camavinga may decide to leave for United - where a starting spot would be almost guaranteed.He and Casemiro in a two-man partnership that would bring great stability and composure - with the French youngster also bringing athleticism going forward and an ability to break the lines. He is also handy cover at left back. ",
        "Another Frenchman potentially joining could be Bayern Munich star Kingsley Coman, who could cost the club a further £57million.The 26-year-old right winger has only managed eight goals and seven assists for the Bavarians this term, but would bring electric pace and silky footwork in attack in a sure upgrade to the current form of both Jadon Sancho and Antony.He would line up on the right, with home-grown hero Marcus Rashford on the left. And up front... the third prong of a three-man forward unit may well be PSG's Kylian Mbappe.Reports that Sheikh Jassim reportedly wants Mbappe if he takes over caught the headlines, naturally, given his stature in the game, and the PSG star would of course slot straight into the side in attack. The Frenchman is undeniably among the world's greatest players - despite his tender age - and has often been linked with a departure from PSG. As well as a hat-trick in the World Cup final, and a converted spot-kick in the shoot-out, he has 35 goals and nine assists this season - which goes some way to explaining his £157m valuation on Transfermarkt.",
        "Bruno behind Mbappe, flanked by the pacey and fearsome duo of Rashford and Coman, would be a fearsome four-man offensive unit that would strike fear into the hearts of any defence in Europe. ",
        "To finance these moves, and add to the reported £100m budget limit, several players sales could be made. The squad list is extensive, with very few outgoings in last summer's transfer window.Jesse Lingard and Paul Pogba left the club for free to Nottingham Forest and Juventus respectively, while Cristiano Ronaldo's second spell at Old Trafford was cut short after a mutual agreement in December. Alex Telles and Dean Henderson both also departed on loan, with the Brazilian full-back joining Sevilla - who knocked United out of the Europa League - and the English goalkeeper joining Lingard at Forest. As such, there are a number of names that could be struck off the list this summer. Telles and Henderson look to have already played their last games in the iconic red shirt, and so they top the list. Transfer value aggregator Transfermarkt estimates their market values to be £10.5m and £19.3m.Of those currently at the club, Harry Maguire is perhaps the most likely to depart, having slipped down the pecking order at Old Trafford to fourth-choice centre back behind Victor Lindelof, Martinez and Varane, who are all likely to remain. Fellow defenders Eric Bailly and Brandon Williams could follow, adding more to the pot.In midfield, Fred, Scott McTominay and Donny Van de Beek are expendable, with their combined market values of £54m, as well as the £70m that Transfermarkt suggest could be raised by selling Jadon Sancho and Anthony Elanga, bring the overall sum to £205m.",
        "Added to the war chest already available to Ten Hag, and there is a suggested £305m that could be spent on transfer targets this summer. Signing the trio of Mbappe, Coman and Camavinga would cost £267m, leaving them £38m under budget - based on Transfermarkt's estimations.  Potential United line-up next season (4-2-3-1): De Gea; Wan-Bissaka, Varane, Martinez, Shaw; Casemiro, Camavinga; Coman, Fernandes, Rashford; Mbappe."
    ]
}