{
    "articleURL": "/news/article-12039773/Employee-says-Jimmy-Fallon-missed-meeting-striking-workers-learn-pay-end.html",
    "content": [
        "The Writers Guild of America started a strike for the first time in 15 years in a row over pay in the streaming era Jimmy Fallon, 48, was at the Met Gala on Monday night and declared: 'I wouldn't have a show if it wasn't for my writers, I support them all the way'A photo research coordinator on his team tweeted Tuesday that Fallon failed to show up for a meeting where NBC said their salaries would no longer be paid Jimmy Fallon's claim that he fully supports the Hollywood writers' strike was ridiculed by a member of his team on Tuesday, who said that the 48-year-old comedian did not attend a production meeting to discuss the union's move.",
        "Fallon was at the Met Gala Monday in New York City, photographed laughing uproariously with supermodels Gigi Hadid and Karen Elson, and palling around with Jared Leto.Asked on the red carpet if he backed the strike - which was confirmed hours later - Fallon said: 'I wouldn't have a show if it wasn't for my writers, I support them all the way.'Yet a photo research coordinator on his show swiftly accused him of being disinterested in their plight.'At a meeting Jimmy wasn't even at, we are told NBC decided to stop paying us after this week and end our health insurance after this month if the strike is ongoing,' tweeted Sarah Kobos.",
        "'They won't even tell us if we will technically be furloughed. Just active employees who aren't paid.'She added: 'I should note that I am non-union and not a striking worker - this was to the rest of the staff and crew.'Fallon's representatives, contacted by DailyMail.com, said they were unable to comment. Sources told DailyMail.com that the meeting Kobos referenced was a standard production meeting, which Fallon has never before attended. Kobos, who is based in New York City - where The Tonight Show Starring Jimmy Fallon is recorded every weeknight - said Fallon's behavior contrasted with his rival comedians.",
        "'I'm told Seth Meyers was in their Zoom production meeting and that he is going to try and take care of his staff and crew after NBC stops paying,' she tweeted.During the last writers' strike, in 2007, Conan O'Brien famously paid the salaries of 75 of his team out of his own pocket.",
        "David Letterman also paid the salaries of staff members on Late Show With David Letterman and The Late Late Show With Craig Ferguson, both of which are produced by his Worldwide Pants banner, through year's end during the 2007 strike.Jay Leno, meanwhile, broke the strike and wrote his own material, and let his staff go.A Leno representative said the comedian handed out $500,000 in bonuses to staff.Carson Daly also returned to work.'If I didn't go back to work, roughly 75 staff and crew would have lost their jobs,' Daly said.'As a non-WGA member, I feel I have supported the Writers Guild of America and the strike by suspending production for a month. While I continue to support the cause, I can't, in all good conscience, stand by and let that happen to my loyal staff and crew. I sincerely hope the strike will be resolved soon.'On Tuesday, shows hosted by Fallon, Jimmy Kimmel, Stephen Colbert and Meyers all aired re-runs.",
        "Members of the union picketed studios across the country.In Los Angeles, picket lines formed shortly before 1pm local time outside of at least 10 television and film studio offices, and drivers passing by honked their horns in support.In New York, the picketing started even earlier with writers taking up an entire block outside the 5th Avenue venue where NBCUniversal streamer Peacock hosted its Newfronts presentation."
    ]
}