{
    "articleURL": "/wires/aap/article-12055419/Dolphins-hero-Val-100m-flyer-All-Blacks-dream.html",
    "content": [
        "Barnstorming Dolphins cult hero Valynce Te Whare dreamed of playing for the All Blacks when he was a schoolboy sprinter in New Zealand and running 100m in 11 seconds.",
        "Now the 22-year-old centre has mastercoach Wayne Bennett predicting he will prove to be \"a big match player\" in the NRL.The 117kg battering ram, known by fans as 'Val Meninga', starred with two tries on debut for the Dolphins in the 36-16 win over Cronulla in Wayne Bennett's 900th premiership match.It was Te Whare's speed off the mark, as much as his physical presence, that dazzled.\"I used to do athletics when I was a kid from the age of five to 13 or 14. I just gave it up to focus on footy,\" Te Whare said.\"I was a 100m sprinter. When I was at school I ran it in 11 (seconds) flat. I was pretty heavy then. I was 115 (kg).\"A groundsman at Kayo Stadium last year, the 2022 season was Te Whare's first in league and he shone in the Queensland Cup for Redcliffe.He was discovered by Dolphins recruitment chief Peter O'Sullivan playing schoolboy rugby in New Zealand.\"Two years ago I was hoping to play All Blacks but I made the switch last year and I thought I'd just keep learning in the (Queensland) Cup and my time would come. Today was the day,\" Te Whare said after his debut on Saturday.\"I wasn't expecting how fast (the game) was. My legs couldn't keep up.",
        "\"I am still trying to figure out what the rules (of rugby league) are and what to do.\"He said getting himself in peak physical condition had been a rollercoaster ride that involved recalibrating his diet, including eating breakfast again.\"I was getting too lazy and wasn't hungry in the mornings,\" Te Whare said.\"I was putting on weight because I was eating more at lunch and dinner.\"I put breakfast back in again and started losing weight.\"Bennett finds the 'Val Meninga' nickname amusing. He prefers 'Val Smith' because the tyro's complete name is a lot longer than Valynce Te Whare.\"If he is happy, I am happy,\" Te Whare said of Bennett's renaming.Bennett predicted after Te Whare's debut \"the bigger the occasion the better he will play\".\"Some players have that kind of psyche and it is part of his DNA,\" Bennett said.Te Whare's mindset is to \"keep it simple\".\"I run hard, tackle hard ... and laugh and have fun,\" the 22-year-old saidAfter the game Te Whare did a haka in front of his family in the crowd who had made the trip from New Zealand.\"I was showing pride,\" he said.\"They are proud of me. I am showing a pathway for my brother and sister. If I can do it they can do it. It is not as hard as everyone thinks it is. Just stay in it.\""
    ]
}