{
    "articleURL": "/wires/ap/article-12059235/Police-deploy-schools-Serbia-opposition-plan-march.html",
    "content": [
        "BELGRADE, Serbia (AP) - Thousands marched in silence on Monday in Serbia in a major outpouring of grief and anger against the populist government and how it reacted after two mass shootings last week that left 17 people dead and 21 wounded, many of them children.",
        "The gatherings in Belgrade and the northern city of Novi Sad were dubbed \"Serbia against violence.\" They were called by opposition parties, which demanded the resignations of government ministers and the withdrawal licenses to the state controlled mainstream media that promote violence and often host convicted war criminals and crime figures on their programs.After the protest officially ended, some of the protesters chanted slogans against Serbia's increasingly autocratic president, Aleksandar Vucic, demanding that he step down, as they passed by government headquarters in Belgrade.The president later dismissed the protest as \"shameful\" during an interview on pro-government Happy television. He accused the opposition of abusing people's grief for their political ends and inciting violence.\"It's pure politics,\" said Vucic, also describing the organizers as \"vultures.\"The shootings - on Wednesday in Belgrade at an elementary school, and on Thursday in a rural area south of the capital - left the nation stunned. They triggered calls to encourage tolerance and rid society of widespread hate speech and a gun culture stemming from the 1990s wars.",
        "Education Minister Branko Ruzic submitted his resignation on Sunday and authorities launched a gun crackdown, but opposition said this was too little, too late.There were no official estimates of crowds that streamed into central Belgrade streets on Monday evening, but observers described the gathering as the biggest in years against Vucic and his government. In Novi Sad, participants held a banner reading \"Everything has to stop\" and threw flowers into the Danube River to commemorate those killed in the shootings.",
        "\"We have to learn anew how to speak to each other and how to create a healthy future ... to nurture the beauty of living, of art, science and humanity,\" said Biljana Stojkovic, a leader of the leftist Zajedno, or Together, party. \"The worst among us have been in power for an entire decade, and they imposed the norms of aggression, intolerance, crime and lies.\"One of the largest anti-government protest in recent years in Serbia also reflected how rattled the nation has been by the shootings.The school shooting on Wednesday was the first in Serbia's recent history. A 13-year-old boy took his father's guns and opened fire at the school he attended in the heart of Belgrade, shooting at his peers and killing seven girls, one boy and a school guard.A day later, a 20-year-old man used an automatic weapon in a shooting rampage in two villages in central Serbia, randomly killing eight people and wounding 14. Prosecutors said that he has confessed to the killings and said he wanted to spread fear among residents, state media have reported.Earlier on Monday, police deployed in schools throughout Serbia in an effort to restore a shaken sense of security as children largely returned to classes. Teams of experts have been sent with the backing of U.N. children´s agency UNICEF, offering support and guidelines for children, their parents and teachers.",
        "Thousands have lit candles and left messages, toys and flowers to commemorate the victims. On Monday, a police officer stood in silence at the entrance of Vladislav Ribnikar school, where students are set to gradually start returning on Wednesday.Also Monday, people who own unlicensed guns can start handing them over at police stations without punishment. Other new gun-control measures include a moratorium on new licenses, strict control of existing ones and the tightening of rules for gun possession, which officials say will leave many current gun owners without weapons.Independent international surveys have put Serbia among the top countries in Europe for gun ownership per capita. Gun control has been loose since the 1990s Yugoslav wars, when many brought back weapons from battlefields.Vucic has said there are around 400,000 registered gun owners in Serbia, but many more own guns illegally.Serbia has never faced up to its role in the conflict against other ethnic groups of the former Yugoslavia. Right-wing and nationalist sentiments have been on the rise and war criminals are regarded as heroes rather than villains, with many retaining public roles after serving their sentences.On Monday, a group of activists painted a red heart over a mural honoring wartime Bosnian Serb army commander Ratko Mladic, who is serving life in prison for genocide in Bosnia on a U.N. court conviction. The mural, located just a few blocks from the school where the shooting took place, surfaced months ago and previous attempts to remove it were thwarted by masked thugs.",
        "___Dusan Stojanovic contributed to this report.___A previous version of this story was corrected to show that the education minister submitted his resignation on Sunday, not Wednesday."
    ]
}