{
    "articleURL": "/wires/reuters/article-12050729/Russias-National-Bank-Trust-sues-commodity-traders-1-bln.html",
    "content": [
        "May 5 (Reuters) - Russian bank National Bank Trust said it had filed a lawsuit in the British Virgin Islands against a number of major commodity traders and was seeking over $1 billion in relation to what it said was fraud.",
        "The bank - which is 99% owned by the Russian central bank - said late on Thursday that traders from Cargill, Louis Dreyfus, Bunge, Quadra, Xangbo and Liberty Commodities had \"wilfully participated\" in what it called illegal schemes.Louis Dreyfus declined to comment. None of the other companies immediately responded to requests for comment.The case is linked to the central bank's 2017 bailout of two private banks - Rost Bank and B&amp;amp;N Bank (Binbank). National Bank Trust is the legal successor to Rost Bank, which it says was defrauded by employees working for the commodity traders.The lawsuit also targets offshore companies linked to Mikhail Shishkhanov, the former owner of Rost Bank and Binbank.\"Between 2013 and 2017, as Bank Trust claims, Mr. Shishkhanov conspired with traders from international agricultural and commodity trading companies, such as Cargill, Louis Dreyfus, Bunge, Quadra, Xangbo and Liberty Commodities, to conceal transfers from Binbank that were intended to dissipate funds in violation of financial regulations,\" Bank Trust said in a statement.Shishkhanov could not immediately be reached for comment. An email and phone calls to three numbers at one point associated with him went unanswered.A Bank Trust spokesperson said its international legal teams had carried out a large-scale investigation and it had extensive evidence to support its case.",
        "Bank Trust, which is an umbrella for the non-performing loans of banks rescued by the central bank in 2017, has been attempting to recover at least some of nearly 3 trillion roubles spent by the central bank on the bailouts.The central bank aims to liquidate Bank Trust in 2027. (Reporting by Alexander Marrow and David Ljunggren; Additional reporting by Rahul Paswan and Mrinalika Roy; Editing by Hugh Lawson)"
    ]
}