{
    "articleURL": "/wires/reuters/article-12048231/Canada-considering-expelling-Chinese-diplomat-targeting-lawmaker.html",
    "content": [
        "By Steve Scherer and Doina Chiacu",
        "OTTAWA/WASHINGTON, May 4 (Reuters) - Chinese Ambassador Cong Peiwu on Thursday denied a Beijing official targeted a Canadian lawmaker and his family for his anti-China stance and denounced Ottawa's statement that it was considering expelling a Chinese diplomat.Canada's Foreign Minister Melanie Joly earlier said she was \"assessing different options including the expulsion of diplomats.\"Conservative Member of Parliament Michael Chong in 2021 sponsored a successful motion that declared China's treatment of its Uyghur Muslim minority genocide.Canada's Globe and Mail newspaper, citing a Canadian intelligence report from 2021, on Monday said China sought information about Chong and his family in China in a likely effort to \"make an example\" of him and \"deter others from taking anti-PRC position,\" using an acronym for China's official name.Cong, who was summoned by a senior Canadian foreign ministry official on Thursday, said he \"protested strongly\" against the \"threat\" to expel a Chinese diplomat because of \"rumors of the so-called 'China Interference'.\"\"China strongly urges the Canadian side to immediately stop this self-directed political farce,\" Cong said in a statement posted on the embassy's website, adding Canada should \"not go further down the wrong and dangerous path.\"Prime Minister Justin Trudeau said he found out about the intelligence report from the newspaper, and on Wednesday blamed the spy agency for not passing it onto him at the time.",
        "But Chong on Thursday said he had been told by Trudeau's national security adviser that the intelligence had been circulated to the Privy Council Office, which supports the prime minister and his Cabinet, in 2021.Late on Wednesday, China sharply criticized Trudeau's comment last week linking Chinese-produced lithium to slave labor and warned Canada could face consequences if it continues \"denigrating maliciously\" the human rights situation in China. (Reporting by Doina Chiacu in Washington and Steve Scherer in Ottawa, additional reporting by Ismail Shakil in Ottawa; Editing by Josie Kao, Daniel Wallis and Cynthia Osterman)"
    ]
}