{
    "articleURL": "/wires/ap/article-12049543/Pavelski-scores-Stars-beat-Kraken-4-2-series.html",
    "content": [
        "DALLAS (AP) - Joe Pavelski wasn't alone scoring in his second game back, and the Dallas Stars got even in their first-round series against Seattle.",
        "\"Everybody was good,\" coach Pete DeBoer said. \"In Game 1, Joe Pavelski was great. Tonight, we didn't have any passengers.\"Pavelski scored his fifth goal in two games since returning from concussion protocol, getting an assist from Wyatt Johnston, his 19-year-old rookie housemate who also scored a goal. Evgenii Dadonov added a nifty wraparound goal and Tyler Seguin also scored and had an assist for the Stars in their 4-2 win over the Kraken on Thursday night.\"It's been a weird few weeks at the Pavelski household,\" Johnston said. \"I´m just trying to do my best to learn off of Joe. I mean, just kind of seeing what he´s done in these these two games. It´s pretty unbelievable.\"In the Stars' 5-4 overtime loss in Game 1, Pavelski scored all four of their goals. That was the 38-year-old forward's first game since banging his head hard on the ice after a big hit in the opener of the Minnesota series April. 17.But just as they did in the first round against Minnesota - this time with Pavelski - the Stars bounced back from an overtime loss at home in the series opener and got even before hitting the road.",
        "Game 3 is Sunday night in Seattle.\"We didn´t get to our game long enough tonight at any point in time,\" Kraken coach Dave Hakstol said. \"We had a couple of spurts. We were fine in the first period, you knew the first couple of shifts were going to be a momentum push by them.. ... We didn´t generate a whole lot.\"",
        "Jake Oettinger had 25 saves for the Stars. Philipp Grubauer stopped 33 shots.Before Pavelski's latest goal, Tye Kartye got the Kraken within 2-1 on a break when he took a long pass off the boards from Vince Dunn and got the shot around defenseman Miro Heiskanen to score.Jordan Eberle also scored for the Kraken.Johnston, who has lived with Pavelski´s family this season, set up his mentor´s power-play goal when he initially whiffed at the puck before whipping around and sending it into the laid-out stick of Grubauer. Pavelski was there for the rebound and put the Stars up 3-1 with 3:03 left in the middle period.\"It was pretty cool to be able to have an assist on his goal,\" Johnston said. \"Just a cool moment.\"Johnston's second career playoff goal came right after the end of a power play earlier in the second period for 1-0 lead. His 24 goals in the regular season tied for the NHL rookie lead.Colin Miller had taken the shot from the top of the circle to the right of the net after he had gotten a cross-ice pass from Max Domi from the opposite circle. Johnston initially got his blade on the puck, knocking in his own rebound after it ricocheted off Grubauer´s chest.",
        "Dadonov, a trade deadline addition, got his fourth goal of the playoffs when he skated around the net and sent the puck sliding across the line - and finally over it - for a 2-0 lead and the middle of their three goals in the second period.\"They pressed hard. I think they played a lot more together than we did, and that´s where we saw ourselves get exposed,\" Dunn said. \"I think we made the game a lot harder than it needs to be on each other.\"Seguin put the Stars up 4-1 with his fifth goal this postseason, the first at even strength, midway through the third period. The veteran center is the only Dallas player who has won a Stanley Cup - as a 19-year-old rookie for Boston in 2011.NOTES: Pavelski extended his record for U.S.-born players to 69 career playoff goals. That is third among active players, trailing on Alex Ovechkin's 72 and Sidney Crosby's 71. ... Stars captain Jamie Dixon and Kraken defenseman Jamie Oleksiak both got holding penalties in the game's opening minute after the former teammates were tangled together on the ice in the corner. Oleksiak, the Stars' first-round pick in the 2011 who played parts of nine seasons in Dallas, was selected by the Kraken in the expansion draft two years ago.",
        "___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}