{
    "articleURL": "/money/saving/article-12038519/Stolen-phone-Bank-apps-main-target-scammers.html",
    "content": [
        "Bank customers are being left dangerously exposed to scammers because of weak security in some major banking apps, consumer group Which? warns.",
        "Mobile banking apps allow users to make payments with their phone. But fraudsters are exploiting weaknesses in their security to steal from victims. In tests Lloyds, Halifax, American Express and Barclays had the worst security of all banks, Which? says.As much as £15.7 million was reported lost to mobile banking fraud in the first half of 2022, according to UK Finance.",
        "Banks often send users codes via email or text which allow them to reset their login details or add a new payee. But if a phone is stolen criminals can view these messages, helping them to access victims’ accounts.Which? is calling for banks to stop relying on text messages to send users sensitive information.Jenny Ross, of the consumer group, says: ‘A lack of strong security protections in some banks’ mobile apps is a huge concern, and could leave many more consumers at risk of being defrauded.’Nick White, 46, from Somerset (whose name has been changed), lost £73,000 after his mobile phone was stolen in a London pub. Fraudsters transferred £15,000 from his personal account and £58,000 from his business after gaining access to his Barclays mobile banking app.Nick has been refunded the £15,000 from his personal account and his insurer refunded him for money lost on the business account.",
        "Barclays says it is constantly testing its app to offer customers the highest level of protection.a.cooke@dailymail.co.uk",
        "PGRpdiBkYXRhLW1vZHVsZS12ZXJzaW9uPTEuNC4wIGRhdGEtbW9sLWZlLXhwbW9kdWxlLXNhdmluZ3MtbmV3c2xldHRlciBkYXRhLXBsYXRmb3JtPWlvcyBkYXRhLW5ld3NsZXR0ZXI9InNhdmluZ3MiIGRhdGEtY29sb3ItdGhlbWU9cHVycGxlIGRhdGEtZm9ybS1hY3Rpb24tdXJsPSJodHRwczovL2xpbmsubmV3cy50aGlzaXNtb25leS5jby51ay9zL1RoaXMrSXMrTW9uZXkrLStTYXZpbmdzK0FsZXJ0cyIgZGF0YS1wcml2YWN5LXBvbGljeS11cmw9Imh0dHBzOi8vd3d3LnRoaXNpc21vbmV5LmNvLnVrL2hvbWUvYXJ0aWNsZS03NzU5MjczL1ByaXZhY3ktQ29va2llcy1Qb2xpY3ktUG9saWN5Lmh0bWwiPjwvZGl2Pg==",
        "Savings rates are on the rise after many years in the doldrums, with savers now able to bag deals as high as 5 per cent.But many people still have money languishing in old sub-1 per cent paying savings accounts. Checking top rates is essential, but can also possible to make life easier to manage your savings pots in one place.  Over the past few years a number of savings platforms have launched, offering savers the option to switch as and when better deals become available and manage accounts from different banks and building societies.They each work slightly differently and include their own exclusives. To find out more and check out what's on offer visit our special savings platform top rates tables.You can also view our comprehensive best buy savings tables, independently curated by savings guru Sylvia Morris and the This is Money team.Savings essentials:&gt; Compare best savings rates in our tables &gt; Check the best rates from savings platforms &gt; Sign up to Savings Alerts to get top deals sent to you",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}