{
    "articleURL": "/tvshowbiz/article-12059367/Snap-happy-stars-Coronation-Concert-selfies.html",
    "content": [
        "Sunday night's Coronation Concert saw a slew of stars take to the stage. ",
        "But the celebrities were not just on the stage, as a host of famous faces were also in the crowd, with the likes of Oti and Motsi Mabuse, Amanda Holden and Bear Grylls taking to Instagram to share snaps from the event. To mark the Coronation of King Charles III the previous day, Katy Perry, Lionel Richie, Take That, Olly Murs and more took to the stage to perform before thousands. Leading the social media documentation was Motsi, 42, who was sitting with her sister Oti, 32, and Amanda, 52, and snapping selfies while also turning the cameras on to the Royal box to photograph the Royal attendees.  ",
        "Following his victorious stint on stage, Olly, 38, took to his Instagram stories to chat to his followers in a video, in which he admitted he was proud and honoured. ",
        "Motsi was on a mission to keep followers abreast of her whole evening as she snapped away - including sharing images with her fellow Strictly star sister Oti and Oti's husband Marius Iepure, who was cosying up to his wife. Motsi was then delighted when she met show host Hugh Bonneville, with whom she posed for an al fresco snap in the midst of the festivities. She went on to pose with Amanda Holden, who was herself sharing snaps from the event while wowing in a bright pink trouser suit. ",
        "The stunner even snapped pictures of the Royals sitting in the stands.  Friend to the Royals Bear was keen to get into selfie mode, as he turned the camera round to capture the stage in the background while beamingly delightedly. He added a caption reading: 'So special to be here at Windsor Castle for tonight’s concert… it starts in 1 hour. We are ready! #kingcharles #coronation #concert'. ",
        "Olly - who was another of Motsi's selfie companions - went on to share a video on his Instagram following his show opener performance.   Speaking to the camera, Olly said: 'Wow just leaving Windsor Castle.. it was fantastic. I got to meet some absolute legends, thank you for your kind messages. I haven't been on socials but I'm catching up now..'I loved it. I wish I could've done more but what an honour. I'm off for the next couple of weeks and enjoy myself at home with Amelia and the dog and have some me time.. what a way to end the last couple of weeks. I'm proud! Sarah Beeny meanwhile was posing happily while brandishing a Union Flag. The presenter, 51, was recently given the all-clear following her battle with breast cancer, having been diagnosed last August last year.",
        "Love Island star and philanthropist Tasha Ghouri was also sharing snaps from the event. Prior to the concert, Tasha and her co-star boyfriend Andrew Le Page met King Charles at special Windsor Castle reception.",
        "Love Island's Tasha Ghouri and boyfriend Andrew Le Page met King Charles at a special Windsor Castle reception before the Coronation concert on Sunday and later snapped selfie videos during the performance. The 24-year-old model, who was the ITV show's first deaf contestant, looked elegant in a white dress with feathered edges as she walked into the castle.Meanwhile Andrew, 27, cut a dapper figure in a beige suit and a crisp white shirt as the pair posed for a mirror selfie.Tasha revealed during the concert that she is 'the biggest Take That fan'.  "
    ]
}