{
    "articleURL": "/sport/football/article-12039785/Chelsea-players-nice-against-Arsenal-complains-Frank-Lampard.html",
    "content": [
        "Chelsea fell to 3-1 defeat at Premier League leaders Arsenal on chastening nightFrank Lampard complained that his players had been too nice during first halfResult means Chelsea have now lost all six games since Lampard returned  Frank Lampard branded his Chelsea players 'too nice' following their 3-1 defeat at Arsenal.",
        "The Gunners moved back to the Premier League summit with their first win in four matches to boost their fading title hopes - but condemned the Blues to yet another defeat this season.Lampard returned to Stamford Bridge as interim boss following the sacking of Graham Potter at the start April but has lost all six of his games in charge.And speaking after the loss at the Emirates, the Blues boss said: 'Not good enough first half, that's what confirms the result.'The first half wasn't good enough in every way. Much better second half. We were too nice to play against in all aspects in the first half.",
        "'In the second half we played much more like a team that has a threat up top. In the first half we were too easy to play against.'It's tough because you want to win games, but it's our job, we'll work on it.'It's the easy go-to that they don't care enough - but the players certainly care. I question them as lads. But, and I hate to say it, they are low on confidence. Because you're playing for Chelsea there's a level of performance you have to do, you can be low on confidence but still show a dynamic side to your game.",
        "'We need to find the reasons quickly - but it won't be an overnight fix. We have to do the basics better and then we'll get some progress.'The first half was nowhere near good enough as a performance for the players that we've got and where we want to be as Chelsea but it's a reality and that's what I've come into. It's what we need to improve as a club.'Arsenal's victory came at a cost, however, as central defender Gabriel limped off in the second half with what appeared to be an ankle problem.Mikel Arteta has confirmed the Brazilian is a doubt for Sunday's crucial clash at Newcastle.",
        "With William Saliba's availability for the game at St James' Park in major doubt as he struggles to recover from a lower back injury, Gabriel's fitness will be a huge concern for Arteta.On his side's win that saw them leapfrog Manchester City into first position, Arteta added: 'This was proof that they still believe (they can win the title).'We cannot drop our heads. To be in the position we are in after 10 months, I am not going to allow anybody not to talk about it and feel it.'If we wanted to have any chance to win this league we had to win today. We want to be back on top and our job was back today.'"
    ]
}