{
    "articleURL": "/tvshowbiz/article-12039979/How-David-Kochie-Koch-scored-major-royal-scoop-ahead-British-Press.html",
    "content": [
        "David 'Kochie' Koch scored a major royal scoop when he reported on a man 'throwing shotgun cartridges' into the grounds of Buckingham Palace.",
        "The Sunrise host, who is currently in England to cover the Coronation of King Charles III, found himself in the right place at the right time Wednesday morning.As police arrested the man who was heard shouting, 'I'm going to kill the King,' in the nights leading up to the incident, a 7News crew caught the whole ordeal on camera.Kochie and his team were camped outside performing obligatory pre-coronation coverage in preparation for King Charles III and Queen Consort Camilla's arrival. A well-placed cameraman spotted the drama unfolding at the gates of Buckingham Palace and whipped his camera out just in time to film the man's arrest before another news station could catch wind of it. ",
        "The man was held by police this morning on suspicion of possessing a weapon after 'throwing shotgun cartridges' into the grounds of Buckingham Palace.Met Police detained him at around 7pm today after he approached the gates of the palace in central London as Coronation rehearsals took place.Witnesses said the man was seen throwing a 'number of items' in the residence grounds before he was arrested.",
        "7News footage shows how the handcuffed suspect hung his head as officers took him into custody. Police later carried out a controlled explosion on a suspicious bag as a precaution.",
        "A witness told The Sun that the suspect had stationed himself outside the palace over the 'last few nights' and was heard shouting: 'I'm going to kill the King.'Police say they are not currently treating the incident as terror-related. It is understood it is being treated as an isolated mental health incident.Buckingham Palace confirmed the King and Queen were not in residence when the incident occurred, but a Royal spokesperson would not answer whether any other relatives or family members were there when it unfolded."
    ]
}