{
    "articleURL": "/wires/reuters/article-12042785/US-Senate-launch-renewed-effort-counter-China.html",
    "content": [
        "By Patricia Zengerle and David Shepardson",
        "WASHINGTON, May 3 (Reuters) - U.S. Senate Democrats launched a renewed effort to stave off competition from China on Wednesday, planning legislation to boost the country's ability to face up to the Asian powerhouse on issues from technology to security and threats to Taiwan.After passing a sweeping bill last year to boost competition with Beijing in semiconductors and other technology, Senate Democratic leader Chuck Schumer and Democratic committee leaders said they would write legislation they hoped to introduce in the next several months to limit the flow of technology to China, deter China from initiating a conflict with Taiwan and tighten rules to block U.S. capital from going to Chinese companies.Schumer said the bill - dubbed \"China Competition 2.0\" - would broaden last year's \"Chips and Science\" act.\"Today, we are announcing a new initiative, one that will build on this momentum and develop new and significant bipartisan legislation,\" Schumer told a press conference.He said he hoped the bill would be bipartisan, and said Republicans in the Senate had been supportive of some of the ideas proposed for the package. The measure will need Republican support to become law, as Republicans control the House of Representatives.The desire for a hard line on China is one of the few truly bipartisan sentiments in the perennially divided U.S. Congress, and last year's legislation passed with overwhelming support from both Democrats and Republicans.",
        "However, John Thune, the Senate's No. 2 Republican, said the new China initiative would have a hard time getting through Congress, given his party's concerns about spending and the debt and the size of last year's bill.\"It would be challenging, and partly because of spending and debt - concerns about too much spending and the impact it's had on inflation, the way the deficits exploded and ballooned,\" Thune said.A rare major foray into U.S. industrial policy, the bill signed into law by President Joe Biden last year authorized hundreds of billions of dollars to boost scientific research and subsidize domestic semiconductor manufacturers.This year's planned legislation would also seek funding for additional domestic investments in key technology areas and provide a better U.S. alternative to China's Belt and Road global infrastructure initiative, an effort to counter Beijing's international influence.\"We know that China uses its economic power like a bully,\" Democratic Senator Chris Coons told the news conference.Schumer said lawmakers would look at TikTok and other foreign-based apps while writing the China bill. TikTok, which is owned by Chinese tech company ByteDance, has been a subject of intense scrutiny in Washington and other Western capitals.TikTok has already been banned from government-issued phones in countries such as Canada and Australia over concerns about whether China can access user data or influence what people see. Some U.S. lawmakers have called for a nationwide ban.",
        "Some of the ideas proposed for the new legislation were part of a broader China bill that was scaled back last year and eventually became the \"Chips and Science\" act. (Reporting by David Shepardson and Patricia Zengerle; additional reporting by David Morgan, Doina Chiacu and Katharine Jackson; editing by Jonathan Oatis and Nick Macfie)"
    ]
}