{
    "articleURL": "/sport/mma/article-12046367/When-Ultimate-Fighter-Conor-McGregor-Michael-Chandler-air.html",
    "content": [
        "Conor McGregor will coach The Ultimate Fighter 31 against Michael Chandler  The Irishman has not fought since his defeat to Dustin Poirier back in 2021 Chandler has not fought since his defeat to Poirier last November at UFC 281 The 31st season of The Ultimate Fighter could be the biggest yet as Conor McGregor and Michael Chandler go face-to-face as coaches. ",
        "McGregor has not fought since his defeat to Dustin Poirier back in 2021 at UFC 264, where he suffered a brutal leg break. As for Chandler, the American has not stepped foot inside the cage since his defeat to Poirier back in November at UFC 281. The Ultimate Fighter is a reality TV show in America and an MMA competition set up by the UFC. It won't be the first time that McGregor has coached on 'TUF.' The Irishman featured on the series back in 2015 against Urijah Faber.It features several professional MMA fighters living together in Las Vegas, with the UFC camera crew following them around as they train and compete against each other for a large cash prize and a chance to compete in the sport's biggest promotion. Each season features either up to two weight classes in the tournament.But when will this season's Ultimate Fighter air on TV? And how can you watch it? Mail Sport provides all the answers below.",
        "When will The Ultimate Fighter air?This seasons Ultimate Fighter is set to air on Tuesday, May 30.The show will feature experienced fighters and hot prospects looking to earn their lucky breakthrough and sign for the UFC.In total, there will be 16 fighters competing in the show in total. Eight bantamweight fighters and eight lightweight prospects will be looking to go all the way and win this season's Ultimate Fighter.",
        "The full bantamweight fighters set to feature on the series are as followed:Mando Gutierrez (8-2) Trevor Wells (8-3) Carlos Vera (12-3)Rico DiSciullo (11-2) Cody Gibson (19-8)Timur Valiev (18-3) Hunter Azure (10-3) Brad Katona (12-2) The full lightweight fighters set to feature on the series are as followed:Landon Quinones (7-1-1)Aaron McKenzie (11-2-1)Nate Jennerman (16-5)Lee Hammond (5-0)Austin Hubbard (15-6)Roosevelt Roberts (12-3)Kurt Holobaugh (19-7)Jason Knight (22-7)",
        "How to watch?The Ultimate Fighter: Team McGregor vs Team Chandler will premier exclusively on ESPN and ESPN+. However, it is set to be broadcast on BT Sport for those wanting to watch the action in the United Kingdom. Each week, a new episode will be released. In total, there will be 12 episodes and is expected to finish on August 15.What's been said?Chandler was recently asked to give his thoughts on what it was like coaching with McGregor. The American revealed that it was a 'crazy blender' of an experience.'You're always thinking, \"am I going to see him today or not\"... and with Conor as everybody knows, he's a wildcard, you don't know what you're going to get sometimes,' Chandler told TheMacLife.'It has been a lot of fun, they force us into scenarios and it's a measuring tape type of thing.'It has been a whirlwind to say the least, two competitors, two dudes who want to win this show coupled with all the fighters we've got and obligations away from family, on the road.''I came in without many expectations but I'm not here for a long time I'm here for a good time to fit it all in and I'm being rewarded.",
        "'There's definitely some good TV, this is what we signed up for, to be thrown into this crazy blender called the Ultimate Fighter, the fans get to grab their popcorn this summer.'As for McGregor, 'The Notorious' revealed that he is looking forward to coming back. 'I'm looking forward to it,' McGregor told the Daily Mirror. 'I'm looking forward to it, I feel good, I feel energetic, I feel ready.'You know, I'm throwing up my high kicks faster than I'm throwing out my jab.'So I'm very excited to get back.' ",
        "When will McGregor and Chandler fight? Traditionally, at the end of every season, the two coaches will then go on to fight each other.Both McGregor and Chandler are set to face each other this year. However, an official date or venue is yet to be revealed by Dana White and the UFC.It may be some time before we see the Irishman return to the cage as he is yet to re-join the United States Anti-Doping Agency. White revealed this year that McGregor's return will be at lightweight. However, the Irishman has teased a return to welterweight in recent times.With McGregor still not in the USADA testing pool, the fight with Chandler may take place at the end of the year. "
    ]
}