{
    "articleURL": "/tvshowbiz/article-12047981/Fresh-faced-Molly-Mae-Hague-cuts-casual-figure-chats-phone-low-key-outing.html",
    "content": [
        "Molly-Mae Hague cut a casual figure as she stepped out for a low-key outing on Thursday.",
        "The former Love Island star, 23, wrapped up in a cosy white knitted cardigan teamed with a beige T-shirt and slouchy pale blue jeans.Elevating her outfit, Molly-Mae donned a pair of £800 platform Prada trainers and clutched on to a swanky Luis Vuitton overnight bag. The influencer showcased her natural beauty by going make-up free for the outing, while leaving her blonde locks loose. Molly-Mae looked in good spirits as she chatted away on her mobile phone while walking down the street.",
        "Despite her dressed down appearance, Molly-Mae was still accosted by fans who she stopped to chat to during her outing. Meanwhile, the stunner also took to Instagram to showcase the stylish outfit she wore the previous day, including a £9k Chanel bag and £700 Loewe shirt.Captioning her snap, she penned: 'Not everyday tracksuit. Much to my sadness.' While Molly-Mae looked comfortable in her pricey ensemble, she was recently divided her social media followers, who accused her of flaunting her wealth by posing in an airport terminal surrounded by her £4,000 designer luggage. Having just returned from a lavish family holiday in Dubai, the star cut a casual figure in a black T-shirt, matching leggings and an oversized blazer as she sat outside a Hermes boutique in a post shared on Sunday.  ",
        "She styled her long blonde tresses pulled back in a claw clip leaving strands to frame her face as she leaned on her hand. The reality star seemed less than impress in the picture as she sat next to her £2,200 Louis Vuitton suitcase and her matching £1,790 travel bag.Molly-Mae looked ready for her flight as she kept her AirPod Max headphones, which are worth over £500, around her neck. ",
        "Referencing her surroundings in the accompanying caption, she wrote: '5 star airport shopping.'However the post, shared in the midst of a cost-of-living crisis, prompted an inevitably divided response from followers.Replying to her latest update, one  quipped: 'If there ever was a caption to humble the working class.'Elsewhere a second quickly added: 'Thanks for reminding me to work harder,' while a third remarked: 'the caption is a little controversial ha…' Another simply added: 'Read the room.'  However others defended the influencer, with one fan writing: 'she isn't pictured with Hermes shopping bags though. 'She's saying 5* shopping and has a tiny paper bag from purchases... working class can walk round all shops at an airport too... people have a choice how they spend their hard earned money.' While another added: 'Stop taking offence ffs.' "
    ]
}