{
    "articleURL": "/news/article-12053025/Tory-chairman-faces-inquest-lacklustre-campaign-ends-disastrous-local-election-results.html",
    "content": [
        " One minister said the Conservative Party chairman's credibility had taken a hit Yesterday Greg Hands acknowledged that the results were ‘disappointing’An inquest was under way at Conservative Central Office last night after local election results came in worse than expected.",
        "Conservative Party chairman Greg Hands faced a backlash from Tory MPs after a ‘lacklustre’ campaign ended in a bruising night at the ballot box.One minister said: ‘There is an inquest going on at CCHQ and quite rightly so.‘It is clear that their analysis was way out.‘We were being told to expect losses in the region of 500-700, which suggests that they didn’t really know what was going on – that is a big worry. Greg’s credibility has taken a hit.",
        "‘This was never going to be a good night for us, but we fought a lacklustre campaign. We were outfought by Labour and that should not be happening.’Mr Hands had focused his campaign on highlighting an infamous letter which former Labour Treasury minister Liam Byrne left behind for his successor after losing the 2010 election, which read: ‘Dear Chief Secretary, I’m afraid there is no money.’Tory MPs were last night circulating an image of Mr Hands holding a mocked up version of the letter which had been altered to read: ‘I’m sorry, there are no councillors left.’Yesterday Mr Hands acknowledged that the results were ‘disappointing’ but he insisted that they were ‘not uniformly good for Labour’ either.However, some senior Tories said that Rishi Sunak had to take the blame for a low-key campaign which did not even receive a formal press launch. ",
        "One said: ‘Rishi has no option but to own these results.",
        "‘He has been either the chancellor or Prime Minister for virtually all of the last three years, and it was he and his supporters who forced Boris and then Liz out of office in order to install him in Downing Street.’Tory sources last night defended the campaign and CCHQ’s performance, pointing out that Mr Hands had raised the possibility that the party could lose 1,000 seats last month. Other senior Tories had also discussed the idea of potentially of losing 1,000 seats before the elections, but this was considered an attempt to manage expectations.One source said: ‘This was never going to be an easy set of elections. We are 13 years into government, there is a cost of living crisis and there has also been a lot of turmoil in government in the last year.‘But the Prime Minister is only six months in – that is not a long time to turn things round and he is going to need a bit of time. 'But we have got to stick to our guns and focus on trying to deliver on the people’s priorities.’"
    ]
}