{
    "articleURL": "/wires/aap/article-12040585/Priceless-Aussie-treasure-gift-fit-King.html",
    "content": [
        "Picking the perfect prezzie for someone who has everything is tough but Australia has nailed it with a priceless, irreplaceable treasure for the new King.",
        "The critically endangered Western Ground Parrot is at the crossroads of existence, with fewer than 150 left on the planet.It now exists in just one wildly beautiful patch of Western Australia but there's a concerted effort to pull the species back from the brink.A $10,000 donation, made by the federal government in honour of the nature-loving King's coronation, will play a role in doing that.The money will go to the charity Friends of the Western Ground Parrot, which has worked for two decades to raise awareness about the parrot, whose mottled green plumage make it a killer at camouflage.The species used to be found in coastal areas from Geraldton north of Perth, right around to Israelite Bay, east of Esperance.But like too many other native species, feral pests, habitat loss and altered fire patterns have changed that.The bird's last remaining stronghold is in the Cape Arid National Park, east of Esperance, an area that's seen destructive fires in recent years.Paul Wettin, from the charity, wants Australians to understand that much more of the same could wipe out the species.The group will use the $10,000 gift to mobilise pubic interest in the parrot's future, and efforts to establish a second population east of Albany.",
        "\"The fire situation has been quite dire,\" Mr Wettin says.\"Since about 2015 there have been major bushfires ... and between 80 and 90 per cent of the parrot's habitat has been burnt. That makes them much more susceptible not only to fire but also to feral and natural predators.\"One fire could possibly result in extinction of the wild population. That's why there's the focus on trying to establish another one.\"Those efforts began three years ago, and so far 19 of the elusive, ground-nesting parrots have been moved to suitable habitat near Albany.It's still early days but efforts to monitor those birds with recording equipment the charity helped pay for suggest it's a case of so far, so good.\"We are picking up calls that appear to be young birds, so on the face if it, they probably have bred, we just don't have concrete evidence,\" says Dr Allan Burbidge, a principal research scientist with the West Australian government.He says efforts to help the parrot, including predator control and fire management - also benefit many other threatened species.\"There's a whole lot of things that need assistance because of those pressures - climate change which increases likelihood of wild fire, reduced rainfall which impacts on food supplies, introduced predators.",
        "\"A whole lot of species are suffering from exactly the same suite of threats.\""
    ]
}