{
    "articleURL": "/tvshowbiz/article-12045487/Makeup-free-Holly-Willoughby-shows-fresh-faced-complexion.html",
    "content": [
        "She's no stranger to making a statement with her stylish looks.",
        "And Holly Willoughby gave fans a glimpse of her fresh-faced complexion in a flawless Instagram post on Wednesday.The This Morning presenter, 42, went makeup free in a black and white snap on her Wylde Moon account to promote a Q&amp;A with her stylist, answering some of fans' most common hair questions.In the snap, Holly's blonde bob was freshly-washed as she dried it with a towel, while beaming for the camera.Her post was captioned: 'How often should you wash your hair? Does apple cider vinegar make your hair shiny? Your 10 most common hair questions answered by @HollyWilloughby's hair-queen @cilerpeksah_hairstylist, at the link in bio.'",
        "It comes after Holly got candid with her skin struggles as she shared a make-up free video with her 8.2 million Instagram followers. Running her hand across her cheekbone, she said to the camera: 'Look can you see this here? This is my pigmentation, which is the bane of my life.'During the social media clip, which was streamed live from her account, Holly was completely natural - clipping her blonde locks back to show her radiant skin. Going through her skincare routine, the star stressed the importance of SPF and Vitamin C as she advised younger generations to prevent the pigmentation she battles with. ",
        "Hyperpigmentation or skin pigmentation describes when certain areas of your skin are darker than the rest and is caused by a pigment called melanin.And sharing the spots where she has this, Holly appeared on camera in a pair of white pyjamas with black piping.While she accessorised with jewellery brand Aurum +Grey's Connect Letter Necklace  - admitting that she 'doesn't take it off' in the comment section.Going through her skincare regime, she told the camera: 'Now, if it was daytime, which it is not, I would now put on my SPF on but I'm not going to do that. If any of you are young, which I'm sure you are, please remember to put your SPF on. ",
        "'Because look, can you see this here? This is my pigmentation, which is the bane of my life. I'm permanently looking, vitamin C is really good for pigmentation, they've got this oxygen face mask thing and it's really, really good.'I'm sort of starting that but your first defence against pigmentation is not letting it happen in first place,' she shared. The star was advertising her new HOLLY-DAY EDIT, a collection of of makeup she is releasing with brand Beauty Pie.The video came after Holly was struck down by a bout of shingles last week, having recovered now. "
    ]
}