{
    "articleURL": "/tvshowbiz/article-12038543/Olivia-Wilde-seen-morning-Met-Gala-avoiding-Harry-Styles-new-girl-Emily-Ratajkowski.html",
    "content": [
        "Olivia Wilde shared a photo from the morning after the Met Gala while took place on Monday evening in New York City.",
        "The 39-year-old House actress was makeup free and in a white-and-black robe as she lay down on a bed.The mom of two made a funny face in the snap, perhaps reflecting on the activities of the night before. 'Oh good morningftrnoon,' she captioned the selfie of herself.The Met Gala was a success for the Don't Worry Darling director as she seemed to manage avoiding Emily Ratajkowski, 31, who was caught kissing Wilde's ex Harry Styles recently.",
        "Olivia and Emily both attended the Met Gala. And they both went to the Zero Bond after party.There are no photos of the stars together, suggesting they avoided each other. Olivia upped the fashion ante as she hit the Met Gala afterparty at Zero Bond. The actress put on a daring display as she went braless in a pearlescent mesh dress after changing out of her red carpet look. Olivia risked another awkward run-in with Ratajkowski, 31, who also attended the star-studded bash. The Met Gala is the first time the pair have crossed paths since Emily kissed Olivia's ex-boyfriend Styles in Tokyo back in March. But Olivia showed no signs of awkwardness as she was pictured smiling while arriving at Zero Bond to party the night away. ",
        "The statement dress sheathed over her slender figure and showcased her black underwear. ",
        "Olivia teamed the look with black platform boots and wore her golden locks in mermaid waves. Just hours earlier, Emily and Olivia had narrowly avoided each other on the red carpet, arriving within minutes of each other. Emily had all eyes on her in a plunging taupe dress which left little of her cleavage to the imagination.",
        "Adorned with pearls, the strapless look cinched into her svelte waist and featured a semi-sheer skirt that furled out into a dramatic train. Meanwhile Wilde was a vision as she flashed her trim midriff and toned waist in a high-necked white gown with dazzling gold detailsWhile the women previously had a friendly relationship, tensions between them escalated after the supermodel told Vogue Spain she 'feels bad' for the director about her steamy make-out session with the pop star, 29. Following the interview, an insider told DailyMail.com exclusively Olivia wants Emily to 'keep her name out of her mouth' and 'focus on being a mum instead of dating everyone she sees.' The source went on reveal that the mother-of-two feels the I Feel Pretty star should 'reexamine her dating life and the men she chooses to go out with' since filing for divorce from Sebastian Bear-McClard.Previously, a separate confidante of Wilde's disclosed the ex-fiancée of Jason Sudeikis felt 'betrayed' by her 'friend' and simply does not want to be dragged into this mess' as she continues to prioritize her 'career and her kids.'"
    ]
}