{
    "articleURL": "/news/article-12044077/Democrat-charged-DRUNK-wheel-Candidate-key-California-race-apologizes.html",
    "content": [
        "A California Democratic lawmaker hoping to win a seat in Congress has confessed to being arrested for drunk driving.",
        "Dave Min, a 47-year-old Californian state senator, was stopped by police on Tuesday evening in Sacramento after he ran through a red light in his Toyota Camry with his headlights off.The Harvard law graduate, who hopes to win the battleground 47th district in Orange County, admitted he had been detained overnight and booked by officers. ",
        " 'Last night I received a misdemeanor for driving under the influence. My decision to drive last night was irresponsible,' Min wrote on social media. 'I accept full responsibility and there is no excuse for my actions. To my family, constituents, and supporters, I am so deeply sorry.'I know I need to do better. I will not let this personal failure distract from our work in California and Washington.'Police had conducted a DUI test and arrested him on suspicion of driving with a blood alcohol level above the legal limit. The results have not been released.'The officers contacted the driver of the vehicle and noticed signs and symptoms of alcohol intoxication,' the police report said. 'The officers conducted a Driving Under the Influence [DUI] investigation and determined the driver was driving under the influence of an alcoholic beverage,' it concluded.Ben Petersen, a spokesman for the National Republican Congressional Committee, blasted the Democratic election hopeful.",
        "'Voters will rightly question David Min’s judgment after this incident, but will California Democrats?,' he asked.Min, a former aide to U.S Senator Chuck Schumer, is in the race to replace outgoing Congresswoman Katie Porter.",
        "She has given up her seat to run for the Senate in Washington and endorsed Min as her possible successor.Porter only just squeezed through to victory in 2022 with 51.5% of the vote, making it a tight battle with the Republicans.  Min will face former Republican state Assemblyman Scott Baugh, Democrat Joanna Weiss and Republican Max Ukropina, amongst others, for the purple district seat.Ukropina, a local businessman, said that it was 'incredibly disappointing to see career politicians behave this way while representing us in Sacramento.''It’s yet another reminder that Orange County deserves new leadership, which is why I am running for Congress,' he said in a statement.Toni Atkins, the current caretaker president of the California senate, declined to comment on whether Min would face disciplinary action.'Like Senator Min, we’re disappointed in his actions, but pleased that he’s taken responsibility and apologized,' she said."
    ]
}