{
    "articleURL": "/femail/article-12060329/Man-goes-viral-demonstrating-correct-way-eat-Airheads-candy.html",
    "content": [
        "Jordan Howlett, 26, from California, has 9.6 million followers on TikTokHe went viral this week after claiming you're supposed to shake Airhead bars Shaking the candy in its wrapper causes it to condense into a cube  A TikTok star has people questioning their childhoods after demonstrating the 'correct' way to eat Airheads that supposedly enhances the candy's flavor. ",
        "Jordan Howlett, 26, from California, has 9.6 million followers on TikTok, where he is known as @jordan_the_stallion8. He went viral this week after claiming the taffy is meant to be shaken in its wrapper until it condenses into a small cube.The influencer stitched his video in response to user @knowledgesaurus, who had asked: 'What is something you found out late in life that you should have known earlier but you just didn't?''I have been eating Airheads incorrectly for the past 20 years,' he said, holding up a wrapped Airheads bar. 'Airheads are like this, right? They're flat, okay, a flat surface.''But, apparently, you are supposed to shake the Airheads before opening them, so they end up tiny, like little cubes because it makes the flavor just a bit [different].'",
        "Howlett had one of the brand's White Mystery bars, which he heard 'changes flavors after you shake it to the bottom.' Perfetti Van Melle — the Italian-Dutch company that makes Airheads — creates its White Mystery bars by taking whatever flavors are leftover and mixing them together, according to Mashed.He held onto the top of the wrapper with his fingers and began vigorously shaking the Airheads bar up and down.  After a minute, he held it up to the camera to show that it was beginning to shrink. He kept going until the taffy was condensed into the bottom quarter of the wrapper. ",
        "He held up the final product next to another Airheads bar to show the difference in size before opening the wrapper. 'As you can see, it's like a little tiny cube,' he said, taking a bite. 'The flavor tastes different.' However, the content creator's experiment was somewhat flawed because he didn't take into account the inconsistency of the ever-changing White Mystery flavor. Without knowing what flavors were mixed together to make that particular batch, he wouldn't actually be able to tell if the taffy tasted differently after being shaken into a cube. Howlett would have been better off using a standard flavor, but that hasn't stopped the video from going viral. ",
        "The nearly one-minute clip has been viewed 9.1 million times and has received more than 12,500 comments in just one day. 'Airheads needs this tutorial on the bag! Why would they make it like this and not tell anyone?!' one person griped. 'So you’re NOT supposed to just shove the whole thing in like a food ruler and chew it?' someone else joked. 'Turns out we were the air heads all along,' another added. There were a number of viewers who recalled shaking the candy when they were young, and some speculated that the technique is how the candy got its name. ",
        "However, there were also plenty of naysayers who refused to believe that the candy is supposed to be shaken before eating. 'What’s your source??' one person asked. 'I need a works cited!''They gave us no instructions growing up. It’s not incorrect just a different way of eating it,' someone else argued. 'I will die on this hill!'Airheads debuted in 1985, and while the shaking technique has been discussed on social media for years, it was unclear if the candy was designed to be eaten this way.A spokesperson for Perfetti Van Melle USA told DailyMail.com via email that 'it's not necessary to shake your Airheads bar' before eating it, but that doesn't mean you shouldn't. 'If you know, you know!' she added of the trend. "
    ]
}