{
    "articleURL": "/femail/article-12053975/Whos-pews-Westminster-Abbey.html",
    "content": [
        "King Charles and Queen Camilla's family fill the pews at the historic eventRead more: King Charles Coronation LIVE - King is crowned in front of Queen Camilla, Harry, Kate and William in Westminster Abbey How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Westminster Abbey today hosted 2,000 special guests to watch the crowning of King Charles III and Queen Camilla.",
        "The couple's family were given front row seats at the ceremony as well as playing a major part in the proceedings. Guests also included foreign dignitaries and royals from around the world who attended to show their support for the new monarch.Here, FEMAIL gives a guide to who had the best seats in Westminster Abbey for Charles' historic crowning...",
        "1. Duke of Gloucester:  The Duke is the youngest grandchild of King George V and Queen Mary and a paternal cousin of the Queen. He carries out duties on behalf of the royal family and is patron of many societies.2. Duchess of Gloucester: The Dutch-born Duchess married Prince Richard in 1972 and is a full-time working member of the Royal Family. She shares three children with the Duke - none of whom undertake official duties.3. Vice Admiral Sir Timothy Laurence: The 67-year-old retired Royal Navy Vice Admiral, husband of the Princess Royal, is an unsung hero of the Royal Family who stays largely out of the spotlight. Today he joined his wife and brothers-in-law for the big day.4. Princess Anne: The King's sister, who is often regarded as the 'hardest working royal', was in good spirits today as she joined members of the royal family for the event.5. Prince Edward, Duke of Edinburgh: The Queen's youngest child Prince Edward was today joined by his wife the Duchess of Edinburgh and children Lady Louise and James, Viscount Severn. He was granted the title of Duke of Edinburgh by Charles  following the death of their mother the Queen.",
        "6. Sophie, Duchess of Edinburgh: The Duchess of Edinburgh joined her husband and children for the big event today. She was famously close to her mother-in-law the late Queen and is considered by many to be a 'secret weapon' within the role family.7. Lady Louise Windsor: The daughter of the Duke and Duchess of Edinburgh is often regarded as a secret weapon for the royal family, and tends to lead a low key life.8. James, Earl of Wessex: The late Queen's youngest grandchild, James, Viscount Severn, is only 15 years old but has stepped up to take a prominent role in the events since his grandmother the Queen died.9. Prince Harry: The Queen's grandson the Duke of Sussex, who lives in California, is attending the Coronation in a whirlwind trip to the UK. It emerged earlier he has been invited to lunch at Buckingham Palace following the historic event. He was relegated to the third row inside the abbey for the service.10. Jack Brooksbank: The husband of Princess Eugenie has been seen on a number of occasions since marrying her in October 2018. Today he supported his wife as she said goodbye to her grandmother.11. Princess Eugenie: The youngest daughter of Prince Andrew and the Duchess of York is heavily pregnant and expecting her second child in the coming months.",
        "12. Edoardo Mapelli Mozzi: The husband of Princess Beatrice. Edoardo shares a daughter, Sienna, with the Princess and the couple were spotted together on an evening out in Soho days before the Coronation.",
        "13. Princess Beatrice: The daughter of Prince Andrew and the Duke of York, who is ninth-in-line to the throne, appeared in high spirits at the event. While she is not a working royal, she often attends high profile royal engagements, including Trooping the Colour.14. Prince Andrew: The Duke of York is not expected to play a key role in today's proceedings, despite his position as the King's brother.15. Princess Michael of Kent: The wife of the Queen's cousin Prince Michael of Kent.16. Peter Phillips: The King's eldest nephew Peter Phillips, who is Princess Anne's son, appeared in good spirits today. While he tends to keep a low profile generally, he often attends high profile events including Trooping the Colour. He was at the front and centre of events mourning the late Queen in September.17. Zara Tindall: The Queen's granddaughter Zara Tindall attended the Coronation with her husband Mike Tindall. She enjoyed a night out with the royals yesterday, and ended up partying in London till 2am alongside her beau.18. Mike Tindall: The former England rugby ace is married to Zara Tindall. He often attends royal events and is known for his playful and cheeky attitude.",
        "19. The Earl of Snowdon:  David Armstrong-Jones, 2nd Earl Snowdon, is the only son of Princess Margaret and Anthony Armstrong-Jones, 1st Earl Snowdon. The furniture designer enjoyed a close relationship with the Queen and used to holiday with the Royal Family as a child.20. Charles Armstrong-Jones: The 23-year-old son of the Second Earl of Snowdon, David Armstrong-Jones, was the third grandchild of Princess Margaret.21. Lady Margarita Armstrong-Jones: The Earl of Snowdon's daughter Margarita Armstrong-Jones featured on the May issue of Tatler in advance of her 21st birthday. Lord Snowdon and her mother, Serena Armstrong-Jones, Countess of Snowdon, divorced in 2020.22. Lady Rose Gilman: The daughter of the Duke and Duchess of Gloucester, Lady Rose, does not undertake royal duties. She worked in the art department on the film adaptation of Harry Potter.23. Lady Davina Windsor: Lady Davina is the elder daughter of the Duke and Duchess of Gloucester.24.  Earl of Ulster: Alexander Windsor attended Prince Philip's memorial service last year. He is the son of the Duke and Duchess of Gloucester, and joined his sisters and parents at the event. 25. Samuel Chatto: The eldest of Lady Sarah Chatto's children, Samuel is a potter and artist.26. Lady Helen Taylor: A peripheral royal happy to lead a life largely under the radar, Lady Helen is the daughter of the Duke and Duchess of Kent.",
        "27. Lord Frederick Windsor: Lord Freddie is the son of the Queen's first cousin Prince Michael of Kent.28. Lady Gabriella Kingston: Gabriella is the daughter of Prince and Princess Michael of Kent.29. Pippa Middleton: Pippa is the younger sister of Kate, the Princess of Wales. She is married to hedge fund manager and former racing driver, James Matthews.30. James Middleton: James is the younger brother of Kate Middleton. He married Alizée Thevenet in a wedding at the French Riviera in 2021.31. Carole Middleton: Carole Middleton is the mother of the Princess of Wales. She set up party supplies company Party Pieces but friends have revealed that CArole and her husband will soon be stepping away from the business.32. Michael Middleton: The father of Kate Middleton. Born in Leeds, he regularly attends royal events with his wife and family to support the Royal Family."
    ]
}