{
    "articleURL": "/wires/reuters/article-12043629/Goldman-Sachs-names-Kim-Posnett-global-TMT-head.html",
    "content": [
        "By Anirban Sen, Jaiveer Shekhawat and Lananh Nguyen",
        "May 3 (Reuters) - Goldman Sachs Group Inc has named Kim Posnett as the head of its global technology, media and telecommunications (TMT) investment banking group, according to an internal company memo.Posnett, who joined Goldman in 2005 and became a partner in 2016, has held several top roles during her tenure at the bank, having previously led the global internet business. Posnett, who is currently the co-head of the One Goldman Sachs initiative at the bank, will continue to hold her existing responsibilities.The One Goldman Sachs initiative aims to integrate the bank's dealings with clients across teams.Posnett's appointment comes after a broader shake-up within the ranks of Goldman Sachs, which earlier this year combined investment banking and trading into one unit, while merging asset management and wealth management.Posnett, who has also served as the global head of investment banking services at Goldman, is one of the few executives who spoke at the bank's investor day in February alongside its chief executive and finance head. In her new role, Posnett will be among a few female bankers who currently lead the TMT franchise at a major Wall Street bank.As a TMT banker, Posnett has led more than 400 tech deals over the last 20 years. Posnett has recently advised on several high-profile deals including Twitter Inc's $44 billion sale to Elon Musk and Endeavor Group Holdings Inc's $21 billion combination with World Wrestling Entertainment Inc in April.",
        "Sam Britton, who previously served as co-head for TMT M&amp;amp;A and is one of Goldman's top rainmakers in tech banking, will become co-chairman of the division, which is one of the investment bank's most powerful groups.In a separate memo sent out by Goldman's heads of global banking &amp;amp; markets, Ashok Varadhan, Dan Dees and Jim Esposito, Goldman also named Aasem Khalil as the new global head of its Investment Banking Services division.Khalil, who joined Goldman in 1996, will continue to serve as head of the bank's Dallas office, co-head of Latin America, and head of investment banking in Latin America and the Southern region in the U.S.On Tuesday, Goldman promoted Troy Broderick as the new chief operating officer of its global M&amp;amp;A business. (Reporting by Jaiveer Singh Shekhawat in Bengaluru, Anirban Sen and Lananh Nguyen in New York; Editing by Arun Koyyur and Lisa Shumaker)"
    ]
}