{
    "articleURL": "/wires/reuters/article-12059309/COLUMN-Funds-bearish-CBOT-corn-views-surge-mid-2020-levels-Braun.html",
    "content": [
        "By Karen Braun",
        "NAPERVILLE, Illinois, May 7 (Reuters) - Speculators staged one of their biggest weekly sell-offs in Chicago-traded corn last week as a strong Brazilian crop, efficient U.S. planting pace and weak U.S. export demand pushed futures to nine-month lows.In the week ended May 2, money managers increased their net short position in CBOT corn futures and options to 118,146 contracts from 15,297 a week earlier, establishing their most bearish corn stance since August 2020.That marked funds´ third largest weekly corn sell-off on record and only the fourth week since 2006 where net corn selling exceeded 100,000 contracts. The all-time biggest selling week had occurred just nine weeks earlier when funds slashed their corn net long by more than 147,000 contracts.New shorts were responsible for nearly two-thirds of last week´s selling among money managers. Index traders boosted total positions in CBOT corn by 8% through May 2, reaching the highest levels since July.Most-active CBOT corn futures fell 4.6% in the week ended May 2, though futures hit another nine-month low on May 3 before rebounding nearly 3% over the last three sessions.The move higher came despite Thursday´s news that the prior week´s U.S. corn export sales were record-low after China cancelled cargoes. Ukraine export worries and strength in wheat also helped corn futures shake off the poor U.S. demand.",
        "WHEATBoth Chicago wheat and soybeans made notable lows on May 3, with most-active wheat and soybeans dipping to the lowest levels since April 1, 2021, and October 28, 2022, respectively.CBOT wheat had shed 6.7% in the week ended May 2, and money managers´ net short expanded to 126,324 futures and options contracts, the largest since January 2018. That was predominantly based on new gross shorts and compares with a net short of 113,012 contracts a week earlier.Some of those shorts may have already fled as futures surged more than 8% between Wednesday and Friday on Black Sea grain deal concerns and Russia´s willingness to cooperate. Shipments from Ukraine have slowed, and no new ships were authorized on Friday for future departure.Kansas City wheat futures also suffered heavy losses in the week ended May 2, including the lowest print since October 2021 at the end of the period. Money managers flipped to a mild net short in K.C. wheat futures and options of 5,464 contracts from the prior week´s net long of 7,371.They also established their most bearish view in Minneapolis wheat since September 2020, increasing their net short to 8,206 futures and options contracts from 3,410 a week earlier. However, Minneapolis July wheat rose 8% over the last three sessions while K.C. futures jumped more than 12%.",
        "SOY COMPLEXIn the two weeks ended May 2, combined fund selling across CBOT soybeans, soybean meal and soybean oil was the strongest for any two weeks since December 2019, but investors views in beans and meal remain moderately bullish.Money managers have avoided bearish bets in CBOT soybeans for much of the last three years, though selling in the week ended May 2 was driven by new shorts, the most for any week since February 2020. Funds´ net long fell to 56,373 futures and options contracts from 87,208 a week earlier, marking their least bullish bean stance since December 2021.Most-active soybean and soybean oil futures had both fallen fractionally in the week ended May 2, while soybean meal shed 1.6%. Money managers continued their selling streak in soyoil, expanding their net short by more than 4,000 to 23,734 futures and options contracts, the largest since August 2019.Money managers´ net selling in CBOT soybean meal was the heaviest for any week since March 2017, but they removed gross longs at a record rate through May 2. That dropped their net long to 60,557 futures and options contracts, the lightest since June 2022 and down from 86,373 a week earlier.Soymeal futures fell fractionally between Wednesday and Friday, including a dip on Thursday to the lowest level since Dec. 1, 2022. Soyoil rose nearly 5% over the last three sessions after having hit two-year lows at the end of April, and soybeans gained 1.8%. Karen Braun is a market analyst for Reuters. Views expressed above are her own.",
        "(Editing by Diane Craft)"
    ]
}