{
    "articleURL": "/news/article-12046333/Russia-accuses-orchestrating-kamikaze-drone-assassination-attempt-Putin.html",
    "content": [
        "Russia accused Kyiv and US of attempting to assassinate Putin with drone strike But UK security officials believe the attack was 'false flag' operation by Russia  Appearing bloated today, Putin was seen in Kremlin for first time since strikesVladimir Putin was seen in the Kremlin for the first time since the building came under a kamikaze drone attack - the same day his Moscow allies bizarrely jumped to accuse the US of orchestrating an 'assassination attempt' on the Russian despot.",
        "Russian state television showed Putin looking bloated as he engaged in discussions with Economic Development Minister Maxim Reshetnikov at his official residence, less than 48 hours after fireballs erupted above the Kremlin's roof. At times, the Russian president looked visibly uncomfortable during conversations with Mr Reshetnikov - and at one point appeared to bow his head and wince in pain.It comes after the despot's furious officials sought to shift the focus on the US by claiming Washington had ordered the alleged drone strike on the Kremlin, just a day after blaming Ukraine.Kremlin spokesperson Dmitry Peskov insisted - without providing evidence - the US was 'undoubtedly' behind the strike that he said was carried out by Ukraine - claims the White House dismissed as 'lies'.",
        "'Decisions on such attacks are not made in Kyiv, but in Washington,' a furious Peskov said. 'Kyiv only does what it is told to do. Attempts to disown this, both in Kyiv and in Washington, are, of course, absolutely ridiculous.'Peskov's extraordinary claim came hours after Putin unleashed a barrage of missiles and explosive-laden drones with 'for Moscow' scrawled on them at Ukraine in response to the alleged strike on the Kremlin. Ukrainian President Volodymyr Zelensky denied Russia's claims Ukraine was behind the drone strike on the Kremlin and British security officials believe the attack was a 'false flag' operation by Russia to distract Kyiv from its anticipated counter-offensive and rally up support back home.",
        "A seething Peskov dismissed Ukraine's denials and ranted that the United States was 'undoubtedly' involved in the alleged drone strike - without providing any evidence. ",
        "'We know very well that decisions about such actions, about such terrorist attacks, are made not in Kyiv but in Washington,' Peskov insisted.He added, again without evidence, that Washington often selected both the targets for Ukraine to attack, and the means to attack them.'This is also often dictated from across the ocean. We know this well and are aware of this... In Washington they must clearly understand that we know this.' White House national security spokesman John Kirby told MSNBC television the Russian claims were false, and that Washington does not encourage or enable Ukraine to strike outside its borders. Moscow has claimed two Ukrainian kamikaze drones exploded over Putin's Kremlin residence in the early hours in 'a planned terrorist act and assassination attempt' - a move UK security officials believe is part of a false flag operation.Hours later, the Kremlin said it reserved the right to retaliate and hardliners including former president Dmitry Medvedev have said it should now 'physically eliminate' Zelensky. Peskov declined to say whether Russia saw Zelensky as a legitimate target. He said Russia had an array of options and the response, when it came, would be carefully considered and balanced. He said an urgent investigation was underway, but could not say when the results would be known.",
        "But within hours of those threats, around 40 explosive-laden drones - some with 'for Moscow' and 'for the Kremlin' written on them - were fired at Kyiv, Odesa and Zaporizhzhia.Missiles and drones also hit the southern city of Nikopol, destroying 11 homes and wounding a 32-year-old man. No deaths have been reported so far.Ukraine has consistently denied being part of any drone strike on the Kremlin. Zelensky, who is visiting the International Criminal Court in the Hague today, denied carrying out the attack or attempting to assassinate Putin, saying: 'We didn't attack Putin. We leave it to the tribunal. We fight on our territory, we are defending our villages and cities.'He also said he was certain Putin would be convicted once his invasion of Ukraine is defeated. And while Ukraine has demonstrated the capability to launch such attacks on the Kremlin, Kyiv is considered unlikely to risk fracturing international support by targeting the dictator directly.A Russian 'false flag' attack appeared a more likely explanation, with the explosion intended to generate support for Putin and further Russian attacks on Kyiv, UK officials said last night.",
        "In footage shared on social media, an unidentified object was seen flying through the night sky towards the Kremlin. Putin was not in the building.",
        "Suddenly the object burst into flames and a plume of smoke drifted over the ornate doomed roof. Muscovites reported hearing a loud bang, but the centuries-old building was unscathed. The apparent absence of any significant damage from a 'drone attack' supposedly intended to eliminate Putin was also considered suspicious. There were no casualties.",
        "Moscow claimed the drones were disabled using electronic radar assets. But it was also thought unlikely that any such object could have reached the Kremlin before being disabled.Putin at the time and was at his Novo-Ogaryovo residence outside Moscow, his spokesman Dmitry Peskov told Russia's state news agency RIA Novosti. Tobias Ellwood, chairman of the Commons defence committee, said: 'I've just returned from Kyiv where every effort is being made to retain international support.'It is therefore highly unlikely Ukraine would consider such an attack, which, if attributed to Ukraine, would jeopardise that support.'More likely, Putin was attempting to shore up domestic support using a pretext that he personally is being targeted by Ukraine.'Experts from the Institute for the Study of War think-tank said it is 'extremely unlikely that two drones could have penetrated multiple layers of air defence and detonated or been shot down just over the heart of the Kremlin in a way that provided spectacular imagery caught nicely on camera'. ",
        "They added: 'Russia likely staged this attack in an attempt to bring the war home to a Russian domestic audience and set conditions for a wider societal mobilisation.'The strike comes less than a week before the large annual military parade in Red Square on May 9 that marks the defeat of Hitler.The Kremlin has persistently attempted to persuade Russians that the present conflict is necessary to 'denazify' Ukraine.A staged explosion may have also been part of an internal public relations campaign designed to prepare Russians for Ukraine's counter-offensive.The thrust, using Western tanks and long-range missile systems, may lead to a loss of Russian-held territory in eastern Ukraine and heavy casualties.",
        "Ukrainian presidential adviser Mykhailo Podolyak said the accusation that Kyiv was behind the attack, as well as Russia's arrest of alleged Ukrainian saboteurs, could indicate Moscow was preparing for a large-scale 'terrorist' attack of its own against Ukraine in the coming days.",
        "Podolyak said the claims could provide a pretext for Russia 'to justify massive strikes on Ukrainian cities, on the civilian population, on infrastructure facilities'. He added that 'Ukraine does not attack the Kremlin because, firstly, that does not solve any military aims'.In recent days, Russia has launched a barrage of missile strikes at Ukraine, killing scores of civilians.",
        "On Wednesday, Russian missiles rained down on Ukraine's Kherson region, killing 21 civilians stood in queues at a train station and supermarket. Three energy workers were killed when they came under fire while making repairs north of the city.Russia has also been rocked by a series of sabotage attacks thought to have been orchestrated by Ukraine . Today, a drone attack set ablaze product storage facilities at the Ilsky refinery, one of the largest oil refineries in southern Russia. Emergency services extinguished the fire just over two hours later.And on Wednesday, a fuel depot further to the west caught on fire near a bridge linking Russia's mainland with the occupied Crimea peninsula. Meanwhile, following the alleged drone strike on the Kremlin, Russian officials called for an escalation in the conflict.In a statement posted on Telegram, Volodin said Russia should not negotiate with Zelensky after the purported attack. Russia has said it is open to negotiations, while making clear it would only enter talks on its own terms.The Pentagon is looking into the alleged attacks, according to a US official, speaking on condition of anonymity to discuss sensitive matters.US Secretary of State Antony Blinken said he is highly sceptical of any allegations made by Russia. 'I've seen the reports. I cannot validate them, we simply don't know,' Blinken said at an event in Washington.He added: 'I would take anything coming out of the Kremlin with a very large shaker of salt.'We'll see what the facts are and it's really hard to comment or speculate on this without really knowing what the facts are.'The alleged drone attack would be a significant escalation in the 14-month conflict, with Ukraine taking the war to the heart of Russian power.Phillips O'Brien, professor of strategic studies at the University of St. Andrews, said: 'It certainly wasn't an attempt to assassinate Putin, because he doesn't sleep in the roof and he probably never sleeps in the Kremlin.'",
        "He added it was too soon to prove or disprove whether it was a Russian attempt 'either to make Ukraine look reckless or to buck up Russian public opinion' or if it was a Ukrainian operation to embarrass Russia.Russia has increased air defences in Moscow and around Putin's palaces and residences. ",
        "Russian pro-war analysts expressed shock that drones could penetrate defences to the Kremlin, the official residence of the Russian president.Telegram channel VChK-OGPU stated that if Putin had been at the Kremlin, his spokesman would not have admitted it.Russian pro-war reporter Alexander Kots called for retaliation against Ukraine's leadership. 'They must be destroyed,' he said.'We should not hit the centres, but the people who make decisions. Methodically, systematically and ruthlessly.'The enemy is doing this systematically on our territory.'Retired colonel and military expert Anatoly Matviychuk said the alleged bid to assassinate Putin will lead to a massive Russian response.'I think that we will strike at the decision-making centre [of Ukraine] like… the presidential palace in Kyiv,' he said. Matviychuk claimed the US and Britain would have approved the drone strike on the Kremlin.He said: 'I think this attack was made on the advice of our Anglo-Saxon 'friends' in order to test our government's response.'How will we react - let's wait a couple more hours... Either there will be a political statement or there will be physical actions by our fighters. They [the Armed Forces of Ukraine] have already crossed not even the red line but the crimson line.'Pro-war reporter Sergey Karnaukhov said Nato planes were active over the Black Sea in the aftermath of the 'Ukrainian drone strike' on the Kremlin.The Russian outrage comes despite Putin's special forces attempting to assassinate Zelensky in the first days of his invasion.Gun battles broke out on the streets of Kyiv, and the Russian saboteurs - who were understood to have been ordered to capture or kill Ukraine's first family - were repelled from the capital, before Russia retreated fully a month later.The drone strike last night came a week after Ukrainian secret service agents allegedly tried to assassinate Putin with a kamikaze drone as he visited a newly built industrial site outside Moscow.",
        "The Ukrainian forces reportedly launched the UJ-22 drone, laden with 17 kilograms of C4 plastic explosives, from Ukraine on Sunday, April 23.But before the deadly drone reached the Rudnevo industrial park on its alleged mission to take out the Russian despot, it crashed a few miles short of their target, it was claimed. German tabloid Bild cited a tweet by Ukrainian activist Yuriy Romanenko, who claims to have close ties to Kyiv's intelligence services, alleging Ukrainian secret service agents had received 'information' about Putin's apparent trip.They decided to launch the deadly drone in an attempt to assassinate the president.He claimed a kamikaze drone that had crashed in Voroskogo village, 12 miles east of the industrial park, was the one that Ukrainian forces had launched as part of the assassination plot.It comes as Ukraine prepares for a fresh offensive against Russian troops that has been months in planning.In a possible sign that preparations are being stepped up, the frontline city of Kherson in southern Ukraine announced a long curfew for residents and sabotage acts behind Russian lines intensified.Kherson, which was re-taken by Ukrainian troops in November, will be under curfew from Friday evening until Monday morning.Regional officials said this was 'for law enforcement officers to do their job', but similar long curfews have also been used in the past for troop and arms movements.'During these 58 hours, it is forbidden to move on the streets of the city. The city will also be closed for entry and exit,' the head of Kherson's regional military administration, Oleksandr Prokudin, said on Telegram.He advised residents to stock up on food and medicine and said people could go for short walks near their houses or visit shops but should carry identity documents with them at all times.Kherson was captured by Russian troops last year in the first days of the invasion and remained under occupation until November 2022.After a sustained campaign of sabotage attacks, Kremlin forces withdrew from the city.They crossed to the eastern side of the Dnipro River which now delineates part of the front line in southern Ukraine.An explosion also caused a freight train to derail in the western region of Bryansk bordering Ukraine on Monday, governor Alexander Bogomaz said on Telegram. Yevgeny Prigozhin, head of pro-Putin Wagner private army, said: 'I believe that the offensive of the Ukrainian army has already commenced, basically. 'We see an extremely intensive activity of enemy aviation on the perimeter and inside the front line.'Meanwhile in Finland, Nato's newest member, Zelensky was on a surprise visit for a summit with five Nordic nations that have been key providers of military aid.'In order to be in Nato and support alliances to gain support, fundamental diplomatic work must be done. Ukraine is doing it today,' Daria Zarivna, Ukraine's presidential communications adviser, wrote on Telegram yesterday."
    ]
}