{
    "articleURL": "/tvshowbiz/article-12056347/Bel-Powley-says-touched-inappropriately-film-set-early-20s.html",
    "content": [
        "Bel Powley has claimed she was 'touched inappropriately' on the set of an indie film in her 20s - but felt that she couldn't speak up at the time. ",
        "The Diary Of A Teenage Girl actress, 31,  who recently starred in A Small Light and Everything I Know About Love, reflected on the industry at the start of her career. The actress said before the MeToo movement, there was a very different culture while filming - especially when she was younger. Bel claimed she was once 'touched inappropriately' by a senior member of the crew while working on an indie film in her early 20s.  She told The Independent: 'I’ve had someone grab my a**e and basically touch me inappropriately before but I was too scared to say anything. I was too scared to rock the boat.'",
        "She continued: 'I just avoided that person and it was fine, but what really has changed post-MeToo is you just know that you’re protected.' And on camera too things were far from easy as a young woman trying to make it in the industry. Bel said poorly-written contracts and awkwardness meant she felt obliged to feature in sex scenes, even though she felt uncomfortable. However she added that there seems to be a 'new code of conduct' since the MeToo movement as actors feel more protected.  Since then she has starred in A Royal Night Out as Princess Margaret and as the lead in Dolly Parton's Everything I Know About Love. ",
        "Her most recent project is A Small Light, which is now streaming on Disney+. Bel has landed the role of Miep Gies - the infamous guardian of Anne Frank's diary who helped hide her Jewish family. ",
        "And it's not the only project she has in the pipeline for release this year, including a historical mini-series about the US Air Force, with a sci-fi romance project also said to be in the works. Bel and her fiancé Douglas Booth are thought to have met on the set of Mary Shelley, filmed in Dublin and Luxembourg in 2016. In July of 2021, the couple shared enigmatic posts announcing they had taken their relationship to the next level.Douglas's post suggested he had proposed, while Powley referred to him as her 'husband'. Bel is also close friends with Mamma Mia actress Lily James, with the two said to be part of the same North London social circle. When finishing her role in A Small Light last year, Bel shared a smiling snap of herself outside a film trailer.'That's a wrap on A Small Light!!,' she wrote. 'Making this show was hands down one of the best experiences of my life. Thank you so everyone who made it so special.'Coming soon to @disneyplus @natgeotv...stay tuned.'",
        "According to IMDb, she's also lined up for a guest role in another historical mini-series - this time about the US Air Force, called Masters Of The Air.According to British GQ, the show - which also stars Austin Butler, Rafferty Law and Anthony Boyle and is produced by Tom Hanks and Steven Spielberg - details the stories of airmen who fought for the Allies in the skies during World War II.It's a sequel to the 2001 hit Band of Brothers. Deadline also reports that a sci-fi romance starring the actress - called Turn Me On - is in the works. According to the outlet, it's set in a world where humanity takes a daily vitamin to hinder the 'inconvenience of human emotion' - but a young couple decides to skip their dose and delve into the messy world of feelings. "
    ]
}