{
    "articleURL": "/news/article-12050975/Matthew-Perry-drives-Los-Angeles-114-000-Porsche-Taycan-4S.html",
    "content": [
        "DailyMail.com spotted Matthew Perry, 53, in a custom built $114,000 Porsche driving around Los Angeles The actor has an impressive car collection and owns noteworthy rides, including a Porsche Panamera, Audi R8, BMW 6 series and Aston Martin Perry was seen puffing on a cigarette while heading to an appointment and had a friend in the passenger seatMatthew Perry was spotted cruising through Los Angeles in a custom built $114,000 Porsche that he's added to his growing collection of luxury sports cars. ",
        "The Friends alum, 53, purchased a 2023 Porsche Taycan 4S, which increases in cost depending on modifications and upgrades chosen by the driver. DailyMail.com saw Perry puffing on a cigarette while heading to an appointment. He wore a sporty top and shades and had a friend in the passenger seat. ",
        "The car enthusiast has a well-documented love for luxury cars and is an owner of some noteworthy rides, including a Porsche Panamera, Audi R8, BMW 6 series and Lincoln Navigator. He also owns a $145,172 Aston Martin Vantage V8 Roadster and has been seen cruising around in it. The actor recently published his bestselling memoir Friends, Lovers and the Big Terrible Thing where he opened up about his extensive history with drug addiction. He revealed that his colon ruptured as a result of his opioid addiction when he was 49. Doctors gave him only a two percent chance of survival and he was in a coma for two weeks followed by months more in the hospital.The actor required 14 surgeries to help repair all of the abdominal damage, and he admitted to having gone to rehab 15 times over the years in hopes of kicking his drug addiction.In an interview with Diane Sawyer he even admitted going to open houses soo he could sneak into bathrooms and steal pills from medicine cabinets. ",
        "Perry sparked concern after his appearance on HBO Max special Friends: The Reunion, a one-off retrospective that aired in 2021. It was the first time the cast had reunited since 2004, when the sitcom ended its 10-year run.Fans noticed Perry's slurred speech in promos, which was later said to be due to an 'emergency tooth procedure' performed on the day of filming.",
        "The star raised eyebrows last year after seemingly bashing Hollywood heartthrob Keanu Reeves in his book. He asked why Reeves 'still walks among us'  when peers such as River Phoenix and Chris Farley had died prematurely.Perry wrote, 'River was a beautiful man inside and out - too beautiful for this world, it turned out.'It always seems to be the really talented guys who go down. Why is it that the original thinkers like River Phoenix and Heath Ledger die, but Keanu Reeves still walks among us?'Perry referred to Reeves a second time when reflecting on Chris Farley's fatal overdose in December of 1997.He issued an apology amid backlash for the comments. He said in a statemen, 'I'm actually a big fan of Keanu. I just chose a random name, my mistake. I apologize. I should have used my own name instead.'"
    ]
}