{
    "articleURL": "/sport/football/article-12056739/Borussia-Dortmund-6-0-Wolfsburg-Edin-Terzics-one-point-Bayern-Munich.html",
    "content": [
        "Borussia Dortmund kept the title race alive with a 6-0 win over Wolfsburg Jude Bellingham and Karim Adeyemi both scored braces in the victoryEdin Terzic's side are now one point behind Bayern Munich in the Bundesliga Borussia Dortmund demolished hapless VfL Wolfsburg 6-0 on Sunday, with two goals apiece from Karim Adeyemi and Jude Bellingham, to stay hot on the heels of Bundesliga leaders Bayern with three games left in the season.",
        "Bellingham's first goal was among the most bizarre he will ever score.He hit an excellent shot from distance and it looked like Koen Casteels had done well to keep it out, but the keeper could only watch as the ball looped across his box.It hadn't crossed the line when it bounced and looked to be moving harmlessly away from goal, but the ball had picked up some unfortunate back spin. It changed direction, and rolled gently into the Wolfsburg net. The goal came after the Ruhr valley club fired three past the Wolves in the first half to take the wind out of their sails.",
        "They added three more after the break in a one-sided game which Wolfsburg littered with defensive errors.Dortmund are now on 64 points, one behind Bayern, 2-1 winners against Werder Bremen on Saturday.In front of a sold-out crowd of more than 81,000, the hosts went in front after 14 minutes with Adeyemi rising high to head in his fifth goal of the season.The Wolves should have levelled in the 20th minute when Patrick Wimmer had only keeper Gregor Kobel to beat but his shot was blocked and Jonas Wind missed the target with his rebound.",
        "Instead it was Dortmund who struck again in the 28th when Adeyemi delivered a pin-point assist for Sebastien Haller to tap in.",
        "Donyell Malen did the same from a Julian Brandt assist in the 37th and after the break the hosts picked up where they had left off with Bellingham's peculiar goal.Wolfsburg's disastrous defending continued, with another wrong pass allowing Adeyemi to slip in and make it 5-0 in the 59th. The Germany international could have earned his first Bundesliga hat-trick but he thundered a 65th-minute penalty over the bar.Bellingham put an end to Wolfsburg's ordeal in the 86th.",
        "Borussia Dortmund: Kobel, Haller, Hummels, Wolf (Reyna, 69) Brandt, Malen, Bellingham, Can, Sule, Ryerson (Passlack, 76), AdeyamiUnused subs: Meyer, Schlotterbeck, Ozcan, Reus, Guerreiro, Moukoko, ModesteGoals: Adeyami (14, 59) Haller (28) Malen (37) Bellingham (54, 86)Wolfsburg: Casteels, Bornauw, Van de Ven, Kaminski, Baku (Fischer, 46), Nmecha, Wind, Arnold, Guilavogui (Paredes, 46), Svanberg, WimmerUnused subs: Pervan, Waldschmidt, Cozza, Pejcinovic, Gerhardt, Marmoush, Ambros"
    ]
}