{
    "articleURL": "/news/article-12043767/Lori-Vallows-brother-researched-firearms-attempted-shooting-Chad-Daybells-wife.html",
    "content": [
        "Detective Vince Kaaiakamanu said he believed Alex Cox's search history showed he was trying to gauge where to stand in order to shoot Tammy DaybellLori Vallow and Chad Daybell are accused of her murder - but ten days before she died she was the victim of an attempted shooting at home in Rexburg, IdahoCox looked up guns in the days before Tammy's death - he also Googled for pornLori Vallow's killer brother researched firearms before an attempted shooting of Chad Daybell's wife - and Googled 'trannys' and pornography.",
        "Detective Vince Kaaiakamanu told Vallow's murder trial Wednesday that in the days leading up to Tammy Daybell's death, Alex Cox searched for bullet drop data, using an AR-15 in cold weather and shooting a victim inside a vehicle.Kaaiakamanu said he believed Cox was trying to gauge where to stand in order to shoot Tammy. The mother-of-five died as a result of asphyxiation on October 19, 2019 - ten days after an intruder pointed a gun at her. Her husband Chad Daybell and Lori Vallow are accused of murdering her. The pair married two weeks later in Hawaii.Doomsday cultists Vallow, 49, and Daybell, 54, are further accused of killing her two kids JJ, seven, and Tylee, 16, the month before Tammy's death. Nine months later their bodies were found buried in Daybell's backyard in Rexburg, Idaho.A list of Cox's searches for firearms on October 10 were displayed on the screen. But Vallow's defense attorney John Thomas put to Kaaiakamanu that there were other searches which showed he was not just a 'gun nut.' The cop agreed Cox also looked up 'trannys' and porn but these were omitted because they were 'not pertinent.'",
        "Cox, who died of natural causes in December, 2019, shot dead Vallow's estranged husband Charles in Arizona that July. He claimed self-defense but Vallow has since been charged over the shooting. She is yet to face trial in that case.",
        "Ten days before Tammy's death, a masked man approached and shot at her several times with what she believed was a paintball gun before running off. Jurors heard earlier how Cox had visited a local store and bought a ski mask and fingerless gloves.The Ada County Courthouse in Boise heard today how on October 8, Cox searched for bullet drop from 100 yards, 200 yards and 300 yards. The following day he looked up several different AR-15 uppers and muzzle energy.On October 10, he searched for using an AR-15 in cold weather and also a YouTube video for firing the rifle at -30 degrees. It was 26 degrees that day.He performed further searches for guns and ammunition on October 12. He also looked up a Dodge Dakota - the type of car which Tammy Daybell drove. He Googled what would be required to shoot through a car.Cox visited the Fremont County Sportsman’s Club, a shooting range, on October 7, 9, 12, 13 and 15.An AR-15 that was seized from Vallow's garage can resemble a paintball gun because of its scope, Kaaiakamanu told jurors. The firearm was shown to jurors and the detective indicated how the scope could be mistaken for the hopper - which holds paintballs - on a paintball gun.",
        "Kaaiakamanu testified: 'When Tammy Daybell called in the attempted shooting, she described the rifle as a paintball gun. After looking at all the firearms, this one stuck out because it has a larger scope on it which could be mistaken for a hopper, which Tammy described. A hopper is on a paintball gun.'The State says that Cox was involved in killing Vallow's two kids in September, 2019. He was part of the couple's doomsday cult which believed the children were 'zombies' that had been possessed by Satan. The same deranged theory was espoused about Tammy Daybell and Charles Vallow before their deaths.Jurors were earlier played a bizarre 'blessing' in which Daybell thanked Cox for assisting the couple following the killings.In the 15-minute recording, made on November 24, 2019, Daybell says: 'You have already assisted us in ways that can never be repaid, but you will continue to do so as you move forward in this life.'Tammy died at the Daybells' home in Rexburg in the early hours of October 19, 2019. She was initially determined to have died of natural causes but when cops started searching for Vallow's missing children her body was exhumed. An autopsy - which had earlier been refused by Daybell - found she was suffocated.",
        "Vallow and Daybell tied the knot on a beach in Kauai on November 5, 2019. Receipts show she purchased her own wedding ring on Amazon almost three weeks before Tammy's death. The children were missing for almost a year before their corpses were found buried in Daybell's yard on June 9, 2020.During the opening, prosecutor Lindsey Blake described how charred remains were all that was left of Tylee.She told jurors: 'You will hear it explained as a mass of bone and tissue. That's what was left of this beautiful young woman.'Tylee's DNA was later found on a pickaxe and shovel in a shed on the property.JJ's body was wrapped in trash bags and duct tape - the tape binding his arms in front of him and wrapping around his head. He had been suffocated inside a plastic bag.The two children and Daybell's previous wife Tammy were all killed because they stood in the way of the couple's relationship, the State says. 'Remember, the defendant will remove any obstacle in her way to get what she wants, and she wanted Chad Daybell,' Blake told jurors.",
        "'The defendant used money, power and sex to get what she wanted.'Jurors have heard from friends and relatives of Vallow that she and Daybell believed the children were 'dark' and referred to them as 'zombies' before they disappeared.",
        "'The common theme was the body has to be destroyed,' Blake said. 'The defendant and Chad used their self-proclaimed religious teachings to justify their actions to others — their actions from affair to murder.'Prosecutors say the couple planned to use life insurance money from Tammy's death, and that Vallow kept collecting and spending the children's social security and benefits after they died.The trial opened on April 10 and the State is still laying out its case. Vallow denies two counts of first-degree murder and three counts of conspiracy in the deaths of her two children and Tammy Daybell.She further denies grand theft for allegedly collecting government benefits on behalf of her children after they were killed.Daybell is being tried separately.",
        "July 11, 2019: Lori Vallow's husband, Charles Vallow, is killed by her brother, Alex Cox, in Arizona. Police initially rule that Alex acted in self defense but reopen the case months later after the children are reported missing. August, 2019: Lori moves children JJ and Tylee to Rexburg, Idaho, close to where her future husband Chad Daybell lives with his wife Tammy.September 8, 2019: Tylee is seen alive for the last time during a trip to Yellowstone National Park with Lori, JJ and Alex. In the following weeks Lori tells people that her daughter is studying at Brigham Young University's Idaho campus.September 23, 2019: The last time JJ is seen at his school in Rexburg. Lori emails the school the following day claiming she is moving the family to California for a new job. October 2, 2019: Brandon Boudreaux, the ex-husband of Lori's niece Melani Pawlowski, is targeted in a drive-by shooting in Arizona. Police identify the vehicle carrying the shooter as a Jeep registered to Charles Vallow, Lori's late husband. October 19, 2019: Chad's wife Tammy, 49, dies at their Idaho home. An obituary states that she passed away peacefully in her sleep. Chad declines an autopsy and her death is listed as due to natural causes.October 25, 2019: A friend of Tylee receives a vague 'miss you' text from her phone but says that it didn't sound like the teen.   November 5, 2019: Lori and Chad tie the knot on a beach in Kauai. Receipts indicate that Lori purchased her own wedding ring from Amazon nearly three weeks prior to Tammy's death. November 26, 2019: Out-of-state relatives ask Idaho police to perform a welfare check on JJ. Lori and Chad claim he is in Arizona with relatives and ask their friend, Melanie Gibb, to lie and say she took the boy there for Thanksgiving. Police soon learn that no one has seen JJ or Tylee, since September. November 27, 2019: Police execute a search warrant related to the children at Lori's home and discover that she and Chad have fled Idaho.December 11, 2019: Tammy's body is exhumed from a Utah cemetery and her death is reclassified as suspicious.December 12, 2019: Lori's brother, Alex Cox, is found dead in a bathroom in his Arizona home. Months later an autopsy determines that he died of natural causes while he had the overdose drug Narcan in his system. December 21, 2019: Rexburg police issue the first press release about JJ and Tylee, revealing they believe their disappearance could be linked to Tammy's death and asking the public for information.December 24, 2019: Lori and Chad issue a statement through an attorney saying they love their son and daughter and look forward to addressing 'allegations once they have moved beyond speculation and rumor'.December 30, 2019: Police accuse Lori and Chad of lying to investigators and say they believe the couple know where the kids are or what happened to them.January 3, 2020: Police search Chad's home in Salem and remove 43 items, including tech devices and journals. They also comb over sections of the snow-covered yard with rakes and metal detectors.January 26, 2020: Lori and Chad are seen for the first time in months as police serve them with two search warrants in Kauai. Lori is also served with a court order to produce the children to authorities in Idaho in five days. The couple are approached by the media while officers serve the documents and refuse to say anything about the children.January 30, 2020: Lori misses the court deadline to produce the children to Idaho authorities.February 20, 2020: Lori is arrested in Kauai and charged with two felony counts for desertion and nonsupport of dependent children, and one misdemeanor count each for resisting and obstructing an officer, solicitation of a crime, and contempt of court. March 5, 2020: Lori is extradited to Idaho, where she is held on $1million bond at Madison County Jail.March 17, 2020: Lori professes her innocence in a statement through her attorney as two other members of her defense team quit and the judge removes himself from the case. March 24, 2020: Court documents filed in the divorce of Lori's niece Melani and her husband Brandon Boudreaux allege that Lori told people she believed her children were zombies before they disappeared. April 9, 2020: Authorities reveal they are investigating Lori and Chad for murder, attempted murder and conspiracy in connection with Tammy's death. June 9, 2020: Police search Chad's home in Salem for the second time and discover human remains in the backyard. Chad is taken into police custody and charged with destruction or concealment of evidence.May 25, 2021: Lori and Chad are charged with first degree murder in the deaths of the children. Chad is also charged with first-degree murder in the death of his wife Tammy. May 27, 2021: Lori is deemed incompetent to stand trial on the murder charges in Idaho. August 5, 2021: Prosecution announces it will seek the death penalty for Chad. April 11, 2022: Lori is restored competency. Criminal proceedings against her in Idaho are ordered to continue. April 14, 2022: Lori is taken to the Madison County Jail in Rexburg, Idaho, by Fremont County Sheriff officers.April 10, 2023: Lori Vallow goes on trial for the murders of JJ, 7, and Tylee, 16. "
    ]
}