{
    "articleURL": "/wires/aap/article-12038611/Childcare-cost-relief-Aussie-families.html",
    "content": [
        "The private sector is confident the Albanese government can hand down a responsible budget that will be good for business.",
        "More than two-thirds of mid-sized business owners surveyed agreed the federal budget, due to be handed down next week, would be positive for the business community.But the RSM Australia survey of more than 300 mid-sized businesses also found almost a third thought their own business would be in a worse position post-budget, with half believing they would be in a better spot and 17.5 per cent predicting no change.RSM Australia chief executive partner Jamie O'Rourke said small and medium sized businesses were comfortable with the Labor government's approach to tax reform that's largely targeted at the big end of town.But he also said the focus on responsible budgeting that does not fuel inflation would mean little extra support for businesses.\"This doesn't bode well for new cash injections for businesses or households outside what the government has already promised, such as targeted energy bill relief, and a focus on the disadvantaged,\" he said.Also on Wednesday, the government committed $55.31 billion across the next four years in this month's budget to make child care more affordable from July.The signature election pledge will benefit about 1.2 million families nationwide, with more than 400,000 families in NSW, 302,100 in Victoria, and 284,100 in Queensland to receive a boost.Treasurer Jim Chalmers said cheaper child care was a key plank in addressing the cost of living as he battles to contain high inflation.",
        "\"What we've tried to do is to provide cost of living relief in a number of areas so that we can make things a little bit easier,\" he told reporters in Canberra on Wednesday.\"Cheaper child care will make life easier for a lot of families in a way that doesn't add substantially to the inflation challenge in our economy.\"Opposition finance spokeswoman Jane Hume said the government needed to rein in spending to curb high inflation following the central bank's rate hike.\"The RBA put out some signals,\" she told AAP.\"We want to make sure that we see a budget that isn't going to make the inflation situation worse. Getting inflation under control is a team sport.\"The government will also set aside $72.4 million across five years to support the training of early childhood educators and the care sector.More than 80,000 early childhood educators will benefit from the package, with a focus on regional and remote services, and Indigenous organisations.Speaking at the National Press Club on Wednesday, Grattan Institute chief executive officer Danielle Wood said Australia will not meet its full potential until the nation makes better use of the capabilities of its highly talented women.Ms Wood said the government's commitment to more affordable and accessible early learning and care and increasing parental leave were important steps on that journey but said there was more room for improvement.",
        "She singled out reforming the childcare activity test, which significantly restricts access to subsidised childcare for some families, as one priority, as well as lifting wages for childcare workers.\"The fact that trained workers doing this critical and emotionally challenging work are getting little more than those flipping burgers at McDonald's or manning the counters a Bunnings, should shock us,\" she said."
    ]
}