{
    "articleURL": "/wires/afp/article-12053243/US-Saudi-Arabia-say-Sudan-warring-sides-start-talks.html",
    "content": [
        "The US and Saudi governments confirmed direct talks between the warring Sudanese army and the Rapid Support Forces would start in Jeddah on Saturday, even as fighting showed little signs of abating in the Sudanese capital.",
        "A joint US-Saudi statement welcomed the \"start of pre-negotiation talks\" and urged sustained global support to quell fighting.\"The Kingdom of Saudi Arabia and the United States urge both parties to take in consideration the interests of the Sudanese nation and its people and actively engage in the talks toward a ceasefire and end to the conflict,\" the statement said.Hundreds have died in nearly three weeks of fighting between forces aligned with Sudan's de facto leader Abdel Fattah al-Burhan, who leads the regular army, and his deputy-turned-rival Mohamed Hamdan Daglo, who commands the paramilitary Rapid Support Forces (RSF).Multiple truces have been reached since the fighting erupted on April 15, but none has been respected.The army confirmed late Friday it had sent envoys to Saudi Arabia to discuss \"details of the truce in the process of being extended\" with its paramilitary foes.",
        "Burhan had given his backing to a seven-day ceasefire announced by South Sudan on Wednesday, but early on Friday the RSF said they were extending by three days a previous truce brokered under US-Saudi mediation.The US-Saudi statement noted the efforts of other countries and organisations behind this weekend's talks, including Britain, the United Arab Emirates, the League of Arab States, the African Union and other groups.",
        "In Khartoum, witnesses reported continued air strikes and explosions on Friday, including near the airport.The fighting raged despite a threat of sanctions from US President Joe Biden against those responsible for \"threatening the peace, security, and stability of Sudan\" and \"undermining Sudan's democratic transition\".The north African country suffered decades of sanctions during the rule of autocrat Omar al-Bashir, ousted in a palace coup in 2019 following mass street protests.\"The violence taking place in Sudan is a tragedy -- and it is a betrayal of the Sudanese people's clear demand for civilian government and a transition to democracy. It must end,\" Biden said.- Children at risk -The conflict has killed about 700 people so far, mostly in Khartoum and the western Darfur region, according to the Armed Conflict Location and Event Data Project.The UN children's agency, UNICEF, warned Friday that \"the situation in Sudan has become fatal for a frighteningly large number of children\".",
        "Spokesman James Elder said UNICEF had received reports from a trusted partner -- not yet independently verified by the United Nations -- that 190 children were killed and 1,700 wounded during the conflict's first 11 days.He said the figures had been gathered from health facilities in Khartoum and Darfur since April 15, meaning that they only cover children who actually made it to facilities in those areas.",
        "\"The reality is likely to be much worse,\" Elder said.Aid workers have struggled to get much-needed supplies to areas hit by violence.According to the International Medical Corps, at least 18 aid workers have been killed amid the fierce urban fighting.The UN Human Rights Council said it would hold a special session next Thursday \"to address the human rights impact of the ongoing conflict\".US Director of National Intelligence Avril Haines said Thursday that Washington expected the conflict to continue for a long time.",
        "The fighting was \"likely to be protracted as both sides believe that they can win militarily, and have few incentives to come to the negotiating table\", she told a Senate hearing.Nearly 450,000 civilians have already fled their homes since the fighting began, the International Organization for Migration said, including more than 115,000 who have sought refuge in neighbouring countries.- International mediation -The UN refugee agency, UNHCR, said it was preparing for an outflow of 860,000 people, adding that $445 million would be needed to support them just through October.",
        "Haines said the conflict had exacerbated already dire humanitarian conditions, \"raising the spectre of massive refugee flows and aid needs in the region\".The UN warned that if the fighting continued, it could raise the already large number of Sudanese threatened by hunger and malnutrition by as many as 2.5 million.",
        "\"That raises the number to a total of 19 million people in the next three to six months,\" said Farhan Haq, a spokesman for UN chief Antonio Guterres.Mediation efforts have multiplied since the conflict began.Speaking from the Ethiopian capital, Burhan's envoy Dafaallah al-Haj vowed that \"shortly the government of Sudan is going to put an end to this rebellion\", referring to the RSF.The RSF is descended from the Janjaweed, a militia unleashed by Bashir in Darfur, leading to war crimes charges against the former leader and others.After a joint coup in October 2021 that upended a fragile transition to civilian rule, Burhan and Daglo have engaged in a power struggle -- most recently over the RSF's integration into the regular army -- which has now flared into bloody violence."
    ]
}