{
    "articleURL": "/news/article-12053813/Brits-celebrating-Coronation-Benidorm-Patriotic-tourists-don-Union-Jack-T-shirts.html",
    "content": [
        "British pubs on the Costa Blanca promising full live coverage of the coronationCORONATION LIVEBLOG: Click here to follow live updates throughout today  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Not wanting to miss out on the coronation celebrations, Brits in Benidorm have hit the beach to mark the historic event - enjoying far sunnier climes than royal fans are seeing in rainy London.",
        "Tourists kitted out in Union Jack t-shirts strolled along the beachfront under sun and blue skies with temperatures expected to reach a glorious 24 degrees Celsius (75.2 Fahrenheit) today.A hotspot for Brits abroad and home to scores of ex-pats, many in the Spanish town are putting on events to rival Britain's street parties.British pubs in the Costa Blanca offered full live coverage of the momentous occasion, complete with cut-price beer and prosecco and traditional afternoon teas.Patriotic punters turned out early this morning in their red, white and blue garb, paying homage to King Charles III and Queen Camilla on the day of their coronation.",
        "Brits have piled into bars and pubs to watch live feeds of the ceremony, declaring God Save the King as the crown was placed on Charles' head. Toasts have been made to the King across British pubs on the Costa Blanca, with pictures showing jubilant families celebrating.At the Ibrox Bar, a publican unveiled a portrait of the new King after he was officially crowned.Pubs had been advertising their showings of the coronation for days ahead of the event, with landlords seen making preparations for an onslaught of royal fans.A staff member at the Jumping Jacks pub in Benidorm proudly put up a Union Jack flag alongside a patriotic guitar decoration.",
        "The pub had a huge TV screen up ready for the event, allowing people to watch the procession and ceremony live all the way from Spain.The Royal Arrow put, which declared itself the 'one and only' place to catch the coronation in Benidorm, urged royal fans to get there early if they wanted to secure a seat.",
        "Other bars tempted customers with special coronation offers, including a free buffet and €1.50 pints of lager to toast the King at one venue called Bar Happy Days.Meanwhile other venues offered more traditional British treats, with scones and tea being put on at The One Bar. As pubs opened up, royal fans began to pour into the town this morning, proudly wearing their support for the new monarch on their sleeves.Many opted to soak up some rays on the beach, while displaying their patriotism with Union Jacks and Queen Elizabeth II pictured on their tops. ",
        "A couple were seen wearing royal -themed T-shirts as they walked along Levante beach.Another royal fan sported a bold Union Jack top in a show of support for the King.It comes as Brits have been flocking to Spanish hotspots like Benidorm, Barcelona and Ibiza to catch some sun.One tourist firm told Spanish media that it has seen the number of Brits heading to the tourist traps rocket, as they try to make the most of the bank holiday weekend."
    ]
}