{
    "articleURL": "/wires/ap/article-12060665/Banks-report-tougher-credit-standards-wake-failures.html",
    "content": [
        "WASHINGTON (AP) - A Federal Reserve report Monday showed that banks raised their lending standards for business and consumer loans in the aftermath of three large bank failures and expect to lift them more this year, a trend that could slow the economy in coming months and increases the risk of a recession.",
        "The report, known as the senior loan officers survey, asked banks if they have tightened their lending standards by taking steps such as demanding higher credit scores, charging higher interest rates, or requiring more collateral, among other steps, that altogether would make it harder for businesses and consumers to obtain loans.About 46% of all banks said they had raised standards for business loans known as commercial and industrial loans, up from just under 45% in the previous quarter. That increase was not as dramatic as in previous quarters, but banks were tightening credit before the bank failures. A year ago, slightly more banks were easing credit standards than raising them. Now nearly half are tightening.At the depths of the 2008 financial crisis, that figure topped 80%.The Fed´s survey also found that a majority of banks plan to tighten their credit further this year.\"That will starve firms and households of credit and help push the economy into recession in the second half of this year,\" Michael Pearce, lead US economist at Oxford Economics, wrote in a note.",
        "Other economists say it is hard to know exactly when a pullback in lending will start to slow the economy and by how much. Federal Reserve staff economists have also forecast a \"mild recession\" for later this year, in part because of an expected reduction in lending.",
        "Last week Fed Chair Jerome Powell said that the turmoil in the banking sector could slow the economy and help the central bank in reducing inflation, which would mean the Fed wouldn't have to raise interest rates as high as it would otherwise.\"In principle, we won´t have to raise the rates quite as high as we would have had this not happened,\" Powell said.Also Monday, Austan Goolsbee, president of the Federal Reserve Bank of Chicago, said he is hearing from business contacts that banks are starting to rein in lending. He suggested that could mean the Fed would limit its rate hikes. The Fed, in a statement last week, signaled it may pause its interest rate increases at its next meeting in June.\"I don´t know that it´s a full-blown credit crunch, but it´s certainly credit tightening,\" Goolsbee said in an interview with Yahoo Finance. \"That will slow the economy, and we absolutely should have to take that into account when we´re setting monetary policy.\"The report follows other signs that the collapse of Silicon Valley Bank, Signature Bank, and First Republic Bank in the past two months has caused other financial institutions to reduce their lending to conserve capital.Federal Reserve officials and economists will closely scrutinize the report, because tighter credit standards are expected to be followed by a reduction in lending. That could force businesses to pull back on expansion plans and reduce hiring, and could limit sales of cars and homes.",
        "The survey respondents were 65 U.S. banks and U.S. branches of 19 foreign banks. The results were gathered from March 27 to April 7, well after Silicon Valley Bank and Signature Bank collapsed in early March, touching off the latest round of bank turmoil. First Republic bank failed a week ago, the second-largest bank failure in U.S. history.The Fed's report said that mid-sized banks - those with assets between $50 billion and $250 billion, like the three banks that failed in March - were more likely to report tighter standards.The banks also said they are restricting credit for most consumer loans, including auto and credit card lending and home equity lines of credit.Separately Monday, the Fed released its twice-yearly financial stability report, which examines the financial sector - banks, insurance companies, and investment funds - for any potential signs of future turmoil or disruption.The report said that commercial real estate loans - particularly loans to downtown office buildings and retail sites - were at greater risk of default as fewer Americans report to work in cities, preferring instead to work from home. Those loans are disproportionately held by smaller banks.\"The Federal Reserve has increased monitoring of the performance of (commercial real estate) loans and expanded examination procedures for banks with significant\" exposure to such loans, the report said.",
        "At the same time, the report said that on average, most loans for commercial properties were backed by significant down payments, reducing the risk to banks from widespread defaults."
    ]
}