{
    "articleURL": "/news/article-12038929/Runaway-detainee-20-arrested-police-eight-flee-Yarls-Wood-immigration-removal-centre.html",
    "content": [
        "Thirteen detainees escaped the detention centre in Bedfordshire on Friday nightFive were caught shortly afterwards, with a sixth taken into custody on Tuesday A man suspected of being a runaway detainee has been arrested by police after eight people fled an immigration removal centre. ",
        "Police say they took a man in his 20s into custody on Tuesday in Warwickshire on suspicion of escaping lawful custody.It comes days after 'disorder' at the Yarl's Wood immigration centre in Milton Ernest, Bedfordshire, on Friday night.A major manhunt was launched after 13 people escaped through the perimeter fence at the site following a row over access to a gym late on April 28.Five people were quickly caught but eight others, including seven Albanian men - some of whom are believed to be convicted drug dealers - remained at large.",
        "The eight runaways were all men included seven people in their 20s and one in his 30s.The man arrested today has been taken to Bedfordshire for questioning, the Bedforshire Police said.Detective Superintendent William Hodgkinson from the force, leading the policing operation, said: 'We are taking this investigation extremely seriously and working with law enforcement agencies across the country to capture and return the escapees.'Please be assured that we are doing everything in our power to return the men and I expect that we will make further arrests over the coming days.'I understand that this incident has caused concern among local residents, and I wish to reassure people that there is no risk to the local community as a result of what has happened.",
        "'The immigration removal centre itself is calm and has returned to normal and I know staff there are working hard to prevent any further incidents like this from happening.'The riot is said to have started when 40 detainees - who are held at the centre while awaiting deportation - were prevented from using the gym.A team of prison staff and a tactical response group were sent to restore order as the detainees used gym equipment to damage the property and grounds.",
        "Bedfordshire Police Assistant Chief Constable Karena Thomas said previously: 'During the incident, 13 people made off from the premises through the outer fencing.'Five of these have been detained but eight others, seven Albanian men in their 20s and one in his 30s, are still being looked for.'We are continuing to investigate their whereabouts to ensure the safety of the detainees as well as the wider public and wish to reassure people that none pose any risk to the wider community.'The public services group Serco, who runs the Yarl's Wood centre, said the incident is now a police matter."
    ]
}