{
    "articleURL": "/news/article-12039631/Box-junction-cash-grab-councils-Drivers-face-unfair-fines.html",
    "content": [
        "Motorists should not enter yellow-lined boxes on junctions unless exit is clearDrivers face unfair fines if councils grab powers to issue yellow box junction penalties, the RAC warned yesterday.",
        "Motorists should not enter the boxes unless the exit is clear and are hit with fines if they get stuck in one. But outside London, only police forces have the power to punish motorists in England.But research by the RAC found that 27 councils have put forward proposals to enforce 111 boxes under legislation introduced last year.If successful, they can issue their own fines. The RAC said there are problems with 90 per cent of the 111 boxes 'likely to lead to' unfair fines.",
        "The RAC'S Simon Williams said: 'It is a moral duty to ensure that fines are fair, justified and the appeals process is consistent across the country.'In England outside London, only police forces have the power to punish motorists over their use of yellow box junctions.But 27 councils have put forward proposals to enforce 111 boxes under legislation introduced by the Government in May 2022.Successful applicants will be able to issue penalty charge notices (PCNs) to offending drivers.On Transport for London's (TfL) red routes, PCNs are £160, reduced to £80 if paid within 14 days.Chartered engineer Sam Wright was commissioned by the RAC to analyse the 111 boxes which councils have put forward proposals to enforce.The RAC said there are issues with 90% of the boxes which are 'likely to lead to drivers being fined unfairly'.",
        "Forty boxes were found to pose visibility difficulties such as faded road markings, while 18 extend beyond junctions.Mr Wright, who was formerly responsible for the design and approval of yellow boxes on TfL's road network, said: 'I haven't seen a single proposal that reviews the visibility of the box from a driver's point of view.'If you also factor in bad weather, poor light and other vehicles, then the poor visibility situation is exacerbated.'This is all very concerning, especially as enforcement is carried out via cameras high in the air.'Many of the boxes have been around for years, perhaps decades.'It appears that many authorities have simply assumed that the boxes already on the ground are suitable for enforcement without carrying out a fresh assessment as is recommended in Government guidance.'Mr Williams added: 'Fining people can have real financial consequences for those on the receiving end.'Enforcing yellow boxes means that the driver of a vehicle overhanging a box by any amount for just a moment can get a ticket.'Yet many drivers end up stopped or trapped in these junctions through no fault of their own.'It is not only imperative, but a moral duty to ensure that fines are fair, justified and that the appeals process is consistent across the country. ",
        "'We urge the Government to carry out an urgent review of its yellow box junction guidance and clarify what is and isn't enforceable.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}