{
    "articleURL": "/wires/pa/article-12056619/PM-joined-US-First-Lady-Jill-Biden-Downing-Street-Big-Lunch.html",
    "content": [
        "US First Lady Jill Biden has joined Prime Minister Rishi Sunak in Downing Street for a lunch to mark the King’s coronation.",
        "The weather stayed dry as Mrs Biden and her granddaughter Finnegan Biden arrived at the event shortly before 2pm.The Prime Minister and First Lady laughed and joked as they met, giving each other a kiss on both cheeks.Mrs Biden, who wore a long white embroidered dress for the outside event, arrived wearing sunglasses and was met by Mr Sunak’s wife, Akshata Murty.",
        "Also present at the event were Mr Sunak’s two daughters, Anoushka and Krishna, and the family dog, Nova – who sported a union flag bandana.Two long tables covered in white linen, with vases of tulips and mugs saying King Charles III, were set up in front of the famous black Number 10 door.Guests tucked into dishes including coronation quiches, coronation chicken, sausage rolls and smoked salmon.The food has been sourced from across the UK, including beef from Gloucestershire, which is being served in Yorkshire puddings, Scottish Loch Duart salmon, Northern Irish soda bread and ice cream from Wales.The crockery has been donated by Emma Bridgewater, a pottery with strong royal connections.The street was bedecked in union flag bunting with music played by the RAF Northolt brass quintet.",
        "Mr Sunak arrived shortly before Mrs Biden, walking out of the famous Number 10 door with his family.",
        "He said: “Hello, how are you?” to the gathered guests before starting to mingle.Recipients of the Points of Light Award, given to ordinary people doing extraordinary things for their community, were among the invitees along with Ukrainians who have come to the UK under the Homes for Ukraine scheme after Russia invaded their country, as well as their UK sponsors.Other guests include young people from UK Youth and the National Association of Boys and Girls Clubs.Laura Ashurst, a breast cancer campaigner from Stokesley in North Yorkshire, was sitting opposite Mrs Biden at the Big Lunch.She said: “It’s been absolutely amazing. We’ve met some amazing people from all over the country.“There’s so many people doing so much admirable and amazing work in their communities and for charity.”",
        "Mrs Ashurst said she and the First Lady discussed the work Mrs Biden has been doing with people with breast cancer, and exchanged some stories.She told the PA news agency: “It’s an absolute privilege to be here.”Zoe Clark-Coates, who runs a charity with her husband, Andy, supporting people who have gone through baby loss and is also co-chairing a pregnancy loss review for the Government, said it was “such an honour to be amongst so many people doing such great work”.",
        "Mr Sunak spent about an hour at the event and was given a round of applause as he went back into No 10.He and Ms Murty hosted the event as part of the Big Lunch celebrations taking place across the country over the coronation weekend."
    ]
}