{
    "articleURL": "/news/article-12047895/Royal-Navy-sailor-COLLAPSES-Whitehall-rehearsal-coronation.html",
    "content": [
        "The woman had to be helped from the ground after struggling during trainingFootage shot at around 2.15am showed concerned colleagues rushing to her aidREAD MORE: Kate and William hit the pub and pose for selfiesThis was the moment a Royal Navy sailor collapsed during a Whitehall rehearsal for the King's coronation.",
        "The woman was helped from the ground after she struggled during her intense training in central London in the early hours of Wednesday.The footage, which was shot at around 2.15am, showed her concerned colleagues rushing to her aid. She was prompted to her shaky feet by two colleagues before she was escorted from the area.The onlooker who shot the footage, said: 'I felt really privileged to see [the practice].",
        "'I just wanted to show people how hard they are working - it shows how committed they are.'It was wonderful to watch them practicing and it felt very special to be seeing it before anyone else.'I was just panning across when I noticed her fall down. I hope she's okay - I felt awful for her.'A stretcher was bought for the sailor but she was able to walk away without any serious assistance while rows of her fellow colleagues stood in position. 'Someone very important looking came over to help her,' the eyewitness, who asked to remain anonymous, added. 'They were all very professional.'A Royal Navy spokesperson said: 'We are very proud of our personnel who are working incredibly hard at this time.'Their training has been scheduled to condition personnel in a measured way for the rigours of long periods of standing and marching.",
        "'This is an intense period for them, and significant periods of rest have been scheduled before and after major periods of activity.'It's understood the woman - whose identity has been obscured - fully recovered and continued to train.King Charles III's coronation takes place in London this Saturday.More than 6,000 members of Britain's armed forces will take part - the largest military ceremonial operation for 70 years."
    ]
}