{
    "articleURL": "/wires/pa/article-12044739/Brazilian-2-000-memorabilia-pieces-says-royals-extension-family.html",
    "content": [
        "A 22-year-old from Brazil with a collection of more than 2,000 pieces of royal memorabilia has said he considers the royals “an extension of my own family” as he prepares for a “historic” celebration on coronation day.",
        "Since the age of 15, Savio Valei has been dedicating himself to building a royal collection, which includes a doll of the Princess of Wales that cost £240 (1,500 Brazilian Real).Mr Valei, who works as a lawyer and will turn 23 a week after the coronation, said he is “really excited” for the “historic day” and will coincide his birthday celebrations with the King’s coronation.“My birthday is May 12th, so I decided to celebrate my birthday on coronation day,” Mr Valei told the PA news agency.“I’m going to decorate the whole house with red, blue and white flags and balloons. It will be a wonderful and historic day.”",
        "Mr Valei follows the royal family from Sao Paulo but considers them as part of his own family as he “loves the legacy they carry”.“I like the royal family because first of all, they are a family,” he said.“I just love the legacy they carry – the royal genealogy, the history, the tradition, and I also enjoy following their lives and work.“They are like an extension of my own family.“I’ve followed them all these years, I celebrate the important dates and I’m saddened by the deaths and family fights.”Mr Valei has “always loved British history” and first became interested in the royal family after the birth of Princess Charlotte, saying “it was love at first sight”.",
        "“I remember that on May 9 2015 I was celebrating my 15th birthday and everyone was talking about the clothes that Prince George wore to visit his newborn sister,” he said.“It made me curious and I started researching and never stopped.”",
        "Among his favourite memorabilia pieces is a framed picture of a handwritten card and bouquet of white roses, placed in Hyde Park by his friends who live in London after Queen Elizabeth II’s death last September.His message read: “Dear Queen Elizabeth, thank you for everything. Rest in peace. With love Savio Valei.”The card and flowers were a gift from Mr Valei and he asked his friends to capture a picture of them among the other tributes so he could hang the image on his wall to remember the late Queen.His bedroom is decorated from floor to ceiling with an array of memorabilia from magazines to dolls.Despite this dedicated space in his home, he admitted there is now little room to display everything.“I have approximately 2,000 pieces, including books, magazines, mugs, dolls, tea tins, photos, replicas,” he said.“The most expensive memorabilia I own is probably a Kate Middleton wedding doll – it’s 50cm long and I still haven’t found a suitable place to display it.”",
        "As well as admiring the King, the lawyer also has great respect for the Queen Consort and said she is “an excellent Queen”.“Charles has been preparing for many years to be King, so I’d say he is more than fit for this supreme role,” he said.“Camilla will also make an excellent Queen, she has earned my respect and admiration during these years of working for the royal family.”"
    ]
}