{
    "articleURL": "/femail/article-12059615/Fans-flock-social-media-wish-Sir-David-Attenborough-happy-97th-birthday.html",
    "content": [
        "Fans flocked to social media to wish David Attenborough a happy 97th birthdayREAD MORE: Sir David Attenborough wishes he'd filmed in Britain more Fans HAVE flocked to social media to wish Sir David Attenborough a happy birthday as the naturalist turns 97 today.",
        "The beloved broadcaster has been captivating television viewers since the 1950s with his glorious wildlife dispatches from the furthest corners of the globe.His loyal fan base showed their love for the London-born naturalist online with many thanking him for his years of hard work.One person wrote: 'Happy Birthday, Sir David! Thank you for all your work on behalf of this planet &amp; its inhabitants!!'Another gushed: 'Happy Birthday Sir David! You are a true treasure.'",
        "While another wrote: 'Happy and Blessed Birthday, Sir David!....You are one of my favourite Naturalists. 'Your voice is so unique and your love, enthusiasm and passion for what you do, is so amazing. 'You are heading to that grand century, in style and what a blessing it is, to still have you doing what you love.'The household name, who is well-known for his mesmerising voice and vast knowledge of the natural world, is no doubt feeling the love today.The star, who has dedicated his life to nature and inspiring generations of people to care more about the planet, is clearly cherished by many.Another person gushed: 'Happy Birthday to a truly inspirational person who has taken us places we never thought we would ever visit and educated us all through the years. 'I have such respect and admiration for this man. Thank you! Happy Birthday.'",
        "While someone else said: 'His books captured my imagination at a very young age. He is such an inspiration! Happy Birthday..keep spreading the message to protect our planet...it's the only one we have!' It was recently revealed that Sir David reportedly earned over £3,000 a minute for his latest run of TV shows.According to new accounts obtained by The Sun, the broadcaster pocketed more than £1.3million last year up to September, after appearing four critically-acclaimed nature series.Over the year, David appeared in four shows, Attenborough and the Mammoth Graveyard, Dinosaurs: The Final Day, and Attenborough's Wonder of Song for the BBC, plus Global Adventure for Sky.It's thought that David could have earned even more through his work than the published figures narrating Apple TV and Netflix shows.",
        "After years of working for the BBC, the presenter has expanded his work to streaming services to reach a younger audience.A source told the publication: 'Sir David is very switched on when it comes to how he works.'He'd spent over 60 years loyal to the Beeb before he looked to streaming channels.'It means sharing his fervent environmental message further, and reaching younger generations, but also makes great business sense.'A representative for David declined to comment when contacted by MailOnline.",
        "It comes after Sir David admitted that he regrets not making more programmes at home.The beloved broadcaster said internal politics at the BBC prevented him from producing documentaries about Britain for most of his career, something he is now rectifying in a new series, Wild Isles, to be screened later this year.He said: 'If there is one thing I regret, and to be honest there isn't a lot, it would be that I spent so much time doing overseas natural history.'The broadcaster said British landscapes mean more to him than exotic locations because they represent 'a continuous thread' in his life.Explaining to the Telegraph: 'I went to Sierra Leone in 1954 on my first overseas trip and it was unforgettable, but I haven't been back. But this [British nature] has always been there.'Sir David said he was prevented from filming in Britain early on in his BBC career by 'a chap trying to establish Bristol as a centre of natural history'.",
        "He insisted he was pressured into focusing on global wildlife, while the BBC's Natural History Unit, founded in Bristol in 1957, would make any films about nature on home soil.Sir David said: 'He knew which strings to pull and I could see things coming to a head. Eventually, we had a meeting and it was agreed I wouldn't look at British natural history at all. Instead, I would go to Africa, South America and so on and [they] could deal with natural history in Britain. And I stuck to that until very recently.'",
        "This year marks the 69th anniversary of Attenborough's first appearance on our screens in 1954, having started at the BBC in 1952.His groundbreaking Life On Earth series, which began in 1979, really put him on the map.But the broadcaster prefers to look forward, insisting that 'the present is much more potent than the past'. 'That is the thing with wildlife,' he said, 'it is continually regenerating.'Sir David is heartened by the environmentally conscious mindset of the younger generation, saying that he receives up to 50 letters a day from children.'They now don't write to me about The Wind In The Willows,' he said. 'They write about the real things. How disgusted they were when they walked along the beach with their mummy and picked up a sack of plastic.' He credits this change to teachers, who he says do 'a fantastic job'.But Sir David cannot ignore his age and admitted he was astonished to be back on set filming his new BBC series, a five-part documentary devoted to the nature of Britain and Ireland.He said: 'I'm fantastically lucky, I can hardly believe it's true. Here I am in my mid-90s and I'm still as active as I was in my 60s, or my 30s even. It is amazing that one can carry on.'"
    ]
}