{
    "articleURL": "/wires/reuters/article-12046965/Israeli-parliament-panel-seeks-roll-state-controlled-milk-prices.html",
    "content": [
        "By Steven Scheer",
        "JERUSALEM, May 4 (Reuters) - Israel's parliamentary economics committee proposed rolling back state-controlled milk prices, giving temporary aid to dairies, and threatened to submit legislation to slash food taxes to Western levels as public anger mounts over soaring living costs.Prices of dairy products have jumped after a deal between the Finance Ministry and suppliers allowed for a rise in the price of milk of more than 9%. All four of Israel's main dairies have said they would increase prices this week on both supervised and unsupervised products.\"We are deciding right now that the government will give compensation (to dairies) of 100 million shekels ($27.50 million) and take steps to return milk prices to what they were on April 30 so that in the next four months we will work on a long-term solution to this matter,\" said David Bitan, chairman of the economics committee during the panel's session on Thursday.He gave the Finance Ministry until Monday to respond positively to his plan to freeze milk prices until September. Should the ministry not agree, Bitan said he would submit a bill to lower the value-added tax (VAT) on food to OECD levels, or around 8% versus Israel's 17%.But Kfir Battat, deputy director of the finance ministry's budget department, said Israel has not subsidized products since the 1980s and prefers other measures such as tax credits to help citizens cope with inflation.",
        "Annual inflation stands at a 5% rate but costs of food and other items have surged, partly due to supply chain issues. The Bank of Israel has responded with aggressive rate increases.Lawmakers ahead of last November's election ran on a platform of tackling high living costs.Yossi Shelley, director general of the prime minister's office, called the milk sector a \"government-sponsored cartel\" and agreed steps needed to be taken but that he was not in favour of subsidies. ($1 = 3.6368 shekels) (Reporting by Steven Scheer; Editing by Hugh Lawson)"
    ]
}