{
    "articleURL": "/wires/reuters/article-12055459/Host-Suns-look-series-against-Nuggets.html",
    "content": [
        "Devin Booker and Kevin Durant combined for 86 points in Game 3 as the Phoenix Suns got back into the Western Conference semifinals.",
        "But the star duo could use some help on Sunday night when the Suns attempt to even the best-of-seven series against the top-seeded Denver Nuggets.Booker matched his playoff career high with 47 points on remarkable 20-of-25 shooting. Durant wasn't nearly as efficient as he was 12 of 31 while scoring 39 points.Booker was the showstopper by scoring 45 or more points for the third time in eight games this postseason. He set the tone with 27 first-half points as Phoenix built a 15-point lead at the break en route to the 121-114 home victory.\"It is that time of year,\" Booker said afterward. \"We've dropped a few games on their home floor and we just wanted to protect ours. This was a really important game for us. Now we have to turn around and be ready for Sunday.\"The fourth-seeded Suns brought a high level of intensity from the outset, knowing full well that being down 3-0 to the Nuggets would leave them in a precarious position.Booker and Durant were intent on keeping that from occurring.\"We didn't talk about needing more; they just knew what we had to do to win this game,\" Suns coach Monty Williams said. \"Kev is still finding his way and his rhythm. He had 39 and if you look at the numbers, that's not a typical Kevin Durant efficient game. So we still have that to look forward to, I believe.",
        "\"And Book was amazing from start to finish. I thought it was his will and determination and reading the defense.\"Durant did most of his damage from the free-throw line, making 14 of 16 attempts.\"It's frustrating not making shots, because that's what I'm paid to do,\" Durant said. \"But there also comes a time when you've just got to figure it out and push through it.\"No other Phoenix player scored more than seven points. Center Deandre Ayton had four points in 26 minutes and was on the bench when the Suns were trying to close out the win.Suns point guard Chris Paul (groin) sat out Friday and also is expected to miss Game 4.Denver would like to bounce back and set up a clinching scenario at home for Game 5.Jamal Murray scored 32 points in Game 3 and Nikola Jokic had 30 points, 17 rebounds and a personal playoff-career-high 17 assists. It was Jokic's ninth career playoff triple-double.Jokic is averaging 31 points, 17.3 rebounds and 9.0 assists in the series.Nuggets coach Michael Malone made it clear that his club's defense will have to be vastly improved on Sunday. The primary focus will be on defending Booker, who is averaging 36.9 points per game this postseason.",
        "\"He was 20 of 25,\" Malone said of Booker. \"I wasn't a math major but that's a very high percentage.\"Malone liked the job done on Durant but couldn't get past how poorly his club dealt with the other Phoenix star.\"Our defense on Devin Booker was unacceptable,\" Malone said. \"He's a hell of a player and I told our guys before the game, `No team has ever come back from a 3-0 deficit. So understand what you're getting ready to face.'\"I think that third quarter was tremendous. We got back into the game, being down 15 at halftime, but we were letting him walk into pull-up 3s.\"Murray has two 30-point outings in the series to go with a substandard 10-point outing in Game 2. He was disappointed in his fourth-quarter performance in Game 3 as he had just four points on 1-of-8 shooting.\"I had some great looks at the end of the game and that would have kept us right there,\" Murray said. \"I feel like they pulled away because of that. I have to be more locked in, more relaxed down the stretch.\"--Field Level Media"
    ]
}