{
    "articleURL": "/tvshowbiz/article-12045131/Rihanna-bares-bump-edgy-black-leather-trench-coat-date-night-AP-Rocky-NYC.html",
    "content": [
        "Rihanna showed off her growing baby bump on Wednesday night as she stepped out in New York City.",
        "The Umbrella hitmaker, 35, was captured strolling hand-in-hand with her baby daddy A$AP Rocky, 34, down the sidewalk.She didn't let pregnancy stop her from putting on a stylish display as she let her bump peek out from under a black leather trench coat.Rihanna teamed her edgy outerwear with a tiny black miniskirt and sexy thigh-high boots.The couple's late-night outing comes days after DailyMail.com confirmed that they arrived fashionably late to the star-studded Met Gala.",
        "The chart-topper was first spotted making her way out of her hotel with a handsome security guard by her side.She kept her sultry gaze hidden behind unique pale peach shades and fastened diamond chandelier earrings to her ears.Rihanna further accessorized by layering sparkly chains around her neck and she tucked her essentials into a small designer purse.Her dark brown hair was swept up in a messy bun with wavy pieces left out to frame her heart-shaped face. As for makeup, the pregnant superstar lined her already plump pout with brown lip liner and topped it off with clear gloss with a glass-like shine.Her stunning hazel eyes were lined in black and she applied a generous amount of mascara to her lashes.Meanwhile, Rihanna's boyfriend A$AP Rocky kept it casual-cool as he paired light wash jeans with a plain white tee and a red flannel shirt.",
        "Braving the NYC chill, the rapper made sure to throw on a blue puffer jacket for extra warmth.In one hand, the New York native carried a vibrant blue Goyard bag that retails for upwards of $2,300.The lovebirds grabbed dinner at the celeb hotspot Carbone.After dinner, Rihanna and A$AP Rocky were spotted making their way towards a chauffeured SUV. ",
        "The Fashion Killa hitmaker doted on his baby mama as he helped her into the backseat.The couple - who began dating in 2021 after years of friendship - are currently expecting their second child together.Rihanna gave birth to their son last May and revealed her second pregnancy during the Super Bowl Halftime Show in February.Earlier this week, the new parents enjoyed another night out by attending the Met Gala at the famous Metropolitan Museum of Art in New York City on Monday.They arrived over two hours late to the annual function that honored late designer and Chanel creative director Karl Lagerfeld.As confirmed by DailyMail.com has confirmed that celebrities were already leaving the event as she arrived.Organizers had also begun to depart and head to afterparties. But despite her delayed arrival, the Disturbia singer stole the show as she transformed into a couture bride by rocking a billowing white gown.",
        "It had a dramatic sweeping train and elaborate rose adorned headdress, with puffy flowers adorning the star's headdress and body as she posed. She then whipped off her headdress with her gown unravelling into an even longer train as she posed on the famous steps.",
        "The dress featured spaghetti straps and hugged her blossoming bump.A$AP Rocky flaunted his cutting-edge style by styling a bright red kilt with a black suit jacket and baggy, distressed jeans.The couple held hands and cozied up to one another while posing for photographers on the museum's iconic staircase.Rihanna also got in some solo snaps to showcase her gown in all its glory. "
    ]
}