{
    "articleURL": "/tvshowbiz/article-12055265/Khloe-Kardashians-daughter-True-wears-vintage-inspired-shirt-featuring-graphic-aunt-Kim.html",
    "content": [
        "Khloe Kardashian shared several posts from her nephew Psalm's birthday party to her Instagram Story on Saturday.",
        "The 38-year-old social media personality posted a video to show how several of the soon-to-be-4-year-old's friends and family members had each been gifted with a custom-made firefighter's costume.The entrepreneur, whose son's name was reportedly revealed, also shared a photo of her daughter True, aged five, wearing a vintage-inspired t-shirt bearing the visage of her aunt, Kim Kardashian.She also added a text graphic to the bottom of her video that partially read: 'How cool is this!' Kardashian shares True, as well as her baby son, aged eight months, with her former partner, Tristan Thompson. ",
        "Before she became involved with the 32-year-old professional basketball player, the reality television mainstay was previously married to Lamar Odom from 2009 until 2016.The influencer and her former partner initially sparked relationship rumors in 2016 and they were confirmed to have been dating in September of that year.The pair revealed that they were planning on starting a family in 2017, although the Los Angeles Lakers member was caught in a cheating scandal that emerged the following April.Kardashian gave birth to True that same month, and the couple reconciled not long afterward.The reality television personality and her former partner maintained an on-off relationship that continued until 2021, when the two split for good.",
        "However, it emerged that Thompson and Kardashian were expecting to welcome a second child via surrogate last July, and their baby boy arrived in August.The US version of The Sun recently reported that the social media figure's son was named Tatum Robert, although this has not been confirmed by the family. True has shown up in numerous photos and videos that have been shared to her mother's Instagram account over the past few years.",
        "In one of her recent posts, Kardashian held her daughter during a recent trip to Disneyland.The realty television personality donned an all-denim outfit and wore a small white backpack during the trip to the theme park.True flashed a smile as she wore a pair of mouse ears while she waited to get on one of the park's rides.The social media powerhouse lovingly referred to her daughter as 'My Girl' in her post's caption. "
    ]
}