{
    "articleURL": "/home/books/article-12048715/LITERARY-FICTION.html",
    "content": [
        "SOLDIER SAILOR",
        "by Claire Kilroy",
        "(Faber £16.99, 256 pp)It’s been more than ten years since Kilroy’s last novel, The Devil I Know, a satire on how the Celtic Tiger went belly-up.Now she’s back with a phenomenally intense short novel dramatising the sleepless nights and spun-out days of early parenthood.It’s narrated by a new mother (in her eyes, a ‘wounded soldier’) addressing her baby son (‘Sailor’). Frustrated by her strategically feckless husband, she has her head turned by the re-appearance of an old friend, now a dad himself, with a contrastingly hands-on approach.The claustrophobic scenario exerts a vice-like grip, but what really makes the book sing is Kilroy’s finely-tuned ear for the inter-parental bickering that forms the soundtrack to these Calpol-soaked years.Dark and intense, as well as richly comic, it’s terrifically well done — and if I had to predict what might end up on this year’s Booker longlist, which will be announced in July, I’d say place your bets.SMALL WORLDS",
        "by Caleb Azumah Nelson(Viking £14.99, 272 pp)Nelson’s justly praised debut, Open Water, followed two young black lovers in South London brought together (as well as driven apart) by their contrasting experience of racism.A slender book with much to say, it nonetheless made me wonder if the author’s style had been cramped by assumptions about what a novel should do.",
        "That question also hangs over Small Worlds, again set in South London, with another teenage narrator, Stephen — the son of Ghanaian parents — trying to find his place in the world after leaving sixth form.When he falls for another school-leaver, Del, the stage is set for a retread of Open Water. But Nelson has a larger canvas now: his timeline involves the London riots, and there’s a section in Ghana, too.As in Open Water, the narrator’s deep sincerity can feel earnest. Yet rare life ripples through this hymn to a city’s rhythms, even if it feels crammed into the form of a novel.BIG SWISSby Jen Beagin(Faber £14.99, 336 pp)",
        "Beagin is an American writer who has flown under the radar in the UK, but is about to hit the big time with this new novel, which is already in development as an HBO TV series starring Jodie Comer.A zany rom-com set in upstate New York, it follows Greta, who earns her living by transcribing the tapes of sex therapy sessions. Sight unseen, she falls for one of her employer’s clients, Flavia, a gynaecologist who has never had an orgasm.And then they happen to meet — embarking on a real-life affair that has no chance of lasting unless Greta can keep shtum about how Flavia first came into her life.",
        "Beagin, previously shortlisted for the Bollinger Everyman Wodehouse Prize for comic fiction, keeps the belly laughs flowing — but you might also see the book as an allegory for the perils of hooking up in an era when our life stories are only ever a Google search away."
    ]
}