{
    "articleURL": "/tvshowbiz/article-12057797/AJ-Odudu-puts-sizzles-plunging-metallic-ord-hosts-Eurovision-event-Liverpool.html",
    "content": [
        "AJ Odudu looked nothing short of sensational as she hosted the Eurovision Song Contest's welcome concert in Liverpool on Sunday evening - ahead of the grand final May 13.",
        "The new Big Brother presenter, 35, turned heads in a silver metallic co-ord that hugged every inch of her jaw-dropping figure.AJ's ensemble featured a plunging shirt that teased a hint of cleavage which she wore with figure-hugging trousers.The stunner, who hosted the event alongside Joel Dommett, completed the stage look with a chunky necklace and added extra height to her frame with strappy heels. Sporting a radiant palette of make-up with smokey eye and glossy lip she wore her raven tresses in loose curls.  ",
        "The evening saw a whole host of iconic Liverpudlian singers take to the stage including Holly Johnson from Frankie goes to Hollywood and Atomic Kitten.Ahead of the event AJ said: 'I am so excited to be hosting The National Lottery's Big Eurovision Welcome. It is going to be an incredible show with some amazing performances and all of the wonder that Eurovision has to offer'.'I can't wait to get the Eurovision party started in one of my favourite cities – come along and celebrate with us.'Favourites for the contest include the UK's Mae Muller, France's La Zarra and Spain's Blanca Paloma.Muller has said her training for Eurovision has been 'like bootcamp' as she reflected on the challenges of being an up-and-coming artist in the music industry. ",
        "The 25-year-old singer will represent the UK at the song contest in Liverpool in the grand final on May 13 with her track I Wrote A Song, which features tongue-in-cheek lyrics about a cheating ex-boyfriend and a propulsive dance beat. In an interview with The Sunday Times, Muller admitted she is keen to do well in the competition but that it has been 'non-stop for two months', describing it as 'like boot camp'. ",
        "The London-born singer was confirmed as the UK's Eurovision act in early March and has since been at a number of Eurovision events ahead of the big day including meeting the King and Queen. Muller joined the royal couple when they unveiled the contest's spectacular stage in Liverpool, with Charles telling her: 'We will be watching you with great interest - egging you on.' She also has pressure following in the footsteps of Sam Ryder who came in second place last year with his uplifting pop song Space Man, giving the UK its best result for more than 20 years. His success meant the UK was chosen to host this year's competition on behalf of war-torn Ukraine as it continues to face the Russian invasion. Alongside these pressures, Muller also reflected on how the evolution of the music industry towards streaming and viral moments has added extra strain. ",
        "She told the newspaper: 'My label said not to rush. I came just before TikTok was a thing, so I didn't need viral success overnight. ",
        "'They wanted to develop me and that is a dying idea because after TikTok took over it's all about how fast you can go. That's sad. 'The whole point of a label is to give you time, but now they don't sign anyone unless they've had a viral hit already.' She added: 'It's no longer: 'My song is on the radio. I've made it.' There are a lot of boxes to tick. 'It depends on what your version of success is, but it is weird. I'm sat at home with seven million monthly listeners and think: 'But how well is it actually going?' It can be jarring.' "
    ]
}