{
    "articleURL": "/wires/ap/article-12039007/Idaho-Supreme-Court-justice-retire-cites-low-salary.html",
    "content": [
        "BOISE, Idaho (AP) - Idaho Supreme Court Justice John Stegner has announced his resignation, telling the governor that the relatively low pay has made it necessary to return to private practice.",
        "The Idaho Legislature gave most state employees cost-of-living raises of up to 7% last year, but refused to approve any raises for judges, and declined to make up the difference during this year's session.In his letter Monday to Idaho Gov. Brad Little, a Republican, Stegner said his decision is bittersweet and that serving as judge has been the privilege of his professional career. His resignation will take effect at the end of October, and Stegner will serve as a Senior Judge, until any pending appellate cases are resolved.\"Given the disparity in pay between a Supreme Court Justice (which is lower than a beginning lawyer at some Boise firms and one of the lowest in the nation) and a lawyer in private practice, I find it necessary financially to leave the public sector and return to the private sector,\" Stegner said. \"The job requires extraordinary hours to do it well. In sum, the state is asking judges to do too much for too little.\"Idaho Supreme Court Justices earn just over $165,000 a year - the equivalent of about $79 an hour.Stegner was appointed to the state's highest court in 2018 by then-Gov. Butch Otter. He previously served as a 2nd District Judge in Latah County.The vacancy means the Idaho Judicial Council will provide a list of applicants to the governor's office, and Little will appoint one of them to serve out the rest of Stegner's term, which ends in January 2027. The judicial seat will be up for election in the 2026 May primary.",
        "Chief Justice Richard Bevan said he wishes Stegner the best as he retires from the bench.\"Justice Stegner brings a principled, deliberate approach to both the appeals we resolve and his vision of what Idaho´s courts should be,\" Bevan said. \"His drive to better ourselves and our work has improved justice for Idahoans.\""
    ]
}