{
    "articleURL": "/wires/reuters/article-12044171/Soccer-Lazio-beat-Sassuolo-reclaim-second-spot-Serie-A.html",
    "content": [
        "ROME, May 3 (Reuters) - Goals by striker Felipe Anderson and midfielder Toma Basic earned Lazio a 2-0 home win over Sassuolo in Serie A on Wednesday, sending Maurizio Sarri's side back to second place and delaying runaway leaders Napoli's title celebrations.",
        "Lazio were under pressure following Juventus' 2-1 victory over Lecce earlier but are back above them with a one-point lead on 64. A draw or a loss against Sassuolo would have given Napoli an unassailable lead before their match at Udinese on Thursday.There was confusion after eight minutes when Ciro Immobile was first awarded a goal after a lengthy VAR check, only for it to be disallowed moments later.However, there was no doubt after 14 minutes when Marcos Antonio scooped the ball over the top and Anderson finished well past goalkeeper Andrea Consigli.At the end of the first half, Davide Frattesi hit the crossbar from a tight angle, denying Sassuolo an equaliser.The result was put beyond doubt by substitute Basic when he tapped home a cross two minutes into stoppage time.Inter Milan were ruthless at Hellas Verona, causing the hosts to concede more than five goals at home for the first time in Serie A with a 6-0 victory that included two goals from both Edin Dzeko and Lautaro Martínez. Inter are fourth on 60 points.By cancelling out Stephan El Shaarawy's opener with a stunning Luca Caldirola volley, Monza dented AS Roma's push for a top-four finish with a 1-1 draw at home. Jose Mourinho's side are outside the European qualifying places in seventh with 58 points.",
        "AC Milan stumbled against relegation-threatened Cremonese at home. David Okereke gave the visitors the lead before Junior Messias equalised with a free-kick three minutes into stoppage time, ending the match 1-1. Stefano Pioli's side are sixth in the standings on 58 points. (Reporting by Tommy Lund in Gdansk Editing by Christian Radnedge)"
    ]
}