{
    "articleURL": "/news/article-12040133/Tributes-Greensborough-College-student-Balin-Mezies-Melbourne-teen-died-sleep.html",
    "content": [
        "Melbourne teen, 15, died suddenly in AprilSparked outpouring of community tributesRemembered as a kind and creative soul A GoFundMe has been set up to support his familyA local community has been rocked by the shock death of a much-loved teenager who tragically died in his sleep.",
        "Heartbreaking tributes are flowing for Melbourne student Balin Menzies, 15, who died suddenly on April 21. It is not yet known what caused his death. Balin was actively involved in various sporting and community groups across Greensborough in Melbourne's northeast.The teen was also a promising street artist who painted murals under the name Posh, including a wall at Greensborough Skate Park.The mural is now surrounded by spray paint cans and flowers in his honour.",
        "Greensborough College paid tribute to the Year 10 student when classes resumed last week.'It has been an incredibly sad start to the term for the Greensborough College community as we mourn the passing of Balin Menzies, our student, classmate and friend,' the statement read.'He made many friends and impressed teachers and students with his artistic talents and cheerful demeanour. Balin will be sadly missed by all.''We extend our deepest sympathies to his family and friends, and our thoughts are with them during this difficult time.'Local sporting clubs shared similar tributes.'Balin was an amazing teenager who played under 12 cricket with GCC in 2014 to 2016 and continued to support the club by cheering on his Mum, Dad and cousin Regan,' Greensborough Cricket Club posted.Referees, coaches and players at Watsonia Warriors Junior Basketball Club and rival clubs wore black armbands in Balin's honour last weekend.",
        "Balin's death has sparked an outpouring tributes from friends who have remembered the teen as a kind and beautiful soul.'Rest easy bro, won’t be the same without you man. Such a beautiful, funny and kind soul taken way too early,' one mate wrote.A family friend wrote: 'Balin, you had this magical way of brightening everyone’s world around you. You lit up the room with your incredible smile and made everyone laugh with your cheeky personality. It was a privilege to have had you in our life and we are so very lucky to have had those years with you. 'Life just won’t be the same without you in it.''Forever Balin's world, you were something different bro,' another said. Another added: 'Everyone's lost without you Balin. Words can't describe how hard it's been on all of us since you left'.",
        "Friends have set up an online fundraiser which has raised almost $20,000 for Balin's grieving family. '100 per cent of funds will go towards Balin and his family,' the page states.'Let's help support them during this difficult time. Rest easy up there mate.'Balin will be farewelled by family and friends at a memorial this Friday.'No dress code applies, please wear whatever you feel comfortable in - when in doubt ask what Balin would have liked,' his family posted on an online memorial page.",
        "'You will have an opportunity to speak during the service, or have your words read out. We will also have two large sketch books and various markers and poscas for you to leave a tribute, a story, a note or a tag.'"
    ]
}