{
    "articleURL": "/tvshowbiz/article-12044147/Neighbours-str-Olympia-Valance-flaunts-ample-cleavage-green-bikini-trip-Greece.html",
    "content": [
        "It seems that Olympia Valance was suffering a case of the Autumn blues on Wednesday. ",
        "The former Neighbours star was dreaming about her 'buddymoon' in Greece last year after tying the knot with her husband, Thomas Bellchambers.Olympia shared several throwback photos of the idyllic trip to her Instagram page and wrote in the caption: 'Going through my phone and stumbled upon so many Greece photos I've never posted and completely forgot about. Get me back into that water.'In several snaps, the actress, 30,  showed off her incredible figure and cleavage in a skimpy green bikini as she swam in the ocean off the island of Milos.In one mesmerising shot the stunning brunette floated on her back.",
        "Another photo captured her posing up a storm with a female friend, with Olympia's makeup-free visage highlighting her natural beauty and one more captured her and her husband locking lips in the sea. Back in June, Olympia walked down the aisle with AFL star Tom Bellchambers, 32, at a picturesque ceremony attended by 250 family and friends in Daylesford, Victoria.The 29-year-old stunned in an ornate, antique-style gown from Melbourne couture house J'Aton, with sheer fabric and detailed off-white lace designs. ",
        "She was walked down the aisle by both her father Ryko Valance and her stepfather Ross Wilson.Guests included Tom's former Essendon teammates, including Cale Hooker, who was his groomsman.",
        "Also in attendance was Dyson Heppell, Dustin Fletcher, Jake Melksham, Andrew Welsh, David Zaharakis, Michael Hibberd, Angus Monfries, Adam Ramanauskas, Michael Hurley, Jobe Watson and former assistant coach Mark Harvey.",
        "Tom's brothers and Olympia's two younger sisters took part in in the ceremony. In August last year, Olympia's sister Holly Candy, 39, shut down rumours of a family rift during an interview on Studio 10, explaining she could not attend her sister's wedding because she was diagnosed with Covid-19 days before she was due to fly to Australia.Olympia played Paige Smith on Neighbours from 2014 to 2017, and reprised her role in 2020 for the show's 35th anniversary.She returned for the series finale last year, alongside her sister Holly and Kylie Minogue, Jason Donovan and Guy Pearce."
    ]
}