{
    "articleURL": "/femail/article-12058965/Meghan-Markle-rocks-Princess-Dis-17k-Cartier-watch-pal-Abigail-Spencers-495-necklace.html",
    "content": [
        "Meghan Markle stunned in Princess Diana's £17k watch and pal Abgail's necklaceREAD MORE: Harry keeps a low profile as he lands back in LA Meghan Markle stepped out for a hike in California just hours after missing King Charles's Coronation - wearing tributes to both the King and her late mother-in-law Princess Diana.",
        "The Duchess of Sussex, 41, transformed an otherwise simple activewear look into a more dazzling ensemble with jewellery worth £157,055, as she teamed her leggings and vest with her late mother-in-law Princess Diana's £17,800 Cartier wristwatch.She also wore a Cartier tennis bracelet, inherited from Princess Diana. It has previously been estimated it could sell for £125,000 at auction due to its history.And despite not attending the Coronation, Meghan paid tribute to her father-in-law the King by wearing a Bentley &amp; Skinner diamond tennis bracelet - believed to be a gift from the royal and worth at least £4,900 - which she stacked atop a £3,965 Jennifer Meyer Gold Mini Bezel tennis bracelet. Alongside these pieces, the mother-of-two rocked a £5,000 Cartier Love bracelet as well as donning a £390 May Brenner x Abigail Spencer ‘The Clarity Retreat’ Necklace.The necklace - which is now sold out - forms part of a collection made by best pal and former Suits colleague Abigail Spencer, also 41. ",
        "Made with a hand-cut clear quartz, it features a crystal wrapped in a 14k gold band and a 2.5mm diamond. The 20-inch diamond-cut chain also has an additional jump ring at 18 inches for alternate length options.Jewellery designer Maya Brenner worked with longtime friend and actress Abigail Spencer to create a Retreat capsule collection of four necklaces aimed at helping people protect their inner peace.  ",
        "The Clarity Retreat Necklace is said to be a powerful energy amplifier that helps you manifest what you want in life, while letting go of anything that's not working.The two beauties met at an audition 10 years before Meghan married Prince Harry, and also both starred in US hit TV series Suits together.The duchess, who celebrated her son Archie's birthday on Saturday, effortlessly rocked the statement pieces while hiking out in the fresh air without her husband, Prince Harry, near their $14million Montecito mansion.For her day out, the mother-of-two looked chic in a sporty outfit complete with a $128 J. Crew lightweight jacket​ in colour dark moss, and a close-fit black vest and fitted black leggings.She wore her dark tresses pulled back in a low ponytail under a straw fedora hat, and topped off the look with a pair of Victoria Beckham 'Navigator Power' glasses on her makeup-free face. ",
        "She cut a stylish figure in brown hiking sneakers and thick blue socks, as she made her way along the hiking route with friends, Markus Anderson and Heather Dorak.She further accessorised the look with a mauve neck scarf, a yellow gold wedding band, and a Lorraine Schwartz emerald cut diamond pinky ring.Harry, who rushed back to California straight after his father's Coronation, did not seem to attend the hike.",
        "Meghan's latest outing comes just two days after her husband Prince Harry attended his father King Charles' Coronation at Westminster Abbey in London.But the King's son slipped out of the venue with only the briefest of goodbyes and headed straight for Heathrow Airport in a blacked-out electric BMW.After just 28 hours and 42 minutes in the UK, he was back on the plane to California before his father and stepmother Queen Camilla had even finished having their official portraits taken.",
        "He was pictured smiling broadly as he arrived at the airport’s Windsor suite before boarding his British Airways flight - still in morning suit and sporting his medals.But the King's Coronation on Saturday was not the only important date in the family's calendar. It also coincided with son Archie's fourth birthday.Archie was born in 2019 with the Sussexes then having their second child, Lilibet Diana, in 2021."
    ]
}