{
    "articleURL": "/tvshowbiz/article-12056163/Christina-Aguilera-puts-busty-display-performing-Lovers-Friends-festival.html",
    "content": [
        "Christina Aguilera turned heads in an edgy leather ensemble as she performed on the stage of Lovers &amp; Friends music festival in Las Vegas on Saturday night.",
        "The Your Body hitmaker, 42, delivered incredible vocals during the gig that was part of the Las Vegas Festival Grounds in Nevada.The singer appeared in great spirits and energy as she took the stage and showcased stunning dance moves along with her crew.The New York-born songwriter - who performed right after rapper 50 Cent - showed off her jaw-dropping figure as she slipped into a racy black leather co-ord.She put on a busty display in a very plunging lace-up body corset - flaunting her ample cleavage.",
        "The item featured also leather laced-up shoulder pads and sheer sleeves, as she put on a pair of matching gloves.Christina displayed her toned curves as she completed the sensational look with matching cut-out leather trousers.The Genie In A Bottle singer accessorised the edgy ensemble with a pair of  Dolce&amp;Gabbana wide black shades as she dominated the stage.She rocked chunky shimmery silver earrings, and didn't spare the bling as she donned an eye-catching silver chain.The popstar wore her trademark platinum tresses loose down her shoulders, framing her stunning features.Although she sported the edgy shades throughout her whole performance, it appeared as Christina donned a bronze palette make up, accentuating her look with a bold rouge lipstick. Other R&amp;B and hip-hop artists who took the stage at the festival include: Da Brat, Lil' Kim, Jhene Aiko, Chris Brown, Boyz II Men, Pitbull, Nelly, and Miguel. ",
        "Earlier in the day at the festival, Da Brat — who is currently expecting her first child with her wife Jesseca 'Judy' Harris-Dupart, 41 — also gave a show-stopping performance.",
        "At one point, the 49-year-old rapper was also seen showing PDA and giving a quick kiss to her partner.The Funkdafied hitmaker showed off her baby bump in a Chicago Bulls jersey with a cutout in the middle as her wife watched at the side of the stage.The soon-to-be mother matched her pregnant wife in a sultry, hooded and halter-style Valentino dress.Da Brat was seen styled from head-to-toe in Chicago Bulls merch that was tailored to show off her growing baby bump and unique style.She donned the jersey with the matching basketball shorts over a pair of opaque black tights.The performer also accessorized with a red hat with the Bulls logo at the front.She was dazzling in a sparkling chain necklace, a diamond-encrusted watch, and her massive wedding ring.Peeking out from underneath her reddish-brown twist braids were also a pair of diamond-shaped, silver statement earrings.For makeup, she looked glamorous in a shimmering eyeshadow look and full, fluttering eyelashes.Last February, the couple announced that they were expecting their first child together. In March, they held a lavish gender reveal party and also shared that they would soon be welcoming a son together in a few months.",
        "Lil' Kim, 48, also took the stage at the festival for an exciting stage where she performed all of her greatest hits.The rapper sported a cropped T-shirt and tight-fitting leggings to show off her toned figure.The reality TV star styled her platinum blonde tresses in loose waves that cascaded across her shoulders and down her back.For accessories, she rocked various gold and silver jewelry pieces as well as a diamond chain with her Queen Bee Entertainment logo.The same design was also emblazoned across her shirt with gold rhinestones.Meanwhile, Usher looked effortlessly stylish decked out in an all-black, leather ensemble as he took the stage at the festival.He donned an oversized leather jacket teamed with the matching black pants and leather gloves.As he performed, he also modeled a pair of oval-shaped and black-framed sunglasses.The Confessions hitmaker left the top half of his jacket unbuttoned to show off his many eye-catching jewelry pieces on his neck.The eight-time Grammy winner accessorized with various chains adorned with diamonds and cross pendants.The Lovers &amp; Friends music festival is a throwback hip-hop and R&amp;B festival that happened for the first time last year.The event that was previously slated to be held in Los Angeles at the same venue that the L.A. Galaxy team play in.",
        "Due to the pandemic, however, the festival — originally planned to be a weekend-long affair — was postponed in both 2020 and 2021.The first-ever Lovers &amp; Friends festival was held in downtown Las Vegas in 2022, and this year, the one-day event was held Las Vegas Festival Grounds."
    ]
}