{
    "articleURL": "/tvshowbiz/article-12039729/Kourtney-Kardashian-says-goodbye-blonde-hair-pretends-smoke-cigarette.html",
    "content": [
        "Kourtney Kardashian is receiving backlash for a series of snaps she posted to her Instagram, where she pretends to smoke a cigarette.",
        "The Poosh founder, 44 - who recently hit back at fans criticizing her PDA displays with husband Travis Barker - left many disappointed by the images shared to her page on Tuesday, with followers saying that she's trying to 'glamorize' smoking.'Why would you glamorize smoking?' one person asked Kourtney, who is known for promoting a healthy lifestyle to young women via her Poosh wellness brand. 'For someone so health conscious, seem like you're promoting cigarettes,' another added. 'The wellness guru promoting smoking cigarettes? Interesting,' yet another commentator chimed in. ",
        "'Getting cancer is cool now kids,' someone else wrote. 'Such a lot of respect for the clean lifestyle you promote, less respect for the promotion of smoking when kids are looking up to you,' another one read. 'Aren’t you little miss healthy? Mmm k. strange mixed messages; way to try and glamorize smoking when you don’t even smoke. Very bizarre,' yet another quipped. 'You preach about healthy living but yet you post pictures of yourself smoking a cigarette which is literally the worst thing for your body and the complete opposite of a healthy lifestyle.' Kourtney captioned the post: 'bye bye blondie. one more smoking hot post for the haters. shoutout to my prop provider and photographer @kulikulikulik.' Commenters on her post mostly missed the 'smoke show' joke she was trying to make and continued to call out the wellness guru for having a cigarette in her hand - even though it wasn't lit. ",
        "The reality television personality's blonde bob was parted on the side for the snaps. She wore a pair of round-lensed sunglasses in the shot.She poured her curves into a strapless black bustier as she posed and preened for the camera.",
        "The promotion of cigarettes certainly seems to go against what her brand has been espousing.In 2020 Kourtney shared about her clean living journey with Vogue Arabia, where she stated that her health consciousness began when she had her first child.'I started learning about what we put in our bodies and then it was kind of a snowball effect. You can’t unlearn the information,' she said.As for changing her hair color, the Keeping Up With the Kardashians alum has been blonde since March.During an interview with People back in 2017, the Poosh founder opened up about coloring her hair, and swore she'd never go blonde again.'I was the original sister with the blonde hair,' Kourtney humorously gushed at the time. 'I was blonde in high school for just like a month. I think I was in 11th grade or something.'She also explained that, 'I did have lighter hair when I was pregnant with Penelope, which is probably my least favorite hair I’ve had.'",
        "The media personality simply added, 'I’m just a brown-haired girl. It just suits me. I like my dark hair.'",
        "It's not the first time Kourtney has gone blonde.She uploaded two snapshots from 1995 when she was 17-years-old and had her hair dyed platinum blonde. She wrote, '17 year old Kourt,' and '1995 bored during finals, convinces someone to dye my hair blonde to procrastinate.' "
    ]
}