{
    "articleURL": "/tvshowbiz/article-12050701/Love-Islands-Antigoni-Buxton-shows-figure-TINY-bikini-kisses-new-beau.html",
    "content": [
        "Antigoni Buxton showed off her figure in a tiny bikini as she passionately kissed her new beau Alex Coronado during a sun-soaked getaway in Athens, Greece. ",
        "The Love Island star, 27, who struggled to find a match in the villa, did not shy away from packing on the PDA with her love interest. She flaunted her curves in the patterned two-piece, complete with a delicate gold belly chain and necklace. Antigoni wore her blonde hair loose, tumbling down her back in natural curls and went makeup free for their relaxing day. Meanwhile, Alex had his tattooed torso on full display, donning a pair of white swimming trunks, with the TV personality struggling to keep her hands off him. ",
        "She rubbed suncream on her boyfriends back as they kicked back on a sun lounger before cooling off in the sea. Alex is from Costa Rica and currently lives in the US, according to his Instagram page.He boasts over 68,000 followers and regularly shares snaps from his travels. Antigoni rose to fame on Love Island series eight, where she entered as a bombshell on day 17.Though she went on dates with Davide Sanclimenti, Dami Hope and Jay Younger, she ultimately left single.Antigoni does have a string of high-profile exes, including former Love Islander Jack Fowler.It has been reported that Jack and Antigoni hooked up for a few months but things fizzled out before they got serious.",
        "Prior to her brief romance with the reality star turned musician, Antigoni was in a nine-year relationship with her childhood sweetheart before going their separate ways so she could focus on her budding music career.",
        "'I've only ever been in love once - I don't think I've been in love since,' she said.'I think I fall in lust and infatuation quickly,' the star also confessed when discussing her past romances before going on the show.She has also been linked to Jack Tyrimos, who featured on Bear Grylls' Treasure Island.Fellow UK Cypriot Jack starred on the 2019 series of the real-life show, which saw a group of individuals left alone to fend for themselves on a deserted island.Since leaving the Love Island villa last summer after a brief stint, Antigoni has been focusing on her music career and even had hopes to represent Greece in the Eurovision Song Contest - though this has ultimately not come to be.",
        "The reality favourite, who has Greek/Cypriot heritage, submitted three songs to the country's biggest TV channel, who broadcast the spectacle, after travelling to Athens to showcase her materialAntigoni told MailOnline at the time: 'I'm submitting three songs but one in particular is my favourite.'It's an up-tempo, powerful, fiery and romantic track with both Greek and English lyrics.",
        "'Combining modern sounds and Hip-hop production with Greek traditional sounds and melodies is my style.' "
    ]
}