{
    "articleURL": "/wires/ap/article-12059967/Tomori-ready-add-Milans-history-ahead-Euroderby.html",
    "content": [
        "MILAN (AP) - AC Milan has a long list of great defenders, including the likes of Paolo Maldini, Alessandro Nesta, Alessandro Costacurta and Franco Baresi.",
        "Fikayo Tomori could find himself on that list as well if he helps Milan end its lengthy wait for the Champions League trophy.The Rossoneri are second only to Real Madrid with seven titles, but haven't lifted the trophy since 2007.First, though, Tomori and his teammates have to get through a semifinal against city rival Inter Milan, which has been dubbed the \"Euroderby\" in Italy.\"It being a derby in the semifinal, it doesn´t really get much bigger,\" Tomori said in an interview with The Associated Press ahead of the first leg on Wednesday.Milan got to this point by beating another Italian team in the quarterfinals, a 2-1 aggregate victory over Napoli, shortly after beating the southern club 4-0 in Serie A.",
        "Napoli recently clinched the Italian league with five rounds to spare and the team has drawn plaudits across Europe for its exciting style of play, so those victories have given Milan \"a lot of confidence,\" Tomori said.\"We know we can go against the best teams in Europe and I think now we can be regarded as one of the best teams in Europe,\" he said.The 25-year-old defender could hardly have hoped for a better start to life at Milan. The England international joined on loan from Chelsea in January 2020 and swiftly established himself as a regular in the heart of the Rossoneri defense - prompting Milan to make the move permanent.",
        "He helped Milan win Serie A in his first full season and has been key to its Champions League run, earning a man-of-the-match award after the 0-0 draw at Tottenham that secured the Rossoneri´s progression to the quarterfinals.\"Winning the scudetto was amazing. I really got to see what it´s like to win here,\" Tomori said. \"We´re all really focused on trying to get Milan back to where it was before.\"The other semifinal pits 14-time champion Real Madrid against another juggernaut in Manchester City. Whichever team wins that matchup will be deemed the favorite to lift the trophy, as the Milan clubs have only recently made their way back to the top level.\"Against Napoli, a lot people counted us out,\" Tomori said. \"Even now, people will be counting us out. Should we reach the final - hopefully we´ll reach the final - there´s going to be people counting us out again.\"But I think with this team we´ve shown a lot of times that when people count us out we manage to get through that. . . . We know that when we play with intensity, energy and quality, then we´re a match for anyone.\"If Milan goes on to win the Champions League, one player who won´t get a medal is Zlatan Ibrahimovi´c, who has never won the league. He has been recovering from surgery and was left off Milan's Champions League squad. But Tomori believes a lot of credit for Milan´s success belongs to the 41-year-old Swede.",
        "\"The way he talks, the way he sees the game, the demands that he puts on himself, the demands he puts on those around him, the team - he´s always demanding the best,\" Tomori said. \"Definitely, if we didn´t have him in the team, if we didn´t have him around the changing room, things would have been different.\"He´s always talking to players, he´s always motivating and making sure everyone´s doing or getting the most out of themselves. We have such a young team, a lot of young players, so having someone like him to kind of show you the way . . . has been great.\"Another Milan icon who has helped Tomori personally is Maldini. Nicknamed \"Il Capitano,\" Maldini spent his entire career at Milan and helped it win five Champions League trophies.Maldini retired in 2009 but returned to Milan as a director five years ago. Tomori acknowledged being a bit starstruck when he first met the former defender.\"I remember I was just kind of looking. I never thought I´d be in the situation where I´m talking to Paolo Maldini,\" he said. \"Being a defender that was just amazing. And ever since I´ve come, he´s always given me help, always given me advice on where he thinks I should be.",
        "\"He´s the kind of person, when he says something to you, you´re taking it on board. He´s been a great help and I just try and take as much as I can from him, try to speak to him as much as I can.\"Maldini and Tomori, trying to keep AC Milan's pedrigree of great defenders going.___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}