{
    "articleURL": "/sport/nfl/article-12047055/NFL-prospect-Michael-Jefferson-suspected-influence-crash.html",
    "content": [
        "Michael Jefferson went undrafted after being seriously injured in a car crashAnd police now believe he was the one at fault for the wreck that killed a manDailyMail.com provides all the latest international sports newsFormer Louisiana wide receiver Michael Jefferson suffered multiple breaks in one of his legs during a fatal car accident last month, according to The Advocate.",
        "And while it was initially believed that the NFL hopeful was hit by an impaired driver, cops now believe that it was actually Jefferson who was driving under the influence of drugs and alcohol, according to a new report from TMZ.Police in Alabama told the website that they mixed up Jefferson and the driver he hit and killed on April 9, Charles Dunn.While it was initially claimed that Jefferson's Chevrolet Impala was slammed into by Dunn's Dodge Charger, The Alabama Law Enforcement Agency says now it was actually Jefferson driving the Charger and Dunn driving the Impala.Furthermore, a diagram from the crash report provided to TMZ shows that the NFL prospect was driving in the wrong line before fatally hitting the 55-year-old Dunn.",
        "Jefferson's attorney told TMZ he had 'absolutely no reason to believe that Michael Jefferson is under criminal investigation or has ever been under investigation.'But Dunn's family told the website in a statement that, 'Charles Dunn never drank or smoked in his life and we would like for his name to be cleared.'The Alabama Law Enforcement Agency told DailyMail.com, 'Due to the ongoing investigation, no additional details are available at this time.'Jefferson was ranked as the No. 41 wideout in the upcoming draft by ESPN, before going undrafted. ",
        "The 6-foot-4 Jefferson led the Ragin' Cajuns with 51 catches for 810 yards and seven touchdowns in 2022. Louisiana went 6-7, earning a bowl berth against Houston in the Independence Bowl.He caught 69 passes for 1,291 yards and 11 TDs in two seasons at Louisiana.Jefferson's agent previously told ESPN that Jefferson required multiple surgeries after the crash. "
    ]
}