{
    "articleURL": "/wires/pa/article-12053551/Countdown-coronation-begun-controversial-Homage-People-toned-down.html",
    "content": [
        "The countdown to the coronation of the King has begun but the controversial “Homage of the People” element of the service has been toned down.",
        "Charles reportedly approved the change which came after a string of commentators criticised the new addition as divisive.Broadcaster Jonathan Dimbleby, a friend of Charles who wrote the King’s authorised biography, said the monarch would find the Homage of the People “abhorrent”.",
        "The Archbishop of Canterbury, Justin Welby, will now “invite” a show of support from the congregation rather than a “call” to those in the Abbey and elsewhere to swear allegiance to the King.Build up to the big day has already begun with workers sweeping sand onto roads, police officers arriving and a rain shelter is being set up outside the Abbey entrance.Metropolitan police and military police officers patrolled the route from Victoria to Westminster from the early hours on Saturday.Royal fans with Union flags and crowns could be seen on trains and in Tube stations from just after 4.30am.The King will be crowned at Westminster Abbey by the Archbishop of Canterbury during a coronation ceremony dating back centuries.",
        "Cries of God Save the King will ring out around the abbey after St Edward’s Crown is placed on Charles’ head by Mr Welby.The senior cleric said in a statement issued on the eve of the coronation that the ceremony served as “a powerful reflection and celebration of who we are today, in all our wonderful diversity”.",
        "He said people will be struck by the “majesty and sacred wonder” of the service, but also hoped they would find “ancient wisdom and new hope”.The event will bring together around 100 heads of state, kings and queens from across the globe, celebrities, everyday heroes and family and friends of the couple, with Charles’ estranged son the Duke of Sussex expected to attend.Invited guests include David and Victoria Beckham, musician Lionel Richie, French President Emmanuel Macron, King Willem-Alexander and Queen Maxima of the Netherlands, Prime Minister Rishi Sunak and US First Lady Jill Biden but her husband President Joe Biden will not be attending.",
        "The day will be a display of pomp and pageantry, with the nation’s Armed Forces promising a “spectacular” event when the King and Queen process through the streets of the capital.The event is the military’s largest ceremonial operation since Queen Elizabeth II’s 1953 coronation, with 9,000 servicemen and women deployed and 7,000 of these performing ceremonial and supporting roles.Mr Welby followed the longstanding tradition of commissioning new coronation liturgy – the prayers and actions of the coronation service – which has the theme Called To Serve.He chaired an advisory group of theology, constitutional history and inter-faith relationships experts to draft the liturgy, produced in close consultation with the King and the Government.",
        "The Homage of the People replaced the homage of peers, and Lambeth Palace described it as an invitation to the estimated global television audience of tens of millions to make a “a great cry around the nation and around the world in support for the King”.",
        "Mr Welby was to say: “I call upon all persons of goodwill in the United Kingdom of Great Britain and Northern Ireland, and of the other realms and the territories to make their homage, in heart and voice, to their undoubted King, defender of all.”All those interested would be invited to say: “I swear that I will pay true allegiance to your majesty, and to your heirs and successors according to law. So help me God.”But now he will say: “I now invite those who wish to offer their support to do so, with a moment of private reflection, by joining in saying God save King Charles at the end or, for those with the words before them, to recite them in full.”A Lambeth Palace spokesperson said: “The Homage of the People was always an invitation rather than expectation.“To provide further clarity as the order of service was finalised, it has been mutually agreed by Lambeth Palace and Buckingham Palace that the introductory words will be changed.",
        "“This reflects the collaborative approach that has been taken throughout the coronation planning. We are looking forward to the service with much joy and expectation.”"
    ]
}