{
    "articleURL": "/money/markets/article-12038205/MARKET-REPORT-Housebuilders-road-recovery-prices-rise.html",
    "content": [
        "Housebuilders made gains amid hopes that the property market was on the road to recovery.",
        "Following seven consecutive falls, data from building society Nationwide showed that UK house prices increased in April.Prices rose 0.5 per cent last month while analysts had expected a 0.4 per cent decline.The property market took a hit last September after Liz Truss’s disastrous mini-Budget which sent mortgage rates spiralling.But in a sign of ongoing recovery, the average house price rose by 0.5 per cent between March and April to reach £260,441. While this was 2.7 per cent lower than a year ago, analysts had forecast a fall of 3.6 per cent.",
        "Robert Gardner, Nationwide’s chief economist, said the data showed there were ‘tentative signs of a recovery’.Tomer Aboody, director of property lender MT Finance, said: ‘Buyers are finally making their move after months of waiting and stalling. More transactions are definitely needed for the overall strength of the housing market.’ Persimmon rose 5.5 per cent, or 72.5p, to 1386.5p, Berkeley Group added 1.3 per cent, or 57p, to 4504p, Barratt Developments moved up 1 per cent, or 5.2p, to 505.2p and Taylor Wimpey gained 0.04 per cent, or 0.05p, to 128.25p.Among the mid-cap stocks, Bellway grew 1.7 per cent, or 42p, to 2454p, Vistry Group increased by 1.5 per cent, or 12p, to 794.5p and Redrow jumped 1.7 per cent, or 9p, to 526.5p.",
        "The London stock market made a slow start to the week in the first session following the May bank holiday, with the FTSE 100 down 1.2 per cent, or 97.54 points, to 7773.03 and the FTSE 250 fell 0.6 per cent, or 110.91 points, to 19314.23.Education publisher Pearson slumped 15 per cent, or 133p, to 754p after its US peer Chegg warned that rising student interest in ChatGPT, the artificial intelligence software, was hurting its business.Chegg’s forecast for second quarter revenues to range between £141million and £143million fell short on the £156million expected by analysts.",
        "Shares in Longboat Energy rocketed more than 100 per cent after it landed a £120m deal to team up with a Japanese oil and gas company.The AIM-listed Norwegian North Sea explorer and producer will form a joint business with Japex, which was founded in 1955, to drill up to three wells every year in Norway. As part of the deal, Japex is set to invest £40million in the tie-up in return for a 49.9 per cent stake.Shares soared 107.9 per cent, or 10.25p, to 19.75p.",
        "The boss of Ferrexpo is to step down after a year leading the Ukrainian iron ore miner.Jim North, who joined the November 2014 and became chief executive in February last year, will leave at the end of June.",
        "Chairman Lucio Genovese will take over on an interim basis from July 1. Shares were up 2.8 per cent, or 3p, to 111.1p.Investors in banknote printer De La Rue will have to wait to find out who will be their chairman after it said it was in the final stage of its hiring process.The group had hoped to replace Kevin Loosemore, who resigned last month following pressure from the activist investor Crystal Amber, by yesterday or ‘as soon as practicable thereafter’. It named Nick Bray as interim chairman until a permanent hire is made. Shares rose 3.5 per cent, or 1.45p, to 43.45p.Superdry is in talks with investors to raise around £12million by selling up to a fifth of its shares in a bid to shore up its balance sheet.The fashion retailer’s boss Julian Dunkerton will ‘significantly participate’ in the sale. Shares fell 1.6 per cent, or 1.4p, to 84.7p.Maker of digital products Made Tech plunged 27.5 per cent, or 7.5p, to 19.75p after it warned its revenue and profit for the year to May 31 would be lower than hoped. The group said some clients had delayed the start date of work packages until its next financial year.It expects to report revenues of around £40million, falling short on the £43million analysts had expected.",
        "And profits of at least £1.5million would be below the £3.9million pencilled in by the market.Hostmore, owner of TGI Fridays, hired interim chief executive Julie McEwan permanently and unveiled further cost-saving measures to reduce debt. Shares soared 27.1 per cent, or 3.8p, to 17.8p.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}