{
    "articleURL": "/wires/reuters/article-12052931/In-coronation-brimming-history-King-Charles-Britain-look-future.html",
    "content": [
        "Coronation ceremony dates back 1,000 years",
        "King succeeded his mother Queen Elizabeth in SeptemberWorld leaders gathered in Westminster AbbeyTens of thousands on streets to witness moment of historyNo formal role, or balcony appearance, for Prince HarryPolice arrest members of anti-monarchy group RepublicBy Michael Holden, Kate Holton and Andrew MacAskillLONDON, May 6 (Reuters) - King Charles III was anointed and crowned on Saturday in Britain's biggest ceremonial event for seven decades, a display of pomp and pageantry that sought to marry 1,000 years of history with a monarchy fit for a new era.In front of a congregation including about 100 world leaders and a television audience of millions, the Archbishop of Canterbury, the spiritual leader of the Anglican Church, slowly placed the 360-year-old St Edward's Crown on Charles' head as he sat upon a 14th-century throne in Westminster Abbey.During the solemn two-hour service, elements of which date back to the time of King William the Conqueror in 1066, Charles' second wife Camilla was also crowned queen.A huge military procession followed, gun salutes were fired, thousands of soldiers roared three cheers, and there was a scaled-down flypast by military aircraft as the king and queen waved from the balcony of Buckingham Palace to cheering crowds who gathered on The Mall boulevard.",
        "While rooted in history, the ceremony - only the second British coronation to be televised - was also an attempt to present a forward-looking institution and to reflect a more diverse country.\"I come not to be served but to serve,\" Charles said at the start.With Britain struggling to find its way in the political maelstrom after its exit from the European Union and maintain its global standing, the monarchy's supporters say the royal family provides an international draw, a vital diplomatic tool and a means of keeping it on the world stage.\"No other country could put on such a dazzling display - the processions, the pageantry, the ceremonies, and street parties,\" Prime Minister Rishi Sunak said.But despite Sunak's enthusiasm, the coronation took place amid a cost of living crisis and public scepticism, particularly among the young, about the role and relevance of the monarchy.Charles, 74, automatically succeeded his mother as king of the United Kingdom and 14 other realms including Canada and Australia when Queen Elizabeth died last September.Saturday's event was on a smaller scale than that staged for her in 1953, but still sought to be spectacular. There was an array of historical regalia from golden orbs and bejewelled swords to a sceptre holding the world's largest colourless cut diamond.",
        "After the service, Charles and Camilla, 75, departed in the four-tonne Gold State Coach built for George III, the last king of Britain's American colonies, to ride to Buckingham Palace in a one-mile procession of 4,000 military personnel from 39 nations.Meanwhile hundreds of soldiers in scarlet uniforms and black bearskin hats lined the route along The Mall for what was the largest ceremonial event of its kind in Britain since Queen Elizabeth's coronation.Tens of thousands of people ignored pouring rain to mass on the streets to watch what some saw as a moment of history.\"When I was a young girl, I was able to watch (the coronation of) Queen Elizabeth on television in Hartford, Connecticut, at a friend's house because we had no TV,\" said retired U.S. teacher Peggy Jane Laver, 79.\"So I'm thrilled to be here for the coronation in person.\"Not everyone who came to watch was there to cheer Charles, with hundreds of republicans booing and waving banners reading \"Not My King\". The Republic campaign group said its leader had been arrested, among 52 people detained as part of a \"significant police operation\".SACRED CEREMONYInside the abbey, which was bedecked with flowers and flags, politicians and dignitaries from around the world such as U.S. first lady Jill Biden took their seats alongside 2,200 others from charity workers to celebrities, including actors Emma Thompson, Maggie Smith and Judi Dench and U.S. singer Katy Perry.",
        "Charles looked solemn as he swore oaths to govern justly and uphold the Church of England - of which he is the titular head.He was then hidden from watching eyes by a screen for the most sacred part of the ceremony when he was anointed on his hands, head and breast by Archbishop of Canterbury Justin Welby with holy oil consecrated in Jerusalem.After being presented with symbolic regalia, Welby placed the St Edward's Crown on his head and the congregation cried out \"God save the King\".Gun salutes were fired at the Tower of London and across the capital, the nation, in Gibraltar, Bermuda and on ships at sea.Charles' eldest son and heir Prince William, 40, knelt before his father to pledge his loyalty as his \"liege man of life and limb\".Much of the ceremony featured elements that Charles' forebears right back to King Edgar in 973 would recognise, officials said. Handel's coronation anthem \"Zadok The Priest\" was sung as it has been at every coronation since 1727.But the service also included an anthem composed by Andrew Lloyd Webber, famed for his West End and Broadway theatre shows, a gospel choir, and an \"unprecedented\" greeting from faith leaders.However, there was no formal role for either Charles' younger son Prince Harry, after his high-profile falling out with his family, or his brother Prince Andrew, who was forced to quit royal duties because of his friendship with late U.S. financier Jeffrey Epstein, a convicted sex offender.",
        "They sat in the third row behind working members of the royal family and neither appeared on the palace balcony.Camilla's crowning sealed her rise from a position of deep unpopularity in the period after Charles' divorced first wife, the popular, glamorous Princess Diana, died in a car crash in Paris in 1997.For the last decade, the royal family has enjoyed massive global media attention, celebrating everything from weddings, births, and significant anniversaries to mourning last year's death of Queen Elizabeth, and now Charles' coronation.But, no major event is likely for some years, and with polls indicating a decline in support for the monarchy, especially among the young, commentators say adapting and staying relevant is the greatest challenge to the institution.Neil Edward, 72, a retired salesman who travelled from southwest England to watch, said the experience had been a mixture of pride and nostalgia with a touch of sadness that this might be the last big royal event he attends.\"Without them, I don't know how we would come together to celebrate big events like this,\" he said.(Additional reporting by Andrew MacAskill, Sarah Young, Suban Abdulla, Rachel Armstrong, Farouq Suleiman, Muvija M and Paul Sandle Writing by Michael Holden and Kate Holton Editing by Frances Kerry and Janet Lawrence)"
    ]
}