{
    "articleURL": "/news/article-12042409/Sheriffs-deputy-helps-woman-deliver-healthy-baby-girl-Florida-highway.html",
    "content": [
        "Hillsborough County Master Deputy Daniel 'Red' Jones sprang into action to deliver the baby girl on the shoulder of Highway 60 in Plant City, Florida SundayDramatic body camera video footage captured the miraculous roadside deliveryThe baby's father Luis Lopez said they have named the child Lexela Luis LopezA Florida sheriff's deputy sprang into action to help deliver a baby on the side of a highway after an expectant mother went into labor while traveling in the car. ",
        "Dramatic body camera video footage released by the sheriff’s office captured the miraculous roadside delivery in Plant City on Sunday.  The driver and father of the baby Luis Lopez approached Hillsborough County Master Deputy Daniel 'Red' Jones in a panic, and explained that his wife was about to give birth and that her water had broken. Jones called Hillsborough County Fire Rescue for backup at the scene on the shoulder of Highway 60, but the baby wasn't waiting for anyone. Without hesitation, he jumped into assist and within minutes, a healthy baby girl was born. The baby is the woman's sixth child and she is the third child Jones has helped delivered since he started at the sheriff's office in 2001. Scroll for video ",
        "Jones offered the woman words of encouragement throughout the delivery while also making her laugh at times. When he asked if this was her first baby, the mother replied that this was her sixth.  'Six? Woo, you all need a better hobby,' Jones said, which made the mother chuckle. The deputy continued to provide 'constant encouragement and emotional support' while also using his training to make sure it was a safe delivery, according to a Hillsborough County Sheriff's Office news release.'All right, look at me, look at me,' Jones is heard telling the woman. 'Breathe through, all right, mama. Breathe through.' ",
        "Paramedics arrived on the scene a short time later and transported the mother and baby to a nearby hospital for further evaluation and care. ",
        "The baby's father told 10 Tampa Bay that he is thankful for Jones and the safe delivery of his child. 'I want to thank the Hillsborough Sheriff's Department for having amazing officers that helped us to deliver our baby girl at Highway 60,' Lopez said. 'Also, thanks to the fire department and EMS team for the awesome job they did there.'Meanwhile Jones said he was thrilled to help welcome this baby girl into the world and even recommended that they name the baby 'Red,' the sheriff's office said in the news release. However, Lopez said they have named the baby Lexela Luis Lopez. Both mother and baby are doing well, officials said. ",
        "The Hillsborough County Sheriff's Office praised Jones for his quick actions. 'I am extremely proud of Master Deputy Jones's quick actions and dedication to serving our community in any capacity,' Sheriff Chad Chronister said in a statement.'This is his third time assisting a citizen with delivering a baby! While delivering in the front seat of a car was not the original birth plan, Master Deputy Jones reassured the mother of six that she was in good hands.",
        "'I wish mom, dad, and their new baby girl all the joy and happiness. Congratulations!'Jones, who is best known around Hillsborough County as 'Red,' is also a proud local small business owner and once had an active rodeo cowboy career from the ages of 15-21.He's an active Patrol Master Deputy and won HCSO's Distinguished Service Award in 2012 and a Life Saving Award in 2021."
    ]
}