{
    "articleURL": "/tvshowbiz/article-12039865/Miranda-Kerr-leaves-New-York-City-hotel-black-leather-jacket-glamorous-black-sunglasses.html",
    "content": [
        "Miranda Kerr was seen exiting the swanky Carlyle Hotel in New York City on Tuesday.",
        "The 40-year-old Australian supermodel - who attended the Met Gala one day earlier - looked refreshed as she stepped out with a smile on her face.The mother-of-three, who shares a son with ex-husband Orlando Bloom, donned a black leather jacket and glossy onyx sunglasses.Miranda waved to fans as she put on a fashionable display in high-waisted jeans and red heels.She carried a brown leather Louis Vuitton purse with the brand's classic logo over her shoulder.",
        "Miranda's jacket was adorned with gold hardware accents in the form of coin-like buttons.She layered the stylish outerwear over a shrunken black crew neck sweater with thin white, gold, and red stripes.The bombshell looked better than ever with her blonde highlighted hair styled in a precise center part.The lustrous locks flowed over her shoulders in a slightly textured wavy pattern.The fashionista commanded attention as she left the hotel in pointy-toe perspex and fire engine red open-back shoes.Kerr, who hails from Sydney, flaunted a clean, short, pink nude manicure as she smiled, flashing her dimples.Underneath her rectangular eyewear she glowed in a face of soft makeup complete with a soft pink lip stain.During the day she took to Instagram to reshare a recording of herself leaving the Big Apple lodge with the caption, 'And we're off!'",
        "It comes after Miranda, who is married to billionaire Snap CEO Evan Spiegel, turned heads at the Met Ball.She was as pretty as a princess in an off-white gown from designer Dior with pearl embellishments.The glamorous garment was cinched in at the waist and featured a tastefully low-cut neckline to reveal the model's décolletage.The floor-length gown had a modest train for a touch of drama and elegant straps on the shoulders.Kerr paired her frock with a diamond choker, along with matching earrings and a ring.She carried a rose gold clutch in one hand and had streaks of blonde through her brown hair.The star's followers were blown away by her stunning look, with one commenting that she was the 'best dressed' of the night.",
        "'Miranda is actually a real life Disney princess,' gushed another admirer.Earlier in the day she received an IV drip of vitamins and hydration infusions.Sharing the moment to Instagram, the ex-Victoria's Secret stunner sat with her arm outstretched as she took a dose before the anticipated fashion event.'Quick IV with Samir,' she wrote alongside the smiling photo."
    ]
}