{
    "articleURL": "/sport/football/article-12050255/Frank-Lampard-labelled-defender-Andre-Wisdom-BULLY-time-Derby-County.html",
    "content": [
        "Wisdom opened up on his difficult relationship working with Lampard at Derby The ex-Rams defender claims he was told 'I'm not scared of you' by his managerHe also accused Lampard of not being 'honest to the team collectively' that year Former Derby County defender Andre Wisdom has criticised Frank Lampard, revealing that his old boss labelled him a 'bully' in the past.",
        "The pair worked together at Derby in the 2018-19 season, where Wisdom revealed they fell out.'I've had one manager scream at me and it was Lampard,' he told The Beautiful Game Podcast. 'We got smashed by Aston Villa, 4-0 I think, and I said some comments after the game and then he just went in. But it was nothing to do really with football, it was more about me as a person which was very strange to me.'He said some things that were just very strange. For instance, when someone says \"I'm not scared of you\". He said I walked slow, he said I bully people.'Anybody you could ask, I know it might sound a bit egotistical, but they'll say no Andre is cool. I've never once even raised my voice at anyone. Don't play with me. Do not. Don't. But bully is different. 'I'll talk to you by yourself over there. That's my type. But in front of people, why do that? You're going to react then we have a problem. I'm not all the things he said, so it was weird.'",
        "'As a player, don. Don. Slapped goals left [and] right, but he's just not for me.'He also said earlier in the podcast: 'My experience it was weird, it was very, very weird. It didn't feel like I was at football, and I think what kind of threw me was the fact that it was Frank Lampard.",
        "'I don't want you misinterpret it like I was in awe... far from. Far from. I think I expected something that I wasn't getting. I expected more from him as a man.' Wisdom, who made 97 appearances during his time with the Rams, also revealed that it was not just Lampard who he failed to warm to as he discussed his relationship with the Chelsea legend's former No 2 Jody Morris.'I didn't rate him,' the centre-back said about Morris. 'On a night out, I'd probably get into a fight with them. Just not for me.'Wisdom, currently a free agent, went on to claim that Lampard has escaped in his managerial career because players are afraid to talk badly of the England icon. He said: 'It's mad when you say that because in football it's like \"don't say anything about Lampard, Gerrard, Rooney, they're legends\". 'I think Rooney is different because he's a scapegoat for English people in football. I don't put him in that category. He's the best for me anyway. ",
        "'Without being disrespectful, for me as a manager I didn't rate him. It didn't click. I've had other managers, being in and out of the team and we had a mutual respect for each other. 'I think we didn't really see eye to eye.'",
        "Wisdom, who played alongside Chelsea loanees Mason Mount and Fikayo Tomori that season, discussed how Lampard changed the culture at Derby but was not 'honest' with his team. 'I don't think he was honest to the team collectively,' he continued. 'We had a good team as well, so it's easy when everything's going well. Like we got to the final and lost against Villa. But I think it was very cliquey, it felt like people spoke behind people's backs. That season just wasn't very good.'Yeah [the old energy] had kind of been lost. And if it's tried to come back you'll be punished for it kind of thing. 'I remember the pre-season, some of the lads on one of the last nights they came back late or something and then the next day we were all running for it. I understand the message, but it just felt very negative.'",
        "Wisdom finalised by wishing all the best to Chelsea's current interim manager, who has lost all six of his matches in charge this season, admitting that he is not surprised he was handed the reigns at Stamford Bridge. 'No I'm not surprised [at Lampard's appointment at Chelsea]. I would never diss [his managerial career]. His job is his job, that's for him. ",
        "'All the best to him, I don't have no bad vibes to him. But if he was sat here would I speak to him? No, I just didn't really rate him.'Chelsea face Bournemouth this weekend as pressure mounts on the Blues, who are still not mathematically safe from relegation this season.Lampard knows that things must change if he is to rescue his reputation, with Wisdom's comments coming to light in recent days. "
    ]
}