{
    "articleURL": "/wires/reuters/article-12042761/Knights-Malta-elect-Canadian-Grand-Master-Americas.html",
    "content": [
        "By Philip Pullella",
        "ROME, May 3 (Reuters) - John Dunlap, a Canadian lawyer, was elected on Wednesday as the new Grand Master of the Knights of Malta, the global lay Catholic religious order and humanitarian group that is emerging from a period of internal upheaval.Dunlap, 66, becomes the 81st Grand Master in the group's nearly 1,000-year history and the first from the Americas to assume the top position in what is formally known as Sovereign Military Hospitaller Order of St. John of Jerusalem, of Rhodes and of Malta.It was founded in Jerusalem in 1048 to provide medical aid for pilgrims in the Holy Land.Dunlap, who joined the order in 1996 and became what is known as a professed knight in 2008, is the first Grand Master in the order's history not to be elected for life.According to the group's recently approved new constitution, Grand Masters, who also assume the title of prince, now serve for 10 years. Professed Knights, from which the Grand Masters are chosen, take vows of poverty and chastity as well as obedience to the pope.Last September, Francis dissolved the order's leadership and installed a provisional government following the death of the last Grand Master in June.The pontiff moved in an attempt to end five years of often acrimonious debate within the order and between some top members of the group's old guard and the Vatican over the new constitution, which some feared would weaken its sovereignty.",
        "The order has a multi-million dollar budget, 13,500 members, 95,000 volunteers and 52,000 medical staff running refugee camps, drug treatment centres, disaster relief and clinics around the world. It has been very active in helping Ukrainian refugees and war victims.The order has no real territory apart from a palace and offices in Rome and a fort in Malta, but is recognised as a sovereign entity with its own diplomatic corps and passports.It has diplomatic relations with 110 states and permanent observer status at the United Nations, allowing to act as a neutral party in relief efforts in war zones.The new constitution and Dunlap's election was seen a win for reformers, backed by the Vatican, who had sought a more transparent government to bring in fresh blood and allow the order to better respond to its recent massive growth. (Reporting by Philip Pullella, Editing by William Maclean)"
    ]
}