{
    "articleURL": "/wires/aap/article-12057057/Labors-cost-living-package-14-billion.html",
    "content": [
        "The federal budget is predicted to dip into the black this financial year, which if it eventuates, will be the first time a surplus is recorded in 15 years.",
        "Treasurer Jim Chalmers will on Tuesday unveil updated forecasts, with a near $4 billion surplus predicted for 2022/23.The treasurer's second budget will unveil smaller deficits than forecasted, with a $143 billion reduction over the forward estimates.But most of the increased revenue will be banked instead of answering calls for boosts to welfare payments with the interest bill on the debt set to hit $110 billion over the next five years.Just over 80 per cent of the extra revenue will go towards paying down the national debt, bringing the total surplus revenue banked over two budgets to 87 per cent.\"What's absolutely clear is that this outcome would never have been possible without our decision to return most of the upward revisions to revenue to the bottom line,\" Dr Chalmers said.\"Our responsible economic management is all about spending restraint, substantial savings redirected to other priorities, and modest but meaningful tax changes.\"But Dr Chalmers says the budget will still help those doing it tough with $14.6 billion of cost-of-living relief, including a lift in single-parent support.From September 20, single parents will no longer have to transfer to JobSeeker when their youngest child turns eight.A base rate of $922.10 per fortnight will apply until their youngest child turns 14.",
        "The Gillard government a decade ago reduced the age cut-off from 16 to eight.Those parents currently on JobSeeker will receive an increase in payments of $176.90 per fortnight, if parliament passes legislation to enact the changes.Prime Minister Anthony Albanese, who announced the proposed change in Perth on Monday, said children of single-parent families deserved greater support.\"I know first-hand what it's like to grow up with a single mum doing it tough and we want to make sure that the children of single-parent families have the best opportunities in life,\" he told reporters.Addressing caucus members in Canberra ahead of Tuesday's budget, Mr Albanese said it would be about aspiration.\"We don't leave people behind but we also don't hold people back,\" he said.\"This budget will be in the best tradition of the Australian Labor Party, dealing with those immediate challenges, but always with the eye on the future.\"While also rolling out power bill relief, cheaper medicines and tax incentives for electrification and energy efficiency upgrades, the government has found $17.8 billion in savings and will reap $2.4 billion extra revenue from taxes on offshore LNG producers.Opposition finance spokeswoman Jane Hume said the only way to provide genuine relief for struggling families was for the government to rein in its spending and tackle inflation, which was sitting at seven per cent.",
        "\"Getting inflation down is the only policy that would provide the cost-of-living relief to all Australians,\" she said.Senator Hume said the government had palmed off its responsibility to help bring down inflation to the Reserve Bank.Greens leader Adam Bandt said the changes to the petroleum resource rent tax had been designed by the \"gas cabal\" and did not go far enough in taxing producers more to pay for social services.\"If the government had the courage to make the big corporations and the billionaires pay their fair share of tax, then all single parents could be getting the support that they need,\" he said.A combination of higher revenues and lower payments is expected to allow the government to deliver the first budget surplus in 15 years, but the bottom line is set to deteriorate from there.The largest calls on the budget include health, aged care, defence, disability services and interest on debt.Australians can expect a 0.75 per cent increase in real wages in 2023/24, reflecting the combination of rising wages and falling inflation."
    ]
}