{
    "articleURL": "/femail/article-12042627/Michael-Bloombergs-family-ANTI-Prince-Harry-Meghan-Markle.html",
    "content": [
        "Georgina, 40, spoke exclusively to DailyMail.com at Rescue Dogs Rock NY eventThe heiress has followed in her dad's philanthropic footsteps with animal charityHowever she says she would never accept a donation from the Sussexes' Archewell charity because: 'My mother would never forgive me'Another famed American dynasty has come out to voice its dislike of Prince Harry and Meghan Markle, marking another clear sign that the Sussexes' popularity in the US is seriously starting to wane. ",
        "Weeks after Rockefeller heiress Kayla took aim at 'controversial' Meghan, 41, and just days before Harry is due to attend his father King Charles' coronation, billionaire former New York City mayor Michael Bloomberg's daughter has revealed her family is also firmly in the anti-Sussex camp.  Speaking exclusively to DailyMail.com at the Rescue Dogs Rock NYC Cocktails for Canines event in New York, Georgina Bloomberg, 40, suggested that it will be impossible for the Sussexes to reach the upper echelons of philanthropic success in the US - at least where her family is concerned. When asked whether she would ever team up with Harry and Meghan's Archewell Foundation as part of her own charitable endeavors, the showjumper and author was quick to say 'no', admitting: 'My mother would never forgive me.' ",
        "Georgina's mother, Susan Brown, is British and - according to her daughter - raised her children in a very 'traditional British way', while also passing down her personal dislike of the Duchess of Sussex. Indeed, when asked if her mother was 'anti-Sussex', Georgina said emphatically: 'Very.'While many Americans initially threw their support behind Meghan and Harry, the showjumper noted that her mother had her concerns about the relationship 'from day one'.  Georgina's 81-year-old billionaire father Michael - who served a the mayor of New York City for three terms, from 2002 to 2013 - has actually met Prince Harry in the past during a 2008 trip to the UK, where the pair had a 30-minute private conversation about the royal's Sentebale charity. ",
        "But it seems that chat did little to improve his family's feelings about the Sussexes, particularly where his ex-wife Susan - who was born in Yorkshire - is concerned. Susan and Michael, who co-founded the financial information and media company Bloomberg LP and is worth an estimated $94 billion, were wed in 1975 and had two daughters together - Emma, 43, and Georgina - before splitting in 1993. Michael is heavily involved in philanthropy and his Bloomberg Philanthropies organization is estimated to have given away roughly $1.6 billion in 2022 alone, according to Fortune. In stark contrast, it was revealed earlier this year that Meghan and Harry's Archewell Foundation has raised more than $13 million since its formation after Megxit, $3 million of which it has donated to its chosen causes. ",
        "Mother-of-one Georgina, who is engaged to investment banker Justin Waterman, has followed in her father's philanthropic footsteps, focusing her efforts on animal rights through her charity Rescue Dogs Rock NYC.'Rescue Dogs Rock NYC’s goal is to raise awareness of the ever-growing plight of homeless animals in the United States, in shelters as well as those abandoned in the streets,' she said of her organization. 'There are way too many fantastic animals that are euthanized every day just because they are homeless.",
        "'Rescue Dogs Rock NYC introduces these animals to the public and educates them that unwanted companion animals are not damaged goods or unworthy but can be fostered into wonderful family pets.'Sadly, the abuse, neglect, cruelty, and medical cases cost shelters the most money, and often are the first animals to euthanized.'People who abuse or neglect animals are a******s.'Georgina's comments about Meghan and Harry come a few weeks after another scion of one of America's most well-known dynasties - Kayla Rockefeller - also railed against the Duchess of Sussex.  Just last month, Kayla, 23, claimed that the Duchess of Sussex is now viewed as being too 'controversial' by many Americans, admitting that she wouldn't ever enlist Meghan to model for her burgeoning jewelry brand because she 'couldn't take that chance' on such a contentious figure. 'That would be controversial,' Kayla exclusively told DailyMail.com when asked about the possibility of Meghan wearing her designs. 'As a new jeweler I couldn't take the chance. I mean, I could but people are so 50/50 [about Meghan].'Still, Meghan and Harry have found support from another scion of a great American family: Kerry Kennedy, who threw her weight behind the Sussexes in December when she presented them with a human rights award on behalf of the RFK Foundation for their 'heroic' fight against 'structural racism' within the Royal Family. ",
        "The move sparked furious controversy, even within the Kennedy clan - with Kerry's own brother Robert Jr branding it a 'bewildering choice' in an interview with DailyMail.com. Harry and Meghan sparked further uproar weeks later with the release of their tell-all Netflix documentary, which was followed soon after by the publication of Harry's bombshell memoir Spare. In the book, and in the many TV interviews he did to promote it, Harry, 38, made several damning allegations about his family - at one point accusing his brother William of grabbing him by the collar and throwing him to the ground during an altercation at Nottingham Cottage.Weeks after the book was released, a shock poll revealed that Harry and Meghan's popularity in the US had plummeted to an all-time low, making them less popular than the disgraced Prince Andrew.Between December 2022 and February 19, when the survey by Redfield &amp; Wilton for Newsweek was conducted, Harry's rating sank by 48 points, while Meghan's had dropped by 40 - giving them approval ratings of -10 and -17, respectively.Meanwhile Andrew's rating at the time stood at -2."
    ]
}