{
    "articleURL": "/news/article-12041853/1000-Lb-Sisters-Tammy-Slaton-seen-standing-wheelchair-time.html",
    "content": [
        "Tammy Slaton has documented her impressive weight loss journey since rehabShe is reported to have lost more than 300lbs - nearly half her original weight READ MORE: Slaton is flooded with praise after she was seen walking unassisted Tammy Slaton of reality show '1000-Lb Sisters' fame has been seen standing in new photos with sister Amy Slaton on Instagram amid a dramatic weight loss journey.",
        "Amy posted the photos, captioned: 'Had a blast last night. Totally embarrassed myself but it was fun. Now to go pick up my boys... can't wait to see my new friends again we love y'all.' Fans shared their support for the star, 36, who has lost more than 300lbs (136kg) since her show followed her into rehab last year - aired in 2023 - to lose weight.After hitting her target and gaining approval for bariatric surgery, Tammy has gone from strength to strength and now appears to be able to stand without support.'Seeing Tammy stand on her own is so heartwarming. Proud of y'all's progress,' wrote one user under the pictures. 'Tammy standing on her own? Big W,' wrote another.",
        "After spending time in a food rehab center, Tammy revealed she had hit her goal weight of 550lbs, meaning she was able to have bariatric surgery.",
        "'Finally, all my work has paid off,' she said at the time. 'After all this bulls**t, all the sacrifices. I had to give up a lot. My soadies. My chocolate.'She said during episode four, which aired on 7 February this year: 'When I got on the scale and I saw the scale was at 534.7, I kinda stopped breathing for a second.'I'm like 14 lbs. under my goal weight. From over 700, that's a huge drop.' ",
        "In December, she shared a TikTok video of herself with her new look and received praise from supportive fans telling her how 'amazing' she looked.Then in March, Tammy showed off yet more progress, reportedly weighing 400lbs down from 700lbs, and was pictured standing unaided after years of using a wheelchair or walker.Following the photo uploads in May, which showed the star out on a girls' night out with her friends and sister, Amy, fans again turned out to offer kind words.Another Instagram user pointed out: 'No trach, no oxygen, no wheelchair, Standing on her own, even doing a little squat This is soo awesome to see! Congrats on the hard work.'Another user, giggle_pants, said: 'Way to go Tammy !! No oxygen and walking on her own!!'",
        "TLC series '1000-lb Sisters' first aired in 2020 and focuses on the lives of Amy Slaton-Halterman and her sister, Tammy, in Dixon, Kentucky.The show has followed their lives over four seasons, the latest of which was first aired on 17 January 2023, as they attempt weight loss and weight loss surgery.The tenth episode of season four, first aired on 21 March 2023, followed the sisters as they prepared for a wedding.In November, Tammy married her partner, Caleb Willingham, during an intimate ceremony.",
        "Willingham took to Facebook at the end of April to express his heartbreak that he had split from Tammy. "
    ]
}