{
    "articleURL": "/femail/health/article-12048895/Girlfriend-shares-boyfriends-weird-sleeping-habit-Thats-serial-killer-behaviour.html",
    "content": [
        "A woman revealed her boyfriend sets 'unusual' alarms in the morning She is not sure if his behaviour is normal A young woman has revealed her boyfriend's 'weird' sleeping habit only to be warned it is 'serial killer behaviour'.",
        "Speaking to a popular podcast Carina, who has been with her boyfriend for a few months, revealed he sets his morning alarm 'hours early'.Everyone is familiar with the relief that comes from realising you have woken up too early and still have hours to sleep before your alarm goes off.She explained it was standard for her boyfriend to pre-set an alarm two hours before he had to wake up in order to manufacture the same feeling.His alarm goes off at 3am every single night, she said, and then he just rolls over and goes back to sleep until 5am.",
        "Podcast host Ryan Jon admitted he loves the feeling of 'not having to get up yet' but forcing it seemed a bit 'strange'.Carina wondered if she should be worried about the behaviour - and Jon's co-host Toni couldn't contain her concern. 'Is his job being a f***ing serial killer?' she asked.The duo quickly decided Carina's boyfriend was strange.'I think he's a f***head,' Toni said.And their fans were similarly outraged by the behaviour. 'No!' exclaimed one woman. 'That feeling can only come organically, you can't force it with alarms!''That's so stupid,' said another. 'If I wake up early I won't sleep again. My anxiety takes over and I'll keep clock watching.'",
        "'I would hate that then I wouldn't be able to get back to sleep,' added a third.",
        "A woman even shared the frustration she felt after a partner did something similar. 'My guy would set several alarms an hour before he really needed to get up. I threw his phone across the room,' she wrote.But others admitted they regularly set alarms for earlier than necessary. 'I do that!' a woman said. 'I have to wake up at 6am for work so I set alarm for 4am and 6am. It's the best feeling when that 4am alarm goes off.''Oh my god, I thought I was the only one who did that,' another echoed.A third said: 'No, it doesn't need to come organically. I set my alarm three hours early each morning and it's divine.''I also do this! I have a 3am, 4am and 5am alarm to get up at 5:30,' wrote a man.",
        "Multiple alarms repeatedly cause the brain to start waking up and then settle again, only to be jolted awake a few minutes later. Repetitive awakenings disrupt sleep quality and are an extremely inefficient way of getting extra sleep, according to Head Space.  Instead, it is recommended to set your alarm for a later time which can help you enjoy a longer sleep without being disrupted. 'If you set alarms for '06:00', '06:05', '06:10' ... and so on, you are setting yourself up to make excuses,' Fitness coach Lauren Simpson told FEMAIL. 'It makes you wish you could stay in bed just five more minutes or just ten more minutes.''Instead, we want to set just one alarm and when that one alarm goes off, this is when you are going to jump out of bed.'"
    ]
}