{
    "articleURL": "/wires/reuters/article-12045301/Weight-loss-drug-maker-Novo-Nordisk-beats-earnings-forecast.html",
    "content": [
        "Novo halves supply of Wegovy starter doses in U.S.",
        "Reduced supply for \"some months\" - CEOFirm reports forecast-beating Q1 resultsObesity care sales up 124% in Q1Shares down 4.7% at 0731 GMT(Adds analyst comment, CEO comment on UK Wegovy launch, obesity care sales, share performance)By Nikolaj SkydsgaardCOPENHAGEN, May 4 (Reuters) - Danish drug developer Novo Nordisk said it would have to halve the supply of starter doses of its popular Wegovy weight-loss drug in the United States to cope with high demand after reporting forecast-beating results on Thursday.Shares in Novo Nordisk traded down 4.7% at 0731 GMT, putting a small dent in a rise of more than 140% since the firm launched Wegovy in the U.S. in June 2021. The company's stock is the best performing in Europe.\"To safeguard continuity of care, the supply of the lower Wegovy dose strengths in the US will be reduced temporarily,\" Novo said in a statement.Novo has faced supply constraints for its hugely popular Wegovy drug as a result of overwhelming demand, and has invested massively in increasing supply.Sales of Novo's obesity care products, including Wegovy, rose 124% in the first quarter.\"We cannot supply an uptake that just continues growing, so it's important for us that we secure continuity of supply for those patients who have started treatment,\" Chief Executive Lars Fruergaard Jorgensen told journalists on Thursday.",
        "Supply of starter doses in the U.S. would be cut by around 50% for \"some months,\" Jorgensen added.Credit Suisse analysts said they were not surprised by the move, given the level of demand for the drug.Last month the company said a second contract manufacturer would commence production of Wegovy and on Thursday Jorgensen said a third manufacturer would begin production later this year.Jorgensen said he could not give a date for when Wegovy would be launched in the UK, where in March the country's cost effectiveness watchdog recommended it for use for certain obese people.\"We will gradually roll out in International Operations, and UK is a part of that. We are not commenting on specific launch dates,\" he said.Novo on Thursday reported earnings before interest and taxes (EBIT) of 25 billion Danish crowns ($3.72 billion), above an average analyst forecast of 22.4 billion, according to a Refinitiv poll.Earlier this month, Novo, the second-most valuable company in Europe by market capitalisation behind French luxury goods group LVMH, significantly raised its full-year operating profit and sales expectations on the back of strong demand for Wegovy.Novo on Thursday maintained full-year growth guidance in local currencies, but said due to the strength of the Danish crown sales and operating profit growth reported in Danish crowns are now expected to be 6 and 9 percentage points lower, respectively.",
        "($1 = 6.7221 Danish crowns)(Reporting by Nikolaj Skydsgaard, editing by Terje Solsvik and Sharon Singleton, Elaine Hardcastle)"
    ]
}