{
    "articleURL": "/tvshowbiz/article-12045109/Alex-Rodriguez-girlfriend-Jaclyn-Cordeiro-smiles-grabbing-dinner.html",
    "content": [
        "Alex Rodriguez and Jaclyn Cordeiro were all smiles on Wednesday evening while heading out for a mid-week dinner.",
        "The 47-year-old Major League Baseball commentator and his 42-year-old fitness guru were spotted arm-in-arm while heading into Giorgio Baldi in Santa Monica.The couple were first spotted together back in October before they became 'Instagram official' in December, just before the holidays.A-Rod stepped out with a crisp white dress shirt, slightly unbuttoned, with no tie, under a black suit coat.He rocked black sunglasses while walking to the restaurant with his girlfriend, as they walked arm-in-arm.",
        "The former MLB superstar completed his look with matching black pants and shiny black dress shoes.Cordeiro opted for a lacy black low-cut top under a black leather jacket for the dinnertime outing.She accessorized with a gold necklace and a gold watch seen peeking out from under her black leather jacket.The fitness instructor linked arms with A-Rod while holding a black clutch, completing her look with black pants and black Yves Saint Laurent heels. Rodriguez and Cordeiro - who started her own fitness program JacFit during the pandemic - were first spotted in Beverly Hills back in October.'Friends say he’s very happy and enjoying [their] time together,' a source told Page Six about the couple. 'He’s enjoying spending time with her. She’s great! She’s a former nurse and a mother of two,' the source continued, adding, 'He’s great with her and really happy.'",
        "A-Rod and Cordeiro's coupling came just a month after the baseball star split with Kat Padgett after nine months of dating. ",
        "A source said of A-Rod's split with Padgett, 'They parted ways, but remain great friends.' Rodriguez played 22 seasons of Major League Baseball with the Seattle Mariners, Texas Rangers and New York Yankees.He now serves as the chairman of A-Rod Corp and Presidente Beer, and is also part owner of the NBA's Minnesota Timberwolves.He also works as a baseball analyst for Fox Sports, recently reuniting with his former Yankees teammate Derek Jeter for the current baseball season. "
    ]
}