{
    "articleURL": "/wires/reuters/article-12045431/Heavy-fighting-Khartoum-power-struggle-rages.html",
    "content": [
        "By Khalid Abdelaziz",
        "KHARTOUM, May 4 (Reuters) - Fierce fighting could be heard in central Khartoum on Thursday as the army tried to push back the paramilitary Rapid Support Forces (RSF) from areas around the presidential palace and army headquarters, with a lasting ceasefire appearing elusive.Each side appears to be battling for control of territory in the capital ahead of any possible negotiation, though the leaders of both factions have shown little public willingness to hold talks after more than two weeks of fighting.Heavy bombardments also rang out in the adjoining cities of Omdurman and Bahri.The United Nations, meanwhile, pressed Sudan's warring factions on Wednesday to guarantee safe passage of humanitarian aid after six trucks were looted and air strikes in the capital undermined a supposed truce.U.N. aid chief Martin Griffiths said he hoped to have face-to-face meetings with Sudan's warring parties within two to three days to secure guarantees from them for aid convoys to deliver relief supplies.HUMANITARIAN DISASTERThe United Nations has warned that fighting between the army and RSF, which erupted on April 15, risks causing a humanitarian catastrophe that could spill into other countries. Sudan said on Tuesday that 550 people had died and 4,926 people wounded so far in the conflict.About 100,000 people have fled Sudan with little food or water to neighbouring countries, the U.N. says.",
        "The army and RSF joined forces in a coup two years ago and had shared power as part of an internationally backed transition towards free elections and civilian government before falling out over the transition.The RSF accused the army of breaching a ceasefire and attacking forces since dawn. It accused the army of attacking its residential neighbourhoods with artillery and aircraft in a \"cowardly manner\"The envoy of Sudan's military leader said on Wednesday that the army \"accepted the Saudi-American initiative for truce talks, not mediation to end the fighting\" with the RSF.The envoy, Dafallah Alhaj, said at a press conference in Cairo: \"Our delegation will not meet with RSF face to face, communication will be through mediators.\"(Additional reporting by Tala Ramadan; Writing by Michael Georgy Editing by Gareth Jones)"
    ]
}