{
    "articleURL": "/wires/pa/article-12047237/Greenpeace-stages-Darth-Vader-protest-deep-sea-mining-conference.html",
    "content": [
        "Actors dressed as Darth Vader, Dr Evil and Thanos have staged a protest at a deep sea mining conference in central London on Star Wars Day.",
        "The three actors hired by environmental campaign group Greenpeace, who wished not to be named, attended the Deep Sea Mining Summit 2023 at the Marriott Hotel in Canary Wharf on Thursday, coinciding with “May the Fourth”.Greenpeace said the “villains” attended the event as a way to raise awareness of how deep sea mining “poses untold threats to our already plundered oceans”.It comes as the International Seabed Authority (ISA), the UN-backed regulator, faces pressure to allow permits for commercial deep sea mining. Monetising the seabed might seem like a far-fetched, dastardly plan, but it's worryingly real and the people trying to do it don't wear obvious, villainous costumes  Andrew Tobert, Greenpeace UK  The three actors entered the conference in what appeared to be normal clothes, but during a Q&amp;A session they put on masks and went up to the stage.One actor initiated the protest when he was given permission to ask a question but instead stood up and put on a Darth Vader mask, saying: “I’m delighted to be here and learn more about deep sea mining, because together we can destroy the oceans.”All three proceeded to head to the stage where the actor continued to say: “We can bring back together the power of the dark side and deep sea mining so that we can eliminate all life in the oceans and then the galaxy. Deep sea mining is inevitable.",
        "“We will use the destructive might of the Death Star and with your mining machines, the fish stand no chance.“Thank you for this platform to connect with you, our colleagues, in our evil plans. You make me think that I haven’t even thought how to be evil. You destroy your own planet.“We could not even think of deep sea mining – what a stroke of genius. I never thought you could make them think it’s good for the planet. Brilliant.”A wave of nervous laughter from the audience could be heard as the actors were escorted from the conference, marching out as one played the Imperial March from Star Wars on a kazoo.Greenpeace has warned that deep sea mining could cause irreversible damage to marine life on the largely untouched ecosystem of the deep ocean floor.",
        "It comes as the ISA is preparing to consider the first-ever commercial deep sea mining application despite opposition from many member states after the small Pacific island nation Nauru triggered a legal clause compelling the regulator to consider applications for permits.Andrew Tobert, Greenpeace UK oceans campaigner, said: “Monetising the seabed might seem like a far-fetched, dastardly plan, but it’s worryingly real and the people trying to do it don’t wear obvious, villainous costumes.",
        "“We have explored just 1% of the deep sea, on each visit discovering fascinating species found nowhere else on Earth – it’s one of our last untouched ecosystems. But it would be stripped bare by deep sea mining, causing irreversible damage to marine life. There’s no way it can be done sustainably.”Mr Tobert added that companies such as Samsung and Renault as well as governments across the world are calling for deep sea mining to be banned while the UK Government is currently supporting research into deep sea mining after approving exploratory deep sea mining licences 10 years ago at UK Seabed Resources (UKSR).“Deep sea mining poses untold threats to our already plundered oceans,” he said.“It’s got to be stopped before it starts.”A Department for Business and Trade spokesperson said: “Our position remains that the UK will not sponsor or support issuing of exploitation licences for deep sea mining projects unless and until there is sufficient scientific evidence about the impact on deep sea ecosystems.“We continue to work closely with the International Seabed Authority to ensure there are strong and enforceable environmental regulations so it contains the highest environmental standards to safeguard our oceans.”The PA news agency has contacted the Deep Sea Mining Summit for comment."
    ]
}