{
    "articleURL": "/wires/ap/article-12057829/Sporting-KC-beats-Sounders-2-1-victory-season.html",
    "content": [
        "SEATTLE (AP) - Erik Thommy had a goal and an assist, Alan Pulido scored his first goal in nearly two years and Sporting Kansas City stunned the Western Conference-leading Seattle Sounders with a 2-1 victory on Sunday.",
        "Sporting KC (1-7-3) picked up its first win of the season after entering play with just three points through its first 10 matches, equaling the worst start in league history. Sporting KC is also the first team with as many red cards (3) as goals through the first 10 matches.Thommy provided an early spark for Sporting KC when he took passes from Gadi Kinda and Dániel Sallói in the 4th minute and scored for the first time this season. It was the first goal allowed by Stefan Frei and the Sounders in six home matches this season. Seattle tied a league record with five straight clean sheets at home to begin a season.Thommy picked up an assist on a goal by Pulido in the 31st minute and Sporting KC took a 2-0 lead into halftime. It was Pulido's first goal in league play since scoring in a 2-0 victory over FC Dallas on August 14, 2021. Pulido missed all of last season with a knee injury.The lone goal for Seattle (6-3-2) came on a penalty kick by Nicolás Lodeiro in the 66th minute.Jordan Morris was held without a goal after scoring four times in the Sounders' 4-1 road win over Sporting KC in March. Morris is tied for the league lead with eight goals this season, although he hasn't found the net in six straight matches.",
        "Both teams took 11 shots with Sporting KC holding a 5-3 edge in shots on goal.Tim Melia finished with two saves for Sporting KC. Frei saved three shots for the Sounders.The Sounders have only beaten Sporting KC in back-to-back matches once - a pair of 1-0 wins in the 2013-14 seasons.Seattle travels to play the Houston Dynamo on Saturday. Sporting KC returns home to host Minnesota United on Saturday.___AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sport"
    ]
}