{
    "articleURL": "/news/article-12048179/Pro-trans-activist-sends-San-Francisco-board-meeting-chaos-letting-scream.html",
    "content": [
        "Trans activist Lia McGeever was protesting over the death of Banko Brown, who was killed last week in the cityBrown, 24, was found with gun shot wounds following an altercation at a Walgreens store McGeever erupted into a loud scream during a city meeting on TuesdayA San Francisco Board of Supervisors meeting was thrown into chaos after a pro-trans activist began screaming in protest over the death of a transgender 'thief'.",
        "Banko Brown, 24, was killed last month by a security guard after allegedly trying to steal from a local Walgreens store. Brown was found with gunshot wounds and taken to a nearby hospital where he later died following the incident.  At a meeting of the city's board of supervisors on Tuesday, protestors held up signs reading 'Justice for Banko Brown'.A video clip taken of the public comment section of the meeting shows one woman, who identifies herself as Lia McGeever, approach the podium with a facemask on before taking it off to let out a blood-curdling scream. ",
        "At the podium, she said: 'I hate a lot of people on this board for the reasons that led up to Banko Brown's death. 'There's a lot of performative people on this board who will say one thing and support black people, homeless people, trans people, and then immediately stab you in the face — being racist, transphobic, anti-homeless.'I don't have any words prepared today. I just want you to feel our pain. 'So, I am going to spend the next minute screaming cause that is what is going on in here.'That is what the trans genocide in this country, in this city, has brought me to.'McGeever then takes off her face mask and launches a blood curdling scream directly into the microphone.",
        "Protestors situated behind her nod their heads in agreement with her actions as she stops and says: 'Imagine that.'Then she launches into a tirade against the board and its members, saying: 'I hate this, I hate what you've done to us. I hate what you're doing to us. I hate you, Board of Supervisors.'",
        "McGeever then starts shouting obscenities' before branding the board 'cowards'.Her outburst follows in the wake of the San Francisco District Attorney announcing that they would not be prosecuting Michael-Earl Wayne Anthony, the armed guard allegedly responsible for Brown's death at the store. Brooke Jenkins, the DA, said: 'After careful review of all of the evidence gathered by the San Francisco Police Department in this case, my office will not be pursuing murder charges, at this time, in connection to the shooting,' she said in a statement.'We reviewed witness statements, statements from the suspect, and video footage of the incident and it does not meet the People's burden to be able to prove beyond a reasonable doubt to a jury that the suspect is guilty of a crime.'The evidence clearly shows that the suspect believed he was in mortal danger and acted in self-defense.'",
        "Police said last week that a theft had occurred during the incident that resulted in his death. ",
        "Earlier this week, a group of community activists gathered outside the Walgreens in downtown San Francisco for a vigil to honor Brown's memory.In November of last year, San Francisco Mayor London Breed announced the launch of a new guaranteed income program for the city's transgender community.The Guaranteed Income for Trans People (GIFT) Program will provide low-income transgender residents with $1,200 each month, up to 18 months to help address financial insecurity within the community."
    ]
}