{
    "articleURL": "/news/article-12056105/12-killed-multi-vehicle-crash-Turkeys-Hatay-province.html",
    "content": [
        "The truck was said to be excavating rubble from a devastated part of TurkeyHatay is still reeling from deadly earthquakes which killed thousands in FebruaryA horror pile-up in Turkey has left at least 12 dead and 31 injured after a truck crossed onto the wrong side of the road on a highway in Hatay, southern Turkey.",
        "Anadolu news agency reported that the truck had crossed into opposite lanes after the driver lost control late Saturday and collided with nine cars and two minibuses. Many of the vehicles were parked by the roadside near a gas station as friends and relatives said goodbye to men leaving to carry out mandatory military service. The Demiroren news agency said the truck was carrying rubble excavated from the earthquakes which killed more than 50,000 people in Turkey in February. Hatay was one of the worst hit regions.",
        "NTV reported that the truck had collided with a town truck around Topboğazi, southeast of Iskenderun.Health Minister Fahrettin Koca said that fires then broke out on the Iskenderun-Antakya highway.The minister tweeted that 22 ambulances and three medical rescue teams were sent to the scene.The injured were taken to hospitals in the area. Three were said to be in critical condition. 'May God have mercy on our citizens who lost their lives, I express my condolences to their relatives,' he tweeted. 'We will do our best to ensure that the injured regain their health as soon as possible.'Demiroren also reported that the truck hit another truck before crossing the highway at around 7 p.m. local time (1600 GMT).Witness Ali Sarrac said that some of those killed had burned to death, Anadolu reported. ",
        "Images showed burning vehicles as emergency teams tried to keep people away from the blaze.Firefighters were pictured extinguishing the truck and a minibus that caught fire after the collision. The identity of the driver has not yet been published. ",
        "Hatay was one of the worst hit of the 11 Turkish provinces affected by an earthquake on 6 February that devastated parts of Turkey and Syria. At least 50,783 died in Turkey, according to the government."
    ]
}