{
    "articleURL": "/wires/pa/article-12059871/Mat-Sadler-believes-ready-Walsall-job-permanent-basis.html",
    "content": [
        "Interim Walsall boss Mat Sadler believes he is ready for the job full-time after the Saddlers handed him his first win in management with a final-day 2-1 victory over Doncaster.",
        "Goals from Conor Wilkinson and Isaac Hutchinson earned Sadler his maiden triumph at the third attempt after last month’s sacking of Michael Flynn.Sadler has been a coach at the club for the past four years under four different managers and confirmed he was interested in succeeding the Welshman.“There’s a lot of conversations going on in the next week – for me it was just important that we won and finished the season well,” the 38-year-old said.“But the club has to get this next appointment really right, they are going to be doing a lot of due diligence, a lot of hard work over the next five to seven days in getting the right person in charge.“The owners are desperate for success and they are not going anywhere until they’ve got it.",
        "“That’s what is most important for me. I think I’ll have a conversation about it. I’ve thoroughly enjoyed the last two to three weeks, I’ve enjoyed every aspect of it.“I know football and I enjoy working with people and I think they are the two biggest things that football management is all about. No qualms on that.”Victory over Doncaster ended a nine-game winless run and meant Walsall finished 16th in League Two.“In the first 20 minutes we could have scored two or three goals and that wouldn’t have flattered us at all,” Sadler added.",
        "“The players have been absolutely fantastic for me, through every minute of the last 270 minutes’ worth of football, and I’m delighted we got that win today which was thoroughly deserved.”Doncaster, meanwhile, finished 18th after an 11th defeat in 16 matches, despite Bobby Faulkner’s half-volley pulling one back late on.But keeper Louis Jones had kept them in the game with several fine stops and boss Danny Schofield said: “There was not a great deal in the game and certain moments went Walsall’s way today.“Finishing 18th is really disappointing. We want to finish up as high as possible. The aim is always play-offs and it’s not materialised.“We were in and around that up until the end of February and really fell off it in March and April which is not good enough.“We need to make sure we reflect and have discussions with everyone at the club and see where we go taking the club forward.“It is an accumulation of things. We’ve been competitive in a lot of the games and moments and haven’t gone for us. You lose a bit of confidence. In certain moments in games, we have fell short collectively.”"
    ]
}