{
    "articleURL": "/femail/relationships/article-12044169/Sydney-parents-earning-income-200k-year-say-buying-home-reach.html",
    "content": [
        "Couple say buying a home is 'out of reach' They earn $195,000 per year collectivelyThey have $30,000 debt and three disabled kids A desperate mum has revealed she cannot afford to buy a house despite her and her husband's combined income of $195,000 a year. ",
        "Despite her above-average earnings, the anonymous mother-of-five said entering the property market felt 'out of reach'. 'We have been trying to improve our position for years, but it still feels so out of reach... we also have two teens. I just don't know how we are meant to do this anymore,' she complained. The 38-year-old explained she has three children with disabilities that require doctor's appointments and specialised service that 'eat into their hard earned income'.She said she and her 40-year-old husband earn $195,000 annually before tax and are saving, but are also paying off $30,000 in debts and a car on contract for four more years.'Does anyone else fell like home ownership is just well beyond reach?' the Sydney woman asked in a post in a popular budget-focused Facebook group.But she didn't get the help she sought. ",
        "Instead people told her she should have 'more than enough' money to by a house with her high income. 'Cry me a river, you earn $200k and can't get your budget in line for a house deposit. You need to seriously reevaluate your lifestyle,' one member quipped. 'Perhaps instead of buying flash cars and lifestyle you need to work out your priorities. If you want a house live on a budget and save. Until your attitude changes you'll keep getting the same result,' a second wrote. ",
        "'God I wish I had your problem. I'm on a quarter of that as a single mum, no child support and saving for a house. Maybe live on one wage and save the other. Remember it's not what you earn that matters is what you spend. And you guys obviously spend a whole lot,' a third replied. ",
        "'I earn roughly a quarter of what she gets, I find it hard to feel sorry for someone struggling on a wage like that,' another said. Many suggested the family move out of Sydney to a more affordable regional town but the mum explained why that wasn't an option. 'Disability support is not great in regional areas. It would negate the benefits when we would need to travel for specialised services,' she said.  'We have a couple of rare cases in our home. Fortunately, we have found a school that (my daughter) is actually doing well in, that in itself is not worth risking for us.'However the criticism kept coming until the mum was forced to hit back at the 'judgemental' commenters. 'Yes it is a great wage, that's why I was so disappointed that we were again told that we didn't meet the criteria for a loan. We don't live beyond our means, we are recovering from having to have stupid loans when our children were small,' she explained. ",
        "She said the family accumulated debts when they had previously been living on one minimum wage income and have an 'extra needs teen' who needs frequent doctor's visits that 'take a large amount of our hard earned income'. 'We don't take lots of fancy holidays... we prioritised having a reliable vehicle. It needs particular safety features, it's not a \"luxury car\" but it's not an older model either. 'The lending criteria has gotten tighter, our wages were not the problem, the remaining debt is, they didn't even look at our spending.'The mum said they are not looking for a new flash home but one she can house her children in as they won't be able to afford to pay their own rent in Sydney as adults. 'We might have some splurges, sports for ourselves and our kids, specialists we see privately because the public system doesn't cover it, a couple of streaming services,' she said.'We shouldn't have to give up everything and considering what is in my splurge budget, it's not exactly going overboard.' A worrying number of young Australians have given up on ever owning their home, a new survey has found. A Resolve Political Monitor poll published on Monday showed 54 per cent of respondents on middle incomes and 63 per cent in the low income bracket think they will never be able to afford their own home.",
        "National house and unit prices together in March rose by 0.6 per cent to $704,723, CoreLogic data showed.Sydney's median house prices last month rose by 1.5 per cent to $1,230,581 as Melbourne's equivalent value edged up by 0.6 per cent to $898,644.Housing in all five of Australia's major cities has been considered 'severely unaffordable' since the turn of the century, according to the 2023 Demographia International Housing Affordability Scheme.",
        "Ten straight interest rate rises from May 2022 to March 2023 have already made home ownership more difficult, and this was compounded by property prices rising last month for the first time in 10 months.Since 2005, the median house price in Sydney and Melbourne has increased by 3.5 times the inflation rate and 2.5 times the increase in average weekly earnings.Jim Reed, director of Resolve, said high house prices and rents meant younger people were being discouraged from entering the real estate market.'Many young people have simply given up on the dream of owning a home, at least in their early careers, and some are even telling me that they are giving up on having a family because they can't afford to look after themselves, let alone more mouths,' he said.Mr Yardney maintained hope residents would still be able to afford a home, as long as they worked hard to save.",
        "'There is nothing new about this,' he said.",
        "Work out your deposit size and price rangeDo some research on where you want to buy, what sort of property you're interested in, and be realistic about how much you can afford to pay in monthly home loan repayments.This will help you determine your deposit size and give you a realistic saving target.Create a budgetAs a general guide (and depending on your lifestyle needs), you should allocate around 50 per cent of your income on living expenses (such as rent, transport, insurance and utilities), 25 per cent of your income on entertainment (such as dining out, movies and concerts) and roughly 25 per cent should go towards your savings.Around 15 per cent of the amount you're saving should go directly towards your deposit fund.Find more ways to cut back on spendingFind a roommate, move to a cheaper suburb or consider downsizing to a smaller or older place. If you're currently paying $300 per week in an inner-city location, consider moving to an outer suburb location where you might pay just $200 per week.A $100 weekly saving may not seem like much, but this could add over $5,000 to your savings account each year, which could fast-track your way into the real estate market.Look for a higher interest savings accountOpen a high interest account that is dedicated to your deposit savings. You can separate your deposit funds from your other accounts and keep track of how much interest you're earning each month.When it comes to applying for a home loan, making regular deposits into a high interest savings account will demonstrate to the lender that you have good financial discipline.Source: Finder",
        "'I remember after property prices increased from the late 1980s that parents said their children will never be able to afford a house, and look what's happened since.'Economist Saul Eslake, who has long been a critic of Australia's housing policy, said the situation has become so bad it is undermining the living standards of coming generations.'I don't understand why younger people today aren't out on the streets, protesting against their parents and their grandparents for what they've done to the cost of housing in this country,' he said.An Australian on an average salary wanting a house is now almost locked out of the inner cities or towns near the beach unless they are prepared to live in a flood zone.Financial comparison Canstar calculated someone on an average, full-time salary of $94,000, would only be able to borrow $436,000.If the prospective homebuyer was able to raise a 20 per cent deposit of $109,000, they would therefore only be able to buy a house or unit worth $545,000.That is less than half Sydney's median house price of $1,217,308, even after a fall of 14.7 per cent in the year to February, CoreLogic data showed."
    ]
}