{
    "articleURL": "/tvshowbiz/article-12045437/Ciara-joins-stars-27th-annual-ACE-Awards-New-York-City.html",
    "content": [
        "Ciara showed off her impeccable sense of style as she joined stars at the 27th annual ACE Awards in New York City on Wednesday night.",
        "The singer-turned-entrepreneur, 37, modeled an oversized black blazer that hung off her gym-honed figure.She teamed her outerwear with matching wide-legged pants and a black knit sweatshirt from her clothing brand LITA by Ciara.Her hair was worn sleek and straight and she let her natural beauty shine by opting for a soft glam look.Ciara was honored with the 'sustainability' award for the fashion retailer she co-founded with her NFL star husband Russell Wilson and businesswoman Christine Day.",
        "The House of LR&amp;C - which stands for 'Love, Respect and Care - aims to 'democratize retail and redefine the way the fashion industry works' by creating ethical brands that are inclusive.They do so by working with partners who are 'socially and environmentally responsible' and using materials that are 'consciously crafted.''Transportation choices' are also taken into account in the hopes of one day 'using only clean energy to transport and distribute our products.'Another big commitment is reducing overall waste by using as 'little packaging as possible.'The retailer carries Ciara's clothing line LITA by Ciara, Russell's menswear line Good Man Brand, as well as the gender neutral streetwear line HUMAN NATION.The House of LR&amp;C was launched in 2020 and its first brick and mortar store opened in Denver, Colorado last year.After accepting the award, Ciara returned to the red carpet to show off her trophy. ",
        "She posed up with businessman and investor Millard Drexler, who looked dapper in a pinstripe suit.The annual bash is thrown by the Accessories Council and honors those who have made a significant contribution to the accessories industry.",
        "'Brand of the Year' went to Wolverine in honor of the footwear line's 140th Anniversary.Dancing With The Stars alum Julianne Hough was named this year's 'Style Ambassador.' Steve Madden and Judith Leiber Couture were among the brands to sponsor the event.The very first ACE Awards were held in 1997. "
    ]
}