{
    "articleURL": "/sport/formulaone/article-12044809/Australian-F1-star-Daniel-Ricciardo-gives-fans-scenes-look-preparations-Met-Gala.html",
    "content": [
        "Ricciardo does behind-the-scenes Met Gala videoF1 superstar says he was out of his comfort zoneAussie made sure custom suit had space for hip flaskAussie F1 star Daniel Ricciardo made a surprise appearance at the Met Gala red carpet on Tuesday - and now he's giving fans a behind-the-scenes look at his preparations for the iconic event.",
        "The 33-year-old reserve driver for Red Bull rubbed shoulders with celebrities on fashion's most famous red carpet, which was celebrating iconic designer Karl Lagerfeld.Ricciardo sent social media wild with his unexpected appearance at the glamourous event, arriving alone in a stylish Thom Browne three-piece tuxedo and flashing his signature grin.Iconic fashion magazine Vogue put together a video of the eight-time race winner suiting up, where he revealed he was surprisingly nervous about attending.'You know that expression, \"It ain't my first rodeo?\" Ricciardo asks in the clip.",
        "'It actually is my first rodeo.''It's funny, because I feel I should get more nervous before a race,' he said. '[But] this certainly feels like I'm stepping out of my comfort zone.'Thom Browne’s Jonathon Zadrzynski was on hand to help Ricciardo get dressed, and told the Aussie that Browne himself was looking forward to him stepping out in his look.'He (Thom Browne) is really excited about the classic but comfortable look you bring to your style,' Zadrzynski told Ricciardo.Ricciardo explains in the clip that it was important for the suit to have a pocket for him to carry a hip flask.'When we were going through the jacket, I was like \"does it have a place for my hip flask?'\" he smiled.",
        "The Aussie was then off to the event, navigating fans and photographers skillfully.Afterwards while on the red carpet eagle-eyed fans spotted Ricciardo taking a quick glance at Hollywood A-lister Anne Hathaway as he awaited his picture.",
        "Yet Hathaway was also starstruck as the pair shared a brief exchange before parting ways.'It's nice to meet you,' she said to Ricciardo. 'Wow, I'm a huge F1 fan.'Ricciardo's appearance at Met Gala came as a shock to many after he said the event was too 'formal' for him in a podcast after fellow driver Lewis Hamilton was invited to the exclusive bash in 2021.'After seeing some of the images, not really. Look, I mean, the way some of the fashion is now, I think you probably could get away with that,' he said.'Don't get me wrong, I'm sure it would be an experience, but I don't know. It seems a little formal for me.'The Aussie joined fellow Down Under stars Nicole Kidman, Baz Luhrmann, Hugh Jackman and Margot Robbie."
    ]
}