{
    "articleURL": "/wires/aap/article-12039891/Rodwells-return-steels-Sydney-Wanderers-encounter.html",
    "content": [
        "Jack Rodwell is bullish in his belief that Sydney FC are hitting form when it matters as they aim to upset the Western Sydney Wanderers in the first-ever A-League Men finals meeting between the two sides.",
        "Sydney travel to Parramatta's CommBank Stadium on Saturday to take on the Wanderers, who thumped them 4-0 in their last meeting, in a winner-takes-all elimination final.Since that loss, the Sky Blues are undefeated in their last five and crucially for Sydney boss Steve Corica everybody is fit for the first time this year.Rodwell's campaign has been hampered by a groin issue but the centre back, who only missed Sydney's final-round win over Newcastle with a concussion, feels he's back to his best.\"We've picked up a little bit of form over the last couple of games and once we knew we couldn't finish top or come second, our aim was to make the finals,\" the English defender, and former Wanderer, told AAP.\"There was never really a consistent four or five weeks where the full squad was fit and the manager could actually play a formation and the personnel he wants.\"It's actually nice to have a full squad and everyone's fighting for position and I do think we are starting to peak at the right time.\"The fact that we've not had our best season, we all know that we can still come out of it with the biggest sort of achievement (with a grand final).\"Injuries have been a theme of Sydney's season but with Adam Le Fondre (hamstring) scoring four in his last four games, the Sky Blues will sense they can exploit the Wanderers.",
        "At the back, too, with Rodwell and skipper Alex Wilkinson fit, Sydney have begun to iron out the defensive deficiencies which impacted their ability to finish higher up the table.\"You've got to know how to work alongside each other,\" Rodwell said.\"The only way you can do that is being on the pitch and getting through moments together.\"Excluding the Wanderers game it's been pretty solid.\""
    ]
}