{
    "articleURL": "/news/article-12054795/MAIL-SUNDAY-COMMENT-heeded-republican-wails-ditch-monarchy-afternoon.html",
    "content": [
        "After the momentous events of yesterday, a ceremony that most had never before seen and which many will not see again, the people of this country (and elsewhere in the world) will be feeling many different emotions.",
        "Some will still be astonished and overwhelmed by Royal majesty on full display, a sight rarely seen in modern times, and full of occasions for thought. Some will have been moved by the new King's obvious desire to assert his humility, and his absolute refusal to treat the Crown as a badge of power or status. Some will have been swept up by the sheer history, the ten centuries of growing freedom, flourishing law and unique national independence behind the shield of the sea, so brilliantly symbolised by every aspect of the occasion.Others, in a chilly, unimaginative, secular world stripped of glory, will have been amazed by the unashamedly religious aspects of the event, the anointing of God's servant on Earth, dating back to King Solomon and Zadok the Priest, and brought to these islands by our Anglo-Saxon forebears before Westminster Abbey even existed.",
        "Millions must just have thought how very lucky we are as a country and as a people to have such a beautiful and joyous ritual at the very heart of our constitution.Blazing with scarlet uniforms, glittering with burnished breastplates, flashing with jewels, heralded by trumpets, illuminated by beautiful and moving music and contained amid the ancient arches of one of the loveliest buildings in the world, who could not at least enjoy some of it?",
        "Those who claim to yearn for a republic seem to have little imagination, and must surely be dull of soul. What would we gain by choosing this form of government, itself so characterless that such varied countries as North Korea, China, Iran, Russia, the United States and France all say they are republics?There are dozens of them. What good things does this give them in common? What does it give them at all? By contrast, a tiny few nations on the planet have adopted our system of constitutional monarchy, and they all have vital, central things in common – most especially liberty under the law.In fact, a republic is not a thing, but an absence. Look at our great neighbour and eternal rival France.The French guillotined their King 230 years ago and are still not reconciled to it, having since made several attempts to restore the throne.As recently as 1958 they chose as their president Charles de Gaulle, who ruled his country much as an 18th Century monarch would have done.Much of France, despite its official worship of equality, still envies our monarchy. President Emmanuel Macron has eloquently expressed the yearning that republics often have for monarchy.",
        "In a 2015 interview he said: 'Democracy is always incomplete in a way. It is not self-sufficient. In French politics, what's missing is the figure of the King, whose death I think the French people fundamentally did not want.",
        "'The Terror created an emotional, imaginary and collective void: the King was no longer there.'He complained that French democracy simply did not fill that void and left 'an empty seat at the heart of political life'. With four republics dissolved already and the fifth beginning to look rather frayed, there is obviously something missing.What is this missing mystery? It is the embodiment of the soul of a nation in a living, breathing person, entirely dedicated to its service. The late Queen showed that this task, though hard, was perfectly achievable through normal human virtues. King Charles has this example ever before him and plainly hopes to emulate it, now borne up by the prayers and good wishes of his people.Politicians cannot do this, not least because they so strongly desire the offices they eventually win, and have had to cut, thrust, kick, gouge and punch their way to the seat of power, often aided by great quantities of donors' money.This does not encourage the noble virtues of patience, self-restraint, self-effacement, humility and reticence. Rather the opposite.The much-mocked system of inheritance does a better job. It is odd that some people who have themselves inherited from their parents, and hope to leave things to their children, so oppose this principle in such matters. ",
        "It is also striking that important talents and professions, such as music and medicine, are often inherited, especially if nurtured, so why should the talent of kingship not be the same?Some claim that monarchy is irrational in a modern world. Well, so what if it is? People are not wholly rational (at least, those who are have a rather chilly approach to life) but they are sensible.And monarchy, if it is not strictly rational, is certainly sensible. This is no bad thing.The internet is rational. Shakespeare is not. The tax system is rational. Charity is not. Motorways are rational. Forests are not. Scarlet uniforms, trumpets, moving music – how lucky we are to have such a beautiful, joyous ritual Which of these things do we prefer? What sort of country would we have if we kept only the rational, and chopped down, demolished or trashed the irrational? Very old nations such as ours are made up of irrational – but sensible – ways of doing things. They have survived because they worked in practice.Meddlers and innovators who think they can tidy them up often fail badly and make things worse than they were before. Have we really benefited, for instance, by the creation of the new Supreme Court or by devolution? ",
        "Modern republics, by contrast, are neat and full of straight lines, which work in theory but not so well in practice.We could become a republic in an afternoon, and then spend (as have the French) centuries wondering why we made such a foolish mistake – and unable to put it right, as such things, once broken, cannot easily be repaired.",
        "Or we could be like the Americans, throwing off the supposedly wicked reign of bumbling George III, and then finding themselves under the mighty rule of men such as Richard Nixon, George W. Bush or Donald Trump, all of whom had real power where our monarch has none, and who were worse menaces to law and freedom at home – or sometimes to peace abroad – than any Hanoverian King ever was.Their democratic mandates, as usual secured through the spending of vast sums of money, did not prevent them from doing bad things. On the contrary, those direct mandates made them harder to oppose than, say, a British Prime Minister would have been.As for the republicans' weakest argument, the supposed cost of monarchy, there is no rule that states that republics are automatically cheaper. Air Force One cost more than £3 billion to build and something like £100,000 an hour to run. ",
        "One (male) French president spent £80,000 a year on make-up artists. The Elysee Palace in Paris costs more than three times as much as Buckingham Palace to run each year. The 2012 London Olympics, a spectacle comparable in power to the £100 million Coronation, cost £9 billion.This is not a serious reason for getting rid of an institution that has served us well and which promises to continue to do so. God save the King, and may he defend our laws and liberties in these uncertain times, and may his heirs and successors do so for centuries to come."
    ]
}