{
    "articleURL": "/news/article-12049965/SNP-plans-abolish-trial-jury-rape-cases-fall-disarray.html",
    "content": [
        "Lawyers say the proposals would breach an accused’s right to a fair trial Plans for juryless rape trials are in disarray after lawyers in Scotland’s two biggest cities vowed to boycott the scheme. ",
        "Lawyers say Scottish Government proposals for a pilot scheme for judge-only trials would breach an accused’s right to a fair trial. Now the bar associations in Glasgow and Edinburgh have said they will not take part, which could scupper the initiative entirely. The proposed move was contained in SNP legislation published last week, which also paves the way for the abolition of the not proven verdict. The Glasgow Bar Association said the result of a recent survey of members was ‘overwhelmingly in favour of boycotting the single-judge pilot court’. ",
        "It said it was now looking at whether a ‘national position and strategy can be agreed’. The Edinburgh Bar Association also voted to boycott the pilot. It added: ‘Trial by jury is a cornerstone of our justice system.’ Several other bar associations have said they will be boycotting the scheme or balloting members about participation. William McIntyre, a solicitor and crime writer, said: ‘I don’t know of any member firm of Falkirk and District Faculty of Solicitors that would be prepared to act in a juryless rape trial. I would go as far as to say the same for the Stirling and Alloa Faculties.’ There around 530 members in total for Glasgow and Edinburgh Bar Associations. It is understood that after the pilot, the Scottish Government will give judges a ‘report card’ and review the trials. ",
        "Success or failure will be measured by the number of convictions, bringing judicial independence into question and meaning those found guilty could appeal on the grounds their trial was not free of influence. Thomas Ross, KC, a critic of the plans, said: ‘The judiciary must have guarantees against outside pressures but the pilot scheme proposes the exact opposite.’Scottish Tory justice spokesman Jamie Greene said: ‘The SNP Government must fully engage with victims and the legal profession if they want to introduce long-lasting, beneficial judicial reforms.’ Justice Secretary Angela Constance said: ‘We have worked closely with the legal sector and will continue to do so during the development and evaluation of the pilot.’ "
    ]
}