{
    "articleURL": "/news/article-12054831/Louisiana-cop-fired-drunkenly-crashing-man-blaming-victim.html",
    "content": [
        "Franklinton Police Officer, Leonard Holloway, crashed into Seth Klaare, 23, Folsom, on April 8 on Highway 1078The crash critically injured Klaare, who went into a coma for two weeks, and he was cited as the cause of the accident Surveillance footage showed otherwise and the case was re-evaluated, leading to Holloway's termination and to be charged with a DUI",
        "A Louisiana police officer was fired after surveillance footage showed he drunkenly crashed into a young man's truck and then blamed the badly-injured victim for the accident. ",
        "Franklinton Police Officer, Leonard Holloway, crashed into Seth Klaare, 23, Folsom, on April 8 on Highway 1078, leaving the young mechanic in a coma for two weeks.Holloway was off-duty and with his wife at the time.  Klaare, who was critically injured, was originally cited in the Louisiana State Police's report as the cause of the accident, having illegally crossed into the middle lane. But when Klaare's father Joost Klaare received the crash report, he was shocked to see his son had been cited as the cause. After hearing that there were empty beer cans on the scene, he sought the only convenience store near the highway and asked the store owner if she knew anything. The surveillance footage showed Joost a different story than the one on the LSP report, it showed Holloway's truck crossing into the left and slamming into his son's vehicle head-on. 'Once I saw the video, I knew that the conclusion from the initial police report was not correct,' he told Fox 8. 'If [Seth] would have recovered and not had a memory of this accident, he would always believe that he caused a horrible accident.' ",
        "The video caused LSP to re-evaluate their report and to request Holloway’s medical records, which showed he had 0.094% BAC at the time of the incident. ",
        "Louisiana has a drink drive limit of 0.08% blood alcohol content - meaning Holloway should not have been behind the wheel.The initial report mentioned that Holloway's voice was slurred and a sour odor was coming from the car, but did not mention that the cop, who was with his wife, was drunk. The second report noted the beer cans, a Miller Light box, and a wine bottle scattered around the car. ",
        "An internal investigation has since been launched into the officer that first filed the report, a source close to the investigation told Fox 8. LSP declined the comment to the outlet. Holloway's termination was approved last week, according to Fox 8. He has been charged with a DUI and vehicular negligent injury. He is currently out on bond. Klaare has since woken up from his coma and is now breathing on his own and is on it in rehab.  "
    ]
}