{
    "articleURL": "/femail/article-12044287/Australian-shoppers-shocked-100-dress-Target-not-budget-Sarah-Strozkiy-shares-reel.html",
    "content": [
        "Sarah Strozkiy got $100 Target dress Shoppers shocked at the expensive priceShoppers have been left shocked after after discovering Target is selling a dress for $100.",
        "The budget retailer is flogging its Preview Broderie Midi for the price, a huge mark up from its usual bargain buys.Sarah Strozkiy is among those who picked up the look and has shared her shock at the hefty price tag, despite praising the look for being well-made.'I won't lie. I was super shocked to see a $100 dress in Target,' she said.'I know their quality has become so much better and OMG their designs are chic AF. ",
        "'But as an OG Target fan girl I still get shocked by their new prices.'I've been running my page for years and those that have followed me for a long time know I love a juicy fashion bargain steal. So this transformation amazes me.'In an Instagram clip trying the dress on, the Australian influencer praised it for being well made.But many fans were shocked at the price, saying they could get a better quality dress for that price elsewhere.'Do we think Target is shifting their branding?' she added.'I wonder in a few years if they will become the next high vibe products on the market. Which is so weird to think back in the day when Target clothes were so crappy and $10. Who else is an original Target lover?'",
        "Many of her fans said the price wasn't worth it. 'Absolutely noticed a MASSIVE jump in price. I love their things but I absolutely do not think it's worth it,' one person said. 'Um, absolutely not! $100. Target, stay in your lane,' added another.'If I had to spend $100 on a dress. I would rather go to some other store (even if the quality is A class),' commented one. 'I used to always buy clothes from Target but the prices have escalated so much,' wrote a fourth.",
        "'I haven't been impressed with Target clothes for a long time. I think they risk alienating shoppers with prices like these. Not a fan,' said another. A Target spokesperson said the brand is 'committed to offering customers quality products for every need and budget'.'Within our womenswear range in particular, we offer a wide variety of products starting at just $8 for a cotton T-shirt,' the spokesperson told news.com.au 'The price points of our dresses, including this dress from our Preview collection, range between $40 and $100.'We hope that across our extensive offering, all of our customers can find something to suit their individual needs.'"
    ]
}