{
    "articleURL": "/news/article-12046423/Married-headteacher-started-affair-pupils-mother-gave-12-bottles-wine.html",
    "content": [
        "Aled Rees was head of Ysgol Teilo Sant primary school in Llandeilo, South WalesHe had an affair with a pupil's mother for months and regularly left his duties A married head teacher started a secret affair with a pupil's mother after she gave him 12 bottles of wine as an end-of-term gift, a hearing was told.",
        "Aled Rees, who has left his position at Ysgol Teilo Sant primary school in Llandeilo, South Wales, insisted he would regret his actions for the rest of his life.Rees, who previously wrote to parents warning against letting their children watch ITV's Love Island, admitted he missed school assemblies, shut himself in his office on personal calls and spent long periods chatting to the woman he was seeing at the school gates.The headteacher's absences were so frequent that the situation became 'laughable', according to one of his colleagues, as rumours grew about the affair. Rees told a fitness to practise hearing yesterday that the fling began after the mother gave him the case of wine as a thank you gift on behalf of parents and pupils at the school. ",
        "'I was not in a good place at the time. I was not thinking straight... It is not something I am proud of and I will regret it forever,' he told the professional standards panel from Education Workforce Council Wales.Rees said he was regularly texting the pupil's mother before it turned into a full-blown affair at the start of the autumn term in 2018.He said: 'What I did during the summer holidays was send her a message to say thank you for the bottles and from there a relationship developed. It became a habit of sending messages back and forth over the summer.",
        "'Going back to school in September the relationship developed further... until my wife became aware of the situation at the end of term and during the Christmas holidays.'Of course, the relationship then came to an end in the light of that.'Rees claimed from then on he was 'trying to repair' his private life and worried about his marriage, as well as the prospect of his children finding out, which placed an impact on his professional work.The committee was told Rees often left the school without arranging cover, claiming he was popping to the Co-op. He claimed he stayed in touch with the mother of a child referred to only as Pupil A after their affair was over as he was worried that it might become public knowledge.",
        "'I was eager for that not to happen, or at least be in a position to share information with our children rather than them hearing from someone else.'Although he agreed with his wife not to make contact with the mother, he carried on doing so using the school phone. He said he also began quitting the school during the day as a way to cope, without arranging any handover with staff.",
        "'I got into the habit of leaving the school because things were too much for me, he said. 'I wanted to escape. I wanted to leave. I was not coping with the situation well at all.",
        "'Leaving school was an opportunity to process and get things straight in my mind. Sometimes I would leave without planning to leave. I was not in a very good place.'I am not trying to make excuses because I am absolutely aware I was in that situation as a result of having an extra-marital affair. I am not trying to make excuses.'Asked about allegations that he spent long periods on personal phone calls during the working day, he admitted he began speaking to the woman he had an affair with on the school phone: 'The only way I felt I could contact the parent was using the school phone rather than my personal phone.'And he said he spoke to her for long periods at the school gate to make sure she was all right, despite ending the affair: 'In that way I could keep sight of the situation on a daily basis. If something had happened and if there was a change and so forth.'Pupil A and their mother were often late. I would make a point of waiting at the gate after 9am to welcome any children who were running late.'By then, any relationship had long since finished and I was dealing with the knock-on of that relationship and trying to make sure the two marriages and both households were returning to where they should be.'",
        "Year Six teacher Aled Prytherch told the hearing he estimated that Rees was absent from the school around 30 times between September and December 2019. Rumours had been rife about his affair, while the mother rang the school so often the office knew her number and worried staff began making a record of the head teacher's absences.Mr Prytherch said: 'It was quite unpleasant for me. I have known Learner A's mother for years. She was at my wedding.'",
        "The head was away so often 'it was laughable', but also a risk, he told the committee. Four staff eventually wrote a letter complaining to the school governors in December 2019 and an internal investigation was held the following summer.Asked about derogatory comment Rees is said to have made to a pregnant Year Five teacher - which Rees denies - Mr Pryterch said he was the uncle of that teacher, Elen Davies.She had claimed Rees told her, 'That's what you get for opening your legs,' or words to that effect, when she went to him to complain about her classroom being moved.Mr Prytherch said he regretted not complaining about that at the time. Instead that complaint had been made alongside complaints about Rees's absences.Miss Davies told the same hearing that she only complained later because she had felt nervous about doing it on her own at the time the alleged comment was made.",
        "Rees faces six allegations, five of which he accepts, which if found proven, would amount to unacceptable professional misconduct.He denies an allegation that in or around July 2018, in response to a pregnant colleague querying a decision he had made, he told her, 'That will teach you to open your legs' - 'Dyna ddysgu ti i agor dy goesau' - or words to that effect."
    ]
}