{
    "articleURL": "/columnists/article-12048557/A-tantalising-insight-Princesss-confidant-RICHARD-KAY.html",
    "content": [
        "Camilla will be the first Queen Consort to be anointed since 1937For all the latest Royal news, pictures and video click here When the former Mrs Camilla Parker Bowles says her devotions to God in Westminster Abbey tomorrow, she will be the first Queen Consort to be anointed since 1937.",
        "The last, of course, was Queen Elizabeth, the Queen Mother, whose lifelong influence over her grandson Charles will reach its apogee in a ceremony that draws heavily on artefacts — among them robes and chairs — from the crowning of his grandparents.This irony will not be lost on Queen Camilla. The former Lady Elizabeth Bowes-Lyon transformed the fortunes of the monarchy: first as a steadfast supporter to her stumbling, stammering husband King George VI during the dark days of World War II and then, through the long years of widowhood, to her daughter, Queen Elizabeth II.And in securing the House of Windsor, the Queen Mother’s own popularity soared, making her one of the most admired and respected members of the Royal Family. She was also one of only a handful of senior royals with whom Camilla maintained cordial relations at a time when she was not generally welcome in Windsor circles.Now, when the eyes of the world are on her, these parallels will be a source of comfort for a woman whose own hold on the affections of the British people has often been fragile.",
        "There was a stark reminder of that this week in Lord Ashcroft’s exhaustive poll for the Daily Mail into the popularity of the monarchy. While the headline numbers showed little appetite for republicanism, perhaps the most revealing aspect of its findings was the approval ratings of individual family members.",
        "Of the top three most popular members of the family, two are dead: the late Queen, still enormously respected and way ahead of the rest, and Princess Diana, whose tragic death was 26 years ago this summer. Prince William separated them at number two.It is the enduring appeal of Diana that is both remarkable and, for the Palace, concerning.No matter how many attempts were made at airbrushing the late Princess from history, especially in those years immediately after 1997 when Charles was trying to win hearts and minds for Camilla, the public affection towards his first wife remains stubbornly unyielding.As for Camilla, she at least remains above Prince Harry, Meghan and the disgraced Prince Andrew in the ratings, but she is bumping along below Prince Edward and Sophie, Duchess of Edinburgh.Does all this matter? After all, Prince Philip rarely reached the same level of public approval enjoyed by the Queen — and it didn’t worry him in the slightest.",
        "Camilla is a late arrival to royalty. The former Army officer’s wife was almost 58 when she married the then Prince of Wales. Her life up to that point had been one of a countrywoman in mud-spattered jeans and wellington boots. In an instant, she had to take on multiple responsibilities and assume an onerous round of official engagements, many of them in the public eye.",
        "Even her most vociferous critics could not deny that, in the 18 years since that Windsor wedding, she hasn’t put a foot wrong.Now, at the age of 75, her life is about to change again. Old friends who knew her as a cigarette-smoking fun-lover in her debutante days — a woman who never had a proper job — chuckle openly at a remarkable transformation.Many would say that a woman who can come back from the derision and scorn heaped upon her during the Charles and Diana years, when she was infamously stigmatised as the ‘third person’ in the royal marriage, will surely have nothing to fear from being anointed as Queen.It is, after all, a public affirmation of Charles’s love for her that he persuaded doubting courtiers she should, and must, be crowned at his side.Nevertheless, there will be moments when she alights from the Diamond State Coach at the Abbey’s Great West Door when the competing memory of Princess Diana will be all around her.It will be there, of course, in the presence of Diana’s sons and in the physical reminders of her former jewellery: if nothing else, Kate will be wearing the diamond and sapphire engagement ring that once adorned Diana’s hand.Unspoken, inevitably, will be the thought that had history not taken the turn it did, it would be Diana being crowned and making her vows in front of her sons, her grandchildren and the watching world.",
        "At 61, she would still be striking and graceful — beautiful, even, judging by the way her mother Frances Shand Kydd aged.She had, of course, ruled herself out of being Queen long before tragedy struck — even when politicians such as former Prime Minister Sir John Major were suggesting that the royal couple’s separation was no impediment to Diana one day taking her place at Charles’s side in the Abbey.Her own views were more modest. In her Panorama interview, she suggested that her ambition was no more than to be ‘queen of people’s hearts’.In all the years I knew Diana, she rarely spoke about being Queen, possibly because everyone else was always speculating about it.I asked her once if she dreamt about being crowned. ‘No,’ she told me, ‘but I have had nightmares about it.’ These bad dreams had a recurring image: it was the pivotal moment in the Coronation and the crown was being lowered onto her head. Instead of remaining there, it would slip down her face and come to a halt over her neck, before slowly tightening around her throat and choking her. It is an eerie and roubling image that could so easily have been a metaphor for the tragedy that lay ahead.",
        "At that point in the dream, she would wake up.On the few occasions Diana did talk about being Queen, it was either accompanied by gales of laughter at such a preposterous idea or a wistfulness at the prospect of what might have been: not least wearing what she called ‘all those Cinderella dresses’.She had attended a Coronation — the enthronement of the Emperor of Japan — and later shuddered as she allowed herself to think about one day taking part in a similarly sacred ritual.She would, though, have enjoyed the pageantry and the partying. Tonight, for example, I could picture her slipping into the discreet gathering in Mayfair’s members club Oswald’s, where crowned heads and foreign royals have been invited for what promises to be a very exclusive pre-Coronation dinner.Harry, of course, has painted himself as ‘my mother’s son’ — even if he shares none of her high-octane glamour. It is not difficult to imagine his thoughts as he watches the woman who usurped his mother in his father’s affections accept the acclamation of the Abbey and later, on the Buckingham Palace balcony, the cheers of crowds in the Mall.We know his views from his memoir. In interviews promoting Spare, he described his stepmother as a ‘villain’ and ‘dangerous’, who left ‘bodies in the street’ in her eagerness to change public perceptions of her. In the book itself, he describes her as the woman who ‘sacrificed’ him on ‘her personal PR altar’. She was, he wrote, both ‘the other woman’ and the ‘wicked stepmother’.",
        "William has been more circumspect, although according to Harry’s book, both he and his brother begged their father not to marry Camilla.Harry’s book also cast William as one of the villains. But he has also remained faithful to his late mother’s memory, including her in every step of his married and family life. William gave Princess Charlotte the middle name Diana, christened her at the same Norfolk church where his mother was baptised and chose a godparent from the Spencer family.Even Kate, who never knew her mother-in-law, has joined in, telling fans on a recent visit to Aberfan in South Wales how Diana is missed ‘every day’ and revealing how she has never resized that famous, flashing engagement ring to fit her own finger.Even if the Fates had dictated differently, it is still hard to know what kind of Queen Diana would have been — but of one thing we can surely be certain: she would have been popular.One of her old friends told me that Diana’s only aspiration as a future Queen was to campaign to end the scourge of child slavery, as she had against landmines. ‘As Queen, she knew she could make a difference,’ says the friend. Noble enough and hardly likely to destabilise Charles.In her quiet and unfussy way, the former Duchess of Cornwall has also been trying to make a difference. Camilla’s is a story of remarkable perseverance and tenacity. In many ways she is the polar opposite of her former rival: unglamorous, tough and steely, and rarely prone to introspection. Famously, it was that blend of ordinariness and earthiness, such a contrast to Diana, that entranced Charles.‘There is a vanity about her,’ cautions one of her circle. ‘But only so far. Getting her hair done every day is a real perk but she would stop short of having any “work” done because everyone would notice.’The journey from mistress to wife, comforter-in-chief and now Queen has been long and bumpy. But Camilla has rarely complained.‘It’s not easy,’ she said carefully in an interview with Vogue last year. ‘I was scrutinised for such a long time that you just have to find a way to live with it,’ adding, ‘I think in the end I sort of rise above it and get on with it.’ There is little room for regret or sentiment in such remarks. Nor, indeed, for revenge.At times, her very presence in Charles’s life was said to have imperilled the future of the throne. Now she is endorsed as its saviour for her calming influence, one that has allowed her husband to become the kind of King he wants to be: more relaxed, less cranky. Never has that old saying that time changes everything been more appropriate.Just over a year ago, the one remaining stumbling block to her Coronation disappeared when the late Queen Elizabeth bestowed her approval by expressing her ‘sincere wish’ that her son’s wife should be fully acknowledged as Queen when Charles acceded to the throne. Even Elizabeth II had been won over by the woman who once possessed only one smart dress in her wardrobe.So did Camilla ever dream of becoming Queen?‘Not once — and at almost 76, I think it’s fair to say the prospect was and remains terrifying,’ says one close figure. ‘She’ll make the best of it, but a chunk of her wishes it had never happened. She’s there because she loves him. That’s it.’Another friend who has known Camilla most of her adult life says: ‘She’ll support Charles, not upstage him, but the thought of starting what amounts to a new career in her mid-70s doesn’t thrill her. Remember, she had a reputation for laziness.’Diana used to pore over Camilla’s astrological chart, keen to see how the chips would fall. They never predicted that it would one day be the woman who replaced her receiving an Archbishop’s blessing, holy oil and a golden crown."
    ]
}