{
    "articleURL": "/femail/article-12051253/The-new-dishy-duke-Scottish-star-takes-steamy-role-new-Bridgerton-spin-off.html",
    "content": [
        "Queen Charlotte: A Bridgerton story is the blockbuster's prequel now on NetflixMust read: Fwends Reunited! Where are The Inbetweener stars now? He has already taken the stage by storm, being nominated for a top award for his role at the National Theatre. ",
        "But streaming fans will soon also become very familiar with Tunji Kasim, 36. The actor plays Duke Adolphus in the new series Queen Charlotte: A Bridgerton Story, now released on Netflix. A spin-off prequel to Bridgerton, the show focuses on the love story between Queen Charlotte - played by India Artemafio - and King George III (played by Corey Mylchreest). Adolphus is Charlotte's older brother, who has agreed to his sister's arranged marriage for the benefit of their German province. ",
        "But due to family circumstances, Adolphus is almost like Charlotte's father figure and only wants the best for her - he is torn to his duty to family and professional duties. And it seems actor Tunji's real life has been just as interesting. He was born in 1987 in Aberdeen, to a father - a Nigerian academic with a PHD in economics - and a Scottish primary school teacher mother.Tunji then spent the first decade-or-so of his life in Nigeria, before moving back to the North East at the age of 12. With his family being high-achievers, acting wasn't top of his list of planned careers and he was expected to become a engineer or doctor.But when he began taking part in high school drama classes, he impressed a teacher so much he was encouraged to consider it for a career.",
        "Hooked on the art, he then attended the Royal Scottish Academy in Glasgow (now the Royal Conservatoire of Scotland) and made his London stage debut in 2007, in Michael Attenborough’s production of Big White Fog at the Almeida Theatre. Following this, he then clinched roles in the TV series Almost Famous and Shetland, before playing Ned Nickerson – the handsome love interest – in CBS’s Nancy Drew.",
        "Tunji's big break came in 2019, when he played Julius Caesar in Anthony and Cleopatra in the National Theatre, for which he was nominated for an Ian Charleston award.It is this role however which will likely see him become a household name.Fans of Bridgerton will not be disappointed, for this show also includes  trademark romps, romance and silk gowns.Tunji recently told Tatler, 'Queen Charlotte reflects a real life couple in Harry and Megan. Especially Megan’s introduction to the royal family. 'We’ve all heard about how that’s gone down and their exit from it… what it was like for an outsider to come into this extremely established institution. 'Tunji has admitted that he struggled to pronounce the German province in which the show is set - Mecklenburg-Strelitz.And he has also revealed that he hasn't watched Bridgerton so that he can bring his own 'energy' to it. ",
        "But he is one of just a few - for Bridgerton broke its own record last year, as Season 2 became the most-watched English-language series on Netflix. This popularity, in part comes from its revolutionary ‘colour-conscious’ casting that portrays the regency period as widely diverse.   Tunji says that the colour blind casting did not mean ethnic tensions did not exist in that society.As for the plot, he describes the marriage of his younger sister Charlotte as one of convenience.But says he relates to this in real life, relaying that his own family share a sense of 'practicality over emotion'. As for Queen Charlotte herself, the character won her way into viewers' hearts in the first two series of the hit show.Now this show - set decades before the events of Bridgerton - follows her as she experiences her first throes of passion in Regency Britain. But what viewers of the show might not know is that the character of Queen Charlotte is based on a real 18th Century royal.Born in May 1744, Sophia Charlotte of Mecklenburg-Strelitz was the daughter of a German Duke and a Princess.",
        "According to the Royal Family's website, Princess Charlotte was selected to be George III's wife when he became King in 1760.As such, the 17-year-old German royal had to move away from everything she knew and start a new life in England with a man she hardly knew.",
        "When she arrived at her husband's court, historians have noted how the new Queen was seen as an outsider - a theme which is explored in the new Netflix series. But despite their arranged nuptials, Charlotte and George went on to have a exceptionally happy marriage.Over the course of their 57 year marriage, Queen Charlotte gave birth to 15 children across 22 years. Shortly after their wedding, George bought Queen's House for his wife to use - which is known today as Buckingham Palace and used as the Royal Family's main London residence. ",
        "Although the couple fell madly in love, their marriage wasn't entirely smooth-sailing - and the Queen had to deal with George's mental illness, which is documented in the Bridgerton series, where the King becomes a virtual recluse. King George III suffered his first bout of mental illness in 1765 - just five years into the couple's marriage. Historians believe his 'permanent madness' started around 1810 and he is reported to have become violent during his fits.Although Queen Charlotte remained his devoted companion, she is said to have never visited her husband alone as his condition worsened.In the final 10 years of his reign, the couple's son George IV acted as the Prince Regent.According to the Royal Family's website, some historians believe that George III's illness was caused by a hereditary physical disorder called porphyria - which can cause hallucinations and confusion.",
        "Since her death in 1818, historians have debated Charlotte's ethnicity - as paintings and descriptions of her suggested that she may have been biracial.Although it is impossible to know the late Queen's full heritage, the show's creator Shonda Rhimes told The Guardian: 'We took the idea that Queen Charlotte was from Black Portuguese royalty and ran with it.'Discussing how the royal inspired the character of Charlotte, Shonda added: 'She was outsized, very glamorous, held herself above everyone. There was a lot to mine.' "
    ]
}