{
    "articleURL": "/wires/reuters/article-12041783/Salzgitter-CEO-says-German-industry-needs-power-price-support.html",
    "content": [
        "FRANKFURT, May 3 (Reuters) - German industry still needs help with high electricity prices, the head of the country's second-largest steelmaker Salzgitter said on Wednesday, arguing that without support it would not be possible to finance a shift to clean technologies.",
        "Plans to be firmed up soon by the economy ministry to subsidise industrial power, possibly by around 50 euros ($55) per megawatt hour (MWh), for several years are controversial within the coalition government.Greens and some Social Democrats are supportive, while the Free Democrats want businesses to succeed without subsidies, citing fairness principles and budgetary constraints.European day-ahead wholesale power stood at 97 euros on Wednesday, having shot up to 548 euros in August, when the loss of Russian gas imports propelled gas and power prices to all-time highs.\"That (near 100 euros) price is still far too high to keep energy-intensive industry competitive in Germany long-term, which must be the goal,\" said Gunnar Groebler at a Handelsblatt conference on transforming industry to clean hydrogen from renewable energy.\"We have to be competitive in global markets and need an energy supply that enables us to do so,\" he added.Groebler said his company's plans for a hydrogen route for crude steel-making would benefit from price support, stressing it should apply only for an interim period.Any subsidy plans require the approval of the federal government and the European Union.Salzgitter expects to build up a 100 megawatt (MW)electrolysis plant by 2026 at its core site in Lower Saxony state, for which it needs regional renewable power.",
        "It is pursuing the transformation under the project name SALCOS for which it received 1 billion euros of combined German federal government and Lower Saxony state funding last month.Steel is responsible for 30% of Germany's industrial greenhouse emissions.($1 = 0.9060 euros) (Reporting by Vera Eckert, editing by Kirsten Donovan)"
    ]
}