{
    "articleURL": "/sport/football/article-12048479/Napoli-fans-party-streets-city-Serie-triumph.html",
    "content": [
        "Napoli managed to get the draw they needed against Udinese on ThursdayThat point sealed the club's first league title since 1990 with five games to spareTheir fans invaded the pitch after the game to celebrate with their heroes Napoli fans wasted no time in celebrating their side's Serie A triumph as they invaded the pitch following the 1-1 draw with Udinese on Thursday.",
        "Needing a point to win their first Scudetto in 33 years, Napoli battled back from a goal down, with Victor Osimhen's second-half equaliser wrapping up the title.As the final whistle blew, supporters raced onto the pitch to celebrate with their heroes, with Osimhen, manager Luciano Spalletti and Co mobbed.There were also amazing scenes at the Stadio Diego Armando Maradona back in Naples, which was sold-out with fans going to the ground to cheer on their side.Despite the game taking place miles away, there was still a stunning atmosphere at the stadium, with flares lighting up the venue. ",
        "Meanwhile, more fans took to the streets of Naples to celebrate their club's historic achievement.For many, it will be the first time they have seen their side win the league, as Napoli's last triumph was inspired by Diego Maradona back in 1989-90. Maradona also played a key role in Napoli's first Scudetto win in 1986-87.The UK's ambassador to Italy Ed Llewelleyn tweeted his congratulations to Napoli alongside a video of fireworks going off in the city, writing: 'Just sent to me by a friend in Naples after Napoli won the Serie A championship for the first time in 33 years. Congratulations, Napoli! I think it is fair to say that the celebrations have started...'",
        "After celebrating with their fans on the pitch in Udine, Napoli's players headed back to the changing room to toast their victory.There were more jubilant celebrations, with Osimhen wrapping a scarf around his head and singing songs with his team-mates.",
        "Winger Hirving Lozano was also seen standing on a table, as the players jumped up and down, highlighting the amazing team spirit that Spalletti has created at the club this season.Napoli have lost just three of their 33 league games to date, and have been the side to catch since the start of the season.Their fans expected them to win the title last Sunday, but a late Salernitana equaliser delayed their celebrations.They finally have their moment now, and it looks set to be a magical night in Naples, with players and fans likely to party into the early hours. "
    ]
}