{
    "articleURL": "/news/article-12059569/Terrifying-moment-amusement-ride-collapses-leaving-five-people-injured-festival-Mexico.html",
    "content": [
        "Three minors and two firemen were injured when a ride crashed on top of a platform at a festival in the northern Mexico border town of Nogales on SaturdayThe ride, the Power Rage, was spinning in the air while 15 people each were strapped to their chairs, when it suddenly stopped workingTwo firemen had climbed up a ladder to help the group to safety when the ride suddenly dropped, causing the firefighters to fall to the groundAt least five people - including a teen girl who stars for Mexico's U15 softball national team - were injured after an amusement park ride crashed at a fair ground in the northern state of Sonora.",
        "The shocking incident took place Saturday evening after revelers descended in the border town of Nogales to celebrate the 'Flowers Festival.'Footage filmed by a bystander captured the moment 15 attendees were trapped in their chairs midair after the Power Surge had malfunctioned and stopped spinning.Another video shows firefighters climbing up an engine ladder to rescue the group. ",
        "A short time later, the ride suddenly plummets into the platform while the firemen were thrown to the ground.Xiomara Félix, a member of the Mexico's U15 softball team that won gold at the Americas qualifier in Peru in April and qualified for the first women's U15 World Cup that will take place in Tokyo in October, was treated for head, chest and ear injuries at the Sonora Medical Center, Mexican news outlet Milenio reported.Félix's injuries were considered non-life threatening. Firefighter Ángel Carpio suffered several injuries and remained hospitalized as of Sunday, the Sonora Civil Service said in a statement Sunday.The other fireman, Gerardo Peralta, was diagnosed with a sprained ankle and was released from the hospital.",
        "Dr. Gabriel López, the head surgeon at the medical facility, told El Universal newspaper that two other minors were treated for minor neck sprain and lower back injuries, and were discharged.Operation of all of the rides at the fair ground have been suspended, the Sonora Civil Service said.",
        "'According to the organizers of the fair, the (ride's) computer crashed and the emergency devices to lower it did not work; for this reason they decided to release pressure from the main pistons to lower the equipment,' the agency said. 'This occurred when the firefighters had the truck ladder extended as they sought to reassure people. 'The rescuers were analyzing how they could carry out the rescue maneuver when the ride collapsed, hitting the ladder and injuring the (five) people.'"
    ]
}