{
    "articleURL": "/news/article-12044421/DAILY-MAIL-COMMENT-Rishi-Sunak-chance-alter-political-mood.html",
    "content": [
        "Local elections rarely make the heart beat faster. Many voters will go to the polls today with even less enthusiasm than normal (if at all) – a damning indictment of our underwhelming political class.",
        "But while giving people their say on vital issues such as bin collections, they are also an important gauge of the national mood.In the year since the last elections, the Tories have changed prime minister not once, but twice, and presided over a period of stomach-churning economic turbulence.Party chiefs are braced for a horrendous drubbing. But this paper asks people to look at the broader political landscape.Yes, the cost of living still bites, but Rishi Sunak has restored a sense of order and stability. His work ethic and his achievements – on the Northern Ireland Protocol, trade deals and determination to end the small-boats scandal – are notable.",
        "Meanwhile, with each passing day, Sir Keir Starmer reveals himself ever more unsuitable for high office. The Sue Gray saga further eroded his crumbling integrity.And have we ever seen a politician so frequently and brazenly break his pledges? The art of politics is to be flexible. But he’s taken that idea and put it on steroids.While the PM has wrestled with myriad problems, Sir Keir has struggled to come up with a single memorable policy or belief (other than that women can have penises).With a general election required by January 2025, these results can set the political weather. Tempting as it is to give the Tories an electoral kick in the pants, we urge voters to hold fire and give them a chance.",
        "Pathetic punishmentsWhen countless car thefts go unsolved, drug gangs roam the streets with impunity and Britons resort to DIY security amid fear of crime, isn’t it time to ask where things have gone wrong?One answer is that soft-touch justice has reached new heights of absurdity. Thousands of criminals are escaping prosecution by agreeing to therapy sessions or education classes – neither of which could be regarded as remotely punitive.This is not only an unforgivable insult to victims. Thugs who aren’t properly punished are emboldened to break the law.That these pathetic penalties were the brainchild of Labour’s David Lammy is no surprise. His party is notorious for treating criminals leniently. But that the hare-brained plan was adopted by Theresa May only undermines the Tories’ claim to be the champions of law and order.The reality is offenders are being coddled by a justice system that long gave up on any pretence of getting tough on crime.Our damaged jewel",
        "The Coronation will be one of the greatest spectacles of our age, attracting tourists in vast numbers not just for the weekend itself, but for months and years to come.Most are big spenders who like to buy designer goods, yet Jeremy Hunt’s refusal to reinstate duty-free shopping for foreign visitors means it will be less lucrative than it could be – a wasted opportunity.",
        "Many will opt to spend their dollars and yen in mainland Europe, where their money will go further. This will be a huge blow to UK retail, tourism and hospitality – and the Treasury, which will lose revenues.The Chancellor should ‘Scrap The Tourist Tax’. After all, VAT-free shopping was a jewel in Britain’s economic crown. As Britain’s biggest security operation swings into action, the Metropolitan Police warns it will have an ‘extremely low threshold’ for anybody disrupting the Coronation. Criminal activity camouflaged as protest will not be tolerated, say top brass. Good. But if Scotland Yard hadn’t treated road-blocking eco-idiots with kid gloves, troublemakers targeting the Royal event might have already got the message."
    ]
}