{
    "articleURL": "/news/article-12052935/Just-Stop-Oil-plotting-graffiti-attack-Mall-monument-Coronation-King-Charles.html",
    "content": [
        "Just Stop Oil are plotting an attack on a Mall monument during the coronation King Charles Coronation LIVE: Royals at Buckingham Palace as Kate dazzlesEco-zealots from Just Stop Oil are plotting a graffiti attack on a monument in The Mall during the Coronation of King Charles.",
        "Police have vowed hardline action against the hated eco mob, who are targeting memorials.Just Stop Oil hope their action today will be their crowning 'masterpiece', although police hope to stomp out any of their attempts.A former royal protection officer warned they could be shot if they disrupt the Coronation.  Simon Morgan, now director of operations at security firm Trojan Consultancy, said demonstrators need to be aware that they will be in the middle of an armed policing operation during Charles' Coronation this weekend.",
        "Mr Morgan said: 'It's an armed policing operation because of the threat that the UK faces, the threat that the royal family faces, dignitaries that are attending. So we have to be very careful.'Somebody that's going to run out in front of the carriage, fiddling with something in their rucksack, who's to say that's not an IED rather than a banner that's just going to be unfolded.'These demonstrators have to be very careful as to the environment that they're going into, the police are acutely aware of it.'On Friday the eco activists were blasted for causing cars to sit in a traffic jam with their engines running. An angry van driver blasted Just Stop Oil activists who disrupted rush hour traffic this morning with a slow march through north London. ",
        "The driver shouted: 'You're wasting everyone's f***ing time. How is this saving the environment? There's about one-hundred f***ing people sitting behind me with their engines running!'",
        "Activists in two groups set off from Gloucester Gate and St Pancras Way in Camden around 7.30am yesterday.JSO said around 33 activists were involved in today's protest which is the latest in a series which began on April 24. The group wants a commitment from government to end licensing and agreeing any new fossil fuel projects in the UK. The controversial group plans to continue their protests today and make a 'bigger scene'.'They are desperate to run on to The Mall and disrupt the procession with spray cans and leaflets,' a source told The Sun.They added: 'They are also planning something big around Westminster which will involve illegal activity.' A Met Police spokesman said: 'Our tolerance for disruption will be low. We will deal robustly with anyone intent on undermining this celebration.'Meanwhile, Met Commissioner Mark Rowley said: 'Sadly, there are individuals who see events like this as an opportunity to have their moment.'"
    ]
}