{
    "articleURL": "/wires/reuters/article-12040715/Max-Scherzer-set-return-Mets-Tigers-play-two.html",
    "content": [
        "Max Scherzer, who got himself into a sticky situation, returns to action on Wednesday in a place he used to call home.",
        "The New York Mets will play a split doubleheader in Detroit after the scheduled Tuesday game was postponed due to inclement weather.Scherzer will be making his first start since serving a 10-game, league-imposed suspension for violating rules regarding foreign substances on his pitching hand. He was ejected before the fourth inning of the Mets' game against the Los Angeles Dodgers on April 19.The veteran right-hander had been dealing with pain in his right scapula prior to the suspension, so he used the imposed layoff to improve his health.\"I feel like I got my back in the right spot,\" he said. \"It was an ailment, not an injury. I threw a lot of (batting practice), a lot of bullpens.\"Scherzer (2-1, 3.72 ERA) has started four games this season. Prior to pitching three scoreless innings against the Dodgers, he held San Diego to no runs and one hit in five innings on April 10.Scherzer saw his career blossom in Detroit, where he pitched from 2010-14 until signing with the Washington Nationals as a free agent. He returned to Detroit's Comerica Park in June 2019 and held the Tigers to one run while striking out 14 batters in eight innings.Overall, Scherzer has started 78 games at the Tigers' home park and posted a 47-13 record and a 3.28 ERA.",
        "\"The five years I was here are arguably the best five years in recent history for the Tigers, and to be a part of that run was awesome,\" he said. \"We had such great teams, great players. This is where I developed and came into my own here. It was a huge five years of my career.\"Scherzer is likely to start the nightcap while left-hander Joey Lucchesi (1-0, 2.19 ERA) gets the nod in the series opener.Lucchesi blanked the San Francisco Giants for seven innings in his season debut on April 21, racking up nine strikeouts in the process. He gave up three runs and five hits in 5 1/3 innings against Washington on Thursday.While the Mets have lost six of their past eight games, Detroit has lost four of its past five games and hasn't played since Sunday.Right-hander Michael Lorenzen (0-1, 7.07 ERA) is scheduled to start the second game for the Tigers. Lorenzen has started three games since signing with the Tigers as a free agent in the offseason. In his latest outing on April 26, he gave up five runs and seven hits in five innings at Milwaukee.Lorenzen has made 12 appearances against the Mets, including two starts, going 1-1 with a 2.73 ERA.",
        "Left-hander Joey Wentz (0-3, 6.45 ERA) will start the opener for Detroit. He gave up two runs and four hits in 5 2/3 innings against the Baltimore Orioles on Thursday in his latest outing.\"His stuff was pretty good and he was pretty efficient,\" Tigers manager A.J. Hinch said. \"I loved the way he commanded the at-bats for the most part.\"New York played a doubleheader on Monday, splitting with the visiting Atlanta Braves. The Tigers have already played two doubleheaders, sweeping the Cleveland Guardians on April 18 and splitting with the Orioles on Saturday.--Field Level Media"
    ]
}