{
    "articleURL": "/wires/reuters/article-12046167/Sterling-hits-11-month-high-vs-dollar-Fed-signals-rate-hike-pause.html",
    "content": [
        "By Samuel Indyk",
        "LONDON, May 4 (Reuters) - The British pound was steady against the dollar on Thursday having hit an 11-month high overnight after the Federal Reserve raised rates but signalled an end to its tightening cycle is in sight.The U.S. central bank raised its benchmark rate by a quarter point but dropped from its policy statement language that said it \"anticipates\" further rate increases would be needed, sending the dollar lower against other major currencies, including the pound.\"It (the pound) has capitalised on the weaker dollar in the wake of the dovish Fed decision,\" said George Vessey, foreign exchange and macro strategist at Convera.By 1000 GMT, sterling was little changed against the dollar at $1.2567, having hit its highest level since June last year at $1.2593 overnight.The pound was edging higher against the euro ahead of an expected rate increase from the European Central Bank on Thursday, with the size of the move still up for debate.Markets are fully pricing in a 25 basis point move, with around a 20% chance of a larger 50 basis point hike. Of 69 economists surveyed by Reuters, 57 expect a quarter-point move, with the other 12 forecasting a 50 basis point hike.The euro was last down 0.1% versus the pound at 87.94 pence.",
        "Meanwhile, a survey showed Britain's services sector had its fastest growth in a year in April, boosted by new orders, while prices charged by businesses picked up pace, adding pressure on the Bank of England to keep raising interest rates.The BoE is set to announce its policy decision in a week and is widely expected to raise rates by a quarter point, with markets pricing in further tightening in upcoming meetings.\"Our latest views are that the BoE may not push back against these expectations next week - which would see sterling hang onto recent gains,\" said Chris Turner, global head of markets and regional head of research for UK and CEE at ING.Eyes were also on local elections in Britain, viewed as one of the last big opportunities to gauge public support before a national election expected next year, and a chance to assess if the main opposition Labour Party can convert its run of double-digit poll leads into election victories.(Reporting by Samuel Indyk; Editing by Emelia Sithole-Matarise)"
    ]
}