{
    "articleURL": "/news/article-12050303/Are-dognapping-gangs-active-area.html",
    "content": [
        "Almost 4,000 dogs have been reported stolen in Greater London since 2010Figures show that pet owners have less than a 1 in 8 chance of being reunited  Since January 2010, almost 4,000 dogs have been reported stolen in the Greater London area with police managing to return the pets in one in eight cases. ",
        "Across the capital, the successful return rate ranges between five per cent in Brent and Sutton to 18 per cent in Richmond upon Thames. Of the 3,921 dogs taken, 478 have been returned, leaving some 3,443 pets missing in the capital. The figures, which have been collated by the Greater London Assembly, show the significant problem faced by pet owners in the capital with dogs a constant target for professional gangs. Nationally, approximately six dogs a day are stolen with just one in four being reunited with their owners. Victims of this crime in the UK include former BBC Technology correspondent Rory-Cellan Jones as well as the daughter of the late entertainer Bruce Forsyth.Mr Cellan-Jones' dog, Cabbage, was one of six which was stolen from a professional dog walker in west London in November 2021. Since lockdown, demand for dogs has increased which has led to pressure on prices and a growth in the interest of Organised Crime Groups seeking to 'take advantage of the marketplace'. This has prompted the government to make dognapping a crime in its own right, acknowledging the pain and suffering caused to both the pet and its owners. Claire Calder, head of public affairs at Dogs Trust said: ' Having your beloved pet stolen is an extremely stressful, often heart-breaking experience. For years, Dogs Trust has called for harsher penalties to deter those who profit from this despicable crime. ",
        "'We welcome the proposed measures in the Animal Welfare (Kept Animals Bill) to introduce tougher sentences for those that steal dogs and recognise the emotional impact that this has on their owners. However, the Bill has sadly not progressed for over a year and needs to be urgently brought back or we will miss the opportunity to sufficiently tackle this abhorrent crime.'",
        "PGlmcmFtZSBjbGFzcz0iaWZyYW1lLWNyZWF0b3IiIGFsbG93PSJjbGlwYm9hcmQtd3JpdGUiICBuYW1lPSJ4cC1pZnJhbWUtbGlkNTlxejVkYjUwdm80cTFkYiIgc3JjPSJodHRwczovL2RhdGF3cmFwcGVyLmR3Y2RuLm5ldC9pR1RhbS8xLyAiICBoZWlnaHQ9IjYwMCIgc3R5bGU9ImJvcmRlcjogMDsgd2lkdGg6IDEwMCU7ICAiPjwvaWZyYW1lPg==",
        "In figures collected by insurance company Direct Line, American Bulldogs, Staffordshire Bull Terriers and French Bulldogs are the most breeds most at risk of dognapping. Such is the extent of the threat posed to dogs, the government established the Pet Theft Taskforce to study the issue and report back on what could be done to thwart the criminal gangs.  According to the taskforce's report: 'Britain is a nation of pet lovers, and many pets are considered members of the family, with their welfare and safety a key concern for owners. When a pet is stolen, this can cause significant emotional distress to the owner and animal, and the government is committed to tackling this crime.' ",
        " The government's taskforce was ordered to uncover any evidence on the extent of the problem and consider how to counter the threat. According to the report: 'Much of the current narrative is around dog theft, due to the higher number of dogs reported stolen compared to other pets. According to the Metropolitan Police Service, around 7 in 10 of crimes recorded in which animals are stolen involve dogs. Whilst the taskforce has focused on dog theft it has also considered the wider position around all pet theft where possible.'",
        "Across the UK, 2,000 dogs were stolen during 2020. The report warned: 'As demand for dogs has risen, so has their price. There has also been some evidence that as the value of stolen dogs has increased, in some areas this has attracted the interest of Organised Crime Groups (OCGs), who have adapted their criminality in response, taking advantage of the marketplace.'The authors concluded: 'Whilst these figures might seem low, the emotional impact of having a pet stolen is undeniable, and often pets play a central role in their owners’ lives, especially assistance dogs. The evidence presented to the taskforce has shown the serious impact of this crime on the victims. As well as causing trauma to the pet’s owners, many cases of pet theft affect the animal’s welfare.'As a result, the taskforce recommended new legislation to deal with the issue: 'Those speaking before the taskforce gave impassioned evidence of the emotional value a pet provides them and their families. It is clear pets are valued as something more than just property. This is where many see the deficiencies with the current Theft Act 1968 (“Theft Act”) – which treats pets as a type of property.'",
        "PGlmcmFtZSBjbGFzcz0iaWZyYW1lLWNyZWF0b3IiIGFsbG93PSJjbGlwYm9hcmQtd3JpdGUiICBuYW1lPSJ4cC1pZnJhbWUtbGlkNTlyM2hpbXF2bThvc3EzYiIgc3JjPSJodHRwczovL2RhdGF3cmFwcGVyLmR3Y2RuLm5ldC90S3JxUi8xLyIgIGhlaWdodD0iNzgxIiBzdHlsZT0iYm9yZGVyOiAwOyB3aWR0aDogMTAwJTsgICI+PC9pZnJhbWU+",
        "However, significant concern was expressed about the way dognapping and other pet theft is recorded which may underplay the seriousness of the problem. ",
        "A dog stolen while walking off the lead in the park can be recorded as a theft, while a dog taken from inside a parked car is deemed a car-related offence. If a dog is taken from a house, that is often classed as a burglary while someone walking their pet and is forced to hand it over can be classified as a robbery. In response to the perceived threat, the government has introduced the Kept Animal Bill into the House of Commons which is currently at report stage ahead of its third reading and consideration by the House of Lords. An early amendment to the bill included pet theft as a criminal offence due to the 'considerable distress for owners and their pets alike' caused by the criminality. According to Direct Line insurance, 2,160 dogs were stolen across the UK during 2022. ",
        "The figures show that American Bulldogs were at greatest risk, followed by Staffordshire Bull terriers an  French Bulldogs. According to the insurance company, the number of dogs stolen in 2022 has fallen by 22 per cent when compared with figures from 2021. Charity Dogs Trust said they have seen a 50 per cent increase in the number of requests about rehoming dogs. Beverley Cuddy, Editor of Dogs Today magazine, Patron of Stolen and Missing Pets Alliance, and Founder of the Bark Angel, comments: 'Although reported dog theft numbers may be going down to pre-pandemic levels, the reality is that a significant number of cases still go unreported. Coupled with the rise in people using dog walkers, multiple dogs could be stolen at one time. Only one crime reference number is assigned when this happens, so we believe the scale of the problem is likely to be much bigger.'",
        "Police in Leicestershire have reported the highest increase in dog thefts over the past eight years rising from 24 in 2015 to 75 in 2022. Madeline Pike, Veterinary Nurse for Direct Line Pet Insurance comments:'We remain a nation of dog lovers. As more than a third (34 per cent) of UK households own a dog, the opportunity for thieves is high, with six dogs stolen each day in 2022. 'Whilst there has been a decrease in the number of dogs stolen, animal shelters have seen a sharp rise in the number of pets being rehomed. This is likely to be a sign that households are struggling with the cost of living or that they can no longer give their pet the attention they need due to a change in their working patterns.'Taking precautions such as not leaving your dog tied up outside a shop, in an empty vehicle or keeping it on the lead when in busy areas, will help reduce the likelihood of being targeted by thieves. It’s also vital to make sure your dog is microchipped and that your contact details are up to date. This can help identify your dog if it does go missing and is found.' According to Direct Line, if your dog has been stolen you should: ",
        "Firstly, check the local area and your dog’s favourite spots in case the dog has wandered offEngage the local community and make your dog ‘too hot to handle’ by sharing with local groups, putting up posters, informing local media and using social media – include pictures and any distinctive markingsThere are some specific sites set up to help find lost and stolen dogs, like doglost.co.ukReport your dog as stolen to the police and provide them with as much detail as possibleReport your dog as stolen to local pet related services like vets, animal shelters, pet shops, dog wardens and the council. Provide photos, a physical description and the dogs microchip numberReport your dog to the microchip database and make sure your contact details are up to date"
    ]
}