{
    "articleURL": "/wires/reuters/article-12049593/Seeking-win-starter-As-open-series-Royals.html",
    "content": [
        "It's a race to the bottom as the Oakland Athletics arrive Friday in Kansas City for a weekend series with the Royals.",
        "The clubs have the two worst records in baseball.A's starters are winless in the club's first 32 games, a major league record to start a season.The A's are coming off the heels of being swept at home by the Seattle Mariners. Thursday's 5-3 loss was their 12th in their last 13 home games and left Oakland with a 3-15 home mark, which is slightly better than Kansas City's 2-14 home record.The Athletics and Royals rank among the bottom five in several offensive categories, including runs and batting average. The Royals rank last in on-base percentage and walks drawn.Meanwhile the Athletics have allowed 244 runs (7.63 per game), easily the most in baseball, while also allowing the most hits (326) and walks (163).Brent Rooker leads Oakland with career bests in homers (nine) and RBIs (22) while hitting .316 and Esteury Ruiz leads the American League with 13 stolen bases.Athletics manager Mark Kotsay hopes to bring all aspects together against the Royals.\"We've played better baseball in all facets,\" he said after Thursday's loss. \"We just haven't played it all at once.\"The Athletics will send lefty Kyle Muller (0-2, 6.28 ERA) to the mound against Royals righty Brad Keller (2-2, 3.56).Muller has allowed 56 baserunners in 28 2/3 innings. He has never faced Kansas City.",
        "In his most recent start, last Saturday against Cincinnati, he left the game with a 2-1 lead. Oakland's bullpen gave up two ninth-inning runs in the 3-2 loss.The bullpen has been an area of concern for the Athletics, having blown 9 of 12 save chances while posting a 6.78 ERA.Before Thursday's game, the club designated righty relievers Domingo Acevedo and Jeurys Familia for assignment and optioned right-hander Adam Oller to Triple-A Las Vegas, while recalling right-handers Rico Garcia, Spencer Patton, and Austin Pruitt from Las Vegas. Familia had two of Oakland's three saves.In four starts against the Athletics, Keller is 1-2 with a 4.67 ERA, getting his lone win June 18 of last season in Oakland.One of the few bright spots among Royals starters, Keller has limited batters to a .226 average, but has walked 24 in 30 1/3 innings.Kansas City snapped a 10-game home losing streak with a 6-0 shutout over Baltimore on Wednesday before falling to the Orioles 13-10 on Thursday.\"It was clearly the best game we've played all around,\" Royals manager Matt Quatraro said after Wednesday's win. \"Pitching the first shutout, the defense made some really nice plays, and then some timely hitting.\"An anemic Royals offense has come to life lately, scoring 36 runs over their last six games, including 23 in the Baltimore series. The offense came back from a 10-3 deficit on Tuesday to make it a close game before losing 11-7, then rebounded from an 8-1 hole Thursday to take a 9-8 lead.",
        "\"I think it says something about the character of the guys in the clubhouse,\" Mike Massey said. \"Any time you get down like that there are two options: you can roll over and fold or come back and make an effort like we did.\"The loss of infielder Nicky Lopez for up to a month due to an emergency appendectomy last weekend was cause for concern, but his replacement, rookie Maikel Garcia, has hit safely in all three starts at third base and is batting .417.--Field Level Media"
    ]
}