{
    "articleURL": "/news/article-12058949/Elon-Musk-fire-graphic-video-slain-victims-Allen-mall-shooting-circulated-online.html",
    "content": [
        "Within minutes of Mauricio Garcia, 33, shooting dead victims, videos went viralElon Musk was criticized for gutting Twitter's moderation team amid layoffs Elon Musk has been criticized after graphic images of the bloodied victims shot dead in the Texas mall massacre circulated on Twitter and were left online for hours.",
        "Within minutes of Mauricio Garcia, 33, shooting dead eight victims at the Allen Premium Outlets shopping mall before he was killed by a police officer, horrific videos and images of those killed began going viral on Twitter.A graphic 10-second video circulated on Saturday, showing several dead bodies slumped against a planter and white wall bearing the sign of retailer H&amp;M. At least one of the victims, lifeless and bloody, appears to be a young child.The unusually graphic nature of the content - some of which is still online - drew condemnation from Twitter users, who pointed to Musk's decision to gut Twitter's content moderation team amid layoffs since he bought the social media platform in October.'This family does not deserve to see the dead relatives spread across Twitter for everybody to see,' veteran photojournalist Pat Holloway, 64, told The New York Times. ",
        "Holloway had tweeted Musk demanding that he do something about the graphic content, including a picture of Garcia's dead body, going viral on the site. 'There is nothing virtuous or ethical about showing easily identifiable dead children and adults, whose families might not yet know they are dead,' wrote Emily Bell, a professor and the director of the Tow Center for Digital Journalism at Columbia University. 'It's deeply unethical - it strips victims and their families of privacy and dignity in death. It serves only Musk's click farm.'",
        "In the past, Twitter has worked to take down videos and images of such grisly content but Musk's decision to curtail the site's moderation practices saw it go viral instead. The company has faced questions about its ability and willingness to moderate harmful and illegal content since Musk slashed half of Twitter's 7,500 staff. An emailed request for comment about the viral mass shooting videos to Twitter, which no longer has a communications team, returned an automated reply with a poop emoji.",
        "Some Twitter users said people and politicians needed to see videos like this one to grasp the magnitude and horrific nature of gun violence.But some have drawn a distinction between traditional news organizations - where editors must be bound by ethics - compared to social media sites like Twitter which are not bound by such standards. 'I understand where people on social media are coming from who want to circulate these images in the hopes that it will make a change,' UCLA professor Sarah T. Roberts, who focuses on content moderation, told the Times. 'But unfortunately, social media as a business is not set up to support that. What it's set up to do is to profit from the circulation of these images.'It comes as officials are investigating whether shooter Garcia had an interest in white supremacist ideology.",
        "A law enforcement official said federal agents had been reviewing social media accounts and believed Garcia had expressed an interest in neo-Nazi views and had a patch on his chest reading RWDS - an acronym for Right Wing Death Squad, which is popular among extremists and white supremacy groups. Further, law enforcement officials said investigators had searched a home connected to Garcia and a Dallas motel near an interstate where Garcia had been staying where they found multiple weapons, including an AR-15-style rifle and a handgun. "
    ]
}