{
    "articleURL": "/wires/reuters/article-12058757/Soccer-The-week-Asian-football.html",
    "content": [
        "By Michael Church",
        "HONG KONG, May 8 (Reuters) - Talking points for the week in Asian football:URAWA BEAT AL-HILAL TO CLAIM ASIAN CHAMPIONS LEAGUE TITLEUrawa Red Diamonds became the first Japanese club to win the Asian Champions League for a third time when Andre Carrillo's own goal sealed a 1-0 second leg win over Al-Hilal on Saturday at Saitama Stadium and a 2-1 aggregate victory.Carrillo put the ball in his own net in the 48th minute and, despite dominating the game, the defending champions from Saudi Arabia were unable to find a way past Urawa goalkeeper Shusuku Nishikawa.\"Today we are very happy that, after a few months working hard, thinking about this game, we are winning this trophy for the fantastic supporters at this huge club,\" Urawa coach Maciej Skorza said.\"This is a big honour for me and it's just amazing. It's difficult to find a way to describe this win.\"OSAKO DOUBLES UP TO KEEP VISSEL KOBE IN POLE POSITIONYuya Osako scored twice as Vissel Kobe maintained their lead in the J.League with a 3-0 win over Yokohama FC.The former Japan international put his side ahead from the penalty spot in first-half stoppage time before doubling Kobe's advantage seven minutes after the interval. Daiju Sasaki tapped in from close range to seal the win two minutes later.",
        "Kobe hold a two-point lead over Yokohama F Marinos after the defending champions thrashed Kyoto Sanga 4-1, while Nagoya Grampus sit in third spot after Sho Inagaki's 67th minute goal earned a 1-0 win over Gamba Osaka.HWANG SCORES TWICE AS LEADERS ULSAN INCREASE ADVANTAGEUlsan extended their lead in Korea with a 3-0 win over Daegu FC on Friday as rivals FC Seoul were held to a 1-1 draw by Jeonbuk Motors and Pohang Steelers lost 2-1 loss to Jeju United.Hwang Jae-hwan scored a brace either side of Valeri Qazaishvili's goal to move Ulsan onto 28 points from 11 games.Seoul, who trail by eight points, were held to a draw by a Jeonbuk side playing their first game since coach Kim Sang-sik quit in midweek due to the team's poor form, which has left the nine-time champions sitting in 10th place in the 12-team league.Third-placed Pohang now trail the leaders by nine points after losing to Jeju.SHENHUA OPEN TWO-POINT ADVANTAGE WITH DALIAN VICTORYShanghai Shenhua moved two points clear in the Chinese Super League with a 1-0 win over Dalian Pro on Friday as neighbours Shanghai Port were held to a 0-0 draw by Tianjin Tigers.The pair were level on 10 points going into the weekend´s fixtures and Yu Hanchao´s 82nd minute goal gave Shenhua their fourth win in five games as Wu Jingui´s side moved onto 13 points.",
        "Port dropped down to third, trailing Chengdu Rongcheng on goals scored after Romulo, Elkeson and Felipe all netted to seal their 3-2 win over Qingdao Hainiu.SHABAB AL-AHLI CLINCH FIRST EMIRATI TITLE SINCE 2016Shabab Al-Ahli secured the United Arab Emirates Pro League title for the eighth time on Sunday after two goals in four minutes gave them a 2-1 comeback win over Bani Yas.The Dubai club went 1-0 down to a Sasha Ivkovic header after 61 minutes but Aziz Ganiev equalised nine minutes later and Yahya Al-Ghassani struck the winner in the 74th minute.\"The current group believed in their goal from the start and did the hard work so I congratulate the players,\" Portuguese coach Leonardo Jardim told AD Sports channel after leading the club to their first league title since 2016.KITCHEE HANG ON TO CLAIM THIRD HONG KONG TITLE IN A ROWAndy Russell scored a 76th minute equaliser for Kitchee as the Hong Kong Premier League champions retained their title in dramatic fashion with a 2-2 draw with nearest challengers Lee Man in the final game of the season on Sunday.Needing a point to seal a third consecutive title, Kitchee went behind to Manuel Bleda's ninth minute goal before Mikael Severo levelled from the penalty spot midway through the first half.",
        "Everton Camargo headed past Kitchee goalkeeper Paulo Cesar after Ruslan Mingazov had been sent off for a second bookable offence to move Lee Man to within 17 minutes of claiming their first league title.But Russell's powerful header into the top corner three minutes later earned Kitchee the point they required as they to finished two points ahead of Lee Man. (Reporting by Michael Church, additional reporting by Osama Khairy, Editing by Peter Rutherford and Toby Chopra)"
    ]
}