{
    "articleURL": "/wires/ap/article-12045033/Covering-previous-coronation-Britain.html",
    "content": [
        "It might just be the coolest caption in newspaper history: \"AP Wirephoto via jet bomber from London\"",
        "On Saturday, The Associated Press will deploy a small army of writers, photographers, radio correspondents and video journalists to cover the coronation of Britain´s King Charles III.But for his mother´s crowning 70 years ago, the world´s oldest news cooperative enlisted the help of an air force as well.CONNECTING THE WORLDFounded in 1846 by competing New York City newspapers looking to share the costs of covering the Mexican War, the AP used boats, barges, trains, sleighs, ponies and pigeons to get stories to its \"members.\" AP was an early adopter of Samuel Morse´s and Alfred Vail's telegraph - thus the term \"wire service.\" With the telegraph, communications technology severed itself permanently from transportation methods.\"Innovation is in our bloodstream - and always has been,\" says Valerie Komor, director of AP´s corporate archives.",
        "Another big leap came in 1935, when - after 10 years of development in collaboration with AT&amp;T - the AP launched its Wirephoto service, using a 10,000-mile network of telephone lines to distribute pictures to newspapers simultaneously with the news report. The photos were transmitted using a light bulb called an \"exciter lamp.\"The print was wrapped around a cylinder that rotated as the lamp shone its beam across the image, scanning about 1 inch of copy per minute. So, an 8 x 10 black-and-white photo took eight minutes to transmit - that is, if there was no interference on the line.",
        "That technology had changed little by 1953, as the world prepared for the coronation of Queen Elizabeth II. But the AP had a few tricks up its sleeve.Today, stories, photos and videos are beamed around the planet via a network of satellites. But this was more than four years before the Soviet Union successfully put Sputnik into orbit.To get its photos out of London, AP was relying on the \"radiophoto,\" which used the airwaves to transmit images. But there was another hurdle.Normal commercial radiophoto circuits of the day ran at a rate of 60 revolutions per minute; AP´s wirephoto network operated at 100 rpm. So, for the coronation, AP leased a special circuit operating at the higher rate.Pre-coronation tests were conducted in London. \"Results were reasonably good,\" the AP noted. But, it warned its members, atmospheric storms forecast between London and New York that week \"may make radiophoto transmission difficult - perhaps impossible during certain periods.\" The problem: Radio waves carrying a photo signal across the Atlantic didn´t simply follow the Earth´s curvature.\"To reach New York successfully they must be reflected from layers of electrified air particles 100 to 200 miles above the Earth,\" the wire service wrote. \"It is the reflection from this `mirror´ which makes possible long distance transmission of pictures by radio.\"",
        "During atmospheric storms, the AP said, that mirror might become clouded, \"like the mirror in your bathroom after your hot shower.\"FLIGHT PLANSSo, as a precaution, AP arranged to have the original photos transported across the Atlantic aboard English Electric Canberra jet planes - the Royal Air Force´s new high-altitude bombers - that were already tasked to carry television films.\"These planes will leave London at intervals during the day,\" the wire service told its members, \"with the first jet due in Montreal around 3:30 pm, EST. Original prints will be sent directly onto AP´s wirephoto network from a location at St. Hubert´s airport in Montreal.\"The dual plan worked, and AP prevailed over the \"opposition,\" a committee of the Associated Press Managing Editors group crowed in a postmortem of the photo coverage. The dedicated circuit was used \"in contrast to circuits the opposition were using (and cursing), and it was a key factor in AP´s success.\"\"Over this 6,000-mile route from London, AP started moving a picture of Elizabeth wearing her crown only 18 minutes after it was put on her head,\" the report noted. \"By the same method the New York Daily News received the picture of Elizabeth´s leaving the palace, and printed it only an hour and 43 minutes after the event. The News called it \"an all-time record for picture-handling.\"",
        "In a battle to be first on American airwaves with footage, CBS and NBC each hired \"souped-up\" P-51 Mustang fighter planes to ferry film from Canada to Boston, the AP reported. In a scheme dubbed \"Operation Astro,\" NBC even hired a Canberra being delivered to the Venezuelan air force to carry its film, though alleged fuel pump problems forced it to turn around, according to a 1988 retrospective by former network president Reuven Frank.\"The TV networks spared no expense to deliver coronation films to U.S. viewers,\" the APME panel wrote. \"But thanks to the absence of any TV transatlantic link, U.S. afternoon papers had the picture beat.\"WHAT WAS WRITTENDespite all the hubbub about photos, AP was still primarily a word operation in 1953. And a team of writers cranked out stories that magically appeared on banks of newsroom teletype machines that clacked away at a stately 60 words per minute - in all caps.Hal Boyle wrote about then 4-year-old \"PRINCE CHARLIE, BRITAIN´S FAIR-HAIRED BOY,\" and how the future monarch \"STOLE THE PRE-CORONATION SPOTLIGHT FROM HIS REGAL MOTHER BY PLAYING A GAME OF PEEK-A-BOO WITH VAST THRONGS OUTSIDE BUCKINGHAM PALACE.\"\"YOUNG CHARLIE, WEARING A SUIT OF PALE BLUE, STEPPED TO A SECOND FLOOR WINDOW, AND DREW BACK A LACE CURTAIN,\" Boyle wrote. \"SMILING BROADLY, HE WAVED HAPPILY DOWN AT THE CHURNING THRONG, WHICH SET UP A CRY, `THERE HE IS!´\"",
        "Boyle, who won a Pulitzer in 1944 for his war dispatches, reported that hundreds of mothers held their children high to see the bonnie prince, \"WHO IS ONE OF THE MOST POPULAR FIGURES IN THE ROYAL FAMILY BECAUSE, LIKE ANY NORMAL BOY, HE GETS IN HIS FAIR SHARE OF TROUBLE.\"Over his long years as sovereign-in-waiting, Charles earned a reputation as somewhat stiff and distant. But 70 years ago, Boyle wrote, the young prince´s antics \"HAD GIVEN A HUMAN TOUCH TO THE SHOW AND TAKEN SOME OF THE TENSION AWAY FROM THE LONG WATCH ...\"Relman \"Pat\" Morin, already the recipient of the 1951 Pulitzer Prize in International Reporting, would add a second Pulitzer five years later for his coverage of the integration battle in Little Rock, Arkansas. He wrote the AP´s \"second night lead.\"\"IN THE MOMENT OF HER CORONATION, ELIZABETH WAS THE VERY VISION OF A QUEEN, BEAUTIFUL, REGAL, AND OUTWARDLY SERENE,\" he wrote.Morin said it was a ceremony \"OLD TO ENGLAND BUT NEW TO TELEVISION.\"\"THE BROADCAST BROUGHT OFFICIALLY TO A CLOSE A DAY OF DESTINY THAT HAD KEPT THE QUEEN IN THE PUBLIC EYE 11 HOURS,\" he wrote. \"IT WAS THE MOST-SEEN CORONATION IN HISTORY.\"That is, perhaps, until Saturday."
    ]
}