{
    "articleURL": "/wires/pa/article-12049737/Lord-Mayor-Westminster-says-coronation-people-coming-together.html",
    "content": [
        "The Lord Mayor of Westminster said the King’s coronation will “share a new Britain” and is “looking forward” to the historic event.",
        "Councillor Hamza Taouzzale, 23, the youngest person and first Muslim to be Lord Mayor, will be donning his blue and gold ceremonial robe at Westminster Abbey to represent the city of Westminster on Saturday as well as attending plenty of street parties in the lead-up to the event.He said the “once-in-a-lifetime experience” will be “really good fun” and he is most looking forward to the moment the King is crowned as he hopes the coronation will showcase a new Britain bringing people together.“The thing I’m most looking forward to is when they put the actual crown on. When they put the crown on he’s obviously King, but it’s all really official,” he told the PA news agency.“I hope the ceremony shares a new Britain. Whether you agree or don’t agree with the monarchy is another story but if the coronation is able to bring people together, then I think it’s done its job.” For me, the coronation is about people coming together, and that's the best thing we can do at a time like this  Lord Mayor of Westminster Hamza Taouzzale  In the lead-up to the event, the Lord Mayor has attended coronation teas and multi-faith exchanges and even unveiled one of only four Royal Mail coronation post boxes – one in each of the nations – painted in red, white, and blue.",
        "He described the unveiling as “really cool” and said it helped him “get into the spirit of things” as he hopes to attend as many street parties as possible.While some critics have branded the event as a waste of taxpayers’ money, Coun Taouzzale feels that bringing the community together is “the best thing we can do at a time like this”.“I’ve grown up in Westminster my whole life. I understand the positives and negatives. I still live in the estate that I grew up in. I can see both worlds really clearly,” he said.“But for me, the coronation is about people coming together, and that’s the best thing we can do at a time like this.“Although we are celebrating the King and the Queen on their coronation, it’s about celebrating each other as a community.”",
        "The Lord Mayor welcomes street parties and community events to celebrate the coronation after a “tricky” few years following the Covid-19 pandemic.“It’s been a bit up and down and all over the place with Covid … so to have a ceremony like this, to have all the street parties and have all the Big Help on Monday, to have all the community events surrounding the coronation, is fantastic,” he said.He has advised that the public should have fun but “within reason” encouraging people to host parties that involve the whole community.",
        "“I’m quite big on the family friendly stuff, so make sure that it involves the whole community, involve the whole family because it’s something where people of any age, any faith or any background can enjoy and have fun,” he said.Despite feeling some pressure to represent the city of Westminster on Saturday, the Lord Mayor is combatting nerves by reading about the coronation in 1953 to draw inspiration from his predecessors.“It feels a little bit nerve-racking because you’re there to do your job, you’re there to represent hundreds of thousands of people, all of those who live in Westminster or work or make up our great city,” he said.",
        "“But a lot of the time, it’s all about making sure you do the job right.“Some of the books describe what the Mayor of Westminster did or the Mayor of Marylebone or Mayor of Paddington, and what their roles were within the coronation,” he explained.“For me, it’s about learning about what they did to see what we can do today. Very few people can remember the last coronation, so to have those books and to have that information helps ease the nerves a little bit.”Alongside being Lord Mayor of Westminster, Councillor Taouzzale is deputy high steward at Westminster Abbey and said the coronation is a “privilege” to be a part of.",
        "“We in Westminster are happy to be hosting it. It’s a privilege to be part of this great city.”"
    ]
}