{
    "articleURL": "/tvshowbiz/article-12060913/EastEnders-Samantha-Womack-opens-undergoing-brutal-chemotherapy-cancer-battle.html",
    "content": [
        "The Macmillan Support Line offers free, confidential support to people living with cancer and their loved ones. Call 0808 808 00 00 for support EastEnders star Sam Womack has revealed she 'yearns' for more children aged 50 after surviving breast cancer, which has made her want to 'celebrate life.'",
        "Having gone through a lumpectomy and chemotherapy, Sam has said she has found a sense of peace after getting the all-clear and her new mantra is 'never say never.' Talking to The Mirror, she said: 'I suddenly really appreciated my kids. I really wanted to do it all again.'Sam is mother to son Benjamin, 21, daughter Lili-Rose and stepson Michael from her marriage to Mark Womack. And she's currently in a three-year relationship with Oliver Farnworth, 40, who played Andy Carver on Coronation Street and he has been an incredible support to her. ",
        "She said: 'Obviously throughout treatment, your ovaries are challenged because chemo can change your hormonal status, so I don’t even know if it would be possible now, post-treatment. And it sounds incredibly greedy because I’ve done it.''Lili’s 18. But I just suddenly had this real yearning. It was like another little switch. Ollie and I talked about it and said, well, never say never. If it’s not possible naturally, there are other ways. I just want to celebrate life.'Sam revealed she was battling cancer last August and two weeks later, Sam had a lumpectomy and lymph node removal to take out the mass, then chemotherapy and radiotherapy to eradicate any floating cancer cells. Sam first met Oliver when they both starred in a 2018 stage adaptation of Paula Hawkins’ novel The Girl On The Train, finding love just before lockdown. ",
        "She remains on amicable terms with her ex-husband Mark.Samantha told OK! last year that she was cancer free and that she was having some ongoing treatment 'as a prevention'. 'Now I'm just having some treatment as I go back to work, as a prevention... We're feeling a lot better than we were,' she told the publication. 'My treatment is ongoing for breast cancer. The surgery was quite difficult to recover from just because it's quite tender when you have lymph nodes removed. There's a few mobility issues at the beginning.'",
        "She recalled: 'The first round of chemotherapy was pretty hardcore really, it was quite toxic,' before adding: 'I've got radiotherapy for a bit of time to try and nuke any leftover cells.' Samantha previously revealed her breast cancer was found during a 'random check' and said the disease has 'attacked' her 'femininity'.Speaking on This Morning, Samantha said she didn't find a lump when she was diagnosed four months ago, saying her cancer was discovered in a random check.'It was really incredible because I didn't find a lump, I didn't feel unwell,' she explained.'There had been a lot of illness around our friends and family and I just thought I'd get a random check and I had an ultrasound, and it showed a little shadow - at that point it could be anything, a cyst… then I had further investigations and then that diagnosis.'",
        "Samantha described herself as 'very lucky' because the lump was less than 2cm and she was able to have a lumpectomy to have the piece of tissue and five lymph nodes removed.",
        "She went on to describe breast cancer as a disease which 'attacks' your 'body' and your 'femininity' as she urged other women to get checked.She said: 'Breast cancer is a strange one, it attacks your body and your femininity, your hair, your breasts, all these beautiful women of all ages.'So many women should be checking themselves in their thirties. That is an important message to get out and checked as well.'The actress, also described battling cancer as 'terrifying' but praised the treatments that are available now to treat the disease."
    ]
}