{
    "articleURL": "/wires/reuters/article-12051821/LATAM-POLITICS-TODAY-Paraguay-president-elect-commits-strengthen-ties-Taiwan.html",
    "content": [
        "Migrant flows won't increase after Title 42 ends, Mexico says",
        "Guatemala's Giammattei government has 75% disapproval ratingEcuador frees cash for Galapagos conservation with bond buybackBrazil's govt confident of victory in high-profile tax caseMay 5 (Reuters) -The latest in Latin American politics on Friday:Paraguay president-elect commits to strengthen ties with TaiwanParaguay's president-elect, Santiago Pena, said he would continue to strengthen his country's \"historic ties\" with Taiwan following a call with his counterpart there after he winning the election.The countries' diplomatic relations of more than six decades had been in the spotlight before Sunday's election, with opposition candidate Efrain Alegre telling Reuters he would seek to move his country closer to China to boost agricultural ties.Migrant flows won't increase after Title 42 ends, Mexico saysMEXICO CITY - Mexican President Andres Manuel Lopez Obrador said migration flows would not increase once U.S. border restrictions imposed during the COVID-19 pandemic are lifted next week.The so-called Title 42 restrictions, which allow U.S. authorities to rapidly expel non-Mexican migrants to Mexico without the chance to seek asylum, are due to expire on May 11.Guatemala's Giammattei government has 75% disapproval rating: pollThe administration of Guatemalan President Alejandro Giammattei has a 75% disapproval rating according to a poll published by one of the country's main newspapers Prensa Libre.",
        "The poll was conducted with 1,202 interviews between April 14 and 23 and has a margin of error of 2.8 percentage points.Compliance with the law, social aid, support for migrants and the non-fulfillment of campaign promises were the causes most questioned by Guatemalans in the survey. Giammattei will leave office in January next year.Ecuador frees cash for Galapagos conservation with $1.6 bln bond buybackNEW YORK/LONDON - Credit Suisse has bought up $1.6 billion worth of Ecuador's bonds, freeing up cash for conservation of the country's unique Galapagos Islands in what is set to be the biggest debt-for-nature swap ever struck.The plans sees three of Ecuador's main government bonds, which have slumped in value this year due to a domestic political crisis, being bought at deep discount with the savings going into one of the world's most precious ecosystems and the inspiration for Charles Darwin's Theory of Evolution.Brazil's govt confident of victory in high-profile tax case in top court -ministerBRASILIA - Brazil's Finance Minister Fernando Haddad said the government \"has everything\" to establish a successful thesis in a high-profile tax case in the Supreme Court, potentially increasing revenues by nearly 90 billion reais ($18 billion) annually.The case has already been ruled on by a lower court. (Compiled by Steven Grattan; Editing by Alistair Bell)"
    ]
}