{
    "articleURL": "/tvshowbiz/article-12038791/Keanu-Reeves-Dogstar-bandmates-pose-photo-tease-new-music-20-years.html",
    "content": [
        "Keanu Reeves has been back in the studio. The music studio. ",
        "The actor, 58, who supported his partner Alexandra Grant in her first New York art show last week, is getting ready to release new music for the first time in some 20 years.The John Wick star and his bandmates posed in rooftop in Los Angeles, teasing their next release.Keanu, who plays bass in the rock group, looked handsome wearing a black T-shirt and pants with a charcoal toned jacket.His dark shoulder length hair was brushed straight and his salt and pepper beard was neatly groomed. ",
        "Composer and songwriter Bret Domrose, 54, who plays guitar and provides vocals, stood in the center of the shot, as drummer Rob Mailhouse, 61, best known for his work on The Days of our Lives, stood to his right. Both were styled in black T-shirts and pants and dark jackets. 'Last set up on the roof in Lincoln Heights for @dogstar photo shoot,' the rockers wrote next to the photo on Instagram.'Exciting news coming soon. Thanks for being so patient. ❤️''Cannot wait!' wrote Spotify's Global Head of Rock Allison Hagendorf.'Cant wait,' agreed another fan, who also offered a suggestion for a spot on any upcoming tours, 'and if it could be possible ..please.. a concert in Rio de Janeiro!'The musicians have been steadily updating fans about their new music.",
        "'Dogstar getting ready for the summer and writing more new material,' they posted on March 29.",
        "In December, they posted, 'Last day of mixing the new Dogstar record in Silver Lake with @tdrumfio. We are loving the new deep, lush sound.'A few days later they shared a photo from a private concert, sharing, 'Back on stage. Private show for the incredible people who made our new album possible.''Can’t wait to perform for everyone when the record comes out Spring 2023.' Keanu and Rob formed formed Dogstar in 1991 with former guitarist Gregg Miller, and had some success on the Indy rock scene. ",
        "Brett joined the group in 1994. After touring through the US and Asia, the rockers opened for David Bowie at the Hollywood Palladium in 1995 and for Bon Jovi on the These Days - Crossroads Tour in Australia and New Zealand. Their first EP, Quattro Formaggi, was released in 1996, quickly followed their first album, Our Little Visionary, the same year.Greg Miller left the band shortly thereafter.Their last album, Happy Ending, was released in 2000 and the group has not put out any new music the  single, Shine, which was included on 2003's Mr. Big Tribute Album. "
    ]
}