{
    "articleURL": "/wires/reuters/article-12060813/Canada-expels-Chinese-diplomat-accused-targeting-lawmaker.html",
    "content": [
        "By Eduardo Baptista and Ryan Woo",
        "BEIJING, May 9 (Reuters) - China on Tuesday expelled a Canadian diplomat in Shanghai in a tit-for-tat move after Ottawa told a Toronto-based Chinese diplomat to leave, escalating tense relations amid concerns about Chinese influence in Canada.Canada expelled Chinese diplomat Zhao Wei on Monday after an intelligence report accused him of trying to target a Canadian lawmaker critical of China's treatment of its Uyghur Muslim minority.\"We will not tolerate any form of foreign interference,\" Canadian Foreign Minister Melanie Joly said on Monday.In response to Canada's \"unreasonable actions\", China told Jennifer Lynn Lalonde, consul of the Canadian consulate in Shanghai, to leave China by May 13, according to the Chinese foreign ministry in a statement.China reserves the right to respond further, the foreign ministry added.\"In response to the Canadian side's unreasonable provocation, China has adopted corresponding retaliatory measures,\" said Wang Wenbin, spokesperson at the Chinese foreign ministry, at a regular news conference. \"This was absolutely just and necessary. We urge Canada to immediately stop its unreasonable provocations.\"Wang added that if Canada did not heed Beijing's warning and continues to \"act recklessly\", China will \"fight back resolutely and forcefully, and the Canadian side must bear all the consequences.\"Diplomatic tensions have been running high since the detention of Huawei Technologies executive Meng Wanzhou in 2018 and Beijing's subsequent arrest of two Canadians on spying charges. All three were freed in 2021.",
        "Last year, Beijing lifted a three-year ban on imports of canola, Canada's largest crop, from trading companies Richardson International and Viterra. The restrictions followed Meng's arrest, but China cited concerns about pests. China is also a major importer of Canadian potash and wheat.Spy agency Canadian Security Intelligence Service (CSIS) authored a report in 2021 about Chinese influence in Canada that included information about potential threats to Conservative Member of Parliament Michael Chong and his family.Details of the CSIS report came to light on May 1, when Canada's Globe and Mail newspaper reported China sought information about Chong and his family in China in a likely effort to \"make an example\" of him and deter others from taking an anti-Chinese government position.\"It shouldn't have taken two years for the government to make this decision,\" Chong told reporters after the announcement.China has said it has never interfered in Canada's internal affairs and has no interest in doing so. China's Toronto consulate-general said the report on Chong has \"no factual basis and is purely baseless.\"The Globe, citing an unnamed national security source, said Zhao was involved in gathering information about Chong, who in 2021 sponsored a successful motion declaring China's treatment of its Uyghur Muslim minority genocide.Chong said he was \"profoundly disappointed\" to find out about the potential threat to his family in Hong Kong from a newspaper, and criticised Trudeau's government for inaction. He repeatedly called for Zhao's expulsion since the Globe report.",
        "Trudeau said he found out about the intelligence report from the newspaper, and on Wednesday blamed the spy agency for not passing it onto him at the time.The agency has now been directed to immediately pass on information about threats to members of parliament and their families.Canadian media outlets have published several reports, citing anonymous intelligence sources, alleging schemes run by the Chinese government to interfere in Canada's last two elections. Beijing has denied those allegations.Trudeau has said China attempted to meddle in the 2019 and 2021 votes, but that the efforts did not change the outcome. He has appointed an independent special investigator to probe the allegations.(Reporting by Steve Scherer and Ismail Shakil in Ottawa and Eduardo Baptista and Ryan Woo in Beijing; Editing by Michael Perry, Gerry Doyle and Jacqueline Wong)"
    ]
}