{
    "articleURL": "/tvshowbiz/article-12043497/The-loves-Gwyneth-Paltrow-look-stars-relationship-history.html",
    "content": [
        "She has been happily married to her husband Brad Falchuk for almost five years.",
        "But before Gwyneth tied the knot with the top producer, she dated some of Hollywood's most famous leading men.The actress recently got candid about some of her exes, admitting that Ben Affleck was 'technically' better in bed but she considers Brad Pitt to be a better actor.The film star was also famously married to Coldplay singer Chris Martin who she shares children Apple and Moses with.After Gwyneth made a rare admission about her love life, MailOnline takes a look at the star's dating history.",
        "Brad Pitt (1994-1997)Gwyneth dated Brad Pitt for three years after they met on the set of the thriller Se7en.They got engaged in December 1996 when Gwyneth was just 24 years old and parted ways a few months later.Looking back on the relationship, Gwyneth previously admitted she felt it didn't work out because she was too young.Speaking on The Howard Stern Show, she said: 'I think I was a kid and I wasn't ready. He was too good for me.''I honestly do think I was too young and didn't know what I was doing.'",
        "Brad would go on to marry and split from Jennifer Aniston and Angelina Jolie but he and Gwyneth have kept in touch over the years.The former flames reunited in June 2022 when Gwyneth interviewed Brad about his involvement in one of her Goop products.",
        "The pair expressed how happy they were to be friends with Brad telling her: 'I do love you,' to which she replied: 'I love you so much'. Ben Affleck (1997-2000) Gwyneth began dating Ben in October 1997 after they met each other at a Miramix dinner event.They would later work together on Shakespeare In Love the following year and split up in January 1999.They were still on good terms after the breakup however as Gwyneth asked Ben to star alongside her in the film Bounce months later.",
        "They rekindled their relationship and parted ways for good in October 2000, with Gwyneth later saying she didn't think Ben was in the right place to have a relationship at the time.The pair have stayed on good terms however and during an Instagram Q&amp;A with fans, Gwyneth said she was happy to hear he had married Jennifer Lopez, saying: 'LOVE!!! SO ROMANTIC!!! VERY HAPPY FOR THEM.' Chris Martin (2002-2014)Gwyneth met Coldplay frontman Chris in October 2002 with the pair marrying in December 2003 in California.The former couple are parents to daughter Apple and son Moses, with Gwyneth pregnant with Apple at the time of their wedding.",
        "The exes made headlines around the world when they announced their split in 2014, with Gwyneth describing their separation as a 'conscious uncoupling'. ",
        "As with her other famous exes, Chris and Gwyneth are still on good terms today.In March 2022, the Sliding Doors star wished her ex a happy birthday on Instagram, writing: 'Happy birthday to the sweetest father and friend ❤️'.Brad Falchuk (2014-present)Gwyneth met her now husband Brad Falcuk back in 2010 when she guest starred on several episodes of Glee, which he co-created with Ryan Murphy.",
        "They began dating four years later and went public with their relationship in April 2015 and announced their engagement in January 2018.They married in a lavish ceremony in The Hamptons in September of that year with celebrity guests including Cameron Diaz, Steven Spielberg and Rob Lowe.  Prior to his relationship with Gwyneth, Brad was married to television producer Suzanne Bukinik with whom he shares two children.  "
    ]
}