{
    "articleURL": "/femail/article-12038801/My-three-year-olds-teacher-snack-shamed-giving-Pringles.html",
    "content": [
        "Megan Peavey, from New Hampshire, went viral after sharing the story on TikTokShe was outraged after she was 'snack-shamed' by her son's pre-school teacherThe mom-of-two was told he couldn't attend the summer program afterwardsA mother who gave her three-year-old son Pringles for his snack at school was left furious after his teacher sent him home with a note on the empty container - in which the instructor slammed her for not providing the youngster with something more healthy.",
        "Megan Peavey, from Bradford, New Hampshire, went viral on TikTok last week, after she revealed that she had been 'snack-shamed' by her son's pre-school teacher.She explained that she packed some chips for the toddler in his lunchbox, but was outraged when he got home from school and revealed that his instructor had written a 'passive-aggressive' note for her on the used container.Megan quickly took to the video streaming platform to share her frustration over the incident, posting a snap of the message, which read, 'Please help us make healthy choices at school.'",
        "'We at our house do not label things as healthy or unhealthy because that starts eating disorders,' she added in the video, which has now been viewed more than 592,000 times. ",
        "'His teacher wrote that on his Pringles cup. They snack-shamed my thee-year-old.' The mother-of-two concluded her TikTok by asking her followers, 'What would you do? Do you think that's ridiculous? Because I do.'In a follow-up video posted days later, Megan explained that she had decided to approach the school director about the situation.She said she 'shared how disappointed she was about how it was handled' and that they should have 'reached out to her directly' instead of writing the note on a piece of 'trash.'In response, she said the director reminded her that they had previously asked parents to start sending in 'healthy snacks' for their kids.",
        "'I didn't consider Pringles to be this unhealthy snack. I considered things like Cheetos, Doritos, Milky Way bars, things like that to be an unhealthy snack,' she explained.'I would pack him Pringles with a granola bar, yogurt, fruit. Regardless, did I think it was appropriate to write it on my son's empty packet of Pringles? No. ",
        "'I wish a phone call had taken place, I wish that a message had been sent directly to me.'The mom added that not only was there 'no apology' from the school, but they actually told her she could no longer send her son to its summer program. She revealed: 'My son's been there for quite some time and we had him registered for its summer program for three days a week but at the end of the conversation, she shared that they no longer have a part-time spot for my son this summer. 'It felt so uncalled for and disrespectful. It was very unsettling. I'm very upset over it, but I just walked downstairs, checked my son out, and that's-that, we're done there.'Megan explained that she didn't speak out about the situation online because she wanted 'attention,' but instead, she hoped that it would shed some light on the 'battles' that parents have to face.",
        "'As a working mom, sometimes it's easier for me to pack Pringles,' she told her followers.'I'm a working mom, my husband is in law enforcement so he has crazy hours and a very demanding schedule. 'Sometimes it's easier for me to just throw in a thing of Pringles. If we're sending food that we think is good for our children, than why can't they just let them have that?'She reiterated that she doesn't 'put weight on food' or use words like 'healthy' or 'unhealthy' around her kids because it can cause an 'eating disorder' later on.",
        "'I have a background in mental health counseling. I am not gonna let my kids get an eating disorder because a school is labeling things as healthy and unhealthy. That to me is unhealthy,' she concluded.Many people were stunned and outraged over the encounter and took to the comment section to share their thoughts.'You should send Pringles the next day that say, \"When you buy it, you can decide what the snack is,\"' one person suggested.'He’d be going with a FULL can on the next day with \"no thank you\" written on the side in big bold letters,' someone else wrote.'I’d tell them maybe they need to provide the snacks if they know what he needs,' another user added.",
        "'I cannot even explain how out of line and wild this seems to me - on the schools part,' read a fourth comment, while a fifth said, 'Send a full-sized can the next day with a note saying, \"I don't tell you how to teach, you don't tell me how to parent.\"'A different user commented: 'I’d print off the teacher an article related to food labeling and eating disorders. With a note that says, \"Please help us make the school a healthy environment.\"'"
    ]
}