{
    "articleURL": "/news/article-12058481/ABCs-Norman-Swan-refuses-accept-pandemic-declaration.html",
    "content": [
        "WHO declares the Covid emergency over  Norman Swan says this isn't pandemic's endHe pointed out the virus is still taking lives ABC's medical expert Norman Swan was quick to brush aside a global health agency's declaration the Covid pandemic is over.",
        "Appearing on ABC TV Dr Swan refuted a suggestion that the World Health Organisation's declaration of an end to the global Covid emergency means the pandemic is officially over.   'It’s not the official end of the pandemic,' Dr Swan sternly shot back.'The World Health Organisation was very clear. This was not an announcement that the pandemic was over.'This was an announcement that the emergency response and the funding flows is over, which most countries have done anyway, but the pandemic is not over. 'The director general of the World Health Organisation was very clear that countries should not stop their Covid response.'",
        "On Friday WHO director-general Tedros Adhanom Ghebreyesus said: 'It's with great hope that I declare COVID over as a global health emergency.'   However, he warned the virus still posed a threat in developing countries that did not have access to vaccines.However, the UN body says it is time for other countries to treat Covid as they do other infectious diseases.Predating the WHO announcement, US President Joe Biden said Covid will no longer be treated as a public health emergency from May 11.Dr Swan, who hosts a weekly Coronacast podcast dedicated to covering Covid, pointed out that despite the overwhelming majority of Australians being vaccinated the virus continues to take lives.",
        "'Last year Covid was the third leading cause of death in Australia,' he said.'The excess deaths in January this year from the Actuaries Institute is 8 per cent so 1,100 people in that month died of Covid and Covid-related diseases who might not otherwise have died.''It’s still around, it’s still a problem.'According to the Australian Bureau Statistics the excess deaths in January were 12.4 per cent above the expected baseline amounting to 1,605 people passing away.Of those 704 of those were doctor certified due to Covid. According to the Actuaries Institute out of the 1,100 deaths they considered to be excess, 760 deaths were from Covid, which represents two-thirds of the total.Nine's chairman and former Treasurer Peter Costello on Tuesday slammed Australia for 'overreacting' to Covid and subjecting residents to 'draconian' and 'unnecessary' restrictions.Peter Costello, who was a prominent treasurer under Liberal PM John Howard, said governments across Australia went 'too far' when they shut down workplaces and implemented daily curfews in 2020 and 2021.Mr Costello said not even during World War II had Australians been forced to stay inside their homes past 9pm.'You'll look back on it and you'll say, 'how did we put up with that infringement on individual liberty,' he told YouTube channel.",
        "Hangovers from the pandemic period are gradually being erased as the cost of the staggering cost of measures to stop the virus come to light. ",
        "NSW is moving to shut the 165 Covid mass testing clinics across the state, which will save $66 million a year.The move follows Daily Mail Australia reporting fewer than 100 tests were being conducted at each site per day with staff spending most of their time bored on their phones.In West Australia there are huge of stockpiles of rapid antigen tests (RATs) that the state has been struggling to even give away with stalls being set up in shopping centres to pass them out.WA's Auditor-General Caroline Spencer slammed the waste of $580 million on the single use diagnostic tests and pointed out two hospitals could have been built for less than that amount.Dr Swan's gloomy views and fixation on Covid have not been without controversy.He had to apologise last year after falsely claiming Labor senator Kimberley Kitching's death of suspected heart issues was likely Covid-related.The Senator, who was 52 when she died, had never contracted Covid according to her furious family.The ABC admitted Dr Swan's remarks breached its editorial standards and cautioned him during discussions with the broadcaster's management.Dr Swan has also faced criticism for relentless doomsday predictions and for exaggerating the untreatable nature of Covid.",
        "He claimed Australia's health system would collapse within days of Covid's outbreak in 2020, that the virus was vaccine-resistant and said the protection from masks was 'very small'.Dr Swan repeatedly called for lockdowns and dismissed the efficacy of vaccines even branding those who took them as 'guinea pigs'.Despite this he was awarded he was awarded a member of the Order of Australia in January's honours list  'for significant service to the broadcast media as a science and health commentator'.Covid is estimated to have killed at least seven million people across the world but Dr Tedros said the pandemic is more likely to have caused around 20million deaths — due to reporting issues and testing inconsistencies. "
    ]
}