{
    "articleURL": "/wires/ap/article-12050933/Funeral-held-Ukraine-American-man-killed-action.html",
    "content": [
        "KYIV, Ukraine (AP) - Soldiers from the International Legion of Ukraine said farewell Friday to an American military veteran they served with, who was killed a month ago in the fierce struggle to prevent the eastern city of Bakhmut from falling into Russian hands.",
        "In a funeral service at Kyiv's St. Michael's Cathedral, Ukrainian regular army troops bore the Ukrainian-flag-draped coffin of Chris Campbell while about three dozen members of the International Legion looked on.After folding the flag, they presented it to Ivanna Sanina, Campbell's Ukrainian wife.The Florida native is one of least nine Americans now known to have been killed in fighting in Ukraine, including another last month in Bakhmut. Two Canadian volunteers were also killed there April 26 after Russian artillery hit their position.The struggle for Bakhmut, located about 55 kilometers (34 miles) north of the Russian-held regional capital of Donetsk, has been one of the bloodiest of the war. It has now been going on for more than eight months.It is believed to have cost thousands of lives, though neither side has said how many. Russia now has possession of most of the city.",
        "Campbell served with the International Legion of Ukraine, a unit of foreign volunteers with prior military experience formed by Ukrainian President Volodymyr Zelenskyy.Sanina, herself a volunteer to provide aid to the frontline troops, said she had first met him at an event for volunteers earlier in the war.\"I asked him, `Why are you here?´ It was our first meeting, and he said, `Because it is right,´\" she told reporters tearfully, calling him \"the bravest man I've ever known.\"",
        "She last saw him two days before his April 6 death in Kharkiv, when he had a short respite from the front lines. She said she could tell how hard the fighting in Bakhmut had been on him.\"I saw that he changed a lot,\" she said. \"Every man, the horrors which they see, it's awful.\"_____David Rising contributed to this report_____Follow AP´s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
    ]
}