{
    "articleURL": "/wires/ap/article-12048863/Ozuna-Acu-Jr-power-Braves-6-3-win-Marlins.html",
    "content": [
        "MIAMI (AP) - Marcell Ozuna homered for third time in two games, Ronald Acuña Jr. stole his league-leading 15th base, and the Atlanta Braves beat the Miami Marlins 6-3 on Thursday to complete a three-game sweep.",
        "Acuña went down in the sixth after fouling a ball off his left knee. He remained on the ground and grabbed at his leg for several minutes, but finished the at-bat and returned to right field in the bottom of the frame. He was eventually removed out of precaution.Braves manager Brian Snitker said after the game that Acuña is \"fine\" but was having trouble bending his knee, so the team wanted to get him treatment right away.Matt Olson also homered for the Braves, winners of five of their last six. They have hit 19 home runs in seven games against Miami this season, including six in a 14-6 win Wednesday night. Atlanta has gone deep in all but one game against the Marlins this year: a 5-4 loss on April 27 in which Miami came from behind with a five-run ninth.\"This was a tough series coming in here because they were playing really well,\" Snitker said. \"It's a good team. Any time you can have an over .500 road trip, it's a good thing.\"Acuña extended his on-base streak to 23 games when he reached on a fielding error by first baseman Yuli Gurriel in the first. He scored on an RBI single by Sean Murphy later in the inning to make it 1-0.",
        "Dylan Dodd (2-1) allowed eight hits, three runs, walked three and struck out one in six innings. A.J. Minter struck out two in the ninth for his seventh save of the season.\"I felt like I battled through a lot of baserunners,\" said Dodd, who was called up from Triple-A Gwinnett. \"At the end of the day, was pretty happy with the result.\"Jorge Soler, who finished a triple shy of the cycle, gave Miami a 2-1 lead in the first with his sixth home run of the season. It also scored Jon Berti, who had a leadoff single and stole his fifth base.But the Braves retook the lead in the second on an RBI single by Acuña, who stole second and advanced to third on a throwing error by Nick Fortes.Ozuna drilled a 1-0 pitch from Jesús Luzardo (2-2) to left-center in the fourth to make it 4-2. It was Ozuna's fifth homer of the season and came one day after he hit a grand slam and a solo home run.Soler made it 4-3 with an RBI double in the fifth. He singled in the seventh off Michael Tonkin, who combined with Nick Anderson for two scoreless relief innings.The Braves forced three Miami errors on Thursday.",
        "\"You have to play pretty clean baseball to beat that team,\" Marlins manager Skip Schumaker said. \"We didn´t play as well as we should have today and kind of shot ourselves in the foot a little bit.\"Luzardo allowed six hits, four runs - three earned - walked three, including an intentional pass to Acuña, and struck out three in 5 2/3 innings.TOUGH COMPETITIONThe Marlins are 3-11 against the Mets and Braves this season and 13-5 vs. the rest of the league. After a three-game series at Atlanta in late June, the Marlins will not face either team until a September homestand in which they'll face Atlanta and New York in back-to-back series.TRAINERS ROOMBraves: Snitker said CF Michael Harris II is sore after landing awkwardly on his right leg during Wednesday's game, but isn't expected to go on the injured list. Harris was given the day off Thursday, but was available.ROSTER MOVESThe Marlins selected the contract of RHP Chi Chi Gonzalez from Triple-A Jacksonville and designated LHP Devin Smeltzer for assignment.UP NEXTBraves: LHP Max Fried (2-0) will start Friday against Baltimore after getting an extra day of rest.Marlins: RHP Edward Cabrera (2-2) will start Friday in the first of a three-game road series against Chicago.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}