{
    "articleURL": "/news/article-12056717/Inside-Archies-fourth-birthday-Sussexes-11m-Californian-home.html",
    "content": [
        "Archie's fourth birthday party was held at the couple's £11m Montecito homeSources claimed Meghan 'felt it would be inauthentic to do anything else'Prince Harry spent just over 28 hours in the UK to witness his father King Charles' Coronation before rushing back to California for his son Archie's fourth birthday party which featured Meghan's homemade lemon cake and celebrity guests.",
        "The Duke of Sussex, 38, was seen slipping out of Westminster Abbey straight after the service and headed straight for Heathrow Airport, in a blacked-out electric BMW, where he was escorted to the VIP Windsor Suite.Sources claim Meghan decided to have the celebrations at the couple's £11million home in Montecito, California, because 'she felt it would be inauthentic to do anything else'.Archie had a 'private celebration' with a lemon cake which was baked by the Duchess of Sussex using fruit from their garden, a source close to the couple said.The father-of-two reportedly skipped a post-coronation lunch at Buckingham Palace following the service, as sources said he was 'always determined to get back in time to spend part of Archie's birthday at home.' ",
        "Archie's grandmother Doria Ragland is thought to have attended Archie's birthday party, as well as Meghan's close friend, make-up mogul Victoria Jackson, 65.When asked if any of the party guests included celebrity neighbours such as Oprah Winfrey, a source said: 'Some of their friends are celebrities, so yes, that's likely. It will be a small, intimate gathering.'Her estranged father Thomas Markle, 78, told the MoS he believed 'it was for the best' that the Duchess stayed at home. 'There are too many disagreements between Meghan, Harry and the Royals,' he added.",
        "Mr Markle stayed up all night to watch the ceremony on TV at his home in Rosarito, Mexico. 'It was wonderful to watch the good people of Britain welcome their new King and Queen,' he said.",
        "Prince Harry wasted no time in leaving his father's coronation today, getting picked up from Westminster Abbey by a car that immediately headed out of London and was spotted at Heathrow Airport. The King's son was beaming as he climbed into a black vehicle immediately after the historic event this afternoon. The same car was then seen being escorted out of the capital by a police motorcade in the direction of Heathrow. Just hours earlier, he was seen awkwardly nodding at other guests as he endured a solo walk down the aisle to take his seat next to his cousins in the third row ahead of the arrival of his father and now Queen Camilla.During the service, as the congregation paid homage to the King, Harry was seen, along with the other royals around him, speaking the words: 'God save King Charles. Long live King Charles. May the King live forever.'Harry appeared to bow his head as the newly-anointed King walked past him on his way out of the abbey - although much of his true reaction was blocked by a feather on Princess Anne's hat. ",
        "But he returned to California after catching a British Airways flight from London Heathrow Airport within a few hours of the Coronation finishing.His abrupt return to the US meant he did not appear on the Buckingham Palace balcony for the finale of the day, with Buckingham Palace confirming earlier that he had no formal role at the event.The Duke of Sussex is believed to have boarded a 3.45pm flight from Heathrow Airport which would have seen him land in Los Angeles at 6.55pm local time.The drive to Montecito from Los Angeles airport takes about 90 minutes. The source said: 'Harry was determined to be back in time to tuck Archie into bed.'British Airways flight attendants confirmed that Harry had been on the flight but said they were not permitted to discuss the details of his trip.The prince had not been seen for over 24 hours after his arrival and accommodation plans remained shrouded in secrecy - before it emerged he had flown into the UK on a commercial American Airlines flight on Friday morning. "
    ]
}