{
    "articleURL": "/wires/reuters/article-12038555/DeSantis-signs-sweeping-anti-ESG-legislation-Florida.html",
    "content": [
        "By Isla Binnie and Ross Kerber",
        "May 2 (Reuters) - Florida governor Ron DeSantis signed into law on Tuesday a bill barring state officials from investing public money to promote environmental, social and governance goals, and prohibiting ESG bond sales.The bill is one of the furthest-reaching efforts yet by U.S. Republicans against sustainable investing efforts, and a clear political message from DeSantis, a likely presidential candidate.Republicans, including some from energy-producing states, say many executives and investors have lost their focus on returns as they take growing account of issues like climate change and workforce diversity.\"We want them to act as fiduciaries. We do not want them engaged on these ideological joyrides,\" said DeSantis just before he signed the bill at a webcast event.Analysts said the legislation goes further than other state anti-ESG bills, even as business groups worry the efforts pose financial risks. Florida's law now creates some questions of how it will operate in practice, analysts said.For instance, fund managers working for agencies like the state's big pension fund would have to include disclaimers in some communications with portfolio companies to make clear they do not reflect Floridians' views.Fund managers that don't include enough disclaimers could face regulatory action, said Joshua Lichtenstein of law firm Ropes &amp;amp; Gray. But, he added, \"It's an oddity to say you're only talking on behalf of some of your clients.\"",
        "The law also outlaws the sale of ESG bonds, a popular way to fund renewable energy projects or lower debt costs for borrowers if they meet gender diversity or greenhouse gas emissions targets.Lawyers and credit analysts said the new law could deny municipalities access to large pools of ESG-mandated capital. A further issue is how officials interpret the terms, said Thomas Torgerson, co-head of global sovereign ratings at DBRS Morningstar, which rates debt.\"If we as a rating agency cannot assess environmental, social or governance risk that creates a problem for us. There are climate and weather risks that are highly relevant, especially in a state like Florida, and would be captured in our assessment of credit risk,\" Torgerson said. (Reporting by Isla Binnie and Ross Kerber, Editing by Rosalba O'Brien)"
    ]
}