{
    "articleURL": "/sport/nrl/article-12052865/The-real-reason-Broncos-star-Reece-Walsh-lost-lunch-clash-against-Sea-Eagles.html",
    "content": [
        "Reece Walsh was 'unwell' before Sea Eagles clashYoung gun later revealed it was due to 'sticky spray'20-year-old recovered and was a standout for BroncosIs closing in on a State of Origin debut for Queensland Brisbane Broncos fullback Reece Walsh has revealed what made him unwell before Friday's clash with the Sea Eagles - and it wasn't due to nerves.",
        "Cameras caught the 20-year-old throwing up into a bin moments before kick-off at Suncorp Stadium - and post game, the Queensland State of Origin hopeful confirmed why he lost his lunch.'It's the sticky spray, it stinks,' he told Fox League reporter Jake Duke. 'I try to spray it on and not smell it, but it got me. 'The sticky spray mate, it's terrible.'Once it was show time, Walsh was at his dazzling best in Brisbane's 32-6 victory.",
        "He was a standout, finishing with two try assists, a line break, another line break assist and five runs for 143 metres.With Maroons coach Billy Slater watching on in the stands, Walsh was also impressive in defence, diffusing a number of aerial raids from the boot of Manly skipper Daly Cherry-Evans.Kalyn Ponga is the incumbent in the no.1 jersey, and while Queensland are renowned for their loyalty, Walsh can't do much more to get the nod.In contrast, the mood wasn't good in the Sea Eagles dressing room.Fullback Tom Trbojevic struggled in his return from injury - and addressed speculation he isn't fit.'I felt really good out there,' he said. 'I am obviously not playing the footy I want to play at the moment but there are no injuries holding me back. ",
        "'I just need to find some form.'Sea Eagles premiership-winning captain Paul Vautin didn't mince his words in commentary for Channel 9, declaring 'they couldn't play any worse if they tried.'The Broncos continue to be the yardstick in the NRL, while the Sea Eagles could drop out of the top eight after Magic Round is completed. "
    ]
}