{
    "articleURL": "/tvshowbiz/article-12038049/American-Idol-judge-shake-Two-popular-singers-temporarily-replace-Katy-Perry-Lionel-Richie.html",
    "content": [
        "READ MORE: Lionel Richie hits back at fans who were 'disappointed' by the singer's 'awful' performance at King Charles' Coronation concert  Katy Perry and Lionel Richie are among the acts who are set to be part of King Charles III's Coronation Concert.And as a result they are leaving two vacancies temporarily open from their American Idol judges panel as it was revealed that the two would be replaced by 'big time' guests.'",
        "It has since been revealed that they will be replaced by two very popular singers; one more known for their hits from the past and another who has had megahits more in the present day.One is Canadian-American and had incredible success throughout he 1990s including one of the most popular revenge songs of all-time while the other is a British singer who is currently a worldwide sensation with their highly-popular pop rock.Can you guess who these two hitmakers are?",
        "They are Alanis Morissette and Ed Sheeran!It was announced by ABC that the two would fill in the roles left by Perry and Richie as Morissette, 48,  will be pulling double duty as she will also be mentoring the contestants on the show who will also be performing her songs.Sheeran will not be mentoring but the remaining hopefuls will be performing duets of his songs.Morissette and Sheeran are also slated to perform with the Jagged Little Pill hitmaker performing one of her classics while Sheeran will be hitting the stage to do one of the songs on his latest album - (AKA Subtract). Perry and Richie were revealed to have been added to the lineup of The Coronation Concert last month.Their fellow judge Luke Bryan revealed days ago that they would be replaced by 'big time' guest judges as he spoke to Entertainment Tonight during the Stagecoach Festival on Saturday to promote the upcoming appearance of the guest performers.",
        "When Bryan was asked to give fans a bit of information about the guest judges, the singer remained tight-lipped. The singer-songwriter stated: 'It's big time. It's big time, but I cannot tease.' ",
        "Meanwhile, joining Perry and Richie at The Coronation Concert of King Charles III are Andrea Bocelli and Take That.Thousands of guests are expected to attend the historic event, including First Lady Jill Biden, who will serve as a representative of the United States.The Dark Horse singer previously spoke to Entertainment Tonight regarding her appearance at The Coronation Concert and joked that a 'hologram' was developed to fill in for her on American Idol.The hitmaker went on to speak about her connection to King Charles, with whom she has worked on various charitable efforts. ",
        "'I'm grateful I get to go. I met His Majesty to be a few years ago and he named me as one of the ambassadors to his organization, The British Asian Trust.'The singer added 'I'm also an ambassador for UNICEF, and it really aligned with my values.'Perry also described her opportunity to perform at the upcoming concert as 'so cool.'The Coronation Concert is currently scheduled to take place on Sunday, May 7. American Idol airs live coast-to-coast the same day on  Sunday, May 7 at 8 p.m. ET/5 p.m. PT on ABC."
    ]
}