{
    "articleURL": "/wires/reuters/article-12045927/Two-pupils-wounded-Serbia-school-shooting-critical-condition.html",
    "content": [
        "Teenager in custody after eight students and guard killed",
        "Serbians shaken by unprecedented school slaughterTwo critical among seven wounded in Wednesday's attackTeachers protest, students hold vigil(Rewrites throughout with reaction, latest developments)By Aleksandar VasovicBELGRADE, May 4 (Reuters) - Shocked Serbians mourned the nine victims of their nation's first mass school shooting on Thursday while teachers demanded better security and two wounded pupils fought for their lives.The suspected shooter, a 13-year-old boy, surrendered on Wednesday, police said, after taking two of his father's handguns to kill eight pupils and a security guard in a hallway and history class at their school in the capital Belgrade.A teacher and six pupils were also wounded in the shooting, with two still in critical condition.\"The girl who underwent an urgent surgery yesterday due to head injuries ... remains in critical condition and in intensive care,\" Sinisa Ducic, acting director at Tirsova hospital, told reporters.Milika Asanin, director of University hospital, said the condition of a severely wounded boy treated there had improved, but was still critical, Tanjug news agency reported.The others were stable.The unprecedented killing prompted the government to announce tougher curbs on gun ownership and to declare three days of official national mourning from Friday.Hundreds of schoolchildren with candles and flowers gathered for a vigil on Thursday evening in streets around the school, while churches planned memorial prayers.",
        "\"There are no words,\" said Aleksandra Zizic, a Belgrade schoolteacher in shock. \"We have spent the day yesterday with children to try and rationalise ... what happened.\"TEACHERS RALLYDrug tests on the teenage suspect, taken late on Wednesday at Belgrade's Military Medical Academy to see if he was under the influence, were negative, Tanjug said, quoting the suspect's family lawyer Irina Borovic.Dozens of high school teachers rallied in front of the Education Ministry in downtown Belgrade on Thursday, demanding improvements to school security and the education system.\"I have a child of that age,\" said Ninoslav Petrovic, a teacher and a union activist. \"This cannot be justified. School is an institution where such things must not happen.\"Ivica Dacic, Serbia's foreign minister and head of the co-ruling Socialist Party, said Education Minister Branko Ruzic, a Socialist, was ready to resign but said that would not address the social problem raised.\"The question is whether it will happen again, whether someone will copy it,\" he told local TV.Ruzic was not immediately available for comment.President Aleksandar Vucic on Wednesday announced a moratorium on new gun licences other than for hunting, a revision of existing permits, and enhanced surveillance of shooting ranges and storage of weapons.The Serbian Interior Ministry told gun owners on Thursday to keep weapons empty and locked up prior to police checks on storage cabinets and safes.",
        "The suspected shooter is under Serbia's age of criminal responsibility. He has been taken to a psychiatric institution for an evaluation and his father arrested.Lawyer Borovic said the father, whom she named as Vladimir Kecmanovic, would appear in court on Friday to face charges of endangering public safety. She said she would address the public after that. (Reporting by Aleksandar Vasovic, Ivana Sekularac and Fedja Grulovic; Editing by Sharon Singleton and Andrew Cawthorne)"
    ]
}