{
    "articleURL": "/news/article-12056015/Abandoned-tents-camping-chairs-Mall-cleared-rubbish-collectors-Coronation.html",
    "content": [
        "Crews this morning are cleaning up tents and camping chairs left along The MallFollow our live blog for all the latest updates on the King's Coronation Rubbish collectors are cleaning up abandoned tents and camping chairs left along The Mall after the coronation of King Charles III and Queen Camilla yesterday.",
        "Thousands of well-wishers lined the processional route from Westminster Abbey to Buckingham Palace to watch Charles and Camilla riding in the fairy-tale coach, wearing their crowns. Some had camped for days in the volatile spring weather to secure their spot along the central London street, turning the area into a make shift campground.Today crews are picking up rubbish and camping gear discarded by the royalists as the capital starts to return to normal following yesterday's historic ceremony.",
        "Equipped with grabbers and massive white bin bags, the volunteers made sure to collect all the rubbish left behind by the tens of thousands of royal fans who filled the Mall yesterday to celebrate as Charles, 74, ascended the throne. He had automatically succeeded his mother Queen Elizabeth II as monarch when she died last September, but was officially crowned king until yesterday. Rubbish crews were spotted along the Mall this morning, cleaning up the slew of litter - ranging from tents to empty cups, plastic bottles and forgotten sun hats - that had been left behind during yesterday's rain showers. Several bin lorries were sent out to collect the full bin bags from the volunteers and transport them quickly way from The Mall. It comes after volunteers and street staff, equipped with grabbers and massive white bin bags, took to the streets yesterday to tidy up after the royal spectacle.",
        "Charles was anointed and crowned yesterday in Britain's biggest ceremonial event for seven decades, a display of pomp and pageantry that sought to marry 1,000 years of history with a monarchy fit for a new era.In front of a congregation including about 100 world leaders and a television audience of millions, the Archbishop of Canterbury slowly placed the 360-year-old St Edward's Crown on Charles' head as he sat upon a 14th-century throne in Westminster Abbey.During the solemn two-hour service, elements of which date back to the time of King William the Conqueror in 1066, Charles' second wife Camilla was also crowned queen.A huge military procession followed, gun salutes were fired, thousands of soldiers roared three cheers, and there was a scaled-down flypast by military aircraft as the king and queen waved from the balcony of Buckingham Palace to cheering crowds who gathered on The Mall boulevard.",
        "The king and queen waved from the balcony to the sea of people who cheered and shouted 'God Save the king!' Despite the thousands of royalists who lined the Mall and assembled outside the Palace yesterday, not everyone who came to watch was there to cheer Charles on.Hundreds of republicans were seen booing and waving banners reading 'Not My King'. The Republic campaign group said its leader had been arrested, among 52 people detained as part of a 'significant police operation'. "
    ]
}