{
    "articleURL": "/wires/ap/article-12060193/Warren-Buffetts-company-keeps-selling-carmaker-BYDs-stock.html",
    "content": [
        "OMAHA, Neb. (AP) - Warren Buffett´s company continues selling off its stake in Chinese electric car manufacturer BYD and now holds less than 10% of the company's stock.",
        "Berkshire Hathaway revealed the latest sale of 1.96 million BYD shares worth about $58.9 million ($462 million Hong Kong dollars) Monday in a filing with the Hong Kong stock exchange. The Omaha, Nebraska-based conglomerate still owns more than 108 million shares, but that stake is less than half the size of the 225 million shares it held until it began selling last August.Buffett has yet to explain why he has been selling stock in a company he has praised so highly in the past, and he wasn't asked about it at Berkshire's annual meeting on Saturday. But Buffett doesn't generally comment on the stocks he is buying or selling while he is still making those moves.Since Berkshire first bought its BYD shares in 2008 for $225 million the company has grown into one of the world's largest electric car manufacturers and its stock price has soared to its current $240 Hong Kong dollars ($30.58 U.S. dollars) per share. BYD sold nearly 1.9 million cars last year including pure electrics, plug-ins and hybrids.Berkshire's original stake in the company that is based in the southern Chinese city of Shenzhen had come to be worth more than $9.5 billion last July (about $74.6 billion Hong Kong dollars) before it started selling. Even after all the stock sales, Berkshire's remaining holdings are still worth more than $3.3 billion (about $26 billion Hong Kong dollars).",
        "Disclosure rules only require Berkshire to reveal when its ownership stake decreases into another percentage point. At its last filing, Berkshire still owned 119.7 million BYD shares, or about 10.9% of the company.",
        "Besides BYD, Berkshire holds a massive portfolio of U.S. stocks worth more than $300 billion, led by its $159 billion Apple stake. It also holds large amounts of Bank of America, Coca-Cola and American Express stock.In addition to investments, Berkshire owns dozens of companies outright, including BNSF railroad, Geico insurance, several large utilities and an assortment of manufacturing and retail businesses such as Precision Castparts, Dairy Queen and Helzberg Diamonds."
    ]
}