{
    "articleURL": "/news/article-12058737/Charles-IIIs-coronation-features-pages-globe.html",
    "content": [
        "Numerous major newspapers around the world lead with pictures of CharlesMillions watched the proceedings unfold from all corners of the globeWhile Saturday's coronation of King Charles III was a largely British affair, people across the world awoke on Sunday to pictures of his crowning splashed across the front pages of their newspapers.",
        "Across Europe, in the United States and Canada, and on the other side of the globe in the likes of Thailand, Taiwan, Australia and New Zealand, the UK's newly crowned king dominated the newsstands.Amid all the pomp and pageantry, Charles and his wife Camilla were crowned at London's Westminster Abbey in Britain's biggest ceremonial event in 70 years.And as thousands of people turned central London red, white and blue - with a sea of Union Jack flags lining the streets - millions more watched from abroad.For many on foreign soil - having reduced the size of their own monarchies years ago, or removed them entirely - the concept of Britain's royal family may seem antiquated. However, the world's newspapers made it clear that the coronation would go down as one of 2023's truly global news events.Here, MailOnline looks at how the coronation was covered abroad... EUROPE ",
        "France may have rid itself of its own monarchy hundreds of years ago, but many across the country watched the goings-on across the Channel with keen interest.With their own head of state President Emmanuel Macron in attendance in Westminster, several of France's newspapers recounted the events to their readers on Sunday.Almost nine million people in France watched the live coverage of the coronation, according to The Times, confirming that many remain fascinated with the British royals who have often spoken of their close relationship with France.",
        "Macron sent his 'congratulations' to Charles and Camilla, calling them 'friends of France', and in the French press the tone was largely positive. Newspapers described Britain as festively uniting around its monarchy for the big day.Le Figaro described Saturday as a 'sumptuous and rainy coronation but without a false note'. It praised Catherine, Princess of Wales, as being 'radiant'.Le Dauphiné libéré, a provincial daily French newspaper known for its emphasis on local news and events, also strayed outside French borders for its front page after the coronation, leading with a picture of Charles and Camilla waving from the balcony at Buckingham Palace.'Crowned!', the headline read.France's daily newspaper Libération also led with a close-up picture of Charles on its Sunday edition, writing: 'Charles III. The Finally King.'It added: 'A whole life to wait and this Saturday, Charles was crowned during a sumptuous ceremony from another age. The British sovereign will have the task of modernising an institution that is less and less popular.'However, not all in France were as complimentary. Just weeks ago, Charles was forced to cancel a state visit amid on-going protests over Macron's pension age increase which has sparked huge outcry in the country.",
        "Jean-Luc Melenchon, leader of France's radical-left La France Insoumise party, described the proceedings as 'nauseating'.",
        "'In front of a people who have been so humiliated by neoliberal politics, this theatrics of a man covered in fancy dress with jewels and precious stones has something nauseating about it,' he said. He described France's television coverage of the coronation as 'syrupy', which he said was regrettable 'when so many people [in the UK] live in misery'.The coronation was also covered extensively in Germany, as was the controversy around the arrest of dozens of anti-monarchy protesters in London.Republican protesters - many dressed in yellow and waving banners saying 'Not my king' - had gathered at Trafalgar Square for the event. According to The Times, almost every major German publication covered the arrests.However, there was also wide-spread enthusiasm for the occasion, with one stately home reportedly selling out an afternoon tea event to watch the events.Charles was recently praised for his visit to Germany earlier this year where he gave a speech in German.On its front page, Bild splashed: 'Finally King at 74. This is the crowning glory.'The paper described the 'sweetheart' moment the King and Queen shared together as they were each crowned. The coronation 'brought the Royal Family closer together again', the paper said, writing that 'Charles seemed relaxed, focused and moved on the most important day of his life.'",
        "Many in Germany were particularly interested in Penny Mordaunt, who in her role as lord president of the privy council was in much of the footage from the abbey.Wearing a teal dress and cape, she was seen wielding two swords at different points in the proceedings, and led the King's procession.Newspaper Süddeutsche Zeitung described her as the 'secret star', while Stern magazine asked: 'Who's the lady with the sword?'Spain's own king, Felipe VI (who can trace his lineage back to Queen Victoria), was also in attendance on Saturday with his wife Queen Letizia. As such, Spain is no stranger to a monarchy. However, the proceedings in Britain still gained a great deal of attention in the press.Newspaper El Pais led with the news of the crowning of King Charles III on its front page on Sunday morning. It described the coronation as 'modernity, in moderate doses, mixed with pomp and tradition'.The publication, which leans to the left, also reported on the arrests of the protesters and the leader of the Republic organisation in particular.Expressen, one of the two evening newspapers in Sweden, found space for Charles and the coronation across the top of its Sunday newspaper. It zeroed in on some of the royal drama on display, writing about King Charles: 'The whisper to William... Ice cold to Harry'. It also reported on Victoria, Crown Princess of Sweden - saying she made a 'discreet tribute to Camilla'.",
        "UNITED STATES",
        "Like some in France, many in the United States remain fascinated with the British monarchy - despite ending British rule in 1783. Major news networks CNN, ABC, Fox News, CBS and NBC all carried live steams of the event.Much of press coverage focused on the traditions that date back hundreds of years,  and how they blended with the modern, diverse approach to a televised royal spectacle.'Charles Is Crowned King in Ancient Ceremony With Modern Twists,' the New York Times said in its headline after the event. 'The coronation, the first since Queen Elizabeth II's in 1953, was a royal spectacle of the kind that only Britain still stages,' it added. The New York Post, meanwhile, led with a picture of a crowned Charles on its front page, with coverage of the event across six pages of the newspaper.King Charles crowned in once-in-a-generation ceremony — marred by family drama,' the Post's headline read on its website - a nod to the fact that Prince Harry and Prince Andrew - both non-working royals - were in Westminster Abbey.Harry was also attending without his American wife Meghan Markle. Her relationship with the royals is a keenly-watched aspect of the family from across the pond. The Washington Post, meanwhile, questioned the relevance of the monarchy.",
        "'Many, especially the youth, are apathetic about the constitutional monarchy,' the newspaper said. 'A golden carriage is hard to square with a cost-of-living crisis.'The newspaper warned that the extravagant event might come back to haunt the King, suggesting that 'such an overtly religious and grand production might ultimately stoke debate about royal wealth and the value of a hereditary monarchy'.In its other coverage, the New York Times also struck a sceptical tone, and was criticised for engaging in 'British Bashing'.In their attempt to sum up the ceremony, the American paper labelled the coronation a 'cringing discomfort' and claimed it 'arrived with little fanfare'. ASIA",
        "In China, the state-owned Global Times reported that Chinese President Xi Jinping and his wife had 'sent a message congratulating King Charles and Queen Camilla on his coronation to the British throne'.But despite the flattering message, it was less complimentary about the United Kingdom itself, saying Charles has inherited 'an empire without its empire status.'The coronation, the newspaper suggested, 'has ushered UK into a new era, a turning point as the country has descended from a glorious empire, inherited by Queen Elizabeth II, to a country struggling with a cost of living crisis in part caused by the lingering fallout of Brexit, surging inflation and the impact of Russia-Ukraine crisis'.Hong-Kong's South China Morning Post was more kind, saying: 'The coronation was a typically British affair. It will not appeal to everyone. 'But the colourful ceremony, steeped in tradition, marked the beginning of a new era – and it is a good excuse for a party.'In Taiwan, The Merit Times led with a picture of King Charles wearing the crown, as he is assisted by the Archbishops. 'After 70 years of waiting, King Charles III takes the throne,' its headline read.English language newspapers in Malaysia also carried the news on their frontages. The country's Sunday Star reported on the 'pomp and splendour' of the celebrations.Singapore's Lianhe Zaobao wrote 'Charles III [was] crowned 'king beyond doubt'.'Meanwhile, India's The New Sunday Express wrote that there was a 'distinct Desi flavour' to the coronation of King Charles. AUSTRALIA &amp; NEW ZEALAND",
        "As nations in the commonwealth - and therefore who share Charles as their head of state - news outlets in both Australia and New Zealand covered the coronation in great detail. While the response from some there has been fairly ambivalent, Australia's Herald Sun Sunday and Sunday Telegraph had 'Long Live The King' splashed on their front pages - over the top of a waving Charles adorned in the crown.The Sunday Australian had a picture of Charles during the coronation ceremony, along with the words: 'Weight Of Destiny'. The New Zealand Herald's Sunday edition hailed 'our new king,' while the front page of its daily edition on Monday delved into the 'challenges ahead for King Charles III after coronation' in the article that it led with.'Once everyone has had their fill of Coronation quiche and the jovial mood dies down, the old problems that have long plagued The Firm will again return to the centre of attention,' the newspaper said. 'Even in the lead-up to this event, there were calls from indigenous leaders throughout the Commonwealth demanding an apology from the King for the effects of colonisation.' In the lead up to the coronation, Australian broadcaster drew some backlash by airing an hour-long panel discussion about King Charles and the monarchy which saw the relevancy of the monarch to Australia.Host Stan Grant said the invasion of Australia in 1788 was when the indigenous people of the country began suffering.'The Crown is not above politics to us, because the symbol of that Crown was, it represented the invasion, the theft of land, and in our case, the exterminating war which next year will mark 200 years,' he said."
    ]
}