{
    "articleURL": "/femail/article-12050055/Princess-Beatrice-husband-Edo-brother-law-Jack-Brooksbank-party-Chiltern-Firehouse.html",
    "content": [
        "Princess Beatrice, 34, was spotted making the most of Soho's nightlife last nightRead more: For all the latest Royal news, pictures and video click here Princess Beatrice seemed to have gotten a head start on Coronation celebrations last night as she joined her husband and brother-in-law for a evening out in Soho. ",
        "The 34-year-old royal was seen leaving Chiltern Firehouse with Edo Mapelli Mozzi, 39, and Princess Eugenie's husband Jack Brooksbank, 37. While Beatrice's younger sister Eugenie, who is heavily pregnant with her second child, didn't join in the fun, the group appeared in high spirits on the night out. The trio were joined by socialite Philip Sallon, who cheekily dressed as Beatrice's uncle King Charles in a nod to the Monarch's coronation tomorrow. Sallon is renowned for his role as a nightclub promoter and impresario through the early punk and New Romantic movements and was Boy George's chief collaborator before the pair had a falling out.",
        "Mother-of-one Beatrice is expected to attend a number of official events over the weekend as the UK crowns its new Sovereign. Beatrice looked stylish in a black dress, which she paired with a sparkly black and white bomber jacket. Beatrice wore the midi dress with the shimmery blazer, as well as a smart pair of heels and black tights. Her silky strawberry blonde locks were styled in a straight blow-dry that rested on her shoulders, tucked behind her ears. She also sported a natural makeup with a dash of eyeliner and mascara to bring the focus to her blue eyes. She flashed the cameras a wide grin as she made her way into the club with her husband Edo, who was dressed in a black-jeans-white-trainers combo with a navy sleeves jacket over a crisp white shirt. ",
        "Meanwhile, her brother-in-law donned a very casual pair of blue jeans which he paired with a white shirt and a green parka jacket. The trio looked happy with their time out on the town ahead of a weekend that will see them attend several events for King Charles' Coronation. Getting into the spirit of these royal festivities, socialite Philip Sallon donned his own regalia last night, donning a red and white cape with a white costume underneath and a toy crown. ",
        "Beatrice's cousin, the Prince of Wales, was also in Soho yesterday, albeit earlier in the day, where he joked that the family hadn't much planned for the historical weekend. He and the Princess of Wales travelled on the Elizabeth line to a rendezvous at the Dog and Duck pub where they pulled pints and spoke with staff. And afterwards the first-in-line to the throne left the crowd smiling after joking about the couple's plans for the Coronation of his father, King Charles III, this weekend.When asked by a member of the public if he had anything planned in the coming days, the Prince of Wales quipped: 'No, a very quiet weekend, nothing happening at all.'",
        "Earlier in the day Kate admitted the family were still getting 'all of the ducks' in a row before the big day, although they had noticed a 'wonderful' atmosphere and that excitement was 'already starting to build'.",
        "The Princess also revealed her three children were deeply immersed in the preparations, saying: 'The children are having their Coronation celebration at school today.'She added that their eldest child, Prince George, is 'excited' about the event and has been taking part in rehearsals as a page of honour at the Westminster Abbey service.Asked if he was looking forward to it, she replied: 'He is actually. Having done a few rehearsals, I think everyone is a bit more relaxed.'Outside the pub they met with cheering crowds of royal fans, who greeted them with shouts of 'We love you!' before the couple posed for selfies with the crowd.William appeared relaxed, telling one group who were discussing the newly opened Shambles Bar in Windsor: 'I love a cocktail! Best not to do it before the Coronation but maybe afterwards!'"
    ]
}