{
    "articleURL": "/tvshowbiz/article-12043865/Queen-Camillas-grandson-breaks-arm-carry-Coronation-duties-sling.html",
    "content": [
        "Their path to the throne can scarcely be described as conventional – and has certainly been far from untroubled. So I trust that King Charles and Queen Camilla won’t discern an ill omen in the accident that has befallen one of Camilla’s Pages of Honour – an accident which, I can reveal, will force him to carry out his duties one-handed at the Coronation on Saturday.",
        "The lad in question is Gus Lopes, 13-year-old son of Camilla’s daughter, Laura, and her husband, Harry Lopes. Abetted by his twin brother, Louis, and their cousin, Freddy Parker Bowles, 13, Gus will be responsible for holding aloft his grandmother’s Coronation robes – likely to weigh as much as 15lbs, as Queen Elizabeth’s did in 1953 – as she progresses down the aisle at Westminster Abbey.Gus will have to manage this without the use of his right arm, which will be in a sling – just as it was earlier this week when he and Louis were at Buckingham Palace for rehearsals. ‘Gus broke his arm in a bike accident while on holiday,’ a family friend tells me. ‘The cast has been removed, but he must have it in a sling on the big day.’",
        "Though this is far from ideal, Gus has the appreciable consolation of being completely at ease with his step-grandfather. The bond between them developed when Gus and Louis were very young, as Camilla explained to my colleague Rebecca English six years ago.‘When we are with my husband in Scotland, he reads them Harry Potter,’ said the then Duchess of Cornwall. ‘And he does all the voices, because he is a brilliant mimic. They sit spellbound. They love it.’",
        "More recently, Gus and Louis and their sister, Eliza, 15 – youngest bridesmaid at Prince William and Kate Middleton’s wedding in 2011 – were among the extended family group at Sandringham, in Norfolk, over Christmas.Should Gus seek inspiration for remaining steady on parade on Saturday, he need only think of the bravery and stoicism of his great-grandfather, Camilla’s father, Bruce Shand, who was awarded two Military Crosses, as well as being wounded, during his wartime service.Gus’s grandfather, Brigadier Andrew Parker Bowles, who commanded the Blues and Royals, will be in the abbey to provide him with encouragement."
    ]
}