{
    "articleURL": "/wires/reuters/article-12053219/Anthony-Santander-launches-2-homers-Os-pound-Braves.html",
    "content": [
        "Anthony Santander hit a pair of home runs, including his first career grand slam, to help the visiting Baltimore Orioles beat the Atlanta Braves 9-4 on Friday to open their three-game series.",
        "The Orioles have won 14 of their last 17 games and improved to 11-0 in series openers.Santander gave the Orioles a lead with a solo homer in the fourth inning off Atlanta starter Max Fried, and he put the game away with his slam in the seventh inning against Joe Jimenez. Santander has five homers for the season.Santander went 2-for-5. Over the last four games, he's batting .421 (8-for-19) with multiple hits in all four.The support made a winner out of Dean Kremer (3-1), who bounced back from a poor outing against Detroit to work six strong innings. He gave up one run on six hits, two walks and three strikeouts in his first career appearance against Atlanta.Fried (2-1) saw his streak of scoreless innings end at 20. In six innings, he allowed seven runs (five earned), on eight hits, two walks and seven strikeouts. The left-hander gave up two home runs, the first he has allowed all season. Fried, a three-time Gold Glove winner for the last three seasons, also made two throwing errors that led to runs. Fried's ERA jumped from 0.45 to 2.08.The Braves scored in the first inning on Sean Murphy's RBI single.The Orioles tied the score in the third when Ryan McKenna singled, went to third when Fried's pickoff attempt went wide, and scored on Gunnar Henderson's grounder. Baltimore took a 2-1 lead in the fourth on Santander's first homer.",
        "The Orioles sent 13 men to the plate in the seventh inning and scored seven times. Cedric Mullins homered to right field, his fourth, to lead off the inning, and added an RBI single in his second at-bat of the inning to supplement the grand slam.Murphy added his ninth homer, a three-run shot, in the seventh inning to cut the lead to 9-4.--Field Level Media"
    ]
}