{
    "articleURL": "/wires/ap/article-12051879/New-week-Jonas-Brothers-Muppets-Bennifer-Air.html",
    "content": [
        "New music from the Jonas Brothers, a double feature of Ben Affleck/Jennifer Lopez films and the latest installment in the highly popular Zelda games are among the entertainment titles coming to a device near you this weeke Associated Press' entertainment journalists break down what's arriving on TV, streaming services and music and video game platforms this week.",
        "NEW MOVIES TO STREAM- After successfully doing the rounds in theaters, \"Air\" is finally making its debut on Prime Video on Friday. The film, directed by Ben Affleck and written by Alex Convery, tells the origin story of the Air Jordan sneaker and how Nike´s then-struggling basketball department defied the odds and signed rookie Michael Jordan in an unprecedented deal. It´s the first time Affleck has directed his pal Matt Damon, who plays Nike executive Sonny Vaccaro, and it´s the first film from their joint company Artists Equity. They brought in a starry cast, including Viola Davis as Michael Jordan´s mother, Deloris, as well as Jason Bateman, Chris Tucker, Chris Messina and Marlon Wayans, and it has been widely praised for its well-told story - smart, adult and solidly entertaining.- Or you can watch Affleck´s better half, Jennifer Lopez, in her new movie \"The Mother,\" about an assassin who comes out of hiding to protect a 12-year-old daughter she hasn´t seen for years. Unlike her recent action rom-com \"Shotgun Wedding,\" this is a more straightforward action thriller. \"The Mother\" was directed by Niki Caro (\"Mulan,\" \"Whale Rider\") and co-stars Joseph Fiennes, Lucy Paez, Omari Hardwick, Paul Raci and Gael García Bernal. It hits Netflix on Friday. (Read AP's review here.)",
        "- Also on Hulu on Friday there is \"Saint Omer,\" which may be the opposite of a feel-good Mother´s Day weekend movie, but is one of the best movies to be released this year. It is a penetrating and restrained portrait of a matricide trial that will leave you moved and changed. It comes from a true story, fictionalized and dramatized by French documentary filmmaker Alice Diop, in this unconventional courtroom drama. In her review for AP, Jocelyn Noveck wrote that Diop \"has taken us further into the emotional, social and moral crevices of this real-life case than any documentary could. And we´re much the better for it.\"- AP Film Writer Lindsey Bahr",
        "NEW MUSIC TO STREAM- Jonas Brothers have been super-busy lately - a stint on Broadway, appearances on \"Saturday Night Live\" and \"The Tonight Show Starring Jimmy Fallon\" and now a new album, called simply \"The Album,\" out Friday. The trio have released the singles \"Wings\" and \"Waffle House,\" an ode to the place they would go to decompress and connect. They may need the waffle house soon: The brothers have a one-night-only show at Yankee Stadium on Aug. 12 where they´ll perform five albums in one night.- With \"Resound NYC,\" Moby reimagines and orchestrates 15 of his old tracks written or recorded in New York from 1994 to 2010, with guest vocalists including Gregory Porter, Margo Timmins and Amythyst Kiah. The songs include \"Helpless,\" \"In My Heart\" and \"Run On.\" Moby adds a swell and depth to \"In This World\" and the new \"South Side\" featuring Ricky Wilson of Kaiser Chiefs is radically different. Says Moby: \"Rather than having every song receive the same orchestral treatment, I kind of built a bespoke orchestral approach for each song.\"",
        "- PBS´ \"Great Performances\" is celebrating 50 years of Broadway with a concert. Hosted by two-time Tony winner Sutton Foster, the special has Sara Bareilles singing \"She Used to Be Mine\" from \"Waitress\" and Chita Rivera performing \"All That Jazz\" from \"Chicago.\" There´s a tap number from \"Jelly´s Last Jam\" performed by Corbin Bleu, a tribute to \"A Chorus Line\" and André De Shields performing \"So You Wanted To See the Wizard.\" Additional stars include Shoshana Bean, Raúl Esparza, Ledisi, Norm Lewis, Rob McClure, Patina Miller, Brian Stokes Mitchell, Jessie Mueller, Jessica Vosk and Vanessa Williams. It premieres Friday on PBS, pbs.org/broadwayonpbs and the PBS app.- AP Entertainment Writer Mark KennedyNEW SERIES TO STREAM- Move over Kermit and Miss Piggy, the house band for \"The Muppet Show,\" called Dr. Teeth and the Electric Mayhem, moves center stage with their own show for Disney+ called \"The Muppets Mayhem.\" It follows the group - including Animal, Lips, Janice, Zoot, Floyd and, of course, Dr. Teeth - as they record a long-awaited album. The series is presented mocumentary-style with Lilly Singh as a music executive tasked with keeping the band on track. It´s got vibes of \"Spinal Tap\", \"Daisy Jones &amp; The Six\" and, of course, \"The Muppets.\" Guest stars include Tommy Chong, Lil Nas X, Tommy Lee and Kesha. All 10 episodes drop Wednesday.",
        "- The use of artificial intelligence, also known as A.I., has become a hot topic in sectors including the government, education, and even the Hollywood writers´ strike, over questions of security, ethics, privacy, and labor. It´s also the focus of a new limited series called \"Class of ´09\" coming to FX on Hulu on Wednesday. Brian Tyree Henry and Kate Mara portray FBI agents in the story, which unfolds over three timelines. Throughout the show, questions arise throughout over the use of A.I. in law enforcement and whether it makes us safer or strips people of autonomy.- The new crime drama \"City on Fire\" for Apple TV+ is inspired by a novel of the same name by Garth Risk Hallberg. The series stars Jemima Kirke, Nico Tortorella and Chase Sui Wonders and is set in 2003 and kicks off with the murder of an NYU student. The investigation reveals a connection to a series of fires in New York, the city´s music scene, and a wealthy family. \"City on Fire\" debuts Friday.- Alicia RancilioNEW VIDEO GAMES TO PLAY- The last time Nintendo released a Legend of Zelda game - 2017´s Breath of the Wild - it pretty much reinvented the franchise and won just about every Game of the Year prize around. So expectations are high for The Legend of Zelda: Tears of the Kingdom. Our hero, Link, has another grueling journey ahead across the sprawling land of Hyrule, but first he gets to visit a bunch of mysterious islands that have popped up in the skies overhead. Link can also build structures and vehicles, add exotic powers to his weapons, pass through solid objects above him and even reverse time. Even with all the tricky puzzles usually found in a Zelda game, how can he lose? His old enemy Ganondorf will probably have something to say about that, starting Friday on Nintendo Switch.",
        "- Perhaps you´re one of those gamers who finds Zelda a little too cheerful. Red Hook Studios has just the antidote: Darkest Dungeon II, the sequel to the hopelessly grimdark role-playing adventure that tormented us all in 2016. The twist, again, is that not only do you have to fight monsters, you have to stave off illness, starvation and your own impending psychosis. Red Hook promises an even deeper and darker dungeon - 500 feet under! - as well as new enemies and a new gang of desperate fortune hunters willing to risk their sanity. If you´re that type of masochist, you can dig in Monday on PC.- Lou Kesten___Catch up on AP´s entertainment coverage here: https://apnews.com/apf-entertainment."
    ]
}