{
    "articleURL": "/wires/ap/article-12051309/King-Charles-III-surprises-crowd-outside-Buckingham-Palace.html",
    "content": [
        "LONDON (AP) - King Charles III surprised cheering fans who started gathering outside Buckingham Palace on Friday, a day ahead of his coronation, as final touches were made in preparation for an occasion that London hasn´t celebrated in 70 years.",
        "People in the crowd screamed his name as Charles stepped from a chauffeur-driven Bentley wearing a blue suit. One person could be heard yelling \"God save the king\" as the British monarch approached the throng lined up behind a barricade.Charles thanked the well-wishers for coming, shaking hands as he slowly moved along the line.Theresa Iredale, wearing a plastic crown, said she trembled when the king approached her after she screamed his name.\"I saw his hand coming out to mine and I was like, `I can´t believe I´m shaking the king´s hand,´\" she said.Prince William, heir to the throne, and his wife, Kate, also greeted the public during the walkabout, talking to fans on the opposite side of The Mall, posing for selfies and chit-chatting.",
        "The royals made the stop after a luncheon that followed the final rehearsal for Charles' Saturday morning coronation service at Westminster Abbey.Charles ascended the throne automatically when his mother, Queen Elizabeth II, died last year. The religious ceremony of the coronation represents his formal crowning.The celebration has been months in the making, choreographed down to the finest detail and includes a huge security operation.Beyond the massive planning, Charles is trying to remain relevant as support for the monarchy has waned, particularly among a younger generation that cares less about its traditions. His crowning takes place as some question the large expense of public funds - with no estimate provided yet - during a cost-of-living crisis that has left many Britons struggling.",
        "On Thursday, William and Kate, the Prince and Princess of Wales, took a subway train and visited a pub in Soho as part of the lead-up to the coronation.The crowd outside the palace has been growing for several days, with visitors from around the world assembling to witness history as the latest monarch is crowned in a tradition that dates back more than 1,000 years.Fans of the royal family were decked out in the red, white and blue of the Union Jack, waving flags, wearing full outfits made of the distinctive pattern and one man had it painted on his face.Many of those assembled had already camped out or planned to spend the night hoping for a prime perch for the procession Saturday and maybe a view of the newly crowned monarch and Queen Camilla, his wife, waving from the balcony of the palace after returning from the ceremony.Those who only expected a fleeting glimpse of the king, were richly rewarded to get to meet him in person.\"Absolutely amazing, just surreal,\" said Gillian Holmes.\"My daughter said her legs were shaking, she was in shock,\" Holmes said. \"I never ever dreamt that I would meet the king. I can´t believe it.\"Throughout the day, rail travelers throughout the United Kingdom were greeted with a recorded message from the king as they boarded trains wishing them and their families \"a wonderful coronation weekend.\"",
        "The message concluded with Charles providing the familiar warning passengers get before they board or leave subways and trains: \"And remember, please mind the gap.\""
    ]
}