{
    "articleURL": "/wires/ap/article-12046451/Anxiety-knocks-regional-banks-shares-slump.html",
    "content": [
        "NEW YORK (AP) - Uncertainty continues to pummel the banking industry, despite assurances from financial regulators and bankers such as Jamie Dimon this week that the worst of the recent crisis is over and the health of the banking system remains strong.",
        "Bank shares have sold off on Wall Street this week following the government seizure and subsequent sale of First Republic Bank to JPMorgan. It was the second-largest bank failure in U.S. history and the third failure of a midsize lender in two months.While many thought the sale of First Republic \"would stop the `who´s next?´ conversations, investors are clearly continuing to focus on remaining players that are deemed the weakest\" analysts at UBS wrote in a note to clients.The bigger worry is that the bank failures might lead to doubts about relatively healthy banks, creating a financial contagion that could impact the wider economy. Averting that scenario was the reason the U.S. put tighter restrictions on major banks following the financial crisis 15 years ago.It is difficult to ignore the sense of unease in banking right now, though there´s no need for concern if your money is in a bank insured by the Federal Deposit Insurance Corp. and you have less than $250,000 there, which covers most accounts.Bankers and regulators have tried to reassure investors that the worst of the crisis is past, to little avail. JPMorgan's Dimon said Monday that he believed \"this part\" of the banking crisis was over. Federal Reserve Chair Jerome Powell vouched for the health of the financial system on Wednesday.",
        "A renewed sell-off Thursday focused on PacWest Bancorp and Western Alliance Bancorp, two smaller regional banks whose shares have been under pressure since Silicon Valley Bank failed in mid-March and set off the current crisis. PacWest fell 51% after acknowledging it was considering putting itself up for sale.PacWest was targeted because of a high concentration of large, uninsured deposits from venture capital and tech clients, the same type of customers who triggered bank runs at Silicon Valley and First Republic. The UBS analysts estimate that about 23% of PacWest's deposits come from the venture capital and tech space.But even Midwest regionals such as Comerica and KeyCorp are down more than 20% this week. That could reflect growing concerns about large amounts of real estate loans, particularly in the office property market, which continues to suffer the effects of the pandemic.PacWest, based in Los Angeles, and Western Alliance, in Phoenix, each issued a statement overnight saying they weren´t experiencing any out-of-the-ordinary deposit withdrawals following the sale of First Republic. Both saw significant withdrawals following the failure of Silicon Valley Bank, but the banks say deposits have increased since March 31.Western Alliance issued a separate statement Thursday morning denying a story in The Financial Times that said the bank is considering a sale. Its shares fell 38%.",
        "Investors may fear that PacWest´s fate could mirror that of First Republic, which spent weeks looking for a buyer before failing. First Republic also catered to a wealthy clientele, many who rapidly pulled deposits when Silicon Valley failed. The rapid rise in interest rates over the past year had also reduced the value of large loans the bank issued when rates were much lower.\"The underlying issue, particularly at these banks, is their asset and deposit mix isn´t sustainable. Deposits keep running out the door or banks are having to pay hefty prices for them,\" said Chris Caulfield, a banking industry consultant with West Monroe who has worked with many of the regional banks in trouble.In another sign of potential trouble, a major deal in the banking sector was called off Thursday. TD Bank Group and First Horizon Corp. said they called off a planned merger, citing regulatory hurdles. Toronto-Dominion Bank had said in February that it was buying regional bank First Horizon in a $13.4 billion all-cash deal.The Federal Reserve's fight against inflation has played a key role in the banking turmoil. The Fed on Wednesday raised its key interest rate by a quarter-point to the highest level in 16 years as part of that campaign, its tenth consecutive rate hike.",
        "The higher rates have prompted depositors to move money into higher-paying certificates of deposit and money market funds. They also played a role in the slowdown in the tech industry, which had major implications for West Coast banks such as Silicon Valley.Chair Jerome Powell said the Fed would monitor several factors, including the turmoil in the banking sector, in deciding its next move on rates.The Fed chair stressed his belief that the collapse of three large banks in the past six weeks will likely cause other banks to tighten lending, and that would help the Fed in its inflation fight. The Fed's rapid rate hikes over the past year have started to slow the economy, and a number of economists expect a recession late in 2023 or in early 2024.Powell also said he agreed with the conclusions of a Fed report issued last week that said lapses in supervision contributed to the demise of Silicon Valley Bank, and recommended stricter regulation of the banking industry.JPMorgan anticipates bank stocks will continue to be pressured due to regulatory and economic uncertainty, among other factors.\"Regulatory concerns primarily would translate into how much banks need to add to capital, liquidity, and debt, all of which would strengthen them longer term but hurt (earning per share),\" analysts said in a note."
    ]
}