{
    "articleURL": "/tvshowbiz/article-12052221/Teresa-Giudices-daughter-Gia-22-flashes-fit-figure-bikini.html",
    "content": [
        "Reality TV star Gia Giudice has certainly taken after her famous mother Teresa Giudice of Bravo fame.",
        "The 22-year-old college student was seen posing in a skimpy bikini by a rocky shoreline in her latest Instagram post shared on Friday.Her figure looked very toned as she showed off a deep tropical tan while her highlighted hair was worn down over her bare shoulders and she added dark sunglasses. Her caption read, 'Baha' as her dad shared, 'Hi my love ❤️❤️❤️❤️❤️.'The TV star is following in the footsteps of her mother Teresa Giudice of Real Housewives Of New Jersey fame.Teresa often shows off her yoga-toned body in swimwear while on vacation in spots like St Barts and Positano with her new husband Luis.",
        "In April the social media personality took to Instagram to share photos from the Shein Festival that took place in California.The Bravo star was dressed to impress in a colorful string bikini top and matching mini skirt that made the most of her impressive figure.The daughter of Real Housewives of New Jersey vet Joe  Giudice also went Coastal Countrygirl with her ivory cowgirl boots and coordinating hat.This comes after the college student from New Jersey was seen last week in Miami in a pink and purple bikini. While at the Shein event she shot several images that she shared with her nearly 1million Instagram followers.",
        "And she left a note for her fans in her caption. 'SHEIN festival day 1 @sheinofficial @shein_us #Zeuphoria #SHEINpartner Use my code ‘GIA’ for 15% off the SHEIN site!' she said, making it clear she is a paid model for the brand,Her mom Teresa left a comment as well. ",
        "'Wow amazing,' typed the cookbook author, adding three fire emojis.Last week Gia was in a bikini.The social media figure opted for a pair of white Nike Air Force One sneakers and matching sunglasses.She accessorized with several pieces of jewelry, and her gorgeous brunette hair fell onto her chest and contrasted perfectly with the brighter tones of her clothing.Giudice shared a set of throwback photos from her recent trip to Miami on her Instagram account last month.In the shots, the reality television figure posed next to an ornate mosaic for a trio of snaps taken in the bathroom of Sexy Fish Miami.The influencer wore black crop top that exposed a slight portion of her toned tummy and a matching pair of form-hugging leggings.She kept a Christian Dior purse slung over her right shoulder and accessorized with several pieces of jewelry during her visit to Miami.Her dark brunette hair remained free-flowing and cascaded onto her chest.",
        "The social media figure referred to the restaurant's bathroom as the 'best picture spot' in her post's caption. ",
        "Giudice, who studies at Rutgers University in her native New Jersey, opened up about her plans for the future during an interview with Bravo.The reality television personality stated: 'After I graduate, I am pursuing my dream of going to law school.'The influencer did express, however, that she was planning on branching out into the fashion world in the near future. 'My hope for the future is to become a very successful lawyer and have a lucrative clothing business on the side,' she stated. "
    ]
}