{
    "articleURL": "/tvshowbiz/article-12048777/Pregnant-Karlie-Kloss-shows-growing-baby-bump-steps-New-York.html",
    "content": [
        "Karlie Kloss showed off her growing baby bump while she stepped out in New York City on Thursday. ",
        "The 30-year-old fashion model - who revealed her pregnancy at the Met Gala earlier this week - wore a flattering $ 1090 Dion Lee cut-out backless gown with heels.The former Victoria's Secret Angel styled her brunette tresses in flowing waves over her shoulders with a glamorous makeup palette, including blush and smokey eyes.This will be the second child for Karlie and her businessman husband Joshua Kushner, 37, who accompanied her to the Super Bowl of fashion, where she proudly debuted her pregnancy on Monday.  The couple welcomed their first child - son Levi, who is now two - in March 2021.  ",
        "Kloss looked stunning in a skintight black gown that clung to her curves as she hit the red carpet holding her husband's hand at the Metropolitan Museum of Art.The runway sensation accessorized her look with diamond earrings and a coordinated five-tier pearl necklace and belt. Following the Met Gala, Karlie changed into a sheer minidress featuring netting and a cinched-in waist as she headed to an afterparty with her other half.The Chicago native took to Instagram to show off her preparation for the event.Wearing a cozy white robe, Karlie was seen prepping her skin with a violet light Therabody machine in a clip posted to her Stories.She also posted a cute snap of her toddler son reaching for her tummy as she got ready.",
        "She also showed off her makeup and shared a mirror selfie taken in a bathroom while preparing for the big night.Karlie and Joshua - whose brother and sister-in-law are Jared Kushner and Ivanka Trump - were first spotted spending time together during an afterparty for the 2012 Victoria's Secret Fashion Show.They waited a whole year before making their initial public appearance as a couple. The duo went Instagram official with their relationship in 2014.",
        "Although the two fielded rumors of an engagement in 2017, they initially shut down the idea before they decided to begin planning their marriage the following year, with Karlie converting to Judaism.Kushner and Kloss made their union official during a wedding ceremony that was held in October of 2018, and they had a second event in June of 2019.In November of 2020, the supermodel confirmed that she was pregnant with a video shared to her Instagram during which she showed off her then-growing baby bump.She eventually gave birth to Levi Joseph in March of 2021."
    ]
}