{
    "articleURL": "/wires/pa/article-12053553/Wales-marks-King-s-coronation-public-screening-church-bells.html",
    "content": [
        "A public screening of the King and Queen’s coronation will take place in the Welsh capital while church bells ring out and dozens of street parties are held across the nation.",
        "Up to 2,000 people will mark the occasion at Cardiff Castle, where visitors will watch the coronation service and processions to and from Westminster Abbey.The event is free to enter but spaces will be offered on a first come first served basis when gates open at 9.30am.",
        "A royal gun salute will be carried out by the 104 Regiment Royal Artillery, while regimental mascots from the Royal Welsh and The 1st Queen’s Dragoon Guards with a quarter guard, Welsh Guards and the Regimental Band and Corps of Drums of the Royal Welsh will be in attendance, along with representatives from the Royal Navy and the RAF.Lord Mayor of Cardiff Graham Hinchey said: “The coronation of a new monarch is an event of great national significance, and one that will undoubtedly be remembered long into the future.“As the capital city of Wales, a country that is close to King Charles III’s heart, Cardiff is proud to host this series of wonderful events to mark the occasion.”The Church in Wales called it a “significant and happy” occasion.The bells at Llandaff Cathedral in Cardiff will ring for two hours before the ceremony at Westminster Abbey begins at 11am.",
        "At St David’s Cathedral, Pembrokeshire, the bells will ring for the ceremony.",
        "The Archbishop of Wales, Andrew John, and the bishops of Swansea and Brecon, St Asaph, Monmouth and Llandaff sent their “warmest congratulations” to the royal couple.Mr John will present Charles with the Sceptre with Dove during the ceremony. The Cross of Wales will also be carried before the King at the head of the coronation procession.In a statement the bishops said: “The coronation of their majesties the King and the Queen is a significant and happy occasion for our nation and for the Commonwealth, and we know people from across the world will be joining us in praying for our new King and Queen.”Organisers of street parties and town events will be hope the rain, which is forecast for most of the day, does not make their events a washout.One event will be a beach party in Barmouth, Gwynedd, where a Big Lunch is due to be held on the seafront followed by DJs.",
        "A number of events in Wales have already been cancelled, including an outdoor screening of the coronation at Friars Walk shopping centre in Newport.Another is at Caldicot Castle in Monmouthshire, after organisers failed to raise £3,000 to cover costs.In an online post, Caldicot Town Team said a crowdfunding page had been running for 16 days, but despite being promoted on social media it had “failed to raise any money whatsoever”.",
        "A coronation party in Caldicot’s town centre was also cancelled after organisers failed to raise the funds needed to cover costs amid a “lack of interest” from the community.A “Not My King” protest will take place in Cardiff, with organisers Cymru Republic asking people to gather by the statue of Aneurin Bevan in Queen Street from 12.30pm.",
        "They will march through the streets before heading to Bute Park stone circle for a Big Republican Lunch.It will coincide with similar anti-monarchy protests expected to take place across the UK during the coronation.One of the organisers, Welsh politician Bethan Sayed, said: “This is not just about attending a protest, it’s about starting a conversation with people in Wales about what the royal family is, what the monarchy represents, and what we could do differently in Wales should we want to.“The crux of it is that we don’t believe there should be the institution of a monarchy in our democracy and we want to look at growing within the 21st century to have a system where young people are treated on an equal basis and people are not left in poverty or have to be subjects of a family that are born into their position.”Ms Sayed led a similar protest during Charles’s last visit to Wales after his accession to the throne, which is said to have attracted around 500 people and made international headlines.",
        "She said the group had not received letters from the Home Office – as the organisers of London’s planned protest, Republic, did last week – but said they had been in communication with South Wales Police.",
        "Chris Truscott, the force’s chief superintendent said: “Officers will be on patrol across South Wales this weekend to ensure that our communities can enjoy the coronation bank holiday safely.“We are aware of a demonstration which is planned to take place in Cardiff city centre on Saturday and officers will be on duty to facilitate a peaceful demonstration and minimise disruption to the wider community.”Over the last week, a Royal Mail postbox in Cardiff that was decorated in Union flag colours in celebration of the King’s crowning has been vandalised with republican and Welsh independence stickers.Complaints were made and the stickers have been moved, but the the location of the box – one of four around the UK – has drawn criticism as it is outside the historic Owain Glyndwr pub in St John Street.Glyndwr was a Welsh hero who fought against English rule in the late Middle Ages. His 15-year revolt means he is often referred to as “the last Prince of Wales” and is seen as a symbol of Welsh nationalism.",
        "Welsh First Minister Mark Drakeford will attend the service in Westminster alongside world leaders, but the country’s Llywydd – speaker of the Senedd – Elin Jones declined the invite saying “as a republic” it was “for others to celebrate a coronation”."
    ]
}