{
    "articleURL": "/tvshowbiz/article-12049117/Julie-Bishop-turns-heads-2-200-floral-dress-Zimmermann-attends-Coronation-banquet.html",
    "content": [
        "Julie Bishop is in London and preparing to celebrate the Coronation of King Charles on Saturday after making the exclusive guest list. ",
        "And on Thursday, the glamorous former Minister for Foreign Affairs, 66, attended a Coronation banquet in the U.K capital. For the evening, Julie looked incredible in a $2,200 dress by the brand Zimmermann, which featured a small plunging neckline, a floral design and a tiered skirt. Julie shared a picture on Instagram to her 106,000 followers, writing: 'Let the celebrations begin! Coronation banquet. Guildhall City of London.'The Coronation is set to take place on Saturday, May 6, at Westminster Abbey. ",
        "Julie revealed earlier this week that she's 'honoured' to be attending the historic event, that will see Charles III and his wife, Camilla, officially crowned as King and Queen of the United Kingdom and the Commonwealth.She shared a picture of her invitation and wrote: 'I am honoured to be invited and I will be present at Westminster Abbey on Saturday 6 May 2023 at 11am to witness the coronation of Their Majesties King Charles III and Queen Camilla - history in the making.'Julie is attending as she is the Chair of the Princes Trust in Australia, which helps young people find employment. ",
        "She will be joined by 18-year-old Tayla Green-Aldridge who is a graduate of the Prince's Trust Australia Get Into Maritime course.King Charles founded the charity in 2013 with Julie holding the title of chair.",
        "Julie, Nick Cave and soccer superstar Sam Kerr are among a handful of Australians invited to King Charles III's Coronation this weekend.",
        "Prime Minister Anthony Albanese and his partner Jodie Haydon will lead the group of Australians attending the ceremony at Westminster Abbey, in London, on Saturday.Some 2,200 people from around the world are on the guest-list with Australia's Governor General David Hurley and his wife Linda among those invited.Kerr was awarded an Order of Australia for her service to football last year and she not only captains the Matildas but excels as a forward for the Chelsea Football Club.Cave was named an Officer of the Order of Australia for distinguished service to the performing arts, both nationally and internationally in 2017, and will also be present at the coronation.",
        "Ms Sam Kerr OAMMs Leanne Benjamin AM OBEMr Nick Cave AOMs Jasmine CoeMr Adam Hills MBEDr Daniel NourMiss Yasmin PooleMs Emily ReganMs Minette SalmonMs Claire Spencer AMProfessor Merryn VoyseyCorporal Daniel Keighran VCMr Richard Joyes CVMs Yvonne Kenny AMJulie BishopTayla Green-AldridgeAnthony Albanese and Jodie HaydonDavid Hurley and Linda Hurley "
    ]
}