{
    "articleURL": "/news/article-12047889/Navy-scrambles-ship-Russian-warship-spotted-stalking-UK-coast.html",
    "content": [
        "Type 23 frigate - described as 'core of the front-line Fleet' - set sail for North SeaTail five Russian warships, spotted leaving the Baltic on course for UK watersAll equipped with Kalibr cruise missiles, capable of carrying nuclear warheadsA Royal Navy warship has been scrambled to tail Russian warships capable of carrying nuclear weapons spotted stalking the UK coast.",
        "The Type 23 frigate - described by the Navy as the 'core of the front-line Fleet' - has set sail for the North Sea.It will tail the five Russian vessels, which have been spotted leaving the Baltic on course for UK waters.The flotilla includes five warships, with two extra support vessels arriving in waters off the UK today.All are equipped with deadly Kalibr cruise missiles, which are capable of carrying nuclear warheads and have been used frequently in Ukraine.",
        "A Ministry of Defence spokesperson told MailOnline: 'We monitor activity within UK waters and its Economic Exclusion Zone, routinely providing a suitable presence to counter and deter threats.'",
        "They added that they are aware of a small number of Russian vessels exercising around the UK and are monitoring the situation closely. It comes amid preparations for King Charles' Coronation this Saturday and a record number of world leaders descendng on London.The Russian flotilla includes Black Sea Fleet frigate the Admiral Grigorovich alongside Baltic Fleet corvettes Sbrazitelnyy, Stoikiy, Sovetsk and Odintsovo, tug Grebelsky and Northern Fleet tanker Kama.Guided-missile destroyer Vice Admiral Kulakov was also pictured saling towards the North Sea yesterday.Poseidon P-8 maritime patrol airctraft were scrambled by the RAF yesterday to track the Russian ships. It comes just weeks after British and German warplanes intercepted Russian jets and a spy plane over the Baltic.",
        "UK and Germany sent Eurofighter Typhoon jets from Amari Air Base in Estonia to identify the two Sukhoi Su-27 fighter aircraft escorting an Ilyushin Il-20 Coot-A intelligence plane, the RAF said.",
        "The Type 23 frigate despatched by the Royal Navy is equipped with harpoon anti-ship missiles, which can fly just above the surface of the water to evade defences.Based in Portsmouth and Devonport, the Duke Class frigates have a crew of 185 and a top speed of 28 knots (32 miles per hour).A versatile ship first developed to deal with the Soviet submarine threat, they are usually found east of Suez, safeguarding Britain's trade routes or the country's interests in the South Atlantic.The Kalibr missile is a cruise missile capable of supersonic speed which can carry a warhead of up to 1,100 pounds of explosive or a thermonuclear warhead.It has a range speculated to be more than 1,500 miles - the distance from London to Moscow.Among the Russian flotilla is the Admiral Grigorovich frigate -which has previously been used as part of Russian military intervention in Syria.In 2016, it destroyed IS and Al-Nusra targets including ammunition warehouses and training centres with Kalibr cruise missiles.Frigates of the same class are also said to have fired Kalibr missiles against targets in the Ukraine war. ",
        "The group also includes corvettes - the smallest class of vessels still said to be warships."
    ]
}