{
    "articleURL": "/news/article-12050779/Matt-Hancock-enjoys-selfies-signs-autographs-fans-Mall.html",
    "content": [
        "Mr Hancock, who left his wife and children for Gina, was spotted earlier today  Crowds in Westminster hoping for a glimpse of a royal today were instead treated to a special appearance by… Matt Hancock.",
        "The disgraced former Health Secretary-turned-I'm A Celebrity star happily signed autographs and posed for selfies as he went for a walkabout among coronation fans on The Mall this morning.Mr Hancock was accompanied by his partner Gina Coladangelo, the woman he left his wife and children for and whose love cost him his government job.Speaking to MailOnline today, he said: 'Like almost everybody else in the country, I'm delighted to celebrate The Coronation tomorrow. It's a moment that few of us will ever forget and its just wonderful to see huge crowds of people from every corner of the world.",
        "He said despite being a former minister, he would not be at Westminster Abbey. Smiling at Gina, he added: 'I am going to be watching with my family.'Gina said: 'We will be together. I made quiche this morning and Coronation chicken.'The couple walked hand-in-hand and chatted to Royal fans as he signed autographs, but he laughed off questions about whether they were planning to marry. As they were on their walkabout a car drove past containing the real celebrity of the weekend - King Charles.Royal superfans armed with tents and sleeping bags have been lining the Mall for days as Coronation fever takes hold with less than 24 hours until King Charles III's procession travels to Westminster Abbey.",
        "Plenty of Brits enjoyed boozy celebrations overnight along the procession route by Buckingham Palace and even though some people chose to sleep in camping chairs without any cover, they still said they 'wouldn't want to be anywhere else'.Several days before Coronation Day, a sea of tents appeared and with just one night left to wait, the royalists have been getting into the spirit of the celebration with gin, champagne and whiskey. ",
        "Patriotic campers swathed in Union Flags and stocked up with food, booze and bunting, many of whom also camped out for the Queen's funeral in September, are settled in for Saturday.Retired nurse Linda McQuaid arranged to attend the Coronation with a group of people she met at the Queen's funeral.However the 67-year-old slept only in a sleeping bag without a tent, but insisted: 'It was fine. I was really warm - sleeping bag inside a survival bag. I got my head right inside there.'I'm really excited because I think the pageantry, the history, the British constitution, you can't beat it really.She told the MailOnline her original plan was to come to the Mall today, but when she saw how crowded the route was becoming she decided to come up a day early.Elsewhere houses, streets and schools across the country are decked out in red, white and blue as they prepare to celebrate the new King - with hundreds of thousands of people still to arrive in the capital before Saturday.",
        "Julie Pearce, who works at Asda, travelled from Swindon this morning with her family to set up camp a day before the coronation.The 55-year-old said she has 'never camped before' but that she has been 'excited for weeks and weeks and weeks'.  'We've got a tent, we've got loads of food, we're gonna make a cream tea later on,' she added.Other eager fans who have arrived more than 24 hours early haven't even brought a tent, choosing instead to sleep on a chair outside or on the floor.Sandra Marshall, an event manager from Liverpool, joined to keen crowd yesterday evening but felt the chilly weather overnight.She said: 'We're here for three nights. It was fine - a little bit cold, because were not properly prepared, but great atmosphere'We're collecting an afternoon tea this afternoon, we've got our psalm house botanical gin, we've got some pims and lemonade to go with our afternoon tea , and lots and lots of snacks.'Nicola Douglas, 54, whose favourite royal is the 'cheeky and gorgeous' Prince Louis, told the MailOnline: 'I'm here because I love the royal family, it's a one off, I've never been to a coronation in my life before, and you've got to be part of it really. It doesn't happen every day.",
        "'We're not family - we're great friends from home. We love socialising, we love dancing to ABBA together, we are just girlies having fun in our 50s loving life, and 24 hours here having a bit of a party is fantastic.'I'm excited, looking forward  to seeing the gold carriages and what everyone's going to be wearing.'It's very British, and it's a bit mad, but you know what I'd you can't do it in Britain where can you do it. I wouldn't want to be anywhere else.'A married mother of four joked that her children think she is 'mad' and having a 'midlife crisis' because she is camping out on The Mall in central London for the coronation.Kim Bilson, 54, from Poole, Dorset, said: 'It's too big of an occasion to miss really, don't want to look back at it and think, why didn't we do it.'It's a lovely atmosphere here, meeting people from all over the place.'"
    ]
}