{
    "articleURL": "/wires/aap/article-12040589/Adelaide-send-tagger-Keays-Geelongs-Stewart.html",
    "content": [
        "Adelaide will consider tagging star Geelong interceptor Tom Stewart as the Crows attempt to quickly bounce back from their heartbreaking one-point AFL loss to Collingwood.",
        "Stewart is coming off 26 disposals and 12 marks against Essendon and since returning from an opening-round knee injury has averaged 24.4 touches and 8.8 marks.Midfielder Ben Keays went to Collingwood wunderkind Nick Daicos, keeping him to a season-low 27 disposals, and Adelaide could employ a similar tactic against Stewart on Saturday.\"We definitely look at Stewart. He's an outstanding player and very influential across half back,\" Crows coach Matthew Nicks told reporters.\"Keaysy's weapon is he likes to have a job. He likes to have something that he's gonna look after and it may be that he looks at Stewart this week.\"Rory Laird (managed) missed Wednesday's training but Nicks was confident he would to be fit to face the Cats at GMHBA Stadium.Taylor Walker and Rory Sloane will likely be managed at some point but it's unlikely to be this week.\"At this point we'd like those guys to play,\" Nicks said.\"We want to go down there and have a real crack at Geelong.\"Their form's top-shelf at the moment and they're playing some great footy. We haven't won down there since 2003.\"So we want to go down there on a mission and really take on the best - we feel like at the moment their performances warrant that sort of tag.\"",
        "Adelaide led Collingwood for most of Sunday's match and trailed for the first time when Steele Sidebottom kicked the winning point with 30 seconds left.\"It hasn't affected our confidence at all,\" Nicks said.\"We're not jumping at the loss.\"At the same time we know we've got to improve but we're going to go down with some real confidence and take on Geelong.\"Nicks admitted he shouldn't have substituted out Jake Soligo for Harry Schoenberg.\"We got a lot of things wrong in key moments towards the end,\" he said.\"But probably our biggest learning out of all of it was the stuff we got right.\""
    ]
}