{
    "articleURL": "/wires/reuters/article-12056293/Slovaks-caretaker-PM-quits-political-wrangling.html",
    "content": [
        "By Radovan Stoklasa and Jason Hovet",
        "BRATISLAVA, May 7 (Reuters) - Slovak President Zuzana Caputova picked central bank Deputy Governor Ludovit Odor to lead a technocrat government after caretaker Prime Minister Eduard Heger quit on Sunday just months before early elections in September.Slovakia, a European Union and NATO member, has struggled through months of political uncertainty as Heger's ruling coalition was weakened, coming amid a period of high inflation and war in neighbouring Ukraine.The country's political scene is fragmented ahead of an election that the largest opposition party, opposed to continued military aid to Kyiv, may win.Heger, who has lead the government since 2021 - most recently in a caretaker capacity - quit after a spate of senior resignations and opposition calls to move aside. Caputova said she would name the rest of Odor's technocrat government after May 15.\"I consider it important for a smooth ending and transfer of agendas between governments,\" she said in a televised address.Odor, 46, has been a deputy governor of the National Bank of Slovakia since 2018.Slovakia lurched into crisis in September last year when Heger's ruling centre-right coalition lost its majority after the libertarian SaS party quit, unhappy with efforts to help people hit by soaring energy and food costs.Heger lost a no-confidence motion in December and, in January, lawmakers agreed to early elections in September.",
        "In the past week the farm minister stepped down following a scandal over a subsidy for a firm he owns. He denied any wrongdoing. On Friday, the foreign minister offered his resignation.The departures left Heger leading several ministries, including finance, as such posts cannot be filled when the government is in a caretaker capacity.\"I decided to ask the president to remove my authority and to leave the president space to try with a technocrat government to stably and peacefully lead Slovakia to democratic parliamentary elections,\" Heger said.Polls favour the opposition Smer-SD party, led by former prime minister Robert Fico, which has opposed military aid to Ukraine.Slovakia has been a strong backer of Kyiv since Russia's invasion and in April this year it sent its retired fleet of Soviet-made MiG fighters.Smer-SD led a Focus agency poll last month, with 17.7%. HLAS, founded by another former prime minister and one-time Smer-SD member, Peter Pellegrini, is second on 17.0%. (Reporting by Radovan Stoklasa in Bratislava and Jason Hovet in Prague; Editing by Barbara Lewis and David Holmes)"
    ]
}