{
    "articleURL": "/wires/ap/article-12044483/North-Carolina-House-OKs-ban-transgender-youth-surgeries.html",
    "content": [
        "RALEIGH, N.C. (AP) - Transgender youth in North Carolina would have to wait until they turn 18 to receive gender-affirming surgeries under a bill approved Wednesday by the GOP-controlled state House.",
        "House lawmakers passed the proposal, which would prohibit doctors from performing surgeries on minors to remove or alter features typical of a patient´s sex assigned at birth, after allowing little time this week for members of the public to testify in committees.Following the 74-44 House vote for passage, the bill now heads to the Senate, where Republicans hold a similar veto-proof majority. Two House Democrats - Reps. Michael Wray of Northampton County and Garland Pierce of Scotland County - and all Republicans voted yes.The proposed measure, which would take effect Oct. 1, also bans using state funds to perform any gender-affirming procedure on a patient younger than 18, which could also restrict access to some hormone treatments and other medications.If it becomes law, North Carolina physicians would be unable to refer a minor to another health care provider to receive gender-affirming surgeries.Republican sponsors argued the bill will protect kids from receiving irreversible procedures before they are old enough to make their own informed medical decisions. But several transgender residents who rallied outside the legislature Tuesday after they were barred from speaking in committee said they worried the restrictions would have detrimental effects on youth mental health.",
        "Rep. Ken Fontenot, a Wilson County Republican and one of the bill's primary sponsors, said performing gender-affirming surgeries on children and teenagers is \"a grave injustice.\"",
        "\"I am not against LGBTQ,\" he said during floor debate. \"I am a proud family member of several in that camp, and we love each other. I am against children being preyed upon.\"While doctors sometimes provide puberty blocking drugs or hormones to young patients who are experiencing gender dysphoria, they very rarely perform irreversible procedures such as genital surgery or mastectomies on minors.The North Carolina Department of Health and Human Services does not have quantitative data on how many of these surgeries are performed on transgender minors, spokesperson Bailey Pennington said.Sharon Sullivan, a nurse and advocate from the socially conservative North Carolina Family Policy Council, applauded legislators Wednesday for protecting children from \"sterilization.\"The General Assembly, like many Republican-led legislatures across the nation, is advancing a swath of bills aimed at trans residents, including restrictions on trans participation in the sports that align with their gender identity, bans on public drag performances and requirements that schools alert parents before addressing their child with a different name or pronoun.Several Democrats, including Rep. Maria Cervania of Wake County, denounced the surgery bill as another unwarranted attack on transgender youth. The trans community is already experiencing a mental health crisis, she said, adding that legislation like this only serves to \"demonize and target\" the state´s most vulnerable residents.",
        "Rae Bandy, the only transgender person given time to speak on the bill in committee this week, told The Associated Press they barely made it to adulthood without access to gender-affirming care as a kid growing up in Texas.\"We are just asking you to step back from our health care because, frankly, you don´t know what you´re talking about,\" the 22-year-old told lawmakers earlier Wednesday. \"We as patients, as parents and as medical professionals need to be making these decisions - not you.\"Rep. Vernetta Alston, a Durham County Democrat and one of the state's few LGBTQ+ state legislators, called it \"a copy and paste bill\" that she said is scaring kids and has nothing to do with the needs of North Carolinians.At least 16 states have enacted similar laws restricting or banning gender-affirming procedures for minors. Federal judges have blocked enforcement of laws in Alabama and Arkansas, and nearly two dozen other states are considering bills this year to restrict or ban transgender surgeries or hormone treatments.Florida, Missouri and Texas have banned or restricted the treatments via regulation or administrative order, but Missouri is the only one that also limits adults´ access to gender-affirming care. A judge has blocked Missouri´s restrictions through May 15.___Hannah Schoenbaum is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."
    ]
}