{
    "articleURL": "/news/article-12050533/Father-two-accused-murdering-21-year-old-woman-firing-assault-rifle.html",
    "content": [
        "Maria Villa Bedford, 21, was fatally shot at around 2.30am on Saturday morningThe man told police he was 'frustrated' at cars 'racing up and down the street'A father-of-two accused of firing an assault rifle at cars because he was 'frustrated' at the noise of vehicles driving down his street has been arrested after fatally killing a 21-year-old woman, prosecutors said.",
        "Bernard Jimmerson, a 39-year-old convicted felon, was charged with murder by police after allegedly firing at killing Maria Villa Bedford in Oakland on Saturday.Jimmerson, a father to a 2-year-old son and 4-year-old daughter, told authorities he had been 'frustrated' by drivers 'racing up and down the street at night'.He told police that he decided he would fire his assault rifle at the cars as they drove down the road, District Attorney Pamela Price said. Bedford was then shot and died as her Mercedes crashed at around 2.30am on Saturday morning, April 29, on MacArthur Boulevard near Oakland's 95th Avenue.",
        "'My office had filed murder charges against an Oakland man who fired his assault rifle into the street, killing 21-year-old Maria Villa Bedford who was just driving by,' District Attorney Pamela Price said.'My condolences go out to Ms Bedford's family and we offer our heartfelt sympathy. Her murder is heartbreaking and absolutely unacceptable.She added: 'Bernard Tracey Jimmerson, an Oakland resident, and the father of two young children, told police he was frustrated by the noise of cars racing up and down his street in the middle of the night. He went outside with his rifle and shot at passing cars, hitting and killing Marie Bedford.''Today, because of a decision he made in anger, Mr Jimmerson is facing a sentence of 27 years to life.",
        "Jimmerson is now facing charges of second-degree murder, shooting at an occupied motor vehicle, possession of an assault rifle, possession of a firearm and ammunition by a felon, and a gun enhancement. 'There are too many guns in this community and there are too many people who are too quick to use a gun, believing they have the right to use a gun when they do not. It needs to stop,' District Attorney Price said in a video statement.'When someone takes a life under these circumstances, we will hold them accountable.' If convicted, Jimmerson faces decades to life in prison.",
        "Amid their investigation into the incident, Oakland police said they seized two AR-15 rifles, two handguns, high-capacity rifle magazines, 194 loose rounds and body armor.Authorities said the weapons were improperly stored and were accessible to his two young children. Jimmerson is being held without bail. He is due in court next week on May 11 to enter a plea."
    ]
}