{
    "articleURL": "/news/article-12043773/Candidates-civil-service-union-chief-include-socialist-calling-return-Jeremy-Corbyn.html",
    "content": [
        "Marion Lloyd is backed by the Broad Left Network and the Militant Left groupBroad Left ads endorse her for president and say they want Jeremy Corbyn backUnion leaders in the civil service want to remove Tory ministers from office and replace them with Corbynite alternatives, it was claimed tonight.",
        "Candidates to become the new president and board members of the Public and Commercial Services union include Marion Lloyd, who is backed by the Broad Left Network and the Militant Left group. Promotional material from Broad Left endorses her for president, saying the group wants 'Tories out' – and Jeremy Corbyn back in.It adds: 'We should only support candidates who are anti-austerity and support the interests of our members and our policies. Corbyn is banned – he stands with us and we would support him standing independently.'Mr Corbyn was kicked out of the parliamentary party after a report by the Equality and Human Rights Commission in 2020 was highly critical of how Labour dealt with antisemitism under his stewardship.",
        "But the decision to ban him from standing for Labour at the next election was condemned by Ms Lloyd, who leads the PCS branch in the Department for Business.She wrote on Facebook at the time: 'Solidarity to Jeremy Corbyn. I really hope and would support him if he stood to give a fighting alternative for workers and show the need for a new party for working-class people.'",
        "In another post she said: 'Let's fight for a world free from poverty and oppression. A socialist world. Solidarity!'The PCS has around 200,000 members and is the biggest union in Whitehall.",
        "A Conservative source said an 'impartial civil service shouldn't be pursuing party political ambitions'.The Broad Left Network, whose PCS election poster features an image of and a quote from Ms Lloyd, demands the creation of 100,000 new civil service jobs, as well as a double-digit pay rise for workers.It is also endorsing candidates for positions on its national executive committee from across Government departments, including the Cabinet Office and the Department for Work and Pensions.Militant Left, formerly known as Committee for a Workers International Ireland, has also backed Ms Lloyd.It says it stands 'for ending the misery of capitalism and for the fundamental socialist reorganisation of society'.A Conservative source said: 'Sir Keir Starmer needs to distance himself from these hard-left activists who are trying to politicise the civil service.'It is essential that an impartial civil service can support whatever government is elected and shouldn't be pursuing party political ambitions.'It comes as Labour continues to be pressed on Sir Keir's planned appointment of Partygate investigator Sue Gray, the veteran mandarin who is believed to have held secret talks to become the Leader of the Opposition's chief of staff, in possible breach of civil service rules.The current PCS president, Fran Heathcote, is standing for re-election.",
        "She is a familiar face on picket lines and has been backed by the pro-socialist group Left Unity.The PCS, which is not affiliated to Labour, said its membership numbers grew by nearly 5 per cent last year.More than 100,000 PCS members went on strike across scores of government departments earlier this year in long-running disputes over pay and conditions."
    ]
}