{
    "articleURL": "/news/article-12059227/Man-shot-dead-windscreen-stolen-BMW-Melbourne-car-chase-Taylors-Hill.html",
    "content": [
        "Police hunting for three men after car chase ends in shootingParamedics unable to save a man shot trough car windscreen A man has been shot dead through the windscreen of a stolen BMW following a frightening car chase through suburban streets.",
        "Police are now hunting for three men after the victim was found critically wounded on Vaucluse Boulevard in Taylors Hill, 30km north-west of Melbourne's CBD, on Sunday about 11.30pm.Paramedics treated him at the scene, but were unable to save the man, who was the passenger in a car that had just been in a high-speed chase with a Mitsubishi Lancer.The driver called triple zero for assistance and was also caught on CCTV desperately knocking on a house door, shouting out 'Help me, help me, my mate's been shot.'He then fled the scene, as did two other mystery figures including the gunman, who had been in the white Lancer.   ",
        "Investigators believe the BMW was pursuing the Mitsubishi before the shooting and that it crashed into bollards on Grange Terrace.'The driver of the white Lancer has gotten out of the vehicle with the firearm and fired a shot through the front windscreen of the black BMW,' Detective Acting Inspector Nigel L'Estrange said on Monday. 'The BMW took off, and the two (people in) the Mitsubishi have left on foot, that is the shooter and his passenger.'The BMW travelled about 500 metres and the driver then abandoned it and left the scene. Inspector L'Estrange said the men 'then spoke with residents and asked how to get directions out of the area'.",
        "Police believe the people in the two cars, including the as yet unnamed victim, are known to each other. The detective urged the three men to 'get on the front foot' and turn themselves in.'We will identify you very soon,' he said. 'There will also be people out there who know who they are. We're also asking them to come forward.'We believe there is connection between these two cars and these people. This is not a random attack, and we don't believe there's any risk to the community.",
        "'We have a number of strong leads in relation to these males, and we're confident we'll identify who they are.'Inspector L'Estrange added that 'Any gun crime is shocking, and we treat it with the utmost seriousness.'There's a family there, a father, a husband or a son who hasn't come home overnight. It's shocking that this stuff is happening in the streets.'Anyone who witnessed the incident or with further information is urged to police immediately."
    ]
}