{
    "articleURL": "/wires/reuters/article-12051663/Berkshire-director-Buffett-CEO-heir-ideal-fit-changeover-not-imminent.html",
    "content": [
        "By Jonathan Stempel",
        "OMAHA, Nebraska, May 5 (Reuters) - One of Berkshire Hathaway Inc's longest-serving directors said Greg Abel has the ability and commitment to its culture that makes him an ideal fit to lead the $700 billion-plus conglomerate now run by Warren Buffett, but that a transition isn't likely to happen soon.Questions about how long Buffett, 92, and his vice chairman Charlie Munger, 99, will be around to steer Berkshire, and how the Omaha, Nebraska-based company will manage a change to new leadership, have long been on investors' minds.Ronald Olson, a Berkshire director since 1997, at an investing conference on Thursday said the company´s directors were satisfied that Abel - designated in 2021 as Buffett´s successor has the ability to lead after the billionaire investing legend is no longer in charge.Abel has \"made very, very savvy investment decisions\" and will have a \"wide berth\" to continue once he takes the company´s helm, Olson said.But Olson added that Abel is likely \"a good number of years off\" from taking over, with Buffett and Munger still on board.Olson said Munger's brain \"is as good as it ever was\" and Buffett's energy was the same. \"Don't count on Greg to take it over tomorrow.\"Abel, 60, has since 2018 been a vice chairman overseeing Berkshire's non-insurance businesses including the BNSF railroad and Berkshire Hathaway Energy, which he used to run.",
        "Buffett publicly designated him as his likely successor as CEO in 2021, after Munger appeared to let slip the board's thinking at that year's annual meeting. Olson spoke ahead of this year's meeting on Saturday.After Buffett departs, Berkshire is expected to name his eldest son Howard as non-executive chairman to preserve its culture, where business units operate essentially without interference from the top.Abel will also have to decide the extent to which two portfolio managers who handle small pieces of Berkshire's stock investments, with Buffett handling big investments such as Apple Inc, take over more of the portfolio, Olson said.Upon becoming CEO, Abel would likely experience \"more formality\" in his relationship with directors than Buffett, who took over in 1965, now has.Still, Olson is certain Berkshire tapped the right person to take it forward.\"The bottom line is, not only is Warren satisfied, Charlie is satisfied that Greg ... will carry out that culture,\" he continued. \"On top of that, he has had a lot of knowledge. Very close to Warren, less so than Charlie, but enough.\" (Reporting by Jonathan Stempel in Omaha, Nebraska; Editing by Ira Iosebashvili and Chizu Nomiyama)"
    ]
}