{
    "articleURL": "/wires/ap/article-12048381/No-bad-blood-F1-drivers-Verstappen-Russell.html",
    "content": [
        "MIAMI GARDENS, Fla. (AP) - Last week is in the rearview mirror and there are no hard feelings between Formula One reigning champion Max Verstappen and challenger George Russell.",
        "The two verbally sparred following the sprint race last weekend at the Azerbaijan Grand Prix with Verstappen furious over contact between the two. They were battling for third place on the opening lap and the contact caused a hole in the sidepod of Verstappen's Red Bull car.Following their confrontation on pit road, Verstappen referred to Russell as \"Princess George\" and Russell said the two-time champion \"let himself down\" with his reaction to the incident.Asked Thursday ahead of the Miami Grand Prix how their relationship is moving to a new grand prix weekend, Verstappen deadpanned one word: \"terrible.\" He then quickly set the record straight.\"No of course not,\" Verstappen clarified Thursday at the Miami Grand Prix. \"Maybe that's what people would like to hear, but no. It's absolutely fine.\"Russell said he won't change how he races Verstappen moving forward and has moved on.",
        "\"I´ll continue racing the same way as I always would,\" Russell said. \"A lot has been said about that coming together, but from my side, it was pretty straightforward - I went for a move, got the move done. Obviously he was pretty upset about it but that´s racing and these things happen. We´re all here to fight and that´s what F1 is about.\"Russell said the two had not spoken as of Thursday afternoon but not because he's avoiding the Dutchman.",
        "\"There´s no air to be cleared,\" Russell said. \"I´ll say hello to him if he passes by and I´m sure we´ll shake hands when we bump into each other. But for me, it´s history now and it´s behind us. My view of him is still the same. I still respect him and think he´s a great driver.\"Obviously things are always said in the heat of the moment, but we move on.\"___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}