{
    "articleURL": "/sport/football/article-12041689/Who-Man-City-play-Community-Shield-win-Premier-League-FA-Cup.html",
    "content": [
        "Pep Guardiola's Manchester City are still in line to win the treble this seasonCity are one point behind Arsenal but have two games in hand over the Gunners They are set to face David Moyes' West Ham United later this evening Pep Guardiola's Manchester City are in contention to pick up their third Premier League title in a row. As well as that, they remain in the FA Cup, meaning they're likely to feature in next season's Community Shield.",
        "City face West Ham at the Etihad tonight as they look to overtake Arsenal at the top of the league. They are also still in contention to win the Champions League - facing holders Real Madrid in the first leg of their semi-final next week. On top of that, City recently booked their place in the FA Cup final after they defeated Sheffield United 3-0.  Should Guardiola's men win both the league and the FA Cup, they will play in next season's Community Shield, traditionally seen as the curtain-raiser before the start of the new top-flight campaign. The Manchester side have lost the last two Community Shield games in a row after losing 3-1 to Liverpool in 2022 and 1-0 to Leicester City the year before.Mail Sport breaks down who Manchester City could play in the Community Shield should they win the Premier League and FA Cup. ",
        "West Ham (H) - May 3 Leeds (H) - May 6 Real Madrid (A) - May 9 Everton (A) - May 14 Real Madrid (H) - May 17 Chelsea (H) - May 21 Brighton (A) - May 24 Brentford (A) - May 28Manchester United (N) - June 3 ",
        "Who will Manchester City play if they win the league and cup double?Traditionally, the Community Shield sees the Premier League champions and the FA Cup winners go head-to-head.",
        "However, with City still in the FA Cup and in contention to win the league title, Guardiola's side could come away with both titles.City will face rivals Manchester United in the FA Cup final on Saturday, June 3.Mail Sport broke the news that the fixture between the two sides will kick-off at 3pm.It will be the first time in 12 years that the showpiece will kick off at that time.If City win both the league and the FA Cup, then they will face the side who finishes second in the league. At this moment in time, if City win the league, it looks as if Arsenal will finish second. The Gunners are 13 points clear ahead of third place Newcastle United. What if City fail to win the Premier League and FA Cup?If Arsenal win the league and Manchester United win the FA Cup, Mikel Arteta's men will face Erik ten Hag's side. As it stands, the Gunners are two points above City in first place on 78 points following their 3-1 win against Chelsea last night. United have won the most Community Shields in the history of the competition, with 21 titles. Their last success came in 2016 when they defeated Leicester City 2-1.The Gunners have the second-most with 16. They last won the Community Shield back in 2020, when they defeated Liverpool 5-4 on penalties after a 1-1 draw in normal time.",
        "Even if City fail to win the Premier League but win the FA Cup, they are then likely to face Arsenal in the Community Shield. If the side secures the league title and lose the FA Cup final, Guardiola's men will then face United in the Premier League curtain-raiser. ",
        "When is the Community Shield? While an official date for this year's Community Shield is yet to be revealed, it is likely that the fixture will take place at either the last weekend of July or the first weekend of August.Last year's fixture between Liverpool and Manchester City took place on Saturday, July 30.Jurgen Klopp's side would go on to defeat City 3-1 - with goals from Trent Alexander-Arnold, Mohamed Salah and Darwin Nunez."
    ]
}