{
    "articleURL": "/wires/afp/article-12048855/Rising-iPhone-sales-help-Apple-beat-forecasts.html",
    "content": [
        "Apple on Thursday said iPhone sales and money made from services powered quarterly earnings that beat forecasts, despite inflation pressure and the slowing global economy.",
        "The iPhone maker's bottom line capped a successful earnings season for US tech giants, with Meta, Google and Amazon also beating expectations after suffering a painful spell of lower sales and profits.The smartphone titan reported profit of $24 billion on revenue of $94.8 billion in the first three months of this year.The overall revenues for the period were lower than a year before, though this was expected and Apple's shares were up about one percent in after-market trading.\"We are pleased to report an all-time record in services and a March quarter record for iPhone despite the challenging macroeconomic environment,\" Apple chief executive Tim Cook said in an earnings release.Sales of iPhones were up two percent and tallied $51.3 billion in the quarter, according to earnings figures.\"The iPhone base has well over a billion active devices... We feel great about the size of it and the rate that it's growing,\" Cook told analysts after the earning result.Analysts said this was at least in part due to the reopening of China after a long period of Covid-19 restrictions that hurt economic growth.Though Apple has made noise with its expansion into India, China remains the iPhone maker's crucial supplier and a key market.Apple was deeply affected by the years of Chinese Covid-related closures and is only now seeing its complex supply chain returning to normal.",
        "- India is 'major focus' -",
        "The company founded by Steve Jobs is making a very publicized push into India, with Cook himself attending the country´s first Apple Store openings last month.\"India is an incredibly exciting market. It's a major focus for us. I was just there, and the dynamism in the market, the vibrancy, is unbelievable,\" Cook said.The country is home to the second-highest number of smartphone users in the world and efforts there help to deflect attention from the company's dependence on China.Sales of Macs slipped to about $7.2 billion as belt-tightening around the world hit the entire personal computer market.Shipments of Apple Macs and MacBooks, which are in the premium segment of the market, shrank more than 40 percent in the quarter, research firms IDC and Canalys have reported.Even though iPhones have been the heart of Apple's money-making machine, the company has made a priority of bringing in more revenue from content and services sold to users of its devices.Apple said revenue from services stood at $20.91 billion, defying predictions that demand for streaming entertainment would fall steeply with the end of Covid restrictions.Though the pile has diminished over recent years, Apple has $57 billion in cash on hand, which fuels market speculation that Cook will swoop in to buy up companies or invest further in services.",
        "Apple also authorized an additional $90 billion stock buyback which will be welcomed by Wall Street as it pumps up the share price and the company's profit potential.Asked about the future of artificial intelligence, as apps like ChatGPT take the world by storm, Cook insisted it was \"very important to be deliberate and thoughtful in how you approach these things.\"\"There's a number of issues that need to be sorted... but the potential is certainly very interesting,\" he added.Apple has largely refrained from joining the AI arms race that has seen its big tech rivals roll out new products to the alarm of some governments and regulators."
    ]
}