{
    "articleURL": "/wires/ap/article-12048517/Business-Highlights-Regional-banks-Simon--Schuster.html",
    "content": [
        "___",
        "Regional bank shares sink in sign crisis not yet overNEW YORK (AP) - Uncertainty continues to pummel the banking industry, despite assurances from financial regulators and bankers that the worst of the recent crisis is over and the banking system remains strong. Shares of smaller regional lender PacWest Bank plunged nearly 50% Thursday after the company confirmed reports that it was considering \"strategic options\" that may include the possible sale of the company. Other regional banks such as Comerica and Zions also saw double-digit declines. The bigger worry is that the bank failures might cause customers and investors to doubt relatively healthy banks, a concept known as financial contagion and one of the nightmares for bank regulators and the industry.___Simon &amp; Schuster again up for sale, executives confirmNEW YORK (AP) - Simon &amp; Schuster is again up for sale. Months after a federal judge halted Penguin Random House´s plan to purchase its longtime rival, Simon &amp; Schuster´s CEO and the parent company, Paramount Global, have confirmed that the publisher is back on the market, with a sale possible by the end of the year. Penguin Random House, already the country´s largest trade publisher, had offered $2.2 billion for Simon &amp; Schuster, a deal that would have created a dominant force in the book market. Paramount is now expected to favor a private equity firm.",
        "___Stock market today: Wall Street sinks as bank fears flareNEW YORK (AP) - Stocks sank on Wall Street as worries cranked higher about a cracking U.S. banking system. The S&amp;P 500 fell 0.7% Thursday to add to its loss for the week so far. The Dow Jones Industrial Average dropped 286 points and is now down for the year. The Nasdaq composite also closed lower. PacWest Bancorp´s stock halved as investors looked for the next weak link following several big U.S. bank failures since March. Shares of other smaller and mid-sized banks also fell sharply. Helping to limit the market´s losses were several companies reporting better profits than expected.___Bud Light boosts spending in US to counter sales declinesBud Light´s parent company said Thursday it will triple its marketing spending in the U.S. this summer as it tries to boost sales that plummeted after the brand partnered with a transgender influencer. But Anheuser-Busch InBev CEO Michel Doukeris also downplayed the impact of the backlash, saying Bud Light´s U.S. sales declines in the first three weeks of April represented only 1% of InBev´s global volumes. Doukeris also said the company sees signs that Bud Light demand is stabilizing. Transgender influencer Dylan Mulvaney posted a video of herself April 1 with a Bud Light can with her face on it that the brand sent her.",
        "___DoorDash beats Q1 forecasts as it expands services, marketsAdds background. Adds stock price. Will be updated following conference call scheduled for 5 p.m. EDT. (AP) - DoorDash posted stronger-than-expected results in the first quarter as it expanded into new markets overseas and new delivery categories at home. The San Francisco company said its total orders rose 27% to 512 million in the January-March period. That was higher than the 493 million Wall Street forecast, according to analysts polled by FactSet. DoorDash acquired the Finnish delivery service Wolt Enterprises last summer, allowing it to expand in 22 countries where it previously had no presence, including Germany. And in the U.S., the company said orders from convenience stores, groceries and other newer categories are growing faster than restaurant deliveries.___Shopify narrowing its ambition, sells Deliverr, cuts staffNEW YORK (AP) - Shopify is selling the two biggest pieces of its fulfillment network and abandoning its logistics ambitions. The company also said Thursday it will lay off about 20% of its workforce, the second mass layoff its had in less than a year. The changes are also a remarkable reversal following the Canadian company´s multiyear effort to build its own warehousing and delivery services. But investors welcomed the company´s move to focus more on its retail business, sending shares up 17% in premarket trading.",
        "___Fox opposes fellow journalists trying to uncover documentsNEW YORK (AP) - Fox News is opposing an effort by three news organizations to reveal documents related to its recently settled defamation lawsuit, saying that material would do nothing but `gratify private spite or promote public scandal.´ The Associated Press, The New York Times and National Public Radio want to uncover mostly private phone, text and email conversations between Fox employees after the 2020 presidential election. Many of the messages have already proven newsworthy and embarrassing to Fox. A Fox lawyer said one of the reasons it agreed to pay a $787 million to Dominion Voting Systems was to buy peace and end the media spectacle.___Debt limit deadline looms as Democrats, GOP spar on spendingWASHINGTON (AP) - Senate Democrats are trying hard to pressure Republicans into resolving the menacing impasse on the nation´s debt ceiling. In a combative hearing Thursday, the Democrats argued that a bill to raise the limit on federal borrowing, recently passed by the Republican House majority, would also force painful cuts in government services if it becomes law. It´s just the latest jousting in Congress over the debt limit, a legal limit on government borrowing that has been raised repeatedly in recent years. Urgency around the issue intensified this week as the Treasury Department announced that the \"extraordinary measures\" being used to avoid a devastating government default could run out on June 1.",
        "___Arconic taken private by Apollo Global in $5.2 billion dealAerospace supplier Arconic is being taken private by Apollo Global Management Inc. in a deal worth approximately $5.2 billion. Arconic shareholders will receive $30 per share in cash. Arconic is the company once known as Alcoa. Alcoa Inc. spun off its alumina and bauxite operations in 2016 into a company called Alcoa Corp., while Arconic became the company that produced rolled and plate aluminum, as well as products for the aerospace and industrial sector.___The S&amp;P 500 fell 29.53 points, or 0.7%, to 4,061.22. The Dow Jones Industrial Average fell 286.50 points, or 0.9%, to 33,127.74. The Nasdaq composite fell 58.93 points, or 0.5% to 11,966.40. The Russell 2000 index of smaller companies fell 20.47 points, or 1.2%, to 1,718.81."
    ]
}