{
    "articleURL": "/wires/pa/article-12053187/Events-planned-Scotland-celebrate-coronation.html",
    "content": [
        "Events are being held across Scotland on Saturday to celebrate the coronation of the King – but there will also be protests against the monarchy.",
        "The coronation ceremony will be beamed from Westminster Abbey on to a big screen in Edinburgh’s West Princes Street Gardens, and Glasgow Cathedral will also show proceedings live.Gun salutes have taken place at Edinburgh and Stirling castles to mark the occasion, and community events are being held up and down the country.",
        "At Balmoral, where Queen Elizabeth II died last year, well-wishers arrived at the royal estate from across the globe to take in the atmosphere.Hundreds watched the coronation live on screens across the estate, and cheered the Ballater Pipe Band as they played throughout the day.Among the royal fans was Louise Gibson-Ellis, from Nebraska in the US, who is spending her honeymoon in the Royal Deeside region.The 52-year-old has brought her new mother-in-law, Gwen Smith, 85, from London.The pensioner, who shares a birthday with the late Queen, has fond memories of the coronation in 1953.",
        "She recalled: “It was absolutely wonderful. There were so many of us in the room sat round looking at the nine-inch television.”It was a double celebration at the Royal Deeside estate for Bjorg Jonsdottir, from Iceland, whose first grandson, as yet unnamed, was born in the early hours of the morning.A special range of unique memorabilia and photographs relating to the royal’s Scottish visits were also exhibited in the castle’s ballroom.",
        "The Royal Standard will fly over St Andrew’s House, the Scottish Government’s headquarters, throughout the coronation weekend.First Minister Humza Yousaf, Lord Advocate Dorothy Bain KC and Permanent Secretary John-Paul Marks will represent the Scottish Government at the ceremony in London.Mr Yousaf arrived at Westminster Abbey in a Slanj kilt in the Spirit of Glasgow tartan with an Asian fusion-style jacket and waistcoat designed by Glasgow-based Anjali Modha.",
        "His wife Nadia El-Nakla wore a full-length kilt made from the same tartan, by Scottish designer Siobhan MacKenzie, and a hat by Glasgow milliner William Chambers, whose designs have been worn by the Duchess of Sussex.Mr Yousaf said: “I will attend at the coronation ceremony as First Minister, on behalf of the Scottish people – and many people across the country will also take part in the celebrations by watching the ceremony on big screens, hosting street parties or taking part in charity or volunteering.“I look forward to participating in the ceremony when His Majesty is presented with the Honours of Scotland at a service at St Giles’ Cathedral later this year.“I know many people in Scotland will want to send their best wishes to King Charles III and Queen Camilla on this historic occasion.”Among the scores of people at Glasgow Cathedral to watch the ceremony on screens around the historic building was US tourist Kathy Kowalski.",
        "The 74-year-old, from St Mary’s County, Maryland, said: “We’re on a tour of Scotland and Ireland so we decided to come here to see the cathedral and it so happened they were showing the coronation.“I like watching it but being an American it’s like ‘couldn’t you have spent that money helping someone else, helping the poor? But that’s just me’.”",
        "At Edinburgh Castle, a 21-round royal salute was fired a minute after midday as the King was crowned.Members of 105 Regiment Royal Artillery fired the salute, with members of the 3rd Battalion, The Royal Regiment of Scotland (3 Scots) taking up position as castle guard musicians from Reserve Bands of The Royal Regiment of Scotland and adult instructors with the Army Cadet Force performed.They played God Save The King after the gun salute.As some people celebrate, others will be protesting against the event.A recent poll suggested the majority of people north of the border do not care about the coronation, with the YouGov survey of more than 1,000 Scots finding 72% either do not care about it at all or do not care very much.",
        "In Glasgow, All Under One Banner – which campaigns for Scottish independence – will stage an independence march from Kelvingrove Park to Glasgow Green, where former first Minister Alex Salmond will address the crowd.",
        "Our Republic, which wants an elected head of state, will also stage a protest in Edinburgh.The event, on Calton Hill, will see Scottish Government minister and Scottish Greens co-leader Lorna Slater speak, as will SNP MP Tommy Sheppard and Green MSP Maggie Chapman."
    ]
}