{
    "articleURL": "/femail/article-12053543/Queen-Letizia-Spain-looks-stunning-pink-arrives-Westminster-Abbey-Coronation.html",
    "content": [
        "Queen Letizia of Spain looked elegant as she attended the King's CoronationCORONATION LIVE BLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Known for her fashion prowess, Queen Letizia stunned in an elegant all-pink look at Westminster Abbey.",
        "The Spanish royal, 50, joined her husband King Felipe VI, 55, to watch the historic first coronation of King Charles III where Britain will hail its new King today.The Queen of Spain wore a pencil skirt and a top with a ruffled peplum, which featured an embroidered neckline along with buttons down its centre. The mother-of-two kept her locks in a neat bun and topped it off with a chic wide-brimmed hat. She accented the style with matching pink shoes and a clutch purse.Her husband looked equally sophisticated for today's historic event in his formal dress, with a pair of gloves on hand.",
        "Felipe is a distant cousin of Charles: his mother, Queen Sofia, was a third cousin of the Queen and a first cousin once removed of the Duke of Edinburgh.Last night, the Spanish couple stepped out dressed to impress at Buckingham Palace for a lavish reception hosted by King Charles ahead of the monarch's coronation.Letizia, who was also joined at the reception by other foreign royals, including Princess Charlene of Monaco, oozed elegance in a green Victoria Beckham midi dress, costing £850, teamed with navy heels and a black clutch.Featuring a gathered front, the dress was gorgeous with its tulip sleeve detail and a slight V-neck at the back. Adding a touch of glitz to her ensemble, Letizia completed her look with a dazzling diamond brooch and an emerald and silver bracelet.",
        "The couple were amongst the many foreign royalty who mingled with other VIP guests at the dazzling eve-of-Coronation reception at Buckingham Palace last night.The reception was organised as a chance for the King to greet his guests because there will be no formal event outside the Coronation itself today.",
        "Others who attended included Prince Albert and Princess Charlene of Monaco – striking in Terrence Bray lavender trousers with a one-shouldered top –  along with King Philippe of Belgium and daughter Princess Elisabeth, who wore a £3,609 Giorgio Armani navy dress.Princess Lalla Meryem of Morocco stopped for photographers at the Grand Entrance, as did Grand Duchess Maria Teresa and Grand Duke Henri of Luxembourg.Glamorous Queen Rania of Jordan - sporting a button-down midi dress from Schiaparelli, costing £8,000 - and her husband King Abdullah were welcomed warmly by King Charles, an old friend.Today, Charles will be crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry. It will also shine a spotlight on Britain's place on the world stage. And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe, including Queen Letizia's Spain.",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations.Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.'There will be all the pomp and ceremony you could dream of, but as little of the 'them and us' as possible,' one senior royal aide said last night.",
        "Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary's Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to 'pace herself' and also ensure 'the day was about her husband', sources said.",
        "'She loves him unconditionally and always wants him to shine,' a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.'The calm before the storm – perhaps metaphorically as well as literally', a friend said with a nod to the dismal weather forecast, something the new King and Queen's celebrations have in common with the late Queen's Coronation in 1953.Today's Coronation will see 7,000 servicemen and women accompanying Their Majesties, making it the country's biggest ceremonial event since 1953."
    ]
}