{
    "articleURL": "/sport/nba/article-12058173/Celtics-head-coach-Joe-Mazzulla-says-Boston-got-play-wanted-final-possession.html",
    "content": [
        "The possession ended as the final buzzer rang just before the shot was takenBoston's defeat now has the series tied at 2-2 with only three games remaining DailyMail.com provides all the latest international sports news Boston Celtics head coach Joe Mazzulla gave reporters a rather blunt answer when asked about his decision not to call a timeout on the final play of overtime in the overtime loss to Philadelphia on Sunday.",
        "On the play in question Boston got the ball back with 19 seconds and two timeouts remaining, after James Harden had just given the 76ers the lead after converting a clutch three-point shot.Rather than call a timeout to advance the ball up court before running a play that saw Jayson Tatum drive off a screen from Derrick White before kicking the ball out to Marcus Smart, who attempted the game wining shot, Smart ended up making the last-second jumper but released the ball just after the final buzzer expired.'That was the play, we just had to play with a little more pace,' Mazzulla said, referencing Boston not getting a shot off in time.'We had the right matchup. Jayson got downhill, made the right play at the rim, we just had to play with a bit more pace there. But that was the play.' ",
        "Celtics' superstar Jayson Tatum also spoke on the play and pointed out that there were also other occasions where the team didn't call a timeout that and they successfully converted the shot attempt.'We got a good core group of guys that know how to play under pressure,' said Tatum. Boston entered the game with a 2-1 lead in the series, which is now deadlocked at 2-2 following today's result. ",
        "Interestingly enough, this head scratcher of a decision comes only days after the Milwaukee Bucks fired former head coach Mike Budenholzer.He was fired after a questionable decision not to call a timeout in crunch time eventually saw his team eliminated from the playoffs.Though it is unlikely Mazzulla will meet a similar fate as Budenholzer did, it highlights the microscope that coaches are under during the postseason, regardless of how tremendous their teams perform during the 82-game regular season. "
    ]
}