{
    "articleURL": "/sport/afl/article-12061323/Huge-clue-Tasmanias-new-AFL-team-drops-league-makes-progress-major-obstacle.html",
    "content": [
        "Club will become first expansion team since GWS Legal obstacle put fan favourite name in doubt That obstacle may soon be removed The nickname 'Tasmanian Devils' has emerged as the clear favorite for the AFL's newest club, with outgoing CEO Gillon McLachlan endorsing the idea.",
        "Tasmania will be the league's first expansion team since Greater Western Sydney was awarded a licence in 2010 and entered the AFL in 2012.It had initially seemed a fait accompli that the expansion club would be named after the iconic Tasmanian Devil, but there was a legal roadblock in the way. The obstacle came in the form of Hollywood powerhouse Warner Brothers, which owns the commercial trademark rights to the Tasmanian Devil character from the Looney Tunes cartoon series. The National Basketball League (NBL) featured the Hobart Devils from 1983-1986 and the Hobart Tassie Devils from 1987–1995, with the Hobart Devils name returning for the franchise's final season in 1996. When the club folded, Warner Bros quickly trademarked the character and registered the name Tasmanian Devil in 1997. The AFL has now entered into dialogue with Warner Bros to address the issue.",
        "According to 7NEWS, Warner Bros has appreciated the AFL's 'acknowledgement and respect' of their registered rights and the two parties have reached out to each other to resolve the matter. The AFL has already lodged trademark papers with IP Australia for the Tasmanian Devil, and a response is expected in July.Meanwhile, the AFL and Tasmanian government will appoint a board in the coming weeks to choose the team's name. ",
        "While the Tasmanian Devils seems to be the frontrunner, not everyone is sold on the idea. AFL legend Matthew Richardson has suggested alternatives, such as the Islanders, and has proposed that the people of Tasmania be allowed to vote on the name.'I think we should go for something new,' Richardson said on RSN radio.'But you know what I recommend that people should decide … throw it out there and let the people of Tasmania come up with some names and some ideas and then let them let them vote on it.'I did mention the Islanders the other day. It is what it is. Tassie is an island. There are other teams called the Islanders. That's one that immediately came to mind.'We've done the Devils, we've done the Mariners.'"
    ]
}