{
    "articleURL": "/wires/ap/article-12039005/Brazil-orders-Google-halt-campaign-against-speech-bill.html",
    "content": [
        "BRASILIA, Brazil (AP) - Brazil´s Justice Ministry on Tuesday ordered Google to stop conducting what it called a propaganda campaign against Brazilian legislation aimed at curbing misinformation, or face about $200,000 per hour in fines.",
        "The company later Tuesday took down an article the ministry had labeled propaganda, but it was not immediately clear if the big tech giant was in complete compliance with the agency´s order.The legislation, hotly contested by big tech companies including Google, would establish fines and deadlines for removing misinformation and hate speech from social media and messaging apps, and require tech companies to file reports on transparency.President Luiz Inácio Lula da Silva´s government says it is essential to regulate online discourse following a recent spate of fatal school attacks that officials argue was motivated by hate speech and social media forums. The bill was sent to the lower chamber on Friday and may be voted on this week.On Sunday, Google published a message on its homepage arguing that the bill \"could increase confusion about what is true or false in Brazil\" and should be improved. The message redirected to an article written by the search engine´s public policy department listing arguments against the bill.Brazil's Justice Ministry accused Google of promoting a disguised editorial position, and ordered the company to promote content which goes against its position. The agency also determined that Google needs to clearly indicate that its position is propaganda and needs to be transparent about any interference in its search engine to links related to the bill.",
        "The agency said the company would be fined 1 million reais, or approximately $200,000, per hour if it failed to comply with the order. Google´s message on its homepage, and the article, were removed Tuesday after the order's publication.Supreme Court Justice Alexandre de Moraes also ordered the heads of Google, Meta, Spotify and Brasil Paralelo - a far-right news and entertainment platform - to give statements to the police on why they authorized what may amount to spreading misinformation about the bill and abuse of economic power.De Moraes cited a study by the Laboratory of Internet and Social Media Studies at the Federal University of Rio de Janeiro (UFRJ), which argued that these companies advertised and ran ads against the bill \"in an opaque way and bypassing their own terms of use.\"Google said in a statement that it was committed to communicating its concerns about the bill \"in a public and transparent way\" and denied manually altering search results to favor its position.Brazilian lawmakers last week had approved a request to speed up the approval process for the bill in the House. Analysts and big tech companies criticized the move and argued there was a need for further discussion.The bill dates back to 2020 when it was approved by the Senate under Lula´s predecessor, far-right leader Jair Bolsonaro, but has since undergone substantial modifications and become much broader. If approved by the House, the bill will return to the Senate for a final vote.",
        "Last week, Telegram was temporarily suspended by a judge after the messaging app refused to send information on profiles which spread Nazi speech. A few days later, another decision canceled the suspension, although the daily fine of 1 million reais was maintained due to failure to comply. Telegram´s founder and CEO Pavel Durov said in a statement that the company will appeal and that compliance is \"technologically impossible.\"Hughes reported from Rio de Janeiro."
    ]
}