{
    "articleURL": "/wires/reuters/article-12057343/At-20-die-boat-overturns-Indias-Kerala-state.html",
    "content": [
        "By Jose Devasia and Mrinmay Dey",
        "KOCHI, India, May 8 (Reuters) - At least 22 people including children died when an overcrowded double-decker tourist boat capsized in an estuary in southern India, authorities said.Some passengers managed to jump off and swim to safety when the converted fishing vessel overturned in the waterway near the town of Tanur in Kerala state late on Sunday, one survivor said.But others among the estimated 40 people on board were trapped in the boat, officials said. The dead included 11 people from one family, Manorama News channel reported, though there was no confirmation of that from officials.Rescuers called off a search on Monday when the last missing passenger, an eight-year-old boy, turned up alive in Calicut hospital, B. Sandhya, the chief of Kerala's fire and rescue services, told reporters.Police said they were searching for the owner of the boat and a case of homicide had been registered against him.The vessel had listed badly soon after it set off, a survivor identified only as Shafeeq told Manorama.\"Most of the people on the upper deck jumped into the river and swam to safety,\" he said.According to initial estimates there were about 40 people, most believed to be domestic tourists, on board including several children, Tanur police official Jeevan George said.",
        "Famous for its picturesque backwaters, Kerala is a major destination for domestic and international tourists.Local residents said the cruise service had only been launched last month and lacked safety measures. One man said he and his brother had decided not to go on the cruise because the boat looked too crowded.\"The operators were asking more people to join saying it was the last trip of the day,\" the man, identified as Ibrahim, told Manorama.The state's health minister, Veena George, said two survivors were discharged from the hospital after treatment while eight were still receiving medical care. (Reporting by Jose Devasia and Mrinmay Dey in Bengaluru, additional reporting by Jyoti Narayan in Bengaluru; writing by Sudipto Ganguly in Mumbai; editing by Robert Birsel and Andrew Heavens)"
    ]
}