{
    "articleURL": "/wires/reuters/article-12051301/After-acrimonious-resignation-Pope-tells-abuse-commission-forward.html",
    "content": [
        "By Philip Pullella",
        "VATICAN CITY, May 5 (Reuters) - Pope Francis on Friday praised the work of an international Vatican commission on sexual abuse prevention, following the recent acrimonious resignation of a high-profile member who accused it of lacking transparency.In an address to a plenary session of the Pontifical Commission for the Protection of Minors, Francis made no reference or allusion to the accusations by Father Hans Zollner, who resigned on March 29, citing concerns over the way it was operating.Zollner, a world-renowned abuse prevention expert, denounced unclear hiring practices, an undefined relationship with the Vatican's doctrine office and \"inadequate\" financial and decision-making accountability.Addressing the commission, whose membership was renewed and expanded last year, Francis said he was pleased with a recent agreement between it and a Vatican department that oversees work in poor countries, where sexual abuse prevention is often hurt by lack of funding.He urged members \"not to get bogged down,\" to \"persevere and keep moving forwards,\" adding: \"You have already done much in these first six months\".Cardinal Sean O'Malley of Boston, the president of the commission, issued a statement at the time of Zollner's accusations, saying he was \"surprised and strongly disagree\".It was founded in 2014 and is made up of abuse prevention experts with a mandate to advise the pope and implement best practices for protection in local churches around the world.",
        "Zollner also leads a centre for the study of abuse at Rome's Pontifical Gregorian University and is an adviser on abuse prevention for the diocese of Rome.Some Vatican officials privately speculated that the rift may stem from overlapping interests and a sense of competition. Zollner told Reuters his decision had \"nothing to do with personalities but with procedures\".Abuse scandals have shredded the Church's reputation and have been a major challenge for the pope, who has passed a series of measures over the last 10 years aimed at holding the Church hierarchy more accountable, with mixed results.\"Over the last decade, we have all learned a great deal, myself included,\" the pope told the commission on Friday. \"The failure, especially on the part of the Church´s leaders, to do what we should have done, has been a cause of scandal for many.\"Two abuse victims who were members of the first commission resigned in 2017 citing resistance within the Vatican but Juan Carlos Cruz, a Chilean who is an international advocate for abuse victims who was appointed to the commission in 2021, has remained.Last year, the pope incorporated it into the Vatican's doctrinal department, which decides on sanctions for priests convicted of sexual abuse. Current commission leaders said this gave it more institutional clout but critics said the move could threaten its independence.",
        "In 2022, the pope mandated the group with producing an annual audit evaluating how national Catholic Churches are implementing measures to protect children from clergy sexual abuse. The first one is expected for next year. (Reporting by Philip Pullella; Editing by Hugh Lawson and Conor Humphries)"
    ]
}