{
    "articleURL": "/wires/afp/article-12049343/Indias-new-mums-live-hope-fear-generation.html",
    "content": [
        "India has become the world's most populous nation, and for the country's new mothers it is a moment of great hope but also anxiety as they face an uncertain future.",
        "Phenomenal economic growth in recent decades has had a transformative effect on Indian families, with the average woman now giving birth to just two children, down from a 1960 peak of six.But many Indians still struggle to find work, housing or reliable electricity, challenges that will become more acute in the decades to come.AFP spoke with five new and expecting mothers from across the country to discuss their aspirations and fears for the next generation.Here are their stories:- 'I will get an operation' -Sita Devi is illiterate, 22, and hoping with her husband that after two daughters their unborn new child is a boy.\"Our father couldn't educate us. We were five sisters and he was the only earning member,\" Devi told AFP in the village in Bihar, India's poorest state, that she has never left.",
        "\"He was poor and had a big family. He couldn't feed us, clothe us or educate us,\" she said.With her husband earning a meagre income as a labourer, she spends her days looking after her children, aged two and four, doing household chores and chatting with neighbours, most of whom have three to five kids.But she wants to stop at three and plans to undergo a tubal ligation, India's favoured contraceptive method.",
        "\"This time, whether I give birth to a boy or a girl, I will get an operation done,\" she said.\"I hope that we will be able to teach and educate our children and they will prosper and live well.\"- 'A lot of problems' -In Goa, the music pumps and Shobha Talwar's 100 guests spill into the front yard, feasting on chicken biryani, bread and sweets for a baby-naming party.Talwar's oldest sister whispers the month-old baby boy's name in his ear -- Shreyansh -- before he is showered with gifts and women sing a lullaby around his crib.",
        "\"We are going to face a lot of problems. We still don't have our own house and have to think about the child's schooling,\" said the first-time mother, 29.The baby is now the 10th resident of their modest single-storey home along with his grandparents, parents, uncle, two aunts and two cousins.But for the child's father, Siddapa Talwar, 30, who runs a wholesale ice block business with his father and brother, the baby's gender makes him less anxious.\"I have a boy. That makes me happy,\" he said.\"I'm not worried about his future. As long as he has a roof over his head and get things done for himself, he will be fine.\"",
        "- 'Sweet little doll' -Girls are often considered a financial burden in India due to the enduring dowry system of parents paying a hefty sum when their daughters get married.But Indu Sharma, 25, in the mountainous northern state of Himachal Pradesh, will be happy regardless of whether her child turns out to be a boy or a girl.",
        "\"In fact my husband wants a daughter, a sweet little doll,\" she told AFP, settling into a chair in her large two-storey home after returning from a prenatal checkup.\"Society is changing. We are also three sisters, but my father never fretted that he does not have a son.\"He brought us up with love and so there's no pressure to deliver a son. Everyone is happy with a daughter.\"But she says more should be done to encourage families to have fewer kids.\"The government should go to every village and create awareness about having small families,\" she said.\"Small family is a happy family.\"- 'Blood, sweat and tears' -Writer and journalist Shreyosi, 30, had been married for five years and she said that like most things in her life, her pregnancy was \"unplanned\".But giving birth to baby Aarya in March was \"one of the most beautiful journeys.\"",
        "\"It was something... out of my own blood, sweat and tears,\" Shreyosi, who did not give her surname, told AFP in her home in Bengaluru.",
        "But worried about overpopulation and the problems it is creating, including climate change, she said people should not have too many children.\"I think there should be a restriction on how many children you can have,\" she said.One of the reasons India overtook China as the world's most populous country was its northern neighbour's sometimes brutally enforced one-child policy.It is now reaping the demographic whirlwind with an ageing, shrinking population.Shreyosi has no plans for a second child but might change her mind if her \"daughter needs a brother or a sister\".\"But I have to ensure that both of my children are brought up in the same way... There should be no disparity.\"- 'Very good parents' -Decked out in flower garlands in a banquet hall in Chennai, Saranya Narayanaswamy and her husband Sanjay make offerings of petals and coconuts in Hindu rituals for their unborn child.",
        "Friends and relatives sing around a ceremonial fire in a celebration staged to ensure the baby's wellbeing, Saranya, an IT professional in the southern state of Tamil Nadu, told AFP.\"The sounds, the smoke that comes out of fire, everything is supposed to be good for the baby and the mum-to-be,\" she said.",
        "Saranya said she was excited about the imminent arrival of her first child but nervous about the challenges ahead.\"We hope to make sure that the baby is brought up well,\" she added. \"We want to be very good parents.\"strs-burs-stu/gle/ser/dhw"
    ]
}