{
    "articleURL": "/wires/pa/article-12048581/Senior-Tory-calls-building-GCHQ-based-Chinese-cameras-removed.html",
    "content": [
        "A senior Conservative MP and China hawk has said it is “absurdity” that a building the Government Communications Headquarters (GCHQ) operates out of has Chinese surveillance cameras attached to it.",
        "Former Tory leader Sir Iain Duncan Smith said CCTV made by Beijing-based firm Hikvision should be removed from a property that is home to the security agency’s North West secure site.It comes after Channel 4 News reported that it had found at least nine cameras made by surveillance equipment manufacturer Hikvision on Heron House, a property in central Manchester that the security agency has offices in.GCHQ said it does not operate Hikvision cameras on its part of the building, which it reportedly leases from Manchester City Council. It seems an absurdity to me and they should get rid of them  Tory MP Sir Iain Duncan Smith  The broadcaster’s report comes after ministers instructed Government departments in November to stop installing surveillance cameras made by Chinese firms on “sensitive sites” owing to security concerns.Making the announcement, Chancellor of the Duchy of Lancaster Oliver Dowden said ministries should consider whether they should immediately remove and replace such equipment from sensitive sites, rather than wait for scheduled upgrades.Hikvision, a shortened version of its full name Hangzhou Hikvision Digital Technology Company, is banned in the US because of concerns it could share intelligence with the Chinese Communist Party.MPs have previously called for the prohibition of equipment manufactured by Hikvision due to the company reportedly having their cameras deployed in internment camps in China’s Xinjiang province as part of the persecution of the Uighur Muslims and other minorities.",
        "Sir Iain described the finding of Hikvision surveillance equipment on Heron House as a “big deal”.He told Channel 4: “I know that (GCHQ) will come back and say things like they’re not our buildings officially, they belong to the city centre … (to) the council.“But the truth is they are the number one, the most important security centre that we have.",
        "“GCHQ knows everything and, therefore, they are hugely relevant in this debate and they should not have those cameras.“After all, the security service themselves have said they shouldn’t have them, so it’s ironic that the senior part of the security services has them.“That seems an absurdity to me and they should get rid of them.”Sir Iain added: “Who walks through that building is recorded.”A GCHQ spokesman said: “Heron House is a multi-tenancy building.“GCHQ does not operate Hikvision products at any of its sites, including Heron House.“We have a range of measures in place to protect the security of our people, systems and sites, which for obvious reasons we will not describe in detail.”Hikvision has been contacted for comment. The firm has previously said it was “categorically false” to represent it as a national security threat.Manchester City Council has also been contacted in relation to the ownership of the building."
    ]
}