{
    "articleURL": "/wires/reuters/article-12042007/UPDATE-4-BNP-Paribas-quarter-revenue-beats-trading-outperforms.html",
    "content": [
        "Sale of U.S. retail division yields 2.95 bln euros",
        "Outperforms some peers in securities tradingConfirms 2025 outlookBy Mathieu Rosemain and Matthieu ProtardPARIS, May 3 (Reuters) - BNP Paribas's first-quarter sales beat market expectations as trading business at the eurozone's biggest bank outperformed most of its peers, while it started to reap the benefits from rising interest rates.BNP's quarterly profit more than doubled in the first quarter from a year earlier, bolstered by gains from the much-anticipated sale of its U.S. retail division, allowing the bank to beef up its capital and liquidity buffers at a time when lenders strive to restore confidence in a sector hit by turmoil.Revenue of just over 12 billion euros ($13.20 billion) in the period exceeded the company's compiled consensus of 11.7 billion as net interest income ticked higher in the usually difficult French retail market, the bank said on Wednesday.Analysts at Deutsche Bank called BNP's quarterly report \"solid, \" while Royal Bank of Canada analysts said the results pointed to a strong performance at BNP's trading arm and good cost control.Shares stood flat at 1120 GMT, after edging up and down in early morning trade.\"BNPP 1Q23 results are difficult to navigate, but overall slightly ahead of expectations on higher revenues and lower provisions,\" Jefferies analysts said in a note.",
        "In securities trading, revenue edged down 1.8% but still performed better than some peers including Deutsche Bank , which saw fixed-income trading decline by 17% in the first quarter.At U.S. bank Goldman Sachs, first-quarter sales from fixed income, currency and commodities (FICC) trading, usually a bright spot, plunged 17% to $3.93 billion, while equity trading revenue sank 7% to $3.02 billion.BNP's FICC trading over the period was up 9%.The sale of Bank of the West, which closed in February, yielded about 2.95 billion euros ($3.25 billion) in capital gains, the French lender said, helping BNP Paribas shore up its CET 1 ratio - a key measure of financial strength - to 13.6%, up from 12.3% in the previous quarter.The first quarter net income, group share amounted to 4.44 billion euros, in line with expectations, and up from 1.84 billion a year earlier.The group's liquidity ratio was also up by 10 percentage points over the same period, to 139%, while the cost of risk -- money put aside for failing loans -- stood lower than expected at 642 millions euros.INTEREST INCOME UPBNP's first-quarter sales were up by 1.4% from a year earlier to 12.03 billion euros, driven by its investment bank and its commercial and retail branch.",
        "The group's global markets division, which bolstered BNP's results in 2022, saw its sales edge down by 1.8%, in spite of continued growth in FICC trading (fixed income, commodities, currencies).BNP's commercial and retail banking's sales in France grew faster than expenses in the first quarter, driven by the rise in interest rates charged on mortgages following tighter monetary policy.French banks usually lag behind their German and Italian peers because of stringent regulations that cap the rates at which lenders provide mortgages, which are mostly on a fixed rate basis.BNP's operating expenses also jumped 23% in the first quarter from the previous quarter, notably propelled by a nearly 900 million-euro contribution to the Single Resolution Fund, an industry-funded safety net.Restructuring costs worth 236 million euros at BNP Paribas' consumer finance division, where it is cutting 921 positions through voluntary departures and internal mobility, also weighed on expenses.BNP Paribas said it was on track to deliver \"strong growth\" in 2023 distributable earnings per share.It confirmed its 2025 targets, including a return on tangible equity (ROTE) of around 12% by 2025 and an average annual growth in net income of more than 9% between 2022 and 2025.Its 5 billion-euro share buyback programme will proceed as planned, it said. The first tranche of 2.5 billion euros was approved in March, a sign analysts deemed reassuring as it took place shortly after the collapse of Credit Suisse. ($1 = 0.9093 euros)",
        "(Additional reporting by Sudip Kar-Gupta; Editing by Ingrid Melander, Elisa Martinuzzi, Jacqueline Wong and Louise Heavens)"
    ]
}