{
    "articleURL": "/femail/article-12050637/Royal-Windsor-Horse-Show.html",
    "content": [
        "Royals fans were stunned as they claimed to have heard an obscure lyric CORONATION LIVE BLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.ukViewers of the Coronation of the King and Queen were left howling today as they confessed they thought that they heard the choir singing an unusual word during the ceremony.",
        "As King Charles and Queen Camilla entered the Abbey, the choir belted out songs, however, royal fans hilariously pointed out that one of the lyrics appeared out of place.A number of other people look to social media after they could have sworn they heard the word 'vagina' as the ceremony went underway.One person said on Twitter: 'Not the choir sounding like they are singing 'I have a Vagina Camilla' as she walks up Westminster Abbey'.Another suggested that the lyrics may be 'Buy that vagina, Camilla' as the user said: 'Why are they singing buy that vagina Camilla at the Coronation?'",
        "A third added: 'Was it just me or does this song sound like it's saying 'I have a vagina Camilla'.'Another asked: 'Are these lots in the choir singing about Camilla’s vagina?!'While these posts do make a convincing point, it is not likely that these were the words sung by the choir - it is more likely that they were saying the word 'Regina' which is the title used for the reigning queen. The controversial clip is just one of many songs coronation viewers are set to hear during today's proceedings. It was reported that the King and Queen carefully selected songs which will 'showcase and celebrate musical talent from across the United Kingdom and further afield'.",
        "The Coronation Choir is a 300-strong band of amateur singers from across the UK, each of them brought together into one group to perform in front of the newly crowned King Charles III.Chosen singers include farmers from Northern Ireland, NHS workers in Hull, London firefighters and cab drivers, a Welsh male voice choir, Yorkshire’s only female South Asian choir and Gaelic singers from Scotland’s Western Isles.",
        "Additional performers at the event also included a gospel choir and the Byzantine Chant Choir, as well as soloists such as famous baritone Roderick Williams, South African soprano Pretty Yende and Welsh bass-baritone Bryn Terfel.The lineup for tomorrow's Coronation Concert features some household names, with Lionel Ritchie, Katy Perry and Take That all set to perform.It will be the first time that a public concert has taken place at Windsor Castle, with as many as 20,000 people expected to attend the event.The newly-crowned King and Queen have appeared on the Buckingham Palace balcony with a select group of senior royals as The Mall was swamped by tens of thousands of cheering supporters this afternoon.The royal couple waved to gargantuan crowds before a RAF flypast, which had to be scaled back to just helicopters and the Red Arrows because of the heavy rain in London.",
        "The public started chanting 'God Save The King' and gave three cheers as the royals emerged before a resounding cheer when the King and Queen waved to members of the public gathered in the showers. They also sang the national anthem with gusto and several declared the patriotic scenes made then 'proud to be British'.",
        "The Mall was a sea of people, many of whom sprinted to get close to the Palace and catch a glimpse of the King and Queen following their historic coronation watched by 100million people on TV worldwide.Charles and Camilla were joined by the Prince and Princess of Wales, their children, the Duke and Duchess of Edinburgh and Princess Anne. Once again Prince Louis and Princess Charlotte stole the show with some enthusiastic waving and pointing as the jets flew over the Palace to roars. At one point little Louis was open-mouthed and yelled in shock as the planes rushed over their heads.But their uncle Prince Harry decided against going back to Buckingham Palace and appears to have been driven straight to Heathrow Airport to jet home after a 24-hour stay in the UK. He is said to be determined to get back to California to see his son Archie's fourth birthday today."
    ]
}