{
    "articleURL": "/wires/pa/article-12056405/Zoe-Ball-pulls-Coronation-Concert-radio-duties-minute.html",
    "content": [
        "Zoe Ball has said she is “absolutely gutted” at having to pull out of covering the Coronation Concert for BBC Radio 2 at the last minute after falling ill.",
        "The 52-year-old DJ was due to present a show from the grounds of Windsor Castle on Sunday evening ahead of the star-studded event which will feature performances by Take That, Katy Perry and Lionel Richie.Scott Mills will take over from Ball to chat to the crowd ahead of the concert, while Dermot O’Leary will be backstage speaking to the stars before they perform.On Sunday morning, Ball tweeted: “Absolutely gutted… the sickness bug has got me. Was meant to be heading to Windsor Castle for the #coronationconcert on @BBCRadio2 later.“@radioleary and @scott_mills have got you covered. I’m heading back to bed.”The King and Queen and other members of the royal family will join around 20,000 members of the public at the Coronation Concert to continue the celebrations after their crowning at Westminster Abbey on Saturday.The show in Windsor, hosted by Downton Abbey and Paddington star Hugh Bonneville, will also see performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.",
        "Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video.",
        "The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh – seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, will also perform.Meanwhile, fashion designer Stella McCartney will deliver a spoken word performance with a conservation theme which will reflect her and the King’s “shared passion for environmental sustainability”, the BBC has said.Her performance will be part of a broader nature-themed section of the concert which will also include a rendition of a 1980s hit by classical-soul composer Alexis Ffrench and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir.Bollywood star Sonam Kapoor will also deliver a spoken-word performance.",
        "The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Former Desert Island Discs and Crimewatch presenter Kirsty Young will anchor the special live broadcast of the concert in the grounds of Windsor Castle after reporting from a studio at Buckingham Palace on Saturday’s coronation day.",
        "The concert on the castle’s East Lawn will also see TV presenter Clara Amfo and Diversity dance troupe member Jordan Banjo speaking to the artists backstage.Rendered images released last month revealed that the concert will feature a Union flag-shaped stage which fans out to the audience.",
        "The stage will also have a halo-like screen surrounding the roof, which the BBC said will “symbolise the Crown protecting the nation”.Together with the parapet wall steps in the middle, the broadcaster said the staging creates multiple levels for the 74-piece classical ensemble – formed from the strings of the Countess of Wessex’s String Orchestra and woodwind, brass and percussion sections from the Bands of the Household Division – to make an abstracted Union flag.There are four additional catwalks, which also form the flag shape, so fans can see acts close up.At the back of the stage the orchestra will sit in front of the castle.– The Coronation Concert will be broadcast on BBC One, BBC iPlayer, BBC Radio 2 and BBC Sounds on Sunday May 7 from 8pm."
    ]
}