{
    "articleURL": "/femail/article-12056193/Princess-Anne-husband-Sir-Tim-Laurence-join-coronation-street-party-Wiltshire.html",
    "content": [
        "Princess Royal attended a coronation street party in Swindon with her husband Follow all the latest royal news and updates on Coronation events herePrincess Anne today joined Britons celebrating the coronation of King Charles at a street party in Wiltshire.",
        "The Princess Royal, 72, was in high spirits as she met royal fans at the community gathering in Swindon this afternoon.She looked stylish in a creped cream blazer for the occasion with a stripped multicolour shirt and navy trousers. She was accompanied by her husband, Vice Admiral Sir Timothy Laurence, who looked dapper in a tan suit.  Similar gatherings have popped up in streets across the UK this weekend, as the country rallied together to celebrate the first royal coronation in 70 years.",
        "Anne looked relaxed as she arrived at the party, where she met wit well-wishers and enjoyed a cup of tea. The royal crouched to speak to a little girl who held out her five fingers to her, possible to tell her how old she was. The Princess Royal looked stylish in a smart casual look, with the cream blaser and colourful shirt. Her hair was pinned in an updo, and she wore a vibrant shade of red lipstick, but kept the overall look understated. Her and Sir Timothy Laurence's appearance at the street party came as the couple prepared to attend a star-studded Coronation Concert at Windsor Castle tonight. Yesterday, millions watched as King Charles and Queen Camilla were crowned at Westminster Abbey in a lavish religious ceremony, attended by 1,000 senior royals, world leaders and A-list celebrities.",
        "Prince Harry was in attendance, though he quickly departed, and arrived back in California after spending just 28 hours and 42 minutes in his native England. ",
        "Following the ceremony, he slipped out of Westminster Abbey - accompanied by a Metropolitan police escort and four outriders - with only the briefest of goodbyes and headed straight for Heathrow Airport.He was back on the plane to California before his father and stepmother, the newly crowned queen, had even finished having their official portraits taken.At the main event on Saturday, he was obscured by Princess Anne's feathered plume from the cameras for most of the ceremony. He was seated in the third row, close to Princess Eugenie and her husband, Jack Brooksbank.The front row was reserved for the Prince of Wales - his brother, wife and their children, as well as the Duke and Duchess of Edinburgh.As a working royal, Princess Anne was seated in the second row of the pews with her husband Sir Tim Laurence. She also appeared in the traditional balcony moment.She and Sir Tim stood to the far right of the Buckingham Palace balcony, alongside her youngest brother Prince Edward, Sophie, Duchess of Edinburgh and their two children: Lady Louis Windsor and James, Duke of Wessex.",
        "Anne's duties continued today as she made an official visit to the street party in Swindon, where she greeted well-wishers who were out enjoying the Bank Holiday weekend."
    ]
}