{
    "articleURL": "/wires/ap/article-12055219/Rangers-coach-Gerard-Gallant-ways-1st-round-exit.html",
    "content": [
        "The New York Rangers and coach Gerard Gallant are parting ways after losing in the first round of the NHL playoffs.",
        "The Rangers announced the change, which they called mutual, on Saturday - less than a week after a seven-game series loss to the rival New Jersey Devils.\"I have a ton of respect for Gerard as both a coach and person and truly appreciate everything he did for us on and off the ice these last two seasons,\" general manager Chris Drury said in a statement. \"After my evaluation of the season and discussions with Gerard, we mutually came to the conclusion that a change would be beneficial for both parties. I wish he and his family all the best in the future. Our search for a new head coach will begin right away.\"Gallant led New York to the Eastern Conference final in 2022 in his first season with the team and was a finalist for the Jack Adams Trophy as coach of the year. He has not lasted three full seasons in any of his five head jobs around the league.In a statement sent through the team, Gallant thanked owner James Dolan and Drury for the opportunity.\"The experience of coaching an Original Six franchise with such rich history and an incredibly passionate fanbase is something I will never forget,\" Gallant said. \"After conversations with my family and Chris, it became clear that this was the right decision for both myself and the Rangers at this time.\"",
        "Gallant's departure was not particularly surprising, but it came after the 59-year-old defended his job status during exit interviews earlier in the week, calling the line of questioning \"disappointing.\"\"I can´t believe I have to answer some of these questions about me getting let go or getting fired, brought up by the media,\" Gallant said Wednesday. \"If I can´t stand by my record and what I´ve done, I think there´s something wrong.\"The Rangers now begin another coaching search in hopes of finding the person who will get them their first Stanley Cup title since 1994. Three-time championship-winning coach Joel Quenneville's name has already been connected to the franchise, though he would need to be reinstated by NHL Commissioner Gary Bettman after his role in a sexual assault scandal with the Chicago Blackhawks from 2010 that caused him to resign from his job with the Florida Panthers in October 2021.Two years ago, Drury thought Gallant was the right person to lead the Rangers. After assuming control when President of Hockey operations John Davidson and GM Jeff Gorton were fired by Dolan, Drury shifted into win-now mode, hiring Gallant a year and a half after the veteran coach was let go by Vegas.Gallant and the Rangers finished second in the Metropolitan Division in his first year behind the bench and made an improbable run to the East final before losing to Tampa Bay.",
        "With that playoff success raising expectations, the Rangers had an up-and-down regular season and scuffled in the days leading up to the trade deadline. They acquired previous Cup champions Vladimir Tarasenko and Patrick Kane in a pair of deals and finished third in the division to set up a showdown with the Devils.The Rangers won the first two games of the series on the road before losing three in a row, a stretch that included a tirade from Gallant about his team being \"not good enough - not even close to good.\"\"We didn´t show up, we didn´t play hard enough, we didn´t compete hard enough,\" Gallant said after Game 4. \"A lot of bad things.\"New York staved off elimination at home to force a Game 7. Despite some lineup adjustments by Gallant, the Rangers lost 4-0 to get knocked out.___AP NHL: https://apnews.com/hub/NHL and https://twitter.com/AP_Sports"
    ]
}