{
    "articleURL": "/sport/othersports/article-12043035/Tori-Bowie-American-woman-win-100m-major-championship-clip-delight-shared.html",
    "content": [
        "Tori Bowie was elated to be the 'world's fastest woman' after winning in LondonHer death was announced Wednesday, with tributes from track peers pouring inDailyMail.com provides all the latest international sports newsSix years before she would pass away, American sprinter Tori Bowie won gold at the World Championships in 2017 and relished her new title of 'world's fastest woman' in an interview at the time.",
        "Bowie's death at the age of 32 was announced Wednesday, bringing a tragic end to the life of the Olympic gold medalist and Mississippi native.But with her achievement at the 2017 World Championships in London, she remains the last American woman to win gold in a 100 meter major race, and can be seen beaming with excitement in a clip from shortly after her win.'It still kind of feels surreal right now,' she said. 'Like I know it happened but it hasn't really all sunk in yet. And I simply think it's because, I'm like still in work mode, still focused, still trying to focus on the next event.'Yes, I am the world's fastest woman,' she continued with a laugh. 'Oh my god, I've been waiting to say that for years now.'",
        "Bowie won gold in that event by holding off Marie-Josee Ta Lou of the Ivory Coast in second and Dafne Schippers in third place.A year prior in Rio, Bowie helped Team USA retain the Olympic gold in the 4x100m relay by running the anchor leg and outlasting Jamaica's Shelly-Ann Fraser-Pryce.According to Runners World, Bowie hadn't competed since June 4 of last year, when she finished 5th in a 200m race in Florida.Bowie was found dead in her home in Winter Garden on Tuesday. Her cause of death is yet to become public.",
        "On social media, her grieving sister hinted at mental health problems.'People who pretend to be happy have some of the saddest souls and people who do not try to convince the world that they are happy have the most genuine souls, because they are content with just being them for them and nobody else,' she said in a Facebook post.",
        "US record holder and three-time world champion Noah Lyles led the tributes to Bowie online.He responded to her management agency's statement on Twitter, saying: 'I can't believe this.'I had just heard word of her going to be with her sister back home and now this. This breaks my heart to hear and I will keep the family in my prayers.'One of Bowie's competitors, Jamaican Olympic champion Shelly-Ann Fraser-Pryce also paid tribute, tweeting , 'My heart breaks for the family of Tori Bowie.'A great competitor and source of light. Your energy and smile will always be with me. Rest in peace.'"
    ]
}