{
    "articleURL": "/wires/ap/article-12052567/Cologne-ends-Leverkusens-unbeaten-run-Bundesliga.html",
    "content": [
        "LEVERKUSEN, Germany (AP) - Cologne ended local rival Bayer Leverkusen's 14-game unbeaten run by 2-1, and relegation-threatened Schalke earned a priceless win with a 102nd-minute penalty in the Bundesliga on Friday.",
        "Ahead of Leverkusen playing Roma on Thursday in the Europa League semifinals, Davie Selke's two goals put an end to an undefeated run across all competitions which had lasted more than two months and hauled Leverkusen into contention for European places in the Bundesliga. Leverkusen was second to last when Xabi Alonso was hired as coach in October.Selke headed Cologne into the lead in the 14th minute but Leverkusen leveled in the 28th when Amine Adli was left unmarked to run onto a pass from Moussa Diaby and blast the ball past the goalkeeper. Selke restored the lead on the counter eight minutes later off a low cross from Jan Thielmann.Cologne fans hurled dozens of tennis balls onto the field early in the second half, causing a brief stoppage, in what appeared to be a protest against the game being moved to Friday from its original Sunday date.The league moved the game to allow Leverkusen more rest before its semifinal against Roma, the furthest Leverkusen has been in a European competition since losing the 2002 Champions League final to Real Madrid.Leverkusen is sixth in the Bundesliga and Cologne is 10th.",
        "SCHALKE'S DRAMATIC WINSchalke took a big step out of the relegation zone and up to 14th place after beating Mainz 3-2 on a dramatic and controversial penalty call after Mainz leveled twice.",
        "Left back Aarón Martín equalized for Mainz for the second time with a direct free kick in the 70th, but the game changed again deep into stoppage time when video review caught Mainz defender Anthony Caci pulling Marius Bülter's shirt.The clock was in the 102nd minute by the time Bülter stuttered in his run up and scored with a low shot to start wild celebrations with his teammates in front of the thousands of visiting Schalke fans. Defeat was a blow to eighth-placed Mainz's fading hopes of qualifying for European competition.___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}