{
    "articleURL": "/wires/aap/article-12038711/Assange-case-dangerous-threat-press-freedom.html",
    "content": [
        "Media organisations are using world press freedom day to push the United States government to drop extradition proceedings against WikiLeaks co-founder Julian Assange.",
        "The Australian has been in prison in the United Kingdom for the past four years and is fighting extradition to face espionage charges in the US.Australia's media union the Media Entertainment Arts Alliance (MEAA) released a statement alongside the International Federation of Journalists and European Federation of Journalists calling for Assange's release.The statement described his imprisonment as \"the most dangerous threat to press freedom today\".Research by The Australia Institute and the Human Rights Law Centre to coincide with world press freedom day found Australians overwhelmingly supported better protections for whistleblowers.The survey of more than 1000 people found three in four thought whistleblowers made Australia a better place.More than 80 per cent supported stronger legal protections and four in five supported the introduction of an Australian whistleblower protection authority.The centre's senior lawyer Kieran Pender said press freedom was significantly undermined when whistleblowers were put on trial for telling the truth to the media and existing laws offered weak protections that were not working.A press freedom survey conducted by the MEAA in 2022 showed more than 92 per cent of media worker respondents feared that threats, intimidation and harassment of journalists was on the rise.Assange, an Australian citizen, has been a member of the union since 2007 and has been held in London's Belmarsh prison since 2019.",
        "MEAA media president Karen Percy said she was saddened the case against the WikiLeaks co-founder had continued for so long.\"The prosecution of Julian Assange imperils journalism everywhere and undermines the United States' reputation as a safe place for press freedom and free speech,\" Ms Percy said.\"We urge the Australian government to ramp up its advocacy to the Biden administration for the charges be dropped, which would allow Assange to be released from prison and reunited with his family.\"Assange's brother Gabriel Shipton said people across the world should question whether journalists were truly free to report on US foreign and military policy.\"Back in 2010, Julian worked with leading media outlets from around the world to publish factual information in the public interest about US war crimes in Afghanistan and Iraq,\" Mr Shipton said.\"Many of the revelations were deeply embarrassing to the US and its allies, including Australia.\"While Julian has been singled out and continues to suffer the vicious wrath of the US government, not one of these other media outlets is facing any legal repercussions.\""
    ]
}