{
    "articleURL": "/tvshowbiz/article-12048667/Julia-Fox-SLAMS-Met-Gala-claiming-politics-privilege.html",
    "content": [
        "Actress and model Julia, 33, says she has never been invited to the Met GalaInsists the annual event only invites those of privilege and isn't about fashionDescribed late designer Karl Lagerfeld - who was honored at this year's gala - as someone who 'upheld supremacy and imperialism ideals'Julia Fox has sensationally slammed the Met Gala, labelling the glittering star-studded soiree 'stale' and exclusionary, while railing against its hostess Anna Wintour for using it as an excessive display of 'privilege' and wealth. ",
        "Speaking exclusively to DailyMail.com, the 33-year-old model and ex of Kanye West, who has become a fashion icon in her own right in recent years thanks to her very unique approach to personal style, called for 73-year-old Anna to step aside, while blasting her decision to honor late designer Karl Lagerfeld at this year's event. 'To be honest with you, the Met Gala has never spoken to me - I mean look at who is running it,' Julia, who admits she has never received an invite to the annual celebrity event, said. However, the fashion star insists that even if an invitation was to be sent her way, she would not attend, stating that she doesn't want to throw her support behind such an over-the-top display of money and privilege.",
        "'If it was about fashion I'd be there but it's not,' she went on. 'It's about politics, privilege, who your parents are and how much money you make.' On Monday night, stars from across fashion, music, art and entertainment gathered in New York to attend the glitzy soiree at the Metropolitan Museum.The theme at this years event was: 'Karl Lagerfeld-A Line In Fashion', in honor of the  controversial designer who helmed Chanel and Fendi for more than 50 years. Speaking about the theme, Julia voiced her outrage over the choice, blasting the late designer as someone who 'upheld supremacy and imperialism ideals'.",
        "During his tenure at Chanel, Lagerfeld was accused of making several misogynistic, Islamophobic and racist comments. In particular, he rubbished the #MeToo movement saying he was 'fed up' with accusations made about movie producer Harvey Weinstein and other powerful players in the entertainment industry who were accused of sexual abuse and telling victims they should  ‘join a nunnery’ instead of making accusations.The German designer, who died in 2019, aged 85, also had form when it came to those he considered too 'fat'. He criticized German supermodel Heidi Klum, 49, who he said was ‘simply too heavy, [with] too big a bust’ together with singer Adele, 35, whom he labelled ‘a little too fat’. ",
        "As far as Julia is concerned, those same exclusionary ideals are still being put on show at the Met Gala each year, with the model railing against the lack of diversity at this year's event. 'There were no trans people of color or even trans people there', she said. One key change that Julia wants to see take place is the removing of Vogue editrix Anna from the helm of the event - a position that she has held since 1995. Since she took over the organization of the Met Gala from Diana Vreeland, she has grown it into one of the most anticipated celebrity events of the year - and, for some, it marks the highlight of the fashion calendar each year. ",
        "However, Julia is now taking aim at Anna, calling for her to step down from her fashion parapet - not only at the Met Gala but also at Vogue - in order to allow a 'fresh' replacement to pick up her mantle and guide the soiree into the modern age.  'She [Anna Wintour] just won't quit - how long is she going to keep going?' Julia questioned, adding that Anna's fashion publication has become more about 'commerce than art'.'There is a dis-connect. American Vogue is not my favorite: it needs to be more fun and fresh and new energy.'To that end, Julia wants to see big-name stars and 'nepo babies' like Lila Moss - who attended this year's event with her supermodel mother Kate - replaced on the Met Gala red carpet by designers and artists, whose work she believes deserves to be celebrated at such a prestigious occasion. ",
        "'The Met Gala has a gatekeeper vibe,' she opined. 'I don't rank people in my head based on who their parents are or how much money they have: the Met is not exclusive it is exclusionary.'I don't want to sound like I'm butt hurt [because] I love the Met [Museum] but I want to do more for more designers and people that don't have the same privilege so they can be seen and heard.' ",
        "Julia admits that she is considering setting up a rival event that will focus more on the talents off less-celebrated stars in the fashion industry - while also helping to raise funds for those who really need them. 'I want to support fashion designers,' she explained. 'Me and my friends are hoping to start our own gala and help funds disadvantaged people and single mothers.'I just want to tell people don't aspire to be like these people [who went to the Met] aspire to be yourself. There's a little boy or girl our there will look at me and not be ashamed-fashion and art is about vision.' Julia is a mother herself, having welcomed her first child Valentino in 2020 with her former husband, pilot Peter Artemiev, whom she wed in 2018. It wasn't until after her 2021 divorce that Julia burst onto the fashion - and the celebrity - scene when she arrived at Schiaparelli's haute couture runway show in Paris on the arm of Kanye West in January 2022. Julia's appearance with Kanye - whose ex-wife Kim Kardashian is a Met Gala regular - garnered international headlines, with her quirky style turning her into an overnight fashion icon. ",
        "And while many attributed Julia's unique style to Kanye, the actress said it was all down to her and a pal. ",
        "'No-one wants to give me credit for my own style but it was me and my best friend Briana,' she insists. Turning to her formative education, Julia thinks those with a unique sense of self expression, should be put on a pedestal more so than those who haven't worked for their own success.'I went to the same high school as Basquiat,' she recalled. 'It was such an amazing school. It was a school that threw us out into the world. We just did internships.'New York used to be full of misfits and freaks; now it's full of privileged kids and it's stagnate and people are sick of it, it's depressing.' After spending the pandemic in New York, Julia was delighted her hometown had returned to its former glory because she says the elite abandoned their luxury Manhattan apartments.'During the pandemic they all went back to their mansions and New York was cool again. The media was saying it was full of crime but it wasn't,' she shared. "
    ]
}