{
    "articleURL": "/wires/reuters/article-12056891/Cycling-Milan-wins-stage-two-Giro-sprint-finish-Evenepoel-retains-lead.html",
    "content": [
        "May 7 (Reuters) - Italy's Jonathan Milan of Bahrain Victorious claimed his first Grand Tour stage win at the Giro d'Italia on Sunday after powering through to the finish line in the final sprint of stage two, a 202-km ride from Teramo to San Salvo.",
        "After Remco Evenepoel obliterated the competition in the opening time trial on Saturday, stage two was a chance for the sprinters while points were up for grabs for climbers as well.The route's home straight was one km long and a bunch of riders set themselves up for the sprint with Alpecin-Deceuninck in the lead as Ramon Sinkeldam went on the final leadout to give his team mate Kaden Groves the upper hand.Fernando Gaviria (Movistar) and Pascal Ackermann (UAE Team Emirates) were also in the mix but Milan put his head down, emerged from behind Groves and pedalled hard in the last 100 metres to take victory after nearly five hours of cycling.\"It's something incredible. Yesterday I tested my legs before today, I wanted to go for the sprint,\" Milan, 22, said.\"My team mates positioned me to perfection. This is my first win at the Giro, I'm lost for words.\"Yesterday I did a nice time trial, I was quite happy, I was pushing good but I could never imagine that today a victory was coming.\"David Dekker of Arkea-Samsic was second while Groves had to settle for third place.With less than four km to go, there was a crash in the bunch when the road narrowed with Mark Cavendish of Astana-Qazaqstan among the riders to fall, taking out a couple of fans lining the road in the process.",
        "Evenepoel was at the heart of the bunch at the time but he escaped the crash to retain the leader's maglia rosa jersey with a 22-second lead over Ineos Grenadiers rider Filippo Ganna.\"Everything was pretty fine. We were in front so we were out of trouble but it was a nasty crash,\" the Belgian said.\"I actually saw it happen. We know who we can blame for this crash, but that's racing, it's not a nice move but luckily we stayed out of trouble and arrived safe.\" (Reporting by Rohith Nair in Bengaluru; editing by Clare Fallon and Ken Ferris)"
    ]
}