{
    "articleURL": "/wires/pa/article-12042061/Serbian-school-shooter-list-pupils-target.html",
    "content": [
        "A 13-year-old who opened fire at his school in Serbia’s capital drew sketches of classrooms and made a list of people he intended to target in a meticulously planned attack, police said.",
        "The boy killed eight fellow students and a guard before calling the police and being arrested.Mass shootings are extremely rare in the Balkan region, although Serbia is awash in guns left over from the wars of the 1990s. No mass shootings have been reported at Serbian schools in recent years.The boy first killed a school guard and then three students in a hallway, according to senior police official Veselin Milic. He then entered a history classroom close to the school entrance and opened fire again, Mr Milic said.Seven girls and one boy were killed, he added.The victims included a girl with French citizenship, French Foreign Ministry spokeswoman Anne-Claire Legendre said in a statement.The assailant called police when the attack at the school in central Belgrade was over, though authorities had received a call reporting the shooting two minutes earlier.“The child who committed the crime said when he called the police that he shot some people in the school and that… he is a psychopath who needs to calm down,” Mr Milic told state television station RTS.“He said that after committing (the crime) he was caught by fear and panic and funny breathing, and that it was the right thing to call the police and report the event.”",
        "A father of a student said the boy entered his daughter’s classroom, firing at her teacher and then her classmates as they ducked under their desks. Most students at the school were able to flee through a back door, according to a local official.While Mr Milic said the boy had planned the attack for a month, sketching classrooms and writing out a list of children he planned to “liquidate”, authorities said they did not know the motive for the shooting.It is unclear if he shot any of the people named on his list or how many rounds were fired, but police said the boy reloaded the handgun.In addition to the nine killed, six children and a teacher were also taken to hospital.Commentators on television and officials repeatedly said it was the kind of thing they expected to read about elsewhere, particularly in the US. In the last mass shooting, a Balkan war veteran in 2013 killed 13 people, including family members and neighbours, in a central Serbian village.“Today is one of the toughest days in Serbia’s modern history,” said President Aleksandar Vucic, who addressed the nation in a sombre manner, crying occasionally. “Unfortunately, Serbia is united in grief.”Authorities declared three days of nationwide mourning, starting on Friday.",
        "Police identified the boy as Kosta Kecmanovic, who attended the Vladislav Ribnikar school, where students range in age from six to 15.Because he is under 14, he cannot face criminal charges, the Belgrade prosecutor’s office said. Social services will determine what happens to him.He carried two guns belonging to his father — at least one a handgun — and four petrol bombs, officials said.Interior minister Bratislav Gasic said the weapons were licensed and kept in a safe but the teenager, who had been to shooting ranges, apparently knew the code. The father was also arrested but has yet to be charged.Local media footage showed a commotion as police removed Kecmanovic, whose head was covered as officers led him to a car. Police sealed off the blocks around the school. Authorities later carried body bags to a waiting van.Police said they received a call about the shooting at around 8.40am on the day classes resumed after a long weekend for the May 1 holiday.One student described the attacker as a “quiet guy” who had good grades.“He was not so open with everybody. Surely I wasn’t expecting this to happen,” she added.Milan Milosevic, who said his daughter was in a history class when the shooting took place, told N1 television that he rushed to the school when he heard what had happened. He received a call from his daughter who had escaped the building and was unharmed.",
        "“He (the shooter) fired first at the teacher and then the children who ducked under the desks,” Mr Milosevic said his daughter told him.Milan Nedeljkovic, mayor of the Belgrade area of Vracar where the shooting happened, said most of the students were removed from the school through a back door.“We have video surveillance, but now this is a lesson, we need metal detectors too,” he said. “It is a huge tragedy… something like this (happening) in Belgrade. Such a tragedy at an elementary school.”"
    ]
}