{
    "articleURL": "/wires/reuters/article-12056677/Security-worries-overshadow-Russias-Victory-Day-preparations.html",
    "content": [
        "By Gareth Jones",
        "May 7 (Reuters) - Russia stages its annual Victory Day parade on Red Square on Tuesday amid particularly tight security after a series of drone attacks, including on the Kremlin citadel, symbolic heart of the Russian state, that Moscow has blamed on Ukraine.Victory Day is a key anniversary for President Vladimir Putin, who often evokes the spirit and sacrifice that helped the Soviet Union defeat Nazi Germany in 1945 to kindle Russians' sense of patriotism, especially since launching what he calls a \"special military operation\" in Ukraine on Feb. 24, 2022.But several Russian regions have already scaled back events, citing concerns that they could be targeted by pro-Ukrainian saboteurs. And in Moscow, there appeared to be fewer military personnel and less military hardware involved in rehearsals for the parade, though residents wanted it to go ahead as always.\"I think we need to hold (the parade) to boost patriotism among people as it is fluctuating due to the special military operation,\" said Andrei Kucheryavykh, a resident of Belgorod near the Ukrainian border, visiting Moscow with his son.\"People have to know what our great-grandfathers, our grandfathers and grandmothers went through... as many are beginning to forget what May 9 is and what it stands for.\"The Soviet Union lost 27 million people in World War Two, more than any other country.",
        "DRONE ATTACKSRussians' security concerns have grown over the past week following drone attacks targeting fuel depots and freight trains, while media on Sunday also reported overnight multiple blasts across Russian-occupied Crimea.Putin's office linked what it called the \"terrorist\" drone attack on the Kremlin in the early hours of May 3 to the Victory Day parade, which takes place below the walls of the ancient citadel. It branded the attack as an attempt to assassinate Putin, an allegation rejected by Ukraine and its Western allies.Moscow also blamed Kyiv and the West for a car bombing on Saturday that wounded a prominent Russian nationalist writer, Zakhar Prilepin, in a village about 400 km (250 miles) east of Moscow. His driver was killed in the blast.This year's anniversary comes as Russian casualties continue to mount in the Ukraine war, now in its 15th month, ahead of a planned counter-offensive by Ukraine to recapture occupied land.Kyiv has said it expects increased efforts by Russian forces to take the devastated eastern Ukrainian city of Bakhmut ahead of Moscow's Victory Day celebrations.Putin casts the Ukraine war as an existential battle for national survival, just like World War Two, saying Russian forces are fighting Ukrainian \"Nazis\" in the pay of a hostile West which wants to inflict a \"strategic defeat\" on Russia.",
        "Kyiv and its Western allies dismiss this as absurd and say Moscow is waging an imperial-style war to seize territory.In Soviet times, Victory Day commemorations were more low-key, with the emphasis on honouring veterans and their huge sacrifices, which are seared into older Russians' folk memory.Since 2008, under Putin, the anniversary has also increasingly become an occasion to burnish an image of post-Communist Russia restored to the greatness of former years.\"It's our history. All our new generations should remember it, know it and not forget it,\" said one Moscow resident, Andrei.(Additional reporting by Reuters Television, Writing by Gareth Jones, Editing by Angus MacSwan)"
    ]
}