{
    "articleURL": "/wires/reuters/article-12055497/Kraken-battle-Stars-series-shifts-Seattle.html",
    "content": [
        "It appears the Seattle Kraken's hopes for a Joe Pavelski-like return from leading scorer Jared McCann will have to wait.",
        "McCann skated with the Kraken on Saturday, wearing a no-contact jersey during an optional practice. It was McCann's first time on the ice with teammates since April 24, when he took a late hit from Colorado's Cale Makar and suffered an undisclosed injury.The forward likely won't play when the Kraken play host to the Dallas Stars on Sunday night in Game 3 of their Western Conference semifinal series. The series is tied 1-1.\"I don't believe (Sunday) night is a possibility,\" Kraken coach Dave Hakstol said of McCann's comeback. \"We'll take it one step at a time. He's going to jump back in at a very high level, so first things first. We've got to make sure his health is where it needs to be, and then he's got to be ready to get into the lineup, and it's a step-by-step process.\"Hakstol said McCann has been going through \"injury protocol\" and skated on his own twice before joining his teammates.\"I don't really have an update other than the fact that he's on the ice and he's able to be out there with the optional skate (Saturday), which is a really good step for him,\" Hakstol said. \"We'll just continue progressing. Nothing imminent in terms of return.\"Even without McCann, the Kraken eliminated the defending Stanley Cup champion Colorado Avalanche in seven games in the opening round of the playoffs and split the first two games in Dallas.",
        "Tye Kartye, the American Hockey League's rookie of the year, has two goals in five games in McCann's spot on the Kraken's top line with Matty Beniers and Jordan Eberle.\"Obviously, he's a big part of this offense with the amount of goals that he's scored,\" Eberle said of McCann, who had a career-high 40 goals in the regular season. \"We rely on our depth, and I think that's kind of what's carried us with his absence. But just getting him back and then added on to what we're doing, it's a big piece. Hopefully, we get him back soon.\"Pavelski returned for the series opener against the Kraken after he suffered a concussion in Game 1 of Dallas' first-round matchup against Minnesota. The 38-year-old scored all of Dallas' goals in a 5-4 overtime loss Tuesday, then tallied another in a 4-2 victory in Game 2 Thursday.Stars rookie Wyatt Johnston, 19, who lives with Pavelski's family, added a goal and an assist.\"Yeah, I don't know what they're eating in the Pavelski household right now, but it's working,\" Stars teammate Tyler Seguin said. \"Mrs. Pavelski's making some good food or something, because they're buzzing.\"The Stars' coaching staff suggested the living arrangement last fall so Pavelski could mentor Johnston.\"It's fun to watch because Wyatt is just starting his career, and Joe has done everything but win a (Stanley) Cup,\" Stars coach Peter DeBoer said. \"Joe understands the importance of the messaging and what he's teaching Wyatt, and I think Wyatt is going to appreciate that down the road, probably a lot more than he does now.",
        "\"He's a pretty smart kid, but I think he's going to really get it probably 10 years from now when he looks back and goes, `Wow, was I lucky to be in that situation with that guy.'\"--Field Level Media"
    ]
}