{
    "articleURL": "/tvshowbiz/article-12048281/Shawn-Mendes-Camila-Cabello-appear-loved-Coachella-reunion.html",
    "content": [
        "Shawn Mendes and Camila Cabello are proudly showing off their on-again romance, as the pair were spotted enjoying a flirty date night in Los Angeles on Wednesday. ",
        "The on-again couple were spotted sharing a romantic embrace as they met for some laughs at the Hollywood Improv, a comedy club on Melrose Avenue, following their Coachella reunion last month. Their body language suggested they were more than just friends as they shared a smile and gazed lovingly at one another. The romantic outing comes weeks after an insider revealed to DailyMail.com that the duo have been secretly seeing one another for weeks - after 'playing the field' during their 18-month split made them realize just how 'special' their relationship really is.'They have hung out several times with friends and alone in recent weeks. They are seeing where things go,' the source told DailyMail.com.",
        "As the latest images prove, the duo definitely seemed happy together. The songstress could not stop smiling as they enjoyed some time at the club before making their way to the iconic Sunset Tower Hotel in West Hollywood. The duo certainly dressed up for their night on the town.Camila wowed in a black mini dress worn over a white button down and a silver sequined purse in her hand.She strutted alongside him in black peep toe heels.As for Shawn, he smartened up in a white turtleneck and tan slacks.The pair first sparked rumors of a reconciliation last month when they were caught on camera enjoying a very passionate kiss at Coachella, before they were seen holding hands in Venice, California. ",
        "Since their breakup in November 2021 after dating for two years, they have both gotten romantically involved with other people - which, the insider says, made them realize just how 'special' their romance with one another had been.'Having played the field for two years now, they both know now how special what they had was,' the source went on.'Not to mention that their sexual chemistry is off the hook. Camila turns Shawn on like no other woman. She always has.'Last month, on the same day that they were videotaped holding hands on their romantic stroll, Camila released a teaser for her new single June Gloom - and it could not be any more obvious that it was written for Shawn and their Coachella tryst.",
        "In the song, Camila sings: How come you’re just so much better? Is this going to end? ever? I guess I’ll f**k around and find out. Are you coming to Coachella? If you don’t it’s whatever. If you do honey, It’ll be all I think about.'This is not the first time around for the sexy singers, who met in 2014 when they collaborated on the song I Know What You Did Last Summer.After years of speculation, the announced that they were dating in the summer of 2019 - shortly after the release of their second smash hit, Senorita.",
        "They moved into a home in Los Angeles together at the height of the Covid-19 pandemic and got a dog, Tarzan. The couple called it quits in November 2021.",
        "'So here is the thing. They never really stopped talking since their breakup,' the source tells DailyMail.com.'Because they share a dog together, which Camila takes care of, they have been in communication. Any one who has gone through a breakup with pets understands this.'They shocked their legion of die-hard fans when they announced their separation just prior to Christmas in 2022 with a joint statement posted to their Instagram.The statement read, 'Hey guys, we've decide to end our romantic relationship but our love for one another as human is stronger than ever. We started our relationship as best friends and will continue to be best friends.'According to the source, 'they broke up because they were going too hard, too fast.''",
        "'They moved in together during the pandemic and were together 24/7 for a year. When the pandemic died down and the threat lessened, they both needed to explore.''They focused solely on each other and not on their music, which is their first passion.'Eight months after she and Shawn broke up, Camila started dating Lox Club dating app CEO, Austin Kevitch, 31.",
        "The two kept their romance private in comparison to her very public relationship with Shawn.Shawn, meanwhile, has been spotted out on numerous dates with various women.",
        "In recent months, he has been spending a lot of time with his longtime chiropractor who is more than double his age, Dr. Jocelyne Miranda, 51.Shawn and Dr. Miranda have been seen out together on many occasions, leading many to believe she was doing more than just an alignment on him.This, however, was not true and it was confirmed that they were just friends.The source tells DailyMail.com that during Shawn and Camila's time apart, they never stopped having feelings for each other.'Camila started dating Austin and Shawn started dating again too,' the source adds.Camila and Austin announced their separation just several months ago.'He kept putting every girl up against Camila and she kept comparing her relationship with Shawn to Austin.''This is one of the reasons that she and Austin did not work out. Camila has never stopped being crazy about Shawn and she has always felt that he was the one for her,' the insider tells DailyMail.com.Last month, Shawn and Camila shocked a packed crowd at Coachella when they were seen making out with each other in the middle of the festival.",
        "Neither seemed to care who was watching. They arrived with a group of friends and they left with a group of friends.When they left the venue, Camila played coy when asked by paparazzi if they were back together, before getting into a blacked-out SUV that Shawn was in and driving away."
    ]
}