{
    "articleURL": "/wires/reuters/article-12046995/Excitement-apathy-ahead-King-Charles-coronation.html",
    "content": [
        "By Jeevan Ravindran and Natalie Thomas",
        "LONDON, May 4 (Reuters) - Dozens of royal fans have begun camping out in central London ahead of King Charles' coronation on Saturday, but while they and millions more are anticipating the historic event with excitement, at least as many say they do not care.The coronation, whose origins date back 1,000 years, will be the biggest ceremonial event since that staged for Charles' mother Queen Elizabeth in 1953, with a display of pageantry and a huge military procession.For some Britons, it is a once in a lifetime event. For others, it is a welcome occasion only because it provides a day off work with an extra holiday on Monday.\"They just take everything from me. They never do a day's work,\" said Philip Nash, 68, as he swept the streets in Whitechapel, a more run down area of east London.\"I'd like to see one of them come out here, come sweep this street. Have you known any of them to do a day's work? They are like vampires, sucking my blood.\"For some in Whitechapel, an area where immigrants have settled in the British capital for centuries, a spectacular ceremony for the royals seemed inappropriate when many are dealing with high inflation - running at over 10% - which is sending the cost of food and energy soaring.",
        "\"With loads of people struggling to pay bills and dealing with a lot of loss, it's kind of disheartening to see on TV so much resources and money being given to this family ... it doesn't feel like they're giving us anything back,\" said dentistry student Unab Ali, 19.Across the capital and many parts of Britain, shops and public areas are bedecked with Union Flag bunting and street parties are planned. Giant screens will show the ceremony at 30 sites around the nation.While planning and details for the historic occasions have been trailed for months in the media, polls suggest the majority of the public are not that interested.A YouGov poll last month found only 33% of those asked cared about it. Another survey last week found 48% were likely to watch it on television compared to 46% who said the opposite.That contrasts with 1953 when millions thronged the streets of London and some 27 million people watched the televised ceremony for Elizabeth, which was for many the first time they had watched any event on TV.UNPLUGGING\"I'm actually unplugging completely on Saturday and I'm just going to go and be in nature for the day, with my phone off. So I won't be celebrating,\" Justin Hackney, a 32-year-old filmmaker said. \"But I know my mum will, because it's special to her, because it was special to my grandma.\"",
        "For those already lining the Mall, the grand boulevard leading to Buckingham Palace, there was a prevailing sense that this too would be a special moment.\"I wouldn't have missed this for the world,\" said Tony Chen, who travelled from central England to camp out despite having a severe heart condition. \"Being at home watching it on TV is not like being here in real life.\"Ali Stephens, 50, a nursing associate, said it might be nonsense, \"but it's our nonsense\".\"It's something that this little country has got and big countries haven't got that,\" she said. \"And so we should really cherish it and be thankful for all that pageantry and all that nonsense ... you don't get that in a republic.\" (Reporting by Javeen Ravindran and Natalie Thomas, writing by Michael Holden; Editing by Janet Lawrence)"
    ]
}