{
    "articleURL": "/tvshowbiz/article-12051895/Julia-Fox-chats-Grimes-dangers-celebrities-using-Photoshop.html",
    "content": [
        "Julia Fox donned a red wig as she chatted with Grimes about celebrities endorsing unrealistic beauty standards in her latest episode of her Forbidden Fruits podcast.",
        "Fox, 32, looked near unrecognizable as she sported the 70s-inspired hairdo while in dialogue with the musician, 35, about how 'irresponsible' technology has made 'everyone a 10,'Uncut Gems star Fox said: 'A lot of celebrities Photoshop their images, a lot of girls have unrealistic expectations, like, why can't I look like that?'Like boo, they don't even look like that!'Tech mogul Elon Musk's ex Grimes, who shares two children with the billionaire, said: 'Yeah I feel like the idea that the average person is a 10 right now is very impressive if you're a kid right now. ",
        "'It's very concerning, it's the most irresponsible thing tech is doing right now.'Fox added that she believed tech was 'demonic'.Back in February Fox revealed she has had liposuction and Botox in the past in a candid new interview.The actress said she was 'saggy' and her body had changed, but that she was not going to do a 'damn thing about it' as she spoke to Elle.Revealing she would consider the cosmetic procedures again, she said: 'I’m, like, saggy, like, things are not sitting the way they used to.'But it’s like, I am not gonna do a damn thing about it. ",
        "The fashion maven has previously spoken about how 'aging is fully in' in a TikTok posted last year.",
        "She said:' Dirty girl, ugly, not wearing clothes that fit your body type … all those things are in.''If I see another product that says anti-aging on the label, I’m suing. I’m going to sue.'I’m going to age regardless of if I put that f*****g $500 serum on my face and you all f*****g know it and we know it, so let’s stop lying to ourselves.She also said getting older is 'probably the sexiest time in life actually, because being pretty and hot in your twenties is the f*****g trenches.'"
    ]
}