{
    "articleURL": "/wires/ap/article-12051705/Wearing-red-Indigenous-families-honor-missing-relatives.html",
    "content": [
        "ALBUQUERQUE, N.M. (AP) - Native Americans whose relatives have gone missing or been killed wore red on Friday, a color synonymous with raising awareness about the disproportionate number of Indigenous people who have been victims of violence.",
        "Missing and Murdered Indigenous Peoples Awareness Day is held on May 5 - the birthday of Hanna Harris, who was only 21 when she was slain on the Northern Cheyenne Indian Reservation in Montana.Countless more Indigenous people have gone missing since her body was found nearly a decade ago. Advocates describe it as a silent crisis, rooted in colonization, forced removal and government policies that led to the stamping out of culture and identity as entire communities were marginalized.This weekend's marches, symposiums, prayer gatherings, art installations and ceremonies are meant to pressure policy makers in the U.S. and Canada to ensure equity when investigating such cases. The red dresses, they say, are used to call home the spirits of missing and slain Indigenous victims.\"We have to call this national state of emergency what it is -- a genocide,\" Carol McBride, president of the Native Women´s Association of Canada, said in an email. She urged people to channel their grief into activism. \"Wearing red is powerful.\"Canada's House of Commons unanimously approved a motion this week calling on the government to declare a national state of emergency. Such a declaration would make more tools available, said Mel Critch, who works with the Native Women's Association of Canada and is co-chair of the group Manitoba Moon Voices.",
        "The burden of tackling the problem has fallen largely to Indigenous women, relatives and other community members, Critch said.\"As this moves through the Senate, our communities will be watching and listening carefully, praying for its adoption and a day when this will end, when our children and families will be safe,\" Critch said.Lawmakers in the U.S. introduced their own resolutions this week supporting the May 5 effort.High rates of violence, sexual assault, homicides and disappearances of Indigenous people, particularly women, have festered for generations amid inadequate public safety resources in Indian Country, where tiny police forces are responsible for vast territories and a tangled web of local and federal jurisdictions often complicates efforts to track and communicate about cases as they happen.About 4,200 missing and murdered cases have gone unsolved, according to U.S. Bureau of Indian Affairs estimates. Federal health statistics document murder rates for Native American and Alaska Native women at 10 times the national rate.Still, the number of missing and slain Indigenous women remains unknown. A 2021 review by the nonpartisan Government Accountability Office pointed to reporting problems, distrust of law enforcement and jurisdictional conflicts.Recently adopted U.S. laws aim to improve data collection and law enforcement responses. A national commission began holding public meetings in April to craft more recommendations. Gary Restaino, the U.S. attorney for Arizona, will be listening to tribal leaders and families at next week´s commission meeting in Flagstaff.",
        "He said the Justice Department now prioritizes cases in Indian Country, bringing the Marshals Service, Drug Enforcement Administration and Bureau of Alcohol, Tobacco, Firearms and Explosives to support the FBI when local or tribal police call for help.\"That, I think, is a real expansion from the way we have traditionally done these cases and should be an opportunity to get more resources into underserved areas in Indian Country,\" he said.Many states have created their own task forces and commissions, aiming to keep cases from falling through the cracks. Prosecutors in New Mexico's largest judicial district have a special unit to help with missing person investigations involving Native Americans.In California, lawmakers approved the creation of an alert system to help find Indigenous people missing under suspicious circumstances. The legislation came last year after the Yurok Tribe issued an emergency declaration after five Indigenous women were reported as missing or were killed within a span of 18 months.\"Every time someone goes missing in this state, that is tomorrow´s historical trauma,\" said Abby Abinanti, the Yurok Tribe´s chief judge.The tribe plans to use drones to bolster its search and rescue program.The Round Valley Indian Tribes in Northern California also declared an emergency, and imposed a curfew for minors following the recent killings of two tribal citizens.",
        "Washington is creating a cold case investigations unit, and Oklahoma's governor signed legislation Monday ordering state public safety officials to work with tribes on an alert system named for Cherokee Nation citizen Kasey Russell, who went missing in 2016.While there has been progress, state and federal lawmakers agree that more needs to be done.California Assemblymember James Ramos told a hearing Tuesday that trends in his state don't show improvement. He wants qualified tribal law enforcement officers to be able to access a statewide telecommunications system as they investigate missing persons cases.In New Mexico, advocates want the governor to issue a new executive order to chart the next phase of implementing recommendations made in an extensive task force report in 2020.For Melody Delmar, who leads MMIP projects for New Mexico's Indian Affairs Department, the crisis is personal. As a social worker, she's often among the first people families call when they need help.Her dream? A state office dedicated to Indian Country cases where families could be assigned a social worker.\"There´s just so many levels of this and it can be complicated,\" she said. \"But we also can look at this and know there are solutions out there too.\"Nearly two years passed before federal authorities made an arrest in the case of Ella Mae Begay, a master Navajo weaver who went missing in 2021.",
        "Her niece, Seraphine Warren, walked from the Navajo Nation to Washington D.C. to raise awareness. She has not given up finding her aunt - she's gathering volunteers for another search of the desert in the coming weeks.Waiting for information to trickle down from authorities to grieving family members is like torture, Warren said.\"All that families want is for somebody to check on them, to see if their cases are still being investigated,\" said Warren, who will be marching in Seattle this weekend.U.S. Interior Secretary Deb Haaland received a briefing Friday in Albuquerque from her agency's Missing and Murdered Unit, created in 2021. To date, the unit has investigated 728 cases; solved or closed 263 missing persons cases; and solved eight murder cases.Advocates are watching closely as Congress hashes out budget requests for federal agencies, including the Bureau of Indian Affairs. Cuts could result in fewer law enforcement officers in areas that are already understaffed.U.S. Rep. Raúl Grijalva, an Arizona Democrat, said Congress has a responsibility to honor trust and treaty obligations with Indian Country.\"And it's important to affirm that this is a priority,\" he said.___Associated Press contributors include Sophie Austin in Sacramento, Calif.; Claire Rush in Portland, Ore., Sean Murphy in Oklahoma City, Okla. and Terry Tang in Phoenix, Ariz."
    ]
}