{
    "articleURL": "/wires/pa/article-12041841/Child-killer-s-sentencing-broadcast-legal-media-victory.html",
    "content": [
        "A child murderer will be sentenced on television for the first time in England and Wales following a successful legal challenge by the media.",
        "Marques Walker, 17, can now be identified as the killer of Jermaine Cools, who at the age of 14 was the youngest victim of fatal knife crime in 2021.Jermaine was stabbed as he lay defenceless on the ground outside a chicken shop in Croydon, south London, on November 18 2021.At the time of the killing, Walker, then aged 16, was on bail for carrying a large knife, the Old Bailey was told.Earlier this year, Walker, now 17, pleaded guilty to Jermaine’s murder and possessing a knife. There is a very strong argument in this case in support of the lifting of reporting restrictions  Prosecutor Caroline Carberry  Ahead of his sentencing, a joint application was made by the PA news agency, The Times, The Sun and The Daily Mail newspapers to lift a court order banning Walker from being identified.A separate bid was made for permission to film Walker’s sentence and broadcast the footage on news channels and online.Jermaine’s parents Lorraine Dudek and Julius Cools attended the legal hearing by video link on Wednesday to discuss reporting of their son’s case.Walker’s lawyer attended court and the media was represented by a barrister.Prosecutor Caroline Carberry KC said: “There is a very strong argument in this case in support of the lifting of reporting restrictions and once it is deemed in the public interest for reporting restrictions to be lifted the hearing may be recorded for broadcast unless there is a reason not to. We bear in mind the defendant would not be filmed.”",
        "She argued that in the circumstances of the case the widest reporting would act as a “very powerful deterrent” and that Jermaine’s parents were “fully supportive of the widest possible reporting”.Judge Sarah Munro KC lifted the legal restriction on naming Walker and agreed to allow his sentence to be filmed despite his young age.In her ruling, she said: “Jermaine was the youngest victim of fatal knife crime in 2021.“The defendant was 16 at the date of the murder. He is 17 now and will be 18 in four months’ time. The reporting restriction would, in any event, lapse upon his attaining 18.“In this highly fact-specific case I have no hesitation in concluding that the restriction should be lifted and I hereby revoke the S45 order.“In all the circumstances of this case the welfare of this defendant does not outweigh the public interest in open justice and a reporting restriction is no longer necessary.”Outlining her reasons, she said: “The serious nature and increasing prevalence of knife crime, knife-related homicide and violent crime…; the consequent need for deterrence; the promotion of public confidence that the criminal justice system is addressing the problem; and the proximity of the defendant’s 18th birthday… all outweigh any minimal impact upon the welfare of defendant.”",
        "She added: “Having decided to revoke the reporting restriction, I will also grant the application for the sentence to be filmed and televised.”Jermaine was fatally injured in London Road, near West Croydon railway station, following a fight involving a number of people on November 18 2021.Police have previously said that at 6.41pm, a member of the public reported the incident outside a chicken shop.Walker was caught on chilling CCTV calmly walking towards the fight and drawing a large knife from his coat.Jermaine appeared to fall over and the youth ran towards him while he was on the ground.Walker was seen to repeatedly lunge at Jermaine with the knife while his victim was frantically trying to avoid being stabbed.",
        "Jermaine received multiple stab wounds and the defendant ran off from the scene with the knife.A member of the public approached Jermaine, who was bleeding heavily, and helped him into a car and drove him to Croydon hospital, where he later died.A post-mortem examination found he had suffered seven stab wounds to his body, with the fatal wound to his chest piercing a lung.A murder investigation began and the defendant was quickly identified from CCTV.However, he had left his home and police hunted for him for nearly six weeks.",
        "On December 27 2021, he was found hiding behind a bed and gave a false name to officers.It was while on the way to the police station that he finally provided his real name and was arrested for murder.At the station he refused to answer any questions but was charged with Jermaine’s murder and possession of an offensive weapon.Judge Munro will sentence Walker, from Bromley, Kent, at the Old Bailey on May 9.In July last year, Judge Munro made legal history when she became the first judge to be broadcast as she sentenced a defendant for manslaughter at the Old Bailey following the change in the law."
    ]
}