{
    "articleURL": "/wires/ap/article-12048431/Napolis-title-not-expected-start-season.html",
    "content": [
        "When Lorenzo Insigne, Dries Mertens and Kalidou Koulibaly left Napoli after several years of near misses, many thought the likelihood of a first Serie A title since the days of Diego Maradona went out the door with them.",
        "Little did they know that an unknown winger from Georgia and a not-so famous striker from Nigeria were going to pick up the pieces and lead the team right to the top.Sure, Khvicha Kvaratskhelia and Victor Osimhen had plenty of help. But there's no question that those two were the key elements that helped Napoli clinch the title on Wednesday following a 1-1 draw with Udinese.It's Napoli's first Sere A title since Maradona led the club to its only two championships in 1987 and 1990.Not much was expected when Napoli brought in the 22-year-old Kvaratskhelia to replace Insigne on the left wing. But the dribbling specialist scored his first goal for the club only 37 minutes into his Serie A debut back in August.His skills on the ball quickly earned the nickname \"Kvaradona\" in homage to Napoli´s greatest hero - the namesake of the club's Stadio Diego Armando Maradona.",
        "And when Kvaratskhelia isn´t scoring, he´s setting them up for others - mainly Osimhen - with a league-best 10 assists.The 24-year-old Nigerian leads the Serie A with 22 goals.Osimhen has already surpassed his previous best for Napoli, when he scored 14 goals last season. But other players have been weighing in, too, with Napoli scoring 69 goals in the league this season, far more than any other team.",
        "Napoli also signed Kim Min-jae from Fenerbahce as a replacement for defensive stalwart Koulibaly. The South Korea center back swiftly adapted to life in Italy and was named Serie A player of the month in September.STARTING FROM ZERONapoli president Aurelio De Laurentiis bought the club in 2004 when it was declared bankrupt.Restarting from the third division, De Laurentiis has drawn notice for avoiding debts and financial fair play sanctions as he's brought the club back to prominence - first by returning to the top division in just three seasons and then developing into a perennial contender.Napoli has finished in the top three nine times under De Laurentiis.SPALLETTI´S SUCCESSNapoli coach Luciano Spalletti´s exciting brand of attacking soccer has earned plaudits across Europe. And now it's earned him the scudetto, also known as the Serie A title.Spalletti rarely rotates his team, tending to stick to mainly the same starting lineup. That tactic has helped the players gain confidence in themselves and each other.The 64-year-old Italian previously coached teams such as Inter Milan and Roma, but his innovative style first showed promise at Udinese nearly two decades ago. It was up in the northern Italian city of Udine where he found success, leading the provincial club to a fourth-place finish and a spot in the Champions League.",
        "Spalletti went on to win Italian Cup titles with Roma in 2007 and 2008 and then Russian league trophies with Zenit St. Petersburg in 2010 and 2012.NORTH-SOUTH DIVIDENapoli's title will bring the scudetto to southern Italy for the first time since Roma won the title in 2001.Juventus and the two Milan teams - AC Milan and Inter Milan - have shared every league title since then.Apart from Roma, only Sampdoria (1991) and Lazio (2000) have interrupted the domination of Serie A by the \"Big Three\" since Napoli last won the league in 1990.___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}