{
    "articleURL": "/wires/pa/article-12052337/George-Russell-Lewis-Hamilton-ear-surprise-Mercedes-one-two-Miami-practice.html",
    "content": [
        "George Russell saw off Lewis Hamilton as Mercedes completed a surprise one-two finish in opening practice for the Miami Grand Prix.",
        "In the closing moments of the one-hour running in the Sunshine State, Russell and Hamilton moved from the back of the pack to the front.Hamilton held top spot for a handful of seconds before he was usurped by team-mate Russell. Charles Leclerc finished third for Ferrari, one spot ahead of championship leader Max Verstappen.Formula One is back in Miami for a second time at a 3.36-mile circuit constructed around the Hard Rock Stadium – home of NFL side the Miami Dolphins – 15 miles north of the city.The race marks the first of three rounds to be staged in the United States this year as F1’s American owners Liberty Media continue to build on the rise of the sport across the Atlantic.A debut event on the Las Vegas strip will take place in November, while Austin’s grand prix at the Circuit of the Americas – a permanent fixture on the F1 schedule since 2012 – also features.",
        "Despite the boom of the sport, the actual competition is facing accusations of being “predictable” and “boring” with Red Bull winning 14 of the last 15 races.Verstappen leads Red Bull team-mate Sergio Perez in the standings by six points after the opening four rounds.But Mercedes’ encouraging start here will provide hope that Red Bull might not have it all their own way in Florida.",
        "Russell edged out Hamilton by 0.212 sec with Leclerc three tenths back. Verstappen ended the first running four tenths behind Russell, while his Red Bull team-mate Perez, who comfortably won the Azerbaijan Grand Prix last weekend, was only 11th.The session was earlier suspended for nine minutes when Nico Hulkenberg crashed into the wall after he lost control of his Haas coming through the third corner.With Hulkenberg’s broken machine in a precarious position, the red flags were deployed.Behind the top four, Carlos Sainz took fifth for Ferrari, with Alpine’s Pierre Gasly sixth and the Aston Martin of Fernando Alonso seventh.Lando Norris finished 16th for McLaren, 1.8 sec back while home favourite and sole American in the field Logan Sargeant, who was raised in nearby Fort Lauderdale, finished 19th of the 20 runners.The concluding action of the day gets under way at 17:30 local time (22:30 UK)."
    ]
}