{
    "articleURL": "/wires/afp/article-12048263/Trump-denies-rape-allegation-video-testimony-played-court.html",
    "content": [
        "Donald Trump described his rape accuser as \"mentally sick\" in a videotaped deposition that was played for jurors in his sexual assault and defamation civil trial Thursday.",
        "\"She's a liar and she's really a sick person. I think she's sick, mentally sick,\" Trump said of former American columnist E. Jean Carroll.He made the comments in October when he sat for a deposition in Carroll's lawsuit against the ex-president.Carroll sued Trump last year alleging that he raped her in a New York department store in the mid-1990s.She also claims that he defamed her when he accused her of lying after she went public with the allegation in 2019.Trump has repeatedly and strenuously denied the allegations and has not been criminally prosecuted over them.During the deposition, Trump reiterated his claim that he does not know who Carroll is and repeated several times comments he's made before that \"she's not my type.\"A friend of Carroll's testified Thursday that Carroll told her shortly after the alleged rape that Trump had attacked her.\"I was fighting, I was fighting,\" retired journalist Carol Martin recalled Carroll as saying, adding that Carroll had not used the word rape.Trump's lawyers have said the former US leader will not take the stand in court during the trial.About a dozen women came forward accusing Trump of sexual misconduct in the run-up to the 2016 presidential election.Among them was former businesswoman Jessica Leeds who testified in Carroll's lawsuit that Trump sexually assaulted her on a plane in the 1970s.",
        "Trump has repeatedly denied all allegations of sexual assault and has never been criminally prosecuted over any such claims.Carroll's suit seeks unspecified damages and asks that Trump retract his comments.If Trump is found liable, it will be the first time he faces legal consequences over an allegation of sexual assault.",
        "The case is one of several legal challenges facing Trump, as the 76-year-old Republican seeks a return to the White House in next year's election.Last month, he pleaded not guilty in a criminal case related to a hush-money payment made to a porn star just before the 2016 vote.Trump is also being investigated over his efforts to overturn his 2020 election loss in the southern state of Georgia, his alleged mishandling of classified documents taken from the White House and his involvement in the storming of the US Capitol by his supporters on January 6, 2021."
    ]
}