{
    "articleURL": "/wires/pa/article-12039721/Academics-launch-search-super-memorisers-new-study.html",
    "content": [
        "Scientists are on the hunt for “super memorisers” to take part in a new study about people with exceptional memories.",
        "Academics from the University of Cambridge are trying to uncover why some people are much better at remembering than others.Anyone who believes they have an exceptional memory is being urged to take an online survey and memory test. We’re looking for anyone who thinks they might be a ‘super memoriser’ to try out our memory tests  Study lead Professor Sir Simon Baron-Cohen  Based on their performance, some will be invited to Cambridge to have a brain scan so researchers can examine the images in detail to assess whether there are any differences in structure or function.“Memory is one of the best understood psychological processes in terms of brain networks and yet we still don’t really know why some people have exceptional memories. That’s why we’re inviting people to take part in our study,” said Professor Jon Simons from the Department of Psychology at the University of Cambridge.The researchers are also aiming to discover whether people who are autistic or neurodiverse are more likely to have an exceptional memory.",
        "The team have previously worked with writer Daniel Tammet, who is autistic and has synaesthesia and can recall the number pi to 22,514 digits.Professor Sir Simon Baron-Cohen, director of the Autism Research Centre at Cambridge University and lead investigator of the study, said: “You don’t need to have won any competitions to take part or to consider yourself neurodiverse – and you certainly don’t need to be able to recite pi to 22,000 digits.",
        "“We’re looking for anyone who thinks they might be a ‘super memoriser’ to try out our memory tests.”Dr Carrie Allison, also from the Autism Research Centre, added: “We hope that people will enjoy taking part in this study and in the process contribute to helping us understand more about memory and whether exceptional memory is related to autism.“For decades, autism research has focused on disability, but this study is a wonderful opportunity to focus on strengths.”– People aged 16 to 60 who wish to take part in the online memory tests – such as memorising a phone number or patterns on a chess board – can visit: https://cambridge.eu.qualtrics.com/jfe/form/SV_eFYFJCUtGpbc3RA"
    ]
}