{
    "articleURL": "/tvshowbiz/article-12046825/Kevin-Costner-didnt-Yellowstone-crew-member-pregnant-despite-viral-rumor-divorce-filing.html",
    "content": [
        "READ MORE: Costner's wife seen for first time without wedding ringSources close to Kevin Costner are denying a new rumor that he allegedly impregnated a woman on the set of Yellowstone.",
        "The seemingly unfounded rumor apparently began spreading shortly after Costner's second wife Christine Baumgartner filed for divorce on Monday.The sources told TMZ that the rumor is 'total BS,' despite how it has been spreading on social media.A representative for Costner told DailyMail.com that the rumor was 'absolutely not true.'Befitting an online rumor, there doesn't seem to be a specific woman who is alleged to have gotten pregnant with the 68-year-old actor.Watch the epic final instalment of Yellowstone returns this November, only on Stan. ",
        "The source of the rumor also isn't clear at this time.As cited by the outlet, one person previously wrote on Twitter: 'I wonder now, if the drama surrounding Kevin Costner and Yellowstone “scheduling,” was due to the rumor of him potentially getting someone on set pregnant? Was he trying to avoid or is there more to it? Or just a rumor?\"Another user replied to an earlier story about Costner's wife filing for divorce with, 'So it wasn’t Bentley who got a girl pregnant on the Yellowstone set.. it was Costner.'TMZ previously reported that Costner's wife Christine filed for divorce on Monday, citing 'irreconcilable differences.' The couple were married in 2004.In the filing, she requested joint custody of their three children: Cayden, 15; Hayes, 14; and Grace, 12.",
        "Costner filed a response with celebrity divorce attorney Laura Wasser the following day in which he also requested joint custody. 'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action,' Costner's rep said in a statement. 'We ask that his, Christine's and their children's privacy be respected as they navigate this difficult time.'Baumgartner has not requested spousal support, and Wasser's response indicated that there was a prenuptial agreement between the former couple that would determine it.The divorce filing and unfounded rumors seem to have made an impact on Costner's blockbuster series Yellowstone. Entertainment Tonight reported that Costner would not be returning to the Taylor Sheridan–created series following the conclusion of its fifth season.The season has already aired a first half, while the second half has yet to be finished, and there's no word yet on when production will start on it. A spinoff starring Matthew McConaughey is being developed, which may take over as the flagship series if Yellowstone comes to an end without Costner. ",
        "Costner was previously married to Cindy Silva from 1978 to 1994 and they share three children: Annie, 39; Lily, 36; and Joe, 35.He also shares a son Liam Costner with Bridget Rooney, whom he dated after his split from Silva. ",
        "The divorce news comes weeks after DailyMail.com reported new details about Costner's rift with Yellowstone creator Taylor Sheridan.Sources claimed Sheridan developed a 'God complex' which left Costner reportedly frustrated with the development of the hit Paramount Network series.The insider also alleged that Costner was left frustrated at how his concerns over the direction the series was taking were dismissed by Sheridan — saying that the actor, who also serves as an executive producer on Yellowstone — was told to 'stick to acting' when he raised questions about the future of the show. 'Kevin will forever be proud of and grateful for Yellowstone and the cast is like family to him,' the source said of Costner, who recently nabbed a Golden Globe Award for best actor for his portrayal of John Dutton.'He just felt like Yellowstone is headed in a direction that was not in line with their initial vision and he was met with criticism, including that he should just stick to acting.'Adding to the uncertainty around the series is the fact that a date has not been set for when filming will commence for the second half of the latest season, which could be disrupted by an impending writers strike after members of the Writers Guild of America voted to authorize a shutdown over pay issues.",
        "In March, the New York Post reported that Costner's desire to cut down his workload on the fifth season to focus on other projects was also to blame for the tension between him and Sheridan.'It’s the same as with any show runner and big star — there’s respect, but there’s friction,' a source described as 'well-placed' within the production told the outlet.Costner is currently directing and starring in Horizon, a western film series consisting of four separate movies that will be released three months apart from each other.Each film is close to three hours long and after the quadruple release, Horizon is going to be broken into a series for television — each with 42-minute episodes.Another 'highly placed' Hollywood source told the outlet that some of the blame for the 'friction' on set lies with its creator.'Taylor is the star of his show. He’s the most important person on all of his shows,' they said.Deadline reported in February that Costner wanted to shoot for only a week on the second half of season five, after he had already shortened his work on the first half.The apparent reason was that the actor wanted to focus on his upcoming Western film franchise Horizon.",
        "But Costner's attorney Marty Singer shot back after the report and claimed to Puck News that it was an 'absolute lie' that his client would only shoot for a week. ",
        "'As everyone who knows anything about Kevin is well aware, he is incredibly passionate about the show and has always gone way above and beyond to ensure its success,' he said at the time.Other inside sources have claimed that Sheridan's lack of preparation has caused major delays with the production of the show — with one suggesting that Costner had made himself readily available to shoot, only for the creator's own schedule to get in the way.They added that Sheridan was 'overburdened' and 'nothing was ready' even after Costner 'made himself available.They said that Costner was prepared to shoot the second half of the season sometime last year, as well as in January of this year, but there were allegedly no completed scripts to shoot at the time.'Kevin’s been extremely cooperative with working with Taylor and his production company, 101 Studios. They were supposed to shoot the second chapter of Season five late last year, but they just didn’t have the scripts,' a source told the Post.'Kevin had already committed to making his other movies. He had given the producers his schedule. There was nothing to shoot.'There have also been reports that Costner's beloved character John Dutton will be killed off in the back half of Yellowstone's current fifth season.",
        "It's unclear when production will begin on the new episodes for Yellowstone Season 5, or if those episodes will feature the death of John Dutton.Along with tensions with Sheridan, it was also reported last year that Costner's wife Baumgartner was fed up with her husband's demanding work schedule.'It's really knocked a hole in their family life,' a source told RadarOnline. 'The show is such a mega-hit, producers want it to go on forever!'It was further reported that Christine's patience was wearing thin which led to her posing an ultimatum to Costner."
    ]
}