{
    "articleURL": "/femail/article-12038781/The-Chic-List-going-summer-90s.html",
    "content": [
        "Too young and clueless to do it properly the first time round, I’ve decided I’m having an entirely 1990s style-inspired summer.",
        "In many ways dressing for warmer weather can be trickier since we have fewer layers to work with. As we get older, being clever about our choices is key – hide your worst bits, accentuate your best.Pared-back pieces never go out of style and the 90s version of minimalism really encapsulates my approach to summer dressing. I always find that when it gets hot and sticky, looking more pulled together for work or socialising is much easier with a fuss-free silhouette.I’m not alone with this 90s obsession either. Prada, one of the decade’s designer heroes, has relaunched some of its handbag hits from that time, while Generation Z’s TikTokers are dissecting the 90s catwalk shows, fascinated by big personalities such as Claudia Schiffer and Naomi Campbell. They can’t stop watching reruns of Friends either.",
        "Meanwhile, a fresh obsession with the late Carolyn Bessette Kennedy has gripped young and old. She pivoted around a neutral palette and effortlessly paired everyday staples with sleeker pieces, such as a white shirt with an evening maxiskirt.Some say we long for nostalgia because of all the uncertainties of today’s world. I just like the simplicity of the clothes and how they look and feel when I wear them.The idea of living a fuss-free 90s summer has me excited. Gwyneth Paltrow, one of the faces of that decade, thinks it was more fun back then because there were no iPhones to capture everyone’s moves. ",
        " Pared-back pieces never go out of fashion   ‘You could go home from the bar with some rando and nobody would know,’ she said.Of course, bad things happened in the 90s, too. The documentary Pretty Baby: Brooke Shields, on Disney+, tells how the actress, when just a child, was exploited by the adults who were meant to protect her, and sexualised in fashion ads and films.During the 90s Shields went to Ivy League university Princeton to prove she was more than a pretty face but struggled to get work after graduating – it seems a beauty with brains and an opinion wasn’t desirable in the male-dominated entertainment industry. Thankfully we’ve come a long way from there.If you want to join me in a 90s summer, these pieces will help…★ Thin-strapped linen dresses.★ Top and skirt two-pieces. Check out labels such as Stylein, Issue Twelve and Marcéla London.★ A trouser suit. My go-to for one to last seasons is Alex Eagle Studio.★ Waistcoats as tops.★ Simple but chunky jewellery.FANCY SOME OOH-LA-LA? Our love for French style will be fuelled further with Parisian label Rouje opening its first store in London’s Mayfair this summer. Founded by fashion queen Jeanne Damas, Rouje is seeking staff with similar tastes who, as its advert says, are ‘determined to make shine this je ne sais quoi unique to France’.",
        "HANDS OFF! Start practising your ‘nonchalant tuck’ pose: the clutch bag is fast becoming a favourite this season. For an everyday option that has enough room to store your essentials and ticks all the boxes, I love this raffia one by Cos.",
        "FLAT MATES When it comes to sandals, these are a great choice for a 90s look. Not just a top brand for on-trend footwear, Aeyde also delivers on comfort, with styles you can walk in for miles, too."
    ]
}