{
    "articleURL": "/wires/afp/article-12051193/Rohingya-team-says-not-agree-refugee-return-Myanmar-visit.html",
    "content": [
        "Rohingya refugees who visited Myanmar on Friday told AFP they would not voluntarily agree to return there, after touring facilities meant to accommodate the repatriation of the stateless minority to their homeland.",
        "Bangladesh is home to about a million Rohingya, most of whom fled a 2017 military crackdown in neighbouring Myanmar that is now subject to a UN genocide investigation.Both countries signed a repatriation agreement to return them later that year, but little progress has been made since, and the United Nations has repeatedly warned conditions were not right for their return.Several Bangladeshi officials accompanied 20 Rohingya refugees during Friday's visit to two model village resettlement camps erected for the pilot return project.\"We have seen the camps... But they don't accept our citizenship demands,\" Mohammad Salim, a Rohingya member of the delegation, told AFP.\"We will not go to the camps,\" he added. \"We must return to our own land. We didn't like it there. We won't go. We will return if our safe repatriation and demands are accepted.\"A woman member of the delegation said she was worried about her safety in the newly built facilities, which include a market, hospital and reception centre for returning refugees.\"Nothing is safe for us there. They can subjugate and torture us again,\" she told AFP on condition of anonymity.Bangladesh refugee commissioner Mizanur Rahman, who accompanied the delegation, nonetheless said that his country wanted the repatriation scheme to go ahead.\"We went to Myanmar today. There are many Rohingya moving freely and doing business there,\" he told AFP.",
        "\"The repatriation must begin. Myanmar representatives will also come to Bangladesh. And subject to discussion, we will decide on the next step.\"",
        "Officials have told AFP they expect repatriations to begin later this month, before the annual monsoon season.Rohingya refugees, who have spent nearly six years living in overcrowded and squalid camps in Bangladesh, have been consistently sceptical of the scheme since it became public knowledge in March.They say that none of their queries about security or recognition of their right to citizenship in Myanmar has been answered.The Rohingya are widely viewed in Myanmar as interlopers from Bangladesh, despite roots in the country stretching back centuries.- 'Must be voluntary' -",
        "The UN refugee agency said it was aware of the trip, which was taking place \"under a bilateral arrangement between Bangladesh and Myanmar\".\"UNHCR is not involved in arranging this visit. However, we reiterate that every refugee has an inalienable right to return to their home country,\" agency spokesperson Regina De La Portilla told AFP.\"Refugee returns must be voluntary, in safety and dignity,\" she added. \"No refugee should be forced to do so.\"Myanmar junta chief Min Aung Hlaing, who has dismissed the Rohingya identity as \"imaginary\", was head of the armed forces during the 2017 crackdown.",
        "The International Court of Justice is probing allegations of rape, murder and arson against entire Rohingya villages by Myanmar's security forces during that year's violence.The repatriation plan agreed to in 2017 failed to make any significant headway in the years since, partly over concerns the Rohingya would not be safe if they returned."
    ]
}