{
    "articleURL": "/tvshowbiz/article-12056341/MasterChef-Australia-viewers-left-shattered-season-premiere.html",
    "content": [
        "MasterChef Australia returned to screens on Sunday night following the unexpected death of judge Jock Jock Zonfrillo. ",
        "The show's viewers were quick to express their heartache on social media, admitting the new season 'hits differently' in the wake of the tragic loss.Tears flowed as viewers watched the late Jock Zonfrillo grace their screens for the last time, with many sharing their emotional reactions on Twitter.'Every time Jock speaks,' wrote one distraught fan, accompanied by a crying emoji. ''What a time to be alive''. Life is so precious and nobody knows what's ahead. This comment from Jock is heartbreaking,' another person tweeted.",
        "The pain was palpable, with many fans struggling to hold back their emotions.'I can't get past this. Nup. I think it's going to take me some time. My heart breaks,' wrote another viewer. Meanwhile, others found solace in the show's continuation.'I am glad that they decided to air MasterChef, even though it is difficult to watch, I can tell already I am going to enjoy this season. #RIPJock.'",
        "'I'm excited to watch this season but knowing Jock's gone makes me so sad,' wrote another.Another viewer found the episode particularly moving, writing, 'I don't think I've ever seen a TV show as powerful as this episode of MasterChef, and that's even before considering Jock's passing... I can see why he was so proud of it.'",
        "'My heart is broken. Toughest MasterChef watch yet,' said another. Elsewhere another viewer said: 'Pouring out a bottle of HP sauce for you. I love you and miss you, your culinary skills, your insatiable food shovelling, your impeccable style, and your kind heart,' ",
        "Others couldn't help but feel the weight of the loss, as they watched an emotional conversation between Jock and contestant Brent about overcoming personal struggles.'That convo between Jock and Brent just hits hard now,' a fan remarked.MasterChef Australia continues Monday at 7.30pm on Channel Ten "
    ]
}