{
    "articleURL": "/news/article-12045715/Jack-Ripper-Met-cop-hated-opposite-sex-author-claims.html",
    "content": [
        "Rod Beattie believes that policeman Bowden Endacott was the culpritA year before killings began, Endacott accused a woman of being a prostitute Jack the Ripper was a twisted Metropolitan Police officer who had a hatred of women, an author has claimed.",
        "Historian Rod Beattie has spent the last 20 years trawling through archives putting together his case that the infamous serial killer was an aggrieved police constable.Prostitutes Mary Ann Nichols, Annie Chapman, Elizabeth Stride, Catherine Eddowes, and Mary Jane Kelly were all murdered during the killing spree between August 31 and November 9, 1888.Mr Beattie believes that Bowden Endacott, a reserve Met police officer who would have been patrolling the streets of London's Whitechapel, was responsible for the notorious murders.He argues that the constable's dark history with prostitutes caused him to erupt in a 'frenzy of murderous revenge'.In 1887 - the year before the ripper killings began - Endacott was the focus of a national scandal when he accused a woman out walking late at night of being a prostitute.Elizabeth Cass was outraged at being wrongfully arrested and she complained to Scotland Yard about her treatment.",
        "An inquiry was opened into the wrongful arrest and despite eventually being cleared, Endacott was reassigned to guard duty at the British Museum.Following his demotion, Mr Beattie believes that he decided to take revenge on the prostitutes of London.Before joining the Met in 1875, Endacott worked in Devon and was given a bastardy order, the Victorian equivalent of child maintenance payments, for fathering a child outside marriage.",
        "It was reported in the Lancaster Gazette that he got a young woman by the name of Rogers 'in trouble'.The order was settled before it came to court, but Mr Beattie believes it fuelled Endacott's anger towards women.Mr Beattie, 72, from Birmingham, said: 'I was reading an article about the Endacott case and I suddenly had a eureka moment.",
        " 'What stronger motivation could there be than having your career ruined by what you thought was a prostitute?'It just made sense, I started to go through the national archives trying to piece together his history.'He was in London for all of the killings. He was officially stationed at the British Museum, but all the Met's reserves were called up to patrol the streets.'The murder spree began the year after he lost everything when Elizabeth Cass brought him to court for perjury.'He had a bad history with women generally. He moved to London from Devon after being subject to a bastardy order for fathering a child out of marriage.",
        "'I think he finally snapped when he was made to guard the British Museum, and went on this frenzy of murderous revenge.'There is no concrete proof that he did it, but there isn't any for any suspect.",
        "'Considering the man's personal history and the fact that as a police officer he could go anywhere and pass without suspicion I'm confident that it was him.'It's possible that the Met knew it was him but simply didn't want to damage their reputation.'Mr Beattie's 167-page book, Jack The Ripper - The Policeman: A New Suspect, published by Pen and Sword, is now available to buy.",
        "Jack the Ripper is thought to have killed at least five young women in Whitechapel, East London, between August 31 and November 9, 1888, but was never caught.Numerous individuals have been accused of being the serial killer.At the time, police suspected the Ripper must have been a butcher, due to the way his victims were killed and the fact they were discovered near to the dockyards where meat was brought into the city.There are several alleged links between the killer and royals. First is Sir William Gull, the royal physician. Many have accused him of helping get rid of the alleged prostitutes' bodies, while others claim he was the Ripper himself.A book has named Queen Victoria's surgeon Sir John Williams as the infamous killer. He had a surgery in Whitechapel at the time.Another theory links the murders with Queen Victoria's grandson, Prince Albert Victor, the Duke of Clarence.At one point, cotton merchant James Maybrick was the number one suspect, following the publication of some of his diary which appeared to suggest he was the killer.Some believe the diary to be a forgery, although no one has been able to suggest who forged it.Other suspects include Montague John Druitt, a Dorset-born barrister. He killed himself in the Thames seven weeks after the last murder.",
        "George Chapman, otherwise known as Severyn Kłosowski, is also a suspect after he poisoned three of his wives and was hanged in 1903.Another suspected by police was Aaron Kosminski. He was admitted to Colney Hatch Lunatic Asylum and died there.Dr Thomas Neill Cream poisoned four London prostitutes with strychnine and was hanged in 1892.",
        "Some of the more bizarre links include Lewis Carroll, author of the Alice In Wonderland books, who taught at Christ Church until 1881 - which was at the forefront of the Ripper murder scenery.Winston Churchill's father - Lord Randolph Churchill - has also been named as a potential suspect.Crime writer Patricia Cornwell believes she has 'cracked' the case by unearthing evidence that confirms the artist Walter Sickert was the prime suspect. Her theories have not been generally accepted.Author William J Perring raised the possibility that Jack the Ripper might actually be 'Julia' - a Salvation Army soldier.In The Seduction Of Mary Kelly, his novel about the life and times of the final victim, he suggests Jack the Ripper was in fact a woman.In February 2019, it was suggested that Jack the Ripper may have been a sinister Dutch sailor who murdered two ex-wives in his homeland and bludgeoned to death two other women in Belgium.Crime historian Dr Jan Bondeson has named Hendrik de Jong as a prime suspect for the most notorious set of unsolved murders in history.At the time of the Whitechapel murders, de Jong is believed to have worked as a steward on a ship that made frequent trips from Rotterdam to London, providing him with the perfect means of getting out of the country after his heinous crimes.He later murdered two of his ex-wives in his native Netherlands in 1893 and bludgeoned to death two women above a pub before attempting to set their bodies on fire in Belgium in 1898."
    ]
}