{
    "articleURL": "/wires/pa/article-12047625/Trump-described-rape-accuser-nut-job-mentally-sick--court-told.html",
    "content": [
        "Jurors heard former president Donald Trump blast a woman who accused him of rape as a “nut job” and “mentally sick” in a video recording that was shown on Thursday during the trial of her federal lawsuit.",
        "A transcript of Trump’s remarks about accuser E Jean Carroll emerged in court filings before the trial.But the deposition played in the courtroom allowed jurors to hear Trump speak about the case in his own voice. Other sections of the recording were shown in court on Wednesday.Thursday’s portions also included Trump standing by his repeated prior comment that Ms Carroll was “not my type” and his defence — as “locker room talk” — of his notorious boasts on a 2005 “Access Hollywood” hot-mic recording about grabbing women’s genitals.Ms Carroll, a 79-year-old writer, alleges that Trump raped her in an upscale New York department store dressing room on an unspecified date in spring 1996.According to Ms Carroll, they ran into each other, got into light-hearted banter about trying on lingerie and went jokingly into the fitting room, where he slammed the door and suddenly became violent.Trump, 76, says that she fabricated the entire encounter and that he has never met her, except for a brief exchange of pleasantries at a 1987 social event.“I think she’s sick, mentally sick,” Trump said calmly during the deposition, which was taken in October.He added: “She said that I did something to her that never took place. There was no anything. I know nothing about this nut job.”",
        "Trump has not attended the trial, and his lawyers have said he will not testify or call any witnesses on his behalf.However, during remarks on Thursday to reporters while on a golf trip to Ireland, Trump suggested he would “probably attend” the trial, which is expected to wrap up next week.His lawyers continued to say there were no plans for him to do so.Trump, who irked trial Judge Lewis Kaplan with social media posts criticizing the case at the trial’s outset, also repeated his claim that it’s a political “scam” and knocked Mr Kaplan, a Bill Clinton appointee, as an “extremely hostile” and “rough judge” who “doesn’t like me very much”.The Associated Press typically does not name people who say they have been sexually assaulted unless they come forward publicly, as Ms Carroll has done."
    ]
}