{
    "articleURL": "/wires/afp/article-12047787/Tuition-gift-raises-new-ethics-question-US-Supreme-Court-justice.html",
    "content": [
        "A billionaire Republican donor paid for the private school tuition of Justice Clarence Thomas's grandnephew, whom he was raising at the time, a report said Thursday -- the latest in a string of ethics controversies surrounding the US Supreme Court.",
        "Thomas did not disclose the payments, according to ProPublica, which also reported last month that conservative real estate tycoon Harlan Crow had gifted the longest-serving justice luxury trips over two decades.According to the report published Thursday, a July 2009 bank statement showed that Crow's business had paid the $6,000 monthly bill for a boarding school attended by Mark Martin, Thomas's teenage grandnephew.Thomas at the time had legal custody of Martin.Former school administrator Christopher Grimwood told the news outlet that Crow paid for Martin's entire year-long stint at Hidden Lake Academy in the southern state of Georgia, and that Crow once told him he paid Martin's fees at another school as well.Crow may have paid more than $150,000 in tuition over four years at the two schools, ProPublica said.But Thomas, 74, did not disclose the payments, even though records show he did report another friend's $5,000 education gift for Martin.Neither Crow's holding company nor staunch conservative Thomas immediately responded to AFP queries about the arrangement.Crow's office told ProPublica that he \"has long been passionate about the importance of quality education and giving back to those less fortunate, especially at-risk youth.\"Ethics standards around financial dealings of the nine justices, who serve lifetime terms, have been under increased scrutiny in recent weeks after earlier reports of lavish gifts and undisclosed real estate transactions.",
        "- Ethics questions -Senator Dick Durbin on Thursday repeated his call for a binding code of ethics for Supreme Court justices, saying in a statement that \"the reputation and credibility of the Court is at stake.\"\"The highest court in the land should not have the lowest ethical standards,\" added Durbin, chair of the Senate Judiciary Committee.This week, the committee voiced dismay after Chief Justice John Roberts declined to testify before the panel amid the mushrooming controversy.Earlier ProPublica investigations revealed Thomas also failed to disclose yacht and private plane trips gifted by Crow, and that Crow bought properties in Savannah, Georgia from the justice.Crow has made more than $10 million in donations to Republican political groups, ProPublica said, including half a million dollars to a conservative lobbying group founded by Thomas's wife, Ginni Thomas.Ginni Thomas's involvement in politics has drawn its own criticism, notably over her support for former Republican president Donald Trump's attempt to overturn his 2020 presidential election loss.Questions have also been raised about another conservative justice, Neil Gorsuch who, according to Politico, neglected to disclose the buyer of a large vacation home on the Colorado River -- the head of a major law firm which regularly handles cases before the high court.",
        "The revelations follow a tumultuous year during which the court, with its relatively new 6-3 conservative majority, handed down rulings in several major cases: overturning the constitutional right to abortion, rolling back environmental protections and affirming gun rights."
    ]
}