{
    "articleURL": "/sport/football/article-12057027/Newcastle-0-2-Arsenal-Artetas-maintain-title-bid-victory-St-James-Park.html",
    "content": [
        "Arsenal ensured they kept pace with Manchester City with a crucial victory away at Eddie Howe's NewcastleMartin Odegaard's first-half strike and Fabian Schar's own goal saw the Gunners go within a point of the leadGame was played at a frenetic pace with both sides missing plentiful chances either side of the breakRarely has the award of a penalty been so badly needed by the team on the receiving end - but it was here that a breathless and brilliant contest swung in Arsenal's favour.",
        "Mikel Arteta's side were gasping for air come the eighth minute. They were doing their best impression of Tottenham at St James' Park a fortnight ago. If not in terms of scoreline - Spurs were 3-0 down by then - but certainly by the manner in which they appeared helpless in repelling the home onslaught.The concession of a spot-kick probably did not feel like the respite they so craved, but when the decision was overturned, the flow of the game changed with it.From masquerading as Spurs - now there is an insult - to morphing into a team who have not given up on the title, Arsenal were deserved winners come the end. The outstanding Martin Odegaard enjoyed a rare weekend as the Premier League's top scoring Norwegian and led the recovery with a superb 14th-minute opener.The captain had come to the touchline asking for water after just five minutes. It was oxygen tanks he and his team-mates could have done with. ",
        "Even the spider cam spinning its web above the pitch needed every one of its eight legs to keep up with Newcastle. It was all a wonderful advert for the Premier League, if not for the health of Arteta, who looked ready to explode.Newcastle's artillery had left his players shelled and shocked during an early blitz in which Messrs Gung and Ho read like the first names on the home team-sheet. It was, in fact, Alexander Isak and Callum Wilson whom Eddie Howe had paired for the first time together.",
        "Jacob Murphy smacked the post inside 70 seconds, Isak saw a goal-bound blast deflected wide and, with only four minutes on the clock, it felt like Arsenal goalkeeper Aaron Ramsdale was calling for a truce as he measured a goal-kick with all the care of putt to win The Masters.But then came Newcastle's penalty and, with it, the laying down of arms that Arsenal so desired. The two-minute break as the officials tried to determine whether the ball had struck the arm of Jakub Kiwior, from a Bruno Guimaraes shot, served as a timeout. Chris Kavanagh's call was rightly reversed - the ball hit the defender's thigh first - and the wind sucked from Newcastle's sails was duly inhaled by the visitors, who were soon in front thanks to Odegaard's 25-yard strike. The result was made safe when Fabian Schar put through his own goal in the second half.Howe was in no doubt as to the impact of the penalty incident. 'In hindsight, you'd probably hope that it wasn't given in the first place because it seemed to have a detrimental effect on our psychology,' he said. 'We didn't react well for the next period when they scored. With the emotion of the game, it's so difficult for players sometimes to put a disappointment behind them.'",
        "Arsenal were beaten 2-0 here last May and so lost out on the top four to Spurs. Arteta tore his players to shreds then and he sought to pick at the scars of that night before this game, showing them the footage of his dressing-room dressing-down. There is always a risk that such a move is akin to watching Jaws before a swim in the sea. But Arsenal, in fairness, responded by showing their teeth, albeit after a start in which they were in danger of losing them.It leaves Manchester City one point clear with a game in hand and the title race set to go to the wire. City can afford one misstep, but any more and they're likely to come crashing down. Arsenal, at least on the evidence of the final 80 minutes here, should win their final three against Brighton, Nottingham Forest and Wolves.But had they lost to Newcastle - and many thought they would - City's crown would have been all but retained on coronation weekend. As it is such ceremony must wait and, for that, Arsenal have Odegaard and his midfield sidekick Jorginho to thank.",
        "They combined for the first goal when the latter found the former in space. It was a lovely finish, drilled into the bottom corner from distance, but questions remain about the urgency of Newcastle's closing down and the speed of Nick Pope's reaction.",
        "Even so, the goalkeeper was the sole reason his team did not trail by four come half-time. Twice Arsenal cut through Newcastle with ease and Gabriel Martinelli and Bukayo Saka were denied by Pope's boot and midriff respectively. Then, in stoppage-time, Odegaard thought he had his second only for Pope to intervene once more.On reflection, 4-0 is a dangerous half-time scoreline for Arsenal at St James' Park, given the lead they surrendered when drawing 4-4 in 2011.But Newcastle could not even recover one goal this time. They played well enough - Isak headed against the post, Ramsdale saved fabulously from Schar's six-yard header and Granit Xhaka blocked from Joe Willock inside the goalmouth. Xhaka's Swiss compatriot Schar, however, was not nearly so decisive at the other end and his tired leg could only turn in Martinelli's cross on 71 minutes.Arsenal did not celebrate like a team who had won the league, but they certainly wore the relief of one who knew they had not lost it.",
        "Newcastle United (4-3-3): Pope 7.5; Trippier (c) 6, Schar 5, Botman 5.5, Burn 5.5 (Targett 82); Joelinton 5.5 (Anderson 81), Guimaraes 5.5, Willock 6 (Saint-Maximin 78); Murphy 6 (Almiron 65, 5), Wilson 6 (Gordon 78), Isak 7Substitutes not used: Dubravka (GK); Dummett, Lewis, ManquilloManager: Eddie Howe 6 Booked: Burn, ScharArsenal (4-3-3): Ramsdale 8; White 6, Kiwior 6, Gabriel 6.5, Zinchenko 6 (Tierney 61, 7); Odegaard (c) 8.5 (Partey 80), Jorginho 8, Xhaka 7.5; Saka (Nelson 87), Jesus 6.5 (Nketiah 87), Martinelli 7.5 (Trossard 80)Substitutes not used: Turner (GK); Smith Rowe, Holding, VieiraManager: Mikel Arteta 8 Scorers: Odegaard 14; Schar 71 own goal Booked: NketiahReferee: Chris Kavanagh 7 Attendance: 50,267 Man of the Match: Martin Odegaard "
    ]
}