{
    "articleURL": "/wires/pa/article-12047683/Ex-health-secretary-Matt-Hancock-declares-10-000-fee-morning-TV-interview.html",
    "content": [
        "Matt Hancock received £10,000 for a television appearance in which he said he did not “primarily” go on I’m A Celebrity… Get Me Out Of Here! for the money.",
        "The former health secretary declared the fee from ITV for an interview on Good Morning Britain (GMB) in the latest register of members’ financial interests.He received the payment via Shine Talent Management Limited for two hours of work, according to the entry.Mr Hancock was criticised by constituents and then-Conservative colleagues for entering the Australian jungle for I’m A Celebrity.",
        "He donated £10,000 of his £320,000 fee to charity, telling ITV during his January 31 interview: “I didn’t primarily do it (go on the reality show) for the money, I primarily did it to try to show who I am.“I think £10,000 is actually a decent sum.”Mr Hancock was also confronted by GMB presenter Kate Garraway on how families who were affected by his coronavirus policies felt about his decision to compete on I’m A Celebrity.Garraway’s family was among those heavily impacted by Covid-19 as her husband Derek Draper, a former political adviser, fell seriously ill with coronavirus in March 2020 and has suffered long-lasting damage to his organs and requires daily care.West Suffolk MP Mr Hancock lost the Tory whip over the appearance on the reality TV show and he currently sits as an independent in the Commons.He was forced to resign as health secretary after leaked CCTV footage showed him breaching his own Covid-19 guidance by kissing his assistant Gina Coladangelo.",
        "Elsewhere, Conservative former cabinet minister Jacob Rees-Mogg said he received £32,083.34 on March 30 from GB News for presenting a television programme for the broadcaster.",
        "He said the hours for the work were “40 hours including preparation”.Labour leader and Arsenal supporter Sir Keir Starmer was among several MPs to declare hospitality for sporting events.He received two tickets with hospitality for Arsenal’s 2-2 draw at West Ham on April 16.The donation was valued at £700 and provided by Mulalley &amp; Co Limited – a construction company based in Woodford Green.Former prime minister Boris Johnson also updated his register of financial interests, declaring a number of in-kind donations.Mr Johnson reported being given the use of the Windsor Suite by Heathrow Airport Limited on three occasions, with each stop-off valued at £1,800.Two occasions are listed as being for use by one person, the other mentions two adults and two children, suggesting his wife Carrie Johnson and their two offspring potentially joined him.He also enjoyed the use of accommodation for his family as a donation, with one stay donated by Lady Carole Bamford and the other gifted jointly by her and her husband, Lord Bamford, who is chairman of the company JCB.Accommodation provided between April 2 and May 1 was deemed to have been a concession worth £10,000 to the former Tory leader while a stay between April 11 and May 10 was valued at £3,500, according to the register.",
        "His Downing Street successor Liz Truss has newly registered a £50,000 donation towards staff and office costs to “support me with policy”.The money was provided by Jeremy Hosking, thought to be the millionaire businessman, political donor and Crystal Palace shareholder of the same name.Ms Truss, who last year became Britain’s short-serving prime minister with her 44-day stay in No 10, also declared she was given £7,600 to cover her and her family’s flights and accommodation when giving the Margaret Thatcher Freedom Lecture in Washington DC last month."
    ]
}