{
    "articleURL": "/news/article-12045801/Brazilian-city-70-000-people-set-SWALLOWED-earth-forestation.html",
    "content": [
        "Brazilian city built on plateau faces devastating landslide and erosion problems worsened by deforestationSeven are said to have died and 50 houses have been dragged away by the deepening craters around the cityA city of 73,000 people in Brazil is set to be swallowed by the earth as it battles with its environment.",
        "Buriticupu, in the northeast of the country, faces an existential gully problem made worse by deforestation.Huge craters as deep as 230ft (70m) and landslides threaten to wipe the city out within 30 to 40 years.There are now 26 gullies measuring more than 978 feet (298 metres) long, which have been formed over years of deforestation in and around the city - and 'unplanned urban expansion' into the natural world.Clearing can weaken the ground below, making it difficult for soil to absorb excess water and causing surface water to concentrate and erode land - allowing huge craters to develop over time.This year, harsh rainfall has made the situation all the more devastating, with the authorities forced to declare a state of 'public calamity'.",
        "A lack of town planning has allowed the underlying issue to worsen since the city's founding in 1994.Only a few Civil Defence employees are on hand to monitor the holes' - known as voçorocas - growth and plan how to relocate families.Mayor Joao Carlos described the situation as 'complex' and said that it 'involves compensating properties, building new housing complexes, drainage services'.An expert on the study of the holes from the local university, Augusto Carvalho Campos, said to 20 Minutes that soil erosion was made much worse by 'unplanned urban expansion with a faulty water sanitation system'. ",
        "In the last 10 years, three streets and more than 50 houses have been swallowed up by one gully alone.Seven people have reportedly died from falling into the holes over the last 20 years.The region is also hit hard by deforestation; between 2000 and 2020 Buriticupu experienced a loss of 41% of its tree cover. More than half of its humid primary forest was cleared between 2002 and 2021.Authorities have issued R$ 687,000 (£109,505) for assist families who will have to leave their homes.But less has been done to stop the trend of climate devastation. Celio Roberto of the Maranhao Fire Department told local media: 'The intervention must be both emergency and preventive.'Otherwise, we will have this process increasing more and more and causing greater damage to the families who reside there.'The town hall decreed the state of public calamity on 26 April, five days after these images were taken.It hopes to gain funds from the municipality to begin containment work.Deforestation in Brazil has made it harder for the Amazon Rainforest to recover from droughts, fires and landslides.The problem is only worsening, with an area five times the size of New York City cleared in the first six months of last year - the highest figure in six year.",
        "The gullies in Buriticupu started out as cracks in the ground caused by rainwater but then evolved over time into huge craters.Without trees to strengthen the ground and bind the layer of soil at the top, 'runoff' surface water will continue to collect in vulnerable areas, eroding the surrounding soil.",
        "On Tuesday, a retired policemen suffered fractures after falling into one of the gullies.Jose Ribamar Silveira plunged into the hole along with his car from a height of approximately 80 metres (262 feet), according to witnesses.Silveira fell into the hole in the early hours of the morning but was unable to be rescued until the evening.He was taken to an emergency care unit with a broken arm, an exposed fracture in his left foot, and other injuries, and later transferred to a hospital in Sao Luis."
    ]
}