{
    "articleURL": "/wires/pa/article-12050781/HSBC-bosses-climate-protesters-ejected-turbulent-AGM.html",
    "content": [
        "The chairman and chief executive of HSBC had several climate protesters thrown out of its annual general meeting on Friday as shareholders rejected a plan which could have split the bank in two.",
        "Investors voted by 80.22% to not accept the plan to split off the company’s Asian arm, which had been suggested by its biggest shareholder, Ping An.It happened after a turbulent meeting where the first protester to stand up accused the bank of being “chief arsonists” in the climate crisis.At the Birmingham meeting, he said: “Our grandchildren will inherit a polluted planet and they will curse us for it. This is a disgrace and you should be ashamed. We concluded that the alternative structural options would materially destroy value for shareholders, including putting your dividends at risk. This remains our unanimous view today  Mark Tucker, HSBC  “You are the chief arsonists – this organisation has been described as a financial arson organisation and you are the chief arsonist. I don’t know how you sleep at night knowing that millions of people are going to starve to death because of the investments that this bank is making.”Minutes apart several other protesters stood up, one by one, expressing similar terms. Eventually, chairman Mark Tucker and chief executive Noel Quinn asked security to escort the protesters from the room.“Thank you for your patience, security are resolving the situation,” Mr Tucker told shareholders.One protester accused the bank of funding a company which was bulldozing a village in Germany to expand a coal mine.",
        "Outside the meeting, one protester wearing a suit was pictured sitting in a green bath which had a sign reading: “HSBC greenwashing” on its side.The man was covered in green paint and surrounded by protesters dressed as cleaning staff while a green flare had been let off.During the meeting, Mr Tucker also urged shareholders to vote against the plan which would split the company in two.He said that the board has considered the proposal “carefully and fully,” but said they felt it would destroy value at the bank.“Last year, with the benefit of expert advice from third parties, the board considered a wide range of alternative structural options for your bank in depth.“We concluded that the alternative structural options would materially destroy value for shareholders, including putting your dividends at risk. This remains our unanimous view today.”The resolution, to spin off the company’s Asian arm, was proposed by a group which has backing from Ping An, HSBC’s largest shareholders.Apart from Ping An, it appeared that most shareholders had accepted the board’s recommendation.The company further said that 20.25% of votes were cast against the pay package for its top team and several other votes were cast only around four to one in favour, including the re-election of the chairman and the chief executive."
    ]
}