{
    "articleURL": "/news/article-12039439/Cops-trans-supports-shoving-match-Texas-House-protestors-interrupt-debate.html",
    "content": [
        "Senate Bill 14 blocks treatments for young people including surgery, puberty blockers and hormone therapy. It would also revoke a doctor's licenseThe bill passed Texas' Senate on April 4 and moved to House debate, but was immediately blocked on a procedural issue and sent back to committeeProtesters inside the House chamber staged a noisy protest until the Sergeant at Arms cleared the gallery, and cops and protesters scuffled outside the chamberDebate of a controversial bill in Texas to ban young transgender people from accessing surgery, puberty blockers and hormone therapy was blocked Tuesday amid angry protest, with police and activists scuffling outside the House chamber.",
        "Protesters inside the chamber, seated in the gallery, began a noisy chant as the SB14 was being discussed - unfurling banners, clapping and catcalling.The Sergeant at Arms was asked to remove the agitators, who chanted 'trans rights are human rights' as they were dragged out of the chamber.Police and protesters then scuffled outside the chamber: footage shared on social media showed protesters being pushed to the floor and restrained by officers.Minutes after the protesters were removed, an expected vote on the bill was delayed until later in the week after a parliamentary concern was raised. ",
        "The Department of Public Safety, which polices the Capitol, has not confirmed whether any arrests were made.According to the Texas Tribune, the protestors were chanting in the lobby and a trooper used a bullhorn to direct them to leave. Police then began to usher protestors down the stairs when several troopers and two protestors began pushing and shoving each other. Police then handcuffed one person and led them away.  If Texas manages to pass Senate Bill 14, it will join at least a dozen other states that have outlawed gender-affirming care so far - Georgia and Tennessee being the most recent, according to a U.S. News report published on Tuesday.The bill passed the Senate last month and was introduced in the House on Tuesday.",
        "Tom Oliverson, a Republican member of the House representing Cypress, introduced the bill and thanked those gathered in the Capitol to support it, wearing red t-shirts with the slogan 'Save Texas Kids'.Oliverson tweeted: 'Thank you all so much for coming today. Your presence in the gallery strengthens our resolve to get this done today!'Johnathan Saenz, president of Texas Values, which led support for the bill, told WFAA that there should be more mental health support for children, rather than medical interventions.'When you have kids go through gender transitions, it harms them,' Saenz said. 'Let's focus on the heart instead of thinking that removing body parts is somehow going to make their mind feel better.'Kids are not in a position to make these decisions and even if the parents support it, it's not healthy for them.' ",
        "Ricardo Martinez, who heads the LGBTQ-advocacy group Equality Texas, said government should not interfere in healthcare.'This sets the standard that the government can interfere in your life when they don't like how you lead it - and that should terrify everyone,' he said.Martinez said the bill is one of 140 targeting LGBTQ Texans, including criminalizing drag shows and limiting the discussion of LGBTQ topics in classrooms.A study by the Williams Institute at UCLA estimated there are 92,900 transgender adults in Texas and 29,800 who are 13-17 years old.",
        "'Stigma leads to discrimination,' Martinez said. 'Discrimination leads to violence against our community and that's what we're seeing play out.'"
    ]
}