{
    "articleURL": "/news/article-12056357/Aussie-DJ-Ian-Bell-suddenly-dies-Paris-set-attend-Eurovision-Song-Contest-UK.html",
    "content": [
        "DJ Ian Bell died suddenly of a heart attack in FranceWas also a writer, photographer and record shop owner Australian DJ and music writer Ian Bell has died of a heart attack in Paris while on holiday with his family and en route to the UK for the Eurovision Song Contest.",
        "Bell, 60, was a not only a much loved stalwart of the Adelaide music business who was often photographed with stars such as Mel C of the Spice Girls and Rita Ora, he has also been remembered as a 'lovely and kind' person. His career, which started in the 1980s, saw the versatile nightclub DJ develop into a pop culture expert, record shop owner and music writer and photographer.He spun records at a string of clubs including Limbo in the 1980s and also played at Heaven and his own Pop! night on Gouger St in the 1990s.Bell died on May 2 after having a heart attack in Paris, which was the family's first stop on a trip that was meant to include the Eurovision in Liverpool, the Advertiser reported.",
        "His interviews, reviews and photos were featured in numerous publications and music websites and he regularly performed at the Big Day Out festival.He is survived by his wife Jordan, their daughter Ruby and his sisters Susan and Janet.Writer Andrew P Street said Bell was 'one of the loveliest, kindest, most endlessly enthusiastic people I have ever known'.'So many friendships, so many relationships, began on the sticky floors of Bang! and Pop! and Ian's many other club nights,' he wrote.",
        "Nightclub owner Driller Jet Armstrong wrote on Facebook that Bell was 'a true pioneer'.'Tried and trusted, from the Toucan club to Sugar and everything in between,' he said.Deb Edwards, a former EMI and Sony records employee, said there would 'only ever be one Ian Bell'.'Blessed was I to have him amongst my DJ meetings … He was always keen as beans to hear and see new music,' she posted on social media."
    ]
}