{
    "articleURL": "/news/article-12060611/Texas-gunman-staked-massacre-mall-monitor-peak-times-three-weeks-killing-eight.html",
    "content": [
        "Mauricio Garcia posted about his hatred for women, Jews and black people The gunman killed eight at the Allen Premium Outlets before being shot by a cop READ MORE: Neo-Nazi Texas mall gunman was removed from the Army in 2008 The Texas mall gunman scoped out the scene of his crime to track when it would be busiest three weeks before he shot dead eight people in a senseless bloodbath, it has been reported.",
        "A social media account that appears to belong to Mauricio Garcia, 33, is littered with photos of Nazis, guns and ammunition as well as extremist rants about Jews, women and racial minorities, according to Bellingcat researcher Aric Toler.In the weeks before he committed the senseless mass shooting at Allen Premium Outlets near Dallas, more than two dozen photos of the shopping center and surrounding area were uploaded to an account on the OK.RU platform, including screenshots of Google location information tracking peak visiting times.Both Toler and NBC said the account, on Russian site OK.RU, belonged to Garcia, who was shot and killed at the scene.DailyMail.com verified a picture of Garcia uploaded to the account that shows him next to a waitress at a Texas Twin Peaks. ",
        "It was uploaded alongside the caption: 'Me at the Twin Peaks in Frisco on Preston Road. Now that's a girl who knows how to make a guy smile. How to drive a guy crazy.' Another post appears to show the receipt for the guns and ammunition he bought in 2020, which he ultimately used to carry out the shootings. The account also links to other sites, including one of a YouTube account with a video that allegedly shows Garcia removing a 'Scream' mask before asking in a modulated voice: 'Not quite what you were expecting, huh?'",
        "The video was uploaded before the shooting, but was scheduled to be published afterwards, according to Toler.The OK.RU account carries posts referencing extremist online forums and content from white nationalists, including Nick Fuentes, an anti-Semitic white nationalist. The Texas mall gunman scoped out the scene of his crime to track when it would be busiest three weeks before he shot dead eight people in a senseless bloodbath, it has been reported. Other photos include a bulletproof vest that appears to match the one described by witnesses to the shooting, which is emblazoned with an acronym for 'Right Wing Death Squad' - a popular meme among far-right extremist groups.In one video that shows the account holder gives a tour of his apartment, a tattoo visible on his hand appears to match that seen in a picture of Garcia lying dead after he is shot by police at Allen Premium Outlets on Saturday.",
        "Posts also show a series of shirtless pictures with white power tattoos on his body, including SS Lightning Bolts and a swastika. Garcia's motive remains unclear; his victims range in age from three to 61 and come from a variety of ethnicities. But the OK.RU account makes is plastered with neo-Nazi ideology and rants against women and Jews. ",
        "It also posts extensively about Hitler, 'superior races' and about wanting to escape  life, while raving about mass killer Jeffrey Dahmer. The final post on OK.RU included the lyrics of a heavy metal song titled 'You've dug your grave now lie in it.' The account didn't explicitly state what was being planned, but twisted posts refer frequently to violence. Garcia was briefly enrolled in the Army in 2008 and previously worked as a security guard but his license expired in 2020.According to witnesses from the shooting and photos from the scene, he had dressed in tactical gear. No one from Garcia's family has commented on the shooting on Saturday.  PICTURED: Two elementary school-aged sisters killed by neo-Nazi in Texas outlet mall shootingTwo Texan sisters shot and killed in Saturday's mass shooting at an Allen mall have been pictured, as a disturbing picture emerges of the swastika-tattooed gunman sharing white supremacist and neo-Nazi posts online.Mauricio Garcia, 33, shot and killed eight people, and injured seven more, before he was killed by police.On Monday photos of two sisters he murdered were published - Daniela Mendoza, 10, and her eight-year-old sister Sofia.Their mother, Ilda Mendoza, remains in critical condition.",
        "Both sisters took cheerleading classes at Wylie Elite gym in Wylie, 13 miles from the mall. 'Two of the victims who were sisters, and who lost their lives this past weekend, not only took classes at Wylie Elite, but are nieces to one of our team families,' the gym posted on Facebook. ",
        "'Our hearts are broken for these families. They have shared that one of their favorite colors was yellow. 'To honor these young ladies, WE want everyone to wear yellow this week. Also please be praying for all of the families affected.'The girls attended Cheri Cox Elementary School - Daniela in the fourth grade, and her sister in second grade.The principal, Krista Wilson, described them as 'rays of sunshine.'The district sent a letter to parents and students detailing the 'heartbreaking situation' impacting one of its elementary campuses.Medical City Healthcare said it continues to treat six patients at three hospitals from the shooting. Three are in critical condition, two patients are in fair condition and one patient is in good condition.The girls were not the youngest victim.Three-year-old James Cho, his mother Cindy and father Kyu were also killed. James' six-year-old brother, William, survived the shooting, according to officials.William had celebrated his sixth birthday just four days before the tragedy and was also rushed to hospital with severe injuries.Family members have now confirmed that the schoolboy has been moved from ICU, and it is thought that he is one of the youngest injured in the attack.A GoFundMe for the Korean family has raised nearly $200,000 of their $50,000 goal, and described their 'deep mourning.'",
        "They said: 'An afternoon that should have been filled with light, love and celebration unfortunately was cut short by another mass shooting massacre that left eight victims dead.'After being released from the ICU, their six-year-old son William is the only surviving member of this horrific event.'Dental colleagues of Cindy paid tribute to her as 'one of the kindest, happiest, most genuine people.'The Korean Consulate in Dallas confirmed to DailyMail.com that the family had been killed in the shooting, adding that they were trying to contact relatives not in the area.Family members told the South Korean consulate in Dallas that the victims are U.S. citizens, according to Myoung Joon Kim, head of the Consulate in Dallas.He said: 'The Korean consulate joins the people of the Dallas-Fort Worth area to express our deepest condolences for the victims and their family members.'We pray for the victims and their family members for their healing and recovery.'",
        "Engineer Aishwarya Thatikonda, 27, and Christian LaCour, 20, who worked as a security guard at the mall, were also killed in the massacre.Thatikonda, originally from Hyderabad, India, had been shopping for her upcoming birthday when she was one of the nine shot dead - including the shooter.She moved to Dallas two years ago to work as a Project Engineer at Perfect General Contractors, was shopping with her friend at the Allen Premium Outlets on Saturday morning.",
        "'She was very friendly and very loving,' a family representative told WFAA, adding that Thatikonda's friend was injured in the shooting and is currently stable in the hospital.On Monday the final victim's name was confirmed as Elio Cumana-Rivas, 32, from Dallas. LaCour was the first victim of the mass shooting to be identified, with his grandmother Sandra Montgomery describing him as a 'beautiful soul'.'My beautiful grandson, Christian LaCour, was the security guard killed in the shooting at Allen, Texas. He was such a beautiful soul,' she wrote.",
        "In another tribute post shared Sunday, one person who is friends with LaCour's family said he was a 'very sweet gentleman.'Kellie Smith said she considered herself lucky to have 'watched this sweet young boy turn into a very sweet gentleman,' the woman wrote on Facebook.'Their will forever be a void. Please uplift his family in prayer as they navigate this unimaginable time of their lives. 'Christian you will always remain close to us because we will keep you in our hearts until we see you in Heaven,' Smith wrote.",
        "Garcia was shot and killed by a police officer after the shooting on Saturday afternoon and officials are investigating whether he had an interest in white supremacist or neo-Nazi ideologies.A law enforcement official said federal agents had been reviewing social media accounts and believed Garcia had expressed an interest in neo-Nazi views.He had tattoos of a swastika and a SS lightning bolt, plus a patch on his chest reading RWDS - an acronym for Right Wing Death Squad, which is popular among extremists and white supremacy groups.Investigators have searched a home connected to the suspect – believed to be where his parents live - and a Dallas motel near an interstate where Garcia had been staying.The motel room contained multiple weapons, including an AR-15-style rifle and a handgun.",
        "Footage showed the moment those first shots rang out, in which the gunman is seen pulling up to the store.Dashcam video showed the gunman getting out of a car and shooting at people on the sidewalk on Saturday afternoon. More than three dozen shots could be heard as the vehicle that was recording the video drove off.Garcia was using an AR-15-style gun during the mass shooting, and was dressed in full tactical SWAT gear.Investigators confirmed they believe shooter Garcia was working alone, but they have not yet released any motive for the killings."
    ]
}