{
    "articleURL": "/tvshowbiz/article-12056075/About-Father-stars-Leslie-Bibb-Kim-Cattrall-Robert-Niro-attend-Chicago-premiere.html",
    "content": [
        "READ MORE: 'I just had a baby!': Robert De Niro, 79, reveals he has recently welcomed his SEVENTH child The promotional push is on for the upcoming new comedy film About My Father, which was co written and stars Sebastian Maniscalco.",
        "The story is loosely based on the comedian's life and relationship with his father Salvatore Maniscalco, who's played by Robert De Niro.Both of them were on hand for the premiere screening at the AMC River East 21 in Chicago on Saturday, along with actresses Leslie Bibb and Kim Cattrall.Being that the standup comedian grew up in the Chicago suburb of Arlington Heights, Illinois, it was only fitting the the premiere would drop in the Windy City.The other castmembers on hand to hit the red carpet and screening included Laura Terruso, Anders Holm, Brett Dier, David Rasche, and of course Maniscalco's father Salvatore Maniscalco.",
        "Ahead of the screening, Bibb, 48, strutted her stuff on the red carpet in a spaghetti strap black dress, that was the picture of elegance.The simple but striking number had a plunging neckline and fell down past her ankles, which helped showcase her stylish black heelsRounding out her overall look, the former star of The Big Easy had her blonde tresses styled in a bob-cut of sorts, which came up about her shoulders with a part on the left.After striking a few poses by herself, Bibb was joined for another round with Cattrall, who showed off her fab figure in a fitted green green dress that she paired with a white blazer.",
        "Carrying a black clutch purse, the Sex And The City alum, 66, wore her blonde locks several inches past her shoulders with a partial center part.Maniscalco, 49, would also use the arrival of spring as an inspiration for his fashion choices for the evening decked out in all-white.The ensemble consisted of dress pants, top and light jacket, along with a pair of matching sneakers.",
        "He would also share the spotlight with his dad, who's often been a source of material for his standup comedy act over the years. His animated father would strike a few poses alongside his son in a black suit with a matching dress shirt. Salvatore Maniscalco and his family immigrated from Cefalù, Sicily to Illinois when he was just 15-years-old, and with him he brought many of his Italian customs and traditionsIt's those traditions and way of life that his son uses to perfection in his comedy, which no doubt plays a big role in the new movie.Directed by Laura Terruso from a screenplay by Sebastian Maniscalco and Austen Earl, the story follows Sebastian as he informs his dad about his plan to propose to his American girlfriend during a weekend getaway,  which Salvo insists he should attend.",
        "Despite the clash between their two cultures and initial perception of having nothing in common, they eventually become a single, unified family by the end of the summer holiday weekend.",
        "The other stars of the film would also makes the rounds in front of the photographers gathered for the event.  De Niro, 79, came dressed to impress in a black suit, while Anders Holm, 41, was wearing in a brown blazer with black pants and a white shirt.David Rasche zlso went with black, while Brett Diar opted for blue jeans with a multi-colored shirt, and Laura Terruso wore black dress pants with a matching blouse.About My Father is scheduled to premiere in theaters in the U.S. on May 29. "
    ]
}