{
    "articleURL": "/wires/reuters/article-12044315/Canada-online-news-bill-unreasonable-Google-executive-says.html",
    "content": [
        "By Sam Jabri-Pickett",
        "TORONTO, May 3 (Reuters) - Google may be forced to remove links to news articles found in Canadian search results if the government passes legislation to compel internet companies to pay news publishers, a company executive told lawmakers on Wednesday.Canada's proposed legislation would force platforms like Alphabet Inc, Google´s parent, and Facebook parent Meta Platforms Inc to negotiate commercial deals and pay Canadian news publishers for their content, part of a broader global trend to make tech firms pay for news.\"The extreme level of business uncertainty and uncapped financial liability that Google is being asked to accept ... is unreasonable,\" Google vice president of news Richard Gingras said in testimony to a Senate committee.\"If we must pay publishers simply for linking to their sites, making us lose money with every click, it would be reasonable for us, or any business, to reconsider why we would continue to do so,\" he added.This year, Google tested blocking some Canadian users' access to news as a potential response to the legislation, a move Prime Minister Justin Trudeau called a \"terrible mistake.\"Google last year linked to Canadian news publishers more than 3.6 billion times, Gingras said, which helped those companies make money on ads and new subscriptions.Introduced in April 2022, the bill, known as Bill C-18, is the latest legislation that aims to make digital media platforms pay their fair share for linking news content.",
        "Ottawa's proposal is similar to a ground-breaking law that Australia passed in 2021, which also triggered threats from Google and Facebook to curtail their services. Both eventually struck deals with Australian media companies after amendments to the legislation were offered.Since the Australian law took effect, the tech firms have approved more than 30 deals with media outlets compensating them for content-generating traffic.Canada's news industry has called for tighter regulation of tech companies to prevent them from elbowing news businesses out of the online advertising market. News industry says it has suffered financial losses as firms like Google and Meta steadily gain greater market share of online advertising revenue. (Reporting by Sam Jabri-Pickett in Toronto, additional reporting by Ismail Shakil in Ottawa, editing by Steve Scherer and Josie Kao)"
    ]
}