{
    "articleURL": "/sport/formulaone/article-12047185/Red-Bull-chief-Christian-Horner-sends-warning-F1-gruelling-23-race-calendar.html",
    "content": [
        "Formula One is undertaking a record-breaking 23-race season for 2023Red Bull boss Christian Horner is wary that it is 'gruelling' and now at 'saturation'He has suggested that one option could be to rotate some circuits being used Red Bull team boss Christian Horner has warned that Formula One is 'right on the limit' with its record-breaking 23-race calendar for 2023. ",
        "F1 executives pieced together a calendar with one more race than last season, won by Red Bull's Max Verstappen, with the season commencing in early March in Bahrain and ending in late November in Abu Dhabi. But Horner is increasingly concerned at the toll the 'gruelling schedule' is taking on drivers, team members and travelling F1 staff, so much so that he believes every circuit should be under the microscope.  '23 races is a gruelling schedule for everybody on the travelling team… we are at the point of saturation,' he told CSM Sport and Entertainment non-exec Chairman Seb Coe on the Extraordinary Tales podcast. 'Every good book can only have so many chapters and I think we've got that.'",
        "Asked where the sport, which has exploded in popularity due in no small part to the success of Netflix's Drive to Survive series, goes from here, Horner is convinced there is no room for more adds to the calendar. 'Maybe we need to revisit some of the existing circuits and ask: 'do we need to be there every year?',' he added.'Should there be a rotation? I think 23 races is right on the limit.'It was originally planned that this would be a 24-race season but the Chinese Grand Prix was shelved earlier this year due to its Covid protocol. It was not replaced.",
        "F1 took a four-week break as a result, leading into last weekend's race in Baku, which was won by Red Bull's Sergio Perez.Horner, who spoke with fervour at the debut of the Las Vegas Grand Prix later this year, which will see the track travel down the famous Strip, remains eager to protect the sport's historic tracks.",
        "Mar 5: Bahrain GP (Sakhir)Mar 9: Saudi Arabian GP (Jeddah)Apr 2: Australian GP (Albert Park)Apr 30: Azerbaijan GP (Baku)May 7: Miami GP (Miami Autodrome)May 21: Emilia Romagna GP (Imola)May 28: Monaco GP (Monte Carlo)Jun 4: Spanish GP (Catalunya)Jun 18: Canadian GP (Gilles Villeneuve Circuit)Jul 2: Austrian GP (Red Bull Ring)Jul 9: British GP (Silverstone)Jul 23: Hungarian GP (Hungaroring)Jul 30: Belgian GP (Spa)Aug 27: Dutch GP (Zandvoort)Sep 3: Italian GP (Monza)Sep 17: Singapore GP (Marina Bay)Sep 24: Japanese GP (Suzuka)Oct 8: Qatar GP (Lusail)Oct 22: US GP (Circuit of the Americas)Oct 29: Mexico City GP (Autodromo Hermanos Rodriguez)Nov 5: Sao Paulo GP (Interlagos)Nov 18: Las Vegas GP (Las Vegas)Nov 26: Abu Dhabi GP (Yas Marina)",
        "The Red Bull chief stressed that he does not want to see circuits such as Silverstone, Monza, Monaco, and Spa removed, but did accept that a calendar north of 23 races isn't sustainable. ",
        "The clamour for more races is being driven by the fandom from the Netflix series, something Horner likened to 'the Kardashians on wheels'.'We're going to be racing down the strip in Las Vegas,' he continued. 'Five years ago that would have been incomprehensible.'Horner and the rest of the F1 paddock are currently in Miami, Florida, preparing for the first of three US races this year, with Austin, Texas, and Las Vegas, Nevada, to follow."
    ]
}