{
    "articleURL": "/wires/aap/article-12039325/Firefighter-dies-battling-factory-blaze.html",
    "content": [
        "An experienced firefighter who died after she was injured responding to a large factory fire is being remembered for her courage and devotion to the job.",
        "Izabella Nash died in hospital overnight after suffering critical injuries in the Slacks Creek fire south of Brisbane, Queensland Fire and Emergency Services said.A second firefighter, Lia Drew, also rescued in the blaze early on Tuesday morning, remains in hospital in a serious but stable condition.\"The thoughts of all QFES members are with Izzy's and Lia's families, friends and fellow crew members,\" QFES said on Wednesday.Ms Nash was an experienced firefighter with about a decade in the service, United Firefighters' Union Queensland secretary John Oliver said.\"It's a very sombre morning for firefighters across the state,\" he told ABC radio Brisbane.Delegates are visiting stations across the southeast this morning and checking on firefighters who were at the factory fire that was contained just after 6am on Tuesday.\"I can tell you they're feeling the pain,\" Mr Oliver said.\"The crews that were there on the night were fantastic ... the people running the incident I know personally and they're very experienced and good operators.\"Safety teams wearing breathing apparatus were involved in the firefighters' rescue, which took place during the hottest part of the battle against the blaze, QFES Deputy Commissioner Michael Wassing said.\"It is very rare that our firefighters are injured in this way and that's because of the enormity of the training and the professionalism of our firefighters,\" he said.",
        "Federal Treasurer Jim Chalmers said Ms Nash was a firefighter in his local community and described her as a selfless, committed and courageous young woman.\"Her loved ones and her workmates will be incredibly sad today and our community is heartbroken too,\" he told reporters on Wednesday.Premier Annastacia Palaszczuk said Ms Nash's death was a poignant reminder of the danger front-line staff face daily.\"She was clearly devoted to her job, on the front line supporting her fellow Queenslanders,\" the premier said.Police have declared a crime scene as they work to determine the cause of the blaze.Officers checked the surrounding area for CCTV and business owners were interviewed by investigators.Workplace Health and Safety officers are also investigating."
    ]
}