{
    "articleURL": "/news/article-12052481/Prince-wont-official-photos-family-lunch-procession.html",
    "content": [
        "Prince Harry is not expected to play any part in today's Coronation celebrationsThe king's son will be relegated to the 'and also's' at the Abbey King Charles Coronation LIVE: Kate and royals dazzle at Buckingham Palace Prince Harry is not expected to play any part in today's Coronation celebrations apart from his brief appearance at Westminster Abbey.",
        "Sources have told the Mail that there are 'no plans' for him to join the Royal Family at Buckingham Palace, take part in the private family lunch or even appear in photos.And he will not take part in the procession back from Westminster Abbey or join his family on the balcony for the traditional public appearance and flypast.Instead, the King's son – who is fifth in line to the throne – will be relegated to the 'and also's' at the Abbey.It comes after it was revealed that the Duke jetted into the UK on a commercial flight yesterday morning, leaving passengers gobsmacked. The King's son arrived from Los Angeles on American Airlines flight AA136, which landed at 11.23am at London Heathrow on Friday.",
        "It came amid a blanket of secrecy over his arrival for the big day.The Duke of Sussex has not been seen in public for days and there was no sign of him leaving his Californian mansion or arriving in the UK.Buckingham Palace announced last month he would be attending and he was expected to spend the night at Frogmore Cottage on the Windsor estate last night.Sources have stressed that he will be 'in and out of the UK in 24 hours'. He plans to dash back straight after the two-hour ceremony to be with Meghan for their son Archie's fourth birthday.",
        "Insiders last night said they could not rule out him having an unplanned heart-to-heart with his father after he lands in the UK.",
        "'Of course you can never say never,' said one. 'Anything is possible, especially with him. And His Majesty loves his son despite everything.'But others felt that this was extremely unlikely.'To be honest it seems a bit pointless him being there. His place in the pecking order couldn't be clearer,' another source told the Mail.'Attending is probably the right thing for him to do in the long run. He can at least say he came and made the effort to be with his father on his big day... But the red carpet is most definitely not being rolled out and, as it stands, he will just be another member of the congregation.'Buckingham Palace last month announced it was 'pleased to confirm' Harry would attend his father's ceremony. There had been months of speculation over whether he and possibly Meghan would attend.It came after the Duke and Duchess of Sussex released a six-part Netflix docuseries in December where they suggested William was 'trapped' and claimed they were not treated well by the Royal Family.Then in January, the Duke of Sussex published intimate details of his family's private life in his memoir, Spare. All of this followed the Sussexes' extraordinary Oprah interview in 2021 where they claimed an unnamed relative had asked what colour skin their baby would have.",
        "Despite the continued hostility towards his family, King Charles was keen to extend an olive branch and invited his son to the Coronation.Harry made him wait until the last minute before Buckingham Palace announced he would be attending on his own.It was said to have left royal officials unable to sign off arrangements for seating plans, transport and security, as the duke's confirmation came after the official RSVP date.Coronation organisers admitted that they were stressed about Harry's plans and said that it was like 'trying to communicate with Mars'.Royal insiders told how they were seeking confirmation of 'when he is coming, when he is going back and whether he is happy with his seating position in the Abbey'.Meghan will stay behind with Lilibet, one, and Archie, who celebrates his birthday today.Meghan announced this week that she has signed a deal with a talent agency representing Dwayne 'The Rock' Johnson, LeBron James and Serena Williams.It is expected to earn her tens of millions of dollars and will likely see her back in the spotlight."
    ]
}