{
    "articleURL": "/news/article-12047195/Twitter-CEO-Elon-Musk-slams-San-Francisco-post-apocalyptic.html",
    "content": [
        "Twitter CEO Elon Musk slammed San Francisco as feeling 'post-apocalyptic'Musk has been spending much of his time in the company's SF officesNordstrom, Target, Whole Foods and a range of stores have shut due to crimeBillionaire Elon Musk has branded downtown San Francisco 'post-apocalyptic' as retailers continue to flee the city over concerns about safety and declining foot traffic.",
        "Musk, who has been spending much of his time at Twitter's San Francisco headquarters since purchasing the company in October, made the remark in response to a tweet lamenting the city's crime problems.'So many stores shuttered in downtown SF. Feels post-apocalyptic,' he tweeted on Thursday. 'The philosophy that led to this bleak outcome will be the end of civilization if extended to the world.' Nordstrom announced this week plans to shutter its stores in San Francisco, joining a growing list of companies pulling out of the city, including Whole Foods, Anthropologie, and Office Depot. Other retailers, including Target, have stepped up security by encasing some or all of their products in locked security cabinets to deter rampant theft by organized shoplifting gangs.",
        "Musk's comment on Twitter came in response to a tweet from Tesla Owners Silicon Valley, an account he regularly interacts with, which had written: 'SF has become a place to avoid due to crime and the fact that your car will most likely be broken into.'Concerns about crime appear to have contributed to the declining foot traffic that several retailers have cited in shuttering their San Francisco stores.Nordstrom, the clothing retailer based in Seattle, said it would not renew leases for its San Francisco store in Westfield Mall and a Nordstrom Rack across the street, according to an internal memo reported by the Washington Post.",
        "The memo noted that 'the dynamics of the downtown San Francisco market have changed dramatically over the past several years, impacting customer foot traffic to our stores and our ability to operate successfully.' Westfield told the Post that the closure was due to 'the deteriorating situation in downtown San Francisco' and blamed the departure of businesses on 'unsafe conditions for customers, retailers, and employees, coupled with the fact that these significant issues are preventing an economic recovery of the area.' While many of the issues facing San Francisco are tied to property crimes and quality of life issues, last month the brutal stabbing death of CashApp founder Bob Lee in the city shocked the nation.The man charged with the murder, 38-year-old Nima Momeni, appears to have had a personal dispute with Lee, who was reportedly dating his sister, and police say the murder was not a random attack. Still, footage showing Lee staggering down a San Francisco sidewalk as he bled out only served to underline concerns about the city's safety.",
        "Recent crime data shows a mixed bag in San Francisco, with murder up 13 percent and robbery up 11 percent from last year, while rape is down 25 percent and larceny theft, by far the most common major crime, is down 10 percent.",
        "Overall, San Francisco's crime rate is down 7.6 percent in 2023 from last year, and the city's per capita murder rate is well below that of many other cities of a similar size, including Indianapolis, Columbus, Ohio and Jacksonville, Florida.However, San Francisco District Attorney Brooke Jenkins acknowledged last month that crime stats don't tell the entire story about public safety.'I think San Franciscans are still very much concerned about public safety, and we still have a long way to go to make San Francisco as safe as it needs to be,' she told KTVU. 'And so, this isn't always necessarily about data. It's about the way that our residents and business owners and even visitors feel.'Scenes of rampant open-air drug use and squalid homeless encampments also remain tragically common in the Golden Gate City.Recent data from the city's medical examiner revealed a 41 percent surge in the number of drug-related deaths in the first quarter of 2023 compared to the same time last year, as fentanyl ravaged the city's homeless population.",
        "San Francisco saw 200 people die due to overdoses between January and March, compared to 142 deaths in 2022. That amounts to one overdose death every 10 hours, and the victims were disproportionately black and Latino men, and frequently based in the Tenderloin area, a gritty downtown neighborhood where a drug treatment center was shuttered in December.",
        "Those living on the streets were particularly hard hit — with the number of homeless people dying from drug overdoses doubling.Conditions in downtown San Francisco have led to a number of business closing locations in the area, or pulling out of the city entirely.Gap was the first to announce its departure in August 2020, shortly followed by H&amp;M and Marshall's. As the years went on, more stores slowly pulled out. The Market Street Anthropologie will be closing its doors on May 13, according to the San Francisco Chronicle. As a result, the brand will no longer have a location in the city. Office Depot, located on Third Street, will also be shuttered, but the exact closing date is unknown. The brand has a bigger store on Geary Boulevard, which will not close. ",
        "Organic food giant Whole Foods opened a new 'flagship' location at Trinity Place in the city's Tenderloin District in March 2022, hoping to revitalize footfall after two years of draconian COVID-19 restrictions severely impacted businesses in the area.But a Whole Foods spokesperson confirmed the store had shuttered due to safety concerns for its staff. 'We are closing our Trinity location only for the time being,' the spokesperson said in a statement. 'If we feel we can ensure the safety of our team members in the store, we will evaluate a reopening of our Trinity location.' ",
        "The company cited deteriorating street conditions including drug use and crime near the store as the driving factors behind the closure.Industry groups have noted that there is an issue with theft, with the National Retail Federation saying that organized retail crime is setting stores back around $100 billion a year, according to a 2022 survey.In 2021, retailers saw a 27 per cent increase in theft carried out by organized criminal rings, the survey found. To tackle the issue, they invested more money in safety and security measures to protect employees, customers and merchandise."
    ]
}