{
    "articleURL": "/wires/afp/article-12056561/Gunman-kills-eight-rampage-Texas-mall.html",
    "content": [
        "US President Joe Biden renewed his call Sunday for a national assault-weapons ban and other gun safety measures, a day after eight people were murdered at a Texas shopping mall in the latest mass shooting to shake the nation.",
        "Responders, distressed witnesses and police described scenes of panic and horror in Allen, where video footage shared online showed the shooter exiting a sedan in an outlet mall parking lot Saturday and firing a semi-automatic rifle at people walking nearby.An officer on an unrelated call nearby quickly responded and \"neutralized\" the shooter, police said.Seven people were pronounced dead at the scene, including the shooter, while two others died in the hospital, authorities said.Three people were in critical condition as of Sunday morning, the Allen Police Department said.The Texas Department of Public Safety identified the suspected shooter as Mauricio Garcia, a 33-year-old from Dallas, in a statement Sunday evening.While the statement did not offer further details about Garcia's background or motive, multiple US media outlets said investigators were probing his social media posts, which allegedly showed an interest in radical right-wing ideology, including white supremacy and neo-Nazism.\"Eight Americans -- including children -- were killed yesterday in the latest act of gun violence to devastate our nation,\" Biden said in a statement Sunday.He ordered US flags lowered to half-staff \"as a mark of respect for the victims\" and repeated his call for lawmakers to take action against a gun \"epidemic.\"\"Once again, I ask Congress to send me a bill banning assault weapons and high-capacity magazines,\" the 80-year-old Democrat said.",
        "He also demanded lawmakers require universal background checks for gun purchases and end legal immunity for manufacturers' whose weapons are used in attacks.\"I will sign it immediately. We need nothing less to keep our streets safe,\" Biden said in a statement.- Awash in firearms -The attack is the latest in an alarming trajectory of deadly US gun violence. Barely a week earlier, a man shot and killed five neighbors in Cleveland, Texas after one of them asked him to stop firing his rifle in his yard at night while a baby slept.",
        "Several other people have also been gunned down in recent weeks over petty disputes or common mistakes, such as knocking on the wrong door or getting into the wrong car.Awash in firearms, the United States has already endured 199 mass shootings this year, according to the Gun Violence Archive, a non-governmental organization that defines a mass shooting as four or more people wounded or killed.\"Too many families have empty chairs at their dinner tables,\" Biden said, as he berated his political opponents for inaction.\"Republican members of Congress cannot continue to meet this epidemic with a shrug,\" he said. \"Tweeted thoughts and prayers are not enough.\"- No 'quick solution' -The gunfire at Allen Premium Outlets, 35 miles (56 kilometers) north of Dallas, erupted Saturday afternoon when it was busy with weekend shoppers, police said.",
        "The officer in the mall \"heard gunshots, went to the gunshots, engaged the suspect and neutralized the suspect,\" said Chief Brian Harvey of the Allen police department.Biden joined local officials in hailing the quick actions of police for likely saving lives.",
        "The police chief later said authorities believe the unidentified shooter \"acted alone.\"CNN showed a cropped photograph of the apparent gunman dead on the ground, wearing tactical gear with extra magazines, and with an AR-15-style rifle at his side.Governor Greg Abbott, who attended a vigil Sunday evening for the victims, said \"the hearts of all Texans are with Allen.\"Earlier in the day, the Republican had called the shooting an \"unspeakable tragedy,\" and refused to discuss repeated demands by Democrats for tightened gun restrictions.\"People want a quick solution. The long-term solution is to address the mental health issue\" including the increased \"anger and violence\" in America, Abbott told Fox News.- 'Unfathomable' carnage -Steven Spainhouer, a former police officer, said he was confronted with horrific images when he rushed to the scene and performed CPR on victims before emergency responders arrived.",
        "Finding one female victim on the ground, \"I felt for her pulse, pulled her head to the side, and she had no face,\" Spainhouer told CBS News. He found the son of another victim lying alive under his dead mother and \"covered head to toe\" in her blood.",
        "\"It's just unfathomable to see the carnage,\" he said.With more firearms than inhabitants, the United States has the highest rate of gun deaths of any developed country -- 49,000 in 2021, up from 45,000 the year before."
    ]
}