{
    "articleURL": "/news/article-12039795/Extreme-marathon-runner-26-known-Worthings-Hardest-Geezer-racing-length-Africa.html",
    "content": [
        "Russell Cook will have to complete a marathon a day until Christmas in his testThe West Sussex man is running over 15,000km from South Africa to TunisiaAn extreme marathon runner who is known as Worthing's 'Hardest Geezer' is running the length of Africa without resting in a bid to break records.",
        "Russell Cook is embarking on a tortuous quest to race  more than 15,000km from the tip of South Africa to the northern coast of Tunisia on foot.To do this, he hopes to run a marathon every single day until Christmas, with no breaks or rest days as he travels up the continent.In the process the 26-year-old, who is less than two weeks and 353 miles into his odyssey, will cross 16 countries and brave some of the toughest environments known to man including rainforests and deserts.Russell, from Worthing in West Sussex, claims he would be the first person to make the journey and he wants 'to suffer' as he does it, while raising money charity.",
        "The athlete, who is a self-described former 'fat lad' with alcohol and gambling issues, was introduced to long distance running when he entered a half marathon at the age of 21.Since then he has gained a reputation for attempting trials of strength and endurance - he ran 71 marathons in 66 days from Asia to London in 2019, pulled a Suzuki Alto 26 miles along the south coast and was buried alive for a week in 2021. But #ProjectAfrica, as he calls it, is on another level and he's not doing things the easy way, telling The Times he has no intention of taking unenforced stops on the journey.",
        "He said: 'Rest days don't exist in my world We don't do rest days. They just take away from the purity of the physical challenge. I'm out here to suffer and rest days make it easy. 'Also, no one's ever done this before, so I'm trying to set a fast time so that no one tries to beat it.'Over the course of his journey he will pass through South Africa, Namibia, Angola, Democratic Republic of the Congo, Republic of the Congo, Cameroon, Nigeria, Benin, Togo, Ghana, Ivory Coast, Guinea, Senegal, Mauritania, Algeria and Tunisia.While the magnitude of the simply running over 15,000km would put many off, Russell will also have to contend with some of the most inhospitable environments on the planet, as well as man-made problems. He said: 'I think that going through the Congo rainforest in rainy season is going to be pretty dicey. One, just because the weather's going to be atrocious and two, because I don't know if the van is going to make it through that. 'There is also some civil unrest and geopolitical issues in various countries so there's always potential problems. ",
        "'And then the other one is obviously the Sahara Desert. I've got around 4,000 kilometres [there] so that's probably not going to be very easy.'",
        "The extreme runner, who has a mantra of 'you've got one life, so attack it', admits he might do permanent damage to his body in his attempt. Russell began his journey on April 22 by setting off from Cape Agulhas in South Africa, and since then has run for 11 days and 568km in total.He is joined by travelling companions Harry Gallimore and Stan Gaskell who will be filming his travels and making sure he is as well and comfortable as can be.Aside from the immense pride at finishing the epic journey, Russell is also raising money for charity.Half of the proceeds will go to The Running Charity, which helps young people who are homeless, and the other half will go to WaterAid, which provides clean water and toilets in places like Africa.You donate to his fundraising page at https://givestar.io/gs/PROJECTAFRICA"
    ]
}