{
    "articleURL": "/wires/reuters/article-12043015/Colombia-oil-regulator-invest-135-mln-renewable-energy.html",
    "content": [
        "By Oliver Griffin",
        "BARRANQUILLA, May 3 (Reuters) - Colombia's National Hydrocarbons Agency (ANH) will invest more than $135 million in growing its knowledge of renewable energy options, the agency's new president Clara Guatame said at an industry event in the Caribbean city of Barranquilla on Wednesday.The government of leftist President Gustavo Petro has set its sights on weaning Colombia from its dependence on oil exports, a major source of income for the Andean country, as it moves to transition to cleaner energy sources.\"Recently, the ministry of mines and energy has delegated some functions to the National Hydrocarbons Agency, that will allow us to grow our knowledge mainly in wind energy, geothermal energy and hydrogen,\" Guatame said at an oil and gas conference organized by the Colombian Petroleum Association (ACP).The ANH will invest 640 billion pesos ($135.8 million) in projects over the next four years geared toward the energy transition, she said.The sum forms part of the Colombian government's four-year development plan being debated in congress.As part of its energy policy, Colombia's government has pledged not to grant any more hydrocarbon exploration and production contracts, urging companies to make the most of licenses they have already been granted.Last year, Minister of Mines and Energy Irene Velez told Reuters the government was targeting a 15% increase in oil output using enhanced recovery methods.",
        "Colombia currently produces around 765,000 barrels of oil per day (bpd), Guatame said. This is 1.4% higher than the average production recorded last year, which was 754,199 bpd, according to the ministry of mines and energy.Some 39% of Colombia's current oil output comes from projects where companies have implemented enhanced recovery technologies, Guatame said.\"This shows a commitment from the companies to also apply new enhanced recovery technologies,\" Guatame said.($1 = 4,713.08 Colombian pesos) (Reporting by Oliver Griffin; Editing by David Gregorio)"
    ]
}