{
    "articleURL": "/wires/ap/article-12054555/Leipzig-beats-Freiburg-boost-Champions-League-chances.html",
    "content": [
        "BREMEN, Germany (AP) - Bayern Munich survived a nervy finish to edge closer to the Bundesliga title with a 2-1 win over Werder Bremen that opened up a four-point lead over Borussia Dortmund on Saturday.",
        "Gnabry broke through in the 62nd minute, seizing on the loose ball and scoring after Jamal Musiala mishit a shot off Sadio Mané´s pass. Leroy Sané doubled the Bayern lead 10 minutes later with a first-time shot from a narrow angle off Noussair Mazraoui's incisive throughball.Bremen brought the game back to life out of nowhere when Niklas Schmidt curled a long-range shot into the top corner in the 87th, shortly after coming off the bench. Bremen tried to level the score but Bayern held on with smart defending and some strategic timewasting.Bayern dominated most of the first half without generating any chances of note against the compact Bremen defense, besides a Benjamin Pavard header pushed away by goalkeeper Jirí Pavlenka.Bremen gave Bayern a scare first when Mitchell Weiser failed to make contact with a cross in front of goal, then again soon after when midfielder Christian Gross surged through the center of the field past two defenders but missed the target.Bayern will be assured of a record-extending 11th successive German title if it wins its last three games against Schalke, Leipzig and Cologne.",
        "Dortmund, which dropped the league lead after drawing with Bochum last week, hosts seventh-placed Wolfsburg on Sunday.CHAMPIONS LEAGUE CONTESTA solo goal from Kevin Kampl lifted Leipzig to 1-0 over Freiburg on Saturday that boosted Leipzig's hopes of qualifying for the Champions League.",
        "While Bayern and Borussia Dortmund tussle for the league title, Leipzig gained an edge on Freiburg and Union Berlin in a three-way fight for the last two Champions League spots.Union Berlin's chances were hurt after losing at Augsburg 1-0 on a second-half volley from Dion Beljo.Union and Freiburg are aiming to qualify for Europe´s top club competition for the first time.Kampl's goal was down to skill and a slice of luck. The Slovenian dribbled into the penalty area and looked to play a pass which deflected off defender Manuel Gulde, leaving Kampl to collect the loose ball and score. It was the second time Leipzig beat Freiburg this week after a 5-1 rout in the German Cup semifinals on Tuesday.RELEGATION FIGHTSLast-placed Hertha Berlin raised hopes of a dramatic escape from relegation after beating fellow struggler Stuttgart 2-1. Hertha stayed last but cut the gap to 16th-placed Stuttgart, the first team outside the drop zone, to three points.American coach Pellegrino Materazzo took a big step closer to his goal of saving Hoffenheim from relegation after a 3-1 win over Eintracht Frankfurt.Frankfurt coach Oliver Glasner was red-carded before halftime after disputing a contentious penalty for Hoffenheim. Frankfurt had a chance to come back when Stanley Nsoki was sent off for a dangerous challenge on U.S. player Paxten Aaronson, but could manage only a single goal from Mario Götze.",
        "Bochum remained in the relegation zone in 17th after losing to Borussia Moenchengladbach 2-0.Bochum's defeat could be costly given that four of the bottom six teams won their games this weekend, including Hertha, Augsburg, Hoffenheim and Schalke, which beat Mainz 3-2 on Friday on a dramatic 102nd-minute penalty.___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}