{
    "articleURL": "/news/article-12050223/Simon-Charles-Dorante-Day-not-watch-King-Charles-Coronation-amid-claims-son.html",
    "content": [
        "Australian claims to be son of Charles and CamillaSays he won't be watching Coronation on Saturday night An Australian claiming to be King Charles' 'secret son' has revealed he has no interest in watching the Coronation because of the radio silence he's received from the royal.",
        "British-born Simon Charles Dorante-Day claims he is the illegitimate love-child of Queen Consort Camilla and King Charles and has had his requests for a DNA test ignored for years.He was adopted when he was about eight months old in August 1996 in Portsmouth, in the UK, when Camilla would have been 18, and Charles 17. Mr Dorante-Day said that he and his wife Elvie will not be watching Saturday's event from their home in Queensland because they have 'better things to do'.",
        "'Him being King doesn't make me any less his son does it?' he told Seven News.'I'm going to be pursuing what I'm pursuing, I have my proof of where I stand with this.'I've got no fear in the truth in this. I won't be the one with egg on my face.'The Coronation is expected to be viewed by about 350million people worldwide and cost around $180million. 'It's an historical event, sure it's a significant event but I know I won't be watching it,  I've got better things to do,' Mr Daronte-Day said.He said the money should instead go towards hospitals or curbing homelessness. ",
        "'I'm with Meghan (Markle). I don't want to stand in front of people who think they're better than me,' he added.",
        "Mr Daronte-Day said he had 'no doubt' the royals would be watching his interview and left them with a final message: 'You know the truth - and you're standing there accepting being named King, knowing the truth.'Mr Dorante-Day claims that as a child, his adoptive grandmother - who worked for the late Queen Elizabeth II - told him on her deathbed that he was Charles and Camilla's son.The father-of-nine also claims that in the months leading up to his birth, Charles was sent to Australia to study and Camilla disappeared from the public eye for about nine months. ",
        "Mr Dorante-Day claims medical procedures were undertaken during his childhood to alter his appearance, including changing his eye colour and filing his teeth.In his case, he alleges King Charles and Queen consort Camilla began their close relationship in 1965, a year before his birth certificate says he was born.Mr Dorante-Day claims that Camilla kept him until he was eight months old, hiding him from the world with the help of the Royal Family and protection officers, and claims to have been told it was a condition of the adoption that his names Simon and Charles were not changed.However by eight months he was growing too big to hide and it was arranged for the daughter of a royal household staff member - Mr Dorante-Day's adoptive grandmother - to take him under her care.",
        "Mr Dorante-Day believes inconsistencies on his birth certificate and his name also prove he is of royal blood.But his timeline of events contradicts official records that say the new King and Camilla met each other five years after Mr Dorante-Day's birth."
    ]
}