{
    "articleURL": "/femail/fashion/article-12049211/Natv-Shoppers-frenzy-sustainable-intimates-brand-Ive-underwear-soulmate.html",
    "content": [
        "Thousands are obsessed with Australian underwear label Nat'vThe sustainable brand has been labelled a 'must have' An intimates brand is becoming a must-have for women after shoppers revealed they felt they'd 'found their underwear soulmate' the moment they tried them on.",
        "Nat'v is an Australian-owned brand which is quickly becoming known as the most comfortable underwear ever.Founder Sandy Ronalds, 38, revealed more than 600,000 pieces have been sold since she launched her business in 2019.With 2023 looking to be the company's biggest year yet  because more women are learning about the brand.Nat'v is an Australian label with eco-friendly and ethical vegan underwear which is designed for everyday use.",
        "Some people claim it feels like 'you are wearing nothing' and thousands of others have dubbed it the 'essential addition' to your underwear wardrove. 'I really feel like I've found my underwear soulmate,' one customer said after trying the briefs.While others admitted they could never go back to their old buys. 'I've slowly but surely started replacing all my underwear with Nat'v products and they've exceeded all my expectations.'",
        "Nat'v was founded to actively combat brands who produce high volumes of waste and stocks sizes 6-20.Retailing from $20, shoppers can purchase panties, bras, bodysuits, and maternity wear in a variety of colours.'These are really my new favourites, they're perfect for working out and going to the club,' a shopper wrote.The company's founder was particularly concerned about the state of the fashion industry when she created the brand.",
        "'It occurred to me that fashion and apparel are some of the biggest culprits when it comes to unethical and unsustainable practices,' she told FEMAIL. ",
        "Ronalds has previous experience in marketing and business development that helped her spearhead sustainable change.'So much fashion is fast fashion - which is a massive problem. But most of us wear undies most days, and I'd say underwear is the one category of clothing you really don't want to be buying second hand.' 'The penny immediately dropped and the seed was planted. I was going to build an underwear and basics brand that asks the question; 'is this better for people and planet?' at every step of the way.'Shoppers have been particularly raving about the long-lasting and high-quality aspects of Nat'v's range.'Our customers have become such fans of our products,' Ronalds elaborated. 'We get a lot of feedback that they’ve found their ‘forever undies’ which feels pretty awesome to hear!'",
        "Thousands all around Australia cannot get enough of Nat'v's popular underwear sets.'I have been searching for these forever,' a woman wrote. 'No panty line, so easy, so comfortable, pack like a dream, wash like a dream. Can't praise enough!''These undies are to die for. The g-string doesn't ride up your bum in pain, it looks amazing, and they have a variety of colours. They make me want to do the washing as I never want to go without wearing them!' said another.",
        "A third added: 'They're so super surprisingly soft, they move to my grooves really easily, don't chafe or cause any discomfort after shaving.'"
    ]
}