{
    "articleURL": "/sport/football/article-12057443/TOM-COLLOMOSSE-Old-warhorse-Diego-Costa-imperative-Wolves-Premier-League-survival.html",
    "content": [
        "The former Atletico Madrid and Chelsea striker was signed by club last yearIt appeared a desperate move for a desperate situation but it has worked outManager Julen Lopetegui would like to keep Diego Costa around for next season Diego Costa might have scored only once in 21 matches but the old warhorse’s role in Wolves’ survival bid should not be underestimated.",
        "When Costa arrived at Molineux last September, it was a desperate move for a desperate situation. The transfer window had closed and Wolves had no senior centre forward available.The 34-year-old had not played competitively since leaving Atletico Mineiro in January 2022 and from his rusty early displays, it was impossible to imagine the former Chelsea man playing a key role in Julen Lopetegui’s efforts to keep Wolves in the Premier League.Yet there was Costa in the moments after Wolves’ 1-0 win over Aston Villa, secured by an early goal by Toti, giving Lopetegui a bear hug to celebrate reaching the 40-point total that should guarantee survival, and conducting the crowd as they chanted ‘Diego, Diego’.",
        "While he is no longer as sharp as he was, Costa was a constant menace for Villa centre backs Tyrone Mings and Ezri Konsa and his revival is testament to his fitness and dedication.His mentality has rubbed off on some of the younger players, with Brazilian midfielder Joao Gomes particularly grateful to Costa for helping him settle into English football.Mail Sport reported last week that Wolves were considering giving Costa a contract for next season. While his goal record does not match his status as one of Wolves’ highest-paid players, Lopetegui would like to keep Costa around.",
        "Villa will be setting their sights a little higher. Unai Emery has done a superb job at Villa and the imminent arrival of Barcelona director of football Mateu Alemany indicates an ambitious transfer campaign ahead.Before that, Villa will try to revive their fading European hopes by beating Tottenham on Saturday. ‘That match is our final,’ said Emery.Wolves (4-4-2): Sa 7; Semedo 6.5, Dawson 7.5, Kilman 7.5, TOTI 8; Nunes 6.5 (Moutinho 90min), Neves 7, Lemina 7.5, Neto 6.5 (A Traore 84); Costa 7.5 (Collins 83), Cunha 7 (Hwang 68, 6). Scorer: Toti 9. Booked: Costa, Toti, Semedo. Manager: Julen Lopetegui 8.Aston Villa (4-4-1-1): Martinez 7; Young 7 (Carlos 65, 6), Konsa 5.5, Mings 5.5, Moreno 6 (Digne 85); B Traore 4.5 (Bailey 46, 6), Luiz 6 (Kamara 86), McGinn 6.5, Ramsey 7; Buendia 7.5 (Duran 81); Watkins 5.5. Booked: Mings, Watkins, Luiz. Manager: Unai Emery 6.Referee: Stuart Attwell 6. Attendance: 31,651."
    ]
}