{
    "articleURL": "/wires/ap/article-12048183/Executions-return-South-Carolina-shield-law-nears-OK.html",
    "content": [
        "COLUMBIA, S.C. (AP) - A bill that would allow South Carolina to buy the drugs needed for lethal injection without revealing the name of the company who sells them will soon be heading for the governor's desk.",
        "The state Senate on Thursday approved minor changes the House made in the shield law bill with almost no debate. The proposal also requires the names of members of the execution team be kept secret.South Carolina has had an unintended 12-year moratorium on the death penalty after its lethal injection drugs passed their expiration date and pharmacies refused to sell the state more.Several South Carolina death row inmates have run out of regular appeals. But their executions are on hold because they can't be carried out.Sixteen other states have carried out about 100 lethal injection executions in the past six years. Many have shield laws. Some do not.\"It has worked in other states. Let´s see if it works here,\" South Carolina Corrections Department Director Bryan Stirling said Thursday.",
        "Two years ago, South Carolina tried to work around the lack of lethal injections drugs by passing a law creating a firing squad and giving inmates a choice between dying by bullets to the heart or in the state´s electric chair, which was first used to kill an inmate in 1913.But that law is on hold because of a court challenge as to whether those execution methods are constitutionally prohibited cruel and unusual punishments.South Carolina currently has 34 inmates on death row. At the end of 2011 after the last execution took place, the state had 52 death row inmates. Only three prisoners have been sent to death row during that time. Several prosecutors said they are less likely to seek the ultimate punishment without assurance the state can carry it out. The rest have left death row either through sentences reduced by appeal or natural deaths.",
        "While the state Supreme Court has halted executions by firing squad or electrocution, the justices have indicated they will lift the stop if the state can find lethal injection drugs.In court papers, state prison officials indicated their prospects for buying the drugs started to change as soon as it seemly likely lawmakers would pass the shield law.Gov. Henry McMaster said he will sign the bill. He has been adamant about finding some way to restart executions."
    ]
}