{
    "articleURL": "/news/article-12057019/William-Kate-release-gorgeous-photos-videos-surprise-Windsor-walkabout.html",
    "content": [
        "Follow all the latest Coronation news on MailOnline's live blog hereThe Prince and Princess of Wales have shared a gorgeous array of photos and videos on Instagram showcasing their surprise Windsor walkabout this afternoon.",
        "The couple delighted flag-waving fans with their impromptu appearance, smiling for selfies and warmly greeting members of the public who had turned up ahead of this evening's concert.One little girl was so overwhelmed at meeting Kate, that she was comforted with a royal hug in front of cheering onlookers.The princess, who had crouched down to speak to her, continued chatting to the girl, who nodded her head and gave a small shrug as Kate patted her back.The duo's 40-minute walkabout in the Windsor's famous Long Walk saw them sip cocktails and they were shown a special coronation ale dedicated to the King. The unannounced appearance came as Buckingham Palace said the King and Queen were 'deeply touched' by the nation's celebration of their coronation on Saturday.",
        "More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen's funeral in September.",
        "With a few hours to go before Take That, Katy Perry, Lionel Richie and others take to the stage in Windsor for a musical extravaganza, William and Kate chatted to picnicking families who were enjoying the summer sunshine.When the couple stopped to talk to Sue Watson and her friends, who all wore knitted yellow crowns and coronation T-shirts, they offered the future King a drink.",
        "Ms Watson told BBC News: 'We've got a homemade cocktail with us called Purple Rain, which we made ourselves out of gin and blue curacao and lemonade and grenadine, I think.'We offered him some, we gave him a cup and he poured himself a little drink and had some. He liked it, said it was really nice and he offered some to Kate, she had some and thought it was very nice as well.'The prince was fascinated by cans of Return Of The King coronation ale which the group had brought, and holding one asked: 'That's from Windsor?'During the walkabout the public swarmed around the couple and William and Kate crouched down to talk to children with their parents, and they both posed separately for group photographs and selfies.One woman in the crowd complimented Kate on the headpiece, by Jess Collett x Alexander McQueen, she wore for the coronation, telling her: 'I loved your headpiece.'The item featured silver bullion, crystal and silver thread work three-dimensional leaf embroidery, and in response Kate touched the woman on the shoulder as if to say 'thank you'.",
        "Before they left William told one group of well-wishers: 'Enjoy the concert tonight.'The walkabout came shortly after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.",
        "A Palace spokesman said the King and Queen were 'profoundly grateful' for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.The King, Queen and royal family will join around 20,000 members of the public at the musical extravaganza.Heir to the throne William is to take to the stage to deliver a speech during the event in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, will see Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls and singer Sir Tom Jones appear via video message.The series of pre-recorded sketches will reveal little-known facts about the monarch and include moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.There will also be performances by Paloma Faith, Olly Murs, veteran singer Steve Winwood - whose grandson Arthur Eliot was one of Camilla's pages of honour - and Nicole Scherzinger of The Pussycat Dolls.",
        "Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will perform too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Thousands of street parties have been held across the country with people encouraged to come together for the Coronation Big Lunch.Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.",
        "Meanwhile. Camilla asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.The simple posy, including auriculas, the late Queen's favourite lily of the valley, and one of Charles' favourites hellebores, by the King and Queen's go-to florist, Shane Connolly, was laid at the memorial.Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother.Camilla did not carry the flowers on Saturday as it was a coronation not a wedding, the Palace said.",
        "The heir to the throne also revealed that his father Charles' neck hurt last night after wearing St Edward's Crown, which weighs a hefty 5lbs and had to be carefully adjusted by the Archbishop of Canterbury to ensure it didn't topple off his head.Speaking to one group of fans, the prince said: 'I think his neck hurt last night, having the crown…it does weigh a hell of a lot.'When the couple first walked over to chat to family groups picnicking ahead of the concert, William was offered a drink in a union-flag decorated paper cup by a group of women who all wore yellow-coloured cloth crowns. He took a sip and later handed it to his wife, who drank from the cup and appeared to like it.",
        "William was handed a can of 'Return of the King', a specially brewed organic 'Coronation ale'. He looked absolutely thrilled, and Kate smiled as her husband told the well-wisher he'd save it for later. At one point, Kate, wearing a pale blue blazer and white top, picked up a small union flag on a stick which had fallen on the floor and handed it to the well-wisher who dropped it. She also comforted a little girl who was overwhelmed to meet her.Scores of people crowded around the Prince and Princess of Wales in Windsor, with William crouching down to chat to a boy and girl wearing golden crowns. The prince and princess looked relaxed, with William telling one group of well-wishers: 'Enjoy the concert tonight.'",
        "One woman in the crowd complimented Kate on the headpiece, by Jess Collett x Alexander McQueen, which she wore at the coronation, telling her 'I loved your head piece'.The item featured silver bullion, crystal and silver thread work three-dimensional leaf embroidery, and in response Kate touched the woman on the shoulder as if to say 'thank you'.The prince and princess continued to chat to the well-wishers and finally ended their walkabout, which lasted 40 minutes, with a wave goodbye.The couple's appearance came shortly after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were 'deeply touched' by the nation's celebration of their historic coronation.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.Heir to the throne William is to take to the stage to deliver a speech during the musical extravaganza in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The King, Queen and royal family will join around 20,000 members of the public at the musical extravaganza to see performances by Take That, Katy Perry and Lionel Richie.Kate Middleton greeted fans dressed in a pale blue blazer, while Prince William opted for a darker shade as he shook hands with those gathered outside the castle. ",
        "Alongside the thousands of smaller street parties expected to be held at the weekend, people are encouraged to come together across the country for the Coronation Big Lunch.In Cranleigh, the Duke and Duchess of Edinburgh will join residents and representatives from the Royal British Legion, the Scouts and the Guides - of which Sophie is president.Elsewhere, the Princess Royal and Vice Admiral Sir Tim Laurence will visit a community street party in Swindon, and Princess Beatrice and Princess Eugenie will join a big lunch in Windsor. Members of the public and organisers from a number of charities across the UK have expressed their enthusiasm ahead of the event. Lucinda Spelman-Ives, from Wilstock, who raised over £1 million to fund a community hub, hopes the Big Lunch will 'unify and bring everyone together being part of history, making amazing memories, laughing and meeting lots of people who have never met before'. 'Everyone is bursting with pride after yesterday's ceremony,' she said. 'This will be a very special memory for us all. Long live the Big Lunches and long live the King.'"
    ]
}