{
    "articleURL": "/wires/reuters/article-12059373/Sudanese-pin-hopes-Jeddah-talks-warring-factions.html",
    "content": [
        "Combatants aim to discuss humanitarian crisis, not war",
        "US/Saudi-backed talks began in Jeddah on SaturdayNegotiations 'our only hope' -government employeeSeveral ceasefires violated since fighting erupted(Adds army chief in paragraph 4 and 5, U.S. State Department in 13, tribal demonstration in 27)KHARTOUM, May 8 (Reuters) - Sudanese are pinning their hopes on talks in Saudi Arabia between envoys of warring factions to end bloodshed that has killed hundreds and triggered a mass exodus, but there is no sign lasting relief will come anytime soon.There has been no word on the progress of the talks which began on Saturday between the army and the rival paramilitary Rapid Support Forces (RSF) in the Saudi Red Sea city of Jeddah.The combatants have said they would try to tackle only a ceasefire and humanitarian issues like safe passage. Numerous ceasefires have been violated since conflict erupted on April 15.Army chief Abdel-Fattah al-Burhan said on Monday the army was seeking a peaceful solution but that there could be discussions about a lasting settlement only \"after we reach a permanent ceasefire in Khartoum.\"\"We believe the peaceful solution is the ideal route to handle this crisis,\" he said.However, the sound of air strikes and clashes echoed anew across the capital Khartoum on Monday, witnesses said, and neither side has publicly signalled it is open to concessions.",
        "\"If the Jeddah negotiations fail to stop the war this would mean that we won't be able to return to our homes and our lives,\" said Tamader Ibrahim, a 35-year-old government employee in Bahri, across the Blue Nile river from Khartoum. \"We're waiting on these negotiations because they're our only hope.\"Mahjoub Salah, a 28-year-old doctor, said the areas of the capital hit by violence changed from day to day.Salah witnessed heavy fighting and a neighbour getting shot in the abdomen in his central Khartoum district of Al Amarat last month, before renting a flat for his family in the south of the capital.\"We're still waiting for our passports to get issued, but we don't know how long this will take,\" Salah said. \"Then our plan is to travel from Port Sudan to Saudi Arabia.\"THOUSANDS PUSHING TO LEAVEThe U.S.-Saudi initiative is the first serious attempt to end fighting that has turned parts of Khartoum into war zones, stymied an internationally backed plan to usher in civilian rule after years of unrest, and touched off a humanitarian crisis.The Saudi Foreign Ministry said \"pre-negotiation\" talks were \"in the expectation of reaching an effective short-term ceasefire to facilitate humanitarian assistance.\"The U.S. State Department said it believed the sides had also discussed protecting civilians.",
        "Talks on any more permanent settlement appear far off. \"We are not for negotiation right now with (RSF chief) General Hemedti,\" Dafallah Alhaj, an envoy to the army chief Burhan, said in South Sudan on Monday.However, analysts have advised caution on the outcome, noting the presence of hardliners in the delegations and recent RSF territorial gains that may dissuade the powerful militia from concessions now.\"Key domestic and international stakeholders are not there like Egypt and the UAE, who are the only ones so far who have proven that they can guarantee a ceasefire,\" said Kholood Khair, director of Confluence Advisory, a Sudanese think-tank.\"That no civilians are present recreates failings of previous political negotiations,\" she said, adding that African states that support civilian rule in Sudan were also not present.United Nations aid chief Martin Griffiths is in Jeddah for the talks to engage on humanitarian issues in Sudan, but is not engaging directly with any of the warring parties, his spokesperson said.The RSF released what it said was a video of Sudanese army soldiers who surrendered. As one of them started to speak, shooting could be heard in the background.An army source said the men shown in the video were from a unit that performed ceremonial music at Khartoum's presidential palace where RSF guards had detained them at the outset of the fighting last month.",
        "Thousands of people are seeking to leave from Port Sudan on boats to Saudi Arabia, paying for expensive commercial flights via Sudan's only working airport, or using evacuation flights.Meanwhile, members of the Beja tribe, which has mobilised in support of the army in the past by closing off Port Sudan, staged a demonstration there pledging allegiance to the military.Conflicts are not new to Sudan, a country that sits at a strategic crossroads between Egypt, Saudi Arabia, Ethiopia and the volatile Sahel region.But most of them occurred in remote areas. This time intense fighting in Khartoum, one of Africa's biggest cities, has made the conflict far more alarming for Sudanese.Since the fighting erupted, the U.N. refugee agency has registered more than 30,000 people crossing into South Sudan, more than 90% of them South Sudanese. The true number is likely much higher, it says. Aid agencies fear the influx will worsen an already dire humanitarian crisis in South Sudan, which won independence from Khartoum in 2011 after decades of civil war.(Reporting by Khalid Abdelaziz Additional reporting by Aidan Lewis and Adam Makary in Cairo, Arshad Mohammed in Washington, Michelle Nichols in New York and Denis Elamu in Juba Writing by Michael Georgy and Angus McDowall; Editing by William Maclean, Mark Heinrich and Matthew Lewis)"
    ]
}