{
    "articleURL": "/news/article-12039645/Texas-gunman-shot-dead-five-people-ELABORATE-death-cult-shrine-bedroom.html",
    "content": [
        "Francisco Oropesa, 38, was linked to the 'Santa Muerte death cult', a source saidA shrine was found in Oropesa's bedroom linking him to the cult that is famously known among Mexico's drug cartel Lit candles imprinted with the cult 'saints' were found three days after the shooting, along with drug offerings and fresh flowersThe Texas gunman who shot dead five people, including a nine-year-old, had an elaborate death cult shrine and links to the criminal underworld.",
        "Francisco Oropesa, 38, opened fire in his neighbors' Cleveland home, about 40 miles north of Houston, on Friday after they asked him to stop firing the gun in his backyard.Oropesa, who is an illegal immigrant from Mexico previously referred to as Oropeza by police, fled the scene as a nationwide manhunt unfolded. An anonymous law enforcement officer working on the case told the Center for Immigration Studies that a shrine honors the 'Santa Muerte death cult' was found in his room following the massacre.The cult is famously known among Mexico's drug cartels, and investigators believe it signifies Oropesa has connections to the criminal underworld, which can help him escape back to Mexico.US Immigration and Customs Enforcement announced Monday that Oropesa had been deported four times since 2009.On Tuesday, sources stated that Oropesa was caught, ending the four-day manhunt. ",
        "Followers of the Santa Muerte cult, who are often drug lords, believe that their 'prayers' will prevent them from being arrested.The shrine found in Oropesa's bedroom sat on top of glass shelving. Candles from the display were still burning from when the gunman opened fire on Friday.The source told the news outlet the candles had 'saints' from the death cult, which often reflect a grim reaper.Multiple statues similar to Catholic patron saints were found along with fresh flowers and several $2 bills. An offering of drugs wrapped in tinfoil was also found, according to the news outlet.",
        "Oropesa appeared to be deeply invested in the cult and even had several tattoos of the 'saints' on his body. One tattoo on his arm showed a skeleton figure with a cloak sitting on a pedestal. Another large tattoo on the inside of his forearm showed what appeared to be a female Aztec, wearing a headdress. The shrine wasn't enough for police to believe Oropesa may be connected to drug crimes but the gunman's tattoos might suggest otherwise, according to the source.",
        "Oropesa allegedly shot the victims after one of them asked him to stop firing off rounds outside his home just before midnight.Police were called to the home before for reports about the firing of guns. It is not illegal to fire guns in your own yard, but it remains unclear why officers did not ask for a permit - which, as a person in the country illegally, he could not have.The victims have been identified as Sonia Argentina Guzman, 25; Daniel Enrique Laso Guzman, 9; Diana Velazquez Alvarado, 21; Julisa Molina Rivera, 31; and Jose Jonathan Casarez, 18.They were all Honduran nationals shot 'from the neck up,' in their home, according to the sheriff of San Jacinto County, Greg Capers.He said two of the victims were found in a bedroom laying over two children in an apparent attempt to shield them.",
        "Capers said there were 10 people in the house, including three children who were not hurt."
    ]
}