{
    "articleURL": "/wires/ap/article-12039233/Starbucks-says-seeing-demand-heat-China-recovers.html",
    "content": [
        "Starbucks posted stronger-than-expected sales in its fiscal second quarter as demand in China began to recover, but the company said that sales growth could moderate as the year progresses.",
        "The Seattle coffee giant said Tuesday that its net revenue jumped 14% in the January-March period to $8.72 billion. That was better than the $8.41 billion Wall Street had forecast, according to analysts polled by FactSet.Same-store sales - or sales at stores open at least a year - rose 11% as traffic picked up in stores. That also beat analysts' forecast of a 7.3% increase.Same-store sales in China were up 3%, reversing a 29% decline the company saw in its October-December period due to a spike in COVID infections. It was the first time Starbucks had seen positive same-store sales in China since 2021.Starbucks Chief Financial Officer Rachel Ruggeri said traffic is strong in the afternoons and on weekends at stores in China. But the company is still uncertain about post-pandemic customer patterns as well as the resumption of international travel to China. Ruggeri said Starbucks expects the pace of weekly sales' improvement to moderate in the second half of this year.\"We´re very encouraged by many of the signs that we see, but there´s a lot that we´re navigating,\" she said on a conference call Tuesday with investors.",
        "In North America, same-store sales climbed 12%, and the company reported more store visits as well as higher spending per visit. The double-digit gain was partly due to comparisons with the same period last year, when sales were impacted by the omicron variant. For the full year, Starbucks expects North American same-store sales increases in the 7-9% range, Ruggeri said.",
        "Starbucks said it opened 464 net new stores during the quarter, including 100 in North America. As part of a larger plan to reinvigorate sales, Starbucks has been closing underperforming locations and replacing them with stores in higher-traffic areas or smaller stores that are focused on pickup or drive-thru business.Starbucks CEO Laxman Narasimhan said the company also continues to introduce new equipment - like hand-held cold foamers - to improve execution and speed. But he said Starbucks must do a better job simplifying its supplies and operations; he noted that the company currently has 1,500 cup and lid combinations around the world.\"Our performance is strong, but our health could be stronger,\" he said. \"There is more work to do in our stores for the demand that we see.\"Starbucks' earnings rose 35% to $908 million. Adjusted for one-time items, the company earned 74 cents per share. That also beat analysts' forecast of 65 cents.Shares in Starbucks fell 5.5% in after-market trading.Tuesday´s earnings report was the first presided over by Narasimhan, who took over as Starbucks´ CEO at the end of March.Narasimhan is a former PepsiCo executive who most recently served as CEO of the U.K.-based health and nutrition company Reckitt. At Starbucks, he succeeded longtime leader Howard Schultz, who came out of retirement last spring to serve as interim CEO while the company searched for a new chief executive."
    ]
}