{
    "articleURL": "/wires/reuters/article-12039665/Family-ex-Bosnian-Serb-leader-sues-US-escape-sanctions-list.html",
    "content": [
        "By Andrew Goudsward",
        "May 2 (Reuters) - Family members of former Bosnian Serb political leader Radovan Karadzic, who was convicted of war crimes for his role in the 1990s Balkan conflict, sued the U.S. Treasury Department on Tuesday over their continued inclusion on a U.S. sanctions list.Karadzic´s wife Ljiljana, son Aleksandar and daughter Sonja said in a complaint in Washington, D.C., federal court that the Treasury Department´s Office of Foreign Assets Control, which administers U.S. sanctions, has unreasonably delayed its decision on whether to lift sanctions against them.A Treasury Department spokesperson did not immediately respond to a request for comment.The trio was sanctioned by the U.S. government in 2003 after being suspected of helping Karadzic evade authorities as he faced indictment by a United Nations tribunal on charges connected to the genocide of Muslims in Bosnia.The family claimed in the lawsuit that they did not help Karadzic avoid arrest.Karadzic was arrested in 2008 and later sentenced to life in prison for his role in the July 1995 Srebrenica massacre of more than 8,000 Muslim men and boys by Bosnian Serb forces.His family said they began petitioning the Treasury Department in 2020 to be removed from a list of sanctioned individuals known as the \"Specially Designated Nationals\" list. Inclusion on the list cost them employment opportunities, prevented them from opening bank accounts and unfairly attached a stigma, according to the lawsuit.",
        "Despite three years of conversations between OFAC and the family´s attorney, the department has yet to make a decision on any of the three requests, according to the complaint.\"It´s unfair for somebody to have to wait so long before getting a decision,\" said the family´s attorney, Peter Robinson.The lawsuit asked the court to order OFAC to decide on their requests within 30 days and seeks attorney fees. (Reporting by Andrew Goudsward in Washington Editing by David Bario and Matthew Lewis)"
    ]
}