{
    "articleURL": "/wires/reuters/article-12052041/King-Charles-Commonwealth-coronation.html",
    "content": [
        "By Michael Holden and Kate Holton",
        "LONDON, May 5 (Reuters) - King Charles will be crowned at Westminster Abbey in a ceremony full of pomp, pageantry and solemn religious significance on Saturday.Below are details about Charles, his role in the Commonwealth and why he has a coronation.CHARLESCharles was born in 1948, the eldest of Queen Elizabeth's four children, ahead of Anne, and brothers Andrew and Edward.Charles, who previously held the title of Prince of Wales, had two children with his first wife Princess Diana: heir-to-the-throne Prince William and younger son Harry who has moved to the United States to live with his wife Meghan.Charles will be crowned alongside his second wife Camilla. The couple have been married for 18 years.CHARLES' ROLE WITHIN THE COMMONWEALTHCharles became monarch of the United Kingdom and 14 other realms on the death of Queen Elizabeth in September last year. Their leaders will attend the coronation.The 14 realms are Antigua and Barbuda, Australia, Bahamas, Belize, Canada, Grenada, Jamaica, New Zealand, Papua New Guinea, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, Solomon Islands and Tuvalu.Barbados ditched the monarchy in 2021. Antigua and Barbuda, Belize, Jamaica and the Bahamas have all expressed an intent to cut ties with the British crown.Charles has acknowledged growing republican sentiment in some Commonwealth nations and said it was for them to decide their constitutional arrangements.",
        "WILL THE CORONATION BE FOLLOWED AROUND THE COMMONWEALTH?The build up to the coronation in Commonwealth countries including Australia and New Zealand appears to be low key.Unlike the death of Queen Elizabeth, when her image was projected onto the sails of the Sydney Opera House, major buildings in Australia will not be lit up to mark the king's coronation.However a fly past will take place in Australia and New Zealand. The Canadian government will hold an official ceremony.WHY IS CHARLES HAVING A CORONATION?A coronation is not essential and no other monarchy across the globe has an event in the same style. But royal historian Alice Hunt said it had persisted as a means to legitimize the monarch in a public way.\"Although the monarch is the monarch from the moment the predecessor has died, the language of the coronation ceremony from since it was locked down in the 14th Century has still articulated that the king or queen somehow changes during that ceremony,\" she said.WHAT IS THE HISTORY OF CORONATIONS?For the best part of a thousand years, the kings and queens of England and Britain have been crowned at London's Westminster Abbey in a ceremony that has changed little throughout the centuries.The coronation of every king and queen of England and Britain has been held at the Abbey since 1066. Two monarchs - Edward V, one of two young princes believed to have been murdered in the Tower of London in the 15th Century, and Edward VIII, who abdicated to marry American divorcee Wallis Simpson - were not crowned. (Reporting by Michael Holden and Kate Holton; Editing by Janet Lawrence)"
    ]
}