{
    "articleURL": "/wires/pa/article-12057581/Dean-Smith-struck-Leicester-players--care-club-survival-battle.html",
    "content": [
        "Leicester boss Dean Smith says his players know it is important to avoid relegation in order to protect their legacy at the club.",
        "The majority of the Foxes squad have been involved in one of the club’s most successful periods over the last few years, with an FA Cup success and back-to-back fifth-placed finishes under Brendan Rodgers.Things have been different this season, with the club firmly embroiled in a relegation fight where they are currently out of the bottom three on goal difference alone ahead of Monday’s visit to Fulham.Smith, who was parachuted in last month on an SOS mission to keep the Foxes up after Rodgers was sacked, has seen that his players care.“It is, that’s the important thing I’ve felt from the players,” he said when asked how crucial it was to protect the players’ recent achievements by staying up.“The care for the club and the need to ensure it remains a Premier League team, not just from us as coaching staff but also from the players, has been really noticeable.",
        "“You can see that in the performances as well.”Leicester have been hamstrung by poor defensive displays, having not kept a clean sheet in 19 games, going back to the 2-0 win at West Ham in the final game before the World Cup break.Smith reckons if they can get that right between now and the end of the season, they will stay up.",
        "“If we keep four clean sheets until the end of the season, we’re safe. I fully believe we’ve got players that can score goals, so we would win some of those games,” he said.Smith brought John Terry with him to the King Power Stadium and says the former England and Chelsea centre-back can play a part in shoring up the defence.He added: “He is someone they listen to because he based his game on being a good defender first and a good footballer second.“He gives little tips he had and talks about the ‘what if’ quite a lot.“As a defender you have to think, ‘What if he does make a mistake’ so you are there to cover him.”"
    ]
}