{
    "articleURL": "/sport/football/article-12046259/FA-turn-Financial-Times-guru-Yasir-Mirza-new-diversity-chief.html",
    "content": [
        "The FA's eight-month search for a new diversity lead is set to come to an end READ: Edleen John quit last year amid claims about her conduct to colleaguesYasir Mirza is highly experienced and is considered to be an expert in the field The Football Association are set to appoint current Financial Times diversity guru Yasir Mirza as the organisation's new anti-discrimination chief.",
        "Mirza will work closely with both mens and women's England senior teams, as well as junior age sides, as their lead diversity and equality advisor.The executive position has taken on major significance at the governing body in recent years given English football's ongoing commitment to improving diversity.Mirza has emerged as the successful candidate of the FA's eight month search, aided by recruitment specialists Perrett Laver, for their next head of equality, diversity and inclusion (EDI).Mizra, who is considered an expert in his field, is currently global head of diversity and inclusion at national newspaper the Financial Times and has held similar roles at BBC Studios, Channel 4 and The Guardian.",
        "He will replace Edleen John, who left the FA last summer following an internal investigation into allegations regarding her conduct towards colleagues - news exclusively disclosed by Mail Sport.John held the role as director of international relations, corporate affairs and co-partner for EDI. But the position Mirza steps into is one with a pure focus on EDI, without responsibility for international relations and corporate affairs.English football has seen a worrying rise in cases of racial abuse towards players in recent years. England players Bukayo Saka, Marcus Rashford and Jadon Sancho were all targeted with social media abuse after missing penalties in the Euro 2020 final.",
        "One of Mirza's immediate focuses will be to liaise with English football's key stakeholders to accelerate the long-awaited Online Harms Bill, which will include stringent laws to prevent social media abuse, through Parliament."
    ]
}