{
    "articleURL": "/news/article-12043511/Brooklyns-iconic-Kelloggs-Diner-served-good-soup-HBOs-Girls-goes-sale.html",
    "content": [
        "Brooklyn's Kellogg's Diner has filed for bankruptcy and is being listed for $2.5MThe business was opened in 1928 and sits at Metropolitan and Union avenuesThe 6,000 sq. foot property was featured in an episode of HBO's 'Girls' Brooklyn's iconic Kellogg's Diner is being sold for $2.5 million after the owner filed for Chapter 7 bankruptcy in January after nearly 100 years in business. ",
        "The Williamsburg institution was once featured in HBO's 'Girls' with a scene of stars Lena Dunham and Adam Driver eating dinner. The restaurant, which will remain open throughout the sale, was widely known for its after-hours service, staying open 24 hours a day. Kellogg's- located at the intersection of Metropolitan and Union avenues - is being sold by MYC &amp; Associates and comes with a full liquor license and a 130 person capacity, according to the listing. ",
        "Court records show the diner has been struggling for several years. In August 2021, Kellogg's owner Irene Siderakis owed creditors an estimated $750,00, ranging from utility bills to legal fees for a federal wage theft lawsuit. The restaurant also owed almost $300,000 in unpaid rent, documents say. Siderakis filed for Chapter 11 bankruptcy later that month. Chapter 11 allows a business to restructure in order to attempt to become profitable.In 2021, the business owner spoke about the struggle the business was facing after the unexpected loss of her husband in 2018. 'I had no idea how to run a diner or if I could,' she told the New York Times. 'I had to make a choice: sell the diner or learn the business on my own and show my boys we can do this and persevere,' she continued. ",
        "In another interview with CBS 2 New York, she said matters were only made worse during the COVID-19 pandemic. A single mother to four boys, the mom said more than just her business became a concern when she herself caught the coronavirus.  'Another fear that came inside the boys that, \"Oh no, we might be losing mom, too.\" It was horrible,' Siderakis said in 2020. The owner tried everything from comedy shows to community events to a GoFundMe that raised $100,000 but made a mere dent in the issues.",
        "One of the diner's biggest claims to fame is its feature in season eight of Lena Dunham's 'Girls' in an episode that later spawned the 'Good Soup' meme. The line, read by the now A-Lister Adam Driver - also went on to become a massive TikTok sound with millions of users recreating the scene filmed inside the diner. The diner is now being listed by MYC &amp; Associates and the listing states the historic restaurant averages $3.5 million in annual sales.Throughout its storied history, the diner has also seen everything from celebrity photo shoots to a police officer driving into it to a fire burning the original building to the ground. 'It has been here since 1928. It should never be closed down, ever,' she said. ",
        "'To me it’s a neighborhood landmark,' Joe Weisbord, who is known as the neighborhood's mayor, told the New York Post. 'I hope there’s a buyer out there that thinks so too.'"
    ]
}