{
    "articleURL": "/wires/reuters/article-12039575/Cycling-UCI-defends-transgender-policy-Killips-victory.html",
    "content": [
        "May 2 (Reuters) - Cycling's governing body the UCI has defended its policy on transgender athletes competing in female events after American Austin Killips fuelled the debate by winning the Tour of the Gila in New Mexico on Sunday.",
        "The 27-year-old Killips won the fifth and final stage of the race to become the first transgender cyclist to triumph in an official UCI stage race.Unlike some international sporting bodies such as World Athletics, the UCI allows transgender riders to compete in women's races, prompting criticism from the likes of American former Olympian Inga Thompson who said the decision was \"effectively killing off women's cycling\".Thompson referred on Twitter to a survey last year by a leading riders' union which showed that over 90% of professional women´s cyclists opposed racing against transgender athletes but she said their voices were not being heard.The Telegraph reported that the Cyclistes Professionnels Associes (CPA), which represents men's and women's riders, had conducted the survey of its female members before making representations on the subject to the UCI.In a statement on Tuesday the UCI said: \"The UCI acknowledges that transgender athletes may wish to compete in accordance with their gender identity.\"The UCI rules are based on the latest scientific knowledge and have been applied in a consistent manner. The UCI continues to follow the evolution of scientific findings and may change its rules in the future as scientific knowledge evolves.\"The UCI toughened its rules for transgender women to compete in its events last year, halving the maximum permitted plasma testosterone level to 2.5 nanomoles per litre and doubling the transition period to 24 months.",
        "Killips, who began racing in 2019, said on Monday that she had been the subject of a \"week of nonsense\" on the internet.\"I love my peers and competitors and am grateful for every opportunity I get to learn and grow as a person and athlete on course together,\" she said on Instagram.British Cycling changed its rules last year to ban transgender women from elite races, pending a full review. (Reporting by Martyn Herman; Editing by Ken Ferris)"
    ]
}