{
    "articleURL": "/wires/reuters/article-12045341/Mariners-rally-late-post-five-run-10th-sink-Athletics.html",
    "content": [
        "Eugenio Suarez hit a tiebreaking, three-run homer with two outs in the top of the 10th inning as the Seattle Mariners defeated the host Oakland Athletics 7-2 Wednesday night in a game that was delayed an hour and five minutes at the outset by rain.",
        "Seattle's AJ Pollock tied the score at 2-2 with a solo shot to center field with one out in the ninth off Zach Jackson.Suarez went deep to right-center off Adam Oller (1-1), scoring ghost runner Jose Caballero and Julio Rodriguez, who led off the inning with a walk. Teoscar Hernandez followed Suarez with a double to left, Cal Raleigh and Pollock walked to load the bases and J.P. Crawford lined a two-run single to right to cap the five-run inning.Matt Brash (3-2) pitched 1 2/3 innings of scoreless relief to earn the victory, Seattle's third in a row.A's left-hander JP Sears pitched six scoreless innings but was unable to earn the first victory by an Oakland starter this season. Sears allowed four hits, walked two and struck out seven.The A's, who have lost seven of their last eight, broke a scoreless tie in the sixth. Ryan Noda drew a leadoff walk against right-hander Logan Gilbert and advanced on Nick Allen's sacrifice bunt. Esteury Ruiz lined a run-scoring double to left field on the next pitch. Ruiz stole third and scored on Tony Kemp's double to right.Gilbert went six innings, allowing two runs on three hits. He walked two and fanned six.The Mariners threatened to score in the third and fifth innings, but Sears emerged unscathed.",
        "Crawford led off the third and reached on an error. Crawford took third on Caballero's single to left (with Caballero taking second on the throw). Sears responded by striking out both Rodriguez and Ty France before getting Jarred Kelenic to fly out to right-center.In the fifth, Crawford drew a leadoff walk and Caballero singled to left. Sears got Rodriguez to pop out to first and France to ground into an inning-ending double play.The Mariners finally broke through against reliever Domingo Acevedo in the seventh. With one out, Pollock doubled to left. After Crawford grounded out, Caballero lined a run-scoring single to center, his third hit of the night.Kelenic was ejected by home-plate umpire Nestor Ceja after striking out leading off the sixth inning."
    ]
}