{
    "articleURL": "/femail/article-12047249/Im-private-chef-heres-2-000-pizza-celebrity-client.html",
    "content": [
        "Beverly Hills celebrity cook Chef Bae has been slammed as 'tone deaf' The private chef shared footage of herself making a $2,000 pizzaMany viewers criticized her, claiming the pizza was more than their 'rent' A private chef in Beverly Hills has sparked fierce backlash after she showcased a $2,000 pizza complete with gold flakes and caviar, prompting social media users to slam the elite cook as 'tone deaf' for boasting about lavish meals while families across the country go hungry due to the soaring costs of inflation. ",
        "Brooke Baevsky, a celebrity chef in Los Angeles, went viral after detailing her day-to-day routine as an elite chef in California's heart of luxury, which sees her whipping up dozens of delicious meals and going grocery shopping at the famously expensive market known as Erewhon. And while her viewers tend to get a kick with what it's really like to work for celebrity clients, Brooke or Chef Bae as she's known on social media, recently caused quite the stir online when she shared footage of herself making a pizza with a very expensive price tag.The clip of the pricey pizza - which she revealed was an appetizer - received over 4.5 million views and was met with many comments slamming Chef Bae for being insensitive towards those who are struggling to make ends meet. ",
        "Chef Bae took viewers with her to Erewhon, the grocery store known for its celebrity customers and high-end organic items. Erewhon is known to be one of the most luxurious grocery stores in all of California that contains high-priced, locally produced and organic items. The most elite celebrities shop at the grocery store including Kourtney Kardashian, Hailey Bieber, Miley Cyrus, and Kaia Gerber. Chef Bae has posted several videos that see her shopping at the upscale grocery store, showing herself opting for $33 nuts, and a cart full of what many would call 'basic' items. ",
        "She filled her shopping cart to the brim, grabbing two $30 water bottles, $7 figs, 'the entire line of' $53 mushroom powder, and $35 balsamic vinegar, along with other luxury goods. Filming herself checking out, she left viewers jaw-dropped when she revealed her total came out to $944. In addition to her costly Erewhon haul, the chef also boasted about $200 honey she overnight shipped from New Zealand and $200 caviar from the brand Caviar Mermaid, who is known for its 'fresh river' caviar. 'I then get started on my pizza dough with beauty powder, collagen powder, Erewhon flours, Erewhon olive oil, Erewhon $30 water, and I give it a mix and give it a need and let it sit for about 30 minutes,' she said as she prepared her pizza dough. ",
        "After creating the dough, she topped it with superfood pesto, almond milk ricotta, and some tomatoes. After baking the pie, she adds even more gold-filled pesto.  She said the total cost of her pie came out to $1,394.48, however, she didn't include the price of the 24K gold flakes she topped her pizza with, which can range anywhere from $20 to $300. And while she said her celebrity client - whom she did not reveal the name of - 'drooled' over the pizza that was topped with green pesto and gold flakes, her followers couldn't help but notice how the pie was 'more than [their] rent.' ",
        "One person said: 'No shade to your job, but all I can think of is how many homeless people could be fed for the cost of a pizza!''I’m a teacher and I eat ramen noodles because I can’t afford groceries until payday. But slay,' another person added. Someone else wrote: 'This makes me think about how many kids go hungry at night in our country and there are others living like this.' 'It’s wild to me to think about how some people can’t afford water and food but then some can afford $2k pizza,' commented another person. Another user added: 'I appreciate your job and all but why do people spend so much on groceries, filtered tap water would make that dough just as good.' ",
        "'Never in my life would I say I want a $2,000 pizza appetizer….no matter how much money I have. This is wild to me lol,' commented one user. Someone else wrote: 'Crazy that some people don’t have money to live, and others are paying people to put gold flakes on their pizza.' Another person commented: 'This is so sad. So many people are starving but hey, let’s make a $2k pizza with gold flakes. $2k could’ve fed a homeless shelter.''This is so unnecessary and says a lot about the celeb. I also work for celebs as a chef, and they are definitely not extra like this,' one user added.",
        "'This is so tone deaf lol,' said someone else. Although inflation has decreased in the past few months, it still remains high and sits at 7.1 per cent.According to consumer data firm Dunnhumby, one-third of households are skipping meals or reducing their portion sizes to save money. ",
        "Researchers found that 18 per cent of survey's 2,000 participants noted they weren't getting enough food to eat. Furthermore, 31 per cent of households have reduced their portion sizes due to empty pantries as a result of rising grocery store prices.In addition to food costs, millions of people across the country lack a financial safety net. According to researchers, 64 per cent of participants admitted they wouldn't be able to raise $400 in an emergency. Many have suffered due to inflation, which has caused the prices of basic goods to skyrocket - including the prices of meat and poultry up by 10.4 per cent, cereal up 15.1 per cent, and fruits and vegetables up 8.1 per cent.Gas prices are another point of pressure for many people around the country, up nearly 60 per cent over the past year, with the cost of airfares up more than 34 per cent and the price of used cars up more than 7 per cent.Apparel costs are up by 5.2 per cent, overall shelter costs went up 5.5 per cent and delivery services have gone up 14.4 per cent. "
    ]
}