{
    "articleURL": "/sport/cricket/article-12039671/National-anthem-sung-Saturdays-cricket-fixtures-mark-coronation-King-Charles.html",
    "content": [
        "Anthem will be introduced to spectators over the tannoy systems at groundsPlayed at County Championship and Rachael Heyhoe Flint Trophy fixturesThe coronation emblem will be displayed on big screens during this period The national anthem will be sung before each of this Saturday's domestic cricket fixtures to mark the coronation of King Charles III - but there will be no suspensions in play.",
        "Cricket marked the accession of his majesty last September when England's Oval Test versus South Africa became the first major sporting event in this country since 1952 to incorporate God Save The King into its proceedings.Laura Wright led a moving rendition before the resumption of the third and final match of the series, after the sport's governing body cancelled the second day's play following the passing of Queen Elizabeth II.And it will be a pre-play feature of seven County Championship fixtures plus three Rachael Heyhoe Flint Trophy games this weekend, following government advice to the England and Wales Cricket Board.The anthem will be introduced to spectators over the tannoy systems of the respective grounds and played with both teams and officials present on the field. The coronation emblem will be displayed on big screens during this period.",
        "The Championship matches are scheduled to resume day three on time at 11am, despite a direct clash with the beginning of the coronation's ceremony at Westminster Abbey. The women's games, which start at 10.30am, will continue without pauses.As no breaks in play were instructed in the official guidance passed to the 18 first-class counties indirectly from the Department for Digital, Culture, Media and Sport via the ECB, none will be taken.",
        "Eight months ago, the Kia Oval hosted an impeccably kept minute's silence in a touching tribute to the Queen, broken only by a one-bell chime from a member of the Irish Guards.The players were then given a military guard of honour as they walked onto the field for God Save The King and the national anthem of South Africa."
    ]
}