{
    "articleURL": "/tvshowbiz/article-12051907/Ne-Yo-asks-court-establish-paternity-joint-custody-two-young-sons-ex-girlfriend.html",
    "content": [
        "The singer Ne-Yo is looking to make his new family with his ex-girlfriend Sade official.",
        "The 43-year-old hit-making songwriter has asked a court to officially establish parentage for his two young sons Braiden and Brixton, according to legal documents obtained by TMZ.He shares Braiden — who was born in 2021 — and Brixton — who cam along in February of this year — with his ex-girlfriend Sade (not to be confused with the singer).Ne-Yo (born Shaffer Smith) also wants the court to grant him joint legal and physical custody of the boys.His family with Sade appears to have been the deciding factor in the collapse of his marriage to Crystal Renay Williams.",
        "She filed for divorce in the summer of 2022 claiming that he had fathered a child outside of their marriage, which appears to be Braiden, and they subsequently finalized their divorce in January of this year.According to the publication, Ne-Yo hopes his youngest children will be able to inherit from him in the event of his death just like his other children born from his former marriage.The exes shared sons Shaffer, seven, and Roman, four, along with a daughter, Isabella, who will turn two in June.He also shares two children with his earlier ex-girlfriend Monyetta Shaw: Madilyn, 12, and Mason, 11. Although Ne-Yo still makes regular appearances in Instagram Stories posts from his latest ex Sade, he clarified to TMZ late last month that they were just friends.",
        "He confirmed that he was dating around, but he wasn't exclusively attached to Sade and he was 'enjoying the single life.' The terms of his recent divorce reportedly stipulate that he will retain three of the four homes that he and Crystal owned, while she will get the other house.But in order to keep things relatively even between the two, he also agreed to pay a $1.6 million lump sum to her. ",
        "In addition to the Georgia home, she was also given $20,000 to cover her moving expenses, though it wasn't clear if she would be moving from one of the four houses to another, or to a separate property.TMZ reported that Ne-Yo would be retaining the couple's 2022 Bentley Bentayga, but he would make it up to his ex-wife by paying her an additional $150,000 to find her own vehicle.She will be receiving $12,000 per month in child support, while the hitmaker will be on the hook for their three children's tuition expenses.Crystal will receive $5,000 per month in alimony, but only for the first three years after their divorce."
    ]
}