{
    "articleURL": "/sport/football/article-12043745/Lee-Westwood-Sergio-Garcia-Ian-Poulter-RESIGN-memberships-DP-World-Tour.html",
    "content": [
        "Trio resign membership in face of severe sanctions upheld by arbitration hearingEnds any faint hopes they might have had of making this year's Ryder CupAnother significant marking post in sport fractured by Saudi-backed LIV Tour Lee Westwood, Sergio Garcia and Ian Poulter have resigned their membership of the DP World Tour in the face of severe sanctions handed down for joining the LIV series.",
        "The trio’s decisions, which formally cements their ineligibility for the Ryder Cup, were confirmed on Wednesday and follows their loss in a key arbitration hearing between the European circuit and the LIV defectors in April.Mail Sport revealed last week that as a consequence of that verdict, the rebels are potentially facing huge fines, with the DP World Tour set to issue retrospective sanctions on a sliding scale of £100,000 and down for each of the LIV tournaments they contested without permission.Westwood, Poulter, Garcia and English veteran Richard Bland, who also resigned, have so far played in all 13 LIV events, so could be on the end of drastic cumulative punishments when the sanctions are finalised. Greg Norman has previously said the Saudi-backed start-up will pay all legal fees.",
        "The DP World Tour said in a statement: ‘(We) would like to take this opportunity to thank the four players for the contribution they have made to the Tour and in particular to Sergio, Ian and Lee for the significant part they have played in Europe’s success in the Ryder Cup over many years. ‘Their resignations, however, along with the sanctions imposed upon them, are a consequence of their own choices. ‘As we have consistently maintained throughout the past year, the Tour has a responsibility to its entire membership to administer the member regulations which each player signs up to. These regulations are in place to protect the collective interests of all DP World Tour members.",
        "‘The independent panel appointed by Sport Resolutions recognised this, determining that our conflicting tournament regulation and its application in the circumstances did not go beyond what was necessary and proportionate to the Tour’s continued operation as a professional golf tour and that we have a legitimate interest in protecting the rights of our full membership by enforcing it.’The Tour said a further update on other sanctioned members would be made on Thursday."
    ]
}