{
    "articleURL": "/wires/reuters/article-12048311/Lyft-beats-quarterly-estimates-price-cuts-pay-forecast-disappoints.html",
    "content": [
        "Lyft beats Q1 core profit, revenue expectations",
        "Sees Q2 adj profit, revenue below estimatesCEO Risher expects $330 mln a year savings from cost cutsBy Akash SriramMay 4 (Reuters) - Lyft Inc's first-quarter revenue and core profit topped estimates on Thursday, benefiting from a strong ride-share demand and its move to cut prices to match larger rival Uber, but it forecast second quarter below expectations.The results follow job cuts by Lyft, which is trying to turn around its business under new CEO David Risher who took charge last month.Risher said Lyft should be a \"strong second player\" in the North American rideshare market by the end of the year and expected to save about $330 million a year from cost cuts.\"We've seen really nice growth, our share is now north of 30% and earlier this year it was sort of in the mid-to-high 20s,\" he said in an interview to Reuters.Lyft added 10% more riders to its platform in the first three months of 2023 as its strategy to cut prices paid off.Revenue rose 14% to $1 billion and beat estimates of $981.4 million, but lagged the 72% surge posted by Uber's ride-sharing business.As a dominant player in key global markets, Uber has been making the most of this year's rebound in travel demand from pandemic-induced lull.",
        "Lyft's adjusted core earnings of $22.7 million also exceeded expectations of $12 million, according to Refinitiv data, despite a 13.2% rise in costs to $1.22 billion from a year ago.But its revenue as well as core earnings forecast for the current quarter was below market expectations.The company said it expected revenue of $1 billion to $1.02 billion, below estimates of $1.08 billion and core earnings of $20 million to $30 million, way behind expectations of $49.3 million.On whether Lyft was being conservative with the outlook, Risher said, \"when I say something I really want to have conviction that we're going to deliver.\" (Reporting by Akash Sriram in Bengaluru; Editing by Arun Koyyur)"
    ]
}