{
    "articleURL": "/wires/aap/article-12057839/Lions-defensive-truck-Payne-getting-started.html",
    "content": [
        "Brisbane star Harris Andrews is excited by the future of the Lions' new \"truck\" Jack Payne following the key defender's stunning shutdown job on Carlton star Charlie Curnow.",
        "The 23-year-old's role on Curnow - who was coming off an ominous nine-goal haul against West Coast - was vital in the Lions' 26-point triumph over the Blues on Friday night.Andrews, a dual All-Australian fullback, was also among Brisbane's best in their fourth-straight win as he dominated his duel with Blues spearhead Harry McKay.The Lions co-captain relishes lining up alongside Payne, who managed just 27 games in his first four seasons after being drafted in 2017.\"It's funny what happens when you do get a bit of an extended run at it,\" Andrews told AAP after the Lions' round-eight win.\"He's played 35 games now, but he's a truck, he's big boy.\"He probably looks a little bit older than he actually is, he's only 23 years of age so he's still young in his football career.\"I still remember I was running around like a headless chook after 30-odd games, but he's just going to continue to build and it makes my job a lot easier having that support in the air.\"Payne's emergence has been a massive boost for the Lions, who were shattered by the loss of hulking key defender Marcus Adam through prolonged concussion.But Payne, who stands 197cm and weighs 101kg, had been building towards taking down Curnow, the reigning Coleman medallist.",
        "\"He's had some big games in the last few weeks, (GWS forward) Jesse Hogan, (Fremantle) Jye Amiss,\" Andrews said.\"He's a really quiet achiever, but we know when you get out there with him, we know what we're going to get from him and that's really important as a key defender.\"Lions coach Chris Fagan was pleased Payne had taken his opportunity.\"It's important for us that someone stood up and he looks like he could become one of the really good defenders in the competition,\" Fagan said on Friday night.\"He's got a long way to go in his career but all the signs are good at the moment.\""
    ]
}