{
    "articleURL": "/tvshowbiz/article-12053691/Gogglebox-stars-left-feeling-sick-disgusting-drinking-trial-Dean-Gaffney-Joe-Swash.html",
    "content": [
        "Gogglebox stars were repulsed by one of the most disgusting I'm A Celebrity trials ever during Friday's episode.",
        "As cast members including Ellie and Izzi Warner and Dave and Shirley tuned into the challenge involving Joe Swash and Dean Gaffney, they were left feeling sick.Joe and Dean were required to drink a plethora of horrific drinks to win treats for their campmates before they made their late arrival into the camp in South Africa.Their trial included everything from cow's vagina to blended maggots and the men, who are known for their strong reactions to challenges, repeatedly gagged and struggled to keep the concoctions down.The vile scenes also affected Gogglebox viewers, leaving many feeling nauseous and they took to Twitter to express their feelings. ",
        "One person wrote: 'OMDS That is pure disgusting that vomiting' while someone else said: 'Watching these 2 vomit is worse than the actual food they are consuming.'Another penned: 'Bad time to watch this while I'm eating' and a separate person said: 'omg dean and joe drinking that lol... that is vile!'Someone else said: 'I cannot watch other people vomiting or heaving- it makes me feel sick' as they shared a Friends meme of character Phoebe saying: 'Oh my eyes, my eyes!'Another person was seriously unimpressed by the scenes, writing: 'I only ever see reality tv on #Gogglebox.'I cannot believe anyone seriously watches tripe like I'm A Celebrity. People drinking vile things and vomiting. This is entertaining is it?'",
        "And a separate viewer penned: 'Oh god I KNEW they'd show the Gaffney vomming clip.'It comes after I'm A Celebrity South Africa viewers kicked off on Friday night as the show ended on a dramatic cliffhanger ahead of a double elimination.The latest instalment wrapped up during a tense trial in which yellow pride's Jordan Banjo and Myleene Klass and green pride's Andy Whyment and Georgia Toffolo battled for their place in camp.",
        "The group were going head-to-head in the gold mine trial, with the winners earning a luxury picnic, while the losing pair would be sent home.However, just as things began to heat up with the competition closely fought, the show abruptly ended, with the result not being announced until Monday.And viewers were far from impressed with the 'cruel' twist as they took to Twitter to vent their fury, with one even asking: 'What are you playing at?!' 'Making us wait till Monday?!' fumed one person, while another questioned: 'What you mean NEXT TIME ???!'"
    ]
}