{
    "articleURL": "/wires/aap/article-12052779/Dragons-latest-loss-turn-worse-Nightingale.html",
    "content": [
        "Club legend Jason Nightingale believes St George Illawarra's latest loss marked a turning point for the struggling club and sets the stage for a vital clash with the last-placed Wests Tigers in Magic Round.",
        "The Dragons lost their three games prior to last Sunday by a converted try or less and had been well in the contest on each occasion.On the back of a gutsy Anzac Day performance that had them on the cusp of upsetting the Sydney Roosters, the Dragons were tipped to return to the winner's circle against injury-ravaged Canterbury in round nine.But the joint venture found themselves ambushed at home in Wollongong as the Bulldogs established a 10-4 half-time buffer that the Dragons reduced but never overcame.Nightingale, a member of the Dragons' 2010 premiership-winning team, said the most recent game of the losing streak would have hit his old firm the hardest.\"There was disappointment with every one of those losses but you could be pretty proud up until last week,\" he told AAP.\"Although they've all been close losses when they start mounting up it gets more worrying.\"The turning point was probably last week. They were probably expected to beat the Bulldogs and they would've expected better of themselves at home.\"Sunday's clash against the last-placed Tigers looms as crucial for under-fire coach Anthony Griffin, who has already been told he will need to reapply for his job beyond this season.Despite the Tigers' lowly ladder standing, victory is far from assured for the Dragons as Wests waged an almighty upset against reigning premiers Penrith last week to lodge their first win of the season.",
        "Dragons captain Ben Hunt conceded the match was a must-win for his side.\"It's really crucial,\" he said.\"We've lost four in a row now and they've all been four games that we've been very close to winning.\"This is the one that we've got to crack it.\"Centre Zac Lomax was thoroughly beaten by opposite man Jake Averillo in the loss to Canterbury and has been dropped in favour of Max Feagai.Changes to Lomax's goal-kicking style have yielded underwhelming results and cost the Dragons in their losing streak with the Saints scoring the same number of tries or more than their opposition in each of their last four games.\"It's the culmination of what happens after loss on loss on loss,\" Nightingale said of the selection change.Hunt said his teammate would be hurting after being overlooked for the Tigers game.\"It is hard to take,\" he said.\"We've all been there. Most players have been dropped. I've played State of Origin and been dropped in the same year back to Cup. It's something that can happen to anyone.\"You've just got to get on with it, get back to working hard and I guess working on your craft and playing some good footy.\""
    ]
}