{
    "articleURL": "/wires/aap/article-12038613/McLachlan-Tassie-19th-AFL-licence.html",
    "content": [
        "Tasmania has claimed its \"rightful\" place in the AFL after a battle for recognition spanning decades.",
        "The island state was on Wednesday granted a 19th licence by the league, with a men's team slated to join in 2028 and the timeline for a women's side to be worked out.The most recent bid, which started in earnest four years ago, got across the line at the weekend with the finalisation of funding for a new Hobart stadium - the final sticking point.AFL CEO Gillon McLachlan said Tasmania belongs in the AFL and AFLW and as part of the national football conversation.\"There have been urges and pushes and discussions for decades. It's probably overdue, but (comes) at the right time as well,\" he said at North Hobart Oval.Tasmanian Premier Jeremy Rockliff said it was a historic day for the state.\"Our time has finally come. We have our right to be represented in the national competition,\" he said.\"This has been a hard fight ... by many Tasmanians over a number of generations.\"After more than a century, the AFL will finally be complete and recognised as a truly national competition.\"For everyone who has backed us and believed - thank you for sticking with us.\"Tasmania will be the first expansion team since the Giants were awarded a licence in 2010 and entered the AFL in 2012.",
        "Unlike the most recent expansion efforts in western Sydney and the Gold Coast, the team will be born into an Australian Rules football heartland.Tasmania has produced four Australian Football Hall of Fame legends, Ian Stewart, Peter Hudson, Darrel Baldock and Royce Hart, as well as contemporary stars including Matthew Richardson and Nick Riewoldt.McLachlan said the Devils \"made sense\" as the team's mascot, but the question would be put to the community.There is speculation the name would breach a commercial copyright. However, McLachlan said the issue could be worked through.He said Tasmania would likely enter the VFL in about 2025 as a precursor to its AFL start.Hobart-born Richmond Tigers veteran Nick Riewoldt, who was at the announcement, said the state deserved the licence.\"It's a big day for the state and the next generation of boys and girls who don't have to travel across Bass Strait to play AFL and AFLW,\" he said.\"It is the most historic day in Tasmanian football. That will only be superseded by the day the Tasmanian football club wins its first premiership.\"McLachlan and Rockliff said it was planned the new $715 million stadium at Macquarie Point on Hobart's waterfront would feature a roof, but the design hadn't been finalised.The stadium has proven divisive and was opposed by the state Labor opposition, the Greens and Tasmanian federal Liberal and independent MPs.",
        "The state government will contribute $12 million per year over 12 years towards a team, plus $60 million for a high-performance centre.It will spend $375 million on the 23,000-seat stadium, which has been criticised as a waste of money amid a housing and health crisis.The federal government announced on Saturday it would contribute $240 million, while the AFL is chipping in $15 million.The licence was unanimously backed by the 18 existing club presidents on Tuesday and promptly signed off on by the league commission.Tasmania launched a bid in 1994 featuring a 30,000-seat stadium in Hobart's northern suburbs, as well as another in 2008 which had the backing of confectionary giant Mars."
    ]
}