{
    "articleURL": "/wires/reuters/article-12050421/Google-Sonos-head-trial-contentious-smart-speaker-patent-fight.html",
    "content": [
        "By Blake Brittain",
        "May 5 (Reuters) - Sonos Inc and Alphabet's Google LLC will face off in a San Francisco federal trial on Monday over claims that Google copied Sonos' patented smart-speaker technology in wireless audio devices like Google Home and Chromecast Audio.The case is part of a sprawling intellectual property dispute between the former business partners that includes other lawsuits in the U.S., Canada, France, Germany and the Netherlands.Sonos has asked the court for $90 million in damages from Google in the San Francisco case, down from $3 billion after U.S. District Judge William Alsup narrowed the case, according to a Google court filing. Sonos alleges Google infringed two of its patents related to multi-room wireless audio.Google spokesperson Jose Castaneda said the case relates to \"some very specific features that are not commonly used,\" and that Sonos \"mischaracterized our partnership and technology.\"Sonos declined to comment on the dispute.The companies previously worked together to integrate Google's streaming music service into Sonos products. Sonos first sued Google for patent infringement in Los Angeles and at the U.S. International Trade Commission in 2020, accusing the tech giant of copying its technology during their collaboration.Sonos won a limited import ban on some Google devices from the ITC last year, which Google has appealed. Google has countered with its own patent lawsuits in California and at the ITC.",
        "Alsup has had sharp words for both companies. Last month, he called their attacks on one another's expert testimony \"emblematic of the worst of patent litigation\" with \"much ink spilled for little purpose.\"In a 2020 order, he cited the \"enormous\" resources already expended on the dispute.\"By the end, our parties' legal bills will likely have been able to build dozens of schools, pay all the teachers, and provide hot lunches to the children,\" the judge wrote. (Reporting by Blake Brittain in Washington Editing by David Bario and Josie Kao)"
    ]
}