{
    "articleURL": "/news/article-12060793/Hollywood-writers-strike-hits-Game-Thrones-Stranger-Things-new-Blade-movie.html",
    "content": [
        "Game of Thrones writer George R.R. Martin announced that the writer's room on spin-off series A Knight of the Seven Kingdoms: The Hedge Knight has closedThousands of film and TV writers have hit the picket lines since May 2Analysts are warning that the walkout could last three months or more A Game of Thrones spin-off and Netflix's Stranger Things are among the latest shows which have had to halt production as the Hollywood writers' strike heads into its second week. ",
        "Marvel's movie Blade, which is due out in 2024, and Apple TV+ show Severance have also had to wrap early as the walkout begins to hurt Hollywood productions. Thousands of film and TV writers have hit the picket lines after the Writers Guild of America called its first strike in 16 years.  America's most popular late-night comedy shows were shut down and aired re-runs last week, and the strike is now affecting planned TV shows and movies. The last strike lasted 100 days, beginning in 2007 and ending in 2008, and analysts are now predicting this walkout could also last three months or more. ",
        "An estimated 11,500 members have downed tools since midnight on May 2 after talks with the Alliance of Motion Picture and Television Producers over pay fell apart.At the center of the row is the rise of streaming - with the guild claiming that even as budgets have increased, writers' share of that cash has consistently shrunk.Earlier today, Game of Thrones writer George R.R. Martin announced that the writer's room on spin-off series A Knight of the Seven Kingdoms: The Hedge Knight would be closing for the foreseeable.   The creator of the Game of Thrones universe pledged his full support for the strikers, writing on his blog: 'I am not in LA, so I cannot walk a picket line as I did in 1988, but I want to go on the record with my full and complete and unequivocal support of my Guild.'",
        "'There are pickets in front of every studio lot and sound stage in LA, and many in other cities as well. Get used to them. I expect they will be there for a long time,' he said. He added that filming would continue on the Game of Thrones prequel House of the Dragon, which started in the UK on April 11.  The show is the latest in a growing list of series impacted by the walkout. The creators of Netflix smash hit Stranger Things confirmed on the weekend that production on season five has been delayed.Creators Matt and Ross Duffer, both 39, known as the Duffer Brothers, took to Twitter on Saturday to break the news to fans.They wrote: 'Writing does not stop when filming begins. While we're excited to start production with our amazing cast and crew, it is not possible during this strike.We hope a fair deal is reached soon so we can all get back to work. Until then -- over and out.'While the fifth and final season of the sci-fi horror was announced last February, a release date has not been set.",
        "On Monday, Apple’s drama series Severance paused production of its second season after members of the International Alliance of Theatrical Stage Employees (IATSE) and Teamsters refused to cross the WGA picket line at York Studios in New York.",
        "It comes after fellow Apple series Loot, which stars Maya Rudolph, paused filming last week in Los Angeles. Marvel also closed production on vampire thriller Blade, which was due to begin shooting in Atlanta next month. The feature film, which stars Mahershala Ali, was also paused once before and is expected to restart when the strike ends.   According to data from the Milken Institute, the last strike in 2007 cost the industry $2.1 billion. It also had a major economic impact on ancillary businesses such as construction companies and restaurants. According to the New York Times, the current strike could last more than three months.   This time, writers are also worried about how artificial intelligence could encroach on writers’ credits and compensation.'Any hope that this would be fast has faded,' Tara Kole, a founding partner of JSSK, an entertainment law firm that counts Emma Stone, Adam McKay and Halle Berry as clients, told the outlet. 'I hate to say it, but it’s going to be a while.'It also had major economic repercussions for ancillary businesses like hotels, restaurants and construction companies that often work with film and television productions Striking Writers Guild of America members have received support from celebrities such as Drew Barrymore, who pulled out of her hosting duties at the MTV Movie and TV Awards, and Pete Davidson, who passed out pizzas on Friday to those walking the picket line in New York.",
        "Sex and the City star Cynthia Nixon also joined the picket line outside Netflix's office in Manhattan last week.",
        "'I stand with the WGA and visited the NYC picket line today organized by @wgaeast. Without writers there would be no tv or film—they deserve a fair contract now!,' she wrote on social media. She also shared a video clip telling an interviewer, 'A writer is everything to a show.'Nixon added that 'everything starts with a writer's idea' and noted that television was 'completely writer focused', but the contribution of writers was not reflected in the sharing of the profits.It comes as HBO, Disney and other studios are accused of 'union busting' after demanding show runners return to work during writers strike.Several show runners - the executives with creative control over a program - say they have received letters from Warner Bros/Discovery owned HBO, Disney, and Paramount owned CBS requiring them to fulfill their non-writing obligations.Deadline received copies of letters sent to show runners.'If you are a WGA member, HBO/HBO Max respects your membership in the WGA, and we will not do anything to place you in jeopardy of WGA rules,' read a May 2 letter from the network.'However, we believe certain services, such as participating in the cast process and/or contributing to non-writing production, and post-production work are clear examples of non-WGA required services that should continue to be rendered during this time,' the letter stated. "
    ]
}