{
    "articleURL": "/wires/reuters/article-12047275/Kroger-pay-68-mln-settle-West-Virginia-opioid-claims.html",
    "content": [
        "By Brendan Pierson",
        "May 4 (Reuters) - The Kroger Co has agreed to pay West Virginia $68 million to settle claims that it fueled the opioid epidemic through lax oversight of its pill sales, bringing the state's years-long litigation over the opioid crisis to a close.The deal, announced Thursday by West Virginia Attorney General Patrick Morrisey, comes a month before the grocery store had been set to go to trial against the state. All other companies sued by the state over opioids had already settled.\"This is an important day for West Virginia,\" Morrisey said. \"This is a day of healing.\"Morrisey also touted the state's framework for spending the funds on fighting the opioid epidemic, in which 72.5 percent will go to a newly created foundation, overseen by a board chosen by the governor and by local governments. Most of the remainder will go to local governments.He said the framework would ensure that the money is spent well and does not disappear into a \"black hole.\"A Kroger spokesperson said in an email that the company believes the lawsuit is without merit, but that the settlement was the \"best path forward to resolve this litigation.\"West Virginia, which has opted out of nationwide opioid settlements totaling more than $50 billion in order to pursue cases on its own, has now secured approximately $1 billion from drugmakers, distributors and pharmacies, Morrisey said, a larger amount per capita than any other state.",
        "West Virginia had the highest drug overdose death rate of any state in 2021, according to the U.S. Centers for Disease Control and Prevention.Thousands of lawsuits have been filed by states, local governments and Native American tribes over opioids, accusing drug companies of downplaying opioids' risks and distributors and pharmacies of ignoring red flags that they were being trafficked illegally. (Reporting by Brendan Pierson in New York, Editing by Rosalba O'Brien, Alexia Garamfalvi, Aurora Ellis)"
    ]
}