{
    "articleURL": "/wires/ap/article-12060637/20-bodies-Congo-mass-grave-ADF-rebels-suspected.html",
    "content": [
        "BENI, Congo (AP) - The remains of at least 20 people were found buried in a mass grave in an area used to cultivate cacao in Ndoma village in Congo's North Kivu province this weekend, according to local authorities and a military spokesperson.",
        "A team of forensic and security officers exhumed the bodies after residents of villages in Beni territory found bones and clothing and alerted officials.Until earlier this year, the area had been under the control of the Allied Democratic Forces, or ADF, a rebel militia with links to the Islamic State group. The area is now controlled by the Congolese army. Muyisa Kambale Sindani, representative of nearby Kilya village, said Saturday that the remains were reburied \"with dignity and security.\" He confirmed that bones of at least 20 people were found, but that it wasn't possible to search further because of a lack of security in the region. It wasn't immediately clear how long the bodies had been there. Eastern Congo has been plagued by violence for decades as more than 120 armed groups fight for power, influence and resources and some to protect their communities. The ADF attacks have concentrated on North Kivu province, but the group has recently extended its operations into neighboring Ituri province and to areas near the regional capital, Goma, in South Kivu. The rebels are accused by the U.N. and rights groups of targeting, maiming, raping and abducting civilians, including children. Capt. Anthony Mwalushayi, regional spokesperson for the Congolese army said the area had been an ADF stronghold.",
        "\"There are innocent people who have been buried here. This is really a mass grave, \" he said, but noted that among the bones that were found, there were military insignias.Mwalushayi pledged authorities would investigate and bring those responsible to justice.Local residents are demanding more protection from the government but also justice.",
        "\"We demand justice to be done so that the perpetrators of this massacre answer for their actions and set an example for other rebels to stop killing us unfairly\" said Richard Kakule, a farmer from Ndoma. After the forensic and experts collected the remains and placed them in white body bags, locals organized a small ceremony and sang while burying the bodies with their own hands. ADF rebels have been active in eastern Congo for decades and have killed thousands in the region since they resurfaced in 2013.Earlier this year, the United States offered a reward of up to $5 million for information that could lead to the capture of the group´s leader, Seka Musa Baluku."
    ]
}