{
    "articleURL": "/wires/ap/article-12059485/Messi-training-PSG-despite-suspension.html",
    "content": [
        "Lionel Messi returned to training Monday with his Paris Saint-Germain teammates after the club lifted his suspension.",
        "The French team announced Messi's return on its website, posting a picture of the former Barcelona player running with a ball at the club's training ground.PSG did not officially say whether Messi's disciplinary punishment had been revoked, but a person with knowledge of the situation told The Associated Press that the Argentina star resumed his training after the suspension was lifted.The person spoke on condition of anonymity because they were not authorized to publicly discuss the matter.The move suggests that the World Cup winner will be available for PSG´s next league game against Ajaccio on Saturday, barring an injury.With four games left to play, PSG tops the league standings with a six-point lead over Lens.",
        "PSG had not specified the length of the suspension, though French media reported it to be two weeks.Messi missed practice last Monday while he was on a promotional trip to Saudi Arabia, and the French club announced his suspension a day later. Messi apologized to the club and his teammates for traveling without PSG´s permission.Messi, who joined PSG in August 2021, is not expected to extend his contract with PSG beyond this season.PSG fans hoped his arrival would result in an elusive Champions League title. Instead, the Qatari-backed club was eliminated in the round of 16 in consecutive seasons.",
        "After a good start to the season, Messi has failed to replicate that form since returning from the World Cup. Still, he has scored 15 league goals and leads the French league with 15 assists.Reports have linked him to Inter Miami in Major League Soccer, a return to Barcelona, and a lucrative move to Saudi Arabia.Messi joined PSG after winning every major title with Barcelona. The Catalan club that Messi called home from the age of 13 couldn´t afford to keep him because of large debts and the Spanish league's financial regulations.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}