{
    "articleURL": "/wires/pa/article-12061409/10-days-claim-pension-credit-qualify-301-cost-living-payment.html",
    "content": [
        "Pensioners on low incomes are being urged to check whether they could be eligible for pension credit, worth over £3,500 per year on average.",
        "There are just 10 days to go for people to claim pension credit and still qualify for the latest £301 cost-of-living payment, which they will receive direct into their bank accounts.Those who successfully claim by May 19 could receive the £301 payment.Pensioners can check their eligibility and get an estimate of what they may receive by using an online pension credit calculator. Please check if you or your loved ones can claim for this extra support, and if you do it by May 19 you could qualify for the £301 cost-of-living payment  Minister for Pensions, Laura Trott  Minister for Pensions Laura Trott said: “Pension credit can make a real difference and I am determined to make sure this support – worth an average of £3,500 a year – is reaching everyone who needs it, particularly as we know how much pressure households across the country have been under.“Please check if you or your loved ones can claim for this extra support, and if you do it by May 19 you could qualify for the £301 cost-of-living payment – giving another financial boost to those who need it most.”",
        "Pension credit is designed to help people over state pension age and on a low income with daily living costs, though someone does not need to be in receipt of the state pension to receive it.",
        "It tops up a person’s income to a minimum of £201.05 per week for single pensioners and to £306.85 for couples or more if a person has a disability or caring responsibilities.Pension credit is sometimes described as a “gateway benefit”, because even a small pension credit award can provide access to a wide range of other benefits – such as help with housing costs, council tax or heating bills – in addition to the extra cost-of-living payments, worth up to £900 this financial year.Around 1.4 million pensioners across Britain receive pension credit, but many who could be eligible are not claiming this extra financial help.Applications for pension credit can be made in various ways, such as by printing and filling out a paper form, visiting www.gov.uk/pension-credit/how-to-claim, or over the phone by calling 0800 99 1234 (phonelines are open Monday to Friday 8am to 6pm). "
    ]
}