{
    "articleURL": "/tvshowbiz/article-12045181/MasterChefs-Jock-Zonfrillo-dead-Melissa-Leong-pulls-live-event.html",
    "content": [
        "Melissa Leong has pulled out of a scheduled event at the Sydney Opera House following the death of her MasterChef Australia co-host Jock Zonfrillo aged 46.",
        "Leong was meant to host a live Q&amp;A with American cookbook writer Alison Roman next Tuesday, but it was announced on Thursday she would no longer be attending. 'Following the sad news of the passing of her colleague and friend Jock Zonfrillo, Melissa Leong is no longer able to join Alison Roman in conversation on Tuesday, May 9,' a Sydney Opera House spokesperson said in an email sent to ticketholders.Replacing Leong will be MasterChef Australia season two winner Adam Liaw. ",
        "Zonfrillo was found dead by police at a hotel in Melbourne's inner-north at about 2am on Monday, the same day Channel Ten was meant to premiere the fifteenth season of MasterChef Australia.   In the wake of the tragic news, Leong and fellow MasterChef judge Andy Allen pulled out of all media appearances to promote the cooking show's return. The premiere has since been rescheduled to Sunday, May 7.",
        "On Tuesday afternoon, Leong shared a heart-wrenching tribute to Zonfrillo, expressing her disbelief and sorrow at the tragic loss. In her post, Leong touched on how much Zonfrillo had altered her life after the two, alongside Andy Allen, replaced the hit cooking show's previous judges in 2019.'Four years ago, the three of us stood on a precipice and jumped,' Leong wrote. ",
        "'I could never have guessed how much of an impact your arrival in my life would have, or that we would be saying goodbye to you so soon. You were always supposed to be the bulletproof one who outlived us all,' she wrote.",
        "She then paid tribute to her co-host pushing her to strive for excellence 'both in the kitchen and outside of it.' 'Thank you for challenging me daily, for making me better, my work buddy and friend, purveyor of excellent morning coffees, hater of pears, okra and nasturtiums,' she continued.'This all feels too raw too process still, I suspect it will for some time. Such is the impact of a life lived so large, with so much levity and entirely on your own terms.",
        "'My heart goes out to your family, who were and are your life. A wee dram for you today, and always.'Zonfrillo is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried. If you or someone you know needs immediate support, contact Lifeline on 13 11 14 or via lifeline.org.au. In an emergency, call 000. ",
        "Zonfrillo is believed to have died of natural causes and nothing unusual or suspicious was discovered in the hotel room where he was found dead, Daily Mail Australia understands.The MasterChef star was found dead by police at Zagame's House hotel in Melbourne at about 2am on Monday, just metres away from his former inner-city home in Carlton.",
        "The Glasgow-born chef had left his family behind in Italy, where they had recently emigrated, to return to Australia for the launch of the new season of the hit cooking show.Daily Mail Australia can reveal that when the police entered the hotel room to conduct a welfare check, officers believed that Zonfrillo had died of natural causes and didn't find anything that suggested otherwise.There was also no drug paraphernalia found in the hotel room, sources said.It will now be for the Coroner to determine the celebrity chef's specific cause of death."
    ]
}