{
    "articleURL": "/news/article-12044369/Tyre-Nichols-legal-alcohol-limit-despite-responders-claiming-drunk.html",
    "content": [
        "The man beaten to death by Memphis police officers in January was under the legal limit for alcohol when he was pulled overThe video, which shocked the nation, showed five officers beating and tasing Tyre Nichols, 29, causing his deathNichols' mother maintained that her son was under the limit despite one of the officers accusing him of being 'high as a kite' when he was pulled over The medical examiner's report into the death of Tyre Nichols found that the Memphis man had a blood alcohol level of 0.49, which is under the legal limit, when he was pulled over by the police.",
        "The report also found that Nichols died of 'died of brain injuries from blunt force trauma,' reports ABC News. The full report will be released to the public shortly. The five Memphis police officers who were seen on video beating and tasing Nichols in January have been fired and charged with second-degree murder. They have pleaded not guilty.The shocking video of Nichols' beating showed the officers savagely beating Nichols, a 29-year-old FedEx worker, for three minutes while screaming profanities at him in an assault that the Nichols family legal team has likened to the infamous 1991 police beating of Los Angeles motorist Rodney King. In the wake of Wednesday's development, Nichols' mother has said that she never felt that her son was drunk at the time he was pulled over.  He also had trace amounts of marijuana in his system. ",
        "In the video, the officers can be heard saying that Nichols was 'high as a kite.' 'The legal team representing the family of Tyre Nichols acknowledges the release of the medical examiner's report, the contents of which are highly consistent with our own reporting back in January of this year. We know now what we knew then,' attorneys Ben Crump and Antonio Romanucci said in a statement. 'Tyre Nichols died from blunt force trauma and the manner of death was homicide. The official autopsy report further propels our commitment to seeking justice for this senseless tragedy.'",
        "The shocking video saw Nichols calling out for his mother before his limp body is propped against a squad car and the officers exchange fist-bumps.Rodney Wells, Nichols' stepfather, said at the time of the release of the video that the family would 'continue to seek justice,' noting that several other officers failed to render aid, making them 'just as culpable as the officers who threw the blows.' The arrest was made by the so-called Scorpion unit, which has three teams of about 30 street officers who target violent offenders in areas beset by high crime. The unit has since been disbanded.An officer in the video accused Nichols of swerving as if he intended to hit an officer's car. The officer said that when Nichols pulled up to a red light, the officers jumped out of the car.'We tried to get him to stop,' the officer sad. 'He didn't stop.'",
        "Officers also initially said Nichols was pulled over for reckless driving, but there has been no evidence to back up those claims. After the first officer roughly pulls Nichols out of a car, Nichols can be heard saying, 'I didn't do anything,' as a group of officers begins to wrestle him to the ground.One officer is heard yelling, 'Tase him! Tase him!'",
        "Nichols calmly says, 'OK, I'm on the ground.''You guys are really doing a lot right now,' Nichols says. 'I'm just trying to go home.''Stop, I'm not doing anything!' he yells moments later.Nichols is also initially compliant with the officers' requests although he is confused by their hostility towards him and lies on the ground as told to while police try to handcuff him. It's unclear if he had any prior encounters with any of the cops involved.Nichols can then be seen running after an officer fires a Taser at him. His mother's home, where he lived, was only a few houses away from the scene of the beating, and his family said he was trying to get there. The officers then start chasing Nichols.",
        "Other officers are called, and a search ensues before Nichols is caught at another intersection. The officers beat him with a baton, kick and punch him, then pepper spray him.Security camera footage shows three officers surrounding Nichols as he lies in the street cornered between police cars, with a fourth officer nearby.Two officers hold Nichols to the ground as he moves about, and then the third appears to kick him in the head. Nichols slumps more fully onto the pavement with all three officers surrounding him. The same officer kicks him again.",
        "The fourth officer then walks over, draws a baton and holds it up at shoulder level as two officers hold Nichols upright, as if he were sitting.'I'm going to baton the f*** out you,' one officer can be heard saying. His body camera shows him raise his baton while at least one other officer holds Nichols. The officer strikes Nichols on the back with the baton three times in a row.The other officers then appear to hoist Nichols to his feet, with him flopping like a doll, barely able to stay upright.An officer then punches him in the face, as the officer with the baton continues to hit him. Nichols stumbles and turns, still held up by two officers. The officer who punched him then walks around to Nichols' front and punches him four more times. Then Nichols collapses.Two officers can then be seen atop Nichols on the ground, with a third nearby, for about 40 seconds. Three more officers then run up, and one can be seen kicking Nichols on the ground.As Nichols is slumped against a car, not one of the officers renders aid. The body camera footage shows one of them reaching down and tying his shoe.Court records showed that all five former officers — Tadarrius Bean, Demetrius Haley, Desmond Mills Jr., Emmitt Martin III and Justin Smith — were taken into custody.",
        "Second-degree murder is punishable by 15 to 60 years in prison under Tennessee law."
    ]
}