{
    "articleURL": "/wires/reuters/article-12058209/Binance-pauses-bitcoin-withdrawals-citing-large-volumes.html",
    "content": [
        "Four hour block on bitcoin withdrawals across Sunday and Monday",
        "Pending transactions cleared with higher fees - Binance(Recasts with fees detail, updates Bitcoin price, adds fresh Binance and expert quote, turnover data)SINGAPORE, May 8 (Reuters) - Cryptocurrency exchange Binance halted bitcoin withdrawals for several hours on Monday, citing heavy volumes and a surge in processing fees, before clearing them at a higher cost.Late on Sunday and again early on Monday the world's biggest crypto exchange shut bitcoin withdrawals saying there was a glut of pending transactions because it hadn't offered so-called miners a high enough reward to log the trades on the blockchain.The halt pushed bitcoin lower though its losses were marginal, with the cryptocurrency last down about 1% to $28,162, its lowest in nearly a week.\"Our set fees did not anticipate the recent surge in (bitcoin) network gas fees,\" Binance said in a tweet. \"We're replacing the pending bictoin withdrawal transactions with a higher fee so that they get picked up by mining pools.\"Gas fees refer to payments made to crypto miners whose computing power processes transactions on the blockchain.\"If the withdrawal amount is large, the gas fee required to process the transaction may also be large, especially during times of high network congestion,\" Joshua Chu, group chief risk officer at blockchain technology group XBE, Coinllectibles and Marvion.",
        "\"We need more information as to what has led to the large withdrawals.\" After an hour-long stoppage late on Sunday and several hours on Monday, Binance said withdrawals resumed.\"To prevent a similar recurrence ... our fees have been adjusted.\" In a separate tweet Binance denied there had been large outflows from the platform.In March, Binance had suspended deposits and withdrawals citing tech issues. Twenty-four hour trading volume on Binance was $6.9 billion according to analytics site CoinMarketCap, more than eight times the next-largest venue, Coinbase.(Reporting by Rae Wee in Singapore and Akanksha Khushi in Bengaluru; Editing by Muralikumar Anantharaman, Jacqueline Wong &amp;amp; Simon Cameron-Moore)"
    ]
}