{
    "articleURL": "/tvshowbiz/article-12058595/Transformers-Rise-Beast-clip-2023-MTV-Movie-TV-Awards-Optimus-Prime-Primal.html",
    "content": [
        "Transformers: Rise of the Beasts stars Anthony Ramos and Dominique Fishback arrived at the 2023 MTV Movie &amp; TV Awards on Sunday to present a new clip from their highly-anticipated movie.",
        "Paramount Pictures released a new trailer just a few weeks ago for the highly-anticipated Transformers adventure, in theaters June 9.The film is set in New York City circa 1994, following Noah Diaz (Ramos), an ex-military electronics expert trying to support his family in Brooklyn, and Elena Wallace (Fishback), an artifact researcher.They ultimately team up with the Autobots as they team up with three animalistic factions of the Transformers - Maximals, Terrorcons and Predicons.They team up to battle the powerful Unicron, though this exclusive clip shows the first meeting of Optimus Prime (Peter Cullen) and Primal (Ron Perlman).",
        "The clip begins with the massive Primal - a Transformer in the shape of a gorilla - jumps in front of Noah and Elena, asking who they are and, 'Why are you hunting for the key?'Before they can answer, Mirage (Pete Davidson) arrives from an elevated position, telling Primal, 'Yo, Donkey Kong, stay away from my friends!'A nervous Noah calls out for Mirage, though the Autobot says, 'Don't worry, your boy's got this,' before the cheetah Maximal Cheetor (Tongayi Chirisa) pounces on Mirage, causing him to scream and say, 'Stranger danger! Stranger danger!'Wheeljack (Christo Fernandez) arrives behind Noah and Elena, but that Autobot is tossed aside by the rhinoceros Maximal dubbed Rhinox (David Sobolov).",
        "Arcee (Liza Koshy) arrives and points her weapons at Cheetor, joking, 'Hey, over here, kitty kitty,' when Optimus Prime jumps in and tells everybody to stand down.Optimus points his weapon at Primal as he pounds the ground, as Optimus adds, 'I won't ask a second time,' as Primal pounds his chest as the clip comes to an end.Other new voice cast members include Oscar winner Michelle Yeoh as Airazor, Ron Perlman as Optimus Primal, Peter Dinklage as Scourge, John DiMaggio as Stratosphere, Cristo Fernandez as Wheeljack and MJ Rodriguez as Nightbird.",
        "The movie continues the studio's lucrative Transformers franchise - which has taken in nearly $5 billion at the box office worldwide.The film hits theaters on June 9, going up against Universal's R-rated comedy Strays in wide release.Stephen Caple Jr. (Creed II) directs from a script by Joby Harold (The Flash), Darnell Metayer (BMF) and Josh Peters (BMF).The project is the seventh film in the Transformers franchise, which will be followed by Transformers One by director Josh Cooley.That project will be released in theaters July 19, 2024, with several other Transformers movie projects in development. "
    ]
}