{
    "articleURL": "/sport/racing/article-12055345/Champion-jockey-Jamie-Kah-reveals-horrifying-extent-injuries-fall-Flemington.html",
    "content": [
        "Kah was involved in horror race fall Reveals she didn't know who she was Had to 'Google herself' to find outChampion jockey Jamie Kah has revealed the horrifying extent of her injuries following a sickening race fall, which left her with a brain injury so bad she thought it was almost 10 years prior.",
        "The 27-year-old nine-time Group 1 winner and fellow champion hoop Craig Williams were involved in a horror fall during the Sires Produce Stakes at Flemington on March 11. Kah was rushed to hospital in a critical condition after suffering bleeding in the brain, a fractured wrist and broken foot; while Williams' injury list was also extensive, with a broken collarbone, ribs and a finger as well as concussion.She was put in an induced coma for almost a week to allow her brain to rest, and after a significant stint in hospital has returned to her farm in Victoria's Mornington Peninsula is now finally eyeing a return to racing in the coming months.But it has been a very long road just to get to this point, and Kah has broken her silence on the fall-out from the incident that led 'time to disappear' for her.",
        "'The main injury was bleeding in the brain. I was in a coma for I think about five days,' she said in an interview with Channel 7 from her farm. 'I broke my wrist, which I didn't find out until a long time after the fall. And my foot was broken, and I think my nose. But that wasn't really relevant compared to the brain injury. 'When I fell, I was told I couldn't breathe for about 20 seconds or maybe more ... I was put in the induced coma and then I couldn't wake up because of the medication I was on, I just kept sleeping. It took me ages to wake up.",
        "'I was whinging in the Epworth (Hospital) about my wrist and then they X-rayed again. They said, \"You're right wrist, it's broken!\". So yeah, I found out a long time after that my hand was broken as the focus was on getting my head right.' It's safe to say her brain had gone through a very significant trauma. Kah has no memory of the fall, or even being at the track that day - indeed much of the month following the incident is a 'blur' for the world's leading female jockey.She doesn't remember the hospital she was rushed to by ambulance after the fall - the Royal Melbourne, where she was from March 11-20 - or the first few days after she was transferred to Epworth. ",
        "Shockingly, Kah revealed that so great was the injury to her brain, she believed it was almost 10 years prior, when she began her stunning rise to stardom in her home state, Adelaide.'I woke up in Epworth thinking I was 18 years old and that I lived in Adelaide again,' she said. 'I kept saying my address, which was my old address from back home in Adelaide. I could remember that, but they told me it was wrong, but I couldn't remember where I lived.'",
        "In order to fill in the significant gaps in her memory as she tried to put the pieces together of what happened, and the decade of her life she had 'lost', Kah revealed she had to turn to a very 21st option. 'I started to Google myself to put all the pieces together. It was like some sort of a movie. I couldn't remember how old I was, so I wrote my name and Google told me, I'm like, \"Oh, 27, not 18. There we go\",' she said.'Lots of things came back after I Googled myself. I could see articles about what had happened in the race fall. 'I didn't know what had happened to me so I started reading about it. I had worked out I was in hospital because I'd fallen off a horse but I had to find out what had actually happened.' ",
        "It's a startling revelation on serious her brain injury was, and perhaps most scary of all for her loved ones was the fact she didn't remember who her parents and partner were at first, or see properly. It was the worst possible concussion she could have had.'My vision wasn't good at the start. I couldn't see anything, and I kept walking into walls. I didn't know that until Ben (partner Ben Melham, also a champion jockey) told me. Now my vision is fine,' Kah explained. ",
        "'When I woke up, I couldn't remember who dad was, or really who I was, then there were some concerns. 'They (doctors) told me there was a scale between 3 to 15, and 3 was the worst. I was 3.'It was an incident that shocked the racing world, and one of three serious falls on successive race weekends.It started with Ethan Brown suffering internal injuries after a fall in the Group 1 Australian Guineas at Flemington on March 4, with Kah and Williams' fall coming the weekend after. Then Teo Nugent was left with a fractured C1 vertebrae and his mount Florescent Star had to be euthanized.",
        "Tragically that culminated in much-loved rider Dean Holland dying after a 'sickening' fall in country Victoria on April 24, which left a still-recovering Kah devastated, and feeling 'lucky' despite her serious injuries.'To be honest, I'm just feeling incredibly lucky and blessed to be here. I feel very fortunate. My friend and fellow jockey Dean (Holland) isn't here. I am,' she said on her fellow Adelaide native.'I've known him for a really long time, and he was a great jockey. But aside from that, he was just an amazing person. He's done so much for so many people around him.'It was an absolutely horrible thing to happen and I'm very sad he has gone. We now need to keep doing everything we can to support his family. I am heartbroken for them. ",
        "'He was a really good friend who supported so many jockeys and people around him. He looked after everyone. He was just such a worker too ... he rode every day, everywhere, and he loved his family. 'He was such a nice person and he was always good fun. He's going to be very, very sadly missed by so many people. It is going to be very hard on Monday (Holland's funeral) when we all have to say a final goodbye.' In a tragic twist of fate, Holland only won his second Group 1 - the Newmarket - just weeks prior as a result of Kah's fall. The Newmarket was run on the same day as the incident, and with Kah unable to ride on In Secret, Holland, an extremely lightweight jockey, was the only rider who could saddle up.He subsequently won, but instead of celebrating with the gusto and joy he deserved, his only thoughts were with Kah and Williams. ",
        "'The last thing I wanted to do today was carry on - win, lose, or draw - it's very unfortunate what happened to Jamie and Willo (Williams), and my thoughts go out to them,' Holland said at the time. 'I was just the lucky one who was able to ride light today and picked up the ride on one of Australia's best sprinters.'",
        "After his death, the interview came back into the public consciousness as brilliant evidence of the sort of man he was. 'Dean handled himself so well the day that he rode In Secret, on the track, and off it. The way he spoke about me and Craig Williams afterwards when he won, summed up how remarkable and selfless he was,' said a grieving Kah.Kah, Melham and thousands of people from the racing world will descend on Flemington to attend Holland's funeral on Monday from 2pm, which will be streamed live for the many fans and friends who can't attend. The fundraiser for Holland's family continues, and has now raised more than $1.7million for his wife Lucy and four young children. You can donate here."
    ]
}