{
    "articleURL": "/wires/ap/article-12042629/Triple-Crown-winner-Secretariat-dominant-50-years-on.html",
    "content": [
        "Secretariat had an unusually large heart, an engine that propelled him to a Triple Crown sweep 50 years ago. The colt nicknamed Big Red remains the heartbeat of an industry that has yet to see such dominance on and off the track replicated.",
        "His name recognition, even among those who don´t follow sports, is still strong 34 years after his death, and eight of his descendants will run in the Kentucky Derby on Saturday, including early 3-1 favorite Forte.\"He´s still the bar to me,\" said Bob Baffert, who trained Triple Crown winners American Pharoah in 2015 and Justify in 2018. \"I still ask strangers, `Who´s the best horse you ever heard of?´ and I´m hoping they say Pharoah. They say Secretariat.\"Secretariat won the Derby, Preakness and Belmont in record times that still stand, and ended a 25-year Triple Crown drought.\"It says he was beautifully prepared for each of those races, and his competition was not as good as he was,\" said Dave Johnson, track announcer for the 1973 Belmont in which Secretariat won by an astounding 31 lengths. \"He was a special animal.\"Big Red´s path to Triple Crown glory began in the Derby. He was the first horse to cover the 1 1/4-mile distance in under 2 minutes with a time of 1:59.40. It would not be repeated until Monarchos clocked 1:59.97 in 2001.",
        "Two weeks later, Secretariat broke last out of the starting gate in the Preakness. Jockey Ron Turcotte made a split-second decision in the first turn to swing Big Red to the outside in a rush to the front. They won by 2 1/2 lengths over Sham, who had also finished second in the Derby.",
        "\"I could make five, six moves with him in a race. A normal horse you could make one or two,\" Turcotte told The Associated Press by phone from his home in Canada. \"Down the lane I never asked him to run. He just galloped to the wire very easily.\"The Pimlico track´s timing device showed Secretariat clocked 1:55 for 1 3/16 miles, but it had malfunctioned. It wasn´t until 2012, at owner Penny Chenery´s request, that the Maryland Racing Commission reviewed video and revised his time to 1:53, another track record.Secretariat´s popularity exploded in the three weeks leading up to the Belmont. He became a pop culture phenomenon, appearing on the covers of Time and Newsweek while helping distract a nation dragged down by Watergate and the Vietnam War.\"He had just about everything,\" Turcotte said. \"He was a good-looking horse, he was a very strong horse, had a long stride that covered a lot of ground, a very cooperative and generous horse. He would give you whatever you asked of him.\"In the Belmont, Secretariat was the 1-10 favorite in the grueling 1 1/2-mile race against just four rivals, including Sham who was back for another try.Secretariat went to the early lead along the rail and was soon challenged by Sham, ridden by Laffit Pincay Jr. The two horses were even through a half-mile at a blistering pace in what became a match race with the rest of the field about 10 lengths behind.",
        "Sham poked his head in front around the turn, but soon weakened. Secretariat began distancing himself from the field. He ran the mile in 1:34.20 and reeled off 1 1/4 miles in 1:59, faster than his record time in the Derby.Big Red completed the last quarter in a scant 25 seconds. He finished in 2:24, his third record in as many races.\"The Belmont was such a magnificent display of speed and stamina,\" recalled Johnson, who is now 81.Sham was injured and finished last. He never raced again.Secretariat´s legend has only endured. He had his own U.S. stamp and was the subject of a 2010 Disney movie.\"He was a beautiful horse,\" said Pincay, now 76 and retired since 2003. \"You never saw him do anything stupid. Some horses jump and down and get nervous. He was very businesslike.\"Secretariat´s heart - which a 1989 necropsy found weighed 22 pounds, compared to 8 1/2 pounds for the average horse - was the basis for an Audi car commercial in 2017.\"He could turn air to oxygen much faster than another horse could,\" Turcotte said.And on the 50th anniversary of his history-making triumph, Secretariat is being given another round of celebration. The Kentucky Derby Museum is featuring \"Secretariat: America´s Horse,\" a new exhibit that uses technology to show how his physique helped make him such a standout. His three Triple Crown victories can be viewed on a 10-foot wall.",
        "The National Museum of Racing and Hall of Fame is taking a traveling exhibit to the Triple Crown cities of Louisville, Kentucky, Baltimore and New York - as well as Secretariat´s birth state of Virginia. The exhibit features his Triple Crown trophies and the story of the people who guided him.Turcotte is the lone remaining member of Secretariat´s team. Chenery, his owner, died in 2017 at age 95; trainer Lucien Laurin died in 2000; groom Eddie Sweat died in 1998; and exercise rider Charlie Davis died in 2018. Bill Nack, the former Sports Illustrated writer who closely chronicled Big Red´s career, also died in 2018.Turcotte, 81, became a paraplegic after a riding accident in 1978. He travels less these days while caring for his wife in his tiny hometown of Drummond, New Brunswick, where there's a statue of him and Secretariat crossing the finish line.\"There´s never been a horse like him,\" Turcotte said, \"and I doubt there will be another one.\"In 2015, on his way to the Belmont winner´s circle for American Pharoah in 2015, Baffert shared a celebratory embrace with Chenery.\"I whispered in her ear, `He´s no Secretariat, but he´s as close as I´ll ever get,´\" the Hall of Fame trainer said.\"You´re damn right,\" she replied.",
        "___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sport"
    ]
}