{
    "articleURL": "/tvshowbiz/article-12047603/Bradley-Cooper-holds-hands-Oscar-date-mother-Gloria-Guardians-Galaxy-Vol-3-screening.html",
    "content": [
        "Bradley Cooper sweetly held hands with his mother Gloria Campano at a New York screening for Guardians Of The Galaxy Vol. 3 this Wednesday.",
        "The movie will enjoy a wide theatrical release this Friday, but two days earlier it got an advanced showing at a Manhattan location of iPic Theaters.Cutting a dapper figure in a midnight blue pea coat with a cardigan-style collar, Bradley exuded movie star magnetism during his latest outing.Gloria, who has been his date to a number of glittering showbiz events including last year's Oscars, remained proudly on his arm.She teamed a shimmering black top with an elegant floral blazer, wearing her blonde hair in a perfectly coiffed bob for her son's big night.",
        "During the event, Bradley found time to pose with his co-star Chris Pratt as they celebrated their final Guardians Of The Galaxy movie together.Over the course of Wednesday's fete, Bradley and Chris also gathered for a group shot with their co-stars Miriam Shor, Karen Gillan and Chukwudi Iwuji, as well as their director James Gunn, who has been with the film series from the start.Chris shot to international sex symbol status as Peter Quill aka 'Star Lord' in the first instalment, which came out in 2014. The movie also introduced Bradley as the voice of a computer generated talking raccoon called Rocket, a venal and sharp-tongued weapons specialist.Guardians Of The Galaxy Vol. 3 will reportedly show Rocket's origin story, which is said to involve scientific experiments.",
        "'I love Rocket a lot, and it was a real privilege to play him, to be part of the team that is Rocket,' Bradley recently told the Baltimore NBC affiliate WBAL-TV. 'And then to do - in this last incarnation of Guardians that they really were able to focus on his story meant a lot to me to be able to help tell that.'Alongside his prodigious career as a movie star, Bradley has also broken into directing, first with his 2018 remake of A Star Is Born.",
        "Following on from previous versions that starred Janet Gaynor, Judy Garland and Barbra Streisand, Bradley cast pop diva Lady Gaga as his leading lady.Bradley himself portrayed the self-destructive leading man, stepping into the shoes of Fredric March, James Mason and Kris Kristofferson.He is currently directing Maestro, a biopic of Leonard Bernstein, the Broadway composer of such legendary shows as West Side Story, On The Town and Candide.Leonard was married to Chilean actress Felicia Montealegre from 1951 until her death of cancer in 1978 in spite of the fact she knew he was gay.Bradley is playing the leading man, with Carey Mulligan as Felicia in a cast that includes Maya Hawke, Matt Bomer and Sarah Silverman.On the personal front, Bradley is amicably co-parenting his six-year-old daughter Lea De Seine with his ex, Russian supermodel Irina Shayk.",
        "Irina, whose dating history includes Cristiano Ronaldo and Kanye West, is in fact so close with Bradley that they have set off reunion rumors more than once. "
    ]
}