{
    "articleURL": "/wires/aap/article-12047837/Brisbane-ready-tackle-Carltons-twin-towers.html",
    "content": [
        "Brisbane are confident they can find a way to quell Charlie Curnow, with breakout defender Jack Payne likely to get first dibs on the Carlton superstar.",
        "Curnow is coming off a nine-goal haul in Carlton's 108-point drubbing of West Coast and leads the Coleman Medal on 30 goals alongside Geelong gun Jeremy Cameron.Last year's AFL leading goalkicker, Curnow is joined by fellow big man Harry McKay, with Lions coach Chris Fagan confident Payne could handle one of the twin towers on Friday night after his strong start to the season.\"(Payne) is just looking confident, isn't he?\" Fagan said.\"That continuity, the fact he played in all the finals last year, he's starting to believe in himself and feels like he belongs at AFL level.\"He's played on some pretty decent players this year and done a great job.\"I can't see why he can't continue that tomorrow night.\"Fagan noted both attacks were capable of putting on a show, with Curnow and McKay at one end and Joe Daniher, Eric Hipwood and Charlie Cameron at the other.\"They've got their work cut out, their backs, and our backs have got their work cut out for them, so it'll make for a good contest,\" he said.\"But Curnow and McKay are certainly in good form.\"The Blues are expecting a bumper crowd at Marvel Stadium and Fagan welcomed the occasion.\"Big stage. I hear the game's a sell-out so it's going to be a finals-like atmosphere and we crave to play in those games and we're looking forward to the opportunity,\" he said.",
        "\"Carlton found some good form last week, they were really good against West Coast.\"It's a good test for us.\"Fagan relished the prospect of gun midfield trio Lachie Neale, Josh Dunkley and Will Ashcroft going toe-to-toe with the likes of Patrick Cripps, Sam Walsh and Adam Cerra.\"It's going to be the part of the game we need to get right this week because they've got a really strong midfield too,\" he said.\"Cripps is the No.1 clearance player and first-possession player in the AFL.\"Whoever wins that battle, it'll go a long way towards deciding the outcome of the game.\""
    ]
}