{
    "articleURL": "/wires/pa/article-12051925/Birthday-boy-Carlos-Alcaraz-beats-Borna-Coric-reach-Madrid-Open-final.html",
    "content": [
        "Carlos Alcaraz celebrated his 20th birthday by beating Borna Coric to reach the final of the Madrid Open.",
        "The Spaniard is bidding to win back-to-back titles in his homeland for the second year in a row after successfully defending the title in Barcelona last month.Croatian Coric put up a good fight, with the first set in particular full of gruelling all-court rallies, but ultimately Alcaraz was too good and he claimed a 6-4 6-3 victory.After the pair had shaken hands, the home hero was presented with an enormous birthday cake while the crowd sang happy birthday.“It means a lot to me, playing a final again here in Madrid,” said Alcaraz. “It’s such a special place for me and I have great memories since I came here to play under-12s. Of course last year was amazing.“Turning 20 like that is special, so I will enjoy the final here and of course I will try to make all of Spain happy.”",
        "Alcaraz’s latest win came amid the news Rafael Nadal will miss the Italian Open in Rome next week as he continues to recover from a hip injury, and the younger Spaniard is rapidly establishing himself as the French Open favourite.Novak Djokovic missed Madrid with an elbow problem and, if he wins the title this weekend, Alcaraz will only need to play a match in Rome to ensure he returns to world number one.",
        "In the final, Alcaraz will take on German Jan-Lennard Struff, who became the first lucky loser to reach the trophy decider at a Masters 1000 event.Incredibly, Struff lost to Aslan Karatsev in qualifying only to meet the Russian again in the semi-finals after both put together brilliant runs.Karatsev won the opening set but increasingly struggled with a left thigh problem and Struff battled to a 4-6 6-3 6-4 victory that ensures he will hit a new career-high ranking inside the top 30.Former Australian Open semi-finalist Karatsev, meanwhile, will return to the top 100 after a difficult 2022."
    ]
}