{
    "articleURL": "/wires/afp/article-12059919/US-needs-30bn-seal-14-000-unplugged-offshore-oil-gas-wells-study.html",
    "content": [
        "The cost to secure thousands of inactive oil and gas wells in the US Gulf of Mexico could top $30 billion, according to research published Monday weighing potential environmental damage against the estimated price tag.",
        "Researchers in the United States found there are some 14,000 unplugged oil and gas wells that are either officially idle or have been inactive for at least five years in the waters off the southeastern coast of the United States.With new US government funding available for plugging old fossil fuel wells, the authors focused on offshore sites which are relatively more costly and complicated to secure than those on land.They said both taxpayers and fossil fuel giants would likely be liable for the costs of plugging and abandoning the wells -- a process that includes encasing the opening in concrete to stop oil and the potent greenhouse gas methane from leaking out.\"The wells aren't supposed to just be leaking into the environment if they're not actively producing... but sometimes they do,\" said Mark Agerton, lead author of the study published in the journal Nature Energy.- Shallow waters -The research found that while 90 percent of the inactive wells in the US Gulf of Mexico region were in shallower waters closer to shore, they accounted for only a quarter of the $30 billion in plugging costs -- and presented a greater environmental risk.\"The policy implication is that you'd likely focus on those shallow ones,\" said co-author Gregory Upton of Louisiana State University in a press briefing.",
        "Researchers identified some 13,000 idle wells in shallow waters close to shore, either in the state waters of Texas, Louisiana, and Alabama, or in federal jurisdiction.Oil leaks from these shallow wells would be more likely to pose a threat to coastal habitats than those from deeper wells, the authors said.\"Also, any leakages are more likely to get to the surface and in the case of methane emissions going into the atmosphere and thus cause climate damages,\" Upton said.The study said much of what is known about the environmental impacts of oil and gas spills at different depths comes from the 2010 Deepwater Horizon explosion in the Gulf of Mexico, one of the worst environmental disasters in US history.The BP-leased rig exploded off the coast of Louisiana, killing 11 people and spewing out an oil slick the size of the state of Virginia.While inactive wells are more likely to produce \"small, chronic and potentially unobserved\" leaks, the study said the underlying processes affecting ecological impacts \"have many similarities\".- Who pays? -Under US laws, the costs for plugging wells in state waters are more likely to fall on the taxpayer, while in federal waters it is often the current or even previous owner that is liable.",
        "In the case of the Gulf of Mexico wells, the study found that of the total $30 billion in estimated costs for plugging inactive wells, under $2 billion were in state waters.The vast majority of costs were in federal waters, where nearly 90 percent of the wells had at one point been owned by \"supermajor\" companies like Chevron, Shell, ExxonMobil, ConocoPhillips, BP, Total and Eni.\"I think that points to a very strong conclusion that before a taxpayer would be liable for a well, there's a large oil and gas firm that would be liable,\" said Agerton."
    ]
}