{
    "articleURL": "/wires/ap/article-12040207/Brunson-Randle-help-Knicks-beat-Heat-111-105-series.html",
    "content": [
        "NEW YORK (AP) - Jalen Brunson took the blame when the Knicks dropped the opener of the Eastern Conference semifinals and insisted he needed to be better in Game 2.",
        "Halfway through, it appeared he wasn't.Struggling again with his shot and this time a sore right ankle as well, Brunson told himself he needed to fight through it.\"Just kind of had to find a way to be mentally tough,\" he said. \"Go out there and do it.\"He did, getting New York back to even in the series.Brunson scored 30 points Tuesday night and keyed the run the Knicks needed just in time for a 111-105 victory over a Miami Heat team playing without Jimmy Butler.",
        "Julius Randle returned from a sprained left ankle that sidelined him in Game 1 with 25 points, 12 rebounds and eight assists, and RJ Barrett scored 16 of his 24 points in the first quarter for the No. 5-seeded Knicks. Josh Hart finished with 14 points, 11 rebounds and nine assists.\"I thought Julius gutted it out, played tough. I thought Jalen was fantastic,\" Knicks coach Tom Thibodeau said. \"RJ big, big start to the game for us, so we had a number of guys step up to get it done.\"But it was Brunson, who was 0 for 7 from 3-point range in the opener, who made the biggest plays after going just 1 for 6 for seven points in the first half.",
        "\"It's who he is,\" Thibodeau said. \"Great leader, great toughness. He never disappoints you. Sometimes you can fall short, but there´s no quit in him.\"Caleb Martin scored 22 points in place of Butler for the Heat, who host Game 3 on Saturday afternoon. They will hope to have Butler, the leading scorer in the playoffs who sat out after spraining his right ankle late in their 108-101 victory in the opener.They almost didn't need him.Miami had a six-point lead midway through the fourth quarter thanks to undrafted players Martin and Gabe Vincent before Brunson, who had been listed as questionable after feeling ankle pain at the end of Game 1, took over.He made a 3-pointer that became a four-point play when Isaiah Hartenstein was fouled on the play, and the point guard then scored to knot it at 93.The Heat went back up 96-93 on Vincent's three free throws, but Hart tied it with a 3 before Brunson hit a 3 and scored again to make it 101-96 with 2:48 remaining.Brunson went 6 of 10 behind the arc.Butler is averaging 35.5 points in the postseason, finishing off the top-seeded Bucks in the first round with 56 and 42 points in the the last two games. He had 25 points and 11 points in the opener of this series and almost watched his teammates pull this one out without him.",
        "\"Obviously we feel a certain way right now that we weren´t able to find a way to get this win, but we´ll get over it and we´ll get ready for Saturday,\" Heat coach Erik Spoelstra said.Randle was originally hurt against the Heat in a victory March 29 after starting the first 77 games. He returned for the start of the playoffs but wasn't sharp for much of the series against Cleveland before reinjuring the ankle in the Game 5 clincher.He was much better Tuesday for a Knicks team trying to advance to the Eastern Conference finals for the first time since 2000, when they got there after beating Miami in seven games.\"Whatever it takes to win the game,\" Randle said.Randle had assists on two of the Knicks' first three baskets, with the Heat paying extra attention to him and leaving shooters open on the perimeter. But the No. 8-seeded Heat stayed right with them by making six 3-pointers and the Knicks led just 31-29 after one.Like in the opener, the Heat dug in defensively from there. They limited the Knicks to just two baskets in the first 8 1/2 minutes of the second, building their lead to 46-38, and were ahead 54-51 at the break after Kevin Love's 3-pointer with 6.1 seconds remaining.",
        "The Knicks finally went back into the lead when Brunson hit a couple 3s and then another basket, but Vincent's basket sent Miami to the fourth with a 77-76 edge.TIP-INSHeat: Vincent scored 21 points. ... Max Strus finished with 17 points but missed part of the second half after going to the locker room with a bruised lower back. ... Bam Adebayo had 15 points, eight rebounds and six assists.Knicks: Starting center Mitchell Robinson committed two fouls in the first 2:31 and sat the remainder of the first quarter. ... The crowd included comedians Chris Rock and Mike Myers, retired tennis star Roger Federer, former Knicks All-Star Carmelo Anthony and actress Jessica Alba.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}