{
    "articleURL": "/wires/reuters/article-12058891/Euro-zone-investor-morale-unexpectedly-dips-May.html",
    "content": [
        "BERLIN, May 8 (Reuters) - Investor morale in the euro zone took a surprising dip in May, with stubborn inflation and energy concerns upending expectations of a spring recovery, a survey showed on Monday.",
        "Sentix's index for the euro zone fell to -13.1 points for May from -8.7 in April. Analysts polled by Reuters had expected it to rise to -8.0 this month.The index on expectations in particular took a fall, decreasing to -19.0 in May from -13.0 in April, its lowest level since December 2022, \"wiping out all hopes of an economic revival following the outbreak of the Ukraine war,\" Sentix said.The barometer plunged into negative territory in the wake of Russia's invasion last February.The issue of energy shortages, dampened consumer spending due to inflation and consumer concerns about forced investment in their heating systems to mitigate climate change are among factors that have contributed to the weak spring, it added.Among a raft of policies being brought in across the zone, Berlin's ruling coalition in March agreed that almost all newly installed heating systems in Germany should run on 65% renewable energy from 2024, both in new and old buildings.\"The economic recovery, which is built on feet of clay, is thus beginning to falter,\" the survey said.The euro zone economy had been recovering in recent months, driven by robust demand for services, and a host of agencies from the IMF to the ECB have upgraded their forecasts for the bloc. But recent weakness, especially in manufacturing, is casting a shadow over this recovery, especially as rapid inflation is eating into households' purchasing power.",
        "Germany's economy, Europe's largest, also saw dramatic falls in May, with the index on the current situation dipping to -9.0 from -2.3 in April, bringing back talk about a recession.Adding to recession fears, the manufacturing sector, which accounts for almost a fifth of the German economy, has been struggling, according to the latest statistics office data.Both industrial output and orders posted larger-than-expected declines, which analysts said were a consequence of global rate hikes that are putting the brakes on the economy.The poll of 1,276 investors was conducted between May 4-6, Sentix said. (Reporting by Miranda Murray; Editing by Rachel More and Alison Williams)"
    ]
}