{
    "articleURL": "/femail/health/article-12044713/Sustainable-toothpaste-brand-Waken-smashes-Aussie-market-cult-following-UK.html",
    "content": [
        "All-natural toothpaste brand Waken is finally in AustraliaThe cult-favourite is already third best selling natural product at WoolworthsA toothpaste company with a massive following in the UK has come to Australia - and shoppers can't seem to get enough.",
        "Waken launched Down Under on May 3 and is already the third most popular brand in the all-natural toothcare category at Woolworths.In just 24-hours sales data indicated the wildly popular range of toothpaste and mouthwash was beating out Colgate's own natural range 'Hello'.There is a Waken product sold every minute in the UK, making the 'first day frenzy' in Australia less surprising.'This is the best mouthwash I have ever tried,' one customer wrote online.While others admitted the 'aesthetics' were the hook for them.'I don't want ugly toothpaste in my shower. This one looks nice.' ",
        "Waken's line features products in four flavours across toothpaste and mouthwash, including Whitening, Peppermint, Mint &amp; Strawberry, and Spearmint.Shoppers are particularly fond of the brand's sustainable packaging and pretty pastel shades. Retailing at $13 for a 75ml tube of toothpaste and $15 for 500ml of mouthwash, Waken's whitening toothpaste whitens by up to eight shades without any peroxide.The brand instead uses a unique combination of natural enzymes from papaya, pineapple, zinc salts, and pyrophosphates. 'In formulating our products, we wanted to make sure consumers weren't forced to compromise on effectiveness like some other naturally-based brands,' explained Simon Duffy MBE, Founder of Waken Mouthcare.'Our research uncovered 53 per cent of Aussies would worry about switching to a more naturally-based mouthcare brand because of the perception it'll be less effective, so it's great they now have a great choice in Waken.' ",
        "He added: 'Our toothpaste tubes are made from recycled and endlessly recyclable aluminum, the cartons are made from FSC certified cardboard and our mouthwash bottles are made from 100 per cent post-consumer recycled plastic.'",
        "Consumers all around the world have been raving about Waken's 'life-changing' products. 'They have a lovely scent and I love the metal tube this comes in - unlike most that are plastic,' a man said. 'Great minty paste, it makes my teeth feel really clean, plus I can recycle the tube - would recommend.''I like the environmentally friendly aspects of Waken, the metal recyclable tube, and make up of the actual toothpaste,' said another.She added, 'It's much better than any other environmentally friendly toothpaste I've tried, some are positively disgusting.'A third wrote: 'This works well with small dose, gently foaming, with nice natural flavour. I like that it has vegan approved contents, and is supplied in recycled packaging.' "
    ]
}