{
    "articleURL": "/sport/nfl/article-12049035/Commanders-lobby-federal-legislators-DC-control-RFK-Stadium-site.html",
    "content": [
        "The District of Columbia is attempting to gain control of the RFK Stadium siteA team spokesperson said the club is talking with local and federal officials DailyMail.com provides all the latest international sports news The District of Columbia is attempting to gain control of the RFK Stadium site, and the NFL's Washington Commanders are helping by lobbying Congress with an eye towards potentially returning to their former address. ",
        "A team spokesperson said Thursday officials are communicating with stakeholders at the federal and local levels about the RFK site.'[We are] sharing our vision for a potential venue at that will create jobs and economic growth for the region and be compatible with the surrounding community and the elected leaders of the District,' the spokesperson said in a statement.The land less than roughly 2 miles (3.22 kilometers) east of the US Capitol is currently owned by the federal government, and congressional control is one of the biggest obstacles to potentially building a new state-of-the-art football stadium on the site, the future of which has been a matter of considerable debate.One major question around the RFK Stadium site is whether the DC government would approve construction of a mixed-use entertainment complex on the land just west of the Anacostia River. While several DC City Council members have voiced their opposition to building a stadium there, mayor Muriel Bowser has supported the idea and continues to do so.",
        "'We have a unique opportunity to transform unused federal land at the RFK campus into a mixed-use destination that could also bring the beloved Washington Commanders back home,' a spokesperson for the mayor's office said in an email reply to The AP. 'We look forward to continued conversations with the team and our federal and local partners to get this win for Washington.'",
        "It's not clear how new ownership might approach the situation once Josh Harris' group buys the team from Dan Snyder. There's an agreement in principle in place to sell the storied franchise for a record $6.05 billion, pending league approval among other steps.Washington played home games at RFK Stadium from 1961-1996 before moving to FedEx Field in Landover, Maryland. Rushed to completion under previous owner Jack Kent Cooke, that stadium has not aged well in the decades since.Finding a new stadium site is the top long-term priority for the new owners once they assume control of the organization, with places in DC, Maryland and Virginia still among the options. Last year, Virginia's General Assembly abandoned a stadium bill and Maryland took steps to make bonds available for possible stadium construction.",
        "The team's sale still needs to be approved by the league before it can be finalized. First the NFL's financial committee would have to give a green light before the sale would move on to the league's 31 other owners, three fourths of whom would need to give their approval.The deal is a record for a sports franchise, eclipsing last year's $4.65 billion purchase of the Denver Broncos by the Walton-Penner family, the heirs to the Walmart fortune.",
        "If Harris is approved as owner, he would own stakes in three pro teams, including the NHL's New Jersey Devils. He currently has a stake in the Pittsburgh Steelers, which he will need to sell before his purchase of the Commanders can be finalized.NBA legend Magic Johnson is also part of the incoming ownership group, but his exact stake remains unclear.Snyder and his wife, Tanya, previously announced they've enlisted Bank of America Securities to explore selling all or a portion of the team, which he bought for $800 million in 1999. The NFL franchise is now worth an estimated $5.6 billion, according to Forbes, despite ongoing legal concerns and Snyder's struggles to secure land for a new stadium.The 58-year-old Snyder has faced fans' calls to sell the struggling team for years, but pressure has been mounting since 2020 following accusations of sexual harassment, financial impropriety, and obstruction against the team and Snyder himself.Sexual harassment allegations against team employees ranged from inappropriate comments to the creation of a lewd behind-the-scenes video from a cheerleader calendar shoot in 2008, according to the 2020 Washington Post report that first uncovered the claims.",
        "A former cheerleader also alleged that Snyder suggested that she join his 'close friend' in a hotel room in 2004 so they 'could get to know each other.'",
        "Snyder denied this claim in a 2020 statement: 'I want to unequivocally state that this never happened.'While the Commanders have fired many of the individuals accused of sexual harassment and paid a $10 million fine to the NFL, Snyder has defiantly denied accusations against him in the face of subsequent investigations.The Democrat-led House Oversight committee launched an investigation into the Commanders and the league probe after the NFL decided against compiling its findings in a formal written report, citing confidentiality concerns."
    ]
}