{
    "articleURL": "/health/article-12045933/Hundreds-forced-stand-line-4am-place-NHS-dentist-list.html",
    "content": [
        "Over 300 people were forced to queue outside Smile Dental Care in NorfolkThe practice posted that it would be taking new NHS patients from May 2Hundreds of people were forced to queue from 4am for a place on an NHS dentist list in scenes akin to lines 'outside bakeries in the Soviet Bloc'.",
        "More than 300 people reportedly stood in line outside Smile Dental Care in Kings Lynn on Tuesday following a one-line announcement on the practice's website saying: 'We will be taking on new NHS patients from 2nd May.'A picture of the queue was shared on Twitter by a disgruntled wannabe dental patient with the username @elliebwick.She wrote: 'Is this a queue for a gig? To meet a celebrity? No. It's a queue of people trying to get into the only dentist in Norfolk taking on NHS patients.'The British Dental Association (BDA) described the scene as 'belonging in the Soviet Bloc not in a 21st century health service'.",
        "Below Ellie's original tweet, she added: 'For context, the dentist are taking on 100 NHS patients today. 'I was queuing and had to leave as I need to pick my son up at 10.30 and I know I'm not getting in. Absolutely ridiculous.'Another resident responded to the tweet, saying: 'We live in Norfolk. My husband's dentist left the UK to return home to EU &amp; our practice hasn't been able to replace her despite trying everything. 'I'm terrified that my own dentist will do the same one day &amp; then we'll have no chance at all of getting an NHS dentist in Norfolk.' ",
        "Shawn Charlwood, chair of the BDA's General Dental Practice Committee said: 'This is a wealthy 21st century nation, and dentistry is meant to be a core part of our NHS. ",
        "'But we're now seeing scenes you'd expect outside bakeries in the Soviet Bloc. The crisis in dentistry is still with us and requires real urgency and ambition from government.'Conservative MP for the area, North West Norfolk, said: 'Having campaigned successfully for the NHS to issue contracts which led to the new Smile Dentalcare practice opening last summer, I am pleased thousands of patients have had appointments since then.'He added: 'It is encouraging the practice is now taking on more NHS patients although I've raised concerns with the company over this process and particularly how vulnerable people can register. 'Last month I met with the NHS again to urge them to take further steps to improve access to dentists in West Norfolk to meet the demand locally.'",
        "It comes after the government last week set out its intentions to develop a dentistry 'recovery plan'. The plan was announced just minutes ahead of the Department of Health and NHS England giving evidence to the Health and Social Care Committee inquiry into the NHS dentistry crisis. The move was slammed by the professional body and MPs, as merely being a 'plan to have a plan', with the BDA describing the last-minute announcement as 'reeking of desperation'.",
        "The latest figures from the LG Inform — a database run by the Local Government Association (LGA), recorded that nationally, there was only one NHS dental practice for every 4,975 people at the start of 2023. And figures suggest over 6.5million children in England have not been seen by an NHS dentist for at least a year amid the growing crisis.Dentist Stuart McCance, who visits schools in Norfolk and Waveney to promote good oral hygiene, also shockingly claimed that some children in parts of England have 'never' seen a toothbrush.In March, the first oral health survey of five-year-olds published since lockdown showed there have been no improvements in decay levels and a widening gap between rich and poor.Some 23.7 per cent of five-year-old children in England had experience of obvious dentinal decay, which is a marginal increase on the previous survey of five-year-olds in 2019, where figures stood at 23.4 per cent.MailOnline has approached King's Lynn's Smile Dental Care for comment. "
    ]
}