{
    "articleURL": "/columnists/article-12053029/AMANDA-PLATELL-wish-King-Charles-not-making-Camilla-Queen-today.html",
    "content": [
        "How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk This morning my friends and I will be excitedly gathered around my wide-screen, high-definition TV to catch every detail of the Coronation in all its splendour.Union Jacks will flutter at my windows, there will be Dubonnet and gins at the ready, quiches in the oven, a table laden with cocktail sausages, pork pies and, yes, even cucumber sandwiches.It is not every day you can celebrate the Coronation of your King, particularly one who served our late Queen so dutifully all his life and now, aged 74, assumes the mantle of Sovereign.Yet at the back of my mind I do have a concern — and it is a substantial one. I am uneasy that Camilla will be crowned Queen beside him.After all, the Queen never made her beloved husband Prince Philip our King. And while it’s true she was clear Camilla should be formally made Queen Consort — a generous gesture given Her Majesty once referred to her as ‘that wicked woman’ — Charles has gone one step further and declared her Queen.",
        "To be fair, Camilla never asked for this honour. But more importantly, nor did the British public.Like millions of loyal monarchists, I wish King Charles and Queen Camilla well. But why did he have to over-reach with Camilla when so many of us still have misgivings about her? A poll in the Mail this week mirrored my own concerns — naming the late Queen our most popular royal, Prince William in second place followed by his mother Princess Diana who died nearly three decades ago.Most telling was that Queen Camilla was near the bottom, along with Meghan, Harry and Andrew.However much Charles loves Camilla, his subjects do not share his adoration. And I’m afraid to say much of this has to do with Diana who, even in death, casts a shadow over today’s proceedings. It’s made more poignant by the fact that she feared the woman who got her husband would get to wear the crown. Today that comes to pass.Women of my generation lived through Charles’s betrayal and we can’t shake off memories of Camilla’s role in that desperately sad saga.That’s why as I watch today, I will feel uncomfortable when Camilla is made Queen — and hope it will not turn out to be a terrible mistake.Singer Taylor Swift is madly in love with little-known Brit rocker and ex heroin addict Matt Healy who smokes joints in interviews. This echoes supermodel Kate Moss’s disastrous relationship with ex addict rocker Pete Doherty.So a gentle reminder to multi-millionairess Taylor, opposites may attract but they can also often end in tears.Sheer cheek, Kendall!Accepted wisdom among fashionistas at New York’s Met Gala after-party is that less is more, if you want to grab attention among so many beautiful women. Kendall Jenner proved the point with her cheeky sense of humour. Was she channelling her inner Borat in that eye-watering thong over sheer shorts? ",
        "Kate and William prove a pint to HarryAs Harry prepared to fly to London for his one-day Coronation jaunt, William and Kate pulled pints in Soho pub the Dog And Duck and got the Tube home. Let’s hope the Spare spared a thought for his eco-warrior reputation as he clocked up the air miles for a few begrudged hours with Papa.How touching that William will make a moving tribute to both his father and stepmother after tomorrow’s concert. And it’s one in the eye for Harry, whose venom towards Camilla was unmasked in his book and who’ll be safely back in California trying not to choke on his kale smoothie as he sees how popular his estranged brother is.What a woke ninny our Archbishop of Canterbury is, inviting us all to pledge allegiance to the King — at home in front of the telly! That’s unlikely as, after a few drinks having watched the Coronation from 10 am, some of us will have trouble even standing.The Old Vic theatre warns its play Pygmalion has scenes of ‘coercive control’ as Eliza Doolittle, with her terrible accent, becomes sophisticated. Blimey, I wish someone had exerted coercive control over me. Maybe I’d have lost my own awful accent. Westminster wars Now we learn that ‘impeccably impartial’ civil servant Sue Gray had ‘multiple talks’ for at least four months with Keir Starmer to become his chief of staff, while she was investigating Boris Johnson over Partygate. The result of the Privileges Committee investigation into Partygate — which could decide Boris’s future — is due in May. It should be cancelled immediately as this Labour stitch-up stinks. The only investigation we need now is into Gray’s links with Labour.Labour should contain their jubilation over local election wins. William Hague won a huge number of seats in the locals before the 2001 general election — when the Tories were trounced by a second Blair landslide.No wonder Generation Z refuses to understand phrases used by older folk. ‘Flogging a dead horse’ is animal cruelty. ‘Back to the salt mines’ has echoes of slavery. ‘Burn the midnight oil’ means working more than four hours a day. ‘Bite the bullet’ is surely warmongering. And how offensive is ‘What’s the beef?’ — to vegans, not to mention fruitarians? ",
        "Heard done by After her very public divorce from Johnny Depp, Amber Heard has quietly moved to Madrid. Meanwhile Depp is making his movie comeback in Jeanne du Barry which is premiering at the Cannes Film Festival.Both came across as thoroughly awful people during their court proceedings, yet why is it that bad publicity recharges Johnny’s career — while Amber is left jobless and unheard?Announcing the opening of a new chain of restaurants, Jamie Oliver reveals he was so cocky as a child — working from the age of 11 in the pub his dad owned — that he used to be locked in the freezer to cool down. These days that would be called child abuse, yet he’s now one of our most successful and most loved chefs.A message to snowflakes that it’s hard work, determination and not whining about ‘issues’ that gets you a seat at the top table.Jodie screens her private life Jodie Comer is up for a Tony Award for her one-woman play Prima Facie.She is very privately dating American lacrosse player James Burke and, as of last year, lived with her parents in Liverpool. No social media to take note of, no selfies of the Killing Eve star.Just proves to all those celebs screaming invasion of privacy, if you want a private life, you can have it.Despite pouring sewage into our rivers and seas, water companies were fined only £10.5 million while rewarding bosses with bonuses totalling £30 million. When will the Government realise we treasure our waterways and would like to be able to swim in them untroubled by filth and the stench of fat-cat greed?"
    ]
}