{
    "articleURL": "/news/article-12043603/Family-Houston-man-mown-date-sue-drunk-traders-wife-driving-Porsche-100mph.html",
    "content": [
        "Relatives of Joseph McMullin, 33, have filed a suit against Kristina Chambers, 32, the wife of a wealthy Texas trader, after the horror crash in Houston on April 20McMullin was on a first date when Chambers ploughed into him while allegedly four times over the limitLawyers for his family have filed a civil suit against Chambers, who also faces criminal chargesThe family of a man killed by a drink driver during a first date has filed a lawsuit against the woman who ploughed into him while driving a Porsche at 100mph.",
        "Relatives of Joseph McMullin, 33, are suing Kristina Chambers, 32, the wife of a wealthy Texas trader, for at least $1 million after the horror crash in Houston on April 20.His family filed the lawsuit on Wednesday. The case has been likened to the tragic death of a newlywed bride killed by a drunk driving woman moments after she tied the knot last week.McMullin, an audio technician and music lover, had enjoyed a first date with Briana Iturrino and they were walking along a sidewalk at around 2.25am when the crash happened.Chambers, driving a Porsche 911 Carrera, allegedly lost control at a bend in the road and struck McMullin, who was flung 30ft and died at the scene.",
        "Chambers, who was allegedly four times the drink driving limit, appeared in court last week charged with intoxication manslaughter.Lawyers for McMullin's family filed a civil suit on behalf of his parents, Christopher and Lynn McMullin.Lead Attorney Jesus Garcia Jr, from Kherkher Garcia LLP, said: 'On behalf of the McMullin family, we have filed a civil lawsuit against Kristina Chambers, the woman accused of being responsible for the unspeakably tragic death of their son, Joseph. 'Our hearts are with the family of this wonderful young man who was senselessly struck down in the prime of his life.",
        "'Joseph McMullin was a cherished son, loving brother, proud uncle, and the most loyal friend.'Joseph's death was a needless tragedy caused by the reckless and illegal actions of a motorist who showed no regard for the safety of others.'As the McMullins continue to mourn their unimaginable loss, our team will do whatever is necessary to hold Ms Chambers accountable for her actions and furthermore deter others from exercising such indifference and disregard for others' lives.'The lawsuit said McMullin's family is seeking a jury trial to determine the payout, but that more than $1 million is being sought.A news release which announced the lawsuit said it bears a 'striking resemblance' to the death of Samantha Miller, 34, in a drink driving incident moments after her wedding.Miller, 34, was killed and her husband, Aric Hutchinson, 36, remains in a critical condition after they were hit by a speeding drunk driver when they left their wedding reception in a golf cart.They were allegedly rear-ended by Jamie Komoroski, 25, after celebrating their nuptials at Folly Beach, South Carolina, on Friday.",
        "Heartbreaking pictures showed the happy couple moments before tragedy struck, beaming as they were waved off by their guests with sparklers.McMullin's death was captured in horrifying surveillance footage that showed Chambers' $100,000 supercar careen off the road and into him before smashing into a pole. She has claimed that poor road conditions caused the incident.",
        "McMullin was flung about 30 feet from the wreckage and died at the scene. Iturrino said she met McMullin on dating app OK Cupid and they spent the evening at a karaoke night before walking to a nearby doughnut store. As they strolled along the sidewalk, Chambers allegedly sped down the narrow road and lost control at a curve, striking McMullin.'Immediately it was where's Joe,' Iturrino said. 'I thought he was on my left I didn't realize he was on my right. And then it hit me how close the car had been to hitting me.''I knew she was not going to make that curve, I knew she was going to come up on the sidewalk,' she said.Iturrino added: 'He didn't deserve to go like that, he didn't deserve to go now at all.'She added tearfully: 'I can't believe he's gone, and I watched it and also not being able to believe how close it was to almost being me.'I wish I would've gotten to know more about him. We'd been texting for a few days so I got to learn a little bit about him from those, I know that he loved his family.'Chambers lives in the Montrose area with her husband of six years, Xuan Si, a portfolio manager, in an expansive $1.5million home bought with a $1 million mortgage.",
        "Chambers entered the 339th District Court on Wednesday still visibly injured from the crash, in a wheelchair with her arm in a sling.Her lawyer, Mark Thiessen, said Chambers broke her leg and clavicle in the collision.",
        "Thiessen described Chambers as unemployed and noted for the court that her husband is the sole provider.Assistant District Attorney Kelly Marshall told the court Chambers' actions were criminal.'There was a lot of alcohol in her system,' Marshall said, adding that traces of suspected drugs — possibly Adderall and cocaine — were also found in her purse.Chambers told police that she drank a beer at 9:30pm but nothing else until the crash.Judge Te'iva Bell ordered that Chambers be held on a $50,000 bond and prohibited her from driving unless she gets a job.McMullin's family paid tribute to a doting uncle, music lover, and kind soul.Born in Houston, he graduated from Stratford High School and later Houston Community College.His mother Lynn, father Chris, younger brother Matthew and his wife Anna all recalled him as someone with a true love of life and a huge number of friends.'Good people are drawn to good people, and Joe had nothing but great people supporting, loving, and cheering him along,' his obituary states."
    ]
}