{
    "articleURL": "/wires/reuters/article-12058247/Chile-right-wing-parties-win-majority-vote-draft-new-constitution.html",
    "content": [
        "SANTIAGO, May 7 (Reuters) - Chilean right-wing parties won a majority of votes on Sunday to elect advisers to draft a new constitution, marking a sharp shift from a progressive majority that drafted a failed first constitutional rewrite.",
        "With 95.13% of ballots tallied, Chile's Republican Party, led by former conservative firebrand presidential candidate Jose Antonio Kast, secured nearly 35% of the vote.A separate coalition of traditional right-wing parties gained just over 20% of the vote, while President Gabriel Boric's left-wing coalition garnered about 29%. Centrist parties took the remainder of the vote.\"Today is the first day of a better future, a new start for Chile,\" Kast, who lost to Boric in 2021, said during a speech in Santiago. \"Chile has defeated a failed government.\"The final results will determine the exact make-up of a 50-seat Constitutional Council that will be in charge of drafting a new constitution. Articles will need a three-fifths majority to be approved.This is the latest step in a years-long effort to overhaul the country's dictatorship-era text after nearly 80% of Chileans voted to draft a new constitution in 2020 following violent protests against inequality.The constitutional advisers elected on Sunday will start drawing up a new constitution in June based on a draft compiled by 24 constitutional experts appointed by Congress in March. Voters will then approve or reject the new proposal in December.The first rewrite was drafted by largely independent and left-wing constituents and it focused on social benefits, environmental rights, gender parity and indigenous rights.",
        "It was considered one of the world's most progressive constitutions, but many voters found it too polarizing and the process was mired by controversies.Boric, who took office last March, rose to power on a wave of optimism surrounding reform, but his approval ratings have since plummeted as a struggling economy and rising crime have become the main concerns for voters.Boric also suffered a political defeat after throwing his weight behind the first rewrite, which was rejected by nearly 62% of voters. The president has since distanced himself from the process but vowed to support it.\"The government won't meddle with the process and will respect the entity's autonomy in its deliberation,\" Boric told reporters Sunday morning after voting, adding that the government would act as a guarantor and support requests from the new council.After Kast's victory speech, Boric spoke from La Moneda presidential palace in Santiago and called for unity and urged the opposition to learn from the previous failed attempt.\"I want to invite the Republican Party, that's won an unquestionable majority, to not make the same mistakes we made,\" Boric said. \"This process can't be about vendettas, but putting Chile first.\" (Reporting by Alexander Villegas and Natalia Ramos; Editing by Lisa Shumaker and Michael Perry)"
    ]
}