{
    "articleURL": "/sport/football/article-12041327/How-watch-Manchester-City-vs-West-Ham-Premier-League-tonight.html",
    "content": [
        "Manchester City host West Ham United in the Premier League this evening Pep Guardiola's men defeated Fulham 2-1 in their last league game  West Ham come into this evening's game off a 4-3 defeat by Crystal Palace  Pep Guardiola's Manchester City will be looking to go back to the top of the league when they host West Ham United this evening.",
        "City come into the game off the back of a 2-1 win away to Fulham - with Erling Haaland and Julian Alvarez scoring for Guardiola's side.The club are now two points behind league leaders Arsenal after the Gunners defeated Chelsea last night.As for West Ham, the Hammers come into the game off the back of a 4-3 defeat by Crystal Palace. David Moyes' side sit in 15th place and are four points above the drop zone.Mail Sport breaks down everything you need to know ahead of Manchester City's meeting with West Ham including how to watch and team news. ",
        "When is Manchester City vs West Ham?City's clash with the Hammers will take place tonight, with the game kicking off at 8pm.The game will take place at the Etihad Stadium, where City have won all of their last five games in all competitions.City fans will be confident heading into the game. The Manchester side have won three of their last five meetings with the Hammers. Haaland is City's top scorer this season, with 50 in all competitions. The Norwegian has scored five goals in his last five games. Michail Antonio is West Ham's top scorer this season, with 13 goals in all competitions. The forward has scored four goals in his last five games. ",
        "How to watchThis evening's clash between City and West Ham will be shown live on Sky Sports Main Event and Sky Sports Premier League, with coverage getting underway at 7pm.The game between the two teams will also be streamed on the Sky Go app.Highlights will be uploaded to the official Sky Sports YouTube channel after the game.Mail Sport will also be providing live coverage of Manchester City vs West Ham, so you can keep up-to-date with all the latest developments here.",
        "Team newsNathan Ake is in line to return to the side for the game after recovering from a muscle injury.The defender returned to full training recently after missing the last three games with a thigh problem. City are set to be without Kevin De Bruyne. The midfielder missed the Fulham game after suffering a slight knock towards the end of the Arsenal game.After scoring at the weekend, Julian Alvarez is expected to feature from the off.Erling Haaland is just one goal away from breaking the all-time record in a Premier League season and is expected to start from the off this evening.As for West Ham, the Hammers are set to be without Kurt Zouma. The defender picked up an ankle injury against Crystal Palace at the weekend.",
        "Moyes will also be without Gianluca Scamacca, who continues to be on the sidelines with a knee injury. Antonio is set to lead the line, with Jarrod Bowen, Lucas Pacqueta and Pablo Fornals operating behind the striker. Predicted Manchester City XI (3-2-4-1): Ederson; Walker, Dias, Ake; Stones, Rodri; Mahrez, Gundogan, Alvarez, Grealish; Haaland Predicted West Ham United XI (4-2-3-1): Fabianski; Coufal, Aguerd, Ogbonna, Cresswell; Rice, Soucek; Bowen, Paqueta, Fornals; Antonio ",
        "What's been said?Heading into tonight's clash with West Ham, Guardiola revealed that the Hammers have the ability to get a good result at the Etihad.'I don't control the results of the other ones, I'm too busy working on what we have to do tomorrow against West Ham', Guardiola sat at his pre-match press conference.'West Ham maybe didn't do in the Premier League the season they expected like they have for the past two seasons, but [David] Moyes has been exceptional and that doesn't mean the quality isn't there.'I will review their games against Liverpool and Arsenal a little bit and I will review the first game of the Premier League [season].'The weapons are there, they are a good team, they didn't do a good season like they expect but the weapons are there. I don't have doubts that in one game anything can happen that's why we have to be absolutely ready'. ",
        "As for the Hammers, Moyes is hoping his side can put up another good show and cause an upset this evening. 'You approach the fixture against Manchester City in the same you would any other fixture', Moyes said at his pre-match press conference.'We know we are playing a very good team. We have been to the Etihad a lot and it has been hard to win. But we have given them some really good games when we have played them, and the games have been really close.''I am hoping we can put up another good show'.Odds Manchester City to win - 1/6West Ham United to win - 13/1Draw - 6/1Man City to win each half, Erling Haaland to score and Man City to have most corners in each half - 4/1All odds via Paddy Power and correct at the time of publication. PredictionA win tonight will see City go one point above Arsenal in first place. As well as that, the side will still have a game in hand over the Gunners.Even without De Bruyne, the likes of Haaland and Alvarez will be enough to get the job done for Guardiola's side.As for the Hammers, the side have lost their last two games in a row and are only four points above the drop zone. ",
        "It'll certainly be a tough ask for the side to get the job done against an in-form City side.Prediction: 4-0 Manchester City "
    ]
}