{
    "articleURL": "/news/article-12060809/Resentful-Colorado-stepmom-Leticia-Staunch-GUILTY-murdering-stepson-Gannon-11.html",
    "content": [
        "Stauch was convicted of first-degree murder and three other charges MondayGannon was stabbed 18 times, then shot in the head and dumped over a bridgeStauch is said to have been resentful about being used as a babysitter  A Colorado woman has been found guilty of murdering her 11-year-old stepson and dumping his body in a suitcase.",
        "Letecia Stauch was found guilty on Monday of murder in the first degree, guilty of murder of a child under 12, guilty of tampering with a deceased human body and guilty of tampering with physical evidence in the death of 11-year-old Gannon.Stauch, who worked as an elementary school teacher for special needs children, will be sentenced later on Monday afternoon. Prosecutors say she killed Gannon because she was resentful about being used as a glorified babysitter. She Googled the phrase 'I hate my stepson.' ",
        "Stauch stabbed Gannon 18 times before beating him across the head four times and shooting him in the jaw in January 2020, 'obliterating' the young boy's skull, according to prosecutors. She killed Gannon while they lived in El Paso County, in the youngster's bedroom. Stauch then hid his remains in a remote area nearby, and later rented a van to drive the little boy's body to Florida, where she dumped it under a bridge in Pensacola.It wasn't found until March, around three months after he vanished.  The killer stepmom had tried to blame mental illness on her behavior, with her defense attorneys claiming she'd suffered a 'psychotic crack.'",
        "Her attorneys claimed it was the result of sexual abuse she'd suffered as a child.  But prosecutors said the extent of Gannon's injuries showed that she acted with intent, and that she was mentally-competent when she killed him. ",
        "Prosecutor Dave Young told the court: 'What does that tell you? Use your common sense. It’s not psychotic. It’s just strategic.'Distressingly Gannon tried to fight off his killer stepmom despite being drugged with hydrocodone, prosecutors say. Stauch is said to have wanted to end her marriage to Gannon's father, Al. Prosecutors say a photo she snapped of Gannon laying in his bed on the morning of his murder was further evidence of the fact she'd pre-meditated the plot.",
        "She texted it to Al, who was away serving with the National Guard at the time.  They say she used it to try and cover her tracks, by claiming she'd left Gannon in bed to go for a hike, only to come home to find he'd vanished. After killing Gannon, Stauch scrubbed the walls and floors of his bedroom, then put her bloody shoes and clothes in the washing machine.Prosecutors said this was further evidence that her crimes were pre-meditated. District Attorney Michael Allen said of Stauch's crimes: '(Gannon) deserved to live. He deserved to grow up and become a young man and someday have a family of his own. She took it all away.'",
        "Jan 27, 2020: Gannon Stauch is reported as a runaway; last seen by stepmother Letecia Stauch between 3.15 pm-4 pm Jan 30: Case is upgraded to a missing and endangered child's case due to his age, need for medication, winter weather and the length of time he's been missing  Jan 31: Letecia Stauch gives interview to KKTV saying deputies had threatened to shoot her and put her 17-year-old daughter in handcuffsFeb 4: Neighbor Roderrick Drayton shares surveillance video showing what appears to be Letecia returning home at 2.19pm without Gannon in her pickup truck; claims boy's father broke down in tears when he saw the video  Feb 5: District Attorney Dan May visits Stauch's home; Stauch family make YouTube statement to bring Gannon home Feb 7: Searchers use submersible remotely operated vehicle with sonar to scour a pond near Stauch family's homeFeb 8: Candlelight prayer vigil is held at Lorson Ranch   Feb 11: Letecia Stauch releases statement to Fox 31 claiming Gannon was in her truck on Jan. 27 and that later left with a 'friend' Feb 21: Ground search for Gannon is halted by investigation continuesFeb 28: Planned search for Gannon is called off without explanation Mar 2: Letecia Stauch is arrested in connection to the case. Stauch was charged with murder of a child under 12 years of age by a person in a position of trust, child abuse resulting in death and tampering with a dead body. Authorities announce that they don't believe Gannon is alive, but they haven't found his body. The investigation is ongoing Mar 5: Letecia is extradited from South Carolina to El Paso County, ColoradoMar 18: Remains on a boy are found in Pace, FloridaMar 20: Autopsy performed on child's remains tentatively identify the deceased as Gannon Stauch Apr 3: Leaked affidavit claims Letecia killed Gannon in his bedroom on January 27 and disposed of his body the next day. It includes photos of Gannon's room, mattress and walls covered in blood splatters. It also states Letecia 'lied to investigators on multiple occasions'  May 5: Court records reveal Letecia has been charged with one count of solicitation to commit escape after she planned to break out of El Paso County Jail in Colorado SpringsJan 21, 2021: Stauch is ruled mentally competent to stand trial Apr 3, 2023: Letecia Stauch goes on trial for murder in Colorado Springs May 8, 2023: Leticia Stauch is convicted of murdering Gannon "
    ]
}