{
    "articleURL": "/news/article-12048425/Cammeraygal-High-teacher-Eric-Wong-admits-upskirt-video-plot-Sydneys-north-shore.html",
    "content": [
        "Teacher secretly filmed female students in classPolice found hundreds of videos and photos on phoneEric Wong will be sentenced next Wednesday Do you know more? Email tips@dailymail.com A high school teacher has been exposed secretly filming up the skirts of female students, after a teenage pupil bumped into a whiteboard and found a hidden mobile phone pointed at her. ",
        "Physics teacher Eric Wong, 28, will be sentenced next week after admitting to two charges of filming a person's private parts without consent at Cammeraygal High School at Crows Nest on Sydney's north shore. Court documents said NSW Police officers found up to 300 pictures and 90 videos of girls in school uniform in his classroom, including 'up-skirt' photos and images focused upon their breasts.The Sydney Morning Herald, citing a police fact sheet, reported that video examples included Wong '(walking) up next to or behind the female students and whilst talking to them or observing them undertaking their science experiment.... discreetly positions his mobile phone in position to film private parts.'",
        "'In some video files the accused can be seen talking to the female victims and then glance toward his mobile phone (which) is then repositioned, making sure he capturing the stated areas of the female body.'Court documents indicated a 16-year-old girl became suspicious when she knocked a mobile phone out of its hiding place and 'formed the opinion ... (it) was purposely placed in an upwards position and was filming her'. Students at the school received a letter from principal Kathy Melky three days before Christmas informing them a 'serious criminal charge has been laid by NSW Police against a staff member'. ",
        "Mr Wong's LinkedIn profile shows he had worked as a chemistry and physics teacher for the NSW Department of Education for six years and graduated from the University of Sydney. Wong will be sentenced next Wednesday. The maximum sentence for filming a person’s private parts without consent is five years."
    ]
}