{
    "articleURL": "/femail/article-12042729/People-just-finding-H-lampposts-means-blowing-minds.html",
    "content": [
        "People learning what yellow H sign  means - and it's not for a helicopter pad!Some people are only now finding out what the H on a yellow sign attached to a lamppost means - and they cannot believe the answer.",
        "The signs, as some people incorrectly believe, do not indicate helicopter landing sites on Britain's suburbans streets.You have probably seen the bright yellow signs, emblazoned with a large black letter H, when you are out walking on the streets and on lampposts.While you may know what the H stands for, some people are only just finding out thanks to help from a Fire Service Video.South Yorkshire Fire and Rescue Service posted a video on TikTok, which said: 'POV: You've walked past these small yellow signs your whole life.",
        "'But it was today you realised, finally, after all these years, they are there to tell firefighters where the hydrants are.'The H stands for 'hydrant', showing fire fighters the locations of the water supply when they need to extinguish a fire. These can be very helpful if the hydrant cover is obscured in some way.As well as lampposts, the signs can also be attached to walls and small concrete slabs which protrude from the ground.While some people insisted that it was obvious what the H stood for, or that they had been taught it at school, for some it was a lightbulb moment.One TikTok commenter said: 'I never knew. Everyday is a school day thank you.'",
        "But one said they 'thought it was a helicopter landing pad'. This TikTok user was not alone with two other saying they 'thought it was H for helicopters'.",
        "The yellow H signs also have two numbers, one above and one below the central line of the letter.The top number refers to the size of the connection and the bottom is the distance from the sign.Therefore an H sign with a 100 and a 10 would mean the nearby hydrant has a 100mm connection and is within 10 metres of the sign.'Local Authority Fire and Rescue Services are usually responsible for the hydrant signage that you see above ground,' according to Hydrants Direct, who maintain and test privately owned fire hydrants."
    ]
}