{
    "articleURL": "/news/article-12056579/Chicago-gay-bar-refuses-sell-Bud-Light-beer-products-amid-Dylan-Mulvaney-controversy.html",
    "content": [
        "The Chicago gay bar, 2Bears Tavern Group, announced Thursday they will no longer serve Bud LightBar officials denounced the beer company's 'abandoned' support of their partnership with trans influencer Dylan Mulvaney It comes as Anheuser-Busch reported a 26 percent drop in sales amid backlash Chicago gay bars pledged not to sell Bud Light after Anheuser-Busch walked back their involvement with Dylan Mulvaney amid sales tanking by 26 percent.",
        "The bar with four locations throughout the Windy City, 2Bears Tavern Group, denounced Anheuser-Busch after the company 'abandoned' their support of Mulvaney, 26, on Thursday.CEO of the beer company Michel Doukeris addressed the mass backlash last week claiming that the partnership with Mulvaney was 'not a formal campaign or advertisement.'The 2Bears Tavern Group referred to Doukeris' response to the contention as 'cruel' and 'hateful' while insisting the beer company simply fed into 'anti-trans' criticism.The conflict comes more than a month after the beer company partnered with Mulvaney in March to celebrate her first year as a trans-woman.",
        "Doukeris downplayed the partnership with the trans-influencer during a Thursday earnings call with investors.  'We need to clarify the facts that this was one camp, one influencer, one post and not a campaign,' Doukeris said.The CEO attempted to repair its tarnished brand after announcing the partnership tainted the company and tanked sales. The collaboration also led to two marketing executives taking a leave of absence amid backlash.The disastrous marketing bid has seen sales for the American flagship beer plummet 26 percent, despite Anheuser-Busch reporting first-quarter earnings of $1.65billion.Investors were also told by Doukeris that Bud Light will triple its marketing spend this summer in a bid to woo customers back to the tarnished brand. ",
        "'We will continue to learn, meet the moment in time, all be stronger and we work tirelessly to do what we do best: Bring people together over a beer and creating a future of more cheers,' Doukeris said. Meanwhile, the LGBTQ+ Chicago pub slammed  Doukeris' attempt at damage control as an 'attack' on the country.'Anheuser-Busch's decision to drop its support of Mulvaney in response to ignorant and hateful objections by some of its customers shows how little Anheuser-Busch cares about the LGBTQIA+ community, and in particular transgender people, who have been under unrelenting attack in this country,' the bar wrote in a statement.'CEO Brendan Whitworth's excuse that Anheuser-Busch \"never intended to be part of a discussion that divides people\" was tantamount to saying that the rights and safety of transgender people are topics worthy of debate.' Bar officials further ridiculed Doukeris for his lack of 'care' for the LGBTQ+ community. Aside from Bud Light, the pub will also discontinue other Anheuser-Busch brands, including Busch Light and Goose Island 312.Several other LGBTQ+ activists have suggested Bud Light will go extinct.",
        "Stacy Lentz, the co-owner of the famous Stonewall Inn where many suggest the modern LGBTQ+ movement began, expressed sympathy for Mulvaney in an interview and believes people like her may begin giving up their Bud Lights.",
        "'As far as marketing, I hope and think they realized that as a brand they will be extinct in a few years if they are not fully on the side of equality, as that is what the Gen Z consumer expects and demands,' Lentz said. She also told Newsweek the brewery had 'missed an opportunity to stand by their commitment to the trans community by pandering to and giving into transphobic outcries.'Stonewall Inn, the New York City haunt, was where the 1969 Stonewall Riots launched, widely considered the beginning of the LGBTQ+ movement in the United States. The landmark is no stranger to controversy with the brewer, refusing to serve Bud Light during New York Pride in 2021 over Anheuser-Busch's donations to anti-LGBTQ+ politicians.  Lentz also said 'this whole thing was not handled well and she was caught in the middle of a horrible firestorm,' showing concern over Mulvaney in the wake of the backlash. ",
        "Mulvaney posted several videos and images on Instagram for the paid partnership on April 1, leading to an uproar of criticism. It is unknown exactly how much she was paid. Anheuser-Busch reported first-quarter earnings of $1.65billion, which topped Wall Street expectations. The brewer posted revenue of $14.21 billion in the period, which also beat forecasts, with the shares rising 6 percent since the beginning of the year and 12 percent in 12 months.",
        "It's unclear if the boycott had any impact on these figures, and whether a larger impact on the firm's finances will be visible for the second quarter of the financial year if the controversy and boycotts rumble on.  After the post on April 1, Anheuser-Busch lost more than $6billion in market capitalization in just six days.The beer giant's stock roughly traded at just over 5 percent decrease in the total share value and the company's market capitalization stood at $113.33billion."
    ]
}