{
    "articleURL": "/travel/article-12051647/Im-flight-safety-expert-heres-pilots-bus-drivers-sky.html",
    "content": [
        "Joji Waites is Head of Flight Safety at pilots' union BalpaHe argues here why being a pilot 'is far more than just flying the plane'READ MORE: Were the 50s and 60s REALLY the 'Golden Age' of air travel? It's a job summary all pilots will be familiar with – that they're just 'bus drivers in the sky'.",
        "But it's one that Joji Waites, Head of Flight Safety at pilots' union Balpa, argues is a myth. Here he lays out the reasons why a pilot's job 'is far more than just flying the plane'. PILOT NAVIGATORAs sophisticated electronic flight management systems were developed, the navigator's position was discontinued. Nowadays, every pilot needs to be able to get the aircraft from A to B. That means planning the route... checking the weather en-route, knowing which diversions are available and how to get to them. You must also be able to program and monitor the aircraft's onboard navigation systems and have a working understanding of how to navigate should these fail.",
        "PILOT ENGINEERLike the role of a navigator, this job has also been incorporated into that of the pilot.In modern airliners if a malfunction, abnormality or an emergency occurs, it is displayed on an electronic display panel and action must be taken to rectify the abnormal condition. However, despite the automation, pilots still need a comprehensive knowledge of aircraft systems to be able to deal with problems that may occur and on occasions to be able to 'think outside the box'.PILOT COMPUTER TECHNICIANModern aviation is all about computers. Fewer people in the cockpit means more technology on board. But all this technology needs to be programmed and monitored and that's where the human comes in. Pilots today must understand a variety of computer systems that help fly the plane, navigate and communicate. When flying through the autopilot you never want to hear the phrase 'what's it doing now?' You need to be ahead of the aircraft and the automation at all times.",
        "MET OFFICERDo you know what haboobs are? Or how to identify a cumulonimbus cloud? Your pilot will. (FYI: Haboobs are violent and oppressive winds blowing in summer in Sudan and elsewhere, bringing sand from the desert. A cumulonimbus cloud is a dense towering vertical cloud associated with thunderstorms and atmospheric instability.)Weather has a big impact on flights. Pilots need to know if they need to de-ice the aircraft before take-off, take extra fuel to allow for diversions around thunderstorms or if they can expect turbulence on a sector. Part of the extensive training involves understanding meteorology and it's a skill pilots use all the time to keep flights safe.COMMUNICATIONS OFFICER",
        "On a typical day, pilots deal with other aircrew, ground crew, cabin crew, air traffic control and passengers to name a few. A pilot must be able to communicate well, not only in aviation terms (for example using the radio to speak to ATC), but also on an interpersonal level.For a start, pilots fly with so many different crews that they must be able to establish a rapport with other flight and cabin crew easily. They must be able to exchange information clearly with people they have never met before. A pilot also must communicate information to passengers. And that's where the next part of the job spec comes in.",
        "CUSTOMER SERVICES MANAGERA pilot's primary concern is always the safety of the flight. But pilots take pride in ensuring their passengers receive the best possible service. Explaining a technical problem that's caused a delay, letting them know the weather at their destination or pointing out the opportunity to see a famous landmark as [they] fly past can all add to a passenger's experience of a flight. Pilots are much more than just plane drivers – they are skilled professionals who are part of a vital safety system that works to ensure passengers, crew and cargo arrive safely at their destinations Joji Waites, Head of Flight Safety at pilots' union BalpaPROBLEM SOLVERAs well as being responsible for their passengers, a captain has the ultimate responsibility for all the crew on board. Understanding their needs, flight time limitations, rest requirements, industrial agreements and supporting them in their dealings with passengers is a vital part of the job. Pilots can be away from home for extended periods and on occasions, people need supporting on a personal level.Not forgetting pilots can suddenly find themselves very close to terrorist attacks, military coups and natural disasters! Together with senior cabin crew members, this is another part of the role in the management and care of all the crew.",
        "ADMIN OFFICERThe masses and masses of paper that pilots used to deal with is diminishing rapidly with the introduction of electronic flight bags and iPads. However, the same information and requirements are there – just more in an electronic form. Pilots must ensure they have all the correct and relevant flight documentation and that any reports required from the flight are written correctly and filed in a timely manner.Overall, being a pilot is a job Balpa members find interesting and varied. The skilled pilot is part of an intricate safety system that mitigates risks and keeps passengers safe. Pilots are much more than just plane drivers – they are skilled professionals who are part of a vital safety system that works to ensure passengers, crew and cargo arrive safely at their destinations. As pressure increases from some parts of the industry for operations with a further reduction in crew numbers – maybe eventually leading to fully autonomous operations – the recognition of these skills and the safety added value of a multi-crew cockpit is more important than ever.The above is an extract from a blog post Joji wrote for Balpa. Click here to read it. For more on Balpa visit www.balpa.org."
    ]
}