{
    "articleURL": "/wires/reuters/article-12038005/Brazil-lawmakers-vote-controversial-bill-clean-social-media.html",
    "content": [
        "By Anthony Boadle",
        "BRASILIA, May 2 (Reuters) - Brazil's lower chamber of Congress will vote on Tuesday afternoon on an internet regulation bill that cracks down on fake news and has become a battleground between big tech firms and the Brazilian government and its allies.Bill 2630, also known as the Fake News Law, puts the onus on the internet companies, search engines and social messaging services to find and report illegal material, instead of leaving it to the courts, charging hefty fines for failures to do so.Companies would also have to pay content providers and copyrights on material posted on their sites.The Brazilian proposal is shaping up to be one of the world's strongest legislations on social media, comparable to the European Union's Digital Services Act enacted last year.Big tech firms such as Google and Facebook say the bill is a recipe for disaster, was too hastily created and will have the opposite result of rewarding those who post disinformation since platforms have to pay people who post undefined journalistic content. They also say it will endanger free posting services for users while allowing censorship as practiced in authoritarian societies.Brazil's Justice Minister Flavio Dino has asked the consumer protection authority to investigate whether the companies engaged in \"abusive practices\" in campaigning against the bill. Dino will hold a news conference at midday on Tuesday.",
        "To support the bill, human rights advocacy group Avaaz placed 35 backpacks on the grass esplanade opposite Congress in memory of the 35 school children and teachers killed in violence at schools in Brazil that was influenced by social media.One of the bill's authors who will report on it to Congress, Representative Orlando Silva of the Communist Party of Brazil, said the law is needed to curb fake news that has poisoned Brazilian politics and impacted elections.\"Fake news led to the storming of government buildings on January 8 and has caused an environment of violence in our schools,\" he told Reuters.The bill was fast tracked in the lower house after a series of fatal attacks in schools which social media allegedly encouraged, and new articles added to the bill have not been debated in Congressional committees before going to the vote.Last month, a man armed with a small axe killed four children in a daycare center in southern Brazil and one week before, a teenager stabbed his teacher to death in Sao Paulo.Google placed a link for all Brazilian search engine users that says: \"The fake news bill can increase the confusion about what is true or false in Brazil\" while urging readers to call their representatives to vote against it.",
        "\"We need to debate Bill 2630 in more depth ... We are committed to continuing to find new ways to support news production and combat misinformation in Brazil,\" Google Brasil CEO Fabio Coelho wrote in a blog.Silva, the bill's rapporteur in Congress, said the big tech companies were using their vast resources and reach on the internet to campaign against regulation with art.\"They want to earn more and more. The role of the state is to stop abuses happening,\" he said. (Reporting by Anthony Boadle and Ricardo Brito; Editing by Josie Kao)"
    ]
}