{
    "articleURL": "/wires/reuters/article-12059095/Closing-arguments-set-rape-defamation-suit-against-Trump.html",
    "content": [
        "By Luc Cohen and Jack Queen",
        "NEW YORK, May 8 (Reuters) - A jury in Manhattan federal court is set to hear closing arguments on Monday from lawyers representing Donald Trump and writer E. Jean Carroll in her civil lawsuit accusing the former president of raping her in the 1990s and later defaming her.Trump's attorney Joseph Tacopina told U.S. District Judge Lewis Kaplan last Thursday that his client waived his right to testify in the trial and also opted not to present a defense in the case, gambling that jurors will find that Carroll had failed to make a persuasive case.Trump has so far not attended the trial, which began on April 25, but told reporters in Ireland last Thursday that he \"probably\" would attend. Kaplan has scheduled closing arguments for Monday, with jurors due to begin deliberations after that.Carroll, 79, filed her lawsuit last year against Trump, 76, claiming he raped her in a dressing room at the Bergdorf Goodman department store in Manhattan in 1995 or 1996, and then defamed her by denying it happened. The former Elle magazine advice columnist is seeking unspecified monetary damages.Trump, who served as president from 2017 to 2021 and is the current frontrunner for the Republican U.S. presidential nomination in 2024, has said Carroll made up the allegation to drive sales of her 2019 memoir.",
        "Her defamation claim concerns an October 2022 post on Trump's Truth Social platform in which he called her allegations a \"complete con job\" and \"a Hoax and a lie.\"Carroll said during three days of testimony and cross-examination that during the alleged attack, Trump slammed her against the wall, put his fingers into her vagina and then inserted his penis.Two of Carroll's longtime friends testified that she told them about the attack shortly after it occurred and said they believed her. Jurors also heard from two other women who said Trump sexually assaulted them in separate alleged incidents decades ago. Trump denies those claims as well.In a video deposition played for the jury last Wednesday, Trump denied raping Carroll.\"It's the most ridiculous, disgusting story,\" Trump said in the video, hunched over a conference table as Carroll's lawyers presented documents to him. \"It's just made up.\"(Reporting by Luc Cohen in New York; Editing by Will Dunham and Noeleen Walder)"
    ]
}