{
    "articleURL": "/femail/article-12053731/British-Vogue-Editor-Edward-Enninful-arrives-Westminster-Abbey-Coronation.html",
    "content": [
        "Edward Enninful looked to be in deep conversation with Katy Perry as he arrived at Westminster Abbey  CORONATION LIVEBLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk British Vogue editor Edward Enninful put on a dapper display as he arrived at the Coronation in a chic, single-breasted blazer.",
        "The fashion-world A-lister, 51, who was once pals with Meghan Markle, has over the past few weeks praised King Charles III for his 'charm' and said he can 'evolve with the times' despite being head of an imperfect institution.As he arrived to Westminster Abbey, Edward appeared in high spirits as he added a Springtime touch to his ensemble with a blue double breasted waistcoat and bespoke black morning suit by Savile Row tailor Huntsman.The once-model also sported a navy tie as he looked to be in deep conversation with singer Katy Perry - who is a part of the star-studded line-up for the Coronation Concert tonight.The American pop star, 38, opted for a glamorous fitted all-pink look in a skirt and blazer, with fashionable matching evening gloves.",
        "Leaning into British fashion, Katy wore a glamorous lilac headpiece and ornate pearl chocker, while holding onto a white clutch for the festive day.It comes as Edward was full of compliments for the King as he penned the monarch's entry in Time Magazine's 100 Most Influential People of 2023 list.The fashion editor, who is also an ambassador for Charles's charity, The Prince's Trust, made note of how the organisation helped people he knew into work when he was a child living on a council estate in west London.",
        "Noting that the King 'didn't have to do any of it', he praised the royal, 74, for his commitment to improving opportunities for young people from underprivileged backgrounds.Writing the entry, Edward said: 'He could've let his privilege shield him from the realities of our hardship in a time when these were not a cause célèbre. But he always met us with an open mind and a listening ear.'He added that he believes the monarchy is 'not perfect' but that King Charles has the ability to modernise things.Edward's links to the monarchy don't end with King Charles, as he also developed a friendship with the Duchess of Sussex when he collaborated with her on an issue of British Vogue in 2019.The 'Forces for Change' issue put inspirational women including actresses Gemma Chan and Jane Fonda, and former New Zealand prime minister Jacinda Ardern on the front cover. ",
        "When it was published in the September, it was the fastest selling issue in the magazine's 104-year history, selling out in less than 10 days. The following year, Edward spoke to Sky News about criticism Meghan received when she joined the royal family, arguing that he didn't believe it was solely down to racism.Describing the Duchess as a 'brave woman', he said: 'Parts of it were probably racism, but it was more of an institution.'",
        "He added that while criticism was 'harsh', he 'wouldn't just blame it on racism', saying: 'She walked into an institution and everyone expected her to know the rules. And I think sometimes it takes a minute to understand the rules.' However he continued to say he believed the treatment of her was 'very unfair'.And this morning King Charles III's day of destiny has arrived as the world prepares to watch the historic first coronation of a UK monarch in 70 years at Westminster Abbey where Britain and the Commonwealth will hail its new monarch today.The royal had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the Abbey from 6am to get one of the prime 2,300 seats inside.On the the streets of London today - including on a packed Mall - there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast.",
        "Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations. Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning.She chose not to attend any of the other public engagements by his side, preferring to 'pace herself' and also ensure 'the day was about her husband', sources said.'She loves him unconditionally and always wants him to shine,' a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.'The calm before the storm – perhaps metaphorically as well as literally', a friend said with a nod to the dismal weather forecast, something the new King and Queen's celebrations have in common with the late Queen's Coronation in 1953.The Coronation bank holiday weekend will conclude on Monday with The Big Help Out, when members of the Royal Family will join volunteers working with local community organisations as part of an initiative to create a lasting legacy from the celebrations.Charles and Camilla, however, will leave for their Sandringham estate in Norfolk for a well-earned break.",
        "The Duke of Norfolk, who is organising the ceremony, said: 'The Coronation is an opportunity to bring our great nation, the realms and the Commonwealth closer together, plugging into the power of the past and promoting our shared values to the wider world with all that we have to offer.'Mr Sunak said the weekend would be a chance to reflect on the 'enduring nature of monarchy' and urged the nation to celebrate its history and culture.The Prime Minister added: 'Let's celebrate this weekend with pride in who we are and what we stand for. Let's look to the future with hope and optimism.'And let's make new memories, so we can tell our grandchildren of the day we came together to sing God Save The King.'"
    ]
}