{
    "articleURL": "/sport/football/article-12039655/David-Moyes-adamant-Declan-Rice-walk-Pep-Guardiolas-starting-XI.html",
    "content": [
        "There has been much debate surrounding the supremacy of Manchester CityDavid Moyes says Declan Rice would walk into any team - Pep Guardiola's sideCity are interested in Rice despite having Rodri - who has excelled this seasonThe Sunday morning debate on talkSPORT surrounded the supremacy of Manchester City and why, right now, there are no Premier League players at opposition clubs who would walk into Pep Guardiola's first-choice XI.",
        "Crash through the contenders and you can imagine Guardiola's responses. Harry Kane? We've got Erling Haaland. Alisson? We've got Ederson. Martin Odegaard? And drop Kevin De Bruyne or Ilkay Gundogan? Are you mad? Bukayo Saka or Marcus Rashford? Not when we've got Riyad Mahrez, Bernardo Silva, Jack Grealish and Phil Foden, thank you very much.John Stones' versatility in the way he is seamlessly stepping into midfield makes him a difficult man to replace. The same goes for Nathan Ake, who has improved immeasurably, while Manuel Akanji has appeared faultless beside Ruben Dias in this season's second half.Ahead of facing City at the Etihad Stadium on Wednesday, David Moyes weighed in on the debate. When Mail Sport told West Ham's manager that only one player made the grade once we had thought it over, and that man was Declan Rice, he concurred.According to Moyes, Rice would walk into any team - Guardiola's City included.",
        "'Declan is improving all the time,' Moyes said of his 24-year-old midfielder at his pre-match press conference. 'He's still young, and he's got a long way to go, but he's improving.'He's earned his right to play for England and every time he's come back from playing for England, I've seen someone new - with more confidence, with more about his game.",
        "'He's got leadership and things which will improve with age and time. But overall, he's been very good. Declan could play for any club. No doubt about that. He can play different roles as well.'He could quite easily fill in as a defender if required. He could play as an attacking midfield player. He could play as a No 6. He's got the ability to play in several different roles.'Rodri is ridiculously good. At the heart of a City team that controls possession, he has managed more touches of the ball than any other Premier League player this season.Rice's role for West Ham is different. As they do not dominate the ball, he tackles and intercepts, routinely predicting where the ball will be played as if he has a crystal ball tucked in his sock.But he has also improved in his creativity. The sight of Rice charging forward after winning the ball in front of his own box has become regular and, more often than not, he proceeds to play the right pass.Rice has been a privilege to watch this season, going from strength to strength ahead of a summer when the Premier League's big boys plan to test West Ham's resolve.West Ham fans do not want to lose their club captain. Their newest chant - 'one more year, Declan Rice, one more year' - tells us that. But there is a feeling of the inevitable about his impending exit once the bidding begins.",
        "Wednesday will be the England international's greatest challenge as he faces a City team who can make opposition defensive midfielders look like piggies in the middle. They flood the midfield - with Rodri, with De Bruyne, with Gundogan, with full backs - and pass it masterfully.",
        "Asked about the task facing Rice, Moyes said: 'It is very hard because they've got the ability to make you not be in the position you want to be in. They're so good. I watched them (at Fulham) on Sunday. But hey, that happens. We've got to go into it with the hope that we can get a result.'Rice's defensive nous will be needed in particular as West Ham face City without the injured Kurt Zouma. There is hope that, should they reach the Europa Conference League final on June 7, he will have overcome the ankle ligament damage suffered at Crystal Palace on Sunday.Despite City boasting a squad of superstars, Moyes is reluctant to hand them the Premier League trophy. With Rice's help, he hopes West Ham can throw a spanner in the works, a gift which would be gratefully received by Arsenal manager Mikel Arteta, who played under Moyes at Everton.'We have to be careful talking about City being champions,' Moyes said. 'Arsenal still have a great chance. Who knows what will happen.'"
    ]
}