{
    "articleURL": "/wires/reuters/article-12046477/As-turn-Drew-Rucinski-bid-halt-streak-vs-Mariners.html",
    "content": [
        "What's it going to take for an Oakland Athletics starting pitcher to win a game?",
        "Judging by the past two nights, Athletics right-hander Drew Rucinski could pitch a perfect game Thursday afternoon against the visiting Seattle Mariners and still wouldn't be guaranteed a victory.Oakland has gone 31 games without a win from its rotation, a major-league record to start a season. The Pittsburgh Pirates went 27 straight games without a win from their starters to begin last year.The Athletics can't fault rookie Mason Miller or JP Sears after each posted a quality start in the first two contests of the three-game series.Miller didn't allow a hit over seven innings in a 2-1 loss Tuesday. Sears pitched six scoreless innings Wednesday before AJ Pollock hit a solo homer in the ninth inning to tie the score. Pollock did the same in the eighth Tuesday. Eugenio Suarez added a three-run shot in the 10th as the Mariners rallied for a 7-2 victory on Wednesday.\"Outstanding job by Sears,\" Oakland manager Mark Kotsay said. \"Unfortunately, the back end and the bullpen just haven't been able to close it down.\"The Athletics' bullpen has blown a save in four consecutive games and is 3-for-12 in save opportunities this season.Lefty Kyle Muller, acquired in the trade that sent catcher Sean Murphy to Atlanta in the offseason, said the A's starters aren't thinking about the streak.",
        "\"Obviously every starter's goal is to go out there and do their best to help the team win, but we've got a good group of guys. It's not like a personal thing,\" Muller said. \"We all just want the team to win and if we do our job, that'll come. Nobody's really pressing for it.\"Rucinski (0-1, 4.76 ERA) will be making his second start of the season. The right-hander, who spent the past four seasons in South Korea, allowed three earned runs in 5 2/3 innings last Friday in an 11-7 loss to the Cincinnati Reds. The 34-year-old will be facing the Mariners for the first time.Seattle is scheduled to send right-hander George Kirby (2-2, 2.93) to the mound on Thursday. Kirby, 25, was 1-0 with a 4.43 ERA in four starts against Oakland last season as a rookie.Mariners manager Scott Servais, whose team has won three games in a row, admitted the past two nights haven't been masterpieces.\"Not the prettiest win,\" Servais said following Wednesday's game. .\".. But hopefully a couple of these late-inning wins will help calm the waters here a little bit.\"The Mariners got a boost as Julio Rodriguez returned to the lineup Wednesday, leading off as the designated hitter, after missing the previous two games with lower back soreness.",
        "But Jarred Kelenic, Seattle's hottest hitter, was ejected by home-plate umpire Nestor Ceja after striking out to lead off the sixth inning.\"There are certain things you can't say to the umpire,\" Servais said. \"And, unfortunately, when you say things and there aren't too many people in the stands, they hear everything. And that's what happened.\"--Field Level Media"
    ]
}