{
    "articleURL": "/tvshowbiz/article-12048807/Ex-premier-Kristina-Keneally-debuts-shock-new-look-announcing-latest-career-move.html",
    "content": [
        "Kristina Keneally has undergone a complete makeover just months after announcing her latest career move away from politics.",
        "The ex-NSW Labor premier, 54, has ditched her long bob, and debuted a shorter and sharper side-swept blonde cropped hairstyle at the prestigious annual Gold Dinner in Sydney on Thursday.The newly-appointed CEO of the Sydney Children's Hospital Foundation also showed off her toned biceps and glowing tan in a floor-length metallic gold gown, which featured a glittering bejewelled collar.She completed the look with statement earrings and heels and carried a white mesh purse. Kristina's visage looked youthful and was glowing thanks to a glossy makeup.",
        "Five hundred of the city's leading philanthropists and VIPs attended the event, which benefits the foundation.The charity hopes to achieve a double-digit target this year after the charity gala raised $9million last year. This year's Sydney Children's Hospitals Foundation (SCHF) Gold Dinner is set to raise millions to transform complex paediatric care in Australia. The gala will benefit The Children's Hospital at Westmead Kids Complex Care Centre, to be known as the Kookaburra Centre.",
        "It comes after Kristina announced in November she had taken up a new executive role, in the wake of her humiliating defeat at last year's federal election.The former Labor senator has been appointed CEO of the Sydney Children's Hospital Foundation.Kristina was toppled by Independent Dai Le in the fight for the south-west Sydney seat of Fowler last May - which had been a safe Labor seat.",
        "The charismatic leader said she was 'thrilled' to join the non-profit organisation, which described her as a passionate advocate for 'society's most vulnerable'.'I have long been inspired by SCHF and I am excited to join SCHF leadership team and build upon the great foundation to ensure we can continue to create an enduring and positive impact on children's health,' Ms Keneally said. The ex-NSW Premier copped flack this year when she was parachuted from her ritzy home in the city's northern beaches to the migrant community in the city's suburbs.But the seat was nabbed by Ms Le, a former refugee hailing from Vietnam.The independent won the seat by a narrow margin of less than 3000 votes.",
        "SCHF Board Chair, Mr Len Chersky said the charity was delighted to welcome the 'calibre' of the former NSW premier.'We know her voice and vision will help SCHF continue to make a positive impact on the lives of sick kids and their families through funding world-class healthcare and research,' Mr Chersky said.'Kristina is a fierce advocate for children and their families, as well as improving access to healthcare for kids.'Importantly, Kristina is a proven leader who has demonstrated her strength, discipline and composure during her career and will bring the strategic and leadership skills ... to achieve its important mission.'"
    ]
}