{
    "articleURL": "/wires/aap/article-12057029/NSW-Liberal-MPs-decide-fate-rising-female-star.html",
    "content": [
        "Simmering tensions over a prestigious parliamentary role have boiled over in the NSW Nationals, with the party dumping its leader and electing the MP for Dubbo as their new boss.",
        "Former minister Dugald Saunders became leader of the party on Monday afternoon after former leader, Bathurst MP Paul Toole, came under fire for supporting MP Ben Franklin in his push to become upper house president.The former radio presenter and sports broadcaster wants to reform the party, saying Nationals are more than someone \"sucking on straw in a paddock\".\"People have really forgotten what the Nats stand for,\" Mr Saunders told reporters on Monday.\"For some people, the NSW Nationals are sucking on straw in a paddock.\"We are a modern party, that represents modern people. That's young people, that's women and men, that's professionals, that's doctors and nurses, that's teachers.\"Before the vote, Mr Franklin's move was condemned by coalition MPs including Mr Toole.However, Mr Franklin contradicted Mr Toole's version of events, saying his leader encouraged him to pursue the role.\"At one point he said if the Liberals don't want you to do it, I think you should do it anyway because this is really good for us,\" Mr Franklin told the Sydney Morning Herald on Monday.He accused Mr Toole of giving in to pressure, saying he called him last week to \"say that I've asked you not to do it\".At a party room meeting on Monday, Mr Toole was rolled by his colleagues and replaced by Mr Saunders.",
        "It comes one month after Mr Toole narrowly survived another leadership challenge from the Dubbo MP.Mr Franklin is set to run for the role of president on Tuesday, and is being backed by his friend Premier Chris Minns, as well as the Greens.If he wins, the Labor government will have the upper hand in the Legislative Council, making it easier for the party to pass legislation.The premier said he would support any non-government member becoming upper house president, saying it would ease the functioning of parliament.\"We need progress when it comes to legislation,\" Mr Minns told reporters on Monday.\"The leader of the opposition has said he's going to work hard to block our agenda, which is his right.\"But it's my right, and my obligation to work hard to get our legislation through.\"Meanwhile, the Liberal Party backed rising star Natalie Ward, electing her as deputy leader after changing the party rules so she could take on the senior role.The result was a great outcome for the party and would modernise the party's rules, Opposition Leader Mark Speakman told reporters on Monday.\"I'm delighted today to announce that Natalie Ward has been elected as the deputy parliamentary leader,\" he said.Touted as a future leader, Ms Ward replaces Matt Kean as deputy after MPs voted to change regulations so upper house MPs can nominate to run for the position.",
        "Liberal leader in the upper house Damien Tudehope said ahead of the meeting he hoped his colleagues would support the change.\"I think it is eminently sensible,\" he told reporters on Monday.Mr Speakman, the former attorney-general, was elected Liberal leader more than two weeks ago after running for the top job as a \"united team\" with Ms Ward and Mr Tudehope.Prior to the March election, Ms Ward tried to switch to the lower house in a bid to pursue her leadership ambitions, but was defeated in a preselection battle in the safe Liberal seat of Davidson."
    ]
}