{
    "articleURL": "/wires/ap/article-12055865/Eovaldi-throws-8-scoreless-innings-Rangers-beat-Angels-10-1.html",
    "content": [
        "ANAHEIM, Calif. (AP) - Nathan Eovaldi threw eight scoreless innings and the Texas Rangers defeated the Los Angeles Angels 10-1 on Saturday night.",
        "Eovaldi (4-2) followed up a complete game shutout against the New York Yankees last Saturday by taking his scoreless streak to 20 innings. He allowed five hits and two walks, helping the Rangers snap a four-game road losing streak.\"He gave us what we needed,\" Texas manager Bruce Bochy said. \"He´s such a competitor.\"Eovaldi is the first Ranger to post consecutive starts of at least eight scoreless innings since Martin Perez in 2014. Although Eovaldi was up for the challenge of trying to become the first pitcher in the majors with consecutive complete game shutouts since Mike Montgomery did it for Seattle in June 2015, Bochy overruled him, in part because Texas piled on seven runs in the ninth.\"I felt like I had gas left in the tank,\" Eovaldi said. \"I mean, I would have loved to go back out there and finish the game, but anytime we can score a lot of runs, I understand that scenario.\"Eovaldi ran into his only bit of trouble in the fifth inning, facing Mike Trout with runners on first and second and two outs. But he got Trout to ground into a force out at second.",
        "\"I feel like I got to be aggressive in those scenarios,\" Eovaldi said. \"I´d been attacking Trout. ... I just went with my strengths, and I was fortunate, I think it was `Zeke´ (Ezequiel Duran) was able to make a really good play where he got the force out.\"",
        "Jonah Heim had three RBIs, Marcus Semien and Travis Jankowski each drove in two runs, and Robbie Grossman got a hit for the 14th straight game.Reid Detmers (0-3) allowed three runs on seven hits and two walks in four innings, Tucker Davidson was tagged for seven runs in 2/3 of an inning, and the Angels had their five-game winning streak broken.\"It looks ugly, I know, in the box score, but at the end of the day it was a three-run game going into the ninth and the same game we won last night,\" Angels manager Phil Nevin said. \"Just didn't work out for us.\"Brandon Drury hit a solo homer in the ninth to keep Los Angeles from being shut out for the first time this season.GOING STREAKINGGrossman singled in the third inning, extending the longest hitting streak by a Ranger this season. It also tied the longest hitting streak of Grossman´s career, matching a 14-game stretch August 13-27, 2013.GROWING PAINSThe Rangers were able to load up the pitch count on Detmers in the crucial fourth inning when they got their first three runs, and Nevin thought the unpleasant experience will be valuable for the third-year lefty.\"It´s just more figuring out how to navigate through a baseball game,\" Nevin said. \"You can look great. ... The first three innings, I think he struck out seven, and got away from him a little bit there in the fourth.\"",
        "TRAINER´S ROOMAngels: 3B Anthony Rendon was held out Saturday because of a sore thumb. He sustained the injury Friday, colliding with C Matt Thaiss while trying to field a bunt.UP NEXTRangers LHP Martín Pérez (4-1) has gotten off to an effective start, including allowing one earned run in 12 1/3 innings over his past two appearances. The Angels will be looking for LHP José Suarez (1-1) to pick up where he left off after tossing five scoreless innings in a 3-0 win at Milwaukee on Sunday.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}