{
    "articleURL": "/femail/article-12054185/Harry-Jack-Brooksbanks-bromance-Eugenies-husband-princes-ally.html",
    "content": [
        "Harry, 38, was snapped beaming with Princess Eugenie's husband todayREAD MORE: Prince Harry grins at Heathrow as he jets back to LARoyal experts predicted that Prince Harry might have a lonely time at his father's coronation today, with members of The Firm choosing not to speak with him.",
        "However, as photos from the event show, the Duke of Sussex, 38, who attended the event without his wife the Duchess of Sussex, 41, had at least one good friend on hand.Images from today's proceedings show Harry beaming, as he appeared to share a joke with Jack Brooksbank, 37, the husband of Princess Eugenie as they stood outside the Abbey.Meanwhile, when inside, Prince Harry was seated in the third row between Jack Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for 10 years.They were joined by Prince Andrew's daughters Eugenie, 33, and Beatrice, 34, and her husband Edoardo Mapelli Mozzi. ",
        "A photo of Jack and Harry at their seats seems to show them enjoying a conversation. Lip reader Jacqui Press told MailOnline that the two men may have been discussing someone lighthearted as they waited for the historic ceremony to begin.She claimed the Prince smiled at Mr Brooksbank and said: 'That’s funny, mmm interesting'.To an unknown question from Mr Brooksbank, Prince Harry said: 'About quarter to 4?'Mr Brooksbank then replied: 'Oh really, when?' to which the Duke responded: 'I think tomorrow...'Today doesn't mark the first time Harry has been spotted joking with his cousin's husband.Images taken at the Queen 's Service of Thanksgiving at St Paul's Cathedral, during the late monarch's Platinum Jubilee, also show the men enjoying a joke.",
        "The Duke, wearing a black suit adorned with military medals and a silver tie, couldn't resist larking around in the pews of St Paul's, sharing a joke with Jack.",
        "Prince Harry and Jack were spotted giggling ahead of the historic service, with Princess Eugenie, dressed in a striking orange dress, appearing to also stifle a laugh.Harry's friendship with Jack could be a result of the bond he shares with Eugenie, which is said to be very close. Despite being born five years apart, Harry and Eugenie often spent time together as children thanks to the friendship between their mothers Princess Diana and Sarah Ferguson, who would pack up the children for joint family holidays.And Princess Eugenie became the first member of the Royal Family to make a public visit to Prince Harry in California, two years after he quit as a senior royal.",
        "In addition, Eugenie and Jack have spent time living in the Sussexes' Windsor home, Frogmore House, with their two-year-old son August. And Harry opened up about the close relationship he shares with Eugenie in his autobiography Spare, in which he discussed how she was the first Royal to meet Meghan.Of this first meeting, Harry wrote: 'I remember Euge hugging Meg as if they were sisters.'And during the Sussexes' Netflix special, Harry and Meghan explained how they partied with Princess Eugenie and her now husband Jack the night before their romance was made public.",
        "Eugenie was reportedly among the first to know about Prince Harry's relationship with Meghan, whom she already knew through their mutual friend Misha Nonoo.In October 2016, Prince Harry received a call from his communications secretary Jason Knauf who informed him that the news of his new relationship had reached the press.Megan recalled: 'Well, if it's going to come out tomorrow, let's go and have fun tonight!'Harry added: 'We went to this Halloween party together, where we could be completely dressed up and no one would know. I had a bandana and goggles on.'Sharing photos from their night out, Meghan said: 'His cousin Eugenie and her boyfriend of the time Jack and my friend Marcus were there too. It was so great. Just silly fun.'"
    ]
}