{
    "articleURL": "/wires/aap/article-12058589/Broncos-undaunted-dirty-dozen-losses-Storm.html",
    "content": [
        "Prop Corey Jensen says Brisbane have a \"history be damned\" mentality ahead of their trip to Melbourne on Thursday night.",
        "The Broncos have not beaten the Storm at any venue since 2016 and have a losing streak against them that now numbers a dirty dozen.While players such as captain Adam Reynolds, prop Martin Taupau and second-rower Kurt Capewell have tasted victory over the Storm at other clubs, there will not be a single player at AAMI Park in the 17 who has had a win over Melbourne whilst playing for the Broncos.The only survivor in the Broncos' top 30 from the 2016 team who beat the Storm 26-16 in Melbourne is winger Corey Oates but he is unavailable due to a knee injury.\"They are a bogey side for us and will be up for the challenge on Thursday night. It is one I am looking forward to,\" Jensen said.\"(The losing record) has been mentioned a fair bit but we haven't read too much into that. We know what our game is about and if we perform at our best we give ourselves every opportunity to perform well there.\"This group is a lot different to what we've had in previous years and we are playing a lot different footy. We take a lot of confidence out of what we have done so far but are under no illusions it is going to be a big test.\"",
        "The Broncos are on top of the table on 16 points, four points clear of the Storm in sixth. The Broncos' season kicked off with an upset 13-12 away win over Penrith that gave the side belief.\"No-one gave us a chance on the outside but we knew internally what we were about,\" Jensen said.\"We had a massive pre-season for that Penrith game and worked really hard on our defence and that has held us in good stead.\"We have only lost two games this year but ... we still have a lot more improvement in our side and are just touching the surface of the potential of this group. We are all about doing the little things right, working hard for each other and getting the effort areas right.\"Jensen said giant Storm prop Nelson Asofa-Solomona was \"a huge challenge, a big human and playing great footy\" but the Broncos have the Dally M Medal leader Payne Haas to take them forward.\"Payne is the best front-rower in the game at the moment and his game has gone to another level,\" he said.\"It is just about us going with him. We have a great middle rotation at the moment. Payne leads the way with Patty (Carrigan) and Flegie (Tom Flegler) and it is up to us on the bench to maintain that.\""
    ]
}