{
    "articleURL": "/tvshowbiz/article-12042645/Pixie-Lott-shows-new-short-hairstyle-enjoys-al-fresco-pub-meal.html",
    "content": [
        "Pixie showcased her dramatic new hairstyle as she had a pub meal with her husband Oliver Cheshire on Saturday.",
        "The singer, 32, who first revealed her pixie cut on social media, looked stylish for the outing in London, wearing a ruched purple top and Tommy Hilfiger jeans. She added a pair of large purple Versace sunglasses to the look, grinning as she had quality time with Oliver. Her model husband, who she married at Ely Cathedral in 2022, wore a white cardigan, jeans and trainers for the excursion.On their table were bags from the designer boutiques Matches and Monica Vinader. ",
        "Pixie and Oliver shared a bowl of chips and enjoyed some drinks together at the pub.It comes after Pixie debuted her stunning new hairstyle on her Instagram page earlier on Saturday.The singer took to Instagram to give her 751,000 followers a glimpse at her new hairdo as she modelled her gorgeous new look.Her newly-chopped blonde pixie cut featured a tapered hairline while a feathered fringe framed her stunning features.Pixie looked dramatically different from her usual choppy bob look as she posed up a storm for the gorgeous selfies.She cut a stylish figure in a black patterned dress with puffed sleeves and accessorised her look with a pair of silver earrings.The Cry Me Out hitmaker accentuated her natural good looks with a dewy make-up palette and a touch of blusher.",
        "Alongside the stunning snaps, she simply penned: 'Pixie cut.'",
        "It comes after Pixie took to social media to show off her eye-catching make-up look as she got glammed up in February.She posed in a cream slip dress after having her hair and make-up done by her team.Pixie's blonde locks were swept into two top knots, while she sported bright blue eyeshadow and pale pink lipstick.She accessorised with a series of gold rings, wearing dark green nail polish."
    ]
}