{
    "articleURL": "/sciencetech/article-12050585/Can-guess-odd-one-Google-challenges-AI-imposters-hidden-atworks.html",
    "content": [
        "Google is putting our ability to spot AI-generated content to the test The game shows four artworks and asks you to spot the one generated by AIFrom an image of Pope Francis wearing a puffer jacket to a snap of Donald Trump being arrested in New York City, several AI-generated images have fooled onlookers in recent months.",
        "Now, Google is putting our ability to spot AI-generated content to the test in a new game, called Odd One Out.The game shows players four artworks and tasks them with spotting the one that has been generated by AI.While it might sound easy, the game is fiendishly difficult, with the AI creating impressively convincing artworks.'Can you spot the odd one out? Guess the AI generated \"imposters\" hidden among the artworks on Google Arts &amp; Culture,' Google said.",
        "To play Odd One Out, visit the experiment website here, and click 'Launch Experiment.'Once you've read the game instruction, click 'Ready, set, go!'Four images of artworks will appear on your screen, and you must select which you think was generated by AI. If you get the answer correct, click next to see the next four artworks. If you get the answer wrong, guess again. But beware - you only have four chances before the game is over!",
        "The game is one of four new games launched by Google in collaboration with artists this month. 'Our artist residency program has been running since 2014 and supports artists &amp; creative coders experimenting with emerging technologies to solve a cultural challenge, or to connect audiences with culture online in new ways,' it explained. 'The starting point for these new experiments was applications of Google AI Image Generation Research to inspire cultural discovery and learning through play.'To play Odd One Out, visit the experiment website here, and click 'Launch Experiment.'Once you've read the game instruction, click 'Ready, set, go!'Four images of artworks will appear on your screen, and you must select which you think was generated by AI. If you get the answer correct, click next to see the next four artworks. ",
        "If you get the answer wrong, guess again. But beware - you only have four chances before the game is over!While Google's game is just good fun, several concerns have been raised about the dangerous of AI in recent weeks. ",
        "The second from the right is the AI-generated carThe second from the right is the AI-generated skirt The right is the AI-generated decanterThe second from the right is the AI-generated lycaenidThe second from left is the AI-generated rabbit ",
        "Elon Musk, Apple co-found Steve Wozniak and more than 1,000 tech leaders are calling for a pause on the 'dangerous race' to develop AI, which they fear poses a 'profound risk to society and humanity' and could have 'catastrophic' effects.The AI-generated image of Pope Francis, published on Reddit, made waves on the internet, ultimately because the public believed it was real.'I thought the pope's puffer jacket was real and didn't give it a second thought,' tweeted model and author Chrissy Teigen. 'No way am I surviving the future of technology.' Experts have also weighed in on the realistic AI image.Web culture expert Ryan Broderick said the pope image was 'the first real mass-level AI misinformation case.'The image, however, followed a gallery of fake photos showing what it could look like if Trump were arrested - but these were publicly known to be AI-generated. Bellingcat journalist Eliot Higgins created the images this month, showing Trump being chased down the street by police officers while his wife Melania screams.",
        "Others show the former President in jail wearing an orange jumpsuit.",
        "'Legit thought these were real,' one person tweeted, while another said: 'We should really be putting watermarks on these that disclose they are AI-generated and not real.' Deepfake videos and images have also seen a boom online, showing influential figures relaying misinformation.Meta CEO Mark Zuckerberg was used in a clip where he thanked Democrats for their 'service and inaction' on antitrust legislation.Demand Progress Action's advocacy group made the video, which used deepfake technology to turn an actor into Zuckerberg.More recently, in February, several female Twitch stars discovered their images on a deepfake porn website earlier this month, where they were seen engaging in sex acts.Currently, no laws protect humans from being generated into a digital form by AI."
    ]
}