{
    "articleURL": "/wires/ap/article-12048771/Trammell-Kirby-help-Mariners-complete-sweep-vs-Athletics.html",
    "content": [
        "OAKLAND, Calif. (AP) - Taylor Trammell homered for the second time in five days since coming off the injured list and drove in three runs as the Seattle Mariners beat the Oakland Athletics 5-3 Thursday to extend their winning streak to four games and complete a series sweep.",
        "Trammell feels his swing is coming together after missing the first 27 games of the season with a fractured hand.\"I feel very comfortable with it, especially balls out over the plate,\" Trammell said. \"Being able to not pull it, being able to take it to all different types of the field. That was exactly the plan.\"It worked out well for the Mariners´ left fielder, who has an .889 slugging percentage since his return.\"The biggest thing he´s brought is he has made some adjustments to his swing,\" Mariners manager Scott Servais said. \"That ball that he hit out today, he could not do that a year ago or anytime in the last few years. Didn´t swing hard, just trying to make contact. He´s got some kind of ability, the ball just jumps off his bat.\"George Kirby (3-2) pitched seven mostly strong innings for Seattle. Kolten Wong added two hits and two RBIs as the Mariners ended their nine-game trip with four straight victories after starting 1-4.",
        "\"Nice way to end the trip after we got off to a rocky start,\" Servais said. \"The mood around our club, this team believes in itself. And we know we´re not clicking on all cylinders yet, and that´s OK. But we do have to enjoy it.\"",
        "JJ Bleday hit his first homer of the season for Oakland.The A´s lost for the eighth time in nine games and fell to 6-26 (.188), the lowest winning percentage in the majors. They are 3-15 at the Coliseum. The game drew a crowd of 13,025, after getting only 5,268 for the first two games with the Mariners.Trammell, who recorded his first career grand slam Sunday against Toronto after being activated, hit a two-run homer off A´s starter Drew Rucinski (0-2) in the third and then drew a bases-loaded walk in the fourth when the Mariners had four two-out walks and scored three times to pull away.\"Scott talked about it earlier, just keep the baton moving,\" Trammell said. \"For me, that was the biggest thing, keep the line moving.\"The previous four losses for Oakland came as a result of blown saves by the bullpen. It didn´t get that far this time as the Mariners peppered Rucinski for five runs in 3 2/3 innings.Wong´s two-run single off Rucinski in the fifth made it 5-3.\"We´ve played better baseball in all facets. We just haven´t played it all at once,\" A´s manager Mark Kotsay said. \"Today we didn´t get good starting pitching, but our bullpen pitched and gave us a chance to come back.\"",
        "Kirby, coming off a 1-0, complete-game loss to Philadelphia on April 27, allowed seven hits and three runs in winning for the third time in four starts. Kirby walked one and retired 10 of the final 12 batters he faced.\"I would say it was not my best stuff, but I did a really good job of going inside on the guys all day with the sinker,\" Kirby said. \"A couple pitches I´d like to get back, but I did my job, went as long as I could.\"Justin Topa retired three batters and Paul Sewald worked the ninth for his ninth save.Rucinski had control problems in his third career start, walking five and allowing four hits in 3 2/3 innings.A´s starting pitchers remain winless in 32 games this season, the longest season-opening drought in major league history.ROSTER MOVESAthletics: RHP Jeurys Familia and RHP Domingo Acevedo were designated for assignment. RHP Adam Oller optioned to Triple-A Las Vegas. RHP Rico Garcia, RHP Spencer Patton and RHP Austin Pruitt were called up from Las Vegas.TRAINER´S ROOMAthletics: C Manny Pena (left wrist) had a setback in his recovery and is consulting with a doctor. ... RHP Adrian Martinez (strained right elbow) is slated to throw an extended bullpen Friday.",
        "UP NEXTMariners: RHP Luis Castillo (2-0, 1.82 ERA) faces the Astros in the first of a three-game series in Seattle beginning Friday. Castillo has faced Houston once in the regular season, striking out seven in six innings in June 2019.Athletics: LHP Muller (0-2, 6.28) pitches against the Royals in Kansas City on Friday. Muller has allowed 40 hits in his first six starts this season, tied for 10th most in the majors.___ AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}