{
    "articleURL": "/tvshowbiz/article-12043493/Chanel-Iman-displays-baby-bump-bikini-clad-Heather-Rae-El-Moussa-Brittany-Cartwright.html",
    "content": [
        "Pregnant Chanel Iman happily showed off her growing baby bump as she joined Heather Rae El Moussa and Brittany Cartwright for a beach photo shoot in Playa Del Rey earlier Tuesday. ",
        "The former Victoria's Secret angel, 32, who recently revealed she is expecting her third child on social media, soaked up the warm sunshine as the Selling Sunset star, 35, and Vanderpump Rules personality, 34, proudly showed off their post baby bodies. The trio paused for a slew of snaps with Los Angeles-based model, Bianca Mitsuko, who also took part in the photo shoot on the sandy shore. Chanel was seen sporting a silver, one-piece swimsuit that perfectly molded to her burgeoning bump and was securely held up with straps wrapped around her shoulders. Her locks were parted to the side, and flowed down naturally to barely brush past her shoulders, revealing a pair of dangly, hooped earrings. ",
        "Iman, who already shares daughters Cali, four, and Cassie, three, with ex husband Sterling Shepard, will welcome her first child with NFL star boyfriend, Davon Godchaux. Similar to the other stars, the mother of two, soon-to-be three, chose to not wear any sandals while striking a few poses on the shore. Heather, who entered motherhood after welcoming son, Tristan, earlier this year in January with TV personality, Tarek El Moussa, flaunted her stunning post-partum frame in a white, two-piece swimsuit made of a ribbed material. The bikini comprised of stylish, high-waisted bottoms along with a plunging bikini top that was secured with fabric tied into a bow near her upper back. ",
        "Her blonde locks were parted in the middle, and effortlessly flowed down in elegant curls, with some of the top strands braided away from her face. The star has given updates of her post baby body on her main Instagram page by uploading various snaps while celebrating her latest series, The Flipping El Moussas, and counting down the days until the season six premiere of Selling Sunset on May 19. Brittany Cartwright was all smiles as she showed off a few of her favorite poses while donning a brown-colored bikini that contained zigzag patterns throughout the material.Similar to Heather, the reality star slipped into high-waisted bottoms that offered a retro-inspired flare, as well as a supportive bikini top.  ",
        "The mother of one, who shares two-year-old son, Cruz, with fellow Vanderpump Rules star, Jax Taylor, parted her long locks to the side, allowing the strands to flow down in elegant curls. The beauty, who tied the knot with Taylor in 2019, added a pair of large, dangly earrings to accessorize her look for the photo shoot. Model Bianca Mitsuko, who is based in sunny Los Angeles, joined the trio while sporting a blue and white, floral pint bikini that also contained high-waisted bottoms. The four models could be seen standing underneath the shade of a yellow and white beach umbrella for an assortment of snaps. They also flashed big smiles as they strolled towards the cameras in other photos. ",
        "The sun shone down brightly on the stars as they took the pictures on the beachside area of Playa Del Rey, which is located just south of Santa Monica. In between shots, crew members and makeup artists were seen touching up their looks in preparation for another slew of snaps.  ",
        "On Wednesday, Chanel took to her own Instagram page to officially confirm her third pregnancy with the NFL pro defensive tackle. The two lovebirds, who publicly began dating in April 2022, donned all-white ensembles with a white backdrop directly behind them. Her baby bump was on full display, which her boyfriend gently caressed with his left hand. In the caption of the post, the star penned, 'Our family is growing and we are so excited to meet our new little one.' She shared a second post with additional snaps, and added, 'God is great! It’s all been a blessing.' Social media users flocked to the comment to express their excitement and congratulations, including Davon, who typed out, 'My love my everything! Soon to be mine forever.' ",
        "Fellow supermodel, Gigi Hadid, wrote out to Chanel, 'So happy for you!' while Winnie Harlow penned, 'Congratulations sweets.' Keke Palmer, who also recently became a mother in February, added, 'Congrats sista!!!!!' Earlier on Tuesday, Chanel debuted her baby bump in a social media post uploaded by her own publicist, Lori Krebs. ",
        "In a caption added towards the bottom of the fashionable snap, Chanel's publicist typed out, 'The sun was super blinding but they did an amazing job.' The supermodel was seen posing with Heather, Brittany, and also Bianca as they paused for a quick group photo together. Iman glowed wearing a dark green, drawstring bikini with tasseled details. She also slipped into matching bikini bottoms which was partially covered with a short skirt wrapped around her waist with similar fringed embellishments at the bottom. Heather donned a blue swimsuit which was covered with a sleeveless, semi-sheer white sundress that contained tasseled details at the hem. ",
        "Cartwright was also spotted joining in and rather than a bikini, she showed off her frame in a peach-colored, one-piece swimsuit while a sheer, white shawl was draped over her shoulders. Bianca placed her hand on her hip while modeling a blue swimsuit with patterned details on the top portion. Chanel was previously married to NFL wide receiver for the New York Giants, Sterling Shepherd, from 2018 until the football pro filed for divorce from the model back in June 2021, per documents obtained by People last year in January. She was first linked to Davon back in April of last year, and he already shares son, Davon Godchaux II, from a past relationship. "
    ]
}