{
    "articleURL": "/sport/nba/article-12044853/Boston-Celtics-rebound-Game-1-loss-defeat-76ers-121-87-blowout.html",
    "content": [
        " MVP winner Joel Embiid returned after missing Game 1 with a sprained LCL Celtics forward Jaylen Brown led the way for the Boston with 25 points in the win DailyMail.com provides all the latest international sports news Jaylen Brown scored 25 points and the Boston Celtics rolled past the Philadelphia 76ers 121-87 on Wednesday night, spoiling the return of reigning league MVP Joel Embiid.",
        "The Celtics tied the series at one game apiece as the Eastern Conference semifinals series shifts to Philadelphia for Game 3 on Friday.Malcolm Brogdon added 23 points, connecting on six of Boston´s 20 3-pointers. Derrick White and Marcus Smart added 15 points apiece. Jayson Tatum played most of the game in foul trouble and was held to seven points.Boston ratcheted up its defense and limited a 76ers team that hit 17 3-pointers in its Game 1 win to just 6 of 30 from beyond the arc on Wednesday. The Celtics led by as many as 36 points in the fourth quarter.Tobias Harris led the 76ers with 16 points. Embiid finished with 15 points, three rebounds and five blocks in his first game back from a sprained right knee that caused him to miss the final game of the 76ers´ first-round sweep of Brooklyn. He also sat out Philadelphia´s Game 1 win on Monday.",
        "Embiid´s return came a day after being voted MVP for the first time. He was cleared to play by doctors and training staff following a pregame, on-court workout. That was after he did some light work during the 76ers´ morning shootaround.Tatum picked up three fouls in the first half. He was called for his fourth at the 7:34 mark of the third quarter when he knocked Harden to the floor while trying to fight through a screen.",
        "It forced him to play a little less aggressively and helped Philadelphia cut what had been an 18-point Boston lead to 73-60 with just over four minutes to play in the third quarter.",
        "But Tatum´s teammates picked up the slack, leading the way as the Celtics closed the quarter on a 19-5 run to get it back up to 92-65 entering the fourth.Embiid started slowly offensively, but with the 76ers struggling to make shots from the outside, he made an almost immediate impact defensively.First, he blocked an early shot by Smart and then forced White to adjust another attempt. Embiid had five blocks his first 13 minutes of action.But his conditioning was noticeably lacking as he lumbered into sets at times. He played just shy of seven minutes in the first quarter before getting his first rest. He returned for the final 1:05 of the period.Embiid knocked down his first field goal of the night. a jumper over Grant Williams, with 21.4 seconds left before tripping as he backpedaled back down the court.He quickly rose to his feet. He finished the first half with 13 points, going 7 of 8 from the free throw line."
    ]
}