{
    "articleURL": "/sport/football/article-12054561/Lionel-Messi-better-player-Cristiano-Ronaldo-bigger-man.html",
    "content": [
        "Messi has been suspended by PSG for an unauthorised trip to Saudi Arabia He has the chance to join rival Cristiano Ronaldo in Saudi Arabia this summerThe Argentine star must now decide whether to turn down their lucrative offer With a decent sense of timing, the Saudi Tourism Authority sent out an email on Wednesday. It was titled: ‘Messi’s Riyadh trip uncovers the family side of the world’s most exciting new destination’. In catchier form, it boiled down to what football’s greatest talent chose over his day job in Paris.",
        "It was quite the read. With his wife and two of their three sons, we learnt Lionel Messi indulged in some fine dining this week at Bujairi Terrace in Diriyah. They also took in a palm weaving demonstration, marvelled at purebred Arabian horses and posed with a white falcon. Messi, the release told us, was ‘enchanted’ by the bird and they sent the pictures to go with it.That’s what you get for £25million a year – an ambassador. A globally recognised face for your campaigns. You get a bit of his time, his smile, his offspring, his stamp of approval. Visit Saudi, just like Messi does when he is meant to be honouring other contracts. Visit Saudi, ‘a perfect family-friendly destination’, as they wrote.If we are to pick at the nits of that, you might apply a disclaimer or two. It’s rather less family friendly if your family includes any young mothers who tweet support for the human rights of women. Or if they are gay. Or their surname is Khashoggi. And better not take them to Chop Chop Square, 20km or so from the Bujairi Terrace, on certain days either.",
        "You know the sportswashing dance by now. I bang on about it on occasion in this space and it seems to irritate Newcastle United fans. It can touch on Manchester City, too. And boxers, racing drivers, golfers, tennis players.",
        "They have all made their way to that teat, as will many more, and we know the discussion has broader nuances than good versus evil, just as we know everyone is entitled to enjoy sport in their own way. We could loop around in a righteous circle on that all day if the vinyl wasn’t so scratched.But for a moment let’s forego the bigger pictures of Saudi Arabia’s sporting buy-in and their motivations for doing it. We should focus instead on the pawn in their sights, which in this case is arguably the finest footballer to walk the earth.We can have a degree of certainty about the temptations Messi is experiencing around his immediate future, once the toxic finalities of his time at PSG conclude this summer. He has 320 million reasons to follow the golden path to Riyadh and, as with so much in his life, he might soon be close to Cristiano Ronaldo again. Messi and Ronaldo, Ronaldo and Messi, the never-ending tango of two legends.I disliked the Ronaldo move because he didn’t need to sell out - it was beneath him and he could more than afford to apply a few principles.But his willingness to shill for Saudi cash wasn’t a surprise. He was no longer the best player in the game, or part of that conversation, and his humiliations at Manchester United and the World Cup meant there was a timely tickle for an ego the size of the Arabian Peninsula by being the best paid. ",
        "Forget what he said about conquering Asia just as he had Europe – that line was less convincing than anything we might read about Messi and his new appreciation of birds.Which takes us to hawks and hawking, because Messi also doesn’t need to peddle himself like this. Not even five months have passed since he ticked the last box of such a wonderful career in Qatar, thus removing the only asterisk from his record. He did it. He completed the set. He was finally loved in deeper senses in Argentina, as he has been in Europe for even longer, and he did so by weaving his happy patterns in that glorious middle ground between elite functionality and sporting art.When I think of Messi, I think of beauty and brilliance. I think of Federer, Ali and Biles. Maybe a touch of Ronnie O’Sullivan. It is a subjective list and a short one. They’ve mostly had their flaws, too, especially Ali, and when we speak about Messi’s affiliations, we might conclude the falcon has long since flown on his moral reputation.After all, he is already on the payroll as a signed-up badge-kisser for the Kingdom’s Vision 2030 strategy, which was a decision he took despite the awkwardness of Saudi Arabia rivalling his own country in plans to host the 2030 World Cup. ",
        "But a move to play there would go far beyond all that. It would be full immersion and a willing acceptance for them to use his image to clean theirs. It would be the Saudi’s greatest PR victory, their thickest blanket yet over all the ghoulish things we might otherwise look at.Perhaps it won’t come to that. He has other options, of course, not least in Miami, and presumably any place he blindly plonks a finger on a spinning globe. But the Saudi Arabia can be awfully persuasive and these are not new discussions – I was told recently by a major sporting executive that Prince Abdulaziz, the Saudi sports minister, met with Messi in Paris in January. What they want, they tend to get.Personally, I hope it doesn’t go that way. To see reports of Ronaldo’s frustrations in his new world, you are inclined to wonder if he sometimes wishes he chose a different road as well, which brings to mind the surreal sight of his debut back in January.",
        "I went to Riyadh for that game, which naturally enough was an all-star exhibition against Messi and PSG. There was a good atmosphere on the night, because the Saudis do legitimately love football. But it was quite sad to see Ronaldo doing his siuuuus and his struts like some kind of performing seal. Like it still mattered in any meaningful way.",
        "On that day I noted the difference in how one titan was passing through the Kingdom on his victory lap and the other was staying put, infinitely wealthier and somehow poorer.Now Messi has that same choice and possibly it was always going to be this way. Messi and Ronaldo, Ronaldo and Messi.For my money, Messi was always the better player. The question is whether he can be the bigger man.As part of the LIV ruckus, Lee Westwood, Ian Poulter and Sergio Garcia have resigned their memberships of the DP World Tour, and in doing so have formally ended their wonderful relationships with the Ryder Cup. ",
        "‘A sad day,’ Westwood called it, and he blamed the European circuit for getting into ‘bed with the PGA Tour’. There’s a degree of truth in that. There’s also truth in a similar phrase – you make your bed and you lie in it.I went to see Neil Warnock in Cardiff a few years ago and it stuck with me how he couldn’t help laughing when describing his wife’s surprise that folk in the city quite liked him. Same now goes for Huddersfield, adding to pockets of Scarborough, Nottingham, Plymouth, Sheffield and London. Colin was always an amusing nickname for him; underrated was always a more accurate word."
    ]
}