{
    "articleURL": "/wires/ap/article-12053129/Bassitt-impressive-Blue-Jays-end-skid-Pirates-4-0.html",
    "content": [
        "PITTSBURGH (AP) - The settling-in process appears to be just about over for Chris Bassitt.",
        "The Toronto pitcher dominated the Pittsburgh Pirates over seven strong innings on Friday night as the Blue Jays rolled to a 4-0 victory to end a five-game losing streak.Bassitt (4-2), signed to a three-year, $63-million contract in December, struck out five against four walks to win his third straight decision. After a bumpy debut with the Blue Jays on April 2 in which he was tagged for nine runs in 3 1/3 innings, Bassitt has surrendered four hits or less in each of his last five starts.\"I think we're in a really good spot right now,\" Bassitt said.It helps that he's starting to find a rhythm with a new club, in a new league, in a new country after turning a solid 2022 season with the New York Mets into a lucrative deal to help Toronto keep pace in the AL East.There have been adjustments along the way, particularly behind the scenes, that have taken some getting used to. Yet, the 34-year-old certainly looks comfortable on the mound at the moment.",
        "\"Nothing really has changed, just a matter of just getting used to each other,\" Bassitt said. \"And I think we´ve done a really good job here. I´m beyond blessed to be a part of this team that has a core of guys that are super hungry.\"",
        "George Springer hit his fourth home run of the season for the Pirates, a two-run shot off Rich Hill (3-3) in the fifth inning. Whit Merrifield added two hits and stole three bases for the Blue Jays, who bounced back from a rough visit to Boston in which they gave up 32 runs in a four-game sweep by jumping on Pittsburgh early and riding Bassitt and two relievers the rest of the way.\"I felt like every day (in Boston) was 40 and raining in a crappy clubhouse and you were kind of doing the same thing over and over, waiting for the same result,\" Blue Jays manager John Schneider said. \"And sometimes a change of scenery is a good thing.\"The surprising Pirates began the day in first place in the NL Central, but have cooled off of late. They were swept during a three-game visit to scorching hot Tampa Bay and their offense may be starting to be feeling the long-term effects of missing injured shortstop Oneil Cruz (fractured left leg) and designated hitter/first baseman Ji Man Choi (strained left Achilles).Pittsburgh has mustered just six runs during its current slide, a span in which the Pirates are just 3 for 30 with runners in scoring position. Bryan Reynolds extended his hitting streak to 10 with a double in the sixth, Pittsburgh's lone extra-base hit.",
        "Pittsburgh has been one of the most aggressive baserunning teams in the league since the start of the season, and the Blue Jays were prepared for it. The Pirates ran into a pair of outs at third and another at home plate when Rodolfo Castro was thrown out while trying to score on a wild pitch in the second inning.\"It wasn't unexpected, it was just `This is going to happen, let´s make them make the plays and we (got them out),'\" Bassitt said.Hill has been getting by on savvy and the ability to vary speeds during his first six starts with the Pirates, with mixed results. It was more of the same against the Blue Jays. The 43-year-old struck out the side in the second - including getting Daulton Varsho flailing at a 68 mph curveball - but when he missed his spots, the Blue Jays pounced.TRAINER'S ROOMBlue Jays: Put right-handed reliever Zach Pop on the 15-day injured list with a right hamstring strain. Called up right-handed reliever Jay Jackson from Triple-A Buffalo.Pirates: Placed right-handed starting pitcher Vince Velasquez on the 15-day injured list with right elbow inflammation. ... Activated RHP reliever Chase De Jong (back) off the IL. ... DH Andrew McCutchen was a late scratch with a sprained left ankle suffered during pregame outfield drills. Mark Mathis filled in and went 0 for 3. ... 2B Ji Hwan Bae was removed from the game after tweaking his left ankle while running out a ground ball in the eighth.",
        "UP NEXTThe series continues on Saturday when Toronto's José Berríos (2-3, 5.29 ERA) faces Pittsburgh's Johan Oviedo (2-2, 4.78).___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}