{
    "articleURL": "/wires/reuters/article-12054279/King-Charles-coronation-draws-tens-thousands-braving-rain-cheer-monarch.html",
    "content": [
        "By Paul Sandle, Muvija M and Sarah Young",
        "LONDON, May 6 (Reuters) - Tens of thousands of people of all ages, from Britain and across the globe, braved the rain for a glimpse of the newly crowned King Charles in the streets of London and on Buckingham Palace's famous balcony on Saturday.From the early hours, people dressed in red, white and blue and clutching union flags and umbrellas lined the streets for the first coronation in Britain for 70 years, seeking to share a historic occasion and what many viewed as a moment of national unity.In crowns and regal robes, Charles and Queen Camilla appeared on the balcony with heir to the throne Prince William and other senior royals to watch a fly-past, scaled down due to the cloud and rain.\"It was a brilliant way to end what was already a brilliant day,\" said Katie Mitchell, 25, who had made it close to the Palace.\"It was amazing to see them all there in real life, just like you´d see on a postcard.\"Many in the crowd had brought stools or steps, to be able to see over the crowds, and wore elaborate fancy dress including paper crowns and plastic tiaras.While the service took place within Westminster Abbey strangers huddled together under umbrellas to see the ceremony on phones and iPads, or watched on big screens in parks.",
        "Following on his phone in St James's Park, Mick Windebank, 60, a builder from Surrey, said the moment the crown was placed on Charles' head was \"very emotional\".\"He's waited all his life for this moment. As sad as the passing of his mother was, it's his time,\" he said.Charles, 74, ascended to the throne in September after the death of his mother Queen Elizabeth.Toward the end of the two-hour service, crowds lining the procession route and listening on loud speakers joined in when \"God Save the King\", the national anthem, was played.For many spectators, the sight of eight horses pulling the 260-year-old Gold State Coach carrying Charles and Camilla back to Buckingham Palace brought home the sense of history unfolding.\"We have had a monarchy for hundreds of years and it is our connection with the past. Where else would you get these crowds?\" said Sarah Alms, a housewife in her 60s.POMP AND SPLENDOURAbout 4,000 officers were involved in the procession, which featured soldiers in scarlet coats and bearskin fur hats, military bands and dozens of horses.Those gathered had different reasons to be there.Many older visitors wanted to show their support for Charles and the monarchy, for some it was the beginning of a new era, while others simply wanted to celebrate and enjoy the pomp and splendour.",
        "The coronation took place amid a cost of living crisis and public scepticism, particularly among the young, about the role and relevance of the monarchy, and its finances.Charles, who had the longest wait for the throne of any British monarch, is not as popular as Queen Elizabeth, and his coronation did not draw the millions who thronged the streets to watch her crowning in 1953.A few hundred protesters from the anti-monarchy group Republic gathered among the wellwishers along the route, booing as Charles and Camilla went past and holding up signs saying \"Not My King\". The leader of the group was arrested before the procession started.But polls show the public generally approves of Charles as king and a majority still support the monarchy, even if younger people are far less interested.Sam Mindenhall, a 27-year-old cafe worker from Bristol in southwest England, said he thought Charles was trying to balance the tradition of a monarchy that dates back almost 1,000 years with the modern face of Britain.\"I think a lot of the issues that he cares about are quite important,\" he said, adding that Charles was \"trying to be more inclusive\". Others praised the king's well-known environmentalist views.The monarchy's appeal to tourists was also evident in the crowd, which was made up of nationalities from across the world.",
        "Manuel Olarte, who moved to London from Peru 40 years ago, streamed events on his phone for his family back home.\"I was surrounded by British people born in this country ... but I felt at home,\" he said.(Additional reporting by Andrew MacAskill, and Farouq Suleiman Writing by Kate Holton Editing by Alexandra Hudson, Angus MacSwan and Frances Kerry)"
    ]
}