{
    "articleURL": "/news/article-12049615/Pair-thugs-killed-Good-Samaritan-rushed-aid-girl-jailed-life.html",
    "content": [
        "Louis James did not appear in court after prison staff sent the wrong Mr JamesA pair of drunken thugs who murdered a Good Samaritan after he tried to stop them attacking a teenage girl have been jailed for life.",
        "Reece Radford, 26, was kicked and stabbed to death after he came to the aid of a 17-year-old girl who was being attacked by Dereck Owusu at a bus stop in Sheffield, South Yorkshire.Owusu, 40, and his friend Louis James, 47, who was carrying a knife, then attacked Reece, who had a seven-month-old daughter, kicking him a number of times before James fatally stabbed him in the chest.But James was not in Sheffield Crown Court for Reece's mother Laura Radford to see him face justice because Doncaster Prison staff sent another inmate called James by mistake.Instead, court staff had to hastily organise a video link to HMP Doncaster so Reece's killer could see the proceedings remotely.",
        "Barrister Stephen Wood KC, defending James, told the court: 'It is always preferable in a case as grave as this for a defendant to be present at court to receive his sentence.'Judge Sarah Wright replied: 'I certainly do agree, and it is quite astonishing that that mistake has been made and Mr James has not been brought here today.' Mr Wood acknowledged the 'anguish' that caused Reece's family, who were in court.Before the pair were sentenced for murder, Reece's step-father Mick Houghton, read out a victim statement from his his mother.",
        "She described Reece as 'the life and soul of the family', adding he would have been 'the best daddy in the world' to his daughter. 'He wasn't just my son, he was my best friend, my soulmate, my everything,' she said. The court heard that James, of Sheffield, and Owusu, of Rotherham, were talking and drinking with the 17-year-old girl at a bus stop in Arundel Gate when Reece passed by with a group of friends.",
        "Prosecutor David Temkin KC said that when Owusu punched the girl on September 29 last year, it was the 'catalyst' for Reece's involvement, and a fight broke out.Mr Temkin said both defendants were 'angry' with Reece, adding: 'What culminated was a joint attack by both defendants on a younger man, who found himself on the ground, face up, being subjected to serious violence.'He was then stabbed in the chest by James and was kicked in the head 'with vigour' by Owusu.Owusu then stole Reece's wallet and used his belt to 'thrash' it at those trying to help Reece by calling 999. James fled the scene and dumped the knife in a drain. Reece died six days later from a single stab wound to the chest. Sentencing the pair to life, with Owusu getting a minimum of 15 years and James 25 years, Judge Wright recounted how they had been drinking all evening and had been talking to the teenage girl for an hour before she was punched.",
        "She said: 'Reece Redford intervened. After a very short period of time you both proceeded to launch an unlawful joint attack upon him.'Reece Radford was unarmed and his actions never suggested he was about to produce a weapon.'"
    ]
}