{
    "articleURL": "/sport/tennis/article-12053325/Tennis-fans-outraged-gender-disparity-following-viral-images-birthday-celebrations.html",
    "content": [
        "Carlos Alcaraz given massive birthday cake at Madrid OpenWomen's world no.2 Aryna Sabalenka gifted smaller cakeOne tennis fan felt the differing cakes was 'misogynistic'The issue of gender equality has been raised by some past and present tennis players as well as fans after Carlos Alcaraz and Aryna Sabalenka both celebrated their birthdays on Friday with different sized cakes.",
        "Men's world number two Alcaraz, 20, was competing in the Madrid Open - and the Spaniard was handed an impressive multi-tier cake.It was in stark contrast to Belarus star Sabalenka, 25, who appeared to be short-changed with her single tier offering.Canadian world number 27 Bianca Andreescu called out the difference online, posting the two cakes 'didn't look right'.Former women's world number one Victoria Azarenka was equally dismayed.",
        "'Couldn't be more accurate on the treatment,' she tweeted.Many fans were also in disbelief, with one going as far to label tournament organisers 'misogynistic.''They are ranked the same and have the same amount of grand slams, Aryna [Sabalenka] even has more Masters [titles], but anyways I'm calling misogyny,' one fumed in response to the two contrasting images.Another stated: 'people are saying it's because he's Spanish [Alcaraz] and yeah I'm sure that is part of it.... but the size difference of the cakes is INSANE.'Tournament director Feliciano Lopez didn't hold back when he responded to Azarenka's tweet.'I'm surprised by this reaction after this gesture! 1. Carlos had just won his match to reach the final. 2. He was playing on centre court. 3. The tournament is played in Spain,' he tweeted.Both Alcaraz and Sabalenka - who also snared her maiden grand slam singles title at Melbourne Park earlier this year - have won through to their respective finals in Madrid this weekend."
    ]
}