{
    "articleURL": "/news/article-12050865/Fetterman-begging-men-mental-health-help-stint-Walter-Reed.html",
    "content": [
        "Pennsylvania Sen. John Fetterman said he's 'begging' men who are struggling with mental health issues to seek help as he's now 'better' 'I would beg - this isn't a matter of who's tough or who's not. I would just beg men, you're not too macho,' he told MSNBC's Joe Scarborough Fetterman sat down with Scarborough after telling KDKA Pittsburgh on Tuesday his mental health declined after 'vicious' Senate run against Dr. Mehmet Oz  Pennsylvania Sen. John Fetterman said he's 'begging' men who are struggling with mental health issues to seek help after his own stint at Walter Reed Medical Center made him 'better.' ",
        "After a local interview Tuesday with Pittsburgh's KDKA - where he said his 'vicious' 2022 Senate campaign against Republican Dr. Mehmet Oz led to his hospital stay - Fetterman was interviewed Thursday by Morning Joe co-host Joe Scarborough, with the first clips airing on MSNBC Friday morning. As May is Mental Health Awareness Month, Scarborough pointed to figures that showed men are less likely to seek treatment when suffering from depression and anxiety, adding, 'If you need help, get help, don't be too proud.''I couldn't agree more,' the Pennsylvania Democrat said. 'I would beg - this isn't a matter of who's tough or who's not. I would just beg men, you're not too macho. It's no big deal. The only person you're really going to hurt more than anyone else is actually your family.' Fetterman said he believed that he hurt his own children when he couldn't get out of bed after winning his 2022 Senate race. ",
        "'That's what's so insidious about depression,' he told Scarborough. 'You might win and it still feels like you lose.''I laid there, I laid there and watched this hurt my own children. Because they were confused. Because they thought just because you won, why aren't you - you should be happy,' he recalled. Fetterman stayed in the Senate race after suffering a stroke just days before Pennsylvania's Democratic primary last spring. ",
        "It kept him off the campaign trail for most of the summer.He returned to doing public events through the fall - though was slowed down by the after-effects of his stroke, which had created auditory processing issues.He described hearing voices like the adults on the Peanuts cartoons. ",
        "When talking to Scarborough, he was still assisted by closed captioning technology, in order to understand what the MSNBC host was saying. Due to the stroke, Fetterman's speech was still sometimes halting. Scarborough asked the Pennsylvania Democrat what the Biden administration and Congress could do to improve mental healthcare in the U.S. Fetterman noted, 'it's all of our challenges.'  'And we should have it because there might be a time when you're going to need the kind of programming like me to turn your life around,' he said. 'It's not a Democratic issue, this isn't a Republican issue, this is not hard right, hard left, this was jsut a human issue,' the senator added. 'I'm begging people get help if you can - and it works. Just like I refused to believe I could be made better.' After the clip aired, Scarborough previewed their full sit-down, which will air Monday on MSNBC at 8 p.m.  'He's determined to stay, he's determine to fight through this,' Scarborough told his wife and co-host Mika Brzezinski and a roundtable of guests. ",
        "He also noted that Fetterman got the most emotional about 'the love he felt from from Democrats and Republicans alike.''It's the first thing that he talked about,' Scarborough said. Fetterman was discharged from Walter Reed at the end of March. He returned to work in the Capitol when Congress came back from a two-week Easter recess in April. "
    ]
}