{
    "articleURL": "/money/markets/article-12054109/As-Jamie-Dimon-stakes-reputation-banks-fall.html",
    "content": [
        "He is the undisputed 'King of Wall Street'. As the head of JP Morgan, America's largest bank, Jamie Dimon has conquered all before him for the best part of two decades.",
        "Hailed as the saviour of the financial system, his latest 'white knight' act came on Monday – appropriately May Day – when he rode to the rescue of First Republic, the stricken mortgage lender to the wealthy and the second largest bank failure in US history.To the surprise of many, Dimon suggested the immediate crisis – which has already claimed the scalps of Silicon Valley Bank and Signature in the US, and Credit Suisse in Europe – was 'over'.His comments may leave him a hostage to fortune, but few would bet against Dimon, whose modus operandi is buying distressed assets on the cheap.During the last financial crisis 15 years ago he snapped up investment house Bear Stearns and retail lender Washington Mutual – the biggest-ever US bank failure – for a song.This time round competition rules should have barred JP Morgan from buying First Republic.But Dimon, the consummate deal-maker, managed to obtain a waiver from officials desperate to avoid putting taxpayers on the hook again as they had been during the 2008 financial crisis.He went on to rebuke critics concerned about JP Morgan becoming too big and powerful.'You need large successful banks,' he told reporters. 'Anyone who thinks that it would be good for the United States of America not to have that should call me directly.",
        "'There are only so many banks that were offsides this way,' he added. 'There may be another smaller one, but this pretty much resolves them all.'Such is Dimon's power and influence that even those words were enough to cause a sharp fall in the share price of another regional lender, PacWest, which this weekend was teetering on the brink of collapse.As a native New Yorker and the son of a stockbroker, Dimon honed his banking skills in the early 1980s at American Express as assistant to its president and his mentor, Sandy Weill.They went on to work together at Citigroup, building it into a financial powerhouse through a series of deals, but the pair eventually fell out and – in a bitter power struggle that became the stuff of banking folklore – Weill fired Dimon.'The problem was in 1999 he wanted to be CEO and I didn't want to retire,' Weill later told The New York Times.Dimon, 67, has spoken of the 'hurt' over his surprise dismissal, but 'it was my net worth, not my self-worth' that was hit most, he said. But he was not out of work – or out of pocket – for long.",
        "He went on to become boss of the loss-making Chicago-based Bank One and soon turned it round. By 2004 it had been bought by JP Morgan Chase and a year later Dimon was named chief executive of the combined business.",
        "JP Morgan was one of the few banks to prosper during the last financial crisis, but not everything Dimon has touched since has turned to gold.In 2013 he had to apologise for a 'terrible mistake' in allowing a JP Morgan trader dubbed the 'London Whale' to rack up losses of £5billion on dud financial bets.Then two years ago JP Morgan's plans to bankroll a breakaway European super league were shown the red card by angry football fans. Later this month Dimon is due to testify under oath about how much he knew about a controversial decision to retain Jeffrey Epstein as a JP Morgan client after he had been convicted of child sex trafficking charges in 2008.Dimon has said 'hindsight is a fabulous gift' and he firmly denies being involved in any review of Epstein's account.Today Dimon enjoys all the trappings of a billionaire banker. Said to be worth £1.4billion – thanks to years of bumper bonuses and a big stake in JP Morgan itself – he owns luxury mansions outside New York City and along Chicago's Gold Coast, where he lives with his wife of 40 years, Judith Kent.Former colleagues have described him as 'exceptional' and 'narcissistic' in equal measure. 'He's very good at cutting costs – except his own,' said a former insider, noting Dimon's penchant for flying around the country in private jets.",
        "Perhaps Dimon's most prized possession is his network, which he has constructed and cultivated assiduously over the years.He is a regular visitor to the annual Davos powerbrokers' shindig in the Swiss Alps.The New York Times described him as President Barack Obama's favourite banker and he is said to have had a hotline to President Joe Biden during the latest bout of banking turmoil.",
        "He famously claimed in 2018 'I could beat Trump' because 'I'm as tough as he is and I'm smarter than he is'. In true Trump style the then President hit back saying Dimon was a 'nervous mess'.But despite – or perhaps because of – that ding-dong, Dimon's political ambitions seem limited. Dimon has also had health issues. He has been diagnosed with curable throat cancer while three years ago he underwent heart surgery.That in turn raised speculation about who would succeed him at JP Morgan. The question seemed to be answered a year later when Dimon was awarded another chunk of share options so that he could 'continue to lead the firm for a further significant number of years'.Dimon now wants everyone 'to take a deep breath' after the drama of recent months. But he remains cautious about the prospect of interest rates going up – as they did again last week – amid fears that a commercial property downturn and a deep recession could see more US banks go the wall.",
        "'That's a whole different issue,' Dimon warned last week.With up to 200 US banks at risk if savers withdraw just half their uninsured deposits, one thing is for sure. If more banking dominoes fall, expect the King of Wall Street to be on hand to try to pick up a few more of them at knock-down prices.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}