{
    "articleURL": "/tvshowbiz/article-12053013/Duran-Duran-stage-Tour-without-Andy-Taylor-amid-cancer-battle.html",
    "content": [
        "Duran Duran performed on stage at the Utilita Arena in Birmingham on Friday amid their future past tour and the famous pop rock band sent fans into a frenzy.",
        "However, former bandmate Andy Taylor, 62, was noticeably missing from the performance due to his ongoing battle with prostate cancer.Simon Le Bon, 64, John Taylor, 62, and Dominic Brown, 50, all took to the stage to give a once-in-a-lifetime performance.And the band appeared to be in their element as they sang their hearts out on the brightly-lit stage.Simon Le Bon, who is the lead singer of the group, took to the stage wearing a snazzy silver metallic blazer and jeans.",
        "He also paired the outgoing ensemble with a casual black T-shirt that boasted a green graphic print.John Taylor, who was also in his element while playing the guitar, took to the stage in a purple blazer, a sheer blouse, and a pair of leather trousers.John's other bandmate Dominic decided to match his fellow bandmate as he donned a similar coloured blazer, a waistcoat and shirt, and a pair of chequered trousers.And the pair of them could be seen side by side throughout most of the entire show singing their hearts out.The Birmingham show comes after John revealed Duran Duran were set to reunite with their former bandmate Andy, to record their first new album in 30 years.Simon is reportedly set to work on tracks with former member Andy, at the guitarist's studio in Ibiza, after he shared his terminal prostate cancer diagnosis last year.",
        "Speaking at an Unforgettable Evening in LA, which raised £1.6million for the Women's Cancer Research Fund, John Taylor, said: 'Le Bon is flying to Ibiza to work with Andy. I kind of wish I was there. I think it'll be great.",
        "'It'll be really profound for them. They haven't been in the studio together in maybe 10 to 20 years.'John did not confirm whether or not the comeback will be part of a documentary but said: 'Somebody will have an iPhone on it.'Bandmate Simon broke the news of Andy's health battle in November 2022 as he read out a letter from the guitarist and said Andy will not be 'around for very long'. At the time, he went on to clarify that the musician is being treated for stage four metastatic prostate cancer after being diagnosed with the disease four years ago. The band broke the news at their induction into the Rock &amp; Roll Hall of Fame at the Microsoft Theatre in Los Angeles.The band – which also features Nick Rhodes, 60, and Roger Taylor, 62, kicked off their UK tour this month and plan to record in LA and London.The kick-off to the tour comes after the band announced their 2023 headline UK and Ireland arena tour in November 2022.",
        "And the rockers will play dates in May this year in cities including Manchester, London, Birmingham and Leeds.The band had a remarkable year last year, having recently been inducted into the Rock &amp; Roll Hall Of Fame and performing at the Queen's Platinum Jubilee Concert at Buckingham Palace.",
        "In a statement, Simon Le Bon thanked fans for their support over the years.'2022 has been an extraordinary year for Duran Duran - mainly down to the incredible fans we have around the world,' he said.'In July we celebrated our years together at Hyde Park as part of the British Summer Time Festival.''Next Spring we will be back on home soil once again to continue the party. It's remarkable to me that as a band, we are still hitting new milestones, still able to introduce the sound of DD to new generations of music lovers.'He added: 'We are truly grateful that we get to do what we do on a daily basis, and that we still love our job as much as we did when we started out some four decades ago.'The tragic announcement about Andy came as the guitarist had been due to reunite with singer Simon, keyboardist Nick Rhodes, bassist John Taylor and drummer Roger Taylor but he 'suffered a setback' that would not allow him to travel from his home in Ibiza. ",
        "The weekend ceremony for their induction into the Rock &amp; Roll Hall of Fame was set to be the first time the five-piece band from Birmingham had played together in 17 years, having last reformed for a world tour and the album Astronaut in 2004.",
        "At Duran Duran's Rock &amp; Roll Hall of Fame induction, the band read out a letter from Andy in which he revealed he had undergone 'very sophisticated' life-extending treatment.'Just over four years ago I was diagnosed with stage four metastatic prostate cancer,' the letter read.'Many families have experienced the slow burn of this disease and of course, we are no different; so I speak from the perspective of a family man but with profound humility to the band, the greatest fans a group could have and this exceptional accolade.'I have the Rodgers and Edwards of doctors and medical treatment that until very recently allowed me to just rock on.'Although my current condition is not immediately life-threatening there is no cure.'Rodgers and Edwards refer to Nile Rodgers and Bernard Edwards, the producers who worked with Duran Duran throughout their careers.He added: 'Recently I was doing OK after some very sophisticated life-extending treatment, that was until a week or so ago when I suffered a setback, and despite the exceptional efforts of my team, I had to be honest in that both physically and mentally, I would be pushing my boundaries.'",
        "He said he was 'truly sorry and massively disappointed' he could not attend the ceremony, adding: 'I often doubted the day would come. I'm sure as hell glad I'm around to see the day.'Simon, 64, said: 'It is absolutely devastating news to find out that a colleague, no not a colleague, a mate, a friend, one of our family, is not going to be around for very long. We love Andy dearly and I'm not going to stand here and cry. I think that would be inappropriate but that's what I feel like.'The group, which formed in 1978, performed three songs: Girls On Film, Hungry Like A Wolf and Ordinary World.From the start, Duran Duran was a hitmaker, scoring 21 top 40 singles in the US Billboard Hot 100 including Hungry Like The Wolf, Girls On Film, Rio, Save A Prayer, A View To A Kill, The Reflex, Ordinary World, Planet Earth, Is There Something I Should Know?, Notorious and New Moon On Monday, among many others.The band since then has sold over 100 million records, making them one of the world's best-selling music artists.",
        "Dear Simon, John, Roger, Nick, my fellow inductees and countrymenI wanted to send a personal note to pass along my sincerest respect to you all for what's been an amazing career, and to also share what has happened to me.Firstly, can I say what an absolute honour it was to be nominated let alone be inducted into the RRHOF. There's nothing that comes close to such recognition. I'm proud of everything we've achieved together and of the way you have continued. As a guitar player in a progressive band from the synth days of the early eighties, literally from the day I met Nick, John, Simon and Roger they truly valued the contribution of a rather noisy, versatile Northern brat. We all grew up on the same vinyl records and live gigs, from David Bowie to Roxy Music, The Sex Pistols and of course CHIC. I could go to all those places as a player and developed a hybrid guitar style that fitted this amazing concept OF A BAND…I loved going into the studio and recording our material; nobody else sounded like us. We were ripe to absorb what was the art of analogue recording, but with some different kit, Nick's artful obsession with synth technology was something I'd never seen before and I was introduced to layers. Because we were instinctively the right fit, we evolved very quickly, writing RIO as our second album with the confidence our very early success with 'Girls On Film' and 'Planet Earth' inspired.You can dream about what happened to us but to experience it, on one's own terms, as mates, was beyond incredible.I would like to thank each of my brothers in this great band.My family: my incredibly sane wife of 40 years - Tracey - my amazing children, Andy, Georgie, Bethy and Izzy, not forgetting my grandson Albie, who's probably online listening or on Fortnite!!!The original believers: Paul and Michael Berrow, Dave Ambrose, Terry Slater, Rob Hallett.The Producers: Colin Thurston, Alex Sadkin, Bernard Edwards and Nile Rodgers - I've also really dug the work with Mark Ronson - I particularly admire 'All You Need Is Now', that's a DD melody if ever I heard one.Thanks also to Merck, Andrew and Wendy.Now for the bad blood, well the good news is that there is none, just pure love and respect for everything we wrote, recorded and achieved together. What's the point? There's no stopping this 44-year thing called 'Duran Duran'.Now to the reason I'm not here:Just over 4-years ago I was diagnosed with stage 4 metastatic prostate cancer. Many families have experienced the slow burn of this disease and of course we are no different; so I speak from the perspective of a family-man but with profound humility to the band, the greatest fans a group could have and this exceptional accolade.I have the Rodgers and Edwards of doctors and medical treatment that until very recently allowed me to just rock on. Although my current condition is not immediately life threatening there is no cure. Recently I was doing okay after some very sophisticated life extending treatment, that was until a week or so ago when I suffered a setback, and despite the exceptional efforts of my team, I had to be honest in that both physically and mentally, I would be pushing my boundaries.However, none of this needs to or should detract from what this band (with or without me) has achieved and sustained for 44 years. We've had a privileged life, we were a bit naughty but really nice, a bit shirty but very well dressed, a bit full of ourselves, because we had a lot to give, but as I've said many times, when you feel that collective, instinctive, kindred spirit of creativity mixed with ambition, armed with an über cool bunch of fans, well what could possibly go wrong?I'm truly sorry and massively disappointed I couldn't make it. Let there be no doubt I was stoked about the whole thing, even bought a new guitar with the essential whammy!I'm so very proud of these four brothers; I'm amazed at their durability, and I'm overjoyed at accepting this award. I often doubted the day would come. I'm sure as hell glad I'm around to see the day.All My LoveAT"
    ]
}