{
    "articleURL": "/wires/pa/article-12042303/Wife-suspected-Texas-gunman-arrested.html",
    "content": [
        "A woman identified as the wife of a man suspected of killing five neighbours in a shooting in Texas has also been taken into custody, a sheriff has said.",
        "Divimara Lamar Nava, 53, wife of Francisco Oropeza, is in custody in connection with the Friday night shooting, according to Montgomery County Sheriff Rand Henderson.Although Mr Henderson identified Nava as Oropeza’s wife, jail records list her as not being legally married. The two share a home address, according to the records.She had previously denied knowledge of Oropeza’s whereabouts, Mr Henderson said, but authorities believe she hid him in the home near Conroe where he was arrested on Tuesday.Lamar Nava was arrested early on Wednesday and was being held in the Montgomery County jail on a felony charge of hindering the apprehension or prosecution of a known felon, according to online jail records.Oropeza was charged on Wednesday with five counts of first-degree murder during a court hearing in jail, said San Jacinto County Justice of the Peace Judge Randy Ellisor.Bond was set at 1.5 million dollars per count, for a total of 7.5 million dollars (£6 million), Judge Ellisor said. Bond for Castilla was set at 5,000 dollars, he added.A four-day manhunt for Oropeza ended on Tuesday when authorities, acting on a tip, said they had found the suspect hiding under a pile of laundry in the closet of a house.At a news conference on Wednesday morning in Coldspring, Tim Kean, chief deputy with San Jacinto County Sheriff’s Office, said authorities spotted Oropeza, 38, on Monday afternoon in Montgomery County, prompting the lockdown of several schools.",
        "“We did confirm that was him on foot, running, but we lost track of him. That was not a false alarm. That was him,” Mr Kean said outside the county jail.Montgomery County Sheriff’s Office had previously said reports of a possible sighting of Oropeza in the area was a false alarm.Mr Kean declined to comment on the tip that led authorities to the home where Oropeza was arrested as well as on when he had arrived or how he got there. The chief deputy said the home had not been previously checked by authorities.Mr Kean said there have been several other arrests “but I can’t go into the details on that”.He added that Oropeza only mildly resisted arrest and was not injured.Mr Kean said the home where Oropeza was arrested has a personal connection to the suspect. He declined to provide more details, but said there was no indication Oropeza was about to leave.“I believe he thought he was in a safe spot,” Mr Kean said.Oropeza is expected to appear before a judge inside the San Jacinto County Jail and the judge will formally set his bond at 5 million dollars (£4 million), Mr Kean said.The home is near the community of Conroe, north of Houston and about 20 miles from Oropeza’s home in the rural town of Cleveland. That is where authorities say he went next door and shot his neighbours with an AR-style rifle shortly before midnight on Friday.",
        "He had been shooting rounds on his property and attacked his neighbours after they asked him to go further away because the gunfire was keeping a baby awake, according to police.The arrest ends what had become a widening dragnet that had grown to more than 250 people from multiple jurisdictions and had seen 80,000 dollars in reward money offered.As recently as Tuesday morning, the FBI said Oropeza “could be anywhere”, underlining how investigators for days struggled to get a sense of his whereabouts and acknowledged they had no leads.Oropeza is a Mexican national who has been deported four times between 2009 and 2016, according to US immigration officials.Connor Hagan, an FBI spokesman, said officials would not disclose the identity of the person who called in the tip — one of more than 200 he says investigators received.Drones and scent-tracking dogs had been used during the widening manhunt, which included combing a heavily wooded forest a few miles from the scene.Republican governor Greg Abbott offered a 50,000-dollar reward as the search dragged late into the weekend, while others offered an additional 30,000 dollars in reward money.All of the victims were from Honduras. Wilson Garcia, who survived the shooting, said friends and family in the home tried to hide and shield themselves and children after Oropeza walked up to the home and began firing, killing his wife first at the front door.",
        "The victims were identified as Diana Velazquez Alvarado, 21, Julisa Molina Rivera, 31, Jose Jonathan Casarez, 18, Sonia Argentina Guzman, 25, and Daniel Enrique Laso, nine."
    ]
}