{
    "articleURL": "/wires/reuters/article-12042037/QUOTES-U-S-regional-bank-stocks-volatile-investors-eye-Fed-meet.html",
    "content": [
        "May 3 (Reuters) - Shares of major U.S. regional banks were volatile on Wednesday, after two straight sessions of declines following the collapse of the third U.S. lender and investors looked ahead to the Federal Reserve's commentary at its policy meeting.",
        "The central bank is widely expected to raise its benchmark interest rate by another 25 basis points.Here is what analysts are saying about the sell-off in regional banks:BROWN BROTHERS HARRIMAN\"We had hoped that the First Republic deal would be a good first step but clearly, more needs to be done.\"\"It just shows investor unease with the outlook for those banks. Because that outlook is still unknown, markets did what they always do in these situations and assumed the worst. We won't know exactly how bad things are getting again with regards to bank deposits until we see the Fed's weekly H.8 report this Friday.\"\"Unless and until the Fed were to see actual strains on the banking sector, we believe it will stick with its stated view from the March meeting that U.S. banks remain sound and resilient.\"CRAIG ERLAM, SENIOR MARKET ANALYST AT OANDA\"The rescue of First Republic Bank by JPMorgan in recent days, and the sell-off that followed in other regional banks, suggests significant stress remains.\"\"It would be perfectly reasonable to pause today especially when we're already starting to see signs of the labour market softening and inflation easing.\"BOFA GLOBAL RESEARCH\"The sharp sell-off in regional bank stocks over the last two days has been puzzling to investors (based on our conversations) given the lack of an obvious catalyst.\"",
        "\"We expect bank stocks to trade poorly heading into an economic recession.\"\"Higher-for-longer rates are likely to pose a significant headwind to bank earnings per share/return on equity given margin pressures, slowing growth and worsening credit risk.\"PETER CARDILLO, CHIEF MARKET ECONOMIST AT SPARTAN CAPITAL SECURITIES IN NEW YORK\"We had some commentary ... where one CEO said we will probably see other problems with banks. And the Fed is expected to raise rates by 25 basis points today, and that is not going to help the situation.\"\" (the fear) is that there is going to be another bank (to fall). If the Fed continues to raise rates and doesn't pause, that is only going to create a bigger problem because most of these regional banks are suffering because of the higher rate structure.\" (Reporting by Siddarth S, Susan Mathew and Shristi Achar A in Bengaluru)"
    ]
}