{
    "articleURL": "/tvshowbiz/article-12055845/Simone-Biles-Jonathan-Owens-tie-knot-SECOND-time-lavish-ceremony-Cabo.html",
    "content": [
        "Simone Biles and Jonathan Owens tied the knot for a second time with a lavish ceremony in Cabo San Lucas on Saturday.",
        "The Olympian, 26, and her NFL star husband, 27, previously exchanged vows on April 22 in Houston, Texas to make their marriage legal ahead of their nuptials in Mexico. 'We had to get married \"legally\" here in the U.S. since our wedding will be a destination wedding,' the gold medalist explained to a fan on Instagram. Simone looked stunning in her fairytale wedding gown with ornate lace detailing, while Owens was a handsome groom in his dashing beige tuxedo.The pair were surrounded by family and friends as they said 'I do' in front of a beautiful altar made from greenery and white flowers.  ",
        "Simone's father Ronald Biles walked her down the aisle and the ceremony was officiated by her uncle Paul.The pair's official wedding comes after their over-the-top rehearsal dinner on Friday night.Biles dazzled in a shimmering minidress while her groom looked dapper in a white suit with shorts.Jonathan was seen being walked down the aisle by his mother, Arthurine Cannon, who was dressed in a curve hugging white sleeveless dress with a square neck. The proud mother styled her long hair straight and wore silver sandals as she walked with her son across the sand. She was seen giving him a loving hug as they stood in front of Uncle Paul before taking her seat in the front row.",
        "'Uncle Paul aka gonna be the best officiant y'all have ever seen,' the blushing bride wrote in an Instagram story.  Guests included fellow gymnasts, Melanie De Jesus Dos Santos, Aly Raisman, Maggie Nichols, Madison Kocian, Jordan Chiles and Katelyn Ohashi.",
        "It's unclear when the two began dating, but they were official when the World Champion posted a birthday message to Jonathan two year ago in her Instagram Stories. 'Happy 25th birthday,' she wrote. 'Hope this year brings you everything you want &amp; more.'According to an interview with the Wall Street Journal, Simone was the one to make first contact via social media. 'He would say I slid into his DMs,' she told the outlet in July 2021. 'I saw him, and I was like, \"Oh, he’s pretty cute,\" so I said \"hi\"…and then I saw that he was in the Houston area, so we started chatting a little bit, and then we went to hang out a week or two later.'According to Jonathan, he wasn't aware of his future wife's athletic stature when they first met. In the docu-series Simone vs. Herself, the Houston Texans safety said it was her 'work ethic' that caught his eye. 'I never really watched gymnastics before I first started talking to her. When I met her, I honestly didn’t know who she was.'",
        "That soon changed as the football star turned into a certified fan. 'The coolest thing for me is that I get to witness someone who is literally in the pinnacle of their sport,' he explained. ",
        "'It’s motivating to see that and the impact that she has on people. We were walking past this group of girls, and they were shaking, \"Oh my god, it's Simone!\" This is when I kind of knew. Like, okay, yeah, she's the real deal.'The couple got engaged on Valentine's Day in 2022, with Simone posting a photo of the proposal, writing, 'THE EASIEST YES. I can’t wait to spend forever &amp; ever with you, you’re everything I dreamed of and more! let’s get married FIANCÉ.'Simone kept her fans updated on all the festivities via Instagram Stories, including video of a huge party following the rehearsal with all of her guests dressed in white.As her parents, Nellie and Ronald Biles, prepared to accompany her down the aisle, her father made sure to display his pride in his daughter, wearing a shirt reading 'Father of the Bride' and the date of Saturday's ceremony on the front, and 'I loved her first,' with Simone's birthday, March 17, 1997, on the back. "
    ]
}