{
    "articleURL": "/wires/ap/article-12057083/Arsenal-keeps-pressure-Man-City-2-0-win-Newcastle.html",
    "content": [
        "NEWCASTLE, England (AP) - Arsenal kept the pressure on Manchester City in the Premier League title race by beating Newcastle 2-0 in a huge test of its character and credentials on Sunday.",
        "Martin Odegaard´s first-half strike and Fabian Schar´s own-goal, combined with some breathtaking saves by Aaron Ramsdale, saw Arsenal come through the toughest of its final four games with a rare win for a visiting team at St. James´ Park.Arsenal moved back to one point behind City, which has a game in hand but some potentially tricky matches to finish the season as Pep Guardiola´s team goes for a third straight title.\"It shows our mentality and how far we have come,\" Odegaard said.The Norway captain slammed home a low shot from outside the area to give Arsenal the lead in the 14th minute against the run of play, with third-place Newcastle having already struck the post through Jacob Murphy and had the awarding of a penalty overturned after a VAR check.Before Schar´s own-goal in the 71st, Ramsdale saved brilliantly off Joe Willock and Schar from point-blank range while Alexander Isak headed against the post as Newcastle piled forward in waves.",
        "The second goal changed the atmosphere and Arsenal ultimately eased home to become just the second visiting team - after Liverpool - to win at St. James´ Park this season.It was a case of redemption for Arsenal, which was overwhelmed in a 2-0 loss at Newcastle at the end of last season on its way to missing out on a Champions League qualification place.",
        "The team is made of sterner stuff this season, with Arsenal's players dealing with some rough tackling by Newcastle and being streetwise in slowing the game down at times - much to the annoyance of the home fans.\"We know we can't win every game playing beautiful football,\" Arsenal midfielder Jorginho said.Ramsdale said before making the journey to the stadium from the team hotel, Arsenal manager Mikel Arteta showed his players some video clips from last season's painful loss to Newcastle.\"We had that burning desire as soon as we left the hotel to do what we did today,\" Ramsdale said.Arsenal was not without its own chances in a breathless match, with Gabriel Martinelli - whose cross was deflected in by Schar for the second goal - curling against the crossbar and Newcastle goalkeeper Nick Pope saving well in one-on-one situations with Bukayo Saka and Odegaard.Arsenal´s remaining matches are at home to Brighton, at Nottingham Forest and at home to Wolverhampton. City´s are more difficult on paper - away to Everton, at home to Chelsea, then trips to Brighton and Brentford.Arsenal is bidding for its first league title since 2004.\"We´ll be going as hard as we can for three games,\" Ramsdale said. \"We´ll be pushing every step of the way and hopefully, if they slip up, we´ll be there to pick up the pieces.\"",
        "Newcastle stayed three points ahead of fifth-place Liverpool and has played one game less in the race for Champions League qualification.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}