{
    "articleURL": "/femail/article-12044531/Horoscopes-stars-week-Sally-Brompton.html",
    "content": [
        "TAURUS 21 April-21 May ",
        "Ignore what others say you should do and listen only to your inner voice, which is now telling you to have fun. Someone you meet will have a major effect on you in the weeks ahead. It may or may not be a romantic attachment but it will be a life-changer.CALL 0904 470 1162*GEMINI22 May-21 June You’ll learn something that will boost your earning power. Some may say it’s immoral to take advantage of an unearned tip-off but it’s just sour grapes and in your shoes they’d do the same. If Lady Luck smiles on you it would be rude not to smile back. CALL 0904 470 1163*CANCER22 June-23 July You’ll be faced with a challenging situation but, with amiable Venus entering your sign, your laid-back attitude will make everything seem easy. It’sa shame you can’t bottle it as it would make you a fortune, and then you could retire and take life easier still. CALL 0904 470 1164*",
        "LEO24 July-23 Aug You may not like your fate being in another’s hands but the planets indicate they have your interests at heart. Some people like being generous and such a person will go out of their way to smooth your path through life. Go out of your way to enjoy it. ",
        "CALL 0904 470 1165*VIRGO24 Aug-23 Sept You’ll be remarkably laid-back; you won’t care what happens, be it good, bad or indifferent, so long as you can face it alongside family and friends. In fact, the bigger the challenge, the more you’ll like it. It will give you the chance to show that you have what it takes. CALL 0904 470 1166*LIBRA24 Sept-23 Oct There are times when you tend to treat life as a battle. Luckily, as your ruler Venus, planet of harmony and love, crosses the success-orientated midheaven point of your chart, people in positions of power will look on you kindly. Not everyone is out to get you. CALL 0904 470 1167*SCORPIO24 Oct-22 Nov This is not a good week for routine matters, especially if you’re a Scorpio who’s easily distracted. There is far too much going on in your world to allow you to concentrate on anything that doesn’t excite you. Let the drudges of the zodiac take care of the tedious stuff. CALL 0904 470 1168*SAGITTARIUS23 Nov-21 Dec Some people seem to enjoy finding fault with everything you do, but that’s no reason to take any of it seriously. The more they criticise your efforts the more determined you should be to carry on the same as before. Let everyone see you won’t be intimidated. ",
        "CALL 0904 470 1169*CAPRICORN22 Dec-20 Jan With Venus, planet of affection, in the partnership area of your chart you can expect warmer-than-usual responses from loved ones. Don’t be wary if someone you’ve fallen out with wants to kiss and make up. Make sure they know there are no hard feelings. CALL 0904 470 1170*AQUARIUS 21 Jan-19 Feb No matter how great your stamina, if you continue at your current pace you’ll be burned out by next weekend. Identify your priorities and focus on them to the exclusion of all else. You’re doing too many things for too many people. Do more for yourself. CALL 0904 470 1171*PISCES20 Feb-20 March As Venus enters the most romantic area of your chart, affairs of the heart will predominate. No need to be assertive; with charm like yours you can get anything – and anyone – you desire, simply by smiling and saying the right thing. Who could resist? CALL 0904 470 1172*ARIES  21 March-20 April For once you’re on the same wavelength as those around you and can easily persuade them to do things for you, especially at home. But each time they do you a favour you must reward them. Show them you appreciate their efforts. Let them know you care. ",
        "CALL 0904 470 1161*"
    ]
}