{
    "articleURL": "/wires/reuters/article-12052995/Motor-racing-F1-strike-deal-iron-hot-says-rights-holders.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 5 (Reuters) - Liberty Media, the commercial rights holders of Formula One, said on Friday that the time was right to draw up a new Concorde Agreement with FIA and the 10 teams with the sport riding a massive wave of popularity.Liberty Media CEO and President Greg Maffei said stakeholders should come together, \"strike while the iron is hot\" and extend the current agreement that runs through 2025.\"I think there´s a consensus among the teams and the FIA and ourselves that now might be a good time to try and strike while the iron is hot,\" Maffei said during an investor call after the announcement of first-quarter earnings results.\"There´s certainly no obligation to do that and there´s certainly no risk if that doesn´t get done.\"As you may recall (the current agreement) we went right to the end and historically in many cases, the teams have operated without a Concorde agreement.\"The confidential Concorde Agreement is named after the 1981 original that was negotiated at the Paris headquarters of the International Automobile Federation (FIA) in the Place de la Concorde.The deal with Liberty Media, the governing FIA and teams sets out the terms and commercial arrangements under which the teams race.Team principals taking part in Friday's media conference between practice sessions at the Miami Grand Prix agreed that getting a deal done sooner rather than later was in everyone's best interest.",
        "\"I think longevity is in the best interest of everybody,\" said Red Bull team principal Christian Horner. \"We have a settled sport that has a clear direction for the future, of what its goals and objectives are together with the technical regulations and sporting regulations, financial regulations we want to develop for the future.\"Formula One has never been in a stronger position. I think Liberty has done a great job with the sport. We are seeing new markets, new growth, new fans, a new demographic of fans.\"While negotiations of past agreements have been tense McLaren boss Zak Brown does not see the necessity for major changes but rather tweaks to the current deal that by all accounts has helped propel the sport to unprecedented growth.\"I think everything is looking great if you look at the health of the sport from Liberty's point of view, from the 10 teams point of view, the fans, TV, so I would like to see it get done sooner rather than later just for the stability of the sport,\" said Brown.\"I would be happy with a rinse and repeat with a few tweaks here and there.\"The digital age has advanced since we did the last agreement and I think it needs to be discussed.",
        "\"But I think for the most part it is a solid agreement, it's working so we don't need to fix what is not broken.\" (Reporting by Steve Keating in Miami; Editing by Stephen Coates)"
    ]
}