{
    "articleURL": "/tvshowbiz/article-12049555/Tom-Holland-Zendaya-enjoy-sporty-date-night-watch-Warriors-defeat-Lakers.html",
    "content": [
        "Tom Holland and Zendaya were among a number of stars who attended Game 2 of the 2023 NBA Playoffs on Thursday at the Chase Center in San Francisco.",
        "Holland, 26, and his Spider-Man co-star and girlfriend, 26, looked cozy as they sat side-by side and watched the Golden State Warriors defeat the Los Angeles Lakers with a final score of 127-100.The win was a celebration for the Oakland-born Dune star, who came in to the game rocking a black Warriors hat. The actress - who also attended the Oakland School of the Arts before her career took off - was casual cool for the night, wearing a white tee.The couple - who recently enjoyed an Usher concert together in Las Vegas - appeared to have a good time, with Zendaya snacking on popcorn as Tom watched the court action intently. ",
        "Zendaya accessorized her look with a pair of gold-rimmed reading glasses.The Euphoria star wore her shoulder-length brunette tresses parted in the middle and cascading down in natural waves.She further spruced up her look with a number of gold necklaces.The beauty appeared to go bare-faced for the night, wearing just a touch of gloss on her pout. Meanwhile her British beau sported a light grey crewneck sweater and a silver watch.The happy couple met on the set of Spider-Man: Homecoming in 2016, but they denied rumors of a relationship for a long time.However, when the dynamic duo were spotted sharing a kiss in Tom's car in July of 2021, it was all but confirmed that the young couple's friendship had blossomed into something more.",
        "And the couple - who are known for keeping their relationship low-key - appear to be stronger than ever, with Zendaya recently spending time with Tom's parents in his native England.  ",
        "Also present at the sporting event was legendary actor and Lakers diehard fan Danny DeVito, 78.The Batman Returns star sported a plaid blue shirt and a black blazer and pants.He also rocked a black hat with a red 'Game Seven' slogan. Black Panther director Ryan Coogler, 36, who is also an Oakland native, celebrated with the rest of Dub Nation as he sat courtside.The filmmaker sported an all-black look along with a pair of round gold rim glasses.Alex Rodriguez, 47, was also in attendance, along with hiss girlfriend Jaclyn Cordeiro.The former baseball player looked sharp in a plaid navy sweater over a white button-up.Klay Thompson scored 30 points with eight 3-pointers, Golden State limited Anthony Davis while allowing LeBron James 23 points, and the defending champion Warriors evened their Western Conference semifinal with the Los Angeles Lakers at one game apiece with a 127-100 win Thursday night. ",
        "Stephen Curry added 20 points and 12 assists as Splash Brother Thompson shined to help Golden State make 21 more 3-pointers - giving the Warriors an NBA record for most in the first two games of a playoff series at 42. James' Cavaliers hit 40 against Atlanta in the 2016 second round. ",
        "Coach Steve Kerr switched things up and inserted JaMychal Green into the starting lineup for Kevon Looney, who had a career-high 23 rebounds in Game 1 but has been dealing with an illness.Thompson's basket with 7:48 left in the third gave Golden State its biggest lead at 82-64 and the Warriors rolled from there. The best-of-seven series shifts to Los Angeles for Game 3 on Saturday. "
    ]
}