{
    "articleURL": "/wires/afp/article-12042309/US-private-hiring-unexpectedly-April-pay-gains-slow-ADP.html",
    "content": [
        "US private sector employment heated up unexpectedly in April, according to data released by payroll firm ADP on Wednesday, although pay gains slowed rapidly as well.",
        "The jump comes despite policymakers' efforts to rein in stubborn inflation by raising interest rates, and the Federal Reserve is expected to unveil another quarter-point hike at the end of its key policy meeting on Wednesday.Job gains hit 296,000 last month, around twice the figure that analysts expected and a surge from the revised 142,000 number in March, ADP said.But \"the slowdown in pay growth gives the clearest signal of what's going on in the labor market right now,\" said ADP chief economist Nela Richardson in a statement.\"Employers are hiring aggressively while holding pay gains in check as workers come off the sidelines,\" she added.Pay growth has continued a \"nearly year-long slowdown\" with those who changed jobs having their pay gains ease to 13.2 percent, ADP said.For those who stayed in their roles, wage growth stood at 6.7 percent.Richardson said ADP data also indicated that fewer people are switching jobs.The majority of job gains came from service-providing industries, with leisure and hospitality being a standout, while sectors such as financial activities and professional or business services saw declines, ADP said.Meanwhile, small and medium establishments added more jobs than large ones.Ian Shepherdson, chief economist at Pantheon Macroeconomics, noted that ADP has previously understated payroll numbers, adding that the unexpectedly big April figure could mark a catch-up after undershooting.",
        "\"Other April payroll indicators are much weaker,\" he added. \"In short, don't bet the farm on this one.\"Taken together with Labor Department data, numbers \"show the economy is still creating jobs at an elevated pace and the unemployment rate remains historically low, indicating the labor market is still strong,\" said Rubeela Farooqi, chief US economist at High Frequency Economics.\"But the pace should moderate as the lagged and cumulative effects of monetary policy spread more broadly through the economy,\" she said.Overall, payrolls have been impacted by the \"fading of post-Covid catchup hiring,\" Pantheon Macroeconomics said in a recent report, which noted there have been signs a cyclical softening in labor demand is beginning."
    ]
}