{
    "articleURL": "/wires/ap/article-12051601/Poland-summons-Russian-ambassador-assassination-comment.html",
    "content": [
        "WARSAW, Poland (AP) - The Polish Foreign Ministry summoned the Russian ambassador in protest Friday after a former Russian official suggested that it would be acceptable to assassinate Poland's ambassador to Russia.",
        "Pavel Astakhov, Russia's children´s ombudsman from 2009 to 2016, spoke on a television program hosted by Russian propagandist Vladimir Solovyov. He was being interviewed after Polish authorities took over a school building in Warsaw on Saturday that was serving the children of Russian diplomats and the military.Astakhov argued that murdering an ambassador in retaliation \"for unfriendly actions ... is within the framework of international law,\" adding: \"I was taught this well at the KGB school at the counterintelligence faculty.\"That school takeover was the latest of several incidents which have added to tensions between Russia and Poland, an ally of Kyiv which has been supplying Ukraine's military with weapons.In the interview with Solovyov, Astakhov referred to Poland's seizure of other properties, its freezing of Russian bank accounts, and an incident last year in which an activist in Warsaw doused the Russian ambassador to Poland, Sergey Andreev, with a red liquid. Polish Foreign Minister Zbigniew Rau at the time strongly condemned that incident, calling it \"highly deplorable.\"Astakhov said when Andreev was doused with the liquid, he waited to see \"will they find Poland´s ambassador floating in the Moskva River?\"",
        "Poland's Foreign Ministry said in a statement that it had summoned Andreev and handed him a protest note about Astakhov's statement \"calling for the murder of the Ambassador of the Republic of Poland to Moscow.\"",
        "\"The Polish side protested firmly against this situation and urged that criminal proceedings be instituted immediately and the perpetrator be punished without delay,\" spokesman Lukasz Jasina said.Poland's ambassador to Russia is Krzysztof Krajewski, who has had extra security protection since May 2022, Jasina said.Poland has been the target of a series of incendiary statements recently by Dmitry Medvedev, the former Russian president who is now the deputy secretary of Russia´s Security Council chaired by President Vladimir Putin.In a tweet that was briefly removed by Twitter, Medvedev said Saturday that he saw no point in maintaining diplomatic ties with Poland, and added: \"This state must not exist for us while there is no one but Russophobes in power and Ukraine is full of Polish mercenaries, who should be ruthlessly exterminated like stinky rats.\"A Polish anti-hate organization, Never Again, has been monitoring Medvedev's comments and working with some other groups to get Twitter to take them down, with mixed success. A previous tweet last month referring to Poles with the derogatory term \"Polacks\" and false accusations that Poland seeks to take parts of Ukraine was removed in Poland and some other countries upon the group's complaint.Rafal Pankowski, the head of the organization, said that he considers some of Medvedev's language to be \"genocidal\" and worries that his comments, which are written in English for a global audience, could shift perceptions of the war in Russia's favor."
    ]
}