{
    "articleURL": "/wires/reuters/article-12059027/US-STOCKS-Futures-muted-key-inflation-data-tap.html",
    "content": [
        "Futures: Dow up 0.10%, S&amp;amp;P flat, Nasdaq down 0.12%",
        "May 8 (Reuters) - U.S. stock index futures were muted on Monday at the beginning of a week packed with economic data points, including a key inflation reading that will be scrutinized for signs of whether the Federal Reserve is succeeding in its attempt to cool prices.At 5:06 a.m. ET, Dow e-minis were up 33 points, or 0.1%, S&amp;amp;P 500 e-minis were up 1 points, or 0.02%, and Nasdaq 100 e-minis were down 15.5 points, or 0.12%.U.S. stock indexes staged a late-week rally on Friday, with the Dow Jones Industrial Average posting its biggest one-day percentage gain since Jan. 6 after upbeat results from Apple Inc and U.S. jobs data highlighting a resilient labor market.Focus will be on the Labor Department's inflation data on Wednesday, which is expected to show the consumer price index (CPI) likely climbed 0.4% in April, after gaining 0.1% in March, while excluding the volatile food and energy components, the CPI likely increased 0.4% last month.Data on producer prices, weekly jobless claims, and on consumer sentiment are all lined up through the week.These data points will help investors not only gauge whether the Fed's aggressive tightening cycle - including its most recent 25 basis point hike last week - is working towards tamping down inflation but also, if fears of stagflation are founded.",
        "\"Market expectation of cuts already in the summer are based on a too-optimistic forecast of a quick disinflation,\" Paolo Zanghieri Senior economist at Generali Investments wrote in a note. \"Anyway, inflation stabilizing at 3% would not be enough for the Fed to start easing rates.\"Regional bank shares extended gains in premarket, with PacWest Bancorp jumping 13.5% after the company announced quarterly dividend. Peers, Western Alliance Bancorp , Comerica Inc and Zions Bancorp rose between 2.8% and 4.9%.Shares of such regional lenders rebounded on Friday from declines tied to the collapse of First Republic Bank.American Airlines Group Inc rose 1.9% after J.P. Morgan raised its rating on the company's stock to \"overweight\" from \"neutral\", while Southwest Airlines Co fell 1.3% as JPM downgraded its stock to \"neutral\" from \"overweight\". (Reporting by Shreyashi Sanyal in Bengaluru; Editing by Nivedita Bhattacharjee)"
    ]
}