{
    "articleURL": "/wires/reuters/article-12041383/Motor-racing-Formula-One-statistics-Miami-Grand-Prix.html",
    "content": [
        "May 3 (Reuters) - Formula One statistics for Sunday's Miami Grand Prix at the Hard Rock Stadium, round five of the 23-race championship:",
        "Lap distance: 5.412km. Total distance: 308.326km (57 laps)2022 pole position: Charles Leclerc (Monaco) Ferrari one minute 28.796 seconds.2022 winner: Max Verstappen (Netherlands) Red BullLap record: Verstappen 1:31.361 (2022)Start time: 1930GMT (1530 local)MIAMIMiami is the first of three U.S. rounds on the 2023 calendar, joined by Austin and Las Vegas, and has a 10-year deal that started in 2022.Three current drivers have won in the United States: Lewis Hamilton, Valtteri Bottas and Max Verstappen.The Hard Rock Stadium is usually home to the Miami Dolphins NFL team. The track has three straights and 19 corners, with cars reaching top speeds of 320kph.Track temperatures reached 59 celsius last year. The circuit has been resurfaced since last year.WINSLewis Hamilton has a record 103 career victories from 314 starts but has not won since Saudi Arabia in December 2021.Red Bull's double world champion Max Verstappen has 37 wins from 167 starts. One more by Verstappen would put him alongside Sebastian Vettel as the drivers with most wins for the team.Red Bull have won every race this season, three of them with a one-two finish, and 14 of the last 15.Aston Martin's Alonso has 32 wins, most recently in his home Spanish Grand Prix in 2013 with Ferrari, from a record 358 starts.",
        "POLE POSITIONHamilton has a record 103 career poles.Red Bull have been on pole in three of the four races, with Leclerc taking the top slot in Azerbaijan.None of Leclerc's last eight pole positions have ended in victory, the longest such streak since Brazilian Nelson Piquet went 10 in a row in 1984-87.PODIUMVerstappen's second place in Baku was the 81st podium of his career, one more than the late triple world champion Ayrton Senna in the all-time list. Hamilton has 192.Four teams and five drivers have now made a podium appearance this season -- Red Bull, Aston Martin, Mercedes and Ferrari. Verstappen has yet to finish outside the top two.POINTSVerstappen leads Perez by six points.Alpine have failed to score in the last two races. They drew a blank only three times last year.FASTEST LAPSFour different drivers have taken fastest laps so far this season - Alfa Romeo's Guanyu Zhou, Verstappen, Perez and Mercedes' George Russell.MILESTONEBaku was the 25th one-two finish for Red Bull since they entered Formula One in 2005.Red Bull have won the first four races of a season for the first time. (Reporting by Alan Baldwin in London, editing by Ed Osmond)"
    ]
}