{
    "articleURL": "/sport/football/article-12042099/Gabby-Agbonlahor-insists-repeat-offender-Jurgen-Klopp-given-FIVE-GAME-ban.html",
    "content": [
        "Jurgen Klopp has been charged by the FA for comments about Paul Tierney Gabby Agbonlahor has insisted the Liverpool manager deserves to be banned Agbonlahor and Klopp having both previously clashed during the seasonGabby Agbonlahor has claimed Jurgen Klopp deserves a five-match ban following his comments regarding referee Paul Tierney, with the pundit accusing the Liverpool boss of being a 'repeat offender'.",
        "Klopp has been charged by the FA in the aftermath of the Reds' victory over Tottenham, having accused the official of having an agenda against his side.The Liverpool manager also claimed Tierney said something 'unacceptable to him,' which led to PGMOL accusing him of lying.Klopp admitted on Tuesday that he 'regretted' his actions in the aftermath of Jota's goal, having celebrated in front of fourth official John Brooks - pulling his hamstring in the process.He also backtracked on his perceived accusations of bias, insisting that Tierney did not make mistakes against his team deliberately - while again noting that the parties have 'history'.",
        "Speaking on talkSPORT, Agbonlahor has claimed Klopp should be banned for five matches for his conduct.The pundit added that the sanction should be doubled if Klopp were to behave in a similar fashion in the future. 'He has to be careful with what he says,' Agbonlahor said. When you come out afterwards and say what the referee said to me is not okay, everyone is thinking has he said something disrespectful to Jurgen Klopp, it must be really bad what he says.'Then two days later he says “all he said to me was that it was a red card”.'You are making Paul Tierney get all this hate online, and his reaction to the fourth official, why are you running up to him like the fourth official has done something wrong?",
        "'Go and celebrate like you have before with your players. What was funny is that he got instant karma by pulling his hamstring, because he shouldn’t have done that.'That will go down to grassroots level, with kids thinking it is fine to go and celebrate in front of a referee or fourth official or a linesman. Its not a good example.'For me, I would give him a five-game ban and if he does it again I’d double it and give him a 10-game ban.",
        "'He’s not going to learn, he’s got previous and is a repeat offender. He needs to be punished.'Agbonlahor and Klopp have previously clashed, with the former Aston Villa striker having claimed he had 'rattled' the German and contributed to Liverpool's poor season.The talkSPORT pundit clashed with the Liverpool boss at the beginning of the season, with Klopp having defended Man United coach Erik ten Hag after criticism from Agbonlahor.Klopp claimed he almost called into the radio station to defend his rivals.In October, Agbonlahor mockingly labelled Klopp 'Mr Mentality Monster' after Liverpool's shock 1-0 defeat to Nottingham Forest.Agbonlahor is not alone in calling for Klopp to be banned from the touchline.Mail Sport's Chris Sutton claimed the FA must enforce a strong sanction on the Liverpool boss.",
        "Klopp was previously warned about his conduct after being banned for one match and fined £30,000 after the FA successfully won an appeal against the leniency of his punishment for berating an assistant referee during October's home win over Manchester City.The CEO of Ref Support UK has also demanded Liverpool face a points deduction for his actions."
    ]
}