{
    "articleURL": "/tvshowbiz/article-12057111/Pregnant-Danielle-Armstrong-shows-real-skin-make-free-selfie.html",
    "content": [
        "Pregnant Danielle Armstrong showed off her 'real skin' in make-up free selfie as she embraced the 'natural look' on Sunday. ",
        "The former TOWIE star, 34, who is expecting her second child with husband Tommy, has been enjoying a 'pre-baby' holiday in Spain with her family. Posing for a photo on their last day, Danielle showed off her sun-kissed freckled face in the candid update. She wore her blonde hair loose with a hint of a wave and slipped into a sheer striped shirt while lounging in the shade. The TV personality wrote: ' Waking up on our last day of our family holiday, I wanted to share this selfie with you all to show what my skin is really like without the make up and insta story filter.'",
        "She added: 'During pregnancy my skin changes so much but especially in the sun. 'I wear factor 50 and wear a hat as much as I can but I still get some patches of pigmentation and and I’ve always had freckles in the sun which I actually like. 'My lips are swollen and NO I haven’t had lip filler during my pregnancy which I actually get asked a lot in my DM'Anyway just wanted to share the No make up (apart from last night mascara still left on) and embrace the \"Oh Natural Look\" on the gram for once.'It comes after Danielle showed off her bump in a pink swimsuit during the sun-soaked Spanish trip on Monday.",
        "The former TOWIE star, who has Orla, two, with Tom, revealed the Marbella holiday was their final trip as a family of three. Taking to Instagram, the couple shared adorable photos of their time in the sunshine, including Orla cosying up to her mother and father.Other shots showed the three in swimwear grinning for a selfie as they enjoyed quality time together with Tom lovingly holding Danielle's bump.",
        "Danielle captioned her post: 'Our last trip away as a family of 3 spending as much quality time with this little beauty before big changes happen with the new bubba coming. 'I know Orla's going to make the most amazing big sister.'Tom wrote: 'Last Holiday Smudge As A Three' as he took time to relax and unwind with Danielle and Orla. The couple married in August 2022 and announced they were expecting their second child together in January "
    ]
}