{
    "articleURL": "/wires/ap/article-12061269/Iowa-Iowa-St-announce-investigations-athlete-gambling.html",
    "content": [
        "The University of Iowa announced Monday that 26 athletes across five sports are suspected of wagering on sports in violation of NCAA rules, and more than 100 people have been linked to an investigation.",
        "In addition, Iowa State acknowledged that some 15 of its athletes across three sports also are suspected of violating gambling rules.The announcements came less than a week after Alabama fired its baseball coach, Brad Bohannon, following a report of suspicious bets made at an Ohio casino involving his team.NCAA rules prohibit athletes, coaches and staff from betting on amateur, collegiate and professional sports in which the NCAA conducts a championship. For example, athletes cannot bet on NFL games even if state laws would legally allow them to do so if they weren´t competing under NCAA rules. It is illegal in Iowa for a person under 21 to wager on sports.Brian Ohorilko, director of gaming for the Iowa Racing and Gaming Commission, told The Associated Press on Tuesday that his office was monitoring a law enforcement investigation of gambling among athletes at the two schools. He said he knows of no evidence indicating match fixing or suspicious wagering activity on Iowa or Iowa State contests.The Iowa Division of Criminal Investigation is conducting the investigation. A message was left for a spokesman for the DCI's special operations bureau.",
        "Ohorilko declined to comment on what triggered the DCI's investigation.Iowa State issued a one-paragraph statement on the alleged gambling violations. It said the 15 Cyclones athletes suspected of involvement are from the football, wrestling and track teams.",
        "Athletes caught gambling are subject to losing eligibility.The University of Iowa said it is fully cooperating with the investigation, has alerted the NCAA of potential violations and hired outside counsel to assist.Iowa said it has received information about 111 individuals - including 26 athletes from baseball, football, men´s basketball, men´s track and field and wrestling - as well as one full-time employee of the athletic department.The school said the \"vast majority\" are students who are on staff, former athletes or those with no connection to the athletic department.Iowa said university leadership was notified May 2 of potential criminal conduct related to sports wagering that also suggested possible NCAA violations. The university last Wednesday was provided with a list of individuals alleged to have participated in sports wagering.In response, the university notified several athletes they would not be participating in upcoming competitions and alerted the NCAA to potential violations.The state Board of Regents said in a statement that the wagering was conducted online at Iowa and Iowa State.\"We are closely monitoring the situation and have confidence that University administrators at each institution will take all necessary steps to ensure ongoing compliance,\" the regents said.Five years ago, the Supreme Court cleared the way for states to legalize betting on sports. Sports betting is currently legal in 33 states, with billions wagered every year, and the ripple effects for college sports are many.",
        "The Alabama case differs from Iowa and Iowa State in that suspicious wagering activity was detected in Alabama´s baseball game at LSU on April 28. Bohannon´s firing came three days after Ohio´s top gambling regulator barred licensed sportsbooks in the state from accepting bets on Alabama baseball games, and at least three other states followed suit.Alabama scratched its starting pitcher shortly before the game, which LSU won 8-6. No details have been released about the nature of the suspicious bets.ESPN reported surveillance video from the sportsbook located at the Cincinnati Reds´ Great American Ballpark indicated the person who placed the bets was communicating with Bohannon at the time."
    ]
}