{
    "articleURL": "/wires/reuters/article-12050571/At-72-bodies-Congo-village-hit-floods--Reuters-witness.html",
    "content": [
        "By Crispin Kyala",
        "BUSHUSHU, Democratic Republic of Congo, May 5 (Reuters) - A t least 176 people have died in flash floods in eastern Democratic Republic of Congo, a regional governor said on Friday, as heavy rain destroyed buildings and forced aid workers to gather mud-clad corpses into piles.The rainfall in Kalehe territory in South Kivu province caused rivers to overflow on Thursday, inundating the villages of Bushushu and Nyamukubi.South Kivu governor Théo Ngwabidje Kasi put the death toll at 176 and said that others were still missing. A local civil society member, Kasole Martin, said 227 bodies had been found.\"People are sleeping out in the open, schools and hospitals have been swept away,\" Martin said.On Friday, haggard-looking survivors stood outside a wooden shed in which Red Cross workers in blue scrubs placed bodies on top of each other. Many had lost clothing and were covered in dirt. A Reuters reporter counted 72 corpses.The corrugated iron roofs of flattened houses jutted out from beneath thick layers of mud, photos showed.A doctor in Kalehe territory's main hospital, Robert Masamba, said injured survivors had been streaming in since Thursday evening.\"My team and I have not slept. We have received 56 patients, 80% of which have fractures,\" he said.Floods and landslides are not uncommon in South Kivu, which shares a border with Rwanda. Heavy rains also triggered flooding and landslides in Rwanda this week, killing 130 people and destroying more than 5,000 homes.",
        "The last incident of a similar scale in Congo occurred in October 2014, when heavy rainfall destroyed over 700 homes. More than 130 people were reported missing at the time, according to the United Nations. (Reporting by Crispin Kyala; Additional reporting by Sonia Rolley; Writing by Sofia Christensen; Editing by Alexander Winning, Bhargav Acharya and Susan Fenton)"
    ]
}