{
    "articleURL": "/wires/reuters/article-12055421/Motor-racing-Leclerc-angry-repeat-offender.html",
    "content": [
        "MIAMI, May 6 (Reuters) - An unhappy Charles Leclerc blamed himself after the Ferrari Formula One driver's second crash in two days brought an early end to qualifying for the Miami Grand Prix on Saturday.",
        "The mistake also left rivals cursing, with Red Bull's championship leader Max Verstappen ending up ninth on the starting grid for Sunday's race after being unable to get in a flying lap.\"I think what's unacceptable is doing twice the same mistake in the same corner,\" said Leclerc, who will start seventh despite the error. \"I am really disappointed with myself.\"You can always find excuses in those situations -- the wind was really strong, it was really tricky, the setup of the car was really tricky also,\" added the Monegasque, who started last weekend's Azerbaijan Grand Prix on pole.\"But I put myself in these conditions. I wanted this setup and I knew it would be tricky but I thought I will be able to extract the maximum out of the car in Q3 (the final phase), which is normally one of my strong points.\"I know also that I am taking more risks than others probably in Q3 and that's why most of the time I'm doing good Q3s but this is too much. Very disappointed with myself. I did the same mistake yesterday and this shouldn't happen.\"Leclerc, on pole in Miami last year, hoped for a clean race on Sunday to move back up the grid.Asked if he was putting too much pressure on himself in the final phase of qualifying, Leclerc hesitated.",
        "\"I don't think so. It's paying off most of the time,\" he said.\"But this weekend I did too much. I cannot hide my disappointment.\"Leclerc said the Aston Martin, with Fernando Alonso alongside Red Bull's pole-sitter Sergio Perez on the front row, looked strong on race pace.\"A podium would be a really good finish tomorrow considering our race pace,\" he added. (Reporting by Alan Baldwin in London, editing by Toby Davis)"
    ]
}