{
    "articleURL": "/tvshowbiz/article-12060933/Inside-Kim-Zolciak-Kroy-Biermanns-rollercoaster-romance.html",
    "content": [
        "They are parents to four children together, and the former athlete also legally adopted her two daughters from previous relationships The 44-year-old star and her ex-football player husband, 37, have reportedly been dealing with financial issues, including $1.1 million in unpaid taxes Kim Zolciak and Kroy Biermann shocked the world on Monday as it was revealed the pair had split following 11 years of marriage.",
        "The reality star, 44, and the former NFL player, 37, had a famously whirlwind romance, getting engaged and conceiving their first child within three months of meeting in May 2010.The pair went on to welcome three more children together, with every high and low of their steamy romance documented for the cameras on hit reality show Don't Be Tardy.Together, they dished on their racy sex life, built businesses and battled numerous financial issues, culminating in  the pair reportedly owing the IRS $1.1. million in unpaid taxes.As Kim and Kroy go their separate ways after 13 years - DailyMail.com looks back at their extremely public romance... ",
        "MAY 2010 - LUST AT FIRST SIGHT AND BRIEF SPLITThe worlds of reality and football collide as the pair first meet  at charity event Dancing Stars of Atlanta - with their first encounter captured on camera for season three of Real Housewives of Atlanta.A cheeky Kim's first comment to her future husband was: 'I’ve never in my life seen an ass like that.'I just had to tell you. Adorable. 'But again I didn't really think anything. I just thought, 'Wow he's got a really cute butt and a million-dollar smile. I love big wide smiles. His energy was great, but 'OK, I'm filming, I'm working, I gotta go' and that was my mindset.\"",
        "The racy remark went down well with Atlanta Falcons star Biermann - with the pair sparking up a romance shortly afterwards.As she was filming RHOA at the time, the pair opted to keep their romance a secret, which resulted in numerous surreptitious meetings.As a result, more press coverage of the new couple began to weigh on the 24-year-old Kroy, who was in the midst of his NFL career.",
        "Finally things became too much for Kroy, and he texted her a break-up message from a pre-season game in Florida.Hey, just wanted to let you know it might be in our best interests to go our separate ways,' he texted the reality star.The missive caught Kim off guard, and when she asked 'Why, what's up,' Kroy only replied with 'it just is what it is.'Wracked with frustration, she remembered thinking ''It just is what it is.' I was like, this a**hole! Well, f*** him then! I don't need him.'Despite the hostile feelings, apparently Kim felt awful after the exchange.It seems Kroy did as well, as he ended up sending the reality star flowers with the message 'can we talk?'MAY 2011 - FIRST SON IS BORN AND ENGAGEMENT",
        "A little over a year since their first meeting, the pair's first son Kroy Jagger (KJ) is born, with Kroy proposing just days later.",
        "She wrote online: 'I am happy to announce that YES @biermann71 and I are engaged! I’m on a cloud and so blessed!!.'NOVEMBER 2011 - WEDDING BELLS AND REALITY TV The pair wed on 11/11/11 at their Atlanta home in a ceremony documented for Bravo special, Don't Be Tardy For the Wedding.The couple sent  Tweets to each other on their big day, with Zolciak retweeting a message from Biermann: 'Thank u everyone 4 your early congrats and best wishes!!! @Kimzolciak has made me the happiest man alive!!! 11.11.11.She responded: 'I love u.'Kroy later adopted Kim's two daughters from her previous relationships, Brielle, now 26, and Ariana, 21. Kim said at the time: 'I don't know if I could love anybody else's children as much as Kroy loves the girls'I just don't know if I have it in me.",
        "AUGUST 2012/NOVEMBER 2013 - FAMILY EXPANDS",
        "Nine months after their wedding, the couple welcome their second son Kash. The family grows once again with the arrival of twins Kane and Kaia in 2013, completing their family.Zolciak wrote: 'We are officially the 'Biermann Bunch' now! Guess what?!!! The twins have arrived! We welcomed first a baby girl and second a handsome little boy! They are both healthy and Kroy and I are so thankful!!",
        "Sharing the twins' names, she wrote: 'Girl: Kaia Rose (after 'psychic' Rose who is like a grandma to me and been a huge part of my life for 13 plus yrs) also the twins were born on Rose's birthday!'Boy: Kane Ren (Ren after my OBGYN who has delivered 5 of the 6 kiddos, who has also been a big part of my life for 12 yrs and we simply adore him).'The pair's often chaotic home life would be documented in eight seasons of reality show, Don't Be Tardy, which ran from 2012-2020.Kroy had a vasectomy after their last pregnancy and Kim was advised to freeze her eggs. MAY 2013 -  CHEATING ALLEGATIONS",
        "A woman came forward to claim that she was in a relationship with Kroy in the days when he started dating Kim.Elizabeth Seward, a model and former cheerleader, claimed to In Touch Weekly that she was involved with Kroy in 2010, when he was courting Kim.‘I want Kim to know about it,’ Elizabeth told the publication. ‘The manipulation and the lies.’According to Elizabeth, she met Kroy at a party in Indianapolis in January 2010, and things quickly got serious between the pair.‘It was this whirlwind, love-at-first-sight thing,’ Elizabeth recalled.She had moved to Las Vegas by July, but Kroy apparently was still smitten and even flew her out to Indianapolis where he was training at the time.",
        "Elizabeth claims that Kroy told her ‘everything you’d want to hear. “You’re my girlfriend. We’re going to make this work.”’But things allegedly down-spiralled when Elizabeth saw pictures of Kim and Kroy looking cosy at the wedding of Kim’s former co-star Cynthia Bailey just days after returning from the amorous trip.And when she questioned Kroy about his relationship with Kim, he allegedly told her, “She’s a friend.”But a source told the magazine that Kroy was just enjoying single life and didn’t do anything wrong.‘[Kim] left Housewives because she wanted peace, and now this woman is trying to wreck her happy home life,’ the source said.‘Kroy was never serious about Elizabeth – he was young and single and playing the field.’The insider added: ‘It wasn’t betrayal. It was just the normal thing that happens when someone is dating and finally falls for someone.‘The other people get left behind, and sometimes they get hurt.’2014 - FINANCIAL WOES BEGIN ",
        "The pair's lavish Atlanta mansion was threatened with foreclosure for the first time back in 2014, according to an October report by Page Six.However, Kim and  Kroy paid off of their outstanding debts to get their home out of the danger.At the time of the foreclosure threat, they reportedly owed $10,567.67. The foreclosure threat was delivered two years after the home was purchased in 2012.",
        "In 2014, the same year as the foreclosure troubles, Kim admitted on her Real Housewives Of Atlanta spin-off series that she had serious gambling issues.She admitted to losing a shocking $250,000 while gambling in the Bahamas, and in the same episode she admitted to spending $1,240 on scratch-off tickets while stopped at a gas station amid a road trip to Florida, because Georgia had no casinos to take care of her need to gamble.2016 - STEAMY SEX CONFESSIONS AND NAKED PHOTO",
        "In just one of many overshares committed by the couple, Kim posted a fully nude photo of hunky Kroy brushing his teeth which she hand censored herself.His wife used the green scribble tool to censor out his private parts but did choose to leave part of his derriere in it.She captioned the revealing shot: 'My baby! Don't you wish beyotches.''That's never been a problem,' Kim previously boasted about her sex life with Kroy.'We just find the time, even with six hours of home schooling that he does - because I quit like a week in - but he's been doing it for five weeks...'She was asked where the craziest place she has had sex and the answer was not only very revealing.Kim answered: 'I feel like it's all crazy because we're always kinda trying to hide.She added that she and Kroy even find themselves 'outside in view of, like, our neighbors on both sides.'2017 - VOW RENEWAL TO MARK 6.5 YEAR ANNIVERSARYThe couple renewed their vows surrounded by their six children and family. The vow renewal came two years after Kim had suffered a stroke and underwent heart surgery.Zolciak later wrote: 'I'd go to the end of the earth for you' in a loving tribute to her spouse.SEPTEMBER 2020  - APPEARING STRONGER THAN EVER ",
        "Zolciak brands Kroy the 'love of [her] life' in an Instagram post commemorating his 35th birthday.She wrote:  \"Boy did I rob the cradle with you and I'm so glad I did! You amaze me daily somehow, someway .... everyday.'Although it's annoying that you know everything literally. You are the most INCREDIBLE DADDY on this planet, an incredible husband and I love every minute we spend together.'MAY 2022 - REFLECTING ON THEIR FIRST MEET  In an Instagram post about the pair's first meeting, Zolciak  revealed that she didn't even want to go the event where the pair first met. She said: 'I threw the wig on and some makeup and I reluctantly went  - who would have thought that day would change my life forever.'Goes to show you... you never know what the future holds and God ALWAYS has the most perfect plan.'Last year, the couple celebrated their 11-year anniversary and opened up about their long-lasting marriage during an interview with E! News.'If you're asking for a secret, lots of sex,' Kim had humorously told the publication, and added, 'I think one of the biggest secrets is also communication.''Choosing to love that person day in and day out, I think it's a choice and a lot of times people are just so quick to throw in the towel.'Kroy talked about their lives being constantly shown on television, but stated, 'Whether you're married on camera or a regular person married, I don't think there's any difference.'And I think when things get tough, people don't want to stay true to their vows and stay true to their partner,' while later adding, 'you got to hold true to your promises that you gave that person when you were standing in front of your friends and family.'FEBRUARY 2023 - FORECLOSURE ISSUES   ",
        "TMZ reported the family's home was officially going into foreclosure.The couple's Georgia mansion was set to be up for public auction. The Don't Be Tardy stars initially bought the home back in 2012 for $880,000, and it is currently priced between $2.5 and $2.6 million, according to TMZ.The news came four months after the TV personality publicly shut down rumors that the home was auctioned off for a mere $257K after falling into foreclosure.Kim denied the claims in November, claiming on her Instagram Story that she still owns the home and wasn't planning on selling anytime soon.'My house was not sold for $257,000. If you guys think that I would let my home, that we put millions and millions of dollars [into], go for $257,000, you’re an idiot, OK? For real,' said a clearly upset Kim in her video.A source told People that the reality star 'is telling everyone' that the foreclosure 'is a misunderstanding' and that it 'is being sorted out.''She's not moving,' the insider added.Truist Bank has been asked to deal with the foreclosure of the house, and action had reportedly begun to take place back in August when the couple defaulted on their $1.65 million mortgage.According to TMZ, the five bedroom and six and a half bathroom mansion sits comfortably near the 18th hole of the Manor Golf and Country Club located just north of the bustling city of Atlanta.MAY 2023 - COUPLE OWE IRS $1.1MILLION - AND THEN ANNOUNCE SPLITThe couple allegedly owe $1.1 million in unpaid taxes, penalties and interest to the IRS, according to TMZ.Kim and Kroy allegedly did not pay in 2013, 2017 and for 2018.The reality stars also reportedly owe the state of Georgia $15,000 in unpaid taxes from 2018.The former Real Housewives of Atlanta is said to have listed her separation date from the ex-NFL star as April 30, according to TMZ.Kim, 44, and Kroy, 37, share four children together: Kroy Jagger (KJ), 11, Kash, 10, and twins Kaia and Kane, 9.Once married, Kroy also legally adopted Kim's daughters from her previous relationships, Brielle, 26, and also Ariana, 21, whom the reality star shares with ex-husband, Daniel Toce.",
        "She filed the paperwork citing that the marriage is 'irretrievably broken with no hope of reconciliation,' the outlet noted.The star is asking for joint legal custody of their four children and primary physical custody.The outlet also reported that she requested spousal support.Kim also requested her maiden name be restored legally.Kim and the former Atlanta Falcons NFL star first met in 2010 after crossing paths at the Dancing With Atlanta Stars charity event. They tied the knot one year later in November 11, 2011. The split comes just after it was revealed that Kim and Kroy allegedly owe $1.1 million in unpaid taxes, penalties and interest to the IRS, according to TMZ.Kim and Kroy allegedly did not pay in 2013, 2017 and for 2018.The reality stars also reportedly owe the state of Georgia $15,000 in unpaid taxes from 2018.",
        "The couple's home in George entered 'foreclosure' in February, per the outlet.In February, Kim took to social media to boast about her ornate living room, complete with a dazzling chandelier - despite it being in reported foreclosure.'This is definitely one of my most favorite rooms, called the Hollywood room,' the mother-of-six said in an Instagram video, which panned around her parlor.She continued: 'That chandelier is seven — almost eight-feet wide, by seven-feet high.'The TV personality went on to muse about all the 'fun' times that her family shared in that room, before pointing out a shiny gold balloon stuck in the light fixture.Her post comes on the same day a source told People that the reality star 'is telling everyone' that the foreclosure 'is a misunderstanding' and that it 'is being sorted out.''She's not moving,' the insider added.The TV personality and the former professional NFL player initially bought the home for $880,000 back in 2012.Their property is now priced between $2.5 and $2.6 million, according to the outlet.The lavish estate has been featured on both the Real Housewives and Kim's own reality show titled, Don't Be Tardy, which aired for a total of eight seasons.Truist Bank has been asked to deal with the foreclosure of the house, and action had reportedly begun to take place back in August when the couple defaulted on their $1.65 million mortgage.According to TMZ, the five bedroom and six and a half bathroom mansion sits comfortably near the 18th hole of the Manor Golf and Country Club located just north of the bustling city of Atlanta.The front of the home has a spacious circular driveway and has an inviting appeal with stunning brickwork on the exterior.On her own reality show, Don't Be Tardy, which first aired back in 2012 with the original title of Don't Be Tardy For The Wedding, Kim gave a tour of the mansion.The 6,900 square foot home also contains a swimming pool with a hot tub, a waterfall spa, a basketball court, and a built-in elevator.Late last year in November, Kim had denied claims that that their Georgia home was auctioned off for just $257,000 in an Instagram Stories video, while claiming that she still owns it and isn't planning on selling anytime soon.The reality star also claimed the actual worth of her home — located in the city of Alpharetta, Georgia— is $2.5 million, or nearly ten times as much as it was rumored to have been auctioned for.However, Kim and her husband Kroy paid off of their outstanding debts to get their home out of the danger. At the time of the foreclosure threat, they reportedly owed $10,567.67. The foreclosure threat was delivered two years after the home was purchased in 2012.",
        "Last year, the couple celebrated their 11-year anniversary and opened up about their long-lasting marriage during an interview with E! News.'If you're asking for a secret, lots of sex,' Kim had humorously told the publication, and added, 'I think one of the biggest secrets is also communication.''Choosing to love that person day in and day out, I think it's a choice and a lot of times people are just so quick to throw in the towel.'Kroy talked about their lives being constantly shown on television, but stated, 'Whether you're married on camera or a regular person married, I don't think there's any difference.'And I think when things get tough, people don't want to stay true to their vows and stay true to their partner,' while later adding, 'you got to hold true to your promises that you gave that person when you were standing in front of your friends and family.'When discussing her daughters Ariana and Brielle, whom her husband legally adopted, Kim emotionally expressed, 'They were 8 and 13 when Kroy came into their life and it's a pretty spectacular connection that they have.''They call him Dad and that's all they know. He's the only father figure that they've had in their life. He's all they know.'"
    ]
}