{
    "articleURL": "/news/article-12043671/Cycling-governing-body-DEFENDS-transgender-woman-sparked-fury-winning-New-Mexico-race.html",
    "content": [
        "Austin Killips, a 27-year-old transgender athlete, won an elite race in New Mexico over the weekend, leading to uproar among the female elite cycling community Cycling's international governing body has defended its regulations around transgender athletes competing, saying their rule are based on 'science' Several prominent female cyclists have called out the sport's governing body for allowing biological women to be effectively eliminated from their own sport The governing body of cycling defended its policy on transgender athletes after transgender woman Austin Killips won a recent race in New Mexico, which in turn sparked fury across the cycling community.",
        "Killips, who is the first openly transgender woman to win an official UCI women's stage race, beat out the competition on Sunday after winning the fifth stage of the Tour de Gila.The 27-year-old was also awarded the Queen of the Mountains polka dot jersey, which is given to the best climber. The sport's governing body, UCI or the Union Cycliste Internationale, claimed that its rules are predicated on the most recent scientific guidelines that pertain to transgender ideology. ",
        "In a statement given to CNN on Wednesday the organization said: 'The UCI acknowledges that transgender athletes may wish to compete in accordance with their gender identity,''The UCI rules are based on the latest scientific knowledge and have been applied in a consistent manner,' it said, adding that the governing body 'continues to follow the evolution of scientific findings and may change its rules in the future as scientific knowledge evolves.'Last year, the UCI updated its rules around the participation of transgender athletes by announcing that transgender women competitors must have serum testosterone levels of 2.5 nanomoles pet liter or less for at least two years in order to compete in female designated competitions.Inga Thompson, a former Olympic cyclist, was critical on Twitter of Killips' victory, writing that the UCI is 'effectively killing off women's cycling' by allowing transgender athletes to compete against biological females.",
        "Sports scientist Ross Tucker called on sports like cycling to 'respect women's rights' amid an 'abdication of its leaders.'The Tour of Gila organizers said that they are 'required to follow the rules and regulations set forth by UCI,' and added that the Tour 'recognizes the passionate debate regarding rider eligibility and classifications of riders set by UCI and USA Cycling and encourages UCI and USA Cycling to host an open discussion on the matter.'Killips, who has seen much of the discourse play out online said she'd experienced 'a week of nonsense on the internet' and is 'especially thankful to everyone in the peloton and sport who continue to affirm that twitter is not real life.'On Instagram Killips wrote: 'I love my peers and competitors and am grateful for every opportunity I get to learn and grow as a person and athlete on course together.' The 27-year-old American, who began her transition post 2019, finished 89 seconds clear of Italian Marcela Prieto in the general classification and also claimed the Queen of the Mountains jersey. Elite cycling’s participation policy remains more relaxed than that of athletics and swimming, where all trans women are banned from competing in the female category at an elite level.Commenting on the Killips case, former British Olympic swimmer Sharron Davies told Mail Sport: ‘This is beyond disappointing. Those in charge should hang their heads in shame. The UCI is not fit for purpose.’",
        "Ex-Canadian world champion cyclist Alison Sydor tweeted: ‘The current UCI rules that allow males to compete in female cycling events are not fair to female athletes.‘Time for UCI to admit this current rule situation is unsustainable and leaving a black mark on cycling as a fair sport for females.’",
        "Killips rides for the Amy D Foundation - a team formed in memory of former American professional cyclist Amy Dombroski, who died aged 26 in 2013, with the aim of promoting ‘participation, opportunity and equity for women in cycling.’Killips was the subject of controversy last December when she finished third at the USA’s National Cyclocross Championships and was also accused of pushing another competitor off course.Hannah Arensman, a 35-time winner on the cyclocross circuit, finished fourth in that race and later retired from the sport citing the emergence of transgender riders.She said: ‘Over the past few years, I have had to race directly with male cyclists in women’s events.‘As this has become more of a reality, it has become increasingly discouraging to train as hard as I do only to have to lose to a man with the unfair advantage of an androgenized body that intrinsically gives him an obvious advantage over me, no matter how hard I train.’",
        "Last year, British Cycling altered its rules to ban transgender women from elite races, pending a full review. "
    ]
}