{
    "articleURL": "/sport/nfl/article-12051921/Tom-Brady-SLAMS-reports-quit-10-year-375MILLION-NFL-analyst-deal-Fox.html",
    "content": [
        "Tom Brady has long been lined up as an analyst after his playing days ended The 45-year-old has firmly dismissed claims he might not want his media role DailyMail.com provides all the latest international sports newsTom Brady has branded reports he could back out of his 10-year, $375million role as an NFL analyst for Fox 'fake news'.",
        "Brady made the remarks on Friday on Instagram, responding to a post by Sports Illustrated regarding a report that first appeared in the New York Post.Brady, 45, retired again in February but insisted that this time, he really is stepping away from football for good.As it stands, Brady is not expected to begin his deal with Fox until 2024. He is believed to want to take time out for himself during the 2023 season later this year as he adjusts to life away from the game.'Decompression's really important,' Brady said when asked if he'll take some time off.",
        "'You're on this really crazy treadmill, hamster wheel for a long time, loving the moment and journey,' Brady continued. 'At the same time, it's a daily fight. 'I have appreciation for so many people that are so committed every day to showing up, to put their max effort into their life and career. 'For me, I want to be great at what I do — talking, even last week, with the people at Fox Sports, and the leadership there, allowing me to start my Fox opportunity in 2024, something that's great for me.'So, take some time to really learn, become great at what I want to do, become great about thinking about the opportunity, and making sure I don't rush into anything.'",
        "Speaking in January on his Let's Go! podcast Brady outlined how much he is looking forward to working as an analyst.'There's so much to learn, there's so much to teach, you know, it's ever evolving,' he said. 'Believe me, as much as you think I'm willing to teach people, I'm really looking to learn. 'I'm really looking to learn from all the people that I get to talk to. I get an opportunity to be in a job in the future where I get to travel around and learn from all the other people that I've looked up to and admired and different organizations and different people. 'So it's exciting for me too. I feel like the opportunity to do that is something that I'm really looking forward to whenever that time comes.'",
        "Brady retired in February after his Tampa Bay Buccaneers team had been defeated in the playoffs by the Dallas Cowboys.  The seven-time Super Bowl winner has also even been linked with a second retirement u-turn in recent weeks.Appearing at a tech event in Mimaim, Brady didn't exactly empathically reject a suggestion that he could come out of retirement and play for the Dolphins.'Oh man. I will say, now that I'm not affiliated with any teams anymore, and I have strong ties with a couple teams, I do have some friends on the Dolphins that I really like,' he said.",
        "'I wouldn't necessarily say that I root for them all the time, but I root for my friends to do well, and several of them play for Miami.'Earlier this year when rumors first surfaced that he could return again, Brady tweeted: 'Anyone who thinks I have time to come back to the NFL has never adopted a 2 month old kitten for their daughter.'"
    ]
}