{
    "articleURL": "/news/article-12048093/People-just-realizing-meaning-iconic-Michelin-Man-logo.html",
    "content": [
        "The Michelin Man - formerly known as Bibendum or 'Bib' - was created in 1894He was the brainchild of the company's founders Andre and Édouard Michelin He originally appeared as a beer-drinking, cigar-smoking, overweight character, but by the 1920s he'd slimmed down and toned down for a family image  Meet the Michelin Man, or more accurately Bibendum or 'Bib,' his real name. ",
        "Most people will recognize the big, white mascot of the French tire company, but few would be able to tell you Bib's story - or how he came into existence. The character is based on a pile of tires that founders Andre and Édouard Michelin saw at the 1894 Lyon Universal Exhibition in France. 'Look, with arms it would make a man,' Édouard told his brother at the time, according to the company. Thus, the Michelin Man was born. However, he didn't always look like the cuddly character we know and love today. In his original format, Bib appeared more like a fat Egyptian mummy, and was oftentimes seen holding a martini glass filled with nails and shards of glass - to send drivers the message that Michelin tires were tough and sturdy and wouldn't be punctured. Adverts of the time would feature the words 'Nunc est Bibendum' - which means 'now is time to drink.' Over the years, Bib has also been depicted as a gladiator, a kickboxer, a ballroom dancer, and a ladies' man - and almost always had a glass of beer or a cigar in his hand. It was a way to connecting with the upper class, who were the only ones who could afford to buy a car in those early days. ",
        "Scroll down for video  ",
        "However, as the 1920s rolled in, the cigar and beer were dropped for a more family-friendly image. In this new healthy persona, he started appearing on bicycles and throwing frisbees. This is also the time the Michelin Man started to gain his more toned physique, swapping the dad-bod for a more muscular figure. Throughout the years, many have wondered why Bib was made of white-colored tires instead of black, and the simple answer is: Tires weren't black until 1912 - 18 years after he was created. Prior to 1912, tires were typically a gray-white or beige color, according to Michelin's blog. And despite the fact that the Michelin Man does have a mouth, he really speaks (although he did have a travel column in the company's Italian magazine in 1907). ",
        "In one column, Bib raved about the beauties of Renaissance art. 'Oh you sublime Madonna, Rome's destiny, accept my homage, you whose eyes shine with the splendors of the Renaissance,' the mascot gushed in the magazine. He's also appeared in French comic books, including Asterix, and even won an Oscar for the film Logorama, which is a 16-minute short film. And in the year 2000, Bib won best logo ever created, selected by a panel of 22 designers, according to Better Marketing.  ",
        "The Michelin Man has become so much a part of pop culture that he even has a London restaurant named after him -  Bibendum Restaurant and Oyster Bar, in the Fulham neighborhood.It occupies a spot in Michelin House, which served as the company's London headquarters until 1985, when it relocated. "
    ]
}