{
    "articleURL": "/tvshowbiz/article-12044675/Brad-Pitt-59-takes-phone-call-arriving-set-new-Apple-TV-Plus-film-Wolves.html",
    "content": [
        "Just hours after his ex-fiancee Gwyneth Paltrow spilled details about their three-year relationship, Brad Pitt went back to work in Los Angeles.",
        "The 59-year-old actor was spotted making a phone call while arriving on the set of his new Apple TV Plus film Wolves on Wednesday.While Brad was on set, his 29-year-old girlfriend Ines de Ramon was spotted out running errands in Los Angeles.Pitt was seen leaving a vehicle wearing a grey vest over a white dress shirt, while talking on his phone.He also wore a silver watch seen peeking out from his dress shirt while also rocking dark grey pants matching his vest and completed his look with black dress shoes.",
        "His girlfriend Ines de Ramon, who he reportedly started dating in December 2022, was seen out running errands on Wednesday.She stepped out with a pristine white long-sleeved turtleneck that exposed a tiny part of her midriff.She also wore black sunglasses with a gold necklace and pendant dangling from her neck, while accessorizing with gold rings.The jewelry designer also wore tan pants while carrying a large black leather bag on her errands, while also chatting on the phone.De Ramon completed her look with a pair of white sneakers for her errand run on Wednesday. Pitt's ex Gwyneth Paltrow appeared on Alex Cooper's Call Me Daddy podcast where she opened up about her relationships with both Pitt and Affleck.",
        "When asked who was better in bed, Paltrow admitted, 'That's really hard. Because Brad was like the major chemistry love of your life at the time. And then Ben was like technically excellent.'When asked which was a better actor, Paltrow said, 'They're both so talented. And Ben is a great writer and director. But I guess I would probably have to say acting alone, Brad. Because if you think of all the different roles that he's done.'",
        "Pitt's new film Wolves follows two lone wolf fixers - played by Pitt and George Clooney - whose lives are upended when they are assigned the same job.It was revealed last year that both Pitt and Clooney, who are also serving as producers, both took pay cuts to ensure the film would also get a theatrical release along with its debut on Apple TV Plus.'It was an exciting time because it got to be one of those weird bidding wars which happen every once in a while, and it ended up being pretty extreme, and Apple came in with a really big number for Brad and I,' Clooney told Deadline last year.'And we said we’d like to take less as long as we can guarantee that we can have a theatrical release, and they said great,' Clooney, 61, added, in a reference to Apple. "
    ]
}