{
    "articleURL": "/tvshowbiz/article-12038273/Jennifer-Lopez-takes-beautiful-sister-Lynda-Lopez-Met-Gala-instead-Ben-Affleck.html",
    "content": [
        "Jennifer Lopez did not take her husband Ben Affleck to the Met Gala on Monday evening in NYC. ",
        "Instead, the 53-year-old Hustlers actress brought her vocal coach Stevie Mackey.DailyMail.com has learned exclusively that Ben did not attend the Met Gala with his new wife because he had 'work commitments he could not get out of' in Los Angeles.Jennifer's plus one at Stella McCartney and Baz Luhrmann’s Met After Party with Casamigos was her 51-year-old sister Lynda Lopez. Lynda posted a photo with her famous Jenny From The Block sibling as they hit the soiree. '#Aboutlastnight Stayed up late wayyyy too many nights this week... #mamasnightout ❤️,' she added in her caption.The Shotgun Wedding actress was also seen bonding with Kate Hudson and Gigi Hadid as well as fashion designer Stella McCartney at the swanky event.",
        "Lynda is Jennifer's younger sister. In 2022 JLo posted a flashback photo with both her sisters to celebrate International Women's Day.She was seen with Lynda and older sister Leslie Lopez.Lynda is an American journalist and author based in New York City.  She has written AOC: The Fearless Rise of Alexandria Ocasio-Cortez and What It Means for America.Leslie-Ann Lopez keeps a quieter profile. She works as a teacher. On her Instagram account, which is private, she says, 'Musician, LMT, mother to Brendon Scholl of Draw With Me.'",
        "The siblings grew up in The Bronx with parents Guadalupe and David. ",
        "In her caption, JLo wrote: 'Happy #InternationalWomensDay!!! ✨'Each and every day I am inspired by so many talented, incredible and amazing women. 'We truly make the world go ‘round. From my inspirations in life to my beautiful family and friends … today and every day is your day... we celebrate and honor you ✨❤️,' added the star.Her hashtags included links to her sisters' Instagram accounts, @lyndalopez08 @leslieann3626.",
        "This year's Met Gala theme was Karl Lagerfeld: A Line of Beauty which was the dress code for the evening.JLo looked stunning in a black and blush cut out gown, opera gloves, and a black hat by Ralph Lauren. While talking to Vogue, she said she at first was not certain the hat was the best. 'I wasn't sure about the hat but now I'm kind of feeling it.'And she met him.'I got to meet him, and as a little girl from the Bronx, who kind of aspired to be in the fashion world, to be an entertainer- to meet people like that was always such a dream for me.'When talking about Lagerfeld, Lopez said, 'I hate throwing around the word iconic, I've said this before.. but he actually was such an iconic figure in fashion.' 'What he did with Chanel for so long and keeping that brand so fresh, he really was a genius.' "
    ]
}