{
    "articleURL": "/tvshowbiz/article-12058845/Almost-half-years-MAFS-stars-sign-management-companies.html",
    "content": [
        "They went on Married at First Sight to find their life partner, but the stars of the latest season are set to walk away with lucrative careers as social media influencers. ",
        "Now the popular dating show has finished airing on Nine, many of the brides and grooms are trying to make the most of their 15 minutes of fame. Just days after the finale was broadcast, almost half of this year's participants have signed with management and PR firms. Perth-based brides Bronte Schofield and Lyndall Grace have signed with the same manager.The fan favourites are being represented by Benji Hart's THE.mgmt. ",
        "Sandy Jawanda, who was paired with Dan Hunjas on the dating show, will also be represented by the same company. Melbourne-based Claire Nomarhas has signed up with influencer management company, One Day Dream Talent.Harrison Boon has signed on with Rojo Consulting, who also look after Olivia Frazer, Jackson Lonie, Cody Bromley and Tamara Djordjevic.",
        "Sydney-based PR manager Tahnee Cook is also believed to have signed on with a firm to help her look after deals.Janelle Han will remain represented by MGMT, who have been looking after her since her career as a TikTok star kicked off before the pandemic.Alyssa Barmonde is also understood to be in final negotiations with a Sydney-based firm, as is her on-screen groom Duncan James.",
        "Business savvy Melinda Willis and Layton Mills are planning to take care of their own enquires, despite having several meetings with keen firms.",
        "It comes after Daily Mail Australia revealed that this year's brides and grooms will have to wait until May 15 to get their Instagram accounts back. By the time they get their Instagram accounts back, their 15 minutes of fame may have faded, leaving them with fewer opportunities to capitalise on their MAFS experience. "
    ]
}