{
    "articleURL": "/wires/aap/article-12040379/Jones-likens-Volkanovskis-UFC-legacy-own.html",
    "content": [
        "UFC legend and heavyweight world champion Jon 'Bones' Jones has paid Alexander Volkanovski the highest praise, saying the Australian will ascend to the top of the sport when he retires.",
        "Renowned as the greatest of all time in mixed martial arts, Jones is touring six Australian and New Zealand cities in May less than two months after the No.1 pound-for-pound fighter in the world scored a round-one submission over Ciryl Gane for the heavyweight belt.Jones was light-heavyweight champion twice in a career spanning two decades and cemented himself in mixed martial folklore with his heavyweight win in March.The 35-year-old American said he admired Volkanovski, who recently fought up a division like Jones after dominating the featherweight class.\"I'm a big fan of him,\" Jones told AAP.\"We've had some small interactions and every single one of them has been incredibly respectful.\"He was the number one pound-for-pound fighter in the world and very deserving of that.\"I believe when I leave, he will be right back to being the number one pound-for-pound fighter in the world.\"Volkanovski has reportedly verbally agreed to fight for the unified featherweight belt in July against Yair Rodriguez, after the Mexican was named interim-champion with a win at UFC 284 in Perth.Volkanovski moved up a division and fought Islam Makhachev at lightweight on the same card earlier this year and a showdown with Rodriguez would be for the 'undisputed' featherweight championship.Jones said he was sceptical of the Aussie due to his allegiance with middleweight champion and Kiwi Israel Adesanya, but immediately became a fan when he moved up a division.",
        "He believes it is indicative of the legacy Volkanovski is growing in the UFC.\"He's on the right track,\" Jones said of Volkanovski's footprint in the sport.\"One thing he did that took me forever to do was move up to the next weight class and challenge a guy that's much bigger than him.\"When he fought Islam, it just showed a lot about his heart and his commitment to greatness and made me a really big fan - that really was the turning point for me.\"It showed me a lot about his work ethic. He has heart, I'm a fan for life.\"As for his own career, Jones revealed he has his eyes set on a showdown with former heavyweight champion Stipe Miocic in his home city of New York.That, he says, will leave him with nothing left to prove.\"One thing about the UFC is we want to give the fans what they want to see. What I want most is to fight Stipe Miocic at Madison Square Garden. It's the Mecca. I've got to get that under my belt,\" he added.\"After that I really feel like I'd have nothing left to prove and I'd like to fight Sergei Pavlovich, just to do it.\"I want to leave this sport knowing I faced every challenge, I faced it head on, and if Sergei is the last person that people think can beat me - then let's do it.",
        "\"But Stipe is what means the most to me personally.\""
    ]
}