{
    "articleURL": "/tvshowbiz/article-12055165/Olivia-Wilde-shares-glimpse-toned-abs-shopping-flea-market-Los-Angeles.html",
    "content": [
        "Olivia Wilde kept it very casual as she went shopping Saturday in Los Angeles.",
        "The 39-year-old actress looked very different from the way she did during her stunning appearance Monday's Met Gala in New York.Wearing a white T-shirt and distressed straight-leg jeans, the Don't Worry Darling actress and director offered a glimpse of her toned abs as she made her way through a flea market in the Silver Lake area.The Independent Spirit Award winner let her long blonde hair hang in loose layers and topped it off with a beige knitted toque.She appeared to be wearing little makeup, showcasing her natural beauty.",
        "She wore white sneakers for comfort and dark sunglasses to protect her eyes from the glare. While browsing the stalls, Olivia picked up a lovely bouquet of flowers.She perused several stacks of books and walked away with a few purchases in her 1000 books before kindergarten shopping bag. The single mom who shares her children Otis, nine, and Daisy, six, with former fiancé Jason Sudeikis, 47 enjoyed a hot beverage as she carried her purchases.The former couple may have gone their separate ways, but are united in their efforts to have a lawsuit filed by their former nanny moved to private arbitration.Their former caretaker, Erica Genaro, sued them for wrongful termination.She alleges she was fired after requesting a three-day 'stress leave' in 2021 due to the tensions dealing with their crumbling relationship. ",
        "Page Six reported the pair claimed the lawsuit was improperly filed in California when it should have been filed in New York. Olivia and the Ted Lasso star issued a joint statement Thursday saying, 'it is unfortunate that this private matter continues to play out in the press.''Our focus has been and will continue to be to steadfastly protect our family in the face of harassment of any kind' they wrote.'We are confident that the evidence brought forward will affirm our position to summarily dismiss this case and bring our family peace.'Olivia, who has been prepping for her next directing job on Perfect, based on gymnast Kerri Strug's historic comeback to win gold at the 1996 Olympics, has come out strongly in support of striking Hollywood writers. 'Writers channel the human condition into content that brings us together, teaches us things, and makes us feel things.' ",
        "'Pushing them into poverty and replacing them with robots is utterly dystopic,' she wrote Tuesday, the first day of the work stoppage.'Collective worker power through unions is the only way to keep the voracious appetite of corporations in check,' she contended.'They are designed to grow at the cost of everything else starving around them. Even if their CEOs don't agree, that’s what they owe their share holders. Or if they’re privately held, they are competing along those lines.'",
        "The actress, director and producer completed the statement writing, 'I stand in solidarity with the WGA and hope the producers make the decision to end this soon.'"
    ]
}