{
    "articleURL": "/news/article-12046735/Crime-ridden-San-Francisco-St-Louis-Portland-deserted-downtowns-bounce-back.html",
    "content": [
        "Downtown San Francisco is only 32 percent as busy as it was before COVID-19Salt Lake City has bounced back, with a busier commercial hub than before'Some downtowns are still stuck,' Toronto University research director warned The downtown areas of San Francisco, St. Louis, Portland, Oregon, and other North American cities remain deserted months after the pandemic waned, despite many urban areas bouncing back to life, new data show.",
        "Researchers tracked smartphone use across 63 cities and found that San Francisco, which is battling waves of crime and homeless addicts on its streets, only has 32 percent of the activity that was recorded before the pandemic.Meanwhile, Utah's Salt Lake City has bounced back strongest, with 139 percent more cell phone activity nowadays than was seen before COVID-19 arrived, shuttering schools, offices, and public transport in widespread lockdowns.Other cities with downtown areas that are springing back to life include Bakersfield, Fresno, and San Diego, in California, Columbus, Ohio, El Paso, Texas, and Baltimore, Maryland.",
        "The research adds to fears that soft-on-crime policies in ultra-liberal cities like San Francisco and Portland have driven up rates of lawlessness and other social problems, leading to an exodus of people as part of a longer-term decline.'Unfortunately, some downtowns are still stuck,' said Karen Chapple, director of the University of Toronto's School of Cities, upon releasing the institute's latest findings.Her team measured the number of smartphones pinging off cell phone towers in city centers from December 2022 to February 2023 and compared them against the same period in 2019-2020.",
        "Chapple says cell phone usage is a better measure of activity than other standards, such as office vacancy rates, public transportation ridership, or total retail sales, saying it is a 'much more comprehensive' indicator.",
        "The research showcases huge differences between North American cities – some are busier than they were before the pandemic, others are witnessing a sluggish recovery that poses tough questions for their economic survival.Millions of Americans stayed home during the pandemic, others relocated for cheaper rents, lower taxes and more outdoorsy lifestyles across the South, Sunbelt and West, thanks to remote working.With remote work still an option for many employees and small business owners, many cities have not yet drawn their full workforce back, and some downtown areas still look derelict.This has been a huge problem for many downtown economies, which have historically depended on commuting workers to boost a city's daytime population, and spend more at stores and restaurants.San Francisco is perhaps the most extreme example of this trend.",
        "The California hub's high concentration of tech employees saw a huge proportion of its workforce decamp during the pandemic. Many have not returned, thanks to the option of remote work and signs of urban decay on the streets.This week, Nordstrom said it was closing both of its downtown San Francisco stores. Other retailers, including Whole Foods, Anthropologie, Office Depot and CB2, have also shuttered stores in recent months, according to San Francisco Standard.New York ranks relatively positively, attracting back 75 percent of its pre=pandemic downtown footfall, thanks in part to its resilient economy, the lure of its financial center, and with business and political chiefs pushing for an end to remote work.",
        "As the warmer weather arrives across much of North America, people are expected to venture out more to downtown dining spots and watering holes. Over the longer term, New York and other cities are converting empty office blocks into residences.San Francisco's decline has been spotlighted once again by a sharp uptick in overdose deaths among the city's homeless population.The city saw a staggering 41 percent surge in the number of drug-related deaths in the first quarter of 2023 compared to the same time last year, as fentanyl ravaged the city's homeless population.The Californian coastal hub saw 200 people die due to overdoses between January and March, compared to 142 deaths in 2022, according to recent data from the city's medical examiner.That amounts to one overdose death every 10 hours in a city that has seen its reputation as a coastal gem ravaged by worsening crime, drugs, and, homelessness rates, even as it remains home to tech billionaires.The overdose victims were disproportionately black and Latino men, and frequently based in the Tenderloin area, a gritty downtown neighborhood, where a drug treatment center was shuttered in December. ",
        "Those living on the streets were particularly hard hit — with the number of homeless people dying from drug overdoses doubling.",
        "Fentanyl, a potent synthetic opioid that's frequently trafficked from Mexico and can kill in even tiny quantities, was detected in 159 of the deaths.The drug is 50-100 times stronger than morphine.It is cheap, packs down small, is relatively easy to smuggle into the US, and is mixed into pills that then claim the lives of users, who are often unaware they are taking something so powerful.Methamphetamine and cocaine were also present, although to a lesser extent.The sharp increase in deaths started in December and continued into a record-breaking January.This followed the shuttering of the Tenderloin Center, where addicts were allowed to use drugs and where the overdose reversal treatment, Narcan, was available for those who had taken too much.Dr Daniel Ciccarone, a professor of addiction medicine at the University of California, San Francisco, said it was a 'crying shame that a city as wealthy as San Francisco can't get its act together to deal with overdose deaths.''We're a politically divided city between the people who have a lot of money and want the streets swept and those who think a compassionate, science-based, health approach is appropriate,' Dr Ciccarone told The Guardian."
    ]
}