{
    "articleURL": "/wires/ap/article-12039023/Workers-Rotten-egg-smell-chocolate-factory-blast.html",
    "content": [
        "Workers at a Pennsylvania chocolate factory smelled \"rotten eggs\" before a powerful natural gas explosion that leveled one building, heavily damaged another and killed seven people, federal safety officials said Tuesday in a preliminary report.",
        "The National Transportation Safety Board's five-paragraph account of the fatal explosion confirmed earlier reporting by The Associated Press and other media outlets that employees had detected an odor of natural gas at the R.M. Palmer Co. factory in West Reading, a small town 60 miles (96 kilometers) northwest of Philadelphia.About 70 Palmer production workers and 35 office staff were working in two adjacent buildings at the time of the March 24 blast, according to the agency's report, and employees in both buildings told federal investigators they'd smelled gas.\"Employees from Building 2 recalled that they were sanitizing equipment in the building when they detected an odor of natural gas. The employees in Building 1 recalled the smell of rotten eggs around the same time,\" the agency's report said. Natural gas is odorless, but a foul-smelling odorant called mercaptan is added to alert people to leaks.Federal investigators said a \"natural gas-fueled explosion and fire\" destroyed Building 2, caused significant damage to Building 1 and other structures, injured 11 people and displaced three families from a nearby apartment building.The probe has been focused on a natural gas pipeline as safety investigators try to figure out the cause.",
        "UGI Corp. provided natural gas to the factory complex via two mains. UGI said there wasn´t any utility work going on in the area, and it detected no sudden surge in gas usage before the explosion, the report said.",
        "Workers at the plant have accused R.M. Palmer of ignoring warnings of a natural gas leak, saying the plant should have been evacuated.Patricia Borges, who survived the explosion, previously told the AP how she and others had complained about a natural gas odor about 30 minutes before the factory blew up. Borges's arm caught fire as flames engulfed the building. She then fell through the floor into a vat of liquid chocolate.A wrongful-death lawsuit filed last month by the family of blast victim Judith \"Judy\" Lopez-Moran, a 55-year-old mother of three, said Palmer bore responsibility for the explosion. Workers smelled natural gas that day and notified Palmer, but the 75-year-old company \"did nothing,\" the lawsuit said.Palmer has offered condolences, but said federal regulations preclude it from commenting on Tuesday's preliminary report, the ongoing investigation or \"any allegations that may be made in litigation.\"\"Our employees´ safety and health has always been, and will continue to be, of paramount importance,\" Palmer said in a written statement Tuesday, echoing comments the company made April 13 in its last public statement on the blast."
    ]
}