{
    "articleURL": "/wires/ap/article-12052355/Ex-Ohio-Lottery-director-conduct-staff-improper.html",
    "content": [
        "COLUMBUS, Ohio (AP) - The sudden resignation last month of Ohio's lottery director came after he inappropriately touched two employees and sent texts \"expressing inappropriate fondness and innuendo\" to members of his staff, according to an independent investigation released Friday.",
        "The review by Zashin &amp; Rich law firm determined that Pat McDonald's behavior violated Ohio Lottery Commission policy against inappropriate conduct in the workplace.The firm, enlisted by Republican Gov. Mike DeWine, also found that McDonald´s assistant lottery director had knowledge of his inappropriate behavior but failed to take action. The assistant director will be demoted out of management and reassigned to a different state agency in a lower classification and pay grade, the state's human resources department said.DeWine's chief of staff and chief counsel had traveled to Cleveland on April 11 to confront McDonald about the unwanted behavior alleged by a subordinate - which he \"explicitly denied\" - when he told them he had \"a significant medical condition\" and was considering retiring, the report said. McDonald left the job the next morning, precluding further disciplinary action or review, according to the report.McDonald had been a fixture at the Ohio Lottery for 16 years, serving first as a member and long-time chair of the Ohio Lottery Commission before DeWine appointed him director in 2019.The series of events that led to his resignation began in late February, when a lottery employee reported that McDonald had touched and hugged them in a way that made the employee uncomfortable. The human resources director told McDonald his behavior was unwelcome and he apologized. The employee told human resources they were \"satisfied that the behavior was addressed and would not continue,\" the report said.",
        "On April 6, the employee called to report another instance of misconduct. The lottery's human resources director held a meeting with McDonald on April 10, after which the governor's office was informed of \"potential policy violations,\" investigators found.The review ultimately found that McDonald had inappropriately touched two employees on the arms, shoulders and forehead, given an unwanted hug, sent texts \"expressing inappropriate fondness and innuendo\" to two employees, and made \"verbal comments about the appearance of two employees.\"The governor has appointed Michelle Gillcrist, his former aerospace and defense liaison and northeast Ohio regional liaison, to fill McDonald's role on an interim basis.Zashin &amp; Rich has recommended mandatory training of all lottery employees on appropriate workplace conduct and agency policy prohibiting conduct at work that's potentially offensive, harassing or retaliatory. They also urged the administration to promptly alert the assistant lottery director and every member of management of their responsibility to report misconduct."
    ]
}