{
    "articleURL": "/news/article-12038023/Teacher-24-spared-jail-running-father-distracted-podcast-avoids-teaching-ban.html",
    "content": [
        " Jemma Rutherford escaped a teaching ban due to her 'previously good history'A female teacher who was spared jail after running over a father while she was distracted by a podcast she was streaming on her way home from school has avoided a teaching ban.",
        "Jemma Rutherford, 24, started listening to the podcast after leaving Broughton Primary School, North Lincolnshire, where she had taught for three years back in February 2019. Her iPhone 7S was held in place by a magnet fitted to the air vent to the left of the steering wheel on her Fiat 500. Tragedy struck half an hour later when she drove into David Duckitt on his motorbike after failing to spot the traffic was being held up. The father-of-four had been waiting at the back of the queue as crash investigators were examining the road.",
        "She told police although the podcast had moving images, she was simply listening to it through the car's built in speakers.But police crash investigators concluded: 'The driver of the Fiat was mentally distracted from the task of driving her motor vehicle, as opposed to a physical distraction and she failed to see the motorcycle travelling in front of her which was there to be seen.'Ms Rutherford, from the village of Goxhill, North Lincs, was suspended from her teaching job after the accident on the A15 in February 2019 and later resigned.She admitted causing death by careless driving and in November 2020 was given an eight month suspended jail sentence and tagged for a six-month curfew.",
        "Ms Rutherford, now 27, has now been spared being banned from the profession after appearing before teaching watchdogs.At her sentencing hearing at Grimsby Crown Court, Prosecutor Jeremy Evans said of the victim: 'He is described as a committed and wonderful father - always available at the end of the telephone to assist with any problem, no matter how trivial.'He had the patience of a saint with his grandchildren and he played an important part in the lives of his family.'",
        "In a victim impact statement, Mr Duckitt's daughter Harriet said: 'In a split second because of a lapse in concentration, our dad was taken away from us and our lives will never be the same again.'Our lives have and will always now be far worse than what they could and should have been.'But sparing her a classroom ban today, Sarah Buxcey, for the Education Secretary, underlined: 'The panel acknowledged the victim impact statement and the effect Miss Rutherford's careless driving had on the deceased's family. However, the panel considered that it would not be in the public interests to recommend a prohibition order.'Martin Coles, who chaired the Teaching Regulation Agency, hearing, said: 'Miss Rutherford did have a previously good history, having demonstrated exceptionally high standards in both her personal and professional conduct and having contributed significantly to the education sector.",
        "'The panel found that Miss Rutherford showed significant insight and remorse and that she displayed initiative in getting the help and support she needed.'The panel also noted that Miss Rutherford has been forthcoming in the criminal investigation and the TRA investigation. She admitted the allegations from the outset and has taken ownership of her actions.'The panel found Miss Rutherford to be highly conscientious and that there were reasons of public interest to keep Miss Rutherford in the profession, particularly her service to the education sector and when considering the need to apply proportionality.'"
    ]
}