{
    "articleURL": "/sport/football/article-12057465/THE-NOTEBOOK-Lucas-Paqueta-settled-West-Ham-Declan-Rice-reassures-young-mascot.html",
    "content": [
        "West Ham beat Manchester United 1-0 following an error from David de GeaThe Man United goalkeeper was forced to watch the mistake on the big screens Erik ten Had's side continue to struggle in the second half of their matches West Ham took a giant step towards preserving their Premier League status as David Moyes' side claimed a 1-0 win against Manchester United at the London Stadium.",
        "A howler from David de Gea allowed the Hammers to take a first half lead, with the United goalkeeper allowing Said Benrahma's effort to squirm through his grasp.Benrahma's strike would prove the difference as West Ham secured the narrow win to move seven points clear of the relegation zone with three games to play.Man United remain fourth in the Premier League but could face a nervy end to the season as Liverpool chase down the Champions League places.Mail Sport's Kieran Gill takes a look at some of the things you may have missed. ",
        "Analysts offer feedback from their vantage point in the stands Oliver Holt's thought-provoking column for Mail Sport recently suggested that managers should sit in the stands for matches rather than stand on the touchline where they have been causing mischief (case in point: Liverpool boss Jurgen Klopp charging towards the fourth official John Brooks). After all, it comes with the added bonus of providing a greater vantage point for tactical observations. That's true. You do see more from up high than down low and here, there were West Ham and Manchester United analysts feeding back to their bosses in the technical area. David Moyes' assistant Billy McKinlay was seated by the press box with his microphone and earbuds in constant communication with his technical area. ",
        "Five seats to the left of McKinlay was Darren Fletcher, United's technical director who was likewise plugged in and studying statistics and footage on a laptop.West Ham feel aggrieved again over another handball claim It is less than two weeks since Moyes spoke with refereeing chief Howard Webb after West Ham were not awarded a penalty for handball against Liverpool. Another catch-up may be on the cards after they were denied one here too, this time when Victor Lindelof moved his arm towards the ball in blocking Said Benrahma's cross. 'If that was the other way around…' was the general feeling of West Ham's frustrated fans here.",
        "Declan Rice reassures a mascot as he continues a marathon season In a world where footballers are getting a bad rap for ignoring young mascots, let us give Declan Rice his due. As West Ham's captain waited to walk out of the tunnel at the London Stadium, he could tell the girl beside him was nervous and so bent down to give her a hug with a few reassuring words. This was Rice's 54th game of 2022-23. That ranks him fourth in English players for most appearances this season, behind Marcus Rashford (58), Harry Kane (57) and Bukayo Saka (55). It's been a long season for Rice but he looked raring to go here, having missed West Ham's midweek defeat at Manchester City through a mystery illness.",
        "London Stadium's big screens force De Gea to relive his howler David De Gea stood in his six-yard box, staring directly ahead as the London Stadium's big screen in front of him showed his howler over and over. Imagine making a mistake at work and having to watch replays of yourself committing it. Ouch. Yet this is not De Gea's first gaffe, nor will it be his last. Great goalkeeper, De Gea, but prone to some silliness.",
        "Erik ten Hag's side continue to tail off in the second half Manchester United's habit of tiring as the game goes on is becoming more and more apparent. Coming into this, they had scored only twice in their last 10 second halves. Trailing 1-0 at half time, you were not overly confident that they would get back into this and, of course, they could not.Lucas Paqueta is starting to live up to his price tag at West HamWith each passing game, Lucas Paqueta is looking like the Samba star that West Ham hoped they were buying for £51million last summer. The 25-year-old Brazilian is a pleasure to watch, the way his little feints can fool an opponent as they go one way and he turns another. Paqueta is a play progressor and has been a welcome addition to the Premier League.",
        "A decade on from Sir Alex Ferguson's retirement announcement Monday marks the 10th anniversary that Manchester United's legendary manager Sir Alex Ferguson announced he was stepping down after 26 years in charge. 'It is the right time,' Ferguson said on May 8, 2013. That means it is also 10 years since United last won the title and West Ham's fans were serenading the away end by singing: 'Your city is blue.'"
    ]
}