{
    "articleURL": "/sport/nfl/article-12061529/Dan-Orlovsky-backs-Chicago-Bears-breakout-QB-Justin-Fields-enter-NFL-MVP-conversation-year.html",
    "content": [
        "Chicago traded for WR DJ Moore to give Fields a true No. 1 wide receiving optionFields broke out last year recording over 2,000 passing yards and 1,000 rushing DailyMail.com provides all the latest international sports news Chicago Bears breakout quarterback Justin Fields is set to enter this year's MVP conversation, according to ESPN analyst Dan Orlovsky.",
        "'Just to remind everybody at home that the Chicago Bears had the No. 1 pick last year. They were terrible last year, the only reason they were actually in games was Justin Fields,' said Orlovsky.'Fast forward to this year their general manager Ryan Poles has done a couple things. No. 1 this offensive line has gone from weakness to potential strength.'No. 2 DJ Moore, there's finally some decent talent on the outside that he's going to have the chance to throw to.'And then three the growth that he is going to have. Everyone continues to say 'follow the Jalen Hurts model,' for the style, no. Justin Fields season should look a lot like Josh Allen's second season did that last half.'",
        "' I remember everyone talking about I think his last 11 games of his second season he went for like 18 touchdowns and like three picks. 'And you saw uh oh it's starting to take off. That's what this season should look like for from start to finish for Justin Fields.'I will say it again, he's finally going to be in the MVP conversation this year because he has the right people around him to allow his talents to excel.'As Orlovsky mentioned the Bears dedicated to this offseason to building up the offense around their young QB who broke out last season in a major way.",
        "Aside from acquiring DJ Moore to give Fields a true No. 1 target in the passing game, something he did not possess previously, the Bears also added free agent pick up Nate Davis and first-round draft pick Darnell Wright, allowing Tevin Jenkins to move inside from tackle to guard.Last season Fields threw for 2,242 yards, 17 touchdowns, and ran for 1,143 yards and eight touchdowns.Allen's second season saw him end the year with 20 touchdowns and nine interceptions before his numbers skyrocketed to 37-10 in his third season.If Fields can duplicate this type of progression it would see the Bears take a tremendous leap towards being one of the top teams in the NFC, along with sending Fields into the heart of the conversation awards."
    ]
}