{
    "articleURL": "/wires/reuters/article-12060653/Soccer-Excellent-Everton-blitz-Brighton-shock-5-1-win.html",
    "content": [
        "BRIGHTON, England, May 8 (Reuters) - Abdoulaye Doucoure scored a brace of first-half goals as relegation threatened Everton produced a masterclass in counter-attack football with a surprise 5-1 Premier League victory at Brighton &amp;amp; Hove Albion on Monday.",
        "Brighton goalkeeper Jason Steele scored an own goal and Dwight McNeil added two more as Everton cut their hosts apart with lightning quick breaks, and then absorbed intense pressure in the second half, eventually conceding when Alexis Mac Allister netted for the home team.The Merseyside club moved to 32 points from 35 games, two points clear of the drop zone, as they seek to avoid a first relegation since 1951, while Brighton´s hopes of European football next season were dented and they sit in seventh with 55 points from 33 games.Everton had 23 percent possession in the game, but were excellent in breaking down Brighton attacks and flooding forward on the counter, scoring 10 percent of their Premier League goals this season in a dream first half.\"It's massive. We started on the front foot, we had a game plan and we stuck to it. We were all brilliant today and we deserved the three points,\" McNeil told BT Sport.\"We couldn't have got off to a better start. It's a credit to the lads, we've been in a difficult position this year. Now we've just got to build on this game.\"It's massive confidence now, this is about us kicking on as a team. We have a massive game on Sunday (at home to Manchester City) and then two massive games after that.\"",
        "Doucoure´s first came after 34 seconds as he tapped home from close range, finishing off a low cross after being set up by the excellent Dominic Calvert-Lewin.Another quick Everton break saw McNeil cross for Doucoure to net a superb second with an excellent volley from 12 yards.McNeil´s low cross was then directed into his own net by Steele, before the Everton winger added two more in the second half, also from quick counter-attacks.Brighton manager Roberto De Zerbi made four changes at halftime and his positive move made for a vastly improved home team after the break, but despite being camped around the Everton box, they managed only one goal through Mac Allister.\"Still three cup finals and we have to keep going. You have to take a lot of positives from that,\" Everton goalkeeper Jordan Pickford said.\"The gaffer (Sean Dyche) made a couple of changes. We set the standard early. We have to keep going as a group, the togetherness is there but we mustn't take the foot off the gas.\" (Reporting by Nick Said Editing by Toby Davis)"
    ]
}