{
    "articleURL": "/wires/pa/article-12060669/Alex-Sanderson-confirms-bringing-Luke-Cowan-Dickie-Sale-Sharks.html",
    "content": [
        "Sale boss Alex Sanderson has admitted his interest in bringing England hooker Luke Cowan-Dickie to the club amid reports his proposed move to Montpellier has fallen through.",
        "The 29-year-old Exeter forward was due to join the Top 14 club this summer, but reports from France have suggested the deal has broken down on medical grounds with Cowan-Dickie working his way back from ankle surgery.Montpellier have been linked with Tolu Latu, previously a target for the Sharks, and director of rugby Sanderson revealed during a press conference on Monday that he had heard the Australia international had agreed a deal for “twice the amount of money that we offered him.”",
        "Asked if he would be interested in Cowan-Dickie, he said: “Yes, why wouldn’t you? He’s a great player.“I don’t know if we would be in the right price point, but he’s got mates up here as well, he fits our kind of game model in that Ewan Ashman, Akker van de Merwe mould, doesn’t he? He’s a banger, so he ticks the box on a lot of fronts there.“But I haven’t spoken to him, I haven’t spoken to Luke, so there’s nothing there in terms of that actually materialising.”In the meantime, Sanderson will concentrate on the task of preparing his players for Sunday’s Gallagher Premiership semi-final clash with reigning champions Leicester Tigers and to that end, has enlisted the help of rugby league great Jamie Peacock.",
        "Peacock won nine Super League Grand Finals, four Challenge Cup finals and four World Club Challenges during his glittering playing career, and Sanderson is hoping his “champion attitude” will rub off on his charges.He said: “We’ve got JP coming in, who’ll have a little chat to us about what champion attitude looks like.“He’s won nine Super Leagues and four World Challenges or whatever it is. He was a legend, so we’ll hopefully take a little leaf out of his book and add it to our own.”Sale last won the Premiership final in 2006, and lost out in the semi-finals to Exeter two years ago.",
        "This time around, they have proven winners George Ford, who was in the Tigers side which lifted the trophy last season, and Manu Tuilagi among their ranks, and Sanderson is convinced their winning mentality is key.Asked how important it could be, he said: “It’s crucial, isn’t it, because these are leaders who come to the fore at this time of the season.“There are guys that have to step up on the field and are able to keep their heads and respond and find ways when the plan doesn’t work – which it invariably doesn’t against the better teams – find ways of navigating to good outcomes, to better outcomes.",
        "“Being able to draw on their experience is crucial, like I did this morning and I will tomorrow as we go through the week. I’ll continue to lean on them, not that it’s a chore for them, they want to.”"
    ]
}