{
    "articleURL": "/wires/pa/article-12052761/Gary-Bowyer-hails-Dundee-resilience-unity-securing-Premiership-return.html",
    "content": [
        "Gary Bowyer hailed the resilience of his Dundee players after they sealed a return to the cinch Premiership with a 5-3 win over Queen’s Park in Friday night’s Championship title shootout.",
        "The Dens Park side edged a thrilling encounter at Ochilview to bounce back to the top flight at the first time of asking following their relegation a year ago.“It was a magnificent effort from the players tonight,” Bowyer, who was appointed Dundee manager last summer, told BBC Scotland. “They deserve it, they’ve been brilliant all season.“We only signed one permanent player and we’ve brought lads in on loan but the way they’ve stuck together and the resilience they have shown has been fantastic.“Everybody said Dundee are favourites, Dundee should do this, Dundee should do that, but you’ve got to go out and do it. These lads went out and did it and I’m delighted for them.”Bowyer went through a full range of emotions in a topsy-turvy first half that ended 3-3 before second-half strikes from Lyall Cameron and Luke McCowan gave Dundee a two-goal cushion over a Queen’s side who knew they needed a win to overhaul the Dark Blues at the summit.",
        "“It was a fantastic start, then it wasn’t such a great start, and the goals we conceded were poor but we’ll let that go now obviously,” said Bowyer.“It was just absolutely amazing the resilience they had and the way they fought. They kept coming back. The spirit and character they had was just brilliant.”",
        "After seeing his players lift the Championship trophy at Ochilview following a pitch invasion by jubilant supporters, Bowyer is intent on making an impact in the top flight.“The club have now got to stop being a yo-yo club and try and get established in the Premiership,” he said. “We’ll go and attack it next season. There’s a lot of work that needs to be done both on and off the pitch for that but that’s not for tonight.”Queen’s Park slipped from second to third and must now come through six play-off matches if they are to win promotion, starting with a two-legged showdown with Partick Thistle.Manager Owen Coyle admitted his side’s defending proved costly.“Attacking-wise we know what we’ve got in our team but I think over the course of the season our Achilles heel has been defending situations and we certainly didn’t do that well tonight,” he said. “Congratulations to Dundee but the goals we gave away…“There was so much to be pleased about but the bottom line is we’ve lost a game where we could have been champions.“If we are to get to the Premiership this year we’ve got to do it through the play-offs. We’re hurt and disappointed but we’ll get the players lifted and we’ll go again.”"
    ]
}