{
    "articleURL": "/tvshowbiz/article-12053439/Taylor-Swift-release-recording-studio-album-Speak-Now.html",
    "content": [
        "Taylor Swift gave her devoted fanbase a shock on Friday night as she announced her next album re-recording will be Speak Now.",
        "The 33-year-old music sensation performed in Nashville - where her rumored love interest Matt Healy was in the audience - at Nissan Stadium and shared the update while on stage.The beloved singer-songwriter said to fans, 'There's a different reason that I'm really excited about this part of the set tonight. Because I've been planning something for a while,' according to an account by People.She added, 'You know how I love to plan things, and how I love to surprise you with the things I plan. It's my love language with you — I plot, I scheme, I plan and I get to tell you about it. If you would direct your attention to the back big screen...'At that moment the new cover of Speak Now appeared with the title Taylor's Version, along with its release date - July 7, 2023.",
        "Swift used the next moment to transition into one of her Speak Now hits, Sparks Fly.Taking to Instagram to interact with her 257 million followers, Taylor wrote a lengthy caption sharing the news online as well. 'It fills me with such pride and joy to announce that my version of Speak Now will be out July 7 (just in time for July 9th, iykyk) I first made Speak Now, completely self-written, between the ages of 18 and 20,' she wrote.",
        "'The songs that came from this time in my life were marked by their brutal honesty, unfiltered diaristic confessions and wild wistfulness.'I love this album because it tells a tale of growing up, flailing, flying and crashing… and living to speak about it. 'With six extra songs I've sprung loose from the vault, I absolutely cannot wait to celebrate Speak Now (Taylor's Version) with you on July 7th. 'Pre-order now at TaylorSwift.com,' she finished the post.Some fans who closely follow the performer's every move guessed that Speak Now would be her next re-release.",
        "In February, they noticed Taylor wore a midnight blue co-ord by Roberto Cavalli, who she worked with during her Speak Now era.And prior to that, in January, after the release of music videos for the album Midnights, her followers noticed some other hints.In the Anti-Hero video, it was noted that she featured the guitar she played every night on her Speak Now tour.Also, along with her Bejeweled video, Taylor included an instrumental of the song Enchanted from the Speak Now album.Following the news, fans quickly took to social media to share their excitement about the new renditions of Taylor's old music.One fan account took to Twitter to post a meme with the caption, 'F*** you Matty Healy we got speak now taylors version,' in all caps. ",
        "Another user on the platform tweeted, 'Oh you're dropping Speak Now (Taylor's Version)? Should we celebrate? Should we throw a party? Should we invite Matty Healy?'One fan expressed envy as they said, 'Matty Healy witnessing both nothing new and the speak now tv announcement live and not me.' ",
        "Taylor's choice to re-record her old music follows Scooter Braun's acquisition of her former music label Big Machine.The purchase allowed him take the rights to the masters of the star's first six albums, which he later sold for $300 million to Shamrock Holdings.Since then Swift has released re-recordings of her 2012 album Red and 2008's Fearless.She began sharing the new versions in 2021 and noted that although the private equity company approached her, she decided against working with them because Braun would still make money off her music for many years."
    ]
}