{
    "articleURL": "/wires/pa/article-12054413/Prince-Louis-Princess-Charlotte-hold-hands-abbey-arrival.html",
    "content": [
        "Prince Louis and his sister Princess Charlotte held hands in a sweet display as they attended the coronation of their grandfather, the King.",
        "The siblings linked fingers as they walked into Westminster Abbey behind their parents, the Prince and Princess of Wales, before taking up their front row seats.Louis failed to stifle several yawns during the historic ceremony and at one point took a break away from the service before returning for the national anthem.",
        "He also took the opportunity to point out interesting things to his sister as they sat before the high altar.As the service drew to a close, the royal children sang God Save The King as their grandfather walked past.Five-year-old Louis and Charlotte, eight, then held hands again as they left the abbey.Louis was regally dressed in a Hainsworth Garter Blue Doeskin Tunic with specially designed lace work embellishment to the collar, cuffs and fronts, made by bespoke Savile Row tailors Dege and Skinner.His leg garment was black complete with a Garter Blue stripe.",
        "The deeply religious and solemn ceremony was two hours long which was why a break had been factored in for the young prince, with Louis having not attended his great-grandmother Elizabeth II’s funeral in September.Louis has become known for entertaining royal fans with his reactions during royal celebrations.He was seen letting out a howl and clapping his hands over his ears on the Buckingham Palace balcony during the Platinum Jubilee flypast as his “Gan Gan”, the late Queen, told him what was happening.",
        "The now-fourth-in-line to the throne was also spotted being bounced on the knee of his grandfather, Charles, during the jubilee pageant and giving his mother Kate a kiss on the cheek and a cuddle.He stood on his chair, waved his hands in the air, wriggled around and stuck his finger in his ear during the show last year.In a personal tweet thanking those who turned out in 2022, William and Kate wrote: “We all had an incredible time, especially Louis… ”",
        "The prince processed out of the abbey with Charlotte and his parents at the end of coronation service and met up with his brother George, who was serving as one of the King’s Pages of Honour.Once back at Buckingham Palace, the three children were seen on the balcony, with Louis waving to the crowds and drumming his fingers at one point.During the flypast, the children could be seen gazing upwards towards the sky."
    ]
}