{
    "articleURL": "/news/article-12052289/Inmate-escaped-Virginia-jail-captured-Mexico.html",
    "content": [
        "Alder Martín-Sotelo was taken into custody in Guerrero, Mexico, on ThursdayThe 26-year-old escaped from the Piedmont Regional Jail in Farmville, Virginia, last SundayMartín-Sotelo was in jail for murdering North Carolina cop Ned Byrd in August 2022An inmate who escaped from a Virginia jail where he was being held for the murder of a North Carolina police officer was captured in Mexico.",
        "Alder Marín-Sotelo, 26, was taken into custody by authorities in the Pacific coast state of Guerrero on Thursday, the FBI confirmed.The 26-year-old is facing charges in the August 2022 killing of Wake County, North Carolina, Deputy Ned Byrd.Marín-Sotelo, an undocumented immigrant, fled from the Piedmont Regional Jail in Farmville, Virginia, last Sunday.",
        "The U.S. Marshals Service said Friday that Marín-Sotelo had worked with his cellmate to devise a plan to escape.Marín-Sotelo and a second inmate identified as Bruce Callahan, 44, were able to flee the jail by manipulating 'the locking mechanism on the rear exit door.''I think it's like it's fair to reason that they may have talked about (the escape), given that it was so similar,' US Marshals Service Chief Deputy Larry Moltzan told ABC 11. 'But they did not escape at the same time and didn't necessarily help each other in that way.'The Piedmont Regional Jail Authority Board acknowledged that the prison had several areas with unreliable security systems, but that the area which Marin-Sotelo escaped through was not one of them.Callahan remained on the run as of Friday. A $10,000 reward is being offered for information that leads to his apprehension.",
        "Authorities said Marín-Sotelo climbed a fence and then boarded a Mustang that was provided by his sister, Adriana Marín-Sotelo, who in currently in police custody, and traveled almost 2,400 miles to seek refuge in Mexico.",
        "It's unknown how Alder Marín-Sotelo was able to cross into Mexico. His extradition to the United States is now pending.Marín-Sotelo and his brother, Arturo Marín-Sotelo, were charged with murdering Byrd.The deputy, who was in the police force for 13 years, was shot three time in the head and once In the chest on August 11, 2022 and died the following day.The Wake County Sheriff's Office lauded the multi federal agency effort that led to Alder Marín-Sotelo's arrest in Mexico. 'The arrest of Alder Alfonso Marin-Sotelo allows every employee of the Wake County Sheriff's Office to breathe easier tonight,' Wake County Sheriff Willie Rowe said Thursday. The escape and search opened old wounds for our Office and Deputy Ned Byrd's family. We have been in contact with his family and are offering support in any way we can.'"
    ]
}