{
    "articleURL": "/news/article-12050075/Keir-Starmer-gloats-set-PM-grim-local-elections-Tories.html",
    "content": [
        " Voters across England have been choosing 8,000 councillors in 230 councilsThe separatist Scottish National Party boasted that it will 'pull the strings' of a minority Labour government after the Tories suffered a local election meltdown today.",
        "Rishi Sunak has been left reeling as voters in England dealt a series of stinging blows, stripping the Tories of control in dozens of town halls and kicking out more than 700 councillors. Losses could top 1,000 by the time counting concludes tonight.Labour is now the largest party in local government for the first time in more than two decades. It racked up significant gains to take charge of councils such as Medway, Swindon, East Staffordshire, Bracknell Forest and Dover, while the Lib Dems took Surrey Heath in Michael Gove's constituency.But experts cautioned that Sir Keir's vote share does not look enough to win an overall Commons majority.Instead he could be left needing to do a deal with either the Lib Dems or Scottish nationalists to prop him up in No10. A jubilant SNP Westminster leader Stephen Flynn said he expected to hold the 'balance of power' after the general election next year.His party is bound to demand another Scots independence referendum as the price of their backing, although it is also facing its own problems with a police probe into its finances.",
        "Medway - Tory LOSS to LabourSwindon - Tory LOSS to Labour East Staffordshire Windsor &amp; Maidenhead - Tory LOSS to Lib Dems Brentwood - Tory LOSS to no overall controlHertsmere - Tory LOSS to no overall controlNorth West Leicestershire - Tory LOSS to no overall controlTamworth - Tory LOSS to no overall controlEast Lindsey - Tory LOSS to no overall controlSouth Kesteven - Tory LOSS to no overall control East Hertfordshire - Tory LOSS to no overall control South Gloucestershire - Tory LOSS to no overall control Welwyn Hatfield - Tory LOSS to no overall controlMaidstone - Tory LOSS to no overall control Bromsgrove - Tory LOSS to no overall control Plymouth Stoke-on-Trent - Labour GAIN from no overall controlBoston - Independent GAIN from no overall control Mid Suffolk - Green GAIN from no overall control Bracknell Forest - Tory LOSS to Labour Broxtowe - Tory LOSS to LabourNorth East Derbyshire - Tory LOSS to Labour Dover - Tory LOSS to Labour Surrey Heath - Tory LOSS to the Lib Dems ",
        "Unhappy Conservative MPs admitted the party's results were dire, but insisted there was little evidence voters were 'rushing' to Sir Keir. 'They have had this wonderful opportunity to stick two fingers up to the government,' one senior backbencher told MailOnline. 'The Lib Dems wouldn't have done so well if he was more dynamic.' Mr Sunak tried to put a brave face on the 'disappointing' results and dismissed calls for a change in approach, insisting he would keep focusing on the public's 'priorities' such as cutting inflation. He is likely to get breathing space because attention will move on quickly to the coronation.But one minister told Mail Online: 'Tory voters feel let down by Tory policies that aren’t conservative.' And former Cabinet minister John Redwood renewed his call for immediate tax cuts, saying: 'If the PM wants to win back lost Conservative voters he should try offering some Conservative policies.'Some Tories criticised the government for failing to stick to housebuilding targets - although others said pressure to build more had hurt them at the ballot box.Party chair Greg Hands upped the ante in a message to activists this evening, conceding that the results were 'disappointing' and a 'massive wake-up call'.Appealing for donations, he added: 'I don't want to see Keir Starmer reopen Brexit.",
        "'I don't want to see Angela Rayner enthusiastically give in to every union demand.'Speaking in Medway, where his party took charge to end 23 years of blue rule, Sir Keir hailed 'fantastic results across the country'. 'Make no mistake, we are on course for a Labour majority at the next general election,' he said.In more body blows, the Lib Dems have seized Windsor &amp; Maidenhead - where Theresa May is MP - and Stratford-on-Avon in Nadhim Zahawi's seat, and are hoping to take over in Michael Gove's Surrey Heath back yard. Tories could yet ship more than 1,000 seats overall. Bright spots have been rare as the pummelling took in 'Red Wall' areas and traditional heartlands.But respected elections expert Professor Michael Thrasher told Sky News that the national vote share should temper the jubilation for Labour.The 1.7million votes counted so far show the Tories on 28-30 per cent, with Labour considerable ahead on 18-20 per cent. The Lib Dems have surged to 18-20 per cent.Prof Thrasher said that was 'very good results but not quite getting over the line' for an overall majority at a general election. He suggested it was 'plausible' that Labour could govern alone, but it would depend on how they fared against the SNP in Scotland. ",
        "Separate estimates by Professor Sir John Curtice found Labour advantage was nine points. 'Although Labour have met the minimum threshold they set themselves, the party will be disappointed that it has not been any more successful this year than last,' he said. Tory sources argued that Tony Blair was much further ahead in 1996, and David Cameron enjoyed a 13 point lead in 2009.  ",
        "The Tories have lost control of councils in Brentwood, Tamworth, North West Leicestershire, Hertsmere, East Lindsey, South Kesteven, East Hertfordshire and South Gloucestershire. The Conservative majority in Welwyn Hatfield - Grant Shapps' constituency - has been wiped out. Labour celebrated victories in Plymouth, where the Conservatives had been running a minority administration, and Stoke-on-Trent - a key battleground ahead of next year's general election. They were also jubilant about a mayoral win in Middlesbrough.The party boasted that their performance so far, if replicated at a general election, would be good enough to see Sir Keir become PM. That would require a massive double-digit swing.Angry local leaders blamed a backlash over the cost of living, access to GPs, and housing. Some Tories renewed calls for immediate tax cuts. In both Tamworth and North West Leicestershire there were signs that recent Westminster sleaze scandals had damaged the Tories as they lost control of both councils.",
        "Tamworth's local MP is Chris Pincher, the former Conservative whip who faced groping claims last summer in a scandal that ultimately led to Boris Johnson's downfall as PM.The North West Leicestershire MP is Andrew Bridgen, who was kicked out the Conservative Party last month following his claim that Covid vaccines were 'the biggest crime against humanity since the Holocaust'.As well as their gains in Plymouth and Stoke-on-Trent, Labour held on to councils in Sunderland, Chorley, Halton, Newcastle-upon-Tyne, South Tyneside, Sefton, Exeter, Stevenage, Ipswich, Lincoln, Coventry, Salford, Sandwell, Reading and Bassetlaw.They failed to gain a majority in Hartlepool by just one seat, two years on from suffering a devastating Commons by-election loss in the 'Red Wall' area.The Tories did hold on to many councils across England - including Broxbourne, Harlow, Redditch, Basildon, Havant, Rushmoor, North East Lincolnshire, Thurrock and Dudley.Mr Sunak - who arrived at CCHQ with bags of comfort food this morning - pointed to 'progress' in areas such as Sandwell, and said he was concentrating on 'delivering' issues such as lower inflation and stopping Channel migrants. He said it was 'always disappointing to lose hardworking Conservative councillors' but added: 'I'm not detecting any massive groundswell of movement towards the Labour Party or excitement for their agenda.'Labour gloated that they had spoiled Mr Sunak's 'political honeymoon'. ",
        "But senior Tory MPs said Mr Sunak was not being widely blamed for the mess the party was in. One insisted he must keep being 'steady' and showing the government is competent, before bringing forward tax cuts before the election.'You can't do them unfunded,' the MP said. 'It has got to be properly explained... you can't do it yet.' Another Conservative with a marginal Red Wall seat told MailOnline that Labour was not on track to win outright, predicting that the Tories would end up 'in the 280s' for seats and Labour 'the 290s'.'There's nothing I have seen that changes my opinion that Labour will form a minority government,' they said. 'Probably a supply and confidence with the SNP.'We are not going to get a majority. We will be out of power.' The MP predicted that the Labour Left would see that as an opportunity to push Sir Keir to adopt their policies, in the same way the Brexiteer ERG group had when the Tories had a slender majority. On Mr Sunak's fortunes, the backbencher said: 'Everybody's keeping their mouths shut because they think we have got to steady the ship. Whether that carries on is another question.' SNP Westminster Leader Mr Flynn said: 'It's increasingly clear that the SNP can hold the balance of power after the next general election – putting Scotland in prime position to pull the strings of a minority UK government.'Voting SNP is the best way to beat the Tories in Scotland – and every vote for the SNP will be crucial to ensure Scotland wields real power and influence.'From 7am to 10pm yesterday, voters across England visited polling stations to choose around 8,000 councillors in 230 councils.But interpreting the outcome is not straightforward, as the seats up for grabs were last contested in 2019 - when both the Tories and Labour were in dire positions.   Mr Sunak has already lined up a fightback, with long-awaited proposals to improve access to GPs due to be unveiled next week.Downing Street has drawn up plans for a health-focused mini-relaunch in the coming days to demonstrate that the Prime Minister is focused on delivering on the public's priorities.The package will include the Government's delayed primary care plan which is designed to free up hundreds of thousands of GP appointments by asking pharmacists to issue more prescriptions.The Tory MP in Plymouth, Johnny Mercer, who is the veterans' minister, said it had been a 'really terrible night for us here in Plymouth'.Pointing to a row over tree-felling by the council, he added: 'There's a number of factors at play - locally it's been very difficult, the Conservative group here has been through a very difficult time.'As well as their success in the South West, Labour were also celebrating their candidate Chris Cooke defeating the independent incumbent to become the new mayor of Middlesbrough. Lib Dem leader Ed Davey dodged questions over whether he would prop up Sir Keir Starmer in power after shocking the Tories in Windsor.Sir Ed hailed seizing control of the council as he visited the town, staging an awkward photo op with a large clock to show Rishi Sunak his 'time's up'.He said he was proud that Katy Perry and Lionel Richie would be performing in Lib Dem territory at the coronation concert this weekend. But he repeatedly ducked questions on what he will do if Labour falls just short of a majority at the next general election.Local Tories pinned the blame for poor council election results on a failure to grip issues such as the NHS.Kent MP Kelly Tolhurst blamed 'uproar' against 'unrealistic housing targets' that have forced councils to 'build really significant numbers of homes. Outgoing Medway council leader Alan Jarrett told BBC Radio 4's Today programme the government must 'get their act together on a number of fronts'.He said that included 'being clearer about housing requirements... and a really big issue here is access to GP provision'.Others highlighted the turmoil at Westminster over the past year. 'Nationally and locally we've had a very difficult 12 months and I think the electorate have responded to that and voted as they see fit today,' Jeremy Oates, the Tory leader on Tamworth Council, told the BBC.Chris Mitchell, a former local Tory leader who lost his seat on Worcester Council to the Greens tonight, said: 'The political backdrop of Westminster undoubtedly is a key factor, which we heard on the doorstep.'Virge Richichi, a former chair of North West Leicestershire Council and a current councillor, said: 'We've been dealt a pretty bad hand over the past three or four years from Boris, Liz Truss and now Rishi Sunak.'And hopefully Rishi Sunak will put us on the right track again.'",
        "CiAgICAgIDxkaXYgZGF0YS14cG1vZHVsZS0yMDIzLW1heS1lbGVjdGlvbnMgZGF0YS1zZWxlY3RlZC1tYXAtdGFiPSJlbmdsYW5kIiBkYXRhLW1heS1oaWRlLXRhYnM9InRydWUiID4KICAgICAgICA8ZGl2IGNsYXNzPSJtYXktbWFwLXRhYnNlbGVjdG9ycyI+CiAgICAgICAgICA8ZGl2IGRhdGEtbWFwLXRhYi1zZWxlY3Q9ImVuZ2xhbmQiIGNsYXNzPSJtYXlTZWxlY3RlZCI+RW5nbGFuZDwvZGl2PgogICAgICAgIDwvZGl2PgogICAgICAgIDxkaXYgY2xhc3M9Im1heS1saXZlcmVzdWx0cyI+TElWRSBSRVNVTFRTPC9kaXY+CiAgICAgICAgPGRpdiBjbGFzcz0ibWF5LW1hcC10YWJzIj4KICAgICAgICAgIDxkaXYgZGF0YS1tYXktdGFiPSJlbmdsYW5kIiBjbGFzcz0ibWF5U2VsZWN0ZWQiPgogICAgICAgICAgICA8aW1nIHNyYz0iaHR0cHM6Ly9pLmRhaWx5bWFpbC5jby51ay8xcy9lbGVjdGlvbi8yMDIzLWVuZ2xhbmQuanBnIiBsb2FkaW5nPSJsYXp5IiB3aWR0aD0iMTQwMCIgaGVpZ2h0PSIxMzcyIiBhbHQ9IkVuZ2xpc2ggTG9jYWwgRWxlY3Rpb25zIiAvPgogICAgICAgICAgPC9kaXY+CiAgICAgICAgPC9kaXY+CiAgICAgIDwvZGl2PgogICAg",
        "Prior to polling day, the PM had predicted a 'hard night' and warned that - despite 'good progress' since he entered No10 - Tory councillors could yet be punished for the turbulence of the past 12 months at Westminster.Mr Sunak personally paid for a delivery of 10 large Domino's pizzas at Tory HQ last night ahead of votes being counted across England. The local council seats being decided this year were last contested in 2019, at the nadir of Theresa May's time as PM.Following a poor performance that night, Mrs May went on to suffer humiliation in European Parliament elections just three weeks later, which swiftly led to her resignation.But Labour was also failing to make major inroads at the time with an unpopular leader in Jeremy Corbyn.Polling experts have said that Labour needs to score a victory of more than 10 per cent in the projected national vote share in this year's local elections to show that Sir Keir is on course to be the next PM.Sir Tony Blair had double-digit local election vote share victories in the lead-up to New Labour's landslide in 1997, as did David Cameron's Tories before 2010 when they ended up in coalition with the Liberal Democrats.Labour gaining 700 seats or more would be the party's best local election performance for at least 10 years.And gains above 500 seats would point to Sir Keir being poised to win the keys to Downing Street at the next general election, experts have said.",
        "Thursday's local elections were the first time it has been compulsory for all voters in England to show photo identification at polling stations. There were regional pilots previously.There were reports of confusion at ballot stations over new ID rules, with the Lib Dems complaining that the numbers are 'significant'.Some said they turned up to vote with photo ID only to be told it was the wrong type - while others claimed 'greeters' were asking for identification and turning people away outside, meaning that records would not be kept.The craze for #dogsatpollingstations even got in on the act, with one owner creating an ID for her pet.But the Electoral Commission said their initial assessment was that 'overall, the elections were well run'.People were required to show a form of photo identification, such as a passport, driving licence or blue badge.Other forms of identity that were being accepted include biometric residence permits, defence identity cards, and national identity cards issued by the EU, Norway, Iceland or Liechtenstein.Supporters say it is normal to show ID in much of the rest of the world, and the move protects the integrity of the process. But critics argue it could deter young people and those from poorer communities.There have been questions raised about why bus and travel passes for older and disabled people were accepted as photo IDs, but that young people's travel cards were not."
    ]
}