{
    "articleURL": "/sport/football/article-12048917/Napoli-Udinese-fans-fight-PITCH-Spallettis-clinch-Scudetto-draw.html",
    "content": [
        "Osimhen's second-half equaliser sealed Napoli's first Serie A title in 33 YEARSNapoli fans were met by hostile home supporters armed with belts and batonsSix fans were reported to have sustained non-serious injuries on Thursday night Napoli and Udinese fans fought on the pitch after Luciano Spalletti's side clinched the Scudetto at Udinese on Thursday night.",
        "Napoli fans ran onto the pitch to celebrate with players following the 1-1 draw, but were met by hostile home supporters armed with belts and batons, the ANSA news agency said.Anti-riot police intervened to break up the fights, and six fans were reported to have sustained non-serious injuries, RAI public television said.Napoli claimed a third crown following a draw at mid-table Udinese.The draw gave Luciano Spalletti's side an unassailable 16-point lead over second-placed Lazio with only five matches left in the season.",
        "'Yes! We are the champions' supporter Roberto Santoniello told Reuters TV, proudly wearing his club's shirt while others were screaming, waving flags, lighting flares and firecrackers in the central Trieste and Trento Square.Udinese are based in Italy's north-east, more than 800 kilometres away from Naples, so many Napoli fans stayed home and watched the game at their local Maradona stadium, which was specially equipped with eight giant screens.The U.S. consulate issued a security alert last week, saying 'spontaneous celebrations could last multiple days' and warned of 'heavy traffic or road closures, significant use fireworks, and alcohol consumption throughout the city'.Police had banned fireworks but that did not stop the Neapolitan sky being lit up as soon as the game against Udinese was over. Authorities also banned car and scooter traffic from the city centre in the hope of minimising risk to public order.",
        "Having enjoyed a stellar season, Neapolitans have been gearing up for weeks for the title celebration, casting aside their usual superstition about claiming victory before it happens.Streamers, banners, flags, scarves and life-sized cardboard replicas of Napoli's present-day footballers, including Nigerian striker Victor Osimhen and Georgian winger Khvicha Kvaratskhelia, have festooned the city centre.The late Maradona is also still revered, celebrated on fans' t-shirts, banners or tattoos, and on a giant mural in Naples' Miracles Square that has become a major attraction in the countdown to the Scudetto."
    ]
}