{
    "articleURL": "/tvshowbiz/article-12056189/TOWIE-look-Roman-enlists-Junaids-help-try-win-Dani-back.html",
    "content": [
        "This Sunday's episode of TOWIE is set to be filled with drama, tension and romance from the outset. ",
        "Roman Hackett, 20, and Dani Imbert, 23, called time on their romance last year after they joined the show as 'best friends' back in 2021. But Sunday night's episode will show all is not lost, as Roman comes up with a plan to help win her back.  In the seventh episode of The Only Way Is Essex, the cast plan a beach party for Jordan’s birthday before the sun sets on their last day in Thailand, but they’re surprised when he’s nowhere to be seen...A shocking showdown between Dani and Roman at the beach ends up in a drink swill, and Dani has some choice words for Diags and Lockie...",
        "As the cast return to Essex, Roman drafts in Junaid Ahmed, 28, to help get Dani back, but will she give in to his charms? In a trailer for the episode, Roman can be heard saying: 'I lied to the girl that I'm mad over and I need help. I've loved her for ages, you know how much I like her.'Junaid seems willing to help, responding: 'I know how much she means to you so I will do everything in my power to try and get you two back on track. For me, I do want to see you two both together. ",
        "'You did make a stupid mistake but you know that and I'm not going to be the one to rub it in your face. 'This is the first step to getting Dani back. You need to graft. Dani Imbert, the one that you love, loves roses.'Fans are therefore left to imagine that Roman will be arranging a romantic surprise filled with flowers for his love.  Meanwhile, Jordan and Sophie go from strength to strength as they discuss their upcoming move, and are babies on the horizon?Elsewhere, Harry catches his mum up on the Thailand drama and ponders over his kiss with Junaid - could there be something between the pair?",
        "It comes after Dani and Roman appeared to be enjoying a secret first date at Tarantinos Restaurant in Brentwood back in March.The reality stars, who joined the hit show together as 'best friends' in 2021, looked more loved up than ever as they cosied up outside the restaurant. Dani dressed to impress for the evening in a plunging black mini dress while Roman looked smart in a black shirt and nude trousers. Dani added inches to her frame in a pair of towering dark heels and toted her belongings around in a designer bag. The pair were all smiles as they put on a flirty display following their romantic date night. ",
        "They walked hand in hand before Roman wrapped his arm around Dani as they made their way home.Earlier in March, The Sun revealed the pair had locked lips and were an item as the TOWIE cast travelled to Thailand for filming.A source told The Sun: 'Friendship turned into romance when they were away in Thailand. Everyone knows they're a couple now.",
        "'It's actually very sweet and feels like it was meant to be all along.' Previously, Dani dated co-star Liam Gatsby and was branded a 'f***ing joke' by her new beau Roman before he furiously stormed off. Following the fall out, Roman and Dani had a heart to heart but tempers flared once again after he asked her: 'Have you said to me before you're not happy with Gatsby'. Tearful Dani replied: 'Maybe I've confided in you a bit too much. Maybe it's insecurity, whatever.' Roman was left angry once again and told Dani to: 'Crack on with your fake relationship, yeah. You're a f***ing joke.'Dani and Liam later went separate ways as she revealed that she and Roman spent the night together and shared a kiss.The pair denied any romantic connection, but their co-stars speculated if they were more than just friends. The Only Way Is Essex airs Sunday at 9pm on ITVBE and ITVX."
    ]
}