{
    "articleURL": "/femail/article-12038691/Im-stylist-heres-prevent-makeup-transferring-clothes.html",
    "content": [
        "Alex Lamb has revealed a hack that ensures your makeup won't transferThe NYC stylist sprays the collars of white button down shirts with hairspray Viewers branded her a 'genius' and called her tip 'life-changing' A stylist has revealed the perfect hack for ensuring that your fresh face of makeup doesn't get all over your white collared shirt - and all you will need is hairspray. ",
        "New York based-fashionista Alex Lamb frequently shares her best methods for achieving the perfect look on her TikTok account, where she boasts over 44,000 followers. Most recently, the fashion icon came to beauty enthusiasts' rescue and shared how they could get the chic look of a white collared shirt without smudging their makeup. ",
        "In a viral video, which amassed over 1.1 million views, she detailed the 'life-changing' advice that will leave your shirts stain-free.'Things I learned as I stylist in NYC, spray hairspray on your white collar shirts to prevent makeup transferring. 'Thank me later,' she said while striking a pose in a white button down. In a follow-up video, Alex demonstrated how to make your shirts free from the stains of makeup. Holding her white button-down in one hand and a bottle of Oribe hairspray in another, the fashionista displayed her fool-proof method.  'So I'm tasking my Oribe hairspray, that's it, like hold [the shirt] out so you get [the hairspray] all over it,' she said while spraying the button down. The stylist explained that she likes to 'douse' the collared top in the hair spray to make sure that not even a dot of makeup transfers. After spraying a generous amount of the product that helps your locks stay in place, let it dry and you're good to go. ",
        "The stylist frequently styles a white collared button-down, proving that piece is a staple item in everyone's closet. ",
        "Viewers flocked to the comments section with words of praise, gushing over the stylist's tip that 'saved' their clothes. One user wrote: 'Oh my god! Really? My life just changed. Thanks for the great advice!' 'This just saved my clothes, thank you,' added another person. Someone else commented: 'You've changed my life.' 'Game changer. You’re an angel,' said another person.One user added: 'Genius.'"
    ]
}