{
    "articleURL": "/wires/reuters/article-12055777/Nashville-SC-blank-Fire-Hany-Mukhtar-s-hat-trick.html",
    "content": [
        "Hany Mukhtar recorded his third career hat trick, highlighted by penalty kicks on either side of halftime, and Nashville SC won consecutive matches for the first time this season with Saturday night's 3-0 victory over the visiting Chicago Fire.",
        "Dominant the entire first half, then able to further clamp down defensively, Nashville (5-3-3, 18 points) recorded its sixth shutout of the MLS season.Mukhtar, the reigning league MVP who had just three goals entering this match, scored from the spot during first-half extra time, and again in the 70th minute.Then he added some insurance on a rebound from a save by Chicago's 19-year-old goalkeeper Chris Brady in the 91st minute. Mukhtar's first hat trick came during Nashville's 5-1 home victory over the Fire on July 17, 2021.Meanwhile, Chicago (2-3-5, 11 points) was outshot 30-5 overall and 11-3 on target, and on the wrong end of a 10-2 corner differential, while slipping to 0-2-2 in its last four league contests. The Fire didn't record their first shot of any kind until the beginning of the second half.Nashville was active from the opening whistle and recorded the game's first 14 overall shots. Chicago, meanwhile, suffered a blow when central defender and captain Rafael Czichos went off with an injury in the 22nd minute.Nashville was eventually awarded after ex-Fire midfielder Dax McCarty was sent to the ground in the box by the Fire's Federico Navarro in early first-half stoppage time. Soon after, Mukhtar made Nashville's first penalty attempt of 2023.",
        "The Fire were more spirited in the second half and recorded their first shot through Xherdan Shaqiri -- which was saved by Nashville goalkeeper Joe Willis in the 46th. In the 57th minute, Brian Gutierrez's breakaway left-footer was snagged by Willis.Brady made some key second-half saves, but Mukhtar came through after a surging Jacob Shaffelburg was fouled in the box by Chicago's Kendall Burks on 67 minutes.Nashville played minus star defender Walker Zimmerman, who was held out with a groin issue.--Field Level Media"
    ]
}