{
    "articleURL": "/sciencetech/article-12051773/Electric-car-mastermind-Elon-Musk-claims-threat-climate-change-overblown-short-term.html",
    "content": [
        "Tesla and Twitter owner inserted himself in climate debate on Twitter Friday Musk couched his comments by highlighting long term risks were 'significant'READ MORE:  Elon Musk says 'socially conscious' ESG rules have been 'twisted to insanity'The world's on-again, off-again richest man Elon Musk casually dropped a contrarian opinion about climate change today.",
        "'Global warming risk is overblown in the short term,' Musk tweeted, 'but significant in the long term'.The entrepreneur's fortune skyrocketed on the back of ecologically conscious ventures: from the electric vehicles and energy storage systems manufactured by Telsa Motors, where Musk is CEO, to the solar energy installers SolarCity, which Tesla later acquired.But over the past year, Musk's forward-thinking work building a sustainable energy future has taken a backseat to his new public persona as the new owner of Twitter.",
        "Musk isn't the only high-profile celebrity to dismiss climate change this year. Former President Donald Trump has repeatedly mocked eco-zealots and said nuclear war is the much bigger threat.'When I listened to people talking about global warming that the ocean will rise in the next 300 years by one-eighth of an inch and they talk about this as our problem, our big problem is nuclear warming which nobody even talks about it,' Trump told former Fox host Tucker Carlson late last month. The scientific community is in agreement that climate change has occurred over the past century and that human activity has 'unequivocally' caused global warming up to 1.1°C.But what is still debated politically is the most likely impacts that warming will have, and when.A former senior official with Greenpeace Canada, Patrick Moore, has testified before the Senate and in the media that 'the impact of climate change is wildly overblown' sharing Musk's view, in stark contrast to many prominent scientists.",
        "This past March, the world's leading climate scientists released dire 'final warnings' alongside the final portions of the sixth assessment report for the Intergovernmental Panel on Climate Change (IPCC).Scientists on the panel also warned that the rising temperatures will increase the scarcity of both food and water resources for approximately 3.3–3.6 billion people currently living in highly vulnerable regions.",
        "A 19th-century painting that appeared to depict a woman using an iPhone hundreds of years before it was invented ignited the imaginations of social media users who said she may have been a time traveler — but there are several similar examples.",
        "Their data showed that, between 2010 and 2020, human deaths from extreme weather triggered by climates, floods, droughts and storms grew 15-times higher than past averages in these same highly vulnerable regions.In fact, in contrast to Musk, revised assessments by the UK's Meteorological Office determined in 2019, nearly all climate models have actually underestimated the rate of near-term global warming.Because three-fifths of the world's surface is covered by oceans, this seemingly small change in temperature has dramatic implications.As the UK Met Office found, revising their Hadley Center historical analysis of sea surface temperatures (SST), the hidden, underwater melting of ice sheets and glaciers worldwide is occurring hundred times faster than climate models had predicted in 2019.",
        "Musk's climate change comments on Twitter appear to be part of a trend in which the billionaire has begun to weigh-in on controversial issues, criticizing transgender medical procedures and encouraging Americans to vote for Republicans.Musk tweeted his new climate opinion in reply to a comment made by conservative media activist and influencer Mike Cernovich, who had recently called Global warming ‘the largest scam in human history.’Both Musk and Cernovich made their recent climate comments in relation to Senate testimony on the taxpayer expense requested to transition the US to a carbon-neutral economy.These plans, as detailed by the Biden White House, ironically include significant subsidies for Musk’s own Tesla Motors to help the company expand their network of electric vehicle charging stations by 3,500 units nationwide."
    ]
}