{
    "articleURL": "/health/article-12054883/EVE-SIMMONS-diet-gurus-wrong-packaged-foods.html",
    "content": [
        "Are baked beans healthy? It was the question that set Twitter alight last week. According to food policy expert and author Rob Percival, the much-loved British staple brainwashes children into developing a taste for sweet foods from a young age, making them grow up into junk food fiends. And he didn’t stop there.",
        "In a detailed Twitter thread – which attracted 150,000 views – he suggested the same was true for baby foods and children’s snacks.Nutrition expert Professor Tim Spector soon got involved, highlighting the risks of a host of supermarket favourites – bread, cakes and even flour.Why are these foods supposedly so bad for our bodies?Because they are ultra-processed, the experts say.It means they are made in a factory with lots of ingredients listed on the back of the packet, often containing chemicals to extend shelf life.Ultra-processed food (UPF) has, over the past few years, become the big bad wolf of the diet world, linked to everything from cancer to bipolar disorder.",
        "This was highlighted last month in The Mail on Sunday’s serialisation of Dr Chris van Tulleken’s new book on UPFs.I’ve slowly been growing tired of this trend. But this latest Twitter debacle made me really mad.The warnings sparked a flurry of questions from puzzled, anxious Twitter user. What about expensive tinned beans? Are they any better, or should you rinse off the sauce? Are cakes OK if you make them at home without adding chemicals? And what about tinned potatoes?It was a perfect illustration of why telling us to steer clear of processed food can risk creating more confusion.",
        "The truth is that just because a food comes in a packet it doesn’t mean it is bad for you. In fact, many of the products that fresh food evangelists turn their nose up at – jars of pasta sauce, packaged bread and some ready-meals – are, dare I say it, healthy.This was the conclusion of the British Nutrition Foundation last week, according to a statement, which Rob Percival was responding to in his tweets. The charity was attacked for its claims that frozen fish fingers and baked beans are healthy, with critics accusing it of bias due to the funding it receives from big food brands.Hitting back, Bridget Benelam, spokesman for the British Nutrition Foundation, says: ‘Food manufacturers pay us to advise them on nutritional policies to make their food healthier. We think this is important work and we’re always transparent about it.’So let’s look at the research on these vilified UPFs.The most commonly used definition of the term comes from a seminal paper published in 2016 by a group of Brazilian scientists. Their research was based on studies that tracked the diets and health outcomes of hundreds of thousands of people living in the US and Western Europe, including the UK.",
        "People who ate a lot of food that had gone through several industrial processes were found to have a higher risk of obesity. The scientists categorised foods into four groups according to the level of processing, which they called the Nova classification.",
        "Fresh meat and fish and dried nuts are in the unprocessed, healthy group. Condiments, such as vinegar and salted butter, are in the ‘minimally processed’ group two. Group three – tinned fruit, smoked meat and unpackaged, fresh supermarket bread – should be limited. Group four is ultra-processed – the worst type, containing five or more ingredients, and should be avoided. This consists of mass-produced packaged bread, pasta sauces, cereal and fruit yogurts.But healthy eating just doesn’t work like that.‘The Nova system doesn’t take into account the nutrients in food,’ says Steve Blackburn, an NHS dietician working in a London hospital. ‘There are plenty of foods that are perfectly nutritious, as well as easy to prepare, but have been “processed”. Cereal, for example.‘Low-sugar, wholegrain cereals such as Weetabix are a great source of fibre, which protects against bowel cancer. We don’t get enough of it. Most are fortified with extra vitamins and minerals, and if you add milk you get a bit of protein and calcium which is great for bone health and energy.’Professor Tom Sanders, Emeritus Professor of nutrition and dietetics at King’s College London, adds: ‘Breakfast cereals provide 30 to 40 per cent of the nutrients that children need.’There are plenty of other examples. Take ultra-processed pasta sauce. One serving of a jar of Waitrose’s Essential Bolognese Sauce contains a meagre 29 calories, a teaspoon of sugar and barely a trace of salt and fat. The sugar content comes from the tomatoes and tomato puree – so no different from what you might make at home. The only unusual ingredient is lactic acid, which helps the sauce stay fresher for longer.",
        "What about packaged, supermarket bread?Sainsbury’s Multiseed Farmhouse Wholemeal Bread has nearly half the calories and a gram less sugar than a luxury, freshly baked multiseed loaf by artisan bakery chain Gail’s. There is also more fibre in the packaged version.Ready-meals these days aren’t that bad either, thanks to Government incentives to reduce sugar, salt and fat.The ingredients in Sainsbury’s Tomato and Mozzarella Pasta Bake are little different from what you might use at home. It also contains 185 fewer calories, about a teaspoon less salt and two-thirds less fat than a plate of fresh tomato and mozzarella pasta from the Italian restaurant chain Vapiano.‘If you buy a cheap Victoria sponge cake, it’s probably less fattening than one you’ll make at home,’ says Prof Sanders.But what about all the nasty chemicals, you might ask. Don’t they hijack our appetites and ruin our insides?As demonstrated above, not all processed food contains a never-ending list of alien ingredients. And not all additives deserve a bad reputation.‘Most are there to stop us getting food poisoning,’ says Prof Sanders. ‘Extra vitamins and minerals count as additives. And this is part of the reason why we’ve virtually eradicated nutrient deficiencies in many parts of the world.’",
        "There is research that shows some additives – particularly emulsifiers and artificial sweeteners – can destroy the healthy bacteria in our gut, which are said to be key to keeping a healthy weight, among other benefits. But many of the studies are conducted on rodents, and it is not yet proven that it is definitely the ultra-processed food that changes gut bacteria, rather than something else.",
        "And as for claims that sweet foods are priming young brains to seek out junk food in later life, the experts disagree. ‘Children’s brains are naturally programmed to seek out fatty, sweet food that’s high in energy – it’s a survival tactic,’ explains Prof Sanders.The anti-processed food brigade often point to brain-imaging studies to prove that this stuff is ‘addictive’. Experiments found that when participants look at pictures of junk food, the reward centres in their brain ‘light up’.‘We’ve learned, over time, that it tastes nice,’ says Prof Sanders. ‘That’s not the same as an addiction. That’s like saying we’re addicted to anything we take pleasure in.’Mr Blackburn adds: ‘The patients I treat are unhealthily thin and don’t have much of an appetite. They mostly eat ready-meals that are high in sugar and calories, because they’re easy to eat if you have mouth sores and help with weight gain. If they were addictive, patients wouldn’t stop eating it – but we have the opposite problem.’Britons do consume too much junk food, such as cakes, biscuits, crisps and fast food. About a fifth of people say they eat it at least once or twice a week. But it’s not unhealthy because it’s been made in a factory. It just so happens that a lot of these products are high in fat, sugar, salt and, importantly, calories. It doesn’t take a rocket scientist to work out that people who eat lots of calories are more likely to develop obesity and its related health conditions.",
        "‘It’s easier to eat a lot because these foods taste nice – especially if they are snacks such as crisps and chocolate and eaten mindlessly in front of the television,’ says Prof Sanders.Studies also show that people who eat lots of this type of food are more likely to do other unhealthy things, such as avoid exercise, smoke, drink and work varied shifts.So how do we know if the way the food is made is behind the health problems, or it’s something else?It’s also worth saying that most ultra-processed food is eaten by people on low incomes.And what’s the point in making them feel guilty or embarrassed for selecting food they can afford? It’s not just about money – not everyone has spare time to throw together a homemade pasta sauce after a long day at work. So what should we eat?‘No food should be avoided unless you have an allergy,’ says Mr Blackburn. ‘Don’t eat foods that are high in fat, sugar, salt and calories often, and eat plenty of fruit and veg.’Now, where have I heard that advice before?"
    ]
}