{
    "articleURL": "/wires/ap/article-12040427/AP-News-Brief-12-04-m-EDT.html",
    "content": [
        "Since his ouster, embarrassing reports on Carlson pile up",
        "NEW YORK (AP) - A week after Fox News fired star host Tucker Carlson - for reasons that remain unexplained - he has been the subject of a handful of embarrassing stories about some of his private messages and statements while at the network.The latest was in The New York Times on Wednesday, reporting on a text message that had been redacted as part of a recent defamation case targeting the network. In it, Carlson declared that a group of Trump supporters beating a protester was \"not how white men fight.\"The sentiment was not out of character for Carlson, who has promoted the view that whites are being \"replaced\" by people of color. But the Times suggested the timing was crucial, as members of Fox's board found out about the message as part of documents uncovered in the defamation lawsuit filed by Dominion Voting Systems, shortly before a trial was to begin last month.The newspaper said the discovery \"contributed to a chain of events\" that led to Carlson being fired April 24, less than a week after Fox agreed to pay Dominion nearly $800 million to settle the case.Three times in the past week, the anti-Fox watchdog Media Matters for America has released \"hot mic\" moments of Carlson speaking while on Fox sets, material that was never included on broadcasts.",
        "___Police capture suspect in Atlanta medical facility shootingATLANTA (AP) - Police say they have apprehended a man who allegedly opened fire inside the waiting room of an Atlanta medical facility, killing one woman and injuring four others Wednesday.Authorities had swarmed the city´s bustling midtown neighborhood earlier in the day in search of the suspect, who fled after the shooting. Police said in a statement that the gunman, who they identified as 24-year-old Deion Patterson, was captured Wednesday evening. Authorities did not immediately release additional information about where Patterson was found.Authorities said Patterson stole a vehicle and drove away after shooting five women on the 11th floor of a Northside medical building shortly after noon. The facility is in a commercial area filled with office towers and high-rise apartments and news of the shooting prompted workers and lunchgoers to shelter in place for hours.Atlanta Police Chief Darin Schierbaum said a 39-year-old woman was pronounced dead at the scene of the shooting. The four injured victims were also women, aged 25, 39, 56 and 71.Hours after the shooting, Atlanta Mayor Andre Dickens told reporters the surviving victims \"are fighting for their lives at Grady Hospital.\"___Sex offender fatally shot 6, then killed self, official saysAn Oklahoma sex offender who was released from prison early shot his wife, her three children and their two friends in the head and then killed himself, authorities confirmed Wednesday as concerns grew about why he was free as his trial on new sex charges loomed.",
        "Okmulgee Police Chief Joe Prentice said that the victims had each been shot in the head one to three times with a 9 mm pistol when they were found Monday near a creek and in a heavily wooded area in rural Oklahoma.The bodies apparently had been moved there from where they were originally killed, the scene \"staged\" before Jesse McFadden, a 39-year-old convicted sex offender, killed himself, Prentice said in the first major update on the case.The discovery of the bodies near McFadden's home in Henryetta, a town of about 6,000 about 90 miles (145 kilometers) east of Oklahoma City, came on the very day that he was to stand trial on charges that he solicited nude images from another teen while he was imprisoned for rape.Authorities have declined to release a motive for the shootings, but McFadden had vowed not to return to prison in a series of ominous messages with his young victim.___Prosecutor: Suspected Texas gunman tried to escape to MexicoCLEVELAND, Texas (AP) - A man suspected of killing five of his neighbors in Texas after they asked him to stop shooting his gun near their house hid out just miles away from the slayings while he and his domestic partner plotted his escape to Mexico, authorities said Wednesday.",
        "Francisco Oropeza showered and slept at the house outside the city of Conroe while Divimara Lamar Nava got him donuts from a nearby store, a prosecutor said. Lamar Nava also acknowledged delivering a message from Oropeza to his cousins in the area asking for their help getting him out of the country, the prosecutor said at Lamar Nava´s probable cause hearing. The cousins refused to help.Authorities believe Lamar Nava was talking to investigators at the same time she was trying to help Oropeza, San Jacinto County District Attorney Todd Dillon said at a news conference.Oropeza, 38, was arrested late Tuesday at the house, just 20 miles (32 kilometers) from the city of Cleveland, where the shootings took place. Acting on a tip, authorities found him hiding under a pile of laundry in a closet after a four-day manhunt. Lamar Nava was arrested at the house on Wednesday. She is being held at the Montgomery County jail on a felony charge of hindering the apprehension or prosecution of a known felon. Her bail has been set at $250,000.Authorities identified Lamar Nava as Oropeza's wife, though jail records list her as not being married but sharing a home address with him.___Trump calls rape claim 'ridiculous' in video deposition",
        "NEW YORK (AP) - Donald Trump called a writer´s claims that he raped her at a Manhattan department store \"the most ridiculous, disgusting story,\" testifying in a deposition shown in court Wednesday that the allegations were \"made up\" and that the assault never happened.Lawyers for accuser E. Jean Carroll played about 30 minutes of excerpts from the former president´s deposition, including his emphatic denial of the longtime advice columnist´s accusation that he attacked her in the mid-1990s in a Bergdorf Goodman dressing room.\"If it did happen, it would have been reported within minutes,\" Trump said, contending that shoppers and employees at the \"very busy store\" would´ve heard a commotion and alerted authorities.\"It´s the most ridiculous, disgusting story. It´s just made up,\" Trump said in the video deposition taken in October.Several jurors leaned forward, watching without expression as the video played on individual monitors in front of their seats.___Chokehold killed man restrained by NYC subway passengersNEW YORK (AP) - A man who had been shouting at people aboard a New York City subway train died after fellow riders tackled him and one put him in a chokehold that lasted until his body went limp, according to police officials and video of the encounter.Jordan Neely, 30, died from compression of the neck, the city´s medical examiner determined Wednesday.",
        "Neely is recognizable to some New Yorkers as a Michael Jackson impersonator who regularly danced in the Times Square transit hub. On Monday afternoon, he was yelling and pacing back and forth on an F train in Manhattan, witnesses and police said, when he was restrained by at least three people, including a U.S. Marine veteran who pulled one arm tightly around his neck.Video of the altercation posted online by a freelance journalist showed the man lying beneath Neely, holding him in a headlock position for several minutes as Neely tried and failed to break free. A second passenger pinned Neely's arms while a third person held down his shoulder.It was unclear why the group had moved to restrain him.___Hate passwords? You're in luck - Google is sidelining themSAN FRANCISCO (AP) - Good news for all the password-haters out there: Google has taken a big step toward making them an afterthought by adding \"passkeys\" as a more straightforward and secure way to log into its services.Here's what you need to know:WHAT ARE PASSKEYS?Passkeys offer a safer alternative to passwords and texted confirmation codes. Users won´t ever see them directly; instead, an online service like Gmail will use them to communicate directly with a trusted device such as your phone or computer to log you in.All you'll have to do is verify your identity on the device using a PIN unlock code, biometrics such as your fingerprint or a face scan or a more sophisticated physical security dongle.___Florida Republicans pass school bills on pronouns, diversityTALLAHASSEE, Fla. (AP) - Florida Republicans on Wednesday approved bills to ban diversity programs in colleges and prevent students and teachers from being required to use pronouns that don't correspond to someone's sex, building on top priorities of Republican Gov. Ron DeSantis.The two proposals were given final passage by the Republican supermajorities in the House and Senate. DeSantis is expected to sign the bills into law.DeSantis, who is expected to announce a presidential campaign in the coming weeks, has driven a hardline conservative agenda as he seeks to bolster support of Republican primary voters ahead of his White House run.The state's Legislative session, scheduled to end this week, has been dominated by divisive cultural issues, with Republican allies of DeSantis approving his priority bills on sexual orientation, gender identity, race and education that are expected to aid the governor in his presidential bid.The Senate on Wednesday voted to expand the law critics call \" Don't Say Gay,\" a major calling card of DeSantis, with a sweeping bill that prevents school staffers or students from being required to refer to people by pronouns that don´t correspond to the person´s sex.___McDonald´s franchises fined for child labor violationsLOUISVILLE, Ky. (AP) - Two 10-year-olds are among 300 children who worked at McDonald's restaurants illegally, a Labor Department investigation of franchisees in Kentucky found.Agency investigators found the 10-year-olds received little or no pay at a McDonald's in Louisville, the Labor Department said. The franchisee for the Louisville store was among three McDonald´s franchisees fined $212,000 in total by the department.Louisville's Bauer Food LLC, which operates 10 McDonald´s locations, employed 24 minors under the age of 16 to work more hours than legally permitted, the agency said. Among those were two 10-year-old children. The agency said the children sometimes worked as late as 2 a.m., but were not paid.\"Below the minimum age for employment, they prepared and distributed food orders, cleaned the store, worked at the drive-thru window and operated a register,\" the Labor Department said Tuesday, adding that one child also was allowed to operate a deep fryer, which is prohibited task for workers under 16.Franchise owner-operator Sean Bauer said the two 10-year-olds cited in the Labor Department's statement were visiting their parent, a night manager, and weren't employees.___Galactic gobble: Star swallows planet in one big gulpCAPE CANAVERAL, Fla. (AP) - For the first time, scientists have caught a star in the act of swallowing a planet - not just a nibble or bite, but one big gulp.Astronomers on Wednesday reported their observations of what appeared to be a gas giant around the size of Jupiter or bigger being eaten by its star. The sun-like star had been puffing up with old age for eons and finally got so big that it engulfed the close-orbiting planet.It´s a gloomy preview of what will happen to Earth when our sun morphs into a red giant and gobbles the four inner planets.\"If it´s any consolation, this will happen in about 5 billion years,\" said co-author Morgan MacLeod of the Harvard-Smithsonian Center for Astrophysics.This galactic feast happened between 10,000 and 15,000 years ago near the Aquila constellation when the star was around 10 billion years old. As the planet went down the stellar hatch, there was a swift hot outburst of light, followed by a long-lasting stream of dust shining brightly in cold infrared energy, the researchers said."
    ]
}