{
    "articleURL": "/femail/article-12038315/The-end-influencers-Met-Gala-Anna-Wintour-cuts-online-stars-guest-list.html",
    "content": [
        "An explosion of internet celebrities have graced the red carpet in past yearsPreviously, Liza Koshy, Addison Rae, and Dixie D'Amelio have been invitedThis year more influencers were absent, but Emma Chamberlain attendedThe who's who of A-listers and fashion industry darlings walked the red carpet at this year's Met Gala hosted by Vogue's long-reigning editor Anna Wintour.",
        "And famously she keeps a tight leash on who makes it onto the ultra-exclusive guest list, but in the past couple of years she's been criticized for loosening up too much.Ahead of 2021's annual event, one celebrity agent told Page Six those who were on and off the list for that year's gala had put traditional celebrities off going as many influencers had been included.But after a few years of influencers making up the guest list on the red carpet - including Chiara Ferragni, Liza Koshy, Lilly Singh, James Charles, Addison Rae, NikkieTutorials, Dixie D'Amelio and Avani Gregg - it seems Anna and the committee have cut back on how many internet stars are in attendance.",
        "The most notable influencer at this year's Met Gala was YouTuber and It Girl Emma Chamberlain who reprised her role as a red carpet interviewer for Vogue.Of her first Met Gala experience, Emma compared it to going to prom, a life event she hadn't ticked off the list herself after her YouTube career took off when she was 16.'Actually this kind of feels like going to prom, because of the nerves,' she told Vogue at the time.'You're not that scared, but you're excited. This is my prom experience.'With a smaller numbers of influencers attending the Met Gala, TikTok hosted a watch party for creators.",
        "One creator who was in attendance at New York rooftop bar Dear Irving, where the watch party was held, was Jenee, who is better known as @highlowluxxe on the video-sharing platform.She uploaded a get-ready-with-me video on her TikTok as well as footage from inside the party, with its location boasting stellar views of Manhattan.Jenee also appeared alongside influencers Carla Rockmore, Caroline Vazzana, Pierrah and Eric Sedeno in an InStyle TikTok video at the event.Another creator Hannah Harrell also attended a TikTok watch party and posted about her process of choosing an outfit on her account.",
        "In 2021, when the Met Gala was held in September due to COVID (it's traditionally held on the first Monday in May), NikkieTutorials gushed about being invited to the the gala.'PAY IT NO MIND... when I got asked to join the Met Gala(!!!!!) I knew I wanted to pay homage to a trans icon who was at the forefront of the Stonewall Riots… Marsha P. Johnson paved the way for so many of us, and I hope I made my community proud tonight,' the trans influencer said.'This night has been so incredibly surreal…. I can't wait to tell you EVERYTHING!!!!!!... WE DID IT GUYS!!!!!!!!... I'll forever be so grateful!'That same year, Addison Rae made her Met Gala debut and was there again in 2022.",
        "'I wrote about this in my dream journal. I am so grateful. Thank you,' she wrote simply after walking the red carpet for the first time.James strut the red carpet in 2019, writing at the time: 'My first met gala... thank you so much @youtube for inviting me and @alexanderwangny for dressing me! 'Being invited to such an important event like the ball is such an honor and a step forward in the right direction for influencer representation in the media and I am so excited to be a catalyst.'",
        "One of the first influencers to be invited was Liza Koshy who also acted as Vogue's red carpet interviewer for the event in previous years, starting with her 2018 debut.'Thank you to @voguemagazine and @annawintour for dressing these little brown buns (or not),' she wrote at the time.'It was an honor, a blessing and a sweaty dream to be Vogue's interviewer at the Met Gala's Red Carpet. Rihanna, J-Lo, Ariana... y'all looked good, but standing next to me, you looked even better. you're welcome.'And it seems the industry's elite have been taking note of the flood of internet stars, with one celebrity agent telling Page Six back in 2019: 'I've been told that a lot of influencers are on the guest list.",
        "'I've heard that Facebook and Instagram have taken so many tables, and that's put a lot of people off going, alongside the mask mandate.'Personally, I don't think the Met is cool anymore… It's gone from super prestigious to [being] full of influencers.'Anna has faced scrutiny over the years for inviting Kim Kardashian, who is arguably the original influencer, and her family, including sisters Kendall and Kylie Jenner.She's also had to defend putting Kim and her then-husband, Kanye West, on the cover of the fashion tome in 2014.'Part of the pleasure of editing Vogue, one that lies in a long tradition of this magazine, is being able to feature those who define the culture at any given moment, who stir things up, whose presence in the world shapes the way it looks and influences the way we see it,' Anna wrote in the issue.'I think we can all agree on the fact that that role is currently being played by Kim and Kanye to a T. (Or perhaps that should be to a K?)'"
    ]
}