{
    "articleURL": "/tvshowbiz/article-12042647/Ed-Sheeran-predicts-career-end.html",
    "content": [
        "Ed Sheeran and his wife Cherry Seaborn have shared their fears for the end of his career as the singer admitted he doesn't know whether he'll be able to cope.",
        "However the pop star, 32, insisted that he knows a career 'plateau' would be in the best interests of his young children Lyra, two, and Jupiter, 12 months.The song writer admitted he believes the 'plateau' will take place in the next few years when his kids begin school. Speaking on his Disney+ documentary, The Sum Of It All, Ed admitted: 'I feel like my life has to eventually plateau just to be kind to my children. I want them to be.Revealing her fears for her career-focused husband, Cherry replied: 'I worry about you though, I don't think you're programmed that way.'",
        "Predicting when it will take place, Ed admitted: 'I've been coming to terms with it a lot and career plateau at certain points. I think my the time Lyra and Jups are in school. The world will have said \"we're good\".Cherry then asked him: 'How do you think you will cope with that?He candidly responded: 'Not well. I don't think anyone copes well. You get into the music industry to make people want to like your music and the moment they say, \"well actually we prefer this, I think it's quite a difficult thing.\" I really care.'Elsewhere in the episode, Ed broke down in tears as his wife Cherry admitted she feared she would die when she was diagnosed with cancer. ",
        "Doctors discovered Cherry, 30, had a tumour in her arm in February last year while she was six months pregnant with their second child, daughter Jupiter.The couple recalled their 'horrible' start to 2022 which saw Cherry battle cancer, Ed's best friend Jamal Edwards die suddenly and a court case launched over his song Shape Of You, where Ed was accused of plagiarising and which he later won. 'I got diagnosed with cancer at the start of the year, which was a massive s*****r,' Cherry said of why she said yes to letting the cameras into their notoriously private life.'But it made me massively reflect on our mortality. We're all human. I was saying to Ed I would have never agreed to do anything like this but it made me think, this whole year \"If I die, what's people's perception of me? What do you leave behind?\". ",
        "'For Ed he wants to say \"I'm not just this music machine, a robot trying to get number ones. I'm a father. I'm a son, husband, friend\". And I've massively reflected. It wasn't until this year where I thought \"I might die\". It was horrible.'When Cherry first sought medical help, she was initially told by a doctor 'this is really bad' and that she had cancer.",
        "The mother-of-two immediately rang Ed telling him to cancel all of his plans, while they waited an agonizing month long wait for the full report. But Cherry, who was six months pregnant at the time, was told there were no treatment plans that would work with her pregnancy. After a sequencing test was done on the tumour, the couple found it was much less severe than what was thought originally and surgery could be done after she had given birth to Jupiter. Cherry said: 'It was the most incredible news. I nearly threw up when the surgeon told us we could wait to the end of the pregnancy to get the tumour out. 'We didn't have to worry about delivering the baby early.' But the couple faced the most devastating blow, when a day later, Ed's best friend Jamal died suddenly aged 31. The music mogul died from a cardiac arrest after a late night cocaine and drinking session. ",
        "The pair became close after Jamal's YouTube channel SBTV helped to propel Ed into the spotlight, and the entrepreneur gave the aspiring musician a place to sleep when he was 18 and had no place to live in London. 'I was hit by heavy stuff one after the other. They found a tumour in Cherry's arm. The diagnosis wasn't good,' Ed said. ",
        "'She was pregnant and they can't do anything. Then suddenly I'm in this three week court case. Then Jamal dies. 'The moment you find out that the worst thing in the world has happened to someone you truly love with all your heart, you feel like you're drowning and can't get out from under it. 'I remember being sat in this specialists waiting room thinking the worst was going to happen. I'm worried about Cherry. ",
        "Ed Sheeran broke down in tears while reflecting on his close pal Jamal Edwards' tragic death in his new Disney+ documentary series.",
        "'The unborn daughter, that's in her. You start writing a song and you vent a little bit and that's why songs get written.' Ed and Cherry went on to welcome Jupiter and announced her arrival in May with a sweet Instagram post. The couple are also proud parents to Lyra, two. Later in the documentary, Cherry gave an update on her health after going for a check-up appointment months after the initial surgery - and was thrilled when she was told the tumour hadn't come back. She said: 'Yesterday I had follow up scan in my arm to see if the tumour had come back. We were silent in the car as we were worried it would be bad. ",
        "'It was super triggering being in the same room when things weren't so positive at the start of the year. The surgeon looked at the scans and it all looks good. The Lymph nodes have all calmed down. That was amazing. it was massive for us.'Fans were in tears watching the documentary, which hit the streaming platform on Wednesday.One wrote: ' just have seen the @edsheeran @DisneyPlus documentary, and wooow it was amazing. loved every f*****g second of it.' Another added: 'That documentary for Ed Sheeran... all I can say is have tissue ready.'A third viewer chimed: 'just watching your documentary on Disney+ mad me laugh had me in tears. Thankyou for sharing.'Earlier this month, Ed revealed the opening track to his forthcoming album encapsulates his feelings towards depression as he sings, 'The more that I love, the less that I feel.'Ed, whose album Subtract is released on May 5, has dedicated Boat, the first song on his sixth body of work, to the uphill struggle he's faced in recent years against grief, illness, and addiction.Accompanying the new track, which was written by the English seaside, Ed premiered a video in which he is lashed by waves on a shore.The father of two, who has documented his overwhelming feelings of depression in his upcoming series, sings 'but the waves won't break my boat', symbolic of his hope and determination as he recovers from a series of hard-hitting events.",
        "In artwork captured by Annie Leibovitz, Ed can be seen running free from the crashing waves."
    ]
}