{
    "articleURL": "/wires/ap/article-12038789/Debt-deadline-White-House-meeting-set-no-solution-yet.html",
    "content": [
        "WASHINGTON (AP) - All the hand-wringing in Washington over raising the debt limit can seem far removed from the lives of everyday Americans, but they could end up facing huge consequences.",
        "Millions of people in the U.S. rely on benefits that could go unpaid and services that could be disrupted, or halted altogether, if the government can't pay its bills for an extended period.If the economy tanked due to default, more than 8 million people could lose their jobs, government officials estimate. Millions of Social Security beneficiaries, veterans and military families could lose their monthly payments. Vital federal services including border and air traffic control could be disrupted if workers can't get their government paychecks.The economy could nosedive into a recession.President Joe Biden and the top congressional leaders from both parties met at the White House on Tuesday to try to resolve it all, their second such meeting in as many weeks.WHAT'S THE PROBLEM?If the government's legal borrowing limit of $31.4 trillion is not raised or suspended by June 1, the result could be financial havoc. The inability to borrow money to keep paying government obligations could mean businesses sent into bankruptcy, crashes piling up across financial markets and lasting economic pain. The damage would be financial, but the cause would be political, a breakdown between Republicans and Democrats, rather than a problem with a basically healthy U.S. economy.WHAT'S HOLDING UP AN AGREEMENT?Philosophical differences with financial consequences.",
        "Republicans want spending cuts in exchange for raising the debt ceiling, saying the current pace of spending is unsustainable. Biden and congressional Democrats want the debt limit raised without conditions, arguing that the two issues should not be linked.Biden had said he would not negotiate over the debt limit, but that he would have a separate conversation with McCarthy about the federal budget.WHAT'S HAPPENING WITH THE BUDGET?First the budget is not the debt. The budget is the money the government takes in and spends each year. If it spends more than it brings in - a budget deficit - that adds to the debt that has been building basically forever.Biden dared McCarthy to produce a budget plan, and House Republicans responded by narrowly approving a bill to reduce deficits by $4.8 trillion over 10 years. It would do so by cutting discretionary spending to 2022 levels and placing an annual 1% cap on future increases. The bill would also reclaim billions of unspent COVID-19 funding, eliminate clean energy tax credits Biden signed into law last year and reverse his student debt forgiveness and repayment plan.It's unclear how Democrats can get the debt ceiling increased without support from House Republicans. But Democrats say the GOP bill's unspecified budget cuts would harm individuals - and the economy - as domestic spending would likely be cut. Moody's Analytics estimates the Republican bill would cause the loss of 780,000 jobs next year alone.",
        "ARE THERE ANY POSSIBLE AVENUES OF AGREEMENT?Besides repurposing unspent COVID-19 funding, the White House and House Republicans could agree to tighten certain work requirements for federal aid programs that benefit the needy. The GOP-controlled House passed legislation that imposes more stringent conditions for people receiving food stamps, or SNAP benefits, as well as adults without dependents on Medicaid and recipients of Temporary Assistance for Needy Families, which offers aid to low-income families with children.Biden over the weekend appeared to rule out changes to Medicaid. The White House said he would reject proposals that take away people's health coverage or push them into poverty.WHO WOULD SUFFER THE MOST FROM A DEFAULT?Basically everyone, because the jolt to the U.S. and global financial systems would be so \"catastrophic,\" Treasury Secretary Janet Yellen said Tuesday in a speech to community bankers.But working people, those living paycheck to paycheck and people who rely on government benefits and services would face the biggest blows through job losses and the loss of income.Yellen, in her speech, urged Congress to act quickly. \"The U.S. economy hangs in the balance. The livelihoods of millions of Americans do, too,\" she said.HOW DOES IT END?No one really knows, though McConnell, a longtime Senate Republican leader, said this after last week's White House meeting: \"The United States is not going to default. It never has and it never will.\"",
        "___AP Congressional Correspondent Lisa Mascaro and Associated Press writers Josh Boak, Seung Min Kim and Mary Clare Jalonick contributed to this report."
    ]
}