{
    "articleURL": "/travel/article-12050001/Pictured-incredible-55-000-JetCar-cross-jet-ski-Corvette.html",
    "content": [
        "Miami-based company JetCarUSA sells and rents models of the vessel The rental company says: 'JetCar isn't a jet ski. JetCar sits in a class of its own!’READ MORE: The 10 most annoying things that people do on holiday revealedCross a jet ski with a car and this is the result.",
        "Incredible 'JetCar' watercraft that resemble Corvette sports cars are available to rent from Miami-based JetCarUSA, which claims they can hit 56 knots (65mph).With their glossy paintwork and open-topped roofs, these two-seater vessels look like something from a James Bond film.They cost $350 (£277) per hour to rent, or around $55,500 (£44,000) to buy.The 'JetCar' features an onboard music system with Bluetooth function and ‘premium speakers’ so you can ‘enjoy your favourite songs while cruising through the waters in style’.",
        "The fibreglass hull of the car-shaped vessel comes in a range of colours, from sky blue to orange and bright pink.Buyers can choose to add a range of mod-cons to the vessel, such as interior LED lighting, cup holders and a GPS tracking system. They can also take their pick from several engine types, from a 180-horsepower Yamaha engine to a 300-horsepower Sea-Doo engine. The manufacturers say: ‘JetCar isn't just a boat, JetCar isn't a jet ski. JetCar sits in a class of its own!’",
        "Life vests and a fire extinguisher are stored on board, and the vessel can be monitored by 'chase boats' to ensure that passengers have a 'safe, fulfilling time' behind the wheel, JetCarUSA says. A recent model, a 15ft- (4.5m) long vessel based on a Corvette C8 sports car, went up for auction earlier this year on the site Boats &amp; Buyers, but it wasn’t sold.",
        "The auction site’s listing says: ‘Unlike a jet ski, the JetCar is much more stable and easy to balance, even in rough waters. The responsive steering system makes it easy to control and manoeuvre, allowing you to navigate through tight turns and make quick stops with ease.‘But don't let its ease of use fool you – the JetCar is also incredibly fast and powerful, allowing you to reach exhilarating speeds on the water.’ ",
        "YouTuber Brandon Jordan shared a video that shows him getting pulled over by the police while driving a JetCar on the water. The police can be seen quizzing him about what sort of watercraft the JetCar is, only for Brandon to reply: ‘Basically it's just a big old jet ski, just like a really weird shape.’After checking the paperwork Brandon held for the vessel, they moved on. ‘They were super nice, super respectful,’ he tells the camera in the clip.Reflecting on the company's business plan, JetCarUSA's owner Naquan Robinson told Lootpress: 'You won’t find anything else on the market right now quite like this.'Every corner of the United States matters to us. The public loves them, the market has spoken. It’s just a matter of getting them out there.'"
    ]
}