{
    "articleURL": "/news/article-12051351/SAS-hero-fights-Ministry-Defence-gagging-order-bans-talking-it.html",
    "content": [
        "Chris Craighead stormed the building in Kenya and lead terrified guests to safetyThe senior soldier is now taking legal action against the GovernmentAn SAS hero who earned global acclaim after almost single-handedly rescuing hostages from jihadi terrorists in a hotel siege is fighting a Ministry of Defence gagging order.",
        "Though millions watched heavily-armed Chris Craighead storm the building in Kenya and lead terrified guests to safety, he has been banned from discussing it in a memoir or speaking tour.The senior soldier is now taking legal action against the Government. Publication of his account is now on hold pending the outcome of the case.Somali gunmen with the al-Shabaab terror group killed 21 people when they raided the DusitD2 complex in Nairobi in 2019. But the death toll would likely have been much higher had Craighead not intervened.The Mail can reveal he is challenging the lifelong silence clause in his employment contract, which he was made to sign on joining the SAS.",
        "Defence officials maintain letting him recall his experiences would compromise UK national security.Craighead’s judicial review application argues the suggestion is spurious, because the incident is already a matter of public record.His former SAS colleagues claim defence officials are dragging out the dispute in a bid to push up his costs.Close friends said he has even ‘seriously considered’ selling his Conspicuous Gallantry Cross (CGC) he earned to pay his legal bills.For his friends in the elite regiment, who have spoken to the Mail, the MoD has betrayed a national hero.They say their approach is merely the latest attempt by ‘envious’ top brass to gain revenge.",
        "Craighead was in Kenya with the SAS to train local forces and was relaxing off-duty when the siege happened. The soldier with the elite regiment - whose motto is Who Dares Wins - seized the initiative and headed to the scene dressed in jeans and a casual shirt.He pulled on a camouflage flak jacket and a balaclava and stormed the building armed only with an assault rifle, Glock pistol and combat knife, leading a counter-attack in which he almost single-handedly defeated jihadis.",
        "The soldier was seen in news footage escorting hostages from the hotel before sprinting back inside again.The 19-hour siege left 21 people dead, including British charity worker Luke Potter.However, senior officers and Foreign Office officials were apparently horrified to see him in action because he had not sought their approval.Even though every second counted while terrorists were going from room to room executing those inside, it is alleged that they were more worried about Craighead’s intervention causing embarrassment to the Kenyan government.An SAS soldier said: ‘Chris has had four years of this. His colleagues said fair play to him for what he did. But the hierarchy were aghast.‘They’d rather everyone sat on their hands than get stuck in. The rules on not discussing operations are there for good reason, but this incident is an exception.",
        "‘Everyone knows about it, everyone knows what he did. So, what’s the big deal? Truth is, there’s an agenda against him.’Craighead’s battle against British-establishment officialdom contrasts with the experiences of US special forces troops.US Navy Seals who fought in Iraq and Afghanistan have authored books which subsequently became Hollywood movies.While they have built lucrative second careers based on their exploits, Craighead’s friends say he is the only person who cannot benefit from what he did.The Kenya siege story is frequently discussed on podcasts and in YouTube videos.Craighead has a book deal with publisher Simon and Schuster, titled One Man In.As he was credited with saving the lives of US citizens, he subsequently met then-US president Donald Trump who thanked him for his courage.Last night an MOD spokesman said: ‘It would be inappropriate for the MoD to comment on ongoing litigation.’"
    ]
}