{
    "articleURL": "/wires/reuters/article-12052927/What-royal-family-King-Charles-coronation.html",
    "content": [
        "LONDON, May 6 (Reuters) - All eyes will be on the British royal family this weekend as they are joined by about 100 heads of state and global dignitaries for the coronation of King Charles.",
        "Below are details on the leading members of the royal family, their position in the line of succession and what they are expected to do during the ceremony.KING CHARLESKing Charles became monarch of the United Kingdom and 14 other realms on the death of his mother, Queen Elizabeth, in September.On Saturday he will take an oath to uphold the law and the Church of England, be anointed with holy Chrism oil consecrated in Jerusalem, and be presented with items from the Crown Jewels that symbolise among other things, the monarch's power.He will then be crowned by the Archbishop of Canterbury, before he returns to Buckingham Palace in the Gold State Coach as part of a mile-long procession.QUEEN CAMILLA AND HER CEREMONYCamilla, the second wife of Charles, will go through a simpler, mini-coronation as queen during the service.Camilla was for years dubbed by newspapers as the most hated woman in Britain after she was implicated in the break-up of Charles' first marriage to the glamorous Princess Diana.But Camilla was slowly integrated into a more public role and the couple married 18 years ago. The late Queen Elizabeth gave her blessing last year for Camilla to take the title Queen Consort, although polls suggest the public are still uneasy with her having the title.",
        "WILLIAM, KATE AND CHILDRENCharles' eldest son and heir-to-the-throne Prince William will take a leading role in the coronation, giving homage to his father by kneeling before him to pledge his loyalty as \"your liege man of life and limb\".William's eldest son, George - the second in line to the throne and nine years old - will be one of the king's four pages of honour, joining the procession through the nave of London's Westminster Abbey.His younger two children, Charlotte, 8 and Louis, 5, who are the third and fourth in the line of succession, will join George and their parents in a carriage as part of the grand procession back to Buckingham Palace.HARRYThe fifth-in-line to the throne is Prince Harry, Charles' youngest son who lives with his American wife Meghan in California, after they stepped down from royal duties to pursue an independent life.The couple have since accused some royals, including Camilla and Harry's brother William, of leaking stories to the tabloid newspapers to protect themselves or enhance their reputations.Harry will not have an official role in the ceremony and will not take part in the procession. It is not clear if he will join the family when they appear on the balcony to greet the crowds later on Saturday",
        "Meghan will remain in the United States with their two children. Their eldest son Prince Archie, the sixth-in-line to the throne, turns four on the day of the coronation.CHARLES' SISTER ANNECharles' sister Anne will ride in the procession behind Charles and Camilla's carriage, in a position known as \"Gold Stick\" that was created during the reign of Henry VIII when a loyal courtier entrusted with the sovereign's personal safety was ordered to ride by the monarch's side.PRINCE ANDREWPrince Andrew, the third child of Queen Elizabeth, will attend the coronation but will not have an official role.Andrew was stripped in recent years of most of his titles and removed from royal duties over his friendship with late U.S. financier Jeffrey Epstein, a convicted sex offender, and a related sex assault allegation.In February 2022, Andrew settled a U.S. lawsuit in which a woman accused him of sexually assaulting her when she was a teenager. He has not been charged with any criminal offence and has always denied any wrongdoing.(Reporting by Kate Holton; Editing by Emelia Sithole-Matarise)"
    ]
}