{
    "articleURL": "/wires/ap/article-12061307/California-bank-regulator-finds-faults-banks-demise.html",
    "content": [
        "NEW YORK (AP) - California's bank regulator said Monday that it was too slow to see the growing risks at Silicon Valley Bank and did not act forcefully enough to get the bank to fix its problems.",
        "A report from the California Department of Financial Protection and Innovation echoed similar findings in a Federal Reserve report looking at its own supervision of Silicon Valley Bank. The Fed was highly critical of its own role in the bank´s failure, saying its supervisors were also too slow or too unwilling to press the bank´s management to address issues.Silicon Valley Bank collapsed and failed on March 10 after its depositors rushed to withdraw tens of billions of dollars from the bank in a 21st century bank run. Aftershocks from the bank's failure have shaken the financial system, leading to the failure of Signature Bank and First Republic Bank, and putting several other banks under severe financial strain.California has been the banking turmoil's epicenter. San Francisco-based First Republic was closed by regulators and sold to JPMorgan Chase last week. PacWest Bank, based in Los Angeles, was pummeled by financial markets last week after First Republic failed.The DFPI said in its report that its staff was too slow to notice how quickly First Republic and Silicon Valley Bank expanded during the COVID-19 pandemic, taking on billions of dollars in deposits. Staffers also failed to realize the risks that come with banks getting too big too quickly, it said.The agency also said its staff did not recognize the potential risks represented by the large amount of uninsured deposits that were being carried at Silicon Valley Bank and what that might mean if those wealthy depositors were to suddenly get worried about the bank's financial health.",
        "DFPI said it planned to increase staffing to supervise banks with over $50 billion in assets and those that might have high concentrations of deposits in one particular sector, like Silicon Valley Bank had with the technology industry."
    ]
}