{
    "articleURL": "/news/article-12051545/Crimes-ofwoman-faked-cancer-7-years-swindle-100k-laid-bare-podcast.html",
    "content": [
        "Amanda C. Riley, 37, was sentenced to five years in prison in May 2022 after she scammed donors out of $105,513 to help her pay for fake cancer treatmentsIn a Lionsgate podcast, Scamanda, which premieres May 15, the young woman's crime will be laid bare in eight episodes that will drop weeklyRiley started a blog in October 2012, detailing her harrowing tale of dealing with Hodgkin's lymphoma to try and solicit donations to cover her medical expenses The brazen crimes of a California woman who shamelessly faked cancer for seven years - and even shaved her head for the cause - to swindle more than $100,000 from unsuspecting donors are being laid bare in a new podcast. ",
        "Amanda Christine Riley, 37, was sentenced to five years in prison in May 2022 after she scammed donors out of $105,513 to help her pay for fake cancer treatments. The new podcast, Scamanda, by Lionsgate Sound which premieres on May 15, tells the story of how an anonymous tip to an investigative producer let to Riley's trail of lies being uncovered. Scamanda, which is hosted by journalist Charlie Webster, also explores how the unbelieveable tale left the community of San Jose in shock. 'We are always searching for unique stories, and the wild tale behind Amanda Riley's crimes fit the bill,' said Webster, host and creative director at Lionsgate Sound.'The psychology of what this woman did to manipulate and infiltrate her community using the power of social media is fascinating and I know listeners will be enthralled by what unfolds in the series.' Riley's scheme started in October 2012 when she launched a blog, titled Lymphoma Can Suck It, which detailed her harrowing tale of dealing with cancer to solicit donations to cover her medical expenses.  ",
        "She even created a social media presence on Facebook, Instagram, and Twitter documenting her fake battle with cancer, and shaved her head to keep the ruse going, according to the United States Attorney's Office for the Northern District of California. ",
        "As the donations rolled in, the then-Bay Area resident wasn't using the good-faith money to pay hospital bills, but instead deposited it into her personal bank accounts used it to pay for living expenses.Her scheme was ultimately discovered by the Internal Revenue Service in 2019 and she was charged with one count of wire fraud in July 2020, which she pleaded guilty to in October 2021.Riley shared photos of herself with captions claiming she was taking cancer drugs and receiving treatment.She went so far as to shave her head to make it appear as if she lost her hair during chemotherapy and even falsified medical records with forged doctors' letters and medical certificates.",
        "Her blog also linked to a support page, which included false information about her fake 'battle with cancer.'The description reads that Riley was initially diagnosed with cancer in June 2012 and had a brief remission the following year before the lymphoma returned 'with a vengeance' as a Stage-4 metastatic cancer, requiring several rounds of chemotherapy and radiation treatment at various hospitals around the country, including Johns Hopkins Hospital.The now-defunct page featured a clickable 'donate now' icon for visitors to donate money online, and encouraged them to make contributions to 'support Amanda' and help her 'battle with cancer.'",
        "Riley also received money from donors via checks that were deposited into her personal bank account from her friends, family and members of her church.Other donations came from a Facebook challenge, CrossFit fundraiser, Christmas ornament sale, quilt raffle, Chili’s Grill &amp; Bar fundraiser, calendar sales and eBay auctions of various items, including an electric guitar autographed by country music stars John Michael Montgomery and LeAnn Rimes.",
        "It has since been revealed that Riley had convinced her family members that she had cancer, and went as far as to sue one person who questioned her diagnosis.But in reality, Riley has never had Hodgkin’s lymphoma or any other type of cancer.'When people donated to Riley over the internet or at in-person fundraisers, they believed their donations would be used to pay Riley’s cancer-related expenses,' according to the U.S. attorney's statement.'In fact, Riley had no cancer-related expenses, and donors’ funds were simply deposited into Riley’s personal bank account.'She ultimately pleaded guilty to the charges - acknowledging that between September 2012 and January 2019, she raked in hundreds of thousands of dollars by falsely claiming she battled Hodgkin’s lymphoma and soliciting donations on social media.She lost her job as principal of Pac Point Christian Academy in Gilroy, and before being sentenced to prison, she and her husband, Cory, moved with their two sons to Texas. ",
        "Ahead of her sentencing, court documents obtained by DailyMail.com, showed her attorneys arguing that she only face five years in prison. 'Ms. Riley recognizes the seriousness of her offense,' Jodi Linker, a public defender wrote to the judge, noting: 'She is extremely remorseful and is determined to do everything possible both to make restitution and to earn the forgiveness of the people she has hurt.'The public defender went on to note that Riley 'is a devoted wife and mother, and, before her actions ended her career, she was a gifted teacher.'Linker also insinuated in the sentencing memorandum that Riley had mental health issues, writing: 'On the surface, Ms. Riley's upbringing appears to have been relatively stable.'Her parents fought often and sometimes imposed harsh punishments on the children, but her basic needs were met, and while she did not have many friends growing up, she was an excellent student who participated in extracurricular activities.'As a teenager, however, Ms. Riley experienced a series of traumatic events, the impact of which went unacknowledged and unaddressed for many years.'Any details of the 'traumatic events' were redacted from the document."
    ]
}