{
    "articleURL": "/wires/ap/article-12038619/La-Boh-space-returns-Paris-6-years-uproar.html",
    "content": [
        "Claus Guth was pleased with initial reaction to his outer space version of Puccini´s \"La Bohème\" at a special pre-premiere show limited to people under age 28.",
        "\"They were extremely euphoric,\" he said. \"It was an amazing performance with standing ovations.\"Three nights later at the official opening of the Paris Opéra´s first new \"Bohème\" in 22 years, a high-profile occasion featuring conductor Gustavo Dudamel´s formal company debut, the response was far different.\"The real premiere was bizarre because some people freaked out so early that Dudamel had to stop conducting once because there was just too much booing,\" Guth recalled.That uproar on Dec. 1, 2017, weighed on the German director´s mind when he arrived at the Bastille Opéra last week to supervise the first revival of his staging, which opens Tuesday night for a run of 12 performances through June 4.Soprano Ailyn Pérez takes over as the terminally ill seamstress Mimì, tenor Joshua Guerrero is the poet Rodolfo and Michele Mariotti will be in the pit. Posters of the moonscape set used in the final two acts have been plastered throughout the Paris Métro for months.",
        "Puccini set the first and fourth acts in a Parisian garret, the second at the Latin Quarter´s Café Momus and the third at Paris´ Barrière d´Enfe, beginning the drama on Christmas Eve 1837 and ending it months later.Guth envisions the action unfolding across an unspecified future, perhaps 50 years from now or possibly 1,000.",
        "Set designer Étienne Pluss, taking inspiration from Stanley Kubrick's \"2001: A Space Odyssey, \" created a doomed spaceship on a raked stage for the first two acts and a bleak planet for the final two - substituting ashes for snow in Act 3. He estimated nearly 200 LED and neon lights were used. This was his first project with Guth.\"When I thought two times about this and I listened once again to the opera, I really thought it was what Puccini could have dreamed to imagine, because he´s speaking already about this in his music,\" Pluss said.Indelible images of inconsolable isolation were created by Pluss, Eva Dessecker (costumes), Fabrice Kebour (lighting), Teresa Rotemberg (choreography) and Arian Andiel (video). Men in space suits amble in low-gravity gaits and nap in sleep pods, mixed in among a hallucinatory spectacle: a boy with large red balloon, an illuminated yellow Chinese dragon, acrobats, juggling waiters and a stiltwalker.Mimì wears a red dress and Musetta emerges from a shiny curtain to sing her waltz while hugging a stripper pole, twirling a feather boa and peeling off a dressing gown and long gloves, as if in a Paris nightclub. A body double dancer hangs outside a window in an extravehicular repair mission.Supertitles tell the audience they are viewing Day 126 of a mission: \"Expedition in danger - off course - engines inoperative - life-support resources almost exhausted.\" The landlord, Benoit, is dead before the opening note and his lines reassigned. By Day 159, the musician Schaunard and philosopher Colline have expired, too. There are doppelgängers and an invented white-faced mime Rodolfo imagines, sort of a herald of death.",
        "These are all apparitions of Rodolfo´s distant youth. As he approaches his end, Mimì´s spirit lives.\"I think for the newcomer this will be tricky to figure out,\" Pérez said. \"He´s outlining the solitude, the despondency of being alone - really, really alone. It kind of allows the audience to see physically something happening beyond the music. And it leads an audience to sort of go with the story and use their own imagination.\"Stéphane Lissner, preparing to start his term as Paris Opéra director, hired Guth for the project about a decade ago.\"I told Lissner I love this piece, but I hate this stupid cliches about artists, which were probably never true and are not true now,\" Guth said. \"The realistic story is just an occasion Puccini uses to create this music.\"He read the 1851 book \"Scènes de la vie de bohème (Scenes of Bohemian Life)\" by Henri Murger, much originally published in the magazine Le Corsaire and adapted into a play, \"La Vie de la bohème\" by Murger and Théodore Barrière. With librettists Luigi Illica and Giuseppe Giacosa, Puccini turned the story into an opera that premiered in 1896.\"It is actually the story of two old men sitting in the countryside at the end of their lives and looking back at their crazy, wild lives in Paris a long time ago. And so this combination gave me the idea, OK, let´s go one step further: Where could this longing or this remembering better times - how to get that more extreme?\" Guth said.",
        "\"And so it entered at some point in combination of this storyline and the music this idea to say maybe Paris or the Earth doesn´t exist anymore because we ruined it and now I have people somewhere out in space that on a realistic level have a problem on their ship and are close to dying. So what do you do when your time is limited? You try to think of the precious moments.\"His production, preserved in a video recording of the Dec. 12, 2017, performance, is among the boldest reconceptions since Dorris Dörrie´s 2005 staging of Verdi´s \"Rigoletto\" at Munich's Bavarian State Opera was set on the Planet of the Apes.Sonya Yoncheva retains vivid memories after singing Mimì at Guth´s production premiere.\"This was such a nightmare,\" she said last winter, laughing, \"but many people are still talking about it.\""
    ]
}