{
    "articleURL": "/sciencetech/article-12050481/Want-long-happy-marriage-Merge-bank-accounts.html",
    "content": [
        "Married couples with joint bank accounts have better relationshipsThey also fight less over money and feel better about how finances are handledThe Beatles famously sang 'Money can't buy me love'.",
        "But couples who manage their finances together may love each other for longer, according to new research.A study has shown married couples who have joint bank accounts not only have better relationships, but they fight less over money and feel better about how household finances are handled.Researchers recruited 230 couples who were either engaged or newly married, and followed them over two years as they began their married lives together.Everyone began the study with separate bank accounts. Some couples were assigned to keep their separate accounts, and others were told to open a joint account instead.",
        "A third group was also allowed to make the decision on their own.Analysis revealed couples who opened joint bank accounts reported substantially higher relationship quality two years later than those who maintained separate accounts.The scientists said merging funds means couples are more aligned with their financial goals and are more transparent with each other.It also leads to a 'communal understanding of marriage' – when partners respond to each other's needs – they said.Meanwhile couples with separate accounts viewed financial decision-making as more of an exchange, and may think it easier to leave the relationship, they suggest.Some 20 per cent of participating couples did not finish the study, including a significant percentage of those who separate after not merging bank accounts.",
        "Author Jenny Olson, from the Indiana University Kelley School of Business said: 'When we surveyed people of varying relationship lengths, those who had merged accounts reported higher levels of communality within their marriage compared to people with separate accounts, or even those who partially merged their finances.",
        "'They frequently told us they felt more like they were 'in this together.''This is the best evidence that we have to date for a question that shapes couples' futures; and the fact that we observe these meaningful shifts over two years, I think it's a pretty powerful testament to the benefits of merging.'On average, merging should warrant a conversation with your partner, given the effects that we're seeing here.'The findings were published in the Journal of Consumer Research.",
        "Kale Monk, assistant professor of human development and family science at University of Missouri says on-off relationships are associated with higher rates of abuse, poorer communication and lower levels of commitment.People in these kinds of relationships should make informed decisions about either staying together once and for all or terminating their relationship.Here are his top five tips to work out whether it's the right time to end your relationship – 1. When considering rekindling a relationship that ended or avoiding future breakups, partners should think about the reasons they broke up to determine if there are consistent or persistent issues impacting the relationship.2. Having explicit conversations about issues that have led to break ups can be helpful, especially if the issues will likely reoccur. If there was ever violence in the relationship, however, or if having a conversation about relationship issues can lead to safety concerns, consider seeking support-services when it is safe to do so.3. Similar to thinking about the reasons the relationship ended, spend time thinking about the reasons why reconciliation might be an option. Is the reason rooted in commitment and positive feelings, or more about obligations and convenience? The latter reasons are more likely to lead down a path of continual distress.4. Remember that it is okay to end a toxic relationship. For example, if your relationship is beyond repair, do not feel guilty leaving for your mental or physical well-being.5. Couples therapy or relationship counselling is not just for partners on the brink of divorce. Even happy dating and married couples can benefit from ‘relationship check-ups’ in order to strengthen the connection between partners and have additional support in approaching relationship transitions."
    ]
}