{
    "articleURL": "/news/article-12047141/M-S-security-guard-killed-homeless-suspected-shoplifter-blow-head-guilty-manslaughter.html",
    "content": [
        "M&amp;S guard Sabeur Trabelsi, 44, killed homeless man suspected of stealingJason Page died after a 'knockout' blow from Trabelsi near Reading last yearA Marks &amp; Spencer security guard is facing a long prison sentence today after a unanimous jury found him guilty of killing a homeless man he suspected of stealing meat.",
        "A jury took four hours of deliberation to convict father-of-three Sabeur Trabelsi, 44, of manslaughter.Trabelsi had landed a 'knockout blow' to the head of homeless man Jason Page near the supermarket in Lower Earley, near Reading, Berkshire, on March 31 last year, the court had earlier heard.Mr Page fell to the ground, hitting his head so hard he never recovered from his injuries and died in hospital.Trabelsi been hired to work at the M&amp;S supermarket in Lower Earley, Berkshire, following a spate of thefts of expensive meat and alcohol.Trabelsi, who told police, 'I was frustrated, I know I shouldn't have done it', was captured on chilling CCTV footage delivering the fatal blow to Mr Page.  ",
        "After he was arrested Trabelsi tried to claim that 51-year-old Mr Page fell over because he was drunk and that was why he hit his head and denied throwing a punch at him.However, CCTV footage seen by the jury showed him being punched.Jurors convicted Trabelsi of manslaughter and perverting the course of justice. The manslaughter conviction means the M&amp;S guard could be jailed for up to eight years.The store manager, Elliot Cripps, who followed Trabelsi out of the shop as he chased Mr Page, was cleared of perverting the course of justice and walked free from Reading Crown Court.",
        "Judge Amjad Nawaz rejected a plea by Trabelsi's defence counsel for him to be granted bail 'to put his affairs in order' before being imprisoned and he was sent to the cells beneath the crown Court. He will be detailed at Bullingdon Prison in Bicester pending sentencing on June 12.While summing up their case, the prosecution said that Trabelsi, from Kings Road in Reading, Berkshire, had told police in one of several interviews: 'I was frustrated, I know I shouldn't have done it.'The jury of eight men and four women retired on Wednesday afternoon to consider whether Trabelsi was guilty of manslaughter. They heard that the fatal punch happened on Trabelsi's last working day for Marks and Spencer.",
        "Thirty minutes before the shop was to shut, the security guard chased Mr Page out of the shop after he and an accomplice were seen on CCTV 'brazenly' filling up a bag with expensive meat and grabbing a box of Moretti beer on their way out.The jury was told that Trabelsi carried on chasing Mr Page towards the nearby BP garage on Chalfont Way and Mr Cripps, the M&amp;S store manager, followed behind in an attempt to grab back the bag of meat.CCTV played to the jurors showed Mr Page being wrestled to the ground as Mr Cripps manages to get the meat back from him. When Mr Page got back on his feet, Trabelsi delivered a 'knockout blow', causing him to fall backwards and crash onto the pavement. He died a short time after from his injuries.",
        "Trabelsi told jurors that 51-year-old Mr Page had threatened to stab him with a needle when he landed the punch. He also argued he slapped Mr Page rather than punching him."
    ]
}