{
    "articleURL": "/wires/reuters/article-12047409/Fatalistic-Muscovites-shrug-reported-drone-attack-Kremlin.html",
    "content": [
        "May 4 (Reuters) - Russia's administration may have portrayed a reported drone attack on the Kremlin as an attempt to assassinate President Vladimir Putin in the heart of Moscow, but the capital's citizens appeared more fatalistic on Thursday.",
        "\"We can´t do anything about it, can we? We live in an awesome country, the best protected country,\" said Anastasia, a woman in her 30s who, like other passersby interviewed in central Moscow, declined to give her surname.The administration accused the United States on Thursday of orchestrating what it says, without providing evidence, was a Ukrainian drone attack aimed at Putin's quarters in the small hours of Wednesday.Kyiv and Washington denied responsibility, and security analysts ridiculed the notion of an assassination attempt.Some said if Kyiv was responsible, its aim would have been to demonstrate that even the distant Russian capital, preparing for May 9 Victory Day celebrations, could not shut out the consequences of Russia's invasion of Ukraine.But the war seemed far from the minds of Muscovites out on streets no less animated than usual on a chilly spring day.\"It can fly in from anywhere, and it's not only here - it could be an earthquake, or a stone from a building site,\" Anastasia said.\"We've been strolling by the Kremlin - it's beautiful, wonderful, the sun is shining. What's the point of trembling?\"'OUR PUTIN IS SUPER'Vladimir, 57, took a similar view: \"There's probably still more of a chance of being killed by a falling meteorite than a drone. So I'm not afraid in the slightest.\"",
        "Nikita, in his early 30s, did see the incident as a failure of anti-aircraft and early-warning systems, but was still relaxed.\"It's the May holidays. By the time someone saw it, by the time they reported it, by the time they got through, by the time they made a decision, it was already too late,\" he said.\"So what happened happened.\"Zifa, in her 60s, thought the whole thing was an invention. \"I don't believe they got to the Kremlin,\" she said. \"Our Putin is super. Nothing ever threatens him.\"(Writing by Kevin Liffey; Editing by Andrew Cawthorne)"
    ]
}