{
    "articleURL": "/femail/article-12053775/First-Lady-Jill-Biden-looks-radiant-blue-Westminster-Abbey-represent-husband.html",
    "content": [
        "Jill, 71, was seen making her way inside Westminster Abbey on Saturday Was joined by Finnegan, who wore an elegant yellow dress and matching heels after her husband chose not to attend the historic eventHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk First Lady Jill Biden put on a very elegant display in a blue ensemble as she arrived at Westminster Abbey today to represent her husband President Joe at the coronation of King Charles - alongside her 24-year-old daughter and official plus one, Finnegan. ",
        "The 71-year-old donned a cornflower blue Ralph Lauren skirt suit for the historic occasion, accessorizing the look with a pair of matching gloves, nude heels and clutch, and a blue bow in her hair.Meanwhile her granddaughter - who is the daughter of President Biden's scandal-ridden son Hunter - opted for a pale yellow Markarian cape dress, pairing the design with a matching floral headband, silk heels, and a small handbag. The two women are representing the President at the coronation after Jill's husband Joe declined his invitation from Charles, telling MSNBC last night that he was unable to attend because he has 'a lot going on'. ",
        "No US President has ever attended a British coronation - and Jill and Finnegan are understood to be the first immediate family members of a sitting President to attend the event. Finnegan and Jill were seen being escorted into Westminster Abbey, where they took their seats several rows back behind the representatives from Serbia, Slovakia, and Macedonia. The First Lady and her grandchild - with whom she is known to enjoy a very close relationship - were seated alongside Ukrainian First Lady Olena Zelenska, whom they were seen chatting with at a lavish reception at Buckingham Palace last night. It is understood that the two women donned yellow and blue - the colors of the Ukrainian flag - in a show of solidarity with the country. ",
        "Jill and Finnegan have attended several events since their arrival in the UK - with the East Wing confirming on Thursday that the First Lady would be joined by her granddaughter in the absence of her husband, who opted out of the coronation. During an interview on MSNBC last night, the President said of his absence at the coronation: 'I told [King Charles] I couldn't be there because I have this going on.'He added that he told the King that he would be in the UK during the summer during the NATO conference, saying 'He's a good acquaintance and we've worked together on environmental issues.'Biden's likely opponent in 2024, ex-President Donald Trump, earlier expressed his disgust that the president was not making the trip across the pond.'Certainly, he should be here as our representative of our country. I was very surprised, I think it's very disrespectful for him not to be here,' the former Apprentice host told GB News.",
        "At the last such event, when Charles' late mother Elizabeth was crowned in 1953, then US President Dwight Eisenhower sent a delegation of envoys to represent him. Trump went on to accuse Biden of not being physically well enough to make the journey to the UK. 'He's got a lot of things going, a lot of strange things happened,' the twice impeached president added.",
        "Jill was last in the UK for the funeral of Queen Elizabeth in September, which she attended alongside President Joe Biden.However, yesterday, First Lady Jill Biden's first stop was a meeting with Akshata Murty, the wife of Prime Minister Rishi Sunak. Here, they met veterans and visited a local school before they are due to meet US Embassy staff in Vauxhall. Mrs Biden later met King Charles, her 13th cousin once removed, at a reception in Buckingham Palace. The reception was organized as a chance for the King to greet his guests because there will be no formal event outside the Coronation itself today.President Biden has faced some criticism, notably from his predecessor and potential 2024 election rival Donald Trump, for skipping Charles' coronation.At the last such event, when Charles' late mother Elizabeth was crowned in 1953, then US President Dwight Eisenhower sent a delegation of envoys to represent him. ",
        "The White House said last month President Biden had told Charles he wanted to meet the King in Britain at a future date. President Biden visited Belfast and Ireland last month to commemorate the 25th anniversary of the Good Friday Agreement.It comes as new research has revealed how Mrs Biden and King Charles are distant cousins. The monarch and Mrs Biden both descend from 16th century noble couple Philippe III de Croÿ and his wife Johanna. They are 13th cousins once removed.",
        "Philippe III, who died in 1595, served as a knight under Spain's King Philip II, the husband of Queen Mary who sent the Spanish Armada to invade England in 1588.The research by genealogy website MyHeritage has also shown that the King is a 12th cousin of Canadian PM Justin Trudeau, who will also be at the Coronation.The King and Mrs Biden are both the 13th generation descending from De Croÿ. The 'once removed' element of their connection refers to the number of generations that separate them.A first cousin once removed would refer to a cousin who is of your parents' generation.  De Croÿ, who was also the Stadtholder - or steward - of Flanders in Belgium, had daughters Anne and Marguerite with his wife. Charles is directly descended from Anne, whilst Mrs Biden descends from Marguerite.Charles will be crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry. It will also shine a spotlight on Britain’s place on the world stage.And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations.Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.",
        "The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasizes the proud diversity of modern-day Britain.‘There will be all the pomp and ceremony you could dream of, but as little of the “them and us” as possible,’ one senior royal aide said last night.Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary’s Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to ‘pace herself’ and also ensure ‘the day was about her husband’, sources said.",
        "‘She loves him unconditionally and always wants him to shine,’ a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.‘The calm before the storm – perhaps metaphorically as well as literally’, a friend said with a nod to the dismal weather forecast, something the new King and Queen’s celebrations have in common with the late Queen’s Coronation in 1953."
    ]
}