{
    "articleURL": "/wires/reuters/article-12045281/Waiting-ECB-nervous-Fed-pivot-banking-sector.html",
    "content": [
        "By Rae Wee and Ankur Banerjee",
        "SINGAPORE, May 4 (Reuters) - Global stock markets sagged while the Japanese yen rose on Thursday in reaction to the Fed's policy statement and signs of stress at another U.S. regional bank, spurring investors to price in a pivot rather than just a pause in rate increases.Another U.S. regional bank, PacWest Bancorp, reported troubles overnight, reminding investors of the precarious health of some banks despite regulators' assurances around containing the crisis that started with the collapse of Silicon Valley Bank and Signature Bank in March.The Federal Reserve raised interest rates by a quarter of a percentage point and signaled it may pause further increases, giving officials time to assess the fallout from the bank failures, wait on a political resolution to the U.S. debt ceiling, and monitor inflation.Although investors initially cheered the possibility of a pause, their confidence waned as Chair Jerome Powell spoke, clarifying inflation remains the chief concern and that it is too soon to say with certainty that the rate-hike cycle is over.\"The Fed decision was widely expected, so it didn't provide much of a shock to financial markets,\" Tina Teng, market analyst at CMC Markets, in Auckland. \"However, I think the whole economic playout is not positive, especially the recent banking rout from the regional banks, and those big banks taking over the smaller banks. It's not a good sign, and risks are spreading out into the wider banking system, which worries investors.\"",
        "The European Central Bank meets later and is expected to raise rates. It will be a seventh rate rise for the ECB, the central bank for a 20-country zone whose headline inflation is 7% and that has so far dismissed the ongoing banking crisis as U.S.-specific.European stocks seemed languid too, with the Eurostoxx 50 futures flat and FTSE futures down 0.21%MSCI's broadest index of Asia-Pacific shares outside Japan was up 0.6% in trade thinned by Japanese holidays this week.China's benchmark index opened weaker as mainland markets returned after their May Day holidays but rebounded, led by state-owned firms.Investors have cheered a spike in domestic tourism during the long holiday. Meanwhile, the Caixin/S&amp;amp;P Global manufacturing purchasing managers' index (PMI) was unexpectedly weak in April, pointing to softer domestic demand.E-mini futures for the S&amp;amp;P 500 fell 0.22%, reflecting the dramatic slide in regional banking shares after the close of U.S. markets. The S&amp;amp;P 500 had closed 0.70% lower.PacWest fell nearly 60% after announcing it is exploring strategic options, including a potential sale or capital raise. A liquidity boost it announced in March failed to inspire confidence in its ailing share price.Those worries left Asian markets pricing in not just a possible peak in U.S. rates but even a fall.",
        "\"I think he (Powell) perhaps was a little bit more forceful in raising the bar to further tightening than some might have expected,\" said Rob Carnell, ING's regional head of Asia-Pacific research, based in Singapore. \"It feels like there's quite a lot of consideration of these other bits of economic data that are sort of being wrapped up into their decision to say that that's pretty much all we're going to get (in terms of rate hikes).\"ING expects 100 bps of rate cuts by the end of the year.Treasury futures rallied, as did Fed Funds futures , the latter implying a 52% chance of a rate cut in July. The two-year note rose in price to a yield of 3.8%.The Japanese yen strengthened 0.1% versus the greenback at 134.51 per dollar, adding to its more than 1% rise on Wednesday.In thinned Asian trade, the British pound rose 0.2% to a roughly 11-month high of $1.25905, while the euro gained 0.19% to $1.1082, flirting with its recent one-year peak.Mizuho analysts said the excitement over the implied pause in Fed tightening might be overdone and that the Fed's guidance \"is merely more contemplative\" and it was \"cautious about further hikes, not unduly panicked about having over-tightened\".(Reporting by Rae Wee and Ankur Banerjee Writing by Vidya Ranganathan; Editing by Sam Holmes and Gerry Doyle)"
    ]
}