{
    "articleURL": "/news/article-12050751/Marco-Yandle-Mum-breaks-outside-court-private-schoolboy-son-denied-bail-murder.html",
    "content": [
        "The mother of a teenager charged with murder has broken down after having his bid for bail rejected.",
        "Marco Yandle, 19, watched from custody through an AVL link to South Australia's highest court as Justice Sandi McDonald again declined the teenager bail.Marco, who is charged with murder over the February death of then-missing father-of-two Steve Murphy, had previously asked the Adelaide Magistrates Court to release him on home detention bail - a request that was immediately dismissed due to the severity of the charges.He then applied for that decision to be reviewed in the Supreme Court, arguing his age, lack of criminal history and previous good character should be reason enough for the dismissal to be overturned.",
        "Justice McDonald, however, ruled that a murder charge was the most serious offence and meant the teen was not automatically entitled to bail.'It is an offence committed in a vast range of circumstances, by people from many different walks of life,' she said.'It is not uncommon for a person charged with murder to have been of previous good character appearing in court for the first time.'In my view, this is a very serious allegation of murder and I dismiss the application.'Marco had no visible reaction to the decision, but outside court his mother left weeping.",
        "Prosecutors allege that on the night of February 19, Marco and his father Keith equipped themselves with a bat and an illegal firearm after they suspected an intruder was on the property.",
        "The duo allegedly went out to check on their shed at the family property in Kudla, about 47km north of Adelaide, when the intruder, Steve Murphy, was shot.The teen, who had been carrying a baseball bat, allegedly shone a torch over Mr Murphy as his father shot the homeless man three times.The entire incident, the prosecution alleges, was caught on the family's CCTV system, but hard drives containing the footage were hidden in the roof of the home, along with the gun.Arguing against bail, prosecutor Lucy Boord KC said there were suspicions that Marco had something to do with hiding the evidence, as well as destroying text messages between him and his father from that day.Keith Yandle, 46, has also been charged with destroying human remains after burying Mr Murphy's body in an underground 'pit' in the shed.Outside court, Marco's friends and family declined to comment but appeared visibly upset by the decision.Friends of Mr Murphy told NCA NewsWire that they were relieved the teen would remain in custody.Both Marco and Keith will remain in custody until at least October."
    ]
}