{
    "articleURL": "/sport/football/article-12040903/Xabi-Alonso-Tottenhams-No-1-choice-new-manager-holds-advantage-Slot.html",
    "content": [
        "Alonso is reportedly the first choice to become Tottenham's new manager  Feyenoord boss Arne Slot has also been linked but Alonso holds an advantageLiverpool legend Xabi Alonso has emerged as a leading contender for the Tottenham Hotspur job after an impressive season at Bayer Leverkusen, according to reports.",
        "Spurs are searching for a new permanent manager after sacking Antonio Conte, axing his interim successor Cristian Stellini and then appointing Ryan Mason. Mason, 31, oversaw the 2-2 draw with Manchester United last week and the heartbreaking last-gasp defeat to Liverpool on Sunday.Alonso, who has guided Bayer Leverkusen to the semi-finals of the Europa League, is said to be a top candidate for the Spurs job, according to Dutch publication De Telegraaf.The Spaniard is thought to hold an advantage over Feyenoord boss and fellow candidate Arne Slot, who has led his side to an eight-point lead at the top of the Eredivisie.",
        "They report that Slot's lack of experience in 'a major competition', and a shortage of trophies to his name as of now, could count against him.Alonso's 'calibre' during his playing days as a top midfielder is attractive to Tottenham, De Telegraaf said, but no contact has yet been made by Spurs.The 41-year-old's Leverkusen side sit sixth in the Bundesliga, having won 14 matches out of a possible 30 so far this season. He has implemented an attractive style of attacking football.Spurs are also keen on Julian Nagelsmann but reports in The Sun claimed chairman Daniel Levy had reservations about the 35-year-old German because of his age.",
        "However, it is not thought to be a deal-breaker and Nagelsmann remains the favourites with the bookies.He had been the leading contender for the Chelsea job before he pulled out of the race after being spooked by the club's process and thinking he was a shoo-in for the role. Mail Sport previously reported Spurs are exploring an interest in Sporting Lisbon head coach Ruben Amorim.The Portuguese is rated among the best emerging coaches in Europe and is on Tottenham’s radar. He has also been on Chelsea’s radar. Tottenham insist the appointment of Conte’s long-term successor is an open process with no set first-choice as it stands.Vincent Kompany is of interest - though Burnley are keen to tie the Belgian down to a new deal.",
        "Mauricio Pochettino had been the preferred candidate for a number of players and the large sections of the fanbase, but appears set to become manager at Chelsea.Slot, meanwhile, is said to be 'convinced' that he can implement his philosophy at any club in the Premier League if handed the opportunity.Feyenoord are keen to keep Slot for another season and could increase his salary to do so, allowing him to impress in the Champions League with his side next season to further aid his chances of landing a job in England.",
        "Slot was a previous candidate for the Leeds United role but opted to remain in the Eredivisie rather than join the relegation-battling side, who are set to appoint Sam Allardyce as their head coach for the remaining four matches of the season. "
    ]
}