{
    "articleURL": "/wires/ap/article-12053321/Kelly-strikes-10-Diamondbacks-3-1-win-Nationals.html",
    "content": [
        "PHOENIX (AP) - Merrill Kelly gave up a looping homer that barely cleared the wall in the first inning.",
        "The rest of the inning and the rest of his start: dominant.Kelly struck out 10 in seven strong innings, Corbin Carroll homered in his return to the lineup and the Arizona Diamondbacks beat the Washington Nationals 3-1 on Friday night.\"It was Merrill´s day today,\" Diamondbacks manager Torey Lovullo said. \"He was locked in and making pitches all day and all night. I think there was just one hiccup that was that solo home run in the first and after that he was just totally locked down.\"Kelly (3-3) yielded Luis García's slicing homer just inside the foul pole in the first, but also had three strikeouts in the inning. He allowed a run on four hits and walked one in his second straight solid start.Carroll homered off Josiah Gray (2-5) in his first start since crashing into the wall against Colorado last Sunday. Andrew Chafin worked a perfect ninth for his fifth save in six chances to complete the combined four-hitter.",
        "\"He didn´t give us much to hit,\" Nationals manager Davey Martinez said of Kelly. \"He had good stuff. Good cutter, good changeup, threw his fastball to all four quadrants. It was tough tonight.\"Kelly, who allowed a run in six innings against Colorado his last start, stranded runners at second and third in the second. He settled into a rhythm after that, giving up a pair of singles before finishing with his third career double-digit strikeout game.",
        "\"I felt probably better than I have in a while,\" Kelly said. \"Stuff was coming out of my hands a lot better. I felt more like myself. You could probably tell just from the way the pitches look, everything was a little sharper today, a little tighter.\"Gray had been sharp since allowing five runs in his season-opening start, giving up five runs in his next five starts combined.The Washington right-hander didn't have his best stuff against the Diamondbacks.Carroll, who pinch-hit against Texas on Wednesday, homered in the third inning. Arizona loaded the bases against Gray in the fourth, going up 3-1 on Josh Rojas' infield single - after a video review overturned an out call - and Ketel Marte's sacrifice fly.Gray didn't come out for the sixth inning after allowing three runs on seven hits with six strikeouts.\"It was an OK outing,\" Gray said. \"I´ve just got to make one, two more pitches there in the fourth. I´ve got to make the play. But it was OK. I kept the team in the game for a decent bit of it. I´ve got to get better, but I thought it was all right.\"FANTASTIC FLETCHERDominic Fletcher has made the most of his first call-up to the big leagues.",
        "The Arizona outfielder singled in the second inning and later scored a run, extending his hit streak to four straight games opening his career. That puts him three games behind the team record set by David Peralta in 2014.ROJAS' DRojas went 0 for 4 at the plate, but didn't let it affect his defense.Arizona's third baseman made several tough plays, including a diving stop and a tough throw from well behind the bag on Victor Robles in the seventh inning.\"He´s playing Gold Glove defense and those plays are not easy,\" Lovullo said. \"The diving play makes, picks up the ball, throw straight across the field. That´s a tough play to make, but he´s been doing it all year long.\"TRAINER´S ROOMDiamondbacks: RHP Zach Davies threw a bullpen session at Arizona's spring training complex as he works to return from a left oblique strain suffered April 8.UP NEXTWashington LHP MacKenzie Gore (3-2, 3.77 ERA) faces Arizona LHP Tommy Henry (1-0, 6.52) in the middle game of the series on Saturday.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}