{
    "articleURL": "/sport/football/article-12050493/10-things-learned-La-Liga-Barcelona-fans-dont-chant-Lionel-Messis-return.html",
    "content": [
        "Barcelona are just ONE win away from securing the title in the Spanish top flightCarlo Ancelotti has told Militao to 'wake up' before facing Manchester CityThere is no league programme this weekend because of the Spanish Cup final but there was a full round of midweek matches marked by Barcelona moving to within one win of the title and Madrid falling flat on their faces in San Sebastian.",
        "Elsewhere Atletico went goal crazy again and Valencia trusted youth and scraped an important point against neighbours Villarreal.Here’s LaLiga’s 10 things we learned.Barcelona’s Alemany exit shows rotten timing againOn Tuesday night they should have been celebrating yet another 1-0 win and moving to within just two points for the title. Instead, no sooner had Xavi finished his press conference, they announced the departure of director of football Mateu Alemany.They feared he would be spotted in Birmingham sooner rather than later signing his next contract with Aston Villa so they felt they had little choice. It was still another gaff in a season of many. He rarely gaffed. Of the signings he made last summer everyone bar Hector Bellerin has contributed to a title winning season, he will be missed.",
        "Busquets will leave club after winning the leagueBoth the man himself and coach Xavi seemed to suggest he had decided to quit this summer and move on to a new adventure possibly in Saudi Arabia or the US.He knows the best way to go is with a trophy and if he stays another year there are no guarantees that will happen. It also means he signs off in the Nou Camp where he has enjoyed so many incredible nights – and not in the 49,000 Olympic Stadium where Barca will play next season.",
        "No chants for MessiThe ten-minute mark passed this week at the Nou Camp with no chant of Lionel Messi’s name. Was it a sign? Probably not – maybe the fans just felt they should concentrate on the current players who are, after all, about to win the league. The story coming out of Barcelona tends to swing between: he’s definitely coming to he’s definitely not. Most sensible fans are staying centered: it’s neither highly probable, nor completely impossible.",
        "Barcelona’s player of the season is a goalkeeperMarc Andre ter Stegen became the first keeper in the history of LaLiga to keep 15 clean sheets in one season on Tuesday in the 1-0 win over Osasuna. No rival has scored against him from open play at home this season because the only two goals conceded at home have come from a Joselu penalty and a Ronald Araujo own-goal. He’s been Barca’s best player.Winning away at Espanyol will be the cherry on the topIf Real Madrid drop points in their next game at home to Getafe in a week’s time then Barcelona will win the title without playing but if Madrid do win then Barca can win it away at neighbours Espanyol. Three points would also help send down the city of Barcelona’s second club – win-win for Barca fans, and almost as good as winning the league at the Nou Camp.",
        "Silva heading back into the Champions LeagueThe 37-year-old midfielder former Manchester City star will be back in Europe’s top competition next season if Real Sociedad can hold on to fourth-place and it certainly looked that way when they beat Real Madrid on Tuesday inspired by David Silva’s magic.",
        "Militao can’t afford to sleep on the job against HaalandThat was more or less what Carlo Ancelotti said after another sloppy display from the defender in midweek. He has some time to find his best form again because he is already out of the first leg because of suspension. He’ll be back for the all-important second match at the Etihad and in his manager’s words: ‘He needs to wake up.’",
        "Cut-price Kubo looks a bargainKubo cost Real Sociedad €6.5m (£5.7m) from Real Madrid. They have been hoarding the best young talent for a while now and most of them will be on display next week when they face Manchester City, but some have slipped away. Their loss is Arsenal’s gain with Martin Odegaard and the same can be said for Real Sociedad and Kubo who scored against Madrid in his team’s win over them this week.Elche well-placed to come straight back upWith five games left Elche are relegated and the only consolation for their supporters is that the last of the six managerial changes they have made this season was with an eye to the next campaign. They brought in Sebastian Beccacece a month ago – not to save them but to plan for next season and that should stand them in good stead to come straight back up.Greizmann-inspired Atletico are the best watchDo not adjust your sets, the team scoring 13 goals in their last three games and 60 in total this season – the same as Barcelona – are Diego Simeone’s Atletico Madrid. ",
        "With 13 goals and 13 assists Griezmann has been their star but full credit to the manager who has released the handbrake and allowed the team to fly."
    ]
}