{
    "articleURL": "/news/article-12059961/Now-Biden-going-DISHWASHERS-new-rules-fight-climate-change.html",
    "content": [
        "New rules will force dishwashers to meet harsh water and energy efficiency targetsIt marks the latest chapter in Biden's war on appliances that his administration claims will save Americans moneyThe DoE quietly slipped out the rule changes ahead of Cinco de Mayo festivities on Friday Joe Biden will face fresh accusations of meddling in the lives of American households after his administration announced a green crackdown on dishwashers.",
        "His Department of Energy quietly released tighter rules for the home appliances on Friday afternoon as millions of people across the country prepared to celebrate Cinco de Mayo.The annual nationwide festivities mark the anniversary of Mexico's victory over the French at the Battle of Puebla in 1862.The rules, which form part of the administration’s climate change agenda, would slash water use by more than one-third and cut energy use limits by 27% for dishwashers in the U.S.Any changes would only apply to new models on sale once the new rules have officially come into effect, expected to be 2027.The new rules would force manufacturers to limit dishwashers to using 3.2 gallons of water per cycle, far below the current federal limit of 5 gallons.",
        "It would also require manufacturers to reduce their products' energy consumption by nearly 30%.Most dishwashers on the market are already well below the federal standard, with most using 3.5 gallons per cycle or less.Jill Notini, a spokeswoman for the Association of Home Appliance Manufacturers, warned that ordinary Americans will ultimately pick up the tab for the new rules. 'Consumers will pay the real price,' she told DailyMail.com. 'The Department of Energy has proposed very stringent standards for home appliances that will require higher upfront costs to purchase a product.'",
        "'Manufacturers just want to be able to deliver high performing, fully featured products at costs that consumers of all incomes can afford. The DoE is making that very difficult with the standards they are proposing,' Ms Notini added. But administration officials claim that the plans will ‘lower costs for American families and businesses while tackling the climate crisis.’Abgail Marone, an aide to Josh Hawley, a Republican senator from Missouri, accused the Biden administration of peddling 'a radical green energy agenda.'‘Leave our dishwashers alone,’ she said.It marks the latest step in what has been branded the administration’s ‘war’ on home appliances in a bid to cut emissions and save energy.Republicans recently reacted with fury after a Biden-appointed safety regulator suggested that authorities could ban gas stoves considered to be major polluters.CPSC commissioner Richard Trumka Jr. said earlier this year that ‘gas stove regulation has reached a boiling point.Trumka claimed the body 'has the responsibility to ban consumer products that emit hazardous substances, particularly, when those emissions harm children.''Any option is on the table. Products that can't be made safe can be banned,' he said.He later forced to clarify that he had been speaking about new products, and that a retrospective gas stove ban was not being considered.",
        "The U.S. Consumer Product Safety Commission makes decisions independently from the executive branch.But a leaked memo from October 2022, first obtained by Fox News, showed the top safety watchdog was considering tightening the rules on dangerous emissions.Biden’s Department of Energy has already pushed through stricter environmental standards on washing machines and refrigerators that have been described as ‘overregulation on steroids.’On his first day in office in January 2021, he signed an executive order telling DoE officials to make ‘major revisions’ to current appliance regulation standards.A month later, the agency listed more than a dozen energy efficiency rules, impacting appliances like water heaters, cooking products and lamps, that it would review.At the end of last year, the White House released a statement boasting that it had taken action against 110 household appliances to help cut emissions."
    ]
}