{
    "articleURL": "/wires/aap/article-12040045/Midfield-time-Pickett-level-coach.html",
    "content": [
        "Melbourne coach Simon Goodwin believes Kysaiah Pickett still has plenty of untapped ability to unearth as the gun small forward starts to spend more time in their stacked midfield.",
        "The second-placed Demons received a lift this week with Pickett re-signing for another four AFL seasons.Goodwin hailed Pickett's commitment as an endorsement of Melbourne's culture and expected the 21-year-old to get even better by making an impact around stoppages.\"To get his pen on paper is a massive relief for us internally and we're just blessed to have him on our list,\" he said.\"It's (his game is at) a pretty high level. He's kicked 40 goals the last two seasons.\"But what you've seen this year is our ability to put him through the midfield and impact the game around stoppage and clearance is something that we want to continue to evolve with Koz.\"He's still got a lot of untapped ability in terms of where we want to take him. He knows that and we're excited by what he can deliver.\"But his ability to kick goals, have scoreboard impact, but not only do that, but be able to impact around the ball, especially in big games - that's what we're looking for (from) Kozzy.\"Against North Melbourne on Saturday, Pickett had seven inside-50s, 10 contested possessions and three clearances along with three goals.Melbourne average a competition-high 109.9 points despite chopping and changing their forward line.Bayley Fritsch (16 goals), Kade Chandler (13), Pickett (12) and boom youngster Jacob van Rooyen (10 in five games) have the best returns but Tom McDonald and Ben Brown have both been in and out of the Demons' 22.",
        "Goodwin wasn't concerned by the lack of continuity and expected his attack to settle.\"Scoring hasn't been an issue for us in terms of hitting the scoreboard,\" Goodwin said.\"So from a forward line perspective, we're happy with that method and how we're going about our ability to operate inside 50. From a personnel perspective, we're certainly not settled.\"We're open-minded about how we get better, whether that's with our rucks, whether that's with Jacob van Rooyen, Harrison Petty, Ben Brown, Tom McDonald, we're very open minded about that, how that looks.\"But ultimately, we're looking for a group that functions well together, and we continue to hit the scoreboard which we've been able to do.\"Petty and Charlie Spargo should return from concussion against Gold Coast on Saturday, with Josh Schache likely to make way despite being cleared to play with his wrist injury.Fringe midfielder Luke Dunstan will miss four-to-six weeks after suffering a medial strain in the VFL."
    ]
}