{
    "articleURL": "/wires/reuters/article-12040309/Orioles-come-outslug-Royals.html",
    "content": [
        "Ryan Mountcastle homered twice and drove in five to lead the Baltimore Orioles to an 11-7, come-from-behind win over the host Kansas City Royals on Tuesday evening.",
        "After the Royals jumped on Tyler Wells (2-1) for three first-inning runs, the Orioles sent 10 batters to the plate in the fourth, scoring five runs.With one out, Mountcastle hammered a first-pitch changeup into the left field bullpen, cutting the Royals' lead to 3-2.The first of James McCann's three hits tied the score before Cedric Mullins delivered a two-run single to give Baltimore a 5-3 lead.In the fifth, Mountcastle followed with another two-run home run, his eighth, expanding the Orioles' lead to 7-3. It was Mountcastle's eighth career multi-homer game and second of the season.Adley Rutschman and Mountcastle added back-to-back RBI doubles in a three-run sixth for a 10-3 advantage. Rutschman collected four consecutive hits.Wells, meanwhile, retired 10 straight after giving up the three runs and completed six innings, allowing four runs on three hits -- all homers -- striking out four while walking three.Baltimore won their 10th come-from-behind game as the Royals lost their 10th straight at Kauffman Stadium.Bobby Witt Jr. broke an 0-for-13 slump with his fifth homer to left-center leading off the Royals' first.One out later, MJ Melendez followed with a two-run shot to right-center, his third, making it 3-0 Royals. It marked the first multi-run, first-inning lead for Kansas City since April 3 -- their only home win to date.",
        "After 10 straight Orioles' runs, Salvador Perez hit a pair of homers, his 15th multi-homer game. His first of the game was a solo shot in the sixth inning. His second homer, a two-run shot in the seventh, was his fifth of the season and capped the Royals' scoring.Ryan Yarbrough (0-4) struck out his first five batters faced, matching a club record to start a game, most recently accomplished by Brady Singer in 2020.It marked the first time in club history a pitcher struck out the side to start a game followed immediately by a Royals' leadoff homer.Yarbrough surrendered five runs on five hits and three walks -- all in the fourth inning - while striking out the five in 3 2/3 innings.--Field Level Media"
    ]
}