{
    "articleURL": "/wires/ap/article-12048527/Arizonas-Laura-Wisconsins-Latu-settle-sex-assault-suit.html",
    "content": [
        "HONOLULU (AP) - Arizona quarterback Jayden de Laura and Wisconsin safety Kamo´i Latu have settled a lawsuit filed by a woman who said the two sexually assaulted her in 2018 after a football game at their Hawaii high school.",
        "A Hawaii circuit court document filed this week said Latu and de Laura reached a settlement with the woman after a mediation process. The amount of the settlement wasn't disclosed.According to the civil complaint, the woman said Latu and de Laura assaulted her in October 2018 on the campus of Saint Louis School, where Latu and de Laura played on the football team. Both players and the woman were minors at the time.The civil complaint says Latu and de Laura pleaded guilty to second-degree sexual assault in family court and had to write letters of apology to the woman, but neither received jail time. The woman then filed the lawsuit in December 2021.Arizona didn´t immediately respond to an email from The Associated Press seeking comment.\"At the time of Wisconsin football student-athlete Kamo´i Latu´s initial enrollment at UW-Madison, the matter being reported involving Latu was not known to UW Athletics officials,\" Wisconsin officials said in a statement. \"As described, the matter relates to Latu when he was a minor and the juvenile records are sealed. Last fall UW-Madison officials became aware of the civil suit filed in the matter.\"Based on the information available to the UW-Madison Office of Legal Affairs and UW Athletics officials, the matter being reported that involved Latu prior to his time as a college student does not violate the UW Athletics Student-Athlete Discipline Policy, university misconduct policies, or reporting or disclosure requirements. Latu remains a member of the Wisconsin football team.\"",
        "Both de Laura and Latu were starters last season.After playing two seasons at Washington State, de Laura transferred to Arizona and completed 62.5% of his passes for 3,685 yards with 25 touchdowns and 13 interceptions. He ranked third in the Pac-12 in yards passing per game (307.1).Latu spent two seasons at Utah before transferring to Wisconsin. He started 12 games for Wisconsin last season and had 55 tackles with two sacks and two interceptions.___AP college football: https://apnews.com/hub/college-football and https://twitter.com/ap_top25"
    ]
}