{
    "articleURL": "/wires/pa/article-12042151/Highlight-training-far-trip-biology-labs-says-UK-astronaut.html",
    "content": [
        "Rosemary Coogan, the UK’s newest astronaut, has spoken about her experience of training to go into space.",
        "Ms Coogan, who began training at the European Space Agency’s astronaut centre in Cologne, Germany, last month, said that it has brought her “a huge amount of enjoyment” and one of the highlights of her training was a “trip to the biology labs”.The agency has its own unit, known as Biolab facility, in the Columbus laboratory on the International Space Station, where astronauts conduct various scientific experiments.Speaking at her first news conference as an ESA astronaut candidate, Ms Coogan said: “The first month of basic training has been extremely varied. I think one of the highlights has been taking the trip to the biology labs, and starting to look at all the different microscopes  Rosemary Coogan, trainee astronaut  “We’ve had a lot of different experts come in and share their knowledge.“But I think one of the highlights has been taking the trip to the biology labs, and starting to look at all the different microscopes – some of which we have on the space station (and) starting to do pipetting of samples in completely sterile environments and (also) trying to imagine – now I think we all are – how that might be in a microgravity environment in the next few years.”An astrophysicist with two master’s degrees from Durham University and an astronomy doctorate from Sussex, Ms Coogan was selected to join the ESA’s astronaut training programme last year, after beating more than 22,500 applicants.",
        "She is training alongside four other astronaut candidates: Sophie Adenot of France; Spain’s Pablo Alvarez Fernandez; Belgian-Luxembourgish engineer Raphael Liegeois; and Marco Sieber, from Switzerland.",
        "If successful, the 32-year-old, who was born in Northern Ireland, will become the UK’s third astronaut, following Helen Sharman, who became the first Briton in space in 1989, and Tim Peake, who went to the space station in 2015.ESA astronauts usually complete a minimum of three to four years of training before flying to space for the first time.Frank De Winne, head of ESA’s European Astronaut Centre, said, if successful, the first ISS mission for one of the astronauts could be as early as 2026, but the aim is to give all five astronauts the opportunity to go to space by the end of the decade.Basic training is the first phase of astronaut training, which takes about 13 months, and includes scuba diving to prepare for spacewalks, rigorous fitness assessments, and getting introduced to the fundamentals of spaceflight.Once basic training is complete, the candidates will become certified astronauts and ready to embark on the second phase, known as pre-assignment training.This includes advanced training in specific areas, such as systems training, vehicle training, robotics, and extra-vehicular activity training or spacewalks.The third and final third phase is mission-specific training, which is tailored to the tasks and experiments that astronauts will perform during their mission.",
        "Last year, ESA also unveiled two other UK citizens: John McFall and Meganne Christian – as new astronaut candidates.Former Paralympian Mr McFall is part of a feasibility study to see if he can fly as a disabled astronaut while Ms Christian is a reserve astronaut who could join the programme if someone else drops out."
    ]
}