{
    "articleURL": "/wires/aap/article-12038589/Winter-crops-ground-growers-advantage.html",
    "content": [
        "Widespread rain across much of Australia's cropping region has given growers a positive start, but record winter crops are unlikely to be repeated.",
        "Good rain in Western Australia, which delivered 39 of the 67 million tonne national record output last year, has seen more growers plant early.Queensland producers are likely to ramp up planting in the next few weeks.\"We're seeing a lot more people have started earlier than usual,\" Rural Bank senior analyst James Maxwell said.\"Seeds are going into good conditions.\"Despite the strong start, Mr Maxwell said long-term forecasts of an El Nino climate pattern, bringing drier weather to Australia, was still expected to deliver lower yields for winter crops.\"We are anticipating that the planted area will be similar to last year, but we certainly don't expect the same yields that we had,\" he told AAP.Wheat and canola production was the highest on record last year, with a near record for barley.The Australian Bureau of Agricultural and Resource Economics and Sciences, ABARES, expects the combined value of wheat, barley and canola to drop by as much as a third this year.While planting conditions have been ideal for winter growers, Rural Bank doesn't expect any records to tumble.\"Lower global and local canola prices mean a record plant is unlikely to be repeated,\" Mr Maxwell said.China has confirmed it will review import restrictions on Australia barley, but its signal came too late for some producers.",
        "\"When the announcement came a couple of weeks ago, people would have already been planting or already on the cusp of planting,\" Mr Maxwell said.International trade researcher Tim Harcourt said the review would likely help both the Chinese and Australian markets.\"Sanctions really hit the Chinese consumer pretty hard,\" Professor Harcourt said.\"It's likely that some of those restrictions are going to ease because China has to get its economy running after their significant lockdown.\""
    ]
}