{
    "articleURL": "/wires/reuters/article-12059325/Austrian-billionaires-jewels-seen-fetching-150-mln-auction.html",
    "content": [
        "Collection valued at record $150 million",
        "Collector's husband bought Jewish businesses sold under duressProceeds to be donated to charityBy Gabrielle Tétrault-Farber and Denis BalibouseGENEVA, May 8 (Reuters) - The 700-piece private jewellery collection of the late Austrian billionaire Heidi Horten, the world's largest and most valuable collection of its kind to come to auction, could sell for more than $150 million, Christie's said on Monday.Some of its most spectacular pieces include the 90-carat \"Briolette of India\" diamond necklace by Harry Winston, and the \"Sunrise Ruby\" and diamond ring by Cartier that is worth up to an estimated $20 million.The collection, acquired between the early 1970s until Horten's death last year, is also comprised of more than 100 Bulgari pieces.Horten's collection is set to exceed the record sales at Christie's for Elizabeth Taylor's collection in 2011 and the Maharajas &amp;amp; Mughal Magnificence auction in 2019, the only two jewellery collections to have garnered more than $100 million.Christie's said the estate proceeds of the auctions would go towards the Heidi Horten Foundation, which supports charitable causes including in the fields of health care and child protection.Before agreeing to auction the collection, Christie's said it had considered the business practices of Mrs Horten's late first husband, German department store tycoon Helmut Horten, who during the Nazi era \"purchased Jewish businesses that were sold under duress.\"",
        "\"What's important is that we have been completely transparent,\" Rahul Kadakia, international head of jewellery at Christie's, told Reuters.\"We are selling this collection in its identity with the name Horten. It's not being sold as an anonymous collection.\"Christie's said it would make a \"significant contribution\" from its final proceeds to Jewish organisations to advance Holocaust research and education. It did not disclose the amount.\"Of course we cannot erase history,\" said Max Fawcett, head of the jewellery department at Christie's in Geneva.\"But we hope that the funds from this sale will go to do good in the future.\"Christie's will auction 400 pieces in Geneva on Wednesday and Friday and hold an online sale. It will hold a second online sale for the remainder of the collection in November. (Reporting by Gabrielle Tétrault-Farber and Denis Balibouse Editing by Mark Potter)"
    ]
}