{
    "articleURL": "/tvshowbiz/article-12058525/Vanderpump-Rules-star-Tom-Schwartz-spotted-drinking-beers-popular-bar-Australia.html",
    "content": [
        "Vanderpump Rules star Tom Schwartz is currently in Australia where he will be appearing as a contestant on an upcoming reality series, Stars on Mars.",
        "And on Sunday, the handsome bar owner, 40, visited a popular bar in Sydney where he enjoyed some cocktails and a lively musical performance.The Minnesota native shared a photo of The Baxter Inn's menu and a large drink he was having at the bar, and expressed his appreciation with a fire emoji. The reality star later went back to his hotel room and posted a picture of some  goodies he had purchased Down Under -  Australian vodka, Tim Tams and green olives.Schwartz is one of a dozen famous faces announced as contestants on the upcoming reality show Stars on Mars, which will see celebs compete in a simulation of the Red Planet. ",
        "The series is hosted by Star Trek actor and real life intergalactic adventurer, William Shatner.It will be filmed in Coober Pedy, South Australia, which is internationally renowned for its underground houses and jaw-dropping red desert landscapes.His trip Down Under comes at the perfect time for Tom, who for the last few months has been embroiled in the drama resulting from friend and business partner Tom Sandoval's headline-making split from Ariana Madix amid his affair with Raquel Leviss. ",
        "Schwartz has publicly supported Sandoval in the wake of the scandal.He appeared on Watch What Happens Live last month to defend his friend and pledge to stand by his side amid his descent into reality TV villainy for his infidelity.",
        "'Tom, I know the whole world hates you, but I'm not gonna abandon you, old buddy,' Schwartz said.",
        "Schwartz said of Sandoval: 'He knows he's a monster for what he did. If you see him, give him a hug. Maybe he doesn't deserve it, but give him a hug. He's down bad.'He said in the appearance on the Bravo chat show, 'I'm not trying to evoke any sympathy for Tom, he knows what he did was disgusting. He knows he could not have handled that affair any worse.'Schwartz said that while he understands the anger against Sandoval, 'The vigilantism is getting a little out of control.'I want to remind people to take a breath. He knows what he did was terrible, so does Raquel. But the threats are getting out of control.'"
    ]
}