{
    "articleURL": "/wires/ap/article-12042237/WWE-1Q-results-Street-N-America-ticket-sales-climb.html",
    "content": [
        "WWE, which is joining with the company that runs Ultimate Fighting Championship to create a $21.4 billion sports entertainment company, saw a drop in its revenue and profit in the first quarter but still managed to top Wall Street's view.",
        "Last month Endeavor and World Wrestling Entertainment announced that a new publicly traded company will house the UFC and WWE brands, with Endeavor Group Holdings Inc. taking a 51% controlling interest in the new company. Existing WWE shareholders will hold a 49% stake.The companies put the enterprise value of UFC at $12.1 billion and WWE´s value at $9.3 billion. The deal is expected to close in the second half of the year.In the first quarter, WWE reported its revenue declined to $297.6 million from $333.4 million.The company said Wednesday that the drop in revenue was mostly due to a shift in the timing of an international event. That was partly offset by increased revenue related to the contractual escalation of media rights fees for WWE's weekly shows, Raw and SmackDown, and increased ticket sales in North America.While revenue fell, it still topped the $285.5 million that analysts polled by Zacks Investment Research were calling for.",
        "Stamford, Connecticut-based WWE earned $36.7 million, or 43 cents per share, for the three months ended March 31. That compares with $66.1 million, or 77 cents per share, in the prior-year period.Removing one-time costs, earnings were 50 cents per share. The results beat the 42 cents per share that Wall Street expected.",
        "Shares dipped about 1.6% before the market open on Wednesday.Viewership for Raw and Smackdown both rose 7% in the quarter, while revenue from North American live events ticket sales surged 52% from a year earlier.WWE's biggest premium live event of the year, WrestleMania, took place just after the first quarter ended.\"WrestleMania, as well as our other successful premium live events such as Royal Rumble and Elimination Chamber, and strong viewership for our weekly flagship programs, Raw and SmackDown, further expanded the reach of our brands and enhanced the value of our content,\" CEO Nick Khan said in a statement.The company also disclosed Wednesday that during the first quarter it incurred $1.7 million of expenses paid by Vince McMahon for plaintiffs´ attorneys´ fees in connection with a shareholder lawsuit that was mooted. WWE said other shareholder litigation remains ongoing.McMahon, executive chairman at WWE, made a $17.4 million payment to WWE during the quarter to reimburse the company for costs incurred and paid by WWE through Jan. 31 related to an investigation conducted by a special committee in regards to revisions to WWE´s financial statements and other matters."
    ]
}