{
    "articleURL": "/wires/aap/article-12052049/Ban-makes-things-harder-form-Nanai-Payten.html",
    "content": [
        "North Queensland coach Todd Payten concedes Jeremiah Nanai's suspension has come at just the wrong time for the Maroons representative, who is itching to play himself back into form following a slow start to 2023.",
        "Nanai will spend four weeks on the sidelines after flooring Cronulla prop Braden Hamlin-Uele with a hip-drop tackle in the Sharks' 44-6 demolition of the Cowboys last Thursday.The suspension is the latest blow for Nanai, who has been underwhelming in 2023 after breakout campaign that earned him selection in all three State of Origin games and the Australian World Cup team last year.Twenty-four tries have come down Nanai's right edge this season and while he made a name for himself as a try-scoring wizard last year, the back-rower has crossed the line only once outside of his double against Brisbane in round two.Speculation might have been that some time on the sidelines would allow Nanai to take stock and plot a return to form but Payten predicted the suspension could have the opposite effect.\"It's very hard to find a groove when you're not playing footy,\" he said.\"It's going to be difficult for him, I know he's not happy and he's been a little bit inconsistent.\"The best way to get that back is out on the pitch and at the moment, he's only getting training reps in.\"With the chopping and changing, we need to get the reps into the guys that are playing for us each week, so it's a bit of a catch-22 for him.",
        "\"My message to him is to keep his head down. He's got to work hard, he's got to maintain his fitness and our high performance guys will be going pretty hard at him over this next month.\"Nanai's loss is Heilum Luki's gain.An ACL injury cut Luki's season short as Nanai enjoyed a meteoric rise last year and he was sidelined with a hamstring injury in April only three games into his return.The Magic Round clash against the Sydney Roosters on Sunday will be Luki's first game since round five and provides the 22-year-old with a chance to impress in Nanai's absence and help the Cowboys tighten their right edge up in defence.\"We're looking forward to having him back in the team and obviously providing a bit of punch out to us on an edge,\" Payten said.\"Fingers crossed that we can keep him on the field for an extended period now.\"Halfback Chad Townsend is a good chance of playing against the Roosters despite a calf injury forcing him from the field with 30 minutes remaining against Cronulla.The Cowboys' 10-day turnaround gives him the best chance of recovering but the premiership winner will need to pass a fitness test on Saturday in order to play.\"Things are looking positive with Chad,\" Payten said.",
        "Ben Hampton is expected to come into the side if Townsend is unavailable."
    ]
}