{
    "articleURL": "/wires/ap/article-12048679/Orioles-blow-7-run-lead-rally-13-10-win-Royals.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - The Baltimore Orioles have come from behind for 11 of their 21 wins this season.",
        "Their victory Thursday in Kansas City was a little unique.The Orioles raced to a seven-run lead before watching the Royals wipe it out, then pull ahead in the seventh inning. But once more embodying poise under pressure, Ramon Urias hit a go-ahead, two-run single in the eighth inning and added a two-run double in the ninth, allowing Baltimore to escape with a 13-10 victory and its seventh straight series win.\"We fight. We fight every game\" said Urias, who entered as a pinch hitter. \"Every guy is involved with what we're doing.\"That includes Gunnar Henderson and Anthony Santander, who hit homers, and Cedric Mullins, who had a bases-loaded double that helped the Orioles run out to an 8-1 lead by the bottom of the third inning.The Royals fought back and pulled ahead on Bobby Witt Jr.'s single in the seventh, but Aroldis Chapman (1-2) promptly walked the first two batters in the eighth. Adam Frazier moved up on a balk and joined Jorge Mateo in stealing bases before Urias hit a single through the left side of a drawn-in infield to give the Orioles the lead again.",
        "Yennier Cano (1-0) pitched two scoreless innings for Baltimore, one of the few solid outings by a reliever. Felix Bautista coughed up a run in the ninth before striking out Witt and Hunter Dozier to end the game with runners at second and third.",
        "\"The offense did a great job, especially starting off the game,\" said Orioles starter Grayson Rodriguez, who allowed six runs in 3 2/3 innings. \"This team has a lot of fight in it.\"Freddy Fermin hit his first career homer, Salvador Perez added a two-run shot and Kyle Isbel went deep for Kansas City before his tying bunt in the seventh inning, when he beat out the throw but strained his hamstring crossing the bag.He was undergoing an MRI exam after the game, adding injury to another insulting loss for the Royals.\"Somebody has to take it,\" Royals manager Matt Quatraro said of the back-and-forth game. \"They did.\"The Orioles jumped to their big early lead by capitalizing on mistakes.The first came when Ryan Mountcastle hit a high two-out popup down the right-field line in the first inning. Three Royals converged on it, but MJ Melendez, who has stopped catching so he can focus on playing the outfield, was unable to make the basket catch. Santander followed the error with his homer off Jordan Lyles over the right-field wall.In the third, Lyles loaded the bases on a single, walk and hit batter before Mullins cleared them with a double.Then in the fifth, after Lyles once again got the first two outs, he walked Frazier and uncorked a wild pitch that led to Mateo's run-scoring single. Henderson followed with his two-run shot to give Baltimore its 8-1 lead.",
        "Rodriguez served up Fermin's leadoff homer in the third and another to Perez, the 100th for the veteran catcher at Kauffman Stadium, moving him into a tie with Mike Sweeney and trailing only George Brett for the most in club history.In the fourth, Isbel went deep before Vinnie Pasquantino followed Fermin's first career triple with a run-scoring single that pulled the Royals within 8-6. They got within a run in the fifth on Michael Massey's double, Isbel tied the game in the seventh on his bunt, and Witt drove in the go-ahead run for Kansas City two batters later.TRANSACTIONSOrioles manager Brandon Hyde said C Luis Torrens, acquired from the Chicago Cubs on Wednesday, will likely join the team \"sometime this weekend,\" when they play a series in Atlanta.TRAINER'S ROOMOrioles LF Austin Hays was out of the starting lineup for the second straight day, though Hyde said he was available off the bench. Hays has been dealing with a sore right middle finger. Kyle Stowers again took his place.UP NEXTThe Orioles face the Braves with RHP Dean Kremer (2-1, 6.67 ERA) on the mound for Friday night's opener. The Royals remain at Kauffman Stadium fora three-game set against Oakland with RHP Brad Keller (2-2, 3.56) getting the Friday night start.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}