{
    "articleURL": "/news/article-12051721/Biden-promotes-Neera-Tanden-policy-post-moves-past-tweets.html",
    "content": [
        "Tanden serves as Biden's staff secretary and senior advisorHer nomination to run the OMB blew up over her past tweetsSusan Rice is departing the post after two years President Joe Biden has elevated Neera Tanden to serve as his domestic policy advisor following the departure of Susan Rice – as the White House aide puts her slashing tweets about Republicans in the rear view mirror.",
        "The tweets – which included calling Sen. Mitch McConnell 'Voldemort' and Sen. Susan Collins 'the worst,' helped doom her nomination to head the White House budget office.Her online missives rankled influential Sen. Joe Manchin (D-W.Va.), and helped kill the nomination, which required Senate confirmation. The former president of the Center for American Progress had also written that 'Vampires have more heart than Ted Cruz.'When that nomination collapsed in 2021, Biden nominated Tanden to serve as senior advisor and staff secretary – an influential post that put her at the heart of virtually all major issues inside the White House. ",
        "Tanden previously served as an advisor to Presidents Barack Obama and Bill Clinton. Rice is departing her post after two years on the job, a tenure the White House said she had pledged.",
        "'For over two years, Susan Rice has helped craft and implement my domestic policy agenda and our country owes a debt of gratitude for her history-making public service,' Biden said in a statement released by the White House.'I am pleased to announce that Neera Tanden will continue to drive the formulation and implementation of my domestic policy, from economic mobility and racial equity to health care, immigration and education.Biden named Stefanie Feldman will fill Tanden's post as staff secretary. She is currently a member of the domestic policy staff. ",
        "Zayn Siddique is being promoted to principal deputy of the Domestic Policy Council.Rice previously served as National Security Advisor under Obama and as UN ambassador. Her departure also followed blowback over how the administration coped with arrivals of immigrant children at the border and reports on their exploitation in the workforce. The White House said it was unrelated."
    ]
}