{
    "articleURL": "/tvshowbiz/article-12058335/American-Idol-Alanis-Morissette-Ed-Sheeran-steal-judges-perform.html",
    "content": [
        "The season 21 episode featured the top eight singers who were tasked with performing an Alanis song and also singing a duet to one of Ed's songs  Alanis, 43, and Ed, 32, stepped in for Katy Perry, 38, and Lionel Richie, 73, who were both in England taking part in King Charles III coronation events King Charles III and Queen Camilla made a surprise remote appearance during the season 21 episode along with Lionel and KatyAlanis Morissette and Ed Sheeran stole the show as they filled in as judges on Sunday's episode of American Idol and also performed during the two-hour episode.",
        "The season 21 episode featured the top eight singers who were tasked with performing an Alanis song and also singing a duet to one of Ed's songs.Alanis, 43, and Ed, 32, stepped in for Katy Perry, 38, and Lionel Richie, 73, who were both in England taking part in King Charles III coronation events.  King Charles and Queen Camilla also made a surprise virtual appearance on the ABC show with Katy and Lionel. British singer Ed and Alanis were both excited to fill in and mentor the remaining contestants who performed before three were eliminated. Warren Peay, 24, an appliance repairman from Bamberg, South Carolina, was the first contestant of the episode. He met with Alanis and talked with her about being nervous during some of his past performances. When he picked her song All I Really Want, Alanis encouraged him to relax and be more free.",
        "'Warren's vocal tone is very strong,' Alanis said. 'If Warren takes some of the revelations from today. And he creates this range for himself; it's no holds barred for him.'After he finished, Alanis thanked him for doing a different version of her song and adding to it.'This is a version I have never imagined ever hearing in my whole career so thank you for adding to it and blossoming,' Alanis said.",
        "'I thought you really shined,' Sheeran said.Zachariah Smith, 20, a grill cook from Armory, Mississippi, went next and told Alanis that he planned to sing her hit Ironic.'Your voice is beautiful,' Alanis said. 'It's like an angel.''I hope that I do this song justice,' Zachariah said.The crowd cheered for him when he finished.",
        "'I loved that song and I just think you rocked it,' Ed said. 'I think your voice is super, super powerful and I was captivated by the whole thing.''It was a really great performance,' Luke Bryan, 46, said.Iam Tongi, 18, a high school student from Kahuku, Hawaii, and Oliver Steele, 25, a musician from Mount Juliet, Tennessee, took the stage together to perform a duet of Ed's song Photograph. When they finished, host Ryan Seacrest, 48, asked Sheeran for his thoughts.'That was so beautiful to listen to,' Ed said. ' Both of your tones fit so well together.''I was just really moved,' Alanis said.'Great job,' Luke said. 'It had beautiful harmonies.'Haven Madison, 17, a high school student from Clarksville, Tennessee, sat down with Alanis to discuss her song You Learn. Haven said she was encouraged by Alanis to be herself.",
        "'I was really impressed vocally,' Ed said after Haven's performance. 'It was nuts.'",
        "'Great performance, I loved seeing everything about it,' Luke said.Warren and We Ani, 24, a performer from Harlem, New York, took the stage together to perform an emotional cover of Ed's song Perfect.'I'm just loving these renditions,' Ed said when they finished. 'Really, really cool. I love both of your voices.''Beautiful,' Alanis said.'So fun watching you both blossom individually and then come together and really do something pretty special,' Luke said. 'That was great guys.'Ryan checked in with Katy and Lionel  who were in London for King Charles III coronation events.'Everybody's doing such great jobs,' Katy said. 'I think mostly that's because they have such great songs to actually choose from. They sound so wonderful for the Alanis songs and so wonderful with the Ed songs. Thank you so much for taking our jobs.'",
        "Ryan asked Lionel if he was staying out of trouble. Lionel showed them that he had learned a new wave during his time at the coronation. Ryan asked them how things were going.'The English know how to party. Right, Ed?,' Katy said.'Yeah, we do,' Ed agreed.'All we can reveal without revealing is that they fell asleep,' Lionel said.Katy laughed.'Well, we are going to party all night long,' Katy said.",
        "Colin Stough, 18, an HVAC technician from Armory, Mississippi, picked Alanis' song Hand In My Pocket. Alanis encouraged him to make his performance 'imperfect.'",
        "'Beautiful work,' Alanis said afterward.'I love how it rocked out at the end but also how it had a different spin at the beginning,' Ed said. 'Obviously it's a song that everybody knows but you are doing it in your own way and then rocking out.'Alanis then took the stage herself and performed her hit Thank You. The crowd gave her a standing ovation. Ryan asked her what it was like to mentor the contestants.'I've had people in my life who supported me, coached me, gave me feedback that I actually wanted versus the onslaught of unsolicited feedback that people get and so it's me paying it forward to support people,' Alanis said.Alanis said she was also going on a world tour.Haven and Zachariah then performed Ed's hit Thinking Out Loud that was recently the subject of a federal copyright infringement lawsuit.'I usually find when people who cover my songs they usually sing better than I do,' Ed said. 'It was really soulful, really powerful. I really really enjoyed it. You both are so talented.''I loved it,' Alanis said.",
        "'Good vibes all the way around, great job,' Luke said.",
        "Megan Danielle, 21, a server from Douglasville, Georgia, picked Alanis' hit Head Over Feet to perform. Alanis encouraged her to be more vulnerable in her performance.'Just really soulful,' Alanis said when she finished. 'Gorgeous.''I was really, really impressed,' Ed said.'You nailed that and your voice makes this happen naturally,' Luke said.Ed then took the stage and played a new acoustic version of Eyes Closed from his  new studio album Subtract. Ed played guitar and sang the entire time with his eyes closed. Ryan noted that Ed just kicked off his tour and asked him how it felt to perform his songs on stage.'It's never lost on me coming to America and people are still interested in it. Being an English artist, America is always like this holy grail where a lot of people try and a lot of people fail,' Ed said. 'To be able to still come over here and play like Dallas Cowboy stadium last night is pretty cool. I'm really happy to be back.''We are glad you are back,' Ryan said.Ryan asked him also why he decided to make his documentary The Sum of It All that was now streaming on the Disney+ service.",
        "'I said yes to making a documentary on the making of the album, the music videos and while they were filming it stuff just started unravelling in my life. And I think they were secretly happy about that,' Sheeran said. 'It wasn't the documentary I was intending to make, but I think it's a lot more human. It's not a music documentary, it's more life.'",
        "Iam went next with his solo performance of Alanis' hit Guardian that he dedicated to his mother Lily. Alanis said she was almost brought to tears by him singing it to her.The crowd chanted his name when he finished.'The empathy in your voice,' Alanis said. 'You have this velvety voice and the planet I believe needs empathy now more than ever.''I just felt like you really connected with the song and it makes us listeners really connect with it,' Sheeran said. 'It was just really beautiful.''Great job, man,' Luke said.We performed Alanis' song Uninvited.'It was chilling to behold you,' Alanis said when she finished.''It's very very powerful and super good,' Sheeran said.",
        "'That was certainly the best I've ever heard it,' Luke said compared to the other times he had heard contestants sing this song.Colin and Megan sang a duet of Sheeran's hit song Dive. Sheeran applauded them when they finished.'You complement each other so well and it's really, really great,' Sheeran said.'It is definitely a trip to hear our songs sung back to us,' Alanis said. 'And I'm loving Ed's songs through you each.'Katy told Alanis from England that she was a life long fan of her music.'She is the reason why I exist as a musician,' Katy said.Oliver closed out the episode with one of Alanis' biggest hits You Want To Know.",
        "'Oliver brought in a masculine vulnerability that a lot of men are told they can't feel,' Alanis said after helping him by holding up the lyrics as he sang.'This song is coming from a place of anger and rage and it's a side of me that I have not represented yet,' Oliver said.Oliver ripped off his hat when he finished to show that he shaved his head.'Let's go,' Oliver said.'You really brought it,' Alanis said. 'Pride is an interesting thing, I barely know you but I'm proud of you.''I felt it,' Sheeran said. 'I feel like you conveyed the emotion really well. I thought it was a really entertaining performance.'",
        "'I really love the intensity of what you just did. It was awesome,' Luke said.At the end of the night, after the votes had been tabulated, Ryan announced that Zachariah, Megan, Iam, We, and Colin were voted on to be in the top five. They each excitedly ran off the stage.Waren, Haven, and Oliver were eliminated from the competition.American Idol will return Sunday on ABC."
    ]
}