{
    "articleURL": "/wires/reuters/article-12051359/French-Spiderman-crawls-Barcelona-skyscraper-climate-action.html",
    "content": [
        "By Horaci García and Albert Gea",
        "BARCELONA, May 5 (Reuters) - An urban stunt climber known as the \"French Spiderman\" for his daring ascents conquered another landmark by scaling a 166-metre (381-foot) Barcelona skyscraper on Friday in a bid to raise awareness about climate change and drought.Sixty-year-old Alain Robert crawled up the exterior of the glass and steel-covered Melia Barcelona Sky Hotel, the Spanish city's fourth-tallest building, with just a bag of powdered chalk and climbing shoes to aid his ascent.\"I would like to pass on a message on climate change and the problem of soil dehydration in Spain (for it) to be resolved quickly\" by the government, he said after reaching the rooftop. The climb was not authorised and police detained him at the top.Spain is facing a persistent drought and parts of southern Europe are in the grips of unseasonably warm temperatures that scientists say have been exacerbated by global warming.Before the climb, Robert told Reuters the structure was \"quite aggressive\", and half-joked that he would be feeling the effects of climate change and drought himself due to the heat.He draped his fingers with climbing tape to prevent burns from the sizzling surface - heated by strong sunshine even through the maximum temperature in Barcelona on Friday was a relatively balmy 23 Celsius (73.4 Fahrenheit).",
        "Dozens of onlookers gathered outside, craning their necks to catch a glimpse of Robert, sporting a bright-red suit and a cap, as he made his way upward in about half an hour.Robert began climbing in 1975 on the cliffs near his hometown of Valence. Two years later, he took up the high-risk \"free solo\" feats, climbing alone and unaided by ropes or harnesses.Since then, he has climbed more than 150 structures including the world's tallest building, Dubai's Burj Khalifa, Paris' Eiffel Tower and San Francisco's Golden Gate Bridge. (Reporting by Horaci García and Albert Gea Writing by David Latona and Elena Rodríguez Editing by Andrei Khalip and Frances Kerry)"
    ]
}