{
    "articleURL": "/wires/pa/article-12046139/Senedd-probe-Wales-Covid-response-Labour-Tory-deal.html",
    "content": [
        "The Welsh Government has announced plans to set up a special Covid-19 inquiry committee to further scrutinise its handling of the pandemic following a surprise Labour-Tory deal.",
        "In a joint motion, tabled on Wednesday night, Welsh Labour and the Welsh Conservatives proposed establishing a Wales Covid-19 Inquiry Special Purpose Committee to examine the reports published by the UK Covid-19 Inquiry.Given the green light, the committee’s job would be to identify any gaps “in the preparedness and response of the Welsh Government and other Welsh public bodies during the Covid-19 pandemic that should be subject to further examination”, the motion said.It follows a long-standing row over whether Wales should hold a public inquiry into its own pandemic response.",
        "The Welsh Tories and Plaid Cymru have made repeated calls for such an inquiry, but a joint motion submitted by the opposition parties last November was unanimously voted down by Labour.This latest agreement has reportedly come after a “series of meetings” were held between First Minister Mark Drakeford and the leader of the Welsh Conservatives Andrew RT Davies.The Welsh Tories said they welcomed the “halfway-house” compromise, but said they would not give up on their calls for a full public inquiry.Labour said it was right that the decisions it took are “openly and properly scrutinised”.The UK Covid-19 Inquiry, chaired by Baroness Hallett and set up to examine the UK’s response to the pandemic, intends to hold three weeks of public hearings in Wales in February next year.",
        "Bereaved families and campaigners have raised concerns that the short amount of time set aside for the Wales portion of the inquiry will mean the actions of the Welsh Government are not fully scrutinised.A Welsh Government spokesperson said: “The pandemic touched the lives of everyone in Wales, especially those many families who lost a loved one. It is right that the decisions taken by the Welsh Government and Welsh public bodies are openly and properly scrutinised.",
        "“We continue to believe the best way to do that is through the UK Covid-19 inquiry.“However, as the UK Covid-19 Inquiry moves through each of its modules, this special purpose committee will allow the Senedd to determine whether there are any gaps in relation to Wales’ preparedness and response and whether further and specific scrutiny needs to be undertaken.”Mr Davies said: “During the Covid-19 pandemic, Mark Drakeford and the Labour Government continuously chose to diverge from the decisions being made at a UK-wide level. It’s vitally important that these decisions are scrutinised.“The Welsh Conservatives have been pushing for an Independent Welsh Covid inquiry, to cover all bases and ensure that bereaved families get the answers they deserve. We will not give up on our calls to ensure this takes place.“I’m hopeful that by securing this committee will go some way in achieving this.”",
        "Plaid have welcomed the news but called the manner by which the agreement came “bizarre”, and suggested it was a “stitch-up”.A vote on the motion will take place in the Plenary at the Senedd on Tuesday May 16.If passed, the committee’s reports and recommendations will be debated in the Senedd."
    ]
}