{
    "articleURL": "/wires/reuters/article-12049501/Upstart-Os-hit-road-face-NL-East-leading-Braves.html",
    "content": [
        "Two of the winningest teams in the major leagues will go head-to-head for the first time since 2021 when the Baltimore Orioles visit the Atlanta Braves to begin a three-game series on Friday.",
        "The Braves have the best record in the National League and are coming off a three-game road sweep of the Miami Marlins. Atlanta has won eight of its last 10 games.The Orioles have the second-best record in the American League behind Tampa Bay. Baltimore took two of three against Kansas City in its last series and has won 13 of its last 16.In their last meeting in 2021, the Braves enjoyed a three-game sweep in Baltimore.The series opener features Atlanta left-hander Max Fried (2-0, 0.45 ERA) against Baltimore right-hander Dean Kremer (2-1, 6.67).Fried, who was second in 2022 NL Cy Young voting, has been masterful. After leaving the season opener with a hamstring strain, Fried has returned to throw 16 2/3 scoreless innings over his last three starts. In his most recent appearance -- last Friday at the New York Mets -- Fried pitched five shutout innings and allowed three hits and one walk while striking out a season-high seven in a game that was shortened by rain.Fried has one career appearance against Baltimore, throwing a four-hit shutout with four strikeouts in that 2021 series. Fried had been scheduled to face the Miami Marlins on Thursday but had his start pushed back a day.Kremer will make his seventh start of the season and his first career start against the Braves. He is coming off a loss to Detroit last Saturday that saw him allow five runs on 11 hits, two walks and six strikeouts in five innings.",
        "\"So far it's been frustrating,\" Kremer said. \"I feel like my stuff is continuously getting better, command of it also slowly getting better, but just got to find a way to miss more barrels.\"Baltimore manager Brandon Hyde added, \"I just didn't think he was commanding it like he wanted to.\"The Atlanta offense remains hot, outscoring the Marlins 26-9 in the three games. During the sweep Ozzie Albies hit .643 (9-for-14) with four doubles and two homers, and Marcell Ozuna went 6-for-13 with three homers and six RBIs, which raised his batting average from .085 to .153.\"These guys are pretty special and I think it's only the beginning of something special,\" Atlanta reliever A.J. Minter said. \"Everyone is clicking and I feel like we haven't hit our stride yet.\"Baltimore scored 24 runs in the three games with Kansas City -- despite getting shut out on Wednesday. Anthony Santander went 6-for-14 against the Royals and has four multi-hit efforts in his last five games. Ryan Mountcastle has reached base safely in 13 straight games, matching the team high for this season. Adley Rutschman is batting .299 and is the first Oriole to reach base 58 times in the first 30 games of a season since Manny Machado did it in 2018.",
        "Atlanta placed pitcher Kyle Wright on the injured list with right shoulder inflammation, the same issue that prevented him from opening the season with the team. Dylan Dodd was recalled as a replacement and beat the Marlins in the series finale Thursday.Braves outfielder Ronald Acuna Jr., the NL player of the month for April, left Thursday's game after fouling a ball off his knee, but the team said after the game that Acuna would be fine.--Field Level Media"
    ]
}