{
    "articleURL": "/wires/ap/article-12061403/Alabama-sets-execution-state-resumes-lethal-injections.html",
    "content": [
        "MONTGOMERY, Ala. (AP) - The Alabama Supreme Court has authorized the execution of an inmate this summer as the state attempts to resume lethal injection s following a series of troubled executions.",
        "The Alabama Supreme Court last week issued a death warrant for James Barber, 54, authorizing the state to carry out his execution sometime after June 2. It is the first execution scheduled in the state after Gov. Kay Ivey paused executions last year to conduct an internal review. The exact date of the execution will be determined later, under new rules established during the review.\"According to the Alabama Supreme Court´s order, the execution time frame set by the governor must begin sometime after Friday, June 2, 2023, and Governor Ivey will work with the Alabama Department of Corrections to establish this time frame,\" Ivey spokeswoman Gina Maiola wrote in an email.Barber was convicted of the 2001 beating death of 75-year-old Dorothy Epps. Prosecutors said Barber, a handyman who knew Epps' daughter, confessed to killing Epps with a claw hammer and fleeing with her purse. Jurors voted 11-1 to recommend a death sentence which a judge imposed.Ivey in November ordered the Alabama Department of Corrections to conduct an internal review of execution procedures after the state called off two lethal injections because of difficulties establishing IV access and another execution was delayed for several hours because of IV line problems.Ivey rejected calls by several groups to have an outside group, or person, conduct the review. Faith leaders and other groups cited the example of Tennessee Gov. Bill Lee, who authorized an independent review after acknowledging that the state failed to ensure its lethal injection drugs were properly tested.",
        "Ivey announced in February that the state would resume executions. Corrections Commissioner John Hamm said then that prison system is adding to its pool of medical professionals, ordered new equipment and has conducted rehearsals. The Alabama Supreme Court also changed procedures to give the state more time to carry out a death sentence. Previously, the court issued a death warrant authorizing the state to carry out the execution on a single day.The letter cited the May 2022 example in Tennessee where Gov. Bill Lee authorized a third-party review of its procedures after acknowledging the state failed to ensure its lethal injection drugs were properly tested. A former U.S. attorney took over the review and found the state had not complied with its own lethal injection procedure ever since its revision in 2018, resulting in seven executions from 2018 to 2022 that did not follow the state´s protocols."
    ]
}