{
    "articleURL": "/news/article-12039983/Who-Kevin-Costners-wife-Christine-Baumgartner-divorcing.html",
    "content": [
        "Christine Baumgartner, 49, called it quits from her Hollywood heartthrob husband Kevin Costner on Monday Baumgartner and Costner were married for 18 years and shared three children together, ages 12 to 15 On the divorce papers, Baumgartner claimed 'irreconcilable differences' and requested joint custody Kevin Costner's wife called it quits after 18 years of marriage, as the Yellowstone actor claimed he didn't want their love to end. ",
        "Christine Baumgartner, 49, filed for divorce on Monday after tying the knot to Costner, 68, in 2004.The two led a private life, and one of the last public appearances they made together was at the Academy Awards in March 2022.But who is Christine Baumgartner? DailyMail.com breaks down the life of Costner's second wife and her life with the actor leading up to the heartbreaking split.",
        "Who is Christine Baumgartner?Baumgartner is a model and fashion designer with expertise in handbags. She launched her own business known as Cat Bag Couture in the early 2000s with her friend Tamara Muro. Her collection, which initially consisted of laptop bags, was commonly available near the sprawling ranch she lived at with Costner in Aspen, Colorado.Speaking about the early days of her career in a 2005 interview with the Denver Post, she recalled Costner being a 'supportive' in her career aspirations. 'When I came up with some samples, I showed them to Kevin, and he said they were beautiful and amazing,' she told the news outlet.'He told me I should take it to the next step and he’d help me. I’ve always loved fashion and style, and if you can mix it with function, it’s perfect.'",
        "Where did they meet?Baumgartner and Costner initially met in the 1990s when the Hollywood Heartthrob was filming the 1996 film Tin Cup alongside Rene Russo on a golf course.",
        "At the time, The Bodyguard actor was married to his first wife, Cindy Silva - but they rekindled their spark once Costner and Silva divorced in 1994 after about 16 years of marriage. Silva and Costner share three kids together: Anne, Lily and Joe.In a 2003 interview with PEOPLE, Costner recalled running into Baumgartner at a restaurant in 1999.'We exchanged numbers, and I told her that I would – did she mind if I called her in two weeks. I did not realize that was like an insult to a woman,' he told the news outlet.It wasn't long until the two started dating. ",
        "Why are they divorcing?The divorce papers filed by Baumgartner listed the reason for the split due to 'irreconcilable differences.' She also requested split custody of the three kids she shares with the actor: Cayden, 15, Hayes, 14, and Grace, 12.Heartbroken Costner filed his response to the divorce Tuesday, and he is also seeking joint custody of their children. A representative for Costner claimed the divorce was out of the actor's hands and 'beyond his control.' 'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action,' the statement read. 'We ask that his, Christine's and their children's privacy be respected as they navigate this difficult time,' the statement concluded.",
        "Baumgartner is not said to be filing for spousal support, with Costner's response filed by Laura Wasser.'Spousal support to be payable to petitioner pursuant to the terms of the parties' Premarital Agreement,' Wasser said, indicating there is a pre-nuptial agreement between Costner and Baumgartner.How many kids do they have?The broken pair share three kids together - Cayden, 15, Hayes, 14, and Grace, 12.They welcomed their first born Cayden in 2007. Two years later in February 2009, they had Hayes. It appeared Baumgartner and Costner couldn't keep themselves off of each other because a year later, in 2010, the two had Grace.",
        "When was their last public appearance? Baumgartner and Costner were last seen linked at the Academy Awards in 2022. The two were seen gleaming on the red carpet - a photo the actor later shared on social media.'How beautiful is my date?' Costner wrote on Instagram in March 2022. The picture was the last shot Costner posted with his wife.In January, the two were supposed to attend the 2023 Golden Globes. But their appearance was canceled amid the catastrophic floods in California. 'Nobody’s sadder than us that we can’t be there at the Golden Globes,' Costner, who was nominated for best actor for his role in Yellowstone, wrote on Instagram.",
        "'Chris had a beautiful dress, I was looking forward to walking down the red carpet with her.The actor claimed his wife made the award night special for him despite not being able to attend. 'She went out and bought me some gold and yellow and black and silver balloons, and so we’re gonna [watch] the television and see what happens,' Costner wrote. "
    ]
}