{
    "articleURL": "/wires/ap/article-12042913/Aid-officials-say-Syria-conditions-dire-months-quake.html",
    "content": [
        "Three months after a massive earthquake hit Turkey and Syria, living conditions remain dire in Syria's rebel-held northwest, aid officials who visited the region said Wednesday.",
        "The Feb. 6, earthquake killed more than 50,000 people, including over 6,000 in Syria, according to the United Nations, and displaced hundreds of thousands of people.Syria´s northwestern province of Idlib is home to some 4 million people, many of whom had been earlier displaced during the country´s 12-year civil war, which has killed nearly half a million people.David Carden, the U.N.´s Deputy Regional Humanitarian Coordinator for the Syria crisis said that since the earthquake, some 2,000 trucks have crossed the border from Turkey, providing assistance such as shelter, food, medical supplies and other services.\"We have progressed since the early days but there is still more to be done one,\" he said, citing funding as one of the issues. Although a flash appeal is fully funded and $400 million has been raised, he said the humanitarian response plan for Syria, which was in existence before the quake and requires billions of dollars of support, is only 7% funded.Carden urged for the two border crossings between Turkey and Syria that were opened after the earthquake for three months to allow aid in to remain open.",
        "\"We want to keep using these crossings as long as possible,\" he said. The three-month period expires in mid-May and it is still not clear if the Syrian government will allow aid to flow in the future.",
        "The February earthquake left more than 4,500 dead in northwestern Syria and about 855,000 people had their homes damaged or destroyed, Carden said.Patrick Mutai, a coordinator on shelters at the U.N. refugees agency, said that before the quake, some 2 million people in Syria needed assistance, including 1.8 million people who live in camps. Of those, some 800,000 are in tents that need replacement.\"The earthquake has exposed populations to much more vulnerabilities,\" Mutai said, adding that 1.1 million people in Syria are in need of shelter. The immediate plan is to help the most affected with \"dignified shelters, medium term kind of shelters that provide better privacy, security as well as structural stability.\"Idris Elrasheed, who heads northwestern Syria operations from the World Health Organization's office in Gaziantep in southern Turkey, said more medical equipment will be brought to Syria, which would reduce demand for moving those critically ill to Turkey for treatment along blocked roads and across a border has been closed since the earthquake.___Associated Press writer Bassem Mroue in Beirut contributed to this report."
    ]
}