{
    "articleURL": "/wires/ap/article-12045419/Israeli-military-kills-3-wanted-Palestinians-West-Bank.html",
    "content": [
        "NABLUS, West Bank (AP) - Israeli troops on Thursday killed three Palestinian militants wanted in connection with a shooting attack that killed a British-Israeli woman and two of her daughters, the Israeli military said, the latest bloodshed in a relentless wave of violence.",
        "In a rare daytime incursion launched as residents were starting their day, the military said forces entered the heart of the flashpoint city of Nablus and raided an apartment where the men were located. Troops and the suspects exchanged fire and the three men were killed.The military said the men were behind an attack last month on a car near a Jewish West Bank settlement that killed Lucy Dee, the British-Israeli mother and two of her daughters, Maya and Rina. Leo Dee, the woman's widower, told The Associated Press he was \"comforted\" by the news of the militants' death.In a statement after the raid, the Hamas militant group said the three men, identified as Hassan Qatnani, Moaz al-Masri and Ibrahim Jabr, were its members and the group claimed responsibility for the April attack.In a separate incident Thursday near the West Bank town of Hawara, a 20-year-old soldier shot and killed 26-year-old Palestinian woman who had stabbed and lightly wounded him.In Nablus, Israeli shells ripped through the roof of the gunmen´s safe house in the heart of Nablus' Old City, leaving nothing but twisted metal, cement blocks and torn mattresses still stained with blood scattered over the rubble. A couple of hours after the army withdrew, young men collected scores of ejected bullet shell casings from the narrow alleys.",
        "Nablus, the West Bank's commercial capital and second-largest city, has been the scene of repeated Israeli raids over the past year, but few have been conducted during the day because of the increased risk of friction with local residents. Residents have been caught up in previous fighting.Manal Abu Safiyeh, 57, said she woke up at 7 a.m. to the sounds of the Israeli army vehicles rumbling through the city. Although it wasn´t new to her after a year of intense violence in the Old City, the gunfire sounded closer than she´d ever heard it before. An explosion suddenly blew up her neighbor´s house, she said, killing three people. She said she didn´t know much about her neighbors other than that Ibrahim Jabr had cancer.A man who identified himself only as Kareem for fear of reprisals said that he spotted older men and a woman in a long overgarment worn by Muslim women who he had never seen before walking through the limestone alleys and knew instantly they were Israeli special forces. He ran to his house and sheltered there until he heard the gunfire stop.\"So many men from the city have been killed,\" he said. \"We are used to these raids. That´s the story of life in Nablus.\"",
        "After the military pulled out, dozens of masked men paraded through the city while shooting into the air, waving Palestinian flags as onlookers honked in support. A sea of mourners at the men's funeral chanted \"God is great.\"The violence in Nablus comes at a particularly sensitive time in the region, days after a prominent Palestinian prisoner who was staging a lengthy hunger strike over his detention died in Israeli custody. His death set off a volley of rockets from militants in Gaza and Israeli airstrikes in the coastal enclave that killed one man.The deadly attack last month on the Israeli car shocked Israelis because in an instant it reduced the Dee family from seven members to four. Hundreds of people packed the funerals and the family's father, Leo, has been a recurring figure in Israeli media, saying he bears no hatred toward the killers of his family and calling for national unity amid a deep societal rift.\"We´re grateful to God that this was done in a way that protected the lives of the soldiers and caused minimal if no civilian casualties, as far as we know. And of course, that´s very important to us that innocent Palestinians were not injured in this operation,\" Leo Dee told The Associated Press from his home in the Jewish West Bank settlement of Efrat.",
        "Israeli officials said the raid showed attackers would be hunted down eventually.\"Our message to those who harm us, and those who want to harm us, is that whether it takes a day, a week or a month - you can be certain that we will settle accounts with you,\" Israeli Prime Minister Benjamin Netanyahu said in a statement.Israel has been staging near-nightly arrest raids into West Bank villages, towns and cities for more than a year in an operation prompted by a wave of Palestinian attacks against Israelis last year.Israel says the raids are meant to dismantle militant networks and thwart future attacks. The Palestinians see the attacks as further entrenchment of Israel's 56-year, open-ended occupation of lands they seek for a future independent state. Israel captured those territories - the West Bank, east Jerusalem and the Gaza Strip - in the 1967 Mideast war.Some 250 Palestinians have been killed by Israeli fire since the raids were launched. Israel says most have been militants, but stone-throwing youth and people not involved in the confrontations have also been killed.The raids have been met by a surge in Palestinian attacks. Since last spring, nearly 50 people have been killed in Palestinian attacks against Israelis.Goldenberg reported from Tel Aviv, Israel. Associated Press reporter Alon Bernstein contributed from Efrat, West Bank."
    ]
}