{
    "articleURL": "/tvshowbiz/article-12053257/Sonia-Kruger-nearly-fainted-filming-latest-season-Voice.html",
    "content": [
        "Sonia Kruger nearly fainted on stage while filming a recent episode of the latest season of Channel Seven's The Voice Australia.",
        "The 57-year-old, who hosts the singing competition, made the shock admission during an interview with The Morning Show's Larry Emdur and Kylie Gillies.‘I can’t give away too much,' Sonia said of the incident during the intimate chat.'But there was a moment where I was a little bit overcome about something that happened,' she continued.'And I was having a little bit of a freak out on stage, I actually thought I was going to faint if I’m honest...and that’s never happened to me before.’ ",
        "She appeared reluctant to go into further detail and didn't share what exactly caused her to almost collapse. But Sonia did admit that her emotions were running high because 'there was a lot riding with the coaches'.Elsewhere in the chat, Sonia said that new Voice coach, 33-year-old American singer Jason Derulo, has proven to be a hit with fans during the show's filming.‘The audience loved him,' Sonia gushed, 'every time he came out [they] sang his name.'Jason, who replaced Aussie superstar Keith Urban on the show, joins co-stars Rita Ora, Guy Sebastian and Jessica Mauboy for the new season.Sonia said fans can look forward to seeing all four coaches perform live this year as well as an extraordinary line-up of new hopefuls in the competition.",
        "Meanwhile, the glamorous Channel Seven celebrity confirmed that Dancing with the Stars will also be returning to screens in 2023.",
        "'We start shooting very soon,' Sonia said, adding that viewers will see some changes to the hit show, including new judges.‘There’s a whole new crop of celebrities,' she added, 'it's not all celebrities.'‘So these are people who have not done it before. They are all brand spanking new.'It comes after recent rumours that Sonia might be getting set to join the cast of the Real Housewives of Sydney. ",
        "The blonde beauty is said to have caught the eye of Bravo boss Andy Cohen while he was in Australia for WorldPride last month.Cohen is the executive producer of all ten Real Housewives franchises, while the Australian version is produced by Matchbox Entertainment and is aired on Foxtel.The Watch What Happens Live! host appeared to bond with The Voice and Dancing With The Stars star while they were at an event to launch Channel Seven's new channel 7Bravo, according to Woman's Day. The Voice Australia is scheduled to screen on Seven later in 2023 "
    ]
}