{
    "articleURL": "/tvshowbiz/article-12045423/Ariana-Madix-admits-bedroom-problems-Tom-Sandoval-confides-best-pal-Raquel-Leviss.html",
    "content": [
        "'I just want us to f***ing be better. You know, I want us to be more intimate,' Tom told his longtime girlfriend Ariana in the teaser'I cannot have sex with somebody that feels like a stranger,' Ariana told him Raquel in the next clip told Ariana, 'I feel like in a relationship you should want to have sex' Ariana Madix discussed bedroom problems with her boyfriend Tom Sandoval in a teaser released on Wednesday for the next episode of Vanderpump Rules.",
        "The 37-year-old reality star was shown having a talk with Tom, 39, about their sex life in footage recorded before his affair with co-star Raquel Leviss, 28, was exposed.'I just want us to f***ing be better. You know, I want us to be more intimate,' Tom told his longtime girlfriend.'I cannot have sex with somebody that feels like a stranger,' Ariana told him.Raquel in the next clip told Ariana, 'I feel like in a relationship you should want to have sex.'",
        "Ariana then explained her sex situation with Tom.'You come home after working all night. And you're like what you're just gonna like, whip your d*** out and I'm gonna be like, 'Yeah, let's f***'?''' Ariana said to Raquel. \"That's never gonna happen. We have to spend time together.'Sandoval in the teaser also talked to his friend and business partner Tom Schwartz, 40, about his relationship with Ariana.'I want to go somewhere really cool with Ariana,' Sandoval said.'Have you guys been okay?,' Schwartz asked.'I feel like sometimes like, my very presence annoys her,' Sandoval said.Raquel in the final clip of the teaser told Katie Maloney, 36, that she initiated her divorce from Schwartz and it was none of her business if they 'made out or not'.",
        "Katie was outraged and yelled that she was done with Raquel and later shut down Schwartz when he said that Raquel wanted to apologize.'I don't need an apology from her,' Katie hollered. ",
        "The teaser ran at the end of the season 10 episode titled Lady And The Glamp.The episode showed Tom getting caught lying by his grieving girlfriend Ariana as their friends grew increasingly suspicious of his relationship with Raquel.Ariana confronted Tom after learning from Lala Kent, 32, that he purposely stayed at a barbecue with Raquel after knowing that Ariana was reeling over the death of her beloved grandmother Bonnie.Lala told Ariana that she was with Sandoval at the barbecue when she called to let him know that her grandmother died.'Well, ...yeah, I kind of figured you wanted to be alone,' Tom told Ariana.Vanderpump Rules will return next week on Bravo."
    ]
}