{
    "articleURL": "/news/article-12061361/Judge-bans-Trump-sharing-evidence-online-Stormy-Daniels-case.html",
    "content": [
        "The judge in the Stormy Daniels hush-money case barred former President Donald Trump from sharing evidence on social media In a ruling Monday, Judge Juan Merchan also banned Trump from looking at evidence without his lawyers present The Manhattan District Attorney's office had sought the order due to the fear that Trump would 'inappropriately' post content from the case  The judge in the Stormy Daniels hush-money case on Monday barred former President Donald Trump from sharing evidence and other material from the case publicly. ",
        "Judge Juan Merchan also banned Trump from looking at evidence without his lawyers present. The Manhattan District Attorney's office had sought the order due to the fear that Trump would 'inappropriately' post content from the case on social media or elsewhere. At a hearing in New York last week, a prosecutor called that threat 'substantial.' Trump's lawyers had been against the request. ",
        "The latest legal move comes after last month's history-making indictment of a former U.S. president. Trump was charged with 34 felony counts of falsifying business records in relation to the the Daniels hush-money scheme in the run-up to the 2016 presidential election. He pleaded not guilty.  The alleged crimes included writing monthly checks to his former lawyer Michael Cohen throughout 2017 as part of a 'retainer agreement,' with prosecutors saying that there was no such retainer agreement and those payments were actually to pay Cohen back the $130,000 given to Daniels to keep her quiet about her 2006 tryst with Trump ahead of Election Day 2016.Trump has denied having sex with Daniels.He's also attacked nearly everyone involved in the case, including Judge Merchan and Manhattan District Attorney Alvin Bragg. ",
        "Assistant District Attorney Catherine McCaw noted that in the prosecution’s motion for a protective order. 'Donald J. Trump has a longstanding and perhaps singular history of attacking witnesses, investigators, prosecutors, trial jurors, grand jurors, judges, and others invovled in legal proceedings against him, putting those individuals and their families at considerable safety risk,' McCaw wrote. ",
        "Merchan - who's received death threats for his role in the Trump case - said that names and identifying information about the district attorney's office employees working on the case would be kept secret until the start of the trial. He said that all material provided by the DA's office to Trump's lawyers 'shall be used solely for the purposes of preparing a defense in this matter.' 'Any person who receives the Covered Materials shall not copy, disseminate, or disclose the Covered Materials, in any form or by any means, to any third party,' he said, which included the posting of that material to a social media site.  "
    ]
}