{
    "articleURL": "/wires/afp/article-12043433/US-approves-worlds-RSV-vaccine.html",
    "content": [
        "The United States on Wednesday approved GSK's Arexy vaccine against Respiratory Syncytial Virus (RSV), which can cause severe pneumonia and bronchiolitis in infants and the elderly.",
        "It marks the first such approval globally, with similar vaccines from other makers including Pfizer expected to follow soon.\"Today's approval of the first RSV vaccine is an important public health achievement to prevent a disease which can be life-threatening,\" said senior US Food and Drug Administration (FDA) official Peter Marks in a statement.RSV normally causes mild, cold-like symptoms, but can be serious for people with weak immune systems.According to the US Centers for Disease Control and Prevention, it leads to approximately 60,000 to 120,000 hospitalizations and 6,000 to 10,000 deaths among adults 65 years of age and older.The vaccine was approved for people aged 60 and older, based on a study of 25,000 people that showed a single dose was 83 percent effective against disease caused by RSV, and more than 94 percent effective against severe disease.The most common side effects included injection site pain, fatigue, muscle pain, headache and joint stiffness.An irregular heartbeat was a less common side effect, occurring in 10 participants who received Arexy and 4 participants who received placebo.GSK's Arexy has been recommended for approval by the European Union's drug watchdog, the European Medicines Agency, whose positive opinions are normally formally followed by the European Commission.Pfizer has said that it expects a decision from the FDA in May for its own over-60s RSV vaccine.",
        "In January, Moderna said it hopes its RSV vaccine would be approved and available for the Northern Hemisphere's winter later this year.Last year, the EU approved a preventative antibody treatment against RSV, developed by British-Swedish pharmaceutical firm AstraZeneca and France's Sanofi."
    ]
}