{
    "articleURL": "/tvshowbiz/article-12061569/Masterchef-contestant-criticised-making-misleading-comment.html",
    "content": [
        "A MasterChef contestant has been criticised for making a 'misleading comment' on Monday's episode of the cooking show.",
        "As the heat rounds continued on the BBC show hopeful John served up a sugar-free chocolate tart which he said was inspired by his daughter who has type 1 diabetes.The dish was artificially sweetened and was served with vanilla cream and raspberries. After saying it was something he makes for his daughter due to her diabetes, some took to Twitter to say it was misleading. The JDRF states: 'You don't need to cut out sugar when you have type 1. In fact, you should always keep something with a high sugar content on you (like jelly babies, fruit juice or glucose tablets) in case you need to raise your blood glucose levels or treat a hypo.'",
        "Taking to Twitter, one wrote: 'Having lived with a type 1 diabetic for 13 plus years, they can have sugar it just needs to be managed appropriately.'A third added: 'People with type 1 diabetes can eat sugar. Like everything, moderation is key.'A fourth wrote: 'I'm pretty sure type 1 can have sugar.'It comes after last week MasterChef viewers slammed the appearance of one cake as the heat rounds continued. As the series returned for another episode, contestants were challenged in the audition round to create a series of bakes to impress the judges and win aprons. ",
        "But one of the dishes, a gluten-free vegan chocolate and candied walnut cake, made by Mirel, left viewers unconvinced.People took to Twitter in their droves to remark on the presentation, claiming it looked like poo- despite rave reviews from John Torode and Gregg Wallace.Greg and John had remarked on the contemporary nature of the decoration and said it was tasty.",
        "However, one person tweeted: 'There's a fine line between \"looking bold\" and looking like somebody's taken a s**t on your plate'. Another added: 'And that looks like a turd with gold leaf bits' while a third penned: 'My presentation is \"poo after eating sweetcorn.\"Someone else wrote: 'Well, irrefutable proof there looking at that cake, is that you can polish a turd.'Meanwhile, another person added: 'It's like he tried to rewrap a Ferrero Rocher that he already chewed.'And a separate person wrote: 'I think it looks contemporary. I think it looks like a hammered turd.'It came after MasterChef viewers were stunned on Friday as fan favourite Forest was given the boot from the competition.The marketing director, 34, who hailed originally from Hong Kong, impressed both the viewers and the judges earlier in the contest but suffered a series of misfortunes during the quarter final this evening.",
        "He opted to make a savoury dish for the first time but returning winner Thomasina Miers, who was invited to judge this week, was left unimpressed.",
        "Thomasina said Forest's lobster and cheese sauce were not up to standards, as she called them 'one dimensional'.His Eton Mess also failed to impress but viewers think it was Forest's decision to use packet noodles which made it easy for judges John Torode and Gregg Wallace to send him home, leaving viewers fuming. Taking to Twitter to express their disappointment at the result, one person wrote: 'Forest was my winner until today!''Forest only lost because he got his noodles from a packet,' remarked someone else."
    ]
}