{
    "articleURL": "/wires/reuters/article-12041029/Bond-investors-sidelines-ahead-central-bank-meetings.html",
    "content": [
        "By Stefano Rebaudo",
        "May 3 (Reuters) - Investors in euro zone government bonds waited on the sidelines on Wednesday ahead of the Federal Reserve and the European Central Bank policy meetings.Markets fully priced in a 25 basis points (bps) rate hike from the ECB on Thursday, but still see a slight chance - around 15% - of a 50 bps move.Analysts said the central bank had reached a fine-tuning phase of the monetary tightening cycle, which will involve a default increment of policy rates of 25 bps.However, expectations for the terminal rate are still mixed, between 3.5% and 4%.Germany's 10-year government bond yield was up 0.5 bps at 2.25%, still around 50 bps below its highest level since July 2011 hit in early March.Yields in 10-year U.S. Treasuries are 65 bps below their 2023 high at 4.09% as the market bets the Fed will pause its rate hiking and start cutting rates sooner than expected as regional bank stocks kept falling.Analysts expect fears of a banking crisis to prevent the Fed from further tightening its policy.The Fed's Federal Open Market Committee (FOMC) will announce its decision on interest rates at 1800 GMT on Wednesday, while the ECB will hold its meeting on Thursday.\"Inflation data, especially sticky service, do not give the ECB the ability to signal any pause yet,\" said Davide Oneglia, an economist at TS Lombard.",
        "\"The bigger question remains where the ECB will stop. The answer depends mostly on a mid-year U.S. recession materialising and on the Fed response to it, which have big implications\" for euro area growth and equities' performance, he added.Analysts said the ECB's Bank Lending Survey (BLS) did not make a case for a 50 bps rate hike as it suggested that euro area lending conditions continued to tighten at a rapid pace in the second quarter, even if the impact of the recent banking stress remained subdued. Euro zone inflation accelerated last month but underlying price growth eased unexpectedly.Analysts also expect the ECB to deliver hawkish signals by saying there is \"more ground to cover\" while signalling discomfort with the high inflation numbers and the speed of its quantitative tightening measures might accelerate from July.Italy's 10-year yield was flat at 4.16%, while the closely watched spread between Italian and German 10-year yields - a gauge of investor sentiment towards the euro zone's more indebted countries - was at 190 bps. (Reporting by Stefano Rebaudo, editing by Barbara Lewis)"
    ]
}