{
    "articleURL": "/sport/tennis/article-12045519/Nick-Kyrgios-Tesla-robbery-tennis-star-breaks-silence-mother-allegedly-held-gunpoint.html",
    "content": [
        "Tennis star tracked his allegedly stolen Telsa on app His mum allegedly held at gunpoint at front doorCar was recovered 35 minutes after alleged robbery Nick Kyrgios has broken his silence after his mother was allegedly held at gunpoint before his green Tesla was stolen. ",
        "The tennis star thanked fans for their support after a man was arrested over the terrifying incident. 'Last couple days has been rough... haven't slept much and battling a little,' he wrote on his Instagram story.",
        "A 32-year-old Canberra man has been arrested after he allegedly threatened the tennis ace's mother, Norlaila Kyrgios, with a gun and demanded the keys to her son's car at about 8.30am on Monday.The man allegedly asked her how to drive the lime green car before he fled the scene, but was later arrested.Court documents reveal Ms Kyrgios alerted her son of the man before Kyrgios called triple-0. The Wimbledon finalist then rang triple-0 - all while using the electric car's special app on his phone to limit the Tesla's speed to 80km/h an hour and track its movements for police.Cops then tracked the car to the side of a road in Watson and attempted to arrest the driver, the court heard. The alleged robber is then said to have 'sped off' and driven on the wrong side of a road in an escape attempt, the court heard.Police then abandoned the pursuit due to safety concerns for other road users.Eventually, the Tesla was blocked in a driveway in Ainslie by tactical officers and the driver was arrested around half an hour after the alleged robbery, the court heard.",
        "Ms Kygrios told police interviewers she was fearful that the man would return and 'blow a hole in the door'.In a statement, ACT Policing said officers raided a Gilmore home on Tuesday afternoon and allegedly found a shotgun, believed to be the firearm used during the robbery.During the search two other firearms, a pistol and a .177 air rifle, were also allegedly located and seized along with an unreturned, rented BMW, commercial-grade fireworks and substances suspected of being drugs.The seized items will be subjected to forensic examination as a part of the ongoing investigation.The man appeared in ACT Magistrates Court on Tuesday charged with aggravated robbery, driving a stolen motor vehicle, furious driving, and fail to stop for police.He was denied bail to appear at a later date.Kyrgios is very close with his mother, sharing his love for her on her birthday last year.'I know I haven't always been the easiest to deal with and I know I've stressed you out,' the star wrote.'I just want you to know that I don't know anyone stronger than you.'"
    ]
}