{
    "articleURL": "/sport/football/article-12041687/Chelsea-weighing-summer-swoop-Crystal-Palace-talisman-Wilfried-Zaha.html",
    "content": [
        "Zaha has been offered a new Crystal Palace deal around £200,000-per-weekBoth Milan clubs, Napoli, Marseille and sides from Saudi Arabia are keen tooChelsea are interested in a summer swoop for Crystal Palace forward Wilfried Zaha.",
        "The Ivory Coast international's future is uncertain with his contract due to expire at the end of the season.The Eagles have offered Zaha a new contract worth in the region of £200,000-per-week - a deal, if agreed, that would be the most lucrative in the club's history.However, Zaha is attracting interest from across the world given his status as a free agent at the end of the season with the 30-year-old keeping his options open heading into the summer.And Mail Sport has learned that Chelsea are among the clubs considering approaching the attacker at the end of the season, with sources close to the Blues interest in Zaha indicating the Blues are emerging as serious contenders for his signature.The priority for Chelsea is to sell players this summer in order to make the squad more manageable for incoming head coach Mauricio Pochettino and to ensure they fall within FFP rules.",
        "Indeed, trimming the squad in attacking areas is viewed as a priority with Raheem Sterling, Mykhailo Mudryk, Joao Felix, Mason Mount, Noni Madueke, Hakim Ziyech, Kai Havertz and Conor Gallagher all vying for playing time.Nevertheless, the opportunity of signing a player of Zaha's quality on a free transfer is an option the Blues are keeping open.",
        "Interestingly, Zaha is a player Pochettino tried to sign during his time in charge of Tottenham and the chance to work with the Palace is likely to interest the Argentine coach.In addition to Chelsea's interest, Zaha is attracting admiring glances from both Milan clubs, Napoli and Marseille.He also has lucrative offers from Saudi Arabia, but Zaha is prioritising a deal with a European club if he is to leave Selhurst Park this summer."
    ]
}