{
    "articleURL": "/health/article-12040967/Warning-vegans-Diet-meat-eggs-milk-healthier-plant-based-foods-review-finds.html",
    "content": [
        "The study was carried out by the UN's Food and Agriculture Organization It looked at 500 papers to analyse the benefits and risks of animal source foods Vegan diets are 'less healthy' than including meat, eggs and milk in your meals, a major review has found. ",
        "A report by the United Nations' Food and Agriculture Organization (FAO), which looked at more than 500 studies, concluded that animal sources of food offer 'crucial sources of much-needed nutrients'.These include protein, fats and carbs, as well as iron, calcium and zinc, which are vital for health and development, it said.However, these macro and micro nutrients are hard to find 'in the required quality and quantity' if following a vegan diet, according to the FAO.It noted that meat, eggs and milk are 'particularly vital' among children, young people and older people, as well as pregnant and breastfeeding women. ",
        "To assess the benefits of risks of consuming animal products, the FAO looked at more than 500 scientific papers and 250 policy documents.It makes the study its most comprehensive analysis to date. 'Terrestrial animal source foods provide energy and many essential nutrients, such as protein, fatty acids and several vitamins and minerals that are less common in other food types,' FAO deputy director-general Maria Helena Semedo and the body's chief economist Maximo Torero Cullen wrote in a foreword to the report.It noted that plant-based 'meat', available in all major supermarkets, cannot replace animal products, is deficient in some essential nutrients and is high in fat, sodium and sugar.Evidence suggests that in adults, yoghurt and milk consumption reduces the risk of all-cause death, high blood pressure, stroke, type 2 diabetes, colorectal and breast cancer and osteoporosis, the report states.",
        "The report also found there was relatively solid evidence that egg consumption does not increase the risk of stroke or heart disease. Meanwhile, milk and dairy consumption during pregnancy promotes a healthy birth weight of the baby, evidence shows. And beef consumption was found to improve cognitive outcomes and protect against iron deficiency - which can cause dizziness, fatigue, headaches, an irregular heartbeat and pale skin. The report states that eating 72g of beef each day is safe. However, the authors wrote that even consuming small amounts of processed meat — such as deli meats, bacon and sausages — should be avoided.The World Health Organization says there is strong evidence that processed meats increase the risk of bowel and stomach cancer.However, the FAO called on the livestock sector to address an array of issues, such as deforestation, greenhouse-gas emissions and pollution, as well as unsustainable water and land use, poor animal welfare and overgrazing.Professor Gunter Kuhnle, a nutrition and food scientist at the University of Reading, told MailOnline: 'One aspect are nutrient deficiencies, especially iron, zinc and vitamin B12 - meat is a good source for them.'And iron deficiency is a problem for many women (especially young women) in the UK, so this is quite relevant.'However Professor Kuhnle said those who lead a vegan or vegetarian diet can be 'perfectly healthy' and stressed it just requires 'more planning' to ensure they get the correct nutrients.",
        "He added: 'The same applies to protein – meat always contains all essential amino acids, but not all plants do. 'However, meat and animal products are missing fibre – which is important for health – and many plant bioactives which are believed to have a beneficial effect on health.'Professor Kuhnle also warned of 'polarisation' in nutrition, where it is claimed a specific diet or food group is essential. He says the focus should be on humans eating a wide range of foods.",
        "Eat at least 5 portions of a variety of fruit and vegetables every day. All fresh, frozen, dried and canned fruit and vegetables count;Base meals on potatoes, bread, rice, pasta or other starchy carbohydrates, ideally wholegrain;30 grams of fibre a day: This is the same as eating all of the following: 5 portions of fruit and vegetables, 2 whole-wheat cereal biscuits, 2 thick slices of wholemeal bread and large baked potato with the skin on;Have some dairy or dairy alternatives (such as soya drinks) choosing lower fat and lower sugar options;Eat some beans, pulses, fish, eggs, meat and other proteins (including 2 portions of fish every week, one of which should be oily);Choose unsaturated oils and spreads and consuming in small amounts;Drink 6-8 cups/glasses of water a day;Adults should have less than 6g of salt and 20g of saturated fat for women or 30g for men a day.Source: NHS Eatwell Guide "
    ]
}