{
    "articleURL": "/wires/reuters/article-12041149/Boy-opens-fire-Serbian-school-one-dead-5-wounded.html",
    "content": [
        "Police say attack was planned; suspect arrested",
        "Boy, 13, targets security guard, then teacher, othersTeacher and six pupils in hospitalSuspect had recently joined class, considered good pupilPresident says gun controls to be stepped up(Adds candlelight vigil, quotes)By Ivana Sekularac and Aleksandar VasovicBELGRADE, May 3 (Reuters) - A 13-year-old boy gunned down eight fellow pupils and a security guard in a Belgrade school on Wednesday in a planned attack, prompting Serbia's president to announce tougher curbs on gun ownership.Using two handguns that belonged to his father, the boy fired first at the guard and three girls in a hallway and then shot his teacher and classmates in a history lesson, police said. The teacher and six pupils were hospitalised, some with life-threatening injuries.Veselin Milic, head of Belgrade police, said the attacker had two guns and two petrol bombs and had planned everything carefully. \"He even had ... names of children he wanted to kill and their classes,\" he told a press conference.Gun ownership is widespread in Serbia, which has witnessed several mass shootings over the past decade, and President Aleksandar Vucic said checks would be stepped up.As Serbia prepared for three days of national mourning, Vucic announced a moratorium on new gun licenses other than for hunting, revision of existing permits and surveillance of shooting ranges and how civilians store their weapons. School shootings are rare.",
        "The shooter, who gave himself up to police and at 13 is below Serbia's age of criminal responsibility, will be placed in a psychiatric institution, Vucic told reporters, adding that both his father and mother had been arrested.\"He was waiting for this day. He was at the shooting range with his father three times,\" Vucic said. The boy had asked for a transfer to another class where he had three friends, he said.Interior Minister Bratislav Gasic said the suspect's father, had held the guns legally. Hundreds of thousands of weapons remain unaccounted for in Serbia after the Balkan wars of the 1990s.\"(The boy) ... first shot the teacher and then he started shooting randomly,\" parent Milan Milosevic told broadcaster N1. Milosevic's daughter was in the classroom when the attacker burst in, but she escaped.Thousands of people gathered in the elementary school's neighbourhood in the evening to lay flowers and light candles.\"I cannot stop thinking about it. I have children and I hope that we will never see such images in the future,\" said Aleksandar Arandjelovic, a lawyer who came to pay respects.Evgenija, 14, said she knew the suspected gunman.\"He was somehow silent and appeared nice and had good grades. Did not know much about him, he was not that open to everyone. I would never expect that this could happen,\" she said.",
        "WIDESPREAD GUN OWNERSHIP IN SERBIASarah el Sarag, a lawyer who lives locally and is due to send her second child to the school in September, described the dead security guard as gentle and peaceful.\"He was great guy, ...a man who loved the kids. I don't know what was in the head of that child who shot him,\" she said.Health Minister Danica Grujicic, a neurosurgeon who witnessed the impact of the Balkan wars, told reporters in tears that Wednesday's events were \"perhaps the most horrifying experience I have had as a doctor and as a human being.\"Gun laws are very strict in Serbia but civilian gun ownership is also widespread.According to the 2018 Small Arms Survey, Serbia globally ranked third with 39.1 firearms per 100 people, and more than 78,000 people have hunting licences.The survey estimate includes many weapons held illegally since the wars and unrest of the 1990s, despite authorities having issued several amnesties for owners to hand in or register illicit guns.In the deadliest shooting in Serbia since then, a 60-year-old man killed 14 people in 2013. Other mass shootings occurred in 2007, 2015 and 2016. All the assailants were adults.(Reporting by Aleksandar Vasovic and Ivana Sekularac; additional reporting by Anna Magdalena Lubowicka; writing by John Stonestreet and Alistair Bell; Editing by Philippa Fletcher, Aleksandar Vasovic and Ivana Sekularac)"
    ]
}