{
    "articleURL": "/news/article-12038561/Cops-probing-disappearance-murdered-Massachusetts-mom-Ana-Walshe-received-RANSOM-NOTE.html",
    "content": [
        "Note was received three days after Walshe's name was added to crime databaseCops believed it suspicious, as it didn't say how to transfer the ransom demandWalshe's husband Brian has denied murdering his spouse, who's still missing Massachusetts police probing the death of missing murdered mom Ana Walshe received a ransom note demanding $127,000, it has been revealed. ",
        "The note was sent to Cohasset Detective Harrison Schmidt on January 7, about a week after she was allegedly killed, and said: 'We have the so named Ana Walshe with us here … we had a deal worth $127,000.'She messed up..we have her here with us and if she doesn’t pay the money..then she’ll never be back, and we know that the police and the FBI are involved.. Good luck finding us.'It was sent via email from a man named Richard Walker, with Detective Schmidt receiving it three days after Walshe's name was added to the National Crime Information Center Database, the Boston Globe reported. Mm-of-three Walshe, a real estate executive, is believed to have been beaten to death on New Year's Eve 2022 after her husband, Brian Walshe, discovered an alleged affair. ",
        "Brian, 47, has been charged over claims he murdered her over the affair then dismembered her body in the family's basement and disposed of it.  Investigators believed the ransom missive to be suspicious and likely fake, because it did not include any further details on how to respond. ",
        "News of Walsh's disappearance had been widely-circulated by the time it was sent.  Her body has never been found. Days before Walshe disappeared, she told a friend she believed Brian would end up going to prison on art fraud charges.",
        "She added that she was planning on leaving her husband and moving to Washington DC, it is alleged. Brian Walshe was arraigned last week. He denies killing his missing wife, who was mother to the couple's three sons. He is due back in court in August.Norfolk Superior Court was told how Brian's mom had previously tailed Walshe during a trip to Washington DC, because she suspected her daughter-in-law was cheating on her son. ",
        "Brian is accused of obsessively checking the Instagram account of a man he believed Walshe was cheating on him with.He was also in line to collect a $2.7 million life insurance payout in the event of her death, although Brian's family claim he was sufficiently wealthy not to need that cash.Surveillance grabs released by prosecutors also allegedly show him buying a hacksaw, hatchet and cleaning supplies at a Lowes store. The images became public yesterday in court filings submitted as part of the murder case.It was also revealed that Ana, a mother-of-three, had been having an affair for several months with an unidentified man. The man told police that the pair spent Thanksgiving together in Dublin. By the time she died, Ana had become the family's sole breadwinner. She was working in real estate in Washington DC, while her husband remained in Massachusetts with their three young sons. ",
        "Brian was awaiting sentencing for a fraud conviction, after stealing and then passing off as real an Andy Warhol painting. Friends say Ana was ready to leave him and broke down in tears at a dinner in the days before she vanished. The new information about the affair were contained within a search warrant for the home which became public yesterday. Police say Ana was murdered at around 4am on January 1, three hours after saying goodbye to her friend and former boss who they rang in the New Year with. In the hours following her death, Brian is accused of using his son's iPad to search Google for 'how to dispose of a body' and 'how long before a body starts to smell'.His attorney conceded that the searches were 'problematic'. The next day, he visited several stores including Home Depot, Lowes and CVS, buying a combination of cleaning agents, plastic sheets, hazmat suits, a hatchet and a hacksaw. ",
        "Brian was seen in the days following visiting the dumpsters of apartment complexes near his mother's home. It is the prosecution's claim that Ana's dismembered remains were in the bags, but that they were removed by trash services and incinerated by the time police searched the dumpsters. They discovered items of clothing and jewelry - including the Prada boots, Hermes watch and Gucci necklace she'd been wearing when last seen alive - along with traces of her blood and DNA. "
    ]
}