{
    "articleURL": "/wires/ap/article-12052781/Berkeley-professor-apologizes-false-Indigenous-identity.html",
    "content": [
        "SAN FRANCISCO (AP) - An anthropology professor at the University of California, Berkeley, whose identity as Native American had been questioned for years apologized this week for falsely identifying as Indigenous, saying she is \"a white person\" who lived an identity based on family lore.",
        "Elizabeth Hoover, associate professor of environmental science, policy and management, said in an apology posted Monday on her website that she claimed an identity as a woman of Mohawk and Mi´kmaq descent but never confirmed that identity with those communities or researched her ancestry until recently.\"I caused harm,\" Hoover wrote. \"I hurt Native people who have been my friends, colleagues, students, and family, both directly through fractured trust and through activating historical harms. This hurt has also interrupted student and faculty life and careers. I acknowledge that I could have prevented all of this hurt by investigating and confirming my family stories sooner. For this, I am deeply sorry.\"Hoover´s alleged Indigenous roots came into question in 2021 after her name appeared on an \"Alleged Pretendian List.\" The list compiled by Jacqueline Keeler, a Native American writer and activist, includes more than 200 names of people Keeler says are falsely claiming Native heritage.Hoover first addressed doubts about her ethnic identity last year when she said in an October post on her website that she had conducted genealogical research and found \"no records of tribal citizenship for any of my family members in the tribal databases that were accessed.\"Her statement caused an uproar, and some of her former students authored a letter in November demanding her resignation. The letter was signed by hundreds of students and scholars from UC Berkeley and other universities along with members of Native American communities. It also called for her to apologize, stop identifying as Indigenous and acknowledge she had caused harm, among other demands.",
        "\"As scholars embedded in the kinship networks of our communities, we find Hoover´s repeated attempts to differentiate herself from settlers with similar stories and her claims of having lived experience as an Indigenous person by dancing at powwows absolutely appalling,\" the letter reads.Janet Gilmore, a UC Berkeley spokesperson, said in a statement she couldn´t comment on whether Hoover faces disciplinary action, saying discussing it would violate \"personnel matters and/or violate privacy rights, both of which are protected by law.\"\"However, we are aware of and support ongoing efforts to achieve restorative justice in a way that acknowledges and addresses the extent to which this matter has caused harm and upset among members of our community,\" Gilmore added.Hoover is the latest person to apologize for falsely claiming a racial or ethnic identity.U.S. Sen. Elizabeth Warren angered many Native Americans during her presidential campaign in 2018 when she used the results of a DNA test to try and rebut the ridicule of then-President Donald Trump, who had derisively referred to her as \"fake Pocahontas.\"Despite the DNA results, which showed some evidence of a Native American in Warren´s lineage, probably six to 10 generations ago, Warren is not a member of any tribe, and DNA tests are not typically used as evidence to determine tribal citizenship.",
        "Warren later offered a public apology at a forum on Native American issues, saying she was \"sorry for the harm I have caused.\"In 2015, Rachel Dolezal was fired as head of the Spokane, Washington, chapter of the NAACP and was kicked off a police ombudsman commission after her parent told local media their daughter was born white but was presenting herself as Black. She also lost her job teaching African studies at Eastern Washington University in nearby Cheney.Hoover said her identity was challenged after she began her first assistant professor job. She began teaching at UC Berkeley in the Fall of 2020.\"At the time, I interpreted inquiries into the validity of my Native identity as petty jealousy or people just looking to interfere in my life,\" she wrote.Hoover said that she grew up in rural upstate New York thinking she was someone of mixed Mohawk, Mi´kmaq, French, English, Irish and German descent, and attending food summits and powwows. Her mother shared stories about her grandmother being a Mohawk woman who married an abusive French-Canadian man and who committed suicide, leaving her children behind to be raised by someone else.She said she would no longer identify as Indigenous but would continue to help with food sovereignty and environmental justice movements in Native communities that ask her for her support.",
        "In her apology issued Monday, Hoover acknowledged she benefited from programs and funding that were geared toward Native scholars and said she is committed to engaging in the restorative justice process taking place on campus, \"as well as supporting restorative justice processes in other circles I have been involved with, where my participation is invited.\""
    ]
}