{
    "articleURL": "/wires/reuters/article-12055587/Motor-racing-Mercedes-car-nasty-piece-work-fumes-Wolff.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 6 (Reuters) - Mercedes team principal Toto Wolff slammed the Formula One outfit's car as \"a nasty piece of work\" on Saturday after a frustrating qualifying effort for the Miami Grand Prix left the Austrian scratching his head and at times speechless.Things got off to a promising start in South Florida for Mercedes after George Russell and seven-times world champion Lewis Hamilton topped the timing sheets in Friday's opening practice session.But it has been all downhill from there with Russell qualifying sixth for Sunday's race and Hamilton 13th, his worst ever qualifying at any circuit in the United States.\"I take no enjoyment from (Russell) finishing sixth,\" fumed Wolff. \"It's the lack of comprehension of what it is, that makes this car such a nasty piece of work.\"I think that the car is not a nice car, not a good car and I wouldn't even be able to point out fundamentally it's just...,\" paused Wolff searching for the right words. \"It's everywhere.\"I would say the performance is just...really bad.\"The lack of performance and pace in Miami has left Wolff puzzled after a promising start to the season that included a second by Hamilton at the Australian Grand Prix.Wolff, who teaches a course at the Harvard Business School, gave his car a failing grade and struggled to find even the slightest positive, saying things were worse than he thought.",
        "\"That's worse than I thought because we have 20 months on since we were last time in Miami and the car is just marginally better,\" said Wolff. \"Maybe it's not bouncing but that's the only thing that is better than last year.\"The car is not fast enough and we haven't got any comprehension why that is.\"Hamilton also lamented a lack of pace but was more measured in his criticism.\"It was a difficult session,\" said Hamilton. \"We're not that quick so we really needed perfect laps but it was difficult to get into a rhythm, at the beginning I had that issue with the car going slow in the last corner.\"Wolff said the answer may be a total reset adding there is no magic bullet out there.\"I think what we're trying to do with the upgrade is to create a new baseline for us to take question marks, variables out of the equation and say this is not a problem now that we have gone to a different spec,\" explained Wolff.\"So for me it's almost like a reset to what would have been a good start 30 months ago and then to try to add performance to the car.\"But at the moment it's just a lack of understanding.",
        "\"I don't believe in miracles.\" (Reporting by Steve Keating in Miami; Editing by Chizu Nomiyama)"
    ]
}