{
    "articleURL": "/tvshowbiz/article-12044233/The-Challenge-star-CT-Tamburello-remembers-late-girlfriend-Diem-Brown-touching-tribute.html",
    "content": [
        "CT Tamburello shared a touching tribute to his late girlfriend Diem Brown on Monday.",
        "The Challenge star, 42, posted a now-deleted video of himself and Brown, who passed away at the age of 34 in 2014 after a decade long battle with cancer.'To Be Continued … #tay,' Tamburello - who's been going through a bitter divorce from wife Lili Solares - wrote in the caption, and later added touching sentiments in the comments section about how much he missed her.'It would be nice to blow out the candles not alone for once… I'll share what I have .. no motive. Promise,' he wrote as per Us Weekly. 'God she is an angel…'He also envisioned what their life could have been like, writing, 'Can you imagine your closest inner circles knowing that after the lease is up they moving in together and planning on the white Pickett fence …!? Then poof.' ",
        "Brown and Tamburello met in 2006 on The Challenge's 13th season, The Duel, which aired on MTV. Their relationship grew into a romantic connection, and the duo shared a tender moment on screen when Brown, who had completed a round of chemotherapy at the time of filming following her cancer diagnosis, removed her head covering for the first time. At the time Tamburello said she reminded him of 'GI Jane, lookin’ like a little sexy supermodel secret agent.'",
        "The duo also shared their first kiss on-screen.The pair continued to date long-distance after leaving the show, but eventually broke up in 2009.They reunited three years later in MTV's Battle of the Exes, and earned second place.In 2013 Brown was diagnosed with ovarian cancer for a second time, and completed another round of chemotherapy.However, the cancer returned for a third time the following year.",
        "Tamburello proposed to Diem just days before she passed away.At the time it was reported that he visited the television personality in her hospital room and proposed as he got down on one knee with a ruby ring in hand, but Diem joked that she hated rubies and said no.However, CT was unrelenting in reconciliation as he came back the next day with a different ring to pop the question again, but Diem continued to stand firm with her decision.'Diem knew she didn't have much longer to live,' the source for Us Weekly said. 'And she didn't want to be engaged under those circumstances.'Just days later, the MTV The Challenge star died on November 14. Five days after her death and just one day after her funeral, an upset CT took to Instagram on Wednesday to post a touching tribute to the late star.",
        "The image was a photo of Diem - calling her by her given name Danielle - surrounded by a rosary and what looked to be a diamond ring, which very well could have been the ring he used as he got down on bended knee.He captioned the snap: 'You have always been My Angel. And now you have your wings,' he wrote. 'We never gave up on each other. Our plan to be together forever hasn't changed...it's just going to take a little longer now.'",
        "Following Brown’s passing, Tamburello moved on with Lilianet Solares, whom he married in 2018.In November 2022 Tamburello filed a motion to dissolve his marriage claiming that his relationship with Solares, 31, was 'irretrievably broken.'Their split got messy as they battled over finances and custody of their 7-year-old son Christopher."
    ]
}