{
    "articleURL": "/sport/nrl/article-12044263/Brisbane-Broncos-chairman-says-Anthony-Seibold-copped-worst-bullying-hes-seen-rugby-league.html",
    "content": [
        "Anthony Siebold took over as Broncos head coach in 2019Proved to be a disaster, Siebold was then sacked in 2020Chairman Karl Morris was stunned at 'relentless criticism'Siebold's Sea Eagles play the Broncos during Magic RoundBroncos chairman Karl Morris has revealed former head coach Anthony Siebold was on the receiving end of the worst bullying he has ever seen in his time in rugby league.",
        "Siebold, 48, was in the hot seat at Red Hill for 40 games between 2019 and 2020 - and in the eyes of many, it was a disaster.Brisbane eventually finished with the wooden spoon in Seibold's second season in charge - and while the results were unacceptable for a club of their stature, the current Sea Eagles boss had detractors lining up to poison his reputation.'I've never seen anything like it,' Morris told the Courier Mail. 'The pressure he was under by all of those people and the sheer relentlessness of it.'It was not only unfair but also unkind. It was full-on and inconceivable to me that people would write certain things that they wrote [on social media].'There were a few people that should know better.'",
        "Morris was referring to vicious and relentless social media criticism, which included false claims Seibold had slept with his players' partners, taken cocaine and that his wife had left him.A fed-up Seibold later hired cyber security experts to locate the source of vile rumours which circulated prior to his departure from Brisbane.He felt his reputation was left in tatters by the rumours and decided to take action when conjecture about his daughter's mental health was made public.'It's been pretty tough....in some ways it's like the wild west out there,' Seibold said at the time.",
        "'My situation went viral with defamatory comments. My reputation was ruined in a lot of respects.'I don't know what the motivation was for those messages.'It's vicious. There's also no accountability in and around social media platforms.'Following the round 13 defeat in 2020 at the hands of the Rabbitohs, Seibold opted to remain in Sydney and never coached the Broncos again.",
        "His departure less than two seasons into a lucrative five-year contract was confirmed as Brisbane hurtled towards the wooden spoon, winning just three matches all season.'It wasn't working,' Seibold said when reflecting on his time in Brisbane. 'It wasn't healthy at all for anybody. At the end of the day it was done.'Seibold returned to the NRL as a coaching consultant with the Knights in 2021 before joining England's rugby team under then-head coach Eddie Jones.He made his return to the NRL ranks with Manly this season following the sacking of Des Hasler.Morris remains adamant Seibold is a quality coach, and feels his time in Brisbane proves sometimes 'bad things happen to good people'.He is delighted to see 'Seibs' now in charge of the Sea Eagles - and is also well aware his former employee will do everything in his power to orchestrate an upset when Manly take on Brisbane in Magic Round this weekend.",
        "A win at Suncorp Stadium would be one of Seibold's most satisfying career wins, given it would be at the expense of many Broncos identities who were desperate to see him fail."
    ]
}