{
    "articleURL": "/wires/reuters/article-12053195/FIFA-confident-agreement-Womens-World-Cup-TV-rights.html",
    "content": [
        "SYDNEY, May 6 (Reuters) - FIFA secretary general Fatma Samoura is confident the global governing body's threat of a Women's World Cup TV blackout in Europe this year will bring broadcasters to the table with improved offers for the rights.",
        "The rights are being sold separately from the men's World Cup for the first time and FIFA President Gianni Infantino said last week that Britain, Spain, France, Germany and Italy would face a blackout unless \"unacceptable\" bids were improved.\"Those who bought the rights (to the last Women's World Cup) at that time in Europe know how much it brings, because we have reached record numbers during many matches,\" Samoura told Australia's Fox Sports News on Saturday.\"Today, we are just asking them to revisit their figures and discussion are ongoing and I'm sure that an agreement will be reached.\"We have already been having positive feedback from three of the countries that we have opened the discussion (with) and ... we still have 80 days to go before the kickoff.\"Some 1.12 billion viewers tuned into the 2019 World Cup in France across all platforms, according to a FIFA audit of the tournament.Infantino said broadcasters had offered only $1 million-$10 million for the rights for this year's tournament in Australia and New Zealand, compared to $100 million-$200 million for the men's World Cup.Samoura said that the lower offers might have been partly the result of \"unconscious bias\" against the women's game but that improved offers made solid financial sense.",
        "\"It's an opportunity to tell the world that we all know that women football is the only game in the world today that has unparalleled potential to grow,\" she added.\"And this should be reflected also in the commercial deals that we are selling with you.\"Former FIFA Council member Moya Dodd said this week that the governing body had itself devalued the rights of the Women's World Cup by historically bundling them with those of the men's tournament.The ninth Women's World Cup kicks off in Sydney and Auckland on July 20. (Reporting by Nick Mulvenney; editing by Stephen Coates)"
    ]
}