{
    "articleURL": "/news/article-12053923/Furious-viewers-slam-BBC-coronation-coverage-terrible-audio-quality.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's Coronation How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Furious royal fans have slammed the BBC for the 'terrible' audio quality in the broadcast of King Charles III's Coronation. ",
        "Viewers criticised the network on Twitter this morning as 'breaks in the sound feed' interrupted their viewing of the historic event.The outraged royalists complained that the network's sound failure was 'shocking' especially since BBC had 'months of preparation and years of anticipation' for the monumental event.One alleged that when asked what he remembers most from the event he would say 'BBC f*****g the sound up'. Others demanded an 'on-screen apology' from the broadcaster as they vowed to switch the channel to ITV and Sky.It comes as the UK's broadcasting big guns are going toe to toe in the ratings war over this weekend's royal coverage.",
        "The BBC positioned itself to be a leader in Coronation coverage ahead of this weekend's festivities.The broadcaster is airing the proceedings across its network, available to watch on BBC One and BBC iPlayer.It also offered a special one-off TV licence dispensation for the historic ceremony, meaning if you are hosting an event, you won’t need a TV licence to screen coverage of the Coronation today or the Coronation Concert tomorrow. However, royalists allege the network dropped the ball by having poor sound quality in its broadcasts.'Come on BBC. Sort the sound out on your outside broadcasts. Keeps breaking up,' Twitter user Jane Trout penned, adding: 'Going over to ITV to watch the Coronation without the hiccups.'",
        "'Bloody dreadful sound quality for the Coronation,' tweeted Helen Parsons.Kelsey Harkness-Jones added: 'BBC you will ruin the Coronation if you don't sort the sound!!!'",
        "Social media users called on the broadcaster to address the audio issues, with one mockingly saying: 'Hats off to whoever is the #BBC sound engineer doing the audio mixing at the #Coronation ceremony. Top class work.'One viewer said it was 'quite frankly embarrassing' that the network that 'specialises in effective and smooth communication' had so many breaks in its sound.'Months to prepare, but the BBC clearly have sound issues today of all days!' Twitter user Sherri wrote. 'Glad it's not my TV but disappointing that the sound has been cutting out so frequently...'Many viewers alleged that ITV and Sky were providing superior broadcast quality as they branded BBC's coverage as being 'really disappointing'.'Sound constantly dropping out on the Coronation. This is what we pay our licence fee for?' one tweeted. 'Switched over to ITV.'Another added: 'Gave up on the BBC 1 coverage of the Coronation - horrendous sound issues. The UHD feed on iPlayer is much better - crystal clear visuals and the sound is in sync!' ",
        "The criticisms come amid backlash from royal correspondent Jonny Dymond after the BBC branded Charles's Coronation 'the strangest show in town'.In his BBC article, Dymond references Australian singer-songwriter Nick Cave, who will attend today's event 'for the bizarre, the uncanny, the stupefying spectacular, the awe inspiring'. ",
        "Dymond then states that 'The Coronation will be all these things and more,' headlining his article 'the strangest show in town'. One person wrote on Twitter: 'This seems a somewhat \"strange\" adjective to use by the #BBC Royal Correspondent.'Why pick on the Coronation?' Another wrote: 'What a waste of our licence money. This reporter helpfully tells people areas to avoid in London and other unnecessary advice as to how to avoid ‘the strangest show in town'.'People who don’t want to go, or even know about this historic day have already made their plans.' ",
        "Dymond also wrote: 'Every big royal occasion, jubilee or wedding, birth or death, is an opportunity of sorts.'A chance to remind the nation and the world of the institution's role and relevance. And a moment to reinvent and rebrand.' He added: 'And this Coronation comes against a challenging backdrop.' BBC presenter Huw Edwards was also criticised on Twitter for spending 'five minutes' talking about spoons. ",
        "BBC coronation coverage The BBC will broadcast proceedings across its network, with the coronation available to watch on BBC One and BBC iPlayer. Coverage commences at 7:30am.  The broadcaster will also show a version with sign language on BBC Two, with Petroc Trelawny hosting accessible coverage via the Red Button. The broadcaster has also confirmed a special one-off TV licence dispensation for the Coronation of HM King Charles III. If you are hosting an event, you won’t need a TV licence to screen coverage of the Coronation on 6 May 2023, or the Coronation Concert on 7 May 2023. However, there will not be screens along the procession route. If you wish to watch the broadcast of events (including the Coronation service), you should visit one of the screening sites. These will be located in Hyde Park, The Green Park or St James’ Park. If you are travelling into London, be aware that London Victoria station should be used for the Hyde Park screening site only, with closures in operation around the station.  Sky News coronation coverage Sky News' coverage is led by presenter Kay Burley, who is reporting live from Westminster Abbey as troops who have a role to play in the coronation assume their positions.From 9am, Anna Botting will report live from Buckingham Palace in the build-up to the ceremony. This coverage will include the procession to Westminster Abbey.As the day draws to a close, Mark Austin will look back on the day's events from Buckingham Palace between 5pm and 8pm.From 8-9pm, Gillian Joseph will recap the best bits of the day, including a look at celebrations across the UK. Sky will round off its coverage with a special coronation highlights package from 9pm to 10pm.",
        "ITV coronation coverage It has been confirmed that Tom Bradby will lead ITV's coverage alongside Julie Etchingham. The News at Ten anchor, who is friends with the Duke of Sussex, will present from a special studio outside Buckingham Palace.ITV's list of presenters covering the event includes Mary Nightingale, Nina Hossain, Charlene White and James Mates, who will be at important locations across the country.ITV's coverage for the coronation will begin at 8.30am. From 6am, Good Morning Britain presenters Susanna Reid and Ben Shephard will be live from Westminster Abbey, while Ranvir Singh will be in position speak to guests at the coronation ceremony as they arrive.Kate Garraway will be live from Buckingham Palace, Charlotte Hawkins will be with the Armed Forces and Laura Tobin will be live from the Long Walk in Windsor.Spice Girl Mel B and Jonathan Dimbleby are among the guests to feature for ITV.",
        "From 8.30am, Bradby and Etchingham will present King Charles III: The Coronation from a studio outside Buckingham Palace. The programme can be viewed on ITV1. There will be commentary from Nightingale outside Westminster Abbey and Mates will explain the ancient traditions and rituals shown on screen.Hossain will be with the crowds at the Mall and White will report from RAF Waddington where the Red Arrows will be preparing for a flypast.A dedicated section of ITVX will feature documentaries from the broadcaster's catalogue about the monarch.Michael Jermey, ITV's director of news and current affairs, said: 'ITV's uninterrupted coverage on coronation day will capture every significant moment of an historically important event. We will provide viewers with a close-up view of all the pageantry and public celebration', according to iNews. 'Our guests will reflect a range of views on what the new reign will mean for Britain and the Commonwealth.'Channel 4 coronation coverage Channel 4 will offer viewers an alternative coronation viewing experience, including a documentary focusing on Prince Andrew's notorious Newsnight interview.'Andrew – The Problem Prince' will be broadcast in two parts and former BBC journalist Emily Maitlis will reveal how she came to question Andrew over his relationship with the late billionaire sex offender Jeffrey Epstein.The deep dive will also feature archive footage, an interview with former Newsnight producer Sam McAlister and snippets with palace insiders.",
        "The broadcaster will also air Frankie Boyle's Farewell To The Monarchy, which sees the Scottish comedian, 50, take a look back at its more than 1,000-year history and ask if the royal family 'has a place in today's world' and 'should it continue?'.The Windsors Coronation Special will see Harry Enfield, as King, invite the Duke and Duchess of Sussex to his special day, as the comedy show returns for a one-off special.On the day Saturday, Channel 4 says its schedule 'will provide an escape from the pomp and ceremony'.It will be showing films including Johnny English, The Italian Job, Star Trek Beyond, and Con Air, as well as episodes of Everybody Loves Raymond and King of Queens."
    ]
}