{
    "articleURL": "/wires/aap/article-12052301/David-Fifita-gets-Slater-tick-Maroons-recall.html",
    "content": [
        "David Fifita has enjoyed a tough, uncompromising and effective start to the season for the Gold Coast which has impressed Queensland coach Billy Slater just over a fortnight before the Maroons team is named.",
        "Fifita's next three performances for the Titans - starting with Parramatta at Suncorp Stadium on Sunday and then away games with Newcastle and Canterbury - will play a role in whether he is on the plane to Adelaide for the May 31 State of Origin opener.The 23-year-old Titans second-rower played the last of his five games for the Maroons in 2021.\"To play Origin for Queensland again is my goal,\" Fifita told AAP recently.Slater often talks about the need for Queensland-qualified players to display the habits on a regular basis that would make them qualified and ready to play Origin football should an opportunity arise. Fifita is doing that in 2023.Fifita told AAP that Slater met him in pre-season and spoke to him about areas of his game that he needed to improve to reclaim his Origin jersey.Since then he has been one of the leading second-rowers in the competition on the way to averaging a career high 169m per game. It is the tough carries, effort areas and one-per-centers in his repertoire that have improved, a fact not unnoticed by Slater.\"I think his involvement has been the best it has been for a long time,\" Slater said.\"He has worked on some things off the ball that he didn't necessarily have in his game the last few years, so he has been good.",
        "\"We all know David Fifita is capable. It is just about building the habits week-to-week and building that trust that he is going to perform those habits on the big stage under a lot of pressure.\"If the Maroons elect to play their two experienced, successful and battle hardened back-rowers, Kurt Capewell and Felise Kaufusi, in the starting side then Fifita's best chance of selection is on the bench, where he has played Origin before.\"Last year we played (Cowboys second-rower) Jeremiah Nanai off the bench, so he covered our edge forwards,\" Slater said.\"Kurt Capewell has played on the edge and has also played in the centres. You need a bit of flexibility.\"The adversity we faced in Game Three (last year) showed that. We had to move a back-rower out to the centres, a centre out to the wing. Tom Gilbert, in his first game, had to play high minutes.\"You have got to think of all those things and cover all bases because you don't know what is going to be thrown at you in a game.\"Versatility is important but first and foremost they need to be doing really well in their core position.\""
    ]
}