{
    "articleURL": "/wires/pa/article-12054763/Lee-Johnson-hails-important-win-Hibernian-battle-European-places.html",
    "content": [
        "Manager Lee Johnson praised Hibernian for holding their nerve to see out a crucial 2-1 victory over St Mirren after admitting their “dominant” first-half performance “fizzled out” after the break.",
        "Goals from on-loan duo Elie Youan and Will Fish gave the Hibees a deserved 2-0 lead at the interval before St Mirren threatened to claim a point in the closing stages after Alex Greive pulled one back.“I thought we made hard work of it in the second half, we should have had more control than we did,” said Johnson, whose fifth-placed side closed to within a point of city rivals Hearts in the battle for European places. “We didn’t dominate the midfield at all and in the first half we were very dominant.“A lot of the stuff we worked on through the week was executed to perfection (in the first half). I thought the ball speed and our passing and movement was good and we had good opportunities in the first half.“In the second half, for whatever reason, we just fizzled out. Not enough were on their game but we continued to work hard.“We shuffled the pack and changed the shape to cope with a St Mirren side who were throwing caution to the wind after the poor goal we conceded and in the end it was good to see it out. Even in injury time I think we managed it quite well.",
        "“Overall it’s a great win for us, it’s an important win because of that fifth place but also we’re now chasing down everybody ahead of us.”",
        "Hibs lost Jake Doyle-Hayes to a head knock in the first half and Johnson admitted the midfielder will need to be assessed.“Hopefully he’s OK,” said the manager. “He had quite a nasty bump on the side of his head.“I just hope it’s not concussion, firstly for him but also for us because he’s an important player. I thought he was outstanding until he went off.”St Mirren manager Stephen Robinson lamented the two goals his side lost.“It was a disappointing start,” he said. “We gave ourselves a mountain to climb, two individual errors have cost us.“I’ll take my share of the responsibility. I want us to keep the ball from throw-ins, I don’t want us to just chuck it down the line, I want us to try and switch play. We got caught on it today.“The second is a set-play where we let a runner go. They are goals we don’t usually concede which is frustrating.“Our response to that was terrific. I asked them to go out and be brave and step forward and we should have taken something out of the game.”"
    ]
}