{
    "articleURL": "/wires/ap/article-12055149/Man-City-Haaland-avoid-scare-ahead-Real-Madrid-clash.html",
    "content": [
        "MANCHESTER, England (AP) - Manchester City and Erling Haaland got a wake up call they didn't know they needed before their Champions League semifinal against Real Madrid.",
        "The Norwegian goal machine has hardly put a foot wrong this season. But against Leeds on Saturday he allowed himself a moment of indulgence which almost backfired on the defending English Premier League champions.Cruising with a 2-0 lead at Etihad Stadium, Haaland passed up the chance to score a late penalty by handing over the duty to Ilkay Gundogan, who was on for a hat trick.Gundogan hit the post and Leeds scored a minute later to set up an uncomfortable finish in a match that City totally dominated.City won 2-1, but against Real Madrid at the Santiago Bernabeu on Tuesday, such a lapse in judgement could prove much more costly.A miffed Pep Guardiola made sure City took the lesson on board.",
        "\"Erling is the best penalty taker right now so he has to take it,\" the manager said. \"If Gundo scores everyone is `OK, hat trick, well done.´ But a taker is a taker. At 2-0, this is a business, not a situation where we cannot forget it.\"Memories are still fresh of the semifinals against Madrid last season, when City led by two goals on aggregate going into the 90th minute of the second leg. In a dramatic finish, Madrid scored twice to force extra time, and a 95th-minute penalty knocked City out.",
        "City is looking unstoppable in its pursuit of a treble of trophies, including the Premier League and the FA Cup, but perhaps it was all getting a little too easy for Guardiola's players. Haaland has 51 goals already, and Saturday's win extended their unbeaten run to 20 games in all competitions, not to mention moving the league leaders four points clear of second-placed Arsenal.\"Everyone was incredibly focused knowing what we are playing for,\" Guardiola said. \"But at 2-0 you have to close it and not give them anything. If you have control, you have control.\"Rodrigo's goal changed the mood inside the stadium as relegation-threatened Leeds, under new manager Sam Allardyce, went in search of an unlikely equalizer.It didn't come, but after this late scare, Haaland surely won't pass up a penalty shot if one comes his way in Madrid on Tuesday.LIVERPOOL MARCHES ONLiverpool has probably left its run just a little too late.A sixth straight win has moved Jurgen Klopp's team to within a point of fourth-placed Manchester United.But United has two games in hand, meaning it would take a big slump to miss out on Champions League qualification.Liverpool, though, is definitely applying pressure in the final weeks of the season, which encourages Klopp after such a frustrating and inconsistent campaign.",
        "Mohamed Salah's goal secured a 1-0 win against Brentford and the striker's 100th at Anfield.\"Six games ago nobody would have thought we would be here,\" Klopp said. \"We cannot do more than win football games.\"We have to make sure we finish the situation in the best possible way.\"The win also earned goalkeeper Alisson his 100th clean sheet for Liverpool.CHELSEA FINALLY WINSAt the 10th time of asking, Chelsea secured a long-awaited win after beating Bournemouth 3-1 to end a miserable run.It was interim manager Frank Lampard's first victory since returning to Stamford Bridge last month and his first with Chelsea since his final game in charge before he was fired in 2021.Conor Gallagher, Benoit Badiashile and Joao Felix all scored, and Matias Vina got Bournemouth's goal as Chelsea ended a run of six straight losses under Lampard.\"We came in off the back of a tough run, it´s been a tough year and there is a lot work to do,\" Lampard said.RELEGATION FIGHTJulen Lopetegui has coached Spain and Real Madrid. He's also won the Europa League, but says the job he has done at Wolverhampton is his finest work.\"I have won the Europa League and played with Sevilla in the Champions League but, for me, this is the most important achievement,\" Lopetegui said after securing Premier League survival by beating Aston Villa 1-0.",
        "\"We arrived here five months ago with 10 points after 16 matches at the bottom, four points from the team above. We were in a very bad situation with bad belief and low morale.\"Wolves have reached 40 points, considered the benchmark for survival and 10 clear of the drop zone.KANE GOALS FEATHarry Kane is out on his own as the second highest scorer in league history after his goal in Tottenham's 1-0 win against Crystal Palace.The England striker moved past Wayne Rooney with his 209th goal in England's top division. Only Alan Shearer, on 260, is ahead of him.Kane has already become the record scorer for England and Tottenham this season.___James Robson is at https://twitter.com/jamesalanrobson___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}