{
    "articleURL": "/wires/ap/article-12041437/Leeds-hires-Sam-Allardyce-manager-firing-Gracia.html",
    "content": [
        "Sam Allardyce has built a managerial career largely out of being a survival specialist in the Premier League.",
        "At 68 years old, he is back - somewhat surprisingly - in England's top division with one of his toughest assignments yet.The former England coach was hired by Leeds on Wednesday until the end of the season as a replacement for Javi Gracia, who was fired with the team in fourth-to-last place in the standings and only out of the relegation zone on goal difference with four games remaining.Allardyce´s last coaching role was at West Bromwich Albion for the second half of the 2020-21 season, when he failed in his short-term mission to keep the team in the Premier League.That hasn´t stopped Leeds from turning to one of English soccer's most charismatic managers, with Allardyce saying he was \"shocked\" to get the opportunity of being the club's fourth manager in 15 months.\"I never thought at this stage of the season there would be jobs offered,\" he said, \"...so it took me about two seconds to say yes.\"",
        "According to British newspaper The Times of London, Allardyce will earn more than 3 million pounds ($3.75 million) if he keeps Leeds in the Premier League. It is his ninth managerial job in the top division and the sixth time he has been hired during a season, both of which are records.",
        "\"Far too many people think I am old and antiquated, which is so far from the truth,\" a bullish Allardyce said. \"I might be 68 and look old, but there's nobody ahead of me in football terms - not Pep (Guardiola), not (Jurgen) Klopp, not (Mikel) Arteta. It's all there with me. I shared it with them, they did what they do, I do what I do.\"In terms of knowledge, and depth of knowledge, I'm up there. I'm not saying I'm better, but I'm certainly as good as they are.\"Allardyce´s four-game stint could hardly be tougher, with three of them against teams in the top six.It starts with the ultimate test in English soccer, an away match at Manchester City on Saturday, before a home game against third-place Newcastle. Then there's a trip to West Ham, which is also fighting to avoid relegation, and a season-ending home match against Europe-chasing Tottenham. West Ham and Newcastle are two of Allardyce´s many former clubs.It is a desperate late-season move from Leeds, which - in the space of about a year - has gone from having something of a cultural phenomenon in Argentine coach Marcelo Bielsa at the helm to appointing Allardyce, an old-school English manager who has taken charge of 537 Premier League games.",
        "The change in styles between the two coaches couldn´t be more stark, highlighting the lack of direction in Leeds´ leadership in recent years.Nowhere is Allardyce´s preferred direct and pragmatic style better exemplified than the name of his weekly podcast, which is called \"No Tippy Tappy Football.\"It is proving to be chaotic week at Elland Road, with director of football Victor Orta losing his job on Tuesday.And it is a wild season in general in the Premier League, with a record 14 managers having been fired this season as the pressure on clubs to either qualify for Europe or stay in the division takes its toll.There are now six teams with interim managers - Southampton, Leicester, Crystal Palace, Tottenham, Chelsea and Leeds.The arrival of Allardyce continues something of a trend of clubs appointing experienced managers to realize end-of-season objectives.Another former England coach, 75-year-old Roy Hodgson, was hired by Palace in March for the final weeks of the season as the team plunged toward the relegation zone. Palace has won four of its six games under Hodgson and has virtually guaranteed its safety.In the second-tier Championship, Middlesbrough appointed 74-year-old Neil Warnock as manager in February in a bid to avoid relegation. It appears to have worked, with the team having moved out of the drop zone heading into the final week of the season.",
        "Gracia wasn't the initial choice to replace Jesse Marsch in February and leaves after less than three months in the job, winning only three of his 12 games in charge.Leeds lost five of its seven games in April and conceded 23 goals in that period - the most allowed in a single month in Premier League history. Gracia´s last game proved to be the 4-1 loss at Bournemouth on Sunday.\"We considered our chances and had confidence, and we know it is possible,\" Gracia said about Leeds' chances of staying up. \"We are not talking about miracles.\"Still, the Leeds board decided Allardyce had a better chance than Gracia of getting the results needed to remain in the lucrative Premier League. Last season, Leeds won at Brentford on the final weekend to preserve its top-flight status.\"The first thing I did when I looked at the fixtures was I thought they could´ve been a bit kinder,\" Allardyce said.\"We have to create a shock ... I hope we can find six points from four (games).\"He isn't ruling out staying on if things go according to plan.\"Never say never,\" Allardyce said. \"Depends what happens at the end of the four matches and what the conversation is all about. How I feel and more importantly how the wife feels.\"",
        "___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}