{
    "articleURL": "/news/article-12054469/Ive-doing-press-ups-Penny-Mordaunt-reveals-preparations-sword-carrying-Coronation.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today Tory MP Penny Mordaunt has told of her preparations for the sword-carrying role at today's coronation - as fellow MPs praised her for 'stealing the show'. ",
        "The Leader of the House of Commons carried the sword for more than an hour as Lord President of the Privy Council, a role she has undertaken since September last year.  Speaking to The Times' Red Box Politics podcast, Mordaunt disclosed she had been 'doing some press-ups' in preparation for today's role. She added she had been practising in rehearsals with weighted replicas, and her experience in the Navy helped prepare her to stand for long periods of time without fainting. Mordaunt was responsible for bearing The Sword of State and presenting The Jewelled Sword of Offering to the King - the first time it has been carried and presented by a woman.",
        "Dressed in a custom-made teal outfit with a matching cape and headband with gold feather embroidery, Mordaunt held the pieces for the majority of the service.Notable figures including a number of fellow MPs praised her, with Labour MP Emily Thornberry tweeting: 'Got to say it, @PennyMordaunt looks damn fine! The sword bearer steals the show.'Author and columnist Caitlin Moran also commented on the social media buzz around Ms Mordaunt's role, saying: 'Penny Mordaunt's sword is the 'Pippa Middleton's Bum' of the Coronation.'Labour MP Chris Bryant said in a tweet: 'The Penny is mightier than the sword.'",
        "Ms Mordaunt, who is also the Leader of the House of Commons, explained: 'The Lord President of the Council is really the chairman of the King's Privy Council.'It used to be the executive for the King, and it still does a lot of business and it's an important part of our constitution and the authority that we have in Parliament.'On the day I am representing the King's authority, and I am going to be doing a number of things.'",
        "She carried the 17th-century Sword of State in procession to the abbey.",
        "Its silver-gilt hilt features the form of a lion and unicorn and the wooden scabbard is covered in red velvet with silver-gilt rose, thistle and fleur-de-lis emblems.Later in the ceremony Ms Mordaunt exchanged the Sword of State for the Jewelled Sword of Offering and delivered it to the archbishop.The second sword was briefly clipped to the King's coronation sword belt and then after a proclamation by the archbishop, the King stepped forward and offered up the sword.It was then placed on the altar and redeemed with 'redemption money' by Ms Mordaunt.The sword was later drawn and she carried it in its 'naked' form - without its scabbard - before the King for the rest of the service.",
        "The Jewelled Sword of Offering has a hilt encrusted with diamonds, rubies and emeralds and a scabbard decorated with jewelled roses, thistles and shamrocks.It symbolises royal power and being able to decide between good and evil, and the King accepting his duty and knightly virtues.Asked about being around the King with a 'big pointy sword', Ms Mordaunt admitted she did feel 'a terrible weight of responsibility'.",
        "Discussing how she feels the ceremony fits into modern life, Ms Mordaunt added: 'I think this is really important to the country. I think the monarchy survives and persists because it adapts and it changes and it's always relevant.'And I think that in this coronation, yes, it is going to be royal and marvellous and mystical and spiritual and everything that you would expect it to be, but it will be modern as well.'And there's always great chat before an event like this, has it gone too far one way? Has it gone too far the other way? And we always get it absolutely spot on.'And I think that it's an important moment for the country. I think the country is proud of the monarchy and the royal family and the service they play.",
        "'They provide stability, we saw that most profoundly last year. And they provide continuity and I think as far as how we're known by the rest of the world, they're a huge part of our story.",
        "'I just hope everyone has an amazing weekend, I know that is what the King would wish.'Back in September, she officially announced the Queen's death and proclaimed Charles as Britain's new King in front of the Accession Council. She was applauded online for doing an 'outstanding job' during Saturday morning's 'moving and sombre' ceremony.Twitter users pointed out that Ms Mordaunt, who was appointed to her new role by Prime Minister Liz Truss, had little time to prepare for the Accession Proclamation but still managed to be 'very polished' and spoke with 'authority', according to spectators."
    ]
}