{
    "articleURL": "/wires/pa/article-12052937/Coronation-music-feature-Welsh-nod-Philip-Lloyd-Webber-anthem.html",
    "content": [
        "The music selected for the coronation of the King will nod to his late father and feature new pieces by Andrew Lloyd Webber and Debbie Wiseman.",
        "At 11am, Charles and Camilla will enter Westminster Abbey before the choir sings Hubert Parry’s I Was Glad, composed for the coronation of King Edward VII.The choir, joined by opera and concert singer Sir Bryn Terfel, will perform the Kyrie – which will be sung in Welsh for the first time.",
        "After Charles takes the oath, he will sign copies presented by the Lord Chamberlain, as the choir sings an anthem by 17th century composer William Byrd.Gloria, also by Bryd, will “frame” the monarch’s prayer as he kneels before the high altar.Later, the choir will sing the Alleluia, newly commissioned by Wiseman, while St Augustine’s Gospel Book, dating back to the sixth century, is carried to the nave.A second Alleluia, also by Wiseman, will be performed by the Ascension choir – a gospel choir handpicked for the occasion.The choir will also sing the Veni Creator Spiritus hymn in English, Welsh, Scots Gaelic and Irish.The Anointing, described as “the most solemn and sacred part of the service”, will be accompanied by Handel’s dramatic Zadok The Priest, which was composed for the coronation of King George II in 1727.The piece has been sung prior to the anointing of the sovereign of every British monarch since its composition.",
        "The Byzantine Chant Ensemble will also sing in Greek in tribute to Charles’ late father, the Duke of Edinburgh.Charles has also personally requested that the Wiener Philharmoniker Fanfare is played by the Coronation Brass Ensemble during the crowning portion of the ceremony.The choir will sing an anthem by 16th century composer Thomas Weelkes, followed by the enthroning.The homage portion of the service will conclude with a fanfare, and the choir will sing an anthem arranged by John Rutter for the Coronation of King George VI.",
        "Following the the coronation of Camilla, a new anthem, Make A Joyful Noise, composed by Lord Lloyd-Webber, will be sung by the choir.The impresario – known for hit musicals including The Phantom Of The Opera, Evita and Jesus Christ Superstar – has drawn on the words of Psalm 98 for his piece.He is expected to be inside the abbey to witness the debut.Before the end of the service, there will be a performance of Sanctus, composed for the service by Roxanna Panufnik.Following the conclusion of the service, the choir will sing an anthem by William Boyce, composed for the coronation of King George III in 1761, and the Te Deum, written for the coronation of the late Queen.When the newly crowned King and Queen Consort make their exit from Westminster Abbey at 1pm, they will embark on their coronation procession back to Buckingham Palace in the Gold State Coach.",
        "Pieces performed during the procession will include Coronation Bells, The King’s Company and The King’s Guard.The procession music will end with a rendition of the National Anthem in Buckingham Palace Gardens before three cheers are given to the King."
    ]
}