{
    "articleURL": "/news/article-12038697/Inside-California-theme-park-known-five-decade-history-world-records-scandals.html",
    "content": [
        "Throughout a five-decade stint at the top, Six Flags Magic Mountain has earned a glowing reputation among thrill seekersLast year, the California location captured the world record for most rollercoasters in a single park when it opened its 20th ride But the celebrity hotspot has endured a tumultuous history, including numerous deaths and coaster disasters that threatened to derail its legacy Screaming across 209-acres on the California coast, a towering theme park has earned a place among the most sought-after attractions for adrenaline junkies for five decades. ",
        "Last year, Six Flags Magic Mountain opened its 20th coaster - the fast-paced behemoth 'Wonder Woman: Flight of Courage' - topping off its lucrative history which has included a series of scandals, deaths and disasters.Given its location just 30 miles from Hollywood, the hotspot has also become known for surprising celebrity sightings, with injury-hit Jeremy Renner in April and Madonna among those seen enjoying the park in recent months. Opening its doors more than 50 years ago, the park announced itself onto the scene in 1971 with an impressive 33 attractions and a mere $5 entrance fee for adults. Within five years, Magic Mountain became the first park in the world to have a full 360-degree looping rollercoaster, appropriately dubbed the 'Great American Revolution'. Alongside several other groundbreaking coasters, its lineup of top-tier attractions also included was Barbra Streisand, who become the first of a long list of headliners to grace the stage at the Showcase Theater.",
        "The iconic park would continue to add to its rollercoaster lineup over the years, including hosting the world's fastest dual-track coaster, Colossus, in 1978. But 1978 turned out to be a disastrous year for the park, beginning with the death of Terry Fowler, a mechanic, in January when a car from the Grand Prix ride collapsed on top of him. ",
        "His body was only discovered the following morning by his father, who had gone to look for him.  Just a month later, a pair of newlyweds were sent crashing to the ground after they violently rocked the 'Eagles Flight' sky-ride, killing the husband while his new bride sustained critical injuries.  And not long after its high-profile opening, Colossus made headlines for the wrong reasons in December that year, when 20-year-old attendee Carolina Flores plummeted to her death after falling out of the ride, reportedly because her obesity prevented the ride's safety bar working. Amid fears for its safety, the park introduced a period of time where one of the Colossus cars' simultaneous rides was sent around the track backwards. Despite the setbacks, the coaster has remarkably remained on its original wooden structure since it was first sent round the track. In 2014, the park announced the iconic coaster would be shuttered, and it set up a 36-hour riding marathon to send off the theme park staple. But in September, the ride was struck by tragedy again, when it unexpectedly caught fire. Less than two weeks after its closure, Six Flags announced the recovery would instead become a grand re-opening in 2015, under a new moniker: 'Twisted Colossus'. Several other rollercoasters at the park have also come under scrutiny for accidents over the years, including in 2014, when the 'Ninja' ride was plunged into chaos. ",
        "While visitors were flying around the track, a pine tree branch fell into its path, causing the first car to derail with the riders aboard. Four people were injured and two were hospitalized, however the coaster was back up and running just twelve days after the incident. ",
        "Despite several deaths plaguing the park's time at the top, the most notable scandal in its history came with no deaths and, surprisingly, no arrests. In the wake of the infamous Rodney King trial in 1993, a mass brawl took over the grounds and sent dozens of people to hospital when a popular rap group descended on the park. According to reports from the time, hundreds of youths wreaked havoc throughout the estate, firing live ammunition and looting stores in what police described as a 'devil's brew' of gang related activity, release of tension over the trial's conclusion, and bad preparedness by the park. Around 500 LA County sheriff's deputies and California Highway Patrol officers were sent to confront the rioters, with the hours-long melee costing the sheriff's department $285,000. In all, 40 people were treated for minor injuries, 16 were rushed to two nearby hospitals with more serious wounds, yet no arrests were made. Thankfully, the disasters have done little to dissuade A-listers from making the short trip over from Hollywood to the location in Venice, California. ",
        "In April, an Jeremy Renner spent the day at the park with his family, which he said was 'magic on the mountain' on his road to recovery after he was crushed by a snow plow. Other big names who have stopped by in recent times included Madonna, who visited the site with her often-unseen adopted daughter Mercy James, and Nick Cannon, who reportedly rented out the entire park to celebrate his twins' birthdays in May. Other famous faces seen at the theme park include Paris Hilton and Leonardo DiCaprio, while Demi Moore's decision to hold her 30th birthday party at the park in 1991 brought a flood of celebrities such as Sylvester Stallone and his wife Brigitte Nielsen. ",
        "The site has maintained its position as one of the premier theme parks in America, with rollercoaster fanatic Martin Lewison, nicknamed 'Professor Rollercoaster', praising the site for its 'really good, eclectic mix of rides'. 'Six Flags Magic Mountain has definitely tried to be a cutting-edge leader in terms of what kinds of coasters it builds,' he continued to CNN.Before the pandemic, attendance at the park had been steadily increasing, according to theme park data site Queue Times. After peaking in 2019 with over 3.6 million attendees, the 2020 Covid-19 pandemic saw the number of visitors plummet to just 683,000 people. ",
        "This number rebounded to just over 3 million thrill-seekers the next year, the highest attendance rate at the park since 2014. ",
        "The theme park has also earned several records through its five-decade spell at the top, not least thanks to its current rollercoaster roster. Opening in August 2022, 'Wonder Woman: Flight of Courage' added to a growing list of superhero-themed rides in the park. Featuring a terrifying 127ft drop at its zenith, the twisting ride was an instant hit as it became the world's longest and tallest single-rail roller coaster. Found alongside other fan favorites including 75mph monster 'X2', which is consistently ranked among the best in the world, and 'Tatsu', the world's tallest, fastest &amp; longest flying coaster.With millions of people still pouring through the gates to experience the good, the bad and the ugly of rollercoaster mania, it's little wonder why the spot has become known as a thrill-seeker's paradise. "
    ]
}