{
    "articleURL": "/wires/reuters/article-12059705/Trump-rape-accuser-Carroll-not-hiding-lawyer-says-trial-nears-close.html",
    "content": [
        "Trump's lawyer calls the case an 'affront to justice'",
        "Jury due to begin deliberations on Tuesday(Adds details from rebuttal argument in paragraphs 1-2; new quotes from defense argument, paragraphs 11-13)By Luc Cohen and Jack QueenNEW YORK, May 8 (Reuters) - Donald Trump's absence from a trial where writer E. Jean Carroll accuses him of rape and defamation shows that \"he did it,\" a lawyer for Carroll said on Monday, while Trump's lawyer told jurors the case was \"outrageous.\"\"He never looked you in the eye and denied raping Ms. Carroll,\" lawyer Mike Ferrara told jurors as the civil trial in Manhattan federal court neared the end of an eighth day. \"You should draw the conclusion that that's because he did it.\"The six-man, three-woman jury was expected to begin deliberating on Tuesday.Carroll, 79, sued Trump, 76, alleging he raped her in a dressing room at the Bergdorf Goodman department store in Manhattan in 1995 or 1996 and then defamed her by denying it happened in an October 2022 post on Trump's Truth Social platform.In that post, he called her claims a \"complete con job\" and \"a Hoax and a lie.\"The former Elle magazine advice columnist is seeking unspecified monetary damages.Trump, who served as president from 2017 to 2021 and is the front-runner for the Republican U.S. presidential nomination in 2024, waived his right to testify at trial and opted not to present a defense, gambling that jurors will find that Carroll failed to make a persuasive case.",
        "He told reporters in Ireland last week that he would \"probably\" attend, but did not show up.Trump has accused Carroll of making up the story to drive sales of a 2019 memoir in which she made her claims public. In a video deposition played for the jury on May 3, Trump denied raping Carroll.\"It's the most ridiculous, disgusting story,\" Trump said in the video. \"It's just made up.\"In his closing argument on Monday, Trump's lawyer Joseph Tacopina said Carroll's inability to recall the date of the alleged incident made it impossible for Trump to defend himself by citing an alibi, and called the case an \"affront to justice.\"\"This is an absolutely outrageous case,\" Tacopina said.\"The facts in evidence make plain here that E. Jean Carroll's story is not worthy of your belief, not even close,\" he said.TRUMP'S 2005 'GRAB 'EM' VIDEO FEATURES AT TRIALEarlier on Monday, Carroll's lawyer Roberta Kaplan said a 2005 \"Access Hollywood\" video in which Trump says women let him \"grab 'em by the pussy\" bolstered the accounts of Carroll and other women who have accused Trump of sexual assault.\"He admitted on video to doing exactly the kinds of things that have brought us here to this courtroom,\" Kaplan said.",
        "During three days of testimony and cross-examination, Carroll said that during the attack Trump slammed her against the wall, put his fingers into her vagina and then inserted his penis.Two of Carroll's longtime friends testified that she told them about the attack shortly after it occurred and said they believed her. Jurors also heard from two other women who said Trump sexually assaulted them in separate incidents decades ago. Trump denies those claims as well.Kaplan did not specify the amount of money jurors should award Carroll in compensatory and punitive damages. She said Carroll had been unable to sustain a romantic relationship since the alleged rape, and that Trump's public criticism had harmed her client's reputation.\"For E. Jean Carroll, this lawsuit is not about the money,\" Kaplan said. \"This lawsuit is about getting her name back.\"(Reporting by Luc Cohen in New York; Editing by Will Dunham, Noeleen Walder and Howard Goller)"
    ]
}