{
    "articleURL": "/wires/reuters/article-12049113/Suns-head-home-aiming-win-series-vs-Nuggets.html",
    "content": [
        "The Denver Nuggets are halfway toward clinching a berth in the Western Conference finals but the Phoenix Suns surely expect to still mount a charge.",
        "The Nuggets held serve on their home floor and the Suns will look to do the same with Games 3 and 4 of the conference semifinal series. The Suns take aim at their first win in the series on Friday night in Phoenix.\"You've got to believe that it's going to come our way here soon,\" Phoenix coach Monty Williams said after Game 2. \"We've got to go home and take care of business. That's where we are right now.\"Denver prevailed by an average of 14 points in its two home victories, including a 97-87 Game 2 win that saw two-time MVP Nikola Jokic record 39 points, 16 rebounds and five assists.Jokic didn't make it a three-peat as Philadelphia 76ers star Joel Embiid was named MVP earlier this week. But Denver coach Michael Malone isn't concerned about it -- neither is Jokic -- with the bigger prize of reaching the NBA Finals sitting just six victories away.\"I marvel at his greatness,\" Malone said of Jokic. \"I marvel at his consistency, his excellence, his ability to find so many different ways to beat you, whether it's scoring, rebounding, playmaking ... he's not afraid of the moment.\"The Nuggets trailed by three points entering the fourth quarter of Game 2 before holding the Suns to only 14 points on 7-for-25 shooting in the final 12 minutes -- with Phoenix missing all nine of its 3-point attempts.",
        "Jamal Murray struggled to just 10 points on 3-of-15 shooting after pouring in 34 in Game 1. He looked at the stat sheet afterward and knew Jokic was responsible for carrying the team to the victory.\"I mean, 39 and 16, five dimes, while everybody else is struggling,\" Murray said. \"Man, no hesitation from him. Just dominating down low and from 3, both ways. Staying aggressive all game, uplifting us during timeouts, just full belief in us the whole time while he's taking over and picking up everybody's slack.\"Meanwhile, Phoenix is expected to be without point guard Chris Paul due to a groin injury he sustained in Game 2. Paul also could miss Sunday's Game 4.Paul sustained the injury while battling for a rebound in the third quarter.\"He just looked like he was boxing out,\" Williams said of Paul. \"He just came up where he couldn't push off of it or anything.\"Cameron Payne is slated to start in place of Paul. He scored two points on 1-for-7 shooting in 17 minutes in Game 2, with the Suns a minus-16 while he was on the floor.The loss of Paul will leave it up to Devin Booker and Kevin Durant to shoot the Suns back into the series.",
        "Booker is averaging 31 points and seven assists in the first two games, while Durant is averaging 26.5 points and 11 rebounds.Booker has assured his teammates that the series is far from over and felt he received the right responses.\"It's just a feel,\" Booker said. \"It's part of leadership, just trying to be effective in what you say and approach different people different ways. I've had a lot of different teammates, a lot of different coaches, so I've seen what works and what doesn't. I think we have a group that everybody believes in us still and we just take it from there.\"The Suns could use a boost from center Deandre Ayton, who is averaging 14 points and 7.5 rebounds while being outplayed by Jokic.The Nuggets figure to rely again on Jokic in Game 3. He posted 9-for-21 shooting while producing 24 points and 19 rebounds in Game 1. Then he fired up 30 shots, making 17, in his supreme Game 2 effort.\"I love an aggressive Nikola Jokic,\" Malone said. \"He can take over a game. He can beat you in a lot of ways. ... I love a guy who's getting to the basket, imposing his will upon the other team.\"--Field Level Media"
    ]
}