{
    "articleURL": "/tvshowbiz/article-12052119/Perrie-Edwards-launches-mental-health-campaign-struggles-left-felling-die.html",
    "content": [
        "If you have been affected by this story, and are in the UK, call The Samaritans at any time, from any phone for FREE, on 116 123 or call Mind's Infoline from Monday to Friday on 03001233393 or text 86463. Perrie Edwards took to her Instagram on Friday to share an array of stunning shots as she launched her mental health campaign with charity Better Help. ",
        "In the post the Little Mix star, 29, candidly opened up about her own struggles while offering one follower a month's free therapy.Perrie has previously shared details about her crippling anxiety which left her feeling like she would die if she was left alone.And back in 2019, she praised her Little Mix bandmates for stopping her quitting her music career after she found herself in a 'dark place'.Promoting the campaign, the songstress looked sensational in a chic black jumpsuit in an exclusive image shared with MailOnline. ",
        "Going barefoot, she opted for minimal make-up and wore her blonde tresses loose as she accessorised with gold jewellery. Taking to Instagram, she penned:' I've found that opening up about my mental health has really helped me to better understand and take control of my anxiety. 'Therapy is something that I truly believe everyone can benefit from but sadly it's not always accessible.'I'm so excited to announce my partnership with @betterhelp Together, we're on a mission to make therapy accessible and to break the stigma around mental health.'She continued: 'This is an opportunity for YOU to give therapy a try by having access to one FREE month of therapy. You'll be matched with a credentialed therapist and at the end of the month you will decide whether you would like to take it further.'",
        "'We're giving away up to £3,000,000 worth of therapy to help you prioritise your mental health and start your journey towards healing'.Going on to say: 'My heart leapt when I was offered the chance to partner up with @betterhelp to provide people with the opportunity to start their therapy journey and to just encourage people to ask for help'.'I know that this is only the first step but I hope that it helps as many of you as possible'.Before adding: 'Join us in spreading the word and making mental health a priority. Go to betterhelp.com/perrieedwards to get your free month started'.",
        "In a candid 2019 interview with Glamour, the talented singer opened up about her struggles, saying she thought she was having a heart attack when struck by extreme anxiety, and that she developed a fear of being left on her own.She said: 'Weirdly when I first started experiencing the panic attacks, I developed a fear of being on my own. It's a lot better than it was, I kept thinking, 'if I'm on my own and I have a panic attack, what do I do?' 'It's like battling with yourself – my mum got me dolls to paint and I would sit there shaking when she left the house for two minutes… At first, I was like 'don't leave me on my own, I will literally die'. ",
        "She said her mother would take her phone with her when she shopped so she could be on hand if Perrie suffered an attack, as well as accompanying her to work.The star also admitted she feared not being able to perform, tour, do interviews and meet fans due to the severity of her condition.She said: 'If I didn't have the other three girls to think about and the tour to prepare for and all the fans that want to see the show to be the best it can be, I don't think I would have come back to work. 'I was happy to be at home with my family with Hatchi and call it a day. It was that daunting trying to go back to everything.' The DNA singer said her anxiety had made her fearful of going out on her own, adding that trains leave her feeling 'claustrophobic', but that going into therapy had changed her life 18 months on.",
        "She said: 'Therapy helped hugely by speaking to someone who has no idea what's going on in your life, you just let it all out and it's the best thing in the world. 'At first, I was so embarrassed because I thought if I tell everybody I've been to therapy, they're going to think I'm nuts. ",
        "'I thought people are going to think I'm mental and at one point I thought my mum was going to have to send me somewhere because I was having these dark thoughts, I was thinking differently to the way I would.' She is now able to travel on her own and get in a car to visit Alex in Manchester.  The star also credited the support of her family, friends, beloved dog Hatchi and loved ones for helping her through the difficult time, with her cousin and best friend Ellie moving in with her.                  If you have been affected by this story, and are in the UK, call The Samaritans at any time, from any phone for FREE, on 116 123 or call Mind's Infoline from Monday to Friday on 03001233393 or text 86463."
    ]
}