{
    "articleURL": "/news/article-12040035/Halls-Creek-Broome-youth-crime-forces-policewoman-cancel-van-holiday.html",
    "content": [
        "SA policewoman Keely Allport travelled in WAShe said she was robbed and targeted by gangs An experienced cop has been forced to abandon her holiday plans after falling victim to criminal youth gangs in two different Outback towns, saying she'd never experienced such brazen crime in all her years on the force.",
        "Keely Allport and her partner have been travelling Western Australia in their van but had their holiday quickly cut short after suffering a string of crimes in the state's north last week.Ms Allport said the pair had checked in to accommodation in Broome to celebrate her partner's birthday on April 24.They were woken early the next morning by the sound of four youths stealing their credit cards and cash. 'I'm fully aware of the problems that happen in small communities with youth crime,' she told the ABC.'It's not that I'm a naive traveller; I'm very aware and very safety-conscious travelling to remote areas.'But it was the brazen nature of the crimes that left her shocked. ",
        "They managed to chase the gang of four away from their accommodation and decided to move onto Halls Creek, a small town about 685km east of Broome, on Saturday.It was there the couple decided to abandon their WA plans altogether.She explained a gang surrounded their van while they were parked at a service station and began shaking and throwing rocks at their vehicle at about 10am.'What happened in broad daylight at 10 o'clock in the morning in front of a lot of people, I've never encountered that,' she said. Ms Allport has worked as a police officer for nearly 17 years - eight of which she spent working in South Australia's remote northwest Anangu Pitjantjatjara Yankunytjatjara (APY) region. ",
        "On top of her experience in the police force, Ms Allport joined several Aussie travel community pages and thoroughly researched the pair's holiday destinations. She explained the majority of red flags she'd come across were for regions in the Northern Territory, specifically around Alice Springs. She said the incident left her 'shocked' and 'traumatised' both her and her partner.'Every noise that we hear wakes her up and it wakes me up, we're just constantly on edge,' she said.They have since decided to 'salvage' their trip by heading over to Queensland.While Australia's attention has been focused on the growing youth crime epidemic in the Northern Territory, the frightening trend has also been suffered in remote WA.",
        "Concerns for the region peaked in December last year with Halls Creek residents saying they no longer felt safe to go out at night due to gangs like the '6670 Boys' who are inspired by postcode violence in Sydney.The '6670 Boys' still run rampant in the town and regularly post videos of children hooning in seemingly stolen cars on TikTok.One of the town's estimated 4,000 residents, Kirsten Thomson, said the community had become 'totally lawless'.'These kids are now attacking people to steal from them . . . so I don't go out at night anymore,' she told The West in December."
    ]
}