{
    "articleURL": "/tvshowbiz/article-12057823/Shemar-Moore-calls-CBS-social-media-declares-cancelation-SWAT-f-ing-mistake.html",
    "content": [
        "Actor Shermar Moore is calling out CBS for canceling its procedural action drama series SWAT after a six season run on the network.",
        "The show's lead actor, whose been on the series since its premiere in November 2017, took to his Instagram page over the weekend to share his thoughts on why he doesn't agree with the move.First up in the clip, Moore revealed that he was wearing sunglasses at night because he's feeling sad over the decision to cancel the show.'I'm a lot a bit sad. We got canceled, SWAT. SWAT got canceled. It makes no sense.,' he said in almost disbelief, while leaning back on his couch seeming inside his home.'Look up the articles, read the articles. We're the best show on Friday night at 8 o'clock for CBS. The last two years we've been killing it. Us and the fire show.. The fire show that comes on right after us,' he explained.",
        "Moore, 53, continued to make his case by brining race into the equation.'We've done nothing wrong. We did everything that was asked for. Let me tell a truth: did you know that I am the only African American male lead on network television? Not streaming, not cable — network television.'He then reiterated it again: 'I am the only African American male lead on network television. Now let's get beyond me. SWAT is the most diverse show on CBS,' Moore continued. ",
        "'CBS, when I got hired to be Hondo on SWAT, was getting a lot of flack for lack of diversity. If I post this, and I think I might, I will get in a lot of trouble with CBS because I'm calling them out. Because they've been wonderful to me for 26 out of my 29-year career.'It's at this point that the Oakland, California native revealed that he and others on the show 'were led to believe last week — and the week before, and the week before that — that we would have some semblance of a season seven to at least say goodbye, if not continue. And to abruptly be told, You're done.\"'Moore went on to explain that the cancelation of SWAT is matter of politics, saying, 'It's all about money.''They said we're cancelled, but guess what? I don't think we're done. CBS is either gonna wake up and realize they made a mistake. Sony is gonna do their math and realize that this is not the right move,' he added.'I hope we can have a kumbaya and come back together and continue this show, because it's a good time for families across the world.'",
        "Moore then directed his thoughts towards his fellow cast and crew on the series, which is based on the 1975 television show of the same name created by Robert Hamner.",
        "'If it is the end, life will go on. I'm not worried about me. I care about my family, my crew, the writers, the producers, the caterers, the wardrobe, the sound mixers, the teamsters, the construction crew,' the actor explained., adding, 'That's a whole lot of people that are abruptly being told that you don't matter. \"Sorry. Thanks for your services. Good luck in finding a new job.\" And to me, that's not OK.'Moore, again, turned his thoughts to the team he has worked with since 2017.'I will be fine, but I'm upset because I busted my whole entire a** to prove that I could do this, and I did prove that I could do this. But I am also humble enough to know that I did not do this alone,' he shared.He proceeded to make his case by sharing how the show has only increased its viewership over the years.'The world took us in and embraced us, and the ratings have only gotten better and better and better,' Moore explained, 'I'm not bitter. I'm a little bit sad. I understand it's not personal — it's business — but I still have faith that SWAT will live to see another day. I don't know where, I don't know how.'",
        "Moore urged people to get vocal and let CBS know that canceling SWAT is a bad decision.'So I'm asking my homies, my fans and my baby girls; and the rest of the world who follow me or follow the show, follow the cast, my brothers and my sisters: Make some f***ing noise. And let them know that canceling SWAT is a f***ing mistake,' he said.The leading man reiterated that by sharing his thoughts and feelings it could get him 'in a lot of trouble.''I'm making this video because a lot of lives are at stake, and I don't think this is OK, Moore said before concluding, 'Anybody who works with me, I've got nothing but love for, nothing but respect for you. Nah, this ain't the way to go out. If we're gonna go out, cool, but let us go out right.'Along with Moore, who played Sergeant II Daniel 'Hondo' Harrelson Jr., the cast of SWAT also includes Stephanie Sigman, Alex Russell, Lina Esco, Kenny Johnson, Peter Onorati, Jay Harrington, David Lim, Patrick St. Esprit, Amy Farrington and Rochelle Aytes."
    ]
}