{
    "articleURL": "/news/article-12044605/QLD-Horrific-attack-Leslie-Stephen-Erik-Siganto-puts-blowtorch-mans-genitals.html",
    "content": [
        "Judge said the attack was 'disgusting and appalling' Leslie Stephen Erik Siganto brutally assaulted victim A man has been sentenced over an unprovoked attack where he put a blowtorch to his victim's genitals and smashed his knee with a hammer. ",
        "Leslie Stephen Erik Siganto, 40, was sentenced to four years' jail at Beenleigh District Court in the City of Logan, Queensland, on Wednesday.The court heard Siganto brutally attacked a 30-year-old man, who he met at an Upper Coomera property, for no reason on August 4, 2021.  ",
        "Siganto threw a knife at the victim, who had taken an illegal drug called GHB (gamma-hydroxybutyrate), and verbally abused him, calling him a 'dog'.Siganto forced the man into his car and drove to his house where he put a blowtorch to the victim's penis and face, burning his eye, the Gold Coast Bulletin reported.He also smashed his victim's knee with a hammer, threw a lit cigarette at him, made him pull his pants down and threatened to put an arrow or bullet in his knee.Siganto also threatened to shoot the victim if he went to the police to report what had happened.'If I ever hear you called the police you are going to know about it,' he said. 'I'm going to shoot you.'Siganto also forced the man on to a bed and carved letters into his skin with a knife, and stole the victim's phone, watch and money, the court heard.He pleaded guilty to seven counts of assault occasioning bodily harm while armed in company, one count of armed robbery in company and deprivation of liberty.",
        "The court was told that the victim is physically, mentally and emotionally scarred from the vicious assault and has suffered post-traumatic stress disorder.In his victim impact statement, the man said he feared for his life, has severe anxiety and installed security cameras in his home to help cope with his ongoing trauma.'This was appalling and demeaning behaviour. The way you treated him was disgusting,' Judge Brian Devereaux said.Siganto will be eligible for parole on August 10 after already serving 747 days in pre-sentence custody."
    ]
}