{
    "articleURL": "/health/article-12054321/Has-Covid-created-generation-germaphobes.html",
    "content": [
        "Theo Panteli is still scared of Covid-19 and washes his hands for 20 seconds He tells ill friends to stay away and refuses to drink out of cups while at school Most eight-year-old boys have to be reminded to wash their hands. But not Theo Panteli.",
        "For the past three years, Theo has been hooked on a rigorous routine of scrubbing them at the sight of a tiny speck of dust, often several times an hour.Each time it has to be exactly 20 seconds – as long as it takes to sing Happy Birthday twice, which he picked up from an announcement by Boris Johnson, the former Prime Minister, at the height of the pandemic.And it’s not just his hands. Theo won’t drink out of cups at school, even if they are clean. He asks other children to keep at least 2ft away from him when they’re ill. He won’t even hold the hand of family members.All of these behaviours are driven by a fear of catching a virus which could harm him or his family. They are also the classic symptoms of the mental health condition called obsessive compulsive disorder, or OCD.",
        "Sufferers experience intrusive, unpleasant thoughts and attempt to tackle the anxieties with repetitive behaviours.The type of behaviours are dependent on the nature of the fear. Studies show that in around 40 per cent of cases, the fear is contamination. Other common examples include worries about being burgled, resulting in obsessive checking of locks on windows and doors.The condition can often be triggered by traumatic life events. In Theo’s case, this was the Covid pandemic, which began when he was just five.",
        "‘As a baby, he didn’t have these problems,’ says his mother, Tas, a 31-year-old part-time medical secretary from Hertfordshire. ‘Then Covid turned Theo’s life upside down. He would follow everything that was happening in the news about the pandemic because he wanted to know when he could see his family and go back to school.‘That’s when he started washing his hands obsessively – I think because he thought it would help get things back to normal.‘He was really excited to go back to school and see his friends. However, his fear of germs hasn’t gone. He is still worried there will be another lockdown.’Theo has been referred to see a local mental health specialist but the family has been told to expect a long wait before an appointment.Alarmingly, Theo is not alone. Experts have told The Mail on Sunday of concerns about a recent rise in contamination-related obsessive compulsive disorder among school children. In many cases, they say, the problem was sparked by the events of 2020 and 2021. Some have warned that NHS mental health services could be dealing with this growing tide of OCD for years to come.‘Public safety promoting social distancing and mask-wearing had a much more pronounced effect on children than most people expected,’ says Dr Zenobia Storah, a Manchester-based consultant child psychologist.",
        "‘I still regularly see children with red-raw hands from the amount of handwashing they do and kids who refuse to go to school because they’re afraid of catching something. It’s worrying because OCD can stay with them for the rest of their lives.’The Mail on Sunday has heard from parents with children as young as three who use antibacterial handwash compulsively and avoid other children for fear of catching a virus.Around 750,000 people in the UK live with OCD. Of those, an estimated 35,000 are children.The condition can strike at any age, but it typically develops in childhood. Some are able to manage their compulsions with treatment, which usually involves regular sessions of cognitive behavioural therapy with a psychologist and, sometimes, antidepressants.But, in half of cases, treatment fails to keep the condition under control and patients remain unable to do everyday activities such as socialising and going to work. Some sufferers struggle to even leave the house.",
        "It is not the first time that a global health crisis has triggered a rise in contamination-related OCD.‘We’ve seen increases in contamination OCD at points where infectious diseases are in the national conversation,’ says Dr Emma Citron, a private clinical psychologist in London. ‘It was documented during the AIDS epidemic, along with the swine flu outbreak in 2009.",
        "‘While the behaviour of someone with OCD may be irrational, the basis of their anxiety is often genuine. But this anxiety can lead to intrusive thoughts about the worst possible outcome.‘Eventually sufferers reach a point where they believe if they touch something dirty or don’t wash their hands properly, something bad is going to happen.’In the first six months of 2020, when Covid was rife, OCD referrals to mental health services rose significantly in several countries. And many of those who have already been diagnosed found that their symptoms either returned or got worse.In the UK, there was a startling rise in the condition among children. One study, carried out at Central and North West London NHS Foundation Trust, revealed that the number of children referred to mental health services for OCD rose by more than 30 per cent on the previous year. Meanwhile, nearly 70 per cent of children with OCD became more unwell. The researchers noted that many reported fears of infection and contamination by Covid.Three years on, experts are still seeing children with these fears.‘We’re still regularly treating children with contamination fears that originated in Covid,’ says India Haylor, head therapist at the London clinic OCD Excellence. ‘We’ve found that kids under ten were susceptible to the public safety messages used during the pandemic.",
        "‘These are formative years. Now that they’ve grown up a bit, these patterns of behaviour have become set in stone.’Ms Haylor adds that these children have been especially difficult to treat. ‘Usually we explain to children that their behaviour isn’t good for them,’ she says. ‘But I’ve had kids who say, “But the Government says I should be doing this.” ’OCD commonly begins to develop around the age of five, with symptoms becoming pronounced by six or seven, according to studies. However, experts are concerned about an unusual focus on cleanliness in some of today’s three- and four-year-olds.While it may not be full-blown OCD, these children are at higher risk of developing it in the future, they say.Ms Haylor says: ‘You can’t treat a three-year-old for OCD because they’re too young to really understand what they’re doing, but you can treat the mum or dad who are the source of the anxiety.‘Young children pick up the behaviour of their parents very quickly, so you’ve got to be super scrupulous to make sure nervous behaviour isn’t passed on.’One child affected by the fallout from the pandemic is three-year-old Stella Jones, daughter of Sofia Jones, 30, a solicitor from London.‘She was born during Covid and all she has known since then is a world which is hyper-focused on cleanliness,’ says Sofia.",
        "‘I carried antibacterial handwash everywhere with me during the pandemic, and now Stella wants to use it too. She’ll point at the bottle and keep gesturing until I give it to her. It’s got to the point where I’ve had to buy Stella her own one to keep her calm.’Sofia says that despite the fact her daughter is too young to understand what germs are, she is already showing signs of anxiety over hygiene. ‘When I’d come home from work during Covid, I’d always wash my hands thoroughly before I touched Stella because I’d been on the Tube.‘Now she always wants her hands washed too. When she is eating and gets stuff on her hands, she’ll hold them out for me to clean them. She doesn’t know what Covid is but she sees crumbs and dirt and gets concerned. It feels like she associates dirt with bad things.’Sofia adds: ‘She’s at an age where I’m beginning to worry if this is a permanent thing. I worry that she’ll miss out on fun childhood things like finger painting and playing in the playground. I don’t want her to become obsessive about cleaning, like me.’",
        "An unusual interest in hygiene isn’t necessarily something to worry about.‘It’s common for some young children to take a keen interest in cleaning and making sure things are in the correct place,’ says India Haylor, head therapist at London clinic OCD Excellence. ‘Having this interest doesn’t necessarily mean that the child has obsessive compulsive disorder.’But how do you know when it becomes a serious mental health problem?‘One of the tell-tale signs is when a child becomes very distressed when they can’t – for whatever reason – do their cleaning ritual,’ says Ms Haylor. ‘There will almost certainly be tears and a meltdown.‘Those who don’t have a mental health disorder should be able to cope without the behaviours.’The NHS suggests that parents consider seeking psychological help if their children start repeating their cleaning rituals very frequently – for example, several times in an hour – or if not doing them severely affects their mood.The NHS website advises that children with obsessive compulsive disorder may often be late for school because of their cleaning rituals, or they may refuse to leave the house for fear of going anywhere if they haven’t carried them out.",
        "There is also concern that schools are still encouraging an obsessive relationship with hygiene.‘We’re still hearing about schools telling children they need to wash their hands before every class,’ says Arabella Skinner of the parent group Us For Them. ‘All this does is terrify children and make them believe that their bodies are dangerous and can kill others.’The problem is compounded by the dearth in mental health services for young children, experts say.Recent research, carried out by the political magazine The House, suggests that a quarter of a million mentally unwell children in the UK can’t access the services they need.This is largely due to the unprecedented rise in referrals since March 2020.NHS figures show that, prior to the pandemic, the number of children aged six to 16 with a mental health problem was one in nine – that figure is now one in six.‘This rise in OCD cases has come at a time when it is more difficult than ever to get treatment on the NHS,’ says Dr Storah. ‘It’s really concerning, because most mental illnesses need to be tackled early.’Dr Storah adds that half of all life-long mental health conditions develop by the age of 14.But some children can overcome their contamination fears.Six-year-old Vivaana Doodhmal became highly anxious about infection control during the pandemic. Her mum, Jeroo, 39, an author from London, says: ‘There was a lot of uncertainty about how you could be catch Covid at the beginning, and I think I passed on my anxieties and paranoia.‘Eventually Vivaana became fearful of other people and would ask to cross the street if anyone was walking towards us. She wouldn’t want to play with other kids or touch mud and grass. And she would wash her hands all the time, while singing the Happy Birthday song twice, just like they were taught in nursery.’Eager to calm her daughter’s anxieties, Jeroo wrote a book, called Pip &amp; Henry’s Bug Hunt, which tries to explain the difference between ‘naughty bugs’ – such as Covid – and ‘good bugs’ that children come into contact with every day and are harmless.‘It helped her realise that the world isn’t a scary place filled with evil creepy crawlies,’ says Jeroo. ‘That, combined with our more relaxed attitude after vaccination, meant that Vivaana got over the anxieties.‘She’s quite a fearless kid now and loves playing with her friends.’"
    ]
}