{
    "articleURL": "/tvshowbiz/article-12053825/GMB-viewers-left-hysterics-Coronation-Special.html",
    "content": [
        "Good Morning Britain's Coronation Special descended into chaos on Saturday morning after a presenter appeared to swear live on air.  ",
        "The ITV show, which was presented by a range of hosts including Ben Shephard, Kate Garraway and Susanna Reid, focused on the build-up to the momentous occasion.Susanna was presenting a link in which she was preparing to cut to Kate at Buckingham Palace as she told viewers: 'Now many people would say she is and has been one of most vilified figures in Britain, today she will be crowned Queen.'The public mood towards Camilla, the Queen Consort, has definitely softened in recent years, she is now considered one of the most senior royals of course. Kate is at Buckingham Palace.' But as Kate began to speak when the camera cut to her, viewers heard a voice who they wrongly assumed was Susanna which said: 'B***h, it is not good' before Kate promptly carried on with her broadcast.The expletive was uttered by correspondent Petronella Wyatt, who later admitted she was responsible for the gaffe, but not before viewers blamed the long-serving host. ",
        "A debate involving amused viewers then erupted on Twitter, as they queried how the blunder occurred and if it was Susanna who said the rude word.One person wrote: 'I can't rewind tv, but was someone's mic still on, called someone a b***h?'Another said: 'I swear someone just said b***h as it went to Kates part' while a third added: 'Susanna and Ben blushed and smirking says everything. It was defo their convo when we overheard the word 'b***h in GMB.'",
        "Someone else penned: 'Did I just hear Susanna off camera on a live mic say b***h?'While a separate person reacted with laughing emojis as they shared a clip of the moment. and someone else wrote: 'Swear someone just said b***h in the background while talking about Camilla.'And another penned: 'I'm obsessed with it not even being 8am and Susanna has called someone a b***h off camera. Coronation day is brightening up!' Meanwhile, journalist Petronella Wyatt claimed it was her who had sworn and a mic had picked it up.She said: 'Oops. Was off air this morning when a mike picked me up having a private chat about how a royal had been unfairly smeared in some quarters as a b….. apologies if anyone thought it referred to them. It didn't!!'",
        "Elsewhere on the show, Richard Gaisford, Nick Dixon and Nitya Rajan reported from key locations around central London.Susanna began the programme by speaking exclusively to the First Lady of Ukraine, Olena Zelenska.She told Susanna that she hoped to thank King Charles in person at the Coronation for the UK's support of Ukraine as their war raged on.Olena said: 'This is a great honour. We really believe this is an honour to be present at such an historic event and for us, it's important that Ukraine is one of the countries present.",
        "'This is another huge sign of support from Great Britain during such a hard time for us. I hope very much that I will have a chance to thank His Majesty in person for the invitation and to greet him on behalf of all Ukrainian people and The President of Ukraine.'Later, Mel B reflected on meeting Charles, who was then the Prince of Wales, with her bandmates while she was in the Spice Girls and said: 'We were all so excited on the day, we all just kind of freaked out a little bit and we broke protocol. I don't think I'd do that again though!'"
    ]
}