{
    "articleURL": "/wires/aap/article-12055489/Scott-keeps-chase-PGAs-Wells-Fargo-Championship.html",
    "content": [
        "Adam Scott has maintained his pursuit of a 15th PGA Tour title with a third-round 4-under-par 67 leaving him tied for third place at the Wells Fargo Championship in North Carolina.",
        "The Australian scored six birdies and two bogeys to finish level with England's Tyrrell Hatton at 11 under for the tournament heading into the final day.\"It's the best I've played all week all around ... hopefully (I can) get within striking distance tomorrow,\" Scott said.\"This business is all about results, so that's what I'm looking for tomorrow.\"The pair are five shots behind overnight leader Wyndham Clark, who has never won on the PGA Tour - a record he intends to break at Quail Hollow on Sunday.Clark shot an 8-under 63 on Saturday, giving him a two-shot lead over world No.5 Xander Schauffele going into the final round. He is 16-under 197 for the tournament.\"I'm excited to see how I handle the pressure,\" Clark said.\"It's going to be a fun challenge. It's going to be tough, I have one of the best players in the world right behind me and a bunch of other good players.\"Scott, who has 14 PGA titles already under his belt and 11 more on the European tour, knows the pressure Clark is feeling and how winning a first tournament can seem like a daunting task.The key, Australia's 2013 Masters champion said, is to keep your nerves under control.\"I know that's easier said than done,\" he said. \"You've got to just do the same stuff that got you to that position through three days.\"",
        "At one point on Saturday, there were 11 players tied for the lead.Then Clark stepped on the course and shot 31 on the front nine, with birdies on holes 13, 14 and 15.He hit his first 17 greens before his approach on No.18 landed on the fringe, less than five centimetres off the green. He needed just 28 putts to complete his round.Schauffele said watching Clark play so well only inspired him.\"Once these guys out here see someone do it, they just end up doing it,\" Schauffele said.\"When it's really cold and rainy, you feel like, 'Man, three under would be a good score'. Then someone shoots seven under and all of a sudden three under is, like, 30th.\"Monkey see, monkey do is definitely a thing that happens out here.\"While he has never won, Clark's ascension to the top of the leaderboard does not come as a huge surprise given his recent performances.He has finished in the top six in three of his last five tournaments and has not missed a cut since last October's Shriner's Open in Las Vegas.Defending champion Max Homa shot 68 and is eight under for the tournament.Rory McIlroy's bid for a fourth win at Quail Hollow is essentially over after the world No.3 shot an inconsistent 71 that left him at one under overall.",
        "Harrison Endycott also carded a third-round 71, leaving him tied in 45th at two under, while Cam Davis lies joint-61st at one over. Jason Day failed to make the cut.- with AP"
    ]
}