{
    "articleURL": "/sport/nba/article-12056601/Jarred-Vanderbilt-called-wearing-2k-worth-clothes-return-day.html",
    "content": [
        "Vanderbilt wore the outfit in the Lakers' buildup to Game 1 against the WarriorsThe 24-year-old joined L.A. in February as part of the Russell Westbrook tradeDailyMail.com provides all the latest international sports news Lakers forward Jarred Vanderbilt has been called out on social media for buying $2k worth of clothes and wearing them prior to his team's first game against the Golden State Warriors in the second-round of the NBA playoffs, only to return them the next day.",
        "The 24-year-old, who joined L.A. from the Minnesota Timberwolves at the February trade deadline, wore a plain tank top with an opened white and blue short-sleeve button-down, completing his fit with striped slim-fit pants and all white sneakers.On May 5, four days after his purchase, he was slammed on Instagram for sporting the attire just once in the Lakers' 117-112 win at Chase Center, which took place three days earlier, on May 2.'Nice guy,' shared the suspected Saks employee, who seems to be based in the San Francisco area. 'Bought 2k worth of clothes Monday. This outfit specially. Wore it to tunnel and post game Tuesday then returned it yesterday. I wasn't at the store and someone took the return. Look knows why...'Obviously used clothing. Mayn if I didn't have a reason to hate the Lakers and root for home turn now I have more reason. Boooooo @JVANDO YA BUM.' ",
        "A friend of the Saks employee later added on Instagram: 'My boi @sfc.og at Saks just blasted @jvando,' along the hashtag #DubsIn6. DailyMail.com has reached out to both Vanderbilt's and the Lakers' representatives.Vanderbilt, whose based salary is $4.4m-a-year, has been given the tough task to closely guard Warriors and NBA star Steph Curry in the Lakers series against Golden State. ",
        "He especially contained the 35-year-old in Game 1, limiting his efficiency to shooting 41 percent from the field (10-of-24 shots). The four-time NBA champion managed to get more points on the board on Saturday (23) despite L.A.'s Game 3 win and only converting 9-of-21 attempts. ",
        "In Game 2, the Warriors had to rely on the team's other member of the Splash Bros. - Klay Thompson - who made eight 3-pointers and ended up with 30 points to fend off the Lakers. In that game, Curry only had 20 points but shot the basketball better (58 percent, making 7-of-12 shots).It's fair to say that Vanderbilt's improved the Lakers defense dramatically since being part of a trade package that saw ex-Purple and Gold point guard Russell Westbrook go to Utah in February. At the time, Lakers fans had never heard his name but as soon as he played his first game in the City of Angels, the home crowd noticed how unique of a player he was.  Other than Curry, Vanderbilt has been assigned with guarding some of the NBA's most unstoppable offensive players, including Dallas Mavericks star Luka Doncic and Grizzlies point guard Ja Morant. In just a few months, L.A.'s No. 2 has gone from being a stranger to Lakers fans to being a crucial player on a team that could end up being crowned as NBA champs' in June. "
    ]
}