{
    "articleURL": "/news/article-12049341/What-Aussies-want-Budget-2023-Sydney-says-rent-childcare-groceries-expensive.html",
    "content": [
        "Aussies said cost of living pressures are hitting hardMany said the cost of rent and groceries is too high Read more about what to expect in the 2023 Budget Australians grappling with the growing cost of living crisis have revealed what they really want in the Budget - and it won't come cheap.",
        "Faced with skyrocketing rents, rates and every-day expenses, Aussies are pleading with Treasurer Jim Chalmers to use the billions of dollars streaming in from the commodities boom to ease their hip-pocket pain.It is the message that came through loud and clear when Daily Mail Australia quizzed Sydneysiders ahead of Tuesday's Budget speech. Whether they were homeowners, tradies, parents or students, they all wanted the government to do more... and to do it quickly.Some of those interviewed said their rent and weekly grocery bills had almost doubled in the past year. At the same time, interest rates had spiked while their wages had stalled. And there's more pain coming for smokers, who say they don't understand why the government is determined to single them out with cigarette tax hikes.Chalmers, alongside Prime Minister Anthony Albanese, has flagged a huge $14.6billion cost-of-living package. He's also spruiked a leg up for single parents, small businesses, the unemployed and over 55s.But will it be enough? Here, fed-up Australians reveal what they want to see in the Budget.",
        "Families: 'We can't afford it, there's not enough help'Young couple David and Chloe said they've been 'feeling the pinch' since welcoming their baby girl 16 months ago.'We're three people living off one income, buying a house is impossible and the childcare situation is very frustrating,' Chloe said.",
        "'I feel like I'm not being given a choice. If I decide to stay home and spend time with my daughter then I get no financial support, I only get support if I send her to childcare.'",
        "David explained most daycare facilities charge by the day, not hour, making it tricky for families who want subsidised part-time childcare.'If we took our daughter to childcare for four hours instead of 10 we would get subsidised for the hours she was there but still pay the day fee,' he said. Chloe added: 'It's not worth me going back to work part-time with all the extra fees.'Working mother-of-four Nisreen Thekralla, 40, said her family's rent has nearly doubled in just two years.'The most expensive thing in Sydney is rent, it just goes up and up and up,' she said.'It's hard even with my husband and I both working. We rented a home two years ago for $400 a week, we've now moved to something similar for $700 a week.'We're a big family, we just can't afford it. Groceries have hit hard, they keep going up.'",
        "Mum-of-four Nisreen Thekralla said she's grateful she's been able to access childcare payments but asked for more help for families struggling to bridge the gap between lower wages and growing living costs.",
        "'There's not enough support,' she said. 'The payments overall need to be bigger to help support with the higher rent.'It's such a big difference. My friend is paying $700 a week for a one bedroom apartment.'The Budget will include an additional $1.4billion in childcare funding, taking total government spending for the next four years to $55.31billion. The Budget will also include $72.4million over five years to boost skills and education within the sector. There are also plans to help over five million households and one million small businesses pay soaring power bills.For more than five and a half million households the amount they can claim is expected to be up to $500, depending on how high prices are and whether a household is on a pension or other fixed income.It will also depend on what state or territory a household or business is in.Dr Chalmers said it will vary by 'how much the states and territories are prepared to kick in, because this is a co-investment with them'. Students: 'I've moved three times in two months'Exchange students Rina Bruk Levy, 21, and Alberto Miccoli, 22, compared Sydney's current student housing market to the Hunger Games with young adults left grappling with each other for sub-par rooms.RIna said she's been forced to relocate three times since moving to Australia in February.",
        "'I spent two weeks living in an Airbnb and two weeks in a hostel before I found a student room because of the housing shortage,' she said.'I live in a building with 14 to 16 other women and three bathrooms.'",
        "Rina explained she was forced to live close to her place of study, the University of Technology Sydney (UTS) in Broadway, because exchange students cannot access concession discounts for transport like domestic students - despite the fact she studies full-time.She said the rent she pays living in the city is still less than what she would have paid to live outside the city and catch the train every morning.But the central location means she's had to pay more for a worn-out room.'It's not very well kept, it's really not ideal. I think because it's in such a convenient location the landlords don't have to worry as much,' she said.'My room is pretty much just a bed and I can just shut the door. I pay a little more than $400 for it every week.' Alberto said his living situation is slightly better because he managed to get a shared apartment through UTS.'There's a 10-hour time difference between here and home so I woke up at 3am to apply for student housing,' he said.",
        "'By the time my friends applied in the morning, they couldn't get a place.' Fortunately, the students said UTS has stepped up its students wellbeing programs with free food available four days a week and a 'free pantry' on Thursday where they can take five free essential items, like dish soap.",
        "TAFE student Jack Nguyen, 23, said he lives with his parents but still struggles to keep up with costs while relying on Youth Allowance to study full-time.'It's getting harder, everything is getting more expensive. My cheese toastie was $11!,' he said.'I live out west so between the cost of transport and food... I often end up eating fast food more often because it's less expensive.'The government have been increasing Youth Allowance over time but a bigger increase in the Federal Budget would be helpful.' Smokers: 'The government's ripping us off'Rojan Bissookarma, 23, and Bikash Acharya, 31, said they don't understand why the Federal Government is looking to target smokers in its next budget while living costs continue to grow.'The extra taxes aren't stopping anyone from smoking, it's not going to make us quit,' Rojan said.'I used to pay $20 for cigarettes, now I pay $35. Inflation is so high, basic costs are out of control.' Bikash said: 'The government is just ripping us off.",
        "'Ask any smoker, no one will quit. The government will just be making more money.'",
        "The Albanese government has announced three tobacco price hikes will be in next week's Federal Budget - raising $3.3billion in revenue.Health Minister Mark Butler announced the tax on tobacco will be increased by five per cent per year over the next three years, beginning on September 1.Mr Butler said the changes will raise an additional $3.3billion over the coming four years, including $290million in GST payments to the states and territories.He said it would help 'to support our health system and the health of current and former smokers and vapers'.Recreational vaping will also be banned in an attempt to avoid a new generation of addicts.The government will also increase regulation for vapes, including pharmaceutical-like packaging, a reduction in the allowed nicotine concentrations and volumes, and a ban on single-use vapes. Workers: 'I've seen people rent beds for $250'Spanish delivery driver Paula Jimenez said her biggest stress is staying on top of her rent as housing costs continue to rise in line with growing interest rates.'Rent is very expensive. People rent and sublet at quite high prices,' she said.'I have seen people rent beds in small apartments for $250 a week.' Paula added she's mostly had to cut meat from her diet to keep her weekly meal costs low.'It's too expensive for groceries,' she said. Property lawyer Lorraine Kostopoulos, 48, said her family has also struggled to keep up with costs. ",
        "'I work for a pretty good firm who's giving us a four per cent pay rise increase but interest rates, honest, is a really big problem,' she said.'They're killing us, the government has got to do something about the interest rates.'I have two kids, they're older but they still need things and it's difficult.'At the end of the day, the government need to step in and say \"we've reached the limit\" and just stop!' Sydney CBD barista Corinna Perez said she's noticed a drop in how much people are willing to spend on their morning coffee run at The Lobby Project on Kent St.'It feels like we're getting busier but people are buying less than before,' she said.'People would come in and buy three or four things, now they just grab two or a coffee.'Corinna said the growing costs have been hard on hospitality workers who were often living paycheque-to-paycheque before the cost of living crisis hit.'Rent is getting crazy high!,' she said. 'I go to the supermarket and pay double what I did before.'But hospitality pay rates are the same as before, they need to put minimum wage rates up.' ",
        "The one group who are set to score a significant, $10,000-a-year pay rise are 250,000 care workers.The frontline workers will be given the record salary bump to battle the cost of living crisis. It is also expected to improve equal pay statistics for women.The 'historic' 15 per cent pay rise will cost the federal budget more than $11 billion, the government said.Dr Chalmers believes the huge increases will be enough to attract new staff to the industry and keep existing workers.And in the long term, young workers will also find themselves up to $50,000 better off under a government plan to pay employees in real time on payday, rather than only making a single contribution each year.Experts believe it could give young workers an additional $50,000 by the time they retire. 'This is a big win for the three million mostly young and lower paid Australians unfairly deprived the super they've earned and will give them a better shot at building a good nest egg for retirement,' Industry Super Australia Chief Executive Bernie Dean said.But low and middle income workers will notice a slump in their take home pay this year following the conclusion of the former government's low and middle income tax offset.Australians earning less than $126,000 per year will pay more tax after the LMITO offset, also known as the 'Lamington', expired.The offset was first introduced by the Turnbull government and provided relief of up to $1,500. It was due to end this year, regardless of who was in government. Read more about what to expect in the 2023 Budget ",
        "WINNERSAged care workers Aged care workers on minimum wage will get a 15 per cent pay rise from July 1.The move will cost the federal budget more than $11billionAged Care Minister Anika Wells said the pay boost was a 'historic and deserved pay rise for a workforce undervalued for far too long'. Those set to get a pay rise include nurses, personal and aged care workers, recreational activity officers and chefs. Small businessesSmall businesses will be able to claim a $20,000 tax break for switching to more efficient energy - including solar power.It's estimated the program will cost $314million and help 3.8 million businesses.Businesses who make less than $50million will also be eligible for an additional 20 per cent deduction.Businesses with a turnover under $10million will also be able to instantly write-off assets valued under $1,000.Single mumsThe 2012 decision to cut benefits for single mums by $200 a fortnight once their youngest child turns eight will be mostly undone in this Budget.The new policy is looking to support mothers until their children enter high school.People aged over 55 on welfare paymentsOver 200,000 JobSeeker recipients aged 55 and over will see an increase in the base rate of their dole payments.There are 227,000 JobSeeker recipients aged 55 and above - the highest number of any age group - and most of this group are women. It comes after data found women in the above 55 age group are facing higher risks of homelessness. LOSERSTradiesTradies will no longer be able to instantly write-off large assets, like a work ute or van.Instead, the asset will need to be deducted from taxes over the course of its lifetime.Smokers and vapersThe tax on tobacco will increase by five per cent every year for the next three years starting from September 1.The tax has gone up 125 per cent since 2010.The Budget will also set aside $63million for a public health campaign to stop smoking and vaping.Low and middle income earnersAustralians earning less than $126,000 per year will pay more tax after the former government's low and middle income tax offset expired.The offset was first introduced by the Turnbull government and provided relief of up to $1,500.It was due to end this year, regardless of who was in government. People with more than $3 million in super Australians with super balances of more than $3million will no longer get generous tax breaks from July 2025"
    ]
}