{
    "articleURL": "/tvshowbiz/article-12058627/Christina-Milian-41-look-alike-sister-Danielle-Milian-37-ooze-elegance-celebrity-hotspot.html",
    "content": [
        "Christina Milian teamed up with her lookalike sister Danielle for a promotional campaign for the online fashion retailer, Shein.",
        "The sisters were among a group of nearly a dozen ladies for the Shein Influencer Mother's Day lunch at celebrity hotspot Great White in West Hollywood. Christina, 41, looked stunning decked out in a red and black cutout mini dress that hugged her curves.The form-fitted shoulder-less number fell down to mid-thigh, and boasted a  turtleneck design.The actress and singer also wore thin strappy heels and accessorized with a small box purse.",
        "Her younger sister, 37, opted for a yellow dress that was ankle length on the left, while falling just to her hips on the right.The actress and mother of three also donned a pair of black-pointed ankle-boots, and had her nearly the exact same length and style as Christina,.After lunch the sisters were seen leaving the event holding hands and carrying a large bag full of goodies, all while they talked and laughed as they made their way out of the establishment.Christina, who opened the Beignet Box Café in the Studio City neighborhood of Los Angeles two years ago, also keeps busy with her two sons whom she shares with husband, French singer M. Pokora (born Matthieu Tota).She also has a daughter Violet, 13, from her first marriage to singer and record producer, The Dream (born Terius Youngdell Gesteelde-Diamant). ",
        "Before opening her store, Christina had been selling her beignets, among other items out of a customized food truck parked in the Studio City neighborhood. Milian and friend Elizabeth Morris launched Beignet Box in the summer of 2019 with its first pop up location at Tigers Stadium in Baton Rouge, Louisiana. Christina, who was born in Jersey City, New Jersey would ended up spending most of her childhood in Maryland, which is where her younger sister was born.Christina also continues to act and sing, with her two most recent roles in the Netflix film Resort To Love (2021) and a guest starring appearance in the drama series Step Up: High Water. "
    ]
}