{
    "articleURL": "/wires/aap/article-12039619/Patients-control-new-chronic-pain-fix.html",
    "content": [
        "A new approach to chronic back pain that encourages patients to take control of their own treatment has been shown to dramatically reduce discomfort.",
        "It involves intensive coaching sessions with a focus on social and emotional health, on top of physical exercises.Specially-trained physiotherapists help chronic back pain patients understand what has happened to their body, develop strategies to move carefully and encourage them to tackle activities they have been avoiding.About 80 per cent of the 500 patients who took part in a recent trial in Sydney and Perth were satisfied with the treatment and many were still feeling better up to a year later.Scientists from Curtin, Macquarie and Monash universities conducted the study into Cognitive Functional Therapy, published in prestigious medical journal The Lancet on Wednesday.Co-author and specialist physiotherapist Professor Peter O'Sullivan admits encouraging patents to tackle the most painful activities in their lives goes against most teaching, however he believes it builds confidence.\"It's kind of a u-turn because it kind of goes against prior beliefs and it goes against a lot of clinical practice,\" he told AAP.Professor O'Sullivan said people with chronic back pain often feel like they have run out of options but that was not the case.\"This study provides renewed hope that actually there are things that are available for people who are at that point in their lives who have literally given up,\" he added.",
        "Retired mathematician Volker Rehbocks experienced pain so severe he struggled to sit down or tie his shoelaces but noticed significant improvements eight months after starting the treatment.The father of two can now bend, garden and ride his bike comfortably.\"My pain has effectively gone,\" Mr Rehbocks said.The therapy involves seven sessions over 12 weeks and costs about $1000, making it more expensive than standard physio sessions.However it has been shown to save each patient $5000 due to improvements in their productivity in both paid and unpaid work, according to the study.Lead author Associate Professor Peter Kent said many patients involved had previously been prescribed opioids and the new treatment offered a safe alternative.\"We have empowered people to better self manage their condition,\" he said.The researchers hope the findings will prompt authorities to consider whether Medicare and private health rebates for longer physiotherapy appointments should be increased."
    ]
}