{
    "articleURL": "/sport/football/article-12039421/THE-NOTEBOOK-Arteta-swoop-Guehi-Lampard-likely-season.html",
    "content": [
        "Arsenal 3-1 Chelsea: Gunners back to the top of the table after a first-half blitzArteta has placed a new central defender towards top of his recruitment plans Odegaard produced a barnstorming display from midfield on Tuesday nightArsenal returned to the top of the Premier League on Tuesday with a 3-1 win over a woeful Chelsea, set on their way by two goals from Martin Odegaard.",
        "Arsenal raced into a 3-0 half-time lead when captain Odegaard was given acres of space - twice - by Chelsea's flimsy defence to score in the 18th and 31st minutes, and Gabriel Jesus converted from close-range 11 minutes before the break.Chelsea, who lost for the sixth time in six games under interim coach Frank Lampard, at least managed to score only their second goal in eight games when Noni Madueke squeezed the ball past Aaron Ramsdale in the 65th minute.Arsenal's first win in five games took them to 78 points, two more than second-placed Manchester City, who have the chance to reclaim top spot when they host West Ham United on Wednesday. Mail Sport's SAMI MOKBEL takes a look at some of the things you may have missed. ",
        "Arteta could swoop for GuehiMikel Arteta has placed a new central defender towards the top of his summer recruitment plans, with England international Marc Guehi among the targets for Arsenal.The absence of William Saliba due to a lower back injury has exposed the lack of depth in the heart of their defence. Rob Holding was dropped for Tuesday night's London derby, with January signing Jakub Kiwior making his first top-flight start since joining. Nevertheless, Arteta will target a new central defender deemed good enough to compete with Saliba and Gabriel next season.",
        "Guehi is among the names the club are monitoring heading into the summer. Crystal Palace are keeping an open mind regarding Guehi's future, with an offer in excess of £50million likely to test the club's resolve to keep their key defender.Aubameyang jeered on returnThere were boos for Pierre-Emerick Aubameyang from sections of the Emirates support as he returned to the club he left so acrimoniously last season. Then huge cheers when his half-time substitution was confirmed. While on the pitch, Aubameyang touched the ball nine times — four of which were from kick-offs.",
        "Odegaard closing in on Fabregas Martin Odegaard produced a barnstorming display from midfield on Tuesday night. His match actions map shows how influential he was all over the pitch, and he moved on to 14 league goals for the season after his two well-taken finishes. The only Arsenal central midfielder to score more in a Premier League campaign is Cesc Fabregas.Brighton want Nelson on a freeBrighton intend to make a formal offer to sign Reiss Nelson on a free transfer at the end of the season.The Arsenal winger's contract expires in June, though the Gunners have offered the attacker a new deal to stay in north London.A number of Premier League clubs are showing an interest in Nelson, but Mail Sport understands that Brighton will make an offer to the Gunners academy graduate in the summer provided he doesn't sign a new deal with Arsenal before then.",
        "Chelsea fans salute Abramovich How Chelsea fans must yearn for the Roman Abramovich era. Despite spending £600million on new players, the Blues are a shadow of the team that dominated domestically and in Europe during the Russian oligarch's regime. Chelsea fans were heard singing about Abramovich at half-time, which certainly won't have been music to current co-controlling owner Todd Boehly's ears. Money can't buy you love, it seems.Arsenal fans stage protest The Ashburton Army, who sit to the left of the goal on the Clock End, staged a mini protest against extra ticket checks implemented by the club ahead of the game. The group of fans, dressed in black, stayed on the concourse for the opening 30 minutes before filtering back to their seats - just in time to see Martin Odegaard and Gabriel Jesus add Arsenal's second and third goals.",
        "Lampard likely to see out seasonAll the initial indications are that Frank Lampard will see out the season at Chelsea before making way for Mauricio Pochettino to take the reins ahead of pre-season.There's logic to that. Chelsea want to show Lampard the respect his legacy deserves, while Pochettino may feel like he's on a hiding to nothing by taking charge of a team so short on confidence for the final four games.",
        "Who could blame the Argentine after watching his future side produce such a feeble first 45 minutes.But there are some at Stamford Bridge who believe the team would benefit from Pochettino taking over before the season ends. Not to salvage anything from the season, because there is nothing to salvage.But because it would give him a running start to his first full season at the helm…that is, of course, he doesn't run a mile after this!"
    ]
}