{
    "articleURL": "/femail/article-12050021/Durex-launches-online-fitting-service-condoms.html",
    "content": [
        "A survey reveals British men are purchasing larger condoms READ MORE: World's first skin tone condoms launched to make sex inclusive The say size doesn't matter and it's all relative - but that's not exactly the case when it comes to condoms.",
        "According to a recent survey conducted by Durex, British men are buying the wrong size condoms because they're too embarrassed to buy the right - often smaller - fit.A group of men were quizzed on their condom-buying habits and a whopping 92 per cent revealed they opted for an ill-fitting 'regular' fit.The study implies that these men knew a size small was the best fit.Meanwhile on the flipside, it's the same case for those with larger manhoods, who are apparently too shy to purchase bigger condoms.",
        "A Durex spokesperson has put the issue down to a variation in the population’s penis size, and adds that not all people are best suited to a ‘regular’ fit condom.To solve the puzzle, Durex has launched an online fitting service to encourage men to purchase their real size - and feel no shame about it.Durex said: 'We now offer a new range of three sizes ensuring everyone feels maximum pleasure, ultimately enhancing sexual experiences as they aim to raise awareness on the importance of a condom fit.' Along with this tailored service, British men with a smaller-than-average member will be offered condoms with a closer fit and a 5.2cm circumference.And Durex's 'wide' fit will be best suited for regular size men who are in need of condoms that measure up to 5.7cm.",
        "The resource will allow men to tailor the lubricant to their preferred taste of either standard or extra. As well as the thickness to extra thin, thin, or thick.The condom giant carried out the study as it launched the world's thinnest ever range called Nude.The Nude condom is just 48 micrometres compared to standard ones which are 65 micrometres thick.",
        "Nikki Hayward, Marketing Manager for Durex, said: 'Condoms don’t have to be a barrier to pleasure, and we don’t take a one size fits all approach.''We believe that everybody should be able to find their best fit and have wonderful, feel-good sex, without compromising on safety or sensation.'The news follows another survey conducted by Durex which surveyed 2,000 Brits on their sexual experiences, and found that men orgasm four times as much as women on average.Just five per cent of women said they always orgasm during a sexual encounter, compared to just 20 per cent of men.",
        "A fifth of sexually active ladies said they felt frustrated or disappointed as a result, but 11 per cent say they have gotten used to it.The survey also found that sexually active UK adults over 75 are twice as likely to say they always orgasm than those age 25 to 34. "
    ]
}