{
    "articleURL": "/femail/article-12051483/Ham-sandwiches-altar-Daisy-Goodwin-lives-chaotic-Coronations-Royal-history.html",
    "content": [
        " Bats flew round the head of Richard I and James II's crown fell offWhen it was all over, Victoria rushed upstairs to give her pet spaniel a bathFor all the latest Royal news, pictures and video, click here The bunting is on special offer and the excitement is building across the country for the first coronation most of us will have seen. ",
        "All but a privileged few will be watching it on TV (or in my case on a blanket in Hyde Park), but would it seem such a prospect for celebration if the ceremony lasted a buttock-paralysing five and half hours?That’s how long Queen Victoria’s coronation took in 1838 - an unprecedented length even then, largely because no one had bothered to rehearse it.Today we are used to royal ceremonies being immaculately organised - King Charles III has even had a to-scale stage built at Buckingham Palace to replicate the relevant area at Westminster Abbey - but this is a comparatively recent development.When I came to research the coronation of Queen Victoria for the ITV series, Victoria, I wrote about the young queen, I discovered not a single run-through had taken place before the real thing. ",
        "The 19-year-old queen was urged by her prime minister Lord Melbourne to at least visit Westminster Abbey so she would know the layout, but the young monarch was so caught up in the round of coronation balls and parties that she never got round to it. Nor, it seemed, did anyone else involved in the ceremony.When we came to recreate the event, we filmed in Beverley Minster in Yorkshire. The Minster isn’t as grand as the Abbey but when Jenna Coleman, who plays Queen Victoria, came down the aisle carrying the orb and sceptre, her heavy train carried by eight ladies in waiting, it was impossible not to feel goose bumps.",
        "After we finished for the day, Jenna confessed how heavy her robes were, and how difficult they had been to walk in. One can only imagine how hard it must have been for the teenage Queen Victoria, who had no breaks in the interminable ceremony and was wearing a crown weighing more than two kilograms.Our TV coronation went very well. The same cannot be said for the actual ceremony 185 years ago, which was full of confusion. At one point the Bishop of Bath and Wells turned over two pages of the prayer book by mistake, meaning poor Victoria had to be rushed out of King Edward’s chapel in order to be in the right place for the proclamation.So chaotic was it, Victoria describes in her diary entry for the day that she could hardly see the altar in the chapel because it was covered in ‘ham sandwiches and bottles of wine etc etc’. Clearly the various officials got hungry during the endless rigmarole, and who can blame them?At one point the Archbishop, who might have been drinking the wine, forgot that he had already given her the Orb, and ‘tried to give it to me again’. To add injury to insult, he jammed the Coronation ring on the wrong finger, causing the Queen considerable pain and making her finger swell so much that it took days to remove it. ",
        "Later, when all the peers came to pay homage by kissing the Queen’s hand, Lord Rolle, who was 82, fell down the steps leading up to the throne.Despite all the mishaps, however, Victoria called it ‘the most glorious day’ and only displayed her teenage years at the very end when, back at Buckingham Palace, she went straight up to her bedroom to give her pet spaniel Dash his bath.In fact, the history of British coronations over the centuries is much more chaotic than you might expect – from feuding spouses, to abbey picnics and spooky omens. As an historian with an eye for drama, I give you my top ten Coronation highlights...Fit for a soap operaThe prize for the coronation most resembling a soap opera must go to George IV. As Prince of Wales, he had been very unhappily married to a German princess - Caroline of Brunswick - and they had been living separately for years. ",
        "But when he became King on the death of his father George III in 1821, Caroline came back to England to become Queen. The government offered her £50,000 to go abroad and stay there, but Caroline stuck to her guns. A bill of divorce was brought in the House of Lords on the grounds of her adultery (no mention was made of her husband’s numerous lovers), but it was never presented to the Commons. ",
        "Caroline was very popular with the people - much more so than her husband - and they cheered when she arrived at the Abbey on Coronation Day and demanded to be allowed in. ‘I am the Queen, open,’ she commanded. But the door was slammed in her face, and she died 19 days later. At the time her physicians thought she had an intestinal obstruction of some kind, but it may have been cancer. The rumours were that she had been poisoned.Last minute hitchesEdward VII’s coronation was planned for the 26th June 1901, but it had to be called off two days before so that the 59-year-old King, who by that point was seriously obese (he always had a cold roast chicken by his bed just in case he felt peckish in the night) could have an emergency appendectomy. ",
        "He was recovered enough to be crowned in August - only to meet another major problem in the shape of 82-year-old Archbishop Temple, who was too infirm to perform the ceremony but refused to delegate. Courtiers were terrified his frail hands would drop the heavy 2.2kg King Edward Crown, so the lighter 1.3kg Imperial crown was substituted instead.Batty bad omensThe first coronation to have a written record was that of Richard I in 1189. ",
        "The chronicler wrote that when Richard was crowned a bat flew around his head and a mysterious peal of bells was heard. These were considered to be bad omens, funnily enough.When the crown slippedJames II’s coronation in 1685 was also overshadowed by bad omens. When the crown was placed on his head by the Archbishop it slipped off, and the Royal Standard that was flying over the Tower of London was rent in two by a freak wind. James was forced from his throne a few years later and replaced by his son-in-law and daughter, William and Mary.Picnic at the AbbeyElizabeth II went to her coronation in the Golden State Coach, but the 22-year-old George III and his bride, the 17-year-old Queen Charlotte, were carried to the abbey in sedan chairs.",
        "The 1761 ceremony went swimmingly until the Archbishop of Canterbury’s sermon, which was rendered inaudible over the noise of the congregation opening bottles of wine and eating the provisions they had brought with them.The first divorceeCharles III will not be the first king to have a divorced woman crowned alongside him. ",
        "Henry II was the second husband of Eleanor of Aquitaine, who was married for 15 years to King Louis of France before the relationship broke down and the marriage was annulled. ",
        "This left Eleanor conveniently free to marry the young and vigorous Henry ten years her junior. He ascended to the throne, with his queen, in 1154.Golden gown shared by royal queensMary Tudor, the eldest child of Henry VIII, was the first woman to be crowned Queen in her own right. She was accompanied into the Abbey on October 1, 1553 by her only living stepmother, Anne of Cleves, and her half-sister Elizabeth. ",
        "For her procession to the Abbey she wore a gown made out of gold and silver thread. During her reign, Mary at one point had Elizabeth imprisoned in the Tower of London on suspicion of treason - but that didn’t stop Elizabeth from recycling her half-sister’s wardrobe at her own coronation eight years later.All that glittersThe award for the most ostentatious gown, however, surely goes to Queen Caroline, wife of George II, whose dress was so encrusted with jewels a special pulley had to be designed to hold up the skirt so she could kneel down to be crowned. ",
        "George II was the first monarch to hear Handel’s setting of Zadok the Priest at his coronation in 1727.Score-settling processionElizabeth I used her coronation to settle some old scores. On her way to the Abbey, she passed by an elaborate three-tiered stage upon which a pageant depicted her lineage, including figures representing her father Henry VIII and her mother Anne Boleyn. ",
        "Elizabeth was only two when her mother was executed for adultery and treason on the orders of her father, and for most of her life, any mention of Anne had itself been considered treasonous. Yet Elizabeth used her coronation not only to rehabilitate her mother’s memory but to honour it. This was the first time Anne’s image had been seen in public for 23 years and it was a hugely significant act: the so-called ‘bastard princess’ was asserting her right to be a legitimate queen.The most expensive, and cut-price, coronationsThe monarch with the most illegitimate children at his coronation was William IV, who invited four of his ten children by the actress Mrs Jordan. Like King Charles III, William declared that he wanted his coronation, in 1834, to be a cut price event. ",
        "It was called a ‘half-crown ceremony’ by his enemies, and he broke tradition by wearing his admiral’s uniform under his coronation robes. His ceremony cost £2million in today’s money, in contrast to his older brother George IV’s coronation, which cost a breath-taking £21million. His wasn’t the most expensive coronation ever, however. That record goes to Elizabeth II, whose ceremony cost £1.57 million, or £35.5 million today."
    ]
}