{
    "articleURL": "/news/article-12043311/Federal-Reserve-hikes-rates-0-25-points-5-25.html",
    "content": [
        "Fed on Wednesday raised its benchmark interest rate to a range of 5% to 5.25%It is the 10th consecutive rate increase as the central bank fights inflationFed hinted that it could pause rate hikes starting with its next meeting in June The Federal Reserve has raised its benchmark lending rate for a 10th consecutive time, as it pushes to fight inflation while seeking to prevent fresh banking concerns from spreading. ",
        "As was widely expected, the US central bank announced another quarter-point rate increase on Wednesday, bringing its policy rate to a range of 5 percent to 5.25 percent.It could be the final increase before the Fed pauses its rate hikes, as policymakers attempt to balance their inflation fight against concerns about the impact of high rates on the economy and the banking sector. After a relatively calm period for banks following crisis-level worry in March, this week saw the reemergence of some turbulence with the collapse of California-based lender First Republic.The commercial bank's failure, the second-largest in US history, was announced early Monday along with a sale to JPMorgan Chase, in a swift turnaround regulators hoped would ease jitters about the financial sector.",
        "The US central bank began its aggressive campaign of interest-rate hikes in March last year, and has now raised rates 10 times in a row to help target inflation, which remains stubbornly highInflation has fallen from a peak of 9.1 percent in June to 5 percent in March, but remains well above the Fed's 2 percent target rate. 'Inflation pressures continue to run high, and the process of getting getting inflation back down to 2 percent has a long way to go,' Fed Chair Jerome Powell said during a press conference on Wednesday.",
        "But following Wednesday's decision, the Fed hinted that it could pause further rate hikes starting with its next meeting in June.In a statement after its latest policy meeting, the Fed removed a previous sentence that had said that 'some additional' rate hikes might be needed. It replaced that sentence with language that said it will consider a range of factors in 'determining the extent' to which future hikes might be needed. The Fed's rate increases over the past 14 months have more than doubled mortgage rates, elevated the costs of auto loans, credit card borrowing and business loans and heightened the risk of a recession. Home sales have plunged as a result. The Fed's latest move will further increase certain borrowing costs for families and businesses.",
        "Still, the Fed's statement offered little indication that its string of rate hikes have made significant progress toward its goal of cooling the economy, the job market and inflation. 'Job gains have been robust in recent months, and the unemployment rate has remained low,' the statement said. 'Inflation remains elevated.'The surge in rates has contributed to the collapse of three large banks and turmoil in the banking industry. In addition to First Republic, California-based Silicon Valley Bank and Signature Bank of New York both failed in March.",
        "All three failed banks had bought long-term bonds that paid low rates and then rapidly lost value as the Fed sent rates higher.The banking upheaval might have played a role in the Fed's decision Wednesday to consider a pause. Chair Jerome Powell had said in March that a cutback in lending by banks, to shore up their finances, could act as the equivalent of a quarter-point rate hike in slowing the economy.Fed economists have estimated that tighter credit resulting from the bank failures will contribute to a 'mild recession' later this year, thereby raising the pressure on the central bank to suspend its rate hikes.The Fed is now also grappling with the threat of a prolonged standoff around the nation's borrowing limit, which caps how much debt the government can issue. Congressional Republicans are demanding steep spending cuts as the price of agreeing to lift the nation´s borrowing cap.The Fed's decision Wednesday came against an increasingly cloudy backdrop. The economy appears to be cooling, with consumer spending flat in February and March, indicating that many shoppers have grown cautious in the face of higher prices and borrowing costs. Manufacturing, too, is weakening.",
        "Even the surprisingly resilient job market, which has kept the unemployment rate near 50-year lows for months, is showing cracks. ",
        "Hiring has decelerated, job postings have declined and fewer people are quitting their jobs for other, typically higher-paying positions.The turmoil in the nation's banking sector, which re-erupted last weekend as regulators seized and sold off First Republic Bank, has intensified the pressure on the economy. Investors have grown anxious about whether other regional banks may suffer from similar problems.Goldman Sachs estimates that a widespread pullback in bank lending could cut U.S. growth by 0.4 percentage point this year. That could be enough to cause a recession. In December, the Fed projected growth of just 0.5 percent in 2023."
    ]
}