{
    "articleURL": "/wires/aap/article-12040641/Wellington-eye-finals-glory-extend-Talays-tenure.html",
    "content": [
        "Wellington forward David Ball wants to send departing coach Ufuk Talay out on a high, insisting the Phoenix believe they can prolong their stay in the A-League Men finals beyond the first week.",
        "The 'Nix head to face Adelaide United on Friday in a game which could be Talay's last at the club after he opted against renewing his contract with the Kiwi outfit.Wellington have limped into the finals with just one win in their last six outings.But Ball said the Phoenix have visions of beating Adelaide, setting up a two-legged semi-final with Melbourne City and making it through to the decider to give Talay the send-off he deserves.\"I want to win it and I have said since I've come here, I don't want to just be something, I want to be remembered,\" the English forward said.\"These are the games that you get remembered for.\"And if we can go on and do fantastically over these next, hopefully, four games everyone can be remembered (well).\"I think the manager as well, I've said many times he is the best I've worked with throughout my career so I think it'd be great to send him off in the right way and if we can do that as champions, that will be amazing.\"Wellington reached last year's elimination finals and lost to eventual champions Western United.Ball said previous encounters counted for little as they aim to upset an Adelaide side who thrashed them 5-1 in their most recent meeting back in March.",
        "\"It is a one-off game and with Western United last year, we had them over the course of the season we had them really sewn up,\" Ball said.\"It didn't go for us on the night and we missed big chances and they got a 1-0 win and went on to win it.\"It is one game and you have got to leave everything out there on the pitch.\"You can't go through the motions at all. We've got to be we've got to be in it together and work as a group to get the outcome that we need.\""
    ]
}