{
    "articleURL": "/wires/reuters/article-12057889/High-powered-Rangers-double-Angels.html",
    "content": [
        "Adolis Garcia went 3-for-4 with a home run, Leody Taveras went 4-for-5 and drove in four runs, and the Texas Rangers closed out a road series win on Sunday with a 16-8 rout of the Los Angeles Angels in Anaheim, Calif.",
        "Texas fell behind early when Anthony Rendon sent Mike Trout and Shohei Ohtani home with a three-run homer in the first inning off of Rangers starter Martin Perez. Perez surrendered seven earned runs and eight hits in just 3 2/3 innings.It did not take the Rangers long to respond, however.Jonah Heim drew a leadoff walk in the Texas half of the second inning, and Ezequiel Duran drove him in on the ensuing at-bat with a towering home run to left field. The Rangers then tied it 3-3 when Robbie Grossman's sacrifice fly scored Travis Jankowski, who pulled up lame on the play and sat the rest of the afternoon.Jankowski's replacement, Josh Smith, blasted a two-run home run to cap a four-run third inning for the Rangers. They led their American League West counterparts the rest of the way.Starter Jose Suarez (1-2), who took the loss, lasted just 2 2/3 innings for Los Angeles. He gave up seven earned runs on six hits and walked three batters. Relievers Chase Silseth and Chris Devenski pitched 3 1/3 and two innings, allowing three earned runs each.The only Angels pitcher to escape unscathed was first baseman Jake Lamb, who worked a scoreless ninth inning. The outcome was no longer in doubt at that doubt with Texas sporting a nine-run lead.",
        "Any hope of a Los Angeles comeback was nixed in the seventh inning. The Angels had responded to a four-run Texas-half of the fourth inning with RBI singles by Taylor Ward and Ohtani, pulling to within four runs.But the Rangers' five-run seventh put it away, with Garcia hitting a three-run home run after RBI singles by Marcus Semien and Nathaniel Lowe.The offensive outpouring resulted in Texas' second double-digit-run effort in the series, a day removed from a 10-1 win on Saturday.Rendon went 2-for-3 in the loss with two home runs, knocking out a second in the ninth inning. Ohtani went 2-for-3 and drew two walks. Thaiss went 3-for-4.Josh Sborz (1-1) picked up the win with his two scoreless innings pitched for Texas.--Field Level Media"
    ]
}