{
    "articleURL": "/wires/pa/article-12039691/7m-households-301-DWP-cost-living-payment-end-Wednesday.html",
    "content": [
        "More than seven million households across the UK will have received a £301 cost-of-living payment by the end of Wednesday, the Department for Work and Pensions (DWP) has said.",
        "The DWP previously announced that eligible households receiving DWP means-tested benefits would receive their first 2023-24 payment between Tuesday April 25 and Wednesday May 17.The payments are part of a package of wider government support announced to tackle the cost of living in 2023-24, including a further £300 cost-of-living payment for eligible families in autumn 2023, with a payment of £299 in spring 2024.Mel Stride, Work and Pensions Secretary, said: “Paying more than seven million households £301 in a little over a week underlines our commitment to ensure those on the lowest income are protected from the worst of rising prices and give them peace of mind.”Chancellor Jeremy Hunt said: “We know the impact that rising prices are having on families, which is why we are providing significant support to millions through these direct cash payments.”People will be eligible for the £301 cost-of-living payment if they have been entitled to a payment for certain benefits between January 26 and February 25 2023, including, for example, universal credit, pension credit and child tax credit.",
        "The DWP said that 99% of households initially eligible through the department will have been directly paid £301 by the Government by the end of Wednesday.The “small number” of payments outstanding will continue to be made automatically up to May 17, the department added.After this date, if someone thinks they may be missing a payment they are entitled to a form can be filled out on the gov.uk website to make a claim.",
        "Meanwhile, one million eligible households receiving tax credits, and no other means-tested benefits, will receive their £301 cost-of-living payments from HM Revenue and Customs (HMRC) up until May 9. Again, these payments should be automatic, with no need to apply for them.People should also watch out for any scammers sending fake messages about cost-of-living payments. In general, people should pause to think before handing over any money or personal details if they have received unexpected contact."
    ]
}