{
    "articleURL": "/wires/pa/article-12038225/Ludicrous-say-Ukraine-s-Nato-membership-provocative-Russia--Johnson.html",
    "content": [
        "It is ludicrous to say Ukraine’s Nato membership is provocative to Russia and the UK Government should support an application from Kyiv, former prime minister Boris Johnson has said.",
        "He told MPs the next meeting of Nato heads in Vilnius, Lithuania, in July will be an “important test” of the military alliance’s willingness to “fulfil its long-standing promises to Ukraine”.He said Kyiv should be invited to make the “necessary preparations” to join “as soon as possible” for the sake of “clarity” and “peace” in Europe.Foreign Secretary James Cleverly said Nato’s position in regard to Ukraine is “unambiguous” and the invitation has been put out for Ukraine to join.Mr Johnson’s comments came during questions to the Foreign, Commonwealth and Development Office (FCDO) in the Commons. This summer’s Vilnius summit will be an important test of Nato’s willingness to fulfil its long-standing promises to Ukraine  Boris Johnson  He said: “This summer’s Vilnius summit will be an important test of Nato’s willingness to fulfil its long-standing promises to Ukraine.",
        "“Does he agree with me that it’s now ludicrous to say that Ukraine’s Nato membership might be in some way provocative to Russia, since (Russian President Vladimir) Putin has shown what he is willing to do when Ukraine is not a member of Nato and because Ukraine is not a member of Nato?“And does he agree that it should therefore be the policy of the Government that Ukraine should be invited to make the necessary preparations to join as soon as possible under the rules, for the sake of clarity and stability and peace in Europe?”",
        "Mr Cleverly paid tribute to the former PM for “the leadership that he showed at a vital point in time”, adding: “Nato’s position in regard to Ukraine is unambiguous. The invitation has been put out for Ukraine to join Nato.“I think it’s incredibly important that that is not taken off the table.“Of course Russia’s aggression into Ukraine was the provocative action.“Ukraine’s desire to join Nato was an entirely understandable defensive posture because of that threat from the east.”"
    ]
}