{
    "articleURL": "/news/article-12048055/Private-plane-pilot-53-jailed-people-smuggling-plot-joking-investigators.html",
    "content": [
        "Richard Styles caught after flying  private plane carrying four illegal immigrantsThe 53-year-old, from St Albans, Hertfordshire, was sentenced to seven yearsAlbanian group were detained shortly alongside two others working with StylesA British career criminal has been jailed for a people smuggling plot after joking with investigators 'I normally get arrested for drugs'.",
        "Pilot Richard Styles was caught after flying a twin-engine private plane carrying four Albanian illegal immigrants to the UK in a 'luxury' service.The 53-year-old, from St Albans, Hertfordshire, had touched down at Deenethorpe Airfield, Northamptonshire, after a journey from Belgium carrying three men and a woman. The group - who were attempting to avoid immigration checks - were detained shortly after by Northants Police officers working with the National Crime Agency and handed in to immigration authorities.As Styles was arrested he quipped: 'I normally get arrested for drugs, so it's a bit strange.'",
        "He was caught alongside fellow pilot Silvano Turchet, 68, and Vijayakumar Sivakumar, 43.Styles was sentenced to seven years in prison, with Tuchet recieving seven-and-a-half and Sivakumar getting just four-and-a-half.NCA Regional Head of Investigations Jacque Beer said: 'Styles was a career criminal who previously used his piloting skills to move consignments of drugs around Europe. 'On this occasion he was offering a luxury end to end service, bringing people into the UK using a private plane.'His comments to my officers show that he considered getting arrested nothing more than an occupational hazard.'Turchet used his aviation knowledge and criminal connections to organise the attempt.'Turchet had worked with Styles to rent the six-seater Piper Seneca for £1,500 from an airfield in Lincolnshire, and later paid for it to be stored in a hanger as Styles flew it down to Deenethorpe.",
        "The plane was flown to Belgium on March 23 and returned the next day.",
        "Investigators believe the men were in contact with an Albanian known as 'Tim K' who arranged for Styles' illegal passengers to meet him in Belgium.Sivakumar - who had previously been convicted for trying to smuggle someone into the UK in the boot of his car - was arrested while driving the Albanian group away from the former RAF base in a Mercedes taxi.Styles had previous convictions for using a plane to smuggle ecstasy tablets out of Belgium in 2003, and drop cannabis into Jersey the same year while he was on the run from the Belgian authorities. He was sentenced to 12 years in prison in 2006, where he is believed to have met Turchet.Turchet was arrested at his home in Nottingham in July 2022 after NCA investigators identified him as the organiser. He initially denied knowledge of the plot, even though phone data put him near Deenethorpe airfield on 24 March and showed he'd called Styles nine times.All three men were charged with facilitating a breach of immigration law, a charge Styles admitted at a hearing on 8 August 2022. Turchet pleaded guilty on the first day of his trial, while Sivakumar was found guilty by a jury after a five day trial at Leicester Crown Court in February 2023.",
        "Ms Beer continued: 'People smugglers use a range of methods to try and breach UK border controls, and we are determined to do all we can to stop them. Tackling organised immigration crime is a priority for the NCA.'While this type of crime is rare, we would appeal to the aviation and local community to help us prevent it. 'Whether you work in the aviation industry, are a keen pilot or live locally, you should report any unusual or suspicious activity at a UK airfield or airport immediately.'Sarah Jennings, CPS Specialist prosecutor, added: 'All three defendants were involved in a planned and co-ordinated attempt to bypass immigration controls.'The CPS worked extremely closely with investigators to build this case including the National Crime Agency and international law enforcement in Belgium.'The evidence we presented showed the three men working together in the run up to the offence including on the day they were caught, unaware that the NCA were waiting as the plane landed.'We are determined to bring people smugglers to justice and will not hesitate to prosecute those who breach our immigration laws.'"
    ]
}