{
    "articleURL": "/wires/reuters/article-12046437/Ferrari-core-earnings-rose-27-Q1-increased-shipments-pricing.html",
    "content": [
        "Shares hit new record high at 267.20 euros",
        "Adj. Q1 EBITDA rises to above forecast 537 mln eurosMargin on adj. EBITDA up 200 bps to 37.6%Net revenue up 20% to 1.429 mln euros3,567 cars shipped in Q1, +10% y/yShare of hybrid cars on shipments doubled in Q1(Recasts after analyst call)MILAN, May 4 (Reuters) - Ferrari on Thursday produced a bigger than expected 27% rise in first-quarter core profit and forecast a strong second quarter, when deliveries start for its new Purosangue model, for which waiting lists extend to 2026.The Italian luxury sportscar maker said it was reopening orders for the Purosangue four-door, four-seater, which had been suspended due to initial \"unprecedented\" demand.CEO Benedetto Vigna said Ferrari's overall order book covered production until the end of 2025. But those customers now ordering the 390,000 euro ($430,000) petrol-powered 12-cylinder Purosangue will have to wait until 2026 to receive it.\"We were caught by positive surprise for these strong interest,\" Vigna told analysts presenting the company's quarterly results.The CEO however confirmed Ferrari's pledge to keep Purosangue sales below 20% of total group shipments over the car's life-cycle and not to extend it, to retain a degree of exclusivity.Ferrari's Milan-listed shares rose as much as 5.6% on Thursday to a new record high of 267.20 euros.",
        "The Prancing Horse's adjusted earnings before interest, tax, depreciation and amortisation (EBITDA) in the January-March period came to 537 million euros, topping analyst expectations of 508 million euros, according to a Reuters poll.Higher shipments, led by the Portofino M, the 296 GTB and the 812 Competizione models drove the results, as well as pricing capacity.CFO Antonio Picca Piccon told analysts Ferrari was now applying mid-single digit price increases on selected models and markets it had announced last year. He said the company expected a strong second quarter, followed by a softer second half of the year - the fourth quarter in particular - in line with its planned product cadence.Bernstein analysts noted that Ferrari's \"extremely strong\" product mix, pricing power and lengthy order book protected the company against potential recession-driven order cancellations.Ferrari, which has promised its first fully electric model in 2025, confirmed its full-year forecasts, although the Bernstein analysts said they expected them to be raised later in the year.Car price increases will counterbalance current cost inflation, Ferrari said.($1 = 0.9072 euros) (Reporting by Giulio Piovaccari Editing by Keith Weir, Kirsten Donovan and Jane Merriman)"
    ]
}