{
    "articleURL": "/news/article-12059413/ABC-Q-audience-member-calls-Union-Jack-symbol-terrorism-genocide-Jacqui-Lambie-responds.html",
    "content": [
        "Q+A audience member asked the panel for views on Union Jack Jacqui Lambie seemed to shock host Stan Grant with response Senator Jacqui Lambie has hit back with a shock response to an ABC audience questioner who said the Union Jack represents 'genocide and terrorism'.",
        "Irishman Richard Ryan asked the Q+A program panel on Monday for their 'thoughts on the Union Jack on the Australian flag' as debate rages over whether Australia should become a republic and abandon the UK Monarchy. Mr Ryan then called it 'a symbol of terrorism (and) genocide to the original owners of this land?'Ms Lambie, who served in the Australian Army, surprised host Stan Grant and much of the audience with her fiery response, calling not just for a new flag, but an Australian republic.'The flag would have a lot more meaning if we put it out there so it doesn't just include First Nations people, it doesn't just include any white people, but also any migrants that have come to this country over God knows how many years,' she said. ",
        "'The only way to do this and to teach people about our history is to throw it out there to those kids, 16 years and under, get them to design the flag and explain to them why we need to change the flag.'The Tasmanian Senator said getting children to design a new Australian flag would mean 'they'll get an education about the frontier wars'.'They'll get an education about how great this country's come with migrants and how we've all come together, and I think there's only one way to do that and that is creating a brand new flag,' she said.",
        "Ms Lambie argued this would 'give the youth, who are going to become the leaders of this country, a chance to draw up their own future by doing a flag'.She was on a roll by then and raised her voice to add that 'The other thing is when it comes to a republic, we're all grown-ups here in Australia and it's about time we stood on our on two feet and don't need a king and queen to do that. 'We can actually do it all by ourselves. Bring on a republic, bring on a new flag,' she shouted to laughter and applause from the audience.",
        "Terra nullius is a Latin phrase meaning 'land belonging to no one'. It is used to explain how Australia was founded by British settlers who justified doing so by declaring the land to be 'terra nullius'.This was interpreted as a complete absence of 'civilised' people capable of land ownership.Source:  Australian Museum",
        "The senator, who is part Aboriginal on her mother's side, did not address the question of the Union Jack representing 'terrorism (and) genocide', but another panelist, Nova Peris, did.The former Labor senator, Olympian and prominent republican said 'Yeah. When you think of the Union Jack, it was planted here in Botany Bay and marked the notion of 'terra nullius' ('nobody's land') ...",
        "'(On the Australian flag) We have the Union Jack here and the Southern Cross over there. For myself as a First Nations person, when you look at flags, flags are symbolic, they're about representation,' she said.Ms Peris then explained what the Aboriginal flag means. 'The black is symbolic for us as people, the yellow is a giver of life and the red is Mother Earth. 'When you look at the Australian flag, it's got another country's flag in our flag ... I understand the history with it being flown when our soldiers went to war and fought for our freedom that we have.'But it's also a hurtful one for us as First Nations people, because it symbolises the terra nullius.'Another panelist, WA Liberal Party state president Caroline Di Russo, defended the flag and its meaning to her Italian migrant heritage. 'For my family in particular ... the Australian flag is one of those things that is synonymous for them in Australia, so I personally like the flag.'She called for a 'mature conversation' on the flag and acknowledged that society's view evolves over time. 'Australia has already changed a huge amount, even in just the post-war period,' Ms Russo said.'So if it's something that other people want to have that conversation, have the conversation and we'll find out sooner or rather where we land on that.'",
        "There was a mixed response on the ABC's Twitter page to the Q+A questioner calling the Union Jack 'a symbol of terrorism (and) genocide'.'It's a symbol to be proud of!,' one man wrote, with another agreeing with him, saying 'Of course this is the question from the ABC to their hard left audience.'We don't deserve your hatred.'",
        "But others took the questioner's side, with one saying simply, 'Get rid of it.'Another had a suggestion for how the Australian flag could be tweaked. 'Just get rid of the union Jack, change the southern cross to green and gold,' they said.One commenter used folksy symbolism to explain their view.'I love the Australian flag. I have always thought it was great flag for Australia.'When I see it it reminds me of the night sky, as if I'm laying in my swag looking into the sky.'"
    ]
}