{
    "articleURL": "/sciencetech/article-12040941/Remains-2-000-year-old-Roman-wall-built-seal-London-Thames-discovered.html",
    "content": [
        "New sections of the Roman 'Riverside Wall' by the Thames have been uncoveredThis wall completes the perimeter of the inland 'London Wall', built in 200 ADIt is thought to have protected the city from uprisings, and establish its status Archaeologists have uncovered three new sections of an ancient Roman wall that was built along the River Thames the best part of 2,000 years ago.",
        "Known as the 'Riverside Wall', it once completed the perimeter of the more famous 'London Wall' that extends around the centre of the city inland.The barricade is thought to have been constructed to protect London - or 'Londinium', as it was known at the time - from uprisings by local tribes.The newly-excavated sections of the Riverside Wall are located by Riverbank House on Upper Thames Street, and Sugar Quay and Three Quays on Lower Thames Street.In total, they make up about 330 feet (100 m) of the nearly 6,000-foot-long (1,800 m) wall which sealed off London from the Thames. ",
        "They were first discovered between 2006 and 2016 during redevelopments along Upper and Lower Thames Street by the Museum of London Archaeology (MOLA).",
        "The London Wall is a defensive wall built by the Romans around the settlement of Londinium in the late 2nd or early 3rd century AD. The wall was constructed of Kentish ragstone and was up to 20 feet (6 m) high and 10 feet (3 m) thick in some places. It originally extended for around 2 miles (3.1 km) and enclosed an area of approximately 330 acres. The London Wall was designed to protect the city against attacks from the north and was augmented by defensive gates, towers and ditches.During the medieval period, the wall was rebuilt and strengthened with additional towers and gatehouses.Today, some parts of the wall are still visible, including the remains of the gatehouses and towers, which have been incorporated into modern buildings.",
        "Now, they have been added to the National Heritage List for England as scheduled monuments, as confirmed by the Department for Culture, Media and Sport with Historic England.Duncan Wilson, the chief executive of Historic England, said: 'Even in a really dense city like London, built up over 2000 years, there are still mysteries to be revealed right beneath our feet. 'The riverside wall remains an intriguing element of Roman London which raises almost as many questions as it answers.'The Riverside Wall would have severed London's connection to the wharves and warehouses of the quayside.Mr Wilson says this suggests that the anxious Romans were prioritising defence over trade during a 'time of uncertainty' throughout the wider Roman Empire.He added: 'By adding these sites to the National Heritage List we recognise their national significance, and can closely manage their conservation so that they remain part of London's rich story.'The London Wall was constructed of Kentish ragstone brought over from Maidstone, and was up to 20 feet (6 m) high and 10 feet (3 m) thick in some places. It originally extended for around 2 miles (3.1 km) and enclosed an area of approximately 330 acres, but much of it has been destroyed over the last 1,700 years as the city has grown.",
        "As well as protection - with the Riverside Wall, it forms a defensive ring around the whole city - the wall may have helped reinforce the status of Londinium. Some parts of the Riverside Wall incorporate reused monumental masonry and demonstrate ancient Roman construction techniques, so improve our understanding of architecture during this period.",
        "The section of the Riverside Wall under Riverbank House is about 66 feet (20 m) long and up to 4.6 feet (1.4 m) high.Archaeologists also discovered the remains of some timber Roman quays that were used for loading and unloading boats.About 148 feet (45 m) of the wall was found below Sugar Quay, as well as some quayside structures dating from the late 1st century and later Medieval period.Finally, 115 feet (35 m) was excavated at Three Quays, as well as wooden piles made of reused wooden cornice or pediment from a building.All three sections of the Riverside Wall have been left in-situ underground, beneath modern buildings.These well-preserved wooden wharf and quay structures from the Roman and Medieval periods have also been granted protection.",
        "55BC - Julius Caesar crossed the channel with around 10,000 soldiers. They landed at a Pegwell Bay on the Isle of Thanet and were met by a force of Britons. Caesar was forced to withdraw.54BC - Caesar crossed the channel again in his second attempt to conquer Britain. He came with with 27,000 infantry and cavalry and landed at Deal but were unopposed. They marched inland and after hard battles they defeated the Britons and key tribal leaders surrendered.However, later that year, Caesar was forced to return to Gaul to deal with problems there and the Romans left.54BC - 43BC - Although there were no Romans present in Britain during these years, their influence increased due to trade links.43AD - A Roman force of 40,000 led by Aulus Plautius landed in Kent and took the south east. The emperor Claudius appointed Plautius as Governor of Britain and returned to Rome.47AD - Londinium (London) was founded and Britain was declared part of the Roman empire. Networks of roads were built across the country.50AD - Romans arrived in the southwest and made their mark in the form of a wooden fort on a hill near the river Exe.  A town was created at the site of the fort decades later and names Isca. When Romans let and Saxons ruled, all ex-Roman towns were called a 'ceaster'. this was called 'Exe ceaster' and a merger of this eventually gave rise to Exeter.   75 - 77AD - Romans defeated the last resistant tribes, making all Britain Roman. Many Britons started adopting Roman customs and law.122AD - Emperor Hadrian ordered that a wall be built between England and Scotland to keep Scottish tribes out.312AD - Emperor Constantine made Christianity legal throughout the Roman empire.228AD - The Romans were being attacked by barbarian tribes and soldiers stationed in the country started to be recalled to Rome.410AD - All Romans were recalled to Rome and Emperor Honorious told Britons they no longer had a connection to Rome.Source: History on the net"
    ]
}