{
    "articleURL": "/health/article-12046605/Marijuana-30-PERCENT-schizophrenia-cases-young-men.html",
    "content": [
        "National Institute on Drug Abuse study included 6million people aged up to 50Dr Nora Volkow, the agency's director, called for 'urgent action' over weed useREAD MORE: Teens using weed have a six-fold increased risk of schizophrenia Marijuana may be driving a surge in schizophrenia cases among young men, a major Government-funded study suggests.",
        "Researchers backed by the National Institute on Drug Abuse estimated 30 percent of schizophrenia cases in men aged 21 to 30 are linked to cannabis addiction.Overall across all age groups, the analysis of 6 million people found 15 percent of diagnoses in men and four percent in women could be attributed to the drug.Dr Nora Volkow, NIDA director and co-author of the study, said the results called for 'urgent action' and demanded people think twice before smoking marijuana.Schizophrenia cases have been rising in recent decades, linked to growing and aging populations. But the researchers warn it could become more common as marijuana becomes increasingly legal. ",
        "Dr Volkow said: 'The entanglement of substance use disorders and mental illnesses is a major public health issue, requiring urgent action and support for people who need it.'As access to potent cannabis products continues to expand, it is crucial that we also expand prevention, screening, and treatment for people who may experience mental illnesses associated with cannabis use. She added: 'The findings from this study are one step in that direction and can help inform decisions that health care providers may make in caring for patients, as well as decisions that individuals may make about their own cannabis use.'",
        "Smoking the drug at low frequencies came with the same six-fold increased risk of getting the mental disorder as doing it daily, results from the Caribbean-based study showed. ",
        "Several studies have found links between cannabis and schizophrenia in the past, though the exact cause is not clear. Marijuana can cause psychosis, impairing the way you think, make decisions, handle emotions, and interact with reality.It can also interfere with brain development in young people. But it may be that people who are schizophrenic simply use cannabis to ease their symptoms.About 2.8million adults in the United States have the condition, estimates suggest.Patients suffer symptoms including losing touch with reality, hallucinations, paranoia and an inability to answer questions. As a result, sufferers face problems in their personal and professional lives.There is no cure for the condition, with doctors instead focusing on managing symptoms via anti-psychotic medications and therapy.In the latest study, researchers in Denmark analyzed the medical records of six million people over five decades, from 1972 to 2021.  All participants were aged between 16 to 49 years at least once over the period surveyed. They were all also from Denmark, where recreational cannabis use is illegal but it can still be accessed via the black market.Participants' medical files were checked for cannabis use disorder, which was defined as being unable to stop using the drug even if it was causing damage to their health and social lives. ",
        "All cases were also checked for a schizophrenia diagnosis.There were 45,327 cases of schizophrenia in the study.A total of 60,563 participants were also diagnosed cannabis use disorder, of which three quarters were in men.After factoring in other risk factors including alcohol use and parental history of schizophrenia, cannabis use disorder was linked to about 30 percent of diagnoses of schizophrenia in young men in the year 2021.Researchers suggested that more schizophrenia cases were linked to cannabis use in men because this group was more likely to smoke the drug and smoke it more regularly than women.Previous research has suggested that men are more likely to use the drug than women and to use it more regularly, which may be linked to peer pressure.Nonetheless, the advent of other ways to use the drug — such as gummies — is now driving a rise in marijuana use among women. The NIDA — which funded the study — has been outspoken in its warnings over cannabis use in the United States, warning that far too little is known about its health effects for the drug to be widely available for recreational use.It has been spurred into action after as many as 22 states have rolled forward and legalized the recreational use of marijuana.",
        "A growing body of studies warns, however, that the drug can damage brain development in adolescents and may raise the risk of mental disorders such as depression and anxiety.Dr Carsten Hjorthøj, a mental health expert at the University of Copenhagen who was involved in the research, said: 'Increases in the legalization of cannabis over the past few decades have made it one of the most frequently used psychoactive substances in the world, while also decreasing the public’s perception of its harm. 'This study adds to our growing understanding that cannabis use is not harmless and that risks are not fixed at one point in time.'He warned back in 2021 that cannabis was 'not harmless'.'There is, unfortunately, evidence to suggest that cannabis is increasingly seen as a somewhat harmless substance,' he told CNN.'This is unfortunate, since we see links with schizophrenia, poorer cognitive function, substance use disorders, etc.' The study was published in the journal Psychological Medicine. "
    ]
}