{
    "articleURL": "/news/article-12051487/Wife-kept-husband-slave-tells-court-thong-doesnt-mean-having-sex.html",
    "content": [
        "Sarah Somerset-How and George Webb face charge of holding person in slaveryWebb, 50, is also charged with ill-treatment by a care worker and bodily harmA disabled man's wife, who allegedly 'enslaved' him, has today admitted having an affair with his carer, but argued that owning a thong does not mean she was having sex.",
        "Sarah Somerset-How, 49, and lover George Webb, 50, are charged with holding a person in slavery and ill-treatment by a care worker at her husband's home in Chichester, West Sussex.Webb also faces a charge of assault occasioning actual bodily harm (ABH) against Mr Somerset-How after allegedly hitting him with a shoe.Mrs Somerset-How also faces charges of fraud and theft.Portsmouth Crown Court heard that Mrs Somerset-How and Webb allegedly 'enslaved' her husband Tom, barely keeping him alive as they spent his money while treating him 'like a piece of property'.",
        "While they bought themselves lingerie and DJ equipment with cash he had been given by relatives, the 40-year-old, an 'intelligent' history graduate with cerebral palsy, was left as a 'prisoner in his own home', a jury has been told.Sarah Somerset-How said Webb was her 'rock' and they had grown 'closer than we should have'. But she denied a long running relationship, saying the affair that began shortly after they first met fizzled out after six months before rekindling briefly three years later.When asked about text messages between her and Webb about her underwear, she told the court: 'Just because I had a thong it doesn't mean I was having sex'.Giving evidence, Mrs Somerset-How today told jurors her husband 'didn't go without anything'.",
        "Under cross-examination by her barrister, Mrs Somerset-How said: 'I met George and saw how good he was with Tom. He hit the ground running. Tom had exactly what he wanted, when he wanted.'Tom didn't go without anything. The care was above what was required.'When asked if she ever witnessed Webb assault Mr Somerset-How, she said 'no, never, there was never any incident'.She said if Webb had hit Mr Somerset-How, she would have dismissed him. She told the court her husband never raised any concerns about his care with her, and the allegations of neglect were 'rubbish'.",
        "When asked about the state of the house, Mrs Somerset-How said: 'The house was always clean. Always clean. The bathroom was immaculate after the mould had been sorted.''George was my support network. We became very close, maybe we were closer than we should have been.'He was my rock and my support.'She told the jury they became 'intimate' in 2016 but it only lasted for six months, and started up again briefly in 2019.When asked how she felt when her husband was 'rescued' by social services, she said: 'I was shocked. I couldn't comprehend it.'When asked by the prosecution why, if her husband had been properly cared for, did a doctor describe him as 'pale', she said 'he didn't catch the sun'.",
        "Paul Cavin KC said: 'That is nonsense, isn't it? Your case is that Tom was perfectly well and cared for by you and George. He had no complaints. He wasn't kept in bed all the time.'To which she replied 'he would make his own choices. He was taken out a lot'.Mr Cavin said: 'So in relation to these years, up until he asked to be removed, he was pretty lucky?' She replied: 'he got what he wanted.'Mr Cavin asked her: 'How did you let George rack up thousands of pounds of debt in your name? You were fleecing Tom to fund your lifestyles- studios, trips, concerts.'The truth is you saddled Tom with these two loans when you knew there wasn't enough money to pay them back.'Mrs Somerset-How said: 'We had a five-year plan to pay it back.'When asked about text messages between her and Webb about 'thongs', she said 'just because I had a thong it doesn't mean I was having sex'.The court has heard Webb began working for the couple in 2016.They allegedly left wheelchair-bound Mr Somerset How - who is almost blind and needs 24-hour care - in bed for 90 per cent of the time, allowed him a shower once a week and went for a whole year without brushing his teeth.",
        "For food he would be left with only a packet of crisps and a sandwich, the court was told, while Somerset-How carried out a plan to 'ostracise' him from his family and use him as 'a cash cow'.The jury was told that eventually Mr Somerset-How managed to raise the alarm about how he was being treated with a friend who alerted his parents.They then staged a rescue with police and social services, 'an operation that had the marks of extracting someone as a hostage', the court heard.Webb and Somerset-How deny all the charges.The trial at Portsmouth Crown Court continues."
    ]
}