{
    "articleURL": "/news/article-12053369/Rescue-effort-native-black-kite-bird-travelled-1300km-Western-Australia-Bali.html",
    "content": [
        " Millie the Black Kite became a stowaway  She took refuge from a storm on a cruise ship Now she's in Bali, unable to return to AustraliaThousands of people are coming together to bring a rare native bird back to Australia, despite the government saying that there's no way of it returning without facing a grim end.",
        "Millie the Black Kite hid in the Seabourn Sojourn cruise ship during a storm in Broome, NSW, on March 23, before the ship departed en route to Bali.Now she's stuck there due to Australia's strict import and quarantine laws. Millie was found onboard by the ship's captain, Kyriakos Karras, who contacted Australian Native Birds to notify them on the whereabouts of the missing animal.After landing in Indonesia, Millie spent 16 days in quarantine before being transported to the Bali Bird Park on April 10, where she now remains in captivity. Debra and Chris Mitchell, who raised Millie from infancy, have appealed for help to the government as locals petition to get her back to Broome.",
        "After Millie arrived in Bali on March 27, Mr Mitchell contacted the Bali Consul General and Australia's Department of Foreign Affairs and Trading (DFAT) to try and get her back.'We'd had a bit of bad weather that day and I think the passengers had been feeding it, which isn't the best thing to do, and she sailed away on the boat,' Mr Mitchell told 9news.'Quarantine are just saying, it's a high-risk avian thing which, mind you, there's birds transiting between Asia and Australia every day in the north, but they weren't conducive to allowing us to bring it back and put her in quarantine here.'",
        "Biosecurity laws don't allow avian imports from Indonesia, meaning if Millie were to return she would be euthanised upon arrival by Australian Quarantine.Millie immediately lost her Australian health status when the ship docked in Bali because the integrity of her quarantine, the food she ate, the condition of the cage, and the vehicles she entered could not be guaranteed as safe. DFAT said that without a guaranteed health status, the best that can be done for Millie is finding a new home for her in Bali. 'Once an animal leaves Australia it no longer has an Australian health status and, as Millie cannot be returned to Australia, the consul general in Bali are assisting with rehoming options that will maybe enable us to visit Millie once she is found in her new home,' the department told 6PR last month. Debra and Chris Mitchell have paid for Millie's care and relocation since she got to Bali while they've been fighting for her return.Captain Karras declared Millie as cargo to the Balinese Government upon arrival and requested that she be sent back to Australia due to her native status.The request was denied and Mr Mitchell immediately appealed the decision with the Australian Government.That appeal was also denied on April 4, this time by the Department of Agriculture, Fisheries and Forestry/Animal and Biological Imports.",
        "The community in Broome has nevertheless launched a petition to try and bring the native bird back so that it can be released into the wild again.",
        "The petition was launched by Elizabeth Lazenby and got 4,500 signatories before disappearing from the internet.  'Broome locals will tell stories of Millie sitting on the cricket pitch during junior games, circling Christmas festivities at the golf club, or even making appearances at the Roebuck Roadhouse for Sunday lunch,' Lazenby had written in the petition.'Millie is now destined to be caged in a bird park in Indonesia for her entire life. This is not ok! Birds migrate across the globe every year, so why is there an issue returning a native animal.'Please help us get this vibrant member of our community home to where she belongs.'Millie was moved to her current enclosure at the bird park after spending more than two weeks in quarantine.Her cage is 8m x 4m x 6m high and is intended to become her permanent home. "
    ]
}