{
    "articleURL": "/wires/reuters/article-12041551/Soccer-FIFA-responsible-undervaluing-Womens-World-Cup-says-Dodd.html",
    "content": [
        "May 3 (Reuters) - Former FIFA Council member Moya Dodd has criticised Gianni Infantino's threat of a Women's World Cup broadcast blackout in Europe this year and said the governing body is responsible for the tournament being historically undervalued.",
        "FIFA is selling TV rights to the women's tournament separately from the men's for the first time and president Infantino said Europe's \"Big 5\" nations face a blackout unless broadcasters improve on their \"unacceptable\" offers.Broadcasters from Britain, Spain, France, Germany and Italy had offered only $1 million-$10 million for the rights, compared to $100 million-$200 million for the men's World Cup, he added.Dodd, an ex-Australia international, said the broadcast industry had undervalued the women's tournament as FIFA had sold the rights together with the men's.\"Now that FIFA has decided to sell the rights separately, it's no surprise that the buyers don't want to pay the same big numbers twice,\" Dodd told the Sydney Morning Herald.\"Effectively, the industry was trained to pay big money for the men's World Cup and treat the women's equivalent as worthless. At the same time, the women were told they didn't deserve prize money or equal pay because they didn't bring the revenues.\"It's actually quite outrageous. For FIFA to now say that all women's revenues will go straight into women's football overlooks the fact that the value of the women's rights have until now been used to inflate the value of men's football.\"Dodd said that instead of threatening broadcasters FIFA should review all of its bundled deals and attribute a fair proportion to the women's game.",
        "\"If in fact the Women's World Cup gets 50-60% of the viewers of the men's, as FIFA says, that should amount to a sum in the billions,\" she added.FIFA did not comment on Dodd's remarks but Infantino earlier said that \"100% of any rights fees paid would go straight into women's football, in our (FIFA's) move to promote actions towards equal conditions and pay\".In March, FIFAannouncedthat a total package of $152 million would be on offer at this year's tournament - three times more than at the 2019 edition in France and over 10 times more than the amount offered at the 2015 tournament in Canada.The Women's World Cup will be held from July 20-Aug. 20 in Australia and New Zealand. (Reporting by Manasi Pathak in Bengaluru; Editing by Ed Peter Rutherford and Ed Osmond )"
    ]
}