{
    "articleURL": "/sciencetech/article-12041089/NASA-animation-reveals-biggest-black-holes-UNIVERSE.html",
    "content": [
        "A new NASA animation shows 10 enormous black holes observed in the universeThey include Sagittarius A* at the heart of our galaxy, plus a giant called TON 618They are the 'monsters' that lurk at the heart of most big galaxies.",
        "And now a new NASA animation reveals just what puts the 'super' into supermassive black holes.It shows 10 of the most mysterious star-gobbling giants occupying the centre of their host galaxies, including the Milky Way and M87. The animation scales each of the behemoths by the size of their shadows, which we got a closer look at when the first images of black holes revealed a bright ring of hot orbiting gas surrounding a circular zone of darkness.As light crosses the black hole's event horizon it becomes trapped forever, while any light passing close to it is redirected by the object's intense gravity.",
        "These two effects together are what produce the black hole's 'shadow', which is about twice the size of its actual event horizon.",
        "Black holes are so dense and their gravitational pull is so strong that no form of radiation can escape them - not even light.They act as intense sources of gravity which hoover up dust and gas around them. Their intense gravitational pull is thought to be what stars in galaxies orbit around.How they are formed is still poorly understood. Astronomers believe they may form when a large cloud of gas up to 100,000 times bigger than the sun, collapses into a black hole.Many of these black hole seeds then merge to form much larger supermassive black holes, which are found at the centre of every known massive galaxy.Alternatively, a supermassive black hole seed could come from a giant star, about 100 times the sun's mass, that ultimately forms into a black hole after it runs out of fuel and collapses.When these giant stars die, they also go 'supernova', a huge explosion that expels the matter from the outer layers of the star into deep space. ",
        "Starting at our sun, the camera slowly pulls back to compare these ever-larger black holes to different structures in our solar system.First up is a relative baby sitting in the dwarf galaxy 1601+3113. It has a mass of 100,000 suns, but this matter is so compressed that even the black hole's shadow is smaller than our sun.If that seems big, however, it's quickly apparent you haven't been looking deep enough into the universe.Next in size is at the heart of our own galaxy, a supermassive black hole called called Sagittarius A*.This boasts the weight of some 4.3 million suns and has a shadow diameter spanning around half that of Mercury's orbit in our solar system.The animation then reveals two enormous black holes in the galaxy NGC 7727, which is about 89 million light-years away from Earth.The two objects themselves are around 1,600 light-years apart, but are very different in size.One weighs 6 million solar masses and the other equates to more than 150 million suns. That is bad news for the former, because astronomers say the pair will merge within the next 250 million years, causing the latter to gobble it up.At this point we get to the big guns. First is M87's black hole, which has a mass of 5.4 billion suns and a shadow so big that even a beam of light — travelling at 670 million mph — would take about two and a half days to cross it.",
        "And lastly there's a giant so big in size that the clue is in the name.TON 618 is one of a handful of extremely distant and massive black holes for which astronomers have direct measurements. ",
        "It equates to a scarcely believable 60 billion solar masses and boasts a shadow so enormous that a beam of light would take weeks to traverse it. 'Direct measurements, many made with the help of the Hubble Space Telescope, confirm the presence of more than 100 supermassive black holes,' said Jeremy Schnittman, a theorist at NASA's Goddard Space Flight Center in Maryland. 'How do they get so big? When galaxies collide, their central black holes eventually may merge together too.'Goddard astrophysicist Ira Thorpe added: 'Since 2015, gravitational wave observatories on Earth have detected the mergers of black holes with a few dozen solar masses thanks to the tiny ripples in space-time these events produce.",
        "'Mergers of supermassive black holes will produce waves of much lower frequencies which can be detected using a space-based observatory millions of times larger than its Earth-based counterparts.'It is for this reason that NASA Is working with the European Space Agency (ESA) to develop the LISA mission.An acronym for Laser Interferometer Space Antenna, it will be a constellation of three spacecraft in a triangle that will shoot laser beams back and forth over millions of miles.",
        "The purpose is to detect the passing gravitational waves from merging black holes with masses up to a few hundred million suns.It is hoped that the mission will launch sometime in the next decade.",
        "The galactic centre of the Milky Way is dominated by one resident, the supermassive black hole known as Sagittarius A*.Supermassive black holes are incredibly dense areas in the centre of galaxies with masses that can be billions of times that of the sun.They act as intense sources of gravity which hoover up dust and gas around them. Evidence of a black hole at the centre of our galaxy was first presented by physicist Karl Jansky in 1931, when he discovered radio waves coming from the region. Pre-eminent yet invisible, Sgr A* has the mass equivalent to some four million suns.  At just 26,000 light years from Earth, Sgr A* is one of very few black holes in the universe where we can actually witness the flow of matter nearby.Less than one per cent of the material initially within the black hole’s gravitational influence reaches the event horizon, or point of no return, because much of it is ejected. Consequently, the X-ray emission from material near Sgr A* is remarkably faint, like that of most of the giant black holes in galaxies in the nearby universe.The captured material needs to lose heat and angular momentum before being able to plunge into the black hole. The ejection of matter allows this loss to occur."
    ]
}