{
    "articleURL": "/wires/ap/article-12043643/Ex-UN-food-chief-returns-South-Carolina-roots-speech.html",
    "content": [
        "COLUMBIA, S.C. (AP) - For the first time in 25 years, former South Carolina Gov. David Beasley stood before lawmakers in his home state and gave a speech Wednesday. His wasn't a look back at old times, but a talk about his second career - combatting world hunger.",
        "While he shook hands and swapped stories, Beasley has moved on. Since then he has been instrumental in securing a Nobel Peace Prize for the United Nations World Food Program, which has saved millions around the globe from starvation.The Republican whose political career appeared to tank after he lost a reelection bid in 1998 only briefly mentioned that part of his life. Instead, he talked about his second career leading the World Food Program. He worked there for six years, appointed by Donald Trump and continuing under President Joe Biden before stepping aside last month.Beasley told legislators - just 11 of the 170 of them were serving when he last addressed them at his 1998 State of the State speech - to hang on to the state motto \"while I breathe, I hope.\" He added that he knows what they do in Columbia, the state capital, can make small and big changes all over the globe.\"I´ve seen the world. The good the bad and the ugly. We´re moving in the wrong direction. But we can change that course with the heart, the spirit we have in this room,\" Beasley said.Hunger and starvation are becoming bigger issues with climate change and wars and conflicts, he said.",
        "When Beasley took the U.N. job in 2017, about 80 million people in the world were heading toward starvation. But since then, COVID-19, wars and conflicts in Ukraine, Yemen, Ethiopia, Afghanistan, Somalia and other places and crop-killing extreme weather now have 350 million teetering on the brink of death.",
        "Beasley pushed back against the Trump administration's desire to give less international aid and broadened the amount of help the food agency gives and the sources of its funding. He said starvation is one of the most destabilizing forces in the world.That idea piqued the interest of the Nobel Peace Prize committee, which honored the U.N. World Food Program with its 2020 prize for trying to end the use of hunger as a weapon of war and turning the world's eyes toward the millions who still suffer in an increasingly prosperous world.The U.N. food program fed 180 million people, many over and over again, last year. But that's not what Beasley said he thinks about before he goes to sleep.\"I don´t go to bed at night thinking about the children I saved,\" Beasley said. \"I go to bed at night heartbroken over the children I couldn´t reach.\"Beasley, 66, began his political career started in 1979 as one of the youngest representatives in the House.He was elected governor in 1994, completing one stormy term where he battled to get rid of video poker. In 1996, he called for the Confederate flag to be taken down from the Statehouse dome, roiling many of his fellow Republicans.Eventually, video poker was banned and the Confederate flag came down from the Statehouse dome to the front lawn and in 2015 off the capitol grounds entirely.",
        "Legislators invited Beasley to speak to honor his second career, and he told them Wednesday that everything he learned in his life came from South Carolina, the General Assembly and the people he met.\"The fights that we had on the floor, The love, the compassion - issues that I took with me all around the world,\" Beasley said."
    ]
}