{
    "articleURL": "/wires/ap/article-12061015/Oath-Keepers-Rhodes-seeks-leniency-Jan-6-sentence.html",
    "content": [
        "Lawyers for Stewart Rhodes, the Oath Keepers founder convicted of seditious conspiracy in the attack on the U.S. Capitol, say he doesn´t deserve any more time behind bars when he´s sentenced this month, according to court papers filed Monday.",
        "While the Justice Department is seeking 25 years in prison, defense attorneys are urging the judge to sentence Rhodes to the time behind bars he has already served. Rhodes, of Granbury, Texas, has been locked up since his arrest in January 2022.Rhodes is expected to be sentenced on May 25 after his November conviction in one of the most serious cases brought so far in the Jan. 6, 2021, attack. Prosecutors accused Rhodes of being the architect of a plot with his extremist followers to forcibly block the transfer of power from President Donald Trump to President Joe Biden.Prosecutors built their case around dozens of encrypted messages and other communications in the weeks leading up to Jan. 6 that showed Rhodes rallying his followers to fight to defend Trump and warning they might need to \"rise up in insurrection\" to defeat Biden if Trump didn´t act.Rhodes, who took the witness stand at trial, has insisted there was no plan to attack the Capitol and said the Oath Keepers who did so acted on their own. His attorneys say they plan to appeal his conviction.In their filing, Rhodes' attorneys told the judge that all of Rhodes' writings and statements were \"protected political speech.\"",
        "\"None of his protected speech incited or encouraged imminent violent or unlawful acts, nor were any likely to occur as a result of his speech,\" they wrote. \"In particular, nothing Mr. Rhodes wrote or published concerned the direct prevention of the transfer of power between then President Trump and President-elect Biden.\"",
        "His attorneys cited Rhodes' military service - Rhodes joined the Army fresh out of high school and served nearly three years before he was honorably discharged in January 1986 after breaking his back in a parachuting accident.They also rejected the portrayal of the Oath Keepers as an extremists group, and noted that its members helped provide assistance after Hurricane Katrina and other events.\"Much as the character of those within the Oath Keepers has been misconstrued and mischaracterized by others, so too has their history and actions,\" they wrote.Rhodes was convicted of seditious conspiracy alongside Florida Oath Keepers chapter Kelly Meggs, while three of their co-defendants were cleared of the rarely used Civil War-era charge. Those three, however, were convicted of other serious crimes. Four other Oath Keepers were convicted of the sedition charge in a subsequent trial.Prosecutors, in their filing, described the Oath Keepers´ actions as \"terrorism,\" and told the judge that a harsh sentence is critical to deter future political violence. They wrote that Rhodes believes he has done nothing wrong and \"still presents a threat to American democracy and lives.\"Leaders of another far-right extremist group, the Proud Boys, were convicted of seditious conspiracy last week for what prosecutors said was a separate plot to stop the transfer of power. Those convicted in that case include former Proud Boys national chairman Enrique Tarrio."
    ]
}