{
    "articleURL": "/wires/ap/article-12054993/Feeling-believing-Inside-abbey-kings-coronation.html",
    "content": [
        "LONDON (AP) - Being there is better.",
        "I didn´t see much of the coronation of King Charles III and neither did many of the 2,300 or so other guests inside Westminster Abbey. We were too far away, or were seated behind the choir, or had our view blocked by a guardsman in a plumed helmet. But we heard it - and felt it - in a way that just wasn´t possible for those watching on television.It was in the moment the choir, organ and orchestra blasted out \"Zadok the Priest,\" Handel´s coronation anthem, so boldly that it startled me even though I knew it was coming. It was in the gusto with which the congregation shouted \"God save the king!\" after Charles was crowned. And it was in the joyous fanfare blown by trumpeters in the balcony where just a few months ago a lone bagpiper bid farewell to Charles´ mother, Queen Elizabeth II.This was a moment of celebration for Charles and his supporters, a stark contrast to the day in September when the nation mourned the death of a queen who had reigned for 70 years.But there was also a sense of the torch being passed in the place where the kings and queens of England have been crowned for 1,000 years. The chance to be part of that history made it special to be inside the abbey, said Barbara Swinn, a librarian from York who was invited because she was awarded a British Empire Medal for services to her community.",
        "\"I also got emotional when they did `Zadok the Priest,´ and I suppose it´s because it was reminiscent of Elizabeth II,\" she said. \"Whenever they talked about her coronation, they played that, and I just thought there was that sense of continuity. It just sort of gave me goosebumps.\"",
        "I didn´t earn my place in the abbey through community service. I´m just a reporter who occasionally gets the chance to witness history.But my own goosebumps began the moment I walked in and was herded to my \"vision obstructed\" seat more than three hours before the service began.The church was awash with flowers, and it smelled like a garden after a soft spring rain. The space above the high altar looked like a wildflower meadow.Everywhere there were reminders of the medieval roots of this ceremony, alongside Charles´ efforts to make it more reflective of modern Britain.Lords and ladies in ceremonial robes, judges in their wigs and soldiers with medals pinned to red tunics filed in alongside women wearing hats in spring shades and men in suits and kilts.As the trumpeters' fanfare rang out from the balcony, we knew the king and queen were arriving. But I wouldn´t have seen them if I hadn´t glanced at the giant TV screen mounted over the nearby tomb topped by a sculpture of a reclining nobleman.",
        "I finally caught a glimpse of Charles, his head at least, when he faced each corner of the congregation and was presented as Britain´s \"undoubted king.\" Later there was a flash of purple velvet as the crown was placed on Queen Camilla´s head.But that was about all anyone in my corner of the abbey could see. Even so, Kim Beck wouldn´t have missed the opportunity to be there.Beck, a teacher who helps refugees from Afghanistan, was awarded a British Empire medal for services to education. But she didn't think she was something special and was surprised to be invited.The service, she said, was spectacular.\"I was struggling to sing the national anthem,´´ Beck said. \"It was really emotional.´´I understand why she feels that way.___Danica Kirka is an Associated Press writer based in London.___Follow AP´s coverage of King Charles III at https://apnews.com/hub/king-charles-iii"
    ]
}