{
    "articleURL": "/wires/aap/article-12061557/Welch-happy-fellow-prop-Haas-lead-Dally-M-charge.html",
    "content": [
        "Christian Welch is quietly cheering the form of Brisbane big man Payne Haas, who is striking a blow for NRL props everywhere.",
        "After 10 rounds, wrecking ball Haas leads the count in the Dally M Medal, awarded to the league's best player at the end of the season.The 23-year-old has polled 27 votes, three more than his Broncos teammate, young fullback Reece Walsh, with star playmakers Cody Walker and Nathan Cleary a further three points back on 21.Haas and Walsh picked up four votes each in Brisbane's emphatic Magic Round win over Manly.Since the first Dally M award in 1979, a prop has never won - with only five forwards ever claiming the prize.While Melbourne skipper Welch is hoping Haas has a temporary form dip on Thursday night when the Storm host the ladder-leading Broncos, he's delighted to see another prop finally recognised for their grunt work.\"Obviously it's an award for halfbacks and fullbacks and spine players, so to see a front-rower up there I'm bloody pumped for him,\" Welch told AAP.\"He's such a dominant player. Guys like him and Junior Paulo, they're phenomenal players and athletes, and it's always a great challenge taking them on because they're the measuring stick.\"Payne's a phenomenal player in the Broncos and the NRL in general. We're lucky to have him in there.\"Welch's last comment was in reference to Rugby Australia's bold bid to lure Haas, who is off-contract at the end of the 2024 season, across to the 15-a-side game.",
        "The Storm are looking to step up after a disappointing showing at Suncorp Stadium, where they were outplayed by South Sydney.They have been boosted by news their own giant Nelson Asofa-Solomona, who was forced off against the Rabbitohs with a rib issue, is set to face the Broncos at AAMI Park.The Kiwi Test forward was only in his second match for the sixth-placed Storm after returning from a round two knee injury.\"We missed him when he was out with his knee but it's really been a good two weeks having him back - he's such a physical presence,\" Welch said of Asofa-Solomona, who recently resisted rugby overtures to re-sign with Melbourne.\"He's such a core part of our forward pack so hopefully he doesn't miss any time and we can have him lined up on Thursday night.\""
    ]
}