{
    "articleURL": "/femail/article-12050257/Meghans-SECOND-wedding-gown-glamorous-number-danced-night-away-Harry.html",
    "content": [
        "Meghan's stylish Givenchy gown wowed at St George's, WindsorBut she swapped into a backless Stella McCartney dress for evening receptionFor all the latest Royal news, pictures and video click here Meghan Markle's stunning wedding gown was everything royal fans had hoped for - and more - as she walked down the aisle towards Prince Harry.",
        "The Duchess of Sussex moved her groom to tears in the classic silk gown in pure white, with a 15ft veil embroidered with flowers of the Commonwealth.The dress, designed by Clare Waight Keller for Givenchy, was minimal yet classic, the main focus being the open bateau neckline that gracefully framed the shoulders and sculpted Meghan's waist.However, another wedding dress would soon be on view that day - five years ago today. And this one wowed the crowds in quite a different way. ",
        "The ceremony had taken place  St George's, Windsor, on May 19 2018 in front of 600 guests.Afterwards, however, 200 of the bride and groom's closest friends and family went on to Frogmore House on the Windsor estate for an evening reception hosted by Prince Charles .As with other royal brides, Meghan changed into a second dress for the intimate gathering, this time opting for a bespoke Stella McCartney design. While the first dress was expected to be a 'traditional and elegant' wedding gown, the second was a modest yet more glamorous number.The slinky evening dress was made from silk crepe and the halter neck gown was pure white just like Meghan's £200,000 Givenchy number for the ceremony.The backless number allowed the Duchess of Sussex to show off her toned shoulders and back and the figure-hugging gown featured a dramatic fluted skirt.",
        "Meghan paired the evening gown with heels by Aquazurra made in silky satin with nude mesh and soles painted in baby blue.Meghan wore an aquamarine ring belonging to the late Lady Diana Spencer, thought to have been a sentimental gift from Prince Harry so as to include his mother on the big day.",
        "Prince Harry also had an outfit change into a sleek dinner suit with black tie as he and Meghan headed to the reception in an ice-blue vintage Jaguar.Sharing a sketch of the design Meghan wore to the evening reception in 2018, British designer, Stella McCartney said:'I am so proud and honoured to have been chosen by the Duchess of Sussex to make her evening gown and represent British design.'It has truly been one of the most humbling moments of my career and I am so proud of all the team on this stunning sunny royal day,' she told fashion magazine Women's Wear Daily.Many had suspected that Meghan would choose McCartney, given the designer's stance against using fur and leather, as well as her use of organic fabrics - an outlook which fits with Meghan and Harry's eco-friendly principles",
        "Unlike the dress worn during the ceremony, the evening gown had a smaller train and the slinky material meant Meghan and Harry could dance the night away.",
        "Her hair - styled by George Northwood - was up in a  tight bun with face-framing layers, which perfectly suited the dress and the less-formal evening occasion. Celebrity stylist Lucas Armitage revealed to Femail that the gown would probably have cost around £80,000 for fabric, design and fittings.Kate, the Princess of Wales, also wore two wedding dresses on her big day in 2011, which were both designed by Alexander McQueen's Sarah Burton."
    ]
}