{
    "articleURL": "/wires/afp/article-12057079/Superhero-fatigue-Not-Guardians-film.html",
    "content": [
        "Despite talk of growing superhero fatigue among moviegoers, Marvel's \"Guardians of the Galaxy Vol. 3\" opened to a solid $114 million in ticket sales in North American theaters, industry watcher Exhibitor Relations reported Sunday.",
        "That estimated total, while well below last year's opening of Marvel's \"Doctor Strange and the Multiverse of Madness\" -- which launched to the tune of $187 million -- was still \"an excellent opening for a Marvel episode 3 sequel,\" said analyst David A. Gross, adding, \"This is strong business.\"The latest tale of oddball intergalactic mercenaries, human and otherwise, again stars Chris Pratt, Zoe Saldana, Dave Bautista, Bradley Cooper and Vin Diesel -- this time on a mission to save comrade Rocket Raccoon from a scientist intent on removing his brain.The \"Guardians\" finally unseated Universal's \"The Super Mario Bros. Movie\" from the top spot in its fifth week out. The video game-based film, which has earned more than a billion dollars globally, took in $18.6 million for the Friday-through-Sunday period.Warner Bros.' blood-soaked horror film \"Evil Dead Rise\" dropped one spot to third, taking in $5.7 million. It has two sisters (Lily Sullivan and Alyssa Sutherland) battling the demonic Deadites crew.In fourth place, also down one spot, was Lionsgate comedy-drama \"Are You There God? It's Me, Margaret,\" at $3.4 million. Abby Ryder Fortson plays sixth-grader Margaret Simon as she navigates the challenges of that awkward age.And in fifth spot was new Sony rom-com \"Love Again,\" at $2.4 million. Priyanka Chopra Jonas plays a young woman trying to cope with the death of her fiance. Trying to help her do so is journalist and -- spoiler alert: eventual love interest -- Rob Burns, played by Sam Heughan. Celine Dion plays herself.",
        "The film has a paltry 17 percent positive rating on website Rotten Tomatoes, with one critic calling it \"lazy, misguided and uninspired.\"Rounding out the top 10 were:\"John Wick: Chapter 4\" ($2.4 million)\"Dungeons &amp; Dragons: Honor Among Thieves\" ($1.5 million)\"Air\" ($1.4 million)\"Guy Ritchie's The Covenant\" ($1.2 million)\"Sisu\" ($1.1 million)"
    ]
}