{
    "articleURL": "/news/article-12061095/King-Charles-Queen-Camilla-enjoy-days-Sandringham-Coronation.html",
    "content": [
        "The King and Queen are to take a break at Sandringham this weekCharles has one engagement today before he joins his wife for some restREAD MORE: The hardest working royal you've never heard of The King and Queen are to take a break at Sandringham this week as they recover after the weekend of celebrations.",
        "Charles, 74, has one engagement today before he joins his wife for some well-deserved rest and relaxation at their private Norfolk estate.They will take the rest of the week off and possibly a few days early next week.But aides are already busy planning a packed schedule in the run-up to their summer break, including the annual Order of the Garter ceremony and visits the length and breadth of Britain.There is also expected to be a short state visit abroad in autumn – possibly their rescheduled trip to France, which had to be cancelled at the 11th hour in March due to civil unrest there. ",
        "A long-distance foreign visit is also on the cards, with the King confirmed to travel to Samoa in the South Pacific next year for the Commonwealth Heads of Government Meeting.Situated halfway between New Zealand and Hawaii – almost 10,000 miles away – it will be a gruelling journey for Charles, who will be 75 by then. The Queen will be 76.It is therefore likely he may try to fit in stop-overs in Australia and New Zealand, both countries where he is still head of state and are long overdue for a senior royal to visit. More immediately, the King has several major public engagements planned but details cannot be revealed yet.",
        "The Queen is also planning her first Reading Room Festival at Hampton Court Palace in west London next month now that her Instagram book club has become a charity promoting literacy.Sources have said the couple are delighted their CoronaFANtion went so well, despite the inclement weather on Saturday, and were 'thrilled' to see so many people enjoying the weekend's celebrations.But they are said to be ready for a few days 'out of the spotlight'.While the King, like his late mother, never stops working – dealing with the 'red boxes' of state on a daily basis – he considers Sandringham a 'tonic'.Meanwhile, the Prince of Wales told one helper at a Big Help Out event in Slough yesterday that his children were 'so tired' after the Coronation weekend that he was worried he would have 'trouble getting them up for school' today.Prince George, Princess Charlotte and Prince Louis stole the show over the bank holiday weekend at many public events."
    ]
}