{
    "articleURL": "/wires/ap/article-12061429/Bob-Huggins-apologizes-homophobic-slur-radio-show.html",
    "content": [
        "West Virginia basketball coach Bob Huggins apologized Monday after using a homophobic slur to refer to Xavier fans while also denigrating Catholics during a radio interview.",
        "West Virginia's athletic department called Huggins' comments \"offensive\" and said it was reviewing the matter.During a call to Cincinnati radio station WLW, Huggins, a former longtime coach at Cincinnati, was asked about the transfer portal and whether he had a chance of landing a player from Xavier, a Jesuit school and the Bearcats' crosstown rival.\"Catholics don't do that,\" Huggins said. \"I tell you what, any school that can throw rubber penises on the floor and then say they didn´t do it, by God they can get away with anything.\"It was the Crosstown Shootout. What it was, was all those (expletive), those Catholic (expletive), I think.\"Later Monday, Huggins issued a statement saying he \"used a completely insensitive and abhorrent phrase that there is simply no excuse for - and I won´t try to make one here. I deeply apologize to the individuals I have offended, as well as to the Xavier University community, the University of Cincinnati and West Virginia University.\"As I have shared with my players over my 40 years of coaching, there are consequences for our words and actions, and I will fully accept any coming my way. I am ashamed and embarrassed and heartbroken for those I have hurt. I must do better, and I will.\"",
        "In a separate statement, West Virginia's athletic department said Huggins´ remarks \"were insensitive, offensive and do not represent our University values. Coach Huggins has since apologized. West Virginia University does not condone the use of such language and takes such actions very seriously. The situation is under review and will be addressed by the University and its athletics department.\"Huggins spent 16 seasons at Cincinnati before being fired in 2005 in a power struggle with the school´s president as well as the aftermath of a 2004 drunken driving arrest. After spending one season at Kansas State, Huggins took his dream job at West Virginia, his alma mater, in 2007.Huggins was inducted into the Basketball Hall of Fame last year.___AP college basketball: https://apnews.com/hub/college-basketball and https://apnews.com/hub/ap-top-25-college-basketball-poll and https://twitter.com/AP_Top25"
    ]
}