{
    "articleURL": "/femail/fashion/article-12061521/KFC-launches-street-wear-merchandise-Australia-ahead-Sydney-Fashion-Week.html",
    "content": [
        "KFC has released a huge merchandise collection in Australia Prices range from $20 to $75 with proceeds going to charity  KFC Australia have launched its first ever streetwear collection dubbed 'Kentucky couture' sending fans into a frenzy. ",
        "The collection features more than 20 items - including Zinger t-shirts, varsity jackets, bucket hats and drumstick bumbags.Similar collections have 'sold out in minutes' in the UK so fans are being urged to get in quick to avoid disappointment. Prices ranging from $20 for a pair of KFC drumstick socks to $75 for a KFC logo coal red hoodie, with all proceeds going to charity. ",
        "After seeing the demand overseas and listening to customer requests in Australia, the fast food giant decided to launch the range Down Under.To celebrate the release, KFC unofficially kicked off the fashion season with a runway show featuring the full merch line.Models took to the runway each wearing a different look to showcase the fiery options available.",
        "KFC logo pattern party shirt - $80KFC heritage pattern party shirt - $80Zinger® logo tee black - $50Zinger® logo tee white - $50The Colonel's signature tee - $45It's finger lickin' good® tee - $45The Colonel tee - $50KFC bucket tee - $50Zinger® logo black shorts - $45Zinger® logo black trackpants - $60The KFC bucket hat - $40It's finger lickin' good® cap - $35KFC drumstick bumbag - $501991 logo tee - $50Varsity jacket - $901978 logo red jumper - $701978 logo white jumper - $70Zinger® logo black jumper - $65KFC logo coal hoodie - $75KFC logo coal red hoodie - $751978 Colonel logo white shorts - $451978 Colonel logo white trackpants - $60KFC drumstick socks - $20The Colonel's socks - $20The Colonel's slides - $55",
        "Sally Spriggs, CMO KFC Australia, said: 'We're so excited to put KFC on the runway ahead of Sydney Fashion Week and even more thrilled to answer the call from our fans to bring this iconic range of merch to Australia.' Profits from all merch sales will support Aussie youth mental well-being through the KFC Youth Foundation and its charity partners The Black Dog Institute, ReachOut Australia and Whitelion.Customers wanting to get their hands on the latest products are encouraged to act quickly because stock is limited. To view and purchase the products, click here."
    ]
}