{
    "articleURL": "/tvshowbiz/article-12060233/Sum-41-announce-SPLIT-27-years.html",
    "content": [
        "Sum-41 have announced that they will be disbanding later this year. ",
        "The Canadian pop punk band revealed the news in an official statement Monday, thanking fans for the last 27 years of support.'Being in Sum 41 since 1996 brought us some of the best moments of our lives,' the statement began. 'We are forever grateful to our fans both old and new, who have supported us in every way It is hard to articulate the love and respect we have for all of you and we wanted you to hear this from us first,' they continued.Sum 41's members then spoke about their plans for the coming summer, during which they will mainline their own tour and appear alongside The Offspring and Simple Plan on the former's Let the Bad Times Roll Tour.",
        "'We will still be finishing all of our current upcoming tour dates this year, and we're looking forward to releasing our final album Heaven :x: Hell, along with a final worldwide headlining tour to celebrate,' they wrote.The band concluded their message by expressing their enthusiasm for their upcoming tour dates and showing their gratitude for the continued support of their fans.'For now, we look forward to seeing all of you skumf**s on the road and are excited for what the future will bring for each of us. Thank you for the last 27 years of Sum 41,' they wrote.",
        "Sum 41 was initially formed in Ajax, Ontario in 1996, and the group was originally known as Kaspir before its name was changed.The group currently consists of singer/guitarist Deryck Whibley, who was previously married to Avril Lavigne from 2006 until 2010, guitarist Dave Baksh, multi-instrumentalist Tom Thacker, bassist Jason McCaslin and drummer Frank Zummo.The band rose to prominence following the release of their 2001 single Fat Lip, which was featured on their debut album All Killer No Filler and ultimately topped the Billboard US Alternative Airplay chart.Sum 41 has released six albums since then, and the group's most recent record, entitled Order in Decline, made its debut in 2019.The group was nominated for the Grammy Award for Best Hard Rock/Metal Performance in 2012 for their work on the track Blood in My Eyes, although they ultimately lost to Foo Fighters.",
        "The band also received much praise in their native Canada, where they were nominated for and won numerous Juno Awards over the length of their career.Sum 41's final concert is currently scheduled to take place at the Xfinity Center in Mansfield, Massachusetts on September 3.Whibley revealed that the group had begun working on Heaven :x: Hell, which will be a double album, in March of last year.The forthcoming record's planned release date has not been revealed to the public as of yet. "
    ]
}