{
    "articleURL": "/wires/reuters/article-12061575/Japan-says-G7-discuss-strengthening-global-banking-system.html",
    "content": [
        "Policymakers must respond to changes in financial environment",
        "Japan to invite Ukraine to G7 session on aid to the countryU.S. debt ceiling, Russia sanctions among topics of debateJapan hopes to issue G7 joint statement, may mention bank woes(Adds comments from top financial diplomat in paragraphs 4,5)By Tetsushi Kajimoto and Leika KiharaTOKYO, May 9 (Reuters) - Finance leaders of the Group of Seven (G7) advanced economies will discuss this week ways to strengthen the global financial system, Japan's finance minister said on Tuesday, as recent U.S. bank failures bring the risk of digital bank runs into focus.\"The environment surrounding finance has changed dramatically with the emergence of social media and Internet banking,\" said Finance Minister Shunichi Suzuki, who will chair the G7 finance leaders' gathering to be held May 11-13 in the Japanese city of Niigata.\"Responding to such changes have become a common challenge for countries across the world, including Japan,\" he said, adding that the topic will be among many issues to be discussed at this week's G7 meeting.The G7 finance chiefs may also discuss the U.S. debt ceiling woes and steps to prevent Russia from circumventing sanctions, Japan's top financial diplomat Masato Kanda told reporters on Tuesday.Japan will invite Ukraine's finance minister to participate in a session on Thursday that will discuss aid to the war-struck country, Kanda said.",
        "The recent collapse of First Republic Bank has exacerbated investor worries about the U.S. banking sector, and raised calls for better global oversight by regulators to new risks such as digital bank runs.Japan would aim to issue a G7 joint statement after the finance leaders' meeting, which may stress the need for authorities to remain vigilant to banking sector woes, two government sources with direct knowledge of the matter said.\"There won't be much change to the basic message agreed upon in April,\" one of the sources said on condition of anonymity as he was not authorised to speak publicly.In a joint statement issued in April after their meeting in Washington D.C., the G7 finance chiefs said they stood ready to take \"appropriate actions\" to maintain the stability and resilience of the global financial system.U.S. Treasury Secretary Janet Yellen, who will travel to Japan, will tell her G7 counterparts that the U.S. banking system remains sound, a senior Treasury official said on Friday. (Reporting by Leika Kihara and Tetsushi Kajimoto; Additional reporting by Takaya Yamaguchi; Editing by Shri Navaratnam; Stephen Coates and Muralikumar Anantharaman)"
    ]
}