{
    "articleURL": "/femail/article-12045689/Man-won-99k-ITVs-1-Club-kept-secret-family-ultimate-surprise.html",
    "content": [
        "Daniel O'Halloran, 24, from Wirral, only told his grandmother of his winningsREAD MORE: 'I'm a millionaire but I hide my wealth from my family' A man who won £99,000 on an ITV quiz show has revealed how he kept it a secret for a whole year in a bid to give his family the ultimate surprise. ",
        "Daniel O'Halloran, 24, from Bebington, Wirral, said his relatives 'went nuts' last week when they watched his episode of the 1% Club and discovered he had won the jackpot - although he has yet to receive a penny of his winnings. The game show, hosted by comedian Lee Mack, tests the logic and common sense of its contestants - with one lucky winner out of 100 walking away with a small fortune.During his episode, Daniel, a plant operator and footballer in his spare time for the local Heswall FC, declined the chance to walk away with £10,000 and risked it all for the grand prize.Speaking to MailOnline today, he said he decided not tell his family about his true winnings 'for the fun of the surprise', adding that it was 'so worth it.' ",
        "He said: 'A few articles have made it sound like I kept it a secret for personal gain but there was none of that. 'Even now I don't have the money because it comes in 30 days after the show airs.' He added: 'They [his family] went nuts! 'I've just been so excited for it to get aired since last July so it was just amazing to finally be able to see their reactions. 'They couldn't believe I'd managed to keep it a secret which was even better.",
        "'They said a few things you wouldn't be able to print but they were just so proud of me.' Daniel filmed his feature episode back in July 2022 in Manchester, however it wasn't televised until Saturday April 29 of this year. It means he will receive his £99,000 in winnings on May 29. He said he did tell his grandmother how well he really did because it was 'especially nice to share the secret' with her, adding that she 'did so well' in playing along. He also told a handful of trustworthy friends after being left stunned by his victory.He added: 'It was beyond anything I could've imagined… I thought I'd do well on the show but never imagined I'd win or even take on the final question.'I'd like to think of myself as smart and good at working things out... I wasn't clever in school at all. 'I'm not an academic so made it through GCSEs okay but did really badly at A level.' ",
        "And when he finally receives his well-earned winnings at the end of this month, he has some sensible plans on how to spend it. He explained: 'I'll be doing some work on the house and paying off some of the mortgage - but I also need to enjoy it and hopefully go and see the world.' ",
        "Speaking to the Echo, Daniel previously told of how it had been hard to keep the secret from his family. He said: 'They were in total shock... They couldn't believe I'd kept it secret.' He added: 'It was very difficult, there were some moments I nearly blurted it out or my family would ask me and I couldn't keep the smile on my face.'Speaking of the moment he won the jackpot, Daniel described 'losing control' of his body, adding that he was 'running around celebrating on stage in total shock.'  As huge fans of the game show, Daniel's parents were elated to see their son on the big screen, especially as it was his mother's idea to apply for the show.He added that he initially had no intention of going on the programme, but a surprise call back from producers settled his nerves.",
        "Daniel said he really liked the format of the show and it's 'logic-based working out of things' but did concede that he almost succumbed to the live pressure.He told the Cheshire Standard: 'I didn't know how I was going to do it. You only have 30 seconds on each question, but I just got my head in it for those 30 seconds.  I remember on the day, my mum and dad both called me for half an hour separately and quizzed me, which was my revision.'",
        "He was adamant that he'd answered a few questions incorrectly, but kept his head in the game and stood strong until the end.  The lad has sure made his family proud, after offering to take them to a number of festivals this year - with a promise to foot the costs.Daniel has also become somewhat of a neighbourhood hero, and is taken aback by the outpouring of support and positivity from the local community.He said the experience has been an incredible one, and everyone he met on the show was 'kind and lovely'.He added: 'It's been crazy. People in shops and in the streets have been asking me about it. I'm overwhelmed by how kind everyone has been.'"
    ]
}