{
    "articleURL": "/tvshowbiz/article-12057447/Coronation-Concert-viewers-insist-Ncuti-Gatwa-great-Doctor-Who.html",
    "content": [
        "Viewers of King Charles' Coronation Concert were delighted with Ncuti Gatwa's performance as Shakespeare's Romeo at Windsor Castle on Sunday.",
        "The actor, 30, took to the stage with actress Mei Mac for the dramatic segment of the celebratory variety show.In May last year, Ncuti was announced as the replacement for Jodie Whittaker in the role of Doctor Who, and viewers of the concert this weekend took to Twitter to express their delight, insisting the part would be in 'good hands'.One person wrote: 'Ncuti Gatwa is going to be the most amazing Doctor #CoronationConcert.'While someone else shared: 'And I think we can be very confident that #NcutiGatwa is going to be amazing in #DoctorWho.'",
        "'Ncuti Gatwa is going to be an incredible Dr. Who If that performance is anything to go by . Really looking forward to him fighting daleks and the like,' wrote another viewer.While someone else posted: 'That Performance was great. I can't wait to see Ncuti Gatwa in Doctor Who later in the year.'Someone else tweeted: 'I’ve just watched #NcutiGatwa doing a spot of Shakespeare and I know now that he’s going to make a brilliant #DoctorWho. Lovely performance.'Another viewer posted: 'With Ncuti Gatwa on board, #DoctorWho is definitely going to be in very good hands.'While referencing the Royal Shakespeare Company, another viewer wrote: 'So. Ncuti Gatwa. Can certainly deliver blank verse with aplomb. Should be in the RSC. #CoronationConcert.",
        "One other viewer simply shared: 'Doctor who is in good hands #NcutiGatwa.'And someone else shared: 'I would honestly die for Ncuti Gatwa, he's the most charismatic performer. You beam just watching him.'Ncuti looked dapper as he arrived backstage at the Coronation Concert held in the grounds of Windsor Castle to celebrate the Coronation of King Charles III on Sunday.",
        "The actor showed off his stand-out sense of style as he wore a mustard yellow suit, featuring a jacket with an olive green pocket and a long overcoat.He wore a baggy pair of trousers to match the rest of his attire while he had on a white shirt with black stripes.The star completed his look by wearing a pair of smart brown shoes and smiled as he posed casually with his hand in his pocket on the red carpet.Sunday's show in Windsor was hosted by Downton Abbey and Paddington star Hugh Bonneville.Buckingham Palace promised 'global music icons and contemporary stars' for the big concert.It was the highlight of the second day of coronation celebrations.Around 20,000 members of the public attended and there was been a great deal of speculation around who would be performing.",
        "Musicians including Lionel Richie, Paloma Faith, Olly Murs, rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls entertained the royal family and members of the public.",
        "Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang were also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse also made an appearance via video.The series of pre-recorded sketches revealed little-known facts about the monarch and also included moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, also performed.",
        "Meanwhile, fashion designer Stella McCartney delivered a spoken word performance with a conservation theme which will reflect her and the King's 'shared passion for environmental sustainability'.Her performance was part of a broader nature-themed section of the concert which will also included a rendition of a 1980s hit by classical-soul composer Alexis French and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir.Bollywood star Sonam Kapoor also delivered a spoken-word performance.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti and Olivier Award nominee Mei."
    ]
}