{
    "articleURL": "/wires/reuters/article-12040551/Finnish-daily-uses-shooter-videogame-dodge-Russias-press-restrictions.html",
    "content": [
        "By Anne Kauranen",
        "HELSINKI, May 3 (Reuters) - Finland's largest daily Helsingin Sanomat on Wednesday took its struggle against Russian media restrictions to a popular online videogame to mark world press freedom day.Editor-in-chief Antero Mukka said the paper had to get creative in trying to breach the restrictions and decided to hide articles about Russia's war in Ukraine in Russian in the shooter game Counter-Strike, which is popular worldwide and among young Russian men.Russia has cracked down on independent journalism in the country after it initiated what Moscow calls \"a special military operation\" in neighbouring Ukraine last year, by banning free reporting and denying Russians' access to media content produced abroad.In response to Moscow's laws restricting press freedom in Russia, Helsingin Sanomat began publishing some of its Ukraine and Russia related news in Russian last year, only to see access from Russia to its content quickly restricted.\"As we have been widely concerned about the press freedom situation and freedom of speech in Russia, we decided that maybe it's possible to find some new channels to provide Russian audience with some reliable, independent journalism for example about the situations in Ukraine,\" Mukka told Reuters before the press freedom day on May 3.Counter-Strike, released by U.S.-based private gamemaker Valve Corporation in 2012, ranks among the world's top 10 most popular PC games, research firm Newzoo's data showed.",
        "The paper built a map of an unspecified war-torn Slavic city, naming it \"de_voyna\", in reference to the Russian word \"voyna\" meaning war, the use of which is prohibited in Russia in reference to the conflict in Ukraine.The map conceals a secret room where the paper hid images and texts detailing the cruelties witnessed by its reporters and photographers in Ukraine during the war.Mukka said the paper had not asked Valve's permission for the campaign as the game allows users to create and add their own content to its platform.\"If some young men in Russia, just because of this game, happen to think for a couple of seconds what is going on in Ukraine then it's worth it,\" he said. (Reporting by Anne Kauranen, editing by Ed Osmond)"
    ]
}