{
    "articleURL": "/wires/pa/article-12047407/Geraint-Thomas-keen-extend-cycling-career-ahead-new-Ineos-contract-talks.html",
    "content": [
        "Former Tour de France champion Geraint Thomas has no thoughts of putting his bike away as he prepares to start his 18th Grand Tour this weekend.",
        "The 36-year-old headlines the Ineos Grenadiers squad alongside 2020 winner Tao Geoghegan Hart for the 106th Giro d’Italia which will get under way in Fossacesia on Saturday.The 2018 Tour winner described his last set of contract negotiations with Ineos in 2021 as “hard” and, with his existing two-year deal up again at the end of this season, he faces another round of talks if he wants to keep riding. However, staying in the peloton is very much his intention.“I’d still like to continue,” Thomas said. “I’m still really enjoying riding my bike. Especially this year when things have been a bit stop-start, you realise how much you still enjoy it and being around the lads.",
        "“Being around the younger lads keeps you young as well and maybe keeps you immature but I still enjoy a coffee ride and I still enjoy a six-hour ride with loads of efforts and I still enjoy racing as well.“At the moment I’m just focusing on this race and then hopefully we can sort something after this.”Last season Thomas finished third in the Tour de France after delivering victory in the Tour de Suisse.But his 2023 season has been interrupted by illness and on Thursday Thomas spoke more about riding to help Geoghegan Hart than he did about pursuing his own ambitions in a race which he has targeted before only to suffer crashes in both 2017 and 2020.",
        "When he re-signed in 2021, Thomas said he wanted to keep winning for himself, but another contract may require him to accept more of a support role.Asked how many Grand Tours Thomas might have left in him, Ineos deputy team principal Rod Ellingworth said it was up to the Welshman, but was clear about what that might mean.“There’s not many that have kept up the same level of intent in their cycling as Geraint has,” Ellingworth said. “He’s 36 coming on 37 so who knows. At the end of the day, age does catch up with you and you can’t avoid that. How many (Grand Tours) he has left in him is totally up to him…“There’s riding in a Grand Tour and competing in a Grand Tour and it is very different. The thing with Geraint is, if you go to a bike race and you want somebody to help you and be your wingman, bloody hell, I’d sign him up every day. I think he’s got a few left in him if he wants it.”Geoghegan Hart is back at the race where he enjoyed his breakout result with victory in the pandemic-hit 2020 edition.Since then, the 28-year-old Londoner has endured illness and injury setbacks, but delivered a timely confident boost with two stage wins and overall victory at the Tour of the Alps in April, his first general classification win since the Giro.",
        "Although Remco Evenepoel and Primoz Roglic are the clear favourites going into the race, Geoghegan Hart is one to watch.“I feel like from the back end of last year he’s started to piece it together, get a bit of rhythm and he’s got his mojo back,” Ellingworth said. “He’s really shown now he can be consistent.“What’s changed for him is he’s gone through a journey. He’s had a lot more experience now, good and bad. Sometimes you’ve got to get your arse kicked to move on and he’s had his arse kicked and he himself has moved on.”"
    ]
}