{
    "articleURL": "/wires/ap/article-12038503/NCAAs-four-year-academic-progress-rate-score-steady.html",
    "content": [
        "INDIANAPOLIS (AP) - The ever-evolving world of college sports hasn't yet made a significant impact on the NCAA's annual Academic Progress Rate scores.",
        "The overall score for Division I athletes held steady at 984 despite slight decreases in the three most visible sports, according to the latest four-year results released Tuesday. Athletes in football and men's basketball each saw their numbers drop by two points, falling to 962 and 967, while women's basketball players saw a one-point drop to 982. Baseball scores remained unchanged at 977.Scores are based on scholarship athletes earning one point each semester they are academically eligible and another point each semester they remain in school or earn their diploma. Teams that consistently fall below the cut line of 930 are normally subject to penalties, but the NCAA will again impose penalties starting in the 2024-25 school year after the COVID-19 suspension ends.And unlike the calculation for the federal graduation rate, athletes in good academic standing still earn points if they transfer to another school. Individual team scores can be found on the NCAA´s website.The NCAA attributes the declines in men's and women's basketball and football scores to more players being ineligible to compete during the 2021-22 season instead of those leaving school.The latest report also shows that more than 20,700 former athletes who left school without degrees have completed their classwork during the 19 years APR scores have been calculated. Nearly half of that total are from men's and women's basketball and football.",
        "\"Excellence is engrained in student-athletes - academically and athletically,\" said Central Michigan president Robert Davies, chairman of the Division I committee on academics. \"Thousands of former student-athletes are returning to college to complete their degrees, further demonstrating the importance of higher education and exemplifying the fulfillment of earning a college degree.\"___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}