{
    "articleURL": "/news/article-12058933/Father-lost-wife-two-children-Turkish-earthquake-kills-surviving-daughter-himself.html",
    "content": [
        "Ferit Dayan lost his wife and two children after building collapsed in BesniThe couple's 12-year-old daughter Asya Irem Dayan survived the double quakeA father who lost his wife and two children in the Turkey earthquakes has killed his surviving 12-year-old daughter by shooting her in the head before taking his own life after suffering depression. ",
        "Secondary school science teacher Ferit Dayan had been receiving counselling following the February 6 tragedy which claimed the lives of his wife, Feray, and two of the couple's children, Alperen and Azra Beril.Their 12-year-old daughter Asya Irem Dayan survived despite their home in Besni, Adiyaman, collapsing during the powerful 7.7 and 7.6-magnitude earthquakes earlier this year.Mr Dayan's daughter had been playing in the garden of their new home on April 27 when her father called her inside and shot her in the head. After killing his daughter, it's understood that Mr Dayan then shot himself, according to local media. ",
        "Neighbours who heard the sound of gunshots called the emergency services and paramedics, and police officers were promptly dispatched to the house.",
        "The young girl was found with serious injuries and was rushed to hospital after being given first aid at the scene.Asya was taken to Besni State Hospital and later transferred to Adiyaman Education and Research Hospital. Tragically, less than three months after surviving the earthquakes, Asya succumbed to her injuries and died in the intensive care unit.Her father was pronounced dead at the house and his body was taken to the morgue of Besni State Hospital.The two were later buried side by side at the cemetery in Tasliyazi village. An investigation into the tragedy is ongoing.",
        "The devastating quakes, which also hit parts of Syria, claimed the lives of more than 50,000 people. The organisation believes around 214,000 buildings have been destroyed and damaged leaving people homeless, while a total of 18million are said to have been affected.",
        "The first quake that hit southeastern Turkey and northern Syria was measured at a magnitude of 7.7, while the second - a matter of hours later - measured 7.6.The epicentre was near the Turkish city of Gaziantep, around 150 miles north of the Syrian border, while the Kahramanmaras, Gaziantep, Sanliurfa, Diyarbakir, Adana, Adıyaman, Osmaniye, Hatay, Kilis, Malatya and Elazig provinces were all impacted. Turkish President Tayyip Erdogan has pledged to rebuild homes within a year, although it is hoped safety will be priorities over speed.Some buildings that were meant to withstand earthquake tremors came crumbling down.Turkey lies on multiple fault lines and as a result infrastructure legislation dictates that many structures must be reinforced and constructed in such a way as to comply with strict building codes.",
        "There was a huge investment in the last 14 years since the 1999 earthquake of more than $1billion on retrofitting buildings to ensure they comply with standards, but most of that was done around Istanbul and Ankara - the big cities in the north.",
        "In the southern provinces devastated by February's quakes however, a lack of oversight - and a loophole in government policy which allows builders and developers found to have fallen short of standards to pay fines rather than be forced to improve their buildings - means thousands of people likely died as a result of poor-quality building practices.Eyup Muhcu, president of the Chamber of Architects of Turkey, previously said it was 'common knowledge' that many buildings, including modern apartments built since the introduction of earthquake-proofing building codes, were not up to scratch. "
    ]
}