{
    "articleURL": "/wires/reuters/article-12046147/Chinas-financial-data-provider-restricts-offshore-access-new-rules-sources.html",
    "content": [
        "By Julie Zhu and Xie Yu",
        "HONG KONG, May 4 (Reuters) - China's biggest financial data provider Wind Information Co told some customers late last year that it was restricting offshore users from accessing certain business and economic data as a result of the cybersecurity regulator's new data rules, two sources said.Restricted access to Wind by offshore users comes as China sharpens its focus on data usage and security amid rising geopolitical tensions and concerns about privacy in the world's second-largest economy.The move by Wind, whose services are used by economists, fund managers and others, also comes as China is looking to attract more foreign investments and revive an economy struggling for a post-COVID lift-off. The curbs include access to details on some companies' shareholding structures.Shanghai-based Wind has made part of its data such as home sale numbers, which used to be updated regularly, inaccessible for users based outside mainland China since September last year, one of the sources said.A Wind salesperson told the source in September the company had made the changes as per instructions from the Cyberspace Administration of China (CAC), which asked it to stop providing offshore users with certain data.The second source was also told by another Wind salesperson that the restrictions were put in place after the CAC unveiled new data rules last year.",
        "The cybersecurity regulator issued final rules last July requiring data exports to undergo security reviews, as part of a new regulatory framework that will affect hundreds, if not thousands, of Chinese companies.The new rules came in to effect from Sept. 1.Beijing has in recent years issued new cybersecurity, data and privacy laws that require organisations with large user bases to undergo assessments and approvals when handling the data they collect.Lawmakers also passed a wide-ranging update to Beijing's anti-espionage legislation late last month, banning the transfer of any information related to national security and broadening the definition of spying.The restrictions on offshore users' access to certain Wind data have expanded since last September, said the first source. It is unknown whether the CAC stepped up access tightening requirements since the same month.So far, offshore users' access to Wind information that has been blocked includes business registry details such as a company shareholding structure and its ultimate controller, as well as economic data such as home and land sales in certain cities, sources have told Reuters.Wind, which serves numerous domestic and foreign financial institutions, did not respond to requests for comment.The CAC did not immediately respond to a faxed request for comment.When asked about Chinese financial data providers including Wind having stopped providing key corporate information to overseas subscribers, foreign ministry spokesperson Mao Ning told a news briefing that she was not aware of the situation.",
        "The sources declined to be identified as they were not authorised to speak to the media.Founded in 1998 by entrepreneur Lu Feng, private-held Wind is by far the biggest player in China's fast-growing market for financial data, as per estimates by broker Guotai Junan Securities.LIMITED ACCESSBusiness groups have warned about the vague wording of China's new anti-espionage law, which bans the transfer of any information related to national security, the rise in use of exit bans on foreign business executives in the country and heightened scrutiny toward due diligence firms.U.S. due-diligence firm Mintz Group said in late March the authorities had raided the firm's China office and detained five local staff. The foreign ministry said at the time Mintz was suspected of engaging in unlawful business operations.Police visited Bain &amp;amp; Co's office in Shanghai and questioned staff, the U.S. management consultancy said last week.Besides Wind, China's main academic database China National Knowledge Infrastructure (CNKI) has limited access to overseas subscribers from April 1, according to users notified of the suspension.The access restrictions imposed on the database apply to dissertations and conference papers as well as legal and statistical data, the National University of Singapore said in March in a notice on its website about the disruption.",
        "CNKI did not respond to a request for comment on the matter.Reuters has reported, citing sources that Chinese data providers including company databases Qichacha, partially owned by Wind, and TianYanCha have stopped opening to offshore users for at least months.Headquartered in Shanghai's financial district Lujiazui, Wind has expanded its footprint outside China to places including Hong Kong, Singapore, New York and London, and competes with Refinitiv and Bloomberg LP.Wind raked in 2.5 billion yuan ($361.84 million) in sales in 2021, according to Guotai Junan's estimate, almost doubling from 2016 revenue of 1.33 billion yuan.($1 = 6.9091 Chinese yuan renminbi) (Reporting by Julie Zhu and Xie Yu in Hong Kong, Yew Lun Tian in Beijing and the Shangahi newsroom; Editing by Sumeet Chatterjee and Kim Coghill)"
    ]
}