{
    "articleURL": "/wires/reuters/article-12038429/Brazil-orders-Google-curb-campaign-against-fake-news-law.html",
    "content": [
        "By Anthony Boadle",
        "BRASILIA, May 2 (Reuters) - Brazil's government and judiciary objected on Tuesday to big tech firms campaigning against an internet regulation bill aimed at cracking down on fake news, alleging undue interference in the debate in Congress.Bill 2630, also known as the Fake News Law, puts the onus on the internet companies, search engines and social messaging services to find and report illegal material, instead of leaving it to the courts, charging hefty fines for failures to do so.Tech firms have been campaigning against the bill, including Google LLC which had added a link on its search engine in Brazil connecting to blogs against the bill and asking users to lobby their representatives.Justice Minister Flavio Dino ordered Google to change the link on Tuesday, saying the company had two hours after notification or would face fines of one million reais ($198,000) per hour if it did not.\"What is this? An editorial? This is not a media or an advertising company,\" the minister told a news conference, calling Google's link disguised and misleading advertising for the company's stance against the law.The U.S. company promptly pulled the link, though Google defended its right to communicate its concerns through \"marketing campaigns\" on its platforms and denied altering search results to favor material contrary to the bill.",
        "\"We support discussions on measures to combat the phenomenon of misinformation. All Brazilians have the right to be part of this conversation, and as such, we are committed to communicating our concerns about Bill 2630 publicly and transparently,\" it said in a statement.The proposed law to penalize firms for not reporting fake news was due to be voted on in the lower house of Congress on Tuesday but it is facing opposition from conservative and Evangelical lawmakers. Later on Tuesday, Speaker Arthur Lira postponed the vote to allow for more debate.Its critics say the bill needs wider debate because it was too hastily drawn up, allows censorship and will have the opposite result of rewarding those who post disinformation since the bill proposes that companies would have to pay content providers and copyrights on material posted on their sites.The Supreme Court on Tuesday asked the chief executives in Brazil for Google, Meta and Spotify to testify within five days explaining their conduct regarding the bill.\"Such conduct could configure, in theory, abuse of economic power on the eve of voting on the bill by trying to illegally and immorally impact public opinion and the vote in Congress,\" Justice Alexandre de Moraes said in his decision.Brazil's antitrust regulator Cade said it would investigate Google and Meta's campaigns against the bill.",
        "The Brazilian proposal is shaping up to be one of the world's strongest legislations on social media, comparable to the European Union's Digital Services Act enacted last year.One of the bill's authors who will report on it to Congress, Representative Orlando Silva of the Communist Party of Brazil, said the law is needed to curb fake news that has poisoned Brazilian politics and impacted elections.\"Fake news led to the storming of government buildings on January 8 and has caused an environment of violence in our schools,\" he told Reuters.The bill was fast tracked in the lower house after a series of fatal attacks in schools which social media allegedly encouraged, and new articles added to the bill have not been debated in Congressional committees before going to the vote.Silva said the original draft of the bill included the creation of a state agency to watch out for illegal content, but this was dropped due to resistance in Congress. ($1 = 5.0416 reais) (Reporting by Anthony Boadle, Ricardo Brito and Maria Carolina Marcello; Editing by Josie Kao, Conor Humphries and Lincoln Feast.)"
    ]
}