{
    "articleURL": "/wires/reuters/article-12048657/MORNING-BID-ASIA-Another-day-U-S-banking-swoon.html",
    "content": [
        "By Jamie McGeever",
        "May 5 (Reuters) - A look at the day ahead in Asian markets from Jamie McGeever.A sea of red on Wall Street and renewed turmoil across the U.S. regional banking sector on Thursday suggest Asian markets go into Friday's session on the defensive, bringing what has been a surprisingly resilient week for local stocks to a rocky end.On the regional economic data calendar, investors are braced for first quarter GDP from Indonesia, April inflation figures from the Philippines and Taiwan, and China's services sector purchasing managers index, also for April.As world markets digested the 25 basis point rate hikes from the Fed and European Central Bank - and notably divergent messaging from Fed Chair Jerome Powell and European Central Bank President Christine Lagarde - U.S. bank fears intensified.PacWest shares plunged 50%, the regional bank index fell for a fourth straight day, and Canada's Toronto-Dominion Bank Group called off its $13.4 billion acquisition of First Horizon Corp, triggering a 33% slump decline in the U.S. bank's shares.Reuters exclusively reported that U.S. federal and state officials are assessing the possibility of \"market manipulation\" behind the recent big moves in bank shares, as the White House vowed to monitor \"short-selling pressures on healthy banks.\"An investor going long mega U.S. tech shares and short regional banks on January 1 would be doing well today. Even better, following Apple's quarterly earnings beat after the bell on Thursday.",
        "In some ways, the global fallout is clear and obvious - the Japanese yen rose for a third day, another indication that it may be rediscovering its safe-haven mojo, bind yields slumped, and gold surged to a three-year high and a whisker away from a new all-time high.Yet Asian markets, stocks at least, have been fairly unruffled.The MSCI Asia-ex Japan index on Thursday had its best day since late March and is flat on the week, supported by the lower dollar and bond yields, and growing hopes that the Fed's hiking cycle is over.The Hong Kong tech index has outperformed the Nasdaq this week, although it is still on course for its fifth weekly fall in a row, its worst run since September last year.If Asian markets get a steer from local events on Thursday, it will most likely come from China's services PMI. The bar for beating the previous month is high - the last time services sector activity in China grew faster than March was almost three years ago.Indonesia's economy, meanwhile, is expected to have contracted 1% in the first quarter as lower commodity prices hit exports and higher interest rates restricted domestic demand, according to a Reuters poll of economists.Here are three key developments that could provide more direction to markets on Friday:",
        "- China services PMI (April)- Indonesia GDP (Q1)- U.S. non-farm payrolls (April)(By Jamie McGeever;)"
    ]
}