{
    "articleURL": "/wires/ap/article-12052327/UN-South-Sudan-struggling-implement-power-sharing-deal.html",
    "content": [
        "UNITED NATIONS (AP) - South Sudan is facing violent clashes and increasing disillusionment and frustration as it struggles to implement the most challenging provisions of a fragile 2018 power-sharing agreement, U.N. experts say in a new report.",
        "The world's newest nation is struggling to integrate rival military forces, draft a new constitution and prepare for its first election as an independent country in December 2024, the experts monitoring sanctions against the world´s newest nation said in a report to the U.N. Security Council obtained Friday by The Associated Press.The country's stability \"will likely turn on the government´s ability to reward the patience of those who remain committed to peace, rather than those who have sought to reshape it through violence,\" the report says.There were high hopes when oil-rich South Sudan gained independence from Sudan in 2011 after a long conflict. But the country slid into a civil war in December 2013 largely based on ethnic divisions when forces loyal to the current president, Salva Kiir, battled those loyal to the current vice president, Riek Machar.Tens of thousands of people were killed in the war, which ended with the 2018 peace agreement, bringing Kiir and Machar together in a government of national unity. Under the agreement, elections were supposed to be held in February 2023, but last August they were postponed until December 2024.Kiir said he wanted to avoid creating conditions for more bloodshed. He issued a statement outlining the government´s achievements and stressing that it would be \"business as usual\" before the elections.",
        "The U.N. experts said the message was aimed at allaying two concerns - that the extension would be used to undermine the fragile power-sharing structures and would mean further delays, \"not the progress that peace once promised.\"On the plus side, the panel said in the 37-page report that the unity government has survived, a series of laws have started to pave the way for the drafting of a new constitution, and a first batch of approximately 55,000 unified troops has graduated, even though most haven´t been deployed.On the negative side, the experts said, most troops that graduated remain around their training centers, \"though poor conditions have led to hundreds of deaths and thousands of desertions.\" Many graduates don´t receive regular salaries, and most work in local communities to make money, the experts said.Those that have been deployed appear to have joined pre-existing military units rather than becoming part of a new national force, they said. While the parties agreed last year to unify the top command structure, they have not been able to reach a similar agreement for the lower ranks.South Sudan is also facing its highest level of displacement since the peace agreement, and more than two-thirds of the population needs humanitarian assistance, the panel said.",
        "The experts said most South Sudanese have not seen \"tangible progress\" since the 2018 agreement was signed.The deteriorating humanitarian situation is partly the result of violence and serious clashes in most parts of the country between well-armed rival forces, leading to deaths, people fleeing their homes, serious human rights violations, including sexual attacks, and difficulties delivering aid, the panel said.Much of the violence results from efforts to weaken opponents, but increasingly \"from growing dissatisfaction with the political process in Juba,\" the capital.Oil accounts for more than 90% of the government´s revenue and almost all its exports, and as a result of the high oil price the government is likely to exceed its budget target of $1.6 billion in gross oil revenues for the current fiscal year, the experts said, but the money has largely failed to reach institutions that could help stabilize the country.\"The misappropriation and diversion of public resources not only continues to fuel political competition but also deprives the treasury of the resources needed to address the ongoing humanitarian crisis, fund the implementation of the peace agreement, and stabilize the country through regular salary payments and development,\" the panel said."
    ]
}