{
    "articleURL": "/wires/pa/article-12058849/Warning-pharmacy-closures-unless-Government-provides-urgent-funding.html",
    "content": [
        "More pharmacies are expected to close unless the Government provides “urgently” needed funding to the “struggling” sector, industry leaders have said.",
        "The warnings come as healthcare providers await Government proposals to improve access to primary care, which are expected on Tuesday.Leyla Hannbeck, chief executive of the Association of Independent Multiple Pharmacies, said workforce challenges have led to many pharmacies shutting their doors “for good” since 2015, when the sector received a “big” funding cut.She told BBC Radio 4’s Today programme: “We are expecting that this year many more will do the same unless the Government comes out and injects pharmacy with some liquidity and funding to keep the sector going.” For pharmacists to keep their head above the water something needs to be done urgently  Leyla Hannbeck  Ms Hannbeck said there is a £1.1 billion shortfall in funding every year which has resulted in many pharmacies operating at a loss and struggling to pay medicine wholesalers’ bills.“For pharmacists to keep their head above the water something needs to be done urgently,” she added.",
        "Thorrun Govind, chair of the Royal Pharmaceutical Society in England, cited increased staffing, energy and drug costs as some of the issues the sector is facing.She told BBC One’s Breakfast show that pharmacies in England could and would like to do “so much more” – highlighting “independent prescribers” in Scottish pharmacies as one example of how sector workers could do more to support individuals with health needs.",
        "“When I’m working in the pharmacy there’s often occasions where I know what treatment is required but I can’t provide it because I’m hindered by the system that I’m working in,” Ms Govind told the BBC.“People may need support with fungal nail infections but for example the cost of that is quite high if you’re having to use it for a long period of time, which they tend to need, so they’re saying to me, ‘Well I need to go to the GP and get a prescription for that because it will cost me less in the long term’.”She said pharmacies could provide regular support for patients with long-term conditions and help people with common ailments – such as coughs, colds, flus and sore throats – easing the burden on GPs. If King Charles needs any support with neck pain following that crown... he can make sure he speaks to his pharmacist  Thorrun Govind, Royal Pharmaceutical Society in England  Ms Govind added that increased funding for pharmacies would also improve staff retention – with workers currently at risk of “burnout” – and tackle health inequalities.“Pharmacists are really accessible – about a 20-minute walk for most people – and the staff there tend to be from the communities from where they are working so actually health inequalities are also being tackled when we have pharmacies open,” she said.",
        "Asked about the coronation, Ms Govind quipped: “If King Charles needs any support with his neck pain following that crown he can… make sure he speaks to his pharmacist.”"
    ]
}