{
    "articleURL": "/wires/reuters/article-12039357/Home-ice-line-Hurricanes-Devils-meet-semifinals.html",
    "content": [
        "The Carolina Hurricanes will look to take the next step toward a Stanley Cup when they host the New Jersey Devils in Game 1 of their Eastern Conference semifinal series on Wednesday in Raleigh, N.C.",
        "The teams finished second and third in the NHL this season, behind only the Boston Bruins, with the Hurricanes at 113 points and the Devils at 112. With Boston (135 regular-season points) now eliminated after their first-round upset loss to the Florida Panthers, the winner of the Devils-Hurricanes series will have home-ice advantage for the remainder of the playoffs.After defeating the New York Islanders in six games in the first round, Carolina became the only NHL team to win a series in each of the last five postseasons. Getting deeper in the playoffs has been the challenge, as the Hurricanes have reached the conference finals only once in that span, when they were swept by the Bruins in 2019.Just getting into the playoffs was a breakthrough for New Jersey, which is making its second postseason appearance in the last 11 years. The Devils overcame their lack of playoff experience by topping their arch-rival New York Rangers in a heated seven-game first-round series.Things looked grim for the Devils after a pair of 5-1 losses in the first two games, but in hindsight, the adversity might have been what the young team needed.\"Just to see the team grow from the losses we had Games 1 and 2, it's pretty impressive how quick we adapt,\" Devils forward Ondrej Palat said. \"We changed our game a little bit. So I'm very impressed about our team, how we respond. We never gave up.\"",
        "The turning point came when New Jersey replaced Vitek Vanecek in net with Akira Schmid. In his first five career playoff games, Schmid delivered two shutouts and an outstanding .951 save percentage as the Devils stormed back from their 0-2 series deficit.Schmid looks like the Devils' choice in net going forward, while the Hurricanes might also commit to a goaltending change. Antti Raanta started the first five games against the Islanders, but Frederik Andersen made his series debut in Game 6 and stopped 33 of 34 shots.Because Andersen was battling both an illness and an upper-body injury, the goalie \"wasn't really an option\" until Game 6, according to Hurricanes coach Rod Brind'Amour.\"(Raanta) was great, he kept us in every game,\" Brind'Amour said. \"But when we got the green light on Freddy ... if there was a time to get him in, this was the night. And obviously it worked out.\"The Devils' Timo Meier is questionable for Wednesday after he left during the third period of Game 7. After taking a huge shoulder-to-head hit from the Rangers' Jacob Trouba, Meier later returned to the Devils' bench but didn't see any more ice time.Hurricanes forward Jack Drury (upper-body injury) is expected to play Wednesday after missing the last two games of the Islanders series. Brind'Amour said that defensemen Brady Skjei and Jalen Chatfield are dealing with minor injuries, but both should be ready for Game 1.",
        "Carolina and New Jersey are meeting in the postseason for the first time since the 2009 playoffs. The Hurricanes are 3-1 in four previous playoff series against the Devils.--Field Level Media"
    ]
}