{
    "articleURL": "/wires/ap/article-12057625/Clark-holds-Schauffele-PGA-win-Wells-Fargo.html",
    "content": [
        "CHARLOTTE, N.C. (AP) - Wyndham Clark tried to pull his hat over his eyes with both hands as he struggled to hold back tears on the 18th green at Quail Hollow Club after winning his first PGA Tour event at the Wells Fargo Championship.",
        "The long, agonizing wait that included days on tour where he wanted to \"break some clubs\" were over.It was time to celebrate.\"I´m a little choked up,\" Clark said on the green. \"It´s been a long five years (on tour) to get to this point. I thought I would have won one earlier, but it is well worth the wait.\"Clark shot 68 on Sunday for a four-shot victory over Xander Schauffele.He finished the tournament at 19-under 265, the second-lowest score in relation to par in tournament history behind only three-time champion Rory McIlroy´s 21-under 267 in 2015 when par for the course was 72.",
        "Schauffele had accuracy issues with his driver on Sunday and shot 70, finishing at 15 under.Tyrrell Hatton and Harry English finished tied for third at 12 under, one shot better than Tommy Fleetwood and Adam Scott. Defending champion Max Homa shot 70 on Sunday and tied for ninth at 9-under 275.\"There are so many times that I wanted to cry and break clubs - and I did break clubs at times - in this journey,\" Clark said. \"But to get to this point is so sweet. It is just amazing to finally do this.\"\"To go and put that round of 63 together (on Saturday) and finish at 19 under is a fantastic effort,\" Hatton said. \"Yeah, he deserves to be holding that trophy.\"",
        "Clark´s victory didn´t come easy - perhaps fitting for his career.The world´s 80th ranked player opened the final round with a two-shot lead, surrendered it to Schauffele after seven holes and then stormed back to win after playing the final 11 holes in 4 under.Despite never having won on tour before, there were signs that Clark was due. He´d finished in the top six in three of the last five tournaments he´d entered, including a third place finish at the Zurich Classic last month.He showed the poise of a champion after a rough start.Clark pulled his tee shot left on No. 1 over the cart path, leaving him a difficult approach shot leading to a bogey. Schauffele pulled into the lead with birdies at Nos. 3 and 7 and it looked like Clark, who was struggling just to make birdie over the first six holes, might collapse under the pressure of trying to win his first tournament.\"My caddie (John Ellis) kept preaching to me that it´s going to be challenging and get your mind wrapped around it,\" Clark said.The momentum changed on the eighth hole.Clark chipped to within 4 feet and rolled in a short birdie putt to pull back into a tie and then took the lead for good at the turn when Schauffele´s par putt lipped out on No. 9.",
        "Schauffele started struggling with his driver, missing four straight fairways. Clark kept the pressure on sinking birdie putts at No. 10 and 12 sandwiched in between a Schauffele bogey on No. 11, pushing the lead to four strokes with six holes left to play.Clark matched Schauffele´s birdies at the 14th and 15th holes to maintain a four-shot edge heading into the difficult closing three holes known as the Green Mile. From there, the only real drama was whether he´d break McIlroy´s tournament record.But Clark played the final three holes in 1 over, bogeying the 18th after finding a fairway bunker.\"I didn´t hit it as well and didn´t make as many putts as maybe I did the day before but mentally I was super strong,\" Clark said. \"I didn´t start out great. I was kind of shaky. I think in years past I might have folded. But this time I stayed patient and hung in there and caught fire on the back nine.\"Schauffele said he wished he could have put more pressure on Clark, but that he was just flat on Sunday.\"I started leaking oil,\" Schauffele said.Clark dedicated the win to his mother, who got him into golf and later died of breast cancer when he was 19 years old. He contemplated giving up the game after her death, but didn´t.",
        "\"I´m glad I stuck it out,\" Clark said.McIlroy, playing for the first time since missing the cut at the Masters, played the final three rounds in 3-over par, including a 72 on Sunday to finish even par for the tournament.He had nine top 10 finishes in 11 starts including wins in 2010, 2015 and 2021 at Quail Hollow, but this was his worst outing since missing the cut in 12 years ago.McIlroy declined to speak to reporters after his final round.___More AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}