{
    "articleURL": "/tvshowbiz/article-12038795/House-Dragon-season-2-CONTINUE-production-despite-writers-strike-scripts-done.html",
    "content": [
        "Season 2 for Game Of Thrones prequel House Of The Dragon will continue despite the writers strike in the US.",
        "The highly-anticipated second season for the HBO series will move forward with production in the UK according to a source for Variety on Tuesday.An insider told the publication that scripts for the series have already been completed for some time and that it will have no effect on filming. This comes after the Alliance of Motion Picture and Television Producers had ended contract talks with the Writers Guild of America on Monday night which was just hours before the expiration of their contract.The WGA responded by calling for a strike to begin on Tuesday and under those rules all members of the guild must down tools on any project which falls within the union's jurisdiction if there is active writing work taking place.",
        "As a result a number of US projects filming in the UK could be affected by the strike and ultimately will come down to how extensively the disruption will impact production overall.However HBO lucked out as scripts for House Of The Dragon season 2 have been completed and production will go through, however, it does remain unclear how the show will handle any rewrites that are required for the program. Meanwhile, Jimmy Fallon has lent his support to Hollywood writers as they prepare to strike for the first time in fifteen years in a dispute over fair pay.",
        "Speaking at last night's Met Gala, the late night host told a reporter that the strike could affect his staff and crew, but added: 'I got no show without my writers'.Fallon - along with Stephen Colbert, Jimmy Kimmel and Seth Meyers - will all be off the air immediately. The strike, announced by the Writers Guild of America, marks the first time in 15 years that production teams have halted work.The last strike lasted 100 days and cost Hollywood $2.1 billion. 'The Tonight Show with Jimmy Fallon' and other late night talk shows use teams of writers to pen topical jokes. The strike means new episodes will not be available during their traditional TV time slots or on the streaming services.But despite the disruption, Fallon threw his backing behind his writing team. ",
        "'You know, I hope there is no strike. I support my writers, but we have a lot of staff and crew that will be affected by this,' he said outside the Met Gala in New York City.'But [the writers] have got to get a fair deal, so I'll do whatever I can to support them and hopefully there is no strike and they can figure out a deal,' he added.'I need my writers. I need them real bad. I got no show without my writers.'",
        "During the 2007 strike, late-night hosts eventually returned to the air and improvised material. Jay Leno wrote his own monologues - a move that angered union leadership, while others filled air time with other antics.In one episode during the strike, Conan O'Brien spent time spinning his wedding ring on his desk for as long as possible in an attempt to make 'television history'.A massive issue disgruntling Hollywood writers is the issue of streaming services - and how they have affected the economics of the business, causing people to make less money and working under more strained conditions.Meyers, a union member, has also been vocal in his support for the writers.'I love writing. I love writing for TV. I love writing this show,' he said on Monday afternoon. 'I love that we get to come in with an idea for what we want to do every day and we get to work on it all afternoon and then I have the pleasure of coming out here. No one is entitled to a job in show business. ",
        "'But for those people who have a job, they are entitled to fair compensation. They are entitled to make a living. I think it's a very reasonable demand that's being set out by the guild. And I support those demands.' ",
        "Other immediately-affected shows include Real Time with Bill Maher, Last Week Tonight with John Oliver, and Saturday Night Live - which Pete Davidson was due to host on Saturday, the final night in the season. One SNL star told Deadline: 'We have to think about our crew too. 'I absolutely support the writers, and I want the writers to get what they deserve and need, but I don't want our crew to be out of work. We can't make this art without each other.'The decision is the culmination in a months-long battle with studios over pay in the streaming era.'The Board of Directors of the @WGAWest and the Council of the @WGAEast, acting upon the authority granted to them by their memberships, have voted unanimously to call a strike, effective 12:01 AM, Tuesday, May 2,' the union announced on Twitter.They said the decision was made following six weeks of talks with Netflix, Amazon, Apple, Disney, Warner Bros, Universal, Paramount and Sony.'Though our Negotiating Committee began this process intent on making a fair deal, the studios' responses have been wholly insufficient given the existential crisis writers are facing. 'Picketing will begin tomorrow afternoon. #WGAStrong #WGAStrike'In a statement, they said writers are facing an 'existential crisis.''The companies' behavior has created a gig economy inside a union workforce, and their immovable stance in this negotiation has betrayed a commitment to further devaluing the profession of writing,' the WGA said in a statement. ",
        "'From their refusal to guarantee any level of weekly employment in episodic television, to the creation of a 'day rate' in comedy variety, to their stonewalling on free work for screenwriters and on AI for all writers, they have closed the door on their labor force and opened the door to writing as an entirely freelance profession. 'No such deal could ever be contemplated by this membership.'The Alliance of Motion Picture and Television Producers, the trade association that bargains on behalf of studios and production companies, signaled late Monday that negotiations fell short of an agreement before the current contract expired. The AMPTP said it presented an offer with 'generous increases in compensation for writers as well as improvements in streaming residuals.'In a statement, the AMPTP said that it was prepared to improve its offer 'but was unwilling to do so because of the magnitude of other proposals still on the table that the guild continues to insist upon.'The labor dispute could have a cascading effect on TV and film productions depending on how long the strike persists. But a shutdown has been widely forecast for months due to the scope of the discord. ",
        "The writers last month voted overwhelming to authorize a strike, with 98 percent of membership in support.",
        "At issue is how writers are compensated in an industry where streaming has changed the rules of Hollywood economics. Writers say they are not being paid enough, TV writer rooms have shrunk too much and the old calculus for how residuals are paid out needs to be redrawn.'The survival of our profession is at stake,' the guild has said.Streaming has exploded the number of series and films that are annually made, meaning more jobs for writers. But WGA members say they are making much less money and working under more strained conditions. Showrunners on streaming series receive just 46 percent of the pay that showrunners on broadcast series receive, the WGA claims. The guild is seeking more compensation on the front-end of deals. Many of the back-end payments writers have historically profited by - like syndication and international licensing - have been largely phased out by the onset of streaming. More writers - roughly half - are being paid minimum rates, an increase of 16 percent over the last decade. The use of so-called mini-writers rooms has soared.The AMPTP said Monday that the primary sticking points to a deal revolved around those mini-rooms - the guild is seeking a minimum number of scribes per writer room - and duration of employment restrictions. The guild has said more flexibility for writers is needed when they are contracted for series that have tended to be more limited and short-lived than the once-standard 20-plus episode broadcast season.At the same time, studios are under increased pressure from Wall Street to turn a profit with their streaming services. ",
        "Many studios and production companies are slashing spending. The Walt Disney Co. is eliminating 7,000 jobs. Warner Bros. Discovery is cutting costs to lessen its debt. Netflix has pumped the breaks on spending growth.When Hollywood writers have gone on strike, it has often been lengthy. In 1988, a WGA strike lasted 153 days. The last WGA strike went for 100 days, beginning in 2007 and ending in 2008.Scripted series and films will take longer to be affected. ",
        "But if a strike persisted through the summer, fall schedules could be upended. And in the meantime, not having writers available for rewrites can have a dramatic effect on quality. The James Bond film 'Quantum of Solace' was one of many films rushed into production during the 2007-2008 strike with what Daniel Craig called 'the bare bones of a script.''Then there was a writers' strike and there was nothing we could do,' Craig later recounted. 'We couldn't employ a writer to finish it. I say to myself, 'Never again', but who knows? There was me trying to rewrite scenes - and a writer I am not.'With a walkout long expected, writers have rushed to get scripts in and studios have sought to prepare their pipelines to keep churning out content for at least the short term.'We're assuming the worst from a business perspective,' David Zaslav, chief executive of Warner Bros. Discovery, said last month. 'We've got ourselves ready. We've had a lot of content that's been produced.'Overseas series could also fill some of the void. 'If there is one, we have a large base of upcoming shows and films from around the world,' said Ted Sarandos, Netflix co-chief executive, on the company's earnings call in April.Yet the WGA strike may only be the beginning. Contracts for both the Directors Guild of America and SAG-AFTRA, the actors union, expire in June. Some of the same issues around the business model of streaming will factor into those bargaining sessions. The DGA is set to begin negotiations with AMPTP on May 10."
    ]
}