{
    "articleURL": "/wires/aap/article-12058097/Jayden-Sullivan-I-let-Dragons-Griffin-down.html",
    "content": [
        "St George Illawarra playmaker Jayden Sullivan feels he has let under-pressure coach Anthony Griffin down despite guiding the Dragons to within a sliver of victory in his first NRL game for six weeks.",
        "Staring down the possibility of a fifth consecutive defeat, Griffin rang the changes for the Magic Round clash against the last-placed Wests Tigers, a game that loomed as crucial to his future as coach.Griffin dropped Zac Lomax from the centres and recalled Sullivan, who came into the halves midway through the first half and pushed Ben Hunt to hooker - the position he plays at State of Origin level.Sullivan, 21, was the Dragons' best player, scoring two tries by selling dummies to Tigers recruit Isaiah Papali'i and scything through the defence.But the Dragons still fell 18-16, unable to breach the Tigers' defence despite Mikaele Ravalawa's last-minute chance on the right wing.\"Individually, I feel like I went alright but the main thing was to win,\" Sullivan said.\"Hook (Griffin) gave me a job to do and that was just to play footy and I felt like I let the team down.\"At the end, I kicked a seven-tackle set that probably changed the game and probably got them home.\"Sullivan started the season at five-eighth but lost his spot to Talatau Amone after the hefty round-four loss to Cronulla and began lining up for the Dragons' NSW Cup side.\"I love Hook, he is brutally honest,\" Sullivan said.",
        "\"The first three games I played this year, he told me to my face that that's not how I play footy and sent me back to reserve grade.\"Hook just gave me a few goals to focus on, my kicking game and my defence and just being energetic around the ball and running the ball with purpose.\"Hook put trust in me to play this week and I feel like I let him down at the end.\"Griffin was pleased with the outcome of his plan to inject Sullivan off the bench but will wait to review the Tigers' loss before determining whether to reprise the move against North Queensland this week.\"In general, it worked pretty well,\" Griffin said.\"(Sullivan) had good patches. We attacked really well in periods. He did a good job.\"Sullivan agitated for a release in the pre-season, after Hunt signed a contract extension that appeared to delay the youngster's chances of becoming a full-time starting halfback.He eventually withdrew the request and remains willing to bide his time.\"There was a bit of a hiccup there but I got some clarity on what I want to do and what Hook wants me to do,\" he said.\"I just have to put some belief back in the club and get us back to where we want to be.",
        "\"(Hunt) and I are in a position where two can't go into one. He's a 300-game halfback and I get to learn off him.\""
    ]
}