{
    "articleURL": "/news/article-12043737/Former-Playboy-Mansion-butler-says-Bunnies-asked-photos-avoid-creepy-people.html",
    "content": [
        "Bryant Horowitz worked inside the notorious Playboy Mansion from 1997 to 2006 after another employee put in a good word for himDuring his nearly 20-year tenure, he said the Bunnies would often ask him to take their pictures to avoid 'creepy people' but insisted Hugh Heffner wasn't oneHeffner has faced various allegations of sexual misconduct and abuse, including fake crying for sex A former Playboy Mansion butler claims the Bunnies used to ask him to take their photos because they didn't trust 'creepy people' at the mansion but insisted his controversial boss was a 'wonderful guy.' ",
        "Bryant Horowitz, who is now a professor, worked for Hugh Hefner inside the notorious mansion from 1997 to 2006 and recently posted a photo on his Facebook of them shaking hands. During his nearly 20-year tenure, he experienced the wildly famous parties and said he was even asked by the Bunnies to take their photo. 'There were a couple of times when some of the girls would say something like: \"Hey, I need to take photos. I don't trust some of these creepy people around here,\"' he told Unilad. 'That was commonplace for us because they knew which ones they could trust, we weren't going to do anything with it.' ",
        "Several former Playboy Bunnies have accused Heffner, who died in 2017, of sexual misconduct, including faking crying for sex and allegations that he believed he 'owned' the women. Horowitz - who teaches psychology at East Los Angeles College - insisted Heffner was not one of the 'creepy people' because his former boss was 'classy man.' 'Were there times when he put a hand on their back or a little lower just to say hi? Yes,' Horowitz told Unilad. 'I'm not going to dismiss that, it was the culture of times, but if you are thinking about people that are predatory, that was never the intent [from Hefner]. It was always with admiration and love.'",
        "The father-of-one said how Hefner presented in public was how he acted in private around his horde of women.'Hef was as he was in interviews: he was a classy man. He respected women,' he continued.'He was a great person. He is not the person that some of the girls have made him out to be, especially since he can't defend himself after his death.'It makes me feel uneasy when people try to blame him for doing things that he didn't do, for dragging his name through the mud, for ruining his character. 'This whole narrative about how he pitted them against each other is completely false.' Horowitz - who got his start after another employee put in a good word for him - said Heffner was 'kind' and 'funny' as long as 'everything was going his way.' 'He just loved being surrounded by people and having a good time,' the former butler said.  ",
        "The former Playboy Mansion employee began working full-time for Hefner five years into the gig and remembers the boisterous parties  From the small events to the 'big ragers' known as 'Hef parties,' Horoswitz has seen it all and said it would take 'weeks' to plan the large celebrations.  'It would be anywhere from 600 to 1400 people that spent time mostly in the backyard - it would be crazy,' he said.",
        "'The parties would start about eight o'clock. A lot of times you would have girls dressed up in nothing but body paint.'They would be handing out Jello shots, you had anywhere from four to six full bars, lots of loud music and dancing, and the parties would go till about 3am.' Since the butlers were in charge of serving drinks and food, Horoswitz said staff 'got to see what happened behind closed doors.'  Secrets of Playboy, a 10-part docuseries that premiered last year, lifted the lid on its 'dark underbelly' how venues became a seedy playground for drug use, sexual abuse, and even bestiality.The series delved into the hidden truths behind Playboy with exclusive interviews with insiders, including Hefner's ex-girlfriends Holly Madison and Sondra Theodore, as well as former 'Bunny Mother' PJ Masten.",
        "Theodore, now 66, revealed how there was group sex at the mansion five nights a week, which 'broke me like you'd break a horse.'Hefner would also host weekly 'Pig Nights' during which he would invite a dozen 'ugly' prostitutes to have sex with his friends.VIP members of the Playboy nightclubs could do as they pleased, including revered Soul Train host Don Cornelius who allegedly held two Playboy bunnies hostage and raped one of them, according to the docuseries.",
        "Madison, a model who dated Hefner for eight years, also told how the Playboy founder refused to use protection during sex and how the Bunny lifestyle even led her to consider suicide.",
        "Bridget Marquardt, another former girlfriend of Hefner, also hurled damning allegations when she joined Marquardt last August on the third episode of their new tell-all podcast Girls Next Level.The two blondes said Hefner would often shed fake tears in a manipulative attempt to obtain sex.Madison and Marquardt were often in the spotlight as two of the magazine tycoon's main girlfriends - and their new show attempts to shed new light on their years in the infamous Playboy Mansion in the early 2000s.'Like if we were emotional about something or asked about something, he would start fake crying,' Madison, 42, recalled to 48-year-old Marquardt.'And it was such bad acting and so obvious.'"
    ]
}