{
    "articleURL": "/wires/reuters/article-12051111/Markets-mixed-jobs-data-brightens-outlook-rekindles-inflation-fears.html",
    "content": [
        "US jobs growth far better than expected last month",
        "Treasury yields up as Fed rate cut views fadeDollar loses ground, oil bounces(New throughout, updates prices to U.S. trading session, adds second byline and NEW YORK dateline)By Sinéad Carew and Naomi RovnickNEW YORK/LONDON, May 5 (Reuters) -A global gauge of stocks rallied and U.S. Treasuries sold off on Friday as strong U.S. jobs data brightened the economic outlook and traders pared expectations of Federal Reserve easing after a long spate of rate hikes.The non-farms payroll report showed U.S. employers added 253,000 new jobs in April, up from 165,000 in March and exceeding expectations for 180,000.U.S. Treasury yields rose after the report while the dollar rose against a basket of currencies but then lost ground.Oil prices jumped on signs of economic strength, but remained on track for a weekly decline. Shares in U.S. banks also rebounded after a rough week following the collapse of a third major bank.Earlier, traders had bet the Fed would pause hikes at its next meeting in June and begin rate cuts in July, according to CME Group's FedWatch tool. But after the data, bets on a July cut faded.Strong economic data sometimes pressures stock prices if traders think it implies tighter policy, but Friday's trading suggested relief at signs of economic strength that eased worries about prospects of a recession.",
        "\"If you can get a respite from rate hikes for at least a few months and the economic data comes in okay, you can have this environment where decent growth doesn't necessarily lead to additional tightening at least in the short run,\" said Sameer Samana, senior global market strategist at Wells Fargo Investment Institute in Charlotte, NC.But Samana said he disagrees with the market's \"Goldilocks scenario\" where growth slows without a hard recession, allowing the Fed to ease policy quickly.\"If the Fed is cutting rates aggressively in the back half of the year, something has gone very wrong economically,\" he said.The Dow Jones Industrial Average rose 438.65 points, or 1.32%, to 33,566.39, the S&amp;amp;P 500 gained 61.97 points, or 1.53%, to 4,123.19 and the Nasdaq Composite added 217.51 points, or 1.82%, to 12,183.91.The pan-European STOXX 600 index rose 1.07% and MSCI's gauge of stocks across the globe gained 1.25%. Emerging market stocks rose 0.51%.Under the hood, oil's rebound helped boost the energy equity index. U.S. crude recently rose 3.75% to $71.13 per barrel and Brent was at $75.03, up 3.49% on the day.Investors appeared to be done sellingU.S. banks, at least for now as the KBW regional bank index was up almost 5%. However the regional index was still down roughly 8% for the week following sharp declines in previous four sessions the weekend collapse of First Republic Bank.",
        "In currencies, the dollar index fell 0.02%, with the euro up 0.05% to $1.1017.The Japanese yen weakened 0.43% versus the greenback at 134.88 per dollar, while Sterling was last trading at $1.2631, up 0.47% on the day.In U.S. Treasuries, benchmark 10-year notes were up 11 basis points to 3.462%, from 3.352% late on Thursday. The 30-year bond was last up 6 basis points to yield 3.7821%. The 2-year note was last was up 21.6 basis points to yield 3.943%.After getting close to a record high in the previous session, gold beat a fast retreat after the payrolls data tempered expectations for Fed rate cuts.Spot gold dropped 2.0% to $2,010.94 an ounce. U.S. gold futures fell 1.76% to $2,012.00 an ounce.(Additional reporting by Ankur Banarjee in Singapore. Editing by Jacqueline Wong, Robert Birsel, Keith Weir, Alexander Smith and David Gregorio)"
    ]
}