{
    "articleURL": "/wires/reuters/article-12057293/Michael-Harris-II-helps-Braves-outlast-Orioles-12-innings.html",
    "content": [
        "Michael Harris II lined a double to center field to drive in Ozzie Albies with the winning run in the 12th inning, lifting the Atlanta Braves to a 3-2 win over the visiting Baltimore Orioles on Sunday.",
        "Baltimore reliever Cionel Perez (1-1) struck out Kevin Pillar to open the 11th inning but intentionally walked Marcell Ozuna to set up a force play. Harris, who just missed a three-run homer earlier in the game, jumped on the first pitch he saw and bounced it off the wall, allowing Albies to easily score from second base.The winning pitcher was Michael Tonkin (3-1), who did not allow a hit over two scoreless innings.Both teams scored a run in the 10th inning.Baltimore's Anthony Santander led off the 10th with a single to right against reliever Jesse Chavez that scored automatic runner Cedric Mullins. The Braves forged a tie after automatic runner Sam Hilliard went to third on a grounder and scored on Felix Bautista's wild pitch.Neither starter figured in the decision. Atlanta's Bryce Elder pitched 5 1/3 innings and allowed one run on four hits, a season-high four walks and four strikeouts. Tyler Wells worked five innings and gave up one run on three hits, one walk and four strikeouts.Baltimore received two scoreless and hitless innings from both Austin Voth and Yennier Cano. Atlanta got scoreless efforts from Collin McHugh (two innings), Dylan Lee (2/3 inning) and Raisel Iglesias (one inning).The Braves scored in the first inning after Matt Olson belted his 10th homer, a solo shot to center field.",
        "Baltimore tied the game in the fourth inning. Austin Hays singled, went to third on Adam Frazier's double and scored on an infield grounder of Ramon Urias.Atlanta's Ronald Acuna Jr. went 0-for-5, which ended his 25-game streak of reaching base. Baltimore's Ryan Mountcastle went 0-for-5 and saw his streak of reaching base end at 15 games.--Field Level Media"
    ]
}