{
    "articleURL": "/health/article-12045861/NHS-not-ready-dish-breakthrough-Alzheimers-drug-experts-warn.html",
    "content": [
        "UK needs to improve diagnosis speed and monitoring for dangerous side effectsRead more:  The breathing trick that scientists say could slash Alzheimer's riskA drug heralded as 'the beginning of the end of Alzheimer's disease' could provide hope to millions of Brits who suffer from memory the robbing condition or a seeing their loved ones go through the heartbreaking ordeal. ",
        "Donanemab, made by US pharmaceutical giant Eli Lilly, has made global headlines after crucial phase 3 trial results suggested it slowed cognitive decline in Alzheimer's by 36 per cent.The drug – taken as a monthly infusion for 18 months – also halted a reduction in the ability to perform daily activities by up to 40 per cent, according to its makers.It comes less than a year after another drug, called lecanemab, was found to slash cognitive decline among those with the memory-robbing condition by 27 per cent. Experts said the results marked 'the beginning of the end of Alzheimer’s' and confirmed that the world is now entering the 'treatment era' of the disease.However, top doctors in the UK have warned that the NHS is not ready to dish out the breakthrough medication and needs to 'gear up' now in preparation for such treatments.",
        "The trial involving 1,182 people with early-stage disease and researchers found donanemab reduced progression of Alzheimer's by more than a third when compared to placebo.The medicine works by using the immune system to help remove toxic plaque build-ups in the brain known as amyloid, that are a hallmark of Alzheimer’s disease. Almost half of the trial participants (47 per cent) had no evidence of amyloid plaques at 12 months, the company said, compared with 29 per cent of the placebo group.",
        "Those taking donanemab experienced a 39 per cent lower risk of progressing to the next stage of disease compared to placebo, the trial data showed.When follow-up brain scans showed that amyloid had been removed, the treatment was stopped, and volunteers were moved to the placebo-arm of the study.It suggests this may provide a way of 'inducing remission' in Alzheimer's and then monitoring without treatment.",
        "Donanemab has been heralded as an 'encouraging' development in the fight against Alzheimer's disease after data showed it slowed the progression of the condition by 35 percent.The drug is a monoclonal antibody, a man-made protein that acts like an antibody.It is administered to patients via an intravenous injection and then travels to the brain.Once inside the organ, it binds to amyloid clumps that are already present.This then prompts other cells, called microglia which are responsible for maintaining neurons, to clear them.Researchers say that removing amyloid can help slow the progression of Alzheimer's disease, arguing that the clumps are toxic and disrupt communication between cells.About 90 per cent of Alzheimer's patients have amyloid clumps in their brains. But studies have also found that the clumps can be present in the brains of people who do not have the condition.Scientists are still not certain what causes Alzheimer's disease, but another theory gaining traction is that it is linked to damage to blood vessels within the brain.",
        "However, the latest treatment is not without risks with side effects reported including up to a quarter of those taking it suffering from some degree of brain swelling.A known side effect of drugs of this type, the incidence of serious brain swelling was 1.6 per cent, including two deaths attributed to the condition, and a third, after an incident of serious brain swelling.Brain bleeding occurred in 31.4 per cent of the donanemab group and 13.6 per cent of the placebo group.Lilly said most cases of swelling or bleeds were ‘mild to moderate’ and responded to treatment.Reacting to the findings, Dr Richard Oakley, Associate Director of Research at Alzheimer's Society, said: 'After 20 years with no new Alzheimer's drugs, we now have two potential new drugs in just twelve months – and for the first time, drugs that seem to slow the progression of disease.'This could be the beginning of the end of Alzheimer's disease.'Dr Cath Mummery, Consultant Neurologist at University College London Hospitals NHS Foundation Trust (UCLH), said the results confirm that we are now entering the treatment era of Alzheimer's disease.Hailing it an 'historic' moment, she said there are now consistent results across several anti-amyloid antibodies showing that removal of amyloid changes the course of the disease.",
        "'In addition, the method of administration of this drug might reduce burden and cost of treatment - this drug was only given until amyloid was lowered to a low enough point, then stopped - which was 52 per cent over 12 months and 72 per cent over 18 months.'This may provide a way of 'inducing remission' in Alzheimer's and then monitoring without treatment,' she added.This is the first phase 3 trial of any investigational medicine for Alzheimer's disease to deliver 35 per cent slowing of clinical and functional decline.Dr Susan Kolhaas, executive director of research and partnerships at Alzheimer's Research UK, said: 'This is incredibly encouraging, and another hugely significant moment for dementia research.'A second drug for Alzheimer's has been shown to slow people's cognitive decline in a rigorous phase 3 trial. We're now on the cusp of a first generation of treatments for Alzheimer's disease, something that many thought impossible only a decade ago.'The treatment effect is modest, as is the case for many first-generation drugs, and there are risks of serious side effects that need to be fully scrutinised before donenemab can be marketed and used.'However, this news underlines the urgency of preparing the NHS to make these treatments available should regulators deem them safe and effective.",
        "'People should be really encouraged by this news, which is yet more proof that research can take us ever closer towards a cure.'Dr Charles Marshall, honorary consultant neurologist at Queen Mary University of London, said: 'This is hugely exciting news as it provides further evidence that it is possible to slow down Alzheimer's disease.'When the full results are published as a paper, we will be able to start carefully balancing the risks and benefits, and this will inform decisions about whether donanemab should be routinely given to patients with Alzheimer's disease. 'For this to be possible, we will also need substantial new investment in dementia clinics that can deliver accurate diagnosis, treatments that are given as infusions, and appropriate safety monitoring.",
        "'Without this, there is a very real risk that existing health inequalities are exacerbated as only a few patients living near large teaching hospitals will be able to benefit.'Making donanemab available on the NHS is likely to be some way off.UK regulators will need to first approve it on safety grounds and then weigh up its cost-effectiveness for the taxpayer. The results follow trials of another Alzheimer's infusion drug called lecanemab, which is being examined by UK regulators but is already approved in the US, which found it lessened cognitive decline by 27 per cent.",
        "Lecanemab works by clearing plaque that forms in the brain of people with Alzheimer's.However, like donanemab, there are safety concerns.Experts have noted a number of deaths that occurred during clinical trials of the drug, or just after.Some have even called for an ‘urgent re-evaluation’ of the data collected by Eisai, the Japanese pharmaceutical firm behind the drug, which was used to prove its safety.British experts said while the results of the donanemab trial were promising, the  NHS wasn't ready for the logistical and safety challenges such a treatment would create. The first challenge would be finding patients in the early stages of the disease, those who would benefit most from the slowdown the infusion offers.  Dr Tom Russ, director of the Alzheimer Scotland Dementia Research Centre at the University of Edinburgh said this wasn't as simple as it sounded.'While this is another encouraging development, the UK NHS is not ready to implement an infusion-based therapy such as donanemab or lecanemab, should they become licensed treatments in the UK,' he said. 'There needs to be significant support for struggling dementia assessment services which are still emerging from the Covid pandemic to continue to diagnose, treat, and support people currently presenting while developing new ways to implement the disease-modifying treatments of the (near) future.'  Professor Tara Spires-Jones, deputy director of the Centre for Discovery Brain Sciences at the University of Edinburgh and president of the British Neuroscience Association, also said the UK wasn't ready.'We need to prepare the NHS and our healthcare systems for this very expensive, very difficult to administer and monitor type of drug so that people can benefit,' she told BBC Radio 4's Today programme. 'People need to have brain scans, PET scans, that are not that widely available, to check if they have the Alzheimer's pathology in their brain and that they are in the early stages of the disease where we can help.'She added that the health service would also need to prepare for the extensive and regular safety monitoring that such infusions would require to check for dangerous brain swelling.'You also, after you've been diagnosed and you're getting the antibody which is every month as an infusion then you have to be monitored very carefully with other brains scans, MRIs, to watch for these rare, but very serious, side effects of brain swelling and haemorrhaging,' she said. ",
        "Professor John Hardy, an expert in neuroscience and group leader at the UK Dementia Research Institute at University College London, added that while the UK had the capacity to undertake the required monitoring in small research settings, it would need to be scaled up if the drug was made available on the NHS.'We're not ready yet,' he said,'We need to gear up outside the main research centres to be able to administer this drug safely.'He added that while the reported side effects were dangerous and would require 'careful monitoring', the benefits would likely outweigh the risks, and the expense. 'Although the drug is expensive, keeping people in long term facilities is also very expensive,' he said. 'Of course, you are also giving people better quality of life, for longer, with their families.'We should be really pushing for this drug to be approved.'While the cost of donanemab is yet to be revealed, researchers have suggested it will be priced at $1,600 (£1,273) per dose or $20,000 (£15,909) annually.Around 850,000 Britons and 5.8million Americans have Alzheimer's disease. The disease is the leading cause of dementia, a condition where suffers have an impaired ability to remember, think, or make decisions that interferes with doing everyday activities.Dementia affects 900,000 people in the UK and an estimated 7million in the US. The condition is considered a global health concern as people live longer. It puts an increasing burden on health care systems including in the UK.Treating and caring for patients with Alzheimer's disease and dementia is estimated to cost Britain £25billion each year, according to Alzheimer's Research UK, the vast majority of that being in social care spending."
    ]
}