{
    "articleURL": "/wires/pa/article-12056409/Culture-Secretary-looking-closely-BBC-licence-fee.html",
    "content": [
        "The Culture Secretary has said she is looking “very closely” at the BBC licence fee, as she dismissed calls to remove political interference from the appointment of its chair.",
        "Lucy Frazer said a review into the corporation’s funding arrangements is looking at “a variety of sources for its funding”.The Cabinet minister also said Rishi Sunak will appoint the “best candidate” to replace Richard Sharp as BBC chair, regardless of their political ties. I do think it might need to look at a variety of sources for its funding  Lucy Frazer, Culture Secretary  It comes after Sir Keir Starmer said Labour would replace the Government’s power to appoint the chair with an independent process, following Mr Sharp’s resignation after he was found to have broken the rules by failing to disclose he played a part in getting Boris Johnson an £800,000 loan guarantee.“We will be looking for the best candidate,” Ms Frazer told Sky’s Sophy Ridge On Sunday.“I strongly believe that we should not disqualify people from public office who put themselves forward, who are capable of doing the job, because they happen to have in the past supported a political party.”",
        "The BBC funding model has long been under consideration by the Government, which has argued the licence fee is losing support among the public amid a changing media landscape.“We are reviewing the licence fee. I’ve started that review,” Ms Frazer told the BBC’s Laura Kuenssberg On Sunday programme.",
        "“We will be looking very closely at its funding arrangement.“I do think it might need to look at a variety of sources for its funding.“I’d like to ensure the BBC is properly funded. The licence fee isn’t the only way.”Tory former culture secretary Nadine Dorries announced last year that the licence fee would be frozen at £159 for the next two years until April 2024, saying she wanted to find a new funding model before the current deal expires in 2027 as it is “completely outdated”."
    ]
}