{
    "articleURL": "/news/article-12042845/Playboy-model-slams-striking-Hollywood-writers-ruining-late-night-television.html",
    "content": [
        "Jessica Vaugn said she had little sympathy for striking Hollywood writers who she branded 'a tool of cultural division'The Writers Guild of America has sent its nearly 12,000 unionized screenwriters to the picket line for the first time since 2008All script writing has stopped, with late night shows and 'Saturday Night Live' expected to go dark immediatelyA writer and Playboy model has launched a scathing attack on striking Writers Guild of America members who she claims 'ruined late night television'.",
        "Jessica Vaugn said the plight of Hollywood scribes would resonate with her more had they not 'politicized everything.'The Writers Guild of America's screenwriters began picketing on Tuesday after negotiations with studios, which began in March, proved fruitless by Monday's deadline to yield a new contract.The strike, which is over a dispute about low pay in the streaming era, could have a significant impact on what millions of viewers watch every day as major shows are shut down and replaced with re-runs. ",
        "Vaugn on Tuesday captured a video of strikers outside the Warner Brothers studio in Burbank, California, as she drove past. Dozens of people can be seen clutching signs on the sidewalk outside the studio as she passes.She wrote to her 391,00 followers: 'If they weren't the exact people who ruined late night television and a major tool of cultural division instead of unity in humor, I might be inclined to support them.'Vaugn later spoke to DailyMail.com and said: 'I was a big fan of late night, pop culture television for many years. 'Now that everything is politicized, it became impossible to watch without knowing it was abusive to half the political population in the US. 'The plight of the writers in Hollywood would resonate more with me if the industry had remained the neutral entertainment it had been before 2020. ",
        "'Now it is a tool of cultural division instead of unity under the umbrella of humor, much like any other domain of influence these days.'Vaugn, who received a Playboy Cyber Girl of the Week award in August 2011, said more strikes would occur with the advancement of artificial intelligence. 'With AI automation on the horizon, I believe strikes and mass layoffs are now at our front door,' she said.'It's harder to contemplate who won't be on strike in the next two years than it is to list who will inevitably be following in the Writer's Guild of America's footsteps.'",
        "The guild is seeking higher minimum pay, less thinly staffed writing rooms, shorter exclusive contracts and a reworking of residual pay — all conditions the WGA says have been diminished in the content boom driven by streaming.As part of their proposals, the writers guild also called for the regulated use of artificial intelligence (AI) on projects. They said that AI shouldn't be used to write or rewrite literary material, can't be used as source material and work covered under the guilds Minimum Basic Agreement, which is the bargaining agreement that covers their work, can't be used to train AI.  In response, The Alliance of Motion Picture and Television Producers (AMPTP) flat out rejected their proposal and instead offered 'annual meetings to discuss advancements in technology.'",
        "WGA member, writer and comedian Adam Conover posted the response from the AMPTP and slammed them over their stance on AI.'We proposed that AI not be used to undermine our work; they rejected our proposal, and offered an 'annual meeting to discuss advances in technology,' he said. 'Wow, a MEETING?!? Thank you ever so much!! An insulting counter, just dripping with contempt.'",
        "The writers last month voted overwhelmingly to authorize a strike, with 98 percent of members in support.As the writers downed laptops, the most noticeable immediate change will be on late-night shows and 'Saturday Night Live', which will not run sources at NBC told CNN.Pete Davidson, who attended the Met Gala Monday night, was due to return to Saturday Night Live this weekend to host.On Friday's episode of 'Late Night,' Seth Meyers, a WGA member who said he supported the union's demands, prepared viewers for re-runs while lamenting the hardship a strike entails. The guild has said: 'The survival of our profession is at stake.' The cost of the WGA's last strike cost Southern California $2.1 billion, according to the Milken Institute. "
    ]
}