{
    "articleURL": "/wires/afp/article-12051477/King-Charles-greets-royal-fans-coronation-buzz-builds.html",
    "content": [
        "King Charles III greeted the crowds outside Buckingham Palace on Friday on the eve of his coronation, with royal revellers cranking up the party atmosphere with fancy dress and inflatable crowns.",
        "Hundreds of tents have been pitched along The Mall, the tree-lined avenue leading to the palace, with hardcore royalists camping out to secure a prime viewing spot for the glittering processions to and from London's Westminster Abbey on Saturday.The scene looks like a costume party, with many extravagantly dressed up in all manner of costumes and accoutrements and wearing blow-up crowns on their heads.The buzz cranked up even further when Charles, his son Prince William and William's wife Kate went out to shake hands and chat with the multitudes behind the bunting-lined barricades.",
        "People cheered, took selfies next to the royals and some sang \"God Save the King\" as the sun broke through rain clouds that had drenched the gathered masses.One woman told the sovereign: \"Love you, Charlie!\", while others passed on their congratulations.Kate, 41, was heard saying that the coronation was \"a great moment for celebration\".One man, wearing a golden crown and the red, white and blue flag around his shoulders, stood next to a life-size poster of the sovereign.Five women from the English Midlands, all in their sixties and wearing Union Jack suits, were preparing for a third and final night sleeping in a tent.- Carry on camping -But they know the drill, having done it before for the Platinum Jubilee of Queen Elizabeth II in June 2022, celebrating her 70 years on the throne, and then again for her funeral in September.",
        "\"We'll really have good views,\" one of them said.\"Being here, together, for the coronation, it's what makes us British.\"Karen Chamberlain, 57, from Birmingham, arrived at The Mall with a big backpack and a tent. She was preparing to camp out for the night with her sister, husband and their eight-year-old son.\"It's so exciting,\" she told AFP. \"Being here is a way to say we are proud of the monarchy.\"",
        "\"Our mother came to London in 1953,\" said the charity worker, referring to Queen Elizabeth II's coronation.News crews from around the world, some broadcasting live, zig-zagged between the tents. Smiling police officers guided the growing crowd, while groups of passing tourists gazed at the bustling spectacle.Bill Powell, 52, from Toronto, came to The Mall as soon as his plane landed on Wednesday. He is camping out with a fellow Canadian who now lives in England.They have installed a Canadian flag on the barricades.\"Making eye contact with royal family is something amazing, something you don't understand when you just watch on TV,\" he insisted.- Unifying force -Charles is Canada's head of state and Powell does not believe that his country will ditch its constitutional monarchy.",
        "He said some people wanted to replace the king of Canada with a president \"because they don't know Charles\" yet.",
        "\"The priority for the king is his country, the tradition. It's country first. Whereas politicians, it's 'my interests first'.\"His friend Mary Foster added: \"I can't imagine how it is to start the biggest job of your life at 74.\"Ilana Trevisan, a 41-year-old Frenchwoman, came from the southern city of Marseille with her mother and daughter especially for the coronation.\"Being here is brilliant,\" she said. \"We are fans of the monarchy,\" she proclaimed, without regretting France's republic status.\"My mother wanted me to marry William when I was little!\" she said.Christine Large, 56, a farmer from the Midlands, was dressed as a Beefeater, the ceremonial guards at the Tower of London where the crown jewels that will take centre stage on Saturday are kept.\"The atmosphere here is absolutely fantastic. There are so many people from different countries,\" she said.\"I hope it stays like this. I mean the monarchy. It brings people together.\""
    ]
}