{
    "articleURL": "/wires/ap/article-12060869/Accused-ghost-candidate-faces-campaign-finance-charges.html",
    "content": [
        "BUENA VENTURA LAKES, Fla. (AP) - A former city commissioner in central Florida accused of being a \"ghost candidate\" in a 2022 county commission race has been arrested on several campaign finance charges.",
        "Former Kissimmee Commissioner Carlos Irizarry Sr., 67, of Buena Ventura Lakes, was arrested Friday on eight counts of willful certification of false or incomplete campaign treasure´s reports and six counts of deliberate failure to report campaign expenditures as required, the Florida Department of Law Enforcement said in a news release.State investigators said they began looking into Irizarry last year following allegations that he was paid to enter the Osceola County Commission District 4 race to affect its outcome. Kissimmee and Osceola County are located immediately south of Orlando.After comparing bank records to Irizarry´s campaign treasure´s reports, inspectors said they identified a pattern of providing false information. In eight reports, Irizarry reported false campaign expenditures and lied about charitable donations made by the campaign, officials said. After the filing fee, Irizarry spent the remaining funds on personal items like day spas and restaurants, investigators said.The term \"ghost candidate\" refers to someone who does little or no campaigning and only enters a race to siphon votes from one of the legitimate candidates.FDLE officials wouldn't say whether anyone else was involved in Irizarry's candidacy scheme, but Jackie Espinosa, another candidate in Irizarry´s commission race, filed a lawsuit last fall accusing Irizarry of running to steal Hispanic votes and allowing the seat's incumbent to win. The lawsuit was later dismissed, but an appeal is ongoing. No criminal charges have been filed against the incumbent.",
        "The Office of Statewide Prosecution will prosecute the case. Jail records didn't list a criminal defense attorney for Irizarry, and his civil attorney didn't immediately respond to a message seeking comment."
    ]
}