{
    "articleURL": "/wires/reuters/article-12057535/Golden-Knights-aim-bounce-Game-3-vs-Oilers.html",
    "content": [
        "The Vegas Golden Knights have not needed a bounce-back game since Game 2 of their opening-round series victory over the Winnipeg Jets.",
        "As the Golden Knights hit the road for Game 3 of their Western Conference semifinal series Monday in Edmonton, they are in dire need of a rebound against the Oilers.Edmonton evened the best-of-seven series at 1-1 with Saturday's dominant 5-1 victory that showed in no uncertain terms the Golden Knights must elevate their play.\"I don't think anyone in this locker room thought we were going to sweep the Edmonton Oilers,\" Vegas captain Mark Stone said.\"They were saying after Game 1 they didn't bring their best and we're saying after Game 2 we didn't bring much of our best ... but the series is still 1-1 and now we've got to be good on the road.\"The Golden Knights were far from good last game. The Oilers staked a 4-0 first-period lead thanks to a pair of power-play goals and Connor McDavid's short-handed marker and essentially coasted to the finish line.\"Most disappointing part of the game for me as a head coach,\" coach Bruce Cassidy said of the sluggish start. \"You're going to have nights you're going to get out-executed by this team. They were more competitive. We sort of got out-teammated for lack of a better term. That's disappointing. That should never happen to the Vegas Golden Knights.",
        "\"We weren't hard on the puck. Guys we rely on offensively need to understand that. If you're going to beat a good team that's attack-oriented, the highest scoring team in the league, you need to have the puck. You can't just hope you defend the hell out of them all night.\"Whether the Golden Knights can slow the Oilers, especially their offensive attack, is certainly worth questioning. Edmonton is averaging 4.25 goals per game so far in the playoffs, aided by a lethal power play.The Oilers added three more power-play goals to their total last game on six chances and are now 14-for-25 (56 percent) in the playoffs.Penalty killing was an issue for the Golden Knights all season, and the Oilers have taken advantage.\"When teams are undisciplined and run around, it's one of the ways we can make them pay. One of the ways,\" Oilers coach Jay Woodcroft said. \"We were able to come at their team in waves. There was a reason they took the penalties they did because we were playing at a certain pace.\"In turn, Edmonton's top guns are all rolling, especially Leon Draisaitl, who has scored goals in five consecutive games and has netted 13 in only eight postseason games.\"He is playing on another level,\" McDavid said. \"I am not sure why anyone would be surprised at this point because he is the best player in the world a lot of nights, and he has showed that on a regular basis.\"",
        "For his part, McDavid has posted a multi-point performance in six consecutive outings, and defenseman Evan Bouchard has collected 14 points in an eight-game point streak, with 12 power-play points.As a result, Edmonton's confidence is high with the opportunity to take control of the series with the next two games at home.\"We have great belief in our room,\" McDavid said. \"A lot of teams do at this point in the season. ... I would say our group feels pretty good where they are at.\"--Field Level Media"
    ]
}