{
    "articleURL": "/wires/ap/article-12047989/Homebuyers-face-steep-borrowing-costs-despite-Fed-move.html",
    "content": [
        "LOS ANGELES (AP) - Homebuyers should get used to painfully high mortgage rates, despite this week's signal from the Federal Reserve that it could finally pause its yearlong campaign of rate hikes.",
        "The Fed raised its short-term rate to roughly 5.1% Wednesday, the highest since 2007.While the Fed stopped short of declaring an end to the hikes, its effectively raised the possibility of pausing them after a streak of 10 increases going back to March 2022.A pause would likely only nudge mortgage rates modestly lower, said Greg McBride, chief financial analyst at Bankrate.com.\"Any meaningful and sustained decline in mortgage rates will require further easing of inflation pressures and continued slowing of the economy,\" McBride said.While inflation has fallen from a peak of 9.1% last June, it's still well above the Fed´s 2% target rate, despite signs that the economy is slowing. The nation's GDP rose at just a 1.1% annual rate in the January-March quarter, down from 2.6% growth in the previous quarter. Consumer spending, which accounts for 70% of U.S. economic activity, stagnated in March for a second straight month.",
        "More weakening could help bring down mortgage rates, though the reverse is also true.\"There is still uncertainty in the economy,\" said Lisa Sturtevant, chief economist at Bright MLS. \"There´s a chance mortgage rates come down, but I expect we´re still going to be in the 6% (range), though.\"Shifts in the Fed´s benchmark lending rate don´t directly affect mortgage rates, but they do influence the yield on 10-year Treasury bonds, which lenders use as a guide to pricing home loans. That´s because higher rates push bonds prices lower, which then causes their yield to go up.",
        "Investors´ expectations for future inflation and global demand for U.S. Treasurys also influence mortgage rates.The average rate on a 30-year mortgage reached a two-decade high of 7.08% last fall after months of Fed rate hikes and stubbornly high inflation. This week, it averaged 6.39%, down slightly from last week, according to mortgage buyer Freddie Mac. A year ago, it averaged 5.27%.Higher borrowing costs and a shortage of available homes are largely to blame for a 22% drop in home sales in the 12 months ended in March, marking eight straight months of annual sales declines of 20% or more."
    ]
}