{
    "articleURL": "/wires/reuters/article-12042227/Cate-Blanchett-calls-support-refugee-host-countries.html",
    "content": [
        "By Marie-Louise Gumuchian",
        "LONDON, May 3 (Reuters) - Actor Cate Blanchett, a goodwill ambassador for the UN refugee agency, has called for more support for countries hosting people forcibly displaced from their homes to prevent \"a forgotten crisis.\"Blanchett, appointed a UNHCR goodwill ambassador in 2016, said it \"was easy to forget\" there were protracted conflicts around the world leading people to seek refuge elsewhere.The two-time Oscar winner travelled to Jordan last week, which hosts some 661,800 Syrian refugees, in a return to the country she first visited seven years ago in her humanitarian role.\"When you think that 74% of refugees are sheltered by lower to middle income countries, it's not the wealthiest countries in the world that are bearing that responsibility. So it was amazing to see that support continuing, but also to go back and revisit with families, children who are no longer children,\" Blanchett told Reuters in an interview.Some were perhaps in an even more precarious situation now, she said.\" see them seven years on with the ability to return home dwindling with all of... their savings spent... (shows) just how important it is for the global community to continue the support...for those countries that are hosting what could become a forgotten crisis.\"Blanchett reunited with families in Amman and travelled to Zaatari refugee camp, created soon after the Syrian conflict erupted in 2011 and where some 80,000 people now live.",
        "\"As we the general public sort of remotely lurch from watching one crisis unfold to another crisis... it's easy to forget that there are these protracted crises in Yemen, in many parts of Africa and as I was so painfully reminded in Syria,\" Blanchett said.\"Of course the ultimate goal is peace but while we wait for that to be brokered, humanitarian aid is absolutely vital and for governments to find cohesive bilateral solutions to these things and safe pathways for people.\"A record 103 million people have been driven from their homes around the world, according to UNHCR, escaping violence, conflict, persecution and human rights violation.(Reporting by Marie-Louise Gumuchian Editing by Alexandra Hudson)"
    ]
}