{
    "articleURL": "/wires/pa/article-12048477/Coronation-flowers-foliage-Which-blooms-branches-chosen.html",
    "content": [
        "Westminster Abbey will be decked out in seasonal flowers and foliage grown around the UK and expertly arranged by Shane Connolly and Co.",
        "Here is a closer look at how the historic church will be decorated with an array of blooms, blossoms and branches on coronation day.– The Great West DoorA pair of tall yew topiaries will be underplanted with a meadow of wild grasses and cowslips, primroses and violets.",
        "After the coronation, the yews will be replanted in the new biodiverse topiary garden at Sandringham, which will be open to the public.– The Grave of the Unknown WarriorEchoing the colourful British wildflower meadow seen on the hand-painted invitations to the coronation, fresh spring flowers that are symbolic of remembrance will frame the Grave of the Unknown Warrior.These include sprigs of rosemary, bay for virtue, bluebells and forget-me-nots for constancy of love, daffodils for chivalry, cowslips, lilac for memories of youth, and lily of the valley and auriculas, which both appeared in the Queen Consort’s wedding bouquet in 2005.– The QuireTwo floral installations of seasonal flowers of the UK will be positioned at either side of the Quire, surrounding the entrance to the Coronation Theatre, where the majority of the service will take place.",
        "The colour palette has been influenced by the rich golds, burgundies, purples, pinks and reds of the High Altar and the Cosmati Pavement, as well as the King and Queen Consort’s Robes of State and Estate.",
        "The installations will feature hellebores – a particular favourite of the King, which appeared in his buttonhole for his wedding in 2005 – honeysuckle, tulips, ranunculus, jasmine, and aquilegia, which is an ancient symbol of the Holy Spirit, with foliage of rosemary, birch, bay and hazel, and wild broom grown on the Isle of Skye.– The High AltarBoughs cut from flowering shrubs and trees from the five Royal Horticultural Society gardens will adorn the High Altar, including branches from the pair of Dawyck beech trees planted by the late Queen and Prince Philip at RHS Wisley in 1978.Among the seasonal foliage will also be crab apple blossom, amelanchier, camellia, acer, hazel, rhododendron, and azalea will be arranged alongside beech cut from an ancient cluster of trees at RHS Bridgewater, which would have been visited by Queen Victoria."
    ]
}