{
    "articleURL": "/wires/ap/article-12059159/Adeyemi-leading-Borussia-Dortmund-s-Bundesliga-title-push.html",
    "content": [
        "BERLIN (AP) - Karim Adeyemi is finding his best form just in time for Borussia Dortmund´s title push in the Bundesliga.",
        "The 21-year-old Germany forward scored two goals and set up another for Dortmund to pile the pressure on league leader Bayern Munich with a 6-0 rout of Wolfsburg on Sunday.It restored the gap to just one point with three rounds remaining.Adeyemi went off to a standing ovation from the home supporters but was clearly annoyed after missing a penalty and the chance of a hat trick minutes before.\"The priority is the team, and not myself. It was very important that we won, but I was very annoyed with myself that I didn´t score the three goals,\" he said after what was arguably his best performance for Dortmund since joining from Salzburg last year.Adeyemi showed remarkable athleticism to leap above a taller defender to score the opening goal, then set up Sébastien Haller for the second. The Ivory Coast forward returned the favor for Adeyemi to grab the fifth.",
        "The speedy Adeyemi was a constant threat to Wolfsburg´s defenders, who were given no respite when he went off in the 69th. Gio Reyna went on and there was still time for Jude Bellingham to complete the scoring with his second goal.But Adeyemi´s performance stood out even in a complete team effort from Dortmund.\"I don´t know if he had 100 actions or 50, but 49 or 99 of these actions were positive,\" coach Edin Terzi´c said. \"Perhaps he wanted it a bit too much, to seal the win. (The penalty) was probably the easiest opportunity. The other actions were outstanding, not only the goal, but how he accelerates in a one-on-one. How difficult is that to defend against? And that´s exactly what we want.\"",
        "Terzi´c said Adeyemi´s speed is \"always a weapon\" that opposing teams have to take into account.\"If the opponent attacks, maybe they´ll be a bit more nervous (of counterattacks),\" Terzic said. \"We always want to use the weapons that we have on the field, not only in attack, but also in defense.\"Adeyemi is not the tallest player in Dortmund´s team but had already shown how high he can jump with an assist in the 4-0 win over Eintracht Frankfurt two weeks before. He now has three goals and three assists from his last three games.Others also shone against Wolfsburg - including goalkeeper Gregor Kobel and veteran defender Mats Hummels - as Dortmund built momentum for its last three games.The team next plays Borussia Mönchengladbach at home, then visits Augsburg before its final game at home against Mainz.Bayern also has two home games against Schalke and Leipzig before finishing the season in Cologne.The last round´s games are all played at the same time, but Bayern plays before Dortmund in the next two rounds - an advantage for the Bavarian powerhouse according to Dortmund sporting director Sebastian Kehl.\"Nobody asked us, but of course it´s a disadvantage if you always have to catch up over the next three weeks,\" Kehl said.",
        "Emre Can, another outstanding performer against Wolfsburg, says the team is confident it can end Bayern´s 10-year reign as champion.\"Nothing is decided for us. We want to win our games and then we´ll see what happens,\" Can said. \"But the belief is there.\" ___ More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}