{
    "articleURL": "/news/article-12058767/Notorious-orangutan-gropes-giggling-womans-breasts-Thai-zoo.html",
    "content": [
        "Footage shows orangutan hugging and kissing the giggling woman in BangkokThe ape called Nhong has picked up a habit of touching women's breastsThis is the moment a 'notorious' orangutan gropes a giggling woman's breasts at a Thai zoo where his antics have made him a star attraction despite animal groups voicing concerns over the ape being 'exploited'.",
        "Panisara Rikulsurakan, 26, was visiting Bangkok's Safari World in Thailand when she stopped to sit down and pose with the cheeky primate named Nhong. Wearing black shorts and a pink top, Ms Rikulsurakan sits down on a bench in front of the orangutan who needs no invitation to wrap his long arms around her in an affectionate manner.Shortly after, Nhong then flashes a smile at the crowd before bringing the woman in closer to cheekily kiss her on the cheek as she and those watching on break out into fits of laughter.The orangutan then briefly removes his arms from Ms Rikulsurakan before placing them back on her - this time straight onto her breasts.",
        "Despite being shocked by the ape's actions, Ms Rikulsurakan continues to see the funny side as her top starts to slide off her right shoulder while the orangutan continues to peck her on the cheek.Later on in the video, Ms Rikulsurakan can be seen stroking Nhong as the orangutan lies down in front of her.Nhong then wraps his left arm around the woman's neck to pull her in closer before kissing her on the cheek again to her amusement.The video finishes with Ms Rikulsurakan giving the ape a piggy back after the pair had struck up somewhat of a friendship. ",
        "Speaking after meeting the primate, Ms Rikulsurakan said: 'The orangutan is so friendly. 'I love coming to the safari park to see him. He's the star attraction because everyone loves having their picture taken with him.'The orangutan lives in an enclosure at the Safari World zoo in the Thai capital. One of his roles is to stand with tourists as they have pictures taken.Orangutans are among the smartest primates, and as one of the least aggressive great apes are generally non-violent to humans. ",
        "Nhong has learned the habit of touching women's breasts and kissing them - with encouragement from the handlers and other visitors.Women are even said to be flocking to the zoo to visit Nhong because of the popularity of the videos on social media.However, questions have been raised about the use of the orangutan to perform its hallmark stunt with animal rights groups such as PETA complaining that he is being 'exploited and humiliated'.Safari World has come under fire in the past after it emerged that the zoo hosted an event that saw orangutans boxing each other as other apes stood outside the ring banging on drums and dancing in bikinis. And last August, another woman was groped by an orangutan at the same Thai zoo - just weeks after squeezing another female visitor's breasts.  ",
        "Despite concerns over the treatment of orangutans, Ms Rikulsurakan added: 'Nhong is always so clean and he's treated well. I don't think there are any problems. He brings a lot of happiness.'"
    ]
}