{
    "articleURL": "/news/article-12054259/Jordan-Neelys-family-attorneys-say-theyll-hold-killer-accountable.html",
    "content": [
        "Jordan Neely died on Monday after being put in a chokehold by Daniel Penny Penny, a Marine veteran, says he was trying to protect other passengers  The family Jordan Neely, the homeless man who died after being put in a chokehold by a Marine Corps veteran on Monday, has hired a law firm to 'hold the MTA and his killer' accountable for his death. ",
        "Neely, 30, was homeless, schizophrenic and 'self-medicating with K2' before his death, according to members of his family. On Monday, he was put in a chokehold by Daniel Penny, a 24-year-old Marine Corps veteran who says he was behaving in a 'threatening' manner, and was a risk to the other passengers on the train. Penny held onto Neely for 15 minutes, according to some of the passengers on the train. He died, and the NYC medical examiner's office has ruled his death a homicide. ",
        "Now, Manhattan DA Alvin Bragg is weighing charges against Penny. A grand jury is likely to be impaneled next week. Neely's family is demanding justice. In a statement, their new attorneys from Mills &amp; Edwards said: 'We understand our current times have created a heightened sense of fear (sometimes reasonable, sometimes not.) 'However, there has to be a clear line of when lethal force can be used by anyone, including civilians.' 'Mr. Neely suffered from mental illness which began at age 14 when he experienced the brutal murder of his mother. 'It is a tragedy for all of us to know that Jordan Neely’s life was also cut short. 'Mills &amp; Edwards is committed to holding accountable the MTA and Neely’s killer.' Penny's attorneys from Raiser &amp; Kenniff released a statement last night defending him. ",
        "'We would first like to express, on behalf of Daniel Penny, our condolences to those close to Mr. Neely. Mr. Neely had a documented history of violent and erratic behavior, the apparent result of ongoing and untreated mental illness 'When Mr. Neely began aggressively threatening Daniel Penny and the other passengers, Daniel, with the help of others, acted to protect themselves, until help arrived. Daniel never intended to harm Mr. Neely and could not have foreseen his untimely death. ' They are putting the onus on New York City officials who have failed to address the mental health crisis among the homeless population.  'For too long, those suffering from mental illness have been treated with indifference. 'We hope that out of this awful tragedy will come a new commitment by our elected officials to address the mental health crisis on our streets and subway,' they said. "
    ]
}