{
    "articleURL": "/wires/pa/article-12046395/Declan-Kidney-flag-flying-London-Irish-despite-wait-wages.html",
    "content": [
        "London Irish’s game against Exeter looks set to go ahead on Saturday despite the club’s failure to pay staff, with director of rugby Declan Kidney vowing to “keep the flag flying”.",
        "Talks are ongoing between the current ownership and prospective new buyers but, with those negotiations taking place behind the scenes, the April payroll has not been met by either party.There have been suggestions of a potential boycott of the fixture by players, but Kidney indicated that the team’s desire to end their Gallagher Premiership season on a high remains undimmed.",
        "“I can confirm no employee here – players or staff – has been paid as of yet, but we have been given a lot of assurances from the prospective new ownership that it will happen over the coming days,” he said.“Preparations (for the match) are in full swing, everything is going ahead. Training has taken place fully. As far as we are concerned we are ploughing ahead to the match on Saturday.“We are the professional arm of a club that is 124 years old. We know our responsibilities. It is our duty to keep the flag flying here and that is what we are doing.”Kidney confirmed that all insurance premiums had been covered, removing one possible roadblock to the fixture taking place, but he was unable to shine a light on when things could be expected to reach a conclusion.While insisting credible promises had been made, the former Ireland coach said no date had been forthcoming for delivery of overdue wages and he had not been made aware of a clear timeline for completion of the sale.",
        "At the end of a season that has seen Worcester and Wasps go bust, such lack of clarity is an obvious worry for all associated with the club, but Kidney has been overwhelmed by the commitment his squad have shown under adversity. They are just the salt of the earth, fantastic people to work with. Nobody is looking for their hand to be held, everybody is looking forward to getting on with the job.  Declan Kidney  “Obviously there are concerns around it, but they’re not in our control,” he said.“We’re not the first company to have delayed payments in terms of our salaries but we can only control what we can control. You can draw too many comparisons between us and other teams but I think it would be wrong to do that.“I can’t speak highly enough of the quality of players I’ve been working with, in terms of application and positiveness.“These lads are about way more than money. They are just the salt of the earth, fantastic people to work with. Nobody is looking for their hand to be held, everybody is looking forward to getting on with the job.“All I can say is what happened to date, I cannot guess the future but I can say for certain the quality of people here is so strong. We entrust in the owners and prospective owners will come to a positive resolution here.”"
    ]
}