{
    "articleURL": "/sport/football/article-12046649/Alisha-Lehmann-racked-20-million-followers-social-media-wants-fame-football.html",
    "content": [
        "Aston Villa women's star Alisha Lehmann has amassed a huge fanbase onlineLehmann shares football updates and glamourous photos on her social mediaThe Swiss international admits she wants to have more fame for her football Marcus Rashford was described as a gent this week after the Manchester United forward rescued Aston Villa women's star Alisha Lehmann by inviting her to a private area in a nightclub.",
        "The England international came to Lehmann's aid after she was reportedly 'mobbed on arrival' by a group of men on night out in Manchester's Chinawhite.That Lehmann was both swarmed by fans and recognised by Rashford, despite never meeting, demonstrated the profile the 24-year-old has built both on and off the pitch.Lehmann has been labelled as the most followed women's footballer in the world, boasting over 20 million supporters across her social networks.The Swiss international forward boasts 13 million followers on Instagram, just 2.5m shy of Rashford's own total on the network.",
        "The figure also surpasses the likes of two-time Women's World Cup winner Alex Morgan, with the US international having 10m followers despite boasting greater success on the pitch and being one of the sport's biggest names.Lehmann has received attention for her abilities on the field in the Women's Super League but the star has also attracted fans by posting a series of racy photos of herself in glamorous locations around the world.Mail Sport takes a closer look at Lehmann's career and profile to date, with the star recently admitting to the opportunities posed by her huge social media following, as well as the struggle to be taken seriously as a player.Lehmann's career so far ",
        "Lehmann began her professional career with Swiss side Young Boys after breaking into the first team set-up in 2016.She attracted the interest of Women's Super League clubs following her performances for Switzerland at the Under-19 European Championships in 2018.Lehmann played in all three group matches for the host nation, scoring twice, but her efforts were not enough to take Switzerland into the knock-out stages of the tournament.West Ham were quick to move for Lehmann after the club's then manager Matt Beard had been impressed with her displays.'Alisha is an exciting and talented young player. Her continued experience with the Switzerland national team will bring an increased level of ambition and game understanding,' West Ham's general manager Karen Ray said when confirming Lehmann's signing.",
        "'Matt expressed his interest in Alisha to us very early on and since joining the team after competing in the U19 European Championships, she has begun challenging herself and the others around her to raise the level.'Alisha will be a handful for our opponents and we are looking forward to supporting this next stage of her career.'Lehmann was among the players covered during a BBC Three documentary titled 'Britain's Youngest Football Boss', which charted Jack Sullivan - son of West Ham United co-owner David Sullivan - running of the women's team.",
        "'But I didn't know of West Ham women's team because they'd been down the leagues,' Lehmann admitted when discussing her arrival at the club.'We all come from different places and that's why we are all together. We are like a little family. We have a very good philosophy in this team.'Lehmann scored a crucial equaliser for West Ham in the Women's FA Cup semi-final against Reading in 2019, with the Hammers ultimately booking their spot in the Wembley showpiece. Their debut appearance in the final ended in a 3-0 defeat to Manchester City.After scoring nine goals in 42 games for the Hammers across three seasons, Lehmann had a brief loan spell to Everton.She completed a move to fellow WSL side Aston Villa in 2021, where she has made 40 appearances, scoring five goals. Villa have enjoyed a strong campaign this season with the team lying fifth in the table behind Man United, Man City, Chelsea and Arsenal.The Swiss international, who has seven goals in 38 games for her country, will also have her eyes set on making an impact at this summer's Women's World Cup.Social media fameLehmann is expected to be one of the most high profile players at the tournament in Australia and New Zealand due to her immense social media presence, which has made her one of the best known women's football players.",
        "The 24-year-old has amassed a vast number of fans, with 13m followers on Instagram, a further 7.8m on TikTok and 170,000 on Twitter.Earlier this year Lehmann became the most followed Swiss athlete on Instagram taking the crown previously owned by legendary 20 Grand Slam champion tennis player Roger Federer.Lehmann also wowed fans last month with a TikTok video, which showed her scoring an outrageous rabona during one of Aston Villa's recent training sessions.The 24-year-old forward executed the skill after her team-mate played the ball slightly behind her while she was running into the box.",
        "Lehmann crossed her right leg behind her left to poke the ball into the top corner of the goal, prompting some fans to boldly compare her to Cristiano Ronaldo.Lehmann regularly shares updates from training sessions and games, as well as sharing a series of holiday pictures on her pages.Much of Lehmann's fame has on social media has been credited to her photos away from the pitch, having posted numerous bikini photos from exotic locations around the world.Lehmann recently admitted in an interview with talkSPORT that she wants to be known for her prowess on the pitch, than being viewed as a social media influencer.  'To be honest, I don't really think about it,' she said. 'It's not something where I wake up every day and think, \"oh my God, I have so many followers\".",
        "'It's more that it's really nice, the support and everything and it's also a big opportunity.Some people just see Instagram and social media and don't even know I actually play football, when I don't post a football picture for a week, people say, \"oh she doesn't even play\".'I think sometimes it's a bit hard because obviously I play like I train every day, like everyone else, like I play every weekend and sometimes it's hard because they make a picture of you.",
        "'I'm a proper footballer. I work hard every day. I want to be the best version of myself in football and that's my first priority in life.'Lehmann's ability on the pitch and profile off it have combined on occasions, with the star revealing last month the launch of her own kit in the FIFA 23 video game.The Aston Villa star posed in the kit on her Instagram, with the shirt featuring the words 'be brave' and a rose inspired design.'My journey as a female player was not always easy and I think sometimes you need to step back to go forward again,' Lehmann said.'I really like roses, as you can see like I love tattoos. I have a rose tattoo because I made it with my mum and sister together. And for me it just means family and happiness. ",
        "'It’s so cool to have my own kit with my own initials on it, my own story. Just always listen to yourself, like, do what you think and what’s in your heart, do what you love the most and never stop dreaming.'I love football, I love to go training and do the stuff I love the most every day. I hope I can inspire young girls with that and they can look up to me and think I want the same.’Lehmann recently entertained fans with a social media exchange with Greek tennis star Stefanos Tsitsipas and his younger brother Petros.Petros had messaged Lehmann in February to suggest they play a mixed doubles match together, after she had posted photos her playing tennis with international team-mates.World No 5 Stefanos then gifted Lehmann a signed tennis racquet, while she sent an Aston Villa shirt with her name on it in response after claiming to be ‘ready’ for a proposed doubles match.RelationshipsFans had claimed the two Tsitsipas brothers had been flirting with Lehmann, with their exchanges coming shortly after her relationship with Aston Villa men's star Douglas Luiz came to an end.The Villans pair reportedly confirmed their split in November having been a couple for a year.Lehmann and Luiz had announced their relationship on social media at the time. They posted the same picture of them kissing with the caption: 'I love you'.Lehmann's decision to do a raunchy calendar shoot was said to have caused issues between them.According to the Sun, Brazilian star Luiz was supposedly not enthralled by his partner's decision to take part in the photoshoot  - which ultimately proved to be the breaking point for their relationship.",
        "Luiz had previously hit out at Brazilian TV presenter Milton Neves, after he posted a video seemingly objectifying Lehmann. The TV host had tweeted a clip of Lehmann celebrating a goal by jumping and turning her back with the video appearing to zoom in on her backside.The video ended with the question: 'Without rewinding the video what number was on her shirt?'. Luiz responded angrily after Neves posted the video with the caption 'watch and comment', leading to the presenter deleting the Tweet.'You're old, years in soccer and you post a video that does not respect women's soccer or the player herself, who is also my girlfriend,' Luiz said on Twitter.Lehmann, who is openly bisexual, was previously in a relationship with Paris Saint-Germain women's player Ramona Bachmann, who also plays for the Switzerland team.Lehmann addressed their relationship in the BBC Three documentary. She discussed the challenge of playing for rival teams, with Bachmann having played for Chelsea while she was at West Ham.Lehmann said: 'She is really, really good, technical and fast. I am a little bit nervous but I think it will be a good game. If she scores I will feel really bad!'"
    ]
}