{
    "articleURL": "/wires/pa/article-12045673/Former-SNP-spin-doctor-willing-gamble-no-charges-police-finance-probe.html",
    "content": [
        "The SNP’s former spin doctor said he is confident the police investigation into the party’s finances will not result in any charges, as he spoke publicly about the probe for the first time.",
        "Murray Foote was head of communications for the SNP until standing down in March after a row about the party providing inaccurate membership figures to the media during its leadership election, saying he had passed them on in “good faith”.The former Daily Record editor wrote in the newspaper on Thursday that he is prepared to gamble on there being no charges after the investigation is concluded.Mr Foote speculated on the veracity of the probe, codenamed Operation Branchform, and whether it is a “wild goose chase”, branding it a “grotesque spectacle”.Former chief executive Peter Murrell and ex-treasurer MSP Colin Beattie were both arrested as part of the investigation, but later released without charge.",
        "Mr Foote wrote: “I’m not saying Branchform is a wild goose chase – but what if it is?“Surely it’s worth considering. Actually, if we cherish the presumption of innocence, then a no charges outcome must be at least considered.“And the fallout would have serious consequences for the investigating authorities.“Given the grim spectacle at the house Peter Murrell shares with Nicola Sturgeon and at the party HQ, it’s inconceivable the authorities would be so cavalier without slam dunk evidence, right?”Mr Foote then compared the situation to Rangers where administrators David Whitehouse and Paul Clark were falsely arrested over the football club’s financial woes.",
        "“The legal costs over the wrongful pursuit of those involved in the administration and purchase of the Ibrox club are upwards of £50 million,” he wrote.“So, the authorities have previous for high-profile inquiries collapsing in scandal.“If they have spectacularly misjudged this one too, then the reputational cost will be far more substantial than the cash spent on manpower.“By the way, I’m not criticising the investigation itself. If the police receive a complaint, it’s their duty to investigate.”The former spin doctor said the sight of forensic tents outside of the home of former first minister Ms Sturgeon and Mr Murrell was “extraordinary” and a “grotesque circus”.Mr Foote said Mr Beattie and Mr Murrell are highly unlikely to be “master criminals”.",
        "“What I do know, however, is something of the character of the two men arrested to date and, in Peter Murrell and Colin Beattie, two less likely master criminals you will struggle to meet.“Firstly, Peter’s loyalty to his wife is unquestionable.“First minister Sturgeon and her husband lived under crushingly intense scrutiny.“It is inconceivable to me that Peter would so much as consider doing something dodgy lest it rebound and put his wife in jeopardy.”Instead, Mr Foote attacked the Conservatives, saying they know they are the “real party of corruption”, and accused them of exploiting the situation.",
        "On Wednesday, First Minister and SNP leader Humza Yousaf spoke of his relief over appointing new auditors.The party had been without auditors since late 2022.Mr Yousaf has said he only found out about the situation after he became party leader in March.He said: “We take our statutory obligations extremely seriously, so it is welcome news that AMS Accountants Group will complete the accounts for both the party and the SNP Westminster group.“There is hard work ahead, but it is really encouraging to have them on board as we work towards challenging deadlines.”Scottish Conservative MSP Annie Wells said: “Murray Foote may have quit his post but this highly speculative article shows he’s still happy to spin for his former employer, the SNP.“Mr Foote’s faith in Peter Murrell’s character will raise a few eyebrows, given it was the former chief executive’s lies over SNP membership figures which led to his own resignation.”"
    ]
}