{
    "articleURL": "/news/article-12045573/PE-teacher-struck-tampering-students-coursework-inflating-grades.html",
    "content": [
        "PE teacher Liam Browne, 34, was found to have inflated pupils' gradesBanned from profession indefinitely after 'undermining' trust in exams process  A PE teacher has been struck off from the profession indefinitely after he was found by a tribunal to have tampered with his pupils' coursework and inflated their grades.",
        "Liam Browne, 34, associate assistant principal at a Melior Academy in Scunthorpe, Lincolnshire, was found to have boosted the marks of his pupils' sports science coursework.A Teaching Regulation Agency (TRA) conduct hearing last month, found Mr Browne had 'undermined' public trust in the exams process and was banned from teaching indefinitely, with a review period of four years.The panel proved a number of allegations from 2018 to 2021, including 'over-assisting' Melior Academy pupils with coursework by providing templates, which gave an unfair advantage, and tampering with work before sending it to moderators.During the 2018/19 school year, while he was faculty leader for expressive arts at the school, Browne provided templates to base their coursework off, which was against the exam board's rules.",
        "He also substituted content in one pupil's work for an identically written piece of text in another's. The teacher blamed a technical error but found his explanation 'wholly implausible'.Mr Browne shared 'model' pieces of coursework from former pupils to assist current children on the same course, giving them an unfair advantage.Mr Browne admitted that he edited the work of several pupils after it was collected but before it was sent exam board OCR. He said that he had only made formatting changes but denied making 'substantial amendments'.",
        "He was also found to have allowed pupils to modify their work after it was submitted but before it was sent to the exam board. After 15 courseworks samples were moderated by OCR, they provided feedback and requested the remaining five pieces for further moderation. However, the board said the second batch appeared to have benefitted from this feedback.Following a 2019 investigation, Mr Browne was banned by OCR from administering their exams and assessments for five years.But the TRA hearing found that he continued to assess and submit sports science coursework despite this prohibition.Mr Browne was found to have given his pupils inflated grades for their sports science coursework in the 2020/21 academic year. He admitted to the panel that his marking was substantially different to those moderated by senior colleagues - but he claimed this was not intentional and due to errors in marking.For 27 out of 28 pupils in the class, all but one were awarded a lower score when the papers were remarked by two of Mr Browne's colleagues.The remaining pupil's paper was scored zero by Mr Brownes and when it was remarked.The panel found that Mr Browne had acted dishonestly and with a lack of integrity as he had 'demonstrated a clear course of conduct which was undertaken to gain an unfair advantage to his pupils'.",
        "A spokesperson for the Delta Academies Trust, which runs Melior Academy, said: 'The report relates to a former member of staff who left our employment more than two years ago.'Melior Academy has a strong record of maintaining and upholding the integrity of examinations and assessments.'"
    ]
}