{
    "articleURL": "/wires/ap/article-12043161/Embiid-MVP-validation-NBA-title-goal.html",
    "content": [
        "BOSTON (AP) - Joel Embiid finally said it: Winning the NBA´s Most Valuable Player award has been a dream ever since he belatedly started playing basketball.",
        "\"I know I´ve always said I don´t care, but it was just for you guys to leave me alone,\" the 76ers center said Wednesday, a day after he was voted to his first MVP after two runner-up finishes. \"I do care in the way that it validates everything, all the work that you´ve put in. And to be sitting here is just amazing.\"A native of Cameroon who didn´t pick up the sport until he was 15, Embiid was the 76ers' reward for tanking their way to the No. 3 overall pick in the 2014 draft. But he missed two full seasons with foot injuries, leaving Philadelphia fans to wait while general manager Sam Hinkie insisted that they \"Trust the Process.\"Injuries continue to keep Embiid off the court to this day: He missed Game 1 of Philadelphia's second-round series against Boston and is officially listed as doubtful with a sprained knee for Game 2. Embiid said \"it´s a possibility\" he would play on Wednesday night.\"Obviously, it´s earlier than what we thought, considering what I had. We´re just going to take day by day and see how it feels,\" he said after some light shooting on Wednesday morning. \"It's a possibility, just like it was a possibility in the first game. Obviously, I want to play.\"",
        "Comparing his life to a movie, Embiid said he originally took up basketball, thinking it might be a pathway to a college degree and a decent job. It earned him a scholarship to Kansas, where he wanted to redshirt as a freshman and stay for five years. When coach Bill Self told him there was no need, and he could be the No. 1 overall draft pick, Embiid didn't believe him.",
        "\"I didn´t think basketball would take me anywhere,\" he said.\"The probability of someone like me, who started playing basketball at 15, to get the chance to be the MVP of the league is I would say is probably `negative zero,´\" he said.\"We don´t have a lot of opportunities to get to this point, in Africa in general. But improbable doesn´t mean impossible,\" he said. \"You can accomplish anything you set your mind to as long as you believe in it, and you keep working hard. Anything can happen.\"Embiid, 29, averaged 33.1 points to win his second straight scoring title, averaged 10.2 rebounds and tied a career high with 4.2 assists per game. He received 73 of the 100 first-place votes for the MVP, with two-time winner Nikola Jokic of the Denver Nuggets second and the Milwaukee Bucks' Giannis Antetokounmpo third.",
        "While acknowledging that the MVP was important to him, Embiid said he is still focused on his primary goal: winning an NBA title. The Sixers have not made it out of the second round of the playoffs since reaching the NBA Finals in 2001.\"I don´t want to win this award because it´s just the MVP. I want to win it because it means a lot to me (because) I went through a lot, and that´s just a validation of that. Everything - the sacrifices, everything you went through - it´s paying off in some way,\" he said. \"Obviously, winning the championship is going to be way better. We now have that opportunity. But I´m just competitive. I want it all. I want to win everything that I can get my hands on. And everybody around me knows that.\"It doesn´t matter if it´s about basketball or in life, or whatever. I want to win everything,\" he said. \"I want to be first.\"___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}