{
    "articleURL": "/sport/football/article-12046987/Lionel-Messi-earn-PSG-returns-Barcelona-says-Javier-Tebas.html",
    "content": [
        "It was revealed on Wednesday that Lionel Messi will leave PSG this summer The 35-year-old has been suspended for two weeks after a trip to Saudi ArabiaDavid Beckham's Inter Miami, Al-Hilal and Barca will battle it out to sign Messi Lionel Messi has been warned that he will not be earning any more than what he currently receives at PSG if he returns to Barcelona this summer.",
        "LaLiga chief Javier Tebas claims that the seven-time Ballon d'Or winner will have to take an enforced pay cut if he is to seal a switch back to the Nou Camp at the end of the season. The Catalan giants are currently in the midst of a financial crisis that has left them unable to make any signings unless they can raise £178million from player sales. Messi has been linked with a return to the club where he spent 17 years of his career after it was confirmed that he will be departing PSG  at the end of the campaign, although the Blaugrana will battle it out with Inter Miami and Al-Hilal. Yet Tebas suggested that it might not be as difficult for the club to raise the prerequisite funds, stating that they should be able to 'get a good amount'.  ",
        "'If Barca signs Leo Messi, his salary will be less than what it is at Paris Saint-Germain,' claimed Tebas, as reported by Fabrizio Romano.'His return is now conditional on selling players. I think that Barca will get a good amount from selling players this summer'.Barcelona do have several players at the club who would attract decent transfer fees should they be sold on this summer. Ex-Leeds star Raphinha has been linked with a £60m move back to the Premier League, with Newcastle reportedly having made a verbal offer for the Brazilian. ",
        "Danish centre-back Andreas Christensen has also been linked with a move back to the English top-flight having only departed Chelsea last summer, with Erik ten Hag's Manchester United thought to be interested. The Red Devils were also part of a drawn out transfer saga with Barca star Frenkie de Jong last summer, although it remains to be seen whether that pursuit will be reignited this year. ",
        "Messi's future has been shrouded in uncertainty for much of the season, although reports claim that his father and agent, Jorge, informed the Paris outfit that he would be leaving at the end of 2022-23 a month ago.However he has seemingly dropped down in the estimations of the club's ultras, having taken an unauthorised trip to Saudi Arabia, believed to be part of a £25m-a-year ambassadorial role signed with the country. The player was handed a two-week suspension that will see him miss clashes with Troyes and Ajaccio as PSG look to seal an 11th Ligue 1 title.But supporters have made their opinions on the player clear, having chanted for him to leave outside the club's headquarters. It was thought that the fans had arrived at the headquarters to protest Messi's suspension, but, according to The Sun, one chant heard was: 'Messi, son of a b****.'",
        "There was also reportedly swearing aimed at Neymar when the fans gathered outside his house."
    ]
}