{
    "articleURL": "/wires/reuters/article-12058081/Top-Biden-aide-discusses-Yemen-peace-efforts-Saudi-crown-prince-White-House.html",
    "content": [
        "WASHINGTON, May 7 (Reuters) - U.S. national security adviser Jake Sullivan met Saudi Crown Prince Mohammed bin Salman during a visit to the kingdom on Sunday and reviewed what the White House called \"significant progress\" in Yemen peace efforts, the White House said.",
        "On a trip aimed at bolstering often-frayed ties with Riyadh, Sullivan also held joint talks with the crown prince, UAE national security adviser Sheikh Tahnoon bin Zayed al-Nahyan and India national security adviser Ajit Doval \"to advance their shared vision of a more secure and prosperous Middle East region interconnected with India and the world,\" the White House said.Sullivan's meeting came after a period in which U.S.-Saudi ties have been damaged by oil production cuts by Saudi-led OPEC+ and differences over the 2018 killing of Washington Post journalist Jamal Khashoggi.\"He reviewed significant progress in talks to further consolidate the now 15-month long truce in Yemen and welcomed ongoing UN-led efforts to bring the war to a close, as well as covering a range of other issues,\" the White House statement said.Sullivan, President Joe Biden's top White House national security aide, also thanked the crown prince for Saudi support to U.S. citizens during evacuation from Sudan, the statement added.U.S. special envoy Tim Lenderking travelled to Oman and Saudi Arabia earlier this month to seek to advance Yemen peace efforts, the State Department said.A Saudi-led military coalition intervened in Yemen in 2015 after the Iran-aligned Houthis ousted the government from the capital Sanaa.A Saudi delegation, which is seeking a permanent ceasefire deal to end military involvement in the war, concluded peace talks in mid-April in Sanaa with the Houthi group, whose top negotiator said talks had made progress and further discussions would be held.",
        "Yemen's conflict, which has killed tens of thousands of people and left millions hungry, has widely been seen as a proxy war between Saudi Arabia and Iran.A senior Israeli security official said on Friday that Israel was hoping for a breakthrough in efforts to normalize its ties with Saudi Arabia during Sullivan's visit there.But the White House statement made no mention of Israel. (Reporting By Matt Spetalnick; Editing by Sandra Maler)"
    ]
}