{
    "articleURL": "/tvshowbiz/article-12056253/Georgia-Toffolo-puts-animated-display-walking-dog-Mayfair.html",
    "content": [
        "Georgia Toffolo put on an animated display in a chic tartan blazer as she strolled through Mayfair with her dog Monty on Saturday.  ",
        "The Made In Chelsea star, 28, has recently been appearing on the pre-recorded version of I'm A Celebrity... South Africa. Georgia, who is known as Toff, had a spring in her step as she made her way home from enjoying the festivities for King Charles's coronation in London. She looked stylish as she put on a leggy display in skinny black jeans and knee-high boots. Georgia turned heads in a bright red tartan blazer - and even matched her dog lead to the bold tones of her ensemble.  ",
        "Toff appeared deep in conversation as she strolled the capital with her brown King Charles Spaniel Monty, who is three. Toff and Monty braved the rain as they managed to dodge the crowd for their walk.  She appeared fresh-faced in just a light base of make-up, as she pulled her long blonde tresses back into a low ponytail for a practical look.  It comes after I'm A Celebrity South Africa viewers kicked off on Friday night as the show ended on a dramatic cliffhanger ahead of a double elimination.The latest instalment wrapped up during a tense trial in which yellow pride's Jordan Banjo and Myleene Klass and green pride's Andy Whyment and Toff battled for their place in camp.The group were going head-to-head in the gold mine trial, with the winners earning a luxury picnic, while the losing pair would be sent home.",
        "However, just as things began to heat up with the competition closely fought, the show abruptly ended, with the result not being announced until Monday.And viewers were far from impressed with the 'cruel' twist as they took to Twitter to vent their fury, with one even asking: 'What are you playing at?!'",
        "The four had to take part in the Gold Rush trial, in which they had to find gold nuggets buried inside identical mine shafts. The object of the game was to find the nuggets and place them on scales at entrance to the mine, with each team having to find enough nuggets to tip the scales and win a picnic for their team - with the losers going home. It was a closely fought race, with Georgia and Andy initially taking the lead while Myleene struggled to find any nuggets as Jordan ploughed ahead.But things evened up when Myleene began to find her nuggets, with the competition seriously heating up as the stars desperately fought to come out on top.However, viewers will have to wait and see which two stars would be packing their bags.  "
    ]
}