{
    "articleURL": "/news/royals/article-12050741/Royal-fans-believe-spotted-huge-error-Coronation-Medal.html",
    "content": [
        "The medal, unveiled this morning, will be given to more than 400,000 workers Read more: William, Charles and Camilla attend rehearsal at Westminster Abbey Eagle-eyed royal watchers have spotted what appears to be an embarrassing error on the coronation medal. ",
        "The nickel silver medal, which will be given to more than 400,000 people for their efforts to support the coronation, features the new King's royal cypher, surrounded by a laurel wreath. The other side of the award, which also features a blue, white and red ribbon, is decorated with portraits of the King and Queen, who will be crowned in the ceremony at Westminster Abbey tomorrow. But observant royal fans reckon they have spotted an enormous mistake on the medal in images that were unveiled this morning. Social media users pointed out the error online - but can you spot what they're talking about? ",
        "In some lights, the date listed on the award looks as if it says 6 May 2033 - a full decade after the coronation tomorrow. But anyone concerned about receiving a medal with the wrong date can breathe a sigh of relief - the date on the medal is the correct one. Launching the medal on Friday morning, Culture Secretary Lucy Frazer said: 'The coronation medal will act as a reminder of the important part each person has played in this moment of history.'From our armed forces who protect our country to the emergency services who care for us at home, alongside those volunteers who are giving up their time to make this event so special, I am delighted that we can mark their contribution to this special day, and for each and every day that they go above and beyond serving their country.'",
        "Deputy Prime Minister Oliver Dowden said: 'The coronation would not be possible without the dedication and selfless service shown by our armed forces and other public servants.'This medal is a fitting recognition of their efforts and a thank you from the nation. It will be worn with pride for years to come.'The medal will also be given to serving members of the police, fire, emergency services, prison services and armed forces who have completed five full years of service.Living individual recipients of the George Cross or of the Victoria Cross will also receive one.Home Secretary Suella Braverman said: 'This medal is a symbol of the critical role our emergency services will play in this potentially once-in-a-lifetime opportunity to honour our new King.'However, it rightly also goes further and recognises not just those who are helping at the coronation, but the heroes across our emergency services, such as the police, fire and rescue services, that go to work every day to protect and support us all.'The first coronation medal was awarded in 1603, for the coronation of King James I, who had already become King of Scotland."
    ]
}