{
    "articleURL": "/wires/ap/article-12053515/Crowns-coaches-ready-King-Charles-IIIs-coronation.html",
    "content": [
        "LONDON (AP) - King Charles III was crowned Saturday at Westminster Abbey, in a ceremony steeped in ancient ritual and brimming with bling at a time when the monarchy is striving to remain relevant in a fractured modern Britain.",
        "At a coronation with displays of royal power straight out of the Middle Ages, Charles was given an orb, a sword and scepter and had the solid gold, bejeweled St. Edward´s Crown placed atop his head as he sat upon a 700-year-old oak chair.In front of world leaders, foreign royals, dignitaries and a smattering of stars, the monarch declared, \"I come not to be served but to serve,\" and was presented as Britain´s \"undoubted king.\"Inside the medieval abbey, trumpets sounded, and the congregation of more than 2,000 shouted \"God save the king!\" Outside, thousands of troops, hundreds of thousands of spectators and scores of protesters converged.It was the culmination of a seven-decade journey for the king from heir to monarch.To the royal family and government, the occasion - code-named Operation Golden Orb - was a display of heritage, tradition and spectacle unmatched around the world.",
        "To the crowds gathered under rainy skies - thousands of whom had camped overnight - it was a chance to be part of a historic event.Julie Newman, a 77-year-old visitor from Canada, said the royal procession had been \"absolutely fabulous. Couldn´t ask for anything better.\"\"But we´re ready to go back home and watch it all on the television,\" she added.",
        "But to millions more, the day was greeted with a shrug, the awe and reverence the ceremony was designed to evoke largely gone.And to a few, it was reason to protest. Hundreds who want to see Britain become a republic gathered to holler \" Not my king.\" They see the monarchy as an institution that stands for privilege and inequality, in a country of deepening poverty and fraying social ties. A handful were arrested.As the day began, the abbey buzzed with excitement and was abloom with fragrant flowers and colorful hats. Notables streamed in: U.S. first lady Jill Biden, first lady Olena Zelenska of Ukraine, French President Emmanuel Macron, eight current and former British prime ministers, judges in wigs, soldiers with gleaming medals, and celebrities including Judi Dench, Emma Thompson and Lionel Richie.During the traditional Anglican service slightly tweaked for modern times, Charles, clad in crimson and cream velvet and ermine-trimmed robes, swore on a Bible that he is a \"true Protestant.\"But a preface was added to the coronation oath to say the Anglican church \"will seek to foster an environment where people of all faiths and beliefs may live freely.\" It was the first ceremony to include representatives of the Buddhist, Hindu, Jewish, Muslim, and Sikh faiths, as well as the first in which female clergy took part.",
        "Charles was anointed with oil from the Mount of Olives in the Holy Land - a part of the ceremony so sacred it was concealed behind screens - before being presented with the Sovereign's Orb and other regalia.Archbishop of Canterbury Justin Welby then placed the crown on Charles' head, while he sat in the Coronation Chair - once gilded, now worn and etched with graffiti. Underneath the seat was a sacred slab known as the Stone of Scone, on which ancient Scottish kings were crowned.For 1,000 years and more, such grandiose ceremonies have confirmed the right of British kings to rule. Charles was the 40th sovereign to be enthroned in the abbey - and, at 74, the oldest.These days, the king no longer has executive or political power, and the service is purely ceremonial since Charles automatically became king upon death of his mother, Queen Elizabeth II, in September.The king does remain the U.K.´s head of state and a symbol of national identity - and Charles will have to work to bring together a multicultural nation and shore up support for the monarchy at at time when it is waning, especially among younger people.While most Britons view the monarchy on a spectrum ranging from apathy to mild interest, some are fervently opposed to it. The anti-monarchy group Republic said several of its members, including its chief executive, were arrested as they arrived at a protest in central London.",
        "Police, who'd warned they would have a \"low tolerance\" for people seeking to disrupt the day, said they made 52 arrests. Human Rights Watch said arrests of peaceful protesters were \"something you would expect to see in Moscow, not London.\"The multimillion-pound cost of the all the pomp - the exact figure unknown - also rankled some amid a cost-of-living crisis that has meant many Britons are struggling to pay energy bills and buy food.Charles has sought to lead a smaller, less expensive royal machine for the 21st century, and his was a shorter, smaller affair than his mother's coronation.The notoriously feuding royal family put on its own show of unity. Prince William, who is next in line to be king, his wife, Kate, and their three children were all in attendance. Towards the end of the ceremony, William knelt before his father and pledged loyalty to the king - before kissing him on the cheek.Then Archbishop Welby invited everyone in the abbey to swear \"true allegiance\" to the monarch. He said people watching on television could pay homage, too - though that part of the ceremony was toned down after some criticized it as a tone-deaf effort to demand a public oath of allegiance for Charles.William´s younger brother Prince Harry, who has publicly sparred with the family, arrived alone. His wife Meghan and their children remained at home in California, where the couple has lived since quitting as working royals in 2020.",
        "As Charles and the key royals joined a magnificent military procession after the ceremony, Harry stood waiting outside the abbey until a car arrived to drive him away.Large crowds cheered as Charles and Queen Camilla, who was also crowned, rode in the Gold State Carriage from the abbey to Buckingham Palace, accompanied by a procession of 4,000 troops and military bands playing jaunty tunes. From the palace balcony, the king and queen waved to a sea of people who cheered and shouted \"God Save the king!\"For many other Britons, the day's events drew mild curiosity, at best.Cherie Duffy, who was visiting London from Anglesey, Wales, on a trip planned before the coronation date was set, watched the ceremony on TV - but only because someone else turned it on.\"There´s a general not-botheredness,\" she said about how she and her friends felt.___Associated Press writers Sylvia Hui and Brian Melley contributed to this report.___Follow AP´s coverage of King Charles III at https://apnews.com/hub/king-charles-iii"
    ]
}