{
    "articleURL": "/tvshowbiz/article-12057611/Love-Blinds-Chelsea-Griffin-Kwame-Appiah-celebrate-one-year-wedding-anniversary.html",
    "content": [
        "Love Is Blind stars Chelsea Griffin and Kwame Appiah celebrated their one year anniversary over the weekend.",
        "The reality stars, who found true love on season four of  the Netflix show that has been blasted by former cast member Amber Pike, marked the occasion with a trip to the Magic Kingdom and a visit to see 'King' Lebron James.In her Instagram Stories, Chelsea, 31, shared a photo of herself and Kwame at Disneyland, writing 'Surprised Kwame for our anniversary!!! First time for him. First time together.'She later shared snap of her husband, 33, competing with her on the Buzz Lightyear blasters.The couple, who met in one of the pods that allowed them to speak but not see each other during their courtship, had to keep their nuptials out of the public eye until the season four finale was released on April 14. ",
        "Kwame, a former pro soccer player, shared pictures from their wedding on April 26, as part of a birthday message to his wife. 'We all go through this experiment looking for a partner. Along the way, we usually find more. Friendship, growth, and new purpose are all things you will encounter along the way. I was blessed to find all of those in you,' he wrote in the sweet note.'A best friend, to help me grow, and discover new purpose. On this incredible day, we got to share in the joy of starting our new life. Since then, laughing with you has become my favorite hobby. Waking up next to you has become the best way to spend a morning. Being with you makes me feel whole. I love you with all my heart, and I’m blessed to call you my wife. Happy Birthday Baby ❤️'",
        "Chelsea wore a white lace gown with spaghetti straps for their outdoor ceremony in the Pacific Northwest. Her blonde hair was pulled back into a low curly pony tail.The bride skipped a veil and accessorized with a crystal-encrusted necklace and hibiscus-shaped earrings with pearls. Kwame looked handsome in a traditional black tuxedo with a brown-and-black bow tie.Their wedding alter was decorated with cherry blossoms.Looking back on their first year together, Chelsea wrote, 'Happy anniversary to my husband. My hero, my rock, my teacher, my lover, my adventure and rap partner.' ",
        " 'What a year it's been baby,' she continued, 'let the good times roll.'Anniversary weekend about to be amazing! Let's continue to be present, supporting each others growth, keeping at the forefront what matters most. I love you beyond words.'The pair reunited with other contestants from Love Is Blind at the Lakers vs Warriors matchup in Los Angeles, including Tiffany Pennywell and her husband Brett Brown.Chelsea explained the gathering, writing, 'Fun fact! We all got married on the same weekend... guess whose anniversary is tomorrow?' and answering the question writing C+K 5.6.22."
    ]
}