{
    "articleURL": "/news/article-12056201/The-Queens-former-right-hand-woman-Angela-Kelly-shares-poignant-picture-late-monarch.html",
    "content": [
        "Ms Kelly's friend told followers to 'spare a thought for' her after losing the Queen The Queen's former right-hand woman Angela Kelly shared a poignant photograph of herself with the late monarch on the day of King Charles' coronation as friends say she would have felt 'mixed emotions'.",
        "Ms Kelly was the Queen's confidante and stylist for more than 20 years and the pair were known to have a very close relationship. Yesterday as the nation celebrated King Charles being crowned, her friend Stella Mclaren posted a couple of pictures showing Ms Kelly and the Queen beaming with smiles together. 'Let's spare a thought for how my best friend Angela Kelly feels today with such mixed emotions at losing her best friend H Majesty the queen,' Ms Mclaren wrote. 'The queen bought us together and it was wonderful to see their friendship. ",
        "'How she made the queen laugh was an absolute joy to witness. Such brilliant memories. Thank you Angela BFF forever. Love you.' Ms Kelly, commenting on the post, wrote: 'Stella you are truly my best friend. With Love to a friend. From a friend. May we always be friends.'Earlier in the week it was claimed that Queen Elizabeth II's 'best friend' Angela Kelly may have been handed a new home away from the royal household by King Charles in return for her silence including a planned new book on the late monarch.Ms Kelly is leaving her grace-and-favour cottage in the grounds of Windsor Castle.Her Majesty's dresser is having to vacate the modest semi-detached house, and has lost her work-issue mobile phone, to start a new life in the Peak District, 180 miles away.",
        "Angela has written two books and is understood to have had the Queen's blessing to write a third about Her Majesty's love of dogs, as a gesture of thanks for Angela's years of service but also to provide some financial assurance for her future.But a source has told the Mail's Richard Kay that the King's provision of a house for the duration of Angela Kelly's life is almost certain to have come with strings attached. This usually means a non-disclosure agreement, preventing interviews or memoirs about royal service. One friend said: 'Could she make a lot of money from all she knows? You bet she could.'",
        "Many in royal circles expected she would be granted accommodation for life after her decades of service to the late monarch.She was recently recognised by King Charles in a special honours awards marking the death of the Queen.But eyebrows were raised when she only became a Commander of the Royal Victorian Order, rather than a Dame Commander as might have been expected.Ms Kelly was praised for overhauling the Queen's image with outfits in eye-catching colours and matching hats. As Her Majesty's health faltered, Ms Kelly became more of a personal assistant. The late monarch had once told her: 'We could be sisters.' ",
        "On the day of Queen Elizabeth's funeral last year, Ms Kelly described it as 'a very sad day for me today. I said goodbye to my best friend.'"
    ]
}