{
    "articleURL": "/tvshowbiz/outer-banks/article-12053587/Madelyn-Cline-Madison-Bailey-epitome-chic-step-Miami-pals.html",
    "content": [
        "Outer Banks stars Madelyn Cline and Madison Bailey looked sensational as they nailed a chic look while stepping out in Miami on Saturday.",
        "Madelyn, 26, was a vision in a halterneck mini dress - showing off her very toned legs.The white dress featured cherry prints as she matched it with a bold ruby lipstick.The Glass Onion star styled her golden tresses slicked back in a ponytail, showcasing her stunning features.She added large hoop earrings to the look and did a light make up palette, with just a touch of mascara and blush.",
        "Madelyn gave herself some extra inches with black tie-leg strappy heels and a glamorous black disc-detail bag where she carried the essentials.Madison didn't look anything less than spectacular as she flaunted her toned physique in a red striped midi dress.The figure-hugging dress flaunted Madison's enviable figure, and she matched it with black stiletto heeled thong sandals.The actress - who plays Kiara 'Kie' Carrera on the Netflix show - carried a £2,900.00 Dior mini saddle bag with strap.Madison donned large hoop earrings and kept her curly balayage locks in a half-up ponytail, with two locks down to frame her beautiful face.She pouted her lips with a glossy lipstick and showcased a flawless eyeliner - as she also opted for a light make up palette.The OBX duo looked glowing and in their highest spirits as they stepped out in Miami streets hugging and laughing - putting on a smitten display.",
        "The stars were spotted enjoying some time out with long time pal of Madelyn Lukas Gage and his boyfriend Chris Appleton.",
        "Last month Lukas, 27, - who starred in American series Euphoria and White Lotus - has tied to knot in Vegas with Chris, 39, who is nevertheless the hairstylist to Kim Kardashian.The couple was captured beaming closely with Madelyn in the streets of Miami - as she walked hand in hand with Lukas and took Chris under her arm.Madelyn and Lukas have also previously starred together in a mystery thrilled called What Breaks The Ice  as leading stars, along with Ozark actress Sofia Hublitz.While Madison appeared to enjoying some time off away from the public eye after her first appearance at Coachella last month - Madelyn made several appearances in the last weeks from her debut at the Met Gala, to the Nix-Warrior games in New York.On a recent interview for Teen Vogue, Madison said she show needs to explore the Impact of race on its black main characters.As filming of the fourth season of Outer Banks will began later this month, Madison made her opinion clear about how important is not to miss chances to narrate racism within the show.Madison told Cosmo last month: 'I think it would be good on the writers' part to start considering that critique—slightly late but better late than never. ",
        "'In season 2, we added Carlacia [Grant] to our main cast. She brings a vibe to set that we very much needed. I think it'd be in the writers' best interests to start emphasizing it more.'Meanwhile, Madelyn made her stunning debut at this year's Met Gala side by side with Stella McCartney and Aubrey Plaza.Both Madelyn and Aubrey were dressed my the designer for the yearly event.The Glass Onion star stunned in a shimmery black gown with silver embellishments. It comes after an awkward moment between Stella McCartney and Chloe Fineman has gone viral.The designer, 51, was being interviewed by the SNL comedian, 34, who served as Vogue's red carpet co-host for the night, along with Derek Blasberg.At one point McCartney called Fineman out for laughing during the interview, and asked, 'Are you not taking this seriously?''I am!' Fineman replied, with McCartney retorting, 'I think it's very serious.'Many fans called the interview 'cringe' and 'awkward' but others insisted that all the ladies were in on the joke and were simply being sarcastic.The interview started with Fineman introducing the guests as McCartney and Cline, but did not call the White Lotus star by her real name, and instead introduced Plaza as 'Audrey.'The actress then provided her own made up last name, calling herself, 'Slutburn.'",
        "The two have history together and have appeared on Saturday Night Live together on a number of occasions.Fineman then inquired about McCartney's look for the night - a bedazzled structured blazer dress and shimmering silver stockings - to which Stella dryly replied, 'It's a look. And that's about it.'The tense atmosphere persisted after Plaza described her white gown as simply 'Stella McCartney.''It's amazing, isn't it?' McCartney replied.Plaza went on, 'That's right, sustainable Stella,' and the British designer added, 'McCartney.'Following Plaza's response, Fineman and Blasberg began laughing, at which point McCartney called her out and asked if she was not taking the interview 'seriously.''No, I — I'll be more serious,' Fineman replied, as she and Blasberg attempted to change the topic.Fineman proceeded to ask McCartney about the time she took over brand Chloé, following Karl Lagerfeld's departure in 1997.This year, the ball's theme was Karl Lagerfeld: A Line of Beauty. The late German designer was Chanel's long-time creative director. He passed at age 85 in 2019.The atmosphere then eased up, as McCartney — who's the daughter of Beatles legend Paul McCartney and photographer Linda McCartney — recalled an anecdote about Lagerfeld.'My favorite moment about that — and it's when I felt that I truly arrived — is when Karl found out that I had taken over as successor to the brand, his quote was, \"I knew they would take a big name when I left the brand, but I thought it would be a big name in fashion, not in music.\"'",
        "Fineman replied with 'burn!' while Blasberg added, 'A king of the one liners!''I loved it, I was like, oh, Karl Lagerfeld knows who I am,' McCartney said of the dig.Plaza hit the red carpet in a off-shoulder white gown designed by McCartney with an unconventional cutout going diagonally across her chest.The cutout was accented with shimmering silver material that also fell down her back and fell to her hip.The actress had her black hair pulled up in a bun while accessorizing with diamond-encrusted teardrop earrings by EFFY Jewelry."
    ]
}