{
    "articleURL": "/femail/article-12042711/From-SACKED-refusing-ears-pierced-intriguing-facts-Queen-Camilla.html",
    "content": [
        "Queen Camilla has a long list of hobbies and passions which continues to growShe looks after her health by dancing and going to a health retreat in India There are few people under greater scrutiny than Queen Camilla - something she has had to get used to ever since her relationship with Charles became public knowledge.",
        "Even so, she is more colourful, and with a wider range of interests, than most us have bargained for. Did you know that Camilla is a Wordle devotee, that she still takes ballet lessons - or that she was once fired after a late night out (and a late start at work?)Here, the Mail's new Royals section reveals some essential - and intriguing - facts about the newly crowned Queen, from her hidden talents to her top tipple...She is the eldest of three children",
        "Camilla shares a close relationship with her younger sister Annabel Elliot, who is an interior designer and antiques dealer. And, behind closed doors, a key advisor.Her younger brother, Mark Shand, who was known for his swashbuckling travel books and passionate commitment to conservation, died in 2014, aged 62.Camilla's first husband once had a fling with Princess Anne",
        "Camilla married Andrew Parker Bowles in 1973 and the pair were divorced in 1995.Known as 'The Brigadier' in reference to his former career as an army officer, Andrew remains one of Camilla's confidantes.Known as a ladies man, it is said he had a fling with Princess Anne before marrying Camilla.Her first solo royal engagement was to Southampton General HospitalCamilla visited the hospital's osteoporosis unit on 23 May 2005 for her first official appearance without Charles after their wedding.",
        "The Royal Osteoporosis Society became Camilla's first patronage as Duchess of Cornwall",
        "Camilla's mother and grandmother both died of osteoporosis. She wrote that her mother suffered from the disease when it was 'seldom discussed, rarely diagnosed and usually attributed to old women with so-called Dowager’s hump'.She said: 'Seeing someone you love die slowly, in agony, and knowing nothing about the disease that killed them is heart-breaking.'Her first overseas official visit was to the United StatesCharles and Camilla met President George W. Bush and First Lady Laura Bush at the White House.She adopted two rescue Jack Russell terriers",
        "Camilla took home Beth and Bluebell as puppies from Battersea Dogs and Cats Home.Speaking previously about her dogs, the Queen Consort said: 'The nice thing about dogs is you can sit them down, you could have a nice long conversation, you could be cross, you could be sad and they just sit looking at you wagging their tail.'The Queen is so fond of Beth and Bluebell that she had the two pups embroidered onto her gown for the Coronation.Camilla keeps fit by taking Silver Swan ballet classesIn a video call to mark International Dance Day in 2020, Camilla revealed that she had secretly been taking ballet lessons at home with a group of friends.",
        "Speaking to Darcey Bussell and Angela Rippon, Camilla said that she starts her day 'with a bit of Silver Swans and a bit of Pilates'.She is also a fan of Strictly Come Dancing and has 'great natural rhythm'",
        "The Queen Consort has danced with judge Craig Revel-Horwood and former judge Len Goodman.Craig cheekily urged Camilla to 'show a little bit of hip action' as they danced a Cha Cha Cha in the hall of St Clement Danes Primary School in Central London.The notoriously stingy judge said: 'Considering she's never had a lesson in her life she had a great natural rhythm. Her sense of timing was excellent and her foot work was spot on. And she has the personality for it.'Pride and Prejudice is the book she can't stop reading",
        "Literacy has been a cornerstone of Camilla's royal work. In 2021, she set up The Reading Room as a platform for discovering new books which relaunched as charity 'The Queen's Reading Room' in 2023.The Queen Consort revealed that Pride and Prejudice by Jane Austen is the book she returns to over and over again.She has previously highlighted favourite books by authors including William Boyd, Charles Dickens, Susan Hill and Philip Pullman. She is a Wordle warrior",
        "Camilla reportedly loves playing Scrabble and Wordle.",
        "In an interview with British Vogue, she said that she compares her Wordle score with her granddaughter every day, adding that she loves that it 'tells you how brilliant you are'.She boasted that she had even got a score of two before.Camilla does not have pierced ears ",
        "Despite the Royal Family's vast array of glamorous jewellery, Camilla refuses to get her ears pierced and prefers clip-on earrings.Speaking to British Vogue about piercing her ears before her birthday last year, she said: 'No, I’m not going to give it to myself for a 75th birthday present.'[The grandchildren] will try to persuade me, but nothing’s going to pierce my ears.' Her engagement ring once belonged to the Queen MotherThe 30s art deco ring features a central five carat emerald cut diamond with diamond baguettes on each side.It was valued at £100,000 at the time of their engagement, today rising to the astonishing region of £200,000.She has her own retreat in Wiltshire",
        "Camilla bought Ray Mill House, in Reybridge near Lacock, for £850,000 in 1996 after her divorce from Andrew Parker Bowles.The six-bedroom country-pile is a place of refuge for the Queen Consort, with insiders previously saying she can enjoy a G&amp;T and walk around in her dressing gown at the property. ",
        "The Queen Consort makes her own honeyCamilla has a series of beehives at Ray Mill.She is passionate about protecting bees, previously saying they are 'vital to the natural world' and can be used to help provide a much-needed income for people living in some of the world's poorest countries.Camilla's honey is sold at Fortnum &amp; Mason to raise money for charity.Camilla is a keen gardenerQueen Camilla shares her love of gardening with her husband, King Charles.She told Homes and Gardens magazine how much she enjoys planting, weeding and being creative, saying: 'It's just one of the most relaxing things anyone can do. Go into the garden, get on with it.' She loves fish and chips",
        "In an interview with her son and food writer Tom Parker Bowles for You magazine, Queen Consort Camilla said that fish and chips wrapped in paper is one of her favourite foods.'That smell,' she said. 'You cannot beat proper fish and chips.'She used to smoke 10 cigarettes a dayCamilla is reported to have given up smoking in 2001.'It wasn't so much me giving up smoking, rather smoking giving up on me,' she told a friend.She's not bothered about being tidyOne source previously told Express columnist Adam Helliker: 'Charles is so fussy about tidiness, while she leaves her stuff all over the place. She doesn't need her cushions plumped all the time.'",
        "Another friend said: 'Camilla's bedroom always looked like a bomb had hit it and you should have seen the state of the bathroom after she'd been in it.'She was Gyles Brandreth's 'secret crush' ",
        "The author and former Conservative MP gave away that he had a 'secret crush' on Camilla while appearing on an episode of BBC Radio 4's Just a Minute.He later recalled the episode on Lorraine, saying that when he was 16 years old, he saw a 'rather attractive girl' in the garden of Camilla's grandparent's house, Hall Place.'This actually was a girl called Camilla Shand,' Gyles explained.She was appointed to the Order of the Garter ",
        "Camilla was made a Royal Lady of the Most Noble Order of the Garter by the late Queen in 2021.The Order of the Garter is a 700-year-old order of knighthood founded by Edward III in 1348, and recognises contributions of great public service from those honoured. She did not use the title Princess of WalesWhile her husband was the Prince of Wales when they married in 2005, Camilla opted not to use the title Princess of Wales.She was instead known as the Duchess of Cornwall out of respect for Diana, Charles' late wife, who was associated with the title Princess of Wales.She is scared of flying",
        "Camilla has publicly acknowledged her fear of flying, but doesn't let it stop her from jetting across the world.She is said to have once sat terrified on the steps of a tiny private jet during an overseas visit, refusing to get in.On board, she can often be seen squeezing her husband’s King Charles's hand as an aircraft is taking off.She was suffering from sinusitis on her wedding day",
        "According to Vanity Fair, Camilla was suffering from sinusitis on the day of her wedding.Lucia Santa Cruz, the woman who introduced Charles and Camilla to each other, said: 'She literally couldn’t get out of bed.'She loves horse racingCamilla is said to have a greater enthusiasm for the sport than her husband, who was previously an amateur jockey.John Warren, the late Queen’s Royal bloodstock and racing advisor, previously said that Camilla is 'absolutely besotted by racing'.The Queen was once fired from a job for being lateAlong with other debutantes, Camilla opted to work for interior décor firm, Colefax and Fowler, in Mayfair in the mid-1960s.But she was fired from her job for turning up late after a night on the tiles, it has been reported.She is addicted to The Archers",
        "Camilla has previously confessed her love for the Radio 4 soap opera, saying she is an 'Archers addict'.She hosted a celebration to mark the show's 70th anniversary in 2021, watching the voice actors perform a scene and cutting an Archers themed cake.She takes her own supply of red wine when she travels abroad",
        "Both the King and Queen have been known to travel with their own supply of alcohol.While Charles is said to carry the ingredients for a martini on his travels, Camilla prefers her own supply of red wine, typically sourced from the Pomerol appellation of Bordeaux. She frequently visits a holistic health retreat in IndiaCamilla has visited the SOUKYA holistic health retreat in Bangalore at least seven times since 2010.She was joined at the resort by Charles in 2019 to celebrate his 71st birthday, when they both are said to have dined on the retreat's vegetarian food and practiced yoga. "
    ]
}