{
    "articleURL": "/sport/mlb/article-12054517/Carlos-Rodon-set-receive-shot-CHRONIC-issues.html",
    "content": [
        "Carlos Rodon has yet to make his Yankees debut after signing as a free agentAnd while his forearm is feeling better, he's now dealing with back issues DailyMail.com provides all the latest international sports newsCarlos Rodon has been told his back issues are 'chronic' by doctors as the Yankees ace is set to receive a shot to reduce the pain.",
        "Rodon was first sidelined in March with a forearm muscle strain in spring training, but the pitcher has yet to debut for his new team after arriving from the Giants in free agency.While the ace has told reporters his forearm feels good, the lefty's back has been bothering him since at least last month, with doctors telling the ace his issues with that part of his body are 'chronic.'Yankees manager Aaron Bone told reporters Friday that Rodon will receive a shot early next week.'It really sucks,' Rodon said Friday, per the NY Post.",
        "'I want to be pitching for the New York Yankees. I want to be pitching in this series and with the boys. I want to be competing. It's hard to sit here and not be doing it and talking to [reporters].'While the Yankees have yet to provide any sort of timetable for Rodon's return, the Post marked late June as a possibility.The pitcher, who tossed a 2.88 ERA last season with San Francisco, told reporters he isn't feeling pain in his back, but rather feels as its restricted and affecting his velocity.He hasn't thrown the last two days, the Post said. 'Whenever my body tells me I can throw and everyone comes to the agreeance I can throw, I'll start throwing,' Rodon said. ",
        "'Whatever that ramp-up takes, that's what we get to. … I can't set a date for you. I would have thought I'd be pitching here for the club now.''I'd throw a fastball and it would cut 2 feet or I'd throw a sinker — and I don't throw sinkers,' Rodon said. 'The release height, things are just not normal because I guess my body's not letting me get to the positions I normally get to.'Rodon joined the Yankees on a six-year, $162million contract this offseason."
    ]
}