{
    "articleURL": "/wires/reuters/article-12049861/NEWSMAKER-Veteran-soldier-leads-Sudans-army-against-rival-general.html",
    "content": [
        "Burhan rose through ranks during South Sudan, Darfur wars",
        "Ousted strongman Bashir in 2019, staged coup in 2021Shared power with rival Hemedti before war began'No option but the military solution'By Khalid AbdelazizKHARTOUM, May 5 (Reuters) - General Abdel Fattah al-Burhan pledged to take Sudan to civilian rule, but after going to war last month with his former partner in a military coup, that looks a distant promise.As his warplanes rain strikes on the capital and his troops battle the paramilitary Rapid Support Forces of rival general Mohamed Hamdan Dagalo, known as Hemedti, Burhan has shown no inclination to compromise.\"There is no other option but the military solution,\" he said five days into fighting that he was believed to be initially directing from a presidential guesthouse near the airport.The war comes after Burhan had already turned Sudan's fortunes upside down twice by removing veteran autocrat Omar al-Bashir during a popular uprising in 2019 and then by halting a democratic transition in 2021 by ousting a civilian government.A career soldier in his 60s who served Bashir loyally for decades, Burhan rose through the ranks in wars in South Sudan and Sudan's Darfur region. Few expected he would one day rule as head of a \"Sovereign Council\" established after Bashir fell.Hemedti, whose powerful RSF had operated alongside the army during the war in Darfur, stepped in as Burhan's deputy on the council. Despite occasional tensions, they presented a united front and in 2021 dissolved government in a coup.",
        "Their relationship, never close, fell apart as they jostled for an upper hand, squabbling over the terms of a promised transition to democracy and the RSF's merger into the regular armed forces, which Burhan wanted to accelerate.With ties worsening before clashes broke out on April 15, Burhan was already making preparations for war as his air force scoped out bombing targets, military sources have said.No reconciliation seems possible.\"We will get to you and hand you over to justice, or you die just like any other dog,\" Hemedti said of Burhan the day fighting began.NO DISSENTThe 2021 military takeover made Burhan the latest in a long line of coup leaders to rule Sudan for most of its history since independence from Britain in 1956.As he headed the ruling council with Hemedti as his deputy, Burhan was still vowing to hand over power, telling Reuters civilian rule was the \"natural situation\" and repeating a commitment as recently as February to hold elections this year.But pro-democracy activists were always sceptical. They accuse him and other military leaders of killing protesters and say his coup was aimed at prolonging army rule, charges he denies.In July 2022 he removed the five civilian members of the Sovereign Council, saying the army would not participate in internationally led efforts for a dialogue with them on the way forward.",
        "Those who have met Burhan describe him as terse and quick-tempered. His language betrays a vehement aversion to criticism. In April 2022 he threatened to expel the U.N. envoy, who had recently commented on the country's political turmoil, accusing him of \"lying, blatant lying\" and saying \"we will kick you out\".After Bashir loyalists had staged a protest in November 2022 he said in a speech at an army base: \"We'll cut out the tongue of anyone who speaks against the military\".SERVICE IN DARFURBorn in 1960 in a village north of Khartoum neighbouring Bashir's home village, Burhan studied at a Sudanese army college, then in Jordan and at Egypt's military academy.Analysts say his attitudes to governing were shaped by his 41 years of army service. For much of that time, Sudan was a pariah to the West and on a U.S. terrorism list under Bashir, who hosted Osama bin Laden in the 1990s and is wanted by the International Criminal Court (ICC) for alleged war crimes.During a war against rebels in Darfur, Burhan held the rank of brigadier general and worked in a district that saw fierce fighting, getting to know Hemedti.In a grim precursor to their new conflict against each other, the army and RSF are accused of grotesque war crimes including massacres and rapes during the Darfur war.",
        "When Bashir was overthrown in 2019, Burhan was only the fourth most senior figure in the military and holding an administrative position, yet he was among the generals who went to confront him, he has said.\"I told him the leadership of the armed forces had decided the situation was getting out of hand and therefore he should step down,\" he told the BBC.During Bashir's last year in power, Burhan began to develop ties with foreign states that could be important as the conflict develops. He was at the forefront of tentative moves to normalise ties with Israel, a move applauded by Gulf states.And in March 2021, he received Egyptian President Abdel Fattah al-Sisi in Khartoum, solidifying a relationship with Cairo that remains his strongest outside alliance. (Writing by William Maclean and Angus McDowall; Editing by Andrew Cawthorne)"
    ]
}