{
    "articleURL": "/sport/football/article-12044499/Snaffling-Barcelonas-transfer-guru-Mateu-Alemany-sign-Aston-Villas-intent.html",
    "content": [
        "Mateu Alemany is set to arrive at Aston Villa to work alongside Unai EmeryTransfer guru will come from Barcelona - a signal of Aston Villa's lofty ambitionHe had been courted by Newcastle when the Saudi-backed takeover beganIf there were any doubts about Aston Villa’s ambition to rejoin English football’s elite, their pursuit of Mateu Alemany should dispel them.",
        "For the club seventh in the Premier League to target and tempt one of the key decision-makers at Barcelona shows the financial strength of both the league and Villa themselves. Alemany would land a big pay rise by moving to the Midlands.When Unai Emery was hired to replace Steven Gerrard last November, co-owner Nassef Sawiris gave the Spaniard a blank canvas to shape first-team affairs as he saw fit. If confirmed as expected, the arrival of Alemany would be a significant step in that direction.After the Saudi-backed Public Investment Fund’s bid to take control of Newcastle initially fell through in summer 2020, Emery’s close ally and personal assistant at Villa, Damia Vidagany, told Spanish publication Marca that the consortium had wanted to give Alemany the keys to the castle. ‘He was the person they had chosen to take the club forward,’ Vidagany said. ‘He has always been clear he wanted a sporting project.’ When the Saudi-backed group did complete their takeover, Emery was their first choice, only for Eddie Howe to take the job when Emery chose to stay at Villarreal. ",
        "Emery, Vidagany and Alemany all spent time at Valencia and if they link up at Villa, it may give a sense of how Newcastle would have looked if the cards had fallen differently.",
        "The really interesting question is this: What will Alemany’s precise brief be at Villa? He was director of football at Barca and is expected to have a similar title, but such labels are often deliberately vague. ‘His position was more like Ed Woodward’s than Monchi’s,’ said one La Liga source, referring to Manchester United’s former executive chairman and the Sevilla director of football, whose transfer expertise is admired throughout the game. While Monchi focuses largely on football, Woodward’s commitments at United extended across the business.Villa already have a sporting director, Johan Lange, who has been at the club since summer 2020. Though there have been bumps in the road, Lange has done a fine job at Villa. He played an important role in the signings of Emiliano Martinez, Ollie Watkins and Boubacar Kamara – to name three. Kamara’s free-transfer signing was a hugely smart piece of business while the value of Martinez and Watkins has grown since their moves.Lange established a data-driven scouting and recruitment model and improved the way the squad’s needs are catered for away from the game. Villa have also had 10 players on loan in the EFL this season, gaining experience and increasing in value. Lange has always been well-regarded by Sawiris and co-owner Wes Edens and it remains to be seen how Alemany’s arrival would influence his role.",
        "Alemany was president and chief executive at Mallorca but enhanced his reputation at both Valencia, where he worked from 2017-19, and Barcelona.During Alemany’s time, Valencia twice finished in the top four and won the Copa del Rey, while at Barca he is given great credit for building the squad under significant financial constraints. They are virtually certain to win the league title this season.With recent scouting appointment Alberto Benito operating in Spain, Villa are likely to train their sights on La Liga this summer as they seek a forward, a wide man and a dynamic midfielder, with a right-back also a possibility.",
        "Yet Villa fans should be wary of assuming Alemany’s appointment will ensure they take a decisive leap forward. At 60, this will be his first experience of working in English football.Though his network of contacts among agents and sporting directors across the European game is outstanding, this does not always translate to success – as Tottenham discovered when Franco Baldini was in charge of transfers from 2013-15.Emery has done superb work this term, turning Villa from relegation candidates into Europa League contenders and deserves to have his judgement backed.Yet if Emery has been able to thrive this season, it is because the structure around him is solid. Alemany can enhance it - but overhauling it to accommodate him would seem an unnecessary risk."
    ]
}