{
    "articleURL": "/femail/real-life/article-12057917/Expectation-vs-reality-Woman-stunned-receiving-300-cake-looked-like-order.html",
    "content": [
        "A woman ordered a $450AUD four-tier chocolate cakeBut she was shocked by what she received from the baker A woman has left millions in hysterics after revealing the 'hot mess' of a cake that cost her $450.",
        "Libby was excited after she placed an expensive order with a high-rated baker in her area.She expected to receive a four-tier chocolate cake smothered in chocolate ganache and finished with ribbons of chocolate.But the reality of what she received reduced her to tears.The baker dropped off a cake that was haphazardly covered in uneven chocolate icing and crumbling by the minute - with many comparing the sight to human faeces.",
        "Libby, who is from the US, was too shocked to push back against the grotesque cake, and instead just accepted it before sharing her story on TikTok.'I need advice,' she said in a video. 'I paid $US300 for this and the lady just dropped it off - what do I actually do?'The woman shared photos of the inspiration she sent the baker and what she received in return.The actual cake was structurally unsound and had several extra layers that were stacked awkwardly.It was also covered in rainbow sprinkles - a detail Libby never asked for.Thousands were similarly horrified by the 'awful' cake.'It looks like she literally dropped this cake on the floor,' a woman said. 'This has to be some form of a hate crime.''This would make me bawl my kidneys out - why are there sprinkles?!' added another.",
        "A third joked: 'I'd be in jail within the hour.' 'I don't know a nice way to say this, but it literally looks like she took a dump and added sprinkles on top,' a man said. Some offered helpful advice.'Call your non-emergency line and ask how you can get a refund,' one woman wrote.'Drive back to her house and demand she fix it or give you your money back,' advised another.'You need to write a Google review to warn other people about her,' said a third."
    ]
}