{
    "articleURL": "/wires/reuters/article-12044875/Taiwan-says-F-16-deliveries-delayed-working-minimize-damage.html",
    "content": [
        "TAIPEI, May 4 (Reuters) - Taiwan Defence Minister Chiu Kuo-cheng said on Thursday that the delivery of 66 advanced new F-16Vs from the United States has been delayed due to supply chain disruptions and the ministry was working to minimize the damage and \"make up deficiencies.\"",
        "The United States in 2019 approved an $8 billion sale of Lockheed Martin Corp F-16 fighter jets to Taiwan, a deal that would take the island's F-16 fleet to more than 200 jets, the largest in Asia, to strengthen its defenses in the face of a stepped up threat from China, which claims Taiwan as its own.Taiwan has been converting 141 F-16A/B jets into the F-16V type and has in addition ordered 66 new F-16Vs, which have new avionics, weapons and radar systems to better face down the Chinese air force, including its J-20 stealth fighter.The first of the new F-16Vs was meant to be delivered in the fourth quarter of this year but that has been delayed to the third quarter of next year due to pandemic-related supply chain disruptions, the ministry said.Speaking to reporters at parliament, Chiu said Taiwan had asked the United States to \"make up the deficiency,\" including prioritizing spare part deliveries for the existing fleet.\"Multiple channels are being used, and we are minimizing the damage from this,\" he said, adding they still expected to get the full order delivered before 2026.The ministry is using diplomatic channels, such as via the de facto U.S. embassy in Taipei, to resolve the problem, Chiu said.",
        "Neither the de facto embassy, the American Institute in Taiwan, nor Lockheed Martin immediately responded to a request for comment.Taiwan has since last year complained of delays to U.S. weapons deliveries, such as Stinger anti-aircraft missiles, as manufacturers turn supplies to Ukraine as it battles invading Russian forces, and the issue has concerned U.S. lawmakers.Michael McCaul, chairman of the U.S. House Foreign Affairs Committee, said during a visit to Taipei last month he was doing everything possible to speed up arms deliveries. (Reporting by Ben Blanchard; Editing by Robert Birsel)"
    ]
}