{
    "articleURL": "/money/markets/article-12050355/Housebuilding-declines-fastest-pace-2020s-lockdown.html",
    "content": [
        "UK construction sector as whole continued to expand last monthThere were rising volumes of commercial work and civil engineering projects But housebuilding declined at fastest pace in almost three yearsHousebuilding has suffered its steepest decline since May 2020 when the country was in lockdown, as high mortgage rates hit demand, according to a closely watched survey.",
        "The S&amp;P Global/CIPS UK Purchasing Managers' Index for the construction industry came in at 51.1 in April, up from 50.7 in March, indicating that the sector as a whole continued to expand last month.However, it said growth was 'worryingly lopsided', as it was only possible thanks to rising volumes of commercial work and civil engineering projects that helped offset the slump in housebuilding.",
        "The UK's major housebuilding firms have revealed a subdued outlook in their most recent results, with some suggesting that they will cut back the number of new properties they develop.It comes as household budgets continue to be squeezed, and mortgage rates remain high following rising interest rates and the fallout from last year's mini-Budget. However, there have been some signs of a slight recovery in recent weeks, with Bank of England data published yesterday showing a 'significant' rise in the number of mortgage approvals.Some 52,000 mortgages were approved in March, up from 44,100 in February, but still below the monthly average for 2022 of 62,700.House prices have also reversed seven months of falls, rising by 0.5 per cent in April, according to Nationwide building society.Tim Moore, economics director at S&amp;P Global Market Intelligence, said that while these are signs of a recent stabilisation in market conditions, it has yet to feed through to construction activity.",
        "'Extended delays on new housing starts were reported again in April, due to a considerable headwind from elevated mortgage rates and weak demand,' he added.",
        "Dr John Glen, chief economist at the Chartered Institute of Procurement &amp; Supply  said: 'The sharp decline in UK house building in April will be a cause for concern, as it becomes clear that the recent interest rate rises will continue to hamper consumer demand for some time to come. 'With a further rate rise expected next week there will be concerns that things will get worse before they get better for UK housebuilders.'The Bank of England looks set to raise rates next week, from 4.25 per cent to 4.5 per cent - which could mean further rises in mortgage rates, and in turn could hit demand for homes further.Kelly Boorman, partner and national head of Construction at RSM UK, said: 'The sharp fall in housebuilding activity underscores the tough economic challenges that remain as the squeeze from the cost-of-living and higher mortgage rates are still biting.' On a positive note, construction firms said supply chain pressures eased significantly, with fewer delays and materials more readily available, which also helped to alleviate cost pressures on the sector. Input price inflation was at its softest since November 2020, although higher energy bills and prices for some construction products continued to push up costs, according to the survey.",
        "Overall new orders growth was the second-fastest since July 2022 and employment rose modestly. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}