{
    "articleURL": "/wires/reuters/article-12038771/Revlon-emerges-bankruptcy-lender-takeover.html",
    "content": [
        "By Dietrich Knauth",
        "May 2 (Reuters) - Revlon Inc said Tuesday that it has emerged from bankruptcy after cutting more than $2.7 billion in debt and handing control of the beauty products company to its lenders.CEO Debra Perelman said in a statement that Revlon is stronger after bankruptcy and well positioned for long-term growth.\"We look forward to unlocking the full potential of our globally recognized brands and continuing to offer our customers the iconic products they have loved for decades,\" Perelman said.Revlon, which has a 91-year history selling lipstick, nail polish and other beauty products, filed for bankruptcy in June, saying its $3.5 billion debt load and pandemic-related disruptions had left it too cash-poor to make timely payments to critical vendors in its cosmetics supply chain.Revlon has filled its post-bankruptcy board of directors with experiences executives from the consumer, retail, and beauty industries, including former Bloomin' Brands CEO Elizabeth Smith and former Sephora CEO Martin Brok.Revlon's lenders took ownership of the company in exchange for the debt reduction agreement, wiping out the equity value of existing shareholders.The company's largest shareholder was MacAndrews &amp;amp; Forbes, which is owned by Perelman's father Ron Perelman. MacAndrew &amp;amp; Forbes held 85% of the company's shares at the time of its bankruptcy filing, and the remaining stock saw a surge in interest from retail investors last year before collapsing in value.",
        "Revlon's new owners include Glendon Capital Management, King Street Capital Management, Angelo Gordon &amp;amp; Co, and Oak Hill Advisors.King Street Capital Managing Director Noah Charney said the new owners were proud to \"serve as stewards\" of a \"storied American business.\"Revlon exits from bankruptcy with $1.5 billion in debt and$236 million in available liquidity, according to the company.Revlon reported $490 million in net sales for the first quarter, up year on year from $479.6 million. (Reporting by Dietrich Knauth in New York and Nandhini Srinivasan in Bengaluru Editing by Marguerita Choy)"
    ]
}