{
    "articleURL": "/tvshowbiz/article-12047941/Jodie-Comer-stuns-white-suit-Tony-Awards-press-event-New-York.html",
    "content": [
        "Jodie Comer stunned in a white suit as she attended the nominees' event for the Tony Awards in New York on Thursday. ",
        "The Killing Eve actress, 30, is up for a gong in the category Best Leading Actress Of A Play for the one-woman theatre spectacle Prima Facie, which debuted at the Harold Pinter Theatre in London. She looked radiant in all-white as she attended the event at the Sofitel Hotel ahead of the awards on June 12.The elegant ensemble consisted of a white waistcoat, blazer and tailored trousers which flared out towards her feet in a chic appearance.  Jodie chose to wear her blazer draped over her shoulders for a stylish effect and to expose the outline of her incredible figure. ",
        "Her blonde tresses were neatly styled in a shoulder-length cut, while she opted for a rosy lipstick shade and bold black eyeliner. A dewy make-up palette applied to her porcelain complexion made her skin glow as she raked in praise for her acting.  Jodie stars as a barrister called Tessa in the play, which transferred to New York in April after critical acclaim and saw her make her Broadway debut.In the show, Tessa defends men charged with rape and then finds herself in the witness box after being assaulted.Jodie is up against Jessica Chastain in A Doll's House, Jessica Hecht in Summer, 1976 and Audra McDonald in Ohio State Murders in her category - ahead of the awards ceremony on June 12. ",
        "The actress previously won Best Actress at the Olivier Awards for her role in the West End show which is now running at the John Golden Theatre in New York until July. It comes after Jodie made her Met Gala debut at the Metropolitan Museum of Art in New York City on Sunday evening.The Mad Fat Diary actress was in the city for her Broadway debut and looked sensational as she took to the red carpet in a blue feathered Burberry gown. ",
        "Jodie's stylish frock boasted a voluminous skirt as well as an asymmetrical neckline and it's colourful adornment ensured all eyes were on her. The stunner oozed confidence at the star-studded gala and sported a radiant make-up palette complete with pillar box red lip.She styled her blonde tresses into loose waves and completed the ensemble with a pair of chandelier diamond earrings and blue bracelets. "
    ]
}