{
    "articleURL": "/sport/othersports/article-12059379/NASCAR-Ross-Chastain-punches-Noah-Gragson-tensions-boil-Kansas-Speedway.html",
    "content": [
        "The pair squared up after Chastain was pinned to the wall with 60 laps to go Chastain's drawn the ire of many drivers this season with his aggressive styleDailyMail.com provides all the latest international sports news NASCAR drivers Ross Chastain and Noah Gragson had a post-race bust-up at Kansas Speedway on Sunday after Denny Hamlin pipped Kyle Larson for first place to claim the $7.5million prize pool.",
        "Chastain, who has drawn the ire of many drivers this season with his aggressiveness on the track, pinned Gragson to the wall with about 60 laps to go, sending him for a spin, though the latter didn't expect the Trackhouse Racing driver to make his displeasure known afterwards.Gragson put his hands on Chastain, who responded with a sweeping right hook that appeared to connect. Gragson tried to return the punch, but he was pulled away by security and NASCAR officials.'I'm sick and tired of it,' Gragson said of Chastain's driving style. 'The guy runs into everyone. When you have guys like Chase Elliott and other guys telling you to beat his a**, everyone is just sick of him.'Chastain accepted some of the blame for the spin but didn't have much to say about the punch.",
        "'I got tight off four for sure,' Chastain said. 'Noah and I have a very similar attitude on the race track. We train together, we prepare together, we know every little bit about each other. I definitely crowded him out of four.''A very big man once told me we have a 'no push policy' here at Trackhouse,' he added. By the end of Sunday's race - the 15th since the start of the new NASCAR season in February - Chastain finished in fifth, while Gragson finished 29th. ",
        "Hamlin's victory ended a 33-race winless drought for the Joe Gibbs Racing driver, dating to last year's Coca-Cola 600. And along with claiming his record fourth win at Kansas, the 42-year-old gave his team its 400th win overall in NASCAR's top series.Larson, was leading in the closing laps on the hottest race day of the season - 89 degrees - but Hamlin got the better of him by spending just about 30 laps stalking his rival. He pulled alongside Larson on the final circuit, making slight contact with the Hendricks motorsport drive before sending him bumping into the outside wall and giving himself a clear path to the finish line.",
        "'I was sideways. He was sideways. I knew it was going to be close whether he could clear me,' Hamlin said. 'I was grinding his left side, trying to keep the side-draft as much as I could. It's such a super-sensitive part and I hooked him at the end.'Hamlin added that he planned to speak with Larson about the finish at some point.'I was really loose,' Larson said. 'He was able to finally get my inside off two. It seemed he was side-drafting me aggressively. I don´t know if he finally got me turned sideways, but turned me into the outside wall and he got the win.'",
        "Next up is the 'Throwback Weekend' at Darlington in South Carolina on May 14, and it's increasingly become a family affair. Elliott's No. 9 car for Hendrick Motorsports will look like his father Bill Elliott's car from 2003; Ryan Blaney's No. 12 will pay homage to father Dave Blaney's old sprint car; and the No. 21 of Harrison Burton will look like father Jeff Burton's old paint scheme. "
    ]
}