{
    "articleURL": "/wires/pa/article-12038721/FA-charges-Liverpool-boss-Jurgen-Klopp-following-comments-win-Spurs.html",
    "content": [
        "Liverpool manager Jurgen Klopp’s insistence he did not intentionally call referee Paul Tierney’s integrity into question has not prevented the Football Association charging him with improper conduct.",
        "While blaming the emotion of a last-gasp 4-3 win over Tottenham, having been 3-0 up, can in no way excuse the Reds boss for charging down the touchline to celebrate wildly in front of fourth official John Brooks or his suggestions Tierney “had history” with the club, Klopp said he never meant to cast aspersions.Tierney actually appears to have done Klopp a favour by not sending him off as the German claimed the referee had told him his actions on the touchline were worthy of a red card but he chose to issue a yellow on the advice of Brooks.",
        "It was that red card suggestion which led Klopp to say what Tierney said to him was “not OK”, with the 55-year-old German insisting he has not lied about the interaction after the Professional Game Match Officials Limited (PGMOL) rejected Tierney’s actions were “improper” and insisted a review of the recording proves Tierney behaved in a “professional manner”.But it was Klopp’s comments that the referee was acting against Liverpool based on past experiences which has landed him with a misconduct charge and facing an extended touchline ban.The FA’s statement said “they imply bias, and/or question the integrity of the referee, and/or are personal/offensive, and/or bring the game into disrepute”.",
        "“I probably have to expect the punishment,” said Klopp, speaking before he learned of the charge, who has until Friday to respond.“I think the refs think I questioned the integrity (of their colleague), which when I am calm and sitting here I don’t do, but in that moment I just describe my feelings.“I am very sure he is not doing it intentionally but we have a history and I cannot deny that.“Of course they didn’t happen intentionally but they are still there and it’s a feeling and nothing else.“I know the refs were really angry about what I said and now go for it. I heard I was lying.“I did a lot of things that day but I didn’t lie. I shouldn’t have said a couple of things but lying was not one of them.”",
        "Klopp served a one-game suspension in November after the FA successfully appealed against an independent regulatory commission decision to only fine him £30,000 in regards to his behaviour in confronting assistant referee Gary Beswick and subsequently being sent of by referee Anthony Taylor.He said he regretted allowing his emotions to get the better of him again.“We won a football game 4-3 in a very spectacular manner and the only headlines are the ones I created and I really regret that,” he said. “It is absolutely not necessary and not how it should be.",
        "“The whole situation shouldn’t have happened at all. It was out of emotion, it was out of anger in that moment. That’s why I celebrated the way I celebrated. I understand I opened the box. It was not intentional but I opened it  Jurgen Klopp  “Paul Tierney came over to me and I didn’t expect at all a red card. I know I had a red card not too long ago but I didn’t expect for a second a red card because I didn’t feel it was right.“He (Tierney) said to me ‘For me it’s a red card but because of him’ – that’s what I understood because it was loud in the stadium – ‘but because of him (Brooks) it’s yellow’. Showed me a yellow and smiled to my face. That’s it.“The final whistle we go inside and I try to calm down and it didn’t work out properly and I said what I said.“I said ‘What he said to me was not OK’ and I thought it was not OK because it was not a red card in my view.“I understand I opened the box. It was not intentional but I opened it.”Liverpool face Fulham on Wednesday looking for a fourth successive victory to maintain their unlikely pursuit of Champions League football.",
        "There will inevitably be increased scrutiny on the manager but he said: “If there is one good thing, I prefer I am in that situation than any player.“We will see but I can’t see it will have an influence on the team.”"
    ]
}