{
    "articleURL": "/tvshowbiz/article-12040897/Makeup-free-Lila-Moss-enjoys-low-key-stroll-NYC.html",
    "content": [
        "Lila Moss enjoyed a low-key stroll in NYC with pals on Tuesday a day after her glamorous appearance at the Met Gala.",
        "The model, 20, went makeup free for the casual outing where she wore a navy jumper and light blue denim jeans. She completed the look with a brown leather jacket and chunky black boots while accessorising with a gold necklace. Lila was seen enjoying a green energy juice while sitting on a bench with her friends. The beauty wore her blonde tresses in loose waves over her shoulders and opted for a no makeup look. ",
        "The night before she stunned in a quirky fluffy frock that featured a sheer panel to showcase her tiny waist as she posed on the red carpet with famous mum Kate, 49.The ensemble featured a voluminous skirt and plunging top, the blonde beauty wore her locks slicked back and accessorised with statement earrings. Lila was joined by her mother Kate at the event held at New York's Metropolitan Museum of Art on Sunday evening.The supermodel oozed sophistication in a pink lingerie inspired gown, which hugged every inch of her svelte figure.The satin frock boasted a plunging neckline and lace trim which the catwalk queen teamed with a flowing sheer cape.Kate, who shares her daughter with ex Jefferson Hack, accentuated her features with a radiant palette of make-up and lashings of mascara by Charlotte Tilbury while opting to wear her blonde hair loose. ",
        "She completed the look with a diamond necklace and matching bracelet, while adding height to her frame with heels. The biggest night in fashion took place on Monday night with a slew of the industry's most notable stars walking the red carpet to showcase their glamorous and daring looks.",
        "The 2023 Met Gala returned to the Metropolitan Museum of Art in New York City, with everyone from Kim Kardashian to Paris Hilton attending the fundraising event.Since 1948, stars have ascended the majestic staircase into a very exclusive party where no selfies are allowed.In keeping with tradition, the event was held on the first Monday of May and the annual extravaganza kicked off at 6:30PM EST on May 1.The ball's theme was Karl Lagerfeld: A Line of Beauty. The late German designer was Chanel's long-time creative director. He passed at age 85 in 2019.His beloved cat, Choupette, was even invited to the festivities. The decision to honor Karl sparked controversy given the many offensive remarks he has made over the years, from slamming the #MeToo movement to opposing same-sex marriage.'I'm against it for a very simple reason: In the 60s they all said we had the right to the difference. And now, suddenly, they want a bourgeois life,' he told Vice of same-sex marriage. ",
        "'It's difficult to imagine—one of the papas at work and the other at home with the baby. How would that be for the baby? I don't know. I see more lesbians married with babies than I see boys married with babies. And I also believe more in the relationship between mother and child than in that between father and child.' While he ultimately showed his support for same-sex marriage at his spring 2013 Chanel haute couture show, he still said he was 'less keen' on same-sex couples adopting children, according to AP.Along with the Vogue editor-in-chief, Anna Wintour, who runs and hosts the annual event, the 2023 MET Gala was co-hosted by Penelope Cruz, Dua Lipa, Michaela Coel and also Roger Federer.While the show may be known for its glitzy and over-the-top red carpet - with details of what occurs inside often remaining mysterious - at its heart, it is a fundraising event for the Metropolitan Museum of Art's Costume Institute.Last year, the 2022 MET Gala alone raised a grand total of $17.4 million, reported Billboard. This year the price of admission was raised from $30,000 to $50,000, according to Page Six. But even if you have the funds, that doesn't guarantee you entry into the party.Every guest has to be invited, and a waiting list exists for the coveted golden ticket.",
        "And status matters, according to The New York Times, meaning the hottest stars are a shoo in for an invite.Heiress Paris was among the biggest names to attend the event, in what marked her first ever Met Gala.However it didn't go off without a hitch, as her grand Met Gala entrance was blocked by angry climate change protestors who laid in front of her vehicle.But the small disruption didn't stop the billionaire from arriving on the red carpet and stunning an off-the-shoulder leather dress.The best dressed of the night included Met vet Kim, who wowed in an incredible pearl dress, as she seemingly revisiting her Playboy look from 2007 by accident.Kim wore custom Schiaparelli, covered in 50,000 pearls that were hand-strung and draped onto her body.The mother of four revealed that she wanted pearls because 'what is more Karl' than 'iconic Chanel pearls,' she said during her interview on Vogue.com's livestream.",
        "Pregnant Rihanna, Gisele and Emily Ratajkowski also honored Karl in their statement gowns as they brought their A-game to the red carpet.Meanwhile, Blake Lively, a frequent attendee, announced she would not be attending the party this year. 'I will be watching,' she said, according to People.As for Wintour's role in the bash, Vogue's editor-in-chief organizes the party and oversees the guest list and even the menu. ",
        "She has served as the Met Gala's chairwoman since 1994 and continues to serve look after look at every event."
    ]
}