{
    "articleURL": "/tvshowbiz/article-12056061/Britney-Spears-conservatorship-drama-turned-Ryan-Murphy-docuseries.html",
    "content": [
        "Britney Spears' conservatorship drama could be turned into a tell-all docuseries, according to a new report.",
        "The singer, 41, was placed under the controversial court order in 2008 - which saw her father Jamie, 32, wield power over her finances and career decisions - before it was terminated after 13 years in November 2021.And now it's thought American Horror Story producer Ryan Murphy, 57, wants the pop star to tell her own story on the small screen, following the upcoming release of her bombshell memoir.Her conservatorship has been explored by the likes of Netflix, Hulu and the BBC, although the Toxic hitmaker hasn't been involved with any of the projects.Having brought Monica Lewinsky in as co-producer of Impeachment: American Crime Story, which dramatised her 1998 scandal with Bill Clinton, Ryan is allegedly hoping to get Britney on board as he 'hates being accused of exploiting victims'.",
        "A source told The U.S. Sun: 'Ryan is openly fascinated by the Britney saga and of course, he is one of the few filmmakers in Hollywood, maybe the only one, really, with a professional relationship with Britney.'He knows her, he knows her world and he knows why the story of her conservatorship resonated with so many people.'But Ryan hates being accused of exploiting victims and tragedies in his shows so this becomes an incredibly delicate matter, and not something he would even consider pushing forward without Britney's full co-sign.'",
        "The insider went on to claim he hasn't reached out to the superstar yet and is 'not going to push Britney into anything she isn't comfortable with'.Ryan previously worked with the former X Factor U.S judge on a Britney-themed episode of Glee in 2010, on which she appeared.MailOnline has contacted Ryan and Britney's representatives for comment. Last July, it was reported Britney had finally completed the long-awaited book that delves deep into her life, family and the years of her conservatorship.The announcement that her memoir was finished was cause for celebration among fans. However, an immense paper shortage is causing a major delay in publishing the tome, TMZ reported.",
        "Sources told the publication that there is no projected time for when the paper shortage will be fixed, which has caused an abrupt halt in rolling out a release date.Britney and her team had originally wanted to have the memoir available in January 2023.Sources confirmed to TMZ that Britney's revealing memoir will be published under Simon &amp; Schuster, one of the largest American publishers.The Baby One More Time singer signed a book deal earlier that year in February and received a $15 million advance.In an Instagram post that has since been deleted, the star expressed her excitement about having the chance to have her version of the story shared, according to USA Today.",
        "'Well I'm writing a book at the moment and it's actually healing and therapeutic... it's also hard bringing up past events in my life,' the Toxic hitmaker wrote.'I've never been able to express openly!!! I can only imagine that I do sound childish but I was extremely young with those events took place,' Britney concluded.The Gimme More songstress began to put pen to paper after her younger sister, Jamie Lynn Spears, published her own memoir, Things I Should Have Said.Britney grew upset about the contents and claims included in the book. According to Page Six, the singer's lawyer, Mathew Rosengart, wrote a cease-and-desist letter shortly after the memoir became available to the public.'Although Britney has not read and does not intend to read your book, she and millions of her fans were shocked to see how you have exploited her for monetary gain,' he had issued in his statement.At the end of the letter, the lawyer added, 'She will not tolerate it, nor should she.'"
    ]
}