{
    "articleURL": "/wires/reuters/article-12059291/US-STOCKS-Futures-edge-higher-key-inflation-data-awaited.html",
    "content": [
        "Regional lenders extend gains from Friday",
        "April CPI data awaited on WednesdayWarren Buffett's Berkshire Class B shares up after Q1 resultsFutures: Dow up 0.20%, S&amp;amp;P up 0.14%, Nasdaq flatBy Shreyashi SanyalMay 8 (Reuters) - U.S. stock index futures edged higher on Monday ahead of a key inflation reading during the week that will be scrutinized for whether the Federal Reserve's efforts to cool prices were taking hold, while shares of regional lenders extended gains.Regional bank shares stretched gains from a rebound on Friday, with PacWest Bancorp jumping 33% premarket after the company announced quarterly dividend. Peers Western Alliance Bancorp, Comerica Inc and Zions Bancorp rose between 3.5% and 8.6%.Shares of such banks tumbled for much of last week on worries tied to the collapse of First Republic Bank.U.S. stock indexes staged a late-week rally on Friday, with the Dow Jones Industrial Average posting its biggest one-day percentage gain since Jan. 6 after upbeat results from Apple Inc and U.S. jobs data highlighting a resilient labor market.At 6:37 a.m. ET, Dow e-minis were up 67 points, or 0.2%, S&amp;amp;P 500 e-minis were up 6 points, or 0.14%, and Nasdaq 100 e-minis were down 4.25 points, or 0.03%.Focus will be on the Labor Department's inflation data on Wednesday, which is expected to show the consumer price index (CPI) likely climbed 0.4% in April after gaining 0.1% in March, while excluding the volatile food and energy components, the CPI likely increased 0.4% last month.",
        "Data on producer prices, weekly jobless claims and on consumer sentiment are all lined up through the week.These data points will help investors not only gauge whether the Fed's aggressive tightening cycle - including its most recent 25 basis point hike last week - is working towards tamping down inflation but also if fears of stagflation are founded.\"Market expectation of cuts already in the summer are based on a too-optimistic forecast of a quick disinflation,\" Paolo Zanghieri senior economist at Generali Investments, wrote in a note. \"Anyway, inflation stabilizing at 3% would not be enough for the Fed to start easing rates.\"American Airlines Group Inc rose 3.0% after J.P. Morgan raised its rating on the company's stock to \"overweight\" from \"neutral\", while Southwest Airlines Co fell 1.1% as JPM downgraded its stock to \"neutral\" from \"overweight\".On earnings, Warren Buffett's Berkshire Hathaway Inc's Class B shares rose 1.5% after the company posting a $35.5 billion first-quarter profit, reflecting gains from stocks such as Apple.Dish Networklost 4.5% after the pay TV and wireless communications service provider reported first-quarter revenue below estimates.Tupperware Brands Corp tumbled 18.3% after the company said it had engaged investment bank Moelis &amp;amp; Co LLC to explore strategic alternatives. (Reporting by Shreyashi Sanyal and Shristi Achar in Bengaluru; Editing by Nivedita Bhattacharjee and Maju Samuel)"
    ]
}