{
    "articleURL": "/tvshowbiz/article-12050163/Karen-Gillan-forgot-couples-therapy-session-turns-bold-blue-makeup.html",
    "content": [
        "Karen Gillan admitted she completely forgot she had 'scheduled a couples therapy session' while filming Guardians of the Galaxy Vol. 3 - and turned up in full costume.",
        "The actress, 35, took to Instagram on Thursday to share a hilarious snap of herself in colourful face makeup while on a video chat with her husband, Nick Kocher, and their therapist.The Scottish star, who plays Nebula in the hit Marvel franchise, shared the snap to make her latest film hitting theatres today. She penned: 'In honour of Guardians of the Galaxy in theatres this Friday - here's a screenshot of the time I forgot I had scheduled a COUPLES THERAPY session on a day we were shooting.'Karen later gave more of an insight into the Zoom call screenshot while speaking to Entertainment Tonight.",
        "She said: 'I don't know if they were fully prepared for what they got when I logged on.'I was late to the session, and I had warned them, \"Oh, I'm late because I'm at work,\" so they had an inkling, but I don't think they realized I was going to be in full makeup.''The therapist couldn't stop laughing, actually. I felt bad for her.'Karen's Guardians co-stars quickly rushed to the comments and couldn't contain their laughter.Chris Pratt wrote: 'THIS IS THE BEST'. 'This needs to be in a movie,' wrote Zoe Saldaña.Pom Klementieff added: 'Hahahahahahahahahaha DEAD hahahahahaha'Gillan's 'Guardians' costars have since commented on the post.",
        "It comes after Karen shared stunning photos in February from her wedding to long-term partner Nick.The actress wed American comedian and actor Nick in a ceremony in Dunoon's Castle Toward in May 2022.Sharing photos from the day taken by photographer Holly Clark, Karen looked stunning in her white backless dress with a flowing train.The Doctor Who star wore her flame-haired locks in loose waves as she posed next to a four poster bed.Karen also shared a photo from earlier in the day as she wrapped up in a white dressing gown while getting her hair and makeup done.At the time of her wedding, Karen was spotted with Nick and guests outdoors at the venue with a drink in her hand as her partner lent her his blazer to fend off the cold.Nick was said to have arrived at the venue via speedboat as Karen chartered a yacht for family and friends.Throughout the afternoon, parties of family and friends - including Hollywood royalty Julia Roberts and Robert Downey Jr - came ashore at the harbour next to the castle from the Spirit of Fortitude luxury cruiser."
    ]
}