{
    "articleURL": "/wires/reuters/article-12040681/At-55-killed-heavy-rains-Rwanda-official.html",
    "content": [
        "Rain causes flooding and landslides",
        "Rescuers search for people trapped in homesSix dead in Uganda from mudslides(Updates with new death toll and quotes)By Philbert GirinemaKIGALI, May 3 (Reuters) -Flooding and landslides triggered by heavy rain have killed at least 129 people in Rwanda and six in Uganda, authorities said on Wednesday, as rescuers hunted survivors trapped in homes.In chaotic scenes after weeks of rain in the region, one video clip posted by the state-owned Rwanda Broadcasting Agency showed muddy water gushing down an inundated road and destroying houses. \"We woke up at 2 a.m and heard people screaming,\" Angelique Nibagwire, 47, said from Karongi district in western Rwanda where at least 16 people died.Another resident in the area, Nyandwi Emmanuel, said three relatives died after a house he was renting to them collapsed as they slept in the night.Alain Mukurarinda, Rwanda's deputy government spokesperson, said fatalities had risen to 129 by 3:30p.m. local time (01:30 GMT)\"Our main priority now is to reach every house that has been damaged to ensure we can rescue any person who may be trapped,\" said François Habitegeko, governor of Rwanda's Western Province.Some people were rescued and taken to hospital, he added.Habitegeko said the River Sebeya had burst its banks.",
        "\"The soil was already soaked from the previous days of rain, which caused landslides that closed roads,\" he said.In a statement, President Paul Kagame said his government was helping affected people, including with temporary relocations.In a mountainous area of neighbouring Uganda near the border with Rwanda, six people died overnight into Wednesday in the southwestern Kisoro district, the Uganda Red Cross said.Five were from one family, and emergency workers had begun excavations to retrieve the bodies, it added in a statement.Rwanda and Uganda have been experiencing heavy and sustained rains since late March. Landslides have been reported in other elevated areas of Uganda, like Kasese near the Rwenzori mountains, where deluges and floods destroyed homes and displaced hundreds. (Reporting by Philbert Girinema; Additional reporting by George Obulutsa in Nairobi, Elias Biryabarema in Kampala; Editing by Angus MacSwan and Andrew Cawthorne)"
    ]
}