{
    "articleURL": "/wires/reuters/article-12051953/Senators-urge-US-Postal-Service-delay-rural-worker-compensation-plan.html",
    "content": [
        "By David Shepardson",
        "WASHINGTON, May 5 (Reuters) - Six U.S. senators on Friday urged the U.S. Postal Service (USPS) to delay implementing a new compensation system that they said would cut pay for tens of thousands of rural postal delivery workers.The senators -- Democrats Ron Wyden, Elizabeth Warren, Sherrod Brown, Ed Markey and John Fetterman and independent Bernie Sanders -- in a letter to U.S. Postmaster General Louis DeJoy seen by Reuters said the automated Rural Route Evaluated Compensation System (RRECS) should not be used \"until the system´s serious flaws are rectified.\"USPS and a union representing workers agreed last month the system would not take effect until at least Saturday. The union and USPS in 2012 had agreed to create a new system to determine compensation for rural carriers.They also asked how USPS \"will reimburse rural carriers for lost earnings when the system makes an inaccurate determination about their routes\" and for detailed answers to questions.USPS, in response, said the compensation system for rural letter carriers is nationally negotiated and codified in their labor agreement and that changes were the result of an arbitration proceeding.USPS added it would respond to the senators' letter.The letter from the senators said the system \"will reduce the pay of 66% of carriers significantly, and for nearly 14,000 carriers, those cuts will exceed 8 hours of pay a week.\"",
        "The senators said rural letter carriers travel millions of miles daily providing essential services.\"We understand the need to update the rural letter carrier route evaluation system and ensure that rural carriers are compensated for labor that has gone unaccounted for under the current system,\" the senators wrote, \"but it is critical that USPS fixes the known issues with the system before implementation.\"The letter added that \"at a time when USPS is struggling to deliver mail to rural areas, due in part to an inability to recruit rural letter carriers, we fear that RRECS´ impact on working conditions and pay will further deteriorate a vital service to our rural communities.\" (Reporting by David Shepardson, editing by Deepa Babington)"
    ]
}