{
    "articleURL": "/wires/ap/article-12038665/2-fatal-stabbings-1-attempt-rattle-California-college-town.html",
    "content": [
        "DAVIS, Calif. (AP) - Residents of a Northern California university town are frightened and on edge after three people were stabbed within a week - two fatally - with the most recent attempt when a homeless woman reported being knifed several times through her tent.",
        "Davis Police Chief Darren Pytel said he could not say whether officials are searching for one or multiple suspects. He also said he could not recall any incidents like these in his four decades on the Davis police force and neither could officers who go back longer. Two of the victims were homeless and the third was a college student, he said.\"This is different and the attacks were particularly violent and brazen,\" Pytel said at a Tuesday press conference, adding that in the most recent two attacks, the \"suspect didn´t seem to care there were several witnesses\" who could identify him.Davis is a small city known for its laid-back vibe, bicycle-friendly infrastructure and the University of California, Davis. There are roughly 67,000 residents in the city in addition to more than 13,000 students who live on campus. The city is about 70 miles (112 kilometers) northeast of San Francisco and 15 miles (24 kilometers) west of Sacramento, California.\"People are scared,\" said Davis Mayor Will Arnold at Tuesday's news conference.Police issued a shelter-in-place order shortly after the stabbing of the woman was reported at 11:45 p.m. Monday. It was lifted hours later after police said they had not caught the suspect, who is described as a male with long curly hair, a thin build and carrying a brown backpack.",
        "Radhika Gawde, president of the Associated Students of the University of California, Davis, said students stayed up Monday night monitoring police scanner activity and sharing information on social media.\"I think I speak for the whole community here when I say we´re devastated by the loss of our peer,\" she said in a phone interview with The Associated Press. \"Our sense of safety has been completely shattered.\"As of Tuesday afternoon, more than 80% of 4,200 students who responded to a student government survey sent out in the morning said they don't even feel safe attending classes during the day, she said. Gawde and her housemates, who live near campus, won't go out alone and their parents have asked them to come home.The first death was reported Thursday before noon when officers found an unresponsive male in downtown's Central Park, hunched over a bench where he often sat or slept, Pytel said.The victim, David Henry Breaux, 50, was well known in the area for more than a decade as the \"Compassion Guy,\" said the mayor and city council members in a statement. Breaux often greeted people and asked for their views on compassion.The second stabbing occurred Saturday around 9:15 p.m. when a resident heard a disturbance and went outside to find a young man at Sycamore Park with multiple stab wounds. Authorities identified the victim as Karim Abou Najm, 20, a student at the university and a graduate of Davis High School.",
        "In Monday's stabbing, the suspect was spotted by several people at a homeless encampment before stabbing the woman several times through her tent, the police chief said. The woman, whom police have not identified, is hospitalized and in critical condition. She is in her 60s, said Davis Lt. Dan Beckwith.The description given of the suspect in Monday's stabbing was \"substantially similar\" to descriptions of the suspect from the second homicide, Pytel said.The Federal Bureau of Investigation is assisting the Davis Police Department, as are other law enforcement agencies.Pytel said he believes all the attacks occurred at night and urged residents to be vigilant of their surroundings and to look out for one another. He said the department is scouring through hundreds of tips and searching for DNA evidence."
    ]
}