{
    "articleURL": "/femail/article-12058655/Who-blind-pianist-13-left-new-King-Queen-speechless-performance.html",
    "content": [
        "Young musician Lucy Illingworth, 13, won Channel 4's The Piano earlier this yearRead more: 'Miracle' blind pianist began playing in hospital for cancer treatment Blind and autistic 13-year-old pianist Lucy Illingworth, from West Yorkshire, stole the hearts of the nation with her stunning performance at last night's Coronation concert in Windsor.",
        " Lucy's powerful rendition of Bach's Prelude in C Major amazed tens of thousands of spectators and left the newly crowned King and Queen speechless.The winner of Channel 4's The Piano brought the party atmosphere as she donned a colourful chiffon dress with sparkly leggings to perform alongside stars including Lionel Richie and Nicole Scherzinger.But her mesmerising performances since appearing on the series just months ago have left listeners in awe, with some calling her 'a miracle'. Speaking on The Piano, her mother said that she and her family were left in a 'cancer bubble' when the pianist was born, after she was diagnosed with cancerous tumours in her eyes which caused her to lose her sight.",
        "Candice recalled hospital staff trying to treat young Lucy 'pin her down' while administering treatment, while she 'cried, and she kicked, and she screamed'.She further explained that, as well as having no vision at all, Lucy has a chromosome 16 duplication (which Candice also carries), and is globally developmentally delayed, meaning she struggles with communication.But she revealed that, when her daughter was 'very little', she was given a 'tiny keyboard' which she took into hospital with her.'She played Twinkle, Twinkle Little Star perfectly on it,' Candice says, adding she caught the attention of a nurse who initially thought the tune was pre-recorded.",
        "However, when the nurse realised Lucy had played the tune all by herself, she said it was 'spectacular'.Shew then found a piano teacher, Daniel Bath, who has been coaching her ever since through the Amber Trust, which works with blind musicians.Speaking on the programme, Daniel explained: 'Our lessons aren't like normal piano lessons.",
        "'Because [Lucy] can't see what's happening, I started using a method of playing the piano and she would put her hands on top of my hands so she could feel which fingers were doing what.'Daniel adds: 'I've never met anybody in my career who has the same depth of understanding of music [as Lucy].'Music is the way that she communicates and that's how she makes her place in the world.'In one clip, Daniel is seen leading Lucy to the piano at Birmingham New Street Station who helped her onto the piano stool and find the keys, before she charmed an audience with her performance of Chopin's Opus 9 Number 1.The clip left the judges on the show - pianist Lang Lang and musician Mika - visibly moved as they watched with open mouths.At one point, Mika held his hand up to his mouth and appeared to fight back tears.Lang Lang said: 'It's unbelievable that she can play this piece. How - how does she study? I mean, it's incredible.'",
        "As Lucy finished the piece and the crowd applauded her, Lang could be heard saying: 'Oh my God. Oh my God this is - this is impossible.'After her stunning performance at the Coronation concert, those watching the concert from home were quick to applaud the youngster, with some even being brought to tears.One person on social media wrote: 'The Coronation Concert is incredibly emotional - amazing performances by Lucy and the Romeo and Juliet ensemble.'",
        "Another added: 'Wow Lucy - you had me in tears. What a wonderful talent and a beautiful young lady. Bravo!'A third said: 'Lucy Illingworth, you are astonishing.'Lucy's flawless rendition of Debussy's Arabesque in the series final led to her triumph in the competition.Candice said she had entered her daughter as she wanted to show others how 'amazing' she was and raise awareness of her condition.She added it had been a 'once in a lifetime experience that neither of us will ever forget' which was 'literally life changing'.Since recording the show, Lucy has been learning more and more pieces by artists including Mozart, Beethoven, Schubert, Irving Berlin, George Gershwin, Duke Ellington and Stevie Wonder.The pianist was one of a number of star-studded performances taking place at the King's celebration this evening, which Buckingham Palace promised would be filled with 'global music icons and contemporary stars'.",
        "Nicole Scherzinger sang a popular Disney hit, Olly Murs took to the stage to show off his moves and Steve Winwood sang to thousands of cheering spectators.The King and Queen, whose Coronation ceremony took place at Westminster Abbey yesterday, were joined by their family members to watch the spectacular show that is being hosted by Downton Abbey star Hugh Bonneville."
    ]
}