{
    "articleURL": "/money/markets/article-12043395/Footsie-finance-chief-resigns-admitting-having-affair-female-colleague.html",
    "content": [
        "A senior director at a FTSE 100 listed company has resigned after an affair with a female colleague.",
        "David Egan, chief financial officer at RS Group for seven years, has left the electronics firm ‘with immediate effect’.Egan said he recently notified the board about his relationship with a colleague and had decided to stand down.Egan, 55 and married with children, admitted his judgement had ‘fallen short’.",
        "A person close to the company said it was not against RS Group policy for employees to have relationships with one another, but the affair had been inappropriate given Egan’s seniority.Egan was paid £1.8million in 2022, up from £1.5million the year before.He said: ‘I recently notified the board of a personal relationship with a colleague.‘Following a detailed review by the board, I recognise that there have been some shortcomings of judgment on my part and my actions have fallen short of the high standards expected of RS leadership.’Chairman Rona Fairhead added: ‘The board has accepted David’s resignation and in stepping down he recognises the importance of leaders setting and abiding by exemplary standards.’ The former trade minister and ex-chairman of the BBC Trust, thanked him for his service.RS Group was previously known as Electrocomponents and distributes electrical and electronics components to manufacturers globally.The resignation follows a string of high-profile departures in the corporate world.Last month Tony Danker was fired by the CBI following complaints from female members of staff and last week NBC Universal chief executive Jeff Shell left after newsreader Hadley Gamble accused him of sexual harassment.",
        "Egan, born in Australia, studied accountancy and worked around the world in executive roles for industrial giants including Hanson, Esad and Alent before joining Electrocomponents in 2016, according to his LinkedIn profile. He twice served as RS Group’s acting chief executive.Jane Titchener, a member of the finance team, will take over as interim finance director. RS Group said there was no change to profit forecasts since its update on April 5 and will report annual results on May 23. Shares fell 2.8 per cent, or 25.6p, to 887.4p.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}