{
    "articleURL": "/wires/reuters/article-12045299/MLB-roundup-Dodgers-stun-Phillies-walk-slam.html",
    "content": [
        "Max Muncy hit a grand slam on the first pitch he saw from former teammate Craig Kimbrel as the Los Angeles Dodgers rallied past the visiting Philadelphia Phillies for a 10-6 walk-off victory Wednesday afternoon.",
        "Muncy's 12th home run of the season reached the seats down the right-field line after Chris Taylor singled to lead off the ninth inning, Freddie Freeman was walked intentionally and Will Smith walked to load the bases.Miguel Vargas hit a home run for the Dodgers, and right-hander Gavin Stone gave up five runs (four earned) on eight hits in four innings with two walks and a strikeout in his major league debut.Bryce Harper (three hits, two walks) reached base five times for the Phillies, who saw their losing streak extend to four games. Down to their last out in the ninth inning, Harper singled and two batters later, Bryson Stott blooped a single to left field to tie the game 6-6.Rays 8, Pirates 1Shane McClanahan became the majors' first six-game winner, Josh Lowe and Wander Franco each hit solo homers, and Tampa Bay Rays beat Pittsburgh in St. Petersburg, Fla.McClanahan (6-0) remained unbeaten after yielding one run on five hits with two walks and nine strikeouts over six innings. Mitch Keller (3-1) gave up five runs in five innings, but only one run was earned as the Pirates made a pair of errors that led to four runs scoring.Lowe and Franco had two RBIs apiece for Tampa Bay, which has won 25 of its first 31 games and leads the majors with 64 home runs. Pittsburgh, which had won 11 of 13 entering the series, went 0-for-7 with runners in scoring position and has lost three straight games for the first time this season.",
        "Angels 6, Cardinals 4Jake Lamb and Mike Trout hit ninth-inning homers as visiting Los Angeles rallied past St. Louis on a night Shohei Ohtani dominated both on the mound and at the plate.Brandon Drury also hit a homer for the Angels, who won for the sixth time in their last eight games. Ohtani allowed four runs on five hits and one walk in five innings. He tied a career high by striking out 13 batters and earned his 500th career strikeout. He also went 3-for-5 with a double and an RBI.Reliever Ryan Tepera (2-1) pitched the eighth inning to earn the victory, and Carlos Estevez closed out the ninth inning for his seventh save. Reliever Giovanny Gallegos (1-1) allowed three ninth-inning runs to take the loss.Padres 7, Reds 1Brett Sullivan drove in the first four runs of his major league career as host San Diego defeated Cincinnati in the rubber game of their series.Juan Soto added a bases-clearing double for the Padres. Starter Seth Lugo (3-2) held the Reds to one run on seven hits over six innings to earn the win. The right-hander issued two walks and had five strikeouts.Sullivan laced a double in the second to drive in the game's first two runs and added a two-run homer in the fourth to make it 4-0.",
        "Tigers 6, Mets 5 (Game 1)Eric Haase homered and drove in five runs, including a go-ahead two-run single in the eighth, as host Detroit edged New York in the first game of a split doubleheader.Haase's long ball was his first of the season. Javier Baez also supplied his first homer and scored three runs for Detroit. Tyler Alexander (1-0) got the win in relief and Alex Lange notched his fourth save. Starter Joey Wentz gave up five runs and nine hits in six innings.Francisco Lindor hit a two-run homer, while Tommy Pham and Mark Canha added solo shots for the Mets. Starter Joey Lucchesi allowed four runs and five hits in four innings.Tigers 8, Mets 1 (Game 2)Michael Lorenzen pitched seven solid innings, Matt Vierling hit a two-run homer and the host Detroit completed a doubleheader sweep by pounding New York.Lorenzen (1-1), who signed with Detroit as a free agent in the offseason, earned his first win this season by holding the Mets to one run and four hits. Eric Haase, who had five RBIs as the Tigers took the first game, hit a solo homer in the nightcap and scored twice. Andy Ibanez had three hits and drove in two runs.Mets starter Max Scherzer (2-2) was battered for six runs, including two homers, and eight hits in 3 1/3 innings. Scherzer was making his first start since serving a 10-game suspension for having a foreign substance on his pitching hand in his last start.",
        "Braves 14, Marlins 6Marcell Ozuna hit a grand slam and a solo homer against his former team as Atlanta rolled past host Miami despite losing starter Kyle Wright early.Wright, who topped the majors in wins last season with 21, left the game with right-shoulder soreness with Atlanta leading 8-3 with no outs in the third. Collin McHugh (1-0) replaced Wright and worked three scoreless innings to get the win. He was the beneficiary of an Atlanta offense that collected 18 hits, including six homers.Braxton Garrett (1-1) took the loss, allowing 14 hits, two walks and 11 runs with three strikeouts in 4 1/3 innings. His ERA increased from 2.45 to 5.81. The Braves are 14-3 on the road this season, and they have won seven of their past nine games overall.Diamondbacks 12, Rangers 7Brandon Pfaadt's highly anticipated major league debut had a few rough patches but the offense more than made up for it, as Arizona defeated Texas in Arlington, Texas.The victory snapped a two-game skid for the Diamondbacks, who were led by Christian Walker's two home runs and five RBIs. Pfaadt, a touted pitching prospect, went 4 2/3 innings and allowed nine hits -- four of which were home runs -- and seven runs. However, four Arizona relievers combined for four scoreless innings. Joe Mantiply (1-0) earned the win.",
        "Texas starter Andrew Heaney allowed six runs on four hits in 4 2/3 innings, with four walks and five strikeouts. Josh Sborz (0-1) was tagged for the loss after allowing three runs on two hits and a walk in 1 1/3 innings in relief. Josh Jung had two homers for the Rangers.Giants 4, Astros 2Joey Bart doubled in a run and scored another, Wilmer Flores clubbed a home run and San Francisco left Texas with a series win after a victory over Houston.Webb (2-5) took a shutout into the eighth before walking David Hensley and serving up a single to Martin Maldonado, bringing the potential tying run to the plate with no one out. But Webb got former teammate Mauricio Dubon to ground into a double play, which became critical when Alex Bregman followed with a two-run homer to draw Houston within 3-2. The homer was Bregman's fourth of the season.Flores bombed his fifth homer of the year in the ninth, a solo shot, to give the San Francisco bullpen some breathing room. Scott Alexander struck out Yordan Alvarez to end the eighth before closer Camilo Doval worked around a leadoff walk in the ninth for his fifth save.Nationals 2, Cubs 1Lane Thomas tripled and scored on CJ Abrams' single in the seventh inning and Washington beat visiting Chicago for the Nationals' second consecutive victory.",
        "Five Washington pitchers combined on a six-hitter on a night when right-hander Jake Irvin started in his major league debut. Irvin logged 4 1/3 innings and gave up a first-inning run. He allowed two hits, walked four and struck out three.Cubs starter Marcus Stroman turned in a strong six-inning effort, holding the Nationals to one run on five hits. He struck out five and walked three.Yankees 4, Guardians 3 (10 innings)Pinch hitter Jose Trevino hit a game-ending single with one out in the 10th inning as host New York earned a victory over Cleveland.Trevino won it when he lined an 0-2 slider from Trevor Stephan (1-1) into center field to score automatic runner Oswaldo Cabrera. It was Trevino's fourth career walk-off hit and third since joining the Yankees before last season.Albert Abreu (1-0) quickly got through the middle of Cleveland's lineup in the top half to earn the win.White Sox 6, Twins 4Eloy Jimenez lined a go-ahead RBI single in the seventh inning among his two hits and Tim Anderson and Yasmani Grandal had three hits apiece to spark host Chicago to a win against Minnesota.Chicago, which got a three-run homer from Luis Robert in the first inning, secured its first series victory of the season while winning for the third straight time following a 10-game losing streak. The Twins have lost two in a row and three of four.Keynan Middleton worked around a walk to strike out the side in the ninth to notch his first save since May 2021. Minnesota's Carlos Correa hit a two-run double in the third and scored on Byron Buxton's double one batter later.Red Sox 8, Blue Jays 3Triston Casas went 3-for-5 with game-tying singles in back-to-back innings, and host Boston went on to beat Toronto.The Red Sox totaled 15 hits and scored in their last five innings en route to their fifth straight win and third in a row to begin the four-game series. Masataka Yoshida and Enmanuel Valdez had two hits and two RBIs apiece for Boston. Red Sox starter Nick Pivetta (2-2) struck out six and allowed three runs on five hits over six innings.Pivetta allowed solo home runs to Daulton Varsho and Vladimir Guerrero Jr., who were each 2-for-4 for Toronto. Alek Manoah (1-2) allowed five runs (two earned) on eight hits while striking out three in five innings. Toronto also committed four errors, and the Red Sox made two.Royals 6, Orioles 0Zack Greinke pitched five scoreless innings for his first win of the season, Vinnie Pasquantino went 3-for-4 with three RBIs and a home run, and Kansas City evened up its home series against Baltimore.Greinke (1-4) delivered his best outing of the season, striking out three with three hits and no walks, en route to his first win since Aug. 11 of the 2022 campaign. He came out after just 44 pitches -- a coach's decision, via the Kansas City Star -- but the bullpen maintained the club's first shutout since last Sept. 17.Taylor Clarke, Aroldis Chapman, Amir Garrett and Josh Staumont each pitched an inning in relief. Clarke struck out two in the sixth inning with the Royals holding a 1-0 lead after Pasquantino's fourth-inning, solo home run.Rockies 7, Brewers 1Kris Bryant and Charlie Blackmon homered, Alan Trejo drove in three runs and Colorado beat Milwaukee in Denver to run its winning streak to a season-high three games.The Rockies' Kyle Freeland (3-3) tossed five scoreless innings before leaving with what the Denver Post reported was an aggravation of a neck injury. He allowed three hits and struck out five.Owen Miller had two hits and Tyrone Taylor hit a sacrifice fly for Milwaukee, which has dropped three straight and six of its last nine. Losing pitcher Eric Lauer (3-3) allowed four runs -- all unearned -- on four hits and struck out six in 4 2/3 innings.--Field Level Media"
    ]
}