{
    "articleURL": "/wires/pa/article-12056283/Jamie-Oliver-Gordon-Ramsay-pay-tribute-chef-Jock-Zonfrillo.html",
    "content": [
        "Jamie Oliver, Gordon Ramsay and Marco Pierre White have paid tribute to Glasgow-born chef Jock Zonfrillo, with Pierre White labelling him one of the great cooks of the 21st century.",
        "It was revealed last Monday that Zonfrillo, who had presented MasterChef Australia since 2019, had died at the age of 46.Victoria Police said officers went to an address in Lygon Street in the Melbourne suburb of Carlton where they found a body at about 2am. They confirmed the death is not being treated as suspicious.On a special tribute episode of The Project on Australian TV station Channel 10, Marco Pierre White praised his former apprentice chef.",
        "“Jock came to me when he was 17 years old, his enthusiasm was greater than his knowledge, but it was that enthusiasm which drove him, maybe fuelled by his fears of failure, by his insecurities, which I could relate to.“Very few chefs have an inquisitive mind, an intellectual mind and a creative mind.“That’s what makes him special, that’s what makes him rare.”Pierre White said what he did for the industry in Australia was “extraordinary”.“He was filled with empathy, with compassion, he had qualities very few chefs have,” he said.“He’ll be greatly missed … he was a star in the true sense and that’s why he has my vote to be one of the great cooks of the 21st century, he was special, he was rare.”Ramsay was brought to tears when he spoke about Zonfrillo, who he had worked with back in the 1990s in London.",
        "“The ripples have been devastating, no-one is going to get over this quickly,” Ramsay said.“If there is one thing we’ve done as chefs is we’ve united and have been talking about the good times, it’s just so painful.“It’s just a shock, a massive shock. He was never done as a chef, he still had years to go.”Ramsay said spending time with him on Masterchef was “electrifying”.“Being in the environment together sort of took us back 20 years, there is something quite amazing about two Scots coming together in Australia, it makes you happy at the end of the day,” he added.“There was always something quite of encouraging about the shit we’d gone through to get to where we’d been.”Jamie Oliver said he remembers meeting Jock for the first time when he was 22 when he took his then girlfriend and now wife Jules to his restaurant.“It was me and Jules’ first date weekend and we went there, and there he was, young Jock, 22 years old, head chef with a beautiful menu and beautiful food,” he said.“I remember it because it was the first time I remember being spoiled by another chef.“He came from really humble beginnings and he smashed it, just smashed it … we’ve lost a very, very bright star.”",
        "Nigella Lawson said her heart breaks for Zonfrillo’s family.“My heart breaks – as I am sure everyone’s does – for Jock’s children and his family, and everyone who loved him,” Lawson said.“There’s an old-fashioned phrase here but may his memory be a blessing.”"
    ]
}