{
    "articleURL": "/wires/reuters/article-12046077/FOCUS-Sberbanks-tech-push-shows-Russias-growing-reliance-bank.html",
    "content": [
        "This content was produced in Russia where the law restricts coverage of Russian military operations in Ukraine",
        "By Alexander MarrowMOSCOW, May 4 (Reuters) - Already Russia's dominant lender, state-owned Sberbank has become one of the country's leading technology players, taking on an increasingly important role as sanctions and exiting rivals create gaps only a handful of firms can fill.Once a Soviet savings behemoth, Sberbank's image has gradually been transformed under CEO German Gref, who has overseen investments into artificial intelligence, cloud services, big data and smart devices.The shift, which now sees facial recognition used to access parts of the bank's plush new offices in Moscow, shows how Russia and Sberbank are adapting to the unprecedented economic sanctions imposed by the West over the conflict in Ukraine. But it also highlights challenges as Russia's tech development becomes increasingly reliant on one state-owned player.Sberbank's almost $530 billion in assets and 107 million retail clients underline its banking credentials. Since 2020 it has cast itself as a technology company as well, and is now seeking a bigger slice of Russia's shrinking technology pie.Even as the bank's profits slumped almost 80% in 2022, hammered by Western sanctions, investments in technology have remained high, the bank's Chief Technology Officer Andrei Belevtsev told Reuters, without giving concrete figures.\"Last year, 85% of (global tech) vendors and producers refused to work with Russia, but this in no way affected our work,\" Belevtsev said in a recent interview at his skyscraper offices overlooking Moscow's financial district.",
        "The message, as with most sectors of the Russian economy, is one of defiance.Belevtsev presented the past year as little more than a bump in the road for Russian tech, and laid out previously unreported details of Sberbank's domestic technology strategy and its hopes for further cooperation with China on open source technology.Russia, nevertheless, has acknowledged major shortcomings with its electronics industry. Imports of micro chips and other high-tech hardware crucial for weapons and car manufacturing have dried up and hundreds of thousands of workers, including many in the tech sector, have moved abroad.Belevtsev would not say how Sberbank, which operates supercomputers, gets access to micro chips, imports of which are subject to sanctions. Gref in April identified graphics cards as the trickiest hardware to replace.\"There are restrictions on some of them, it is a very complex technology,\" Belevtsev said. \"Every company has its commercial secrets, suppliers and supply chains.\"He declined to say whether the bank used so-called parallel imports, those that have been brought into the country without the licence holder's permission - an increasingly important market in post-sanctions Russia.CHINA COOPERATIONEven with supply issues, Sberbank has accelerated a drive to migrate to in-house technology and is ready to sell software domestically and for export if possible, Belevtsev said.",
        "\"Many countries are determining what they are ready to do and what they are not,\" he said. \"People are interested in Russia as a technology supplier and producer.\"One key market is China. Moscow is becoming more dependent on Beijing, having sharply raised its use of the yuan, increased energy supplies to China and started selling more Chinese-branded cars as Western automakers leave Russia.\"There is already a lot of cooperation on engineers and technology,\" Belevtsev said. \"We would like to see active cooperation on open source solutions ... not just between Russia and China, but in all countries of the world.\"But with that cooperation yet to take off, Sberbank's near-term future may be limited to the domestic market, where economic growth is likely to be minimal at best, as disposable incomes stagnate.Belevtsev, who said Sberbank had sold around 1.5 million smart devices since launching them less than three years ago, believes that consumers will always save up enough to buy a smart television, Russians' \"window onto the world\".\"Go to a remote Russian village,\" he said. \"If there is electricity there, you will certainly see a satellite dish.\"Our target is to sell hundreds of thousands of televisions this year.\"To do that, and seize market share abandoned by departing Western rivals, Sberbank is playing catch up with market leader Yandex.",
        "That task is challenging as Yandex is developing carefully and unhurriedly in smart devices, whereas Sberbank - while taking the right steps - is trying to move faster, said Sergei Polovnikov, head of Content Review, a technology-focused publication.\"Sberbank has big ambitions and, most importantly, a bottomless wallet,\" said Polovnikov. \"You can get a lot done with money.\"($1 = 79.3000 roubles) (Reporting by Alexander Marrow; Editing by Mike Collett-White and Mark Potter)"
    ]
}