{
    "articleURL": "/femail/article-12053921/King-Charles-Queen-Camilla-looking-relaxed-according-body-language-expert.html",
    "content": [
        "The King and Queen's body language shows pair are the picture of composureCORONATION LIVEBLOG: Click here to follow live updates throughout todayHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.ukAs King Charles III and Queen Consort Camilla arrive at Westminster Abbey for the historic first Coronation in 70 years today, they were surprisingly stoic.  ",
        "According to a body language expert, the royal couple naturally felt the weight of the historic occasion, but weren't necessarily nervous. Both the King and Queen 'seem contemplative and serious. Much more relaxed than I expected them to be', expert Carole Railton told Femail. She added: 'If they had been stressed their bodies would have been more forward when they were in the carriage.'During the King's entrance into the Abbey, he appeared to take a deep breath and readjusted his body and position halfway through his walk, which shows he has good composure and is contemplative during this momentous day.The Queen took in her surroundings as she looked around, which according to the expert, shows that she is relaxed and posed - ready for the day.",
        "As the King and Queen take their place on their thrones, they seem to be structured and aware of the 'seriousness of their position', which shows they intend to do a good job in their roles as Heads of State.The expert added that Charles and Camilla look relaxed as they take the oaths. In leading the procession, Ms Railton says the Queen appears to be calm and in control, presenting herself as a strong figure as the ceremony proceeds. The King, on the other hand, is leaning slightly forward, which according to the expert suggests that he is thinking a great deal as he steps into his role. ",
        "The monarch and his wife smiled to the congregation as they walked through the church for a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry.The national anthem played and crowds shouted God Save the King as he started on his 1.3mile journey to the Abbey in the Diamond Jubilee State Coach through streets lined with 2million people and 7,000 British troops. 100million people are watching on TV around the world.As he arrived for the two-hour service, the bells peeled as crowds stood in the rain cheering the arrival of the King and his wife. They entered the Abbey to state trumpeters, with the congregation standing as the royal couple entered.As his father was cheered through the capital, royals including Prince Harry arrived at the service. The Duke of Sussex walked up the aisle alone, smiling at people as he walked to the front of the church. He grinned at people in the congregation before he took his seat.",
        "Stars in the Abbey included Katy Perry, Lionel Richie, Sir Andrew Lloyd Webber, Stephen Fry, Nick Cave and magician Dynamo, while Dame Emma Thompson gave a thumbs up in excitement. First Lady Jill Biden was among the last to enter before the service, sitting with First Lady of Ukraine Olena Zelenska. President Joe Biden has stayed at home.",
        "The Diamond Jubilee State Coach, drawn by six Windsor grey horses, arrived at Buckingham Palace for the King and Queen at 10am. Members of the Mounted Division of the Household Cavalry have lined up at the entrance to The Mall ahead of the King's Procession to Westminster Abbey.A mile away from the Palace, Westminster Abbey was rammed with the great and good from Britain and around the world as Charles III's day of destiny finally arrived and he will be crowned King today.More than 100million people around the world are about to watch the historic first coronation of a British monarch in 70 years - with an estimated 2million people on the streets of London to watch history unfold."
    ]
}