{
    "articleURL": "/wires/pa/article-12055415/Sunak-hosts-coronation-lunch-volunteers-Ukrainian-refugees.html",
    "content": [
        "The Prime Minister and his wife will welcome volunteers, Ukrainian refugees in the UK, and youth groups to Downing Street for a lunch to mark the coronation.",
        "Rishi Sunak and Akshata Murty will host the event on Sunday as part of the Big Lunch celebrations taking place across the country over the coronation weekend.They will dine on food sourced from across the UK, including beef from Gloucestershire, Scottish Loch Duart salmon, Northern Irish soda bread, and ice cream from Wales, according to No 10. I am proud to welcome Ukrainians forced to flee their homes and some incredible community heroes to Downing Street for our very own Coronation lunch  Rishi Sunak  Crockery will be donated by Emma Bridgewater, a pottery with strong royal connections, including a limited edition King Charles III teapot.Like thousands of other street parties, Downing Street will be adorned with festive bunting.Recipients of the Points of Light Award, given to ordinary people doing extraordinary things for their community, have been invited.",
        "They include a couple who founded a charity supporting people who have gone through baby loss, Zoe and Andy Clark-Coates, breast cancer campaigner Laura Ashurst, and Navjot Sawhney, who designed a hand-cranked washing machine used by thousands of people with no access to electric ones.Ukrainians who have come to the UK under the Homes for Ukraine scheme after Russia invaded their country, as well as their UK sponsors, will also attend.",
        "Invitees also include young people from UK Youth and the National Association of Boys and Girls Clubs.Mr Sunak said: “Come rain or shine, thousands of friends and neighbours are coming together this weekend to put up the bunting, pour the tea and cut the cake at street parties and community events across the UK.“I am proud to welcome Ukrainians forced to flee their homes and some incredible community heroes to Downing Street for our very own coronation lunch to celebrate this historic moment.“In England, Scotland, Wales, Northern Ireland – and across our Overseas Territories and the wider Commonwealth – people are marking this momentous occasion in the spirit of unity and hope for the future”."
    ]
}