{
    "articleURL": "/wires/reuters/article-12047757/Afghanistan-aid-donors-struggle-crackdown-women-money.html",
    "content": [
        "By Michelle Nichols",
        "UNITED NATIONS, May 4 (Reuters) - The Afghan people are in for a \"very difficult year ahead,\" warned the top U.S. aid official, as donors grapple with challenging a Taliban administration crackdown on women and girls, more crises around the world and overall less funding.The Taliban seized power in August 2021 as U.S.-led forces withdrew after 20 years of war. Last month the Taliban began enforcing the ban on Afghan women working for the U.N. after stopping most women working for aid groups in December.\"We can never get used to this because it is both, of course, morally deplorable, but also it is so incredibly dumb,\" Samantha Power, administrator of the U.S. Agency for International Development (USAID), told Reuters.\"We are expecting a very difficult year ahead for the Afghan people,\" she said, noting that in 2022 USAID had more money to respond to ripple effects of Russia's war in Ukraine, which the U.N. blames for worsening a global food crisis.She said that Washington would have to make some \"very hard choices\" this year on global humanitarian aid.The United Nations will stay in Afghanistan to try to help millions of people in need, U.N. Secretary-General Antonio Guterres pledged on Tuesday, but he said funding is drying up with a $4.6 billion U.N. appeal less than 7% funded.",
        "According to U.N. data, the United States was the largest donor to the U.N. appeal last year, giving nearly $1.2 billion. So far the United States has given the most money to the 2023 U.N. appeal: $75 million.\"It is really important this coming year that other countries step up with resources that go beyond what they were able to mobilize last year,\" said Power, adding that U.S. funds were already being stretched by unexpected crises like the earthquake in Turkey and Syria and fighting in Sudan.When asked if Gulf countries could do more to help Afghanistan, Power said: \"That would be one obvious potential set of partners.\"'MAGIC SOLUTION'Since toppling the Western-backed government in 2021, the Taliban administration has also tightened controls on women's access to public life, including barring women from university and closing girls' high schools.The Taliban says it respects women's rights in accordance with its strict interpretation of Islamic law. Taliban officials said decisions on female aid workers are an \"internal issue.\"The United Nations has been trying to carve out exemptions in some areas for women to deliver aid, particularly in health and education. It says nearly three-quarters of the country's 40 million people need humanitarian help.Britain has slashed its international aid budget this year as it said it needs to spend more at home to help refugees, particularly from Ukraine and Afghanistan. For the year ending April 5, 2024 it has pledged nearly $180 million in aid funding for Afghanistan and Pakistan.",
        "According to U.N. data, Britain gave more than $450 million to the U.N. appeal last year, making it the second largest donor behind the United States. Britain's U.N. Ambassador Barbara Woodward recognized the great humanitarian need in Afghanistan.\"We are trying to fulfill that need, working with partners, at the same time as making sure that we do not give anything that would give the Taliban reason to think that they can carry on in this medieval way,\" she told reporters last month.Last year Switzerland was among the mainly Western top donors, according to U.N. data, giving some $35 million. Switzerland's U.N. Ambassador Pascale Baeriswyl described the situation in Afghanistan as a \"difficult dilemma.\"\"If you stop the project, you know that people will die,\" Baeriswyl told reporters. \"But at the same time ... it's not possible to implement projects without women being able to work ... and we do not have the magic solution to that.\" (Reporting by Michelle Nichols; editing by Jonathan Oatis)"
    ]
}