{
    "articleURL": "/sport/football/article-12041075/How-Wes-Brown-lost-millions-end-bankrupt.html",
    "content": [
        "READ: Wes Brown was declared bankrupt last month following a HMRC petitionA source has spoken to Mail Sport about the reasons behind his financial woesBrown was eager to mirror lifestyles of team-mates earning a lot more than him Bad property investments and a desire to keep pace with the lifestyle of team-mates earning six times as much as him led to Wes Brown's bankruptcy.",
        "Brown, who raked in £50,000 a week while playing, was declared bankrupt last month over a six-figure debt to HM Revenue &amp; Customs (HMRC).The bankruptcy petition against Brown, who enjoyed a 15-year professional career, was rubber-stamped at the High Court on April 12 and listed on The Gazette, the official public record. As revealed by Mail Sport's In the Money column, two creditors petitioned for 43-year-old Brown, who won 23 caps for England, to be made bankrupt.  Bad investments, coupled with trying to mirror the lifestyle of team-mates on exorbitant wages, was a key contributor to his financial demise.",
        "A source told Mail Sport: 'It may seem like Wes was earning big money - to most people he was - but the trouble was he was also trying to keep up with the lifestyle of team-mates earning five or six times more than he was. 'Most of his money disappeared in bad property deals. He overpaid on the farm that Leanne lives in.'He spent something like £6million or £7m to buy that. They have tried to sell it but haven't managed to, even after lowering the price to £4.75m.'Any money left is tied up in the farm. A previous property of theirs was once listed at £4.5m but took seven years to sell, finally going for £2.4million - almost half price.'",
        "Brown and Real Housewives of Cheshire star wife Leanne also went through a costly divorce.Mail Sport also understands that  former Manchester United team-mates, including Wayne Rooney and current Middlesbrough boss Michael Carrick, have rallied around Brown, who is thought to be renting a modest property off current United striker Marcus Rashford 'at mates' rates.'Brown is set to line up in the Manchester Remembers charity football match for victims of the 2017 Manchester Arena bombing on May 7.",
        "He'll play alongside former United team-mate Nicky Butt and Trevor Sinclair in the game at Oldham's Boundary Park, with boxing legend Ricky Hatton and comedian Jason Manford in the celebrities team they're facing.Brown's story follows Craig Bellamy's exclusive interview with Mail Sport, in which he confirmed he had also been declared bankrupt.Speaking last month to Mail Sport's chief sports writer Oliver Holt, Bellamy said: 'I have been living the last five or six years on Death Row, just waiting for someone to put me out. I have been waiting for the cell door to open and someone to say: \"Today’s the day\".'It’s like the feeling of not being able to look forward to anything. All the money I’ve earned, I can’t get a mortgage. Financially, I have no future. The hurt of that. I can’t own anything. Everything’s gone.'"
    ]
}