{
    "articleURL": "/tvshowbiz/article-12055491/Kate-Ferdinand-reveals-husband-Rios-children-reacted-called-mum.html",
    "content": [
        "Kate Ferdinand has opened up about how her stepchildren told her 'not to worry' after she mistakenly referred to herself as Mum instead of Kate. ",
        "The former TOWIE star, 31, became step mother to husband Rio's children Lorenz, 16, Tate, 14, and Tia, 12, after they wed in 2019.The children tragically lost their mother Rebecca Ellison following her battle with breast cancer in 2015, aged just 34.Speaking on the Happy Place podcast Kate, who also shares biological son Cree, twenty four-months, and is expecting a second baby with her husband, 44, said: 'Sometimes I'm 'Mummy Kate.'But the other day I found myself going 'come here to Mummy', and [Rio's daughter] Tia's there and I go 'oh sorry'.",
        "Before adding: 'Tia said 'Kate, it's fine, I'm OK if you say mummy. You don't have to say Mummy Kate. It doesn't bother me'.It comes after Kate reveals she battled strong emotions while bonding with her stepchildren, claiming she felt as she was 'walking in the steps of someone else's life' as her relationship with former footballer Rio blossomed.In her new book How To Build A Family, extracted by The Sun, she wrote: 'If I could bring Rebecca back, I would in an instant because of the pain I’ve seen in them.'A child losing their parent is horrendous. You want to scoop them up and bring their mum back to make them happy, but you can’t.",
        "'As a step-parent coming into a bereaved home, you can sometimes find yourself in situations where you feel like you’re walking in the steps of someone else’s life.'She went on to say how she felt as if she herself was grieving Rebecca even though she had never met her, with other step-parents experiencing the same.Television personalty Kate admitted she felt guilty for the emotions she felt 'because it wasn’t about me'.",
        "And she came to realise she had a connection with Rebecca as they were both mothers to the children, realising how it must have felt for her to leave her children behind while wanting to do the best for them.It comes after Kate said she feels 'secure' in her bond with her husband Rio's children, as she candidly discussed life as a step mum.Things haven't been all smooth-sailing, with Kate previously admitting she cried in secret while learning to be a stepmother.She told The Sun: 'It takes a while to get to know people after so much trauma and everything that has gone on.'Becoming a parent is not built in big, sweeping moments. It's lots of small things you do all the time. And it takes time to build that bond and relationship. But now I feel secure.'",
        "Kate added: 'I love them all exactly the same, but the love is formed in different ways. It's hard to explain, but because I've worked so hard for their love, it's an extra-special love.'"
    ]
}