{
    "articleURL": "/news/article-12038499/Florida-dentist-accused-brutally-beating-man-golf-club.html",
    "content": [
        "Police had to be called to Harbor Hills Golf Course, Florida, on Sunday after receiving reports that a man was attacked by another with a golf clubJoseph Sivak claims Eddie Orobitg attacked him and caused multiple injuries after Sivak and his wife had been walking on the course In bodycam footage, Orobitg asks deputies arresting him: 'Why am I being arrested?'A Florida dentist was arrested over the weekend for allegedly assaulting another man with a golf club at a golf course, causing him serious injuries including broken ribs.",
        "Eddie Orobitg, 52, was arrested on the course and booked into the Lake County jail on a charge of aggravated battery, the Lake County Sheriff's Office said.Police had been called to the Harbor Hills Golf Course in Lady Lake, Florida, on Sunday afternoon after reports that a man was attacked by another with a golf club.The victim, Dr Joseph Sivak, claims he nearly died in an interview and that the alleged assault left him with fractured cheekbones and his ear having to be stitched.According to Sivak, he had been walking with his wife on the course path when Orobitg told him he wasn't supposed to be when the brutal attack happened.",
        "Sivak said he lost consciousness during the alleged incident and told Fox35 Orlando that Orobitg kept on striking him with the club.Sivak said: 'I nearly died, that's the thing that scared me.'Orobitg is alleged to have told the former doctor that the path way was reserved exclusively for those on golf carts. He also said that he suffered broken ribs, fractured cheekbones and had to have his ear stitched following the alleged assault. The two men live in the same gated community, with the house that Orobitg lives in being estimated as being worth $949,000 according to real estate site Zillow. ",
        "Body camera footage from the Lake County Sheriff's Office show him acting surprised as he arrested.He asks the deputies: 'Why am I being arrested sir? This is unbelievable.' ",
        "Speaking to reporters after the arrest, Lt John Herrell said: 'Things just escalated to the point at which the defendant used his golf club to beat this guy down.'Had he been struck in the right place it could have been much, much worse.'According to the arrest report, Orobitg and his son told deputies Sivak got in his face and that Sivak hit him with his water bottle and tried to take his clubs.Orobitg's son told the deputies that his then father spat in the face of Sivak. A resident of Harbor Hills, Orobitg has a dental office in Leesburg, Florida. On his website, a patient in a testimonial brags about the dentist's 'light touch.' Orobitg also boasts of helping soothe patients' anxieties and another claims he is 'incredibly gentle'.He was released after posting a $5,000 bond, according to local news site Villages News.",
        "It comes after a brawl broke out in the middle of another Florida golf course over the weekend after a group accused another of playing too slow.Golfers at the Cleveland Heights Golf Course in Lakeland, Florida grew impatient waiting for players at the 27-hole field to move on.",
        "A viral video showed two men in a golf cart approaching a group of four shortly before punches were thrown with shots of 'bring it b****.'The video shows the fight start when one of the two men shove another, leading to punches and kicks being thrown. It is unclear if any of the golfer involved in the brawl were charged or asked to leave the course."
    ]
}