{
    "articleURL": "/tvshowbiz/article-12039955/Too-Hot-Handle-star-Francesca-Farago-engaged-TikTok-star-Jesse-Sullivan.html",
    "content": [
        "Too Hot to Handle bombshell Francesca Farago announced her engagement to trans TikTok star Jesse Sullivan on Tuesday.",
        "Farago, 29 – who has dated Vinny from Jersey Shore in the past – shared the happy news via Instagram, posting a collection of photos that showed her and Jesse's 'magical night.''WE'RE ENGAGED,' wrote Francesca, captioning her slideshow. 'A glimpse into the most magical night ever. Obsessed with our family.. what is life !!'The couple looked gorgeous in their engagement photos, posing in a cathedral lit with hundreds of candles.Jesse, 33 – who uses he/him pronouns – gave his new fiancee a jaw-dropping ring comprised of two massive diamonds. ",
        "Sullivan's teen child Arlo and Farago's beloved white Pomeranian were also in attendance, making the moment even more special.Dressed in black tie, the glamorous couple embraced one another and put their love on full display. The influencer eventually flaunted her dazzling creation on TikTok, calling it 'the most beautiful thing I have ever seen in my entire life.''Jesse designed it himself,' she explained. 'He put so much thought into every single FREAKIN detail.'Jesse partnered with Ring Concierge to design the sparkler for his bride-to-be, taking inspiration from one of her favorite designs – Jackie Kennedy's engagement ring. And Francesca also showed off the ring she designed for Jesse – an interlaced metal band with a large black gemstone. ",
        "Little heartfelt details included Jesse having a paw print engraved in her band and Francesca giving Arlo a ring similar to his, just with a smaller stone. The pair's romance began shortly after the reality star finished filming Perfect Match last year, and they have frequently declared that tying the knot was in their cards.",
        "'I guess that's up to me to propose, right?' said Sullivan last year on the podcast Past Your Bedtime. 'But yes, absolutely, I'm definitely marrying her. I mean, she's the love of my life, I can say that hands down.'Farago Recently defended her partner after he received threats on social media for being openly transgender.Speaking to Variety in February, Francesca said: 'My boyfriend is trans, and he gets death threats on his posts. And he's just a nice normal dad. He's so sweet. 'To have these aspects of public hate from that just proves that the more representation we have, the more positive it will be because people will see that we're just normal people.'"
    ]
}