{
    "articleURL": "/sport/football/article-12056807/Free-Saudi-prisoners-banner-flies-St-James-Park-Newcastle-face-Arsenal.html",
    "content": [
        "The banner arranged by the human rights group the SANAD OrganisationThe organisation says it aims to ‘defend political and civil rights in Saudi Arabia’Saudi Arabia's Public Investment Fund took over at Newcastle in October 2021A banner reading 'Free all Saudi prisoners' was flown over St James Park as Newcastle hosted Arsenal in the Premier League on Sunday.",
        "The protest comes amid the Saudi Arabia's Public Investment Fund's backing of Newcastle, after a takeover was completed in 2021.The Saudi regime has been been heavily criticised by human-rights groups for multiple alleged offences.This includes the alleged exploitation of migrant workers, criminalising the LGBTQ community and the imprisonment and torture of anti-Saudi dissidents.The banner also referred to the SANAD Organisation – short for Standing Against Nefarious and Arbitrary Detentions.",
        "The body says it is a human rights organisation, which is officially registered in the UK, and seeks to ‘defend political and civil rights in Saudi Arabia’.The SANAD Organisation says it ‘monitors human rights violations and exposes them to human rights bodies and media, civil and political institutions around the world.’'In Sanad, we seek to let the world know about detainees behind bars in Saudi Arabia and the violations committed against them for their human rights activism, expressing their opinions, or demanding their legitimate right to freedom of speech; and to convey their voices and sufferings to free societies that respect opinion, freedom of expression, and human rights,' the organisation's website reads.Saudi Arabia's Public Investment Fund (PIF) bought a controlling stake in Newcastle in October 2021, but the deal was only given the green light after the Premier League received 'legally-binding assurances' that the Kingdom of Saudi Arabia would not have any control over the club.",
        "Fresh calls were made last month for the Premier League to probe the £305million takeover.The calls came after Newcastle chairman Yasir Al Rumayyan was described as 'a sitting minister of the Saudi government' in a document submitted to a court in the United States. "
    ]
}