{
    "articleURL": "/wires/aap/article-12045277/Drag-storytime-event-canned-threats-violence.html",
    "content": [
        "A Melbourne council has cancelled a drag storytime event, citing threats of violence against staff, families and a performer.",
        "Activists protested Monash City Council's planned celebration of the International Day Against Homophobia, Biphobia and Transphobia at a council meeting last week.Victoria Police then briefed officials about safety risks, prompting the May 18 gathering at Oakleigh Library to be cancelled, Monash chief executive Andi Diamond announced on Thursday.She said repeated threats of violence and intimidation were levelled at councillors, staff, families booked to attend the event and the performer in the lead-up to the \"incredibly disappointing\" decision.\"This event has attracted significant attention, with hateful and threatening commentary and misinformation spread online, via email and directly over the phone,\" Dr Diamond said.\"Councillors and staff have received messages that nobody should be expected to receive in their workplace, as have our LGBTIQA+ community.\"In recent days these threats have escalated to direct threats of violence involving the event itself.\"The occasion had been designed to introduce children to diverse role models and encourage acceptance, love and respect, Dr Diamond said.She said the council understood drag storytime was not for everyone and had scheduled it outside of regular library programs in acknowledgement of that so parents had to make a deliberate choice to attend.\"Unfortunately, some in the community were not willing to allow that choice,\" Dr Diamond said.",
        "\"In the end we were unable to guarantee that we would be able to hold the event safely.\"She apologised to the LGBTIQA+ community for having to cancel and stressed the council did not take the decision lightly.In question time on Thursday, Premier Daniel Andrews derided last week's protest action as \"shameful\" and said death threats against the council were a disgrace.\"(These events) are about sending a message to ... people in our Victorian community that they are loved, they are respected, they are safe and they are supported by the government and their community,\" Mr Andrews said.He said equality was non-negotiable and protesters' hateful views were worth nothing in Victoria.Greens Councillor Josh Fergeus said Dr Diamond was put in an impossible situation.\"I denounce the actions taken by some individuals and groups in the community who have seen fit to threaten and intimidate council staff, councillors, the artist Sam T and members of the public,\" he said on Twitter.United Australia Party Senator Ralph Babet said it was clear from the last council meeting there was \"overwhelming public displeasure\" about the drag storytime event, and many parents and grandparents had expressed concern to him about it.\"We have a duty to ensure that the content our children are exposed to is age-appropriate and not confusing,\" Senator Babet said.",
        "The senator condemned \"far left extremists who have attempted to hijack this event and stoke violence\", before calling for a civilised debate where both sides of the argument could be respected."
    ]
}