{
    "articleURL": "/wires/reuters/article-12052269/Atlanta-United-reverse-skid-vs-Inter-Miami.html",
    "content": [
        "Atlanta United will try to respond following recent stumbles on Saturday when they visit Inter Miami, who just might have put their own struggles in the past.",
        "Atlanta United (5-2-3, 18 points) were defeated 3-1 at rival Nashville SC last Saturday and have won only once in their previous four games.That kind of hiccup is common for even the best MLS teams, but it stands out for Atlanta partly because of how well it began the year, winning four of its first six.\"I feel like we started in a very strong way (but) the performance has dropped in probably the last week I would say, that's it,\" manager Gonzalo Pineda said last weekend. \"(Saturday) we were in some moments we were much better with some rhythm on the ball, occupying certain gaps, and we were dangerous. It's just the final touch wasn't quite there.\"Thiago Almada scored Atlanta's only goal from the penalty spot to tie striker Giorgos Giakoumakis for the team lead with five.Giakoumakis had scored in each of his first five starts in MLS since his transfer from Celtic but missed last week with a hamstring injury and will be out again this weekend.Inter Miami (3-6-0, 9 points) had lost six straight before upsetting the host Columbus Crew 2-1 on Saturday.After missing the first six weeks of the season due to a calf injury, Leonardo Campana scored his first two goals of the season.",
        "Campana scored 11 goals last season but was also limited by injury in 2022, making only 26 appearances and 21 starts.\"Today I thought he was sensational. I really did,\" Miami coach Phi Neville said of Campana's third start of the season. \"I think if we have Leo Campana fit for the whole season, then we're going to be successful.\"Campana's return to full fitness might keep Miami striker Josef Martinez from facing his former side, or at least limit him to a substitute role.Miami's win at Columbus came at a cost: Jean Mota tore his LCL and is expected to miss four to six months. He joins Gregore as central midfielders Neville has lost for a lengthy spell.--Field Level Media"
    ]
}