{
    "articleURL": "/wires/ap/article-12058581/UN-urges-Afghanistans-Taliban-end-floggings-executions.html",
    "content": [
        "ISLAMABAD (AP) - A U.N. report on Monday strongly criticized the Taliban for carrying out public executions, lashings and stonings since seizing power in Afghanistan, and called on the country's rulers to halt such practices.",
        "In the past six months alone, 274 men, 58 women and two boys were publicly flogged in Afghanistan, according to a report by the United Nations Assistance Mission in Afghanistan, or UNAMA.\"Corporal punishment is a violation of the Convention against Torture and must cease,\" said Fiona Frazer, the agency's human rights chief. She also called for an immediate moratorium on executions.The Taliban foreign ministry said in response that Afghanistan´s laws are determined in accordance with Islamic rules and guidelines, and that an overwhelming majority of Afghans follow those rules.\"In the event of a conflict between international human rights law and Islamic law, the government is obliged to follow the Islamic law,\" the ministry said in a statement.The Taliban began carrying out such punishments shortly after coming to power almost two years ago, despite initial promises of a more moderate rule than during their previous stint in power in the 1990s.",
        "At the same time, they have gradually tightened restrictions on women, barring them from public spaces, such as parks and gyms, in line with their interpretation of Islamic law. The restrictions have triggered an international uproar, increasing the country´s isolation at a time when its economy has collapsed - and worsening a humanitarian crisis.Monday's report on corporal punishment documents Taliban practices both before and after their return to power in August 2021, when they seized the capital of Kabul as U.S. and NATO forces withdrew after two decades of war.",
        "The first public flogging following the Taliban takeover was reported in October 2021 in the northern Kapisa province, the report said. In that case, a woman and man convicted of adultery were publicly lashed 100 times each in the presence of religious scholars and local Taliban authorities, it said.In December 2022, Taliban authorities executed an Afghan convicted of murder, the first public execution since they took power the report said.The execution, carried out with an assault rifle by the victim´s father, took place in the western Farah province before hundreds of spectators and top Taliban officials.Zabihullah Mujahid, the top government spokesman, said the decision to carry out the punishment was \"made very carefully,\" following approval by three of the country´s highest courts and the Taliban supreme leader, Mullah Hibatullah Akhundzada.There has been a significant increase in the number and regularity of judicial corporal punishment since November when Mujahid repeated comments by the supreme leader about judges and their use of Islamic law in a tweet, the report said.Since that tweet, UNAMA documented at least 43 instances of public lashings involving 274 men, 58 women and two boys. A majority of punishments were related to convictions of adultery and \"running away from home,\" the report said. Other purported offenses included theft, homosexuality, consuming alcohol, fraud and drug trafficking.",
        "In a video message, Abdul Malik Haqqani, the Taliban´s appointed deputy chief justice, said last week that the Taliban´s Supreme Court has issued 175 so-called retribution verdicts since taking power, including 79 floggings and 37 stonings.Such verdicts establish the right of a purported victim, or relative of a victim of a crime to punish or forgive the perpetrator. Haqqani said the Taliban leadership is committed to carrying out such sentences.After their initial overthrow in the U.S. invasion of 2001, the Taliban continued to carry out corporal punishment and executions in areas under their control while waging an insurgency against the U.S.-backed former Afghan government, the report said.UNAMA documented at least 182 instances when the Taliban carried out their own sentences during the height of their insurgency between 2010 and August 2021, resulting in 213 deaths and 64 injuries.Many Muslim-majority countries draw on Islamic law, but the Taliban interpretation is an outlier.U.N. Secretary-General Antonio Guterres has called a Taliban ban on women working an unacceptable violation of Afghan human rights.On April 5, Afghanistan's Taliban rulers informed the United Nations that Afghan women employed with the U.N. mission could no longer report for work. Aid agencies have warned that the ban on women working will impact their ability to deliver urgent humanitarian help in Afghanistan.",
        "The Taliban previously banned girls from going to school beyond the sixth grade and women from most public life and work. In December, they banned Afghan women from working at local and non-governmental groups - a measure that at the time did not extend to U.N. offices.Under the first Taliban regime from 1996 to 2001, public corporal punishment and executions were carried out by officials against individuals convicted of crimes, often in large venues such as sports stadiums and at urban intersections."
    ]
}