{
    "articleURL": "/wires/ap/article-12042597/Texas-Democrat-Allred-says-hell-run-against-Cruz-Senate.html",
    "content": [
        "AUSTIN, Texas (AP) - Democratic Rep. Colin Allred of Texas said Wednesday he will run for the U.S. Senate in 2024, becoming an early challenger to Republican Sen. Ted Cruz.",
        "Allred, a three-term congressman and former NFL player, enters the race a heavy underdog. No Democrat has won statewide office in Texas in nearly 30 years, although Cruz only narrowly beat Beto O'Rourke in 2018 during what was a strong midterm election cycle nationally for Democrats.\"Some people say a Democrat can't win in Texas,\" Allred said in a campaign launch video. \"Well, someone like me was never supposed to get this far.\"Democrats currently hold a narrow 51-49 majority in the Senate and face a tough electoral map in 2024, when their party will be defending 23 seats compared with Republicans´ 10. Three of those Democratic seats are in states that then-President Donald Trump, a Republican, won in the 2020 election.Allred doesn't have a large profile in Texas beyond his Dallas district. He is introducing himself to voters by making the case that Cruz, who voted to reject the certification of Democrat Joe Biden's presidential election victory over Trump following the insurrection at the U.S. Capitol on Jan. 6, 2021, is too far to the right and turned his back on Texas by taking a family vacation during a deadly winter storm later that year.Cruz´s campaign said in a statement that Allred is \"too extreme for Texas\" and has a voting record that´s \"completely out-of-touch\" with the state.",
        "No other big names in Texas have entered the Senate race for Democrats, who are again trying to rebuild in the nation's biggest red state after O'Rourke lost by double-digits in an expensive attempt to unseat Republican Gov. Greg Abbott last year.Allred was a linebacker for the Tennessee Titans and will be giving up what is a safe congressional seat by entering the Senate race. He is a member of the House Foreign Affairs committee.Cruz ran for president in 2016 but has said he's focused on reelection for next year."
    ]
}