{
    "articleURL": "/tvshowbiz/article-12054545/HBO-Disney-studios-accused-demanding-runners-return-work-writers-strike.html",
    "content": [
        "Hollywood writers are on strike, but several studios are trying to force some show runners to return to work.",
        "Striking Writers Guild of America members have received support from celebrities such a Drew Barrymore, who pulled out of her hosting duties at the MTV Movie and TV Awards, and Pete Davidson, who passed out pizzas Friday to those walking the picket line in New York. However, several show runners, the executives with creative control over a program, say they have received letters from Warner Bros/Discovery owned HBO, Disney, and Paramount owned CBS requiring them to fulfill their non-writing obligations. Deadline received copies of letters sent to show runners.",
        "'If you are a WGA member, HBO/HBO Max respects your membership in the WGA, and we will not do anything to place you in jeopardy of WGA rules,' read a May 2 letter from the network.'However, we believe certain services, such as participating in the cast process and/or contributing to non-writing production, and post-production work are clear examples of non-WGA required services that should continue to be rendered during this time,' the letter stated.'Under the National Labor Relations Act, the WGA is not permitted to interfere with an employer’s right to designate employees to perform certain supervisory functions.'The document then listed those duties, followed by a caveat in the FAQ portion which read, 'If you fail to provide contracted services due to the strike, HBO/HBO Max will not be obliged to continue your salary.'",
        "The letter added yet another warning. 'Further, if production is interrupted by the strike, even if you offer to continue to work, HBO/HBO Max will not be obliged to continue your salary, nor the salary of the cast and crew.' Disney, which owns ABC and 20th Century Television, sent out a similar letter the following day, which included 'Studio intends to stay in production during the WGA strike and we are legally entitled to do so.'However, WGA strike rules explicitly prohibit the performance of those duties, noting in a statement to The Hollywood Reporter that those assignments are 'specifically defined in the Guild contract as writing services'  and as such, 'struck work that Guild members are prohibited from doing during a work stoppage.'Members of the Writers Guild of America went on strike for the first time in 15 years May 2, hitting the picket line in Los Angeles and New York after their current contract expired.The biggest points of contention in the negotiations are an increased wage floor, and more payments and residuals from shows that are shown on streaming platforms. Charles Slocum, assistant executive director at the WGA West explained the situation to Deadline. ",
        "'In streaming, the companies have not agreed to pay residuals at the same level as broadcast, or the same reward-for-success as they have traditionally paid in broadcast,” he said. “If you write for a streamer, you get two residuals payments — one for domestic streaming and one for foreign streaming. It’s a set amount of money. If it’s a big hit, you do not get paid more residuals in streaming, whereas in the broadcast model, you do because of its success.” ",
        "The writers want protections against mini-rooms, in which two or three writers, working for the base salary, script out a considerable portion of a series before it gets the greenlight. They also want protections against the use of artificial intelligence.After receiving the Disney letter a WGA spokesperson said, 'It is shameful that Disney, which has grown its business on unionized labor, is resorting to familiar union-busting tactics.'"
    ]
}