{
    "articleURL": "/news/article-12057431/Meghan-Markle-seen-time-Archies-birthday-King-Charles-coronation.html",
    "content": [
        "Meghan Markle, 41, was joined on the fresh-air outing by her friends Markus Anderson and Heather Dorak in California on Sunday morningThe mother-of-two was absent from the regal festivities in the UK this weekend Meghan Markle has been spotted hiking without her husband Prince Harry near their $14million Montecito mansion - hours after missing King Charles' coronation.",
        "The Duchess of Sussex was joined on the fresh-air outing by her friends, Markus Anderson and Heather Dorak, in California on Sunday after celebrating her son Archie's birthday on Saturday.It comes after it emerged that the King raised a glass to toast the fourth birthday of Prince Harry’s son Archie at Buckingham Palace yesterday in a moving tribute to the grandson he has barely seen.Despite the ongoing acrimony with Harry, who was on a plane back to the US within hours of his father being crowned, emotional Charles made a point of mentioning his absent grandchildren as well as those present on his big day.The poignant moment came at a private family gathering at the palace following his Westminster Abbey crowning and appearance on the balcony with Queen Camilla.It is understood that an invitation had been politely extended to Harry to join the family lunch but he decided to return to California to celebrate Archie’s big day.Meghan, 41, was dressed in an all-black athletic ensemble, along with a khaki jacket, which she tied around her waist during the outdoor excursion.The mother-of-two also wore a wide-brimmed beige hat, pink neckerchief, and large sunglasses for the hike.It was the first time she had been seen in public since her father-in-law's coronation on Saturday.",
        "Meghan was noticeably absent from the regal festivities in the UK this weekend, as she remained in the U.S. to celebrate her son Archie's 'lowkey' birthday at their Montecito home.",
        "Harry, who rushed back to California yesterday, did not seem to attend the hike. ",
        "Meghan has known Markus and Heather for several years - Markus holds a senior position at the Soho House private members’ club and has known Meghan since she was based in Toronto, Canada, filming TV show ‘Suits’. Heather has been Meghan’s pilates and yoga instructor for several years - and the pair often featured on Meghan's social media before she took down her accounts.  Meghan's latest outing comes just one day after her husband Prince Harry attended his father King Charles' coronation at Westminster Abbey in London.But the King's son slipped out of the venue with only the briefest of goodbyes and headed straight for Heathrow Airport in a blacked-out electric BMW.After just 28 hours and 42 minutes in the UK, he was back on the plane to California before his father and stepmother Queen Camilla had even finished having their official portraits taken. He was pictured smiling broadly as he arrived at the airport’s Windsor suite before his British Airways flight - still in morning suit and sporting his medals.",
        "But the King's coronation on Saturday was not the only important date in the family's calendar. It also coincided with son Archie's fourth birthday.Archie was born in 2019 with the Sussexes then having their second child, Lilibet Diana, in 2021. ",
        "Prince Archie enjoyed a ‘low-key’ fourth birthday party at home on Saturday as his cousins took center stage at the Coronation.Sources close to the Sussexes confirmed Archie had a ‘private celebration’ on his birthday at the couple’s £11 million mansion in Montecito, California, and a lemon cake baked by the Duchess of Sussex using fruit from their garden.‘[Prince Harry] was always determined to get back in time to spend part of Archie’s birthday at home,’ a source said. The Duke of Sussex is believed to have boarded a 3.45pm flight which would have seen him land in Los Angeles at 6.55pm local time. The drive to Montecito from Los Angeles airport takes about 90 minutes. The source said: ‘Harry was determined to be back in time to tuck Archie into bed.’ ",
        "When asked if any of the party guests included celebrity neighbors such as Oprah Winfrey, the source replied: ‘Some of their friends are celebrities, so yes, that’s likely. It will be a small, intimate gathering.’ Archie’s grandmother Doria Ragland was expected to be at the party, as well as Meghan’s close friend, make-up mogul Victoria Jackson, 65. ",
        "Another source told the Daily Mail that Meghan ‘stayed home to celebrate Archie’s birthday because she felt it would be inauthentic to do anything else’. The source added: ‘She wanted to minimize the drama.’ "
    ]
}