{
    "articleURL": "/news/article-12055351/Bitter-divorce-Sydney-couple-split-15million-refused-buried-other.html",
    "content": [
        "Bitter couple split estimated $15million fortuneThey refuse to 'lie beside each other for eternity'A wealthy Sydney couple had such a bitter divorce that they refused to be buried next to one another.",
        "The high society pair, who were splitting an estimated $15million fortune after 21 years of marriage, could only agree on one thing when dividing their money.  'I … accept that the parties do not now wish to lie beside each other for eternity,' Justice Robert Harper told the Family Court of Australia.",
        "This left the court to determine what to do with the adjoining burial plots the couple had already bought in a Sydney cemetery, The Daily Telegraph reported. Both the plots were in the husband's name so the wife suggested that he could be buried somewhere else. The husband disputed this and so the judge ordered that one of the plots be transferred into the wife's name so that the acrimonious couple could sort it out themselves. 'There was no dispute that either plot could be sold,' Justice Harper told the court. 'I will therefore order the husband to transfer one plot to the wife. Either party can then dispose of their plot thereafter as they wish.'The couple, who cannot legally be identified, married in 1983 but then separated in 2004.By 2018, their split had become so vicious that they took action against each other in the Family Court of Australia.The court heard their 'considerable' property pool was worth $15 million, including a $10million Sydney pad. ",
        "But the couple were at loggerheads over how much the house should go for if it did not meet the reserve price at auction. 'The husband proposed a regime involving a 10 per cent reduction of the selling price after the passing of each three-month period after the property is offered for sale by private treaty,' Justice Harper told the court.'The wife proposed a form of order that the parties would, in effect, accede to recommendations of price adjustment by the selling agent,' he said.The judge took the wife's side in the argument. 'I believe that a form of orders broadly consistent with the wife's proposal is more realistic and allows a sale of the property at a price which is more reflective of the market,' he told the court.He ordered the house be listed for sale with a reserve price of $10 million and if it failed to sell it should then be listed for sale in a private treaty until sold."
    ]
}