{
    "articleURL": "/wires/reuters/article-12046145/US-STOCKS-Futures-waver-PacWest-slide-offsets-Fed-pause-optimism.html",
    "content": [
        "Futures: Dow up 0.01%, S&amp;amp;P down 0.03%, Nasdaq up 0.22%",
        "May 4 (Reuters) - U.S. stock index futures wavered on Thursday as PacWest Bancorp exploring strategic options deepened concerns about the health of regional banks, while investors drew comfort from the Federal Reserve signaling a likely pause in its interest rate hikes.The central bank on Wednesday raised rates by 25 basis points to the 5.00%-5.25% range and signaled a pause in its policy tightening, giving officials time to assess the recent bank failures, U.S. debt ceiling situation and sticky inflation.U.S. stocks ended lower on Wednesday after Fed Chair Jerome Powell said that it was too soon to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.U.S. interest rate futures priced in a pause in tightening at the June and July policy meetings, according to the CME's FedWatch tool, and also factored in a more than 50% chance of rate cuts at the September meeting.The Fed over the past 14 months has raised rates by 500 basis points to tame price pressures in its most aggressive policy tightening since the 1980s.PacWest Bancorp tumbled 36.3% in premarket trading following talks with potential partners and investors about strategic options after shares of the regional lender and its peers got hammered amid fears of a worsening banking crisis.",
        "This comes after regulators seized First Republic Bank, with JPMorgan Chase agreeing to buy majority of the assets, marking the largest U.S. bank failure since the 2008 financial crisis.Shares of other regional lenders such as KeyCorp, Valley National Bancorp and Zions Bancorp fell between 4.5% and 6.6%, while Western Alliance Bancorp dropped 17.2% despite noting that it had not experienced unusual deposit outflows following the sale of First Republic.Investor concerns around banks have remained despite actions by regulators to contain a banking crisis that kicked off with the collapse of two mid-sized U.S. lenders in March.The KBW Regional Banking index and S&amp;amp;P 500 Banks index have lost around 29% and 15% so far in 2023.Major technology and growth stocks such as Meta Platforms Inc, Microsoft Corp and Alphabet Inc edged up between 0.3% and 0.8% in premarket trading on Thursday, helped by a fall in U.S. Treasury yields.Although the end of Fed's market-punishing rate-hike cycle may be in sight, uncertainty over stock valuations and the economic outlook are keeping investors on alert for more turbulence ahead.Moderna Inc, Paramount Global, Kellogg Co and Peloton Interactive Inc are scheduled to report quarterly results before markets open. Apple Inc results are due after the closing bell.Investors will also monitor weekly jobless claims for further clues on the state of the labor market.",
        "At 5:27 a.m. ET, Dow e-minis were up 3 points, or 0.01%, S&amp;amp;P 500 e-minis were down 1.25 points, or 0.03%, and Nasdaq 100 e-minis were up 28.75 points, or 0.22%.Qualcomm Inc slumped 6.7% after third-quarter forecasts missed estimates, while Etsy Inc gained 3% on beating expectations for quarterly revenue.(Reporting by Ankika Biswas in Bengaluru; Editing by Shounak Dasgupta)"
    ]
}