{
    "articleURL": "/femail/article-12039949/How-parking-fine-time-Australia.html",
    "content": [
        "Driver shared how to never pay a fineRevealed which ones aren't enforceable A money conscious driver claims he has found a fool-proof way to avoid paying parking fines - and notes it could save people hundreds of dollars. ",
        "The driver, known only as Jack, shared that parking tickets issues by private companies aren't legally enforceable, and can be thrown away and ignored.'Guys you do not have to pay a parking ticket issued to you by a private parking company,' he explained.'If you get one of these on your dashboard and its not issues to you by police or your local council then you can kindly grab that parking fine and wipe your behind with it.'But others have criticised his 'fool-proof' method and claim it isn't without risk. 'I tried not paying and they put debt collectors onto me lol how do you just not pay won't it ruin your credit if there is collections?' one person warned. ",
        "But the Melbourne-based runner held firm. 'It is technically not legally enforceable, its not a fine, its a breach notice,' he added.He added the companies 'cannot do anything to you legally' and have 'no right to your personal data' including your 'address or license number'.'They can't issue you an official legal penalty or follow this up  any further,' he added in the now viral TikTok.'You can take the ticket and throw it in the bin, you do not have to pay it, hope this helps,' he added.    ",
        "Under Australian law, only courts and governments can charge and impose parking penalties.This means private companies cannot issue fines.Queensland's Transport Minister Mark Bailey recently advised motorists to not pay invoices from private parking operators.The politician added that he's looking to 'stamp out' the practice and that motorists are being 'ripped off'.  'I'll be asking my department to review the situation and [be] working with other departments to find a solution because we can't have Queenslanders being scared into a rip-off,' he told ABC in January.'The advice I've been given is it is illegal to fine people in a private car park.' ",
        "Currently, a person parking on private property is a trespasser unless the owner of the land has given permission to park there, according to Australian Law Firm Holding Redlich.Unless there is an obvious 'no parking' sign or restriction such as a gate,  this permission is implied.As such, any claims made by private companies must be based on trespass and claimed for general damages.Many Aussies were shocked by the advice, while others shared their stories about not playing parking tickets. 'I've chucked out maybe around 400 + of these,' one person wrote.'As a employee of one of these companies I can confirm this is fact,' said another.",
        "'Yep, found this out in WA!' commented a third.'Why didn't I see this before?? I just paid the b******s!' wrote a fourth.'I've got 27 of these in my glove box,' another wrote. "
    ]
}