{
    "articleURL": "/wires/reuters/article-12046613/ECB-stop-reinvesting-cash-largest-bond-scheme.html",
    "content": [
        "FRANKFURT, May 4 (Reuters) - The European Central Bank will stop reinvesting cash from maturing bonds bought under its 3.2 trillion Asset Purchase Programme from July, it said on Thursday, taking another small step towards shrinking its oversized balance sheet.",
        "The ECB has been allowing 15 billion euros' worth of bonds, mostly government debt, to expire since March but policymakers have been calling for a full stop to reinvestments as markets have easily accepted the ECB's diminished role as a buyer.\"The Governing Council will keep reducing the Eurosystem´s asset purchase programme portfolio at a measured and predictable pace,\" it said. \"In line with these principles, the Governing Council expects to discontinue the reinvestments under the APP as of July 2023.\"Redemptions fluctuate, but about 148 billion euros' worth of debt held under the APP expires in the second half of the year. That means a halt to reinvestment would see an extra 58 billion euros' worth of maturities on top of the currently scheduled 15 billion euros per month.The ECB bought the bonds when inflation was too low, in the hope that pushing borrowing costs for businesses and households to near-zero would stimulate growth and get prices rising.But it now has the opposite problem: inflation is far too high and the bank is raising interest rates at a record pace to slow demand and get price growth back down to its 2% target.At 7.7 trillion euros, the ECB's balance sheet is already more than a trillion euros below its peak size but remains well above its historical average.",
        "Thursday's decision does not affect reinvestments in the smaller, 1.7 trillion euro Pandemic Emergency Purchase Programme, which are set to continue until the end of 2024.\"The Governing Council will continue applying flexibility in reinvesting redemptions coming due in the PEPP portfolio, with a view to countering risks to the monetary policy transmission mechanism related to the pandemic,\" it said. (Reporting by Balazs Koranyi; Editing by Catherine Evans)"
    ]
}