{
    "articleURL": "/wires/ap/article-12044681/Victims-Texas-mass-shielded-baby-9-year-old-loved-soccer.html",
    "content": [
        "CLEVELAND, Texas (AP) - A mass shooting that killed five people, including a 9-year-old boy, at a home in a rural Texas community has left a trail of anguish and sorrow that extends to Honduras and includes two newly orphaned children.",
        "A manhunt for the gunman culminated in the arrest of 38-year-old Francisco Oropeza on five pending counts of murder Tuesday. His partner was arrested Wednesday on allegations she hindered police.Oropeza had been shooting rounds on his property in Cleveland, Texas, north of Houston, and the attack occurred after neighbors asked him to shoot farther away because the gunfire was keeping a baby awake, police say.Adult victims of the shooting ranged in age from 18 to 31. Two were slain while shielding a baby and a toddler from gunfire. All were originally from the Central American nation of Honduras. Here are details that have emerged about the lives of the victims:DANIEL ENRIQUE LASOThe 9-year-old boy attended Northside Elementary in Cleveland where students assembled memorial offerings that included flowers, stuffed animals and a soccer ball.",
        "Laso loved soccer, and his third grade classmates all signed the ball. The school's principal said Laso had a contagious smile.The boy´s mother also died in the attack, while his father and other close relatives survived.Wilson Garcia, Laso's father, was one of the people who had talked with Oropeza about the gunfire noise before the attack.SONIA ARGENTINA GUZMÁNLaso's 25-year-old mother was at the front door as the gunman approached and was the first to die.",
        "Friends were staying with her at the home to attend a religious retreat. Occupants tried to shield themselves and children as the gunman walked up to the home and began firing.Wilson Garcia said he urged his wife to retreat but that she \"told me to go inside because `He won´t fire at me. I´m a woman.´\"Argentina Guzmán is among four victims of the shooting whose remains will be repatriated to Honduras.Her relatives in the Honduran village of La Misión already are in mourning.\"Like any immigrant, she went looking for a better future, because here in Honduras there is no work,\" Germán Guzmán said of his sister.DIANA VELÁSQUEZ ALVARADOThe 21-year-old was the mother of two children in the U.S. She left Honduras when she was still a teenager in search of opportunity, interrupting school studies.Velásquez Alvarado´s father, Osmán, said his daughter´s departure from Honduras seemed reasonable at the time and that she recently received residency status in the United States.\"But I never imagined it would be just for this,\" he said.Texas Gov. Greg Abbott drew wide backlash for initially calling the victims \"illegal immigrants\" and later apologized for the partially false statement.Honduran authorities said Velásquez Alvarado will be buried in the United States at the request of her husband and sister.",
        "JULISA MOLINA RIVERAThe death of Molina Rivera, 31, left two children without parents, according to officials in Honduras. Custody arrangements were being made.Witnesses to the deadly shooting said Molina Rivera and Velásquez Alvarado used their bodies to shield a baby and a 2-year-old girl from gunfire during the attack.JOSÉ JONATHAN CASAREZLittle information has emerged about the 18-year-old native of Honduras."
    ]
}