{
    "articleURL": "/sport/football/article-12057847/LA-captain-Javier-Chicharito-Hernandez-ANGRILY-puts-teammates-blast-Galaxys-abysmal-start.html",
    "content": [
        "Los Angeles fell defeat to the Colorado Rapids 3-1 in their most recent defeatThe Galaxy have a record of 1-3-6 to start the season and are in 13th place DailyMail.com provides all the latest international sports newsLos Angeles Galaxy captain Javier 'Chicharito' Hernandez called out his team for their early-season struggles following their 3-1 defeat at the hands of the Colorado Rapids on Saturday.",
        "'We need to do different things obviously to get out of [this]. I don't know what. We need to figure it out, but we cannot keep doing the same things and waiting for the same results,' Hernandez said.'It's very frustrating, man. I don't know what else to say.' The Galaxy have recorded only one win in their first 10 games of the season and currently sit 13th in Major League Soccer's Western Conference with a record of 1-3-6.'We need so many things to change starting from, I believe that more people need to come [speak to the media] to face things. We're the same people speaking, always,' the Mexican striker added. ",
        "'That's a thing that needs to change too, you know? We always speak in here, the same guys. So I think that should change in the beginning, and then on the training ground other stuff needs to change. Something needs to change, man. 'We need to be accountable. We need to see that the reality is not in the way that we are doing. We cannot say things are going to turn around doing the same things. We can't.' Hernandez also commented on the very noticeable chants from fans voicing their frustrations and said that they were well in their right to do so based off the clubs history.",
        "His words came as the Galaxy lost 3-1 to Colorado on Saturday night.'We're LA Galaxy, man. When I say we need to behave and understand that – they're giving you the chance to be the greatest,' Hernandez said. 'You're in the greatest f***ing organization in the USA. At the least, you give everything. And if teams are better than us, I can take that, I can take those losses. I can take that.''When El Trafico happened, we were way better. We beat ourselves. We were the better team and we lost. I take those ones. These ones, at home? Against a [conference] rival? Man, no. Not good enough. Not good enough. And yeah, the fans were right this time. They're right.' "
    ]
}