{
    "articleURL": "/wires/pa/article-12058159/Call-code-practice-removing-unsafe-cladding-heard-Parliament.html",
    "content": [
        "Developers should follow a legally binding code while repairing unsafe cladding to limit disruption for residents, ministers have been told.",
        "Proposals for a set of rules to govern how companies should carry out cladding remediation works will be tabled in the House of Commons on Tuesday.Conservative MP Tom Hunt has developed the proposals after hearing complaints from tower block residents in his Ipswich constituency, claiming some have been subjected to conditions he “wouldn’t feel comfortable with an animal living in”.He will seek to table a Cladding Remediation Works (Code of Practice) Bill, calling for binding rules for all companies carrying out cladding remediation works, with penalties for those who do not obey. You have got to minimise that disruption. You have got to make living in that building tolerable, and there has got to be decent communication, clear timescales  Tom Hunt MP  Good communication with residents and a clear timescale on the works would be expected under the MP’s proposal.Plastic wrapping was placed on the exterior of St Francis Tower, in Ipswich, as part of remediation works in May 2021.",
        "Mr Hunt claimed residents had “no real forewarning” about the impact of the ongoing works.He told the PA news agency: ”It was a complete shrink wrap. The material wasn’t breathable, so it let in no fresh air and it let in zero natural light.“It completely blocked all of that out. The residents were being expected to live in those conditions, conditions I wouldn’t feel comfortable with an animal living in.”",
        "On his proposals, Mr Hunt said: “People accept a degree of disruption. People are glad their buildings are being made safe. They need to be made safe.“But you have got to minimise that disruption. You have got to make living in that building tolerable, and there has got to be decent communication, clear timescales.“If you get a building agent or freeholder who is acting in an improper way, which has a detrimental impact on the quality of lives of hundreds of people, there needs to be a consequence.”He added: “I think this is going to become a bigger issue, because there will be more and more examples across the country and there will be more and more MPs who get more engaged on this. Residents must be the number one priority during any remediation. That’s why we are committed to bringing forward a code of practice that will set out how residents should be considered when works need to take place  DLUHC spokesperson  “If they can get this right, if they can get a good code of practice that hits all the key points, if they can work with industry partners, it could be a significant movement forward.”Ministers have previously said they aim to develop a code of practice alongside developers, residents and regulators over the summer.",
        "A Department for Levelling Up, Housing and Communities spokesperson said: “Residents must be the number one priority during any remediation. That’s why we are committed to bringing forward a code of practice that will set out how residents should be considered when works need to take place.“We are working with industry and residents to develop and publish it this summer, and we expect all those responsible for delivering remediation to comply with the code.”"
    ]
}