{
    "articleURL": "/news/article-12056331/Coronation-watched-peak-TV-audience-20-4m-King-crowned.html",
    "content": [
        "An average of 18.8 million people watched across 11 channels and servicesFollow our live blog for all the latest updates on the King's CoronationThe coronation of King Charles III at Westminster Abbey was watched by 20 million Brits yesterday.",
        "The lavish ceremony yesterday, which saw Charles and Camilla crowned, was broadcast simultaneously on a range of channels between 11am and 1pm, including BBC One and Two, ITV and Sky News. Thousands of people flocked to London to enjoy the party atmosphere yesterday, while millions remained at home and sheltered from the wet weather.An average of 18.8 million people watched across 11 channels and services, with audience figures peaking at 20.4 million when the King was crowned just after midday, according to overnight ratings released by the research organisation Barb.The audience figure, however, did not match the huge 29 million viewers of the late Queen Elizabeth II's funeral in September last year, which was broadcast across 50 TV channels.",
        "At the time, the BBC revealed that a staggering 32.5million viewers tuned to the broadcaster's coverage of the service at Westminster Abbey on its channels and caught up on iPlayer afterwards.Millions of people are thought to have watched the Queen's coronation on television in June 1953 - but there are no reliable figures, making comparisons with TV ratings of today difficult. The BBC was victorious in the fierce battle to be the leading broadcaster of yesterday's Coronation coverage.Despite a few slip-ups, including a series of intermittent audio glitches amid its coverage of the historic ceremony, 15.5 million people tuned into showings hosted by Huw Edwards on BBC One, BBC Two and the BBC News channel.  ",
        "ITV’s coverage secured 3.6 million viewers while Sky peaked at 800,000 people across Sky News and Sky Showcase.Sky News was met with backlash over its reporting on the 'Not My King' protests which saw police arrest several Republic campaigners as the Coronation festivities were underway. The Good Morning Britain Coronation Special on ITV descended into chaos yesterday morning after a presenter appeared to swear on the air, resulting in viewers wrongly accusing long-time host Susanna Reid of the slip-up.Similarly, the nation was left divided over BBC presenter Huw Edwards' commentary which saw him spending 'five minutes' talking about spoons. Sky host Kay Burley was also mocked online after she appeared to butcher Queen Camilla's name - calling her 'Camilly' - during today's broadcast.",
        "The BBC had positioned itself to be a leader in Coronation coverage ahead of this weekend's festivities - even offering a special one-off TV licence dispensation - but its broadcast was heavily criticised today following a slew of errors.Outraged royalists complained on Twitter after 'breaks in the sound feed' interrupted their viewing of the historic ceremony. Critics said the network's sound failure was 'shocking' especially since the BBC had 'months of preparation and years of anticipation' for the monumental event.The King's coronation had a lower combined audience than the televised address by former prime minister Boris Johnson in March 2020, during which he announced the first Covid-19 lockdown, which was watched by 28.2 million people.",
        "The ratings are also lower than the opening and closing ceremonies of the London 2012 Olympic Games, which had 24.2 million and 24.5 million viewers respectively on BBC One, and the final of the Euro 2020 football championship in July 2021, which attracted a combined total of 22.5 million on BBC One and ITV.It overtook the viewer ratings for the Queen's Platinum Jubilee concert, which took place in front of Buckingham Palace last June, as it was watched by an average of 13.1 million people on BBC One."
    ]
}