{
    "articleURL": "/news/article-12043347/Trump-wont-debate-Republicans-hes-afraid-nemesis-Chris-Christie-claims.html",
    "content": [
        "The former New Jersey governor blasted Trump for indicating he'll skip debatesTrump hinted he won't go due to his 'massive' leadsChristie said Trump wants to relitigate 2020 because his feelings are hurt.Former New Jersey Gov. Chris Christie is accusing Donald Trump of dodging debates because he doesn't have 'serious answers' to questions that might get asked.",
        "Christie, who shared the debate stage with Trump in 2016 only to get behind him after his own campaign fizzled after the New Hampshire primary, said Trump might stay away because he was 'afraid.'His comments come after Trump, who is doing a Town Hall with CNN next week, said he might stay away due to his lead over Republican rivals. 'I’m leading by 40 points. A lot of people say, \"Why would you do a debate when you have people at two and three and fifteen and fourteen [percent]?\"' he told interviewer John Catsimatidis, on WABC in New York last week. “People don’t debate when they have these massive leads,' he said.Christie, who has said he will decide this month whether to run for president, told host Hugh Hewitt in an interview Wednesday Republicans should have as many debates as possible. ",
        "'They should be as open format as they can be to allow for follow ups, to not allow people to give soundbyte-y answers that nobody believes will solve any problems. And anybody who’s serious about wanting to be president of the United States should be on the stage for every one of them.'During debates, 'you see how people respond on their feet. And that’s very important for any executive, because you know, the presidency is not a scripted exercise.'",
        "'And to the extent that President Trump doesn’t want to participate in them, people should wonder why. And I think it’s because he doesn’t have a lot of serious answers for the problems that are facing the country right now. All he wants to do is go back and re-prosecute the 2020 election because his feelings are hurt. He’s a child in that regard,' Christie said.Said Christie: 'If he really cares about the country – and I have deep questions about that – but if he really cares about the country, then he’s going to get up there, and he shouldn’t be afraid. I’m sorry to see that Donald Trump feels like if he gets on the stage, he’s at risk of losing his lead. If, in fact, his ideas are so great, if his leadership is so outstanding, then his lead will only increase if he gets on the stage, not decrease.'",
        "Christie, a former prosecutor who is credited with torpedoing Florida Sen. Marco Rubio's presidential campaign and who like Trump has cultivated a tough guy image, said repeatedly that Trump was 'afraid' to appear. But obviously, he’s afraid. He’s afraid to get on the stage against people who are serious. And I’m sorry to see that he’s that afraid of it, he said, bringing up leaders like China's Xi Jinping. 'This is a guy who seems like he’s afraid. And if he’s afraid, he has no business being president.'",
        "His comments came on a day Trump sat for a TV interview with former UK Independence Party leader Nigel Farage, who has advised him in the past. During that interview, he teed off on Megan and Harry, and aired his long-running grudge against windmills. And advisor to Trump, asked about his decision to appear at the CNN town hall next week, said his rivals were 'afraid' to go out of their comfort zone to appear on the network. Christie also spoke about the timetable on his own plans for a potential White House run. 'I will make a decision in the next two weeks.' His hits on Trump come after he said Florida Gov. Ron DeSantis wasn't a conservative."
    ]
}