{
    "articleURL": "/tvshowbiz/article-12041185/Gladiators-reboot-Father-son-TV-presenter-duo-confirmed-hosts.html",
    "content": [
        "The hosts of a Gladiators reboot have been announced - 23 years since the last series aired. ",
        "Bradley and Barney Walsh will present the BBC show, their latest television project together after The Larkins and travel show Bradley &amp; Barney Walsh: Breaking Dad.They are taking over the series after it was originally presented by Ulrika Jonsson  and John Fashanu on ITV from 1992-2000.The new series will feature some of the classic challenges including Duel, Hang Tough and The Eliminator as well as some surprise new tasks. Gladiators was always an important show for the Walshes as Donna, Bradley's wife and Barney's mother, used to choreograph the cheerleaders.",
        "Chase presenter Bradley even appeared on a celebrities vs jockeys Gladiators special in 1997.The father and son regularly visited the original set- and a young Barney took some of his first steps on the floor of the arena.Bradley said: 'Wow! I can't believe that I've been asked to be part of this iconic show. I used to sit backstage, or in the audience, every week watching my wife be part of this juggernaut and now I get to co-host a new version of Gladiators!!! 'Saturday night family entertainment at its best...Are you ready?!'Barney said: 'Gladiators has been a massive part of our family and it's an honour to be asked to co-host this iconic show. 'I'm so excited for everyone to see the spectacle, elite athletes and fantastic family entertainment that is Gladiators.'",
        "The show's new logo for the 11-part series keeps all the same elements as the original one, with a metal G in the shape of a triangle behind the title.But with a pop more colour, the new graphic features a red and blue outline and metallic shining colouring.The BBC has revealed that filming will take place in and around the spring school holidays at the Utilita Arena, Sheffield but has yet to announce the date it will air.Dan Baldwin, the Managing Director of production company Hungry Bear explained: 'Watching Gladiators LIVE in the arena is the perfect day out for all the family. 'Being close-up to the action is going to be an incredible experience like no other.'Plus, we're making the tickets free, so it won't cost you a penny to get in!'The original Gladiators aired on ITV from 1992-2000 and was adapted from American Gladiators which was syndicated between 1989 and 1996.American Gladiators was created by Johnny C. Ferraro and Dan Carr and developed by Johnny C. Ferraro.  "
    ]
}