{
    "articleURL": "/health/article-12051607/Im-gastroenterologist-five-things-never-eat.html",
    "content": [
        "Bacon, cheese and fried foods are just some that might be damaging your healthRead more: Doctors horrified after patient's scan reveals tapeworm infestationSupermarkets have a near-endless number of products to choose from when filling your shopping trolley.",
        "Sticking to plenty of fruit, veg and whole grains supports the body, boosts wellbeing and reduces the risk of developing chronic diseases, experts say.But beyond these categories, Dr Sarmed Sami, a consultant gastroenterologist who works in London, urges approaching some foods with extreme caution.From bacon and cream to fizzy drinks and ready meals, he told MailOnline there were five options that he'd rather avoid.",
        "Processed meatThese are meats preserved in processes involving smoking, curing, salting, and adding preservatives. And while they're high on taste, they're low on health benefits.Common processed meats include sausages, bacon, ham, and deli meats.Meat processing can help improve its texture and shelf-life but when eaten in excess they can also harm your health.Early animal studies have suggested salt may destroy certain strains of lactobacillus bacteria in the gut, although more research is needed.But more worrying is the addition of nitrates and nitrites, which are used to preserve their colour and flavour.",
        "Fruit, vegetables and whole grainsDr Sarmed Sami, a consultant gastroenterologist, advises including a large variety of plants in your diet every week.'Everyone is different, but generally speaking, incorporating a large variety of plants into your diet every week is a great way to get as many different types of fibre and nutrients as possible into your body,' he said.Dr Sami said: 'This helps promote optimum gut health diversity. This can include fruit, vegetables, wholegrains such as quinoa, bulgar wheat, oats, and nuts and seeds such as chia seeds, almonds and pumpkin seeds.'Herbs and spices 'In addition to this, consuming a variety of spices and herbs, such as turmeric, ginger and parsley, is also good for our guts.'Tinned and frozen fruit and vegBut don't just restrict your search for fruit and veg to the grocery aisle.'Tinned and frozen fruits and vegetables can still be nutritious and shouldn't be overlooked,' says Dr Sami.'Some tinned fruits and vegetables may contain added salt or sugar, so it's important to check the label before consuming them. Some tinned fruits are also packed in syrup, which can add additional calories and sugar.'It's best to select fruit and vegetables that have been packed in their own juice, which can help preserve nutrient content.'In some cases, frozen fruits and vegetables may even be more nutritious than fresh produce that has been sitting on a shelf for several days.'Drink enough water and get enough sleepOther good habits will also encourage a healthy gut microbiome. 'Ensuring that you are getting enough sleep and drinking enough water is particularly important,' says Dr Sami.'Studies have shown a clear link between gut health and sleep, and with those not getting enough sleep suffering from digestive problems such as bloating.'Water helps the digestion process, helping absorb nutrients and reduce inflammation in the digestive system.'",
        "According to the World Cancer Research Fund, these compounds can be converted into harmful chemicals called nitrosamines in the gut, which are considered a risk factor for colorectal cancer.Dr Sami, of the London Digestive Centre at The Princess Grace Hospital, part of HCA Healthcare UK, said: 'These foods are also low in fibre, a nutrient that helps promote a healthy microbiome by feeding beneficial bacteria, which help keep the gut lining healthy.'Processed meats are often high in saturated fat. 'These fats can cause an overgrowth of harmful bacteria in the gut, which may lead to gut inflammation and contribute to conditions such as inflammatory bowel disease.' High-fat dairy foods Dairy products include milk, cream and cheese, which provide the body with protein and a source of calcium.But despite their health benefits, dairy foods are not for everyone, says Dr Sami.Lactose intolerance is one of the most common food intolerances affecting 3.25million people in the UK, particularly those of African, Caribbean, and South American descent. Up to 90 per cent of adults can be affected among these population groups.This condition can lead to unwanted symptoms after eating dairy foods as lactose passes undigested into the large intestine, where bacteria ferment it. Symptoms include bloating, abdominal pain, gas and diarrhoea.",
        "He said: 'These foods are typically high in fat, although fat-free varieties are available. Saturated fat takes longer to digest, which can exacerbate symptoms of indigestion and reflux while also contributing to inflammation in the gut.'High-fat dairy products can also disrupt gut bacteria. 'The high sat fat content of dairy cream can increase bile acid production in the gut, which may cause changes in the microbiome,' he says.'A high intake of dairy foods in the diet has been associated with a decrease in Bifidobacterium. Hormones and antibiotics used in dairy farming may also be transferred to humans, negatively affecting the microbiome.'Deep-fried foodsThe only thing to recommend deep fried foods for is their taste. When it comes to our bodies they're a big no-no.'Fried foods can cause stomach problems as they slow down the emptying of the stomach due to high amounts of fat,' says Dr Sami.'This means that the food takes longer to digest and can result in nausea and abdominal discomfort.'Eating a lot of fat triggers the body to release bile from the gallbladder to help with its breakdown. 'Overeating fat can overload bile production, causing symptoms such as bloating, nausea and cramping.'The high temperatures used to fry foods also produce compounds called advanced glycation end products. ",
        "These compounds can be difficult for the body to break down, which may contribute to inflammation and oxidative stress in the digestive system.'Reducing the amount of fried food that you eat and how often you eat it will improve your gut health,' he says.",
        "Sugary drinks  Consuming sugary drinks brings no health benefits — and that includes fruit juice, if drunk excessively.Overdoing it on sugar is associated with weight gain, a risk factor for many diseases. It can also affect the health of your gut microbiome.",
        "'Excessive sugar in the diet can contribute to inflammation caused by spikes in blood sugar levels which can trigger the inflammatory response in the body. Inflammation can cause damage to the lining of the gut and increases the risk of gut-related diseases such as Crohn's disease or irritable bowel disease,' Dr Sami says.'Consuming high amounts of sugar can change the composition of bacteria in the gut, which may lead to an overgrowth of harmful bacteria and a decrease in beneficial bacteria.'This dysbiosis or imbalance can cause gut-related symptoms such as bloating, constipation and diarrhoea.'High amounts of sugar in the diet can cause discomfort in the gut. This can result from fermentation as certain bacteria feed on sugar producing excess gas.'",
        "Fizzy drinks are particular culprits (containing sugar and sugar-free). 'The carbonation of these drinks can result in a build-up of gas, which can cause bloating, cramps, acid reflux and constipation.'Ready meals They may be convenient but ready meals come at a cost.'Ultra-processed foods (UPF) often contain lots of added sugar, fat, salt as well as many other chemicals, preservatives, and emulsifiers, and are linked to metabolic changes and poorer health,' says Dr Sami.",
        "'UPF are made mostly or entirely from ingredients that have already been highly modified and this often changes the structure of the food. These changes can alter the properties of the food and how it is used by the body.'They can contain high levels of refined carbohydrates, saturated fats, salt, and chemical additives. They often lack dietary fibre, good sources of protein, and healthy fats.'Eating a high UPF diet is associated with a number of health conditions, including conditions such as heart disease, type 2 diabetes, irritable bowel syndrome, depression, asthma and cancer.'Not all processed foods are considered UPF, however, and many foods have to be processed in some way to make them digestible or safe to eat. But as a general rule, the more processed a food is, the less healthy it is for you.'",
        "Consultant registered nutritionist and advisor to Healthspan, Rob Hobson, reveals what bacteria is right for you",
        "Many parts of our body depend on the health of our intestines and scientific research agrees that we need to create a wide variety of good bacteria in our gut.But there is a great deal of confusion over the best way to boost the friendly flora in the gut.A recent survey by nutrition company Healthspan found that people are confused about the why, when and even what time of day they should be taking probiotics. Nearly a quarter of 2,000 people admitted that they took a probiotic supplement to support a specific health condition but then 67 per cent of people openly declared that they were unaware of what strains they needed to support their health.So what are probiotics? Simply put, they are live bacteria and yeasts. They are part of a diverse gut microbiome, the collection of trillions of bacteria that can support health, prevent long-term chronic disease and even boost mood.Live yoghurt is the most well-known probiotic food and contains strains such as Lactobacillus Acidophilus and Lactobacillus Casei. Similar strains are also found in yoghurt 'shot' drinks that have become very popular.Fermented foods such as kimchi, kefir, and miso also contain strains of bacteria that can support good gut health.But often diet alone cannot provide us with the right strains and levels of live bacteria we need to maintain a healthy microbiome.Ageing also has many effects on the body including the absorption of key nutrients and this extends to the diversity of your microbiota.Bacterial strains such as Bifidobacterium lactis have been shown to decline in later life and this reduced diversity of bacteria could open the pathway for disease-causing pathogens.Healthspan's Super-Pro 50 (60 capsules £29.95) is an advanced probiotic with over 50 billion friendly bacteria from four well-researched strains (Bifidobacterium Lactis Bl-04, Bifidobacterium Lactis HN01, Lactobacillus acidophilus La-14, Bifidobacterium planetarum Lp-115), as well as containing calcium, vitamin D3 and B6 all formulated to support digestive health, immunity and energy metabolism.Meanwhile, prebiotics are also important, helping probiotics to thrive. Prebiotics are the indigestible fibres fermented by gut bacteria producing short chain fatty acids supplying energy to the cells of your colon while also helping them flourish. Prebiotics can be found in onions, garlic, leeks, asparagus, bananas, and barley."
    ]
}