{
    "articleURL": "/wires/reuters/article-12053311/MLB-roundup-Red-Sox-beat-Phillies-7th-straight-win.html",
    "content": [
        "Chris Sale struck out 10 in six innings as the Boston Red Sox earned their seventh win in a row, a 5-3 decision against the host Philadelphia Phillies on Friday night.",
        "Sale (3-2) allowed three runs on seven hits and one walk. Richard Bleier, Chris Martin and Kenley Jansen each followed with a scoreless inning, and Jansen posted his seventh save.Zack Wheeler (3-2) had his worst home start of the season for the Phillies, giving up five runs (four earned) in 5 1/3 innings. He allowed seven hits and no walks while striking out five.Enrique Hernandez went 2-for-4 with a run and an RBI for Boston. Enmanuel Valdez finished 2-for-3 with an RBI, and Justin Turner, Rafael Devers and Triston Casas each drove in a run. Nick Castellanos led the way for Philadelphia at the plate, going 2-for-4 with an RBI double. J.T. Realmuto and Alec Bohm each tallied an RBI for the Phillies, who did all of their scoring in the fourth inning but wound up with their fifth consecutive loss.Cubs 4, Marlins 1Justin Steele continued his strong start by allowing one run through seven innings and Ian Happ clubbed a two-run home run as host Chicago snapped a three-game losing streak by beating Miami.In his seventh start of the season, Steele (5-0) lowered his ERA to 1.45, while yielding just a sixth-inning run along with six hits, no walks and four strikeouts. The left-hander tied Jake Arrieta's franchise record (since 1912) with 14 consecutive starts of allowing two earned runs or fewer.",
        "Luis Arraez went 3-for-4 for the Marlins to raise his majors-leading average to .437. Miami has been outscored 30-10 while losing four in a row after sweeping a three-game home series from Chicago last weekend.Rays 5, Yankees 4Randy Arozarena and Yandy Diaz hit home runs, and Wander Franco's RBI double in the seventh inning lifted Tampa Bay over New York in St. Petersburg, Fla.The Yankees had a four-run sixth inning, starting when Anthony Rizzo singled and scored on Gleyber Torres' double. After DJ LeMahieu walked, Harrison Bader launched a three-run homer off reliever Garrett Cleavinger to make it 4-4.Franco's go-ahead double for the Rays off came against Jimmy Cordero (1-1) and scored Diaz from first. Initially, Diaz was called out at the plate, but the call was reversed after Tampa Bay challenged it. Jason Adam closed out the ninth inning for his third save, and the first-place Rays opened a 10-game lead over the cellar-dwelling Yankees in the American League East.Blue Jays 4, Pirates 0George Springer homered and Chris Bassitt pitched seven shutout innings as visiting Toronto ended a five-game losing streak by beating Pittsburgh.Bassitt (4-2) gave up four hits and four walks while striking out five. He combined with Erik Swanson and Jordan Romano, who each threw one perfect inning, on a four-hit shutout. Vladimir Guerrero Jr. hit an RBI single and Daulton Varsho added an RBI double for the Blue Jays.",
        "The Pirates' losing streak reached five games. Pittsburgh starter Rich Hill (3-3) allowed four runs and eight hits in 5 1/3 innings, with five strikeouts and two walks.White Sox 5, Reds 4Elvis Andrus smacked a three-run home run and Luis Robert Jr. went 3-for-4 with a two-run homer to lead Chicago past host Cincinnati Reds.The White Sox won for the first time in Lance Lynn's seven starts this season. The 35-year-old Lynn (1-4) gave up four runs and eight hits in 6 2/3 innings and struck out eight without issuing a walk. Yasmani Grandal had two hits for Chicago, which has won four of its last five after dropping its previous 10 games.Jonathan India homered for the Reds, who have dropped four of their past five games. TJ Friedl had two hits and one RBI for Cincinnati. Hunter Greene (0-2) allowed five runs and seven hits over 5 2/3 innings. He struck out seven and walked one.Twins 2, Guardians 0Bailey Ober won a duel of young starting pitchers, overcoming rookie Peyton Battenfield as visiting Minnesota edged Cleveland on the strength of Max Kepler's two-run home run.The 6-foot-9 Ober, making his third start of the season, lasted seven innings, allowing just singles to Jose Ramirez and Oscar Gonzalez and a double by Josh Naylor. Ober (2-0) struck out six and walked one, throwing 66 of his 91 pitches for strikes, and lowered his ERA to 0.98 in the process.",
        "Battenfield retired the first 17 Twins hitters he faced before Christian Vazquez broke up the 25-year-old rookie's perfect game bid with two outs in the top of the sixth. Six pitches later, Max Kepler turned on an 87-mph cut fastball from Battenfield and crushed it 440 feet into the right-center field bleachers for a homer, spoiling Battenfield's shutout.Mets 1, Rockies 0Brandon Nimmo homered and Kodai Senga tossed six scoreless innings as New York snapped a three-game losing streak with a win over visiting Colorado.Senga (4-1) allowed two hits with four walks and four strikeouts while throwing a career-high 101 pitches. Drew Smith and David Robertson followed before Adam Ottavino stranded a runner at third base in the ninth for his fourth save.Colorado saw its season-high four-game winning streak come to an end after being held to five hits. Antonio Senzatela (0-1) made his season debut and gave up one run on three hits over five innings.Orioles 9, Braves 4Anthony Santander hit a pair of home runs, including his first career grand slam, to help visiting Baltimore beat Atlanta to open their three-game series.The Orioles have won 14 of their last 17 games and improved to 11-0 in series openers. Santander gave the Orioles a lead with a solo homer in the fourth inning off Atlanta starter Max Fried, and he put the game away with his slam in the seventh inning against Joe Jimenez. Santander has five homers for the season. The support made a winner out of Dean Kremer (3-1), who gave up one run on six hits in six innings.",
        "Fried (2-1) saw his streak of scoreless innings end at 20. In six innings, he allowed seven runs (five earned), on eight hits, two walks and seven strikeouts. The left-hander gave up two home runs, the first he has allowed all season.--Field Level Media"
    ]
}