{
    "articleURL": "/wires/afp/article-12043379/Kishan-Suryakumar-help-Mumbai-chase-215-IPL-win.html",
    "content": [
        "Indian stars Ishan Kishan and Suryakumar Yadav smashed blistering half-centuries to help Mumbai Indians chase down 215 in a six-wicket IPL win over Punjab Kings on Wednesday.",
        "Kishan (75) and Suryakumar (66) put on a key third-wicket partnership of 116 before Tim David and Tilak Varma steered the team home with seven balls to spare in the second match of the day in Mohali.Varma smashed the winning six in his 10-ball 26, and David, who starred in his team's previous match, made 19 as the two combined in an unbeaten stand of 38.\"When we started T20 format, 140-150 was a winning score. But look at this one,\" Mumbai skipper Rohit Sharma said.\"Plus one extra batter makes a huge difference as well. Not just to us but across the IPL. I just checked that the average score this IPL is 180.\"The batting effort boosted Mumbai's chances of making the play-offs and trumped an unbeaten 82 by Punjab's Liam Livingstone.Mumbai switched places with Punjab to be sixth in the 10-team table led by holders Gujarat Titans.Rohit went for a duck in the first over of Mumbai's chase and impact sub Nathan Ellis sent back fellow Australian Cameron Green for 23.The left-handed Kishan, who was named man of the match, and Suryakumar, who has recently hit form after a bad start this season, turned the match around with a flurry of fours and sixes.",
        "Suryakumar raised his second successive fifty in 23 balls with two sixes and two fours off Punjab's expensive England import Sam Curran.- Livingstone blitz in vain -Arshdeep Singh cut short Suryakumar's stay with a leaping catch at short third-man off Ellis and then sent back Kishan with his left-arm pace bowling but leaked 66 runs.Varma and David once again ensured a second straight win for the IPL powerhouse with five titles.\"We should have bowled tighter lines,\" Punjab skipper Shikhar Dhawan said.\"Because we saw the wicket and saw it's a very good wicket, we thought change of pace will work a lot and I feel Nathan bowled really well but other bowlers didn't step up today.\"Punjab rode on an unbeaten 119-run partnership between Livingstone and Jitesh Sharma (49) to post 214-3.Livingstone hit the opposition bowlers to all parts of the ground in his 42-ball knock and was especially severe on England teammate Jofra Archer, hitting the Mumbai pace bowler for three sixes in an over.Livingstone later revealed he had lunch with Archer before the game and was prepared for the challenge.Archer returned his most expensive IPL figures of 0-56.The first match of the day between Lucknow Super Giants and Chennai Super Kings was abandoned due to rain in the north Indian city of Lucknow.",
        "Lucknow reached 125-7 in 19.2 overs when rain stopped play and after an hour and 40 minutes of waiting, the officials decided the points would be shared between the teams."
    ]
}