{
    "articleURL": "/news/article-12040499/The-bitter-family-feud-Carrie-Fisher-Debbie-Reynolds-195M-estate-deaths.html",
    "content": [
        "Carrie Fisher's brother Todd claims his family has frozen him out of a ceremony to see to his sister posthumously get a star on the Hollywood Walk Of Fame It comes six years after a bitter feud erupted over the estates of the Star Wars actress and her mother Debbie Reynolds following their deaths in 2016The unexpected tragedies led to a dispute over the inheritance of their estates, worth an estimated combined $95millionCarrie Fisher's brother Todd claims his family has frozen him out of a ceremony to see to his sister posthumously get a star on the Hollywood Walk Of Fame. ",
        "It comes six years after a bitter feud erupted over the multi-million dollar estates of the Star Wars actress and her mother Debbie Reynolds. Carrie - who was witty and frank about her battles with addiction and bipolar disorder - died in December 2016 at the age of 60 after going into cardiac arrest on a plane with cocaine, morphine and ecstasy in her system. Her mother died a day later.Debbie had left the bulk of her $70million estate to her children with Eddie Fisher, Carrie and Todd, and her granddaughter, Billie. The 84-year-old did not think her daughter Carrie would die before her and died so suddenly she couldn't change her will. But issues arose as some family members, including Todd, allegedly believed Billie shouldn't be entitled to the inheritance from her grandmother because her mother died before Debbie.  The unexpected tragedies led to a dispute over the inheritance of their estates, worth an estimated combined $95million, according to Radar Online. ",
        "Her grief-stricken mother, Singin' In The Rain star Reynolds, died of a stroke a day later after telling Todd: 'I want to be with Carrie.' Todd publicly fumed at not being invited to see his late sister's Hollywood Walk Of Fame ceremony on Thursday. He told TMZ it was the family who froze him out of their 30-seat guest list.",
        "'Frankly, it's a distressing situation and I don't deserve to be put in this position,' said Todd, insisting that if Carrie had her way he would be asked to the event.'As the only brother of the Carrie Fisher, being omitted from this special day is truly hurtful,' calling his exclusion 'extremely hurtful and distressing as I was always a big part of everything my sister and mother did historically over their lifetimes.'He noted that he and Carrie were in attendance when Debbie got her second star on the Hollywood Walk Of Fame for live performance in 1997.Debbie received her first star on the Walk Of Fame for motion pictures in 1960, and five years later she got to place her hand- and footprints in front of what was then Grauman's Chinese Theatre with little Carrie and Todd standing by.Todd has now said that he himself kick-started the process to procure Carrie a star on the Hollywood Walk Of Fame, which she will finally get this Thursday.The date is May 4 - known as Star Wars Day because of the pun 'May The Fourth Be With You' - and apparently the final seating arrangement for the ceremony is in the hands of Disney, which controls the sci-fi franchise.",
        "Todd claims that when he protested his snub, Disney told him that Carrie's family had already occupied their allotted seats and the final decision was up to them.To hear him tell it, he was also advised not to bring the matter to Carrie's daughter Billie Lourd and cause her any further strain.Billie, who has followed her family's footsteps into acting, will be on hand at Thursday's ceremony to accept the honor on her mother's behalf.'It's heartbreaking and shocking to me that I was intentionally omitted from attending this important legacy event for my sister, Carrie,' Todd said.",
        "The snub follows a bitter family feud which erupted over the estates of Carrie and her mother Debbie Reynolds in 2017. Debbie had left the bulk of her $70million estate to her children with Eddie Fisher, Carrie and Todd, and her granddaughter, Billie, according to Radar. The 84-year-old did not think her daughter Carrie would die before her and died so suddenly she couldn't change her will. And Carrie's only child Billie, who she had with celebrity talent executive Bryan Lourd, reportedly believed her mother's share should have gone to her. 'While Debbie lost many millions in her lifetime to scheming husbands and bad business decisions — and even went bankrupt — she was worth a fortune when she died,' a source told Radar in July 2017. ",
        "'She left the bulk of her $70 million estate to her children with Eddie Fisher, Carrie and Todd, and her granddaughter, Billie Lourd. 'She never thought for a minute that Carrie would die before her and didn't plan for it. Then Debbie herself passed away so suddenly before changing her will.'I'm told Billie — Carrie's only child — believes her mother's share should pass straight to her.'Carrie would have got her share of the inheritance if their mother died first and when she died it would then have gone to her daughter Billie. 'But Todd thinks Carrie's share should go to him as Debbie's only surviving direct descendant,' the source said. 'Friends are bracing for a family war. It's so sad. Debbie would be devastated.'The disagreement is said to have been clear at the public memorial service for Carrie and Debbie with Billie not in attendance. ",
        "She was spotted at dinner with her dad Bryan Lourd and her then boyfriend Taylor Lautner at Catch in Los Angeles on the day of the event. But she is said to have not attended because she was grieving. Meanwhile, Todd reportedly banned his half sisters Joely and Tricia Fisher, from participating in the memorial.Joely posted an photograph at the service showing her 'giving the finger' and wrote: 'We were told we were not part of the 'show.'",
        "A representative for Todd confirmed Joely was furious at the time and said her post made it clear 'why Todd did not include her.'Carrie's estimated $25million fortune, including bank accounts, luxury vehicles, personal items and rights to Fisher's image, went to her daughter Billie.And she was likely to receive the profits from any sale of her mother and grandmother's $18million Beverly Hills estate, court documents revealed.Although in 2020, she started a complete renovation of the properties to make room for her growing family.Carrie and her mother Debbie lived side-by-side in the two California properties for more than 15 years before they tragically died within a day of each other in December 2016.Billie was her mother's only beneficiary and inherited the movie star's 2016 Tesla S, several LLCs holdings, life insurance policies and Fisher's intellectual property rights.Todd and Carrie were Debbie's children by her first husband Eddie Fisher, a singer who infamously abandoned the family to run off with Elizabeth Taylor."
    ]
}