{
    "articleURL": "/wires/ap/article-12053927/Burials-set-Serbia-victims-mass-shootings.html",
    "content": [
        "BELGRADE, Serbia (AP) - Heart-wrenching cries echoed as funerals were held in Serbia on Saturday for some of the victims of two mass shootings that happened just a day apart this week, leaving 17 people dead and 21 wounded, many of them children.",
        "The shootings on Wednesday in a school in Belgrade and on Thursday in a rural area south of the capital city have left the nation stunned with grief and disbelief.Though Serbia is awash with weapons and no stranger to crisis situations following the wars of the 1990s, a school shooting like the one on Wednesday has never happened before. The most recent previous mass shooting was in 2013 when a war veteran killed 13 people.The shooter on Wednesday was a 13-year-old boy who opened fire on his fellow students, killing seven girls, a boy and a school guard. A day later, a 20-year-old man opened fire randomly in two villages in central Serbia, killing eight people.Classmates and hundreds of other people cried inconsolably as one of the girls killed in the school shooting was laid to rest in Belgrade in a small white coffin that was covered with heaps of flowers. Overwhelmed by grief, the girl's mother could barely stand. One girl collapsed during the service amid screams and sobbing.While the country struggled to come to terms with what happened, authorities promised a gun crackdown and said they would boost security in schools. Thousands lit candles and left flowers near the shooting site in Belgrade, in an outpouring of sadness and solidarity.",
        "\"My soul aches for them,\" said Vesna Kostic, who came to pay her respects outside the school on Saturday. \"I keep looking for a cause, a reason why this has happened to him (the shooter), why this has happened to us.\"Serbian media reported that four of the eight children killed in the school shooting, as well as the Vladislav Ribnikar school guard, were buried at cemeteries in Belgrade on Saturday, the second day of a three-day mourning period for the victims.Some 50 kilometers (30 miles) to the south, a mass funeral was held in the small village of Malo Orasje for five young men who were gunned down in the shooting rampage on Thursday evening.Sobbing mourners lined up to light candles while waiting for the coffins to be placed on five benches outside the village church for a service.\"Five graves! He (the killer) shut down five families,\" one villager told N1 television. \"How could this happen?\"Serbian police have said that the suspected shooter stopped a taxi after his rampage and made the driver take him to a village further south, where he was arrested on Friday. Officers later said they found weapons and ammunition in two houses he was using there.The suspect, identified as Uros Blazic, told prosecutors during questioning on Saturday in the central town of Smederevo that he shot people he didn't personally know because he wanted to sow fear among residents, RTS state television reported. He faces charges of first-degree murder and unauthorized possession of guns and ammunition.",
        "The motive for both shootings remained unclear. The 13-year-old boy, who is too young to be criminally charged, has been placed in a mental clinic. His father was arrested for allegedly teaching his son to use guns and not securing his weapons well enough.The suspected village shooter wore a pro-Nazi T-shirt, authorities said, and complained of \"disparagement,\" though it was unclear what he meant. Serbia's populist President Aleksandar Vucic promised the \"monsters\" would \"never see the light of day again.\"Those wounded in the two shootings have been hospitalized and most have undergone complicated surgical procedures. A girl and a boy from the school shooting remain in serious condition; the village victims are stable but under constant observation.The school shooting left six children and a teacher wounded, while 14 people were wounded in the villages of Malo Orasje and Dubona. The dead in Dubona included a young, off-duty policeman and his sister.Authorities released a photo showing the suspected shooter upon arrest - a young man in a police car in a blue T-shirt with the slogan \"Generation 88\" on it. The double eights are often used as shorthand for \"Heil Hitler\" since H is the eighth letter of the alphabet.Apart from the gun crackdown, officials have announced stepped-up monitoring of social networks and the media. Already by Saturday, several people had been questioned for posting threats or videos supporting the killers on social networks, the Tanjug news agency reported.",
        "Serbia's education ministry outlined a crisis plan for the students of Vladislav Ribnikar school to gradually return to classes next Wednesday. A team of experts, backed by the U.N. children's agency UNICEF, will offer support and oversee the process, a ministry statement said.Experts have repeatedly warned that decades of crises and economic hardship, coupled with corrupt institutions and a high level of intolerance in public speech and politics, could push some people over the edge.The populist-led Balkan country has refused to fully face its role in the wars of the 1990s, war criminals are largely regarded as heroes and minority groups routinely face harassment and sometimes physical violence.\"The question now is whether our society is ready to reject the model of violence,\" psychologist Zarko Korac warned. \"When you glorify a war criminal you glorify his crimes and you send a message that it is legitimate.\""
    ]
}