{
    "articleURL": "/tvshowbiz/article-12047133/Emily-Atack-flashes-hint-cleavage-plunging-white-blouse-alongside-stylish-Laura-Whitmore.html",
    "content": [
        "Emily Atack flashed a hint of cleavage while attending Laura Whitmore's Love &amp; Roses launch event at the Tree House hotel in London on Thursday.",
        "The presenter, 33, showed off her chic sense of style in a low-cut white blouse and cream trousers.She paired the look with a mint green blazer and and added inches to her enviable frame with white strappy heels.The beauty styled her blonde locks in a stylish up-do, with two strands falling either side of her gorgeous face.Stepping out in the bright London weather, she threw on a pair of black shades and made her way into the event.",
        "The woman of the hour, Laura, looked glamorous for the big day in a bright orange top and pink culotte shorts.The former Love Island host, 37, put on a leggy display in the summer chic outfit and carried a matching pink blazer in her arms.She opted for a pair of nude platform heels and stunned with a gorgeous palette of make up, including a swipe of pink lipstick.Laura styled her blonde tresses straight across her shoulders and accessorised with dainty gold jewellery and hoop earrings. Laura's new venture with Love &amp; Roses marks the brand's first ever A-list collaboration.As part of her launch, she created a 25-piece collection packed full of summer-ready staples including cotton sundresses, cocktail-ready midi dresses, and billow-sleeved blouses in a range of fabrics. ",
        "Also turning up for the big event was Ashley Roberts, who cut a stylish figure in oversized grey trousers and an oversized red and black racer jacket.The beauty looked incredible for the day and teamed her chic look with a red handbag and black sunglasses.",
        "Dancing On Ice's Oti Mabuse also looked glamorous for the event, as she opted for an all-white ensemble with a dress and toe-pointed heels.The stunning dress featured a lace detail along the hem and a flattering wrap around the waist.Meanwhile, pregnant Janette Manrara showed off her blossoming baby bump in a black floral dress.The It Takes Two host nailed summer chic as she paired her look with a white blazer and red heels.Zara Martin also made a sophisticated entrance in a pink and white tweed blazer.The beauty added a pair of blue denim jeans and lifted her frame with beige heels. "
    ]
}