{
    "articleURL": "/news/article-12056669/Gov-Abbott-Best-way-decrease-gun-violence-address-mental-health.html",
    "content": [
        "Texas Gov. Abbott said mental health is the biggest factor that needs addressing in order to decrease the massive spike in gun violence'We've seen an increased number of shootings in states with easy gun laws, as well as states with very strict gun laws,' he arguedNew audio footage reveals how hero cop ran towards the active shooter and took him down after he shot at least a dozen people at a mall in Allen, TexasGreg Abbott insists the best way to address the exponential increase in gun violence is to address the mental health problems at the root of the issue.",
        "The explanation from the Texas governor comes after his gun-friendly state saw yet another mass shooting on Saturday that left nine people dead at a mall, including the gunman.Gov. Abbott also dismissed critics' claims that the lax gun laws in the state are to blame for the increased mass shootings. Instead, he said that all states have been experiencing an increase in gun violence in recent years.'We need to recognize the reality we've seen across the United States over the last year or two, and that is an increased number of shootings in both red states and blue states,' Abbott told Fox News Sunday. 'We've seen an increased number of shootings in states with easy gun laws, as well as states with very strict gun laws.''I think that the state in which the largest number of victims occurred this year is in California, where they have very tough gun laws,' he added.",
        "A gunman with an AR-15 and wearing full tactical gear opened fire at an H&amp;M clothing store in the Allen Premium Outlets in Allen, Texas on Saturday afternoon.He gunned down eight people, including children, before a hero cop took out the shooter. The cop was on scene for an unrelated call but rushed over when he heard the gunshots.",
        "'One thing that we can observe very easily – and that is there has been a dramatic increase in the amount of anger and violence that's taking place in America,' Abbott said in his Sunday morning interview.'And what Texas is doing in a big time way, we are working to address that anger and violence by going to its root cause, which is addressing mental health problems behind it.'The shooting comes almost exactly a year after another mass shooting shook Texas in Uvalde last May at the Robb Elementary School.New audio footage of the most recent shooting reveals how the unnamed hero officer made a frantic phone call begging for his colleagues to join him on the scene, radioing: 'I need everybody I got.'He bravely ran towards the active shooter - who was armed with 60 rounds and had shot over a dozen people by this point - and killed him.Around two minutes after first calling for backup, the cop said: 'I got him down.' Minutes later, another voice is heard on the radio saying: 'We got victims. I need an ambulance.' The FBI have raided the dead suspect's home following the civilian massacre.  ",
        "A stampede of hundreds of shoppers were seen racing out of the complex while gunfire rained out - as security and police attempted to shepherd them to safety. ",
        "People in the store were frantically ushered into lockable rooms, and when they eventually got the all-clear to come out, they saw the broken windows, trails of blood by the door, and bloodied bodies covered in sheets.  Dashcam video showed the gunman getting out of a car and shooting at people on the sidewalk on Saturday afternoon. More than three dozen shots could be heard as the vehicle that was recording the video drove off. The gunman was using an AR-15-style gun during the mass shooting, and was dressed in full tactical SWAT gear. Allen Fire Chief Jonathan Boyd confirmed that seven people died at the scene, including the gunman, and then a further two victims died in hospital. Three of the wounded were in critical condition in the evening, and four were stable, Boyd said in an update on Saturday night. A Dallas-area medical group said it was treating victims as young as five-years-old. Investigators have confirmed that they believe the shooter was working alone, but they have not yet released any motive for the devastating killings.  Fontayne Payton, 35, was at H&amp;M when he heard the sound of gunshots through his headphones. He said: 'It was so loud, it sounded like it was right outside.'I pray it wasn't kids, but it looked like kids,' he said. ",
        "The bodies were covered in white towels, slumped over bags on the ground. 'It broke me when I walked out to see that.'Payton then saw the body of the dead shooter - which was the only one not covered, he recalled.  ",
        "Another witness, Kimberly Blakey, said she and her daughter, 14, were among the crowd of people rushing to flee the parking lot after the gunfire started.She said the raining bullets were 'non-stop.' Her car got shot at during the ordeal as she tried to escape. Blakey told CNN: 'I told my daughter to get down. I could hear her start praying.' Another witness, Sheliza Ramlall, who was in the Nike store when the violence broke out, said: 'I had the most horrifying experience earlier. I was standing in line at the Nike store when all of a sudden people started to scream and run. 'The people in the doorway saw the man with the gun outside and raised the alarm. All of us in line dropped to the floor and started to crawl looking for a hiding place while falling over each other. 'I crawled behind the counter. At that moment, I realized that we were right in plain sight and and figured that I needed to get away from the front. ",
        "'As I looked to the back of the store, I heard someone saying 'get to the back, get to the back' and everyone started running at that point. An employee opened the back door and let us out. We are standing by the roadside shaken, crying, and hugging each other.'Not knowing where the gunman was or what was happening on the other side was terrifying but I wanted to get out of there so I left the crowd and started to flag the cars down to give me a lift. 'An elderly woman stopped and I hopped in a panic. She started to tell me about the gunshots she heard and drove me to my car. I raced out of there with an elevated heartbeat. 'I am grateful for our brave first responders who stopped the shooter and helped the people to safety.'",
        "Mayor Ken Fulk said in a statement on Saturday night: 'Today is a tragic day for the City of Allen, our citizens, our friends and visitors who were at the Allen Premium Outlets. We know you are grieving, we are grieving.'Allen is a proud and safe city which makes today's senseless act of violence even more shocking. However, I want to commend our police and fire departments for their quick response. ",
        "'Their thorough training not to hesitate to move toward the threat likely saved more lives today. We also want to thank all of our surrounding municipalities and law enforcement agencies for offering their assistance at the scene. 'This collective effort is what makes our North Texas communities united.' Texas Governor Greg Abbott described the shooting as an 'unspeakable tragedy.'Witnesses have recalled the horrific moments they realized they were in the midst of a mass shooting - with one man, Steven Spainhouer, saying he rushed to desperately save a child who had been shot.His own son was working at the H&amp;M store when shots were fired.Spainhouer told CBS News: 'I never imagined in 100 years I would be thrust into the position of being the first first responder on the site to take care of people.'The first girl I walked up to was crouched down covering her head in the bushes, so I felt for a pulse, pulled her head to the side and she had no face.'  He said she was already beyond saving.Still set on saving the mess of victims, Spainhouer recalled how he then found another child, who survived the barrage of bullets by being covered by his protective mother, who he said was among eight to die by the gunman.Spainhouer added: 'When I rolled the mother over, he came out.'I asked him if he was OK and he said, 'My mom is hurt, my mom is hurt.''Rather than traumatize him any more, I pulled him around the corner sat him down and he was covered from head to toe.  [It was] like somebody poured blood on him.'  ",
        "In recent years, Texas has witnessed some of the most gruesome and deadly mass shootings in America.Many believe it's partly because of the state's loosened gun laws which have come into effect in the past few years.In September 2021, a 'constitutional carry' law came into effect, allowing most Texas who legally own a firearm to carry it openly in public without obtaining a permit or training. At the time, Gov. Greg Abbott declared that the law 'instilled freedom in the Lone Star State.' Just eight months after the pro-gun law was passed, Uvalde, Texas experienced one of the bloodiest school shootings in US history at Robb Elementary School. A total of 19 children were killed, along with two teachers, by gunman Salvador Ramos. The gunman, 18, wrote 'LOL,' an acronym for 'laugh out loud,' on a whiteboard using the blood of his innocent victims. For years in Texas, Republicans have waved aside efforts to tighten gun laws after mass shootings, and even expanded gun rights after the 2019 attack on a Walmart in El Paso. "
    ]
}