{
    "articleURL": "/wires/afp/article-12042199/No-exit-Sudanese-trapped-war-passports-left-shut-embassies.html",
    "content": [
        "As Sudan has descended into bloody chaos, all Rami Badawi wants is to escape the country with his family, but there is a major hitch: his passport is locked inside the shuttered French embassy.",
        "Before fighting broke out on April 15, dozens of unsuspecting Sudanese citizens had applied for visas for journeys abroad, handing over their travel documents along with other supporting papers.But since the outbreak of violence, one foreign mission after another has shut its doors and evacuated its diplomatic and consular staff, leaving many of those passports missing and their holders stranded in the war zone.\"My family refuses to travel outside the country without me,\" the 29-year-old Badawi said, but \"my passport is trapped at the French embassy in Khartoum\".Badawi said he had handed over the passport on April 4 and was supposed to pick it up two weeks later, ahead of a planned trip to France to be trained in agricultural technology.",
        "Ever since, he and his six family members have been sheltering at home, trying to weather the storm of deadly urban combat outside as food and other supplies have dwindled dangerously.As warplanes thunder overhead and gunfire echoes through the streets despite several truce agreements, many in Badawi's situation are both terrified and frustrated about being unable to escape.- 'No response' -Another Sudanese, Iqbal Belah, 65, said she was eligible for a \"family reunion\" visa in Germany where her husband and son live.",
        "But, \"with the embassy closed and without my passport\", she said she does not know whether she will ever be able to join them.",
        "For now, she is focused on a more immediate escape plan -- leaving her battle-torn neighbourhood.\"We are a few metres away from the fighting,\" she told AFP. \"My seven-year-old granddaughter trembles at every bombardment.\"Her father and I hold her tight and try to reassure her, but nothing helps, she never stops shaking.\"Khartoum, a city of five million, has borne the brunt of the war between the army led by Abdel Fattah al-Burhan and the paramilitary Rapid Support Forces commanded by his deputy turned rival Mohamed Hamdan Daglo.About 550 people have been killed and more than 4,900 injured since the fighting erupted, according to official figures, and the real death toll is feared to be much higher.Stray bullets frequently pierce the walls and windows of people's homes -- including that of Ramah Essam, 30, who gathers his family to huddle in the least exposed corners of their flat.\"The situation is catastrophic,\" he told AFP.A gastroenterologist, he had been due to travel to Johannesburg for a fellowship, but the South African embassy has been out of reach.",
        "After the battles started, \"for the first three days there was no electricity or communications,\" Essam said.When power eventually came back and he tried reaching the embassy by phone, there was \"no response\".",
        "\"There are local employees in every embassy,\" Essam said.\"They could have given the passports to those employees to announce a place to hand them back to us.\"- 'Life is threatened' -",
        "Most embassies have been shuttered since foreign governments rushed out diplomats and their families by road, air and sea in a mass exodus.There has been one known case where a foreign mission handed over passports to local staff -- the Chinese embassy, which posted two numbers on Twitter and, when contacted, invited people to visit and retrieve their passports.A Dutch government website said officials \"are actively looking at how to support\" Sudanese whose passports had to be left behind at the embassy, and urges them to email the foreign ministry.The Dutch embassy, responding to a user on Twitter, said in a statement: \"We deeply regret the current situation you're in. We were forced to close the embassy and evacuate our staff.\"Unfortunately, this means we can't get to your passport.\"Many Sudanese government buildings have been targeted in the fighting, and Sudanese civil servants who had already been hiding out have been put on open-ended leave.Even if people wished to venture out to try to apply for a new passport, this would be extremely dangerous.",
        "\"If you go outside, your life is threatened,\" said Badawi.Emma DiNapoli, a UK-based lawyer specialised in international humanitarian law, said that \"what is striking is that the governments involved have not yet taken any action\".\"Governments could be liable,\" said DiNapoli, stressing that international humanitarian law \"guarantees freedom of movement\"."
    ]
}