{
    "articleURL": "/tvshowbiz/article-12048861/Priyanka-Chopra-popular-boys-teen-father-installed-bars-bedroom-window.html",
    "content": [
        "Priyanka Chopra has revealed her father installed metal bars over her bedroom window when she started dating as a teenager.",
        "The Indian actress, 40, who was crowned Miss World aged 18, said the incident occurred after one lovestruck teen jumped onto her balcony.Detailing what happened, she said: 'One of them jumped onto my balcony at night, I saw [the teen] and screamed. My dad came and he went away'.'The next day, my dad was like, 'You need rules. F*** this!' Bars, all your jeans are confiscated, you're going to wear Indian suits'.'Priyanka was born in Jamshedpur the daughter of two doctors and grew up with a brother, Siddharth, she was crowned Miss India before going on to win Miss World in 2000. ",
        "It comes after the stunner slammed the star-studded Met Gala after attending the event in NYC. Turns out the wife of Nick Jonas felt the dinner would have been more satisfying if the caterers had served some bread and butter. 'There was no bread for dinner […] I was so hungry after,' the India born star told Good Morning America on Thursday.'Maybe I have unrealistic expectations, but one roll of bread would be sufficient.' The dinner menu consisted of 'chilled spring pea soup with baby vegetables, lemon crème fraîche, and truffle snow, followed by Ōra King salmon with vegetable nage, asparagus, pickled strawberries, and radish—all served on vintage china,' reported Vogue. ",
        "Priyanka said her spouse came to the rescue: 'My husband ordered pizza by the time we got to the hotel, so we were fine.'And Chopra admitted that her criticism may have gotten her kicked off the guest list for 2024. 'There goes my invite for next year. If you don't see me at the Met, you know why.' The Quantico actress wore a pale pink satin dress that showed her legs while on the morning program.And she was joined by actor Sam Heughan to discuss new rom-com film Love Again.",
        "They also touched on karaoke singing Celine Dion's classic hits after days of filming, as well as shooting with Dion as well as Chopra's husband, Nick.GMA also gave viewers an exclusive first listen to Dion's new track I'll Be from the motion picture soundtrack.The synopsis reads, 'Coping with the loss of her fiance, Mira Ray sends a series of romantic texts to his old cellphone number, not realizing it was reassigned to journalist Rob Burns. Rob becomes captivated by the honesty of her words in the beautifully constructed texts. When he's assigned to write a profile of superstar Celine Dion, he enlists her help to figure out how to meet Mira in person -- and win her heart.'",
        "Priyanka's Met Gala food comments come after Teyana Taylor said she ate a plate full of Chick-fil-A she brought herself.Teyana, 32, was called out by tablemate Pusha T, 45, who joked she was 'embarrassing' him for bringing the fast food to the exclusive bash.'@teyanataylor is embarrassing me. She brought @chicfilausa to the #MetGala. I want her away from me... #HARLEM,' he wrote on an Instagram video capturing her plate full of fries, fried chicken, with a side of dip.Even Usher, 44, tried to interfere - the R&amp;B artist chuckled at the sight of Teyana munching on her fast food.'#HARLEM @teyanataylor @usher tried to stop her...' Pusha T posted, along with a face slapping emoji."
    ]
}