{
    "articleURL": "/wires/reuters/article-12049125/Tommy-Fleetwood-round-Wells-Fargo.html",
    "content": [
        "Englishman Tommy Fleetwood set the early pace at the Wells Fargo Championship with a 6-under-par 65 on Thursday in Charlotte, N.C.",
        "Fleetwood tied his lowest career first-round score on the PGA Tour to establish a one-shot lead over Xander Schauffele, Kevin Streelman, Taylor Moore, Ryan Palmer and South Korea's K.H. Lee, who shot 66.Another shot back at 67 are Patrick Cantlay, Adam Scott of Australia and Tom Kim of South Korea as part of a larger tie for seventh. Justin Thomas joined three-time tournament champion Rory McIlroy of Northern Ireland in a tie for 16th at 3-under 68.Fleetwood got his round going with an eagle at the par-5 seventh following six straight pars to begin his day at Quail Hollow Club. He sailed his second shot over the water hazard and stuck it 8 feet away for an eagle putt.He followed that with a birdie at No. 8 and added three more on the back, including Nos. 17 and 18, while avoiding bogey all day.\"There are plenty of players that shoot great rounds around here,\" Fleetwood said. \"It's such a beautiful golf course and it's a pleasure to play, it really, really is, but you just have to play well and that's all there is to it. I enjoy the challenge, I loved playing today and having a score going and playing like that. I'm looking forward to whatever the week holds. It's a great course to come and play, but it can just beat you up at times and today was my turn.\"",
        "Fleetwood, 32, has had success in Europe but is hunting for his first win on American soil. He has earned 22 top-10 finishes on tour since the start of 2017-18, the third-most of any player without a win in that time.\"Just the consistency of my work and consistency of what I'm doing, that's all I want to do and that's all I want to look at and then, hopefully, the scores and the results show that,\" Fleetwood said. \"And then, yeah, more days like today will be great.\"As a \"designated\" event with a $20 million purse, the field was littered with elite players like Schauffele, No. 5 in the Official World Golf Ranking. Schauffele managed to reach 7 under through 15 holes but bogeyed Nos. 16 and 18 to cost himself a share of the lead or better. His tee shot at the 18th found a creek left of the fairway.Before those missteps, Schauffele had five birdies plus an eagle at the par-5 10th.\"I had a big enough head start on the course that I figured giving some back wouldn't hurt me too much,\" Schauffele said.World No. 4 Cantlay, like Fleetwood, managed to eagle the seventh hole late in the day after starting his round on the back nine. His eagle came via a 26-foot putt.",
        "Joe LaCava, the longtime caddie for Tiger Woods, is on Cantlay's bag this week. LaCava will be Cantlay's full-time caddie moving forward.\"We've known each other a few years now and he's a pro and I've been doing it a little while now, so it's pretty easy transition,\" Cantlay said.Kim, a 20-year-old up-and-coming star ranked 19th in the world, was bogey-free on the day with four birdies.McIlroy, playing on his 34th birthday, made four birdies and one bogey in his first start since a surprising missed cut at the Masters.\"Nice to feel like I played well,\" McIlroy said. \"I didn't want to spend my birthday afternoon grinding on the range, so it was nice to play OK.\"Defending champion Max Homa opened with a 1-under 70. Jordan Spieth tarnished a decent round with a triple bogey 7 at the last hole -- finding the water twice and needing two drops -- to come in at 1-over 72.--Field Level Media"
    ]
}