{
    "articleURL": "/femail/article-12049997/Kate-Middleton-skips-meet-royal-fan-hands-flowers.html",
    "content": [
        "Kate Middleton stopped to chat with royal fans during her visit to Soho yesterdayREAD MORE:  Prince and Princess of Wales hit pub and pose for selfies in SohoThe Princess of Wales delighted royal fans with the skip in her step as she met with well-wishers in Soho yesterday. ",
        "The mother-of-three and her husband Prince William, 40, were in high spirits as they took the Elizabeth Line to the Dog sand Duck pub in London's West End, where they greeted by hundreds of fans. And Kate, 41, put on an animated display during the engagement two days before King Charles' coronation at Westminster Abbey on Saturday. Eagle-eyed fans spotted the skip in the royal's step as she rushed towards a well-wisher holding out a bouquet of flowers in a moment shared on TikTok. Dressed in a vibrant recycled Eponine coat and a white Suzannah dress, the Princess of Wales thanked the fan for the bouquet and heard how he would be busy working throughout the historical weekend. ",
        "In the short clip, an excited Kate showed off her party spirit, hopping and skipping as she made her way to greet the royal fans who had come to greet her and her husband in Soho yesterday. Her face lit up as she saw a man holding out a lovely bouquet of flowers, and she swiftly approached him, warmly holding his hand. 'Thank you so much, it's very sweet of you to bring flowers. I really appreciate it, thank you,' the royal said with a beaming smile, as he handed over the flowers. ",
        "She then asked the man whether he would be working over the weekend, saying: 'I was just saying to these guys, there are loads of people celebrating, but there are a lot of people working.' Upon hearing that the man was a florist and that he would be working over the coronation celebrations, the mother-of-three thanked him again for the bouquet he gifted her.  'Have you been busy with the coronation bouquets?' she asked the florist, who agreed the event had brought him a healthy amount of business. 'I'm so grateful that everyone's come to say hi,' Kate added, gesturing to the royal fans gathered around them.Royal fans were delighted to see the sweet interaction unfold after it was shared on social media. ",
        "'She jumped to him to receive the flowers,' one noted. 'Her wee skip of excitement to go speak to him. Aww she's the best,' one said.  'Catherine is always elegant and compassionate,' one said. 'I'm in awe of how she does small talk. I would never be able to do this! She is so poised and warm,' one said. 'I love her, so classy,' another wrote.'She had a gift of focusing and making that person feel so special,' one wrote.The Prince and Princess of Wales travelled on the Elizabeth Line to a rendezvous at the Dog and Duck pub where they pulled pints and spoke with staff yesterday. ",
        "And afterwards the first-in-line to the throne left the crowd smiling after joking about the couple's plans for the Coronation of his father, King Charles III, this weekend.When asked by a member of the public if he had anything planned in the coming days, the Prince of Wales quipped: 'No, a very quiet weekend, nothing happening at all.'Earlier in the day Kate admitted the family were still getting 'all of the ducks' in a row before the big day, although they had already noticed a 'wonderful' atmosphere and that excitement was 'already starting to build'.The event will feature the Coronation ceremony on Saturday at Westminster Abbey, followed by a concert at Windsor Castle on Sunday.",
        "The Princess also revealed her three children were deeply immersed in the preparations, saying: 'The children are having their Coronation celebration at school today.'She added that their eldest child, Prince George, is 'excited' about the event and has been taking part in rehearsals as a page of honour at the Westminster Abbey service.And the royal added that their eldest child Prince George was 'excited' about the upcoming celebrations and had been taking part in rehearsals.She explained that George was a page of honour during the service at Westminster Abbey and, asked if he was looking forward to it, she replied: 'He is actually. Having done a few rehearsals, I think everyone is a bit more relaxed.'",
        "Outside the pub they met with cheering crowds of royal fans, who greeted them with shouts of 'We love you!' before the couple posed for selfies with the crowd.William appeared relaxed, telling one  group who were discussing the newly opened Shambles Bar in Windsor: 'I love a cocktail! Best not to do it before the Coronation but maybe afterwards!'Earlier in the day the Prince and Princess of Wales made their way into central London on the aptly-named Elizabeth Line - a far cry from the horse and carriage they will be in on Saturday.The pair hopped on at Acton Main Line station and travelled to Tottenham Court Road, the nearest stop to Soho, before making their way to the Dog and Duck."
    ]
}