{
    "articleURL": "/sport/football/article-12060383/Barcelona-fans-BANNED-wearing-club-colours-clubs-title-clinching-game-against-Espanyol.html",
    "content": [
        " Barcelona fans to be refused entry to Espanyol if they are wearing club colours  City rivals repeat stance imposed on them by Barcelona earlier in the campaign  Barca will be confirmed as La Liga champions with a win in the local derby Barcelona fans will be denied entry to Espanyol's RCDE Stadium on Sunday if they  wear any items that represent the club's famous colours. ",
        "The LaLiga leaders will seal the title with a win over their rivals next weekend, while also deepening their rival's relegation fears, with Luis Garcia's men currently three points from safety. However, any fans looking to fly the flag in celebration of Xavi's men's title winning triumph will not be allowed into Espanyol's stadium if they are sporting any attire that is in the red and blue of Barcelona. The stance from Barca's local rivals is in direct response to the same measures that the Catalan club made ahead of the reverse fixture in December. Ahead of the first derby of the campaign, Barcelona banned away fans from attending the fixture. ",
        "While any fans wearing the blue and white jersey were barred from entering the stadium, along with any fans with Espanyol emblems or flags. A statement at the time from Barca read: 'The sale of tickets for Espanyol fans is prohibited. Likewise, fans who come with Espanyol clothing or emblems will be denied entry to the stadium.' The club's defence was that it wanted to prevent a repeat of what happened when Barcelona clashed with Eintracht Frankfurt in last season's Europa League. 30,000 Frankfurt fans overran the stadium and dominated the audience as tickets were distributed within the Barcelona stands of the stadium. ",
        "The December meeting between the two sides, saw the rivals fight out an ill-tempered 1-1 draw in front of a crowd of 88,000 Barca fans. Both sides finished the game with ten men as Jordi Alba saw red for Barcelona, while Vinicius Souza saw red for the visitors. The game also saw 15 yellow cards dished out by referee Mateu Lahoz - including one for Barca boss Xavi. Espanyol are second bottom of LaLiga and three points behind Valencia, while their rivals will be confirmed champions if they win the derby. "
    ]
}