{
    "articleURL": "/sport/nba/article-12051701/Stephen-Smith-says-Anthony-Davis-didnt-look-enthused-Lakers-Game-2-defeat-Warriors.html",
    "content": [
        "The Lakers were soundly beaten by Golden State Warriors on Thursday night Anthony Davis was the big Lakers disappointment after Game 1 victory DailyMail.com provides all the latest international sports newsAfter an electrifying display in Game 1, Anthony Davis was a huge disappointment for the Lakers on Thursday night in a crushing 127-100 defeat by Golden State.",
        "Davis fired 30 points in Game 1 but could only follow it up with 11 for his team on Thursday as the Warriors leveled the series.Reflecting on his performance, Stephen A. Smith said he felt Davis was going to have an off-night before the game even began.'In the case of Anthony Davis... coming into Game 2 this is what you have to worry about with Anthony Davis - I knew when he played 45 minutes the other night, he was going to have trouble tonight,' Smith said.'I'm gonna say it was an off-night because he had plenty of opportunities inside and beyond the paint where he was wide open and just couldn't drain shots.",
        "'He didn't look like he had the legs under him. he certainly didn't look enthused about playing. Obviously when he looks like that, it compromises the success of the Los Angeles Lakers and it certainly did tonight, as you can see.'When asked what Darvin Ham has to do to return the Lakers to winning ways, Smith felt the answer is with Davis. 'The number one thing is you've got to get rest for Anthony Davis,' Smith said. 'Make sure he has got his massage, his pedicures, any kind of therapeutic medicine you can buy, make sure he gets that. ",
        "'Make sure he is ready for Game 3 because LeBron James can't do as much as he has been doing - other parts have to step up.'Davis, for his part, accepted it wasn't his night.'I took all the same shots I took in Game 1. I just missed them,\" Davis said. \"Elbow jumpers. Pocket passes to the floater. Same exact looks. 'Didn't shoot no shot that I didn't shoot in Game 1. Just missed them. That's all.'We'll be better. I'll be better making those shots. \"We'll get back home on our home floor and try to take care of business.' Game 3 between the two teams is Saturday night, back in Los Angeles."
    ]
}