{
    "articleURL": "/tvshowbiz/article-12043689/Roxy-Horner-flashes-hint-cleavage-beneath-plunging-black-blazer-fashion-launch-party.html",
    "content": [
        "Roxy Horner turned up the heat on Wednesday night as she flashed a hint of cleavage while attending the YOMI launch event at London's Nolita Social.",
        "The model, 31, looked sensational as she slipped into a sleek black blazer for the evening, which was worn unzipped so as to display her black bra beneath.Roxy teamed her top with skintight black leggings, while her waist was cinched in with a large black belt.Accessorising her stylish look, the girlfriend of comedian Jack Whitehall added a black handbag and open-toed black boots, while adding a pop of color with bold red lipstick.Roxy was in great company at the event as she was seen cosying up to fellow model Hana Cross, who flaunted her toned midriff in a white crop top.",
        "The former girlfriend of Brooklyn Beckham added a structured black blazer and low-slung jeans to her look. Meanwhile, Roxy also posed up a storm alongside Janice Joostema, who stood out in a pink and black skirt suit. The two ladies were all smiles as they strolled arm-in-arm to the event. Elsewhere, Tigerlily Taylor turned heads in a chic sky blue blazer teamed with black trousers and heels. It comes after Roxy looked stylish as she attended the latest satirical exhibition by her friend and award winning spoof artist Alison Jackson at Grove Gallery on Thursday.The model stunned in a velvet black body teamed with leather trousers as she attended the private view of Alison's latest exhibition The Crown.",
        "She teamed the look with a blue bomber jacket as she was all smiles while posing in front of the cheeky artworks with Alison.Roxy appeared in high spirits as she was captured smiling and laughing.",
        "The bombshell donned a bronzed palette with a nude lipstick - and wore her long blonde locks loose with a centre parting. Roxy appeared to be enjoying her time at the Grove Gallery as she proudly supported her friend and BAFTA winner Alison. The outing comes after Roxy shared her bikini-clad pictures from Coachella on Instagramlast month after spending the weekend there.The stunner, who is dating actor Jack Whitehall, 34, looked incredible in the plunging red two-piece which had a frilly detail.Poking her tongue out for the camera, Roxy looked like she was having a great time in the sunshine as she hung out by the pool.She simply captioned her image: 'Coachella' . "
    ]
}