{
    "articleURL": "/news/article-12055285/Outback-Wrangler-Matt-Wright-reveals-thinks-really-happened-helicopter-crash.html",
    "content": [
        "Chopper crashed last year, killing Outback Wrangler co-star Matt Wright says the helicopter probably ran out of fuel Do you know more? Email tips@dailymail.comOutback Wrangler Matt Wright claims a helicopter pilot was at a drug-fuelled party the night before he was involved in a crash that killed his best mate and TV co-star.",
        "Chris 'Willow' Wilson, 34, was dangling from the Robinson R44 and collecting crocodile eggs in a remote area of West Arnhem Land in the Northern Territory on February 28 last year.He died when the helicopter, flown by Sebastian Robinson and operated by Wright's company Helibrook, collided with trees and plunged to the ground.Wright, 43, was hit with seven criminal offences in relation to the crash, including attempting to pervert the course of justice, fabrication of evidence and destruction of evidence.Mr Robinson, 29, was left with severe spinal injuries and has not been charged. In April, Wright said he did not know why he was the main target of police investigations when a toxicology report found 'cocaine derivatives' in Mr Robinson's  blood sample.Speaking with the Sunday Telegraph, the Netflix star claimed he recently learned Mr Robinson 'was at a party into the early hours of the day before the crash, where people were using cocaine'.",
        "'These new revelations are extremely concerning, especially given the references in court to the contents of the pilot's toxicology report,' he told the publication.Wright said the chopper 'never would have taken off' if he was aware of what the toxicology report suggested.The results of the toxicology report were revealed in Darwin Local Court in April in a letter Wright's lawyers sent a letter to prosecutors.",
        "Wright also told the newspaper on Sunday that he believes the helicopter crashed because it was not refuelled at Mt Borradaile, as planned, prior to the egg collecting mission.'Put simply, all of my refuelling places in Darwin use blue fuel, and the fuel at the refuelling station at Mt Borradaile near the crash site was green,' Wright said.According to a preliminary report by the Australian Transport Safety Bureau (ATSB), seen by Daily Mail Australia, investigators drained about 250ml of blue fuel from the main tank's bladder. The report also said the helicopter's engine did not have any defects that would have caused it to stop prior to the crash. 'Initial assessment indicated that the engine was stopped when the helicopter collided with the ground,' it stated. Wright told the publication: 'This makes me question whether the helicopter was refuelled at Mount Borradaile, and whether it was fuel exhaustion that caused the crash.' ",
        "Tim Luck, who was in one of three helicopters on the mission that morning, previously told The Australian that he was '100 per cent' sure the crashed chopper was refuelled.Mr Luck said he saw Mr Wilson filling the helicopter with fuel, and that he took over and filled the aircraft's tank 'to the top'. However, Wright said Mr Luck was not trained in refuelling helicopters and was not authorised to do so.",
        "The ATSB’s final report into the cause of the crash is due for release by ­September.Wright is yet to enter a plea, but his barrister Greg Jones previously said Wright denies any wrongdoing and intends to fight the charges. He previously told Daily Mail Australia: 'I've seen the damage drugs do to Indigenous and other communities. If I had any suspicion the externally contracted pilot had been using them, he would not have been allowed to fly.'While not commenting on processes currently before the courts, this does also raise serious questions as to why I have been the main target of investigations, instead of the cause of the crash.'He said it was 'concerning' that police have access to that information, but have chosen to focus on his life and business.'Nothing will bring Willow back, which will always be the worst part of this. But trying to lay blame on me is not fair or accurate,' he said.The matter will return to court on May 31."
    ]
}