{
    "articleURL": "/wires/reuters/article-12043755/Feds-Powell-dont-assume-Fed-shield-U-S-economy-debt-limit-default.html",
    "content": [
        "By David Lawder",
        "WASHINGTON, May 3 (Reuters) - The U.S. Federal Reserve is unlikely to be able to protect the U.S. economy from the damage caused by a failure to raise the federal debt ceiling, Fed Chair Jerome Powell said on Wednesday, adding that the government should never be in a position where it is unable to pay all of its bills.Powell told a news conference after the Fed's latest rate hike decision that resolving the debt ceiling standoff between Republicans and Democrats was a matter for Congress and the Biden administration.\"We don't give advice to either side,\" Powell said. \"We would just point out that it's very important that this be done.\"A U.S. default would be unprecedented and have \"highly uncertain\" and \"quite diverse\" consequences for the U.S. economy, Powell said, but he declined to enumerate them.\"We shouldn't even be talking about a world in which the U.S. doesn't pay its bills. It just shouldn't be a thing,\" Powell said.\"No one should assume that the Fed can really protect the economy and the financial system and our reputation globally from the damage that such an event might inflict,\" he added.On Monday, U.S. Treasury Secretary Janet Yellen said the Treasury's best estimate was that a default on U.S. payment obligations due to insufficient cash could come as early as June 1, raising alarm bells on the need for urgent action to increase the borrowing cap.",
        "President Joe Biden reacted by summoning the four top Congressional leaders to the White House for a May 9 meeting, but it remained unclear whether he would open negotiations over Republicans' spending cuts demands or continue to insist on a \"clean\" debt ceiling increase.Yellen has warned that a debt ceiling default will cause \"severe hardship\" to American families by raising borrowing costs, and harm the U.S. global leadership position. (Reporting by David Lawder; Editing by Chris Reese and Daniel Wallis)"
    ]
}