{
    "articleURL": "/wires/reuters/article-12055923/Whitecaps-edge-Minn-U-run-unbeaten-streak-8.html",
    "content": [
        "Brian White scored two goals and Simon Becher added one to help the Vancouver Whitecaps record a 3-2 victory over visiting Minnesota United on Saturday night.",
        "Vancouver (3-2-5, 14 points) extended its unbeaten stretch to eight matches (3-0-5).Michael Boxall and Sang Bin Jeong scored goals for Minnesota United (3-4-3, 12 points), who fell to 0-4-1 over their past five matches.Sang Bin narrowly missed tying it up just before time was called after five minutes of stoppage time. His rocket right-footer was just wide of the top right corner of the net.The Whitecaps blanked Minnesota United for the first 32 minutes to set a franchise record with 442 consecutive minutes without allowing a goal. Vancouver broke the single season (427 in 2012) and overall (433 across 2011 and 2012) marks.It was Minnesota United that scored the previous goal against the Whitecaps, occurring in the 40th minute on March 25.Yohei Takaoka, who had posted four straight shutouts, made three saves for Vancouver. Dayne St. Clair also had three for the Loons.Vancouver had a 17-11 edge in shots. The Whitecaps put seven shots on target to Minnesota's five.White scored his first goal in the 17th minute after Minnesota's Wil Trapp turned the ball over in the midfield.Andres Cubas controlled it and sent an upfield pass toward White, who made a long run before kicking a right-footed shot past St. Clair.Minnesota United tied the score in the 33rd minute to end the Vancouver shutout streak. The Loons took a corner kick, and the ball was loose in the traffic around the net. Boxall poked it over the line with his right foot for his first goal of the campaign.",
        "White tallied his second goal seven minutes into the second half to give Vancouver a 2-1 lead. He was taking a left-footed shot as he collided with St. Clair and the ball bounced into the net. The goal was White's fourth of the season.Four minutes later, the Whitecaps had a 2-on-1 break with Ryan Gauld leading the way. Gauld fed Becher, who easily knocked a right-footer past St. Clair for his fourth goal of the season.Minnesota pulled within 3-2 in the 65th minute as Robin Lod sent a crisp through ball to Sang Bin, who scored his first career MLS goal by sending a hard right-footed shot past Takaoka.Mender Garcia of the Loons had a chance to tie it in the 72nd minute, but Takaoka made a foot save to halt his right-footed shot.--Field Level Media"
    ]
}