{
    "articleURL": "/wires/ap/article-12054679/Haaland-fires-blanks-Man-City-beats-Leeds.html",
    "content": [
        "MANCHESTER, England (AP) - While Sam Allardyce managed to stop Erling Haaland on Saturday, he could not halt Manchester City's relentless march toward the English Premier League title.",
        "Two first-half goals from Ilkay Gundogan saw the defending champions beat Leeds 2-1 at Etihad Stadium and extend their lead at the top of the table to four points.But the relegation-threatened visitors, in new manager Allardyce's first game in charge, provided a late scare when substitute Rodrigo struck moments after Gundogan missed from the penalty spot.Ultimately, City extended its unbeaten run to 20 games in all competitions and moved Pep Guardiola closer to a third straight league title.With second-placed Arsenal facing a difficult trip to Newcastle on Sunday, City's lead could look even more commanding by the end of the weekend.Leeds' sorry run stands at six games without a win, with the fight for survival becoming more desperate by the week.",
        "Gundogan's goals in the space of eight first-half minutes put City on course for victory.The home team was so dominant that it could even afford for its leading scorer to have an unusually off day as Haaland missed a host of chances to add to his 51 goals this season.At one point, the Norway international laughed at himself as another scoring opportunity went by.By the time he hit the post after firing past Leeds goalkeeper Joel Robles in the second half, it was clear it wasn't going to be his day.",
        "He even handed over penalty duties to Gundogan later on to give the City captain the chance to complete his hat trick, only for him to hit the post.Guardiola looked furious about that decision, which looked even more costly when Rodrigo struck almost immediately after to set up an unexpectedly nervy finish.Even after his penalty miss, Gundogan still proved the match-winner. He scored in the 19th and 27th minutes from Riyad Mahrez passes.Gundogan missed from the spot in the 84th, and Rodrigo pulled one back for Leeds a minute later.City is marching toward a treble of trophies, with the first leg of the Champions League semifinals against Real Madrid coming up on Tuesday and a place in the FA Cup final against Manchester United already secured.It is the opposite story for Leeds, with the Yorkshire club in a desperate scrap to avoid relegation.Allardyce was hired to provide the lift that often comes with a change of manager. Yet even the most optimistic of fans would have feared the worst ahead of a trip to City, a daunting assignment for any coach let alone a new one.Sure enough, hopes of a shock win were effectively blown away before the game was a half-hour old.Allardyce´s tactics were clear. Sit deep and try to frustrate City. With 10 players guarding the box, Leeds shut down the space for City to move the ball around in the final third.",
        "It was effective for about 10 minutes.Gundogan broke Leeds´ resistance with a precise shot into the bottom right corner after Mahrez picked him out on the edge of the area.Gundogan's second came again from a Mahrez pass.Haaland mis-kicked when through on goal again, but such was City´s dominance he could laugh at himself for wasting another chance.Leeds did well to keep the score down, even if Haaland´s wayward finishing played a part in that.He had a header saved by Robles in the second half and then saw a spinning effort hit the post. He looked like getting his chance to end his frustrations when Phil Foden was fouled by Pascal Struijk in the box.Haaland opted to give Gundogan the spot kick, but the midfielder´s shot struck the post.Guardiola looked furious - and had more reason to be upset when Rodrigo slipped a shot past Ederson.___James Robson is at https://twitter.com/jamesalanrobson___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}