{
    "articleURL": "/wires/afp/article-12041191/Rohingya-team-visit-Myanmar-refugee-return-plan.html",
    "content": [
        "A Rohingya delegation will visit Myanmar on Friday as part of efforts to revive a long-stalled plan to return the stateless minority to their homeland, refugees and Bangladeshi officials said.",
        "Bangladesh is home to around a million Rohingya, most of whom fled a 2017 military crackdown in neighbouring Myanmar that is now subject to a UN genocide investigation.Both countries signed an agreement to return them later that year but little progress has been made since, and the United Nations has repeatedly warned that conditions were not right for their repatriation.The delegation will visit a site close to the Bangladesh border, where Myanmar's military regime plans to resettle more than 1,000 Rohingya in a pilot project.\"We will be shown the camps built by the Myanmar government for the Rohingyas. We will see the facilities there,\" Badiul, a Rohingya community leader and member of the delegation, told AFP on Wednesday.Bangladesh refugee commissioner Mizanur Rahman will lead the delegation of 20 Rohingya refugees, a senior government official told AFP, speaking on condition of anonymity due to the sensitivity of the issue.\"They will go there in the morning and will come back late afternoon,\" he said, adding the team would visit a reception centre, transit centre and resettlement camp built to house the incoming refugees.Another Bangladeshi official told AFP they expected repatriation to begin later this month, before the annual monsoon season.Rohingya refugees, who have spent nearly six years living in overcrowded and squalid relief camps in Bangladesh, have been consistently sceptical of the scheme since it became public knowledge in March.",
        "They say that none of their queries about security or recognition of their right to citizenship in Myanmar has been answered.- 'Myanmar is our country' -\"Why will we be sent to Myanmar without citizenship?\" a refugee who said they were also part of Friday's delegation told AFP, speaking on condition of anonymity.\"Why should we go to Myanmar to see camps? Myanmar is our country. They have to show us our village, our land.\"The Rohingya are widely viewed in Myanmar as interlopers from Bangladesh, despite roots in the country stretching back centuries.Myanmar junta chief Min Aung Hlaing, who has dismissed the Rohingya identity as \"imaginary\", was head of the armed forces during the 2017 crackdown.The International Court of Justice is probing allegations of rape, murder and arson against entire Rohingya villages by Myanmar's security forces during that year's violence.The repatriation plan agreed in 2017 failed to make any significant headway in the years since, partly over concerns the Rohingya would not be safe if they returned.Progress ground to a complete halt during the coronavirus pandemic and after the military overthrow of Myanmar's civilian government in 2021.The UN refugee agency said in March that conditions in Myanmar remained unsuitable for the \"sustainable return\" of Rohingya refugees.",
        "But civil society groups have criticised the agency for facilitating the transport of Myanmar officials into Bangladesh that month as part of the return scheme."
    ]
}