{
    "articleURL": "/wires/reuters/article-12040785/Looking-sweep-Dodgers-turn-prospect-Gavin-Stone.html",
    "content": [
        "After an opening month of the season that has featured a number of promising rookies, the Los Angeles Dodgers will bring aboard another one in Wednesday's series finale against the Philadelphia Phillies.",
        "Right-hander Gavin Stone, one of the club's top pitching prospects, is expected to make his major league debut in the afternoon game in Los Angeles.Stone, 24, had a strong showing in spring training, not allowing a run in four Cactus League appearances and 6 2/3 innings. He had two walks and 14 strikeouts.He started the season at Triple-A Oklahoma City and struggled in his first outing -- when he gave up six runs in 2 2/3 innings -- but gave up just three runs in 13 innings with 17 strikeouts over his three most recent starts.\"We've seen what he can do on the minor league side,\" Dodgers manager Dave Roberts said. \"To get him here in this environment is beneficial in itself. ... It's going to be fun for all of us.\"By adding an extra starter this time through the rotation, right-hander Dustin May will move back a day into an upcoming series against the San Diego Padres. May threw a career-high 104 pitches against the St. Louis Cardinals on Friday.Currently on a season-best five-game winning streak, the Dodgers have a chance to sweep the six-game homestand. Another Los Angeles rookie, Miguel Vargas, had three doubles in Tuesday's 13-1 victory over the Phillies. Rookie James Outman drove in a run, scored twice and is batting .282.",
        "\"(Vargas) is like a little brother so to see him have success is good for him personally but for the Dodgers as well,\" said Mookie Betts, who had three hits and three RBIs himself. \"What he can do is pretty special and I'm glad he's showing it.\"Philadelphia received a home run from Trea Turner, the former Dodger who signed a free-agent deal with the Phillies during the offseason. Bryce Harper made his season debut and went 0-for-4 with three strikeouts, making a quick return after Tommy John surgery in November.The Phillies will send right-hander Aaron Nola (2-2, 4.46 ERA) to the mound Thursday. In seven career starts against the Dodgers, Nola is 2-0 with a 3.57 ERA and 49 strikeouts in 40 1/3 innings.Nola will enter off his best start of the season when he gave up one run on three hits over eight innings Friday against the Houston Astros, while earning his second win in three outings.The result was welcome as Nola has experienced a decrease in velocity this season into the low 90 mph range with his fastball. But he insists he is not concerned over the development.\"At this time, with the pitch clock, I really don't care about the velocity,\" Nola said, according to the Philadelphia Inquirer. \"It's more necessary when I need it in certain situations. But I'd rather have early groundouts and early popups any day. Strikeouts are ... great but to get in and out quicker and to go deeper into the game is more important than anything.\"",
        "An extended start would come in handy Wednesday after the Phillies' last two starters -- Taijuan Walker and Matt Strahm -- went just 3 1/3 innings each.--Field Level Media"
    ]
}