{
    "articleURL": "/news/article-12051321/Bidens-interview-announcing-2024-campaign-airs-TONIGHT-10pm.html",
    "content": [
        "President Joe Biden will participate in an interview with MSNBC's Stephanie Ruhle Friday to air at 10 pm Friday night It will mark his first one-on-one with a television reporter since talking to PBS Newshour in February When asked about the Friday night timing, a White House official said that the interview was related to the Investing in America Cabinet meeting held earlierPresident Joe Biden has booked his first interview since announcing his 2024 reelection campaign.",
        "The president will sit down with MSNBC's Stephanie Ruhle for an interview that will air 10 p.m. on Friday night - when many Americans will be out for Cinco de Mayo or heading to bed. It will mark his first one-on-one with a television reporter since talking to PBS Newshour in February and comes after the White House has been pressed on him giving fewer press conferences and interviews than his predecessors. On Friday, Biden actually mixed up the two, telling reporters he wouldn't be speaking to them at that time because he would be holding a 'major press conference this afternoon.' The White House later said he meant the Ruhle interview. A White House official told DailyMail.com that Ruhle's sit-down was 'not a campaign interview.'Instead it was related to the Investing in America Cabinet meeting the president is participating in earlier in the day, which is why it's airing Friday night. The official added that portions of the interview will air earlier on Friday and throughout the weekend. ",
        "The network said Biden's conversation with Ruhle would be 'wide-ranging.'They will discuss 'the administration's infrastructure agenda, the 2024 campaign and recently announced reelection bid, the shaping GOP field, looming debt ceiling crisis, and more,' a press release from the network said. Biden, 80, made his reelection bid official last Tuesday by releasing a video. ",
        "Since then, he has yet to hit the campaign trail - and spent most of this week out of the public eye. The president and first lady hosted a state dinner for South Korean President Yoon Suk-yeol last Wednesday - where Biden did participate in a traditional bilateral press conference, where leaders answer questions from two chosen journalists from each country. On Saturday night, Biden attended the White House Correspondents' Dinner, where he was pressed by White House Correspondents' Association President Tamara Keith to be more accessible to reporters.'Every president privately and sometimes publicly bridles at his news coverage. And yet they invite us in and take our questions,' Keith said. 'Though, sir, maybe not as many as we would like,' she said, turning to Biden, who was seated nearby on the dais. ",
        "Two weeks ago, The New York Times called Biden's press shyness a 'deliberate strategy' noting that in the 100 years since President Calvin Coolidge took office only Republican Presidents Richard Nixon and Ronald Reagan held as few news conferences as Biden. He's yet to do a sit-down interview with an American newspaper. Overall, before Friday's meet-up with Ruhle, he'll have done 54 interviews.By comparison former President Donald Trump did 202 interviews during his first two years in office, while former President Barack Obama sat down for 275 interview, The Times said. ",
        "Asked Wednesday what the president was up to, as he hadn't been seen in nearly 48 hours, White House press secretary Karine Jean-Pierre said, 'he's been meeting with - having internal meetings in the Oval Office.' 'I had a meeting with him earlier today with his senior - senior advisers, senior staff, talking about the issues that matter to the American people,' she told reporters. 'It's not unusual. This is something that he does every day. And like you said, you'll see him later this evening. There'll be press available for the toast the president is going to - is going to give,' she said, referencing a Wednesday night dinner the White House was hosting. 'It's going to be, as you know, an open press avail at the top. And you'll get to see the president then,' Jean-Pierre said. "
    ]
}