{
    "articleURL": "/wires/pa/article-12052185/Steve-Smith-30-Sussex-debut-captain-Cheteshwar-Pujara-shines-again.html",
    "content": [
        "Steve Smith had a brief but eventful cameo as his maiden LV= Insurance County Championship innings was put in the shade by Sussex captain Cheteshwar Pujara’s classy century at Worcestershire.",
        "Attention was fixed on Smith, whose union with Sussex for three Division Two matches ahead of this summer’s Ashes has raised eyebrows, after the visitors lost two quick wickets on the second morning.But just as he was finding some rhythm, Smith fell for 30 to a debatable lbw call before Pujara demonstrated why he is as highly-regarded as the Australian with a fine 136 in Sussex’s 373 all out, with Worcestershire going to stumps on 34 for one – trailing by 75 heading into day three.",
        "The pair, who will be on opposing sides when Smith’s Australia take on Pujara’s India in next month’s World Test Championship final, put on 61 in a partnership notable for both batters being ordered to fasten neck protectors to the back of their helmets by umpires Chris Watts and Peter Hartley.Smith has previously described stem guards – mandatory for all domestic cricketers in England but not in Australia – as “claustrophobic” and akin to “being stuck in an MRI scan machine” after experimenting with one following a blow to the neck by a Jofra Archer bouncer in 2019 which caused concussion.Pujara then Smith were brought to the crease within the first 10 minutes of Sussex resuming on 63 for one in response to 264 all out as overnight batters Tom Alsop (13) and Ali Orr (34) quickly perished.",
        "Smith faced a dozen deliveries without scoring, either side of a five-minute delay while adjustments were made to his and Pujara’s helmets, but he duly took advantage from his 13th ball – short and wide from Ben Gibbon – to get off the mark by cutting for four.He looked to be warming to his work by clipping then pulling Josh Tongue for leg-side fours but while he was given the hurry up by the Worcestershire fast bowler, Smith was perhaps unfortunate the umpire’s finger went up after being struck well above the knee roll while already on his toes.It was a key wicket for Tongue but he and the rest of the Worcestershire attack found the prolific Pujara trickier to dislodge. India’s Test number three played late but drove with aplomb and was ruthless to short and wide deliveries while he even uppercut Tongue for six.Either side of Pujara reaching fifty, James Coles departed for 14 after an attempted whip off Gibbon brushed his inside edge while Oli Carter missed a drive at Matthew Waite and was bowled.But Pujara found a willing ally in Fynn Hudson-Prentice, with the pair shining in the mid-afternoon sun after a short rain delay and taking Worcestershire’s bowlers to task in a 117-run stand in 16.4 overs.",
        "Pujara cut Brett D’Oliveira for his 14th four and although he went to tea on 97, he got to a 138-ball ton shortly after the resumption, his third hundred already this season and an astonishing eighth in 12 matches for Sussex.Waite trapped Hudson-Prentice lbw for 54 but, with Sussex having established a first-innings lead by this point, Ollie Robinson had licence to tee off against a flagging attack, the England seamer following up his seven for 59 the day before by lifting Joe Leach for two sixes.Going for a third, Robinson miscued to long-on to depart for 33 off only 21 balls while Tongue had another important scalp as Pujara flirted outside off and nicked through to Gareth Roderick.Sussex’s innings quickly concluded, leaving Worcestershire to negotiate a few tricky overs.Robinson picked up where he left off on Thursday and drew the edge of Jake Libby, with Pujara holding on at fifth slip but Ed Pollock and Azhar Ali helped Worcestershire avoid any more damage."
    ]
}