{
    "articleURL": "/tvshowbiz/article-12050439/Paul-Burrell-cheekily-shows-bum-tattoo-Im-Celebrity.html",
    "content": [
        "Paul Burrell 'pulled a moonie' to reveal his bottom tattoos on I'm A Celebrity South Africa on Thursday night - along with the late Princess Diana's thoughts on them. ",
        "Joe Swash spotted them when Paul bent over on the show. Ready to quiz Paul about what they were, Joe said: 'Let's have a look at those a*** tattoos, it better not be Princess Diana!'But the star first decided to deny all knowledge, until he eventually showed the whole camp that he had a Chinese dragon with writing around it. After Joe joked about the Queen and asked if she had seen the inkings, Paul replied: 'No! Diana said, \"Oh, cheeky.\"",
        "The moment left viewers in hysterics and they took to Twitter in their droves to express their amusement. One person said: 'Not the majority of the camp gathering round for a peek at Paul's ass' while someone else said: 'Paul Burrell #cryin.' Another penned: 'Wow Princess Diana seen Paul's tattoos on his bum' and someone else added: 'Paul with his a** tattoos lmao he's sassy af.'A separate person wrote: 'Paul has tattoos on his a**e I'm dead' and someone else said: 'I love Paul.'Paul was Diana's butler for 10 years until her death in 1997.It comes after Helen broke down in tears while thinking about her children earlier on Thursday's I'm A Celebrity South Africa.The former Coronation Street star, 32, was pitted against Paul Burrell during the show in a task that saw them try and win a luxury picnic for their respective teams.",
        "Helen became emotional ahead of the task and fellow campmate Myleene Klass gave her words of encouragement.She told her: 'It's all in your head. Everything's in your head. Nothing's going to hurt you.'Also, there's a superpower that you've got behind you – that's your children. No bigger power. ",
        "'Every day they make us proud, but this time around you'll get to make them proud.'Helen and Myleene hugged and the soap star later beat Paul in the challenge and won a picnic for her team.The actress is mother to Matilda, seven, Delilah, four, and Charlie, two, with her ex-fiancé Scott Sinclair."
    ]
}