{
    "articleURL": "/wires/ap/article-12052447/Bucks-hope-coaching-change-unlock-potential.html",
    "content": [
        "The Milwaukee Bucks want their postseasons to match the success of their regular seasons.",
        "That pretty much explains why the Bucks opted to fire coach Mike Budenholzer after he led Milwaukee to the NBA´s best record in three of his five seasons on the job. Budenholzer coached the Bucks to their first title in a half-century in 2021 but posted a 4-4 record in playoff series his other four seasons, including this year's first-round exit.\"From a regular-season perspective, we´ve done some incredible things,\" general manager Jon Horst said in a conference call with reporters Friday, one day after Budenholzer's firing. \"And that matters. You care about the regular season. It´s really hard to win an 82-game regular season. It takes a lot to do that. And the playoffs matter an awful lot, too.\"I think ultimately, we just haven´t ended these seasons and these runs and these opportunities to contend in the way that we want or expect. And those expectations have changed over the course of time. So this is an opportunity for us to go forward.\"That opportunity just might lead to the Bucks hiring someone who shares many of Budenholzer´s traits.Horst said he believes the Bucks made the right hire five years ago when they brought in Budenholzer. He added the team is \"where we are today largely because of what Bud´s brought and what we´ve been able to do as a partnership.\"",
        "\"And now the challenge and task will be to find someone that frankly brings a lot of the same things but also can add to what we have, can bring a different view,\" Horst said. \"I think that´s where the refocus and reenergize opportunity comes. To look at this team in a different way and look at this opportunity in a different way and hopefully unlock some more potential with this team.\"Budenholzer compiled a 271-120 regular-season record with the Bucks while working with a roster featuring Giannis Antetokounmpo, who earned MVP honors in 2019 and 2020. Budenholzer helped Milwaukee go 58-24 this season to earn the NBA´s top playoff seed before the Bucks´ stunning 4-1 loss to the Miami Heat in the first round.Horst said the decision to fire Budenholzer was made collectively by the team´s executive group and ownership group rather than from any player request. Horst said players would have a voice in the process, however, as the Bucks select Budenholzer´s replacement.Antetokounmpo said after the Heat´s series-clinching victory that the Bucks didn´t make enough adjustments in how they guarded Jimmy Butler, who averaged 37.6 points over the five games. Antetokounmpo, who left Game 1 early and missed Games 2 and 3 with a bruised lower back, said he would have liked to defend Butler more.",
        "\"This wasn´t a player decision,\" Horst said. \"This was made at the executive level, ownership group. This is something we talked about collectively and we decided. Relative or specific to Giannis or to any of our players, it wasn´t their decision.\"Horst acknowledged a coaching change alone won´t solve all the Bucks´ issues.\"I have to be better,\" Horst said. \"I have to make better decisions at an executive level. Our players have to play better. From a performance area, we have to do a better job. So, it´s across the board, this is not a `one hire fixes all´-type thing. There´s a lot of things that have to improve.\"Milwaukee´s next coach will inherit a talented but aging roster as the Bucks enter an intriguing offseason.Brook Lopez, the runner-up to Memphis´ Jaren Jackson Jr. in the NBA defensive player of the year voting, is a free agent. Three-time All-Star Khris Middleton could become a free agent as well if he doesn´t pick up his $40.4 million player option for 2023-24.The Bucks want to make sure they remain annual contenders as long as they have Antetokounmpo, who has two years plus a 2025-26 player option remaining in the supermax deal he signed in December 2020.Horst said it was too early in the process to tell how important NBA head coaching experience or any other factor might be in the hiring process.",
        "\"We have to make a great hire, and I don´t want to put any boxes around what that will be,\" Horst said. \"I believe we will have a very attractive position. We have the best player in the world. We have a championship culture and organization. We have great facilities. I think we have great respect around the league. So I think we´ll have a lot options.\"___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}