{
    "articleURL": "/wires/reuters/article-12038907/US-STOCKS-Indexes-fall-regional-banks-tumble-investors-worry-ahead-Fed-meeting.html",
    "content": [
        "U.S. debt ceiling worries come to the fore",
        "Chegg slumps as ChatGPT drags on resultsIndexes down: Dow 1.2%, S&amp;amp;P 500 1.2%, Nasdaq 1.1%(Updates to late afternoon trading, adds NEW YORK dateline)By Caroline ValetkevitchNEW YORK, May 2 (Reuters) - Major U.S. stock indexes fell more than 1% on Tuesday as regional bank shares tumbled on renewed fears over the financial system and as investors weighed the likelihood of the Federal Reserve pausing rate hikes when it concludes its two-day meeting Wednesday.The KBW regional banking index was down 5.6% and hit its lowest level since late 2020.Energy shares dropped along with oil prices as investors worried about a potential U.S. debt default.Treasury Secretary Janet Yellen said the federal government could be unable by June 1 to meet all of its payment obligations without legislation to raise Washington's borrowing limit.The S&amp;amp;P 500 energy sector was last down 4.5%, the most of any major sector, followed by S&amp;amp;P financials with a decline of 2.7%.U.S. regional banks extended losses from Monday after the seizure and auction of First Republic Bank. Most of its assets were bought by JPMorgan Chase &amp;amp; Co in a deal brokered by the Federal Deposit Insurance Corp.Two other U.S. regional bank collapsed in March.\"There are concerns that this is not over, and that rates are going to (continue to) go up, and it could be catalyst for more problems,\" said Quincy Krosby, chief global strategist at LPL Financial in Charlotte, North Carolina.",
        "\"There's more and more talk about problems with commercial real estate. Commercial real estate really is, for the most part, the province of the regional banks.\"The Fed is expected to raise interest rates 25 basis points on Wednesday, and investors are anxious for any signals from the central bank on whether it will be the last hike for the near term.Higher borrowing costs hurt both consumers and businesses.The Dow Jones Industrial Average fell 423.65 points, or 1.24%, to 33,628.05, the S&amp;amp;P 500 lost 51.26 points, or 1.23%, at 4,116.61 and the Nasdaq Composite dropped 131.13 points, or 1.07%, to 12,081.47.PacWest Bancorp tumbled 26.3%, while Western Alliance Bank was down more than 17% and Comerica Inc dropped 13%.Educational services company Chegg tanked 49% on a downbeat second-quarter revenue forecast as competition from ChatGPT grew.Declining issues outnumbered advancers on the NYSE by a 4.37-to-1 ratio; on Nasdaq, a 2.67-to-1 ratio favored decliners.The S&amp;amp;P 500 posted 15 new 52-week highs and 13 new lows; the Nasdaq Composite recorded 38 new highs and 380 new lows.(Additional reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Editing by Sriraj Kalluvila, Vinay Dwivedi, Anil D'Silva, Subhranshu Sahu and Richard Chang)"
    ]
}