{
    "articleURL": "/wires/reuters/article-12058299/Rays-battle-Orioles-matchup-American-Leagues-dogs.html",
    "content": [
        "The American League's top two teams meet when the Baltimore Orioles open a 10-game homestand with a three-game set against the AL East-leading Tampa Bay Rays on Monday.",
        "The Orioles (22-12) dropped two of three games on the road against the National League's best team, the Atlanta Braves (24-11), over the weekend.Meanwhile, the Rays improved to a major-league-leading 28-7 by knocking off the New York Yankees 8-7 in 10 innings in the rubber match of the teams' three-game series on Sunday in St. Petersburg, Fla.The Orioles defeated the Braves 9-4 in the series opener before falling 5-4 on Saturday and 3-2 in 12 innings on Sunday.\"It shows that we're up there with the best,\" said Orioles right-hander Tyler Wells, who allowed just a run on three hits over five innings on Sunday. \"The last three games have been great baseball, regardless of the outcome. ... We came in and I think we just showed everyone exactly who we are.\"Tampa Bay beat New York 5-4 in its series opener before losing 3-2 on Saturday. The Rays trailed 6-0 on Sunday before scoring twice in the fifth and five times in the sixth to take a 7-6 advantage.The Yankees tied the game in the seventh before Isaac Paredes' 10th-inning single lifted the Rays to their eighth win in the past 10 games.The Orioles closed the gap against the Rays last season. Tampa Bay won the season series 10-9 in 2022 after completely dominating Baltimore a year earlier by winning 18 of the teams' 19 meetings.",
        "The Rays will open the series with left-hander Shane McClanahan (6-0, 2.03 ERA), who has been among the best pitchers in the majors. He gave up a run on five hits and two walks with nine strikeouts in six innings during an 8-1 win over the visiting Pittsburgh Pirates on Wednesday.Tampa Bay has won each of McClanahan's seven starts this season, as he has yielded two runs or fewer while pitching at least five innings in all seven outings.\"We know how talented he is. He's starting to find that level of consistency that the elite ones do,\" Tampa Bay manager Kevin Cash said. \"We're fortunate that we've got a guy that we can pencil in every fifth day to do that.\"McClanahan has been dominant against the Orioles throughout his career: 5-0 with a 2.45 ERA with 45 strikeouts against just nine walks in seven starts spanning 40 1/3 innings dating back to 2021.The Orioles will counter right right-hander Kyle Gibson (4-1, 4.61 ERA). Gibson is coming off his worst start of the year, when he allowed six runs on 10 hits with no strikeouts and no walks over 6 2/3 innings in a 6-0 loss to the host Kansas City Royals on Wednesday.Gibson is 6-5 with a 4.35 ERA and 50 strikeouts and 22 walks in 13 career appearances (12 starts) against the Rays. All of those outings came as a member of the Minnesota Twins and Texas Rangers from 2013-21.",
        "--Field Level Media"
    ]
}