{
    "articleURL": "/news/article-12042215/Bud-Light-offers-FREE-beer-wholesale-employee-begs-forgiveness-Mulvaney-row.html",
    "content": [
        "Bosses at Bud Light have from a free crate of beer to distributor employees in a desperate effort to recovery to the Dylan Mulvaney backlashThe brand will also increase marketing spending and accelerate ad productionREAD MORE: Anheuser-Busch CEO FINALLY disavows Dylan Mulvaney partnership and says 'it was not a campaign' Bud Light has resorted to handing out free beer as the brand's efforts to squash the backlash to its Dylan Mulvaney deal become increasingly desperate.",
        "Bosses have also promised to boost marketing spending and ramp up ad production after an industry expert said Bud's 'compass is completely broken' over its failure to deal with the fallout.Sales of Bud Light are in free fall after its disastrous partnership with Mulvaney, 26, which was announced in March. The controversial trans influencer was sent a can with her face on it to celebrate a year since she transitioned from male to female.Anheuser-Busch, the beer's parent company and America's largest brewer, said it will hand a free case over beer to every employee of its wholesaler network - which consists of many family-run businesses who've been badly hurt by the scandal.Figures from Bump Williams Consulting, which specializes in the alcohol industry, show in-store sales fell 26 percent in the week ending April 22. The decline in the week previously was 21 percent and the week before that sales fell 11 percent.",
        "Bump Williams, the founder of the firm, said Bud Light must apologize and added: 'Right now their compass is completely broken. There's no game plan.'Williams said that without a clear plan to navigate the backlash and turn around the decline in sales, 'Bud Light is in serious trouble this year'. He said the brand is still the biggest-selling in America, but risks being overtaken by Modelo Especial by the end of the year if the backlash continues. ",
        "His assessment comes after another PR expert told DailyMail.com that Bud Light must properly address the issue or 'they're only going to further hurt themselves'.Bud's current responses have been mealy-mouthed explanations of the Mulvaney partnership without a concrete apology to angry customers.The outrage deepened when comments surfaced from Bud Light executive, Alissa Heinerscheid, who said the beer needed to update its 'fratty' and 'out of touch' branding.Heinerscheid and her boss, Daniel Blake, Anheuser-Busch' VP for mainstream brands, have been placed on leave over the scandal.Williams told the St Louis Post-Dispatch: 'Her big miss was I don't think she understood who the core Bud Light shopper was. When she came out with her comments, they were deemed as being derogatory, insulting and juvenile. And the Bud Light drinkers said, enough of that.'Analysts think Anheuser-Busch's other brands will also suffer because of the Mulvaney anger.",
        "'I also think that what's happening now is that anybody that is a Bud Light drinker and switches to Michelob Ultra because they don't want to be seen holding a Bud Light, someone down the bar is going to say, 'Hey, buddy, that's an Anheuser-Busch product you're holding,' said Williams.Big Light's biggest competitors, including Miller Lite and Coors Lite, have enjoyed a boon in sales during the scandal.",
        "Anheuser-Busch is led by US CEO Brendan Whitworth, a former Marine lieutenant, CIA officer, and Harvard Business School graduate, who joined A-B in 2014 after serving as a senior executive at Frito-Lay.Anheuser-Busch's only comment on the matter has been a single statement confirming the Bud Light cans showing Mulvaney's face were a personal gift to the influencer, and not for sale to the public.'Anheuser-Busch works with hundreds of influencers across our brands as one of many ways to authentically connect with audiences across various demographics,' the statement said.",
        "'From time to time we produce unique commemorative cans for fans and for brand influencers, like Dylan Mulvaney. This commemorative can was a gift to celebrate a personal milestone and is not for sale to the general public,' the company added.In an appearance on Rosie O'Donnell's podcast this week, Mulvaney said: 'The reason that I think I am so…I’m an easy target is because I’m so new to this. 'I think going after a trans woman that’s been doing this for like 20 years is a lot more difficult. I think maybe they think that there’s some sort of chance with me … But what is their goal?  'These people, they don’t understand me, and anything that I do or say then somehow gets taken out of context and is used against me, and it’s so sad because everything I try to put out is positive. ",
        "'It’s trying to connect with others that maybe don’t understand me. It’s to make people laugh or to make a kid feel seen.' "
    ]
}