{
    "articleURL": "/wires/reuters/article-12041927/Russia-says-Ukraine-attacked-Kremlin-drones-failed-bid-kill-Putin--RIA.html",
    "content": [
        "Russia says it shot down two drones overnight",
        "Ukraine denies responsibility, warns of 'terrorist provocation' Russia says it reserves the right to retaliateRussian agency says Putin was not in Kremlin at the time(Updates with Zelenskiy denial, Blinken comment, checks on videos, analyst comment)By Mark TrevelyanMay 3 (Reuters) - Russia accused Ukraine on Wednesday of attacking the Kremlin with drones overnight in an attempt to kill President Vladimir Putin - the most serious allegation that Moscow has levelled at Kyiv in more than 14 months of war.President Volodymyr Zelenskiy promptly denied any Ukrainian involvement, telling a press conference in Helsinki: \"We don't attack Putin, or Moscow, we fight on our territory.\"A senior Ukrainian presidential official said the incident instead suggested Moscow was preparing a major \"terrorist provocation\".U.S. Secretary of State AntonyBlinkensaid Washington had not been able to validate the reported attack, and that Russian assertions should be taken with a \"very large shaker of salt\".Russia reserved the right to retaliate, Putin's office said, and Russian hardliners demanded swift retribution against Zelenskiy himself.\"Two uncrewed aerial vehicles were aimed at the Kremlin. As a result of timely actions taken by the military and special services with the use of radar warfare systems, the devices were put out of action,\" the presidency said in a statement.",
        "\"We regard these actions as a planned terrorist act and an attempt on the president's life, carried out on the eve of Victory Day, the May 9 Parade, at which the presence of foreign guests is also planned ...\"The Russian side reserves the right to take retaliatory measures where and when it sees fit.\"VIDEOS SHOW EXPLOSION OVER KREMLINBaza, a Telegram channel with links to Russia's law enforcement agencies, posted a video showing a flying object approaching the dome of the Kremlin Senate building overlooking Red Square - site of next Tuesday's Victory Day parade - and exploding in an intense burst of light just before reaching it.Two similar videos posted on social media showed two objects flying on the same trajectory towards the dome, with the clock on the Kremlin's Spassky Tower reading 2:27 and 2:43. The first seemed to be destroyed with little more than a puff of smoke, the second appeared to leave blazing wreckage on the dome.Reuters checks on the time and location indicated that the videos could be authentic, although it was not clear how Ukraine, if it were involved, could seriously have expected to kill Putin with a drone strike on the Kremlin - a huge, historic walled citadel in the heart of Moscow.",
        "Ukrainian presidential adviser Mykhailo Podolyak said in comments sent to Reuters: \"In my opinion, it is absolutely obvious that both 'reports about an attack on the Kremlin' and simultaneously the supposed detention of Ukrainian saboteurs in Crimea ... clearly indicate the preparation of a large-scale terrorist provocation by Russia in the coming days.\"The powerful speaker of the lower house of Russia's parliament, Vyacheslav Volodin, demanded the use of \"weapons capable of stopping and destroying the Kyiv terrorist regime\".And former president Dmitry Medvedev, now deputy head of Russia's Security Council, said the incident \"leaves us no option but to physically eliminate Zelenskiy and his clique\".PUTIN 'RARELY GOES TO KREMLIN'But a British expert on Russia, Mark Galeotti, said it was unlikely that the alleged attack had targeted Putin, who \"notoriously rarely goes to the Kremlin, let alone stays there overnight\".\"If we presume it was a Ukrainian attack,\" Galeotti tweeted, \"consider it a performative strike, a demonstration of capability and a declaration of intent: 'don't think Moscow is safe.'\"The presidential administration said fragments of the drones had been scattered on the territory of the Kremlin complex but there were no casualties or material damage.The RIA news agency said Putin had not been in the Kremlin at the time, and was working on Wednesday at his Novo Ogaryovo residence outside Moscow.",
        "Victory Day is a major public holiday commemorating the defeat of Nazi Germany in World War Two, and a chance for Putin to rally Russians behind what he calls his \"special military operation\" in Ukraine.Russia marks the occasion with a huge military parade on Red Square, for which seating has already been erected.The state news agency TASS said the parade - for which the Kremlin last week announced tighter security - would still go ahead.Before the drone attack was announced, some 10 hours after the event, Moscow Mayor Sergei Sobyanin said the city had introduced an immediate ban on unauthorised drone flights.Russia has accused Ukraine of numerous cross-border attacks since the start of the war, including strikes in December on an air base deep inside Russian territory that houses strategic bomber planes equipped to carry nuclear weapons. In February, a drone crashed in Kolomna, about 110 km (70 miles) from the centre of Moscow.Ukraine typically declines to claim responsibility for attacks on Russia or Russian-annexed Crimea, though Kyiv officials have frequently celebrated such attacks with cryptic or mocking remarks. (Additional reporting by Felix Light and Jake Cordell; writing by Mark Trevelyan and Kevin Liffey; editing by Nick Macfie)"
    ]
}