{
    "articleURL": "/news/article-12043105/Coroner-mulls-public-inquiry-number-deaths-vascular-patients-North-Wales.html",
    "content": [
        "Senior Coroner John Gittins is to open four inquests into vascular patientsIt follows a series of failures at Betsi Cadwaladr University Health BoardA coroner is to consider calling for a public inquiry into the number of deaths among vascular patients in North Wales after he was sent four separate cases to review following findings of serious failings at a University Health Board.",
        "Senior Coroner for North East Wales and Central John Gittins confirmed at a hearing in Ruthin on Wednesday he will next week open inquests into four people who died at Glan Clwyd Hospital, Bodelwyddan, after undergoing vascular surgery.The cases were among 44 reviewed by the Royal College of Surgeons, who previously investigated the Betsi Cadwaladr University Health Board service.Their report, published in January 2022, concluded there were serious deficiencies in the standard of care, record-keeping and communication. It made nine recommendations, five of them urgent, 'to address patient safety risks'.Mr Gittins is now understood to be examining legislation which could enable him to call for a public enquiry into the deaths.",
        "Today's hearing was a pre-inquest hearing in the case of 65-year-old Robert Wyn Jones from Botwnnog, near Pwllheli, who died after surgery at Glan Clwyd Hospital in July 2019.But the coroner said that it now needed to be considered in the light of the four other cases referred to him.One of the aspects he would need to look at, he said, would be the decision by the Health Board to centralise the vascular service at Bodelwyddan.",
        "Barrister Christian Howells, representing Mr Jones's family, said that if it were found that there was enough commonality between his case and the four others then it made sense for all five to be considered together.",
        "Though that could lead to further delay, Mr Jones's sister would prefer there to be a thorough investigation, he said.Mr Howells said the Welsh Government could be considered an interested party in the matter as it had placed the Health Board in special measures and then decided to withdraw the ruling, before later reinstating it.Adjourning the matter, Mr Gittins said he would need to consider whether to issue a Prevention of Future Deaths report - though he said he was aware that action had been taken to address problems under the board.He said he would examine the legislation concerning ways of calling on the Welsh Government to instigate a public inquiry and would also decide whether to combine Mr Jones's inquest with the other four.He told solicitor Trish Gaskell, for the Health Board: 'I will need evidence from an extremely high level as to what on earth has gone on and what is going on.'"
    ]
}