{
    "articleURL": "/tvshowbiz/article-12056543/Charlotte-Crosby-shares-shocking-pictures-having-lip-filler-dissolved.html",
    "content": [
        "Charlotte Crosby has unveiled shocking before and after pictures since having her lip filler dissolved. ",
        "The former Geordie Shore star, 32, gave birth to her baby girl Alba in October last year and not long afterwards, she decided to dissolve her statement lips for good.In January she revealed that she decided to go through with the procedure due to pregnancy swelling, which made her lips a lot bigger than she had intended. And posting to her Instagram stories on Saturday, Charlotte was horrified when she realised just how big her lips had become.  She said: 'Just been looking through old pics and I actually CANNOT believe how big my lips got towards the end of my pregnancy!",
        "'That is truly awful. I actually look ridiculous.' She continued: 'It was really hard to get used to having all of my lips dissolved. 'But my god looking at my old lips compared to my lips now has made me realise I never ever wanna go back!'The TV personality then added a poll, asking her fans if they agreed with her decision to reverse her surgery.  And the results were almost unanimous - with 98 per cent of fans in agreement. Charlotte's decision to remove her fillers comes along with a trend of reality stars seeking to dissolve their filler - alongside the likes of Molly Mae, Megan McKenna and Blac Chyna.  ",
        "The reality TV star previously said that she considered the move after seeing herself on the Geordie Shore reunion episode. Speaking on the Nova Podcast, Charlotte explained: 'I did not get my lips dissolved because of trolls, because quite frankly, I've been trolled for so long about them and I did not care. ",
        "'I absolutely love my lips, but it got to the point, after pregnancy they had swelled a lot. Like in pregnancy you have a lot of water retention.'Everything swells, you know your ankles, your face, your wrists, your fingers, your toes, like everything swells in pregnancy.'I watched Geordie Shore reunion and I was watching it and I was like, \"I look ridiculous\". For the first time, I was like \"I look ridiculous\". 'And obviously I've had a little girl now, you know what I mean? I thought to myself when I was watching myself on TV, and when I'm up in my little girl's face... and I'm going [baby babble], and I'm doing all these silly noises, can she even see us over them humongous lips?'Can she even see who I am as a person? Eight years I'd been getting my lips done. That's a lot of filler in them lips. And I thought it's all got to go.'",
        "In late November, the former Geordie Shore star, 32, took to her Instagram Stories on Thursday, admitting she never thought she'd 'see the day' that she would opt for a more natural look after first adjusting her lips back in 2014. Charlotte, who welcomed baby daughter Alba Jean in October with her boyfriend Jake Ankers, made the revelation just a year after Channel 5 pulled a documentary about her changing appearance following complaints.Posting the words over a snap, Charlotte wrote: 'I'm just putting it out there... I'm getting my lips dissolved. ",
        "'If I had a pound for every time someone told me my lips were too big, you know what, I would be s**ting money,' she told the Values and Vibrators podcast.  The channel removed the documentary from its streaming service after receiving 7,000 complaints to Ofcom. The programme criticised her 'plastic face' and 'duck lips,' which came after years of of Charlotte being targeted by trolls due to her appearance. MailOnline contacted representatives for Channel 5 and Ofcom for comment at the time. "
    ]
}