{
    "articleURL": "/news/article-12049481/Macquarie-Bank-executive-Nick-OKane-earns-1million-week-Millionaire-Factory.html",
    "content": [
        " Macquarie Bank executive earned $57.6million in 2023 He earned almost twice what his CEO did for the yearAn executive at 'millionaire factory' Macquarie Bank has earned more than $1million in just a week - and his sky-high earnings even put his CEO to shame.",
        "Nick O'Kane, Macquarie's global head of commodities and markets, earned a staggering total remuneration of $57.6million in the bank's 2023 financial year.That was almost 50 per cent more than he earned in 2022 when he still had a pay package worth an incredible $36.2 million, the bank's annual report reveals.His CEO Shemara Wikramanayake's total 'award remuneration' for 2023 weighed in at a mere $32.8million by comparison, up from $25.8 million in 2022.The massive paydays came as the Sydney-based global financial services firm registered a record $5.2billion profit after tax for the year.",
        "The bulk of Mr O'Kane's awarded pay came in $39.8million of retained profit share, which is a rolling program paid out over seven years. That was almost double his $21.3million retained profit share in 2022.His basic wage was very humble by comparison at just $723,419 in 2023, up a mere $98 from his $723,321 base salary in 2022.But he also took home an available profit share of $17million, up from $14million the previous year.Ms Wikramanayake's base pay was $821,081. The bumper pay packet acknowledges Mr O'Kane's department had played the key role in driving up profits 10 per cent year on year, despite a tough market.Mr O'Kane, who joined Macquarie in 1995, is now expected to be the highest earner of all Australian Stock Exchange company executives, or very close to it.",
        "The bank earned its 'millionaire's factory' nickname for its generous pay and bonus structure over the past 20 years but it insists all rewards are performance related.",
        "'I think if you have an idea, and it's a great idea, bring that to management and articulate what that idea is and go for it,' Mr O'Kane said on the bank's website.'Because at Macquarie we are the type of organisation where we have a bias to saying yes.'If you have a great idea, you will get the opportunity to be able to chase that idea down and build a business and you never know what that might come into.'"
    ]
}