{
    "articleURL": "/femail/article-12059691/My-best-friend-FIRED-maid-honour-pregnant.html",
    "content": [
        "A British woman took to Reddit as she spoke about her bridezilla best friendREAD MORE: I get the ick from my boyfriend because he drinks fizzy drinksA woman revealed that her best friend fired her as a maid of honour because she did not want a pregnant bridesmaid taking the attention away from her. ",
        "Taking to Reddit, the 27-year-old woman believed to be from the UK, explained that two weeks ago, she was asked to step down out of the blue after talking about starting a family. The bride told her that she doesn't want to have a pregnant maid of honour taking the attention away from her on the big day, which she wants to be a celebration of 'one big life event and not two'. She wrote: 'I was upset and had to leave the table momentarily to calm down. During this time she said to my husband: \"We thought that she would react like this.\"'When I came back I mentioned that if I would still be a pregnant bridesmaid (I thought she just didn't want me to be MOH), to which she then responded \"Well we were actually thinking of you guys just coming as guests\".'",
        "The woman said in her post that the bride attempted to 'dress it up' as though it was for her benefit, arguing that a pregnant woman should not be going heavy lifting or getting stressed over wedding arrangements. The friend also added that she would have wanted her bridesmaids in fitted dresses and would not want to pay to alter them for a pregnant woman, despite the writer of the post saying she would pay for the dress herself. ",
        "She continued: 'The fact that she stated it as a decision and not a discussion with myself or my husband to see how we felt shows that she already made her mind up.'She literally said verbatim that, \"It's the one day for it to be all about me and I think that you being pregnant would take attention from me as the bride\".'",
        "The woman and her husband offered resolutions to all of the bride's problems, although they were not expecting a baby, but the bride would not give in.'She kept repeating the main reason which was because me being pregnant would be a distraction from her on her wedding day and that she wanted her wedding day to just be about \"one big life event and not two\".'",
        "'Little addition: she was one of my bridesmaids and I never would've thought about excluding her if she became pregnant.'Instead, the woman and her husband were asked to come as guests, but the bride still suggested that she would be happy for her friend to organise the hen do - which the woman did not intend to do anymore. The post concluded: 'I would like to stress that I am not currently pregnant so she is making this decision based on a hypothetical, which to us is even more of a shock and confusing!",
        "In response to the post, one person commented: 'I'm gonna be honest, it's people like your \"friend\" that make me hate weddings. It's insanely self-absorbed to think the world revolves around you just because you're getting married.'",
        "'If you do still want to go I'd make it explicitly clear that you will absolutely not help in any way other than providing your attendance', they added.Another person said: 'Seems like you have been saved from a ton of hassle she's gonna go full bridezilla.'A third said: 'This is not a real friend. I wouldn't even attend the wedding honestly and I would let it fade away.' A fellow commenter echoed the same sentiment, saying she'd 'dodged a huge bullet by being excluded from crazy persons wedding! Take it as a win that you won't have to deal with this Bridezilla and cut her out as a friend. She's not a true friend.'And another advised her to 'decline all invites' and skip the big day, adding: 'No gift. No card. No contact.'  However, one commenter revealed that she will also ask a pregnant bridesmaid to step down from the bridal party, but believes she has good reason. 'I'd love to keep her in my bridal party but she would be heavily pregnant like ready to give birth on the day, just after or just before,' she said.",
        "'I'd rather she take the time to look after herself and rest instead of coming to a party that I’m just wearing a white dress at.'"
    ]
}