{
    "articleURL": "/tvshowbiz/article-12048501/Courteney-Cox-regrets-frying-skin-tanning-20s.html",
    "content": [
        "Courteney Cox regrets frying her skin in the sun when she was younger.",
        "The 58-year-old Scream actress admitted that she went overboard with the sun worship in her teenage years and into her 20s in an interview with Harper's Bazaar from Wednesday.But now she wishes she didn't spend so many hours soaking up the sun's UV radiation, as she says it did significant damage to her skin.Because of her bad experience, Cox warned her 18-year-old daughter Coco — her child with ex-husband David Arquette — to limit her sunbathing.In order to make her advice stick, she gave her daughter a tour of the sun damage on her own skin.",
        "'I mean, the obvious is sun care,' she said she advised her daughter. 'Don't lay in the sun and don’t fry. 'I always say to my daughter: \"Coco, your skin is incredible. Let me show you my chest,\"' she recounted.'Then she's like, \"Mom, I would never have that kind of skin.\" I'm like, \"Yeah. Your face you always look at, but you forget your body. Wear sunscreen and care about your body. Really use the right products because it catches up.\"'The Friends star — who played Monica Geller in the blockbuster sitcom — now makes sure she always wears sunscreen to keep her skin protected before playing sport or enjoying a day outside.",
        "Having been signed up by Dermalogica as the brand's newest celebrity spokesperson, she was happy to gush about her favorite product's from the company's range.  She explained: 'I love the Dynamic Skin Recovery Sunscreen. I play tennis. I'm out in the sun a lot. And even if it didn't have sunscreen, I would use it. It's so illuminating and gives you so much moisture. I love the way it smells too. I use that and I use it all over my body because I'm lucky enough to be able to do that.She also praised the Dermalogica Phyto Nature Oxygen Cream, which she uses at night. 'It's very hydrating and it smells good as well. But it really works. That's what I love about this,' she said.",
        "Courteney's ex-husband David, whom she was married to from 1999–2013, recently spoke about his difficulties adapting to his then-wife being more successful than him throughout their marriage.When he appeared on Sirius XM's Andy Cohen Live, the Watch What Happens Live host asked him if he ever felt inferior to his more-famous ex.'Yeah, absolutely. It's difficult. I have some of the traditional male things where I want to like, you know, provide and pick up the check and, you know, be the breadwinner,' he explained. ",
        "'In the acting world in general, you're always going on this rollercoaster of popularity and, you know, not being able to get a job. it's like this weird thing,' he continued. 'And then when you're, you know, comparing yourself to someone who's at the, you know, top of the television, iconic world, it's kinda hard to put yourself there, so there was definitely like learning and dealing with that, and a lot of pain and, you know, arguments or, you know, ego, early on,' Arquette added. During the period of the marriage, Courteney was earning $1 million per episode of Friends, along with her costars in the main ensemble.After their divorce, David went on to marry Christina McLarty, 42, in 2015. The couple share two young sons: Charlie, nine, and Alexis, six.Courteney has been dating the Snow Patrol bassist Johnny McDaid going back to 2013. "
    ]
}