{
    "articleURL": "/news/article-12056525/Royal-fans-queue-King-Charless-star-studded-Coronation-concert-10-HOURS-early.html",
    "content": [
        "Queue for King Charles's Coronation concert began ten hours early as fans came to the Long Walk in WindsorThe queue for the Coronation concert began ten hours early today and first in the queue was a woman who lined up for 12 hours for the Queen's lying in state.",
        "Elizabeth Cotterill, 62, from Nottingham, arrived before 9am to be first in the line of 20,000 members of the public who will get the privilege of joining the King and Queen and some of the world's biggest pop stars to celebrate.Mrs Cottrell said: 'I waited for 12 hours to walk past her Majesty's body and pay my respects, and that was a very sad occasion.'This is a much more joyous time, and I don't mind waiting this long.'I wanted to be early because my daughter Emily and I love Take That and we wanted to get a good view of them and the royals.'",
        "Next in line was Rita Gulrajani, 63, from Enfield with her husband Kenny, 66, who was adorned in a Union Jack shirt.Mrs Gulrajani said: 'I am 4 feet 10 tall and if I don't get to the front, I won't say a thing.'So we were here at 9 am, and I know they're not open the queue until around 4 pm, but it will be well worth the wait.",
        "I'm a massive Take That fan as well as Robbie Williams, and I've seen them all over the world dozens of times. I saw Robbie in Vegas and they are all great.'Of course, Kenny and I are royal fans as well. We love the royal family and bringing Take That and King Charles together. It's just amazing.'",
        "By lunchtime, around 1000 people joined the line along The Long Walk.Tonight's Coronation Concert will see Lionel Richie, Take That, Katy Perry, Olly Murs, Andrea Bocelli and Sir Bryn Terfel perform for the Royals.The moment in which the late Queen shared tea with Paddington Bear at Buckingham Palace stole the show at last year's platinum jubilee celebrations.BBC bosses may be hoping for a similar coup at the Coronation Concert by enlisting the services of another beloved literary bear: Winnie-the-Pooh.Downton Abbey star Hugh Bonneville, Hollywood great Tom Cruise and Dame Joan Collins will also be on stage.The Coronation Concert features a union flag shaped stage, which was barely visible to tourists who paid for a nearby field to try to catch a glimpse.It is set on the eastern facade of the castle with multiple levels, and will hold a 70 piece orchestra with four cat walks around Launch out like the union flag into the crowd.",
        "The concert will be transmitted live on the BBC tonight from 8pm.Members of the public were invited to apply for concert tickets online, with 20,000 people being chosen randomly as the lucky ones.It came as the Prince and Princess of Wales surprised fans in Windsor with a walkabout as the King and Queen thanked well-wishers for their support.",
        "William and Kate made the unannounced appearance ahead of Sunday's star-studded coronation concert at Windsor Castle.The Prince and Princess of Wales greeted crowds gathered in Windsor, shaking hands and chatting to revellers. At one point, Kate, wearing a pale blue blazer and white top, picked up a small union flag on a stick which had fallen on the floor and handed it to the well-wisher who dropped it. William It came shortly after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were 'deeply touched' by the nation's celebration of their historic coronation.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.Heir to the throne William is to take to the stage to deliver a speech during the musical extravaganza in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The King, Queen and royal family will join around 20,000 members of the public at the musical extravaganza to see performances by Take That, Katy Perry and Lionel Richie.",
        "Kate Middleton greeted fans dressed in a pale blue blazer, while Prince William opted for a darker shade as he shook hands with those gathered outside the castle. Alongside the thousands of smaller street parties expected to be held at the weekend, people are encouraged to come together across the country for the Coronation Big Lunch.In Cranleigh, the Duke and Duchess of Edinburgh will join residents and representatives from the Royal British Legion, the Scouts and the Guides - of which Sophie is president.Elsewhere, the Princess Royal and Vice Admiral Sir Tim Laurence will visit a community street party in Swindon, and Princess Beatrice and Princess Eugenie will join a big lunch in Windsor. "
    ]
}