{
    "articleURL": "/news/article-12046905/The-REAL-fungus-threat-isnt-zombie-apocalypse-global-starvation-scientists-sound-alarm.html",
    "content": [
        "Fungi turned men into mushroom-monsters in TV drama The Last of Us In the real world, their bigger danger is to the food we need to surviveThe real-world fungal apocalypse would see billions starve from a crop plague   The smash television zombie show The Last of Us was too close for comfort for food scientist Sarah Gurr.",
        "While the apocalyptic HBO drama focussed on fungal infections turning mankind into crazed zombies, the more pressing threat is how they ravage what we eat, she says.The University of Exeter expert warns of a 'devastating' impact on wheat, rice, corn, soy beans, potatoes and other crops that keep the planet's 8 billion people alive.Dangerous fungi are spreading north as the planet heats up, and the fungicides farmers use against them are getting less effective as they adapt to resist man's chemicals, she says.'The imminent threat here is not about zombies, but about global starvation,' said Gurr, in a reference to the hit series.",
        "'While the storyline is science fiction, we are warning that we could see a global health catastrophe caused by the rapid global spread of fungal infections as they develop increasing resistance in a warming world.'Her study, published in the journal Nature, comes as fans of The Last of Us await the second season of a show that tells the story of the tough survivors of a global pandemic in a post-apocalyptic wasteland.Fungal pathogens are already a big threat to farming, causing billions of dollars in losses each year. As temperatures rise, these pathogens can reproduce and spread faster, leading to an increased severity and frequency of crop damage.",
        "Other experts have expressed alarm about fungi destroying more crops. Still, many Malthusian-type projections about mass starvation have proven baseless.In her study, Gurr says farmers are starting at a bad point.Growers already lose between 10 and 23 percent of their crops to fungal infection each year, despite dousing them in antifungals.Another 10-20 percent is lost once they've been harvested.Across mankind's key food sources — rice, wheat, corn, soya beans and potatoes — that amounts to losing the food needed to feed between 600 million and 4 billion people for a year, researchers said.All those crops are vulnerable to fungal infections, ranging from rice blast fungus to wheat stem rust, corn smut, soybean rust and potato late blight disease. Other grains and bananas are also vulnerable.Like in the Last of Us, which saw the Cordyceps fungus adapt to human body temperatures as global temperatures rose, the real-life food threat is made worse by the planet getting hotter.The fungal pathogens that eat up crops are moving north and south towards the poles at a rate of 7km each year as temperatures rise, researchers said.Wheat stem rust infections — which normally occur in the tropics — have recently been reported in Ireland and England.",
        "At the same time, those pathogens are developing a resistance to the chemicals farmers use to kill them.",
        "Since about 2015, the concentration of fungicide needed to fight the wheat-destroying fungus Zymoseptoria tritici jumped tenfold in the space of just a few years.",
        "Eva Stukenbrock, a fellow of the Canadian Institute for Advanced Research and a coauthor on the study, said the danger was growing as the global population is set to exceed 10 billion by the end of the century.'We're already seeing massive crop losses to fungal infection, which could sustain millions of people each year,' Stukenbrock said.'This worrying trend may only worsen as a warming world makes fungal infections more prevalent in European crops, and as they continue to develop resistance to antifungals.'The crop loss would be 'catastrophic' across Africa and other poorer regions, where farmers already struggle to produce decent yields, but would also have a 'major impact in the Western world,' she added.The experts said farmers were up against a powerful adversary. Fungi are 'incredibly resilient' and can survive in soil for up to 40 years, as well as being extremely adaptable and having 'phenomenal genetic diversity,' they said.They called for research into next-generation antifungals that make it harder for pathogens to develop a resistance against, and cross-bred seeds that are naturally resistant to pathogens.Gurr said it was time for a 'globally united approach' with funds from charities, governments and the private sector to 'build on the seeds of hope and stop this developing into a global catastrophe which will see people starve.'"
    ]
}