{
    "articleURL": "/wires/pa/article-12041563/Exeter-not-blame-Wales-Joe-Hawkins-missing-World-Cup--Rob-Baxter.html",
    "content": [
        "Rob Baxter says Exeter do not shoulder responsibility for Wales centre Joe Hawkins’ controversial World Cup omission.",
        "Hawkins was left out of Wales’ preliminary World Cup training squad on Monday following his move from Ospreys to Exeter.The 20-year-old will join the Devon club this summer and, with five caps, has less than the 25 needed to continue at international level and play outside Wales.",
        "National-team head coach Warren Gatland said he was “disappointed” to lose Hawkins for the World Cup in France later this year after Wales’ Professional Rugby Board told him he was ineligible upon studying documentation over the timing of his move to England.Hawkins, who was first named in a national squad in October 2022 and made his debut against Australia the following month, could still have been deemed available for Wales by eligibility rules if he was uncapped when he signed his Exeter contract.Exeter rugby director Baxter said: “We don’t take any responsibility because we approached it completely with open arms, with the anticipation that he would play for Wales.“We felt that we had got everything in place we needed to. We complied with what we were asked to do with the information we had.“Obviously Wales feel there’s stuff that doesn’t prove certain dates and times that they wanted. We haven't done anything wrong, we certainly haven't broken any rules  Exeter rugby director Rob Baxter  ",
        "“We haven’t done anything wrong, we certainly haven’t broken any rules.“I think what will surprise people is how early we looked at Joe. He was playing under-20s rugby and I was watching those games with players we’ve got here.“We’ve been looking at him for years basically. Whatever has happened has happened, but we’ll get on with it and support Joe in what he wants to do.”The spotlight was shone on Wales’ eligibility rules after Gatland named a 54-man squad that, while omitting Hawkins, did include former England prop Henry Thomas, France-bound Dragons forward Will Rowlands and Japan-based Cory Hill.",
        "Thomas, capped seven times by England between 2013 and 2014, has served World Rugby’s stand down period of three years to represent another country.The 31-year-old Montpellier tighthead has not been capped by Wales, so is not affected by the 25-cap criteria.Thomas would, however, have to play in Wales after his current Montpellier deal expires should he be capped in the meantime.Rowlands has won 23 caps and his registration will remain in Wales before he joins Paris-based Racing 92 next season.",
        "Two World Cup warm-up games against England and another with South Africa in August could take Rowlands to the 25-cap mark.Asked if he was surprised by Hawkins’ World Cup omission, Baxter said he was a “little bit”, but added: “It certainly isn’t my place to be critical of the WRU (Welsh Rugby Union).",
        "“I’ve got to be very careful without knowing in depth what the situation is in Wales, what the regions’ thoughts are on it.“There is a lot going on within rugby across the world, a lot going on in the Premiership.“But if Wales decide they don’t want to take Joe to the World Cup then that’s their decision.”"
    ]
}