{
    "articleURL": "/tvshowbiz/article-12038175/Richard-E-Grant-left-red-faced-X-rated-gaffe-Morning.html",
    "content": [
        "Richard E. Grant was left red-faced following a very X-rated gaffe during Tuesday's This Morning.",
        "The actor, 65, was chatting to TV chef Clodagh McKenna, 47, when she suffered a very awkward faux pas while speaking about Richard.Clodagh revealed she'd been hoping to whip up some cheesy eggs but wanted to check in with her pal to see whether he liked them.She said: 'I messaged Richard on the way in today and I was like, \"I'm making cheesy eggs, I know you don't like cheese but will you have it?\"'He was like, \"No way, it tastes like bum!\"'",
        "A horrified Richard butted in: 'It doesn't taste like bum, it smells like bum!'Presenters Holly Willoughby, 42, and Phillip Schofield, 61, were left in hysterics while Clodagh hid behind her hands.Between laughter, Richard added: 'This is a family show!' At a more serious moment, Richard revealed King Charles's act of kindness towards his late wife Joan before she died. Joan lost her battle with lung cancer on September 2, 2021 aged 71, seven months after her tragic diagnosis. She and Richard had been married for more than 35 years and her death left Richard utterly heartbroken. Richard said the King had been one of Joan's final visitors.He said, 'A few weeks before she died, the King asked to see Joan,' who was a voice coach and actress.",
        "He continued: 'He came and sat with her in our garden. They talked about everything.'",
        "In 2021, a month after Joan, whose nickname was 'The Colonel' passed away, Richard told the Daily Mail what had happened during the visit. He said: 'Prince Charles came to see The Colonel last month, sat beside her, took her hand and said, \"It's been an absolute honour to have known you, Joan\"'To which she instantly quipped, \"I'm STILL here.\" Which broke the ice and made all three of us cackle.'He added: 'Astonishingly, unlike me, she's never been star struck and possessed the innate gift of speaking to everyone of any age or status as her equal.'Richard spoke about his book on the show which is a collection of daily journal entries. He said: 'When I knew my wife was diagnosed with terminal cancer in 2021, I wanted to detail the time we had left together. 'When someone is diagnosed terminally you have no control. The one thing i had was writing things down at the end of every day.'The book is called A Pocketful of Happiness which is a tribute to Joan who advised Richard to find a pocketful of Happiness in every day. He said: 'It has been really helpful. I've been gardening, digging, replanting stuff. ",
        "'There have been small acts of kindness from people. You might take it for granted but when you're post grief the kindness of people lifts you up.'  He concluded: 'There are days where you feel like you can't move and then people tweet and say go for a walk. 'Sometimes when it hits you like a tsunami you cant do anything.'"
    ]
}