{
    "articleURL": "/wires/reuters/article-12048289/DoorDash-raises-annual-core-profit-forecast-resilient-delivery-demand.html",
    "content": [
        "Company says consumer engagement remains very strong",
        "Raises 2023 adjusted EBITDA and gross order value forecastsBeats quarterly revenue estimatesBy Granth VanaikMay 4 (Reuters) - DoorDash Inc raised its annual core profit forecast after beating quarterly revenue estimates on Thursday, helped by rising orders for food, groceries and convenience items even as consumer wallets remained pressured due to high inflation.DoorDash and its competitors such as UberEats have gained from a pandemic-driven trend of consumers ordering from the comfort of their homes that has continued to thrive as the companies offer deals and free deliveries with membership passes.San Francisco-based DoorDash now projects annual adjusted EBITDA, a measure of profitability, between $600 million and $900 million, compared to previous outlook of $500 million and $800 million.As part of its cost-saving initiatives, the food delivery firm decided to cut about 1,250 jobs, or 6% of its total workforce, in November.\"Consumer demand and engagement are stronger than ever, which has fueled growth across our topline,\" said Chief Financial Officer Ravi Inukonda.In the first quarter, total orders rose 27% to 512 million, while analysts on average had expected a 20.8% rise to 488.2 million, as per Refinitiv data.DoorDash now expects gross order value, a key industry metric which is a total value of all app orders and subscription fees, to be between $63 billion and $64.5 billion for 2023, compared to previous forecast of $60 billion to $63 billion.",
        "On Tuesday, Uber Technologies also said that it expected \"strong growth\" in its food delivery unit over the next few quarters, signaling demand resilience.DoorDash's revenue rose 40% to $2.04 billion in the quarter ended March 31, compared to analysts' estimate of about $1.93 billion. (Reporting by Granth Vanaik in Bengaluru; Editing by Maju Samuel)"
    ]
}