{
    "articleURL": "/news/article-12045183/St-Clair-home-Jessica-Camilleri-decapitated-mother-Rita-rent.html",
    "content": [
        "GRAPHIC CONTENT WARNING Daughter beheaded her mum in kitchenHouse was put up for rent A suburban house of horrors where a woman beheaded her mother has gone up for rent for $530 a week. ",
        "The three bedroom, one bathroom home at St Clair, in western Sydney, has been put on the market for lease.The property has been repainted but the touch-up may not be enough for most people given the dark history of the house. On July 20, 2019, Jessica Camilleri decapitated her mother Rita in the kitchen of the home, stabbing her 100 times in the face and neck.",
        "Camilleri, 29, used at least six knives to kill her mum, 57, with four of the blades broken in the attack. Rita's head was found outside the home and her body was located on the kitchen floor. Daily Mail Australia revealed that the gruesome crime scene had been sold for $680,000 in June 2020 after an advertisement described it as 'truly superb'. 'This home is inviting from the get go as you stroll through the house you then understand what quality really means,' the description read. The home was up for lease shortly afterwards with an almost identical ad boasting about renovations, 'good sized' bedrooms and 'ample' living space.The listing alluded to the dark history of the house saying the agent would disclose a 'material fact' about the home upon viewing.The latest ad includes the same disclosure.'There is a material fact relevant to the home, which will be disclosed when attending a viewing in accordance with relevant legislations,' it read.",
        "When selling or renting a home in NSW where a crime was committed, real estate agents are by law required to be upfront to potential renters.'Any information that may influence a decision to buy, sell, rent, or impact a property's market value needs to be disclosed to potential buyers,' the Real Estate Institute of NSW told Yahoo.'Whether it is an outlook over a cemetery, a bad strata report or even the scene of a grisly crime, most properties do eventually sell.'Camilleri, 27, was jailed for up to 21 years  for decapitating her mum. The courts had dealt with four previous assault charges against Camilleri between December 2013 and February 2018 under provisions of the Mental Health Act, which diverted her from the justice system. ",
        "Justice Helen Wilson said she had never been convicted of an offence before killing her mother. The judge revealed that Camilleri's mother had taken her to a police station just one day before the killing, after the troubled young woman, then 25, dialled a random stranger 30 times in the 'very early hours' of July 19, 2019.The horror film obsessive - who had autism, an intellectual disability and an 'explosive' personality disorder - only ended her phone bombardment after telling the man that 'she hoped he got cancer and died'.",
        "Justice Wilson also revealed there had been a series of incidents where she had called random people and threatened to cut off their heads. One man sometimes experience more than 100 calls 'per day' from Camilleri 'in the 12 months before Anzac Day 2019,' the judgment said.She was found not guilty of murder but guilty of manslaughter by a jury after two forensic psychiatrists told the trial she was suffering from substantial mental impairment. In September 2022, Camilleri appealed the length of the sentence in the Court of Criminal Appeal.The court has yet to hand down its decision."
    ]
}