{
    "articleURL": "/news/article-12039929/Kevin-Costners-wife-filed-divorce-just-months-telling-QUIT-Yellowstone.html",
    "content": [
        "Kevin Costner was pictured wearing his wedding ring as he cuddled two women in Las Vegas just a day before his wife Christine Baumgartner filed for divorceShe reportedly gave Costner, 68, an ultimatum in October to quit Yellowstone because he would be filming for months at a time away from their LA homeIt comes after he took on a new Western project, 'Horizon', that he is set to direct, produce and star in - with a mammoth shooting schedule of 220 daysKevin Costner was pictured wearing his wedding ring as he cuddled two women in Las Vegas just a day before his wife filed for divorce. ",
        "Christine Baumgartner, who tied the knot with Costner in 2004, filed the petition to separate from the Oscar and Emmy winning actor on Monday.It comes six months after she told him to quit Yellowstone because his busy filming schedule was impacting their family.The split is said to be due to 'irreconcilable differences,' with Baumgartner asking for joint custody of their three children - Cayden, 15, Hayes, 14, and Grace, 12. Costner, 68, has taken on a new Western project that he is set to direct, produce and star in and has a mammoth shooting schedule of 220 days. And there are rumors he may star in the sixth season of the hit series Yellowstone. Watch Kevin Costner in Yellowstone, available now only on Stan.  ",
        "Costner went to the Milano Restaurant and Bar in Las Vegas with his cast and crew following a special pre-screening of his new western movie project Horizon: An American Saga.Owner and chef Laura Migliorini posed for a picture with Costner alongside manager and partner Laura Trent.  She shared the snap on Instagram and wrote: '@kevincostnermodernwest what a pleasure it was to host this wonderful dinner at @milano_restaurant_bar for such a wonderful actor!' ",
        "Diahann Hall, who was at the secret show before the meal, said: 'My dear friend, Jaki Baskow, invited me and Doug Taylor to a very special pre-screening in Las Vegas of Kevin Costner‘s new movie project. ",
        "'Little did I know that I would be sitting literally next to Kevin Costner for more than half the day today and across from Luke Wilson!!! They are just the nicest guys! 'Many of the actors in the 4-sequel movie were here for the screening and it was quite the afternoon… No photos allowed but boy do I have some wonderful memories! Thank you Jaki for such a wonderful experience.' Baumgartner reportedly gave Costner an ultimatum in October to quit the popular neo-Western show, Yellowstone, because he would be filming in Montana for months at a time and away from their family who live in Los Angeles. 'It's really knocked a hole in their family life,' a friend of hers told Radar. 'She wants a firm commitment this is his last season — or he might have to hit the dusty trail!' But Costner continues to lead a busy lifestyle as he finished filming the first of four installments for his new western Horizon: An American Saga in November before he started shooting again the following spring. Production for the second film began in mid-April in southern Utah before Baumgartner filed for divorce on Monday. Costner wanted to shoot all four parts of the project, which involves 170 speaking roles, back to back.",
        "'So, I’ll probably shoot for eight months,' he previously told Variety. 'It’s a mountain — a mountain of time.' 'I’m as pressed as I’ve ever been in my life in terms of the responsibilities and the amount of decisions I’m having to make every day, between doing what I’m doing every day for ‘Yellowstone’ and my own [work]. 'There’s a lot of people standing behind me waiting for me to make decisions and things like that.'",
        "Horizon is an ambitious project which spans 15 years of 'the pre- and post-Civil War expansion and settlement of the American West' and it sees him directing for the first time since Open Range in 2003. Each film, which will be released three months apart from each other, is close to three hours long.And after the quadruple release, Horizon is going to be broken into a series for television - each with 42-minute episodes. Costner has played patriarch John Dutton III in Yellowstone since 2018 but he reportedly only wanted to film the back half of the season for just one week as he was busy with the Horizon project.It is unclear when production will begin on the new episodes for Yellowstone Season 5, or if those episodes will feature the death of John Dutton.But Paramount network president Keith Cox said he was 'very confident' that Costner would return for the rest of the fifth season.",
        "There are even rumors that Costner might return for a sixth season of the hit series. ",
        "Baumgartner's filing for divorce comes after Costner revealed the coronavirus pandemic strengthened their marriage. The couple were in quarantine together with their children at their Los Angeles home when everything was shut down. 'Our partnership has really come into focus about what we do for each other and how we deal with our family,' he told People in June 2020. 'Our house is like a river: You’ve just got to get into the flow of it. And whatever you thought it was going to be, maybe it still can, but it’s going to have to work with what the day brings.'And he opened up about getting his kids to watch his kids grow up and added: 'I can feel them working me. I can tell when they come to me about something that they’ve been already told \"no\" by their mother.'Costner met Baumgartner in the 1996 while he was rehearsing for his role in Tin Cup. He was previously married to Cindy Silva at the time who he split from in 1994 and they share three children - Annie, 39, Lily, 36, and Joe, 35.Costner first began dating Baumgartner in 1998, having met around 1996 while he was filming his movie Tin Cup. ",
        "The Bodyguard star said that at the time he first met her, he wasn't ready to fall in love again.They briefly separated in 2003 because he wasn't sure if he wanted to have kids but they quickly got back together and tied the knot in at Costner's Aspen, Colorado ranch in 2004.",
        "Costner recalled on the break up and said: 'She said, \"I’m going to wait for you, but not long. When you come to your senses, come back to me.\" And I did.' The couple welcomed their son Cayden in May 2007, Hayes in February 2009 and daughter Grace in 2010. ",
        "He also shares a son, Liam Costner, with Bridget Rooney, who he dated after his split with Silva. Baumgartner is a handbag designer by trade. Her label is named Cat Bag Couture. The Daily Telegraph feature refers to her as a 'model.'It was her Oscar-winning husband who helped her to get her start in style.'When I came up with some samples, I showed them to Kevin, and he said they were beautiful and amazing,' Baumgartner told the Denver Post in 2005.Costner shut down his film career for a short period following the birth of their children. 'I didn’t make a film for four years during and after the births of my second family,' he told the Daily Express in 2016.",
        "'I am less concerned with success on screen than being around for the next 20 years to take care of them.' Baumgartner supported her husband's busy acting career and they were pictured together on red carpets frequently. She was there for his nomination for outstanding performance in Yellowstone at the Screen Actors Guild Awards in February 2022. The couple were pictured together at the 94th annual Academy Awards in March 2022 and Costner shared a picture of his wife and tweeted: 'How beautiful is my date?'And the last time they were seen together in public was at a charity benefit in Los Angeles on April 5, 2022. They were supposed to attend the Golden Globes in January 2023 when Costner won best actor statue for his role as John Dutton in Yellowstone but they couldn't go due to a flood. ",
        "After Baumgartner filed for divorce earlier this week, a statement from Costner's representative read: 'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action.'We ask that his, Christine's and their children's privacy be respected as they navigate this difficult time.' Baumgartner, 49, is not said to be filing for spousal support, with Costner's response filed by Laura Wasser.'Spousal support to be payable to petitioner pursuant to the terms of the parties' Premarital Agreement,' Wasser said, indicating there is a pre-nuptial agreement between Costner and Baumgartner.The divorce news comes weeks after DailyMail.com reported new details about Costner's rift with Yellowstone creator Taylor Sheridan.Sources claimed Sheridan developed a 'God complex' which left Costner reportedly frustrated with the development of the hit Paramount Network series.The insider also alleged that Costner was left frustrated at how his concerns over the direction the series was taking were dismissed by Sheridan - saying that the actor, who also serves as an executive producer on Yellowstone - was told to 'stick to acting' when he raised questions about the future of the show.'Kevin will forever be proud of and grateful for Yellowstone and the cast is like family to him,' the source said of Costner, who recently nabbed a Golden Globe Award for best actor for his portrayal of John Dutton.'He just felt like Yellowstone is headed in a direction that was not in line with their initial vision and he was met with criticism, including that he should just stick to acting.'Last month, the New York Post reported that Costner's desire to cut down his workload on the fifth season to focus on other projects was also to blame for the tension between him and Sheridan.'It’s the same as with any show runner and big star — there’s respect, but there’s friction,' a source described as 'well-placed' within the production told the outlet.There have also been reports that Costner's beloved character John Dutton will be killed off in the back half of Yellowstone's current fifth season.The first half of the season concluded on New Year's Day, with the second half originally slated to debut this summer, though that likely won't happen."
    ]
}