{
    "articleURL": "/sport/nba/article-12040431/La-Lakers-Game-1-thriller-vs-Golden-State-Warriors-117-112-Anthony-Davis-30-points.html",
    "content": [
        "Game 2 between the storied franchises is once more in San Francisco Thursday LeBron James dropped 22 points while fellow great Stephen Curry had 27 points DailyMail.com provides all the latest international sports news Anthony Davis manhandled the Golden State Warriors with his 30 points enough to give the LA Lakers a 117-112 Game 1 win. ",
        "A 14-0 Warriors run naturally spearheaded by Stephen Curry almost brought the Warriors a magical comeback win but D'Angelo Russell, LeBron James and Dennis Schroeder made the final four shots -- three of which were free throws -- of the game to take Game 1 for the Purple and Gold.Incredibly, the Tuesday night classic was tied at 112 with 1:25 remaining in the ball game before Russell's jumper and a James free throw. Golden State couldn't connect on its final three shots as the Lakers held on. Russell stalled a Warriors rally by sinking a tiebreaking hoop with 84 seconds remaining. Russell's interior hoop came after Curry triggered the run with a three-point play and later added 2- and 3-point hoops, the latter drawing Golden State even at 112 a piece.Davis' astonishing 30-point, 23 rebound, five-assist, four-block night was almost overshadowed due to the late Curry-led charge, but ultimately received its rightful moment in the spotlight as LA put down the first marker. ",
        "Before Draymond Green's irrelevant game-ending air ball, Jordan Poole had two chances -- including a missed game-tying three-pointer from 28 feet with nine seconds remaining. His long-range attempt was ridiculed on social media, partly given the shooting prowess surrounding him. 'Jordan Poole needs to be studied why on earth would he take this shot,' one Twitter user wrote. ",
        "Basketball twitter satirist Rob Perez tweeted: 'Jordan Poole: the walking, breathing Monopoly Chance Card. Straight to GO collect $200, or straight to jail. No in-between.'LeBron James added 22 points and 11 rebounds dueling with Curry in their latest postseason showdown. For all-time scoring leader James and Curry - who has the most 3-pointers ever - this is a new chapter in the long rivalry between the superstars after they faced off in four straight NBA Finals from 2015-2018 while James played for Cleveland.",
        "Curry's Splash Brother Klay Thompson had 25 points, and Kevon Looney grabbed a career-high 23 rebounds for his fourth game of this postseason with 20 or more. Looney also had 10 points and five assists. Thompson made a 3 with 5:19 to go that cut the Lakers' lead to 112-104.The defending champion Warriors will try to even the series in Game 2 on Thursday night back on their home floor.The Warriors had three players who hit six three-pointers in the game; Poole (6-11), Curry (6-13) and Thompson (6-16). Russell had a team-high six assists. He went 1-for-5 from 3-point range, part of the Lakers' 6-for-25 (24%) shooting from long distance. "
    ]
}