{
    "articleURL": "/sport/football/article-12041233/Arsenal-confirm-fan-arrested-shining-LASER-Mykhailo-Mudryks-face.html",
    "content": [
        " An Arsenal fan has been arrested after shining a laser into Mudryk's face  The Gunners came out 3-1 winners over London rivals Chelsea on Monday nightA 21-year-old Arsenal fan has been arrested after Mykhailo Mudryk had a laser shone in his eyes during the Gunners' 3-1 victory over Chelsea on Monday. ",
        "The winger was named amongst the substitutes, with Frank Lampard turning to him from the bench as Chelsea fell to a sixth consecutive defeat.Mudryk, a target for Arsenal in the January transfer window before he signed for Chelsea for £88million, was targeted by a laser after coming onto the pitch in the 71st minute.An Arsenal fan has been arrested for shining this in the face of the Ukraine international, the club said. The Met Police also confirmed the arrest and said there had been three more for ticket touting offences.'An arrest has been made following the use of a laser during last night's match,' Arsenal said.",
        "'This behaviour is dangerous and totally unacceptable, and we will fully support the police with their enquiries.'We will obviously take the strongest possible action.' The Met Police said: 'A 21-year-old man was arrested at the Emirates Stadium during the Arsenal v Chelsea match on 2 May on suspicion of a public order offence. He has been taken into custody. 'As the result of an anti-ticket touting operation before the Arsenal v Chelsea match, three men were arrested on suspicion of ticket touting and one man arrested on suspicion of breaching his football banning order. They were taken into custody.'It's understood the FA are looking into the incident. ",
        "Mudryk took to Instagram after the match to deliver a three-word response to the incident.Posting a picture of himself with a laser on him, Mudryk wrote: 'It's ok'.Mudryk has struggled since his arrival at Stamford Bridge in January, making just 12 Premier League appearances and failing to score yet.The 22-year-old looked destined for a move to Arsenal in the winter transfer window before the Blues acted quickly to hijack the deal. The winger will be hopeful of turning his form around when Chelsea bring in a new head coach, with Mauricio Pochettino the firm favourite after talks."
    ]
}