{
    "articleURL": "/wires/reuters/article-12055889/Mariners-rally-seven-runs-8th-stun-Astros.html",
    "content": [
        "J.P. Crawford's three-run double sparked a seven-run eighth inning as the Seattle Mariners rallied to defeat the visiting Houston Astros 7-5 Saturday night.",
        "Jose Caballero added a two-run double for Seattle, which has won five of its past six games.Reliever Tayler Saucedo (1-0) earned his first major league victory.The Astros took a 3-0 lead into the bottom of the eighth and reliever Rafael Montero (0-1) retired the first two batters he faced before nine consecutive Mariners reached base.Eugenio Suarez walked, and Cal Raleigh and Teoscar Hernandez reached on infield singles to load the bases. Crawford cleared the bases and tied the score with his double into the gap in right-center field.Ryne Stanek replaced Montero and walked pinch-hitter Taylor Trammell. Caballero then doubled to left center, scoring two to break the tie. Julio Rodriguez lined a run-scoring single to center and, after a single by Ty France, Jarred Kelenic lined an RBI single to right to make it 7-3.The Astros' Jake Meyers hit a two-run double in the ninth to cap the scoring.Seattle's rally spoiled the major league debut of Astros right-hander J.P. France, who pitched five scoreless innings. France, called up from Triple-A Sugar Land to start for the injured Luis Garcia, allowed three hits, walked one and struck out five.After Seattle left-hander Marco Gonzales retired the Astros in order in the first three innings, they broke a scoreless tie in the fourth.",
        "Mauricio Dubon led off the inning by lining a single into left field. An out later, Yordan Alvarez and Jose Abreu walked to load the bases. Kyle Tucker hit a sacrifice fly to right to bring home Dubon and Pena lined a run-scoring single to left to make it 2-0.The Astros tacked on a run in the fifth.With one out, Meyers hit a ground-rule double down the left-field line. Dubon reached on an infield single, with Meyers advancing to third. An out later, Alvarez lined a run-scoring double to left to extend the lead to 3-0.Gonzales allowed three runs on six hits in six innings, with three walks and four strikeouts.--Field Level Media"
    ]
}