{
    "articleURL": "/tvshowbiz/article-12046685/Harry-Styles-releases-Wall-E-inspired-video-single-Satellite.html",
    "content": [
        "Harry Styles' latest music video for his single Satellite has dropped and it is being compared to 2008 Pixar animation Wall-E, which sees a cleaning robot find love.",
        "At the beginning of the video, the robot - named Stomper after Harry's Satellite Stomp dance move - is backstage at one of his shows at the Forum in Los Angeles.The machine blinks away invisible tears while watching a broadcast of the Curiosity rover roaming around Mars alone for more than a decade, narrated by Brian Cox.Stomper watches as Harry's crew spring to action ahead of the gig, with the Love on Tour band huddling together before the performer takes to the stage.Harry himself barely features in the video, aside from a few moments, including one where he is onstage singing Satellite and the crowd's vocals blend with his own.  ",
        "They all sing: 'Spinning out waiting for ya to pull me in/I can see you're lonely down there, don't you know that I am right here?'The song centres in on the idea of going around and around in circles searching for something and the lyrics hint at heartbroken emotions.After the show ends, Stomper is once again alone, as he is seen driving over foa feathers left by Harry's fans in the grounds of the arena.He also hopes to find a connection with a skateboarder by mimicking his tricks.After leaving the venue, Stomper wanders out on a cold and rainy night, avoiding traffic on a busy highway and travelling through canyons and deserts.",
        "During his search for a connection, which also takes him to the mountains, Stomper befriends a rat, which could be another Pixar reference to animation, Ratatouille.Stomper ultimately finds what he is looking for in Harry and the duo can be seen lying side by side in the grass outside NASA, looking up at the real satellite.As Stomper settles beside Harry, his battery runs out. ",
        "The lyrics suggest a stark distance between Harry and the person that he is singing about, who is simply referred to as 'she'.However Harry hints at a change in his emotions in the second part of the film, and rather than being asked to be 'pulled in', he sings: 'I'm in an L.A. mood / I don't wanna talk to you.'However the chorus goes on to double down on the idea of 'being there' for someone, suggesting that the track portrays the ups and downs of a relationship."
    ]
}