{
    "articleURL": "/tvshowbiz/article-12041161/Charles-Dance-reveals-brutal-secret-keeping-toned-physique.html",
    "content": [
        "The Crown and Game Of Thrones star Charles Dance has often raised eyebrows when pictured shirtless on the beach. ",
        "And the age-defying actor has revealed the brutal way he manages to stay in shape - swimming in freezing cold water and lifting weight.He has said he enjoys going wild swimming at Hampstead Heath in north London for much of the year because he is able to stand the cold temperature.He told The Mirror: 'I’ve managed March until November, but there’s a point… six degrees is about my limit. It’s quite cold, it takes you a long time to warm up. But you feel great afterwards.'Acknowledging that he is lucky he has been blessed with good genes, he added: 'I try to eat sensibly and I do a range of basic weightlifting exercises to work on different bits of your body, but I’m not bodybuilding.'",
        "'It’s just, you get to an age where you have to look after yourself, because your muscles begin to diminish. Don’t stand me next to Arnold Schwarzenegger.'Saying he thinks he looks OK, he said he has 'love handles' now and was surprised as he didn't think that would be something he would get.But he said he has no problem with people swooning over him saying he prefers to be looked at rather than overlooked.Charles was pictured on the beach in 2020 while attending the Venice Film Festival with younger girlfriend ­Alessandra Masi, now 54 - and is 22 years his junior.",
        "They met on the set of his newly released film, The Book of Vision. Former actress Ms Masi was working as a production manager on the surreal historical movie which was shot on locations in Italy and Belgium.The film features Dance as two doctors – one in modern London and the other in 18th century Prussia. Asked what was his main memory of the movie, he said: ‘To be honest, it’s meeting Alessandra.’The couple have now been together for around three years. ",
        "Charles - who starred as Tywin Lannister in the first four series of Game of Thrones - and as Lord Mountbatten in the third season of The Crown, was married to Joanna Haythorn from 1970 to 2004, and they have two grown-up children.He then dated actress Sophia Myles, then in her 20s, who has starred in films including Thunderbirds, but they split in 2005.Charles was also linked to French-born ex-Gucci model Shambhala Marthe, and then dated artist Eleanor Boorman for four years. Despite welcoming baby daughter Rose together in 2012 and even getting engaged, the couple split months later. "
    ]
}