{
    "articleURL": "/news/article-12042983/Hunt-animal-abuser-cat-BEHEADED-placed-London-playground.html",
    "content": [
        "Cat's head was discovered at Homerton Grove Adventure Playground on April 24RSPCA believes leaving it there was a deliberate act and appeals for informationAn animal charity is hunting for an animal abuser who beheaded a cat and placed it at a London playground in a 'uniquely disturbing' incident.",
        "The black and white cat's head was discovered by staff at Homerton Grove Adventure Playground in Hackney on April 24 around 3.30pm, when the staff member opened the park for the afternoon.The RSPCA, who is appealing for information on the disturbing discovery, believes leaving the cat's head there was a deliberate act and labelled the incident a 'uniquely disturbing situation'. Michael Harrington, an RSPCA animal rescue officer, said: 'This is a truly horrifying story. We were alerted to the discovery of a dismembered black and white cat head at a children's playground on Monday last week (April 24). 'The head was very carefully placed at the bottom of a children's play apparatus and left in a way that it would be easily found.'",
        "The playground equipment in front of which the head was found is one of the most used and popular things in the playground, the RSPCA has been told.The head was discovered near the main entrance on Wardle Street and it is believed the incident will have taken place between 6pm on April 23 and 3.30pm on April 24. Mr Harrington said: 'This must have been a shocking discovery for the member of staff who stumbled upon it, but we are profoundly grateful that it was not found by a small child who could have been deeply traumatised.",
        "'This is a completely unthinkable act and we very much hope someone will have seen or heard something that can help us with our investigation,' Mr Harrington continued. 'There is a uniquely disturbing situation and we are keen to get to the bottom of what happened here.'The RSPCA has been unable to obtain CCTV footage from the scene due to a lack of cameras, so they are appealing for anyone with information to contact their appeals line in confidence on 0300 123 8018.  "
    ]
}