{
    "articleURL": "/tvshowbiz/article-12058437/Kylie-Jenners-BFF-Anastasia-Stassie-Karanikolaou-gives-hint-midriff-denim-skirt.html",
    "content": [
        " Anastasia 'Stassie' Karanikolaou showed off her toned frame in a co-ord as she headed out for dinner in Santa Monica on Sunday.",
        "The Los Angeles native didn't cut corners when it came to her fashion choice for the evening, decked out in a black and white-patterned skirt and a matching denim top that gave a hint of her toned midriff.While the stylish skirt came down to her knees, she didn't show any of her legs by adding a pair of knee-high black leather boots to the ensemble.Karanikolaou, 25, and her male friend were spotted just as they left the popular Italian eatery Giorgio Baldi, which is often a celebrity hotspot.The dark denim top helped showcase her ample cleavage with its tight fit, complements of the zipper that went top to bottom, and plunging design. ",
        "On this night, Karanikolaou wore her dark tresses long and flowing down over her chest and back that fell to just above her waistline with a part in the middle.She also carried a small black purse over her left shoulder, as she held on tight to her trusty cell phone.Her male companion kept it more casual in the fashion department dressed in baggy dark pants, a pink hoodie, white and black sneakers, and a brown baseball cap over his short hair.Earlier in the day, Stassie took to her Instagram page and posted a mirror selfie of herself seemingly getting dressed ahead of her night out.",
        "In the photo, she can be seen looking towards her camera phone as she held it up in front of the mirror in a bathroom dressed in black tight shorts and a matching spaghetti-strap top.Still getting her look together, she appeared to be makeup free and had her raven locks pulled up into a top bun.",
        "The previous day Stassie shared a series of promotional snaps for Wardrobe Couture that showed her crouched on a bench in a dark ensemble that included shorts, a top that hung off her shoulders, cowboy boots and a black baseball cap.'F is for friends who do stuff together U is for u and me N is for anywhere and anytime at all boots sourced: @_wardrobecouture_ In the first image she can be seen flashing a big beaming smile as she pushed her face towards her knees.She then had her head back up and her hand clasped under her legs while showing a frown on her face.Lastly, the social media butterfly got a burst of energy and kicked up her heels and seemingly gave a loud road, from the looks of her excited expression. ",
        "Just in the last week the curvaceous influencer spent some time in the tropical paradise that is Turk and Caicos, where she celebrated the makeup brand Tarte's latest drop.",
        "YouTube"
    ]
}