{
    "articleURL": "/tvshowbiz/article-12055567/Chelsee-Healey-shows-taut-abs-pink-purple-crop-top.html",
    "content": [
        "Chelsee Healey looked sensational as she arrived at The Ivy Restaurant in Manchester on Saturday.",
        "The actress, 34, showed off her taut abs as she wore a cropped pink and purple Yves Saint Laurent top.She opted for a pair of edgy pink jeans which featured large pockets and patched detail on the legs.The Waterloo Road star carried a pink handbag with her to complete her eye-catching outfit for the evening.Chelsee wore lashings of make-up to highlight her pretty features and accessorised with a pair of gold hoop earrings. ",
        "It comes after Chelsee revealed her five-year-old daughter has been subjected to racist abuse online.The actress finds it 'heartbreaking' when trolls focus their attention on her little girl Coco - who she shares with former partner Jack Malloy - but she refuses to get drawn into a war of words with the bullies.She told the Daily Star Sunday newspaper: 'My daughter gets sent racist abuse through ­social media.'I've been sent a lot of messages about Coco. When it's about an innocent child it's not nice. It's heartbreaking. But I try not to reply back. I don't entertain it.'The star admitted she's been a target for trolls for years, with things getting particularly bad when she took part in Strictly Come Dancing in 2011, when she came second with partner Pasha Kovalev.She said: 'When I was on Strictly, I got a lot of hate. It's such a big show – that was the first time a lot of people had seen me. I got called \"hippo\" and things like that.'",
        "Chelsee insisted she is 'thick-skinned' but says she can't stand people sending cruel taunts about her daughter.The soap star no longer searches online to find out what people have been saying about her because there is 'always' some 'nasty stuff'.",
        "The soap star revealed that there is a liaison rep that the Hollyoaks cast can talk to if they need any further support.Chelsee first spoke about online bullies targeting Coco when she was just two-years-old. She shamed the vile messages on Twitter after racists branded her toddler a 'black monkey'.Chelsee shared a screenshot of an example message she received, labelling the abuse 'disgusting'. ",
        "The troll's post read: 'Right sl*t aren't ya? Daughter is a black monkey.'Chelsee tweeted a message alongside it, saying: 'You know what, I get nasty messages all day mostly about me!'I'm a big girl, I can handle that, but saying something so disgusting about my beautiful, innocent baby upsets me.'Especially when there's nothing you can do to protect them from people's vile words.'"
    ]
}