{
    "articleURL": "/tvshowbiz/article-12047077/Rita-Ora-Lewis-Capaldi-Ellie-Goulding-artists-receive-BRIT-Billion-awards.html",
    "content": [
        "Rita Ora, Lewis Capaldi and Ellie Goulding are just some of the artists who have received the first ever BRIT Billion awards.",
        "The British Phonographic Industry has introduced a new award celebrating an artist reaching a whopping billion streams in the UK.Data from the Official Charts Company includes 'tracks an artist has appeared on either as the principal performer or as a featured artist'.ABBA, AJ Tracey and Headie One are also among the honourees, alongside Sam Smith, Mariah Carey, Anne-Marie and George Ezra.The Swedish pop legends, for instance, have sold 400 million albums worldwide, had 17 No. 1 hits and over 50 million weekly global streams.",
        "Their most-streamed hits are: Dancing Queen, Gimme! Gimme! Gimme! (A Man After Midnight) and Mamma Mia.As for Lewis, his mega-hit Someone You Loved was 2019's biggest single of the year and the most-streamed song in the UK of all time with over 600 million streams.He said: 'Am so buzzing to be one of the first artists ever to be given a 'BRIT Billion' award! Never in a million years did I think any of this stuff would happen but now it is I will gladly accept each and every award, you have my address x.'Pop Diva Mariah's 1994 festive classic All I Want For Christmas Is You is one of the UK's most-streamed songs, having amassed more than 370 million streams.Mariah Carey said: 'I'm really honoured to be one of the recipients of the BRIT Billion Award. I'm so grateful to my fans for their endless and enduring support. I love you UK lambily and cannot wait to come back to your side of the pond and create more magical moments together.'",
        "RAYE, whose hit single Escapism achieved Platinum status, said: 'Thank you so much to the BPI for this award.'One billion streams is a very overwhelming number to truly wrap my head around, I'm very grateful to everyone and anyone who is included in that number, thank you.'Rapper AJ Tracey, whose 2019 hit Ladbroke Grove has racked up over 250 million streams to date, said: 'It's a real honour to have been given one of the first ever BRIT Billion awards. I do this all for you guys, so thank you for listening. New album on the way. Stay locked!'",
        "The late Whitney Houston - whose biggest hits include the 3x Platinum I Wanna Dance With Somebody, plus Saving All My Love For You, It's Not Right (But It's OK) as well as I Will Always Love You and My Love Is Your Love - has also earned a Billion award.Representative of the Whitney Houston estate, Pat Houston, said: 'Whitney would be very proud of this award, and the first thing she would say is, \"Is this for me?\"'Thanks so much to all of her worldwide fans, and on behalf of the Whitney Houston estate, I want to say thankyou, and that we are extremely grateful, and that we appreciate you.'",
        "Each artist will own a specially-designed trophy by BPI by Gaudio Awards1, boasting the BRITs 'B' and an encapsulated BRITs statuette, with their name.Sophie Jones, BPI Chief Strategy Officer and Interim Chief Executive, said: 'For a recording artist, there can be few greater sources of pride than having a Platinum or Gold disc on their wall, but in an era when success is measured in the hundreds of millions and indeed billions of streams, it was clear that we needed a new and additional way to recognise and celebrate outstanding achievement in recorded music, and I feel certain that having a BRIT Billion Award will become equally prized.'"
    ]
}