{
    "articleURL": "/wires/reuters/article-12058777/Indias-Go-Airlines-seeks-bankruptcy-order-cites-lessor-plane-moves.html",
    "content": [
        "By Arpan Chaturvedi and Aditi Shah",
        "NEW DELHI, May 8 (Reuters) - Go Airlines on Monday called on India's company law tribunal to urgently grant its request for bankruptcy protection, as more lessors sought to repossess planes and the country's aviation regulator told the carrier to stop selling new tickets.The airline, widely known as Go First, filed for bankruptcy protection last week, blaming \"faulty\" Pratt &amp;amp; Whitney engines for the grounding of about half its 54 Airbus A320neo. In all, it has 57 planes.While the National Company Law Tribunal heard Go First's bankruptcy plea last week, it has yet to pass an order.This has given lessors a window to try to secure their assets. On Monday, leasing companies Sky High XCV Leasing Company, ACG Aircraft Leasing, SFV Aircraft Holdings and some others submitted requests to India's aviation regulator to take back at least 13 planes, according to regulatory notices.In all, a total of 33 requests have now been made by lessors including GY Aviation Lease and SMBC Aviation Capital.Lawyers representing cash-strapped Go First said at Monday's court hearing the lessors' actions could further impair its operations.Separately, the regulator ordered Go First to stop selling new tickets, a government source with direct knowledge of the matter said.A spokesperson for the airline said it would respond to the regulator's order in due course.",
        "Pratt &amp;amp; Whitney, part of Raytheon Technologies and the exclusive supplier of engines to Go First, has previously told an arbitrator that the airline's claim of defective engines causing its demise was \"astounding\" and without evidence.Go First failed because of \"its own poor management and events like COVID\", Pratt said, according to legal documents.The fall of Go First marks the first major airline collapse in India since Jet Airways filed for bankruptcy in 2019.Go First's total debt to financial creditors was 65.21 billion rupees ($798 million) as of April 28, it had earlier said in a bankruptcy filing with the tribunal. (Reporting by Arpan Chaturvedi and Tanvi Mehta in New Delhi; Writing by Rama Venkat and Dhanya Skariachan in Bengaluru; Editing by Alexander Smith, Sharon Singleton and Mark Potter)"
    ]
}