{
    "articleURL": "/wires/aap/article-12049141/Booker-Prize-winner-talks-magic-danger-writing.html",
    "content": [
        "Author Shehan Karunatilaka was wearing black nail polish when he won the Booker Prize, and he's stuck with the look even though his wife hates it.",
        "Everything has changed for the Sri Lankan-born writer since the October 2022 announcement - everything except the manicures.\"I picked up the Booker with my black nail polish and since then I feel I have to keep it going,\" he told AAP.Happily for Karunatilaka, he's staying in the trendy suburb of Fitzroy ahead of his appearance at the Melbourne Writers Festival on Friday night.It's all part of a mad ride that has seen magical-realist The Seven Moons of Maali Almeida find a massive global audience (his first novel Chinaman was aimed at cricket tragics).It's meant he's only done two or three days of writing in six months.\"I am enjoying it but it's not the natural setting - the natural setting is sitting by yourself in a room for years on end,\" he said.\"I am looking forward to the circus dying down and going back to my boring life of sitting in a room and writing.\"In Seven Moons, the main character Maali Almeida, a photographer, gambler and 'closet queen', wakes up as a ghost with seven days to find out who killed him.His book is set during the civil war in the author's homeland, with the plot a way to talk about the long-running conflict without inviting controversy.",
        "The late 1980s was so many lifetimes ago in Sri Lankan politics the novel felt like historical fiction, Karunatilaka said, while its talking animals and demons helped insulate him too.When the author worked as a advertising copywriter, he helped promote the postcard-perfect image of Sri Lanka by writing tourist brochures and airline ads.But there's always turmoil of some kind, he said, and though some may not like the picture of Sri Lanka in Maali Almeida, the real story is far more gruesome than anything on the page.Freedom of speech can't be taken for granted in South Asia according to Karunatilaka, and the potential for dangerous offence is always in the back of his mind during editing.He recently decided to remove a short story that was too hot to handle from a collection before it was published.\"In the end I thought 'Is this story worth getting stabbed over?' I've got young kids and I don't take myself that seriously,\" he said.Readers might wonder whether another Booker Prize winner, Salman Rushdie, would have done the same.The Indian-born novelist is idolised by a generation of South Asian writers, Karunatilaka said, but attacks on the author and his translators are also a cautionary tale.\"When you see what he's been though, it does give you pause when you are writing.\"",
        "The author may be more a voice of conscience than an activist, but he was on the streets of Colombo in July 2022 when protests toppled President Gotabaya Rajapaksa.Children were confronting heavily armed guards, and while Karunatilaka was watching history unfold, he feared it would once again turn violent.\"All this drama was happening, which is great for a novelist - not so great if you are a father of two kids and you have ageing parents and you are worried about the future,\" he said.As he travels the world to talk about Maali Almeida, he hopes recent events at home are not merely another false dawn.There's a novel to be written about all this of course, but Karunatilaka jokes that it will take him another 20 years to get there.For now, he's looking forward to a period of stability and peace - and hopefully the Sri Lankan cricket team will start winning some matches.Shehan Karunatilaka will discuss The Seven Moons of Maali Almeida at the Melbourne Town Hall as part of the Melbourne Writers Festival on Friday."
    ]
}