{
    "articleURL": "/femail/article-12043155/What-wear-weekend-DINAH-VAN-TULLEKEN-picks-selection-fabulous-fuchsias.html",
    "content": [
        "I have my Coronation outfit ready - and there’s not a spot of red, white or blueREAD MORE: FEMAIL picks out a selection of camel classicsPARTY IN PINKTa-da! I have my Coronation outfit ready - and there’s not a spot of red, white or blue.   ",
        "Nope, I’m in head-to-toe pink.Greta Gerwig’s Barbie movie is coming and that means one thing is for certain: the trend for fuchsia is here and I couldn’t be happier.Even staunch minimalists like me want a little colour in our lives, and this lurid pink is one I’ve got used to. There’s comfort in familiarity.",
        "NOT SO BIMBOYes, yes, pink traditionally has connotations of a certain ‘bimbo’ aesthetic, but get with it, people: Legally Blonde was released in 2001. In 2023, we’re all wearing it. It has become the definitive celebratory hue: a bold, bright, feminist statement. If you think it’s too loud, too look-at-me, then get over it - you’re not going to be the centre of attention this Saturday, with Charles in a robe that’s made of actual gold thread.HAUTE TO HIGH STREETNow if money were no object, I’d treat myself to Valentino’s crepe floral-applique wool-blend dress from their fuchsia-toned runway show, but it’s £8,400. And money is very much an object. Instead, I’ll turn to the High Street. This vivid pink textured silk-linen dress from Jigsaw is a real find. It’s comfortable for relaxed daywear and the bias cut means it doesn’t cling. If you want something more fun, take a look at Kitri’s feathered design below — perfect for your Coronation after-party.MAKE IT HOTWhatever you choose, make sure it’s in a rich, vibrant hue. To nail the trend, you want a properly saturated pink (this is also one of the easiest tricks to making a garment look expensive). ",
        "As you can see, I recommend taking the fuchsia bull by its horns and committing from head to toe.NOW SHOP THE TREND...   EDEN TRENCH COAT Coat, £338, reiss. com £338.00 Shop  Cloud Leather Clutch Bag, Fuchsia Pink Bag, £49, johnlewis.com £49.00 Shop  VOLUMINOUS BOAT-NECK BLOUSE Top, £69, cos.com £69.00 Shop  Carlotta Pink Heart Print Mini Dress Dress, £145, Kitri at fenwick.co.uk £145.00 Shop  Suede Stiletto Heel Pointed Court Shoes Heels, £49.50, marksandspencer.com £49.50 Shop  Relaxed Double Breasted Blazer Blazer, £59.50, warehousefashion.com £59.50 Shop"
    ]
}