{
    "articleURL": "/tvshowbiz/article-12051619/Halle-Bailey-sizzles-Vogue-Arabia-cover-film-Little-Mermaid.html",
    "content": [
        "Halle Bailey is having a moment - the singer and actress can add cover model to her resume. ",
        "The Little Mermaid star, 23, graces the cover of the May issue of Vogue Arabia.The Grown-ish star looked gorgeous in a long, red Schiaparelli dress featuring a hood and ruching throughout the torso.The Chloe x Halle singer accessorized with a necklace and rings from Dior.Halle is about to have her breakout moment as the live action The Little Mermaid is hitting theaters on May 26. The film is projected to take in $110M on its opening weekend, according to Deadline.",
        "In the interview with Vogue Arabia, Halle reflected on the moment she found out she had won the role of Ariel over other actresses, including, if the rumors are true, Zendaya.'I was at home with the family celebrating my sister Chloe's birthday, so when I got the call, it was even more of a celebration,' she revealed. Halle and her older sisters Chloe and Ski grew up on Disney movies and in particular, always felt an affinity for The Little Mermaid.'I remember watching The Little Mermaid for the first time when I was around five years old,' Halle said. 'My older sisters Chloe and Ski would pretend to be mermaids whenever we were in the swimming pool; it's cool how it's all come full circle.'The Lion King star also commented on the racist backlash to her casting.",
        "'I initially expected everyone to be as excited as I was, but the reality of it all hit me later as I realized the world that we live in. I just hope that people who aren't sure about it, go and watch the film and realize we did the original justice,' she explained.Halle also recently wrapped filming on The Color Purple remake.'It feels incredible to be working on such big, important films, especially as it's all relatively new to me as I consider myself a singer first,' the Chloe x Halle singer said. 'I'm just glad that we get to remake these movies so that new generations can see what the hype is all about and experience these wonderful stories first-hand.' On Thursday, Halle stopped by SiriusXM's Hollywood studios to talk all things The Little Mermaid with Julia Cunningham.",
        "For that outing, she looked fit and trim in a cropped denim jacket with a triangle cut out between her breasts. She paired the on-trend jacket with a pair of jeans with swirls painted on them and a pair of white pumps. Halle completed the look with a pair of gold hoop earrings. The Little Mermaid is expected to make a big splash when it hits theaters over the Memorial Day weekend. "
    ]
}