{
    "articleURL": "/tvshowbiz/article-12052107/Amy-Hart-showcases-post-baby-figure-black-swimsuit-two-months-giving-birth.html",
    "content": [
        "Amy Hart showcased her incredible post-baby figure on Friday, just two months after giving birth.",
        "The former Love Island star, 30, welcomed baby son Stanley with her boyfriend Sam Rason in March.And Amy looked full of confidence as she slipped into a flattering black swimsuit as she tried on a number of outfits ahead of jetting off on holiday.The reality star took to her Instagram stories where she filmed herself in the mirror while packing a number of clothes for her trip.Her blonde locks were piled atop her head with a pair of sunglasses while she stood in her kitchen.",
        "Speaking to the camera, she said: 'I’m just packing so I thought I’d try this on to show... This is the black swimming costume and I got a size 14, so I think it’s the right size for me.'It’s a bit booby so it’s still a little bit sexy. I like it.'She added: 'It's actually stretchier than the bikini so I think if you're in between sizes you can  go for your normal size rather than sizing up.'It comes after Amy was praised last month for her candid approach to post-baby dressing after sharing an outfit try-on Instagram post. The reality star took to Instagram in April to share an insight into her postpartum wardrobe choices - with incredible candour about less flattering options. ",
        "One outfit in particularly drew both laughs and praise from fans as Amy tried on a white playsuit which she struggled to button up - yet still shared a clip of the undone one-piece with the buttons straining across her torso. In the caption on the shot, Amy penned: 'First one back clearly not as confident as I was but it’s a work in progress! Sam will not be able to resist me in outfit 3. links and explanations on stories! #zara #zarahaul #keepordelete #zarafashion #springfashion.'Fans wrote underneath: 'Thank you for including number 3 and keeping it real! Love number 2 on you... You look amazing Amy! I love that you included the 3rd one. We all have those moments! The second dress is so lovely x... ",
        "'I know that you probably don’t feel like yourself (speaking from experience of having had two kids myself) and I know you are probably looking at all the bits you don’t like, but honestly you look absolutely incredible...'It’s so refreshing for people to show their real post natal bodies. Thank you for repping for reality!! Xx... You look lovely on all of them. Even number 3 xxxxxxx... The green dress looked Fab!'Another ensemble in the try on was a stunning green vest dress which clung to her frame in a stunning fashion. She also went for summery options in a flirty blue mini dress and a linen sundress. ",
        "Amy, who starred in the 2019 series of the Love Island, shared a sweet Instagram post in March after welcoming her bundle of joy. She gushed over her newborn and said that she and Sam were both 'so so in love'.She wrote: 'Well…. 4 days of contractions at home (which everyone told us were braxton hicks…they weren't), 4 very short hours in the delivery suite and 5 long days in hospital later, we are home with our dreamy baby boy!'Born at 3.31am on 3/3/23 weighing 8lbs with the most beautiful head of hair (Amy would take the 9 months of reflux again) and we are so so in love. Proper introductions to come but now we're home safe and sound.'She continued: 'Thank you to everyone who sent their well wishes. We really appreciated it over the last few days. [here's a few delivery room snaps, can't wait to show you his beautiful, non post birth swollen face!' "
    ]
}