{
    "articleURL": "/news/article-12059047/William-Kate-lead-nation-Bank-Holiday-Monday-volunteering-Big-Help-Out.html",
    "content": [
        "Follow all the latest royal news and updates on Coronation events on MailOnline's live blog here Five-year-old Prince Louis operated a digger with his father today - while his older brother and sister watched with a hint of nerves - as the they led the nation on a day of volunteering to mark the Coronation.",
        "The young prince missed the Coronation Concert last night because it was past his bedtime, but on his first ever official royal engagement he was operating a mini JCB as the family spruced up a Slough scout hut to support the Big Help Out.When the Prince of Wales took control of a digger, Louis jumped into his father's lap as William moved the mechanical arm and grabbed a bucket full of soil before dumping it on a heap. He looked fascinated as William worked the controls of the excavator.And it didn't end there, Kate was seen pushing a wheelbarrow while her youngest son shoveled in sand. He then took control, steering it expertly as his mum supported its weight. Louis also did some painting for a mural.When his work was done he devoured several toasted marshmallows. Charlotte opted for a s'more - a gooey marshmallow in between two chocolate digestive biscuits. When Louis spotted one going spare his father was heard declaring: 'You've made his day - you won't hear a peep out of him now' as he chomped away on the treat.Kate then revealed her affectionate nickname for her youngest son, calling him 'Lou-Bugs'.Charlotte was seen delightedly running to help prepare a new path while George, a future king himself, was spotted learning how to use a power drill. ",
        "All three young royals had a crack at archery - as did their parents - but while George did grab the controls of the digger, Charlotte appears to have declined. The couple and their three children were out and about again to mark the third day of the King’s Coronation, and Charles III's life of service.The Princess of Wales has been Joint President of the Scouts since 2020 and the royals joined volunteers resetting a path, digging a new soakaway, sanding and revarnishing the front door, adding planters to the front of the building and adding a mural to create a lasting legacy of the Big Help Out’s work. William and Kate, who were casually dressed, wore scarfs from the 3rd Upton Scout Group as they mingled with scouts and leaders taking part in The Big Help event – one of thousands across the country to mark the end of the coronation.Louis, five, tried his hand at archery accompanied by his elder brother George, nine, and sister Charlotte, eight.Each fired an arrow tipped with a rubber suction pad at a target.Volunteer Beatriz Andrade said the junior members of the royal family all hit the target.William and Kate also took part in the mini archery contest.'They were very good, and seemed to have good fun,' she said.",
        "The three young royals were happy to toast marshmallows over an open fire while William and Kate chatted to scouts from several troops in the Slough area.Daniel Madigan, from the 1st Chippenham scout troop, said George, Louis and Charlotte joined in all the outdoor activities that had been laid on.‘I saw them toasting some marshmallows. They seemed to enjoy it,’ he said. ‘Louis also helped move sand into a wheelbarrow.’",
        "He said the Big Help Out event was to make improvements to the scout hut, including building a ramp at the rear of the scout hut to make it more accessible.As the Princess of Wales left she stopped to talk to local resident Donna Robinson who was standing by a barricade with her seven year old daughter Ciara.The Princess, casually dressed in a blue top and dark coloured trousers, held on to Louis’s hand as she stopped to say hello and asked Donna how old her daughter was.Donna said:’ She asked what year Ciara was and was lovely.’William and Kate attended in support of the Big Help Out along with other senior royals including the Duke and Duchess of Edinburgh, the Princess Royal and the Duke and Duchess of Gloucester. Princess Anne and her husband, Vice Admiral Sir Timothy Lawrence, are at a civic service recognising local volunteers at Gloucester Cathedral, which will be followed by a special reception for invited volunteers and charity representatives from across Gloucestershire. ",
        "Sophie, Duchess of Edinburgh, as a patron of Guide Dogs, is attending a puppy training class at the Guide Dogs Training Centre in Reading with her husband, Prince Edward.There are over 8million opportunities to get involved today, with more than 52,000 events happening across the nation.",
        "The 3rd Upton Scouts Hut was built in 1982 and is used by a variety of community groups in the area, including the local mosque, a senior citizens contact group for members of the Asian community and the Scout group themselves. The building is also used by ‘Slough All Nations,’ a group with heritage spanning across St. Kitts &amp; Nevis, and which provides recreation and leisure activities to improve health and wellbeing and promote community cohesion.  Among other planned events, the Royal Parks is holding a drop-in session in Green Park in central London, close to Buckingham Palace, where volunteers can plant wild flowers in the same spot where the public laid floral tributes to the late Queen.The Duke of Gloucester, the late Queen’s first cousin, and his wife Birgitte are meeting young volunteers at a Coronation party at St Mark’s Coptic Orthodox Church in Kensington, west London.Meanwhile, Prime Minister Rishi Sunak is helping out at a lunch club, Labour leader Sir Keir Starmer will hit the phones with the NHS Volunteer Responders scheme, Welsh First Minister Mark Drakeford is volunteering at a local charity shop, and Scotland’s First Minister Humza Yousaf is volunteering at a local community larder.",
        "Mr Sunak said: ‘The Big Help Out is not only a chance for everyone to come together to mark His Majesty’s Coronation, it’s also a reminder of how each and every one of us can help make a change for the better.‘It is this community spirit that binds us and makes us stronger as a country, and I hope that as part of the legacy of this historic moment of national unity, people will be inspired for years to volunteer, to help out and to make a difference to others around them.’Chief Scout and adventurer Bear Grylls is the star at a huge taster session for potential recruits in Wembley, north-west London.Would-be volunteers will be able to try out Scouting activities including climbing, archery, marshmallow toasting and parachute games.",
        "The senior royals, celebrities and leading politicians will join an estimated 6million Britons who say they are planning to get involved in the Big Help Out, according to a recent poll.Organised by the Together Coalition and other organisations including faith groups, the Scouts and the Royal Voluntary Service, the Big Help Out aims to pay tribute to King Charles’ decades of public service and create a lasting legacy of volunteering from the first crowning of a British monarch in 70 years.",
        "More than 33,000 organisations have signed up to take part in the initiative, with volunteering opportunities available through the launch of a new app.Among the scheme’s backers are some of country’s best-known charities, including the NSPCC, RSPCA, the National Trust, the RNLI and the British Red Cross.And more than 1,000 businesses have thrown their weight behind the scheme, including BT, British Airways, John Lewis, McVities, PWC and NextDoor, among others.Is there a Big Help Out near me? How to volunteer for King Charles' Coronation projectThe Coronation and its concert have proved to be a buzzing success in getting the country to come together and celebrate.And it's still not over, as today King Charles III and Queen Camilla are encouraging people to come together in communities and volunteer as part of the Big Help Out Initiative.The scheme, which aims to inspire a new generation of volunteers by giving people a taster of what they can achieve, has been backed by celebrities across the country.It takes part on today's Bank Holiday as part of the official Coronation celebrations. Here, FEMAIL tells you how you can roll your sleeves up and get helping...",
        "IS THERE A BIG HELP OUT NEAR ME? To see if a project near you is offering volunteering opportunities, just use The Big Help Out app to search by postcode, type of activity and the organisation they would like to work with.It is available on the Apple app store and Google Play. More than 1,500 charities have signed up. The Big Help Out has been organised by The Together Coalition and leading charities.In Somerset, people can take part in a taster session at their local Age UK charity shop.And in Shropshire, the Ramblers is calling on people to walk on local paths and record any issues.Scout groups will let people try activities that their volunteers do regularly, such as climbing, archery, or campfire cooking.Loved Island's Faye Winter, 27, helps out with the charity The Guide Dogs for the Blind Association and has praised the initiative.'It's a fantastic cause and I would recommend volunteering to anyone who is able to donate some of their time,' the reality star said.",
        "WHAT CHARITIES CAN I GET INVOLVED WITH?There are thousands of charities which are signed up for The Big Help Out, including huge organisations like The National Trust, the RSPCA, British Red Cross and Citizens Advice.Other worthy causes include St John Ambulance, Samaritans the NSPCC. There are endless opportunities which are bound to cater to causes you're passionate about. CAN I ORGANISE A VOLUNTEERING EVENT? You can organise a volunteering event by going to The Big Help Out website.'The more people who organise an event, the bigger the Big Help Out will be,' it reads.'Thousands of organisations, from the smallest local community groups to some of the UKs biggest names are doing just that.'Everything you need to know to organise an event can be found on the app or on the event's site. 'And don’t forget to spread the word in your communities and on social media by using or adapting the helpful designs in our toolkit,' it added.WILL ANY OF THE ROYALS BE VOLUNTEERING?The Prince and Princess of Wales are expected to spend the Coronation bank holiday volunteering with some of the UK's largest charities.The senior royals will likely participate in the event - a nationwide day of service aiming to create both a tangible tribute to the King's history of public service and echo his hope of creating a lasting legacy from the first crowning of a British monarch in 70 years.William and Kate are understood to believe the day of charitable giving is a 'fantastic' idea, royal insiders told The Telegraph. The Big Help Out is being organised by several prominent public figures including Brendan Cox, widow of murdered Labour MP Jo Cox. ",
        "Launching the initiative, Chief Scout Bear Grylls said: 'Volunteering has always been a huge part of what makes this country great – from families looking after evacuees during the Second World War to neighbours looking out for each other during the pandemic.'But it's not just in times of crisis that we step up. Volunteering is what powers our communities, from Scout leaders to football coaches, collecting the shopping for an elderly neighbour to helping out at the school fete.'The Big Help Out will put volunteering centre stage for a day and give people easy ways to join in.'He added: 'We're delighted to be a central part of the Coronation weekend, particularly given The King and Queen Consort's long history of support for volunteering.'",
        "Organisers hope for an 'unprecedented' community response. Catherine Johnstone, chief of the Royal Voluntary Service, described it as a 'wonderful opportunity' for people to come together.Mr Cox, co-founder of the Together Coalition, said: 'How we mark the Coronation will reflect the kind of country we are. We hope an opportunity to volunteer will leave a long-lasting legacy in communities around the country.'Stuart Andrew, minister for civil society, said: 'The Big Help Out is a fitting tribute to the King's life of public service and the Queen Consort's long-standing support for volunteering. It will give individuals the chance to see the wider benefits volunteering can bring to their own wellbeing and to efforts to tackle loneliness.'Learn more at the initiative's website www.thebighelpout.org.uk"
    ]
}