{
    "articleURL": "/news/article-12042537/Pictured-Car-enthusiast-crushed-death-Land-Rover-rolled-him.html",
    "content": [
        "Car-lover Colin Campbell died while working underneath his Land Rover  Neighbours today paid tribute to a man who was crushed to death by his own car in a freak driveway accident.",
        "Car-lover Colin Campbell had been working underneath his Land Rover when it rolled on top of him.Mr Campbell, who lived alone in Leeds, West Yorkshire, was found by a neighbour pinned underneath the two-tonne car yesterday evening. It is understood that he may have been dead for up to four hours before being discovered.The neighbour, who asked not to be named, told how he found Mr Campbell hours after passing him earlier in the day.",
        "He said: 'I was the one who found him.'I walked past him earlier in the day and we had a chat about the Land Rover he was working on. He was trying to change the drive shaft at the back of the car.'I walked back a few hours later - I saw his legs poking out from underneath the car but he wasn't moving.'I tried to get his attention but there was no response.'I looked underneath the car and I could see straight away that he was dead.'It looked to me like when he took the drive shaft out the car rolled forward just a little bit and trapped him.'He wasn't using a jack or blocks and the car has just crawled forward a little bit and pinned him.'",
        "The neighbour, who called the emergency services yesterday, added: 'He clearly had been dead for some time.'The police told me that it could have been there for three or four hours before I found him.'It's so sad. I haven't been able to sleep because I keep picturing him there.'Emergency services were called to Acre Crescent, in the Middleton area of the city, at 5.55pm yesterday.Ambulance and fire crews also joined police outside the two-bed terraced home.Officers investigating the death said there were no suspicious circumstances.Another resident said of Mr Campbell: 'He was a very private man. I think I only spoke to him once in two years.'He loved his cars and was always working away on them.'I didn't realise anything had happened until all the emergency services turned up.'The whole road was closed off. The lights from the ambulances were flashing in our windows all evening.'It must have been about 11pm before a flat-bed truck come to take the car away.'A spokesman for West Yorkshire Police said: 'At 5.55pm yesterday, police were called to Acre Crescent, Middleton, where a man had been found dead.'There were no suspicious circumstances and the Coroner's Officer has been informed.'Yorkshire Ambulance Service was approached for comment.",
        "An earlier version of the article published a photograph of the incorrect Colin Campbell. We have amended the article to remove the photograph and apologise for the error."
    ]
}