{
    "articleURL": "/tvshowbiz/article-12043747/Sophie-Habboo-blames-Jamie-Laing-Spencer-Matthews-wedding-snub.html",
    "content": [
        "Sophie Habboo has blamed husband Jamie Laing for mistakenly snubbing close friend Spencer Matthews from their Chelsea wedding, saying it was 'so stupid' that he forgot to invite him.",
        "The Nearlyweds podcast host, 29, told MailOnline that the couple, who celebrated their legal ceremony in London last month, originally planned for the day to be an intimate affair with close family.But in the run-up to saying their vows, the Made In Chelsea star has confessed that she extended the guest-list, inviting her bridesmaids and Jamie's groomsmen plus their partners to the event while Spencer and his wife Vogue Williams were holidaying in Portugal so unable to attend following the last minute change.Their fanbase, who have watched Jamie and Spencer's friendship for over a decade on the E4 series, were shocked he wasn't in attendance, with Sophie revealing it was a 'silly error' and on reflection they 'would have loved him there.'In an exclusive interview to celebrate becoming Debenhams brand ambassador in partnership with Coast Fashion, Sophie revealed that former boyfriend Sam Thompson will be coming to her and Jamie's Marbella wedding but jokes he's 'thankfully the only ex on the guest list!'",
        "Sophie said: 'Obviously Spencer will be at our Spanish wedding.'The drama with Spencer… it was so stupid of Jamie, he's just so disorganised and it all just changed last minute.'Originally it was just close family and obviously Spencer was away. I felt so bad for both of them, and Jamie felt so awful.",
        "'Both of us are so unorganised and it was always supposed to be a really intimate and small wedding but last minute we changed it.'Essentially it was my bridesmaids and his best men and then two of our best friends who are pregnant and can't make the Spanish wedding, so it looked like there were a lot more people and there was.'It was never going to be that many people. Spencer was in Portugal when we decided last minute, and Jamie didn't even think really. Obviously, we would have loved him there and it was a silly error.'After saying 'I do', Jamie and Sophie were the picture of happiness as they emerged from Chelsea Registry Office hand in hand wearing their designer shades, beaming with excitement as they were met with a flurry of confetti.And Sophie says the experience was 'euphoric,' admitting all her nerves about the big day quickly evaporated and she feels a new sense of calmness as Jamie's wife.",
        "She said: 'The ceremony in Chelsea was euphoric. It sounds weird and I'm really not the most emotional person, but I really do feel a sense of calmness that I didn't know I'd feel at all. I never felt on my own but now I feel like we're together and a team.'",
        "Sophie dated ex Sam Thompson for six months back in 2018 before she fell in love with Jamie while filming Made In Chelsea in Croatia.As a consequence of Jamie's romance with Sophie, him and Sam, who's now in a relationship with former Love Island star Zara McDermott, didn't speak for seven months, eventually rebuilding their friendship.During his time on Made In Chelsea, Jamie also dated former cast mates Louise Thompson, Lucy Watson and Frankie Gaff, but Sophie has revealed Sam is the only ex to join the couple during their special three-day wedding celebration in Marbella.Sophie said: 'Sam Thompson is coming with Zara.'I don't even think about it… obviously he's really close with Jamie and I don't really… definitely that was a long time ago in the past… thankfully he's the only ex coming! I don't think any of Jamie's are…'Sam will be there and we're going to be surrounded by our best friends and we can't wait.'As well as Sam, Sophie has revealed that a number of high-profile guests will be in attendance at their wedding on May 20, including comedian Jack Whitehall and his model girlfriend Roxy Horner and Made In Chelsea alumni Millie Mackintosh, Caggie Dunlop, and Oliver Proudlock. Sophie said: 'Well, Spencer is the MC at our wedding in Spain, so he's front and centre.",
        "'Millie Mackintosh is coming, Caggie Dunlop, Jack Whitehall, Ruby Adler, Liv Bentley, Emily Blackwell, Lottie Moss, Alex Mytton, Proudlock, the whole crew!'Sophie, who is Debenhams new ambassador for Coast Fashion and stuns in her premium hen collection for the brand, has described her upcoming nuptials to Jamie as a three-day 'wedding extravaganza' consisting of a 200-person guest list, pool party, and she is even promising to top the Vivienne Westwood gown she wore on the day of her London ceremony with not one, but two dresses. ",
        "She said: 'It's a three-day event and we have a pool party on the second day. It has been a lot to organise… bloody hell.'It's all coming together now. The seating plan was signed off yesterday, which was hellish to do when you have 200 wedding guests.'Jamie was so shocked that I wore a short dress, he was like \"woah, is that the thing to do?\" And I was like \"chill out, it's fine for a London wedding\" but in Spain I am going much more traditional, and it is long.'I've got a second dress too, but I just don't know if I'm going to want to change because I only get to wear it once!'The couple are also looking forward to their 10-day honeymoon in Panama with Sophie saying after months of wedding planning they can't wait to settle into married life together and enjoy a much-needed break as husband and wife. ",
        "She explained: 'I'm a bridesmaid for one of my best friend's and her hen do is the weekend after my wedding in St Tropez so I'm off there and straight afterwards we're going on our honeymoon for 10 days, which Jamie never does.'He's usually so busy but we need to switch off. We're going to an island off Panama… I did my gap year in central and South America so I've been there, but Jamie's never been and I'm so excited for him to come.' Sophie says her collaboration with retailer Debenhams is a 'dream come true' and the collection, which includes a backless gown with beaded embellishment and a silk dress with statement bow, encapsulates her classy and understated style.She said: 'I'm so, so happy. It is a dream come true, I loved planning the hen outfits. It was so much fun and to be able to put my own vision on the collection has been amazing.'I am the first person out of my very close friendship group to get married, my sister is getting married in August and is actually going to wear one of the pieces from the edit. It's really exciting because my friend's weddings will come after mine and I can say, \"well guys you can wear one of these pieces.\"'",
        "The newlywed is fully embracing the chance to occasion dress as she continues to celebrate her nuptials, which included a day-long hen party in Paris, where she wore a silver minidress with white cowgirl boots, and a statement bejewelled cowgirl hat.She added: 'The sequined dress with the embellishment and open back is one of my favourites, almost like the flapper dress is one of my favourites and the short version with the embellishments and the high neck, I love that one.'Also, one that isn't very me but there's something about getting married your inner child comes out so the princess, strapless, in at the waist with the roses, I love that one. 'I am a girl that never wears heels, and I was strutting around Paris in my heels everyday with no pain. I was loving it. I wanted it to be authentic and organic and love the brand and I'm over the moon this has happened.'Sophie's hen collection with Coast Fashion is available online from May 4 at Debenhams.com"
    ]
}