{
    "articleURL": "/tvshowbiz/article-12043361/Imogen-Thomas-looks-sensational-strips-red-bikini.html",
    "content": [
        "Imogen Thomas looked sensational on Wednesday as she stripped down to a red bikini for a dip in her hot tub.",
        "The former Big Brother housemate, 40, got into the spirit ahead of King Charles's Coronation this weekend, with her tub surrounded by festive Union Jack bunting.Model Imogen shared a clip of herself wearing her swimwear on her Instagram page, with the video showing her stepping into the water before turning around and shimmying with her arms in the air for the camera.She was then seen relaxing with her arms up on the side of the inflatable tub as she enjoyed the sunshine.Sitting next to the hot tub was a luxurious hamper filled with goodies from upmarket department store Fortnum &amp; Mason.",
        "Imogen captioned her post: 'Coronation week. @layzspauk arrived just in time for the epic celebrations. Fancy a dip?! #longlivetheking.'The Coronation of Charles III and his wife, Camilla, as king and queen of the UK is due to take place on Saturday at Westminster Abbey in London.The event will formalise Charles's new status as king following the death of his mother, Queen Elizabeth II, aged 96 in September last year.Imogen previously revealed she has a new boyfriend who is not in the public eye after splitting from partner Adam Horsley - the father of her children - in 2018, but insisted she won't marry.She told new! magazine in October: 'I think when you're not looking, that is when you'll find someone. We've been dating for a couple of months and he's not in the public eye.'",
        "Imogen admitted that she 'doesn't ever want to get married' despite finding love again, and firmly shut down having any more children.The TV personality also revealed her professional life was affected following her separation from Horsley, with the split prompting the closure of her swimwear business, Chasing Summer.Confirming the closure with Instagram followers in 2019, she said: 'The past 11 months has been the most challenging time of my life. Becoming a single parent has changed me as a person.",
        "'When my relationship broke down so did my aspirations for my business. My motivation has not returned so after thinking hard this year I've decided it's time to say goodbye to Chasing Summer.'It's been a great few years but my priorities now lie with my two beautiful girls and I simply just do not have the time and energy that the business needs.'Speaking to MailOnline, the mother-of-two also revealed that after splitting with her ex Adam Horsley in 2018 and getting back onto the dating scene, she piled pressure on herself to look good.She said: 'For me, since becoming single, I need to be looking my best. I keep thinking 'I'm single, I'm single, I need to look my best.'",
        "'Because when you're in a relationship you get so settled, you eat loads and go out for meals. But when you're single you have to look your best.'",
        "The Welsh beauty admitted she is 'really, really strict' with herself in order to maintain her slimmer figure, as she revealed that since becoming single she feels the need to 'look her best.'She added: 'It's hard because I've been out drinking all week and then the next day you want to eat so much rubbish, but I've been trying to be good.'So, I'll force myself to get up the next morning and go for a run. I'm really really strict. So, I will always try and maintain my weight and shape now.'"
    ]
}