{
    "articleURL": "/sport/nrl/article-12053725/Defiant-Latrell-Mitchell-vows-not-silenced-fight-against-racism.html",
    "content": [
        "Latrell Mitchell was racially abused by a teenager in Penrith in MarchThe 14-year-old Sydney Roosters fan denied the abuse was racially motivatedHe's been banned from attending games until he apologises to Mitchell Latrell Mitchell has vowed he will not 'shut his mouth' until racism is eradicated from eradicated from Australian sports and remains committed to be a role model for Indigenous players.",
        "Earlier this week, the 14-year-old who targeted the South Sydney star with racial abuse in Penrith in March was banned from attending NRL games until he has apologised to Mitchell.The New South Wales fullback was abused as he walked off the field at half-time during Souths' 16-10 loss to Penrith on March 9. The teenager received widespread condemnation but, according to the Sydney Morning Herald, he is disputing the allegation his slur was racially motivated.An outspoken supporter of Indigenous Australians, Mitchell wears his heritage proudly on his sleeve and said he won't be deterred by racial abuse.",
        "'A lot of people would love for me to stand in line and shut my mouth, but I won’t do that,' he told the Daily Telegraph. 'I will always stand up for my heritage, for my culture and being a voice for all Australian kids.'It’s about time we rubbed racism out of our game and out of our sports. Even in the AFL, the poor fellas cop it there.'I will support anyone who gets racially abused or vilified. It’s all about us moving forward and growing as a game.'Following the incident against Penrith, in an emotional press conference Souths boss Jason Demetriou called for the NRL to take a zero-tolerance stance against racism.",
        "Demetriou said anyone found guilty of using racist language to be banned for life from attending NRL games, adding the ban should be extended to the parents if the perpetrator is under age.And Mitchell said the ban imposed on the fan will set an important precedent for NRL fans. 'I left it [dealing with the incident] to the NRL and the integrity unit, they’ve acted, and hopefully there’s a lesson from it,' he said.",
        "'All I want out of this is that there’s a strong message to be sent to people who think racism is OK in our game and in society. It’s not. 'There should be repercussions and accountability.'I’m also here to say that I hope this is a message to all rugby league fans sitting in the crowd that if there is racism, then call it out and feel it’s OK to do so.'If you want to be racist, you keep your f***ing opinions to yourself. 'I can say this. I won’t be changing.'",
        "As it finalised its investigation on Wednesday, the NRL indicated the fan will also have to completed education and training programs facilitated by the league before being allowed back at games.'The NRL confirmed today it had issued a notice intending to ban a spectator from attending NRL events until such time as the young person can establish that sufficient steps have been taken to address their behaviour,' an NRL statement read.",
        "'These steps will include apologising and completing appropriate training and education in respectful behaviour and cultural awareness.'The NRL thanks Latrell Mitchell for reporting this matter and reaffirms that no form of vilification will be tolerated in rugby league.'"
    ]
}