{
    "articleURL": "/tvshowbiz/article-12056299/EXC-Faye-Winter-terrified-dissolve-lip-filler-Love-Island.html",
    "content": [
        "Faye Winter has confessed she was 'terrified' to dissolve her lip filler after leaving the Love Island villa, since she hadn't seen their natural state in 'such a long time'.",
        "The reality star, 27, who was subjected to vile trolling over her full pout on the ITV2 show's 2021 series, only realised how much she'd altered her own face after watching herself back on TV.But with the help of Dr Mohamed Hamed, who owns Dr Motox Clinic in Harley Street, she learned to love her natural looks after years of botched procedures by unqualified doctors.Now with 1.2million Instagram followers and counting, Faye's on a mission to educate her fans about the dangers of having injectables if they're not administered correctly.She's set her sights on fronting a TV documentary, and even taking her campaign to parliament to secure the backup of legislation.",
        "In an exclusive interview with MailOnline, Faye spoke candidly about the importance of being honest with her followers and not knowing what the long-term effects on her lips will be.",
        "She began: 'If I've got this amazing platform and I'm not using it for good things, what am I using it for? I obviously had the amazing opportunity with Love Island and now it's given me an incredible following with amazing people and If I'm not using it for any good, then there's no point in using it at all.'When it came to my fillers and my Botox, I'm very open about it and I'm not here to tell anybody to not get it done or to get it done. If you're not confident in something, you should be able to, in your body, make the decisions to get that done and make those tweakments. There's no judgment here for that.",
        "'But I think my big thing is that I never got mine done safely before and that is why my lips were as big as they were. That is why I had dodgy Botox, which I had to live with for months and put me in a really, really hard headspace. Obviously when I came out of the villa, I could see how much I had changed my own face.'A lot of people won't talk about it openly, but I think I've always been one of these people where I make mistakes, I am human, I am not perfect. But if I can learn from my mistakes and rectify it and if I can help one other person not make the same mistakes I did, then I've done a good job and I will make those mistakes just so others can learn from me.'It's funny because when I started it, kind of the craze just started so I was about 21 so now there are loads of girls getting it younger, 18, lots of girls getting it younger than that even because they're not going to qualified doctors and nurses to get these tweakments done.'I just kept adding, I kept adding and I kept adding and, you know, I never had the right person, the right medical professional there to tell me to stop because they were just so happy to take my money and keep filling in my face. ",
        "'They didn't care. They weren't there to do the tweakments and enhance my natural beauty. They were there to take my money and have a great weekend on it.'While Faye was happy with her appearance upon entering Love Island, she decided to opt for a more natural look after arriving back home.But after after having her 4ml lip filler dissolved, Dr Mohamed - who also owns clinics in Clapham and Kent too - advised that she had 1 ½ ml injected back in again due to their wrinkled appearance caused by over-stretching.The influencer's pout was first enlarged even more because when filler is dissolved, it is broken down to water, which causes them to temporarily swell.After two weeks, the filler is no longer there, but the process causes the breakdown of hydraulic acid - and Dr Mohamed used 1 ½ ml to build Faye's lips back up and give them more lift, a well-shaped cupid's bow, and a moreover natural look.Faye explained, 'Now, I've probably got half a ml in my lips. It's kind of dissolved naturally now, but yeah, I went to Dr Motox. He was incredible. And the first thing he said when I walked in was, \"We are dissolving your lips!\"'And that was... I was terrified because I hadn't seen my natural lips for such a long time. Obviously I had just come out of the villa and everything was so busy and I was needing to be out in public.",
        "'But even when I got the filler dissolved, I wasn't confident with the with the size of my small lips and also they were very wrinkly because I'd stretched the skin so much but yeah I did go back and I had a small amount put in.",
        "'He was able to get the lip shape I always wanted and always desired because he was trained and he's a trained dentist so he's a medical professional. I was able to get the results that I wanted just from a small amount of filler.'When asked whether she will have to have to continue with small injections of filler to prevent wrinkles from forming in her lips, she replied, 'I actually don't know.'I think it's all down to genetics, so I don't know how I'm going to pan out or what's going to happen to my lips next, but whatever happens, I will make sure that I am very honest about it, very open as I am as a person so and I pride myself and I've got nothing to hide.'If I wanted to go tomorrow and have a face transplant or a face lift, that's my choice, but I will make sure I'm very honest and open with everybody about that.'I've got an amazing following. I've got an amazing platform that isn't built on lies. I've never been a liar. I've always been myself. People like me, love me, hate me, whatever. I've always been myself. So if anyone has a problem with that, there's nothing I can do about it.",
        "'But I will make sure I'm always open and honest with them, because they've given me this amazing platform and they deserve that honesty.'Due to her outspoken nature, the blonde beauty receives an influx of messages from her followers on a regular basis asking for advice on cosmetic procedures.She explained, 'My fans are amazing and people following me are incredible. So, you know, I've had so many messages from people saying they weren't even aware of what could go wrong.'I've had so many people message me saying they didn't even realise that it is an unregulated industry. They were unaware that people can do literally a one day course in filler and be able to do injectables.'They didn't realise what could go wrong with Botox. And there are so many more people that will be researching it and using the likes of Save Face to make sure  they're going to somebody that is medically trained and people are a lot more aware nowadays that cheaper isn't always better.'While Faye educates her devotees through social media, she'd love to take her campaign to an even larger platform.",
        "She gushed: 'I would absolutely love to do a documentary around fillers, Botox, injectables in the UK. You know, it is something that parliament keep pushing off and keep pushing off and I know that it is there... that it is to be looked into, but it's been there for years and nothing seems to be changing.",
        "'This is actually something that is going to affect the next generation. But then there are a lot of middle-aged, older women going for the more youthful look getting fillers done and they they also need educating on it.'I mean, it's one of those things where it's educational but I can't understand, you know, there are people out there that are doing it that aren't even insured. So if something goes wrong, you're screwed. And then it goes back on our NHS.'It is something that I would love to delve into more and, you know, meet people that have had bad experiences.'I think filler and Botox, the last five years, 10 years, it's had such a taboo around it that people don't want to talk about having things done where actually there should be no taboo and we should just be talking about it.'The only way we're going to get around that is if people like myself in the public eye make people aware that it's OK to have it done, like it's OK. Let's talk about, let's normalise it.",
        "'But also we do need the backup of legislation, we do need the backup of parliament and laws to say they're not going to allow any person to go and do a course and then be able to inject the younger generation's faces... it just doesn't make sense to me.'If they need someone to talk about, I'll talk about it all day long. You know me, I'm very outspoken and I'll say it as it is. So if they want to have a little bit of a barney about it, they can have that as well!'Elsewhere, Faye is calling on all young people to get involved with volunteering, as part of The Big Help Out's launch on May 8.The initiative marks His Majesty The King’s Coronation, where thousands of organisations across the country are getting together to give us all the chance to help out in our own local communities.'Campaign Star' Faye has been volunteering with The Guide Dogs for the past six years and has continued to be ever-involved as her fame grows.She said: 'We're not asking for money. We're asking for you to give a bit of your time, find something new that you love whilst trying to help somebody else.'Obviously it's all in line with the King's coronation and there are so many amazing opportunities, charities and small businesses. There's just so much you can do!'For more information on The Big Help Out please see: thebighelpout.org.uk.To follow Faye’s journey, please see her Instagram: instagram.com/faye__winter."
    ]
}