{
    "articleURL": "/wires/afp/article-12051481/Record-breaking-Azam-lifts-Pakistan-334-6-fourth-ODI.html",
    "content": [
        "Babar Azam scored a superb century Friday to help lift Pakistan to the top of the one-day international rankings after a thumping 102-run victory in the fourth match against New Zealand in Karachi.",
        "Azam stroked a 117-ball 107 and also became the fastest batter to reach 5,000 ODI runs, as his team made 334-6 in their 50 overs.His 18th ODI hundred took him past the mark in his 97th innings in the format, beating former South Africa batter Hashim Amla's previous record of 101 innings.New Zealand were bowled out for 232 in 43.4 overs with skipper Tom Latham (60), Mark Chapman (46) and Daryl Mitchell (34) offering some resistance.Leg-spinner Usama Mir led Pakistan's bowling charge with a career-best 4-43 while pacers Mohammad Wasim (3-40) and Haris Rauf (2-37) also impressed.The win gave Pakistan a 4-0 lead in the five-match series and took them to number one for the first time since the International Cricket Council officially recognised the rankings in 2005.Pakistan's previous highest ODI ranking was third which they attained in January 2018 and again in June 2022.\"I will say that the credit goes to the entire team and support staff for becoming the number-one ranked ODI team,\" said Azam.\"We built the momentum and worked towards this goal.\"I think my journey has been good. I joined the camp on this very day nine years ago, and there have been ups and downs, but the support has been amazing.\"",
        "Azam starred with his 30th ton in all international cricket after New Zealand won the toss and put the hosts in to bat at National Stadium.The 28-year-old beat Amla's record when he reached 19.He added 50 for the second wicket with Shan Masood (44), 127 for the fourth wicket with Agha Salman (58) and another 41 for the sixth with Iftikhar Ahmed who scored 28.Azam, who has been the number one ODI batter for the last two years, hit 10 boundaries before he was caught at deep mid-wicket off debutant Ben Lister in the 48th over.Azam is the 14th Pakistani to score 5,000 or more runs in ODI cricket, with former captain Inzamam-ul-Haq top of the list with 11,701.He is also the fastest to 18 ODI hundreds, beating Amla's record of 102 innings.\"When we started our innings, the wicket played well. I and Shan planned to build the innings. We felt it was 300-plus wicket and then we bowled well,\" added Azam.Salman chipped in with two sixes and four fours in his 46-ball knock before being caught and bowled by pacer Matt Henry who finished with 3-65.Shaheen Shah Afridi hit three sixes and a four in his seven-ball 23 not out as Pakistan plundered 94 runs in the last 10 overs.",
        "\"Credit to the way they played, Babar played fantastically,\" said New Zealand's Latham."
    ]
}