{
    "articleURL": "/wires/pa/article-12043139/Shareholders-revolt-against-Unilever-bosses-pay-packages.html",
    "content": [
        "Shareholders have revolted against Unilever’s pay package for its bosses over concerns about potential excessiveness.",
        "The company’s remuneration deal handed chief executive Alan Jope 5.4 million euros (£4.75 million), including a 3.7 million euro (£3.26 million) bonus.Meanwhile, finance chief Graeme Pitkethly received 3.8 million euros (£3.35 million), including a 2.58 million euro bonus (£2.27 million).The firm confirmed that 58% of shareholder votes were cast against the package after its annual general meeting at its headquarters in Leatherhead on Wednesday. We are disappointed that the advisory vote on the Directors’ Remuneration Report was not passed  Unilever  However, the vote is advisory and, therefore, the company can still hand out the pay deal to its top executives.It comes after shareholder advisory group PIRC advised investors to vote against the remuneration package over concerns that the chief executive’s salary is on the higher end compared with rivals.",
        "PIRC said Mr Jope’s salary is 113 times more than the average employee’s pay where twenty times higher would be considered adequate.It also raised concerns about pay packages for executives who are directors where certain duties that should be considered part of the job and should not be rewarded with bonuses.Unilever said in a statement: “While the board is pleased that all other resolutions were carried with large majorities, we are disappointed that the advisory vote on the Directors’ Remuneration Report was not passed.",
        "“We are committed to shareholder engagement and will consult over the next few months to listen carefully to feedback and determine any next steps.”The board also faced questions from environmental group Friends of the Earth who attended the AGM as shareholder activists after holding a protest outside.Members of the organisation challenged the company on its climate targets, calling for Unilever to adopt policies in line with international climate agreements by committing to at least 45% CO2 reduction by 2030.Others from the group also questioned the board over the company’s ties to palm oil from Astra Agro Lestari (AAL), a major Indonesian palm oil producer who has been accused of land and human rights abuses from environmental groups.Clare Oxborrow, senior sustainability analyst at Friends of the Earth, who attended the protest and AGM, said: “While there was from a couple of shareholders a bit of animosity when questions on climate concerns were repeated, the board acknowledged that these are really, really critical issues for Unilever as a company.“We want them to go further and faster, as a global business leader in sustainability. We want to see them doing more, but we do feel they engaged positively in our concerns and they are taking action.”She added: “I felt in the room there was an understanding that companies like Unilever do need to be taking the environment and sustainability seriously for their own survival.",
        "“It is no longer enough for a company to be trashing the planet and that to be part of their business model.”"
    ]
}