{
    "articleURL": "/wires/reuters/article-12039197/Biden-administration-ramps-data-exchange-program-boost-US-supply-chains.html",
    "content": [
        "By David Shepardson",
        "WASHINGTON, May 2 (Reuters) - The Biden administration on Tuesday said it was ramping up a program to address supply chain issues by getting truckers, shippers, wholesalers, retailers and other businesses to share information.The Freight Logistics Optimization Works (FLOW) program, which was launched in March 2022 with 18 companies, now has 53 firms.The Department of Transportation helps participants exchange supply-and-demand information that is aggregated and anonymized to better view freight movement.U.S. Transportation Secretary Pete Buttigieg said the program will \"help us to smooth out supply chains to make us more resilient to whatever it is that is coming next.\"Companies that are part of the program include Nike Inc , Home Depot Inc, Albertsons Companies Inc , Costco Wholesale Corp, Target Corp, Walmart Inc, Union Pacific Corp, FedEx Corp , United Parcel Service Inc and Maersk .Data exchange may involve incoming container demand or available supply-side assets to move goods like terminal slots, tractors, chassis, and warehouse space, the Transportation Department said.White House deputy National Economic Council director Celeste Drake said at a forum the program had evolved its goal from \"answering the very simple question of 'Where's my stuff?' to 'How do we create a forward-looking integrated picture of the supply chain condition in the U.S.?'\" Drake said the plan is to expand the program to additional ports.",
        "Buttigieg said the Transportation Department spent $1.5 millon to create the program and is asking for $5.3 million in the current budget request \"to keep scaling this, to make it even more useful.\" He said officials will keep refining the program and seeking feedback from companies to make it more useful.Biden created a task force in June 2021 to address high prices and shortages of consumer goods and crucial components, thanks to pandemic-related labor and demand issues. (Reporting by David Shepardson; Editing by Chris Reese and Jonathan Oatis)"
    ]
}