{
    "articleURL": "/tvshowbiz/article-12051577/Courteney-Cox-models-ivory-jacket-enjoying-Japanese-meal-female-friend-Malibu.html",
    "content": [
        "Courteney Cox kept to her classic style as she enjoyed dinner with a friend at Nobu in Malibu on Thursday evening. ",
        "The actress, 58, who admitted she regrets 'frying' her skin via too much tanning in her youth, looked chic in black slacks and a matching top with a cream toned belted jacket.The Scream VI star stepped out in white clogs and carried a small black shoulder bag. The Emmy nominee accessorized with a stack of gold chains. Her shoulder length raven tresses were styled straight and she wore natural looking makeup. Courteney's friend looked equally stylish in black slacks and a burnt orange jacket with a faux fur trim. ",
        "The Alabama-born beauty has entered into a partnership with the skincare company Dermalogica.The Shining Vale star showcased her foaming skills in a video on Instagram.'We're going to have a contest,' she said standing next to esthetician Michael Armendarez.'Who can make the frothiest microfoliant,' referring to the daily exfoliant the Friends star uses as part of her regimen.'The competition goes along well until Courteney realizes she's getting behind in the competition, when in a very Monica Geller move, she pulls out a battery operated mini-mixer to take her over the finish line. 'For the record, no one can foam @dermalogica daily microfoliant better than me,' she posted next to the clip.According to the Dermalogica website, the Mothers and Daughters star attended a class with other skincare students in late April to learn pro-tips from the experts. ",
        "Part of her 'mission' with the company is to 'highlight the original skinfluencers – professional skin therapists.'Courteney said she first became acquainted with the company back in her Friends days.",
        "A bottle of Dermalogica was used as a prop in Rachel and Monica's bathroom. The Home Court founder revealed she has turned to facial fillers in the past to try to maintain a youthful appearance, but in an interview with the Gloss Angeles podcast in March, she looks back on as a mistake. 'Thinking I was getting older when I was really young, that's just a bummer, a waste of time,' she explained. 'You don't realize that you look a little off, so you keep doing more because you look normal to yourself and then you look  in the mirror and go \"that looks good,\" you think and you don't realize what it looks like to the outside person.'Courteney said she had her fillers removed. 'I was able to reverse most of that, and now,' she explained, 'I look, just older.' "
    ]
}