{
    "articleURL": "/wires/ap/article-12039517/Family-dead-bride-urges-drivers-not-drive-drunk.html",
    "content": [
        "COLUMBIA, S.C. (AP) - The mother of the bride had just unwound with a change of clothes and a glass of wine on her short-term rental's balcony when the sound of sirens gave the first impression that her daughter's wedding night had gone awry.",
        "Within minutes, Lisa Miller was riding with her new in-laws to the South Carolina beach road where authorities say a woman driving under the influence at twice the speed limit slammed into the golf cart escorting a happy couple away from their sparkler-filled goodbye at a reception overlooking the Atlantic shoreline.\"She was around all her people. And her face was just lit up like - I don´t know how to describe it,\" Lisa Miller said of her daughter. \"This light coming off her face, she was just so happy.\"A day that had begun blissfully with charcuterie and mimosas along the beach ended with hours spent in agony outside a hospital where she had wrongly been told her daughter had been taken. Then, Lisa Miller said she learned that the bride's father had identified the body back at the crash site.Samantha Miller, 34, died Friday in Folly Beach, South Carolina, while still wearing her wedding dress. The groom, Aric Hutchinson, is recovering from a brain injury and numerous broken bones after the golf cart was thrown 100 yards (91 meters). Two other occupants also reportedly suffered injuries of varying severity.At the wedding reception, Samantha Miller had asked the DJ to make a surprise announcement for a dance with \"the most important person in the bride's life.\" Mom and daughter were soon dancing to \"Just the Way You Are\" by Bruno Mars.",
        "That act emblematized the Charlotte, North Carolina, native's positive nature, her mother said.\"She never met a stranger. She wanted to make sure that everybody was taken care of. She doesn´t ever want anybody to be sad or mad,\" Lisa Miller said. \"Sam doesn´t want this to destroy our lives. We know that.\"She and her daughter, Mandi Jenkins, are now urging drivers to reconsider how a split-second decision to take the wheel while drunk may have lasting consequences for a \"real family\" like theirs. She pointed inebriated ride seekers towards apps like Uber or Lyft.Jamie Komoroski, 25, has been charged with reckless vehicular homicide and three counts of driving under the influence causing death or great bodily injury. She told the responding officer that she had consumed one beer and a drink with tequila about an hour before the crash, according to an affidavit obtained by The Associated Press.She grew uncooperative after refusing to complete a sobriety test, according to the affidavit, and the officer had to help her stand. The officer then reported getting a warrant for two vials of blood after she refused to provide a breath sample at the station.\"We hope that whoever sees this - maybe it will help somebody that has made those poor decisions before stop or maybe not ever make that decision by seeing that real people are affected,\" Lisa Miller said.",
        "The accident has spotlighted traffic safety in a community that has recently moved to combat speeding. Folly Beach residents successfully pushed the South Carolina Department of Transportation in 2018 to lower the speed limit by five miles per hour to 25 mph.State Rep. Spencer Wetmore, the city administrator at the time, vowed Tuesday to continue fighting for safer roads after a \"horrible tragedy\" that she told AP \"has completely broken my heart.\"In the tragedy's immediate wake, Lisa Miller said she wanted to leave and never return to the beach town that was supposed to be the launchpad of her daughter's next chapter. But she since has been heartened by the surrounding community's outpouring of support.People have brought dinner to Lisa Miller and Jenkins for the past few nights. A realtor connected them with an oceanside condo where they plan to stay at no charge for the next month.Now, Lisa Miller said she wants to move there and be around \"good-hearted, genuinely caring people.\" The two emphasized that they want to aid Hutchinson, the groom, through his recovery.\"When he gets out of the hospital, it´s not going to be over. He´s going to need a lot of support physically and emotionally,\" Jenkins said. \"And we will be there for him, too.\"",
        "AP researcher Rhonda Shafner contributed to this report.___James Pollard is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."
    ]
}