{
    "articleURL": "/wires/pa/article-12060597/Arrested-anti-monarchy-campaigners-vow-legal-action-against-Met-Police.html",
    "content": [
        "Anti-monarchy campaigners arrested ahead of the King’s coronation are considering legal action against the Metropolitan Police after being told no charges will be brought against them.",
        "Republic chief executive Graham Smith also called on Monday for a “full inquiry” into who authorised the arrests during the “disgraceful episode”.Prime Minister Rishi Sunak has backed the Met over the dozens of arrests of protesters amid concerns they were cracking down on dissent on Saturday at the behest of politicians.",
        "The force made 64 arrests on coronation day, with 46 people bailed after being detained on suspicion of causing a public nuisance or breaching the peace.But Mr Smith said the eight protesters from Republic detained in London have all been told no charges will be brought against them.He told the PA news agency: “The speed with which they did this demonstrates they were very quickly aware they had made a very serious error of judgment and there will be action taken again.“I’m obviously relieved they dropped it so quickly but very angry they even went down this road, robbing people of their liberty for absolutely no reason.“There was no evidence of any ability or intent to commit any offence and they simply decided to arrest us and that is outrageous.”Scotland Yard has been asked about the result of the Republic arrests.Earlier in the day, Mr Sunak defended Scotland Yard’s operation and denied officers were acting under pressure from ministers.",
        "“The police are operationally independent of Government, they’ll make these decisions based on what they think is best,” he told broadcasters during a visit to Hertfordshire.“Actually, I’m grateful to the police and everyone who played a part in ensuring that this weekend has gone so well, so successfully and so safely, that was an extraordinary effort by so many people and I’m grateful to them for all their hard work.”",
        "But Mr Smith accused Scotland Yard of having “every intention” of arresting demonstrators and of having “lied” in discussions ahead of the planned protests.The campaigner said he was arrested on suspicion of conspiracy to cause a public nuisance unloading placards in St Martin’s Lane, Westminster.He said police initially accused him of being equipped to “lock-on” to an object or building, which the new Public Order Act made a jailable offence.Mr Smith denies this was his intention and believes the Met had used some straps they were carrying as a “pretext” to prevent their protest.He raised fresh concerns about the Public Order Act signed into law last week, which tips the balance against protest, including by lowering the definition of “serious disruption”. I understand the Labour Party said they wouldn’t repeal this law, which is pretty disgraceful if true, this law needs to be repealed  Graham Smith, Republic  ",
        "“The whole thing was a deliberate attempt to disrupt and diminish our protest,” he told BBC Radio 4’s Today programme.“They stopped us because the law was introduced, rushed in last week, to give them the powers to stop us on any flimsy pretext.“That law means we no longer in this country have the right to protest, we only have the freedom to protest contingent on the permission of senior police officers and politicians and it’s my view that those senior police officers were under immense pressure from politicians.“I understand the Labour Party said they wouldn’t repeal this law, which is pretty disgraceful if true, this law needs to be repealed.”Labour frontbencher Andrew Gwynne said the Act gave “disproportionate” powers to the police but the party was not committing the party to repealing it if it enters government.Instead, the shadow public health minister told Sky News: “I think the next Labour government will look very carefully at this legislation.”Mr Gwynne defended the right to protest and suggested revellers supporting the coronation should have drowned out the dissent.“That would’ve been the appropriate approach, to drown out those that wanted to protest rather than maybe heavy-handed practice that some have suggested may have taken place,” he said.",
        " Protesting can take place in this country but it’s the level to which you want to perform that protest that we have to balance and deal with what’s put in front of us impartially. That’s what was done  Ken Marsh, Metropolitan Police Federation  Ken Marsh, head of the Metropolitan Police Federation representing officers from the rank of constable to chief inspector, said police were acting both lawfully and “impartially”.“Protesting can take place in this country but it’s the level to which you want to perform that protest that we have to balance and deal with what’s put in front of us impartially. That’s what was done,” he told Today.Westminster City Council has raised concerns that women’s safety volunteers were among those arrested after rape alarms were seized.The Met said it had received intelligence that people were planning to use the devices to disrupt the procession.Caroline Russell said the London Assembly’s Police and Crime Committee that she chairs will be questioning the Met over the “worrying” arrests.The Green politician told Today: “It felt like for someone who was trying to protest, and trying to do it by the book, it was very difficult to understand what the rules were.“It seems absolutely extraordinary that those people who were volunteering, they were out there handing out flip flops to people who could no longer walk in their high heels because they’d had a bit too much to drink and handing out rape alarms.",
        "“It just seems extraordinary that they got caught up in the Met’s safety net. How? It just feels very odd.”In total the Met made 64 arrests during the coronation day.Four charges have been brought, including over a religiously aggravated public order allegation and class A drugs possession.London Mayor Sadiq Khan has demanded “clarity” from the force’s leaders on the arrests."
    ]
}