{
    "articleURL": "/news/article-12059427/Minke-pictured-dead-sandbar-lawmakers-call-ban-offshore-wind-turbines.html",
    "content": [
        "The large animal was found floating in waters near Westhampton, New York, This latest death means around 33 whales have now turned up dead along the east coast since DecemberIt comes after New Jersey lawmakers asked for an up to 60 day half on construction of wind farms being built off the coast last weekA 25-foot long Minke has been pictured dead on a sandbar near Westhampton, New York, as concerns grow a spate of recent deaths involving the mammals may be linked to offshore wind farms. ",
        "The large animal was captured floating in shallow waters near the Suffolk County town on Saturday, in the Moriches Inlet.According to an eye witness, a whale rescue group attached satellite equipment to it in case it floats away. It is the latest in a large number of whale deaths along the east coast of the United States. Huge offshore wind turbines are currently under construction off the New Jersey coast, and others are planned for New York, sparking concerns they may be interfering with the animals' sonar. ",
        "Since December, at least 32 whales of different species have been found dead on east coast beaches from Massachusetts down to Florida, a large number of which were found along the Jersey shore.Environmental groups have been adamant that the number of deaths is linked directly to the construction of offshore wind farms.In January, the Clean Ocean Action environmental group asked President Joe Biden to step in and halt the wind farm projects, saying there was evidence it was related to the whale deaths.Clean Ocean Action executive director Cindy Zipf said: 'We've gone too far, too fast.'Over 2.2 million acres is being allocated to offshore wind and 10,000 miles of cables. ",
        "'We became alarmed that it was plausible that activity going on offshore had to do with the whale die-offs. We felt there was a reason for investigation.'",
        "Last week, four New Jersey Republicans opposed to the state's offshore wind turbines asked that construction be halted for up to sixty days to see if it would reduce the number of deaths. New Jersey has been rapidly clearing way for the development of new wind farm projects of its coasts, with large-scale construction already underway at several sites. The National Oceanic and Atmospheric Administration (NOAA) - have been adamant there is no evidence the farms are causing the deaths.",
        "Federal lawmakers like New Jersey Democratic Senator Cory Booker have requested deeper investigations into what might be causing the deaths.Republican New Jersey Senator Michael Testa said halting construction on the wind farms was an easy way to test the theory.He told CBS News: 'One thing our side of the aisle gets accused of is not following the science. So what is the harm of waiting 30 or 60 days?'Currently, New York has five offshore wind projects in active development which will cover 480,000 acres.Skeptics of the wind farm theory have said climate change is the greatest threat to the lives of marine life on the east coast. U.S. Rep. Frank Pallone Jr, of New Jersey, said in a statement: 'The food source whales depend on is moving closer to the busy shipping lanes near the Port of New York and New Jersey as ocean temperatures rise, leaving them vulnerable to vessel strikes and entanglements.'"
    ]
}