{
    "articleURL": "/wires/reuters/article-12052529/CANADA-STOCKS-TSX-notches-biggest-gain-four-months-oil-rebounds.html",
    "content": [
        "TSX ends up 1.5%, at 20,542.03",
        "Posts its biggest gain since Jan. 6Air Canada gains 11.6% as company lifts profit forecastEnergy rises 3.4%; oil settles 4.1% higher(Adds economist quote in paragraph 6 and details throughout; updates prices)By Shristi Achar A and Fergal SmithMay 5 (Reuters) - Canada's main stock index rallied on Friday as a rebound in oil prices lifted energy shares, while improved outlooks from companies including Air Canada beat back concerns over a fallout from the U.S. regional bank turmoil.The Toronto Stock Exchange's S&amp;amp;P/TSX composite index ended up 303.84 points, or 1.5%, at 20,542.03, its biggest gain since Jan. 6.On Thursday, it posted its lowest closing level in four weeks, while it was down 0.5% for the week as oil prices swung wildly, the Federal Reserve raised interest rates, and jitters in the U.S. banking sector raised fears of tighter credit conditions.\"Investor sentiment is improving,\" said Colin Cieszynski, chief market strategist at SIA Wealth Management. \"Some of the waves of fear we had relative to U.S. banking and any issues around the Fed meeting have kind of washed through now and we may soon be seeing bargain hunters stepping in.\"The move higher for the TSX came as domestic data showed the economy adding 41,400 jobs in April, which was far more than expected. Wall Street also posted strong gains as U.S. jobs data allayed fears of a recession.",
        "\"The serial pattern of too much bearishness toward Canadian and U.S. jobs continues,\" said Derek Holt, vice president of capital markets economics at Scotiabank. \"They keep surprising to the upside.\"The Toronto market's energy sector gained 3.4% as oil clawed back some of its recent sharp decline, settling 4.1% higher at $71.34 a barrel.Shares of Air Canada surged 11.6% as the airline raised its full-year forecast for core profit. (Reporting by Fergal Smith in Toronto and Shristi Achar A and Vansh Agarwal in Bengaluru; Editing by Shilpi Majumdar and Jonathan Oatis)"
    ]
}