{
    "articleURL": "/tvshowbiz/article-12048847/Im-Celebrity-South-Africa-Helen-Flanagan-breaks-tears-thinking-children.html",
    "content": [
        "Helen Flanagan broke down in tears while thinking about her children during Thursday's I'm A Celebrity South Africa.",
        "The former Coronation Street star, 32, was pitted against Paul Burrell during the show in a task that saw them try and win a luxury picnic for their respective teams.Helen became emotional ahead of the task and fellow campmate Myleene Klass gave her words of encouragement.She told her: 'It's all in your head. Everything's in your head. Nothing's going to hurt you.'Also, there's a superpower that you've got behind you – that's your children. No bigger power. ",
        "'Every day they make us proud, but this time around you'll get to make them proud.'Helen and Myleene hugged and the soap star later beat Paul in the challenge and won a picnic for her team.The actress is mother to Matilda, seven, Delilah, four, and Charlie, two, with her ex-fiancé Scott Sinclair.Helen recently admitted she's 'really bad at being on her own' in a tearful post on Instagram stories.The star decided to end her relationship with her footballer fiancé Scott but has revealed she struggles to 'sit with her own thoughts'.Helen reportedly made the final decision not to reconcile with her ex-fiancé Scott last month, after seeking advice from single-loving Carol Vorderman.The actress has said she needs to 'constantly' be surrounded by friends or her children. Taking to Instagram, she wrote: 'I'm really bad at being on my own, anyone else relate to this? I constantly have to have my friends with me or be with my kids. I can't just sit there with me and my own thoughts.'",
        "Helen sparked speculation of a reunion with Scott when she put her 'engagement ring' back on for a recent Instagram post.But she's only said to be putting on a united front with the footballer, 34, for their children's sake, with no plans to rekindle their romance.According to claims, Helen was guided by her I'm A Celebrity South Africa co-star Carol, 62, who has been open in the past about her own five 'special friends'.A source told The Sun: 'Helen was at a crossroads in her relationship when she went into the jungle this time around.'Carol became a kind of mother figure to the other campmates and Helen found herself opening up to her.'She told Helen to follow her heart and put her children first. She advised that staying with someone just for the kids never works out. Of course they've got the kids and a huge history only time will tell if it's over for good.'"
    ]
}