{
    "articleURL": "/tvshowbiz/article-12040337/Naomi-Watts-hides-ring-wedding-finger-attending-Future-Festival.html",
    "content": [
        "She's been fuelling engagement rumours with actor Billy Crudup for months.",
        "But Naomi Watts concealed the massive diamond ring on her left hand as she stepped out to attend The Wall Street Journal's Future of Everything Festival in New York City on Tuesday.The King Kong actress, 54, wore a smart black suit with a reverse lapel and a white blouse.She accessorised with a pair of black heels and a bold pendant necklace and earrings.The blonde beauty's short, bob-cut hair was styled with a slight wave and her makeup was minimal with a pale pink blush.",
        "Naomi kept her right hand tucked into her suit pocket while her left hand with her ring remained hidden as she posed alongside WSJ Deputy Editor Elisa Lipsky-Karasz.Later on, during her talk onstage, the British-Australian actress was seen wearing the diamond sparkler. Naomi continued to showcase the ring last week when she was spotted out in lower Manhattan with her beau Billy.The Mulholland Drive actress and the Almost Famous star, also 54, have been dating for six years.",
        "Naomi appeared on The Today Show last Thursday where she laughed off engagement speculation.Towards the end of the chat, host Hoda Kotb joked that her 'eye was hurting,' implying it was from the 'glint' of the massive ring on Watts' left ring finger. 'It's like a big glint coming from some ring over here,' Kotb said with a smile, as Watts started laughing.",
        "'It just struck me, but it's beautiful,' Kotb said, as they showed a close-up of the ring many are speculating is her engagement ring... though she wouldn't confirm.",
        "Savannah Guthrie clarified, 'Hoda is asking if you're engaged,' as Watts joked, 'So, the brain fog...'Guthrie added, 'You wear it well,' as Kotb added, 'You do, whatever you're wearing, you wear it beautifully.'The Aussie actress hasn't publicly addressed the speculation that her boyfriend has popped the question.She was first spotted wearing the ring last month, when she was spotted going on a road trip with some friends.The road trip also was her first time spotted out since her ex Liev Schreiber, 54,  announced he's expecting his first child with 31-year-old girlfriend Taylor Neisen.Watts and Schreiber share two children, Alexander 'Sasha', 16, and Samuel Kai, 15, from their 11-year relationship that came to an end in 2016.Watts and Crudup first met on the set of the Netflix series Gypsy in 2017 and they've been together ever since, though they largely keep their relationship out of the public eye.",
        "Since their split, Naomi and Liev have continued to co-parent with their blended families. Last year in May, Naomi and her partner, Billy, were seen in an Instagram selfie in celebration of Kai's graduation. ",
        "Also in the snap was their other son, Alexander, as well as Naomi's ex, Liev and his girlfriend, Taylor, as they all flashed cheerful smiles towards the cameras. During a past interview with PorterEdit in 2019, The Impossible actress opened up about their blended families and co-parenting together. 'We're doing things very differently.' 'I'm pretty proud of us, corny as that may sound. We've made it our absolute priority to be good and kind to each other and we're absolutely committed to that.'  "
    ]
}