{
    "articleURL": "/news/article-12043241/Journalist-cries-testifies-Trump-sexually-assaulted-Melania-nearby.html",
    "content": [
        "Natasha Stoynoff testified Wednesday how Trump sexually assaulted her in 2005 at his Florida estate while Melania was in another room Trump promised to take her for a steak meal and give her the 'best sex you'll ever have,' she claimed Stoynoff cried as she told the Manhattan jury that she was at Mar-a-Lago to write a story celebrating the first anniversary of Trump and Melania's weddingA journalist took the stand today to tell how Donald Trump sexually assaulted her at his Florida estate while his pregnant wife was getting changed for a photoshoot in another room.",
        "Natasha Stoynoff cried as she told the court how Trump pushed her up against a wall and kissed her at Mar-a-Lago in 2005 when she was writing a story to celebrate his first wedding anniversary to Melania.Stoynoff said that after a butler walked in they went back to the photo shoot where Trump promised to take her for a steak meal and give her the 'best sex you'll ever have.'The testimony came during the battery and defamation trial brought by advice columnist E. Jean Carroll against Trump.The court heard Trump will not be mounting any defense at all after his sole witness had a medical problem. He has already failed to appear in person at the court in Manhattan.",
        "Carroll, 79, claims that Trump, 76, raped her in the dressing room of the lingerie department of the Bergdorf Goodman department store in New York in the mid 1990s.",
        "The judge has allowed other accusers to give evidence to show what Carroll's lawyers say is a pattern of behavior.Stoynoff, a New York Times best-selling author, told the court that she was on assignment for People Magazine at Mar-a-Lago at the time of the attack and regularly covered the Trumps.She cried as she told the Manhattan jury that the story was to celebrate the first anniversary of Trump and Melania's wedding.",
        "On a break between photoshoots as Melania got changed, Trump said he wanted to show her a 'really great room' and led her to a different part of the building.At the time Melania was pregnant with their son Barron, who is now 17.Stoynoff, who became emotional a second time, told the jury: 'I'm thinking wow, really nice room and I hear the door shut behind me.'By the time I turned around he had his hands on my shoulder and was pushing me against the wall and kissing me. I tried to push him away.'He came toward me again and I tried to shove him again. He was kissing me. He was against me, just holding my shoulder back.'I didn't say any words. I was in shock. No words came out of my mouth. I remember just sort of mumbling.'A butler came in and said that Melania had finished changing and was ready to resume the photoshoot and Trump left.Stoynoff said she gave the butler a 'get me out of here' look and felt he understood what she meant.But back at the pool area Trump told her: 'Oh you know we're going to have an affair. Don't forget what Marla said,' referring to his second wife, Marla Maples.",
        "'Best sex I ever had,' Trump added, referring to an infamous front page about Maples.Trump said he wanted to take Stoynoff to steak restaurant Peter Luger. She was 'shocked and realized what had just transpired,' she told the court.When Melania sat down Trump became very 'doting' around her and Stoynoff carried on the interview as best as she could.She didn't tell her senior bosses as she felt 'ashamed and humiliated' and didn't want to cause trouble for the magazine, but she asked never to cover Trump again and her editors obliged.While Stoynoff saw Trump at a gala at a later date, she avoided him.",
        "Stoynoff did run into Melania some time later outside Trump Tower in New York and she asked why they never saw her again, but she made an excuse and didn't tell her the truth, she told the court.The jury were shown the infamous Access Hollywood tape which was released just before the 2016 election and showed Trump on a hot mic bragging about groping women.The panel of six men and four women did not react during the two minute clip, which came with a graphic language warning.Stoynoff said that when she saw the footage in 2016 it left her 'horrified.'",
        "In tears again, she said that she felt 'relief.'She said, 'For the first time I thought to myself oh he does this to a lot of women, it's not just me.'The horrifying part was I worried that because I didn't say anything at the time other women were hurt by him. I had some regret there.'The jury were also shown part of a 45-minute deposition given by Trump in October of last year for the case.He appeared wearing a light blue tie and a dark suit and sat at a desk looking bored and holding his wrists with his hands.Trump denied having a hectic social life in the 1980s and 90s and claimed he was working so hard he didn't go out much.Asked by Carroll's lawyer Roberta Kaplan if he did any TV interviews, he said with a smile: 'I did everything.'Trump said that he was married to his first wife Ivana from 1978 to the early 90s.But when asked the dates he was married to his second wife, Marla Maples, he stumbled and paused, saying, 'I'd have to check the exact dates. I can do that very easily.'Kaplan asked about Trump's affairs while he was married to Ivana but Trump said, 'I don't know.'",
        "Kaplan asked, 'You were public about the fact you were seeing Miss Maples?'Trump replied, 'I don't think I was public about it at all.'Trump added, 'It was towards the end of the marriage (the affair) so I don't know, it could have been a lap over,' apparently meaning overlap.Trump claimed he 'very rarely' shopped at Bergdorf Goodman, where Carroll claims he attacked her.Given a copy of Carroll's 2019 memoir in which she accused him for the first time, Trump flicked through it dismissively and looked bored.He was read a number of statements he put out in 2019 denying Carroll's story and was asked if he stood by them today.Trump said he did because the story was 'the most ridiculous, disgusting story, just made up.'",
        "The court has already heard from another accuser, Jessica Leeds, 81, who claimed that Trump groped and kissed her on a flight from Texas to New York in 1979.She told the jury that it felt like he had a 'zillion hands' as he put his hand up her skirt until she fought him off.The case is due to last into next week.Earlier in the day clinical psychologist Dr. Leslie Lebowitz said that she couldn't diagnose Carroll with depression or anxiety either related to the alleged rape by Trump in the mid-1999s.",
        "But Carroll did 'squirm in her seat' because she was physically revisiting the incident during a session for the court, Dr. Lebowitz said, one of a string of symptoms she said had a profound effect on her life.Dr. Lebowitz told the court that Carroll exhibited some of the symptoms of PTSD, which is common among victims of rape and sexual assault.She told the jury that Carroll's symptoms 'fit within the rubric of PTSD but she does not have enough to meet the criteria'.Nor did Carroll have anxiety or depression, but she did exhibit a range of issues, said Dr. Lebowitz.",
        "The psychologist said that Carroll has developed avoidance strategies to stop her from feeling the 'vulnerability' she did during the rape.As a result she had closed herself off to romance, causing herself a 'great loss': she had not been in a relationship or had sex since the attack, a period of 26 years.Dr. Lebowitz likened this to a metal grate on a shop coming down and said that Carroll 'shut down' herself around a potential suitor, staring at the floor and becoming monosyllabic.Carroll's other symptoms included night terrors and 'intrusions' in her thoughts that 'spooled like a video,' the court heard.They were so severe that at one point in their sessions Carroll 'began to squirm in her set because she was re-experiencing Mr. Trump's fingers inside her,' Dr. Lebowitz said.After Trump ran for the Presidency in 2016, Carroll was 'inundated' with such visions, the jury heard.Carroll even watched The Apprentice, the TV show which featured Trump, because everyone in her circle saw it and not doing so would force herself to confront the rape."
    ]
}