{
    "articleURL": "/money/electriccars/article-12047241/Interactive-map-shows-recharge-electric-car.html",
    "content": [
        "There are now more than 40,000 public electric car charging points in the UKThe figure has increased by a third since April 2022 according to today's data # New car purchases up 11.6% and Ford's electric Puma is the top sellerThe number of public electric charging locations has increased by one-third over the past 12 months, new Government figures have shown. ",
        "Since April 2022, 9,860 public chargers have been added to the network, bringing the total to 40,150. By 2030, the government wants this figure to reach 300,000.According to figures released today by the Department of Transport, 7,647 of the chargers installed are described as 'rapid' - representing almost 20 per cent of all locations. More than 22,000 - or 56 per cent - are 'fast chargers'. Since January, more than 3,000 chargers have joined the network meaning electric car owners have more options to top up their environmentally-friendly motors. ",
        "PGlmcmFtZSBjbGFzcz0iaWZyYW1lLWNyZWF0b3IiIGFsbG93PSJjbGlwYm9hcmQtd3JpdGUiICBuYW1lPSJ4cC1pZnJhbWUtbGlkODYxeHo1a2ZybXBiMG53IiBzcmM9Imh0dHBzOi8vZGF0YXdyYXBwZXIuZHdjZG4ubmV0L3o4N0EyLzEvIiAgaGVpZ2h0PSI4NTAiIHN0eWxlPSJib3JkZXI6IDA7IHdpZHRoOiAxMDAlOyAgIj48L2lmcmFtZT4=",
        "Charging points are rated by how many kilowatt hours of power they can supply. Depending on your car as well, the higher the kilowatt hour capacity of the charger, the quicker you can top up. Under current guidelines, slow chargers offer between 3kW to 6kW, which requires a car to be plugged in overnight to fully charge.A fast charger offers speeds of between 7kW to 22kW, while a rapid charger is rated between 25kW to 100kW - allowing 80 per cent of a car's battery to be topped up in half an hour. A small number of ultra rapid charging devices are available offering speeds in excess of 100kW. However,drivers have been warned they need to shop around when seeking a place to top up their electric car and consider the time of day - which can have a dramatic effect on prices ",
        "Some local authorities are installing charging points in lamp posts in residential areas allowing people who do not have a driveway or the ability to fit a domestic charger an opportunity to top up their cars close to home. Motorway services and filling stations are increasing the number of charging points, while they are also being rolled out in locations such as supermarkets, leisure centres and car parks. Some hotels offer residents the chance to top up their cars overnight.  Despite the increase in the number of charging points, expectations for the growth in demand of pure electric new cars have been downgraded.The Society of Motor Manufacturers and Traders said it expects electric cars will make up 18.4 per cent of new registrations this year, down from a forecast in January of 19.7 per cent. This is due to 'high energy costs and insufficient charging infrastructure' which is 'anticipated to soften demand', according to the SMMT.",
        "Estimates of next year's market share for pure electric new cars have also been revised downwards, from 23.3 per cent to 22.6 per cent.Sales of new petrol and diesel cars will be banned in the UK from 2030.The UK's overall new car market has grown for nine consecutive months.Some 132,99 new cars were registered last month.",
        "SMMT chief executive Mike Hawes said: 'The new car market is increasingly bullish, as easing supply chain pressures provide a much-needed boost.'However, the broader economic conditions and chargepoint anxiety are beginning to cast a cloud over the market's eagerness to adopt zero emission mobility at the scale and pace needed.'To ensure all drivers can benefit from electric vehicles, we need everyone - Government, local authorities, energy companies and charging providers - to accelerate their investment in the transition and bolster consumer confidence in making the switch.'Ian Plummer, commercial director at online vehicle marketplace Auto Trader, said: 'Rising new car sales for a ninth month in a row represent a healthier economic picture than feared a few months back, which is good for the market.'Consumer demand is strong but the softening of the SMMT's forecasts on electric vehicle (EV) sales offers some cause for concern.'This underlines our recent call for measures needed to support the EV market, such as cutting VAT on public chargers.'",
        "PGlmcmFtZSBjbGFzcz0iaWZyYW1lLWNyZWF0b3IiIGFsbG93PSJjbGlwYm9hcmQtd3JpdGUiICBuYW1lPSJ4cC1pZnJhbWUtbGlkODYyMHp1ZjIyOW54OTVyYiIgc3JjPSJodHRwczovL2RhdGF3cmFwcGVyLmR3Y2RuLm5ldC9ka0diMC8xLyIgIGhlaWdodD0iNjAwIiBzdHlsZT0iYm9yZGVyOiAwOyB3aWR0aDogMTAwJTsgICI+PC9pZnJhbWU+",
        "However, despite the progress in improving the number of available public charging points, some electric car owners have reported waits of at least three hours at motorway service stations. The AA warned that the rollout of public charging points could impact the number of electric car sales, with motorists suffering 'range anxiety' and abandoning plans to go fully electric. ",
        "Also, one of Britain's biggest car dealers has warned the demand for electric vehicles is 'cooling' as the lack of charging points stalls growth.Vertu Motors slammed the 'inadequate public charging infrastructure' as contributing to the slowing momentum around electric vehicles.The Tyneside group, which has more than 180 dealerships across Britain, said although electric and hybrid vehicle registrations saw growth of more than 20 per cent last year, the UK needed to up its game towards electrification.'There has been a cooling of demand for electric vehicles from consumers in the last six months,' Vertu said, adding: 'The cost of electricity increasing running costs and inadequate public charging infrastructure have all had an impact'.",
        "Car insurance bills have a habit of creeping up, so comparing prices for the best deal is a wise move. New rules introduced to stop insurers bumping up renewal quotes haven't had the desired effect and it still makes sense to check for better deals on the comparison sites. We suggest:MoneySupermarket*Confused.com*GoCompare*Uswitch*Mail Finance* Also check Direct Line and Aviva, which do not appear on comparison sites.* Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. Car insurance: can you save money? &gt; Tips to cut the cost of car insurance &gt; Beware of these sneaky car cover fees ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}