{
    "articleURL": "/femail/article-12038189/Antiques-Roadshow-expert-Hilary-Kay-Royal-Treasures-53.html",
    "content": [
        "Hilary Kay talks us through some souvenirs from Britain's past 1953 coronationREAD MORE: King Charles' Coronation regalia meaning and origins revealedBack in 2014 I was one of three experts given the honour of holding a private Antiques Roadshow at Hillsborough Castle in Northern Ireland for just two people – the Queen and the Duke of Edinburgh. It was the highlight of my 44-year Antiques Roadshow career.",
        "Over the decades I’ve had the privilege of talking about spectacular souvenirs from the 1953 coronation. Here are some more gems from the time, including remarkable objects that played a part in the event itself. Luckily, given so much was produced for the occasion, there’s hope for the rest of us that we may have an undiscovered treasure in our homes.THE PERSONAL FORM AND ORDER OF SERVICE USED BY THE QUEEN",
        "Commissioned by the Church of England, this document contains details of the six parts of the ceremony – the recognition, the oath, the anointing, the investiture, the enthronement and the homage.It was formally presented to the Queen by Geoffrey Fisher, the Archbishop of Canterbury, who conducted the coronation. Following coronation tradition, the Queen signed it, ‘I used this book at my coronation. Elizabeth R. June 2nd 1953.’ It was sent to the Royal Library that year.A CHAIR FROM THE CEREMONY IN THE ABBEY",
        "Made from limed oak, upholstered in blue velvet and bearing the monogram EIIR, 2,000 of these chairs were made by High Wycombe chairmakers W Hands &amp; Sons Ltd for a select group attending the ceremony at Westminster Abbey.Afterwards, attendees could buy their seats for the price of £710 shillings (around £180 in today’s money). A pair of chairs purchased by Harold Sissons, Mayor of Umtata, South Africa, who was at the coronation, sold for £7,500 in 2012. ",
        "However, royal biographer Hugo Vickers has snapped up other ones for as little as £45. ‘They make perfect dining room chairs as they were designed for people wearing uncomfortable uniforms and robes to sit on for hours on end,’ he has said.THE SOVEREIGN’S ESCORT TOY LEAD SOLDIER SET",
        "The legendary set number 2081, complete with the Queen and Duke of Edinburgh seated inside the Gold State Coach, was made by London toy maker W Britain for the coronation – the display of 212 pieces was the second largest the firm ever made. Pieces from this vast set were displayed in the window of Hamleys toy shop on coronation day, and it’s tempting to imagine the Queen catching sight of them as her procession passed down Regent Street. A complete set number 2081 sold for £9,200 in 2021.A WEDGWOOD SOUVENIR MUG",
        "There were plenty of mass-produced coronation souvenirs available in June 1953. One of my favourites is this mug, decorated with a pattern by artist Eric Ravilious, who had produced designs for Wedgwood for the cancelled coronation of Edward VIII and the subsequent coronation of King George VI in 1937. Wedgwood updated Ravilious’s 1937 design for the Queen’s coronation mug, using stylish pink and yellow. The design shows the Royal Coat of Arms with a firework display on one side and the year on the other. ",
        "Inside the mug you’ll find the Queen’s crown and cypher. A Ravilious/Wedgwood mug can now fetch £300-£500 at auction. To mark King Charles’s Coronation, you can buy a hand-made bone china mug for £30 which features the Royal Coat of Arms surrounded by laurel leaves, representing peace – who knows what that will be worth one day?PRINCE CHARLES’S PERSONAL INVITATION",
        "The four-year-old prince was the first child in British history to witness his mother’s coronation as sovereign, and to mark the occasion he received his own specially illustrated invitation. Joan Hassall, who designed the official coronation invitation, also created this unique version to delight a child, featuring colourful guardsmen trumpeting and drumming as well as a smiling lion and unicorn. The invitation was last on public display at Buckingham Palace in 2022 for the Platinum Jubilee exhibition and is now held in the archives of the Royal Collection Trust.THE PEN USED BY THE QUEEN TO SIGN THE CORONATION OATH",
        "This gold-mounted, enamel and jewelled ivory pen takes its inspiration from a feather quill. The gold central vane of the quill is based on the Sword of State, which was borne before the Queen as she proceeded to the altar to sign the coronation oath. It is intricately decorated with royal symbols including a jewelled and enamelled crown held by two cherubs (representing Prince Charles and Princess Anne).",
        "It was presented to the Queen by the Worshipful Company of Scriveners for use at her coronation, and now belongs to the Royal Collection Trust.Antiques Roadshow: Royal Treasures, with archive footage of Hilary and others, is on Sunday, 7pm, BBC1."
    ]
}