{
    "articleURL": "/wires/ap/article-12048005/Canada-mulls-expelling-China-diplomat-targeting-lawmaker.html",
    "content": [
        "TORONTO (AP) - Canada´s foreign minister said Thursday the country is considering the expulsion of Chinese diplomats over an intelligence agency report saying one of them plotted to intimidate the Hong Kong relatives of a Canadian lawmaker.",
        "Foreign Minister Melanie Joly said her department was summoning China´s ambassador to a meeting to underline that Canada won´t tolerate such interference.She said the intelligence agency report indicated that opposition Conservative lawmaker Michael Chong and his Hong Kong relatives were targeted after Chong criticized Beijing´s human rights record.\"We´re assessing different options including the expulsion of diplomats,\" Joly said before a Parliament committee.Canada´s spy agency has not released details publicly. Chong has said the report identifies a Toronto-based diplomat as being part of the plot. Chong has been critical of Beijing´s treatment of Uyghur Muslims in China´s Xinjiang province.\"I cannot imagine the shock and concern of learning that your loved ones have been targeted in this way,\" Joly said to Chong at the committee hearing. \"There will be consequences.\"",
        "Chong said the diplomat should be on the first plane out of Canada.\"It is inexplicable that this diplomat hasn´t been told to leave the country already,\" he said.\"If we do not take this course of action we are basically putting up a giant billboard for all authoritarian states around world that says we are open to foreign interference targeting Canadian citizens. That´s why this individual needs to be sent packing.\"Chinese Ambassador Cong Peiwu denied interference in a statement and warned against expelling its diplomats.",
        "\"Once again, China strongly urges the Canadian side to immediately stop this self-directed political farce, and not go further down the wrong and dangerous path. Should the Canadian side continue to make provocations, China will play along every step of the way until the very end,\" Cong said.Prime Minister Justin Trudeau said Wednesday that he did not learn of the spy agency report until a Globe and Mail article Monday, citing top-secret documents, said the spy agency had the intelligence. But Chong told Parliament that Canada's national security adviser informed him the 2021 report went to various points in government, including to the national-security adviser at the time.Trudeau has ordered Canada´s intelligence agencies to immediately inform lawmakers of any threats against them, regardless of whether those threats are considered credible.Canada´s spy agency didn't tell Chong about the targeting of his family until this week.Many governments, the United Nations, and human rights groups accuse China of sweeping a million or more people from its Uyghur community and other predominantly Muslim ethnic minority groups into detention camps, where many have said they were tortured, sexually assaulted, and forced to abandon their language and religion. China denies the accusations, which are based on evidence including interviews with survivors and photos and satellite images from Uyghur´s home province of Xinjiang, a major hub for factories and farms in far western China.",
        "Last month, Trudeau named a former governor general as a special investigator to look into allegations of Chinese interference in Canada´s last two elections. David Johnston will decide if a public inquiry is needed and Trudeau has said he will abide by recommendations.The Globe and Mail, citing unidentified intelligence sources, has reported that China preferred to see Trudeau´s Liberals re-elected in the 2021 election and worked to defeat Conservative politicians considered unfriendly to Beijing."
    ]
}