{
    "articleURL": "/wires/afp/article-12058139/The-water-cops-Las-Vegas-make-city-model-drought-hit-US.html",
    "content": [
        "Known around the world as an oasis of overindulgence, the desert city of Las Vegas has emerged as a surprising model of austerity and prudence when it comes to water.",
        "Some 2.3 million people live in the arid Las Vegas Valley, and 40 million tourists are drawn each year to its giant casinos and hotels.Yet because Nevada is allowed to use less than two percent of the drought-hit Colorado River's total water, it has taken drastic action, from banning lawns to capping the size of swimming pools.Even as the region's population has exploded by more than half in the past two decades, use of the mighty but dwindling river -- by far Las Vegas's main water source -- has declined by almost a third.\"Las Vegas has done a very good job selling the facade of excess and decadence,\" said Bronson Mack, Southern Nevada Water Authority spokesman.\"But the reality is that our community is extremely water-efficient.\"This is due to a package of strict laws, financial incentives and education, created during severe drought in the early 2000s, when Nevada exceeded its river allocation.Now, at a time when federal officials are mulling mandatory cuts across the parched US West, Las Vegas \"has become a water conservation rock star\" and \"a model for cities\" across the region, said researcher Brian Richter.- 'Water cops' -On the Las Vegas Strip, famous casino attractions like the Bellagio's fountains and the Venetian's canals use non-potable groundwater from private wells.",
        "Out in the sprawling suburbs, early morning \"water patrol\" cars with flashing lights crawl the streets, hunting for broken sprinklers and leaky hoses.",
        "Investigators film any violation, before planting a warning flag on the lawn for first-time offenders, or logging a fine for repeat transgressors.Some homeowners become \"a bit frustated\" to find \"water cops\" on their lawn before dawn, said investigator Cameron Donnarumma, but most are cooperative.Indeed, his work relies on residents reporting their more water-profligate neighbors via an app, which daily yields 20-50 home visits by patrols.\"People recognize when you land in Las Vegas in the Mojave Desert it is a very dry place,\" said Mack. \"It is a different environment from where you came from.\"By 2027, any watering of \"non-functional\" grass -- there purely for aesthetic rather than recreational reasons -- will be banned, except at single-family residences.Las Vegas offers homeowners $3 for every square foot of grass they remove and replace with water-efficient alternatives, like drip-irrigated plants.It is a program that has been copied in other major US cities, such as Los Angeles and Phoenix, though smaller towns find it harder to emulate, said Richter.\"Smaller budgets and limited ability to offer financial incentives in smaller cities can severely constrain\" water conservation programs, he wrote in a recent study.",
        "- 'Political' -The programs are not always popular.Tedi Vilardo, a Las Vegas stay-at-home mom, told AFP she has complied with new rules limiting her to watering her lawn for 12 minutes, but is \"seeing a ton of dead spots.\"",
        "\"I'm gonna go against the rules,\" she said, noting that \"we got lots of rain\" this winter.She dislikes fake grass, because she has two children and \"it burns their feet.\"A recent rule limiting new swimming pools to 600 square feet (56 square meters) has infuriated contractors like Kevin Kraft, who designs giant pools for wealthy homeowners.The industry was not consulted until the legislation was a \"done deal,\" and Kraft says a cap based on percentage of a home's total lot size would save more water.Nevada officials were \"under the gun\" from the federal government and \"had to show savings,\" he said.\"A lot of it is political,\" he added.Even so, Kraft described Southern Nevada's water conservation as \"world class.\"\"Now, the other states such as California? It's not even close,\" he said.- 'Step up' -The rules limiting Nevada's access to the Colorado River, which supplies water to 40 million people including California's cities and giant farms, were drawn up in 1922.Back then, Las Vegas \"barely even existed,\" said Mack, and was \"just a whistlestop for the train between Los Angeles and Salt Lake City.\"",
        "Now, with water levels plummeting at nearby Lake Mead -- the nation's largest reservoir -- federal officials are planning steep cuts across the West.These will either be a uniform percentage reduction for all states, or by \"senior rights\" -- basically, who got there first, which would put Nevada near the back of the line.Mack said Las Vegas's record of water reductions \"could actually be a challenge for us in the future\" if mandated cuts are based on current usage levels.Las Vegas \"should get credit for the amount of water that we have already saved in this community over the past 20 years,\" he said.\"Other communities are just now starting to step up to the conservation plate.\""
    ]
}