{
    "articleURL": "/money/markets/article-12045471/Shell-reports-record-quarter-profits-following-bumper-trading-performance.html",
    "content": [
        "Shell reported adjusted earnings of $9.6bn (£7.6bn) for the first quarterMargins were hit by oil and gas prices sliding back from last year's levelsEnvironmental groups have reiterated their calls for a higher windfall taxShell has posted record first-quarter profits thanks to reduced operating costs and a continued volatile energy market boosting its trading operations.",
        "The oil giant reported adjusted earnings of $9.6billion (£7.6billion) for the opening three months of 2023, $1.7billion greater than forecast and $500million more than in the same period last year.Although margins were hit by oil and gas prices sliding back from last year's elevated levels, the firm offset this with an improved performance from its trading team and falling operating expenses across all segments.",
        "Compared to the previous quarter, profits in its chemicals and products arm, which includes refineries and manufacturing plants, climbed by over $1billion, partly because of lower feedstock and utility costs.Meanwhile, Shell's marketing division saw earnings almost double following a one-off gain in tax credits and surging demand for products and services in its lubricants and decarbonisation businesses.In response to the impressive figures, Shell has announced a further $4billion share buyback programme and a dividend of 28.75 cents per share.Chief executive Wael Sawan said the company achieved 'strong results and robust operational performance, against a backdrop of ongoing volatility, while continuing to deliver vital supplies of secure energy.'Shell's latest trading update comes two days after BP declared a better-than-expected $5billion underlying replacement cost profit for the first quarter thanks to reduced refining expenses and stellar oil and gas trading.The two firms' soaring profits have reignited calls among environmental groups and politicians for a bigger windfall tax on the oil and gas sector, which has been accused of profiteering from Russia's full-scale invasion of Ukraine.",
        "Britons have also seen their energy bills skyrocket in the past 18 months, leaving millions struggling to afford food, heating, and other necessities.Last year, the UK government introduced the Energy Profits Levy to help fund public support for families, though it includes a loophole that allows oil businesses to offset the tax by investing in oil and gas extraction in the North Sea.Liberal Democrat leader Sir Ed Davey said: 'Rishi Sunak's refusal to close windfall loopholes for big energy companies shows just how out of touch this Conservative Government is with the struggles that families are facing right now.'Yet there are fears an even bigger windfall tax would discourage investment in the UK as it imposes an effective 75 per cent corporate tax rate on oil firms regardless of global prices.Harbour Energy recently announced that it would cut 350 positions, mainly in Aberdeen, soon after revealing annual profits were 'all but wiped out' by the windfall tax, while Enquest blamed the levy for production delays at its North Sea site.Analysts have also pointed out that the petroleum sector's profits are unlikely to be as high as they previously were, given the recent decline in energy prices amid slowing global demand. Mark Crouch, an analyst at eToro, said: 'Short of more geopolitical ructions in Europe, Shell won't count on having a repeat of the extraordinary year that was 2022.",
        "'A buyback bonanza for investors won't help the optics, but oil and gas majors have been more robust in their responses to calls for further windfall taxes recently. 'We're unlikely to see any further movement this side of a general election though, by which time the firm's profits might not look quite as extraordinary.'Shell shares closed 0.9 per cent up at 2,345.5p on Thursday, meaning they have grown by approximately 89 per cent in the last three years.  ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}