{
    "articleURL": "/news/article-12058095/Prince-Princess-Wales-share-slick-scenes-clip-arriving-coronation-concert.html",
    "content": [
        "Behind-the-scenes video shows beaming Wales's arriving in style with stars of the show Charlotte and GeorgeThe Prince and Princess of Wales hailed King Charles' star-studded Coronation Concert 'a night to remember' while sharing slick behind-the-scenes footage of the extravaganza. ",
        "Last night the newly crowned King and Queen boogied away alongside senior members of the royal family in the grounds of Windsor Castle, as the likes of Katy Perry, Olly Murs and Take That took to the stage. The momentous and vibrant occasion was watched by around 20,000 from the royal estate, with millions tuning in to performances from home. Prince William and Kate shared a behind-the-scenes video compilation of them arriving at the concert with their two eldest children - the real stars of the show - nine-year-old Prince George and eight-year-old Princess Charlotte.The royal couple were beaming as they climbed the stairs to take their seats, ready to dance the night away. Cheers filled the air as the royal family arrived at the beginning of the concert and continued until the very last song.",
        "Prince George walked beside his father, the current heir to the throne, while Kate held hands with her only daughter who was seen giggling. The montage was filled with clips of people dancing and cheering in large crowds, as well as a sea of waving Union Jacks.Amongst the clips of some of the brilliant performances, it also recalled the emotional moment Prince William paid a moving tribute to his father, telling him: 'Pa, we are all so proud of you.'",
        "The video showed a slightly apprehensive William heading down the concert stairs, appearing to check to see if had notes in his side pocket.It then jumps to the Prince paying a 'huge thank you' to everyone who made it to the concert' before paying tribute to the 'King, country and Commonwealth'.The clip wraps in highlights from the spectacular and historic event that lasted almost two hours yesterday evening.Throughout the night the young royals Prince George and Princess Charlotte led the rest of the firm in a singalong in the show's finale that was performed by Take That, alongside choristers from St George's Chapel.King Charles and Queen Camilla were both seen taking to their feet for a boogie when Lionel Richie performed his most loved song, All Night Long.",
        "Royal fans on social media quickly pointed out that Sophie, The Duchess of Edinburgh, was queen of the dancefloor as she beamed with joy and threw her hands up in the air as 70s pop icon sang Easy Like Sunday Morning. The Duchess of Edinburgh proved she is just like the rest of us as she let her hair down.Royal fans took to Twitter to praise her free-spirited nature with someone claiming she is 'all of us who couldn't attend the concert but wanted to.'",
        "Sophie was spotted in the crowd dancing in her chic coral midi dress which was from one of her favourite labels, Beulah.Fans flocked online to praise Sophie for being the 'most real' royal and letting her hair down.One person wrote: 'I'm still not over Sophie vibing to All Night Long'Another wrote: 'An appreciation tweet for HRH The Duchess of Edinburgh. Sophie was living her best life tonight, singing &amp; dancing (at times to the discomfort of James, but I always say what the point of having teenagers if you can't embarrass them) Go Soph. Love it.Someone else said: 'I'm sorry but I have just become a Sophie fan boy lol It's like she's in a music video with the the wind machine blow her hair looking all glamorous.'Another said: 'She's gorgeous. Representing beauty and rhythm for older women all over the world' While another said: ' I have never wanted to party with a Royal more than I do after watch the way Sophie #DuchessofEdinburgh danced tonight! Sophie has moves.'",
        "Alongside beloved popstar icons, the royals watched a performance of Shakespeare, a ballet and a drone show reflecting the monarch's love of the environment. The evening was one full of laughter and happiness. There were gasps from guests at the stunning light display which painted the night sky above the castle with a series of images.",
        "Performances by Richie, Katy Perry, and Olly Murs prompted the biggest cheers, with Richie getting everyone on their feet to dance and sing along.More reflective moments included Stella McCartney's address about the environment and a Winnie the Pooh skit which did not seem to elicit as much of a response as Paddington Bear's appearance with Queen Elizabeth II at the late monarch's Platinum Jubilee.Away from the stage, long queues built up at food trucks, with waiting times topping 90 minutes at some stations.Ticket-holders had been told not to bring their own snacks and food found during security checks as guests arrived was confiscated and binned.There were also queues for people to get inside the the concert but such frustrations did not dampen the lively audience spirit.All eyes were on the youngest royals in attendance, particularly when Princess Charlotte attempted to get Prince George's attention and pointed at her father the Prince of Wales as he made his way onto the stage to deliver a speech during the Coronation Concert.Throughout his speech to indebted to his father, he reflected that his grandmother, the late Queen Elizabeth, would be looking down 'fondly' from heaven on his Coronation weekend and would be a 'very proud mother'.",
        "Festivities will continue on the Monday bank holiday to celebrate the King's coronation.The King and Queen will not be appearing publicly on Monday - the day of the Big Help Out, which is billed as a lasting volunteering legacy to mark Charles's crowning.",
        "Other royals will be out and about with the Duke and Duchess of Gloucester visiting the Coptic Orthodox Church in London where young volunteers will be hosting a coronation street party.The Duke and Duchess of Edinburgh will take part in a puppy class at the Guide Dogs for the Blind Association Training Centre in Reading.The Big Help Out day is organised by The Together Coalition and partners such as The Scouts, the Royal Voluntary Service and faith groups from across the United Kingdom.It will highlight the positive impact volunteering has on communities and will encourage people to try volunteering for themselves to create a lasting legacy.On Monday evening from 7.30pm, EastEnders will hold a coronation-themed street party in Albert Square hosted by the residents of Walford.The public have been encouraged to take up hundreds of thousands of volunteering roles on the extra bank holiday with more than 1,500 charities involved.An app has been created to allow people to search for volunteering opportunities, ranging from helping the elderly to working with environmental charities and supporting animal welfare.A Buckingham Palace spokesperson said: 'While wholly supportive of the Big Help Out initiatives taking place right across Britain on Monday May 7, (the King and Queen) will not be attending any events in-person.",
        "'These will instead be attended by other members of the royal family.'Camilla is patron of the Royal Voluntary Service charity and has been patron of the Big Lunch initiative since 2013.The extra bank holiday, which will take place across the UK, caps off a long weekend of celebrations."
    ]
}