{
    "articleURL": "/wires/ap/article-12050411/Russias-Wagner-boss-threatens-Bakhmut-pullout-Ukraine.html",
    "content": [
        "KYIV, Ukraine (AP) - The owner of Russia´s Wagner military contractor threatened Friday to withdraw his troops next week from the protracted battle for the eastern Ukrainian city of Bakhmut, accusing Moscow´s military command of starving his forces of ammunition.",
        "Yevgeny Prigozhin, a wealthy entrepreneur with longtime links to Russian President Vladimir Putin, claimed that Wagner fighters had planned to capture Bakhmut by May 9, Russia´s Victory Day holiday celebrating the defeat of Nazi Germany. But they were undersupplied and suffering heavy losses, he said, and would hand over operations to the regular army on May 10.It is not the first time Prigozhin has raged about ammunition shortages and blamed Russia´s military, with which he has long been in conflict. Known for bluster, he has previously made unverifiable claims and threats he hasn´t carried out.Prigozhin´s spokespeople also published a video of him Friday shouting, swearing and pointing at about 30 uniformed bodies lying on the ground. He says they are Wagner fighters who died on Thursday alone, and demands ammunition from Russian Defense Minister Sergei Shoigu and General Staff Chief Valery Gerasimov.\"These are someone´s fathers and someone´s sons,\" Prigozhin says. \"The scum that doesn´t give us ammunition will eat their guts in hell.\"Yohann Michel, a research analyst with the International Institute for Strategic Studies think tank, said Prigozhin's comments should usually be taken with a grain of salt, but \"this time I would take a shovel of salt, at least, or maybe a truck.\"",
        "But why Prigozhin is threatening to pull his forces out is an open question, Michel said. He might want to regroup without being accused of retreating; he may worry about being fired for not taking the city and prefer to say he left on his own; or he could genuinely need more ammunition.",
        "\"The only thing I am taking seriously from that declaration is that Bakhmut is probably not ready to fall,\" said Michel, who is based in Berlin.Wagner has spearheaded the struggle for Bakhmut, the war's longest - and likely bloodiest - battle. U.S. National Security Council spokesman John Kirby said Monday the U.S. estimates that nearly half of the 20,000 Russian troops killed in Ukraine since December were Wagner fighters in Bakhmut.A pullout by Wagner would be a huge blow to the Russian campaign.For the Ukrainian side, Bakhmut has become an important symbol of resistance to Russia´s invasion. President Volodymyr Zelenskyy says its loss could build international support for a deal that could require Ukraine to make unacceptable compromises.Like Michel, Ukrainian officials were skeptical about Prigozhin´s claims of ammunition shortages. Military intelligence representative Andrii Cherniak told The Associated Press that Prigozhin was trying to \"justify their unsuccessful actions\" in Bakhmut.Shoigu didn´t immediately respond to Prigozhin, but his ministry reported Friday that he ordered a top official to ensure a \"continuous supply\" of all necessary weapons and military equipment to Russian troops. And in a counterpoint to Prigozhin´s visibility, an official video showed Shoigu inspecting tanks and other military equipment destined for Russian troops in Ukraine.At the end of last year, the U.S. estimated Wagner had about 50,000 personnel fighting in Ukraine, including 10,000 contractors and 40,000 convicts the company has enlisted. That makes it a small part of Russian fighting forces.",
        "If Prigozhin did pull Wagner's troops out of Bakhmut, it would have serious implications, Michel said.\"If he's removed from the front line - except if Russia surprisingly has reserves that they did not want to use before - I think we can say it is the end of this phase of the offensive for Russia,\" he said.Prigozhin's acrimonious relations with the military brass date back to Wagner´s creation in 2014. During the war in Ukraine, he has publicly accused some top Russian military officials of incompetence - behavior that is highly unusual in Russia´s tightly controlled political system.Prigozhin alleged Friday that Russia´s regular army was supposed to protect the flanks as Wagner troops pushed forward but is \"barely holding on to them,\" deploying \"tens and rarely hundreds\" of troops.\"Wagner ran out of resources to advance in early April, but we´re advancing despite the fact that the enemy´s resources outnumber ours fivefold,\" Prigozhin´s statement said. \"Because of the lack of ammunition, our losses are growing exponentially every day.\"Hanna Maliar, deputy head of Ukraine´s Defense Ministry, said Friday that Ukrainian artillery had destroyed some Wagner ammunition depots, and other military officials said Ukrainian forces were holding their own in Bakhmut. The Russian Defense Ministry, meanwhile, said its forces had destroyed a bridge that Ukrainian troops used to supply their side in Bakhmut. It wasn't possible to independently verify either side's claims.",
        "Prigozhin has toured Russian prisons to recruit fighters, promising inmates pardons if they survive a half-year tour of front-line duty with Wagner. Western countries and United Nations experts have accused Wagner mercenaries of committing numerous human rights abuses throughout Africa.Bakhmut, about 55 kilometers (34 miles) north of the Russian-held regional capital of Donetsk, has tactical military value for Moscow, though analysts say it won´t be decisive in the war´s outcome. The city had a prewar population of 80,000 and was an important industrial center. It is now a ghost town.Western officials and analysts believe Russia has run low on ammunition as the 14-month conflict became bogged down in a war of attrition over the winter.Prigozhin had already threatened to withdraw from Bakhmut once before, in an interview with a Russian military blogger last week.Asked by The AP about Prigozhin´s statement Friday, Kremlin spokesman Dmitry Peskov declined comment.Also on Friday, an oil refinery in Russia´s southern Krasnodar region, which borders the Crimean Peninsula that Russia illegally annexed, briefly caught fire after it was attacked by a drone, Russia´s state news agency Tass reported. The fire was small and was quickly put out, the report said.It was the second straight day that the Ilyinsky refinery had come under a drone attack. Drone attacks on oil facilities in Russian regions bordering Ukraine have been reported almost daily over the past week.",
        "___Follow AP´s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
    ]
}