{
    "articleURL": "/tvshowbiz/article-12057693/Chris-Pratt-says-Jesus-struggles-help-deal-haters.html",
    "content": [
        "Chris Pratt, 43, wants the haters to know he's protected by a higher power: Jesus.",
        "The Guardians of the Galaxy star has always been open about his deep faith in religion and said criticism over his beliefs does not bother him,'That's nothing new, that's nothing new, you know?' Pratt told Page Six, adding, 'If I was of this world, they would love me just like that but as it is, I've chosen out of this world. That's John 15:18 through 20.''That's the way it is, nothing new, 2,000 years ago they hated him, too,' he added, referring to Jesus Christ.Pratt is so committed to his faith, he even met his wife, Katherine Schwarzenegger, 33, at church. ",
        " In an appearance on the Drew Barrymore Show in February, Schwarzenegger said, 'We met each other at church. It was very sweet, but he didn't try and pick me up in church.'She noted of their 2018 meeting: 'Everybody's always like, 'How did that happen that you were in church? How'd that work?''After the couple, who share daughters Lyla, 2,  and Eloise, 1, got engaged, her mother Maria Shriver shared an Instagram post in tribute to them.'Congratulations to two loving, kind, caring, thoughtful, spiritual people. We are so happy for you. You are blessed, as is everyone who knows you. Yes, let's go,' Shriver wrote at the time.",
        "The Super Mario Bros actor also posted an engagement announcement on Instagram.'Sweet Katherine, so happy you said yes! I'm thrilled to be marrying you,' he wrote.'Proud to live boldly in faith with you,' he concluded. 'Here we go.'",
        "However, in a cover story for Men's Health last summer, the Jurassic World star said he's not nearly as religious as people think he is. “Religion has been oppressive as f*ck for a long time,” he said. “I didn’t know that I would kind of become the face of religion when really I’m not a religious person.'I think there’s a distinction between being religious — adhering to the customs created by man, oftentimes appropriating the awe reserved for who I believe is a very real God — and using it to control people, to take money from people, to abuse children, to steal land, to justify hatred. 'Whatever it is. The evil that’s in the heart of every single man has glommed onto the back of religion and come along for the ride.'"
    ]
}