{
    "articleURL": "/wires/ap/article-12048727/Oregon-Senate-walkout-highlights-unusual-stalling-tactics.html",
    "content": [
        "The Oregon Senate has been brought to a halt because Republican lawmakers have refused to show up to work on a Democratic agenda that includes new gun controls and greater access to abortion.",
        "It's not the first time Republicans have walked out of the Capitol, or even the second or third.Though rare in most states, minority party lawmakers in Oregon have a history of skipping sessions in an attempt to prevent the majority party from passing legislation. They also did it in 2021, and 2020 and 2019. The tactic exploits Oregon's unusual requirement for a two-thirds quorum to conduct legislative business - a threshold that exists in only a few other states.In Texas, which has a similar requirement, Democrats staged a walkout a couple years ago as the Republican-led Legislature was considering election legislation. Democrats in Indiana and Wisconsin also skipped legislative sessions a little over a decade ago in an attempt to block Republican bills limiting union powers. Ultimately, the majority parties prevailed in those states - even if it took a while.Whether the latest Oregon walkout is politically successful may depend upon the ultimate objective.\"It´s a good short-term tactic for getting attention to Republicans,\" said Jim Moore, a politics professor at Pacific University in suburban Portland. \"But it is a bad medium- to long-term tactic, because it does not stop Democratic legislation.\"",
        "WHAT'S THE DEAL IN OREGON?When 10 Republicans and an independent senator failed to show up for sessions on Wednesday and Thursday, the Senate was left just shy of the 20 members needed for a quorum in the 30-seat chamber. That's because Democrats hold 17 seats and cannot conduct business on their own.",
        "Republicans said they were protesting that bill summaries are not being written in plain language, citing an obscure 1979 law. But Democrats said they thought the moves were based on the content of several bills, including one that would raise the age to purchase AR-15-style rifles and another that would expand abortion rights, including for minors.How long the walkout lasts may depend on the risk senators are willing to take. A constitutional provision approved by voters last year prohibits lawmakers with 10 or more unexcused absences from running for reelection.CAN WALKOUTS WORK?Oregon's Republican senators staged a more than weeklong walkout in 2019 to prevent a vote on a sweeping climate-change bill backed by majority Democrats. Encouraged by that success, they also walked out in 2020 - again preventing passage of climate legislation while dooming scores of other bills in a short 35-day session.In 2021, Republicans staged a shorter walkout - this time protesting then-Gov. Kate Brown's aggressive coronavirus precautions.That same year, dozens of Democratic Texas lawmakers fled to Washington, D.C., to prevent Republicans from passing an election overhaul. They eventually returned and - 93 days later - Republicans nonetheless passed a bill prohibiting 24-hour polling sites, banning drive-through voting and giving more access to partisan poll watchers.",
        "\"The demonstration by the minority party that they are deeply offended and determined to stop this generally doesn´t give the majority second thoughts,\" said Cal Jillson, a political science professor at Southern Methodist University in Dallas. \"So as soon as they have an opportunity to conclude the passage of that bill, they go ahead and do it.\"A decade earlier, Democratic lawmakers in Wisconsin and Indiana both staged walkouts. Indiana Democrats fled to Illinois in 2011 to prevent a Republican bill prohibiting mandatory labor union fees. But Republicans successfully passed the bill the next year.Wisconsin Democrats also left the state for several weeks in 2011, temporarily preventing Republican action on a bill limiting union bargaining rights. Republicans eventually passed the bill after removing spending provisions that had triggered a requirement for a three-fifths quorum instead of simple majority to conduct business.WHAT ELSE CAN MINORITY PARTIES DO?In most states, minority party lawmakers can't block legislation they don't like by failing to show up for session. Oregon, Texas, Indiana and Tennessee are the only states with a two-thirds quorum requirement - and Republicans easily meet that in Indiana and Tennessee because they currently have overwhelming majorities.Elsewhere, the minority party must resort to other tactics.One of the most common methods of obstruction is stalling. Rules in some states allow lawmakers to talk at length - known as a filibuster - to try to prevent bills from coming to a vote. That tactic was used earlier this year by Nebraska state Sen. Machaela Cavanaugh and others to protest a bill banning gender-affirming treatments for minors.",
        "Other tactics include offering numerous amendments to bills, making changes that result in bills getting sent back to committees, or asking clerks to read aloud the entire text of measures - eating up precious time during sessions. Republican lawmakers in Oregon, for example, refused to suspend the full reading of bills before a final vote in 2021."
    ]
}