{
    "articleURL": "/news/article-12060743/RICHARD-LITTLEJOHN-Food-poisoning-Coronation-quiche.html",
    "content": [
        "The Government is spending £240 million on phone systems for GP surgeriesThis is in an attempt to cut waiting times for appointmentsREAD MORE: It's official! Charles' slimmed-down monarchy is unveiled The Government is spending £240 million on new phone systems for GP surgeries to cut waiting times for appointments.It’s an attempt to end the 8am scramble, when switchboards are jammed with patients desperate to see a doctor.Some practices are overwhelmed by up to 100 calls in the first hour every Monday morning, leaving receptionists unable to cope.Rather than getting an engaged tone, patients will be able to request a call-back. An initial assessment will be carried out to determine whether a face-to-face consultation is really necessary.In emergencies, patients will be told to go straight to A&amp;E. In many non-urgent cases, they will be directed to other medical professionals, including pharmacies and physiotherapists.",
        "Ministers hope that as well as ending the frustration of not being able to get through to the surgery by phone, it will also ease the burden on doctors.The new system will be introduced over the coming months, but trials are already under way. The first pilot scheme went live yesterday, to establish how well it could cope with the aftermath of a busy Coronation weekend. This column gave it a whirl . . .(Bring, bring)Thank you for calling the GP surgery hotline. All our calls are recorded for training purposes. For English, press 1. For Albanian, press 2. For all other languages, including Scribble, press 3.Hello?All our receptionists are currently gossiping about the Coronation over a cup of tea and a packet of Hobnobs. Didn’t Katy Perry look a right old slapper in that low-cut frock?Hello?You are being held in a queue. If you would like a call-back please enter your number now, followed by hash.634-5789I’m sorry, I didn’t get that. Please enter your number followed by hash.Where do I find hash?I’m sorry, I didn’t get that. You might prefer to visit our website, www.ouramazingnhs.com. If you wish to keep holding, press 1.Hello?We are experiencing a high volume of calls following the Coronation weekend. To further assist us in assessing your inquiry, so we can direct you to the appropriate medical professional, please complete the following questionnaire, using your keypad.Hello?Are you suffering from food poisoning after eating too much Coronation quiche? For salmonella, press 1. For listeria, press 2. For botulism, press 3.Hello?If you drank a gallon of cheap prosecco toasting the new King and Queen and are now suffering from a humungous hangover, please hang up, take two aspirins and pour yourself a large Bloody Mary.Hello?If you have been camping in The Mall for the past week: press 1 for frostbite, press 2 for trench foot, press 3 for haemorrhoids.Hello?If you are a dopey bird from Birmingham who fell off her platform soles and snapped an ankle while puking in the gutter, press 1 and go straight to A&amp;E.Hello?If you are a Geordie girl in a crop top, micro-skirt and Union Jack hat who celebrated by downing ten pints of Newcastle Brown and half a dozen tequila chasers in the Bigg Market, press 1 for Panadol, press 2 for Alka-Seltzer, press 3 for the morning-after pill.  All our GPs are currently on the golf course or working from home Hello?If you have spent the weekend on the sofa watching the Coronation on television, while stuffing your face with pizza, Doritos and drinking lager, press 1 for indigestion, press 2 for flatulence, press 3 for deep vein thrombosis.Hello?If you are a Not My King protester suffering from sore wrists after being dragged away in handcuffs by the Old Bill, press 1 for ‘Oh, dear’, press 2 for ‘How sad’, press 3 for ‘Never mind’.Hello?Your call is important to us. All our receptionists are still bitching on about that bright orange outfit Liz Truss wore to the Abbey, made her look like something out of a Tango advert.Hello?If you were bitten by Rishi Sunak’s dog during the No 10 street party, press 1 for distemper, press 2 for rabies, press 3 for a tetanus jab.Hello?If you are a guardsman who passed out after trying to stand still in the pouring rain for eight hours, press 1 for smelling salts, press 2 for stretcher bearers, press 3 for court martial.Hello?All our GPs are currently on the golf course, or working from home. For an appointment this side of next Christmas, press 1. If you would prefer to go directly to hospital, press 2, but good luck with that because all their doctors are on strike in support of a 35 per cent pay rise. To go private, press 3.Hello?If you are a former magician’s assistant in high heels who spent several hours carrying a heavy sword and are now experiencing severe discomfort, we can refer you to an experienced osteopath. If you wish to use this service, press 1 for curvature of the spine, press 2 for slipped disc, press 3 to become the next leader of the Conservative Party.Hello?If you are a member of the Royal Family, and would like to speak to a medical professional, please press 1 now to be connected to our dedicated Physicians By Appointment hotline.Hello?Thank you for holding. One of our receptionists will be with you shortly, just as soon as they’ve finished discussing what they’d like to do to that hot equerry in the kilt.Hello?If you are claiming to suffer from mental health issues after being stuck in the cheap seats behind a pillar and a woman with a huge feather in her hat, press 1 for an Uber to take you directly to Heathrow so you can fly home to your ghastly wife and book an appointment with your thousand-dollar-an-hour Californian shrink. Missing you already.Hello?If you are suffering from withdrawal symptoms because you were unable to smoke in the Abbey during the ceremony, press 1 for Nicorette gum, press 2 for a nicotine patch, or press 3 for 20 Rothmans.Hello?If you’ve got a stiff neck caused by wearing a 5lb solid gold St Edward’s Crown, press 1 and we’ll send a consultant chiropractor from one of London’s top teaching hospitals to the Palace straight away, Your Majesty. At your age, one can’t be too careful.God Save The King!‘All our GPs are currently on the golf course or working from home’"
    ]
}