{
    "articleURL": "/tvshowbiz/article-12058583/Seth-Rogen-announces-beloved-dog-Zelda-passed-away.html",
    "content": [
        "Seth Rogen is mourning the death of his beloved dog Zelda.",
        "The 41-year-old actor and comedian - who recently defended being childless -  took to Instagram on Sunday to share the unfortunate news with his nearly 10 million followers.The Canadian-born entertainer shared a slew of images with the pup and added a heartfelt caption.In the message he wrote, 'We said goodbye to our perfect girl Zelda on Thursday, May 4th.'Speaking on behalf of himself and wife Lauren Miller, he added, 'She was almost 14 years old. She was truly the most special, magical creature.'",
        "The note went on, 'She taught us about love, resilience, strength and kindness.'Included in the carousel was a photo of the Pineapple Express star playing fetch with the canine in a driveway.He said in his social media caption, 'We loved her more than words can describe.'Everyone who met her saw what a unique little puppy she was. She’d stare into your soul with her gigantic buggy eyes.'The dog was small and adorable, with long, floppy ears and a white streak going down the center of its face. 'She was so judgmental, that when she loved you, you really knew you earned it, and it made you feel like you had won,' Seth described about his late pet.The longtime entertainer said, 'She had an incredible life and was lucky to have so many friends and shared her special love with so many people.",
        "She was a girl who was so shy no one adopted her as a baby who became a girl who travelled to multiple countries, appeared in three movies, on two magazine covers, and inspired countless works of Zelda-art— including a lighter that is now in the homes of hundreds of people.'",
        "Zelda, who he shared with his wife of 11.5 years, joined Rogen on GQ magazine in 2019, prompting the actor to tweet at the time, 'I've never been more proud.'In Sunday's tribute he wrote, 'We have a (long) list of things that were special about her. Here are a few highlights:'—Her big eyeballs and her intense eye contact—How it feels when she stretches while I’m holding her in my arms—How she comes inside before she’s done pooing, takes a treat and then runs to the door when she realizes she has to poo more—The sound she made for Zankou chicken.—The way the fur on her legs looks like culottes from the back—Her leave me alone side eye—The way she would sit and wait to be called to walk through the metal detectors at the airport and then she’d run through them and everyone would comment about what a good girl she was.'",
        "The list went on, '—How she always wants to sleep in Seth’s spot—When she would go to the door pretending to have to go out, but just wanted to get us away from our food, although she would never actually go for it—Her big gigantic poops that always surprised people because of her small size—The way she loved sprinting up and down hotel hallways—How she’d ask Seth to take her outside over and over again just for treats—The way she pounced on seaweed and her paws left tracks in the sand. And then she’d “kill it” and ask to take it home.—How incredible it felt to wake up in the morning and see her [staring] back at me.'Finally, Seth finished, 'We belonged to each other and we will miss her forever.'The post has so far collected over 125,000 likes and supportive comments from friends and fans. Zelda was the closest thing the actor and his wife had to children, which Seth has said they don't plan to have. ",
        "Last March, on Steven Bartlett's The Diary of a CEO podcast, Seth opened up about his choice not to become a father and his 'very happy' life with Lauren, who he wed in 2011 after seven years of dating.",
        "When he was asked if he might be 'happier' if he had children, the Superbad actor said he didn't think so and credited the decision with helping him 'succeed' in Hollywood.While speaking about discussions between him and his spouse as they get older, the comedian said: 'Now, more than anything, the conversation is honestly, thank God we don't have children.''We get to do whatever we want, we are in the prime of our lives, we are smarter than we've ever been, we understand ourselves more than we ever have, we have the capacity to achieve a level of work and a level of communication and care for one another, and a lifestyle we can live with one another that we've never been able to live before,' he explained."
    ]
}