{
    "articleURL": "/wires/pa/article-12042357/Stop-right-Singing-protesters-disrupt-Barclays-shareholder-meeting.html",
    "content": [
        "Environmental protesters have caused major disruption at banking giant Barclays’ annual meeting for shareholders in central London.",
        "Chairman Nigel Higgins grew disgruntled after protests broke out minutes into the annual general meeting (AGM), leading security to remove multiple people from the venue and the meeting to be temporarily halted.Singing a version of the Spice Girls’ Stop, a group sang: “Stop right now, no more oil and gas. Stop burning fossil fuels and end this madness.“Hey, you, burning up the Earth… we’ve had enough.”Mr Higgins eventually responded: “Obviously we are very happy to hear opinions of what we do but maybe better to wait for the Q&amp;A and have a two-way discussion.”Money Rebellion, a subsidiary of Extinction Rebellion, was among the teams of activists interrupting the meeting with shouts, songs and rhymes.Several protesters continued to halt the meeting by standing up and shouting about the bank’s impact on climate change and financing of fossil fuel companies.One shouted: “Barclays funds climate chaos – people are dying right now. The largest funder of fossil fuels in Europe.”Another protester was carried out of the building for refusing to move, with his shouts drowned out by Barclays’ company secretary Hannah Ellwood, who continued to run through the agenda.At least two women were removed from the venue by security after holding up banners and shouting: “Barclays funds climate chaos.”",
        "Mr Higgins repeatedly asked people to be removed and “shuffled out” of the meeting and was audibly sighing during interruptions and repeated questions.During the question-and-answer section of the AGM, Barclays’ management team was pressed over its climate policies and decision not to end financing the expansion of oil and gas fields.Mr Higgins was clear in his response: “The world at the moment cannot function without fossil fuels.”He said the bank had restricted its financing of energy companies and reduced emissions from its energy portfolio by a third over the last few years.Mr Higgins added: “We don’t believe that a simple exit from the sector is the right thing to do because it doesn’t square with the other requirements for energy security… and meeting the demands as a consequence of energy poverty around the world.”One campaigner, who did not give her name, responded: “This isn’t real. What’s real is record-breaking temperatures in the world’s oceans, crops failing around the world and a third of humanity in record-breaking heat in 12 countries in Asia. That’s real.“I don’t know if you feel that your privilege is going to protect you, Nigel, but it isn’t.”",
        "Later, questions on the bank’s climate policy were fielded by Mr Higgins, as he said “we have answered this already”.",
        "Elsewhere in the meeting, Barclays chief executive CS Venkatakrishnan, known as Venkat, assured shareholders the banking giant has been “insulated” from the recent volatility in the global banking sector.He referenced the recent failures of Silicon Valley Bank and First Republic Bank in the US, and Credit Suisse.He said the group has strong risk management, robust liquidity and a prudent approach to lending.“And these have insulated Barclays from the volatility which we have seen in markets, and have enabled us to continue to support our customers and clients through an uncertain period.”Despite the protests, shareholders voted to approve all of Barclays’ resolutions, including the pay packages of the executive team.Some 12% voted against the resolution to approve the directors’ 2022 remuneration report, with 88% voting in favour.Venkat took home £5.2 million in cash and bonuses last year, and is set to see his fixed pay jump by 3.4% this year."
    ]
}