{
    "articleURL": "/sport/football/article-12051101/West-Ham-demand-100MILLION-star-midfielder-Declan-Rice-anticipate-bidding-war.html",
    "content": [
        "Arsenal have named West Ham star Declan Rice as their top transfer target Hammers boss David Moyes has insisted his captain will command a hefty feeArsenal could face competition from the majority of their top-flight rivals West Ham will reportedly demand £100m for midfielder Declan Rice this summer as they attempt to ward off Premier League clubs such as Arsenal.",
        "Rice has long been understood to be Arsenal's top target for the upcoming transfer window, with Mikel Arteta an outspoken admirer of the England midfielder.The Spaniard's resolve to sign Rice has only been strengthened by Arsenal's success this season, with the club having secured Champions League football for the first time since 2016.The Gunners are expected to face competition from a number of their rivals with Manchester United and Chelsea also very interested. Liverpool and Man City are also keeping an eye on the situation.Rice's deal at the London Stadium expires in June 2024 but Hammers boss David Moyes is resolute that his captain will not be leaving the club in for a cut-price fee.",
        "And ESPN report that the price tag has been set at £100m.That is close to the British record, which currently sits at the £106million fee Chelsea paid Benfica for Argentinian midfielder Enzo Fernandez in January. Rice, an established England international, has contributed four goals and four assists in 43 appearances this season and is regarded by many as one of the best midfielders in the country.A new midfielder is a priority for the Gunners after missing out on Moises Caicedo in January and the likes of Granit Xhaka and Thomas Partey not getting any younger.",
        "They did add Jorginho to their ranks but this was a short-term fix and they could bring in two central players with Caicedo and Mason Mount also on their shortlist."
    ]
}