{
    "articleURL": "/news/article-12049545/Transgender-applicant-Florida-lifeguard-job-rejected-exposing-breasts.html",
    "content": [
        "Cecil Aquatic Center in Jacksonville, Florida held a session for those hoping to be hired as lifeguards on April 27During the tryout, a transgender male, who was born female and had not had top surgery, removed their top and exposed their breasts to the busy pool crowdThe trans person will not be hired: Mayor Lenny Curry said he refused to mandate a compromise solution of all lifeguards covering their chestsThe mayor of Jacksonville, Florida has refused to succumb to 'wokeism' and order the city's lifeguards to cover their chests, after a transgender person hoping to be employed at a city pool exposed their breasts.",
        "The transgender person, who has not been named, attended a trial session for lifeguard hopefuls at the Cecil Aquatic Center on April 27.During the course of the tryout, the female-born person, who identifies as male but has not had top surgery, exposed their breasts and did not attempt to cover themselves.Children were within 15 to 20 feet from the lifeguard training and the nudity was in 'clear view,' sources told Florida's Voice. The incident happened in a group of 21 lifeguard trainees aged 15 and above. Florida's Voice reported that the situation occurred during the swimming portion of the training. ",
        "Lenny Curry, the Republican mayor of Jacksonville, said families who were in the swimming pool at the time complained. The trans person has not been hired, Action News Jax reported.'Through a citizen expressing concerns, my administration became aware of an incident where a biological female trainee in a lifeguard program was topless at one of our public pools,' said Curry.'After consideration of the incident, I believe it is wrong for our public pools to be a place where Jacksonville families are forced to explain to their children why a person hired to protect public safety is exposing her breasts.'Curry said he did not think it right to introduce a compromise solution, whereby all lifeguards - male, female and trans - would have to cover their chests.",
        "'I see no reason for our lifeguards to be forced to make changes to existing rules mandating that biological females cover their chests,' he said. 'Our parks and public pools are meant to be a place where families can feel safe to enjoy themselves. 'We shouldn't force parents of young children to be caught in the crossfire of battles over wokeism.'Yet Cielo Sunsarae, the executive director and founder of Queer Trans Project, accused Curry of overreacting.",
        "'Kids don't sexualize breasts, it's the adults that are making it out bigger than what it is,' Sunsarae told Action News Jax. 'What is the difference if the person had top surgery or not?' Florida is cultivating a reputation for being on the frontline of culture wars, with Governor Ron DeSantis proudly declaring that his state is a place 'where woke goes to die'.The Florida state legislature passed a 'bathroom bill' this week which bars transgender people from using public restrooms that do not match the gender on their birth certificate.The measure will now head to DeSantis' desk for final approval."
    ]
}