{
    "articleURL": "/sport/othersports/article-12040503/Footy-player-manager-Ricky-Nixon-explodes-AFL-icons-Wayne-Carey-Tony-Shaw-unprintable-spray.html",
    "content": [
        "Ricky Nixon didn't hold back at a recent AFL dinnerEx-player agent called out Wayne Carey and Tony ShawIncident shocked guests at the Glasshouse in CollingwoodControversial former player agent Ricky Nixon turned heads recently when he publicly exploded at AFL legends Wayne Carey and Tony Shaw over their stance on players suing the league after suffering concussions.",
        "The incident unfolded during a Prestige Global Events dinner hosted at the Glasshouse in Collingwood - and Nixon didn't mince his words.Responding to comments from premiership-winning Magpies captain Shaw that the growing number of concussion lawsuits being filed by former footy players may not hold up in court, Nixon lost his cool, according to the Herald Sun.It also followed comments from Carey that being concussed was a 'badge of honour' during his decorated stint with the Kangaroos, which included two premierships.'Shawry and Wayne Carey, pull your f***ing heads in,' Nixon said.",
        "'You didn't manage these players and the stuff they've gone through, and the health [struggles] they've had.'Other speakers and guests at the Glasshouse included AFL identities Sam Newman, Kevin Sheedy, Peter Daicos, Jonathan Brown and James Hird.Shaw wasn't intimidated by Nixon's public outburst, declaring: 'I hope you're not in the class action trying to make a quid out of it. 'I've got no worries about the ridgy-didge blokes, but you know there's going to be a lot of players going down that track who haven't even had issues.'After retiring from AFL in 1993, Nixon quickly became the most influential player agent in the code.At his peak, Nixon had the likes of Carey, Gary Ablett Snr, Jason Dunstall, Gary Lyon and Tony Lockett on his books.",
        "Controversy also followed Nixon, and in 2011 he lost his AFL accreditation following over his relationship with then 17-year-old Kim Duthie. "
    ]
}