{
    "articleURL": "/wires/reuters/article-12043673/Teenagers-tear-gassed-protest-against-Orbans-education-reforms.html",
    "content": [
        "By Boldizsar Gyori",
        "BUDAPEST, May 3 (Reuters) - Hungarian police fired tear gas at teenagers and detained five people at a rally outside Prime Minister Viktor Orban's offices on Wednesday after a protest against a new law that would eliminate teachers' public-servant status.The police action follows a thousands-strong rally in central Budapest earlier on Wednesday against legislation that would significantly increase teachers' workload. The protest was the latest in a series of demonstrations over the past year for better working conditions for teachers.Police said the decision to fire tear gas at protesters was triggered by a breakaway group of participants of the afternoon rally marching at Orban's offices, breaking up barricades around a nearby construction site and pelting policemen with debris.A Reuters correspondent on the scene said police officers were reviewing footage of the incident to identify protesters suspected of wrongdoing.In power since 2010, nationalist Orban has clashed bitterly with the European Union over democratic norms, as the Hungarian leader tightened restrictions on NGOs, media, academics and judges and cracked down on the rights of migrants and gays.Almost 5,000 teachers have already said they will leave their profession if a so-called Status Law comes into force, but Orban's government is going ahead with the reforms that would strip teachers of some of their job security.",
        "Over the past year, teachers have demonstrated and gone on strike for higher wages as Hungary's inflation - running above 25% - erodes salaries that are already below the national average and second-to-last among OECD countries according to 2021 data.Many critics refer to the proposed law as the \"Revenge Law,\" perceived as punishment for teachers' year-long resistance.\"I am entirely against this law, which is not called the 'revenge law' in public discourse by accident,\" said Katalin Torley, one of the most vocal critics of Orban's education policies.\"It is a response to the wave of protests seen over the past year ... which have exposed the dire problems of the public education system.\"The government said the new legislation aimed to improve the quality of education.According to a former version of the draft, teacher behaviour and communications would have been monitored by technical means. Although the government promised to remove this and other minor provisions from the measure, negotiations are still ongoing between the government and teachers' trade unions.If the law passes in its current form, from June 1 teachers´ maximum daily working time would increase from 8 to 12 hours, the weekly working time from 40 to 48 hours, and the number of substitutions from 30 to 80 hours per year.",
        "Hungary is facing a growing shortage of teachers mainly due to low wages and the unpredictability in the regulatory environment. (Reporting by Boldizsar Gyori in Budapest, Editing by Angus MacSwan and Matthew Lewis)"
    ]
}