{
    "articleURL": "/news/article-12054713/Royal-fans-swoon-Charles-IIIs-dashing-equerry-Coronation.html",
    "content": [
        " Major Jonathan Thompson, 39, served as the Queen's most senior bodyguard The dashing soldier married marketing manager wife Caroline, 44, in 2010 READ MORE: King Charles Coronation LIVE: Harry jets off to LARoyal fans were swooning over the return of King Charles' dashing officer during the historic Coronation yesterday. ",
        "Equerry Major Jonathan Thompson, 39, stole the show as viewers noticed the return of the King's trusty official. The hunky officer, who is of the 5th Battalion Royal Regiment of Scotland, was once the Queen 's most senior bodyguard but is now serving His Majesty and has been seen at his side since the death of Queen Elizabeth. The soldier, from Northumberland, has had royal watchers drooling but unfortunately for you ladies, the officer is happily married to a glamourous marketing executive. Mr Thompson, who is known as 'Johnny' by his friends, tied the knot to 44-year-old Caroline in 2010. ",
        "The pair have a four-year-old son as well as two black labradors called Odin and Piper – a nod to his military time in Scotland.Twitter users were quick to express their delight as one eager fan wrote: 'That's the dashing major Johnny. Hands off!!'Other admirers also couldn't help but point out the army officer's striking good looks as another fan wrote: 'Anyone else clocked the dashing chap in the kilt?'The major is so handsome that some admirers are becoming a little too territorial and have warned other groupies to keep their 'hands off'. 'That's the dashing major Johnny. Hands off!!' wrote one Twitter user. Thompson previously went viral during the funeral of Queen Elizabeth II last year. ",
        "He was caught on camera calmly and coolly removing a pen tray which was cluttering the King’s desk, as Charles signed the Proclamation which named him as the new monarch following the death of Queen Elizabeth.Major Thompson was also seen in the procession when the Queen’s coffin was escorted from Buckingham Palace to Westminster Hall for the four days of lying in state.Eagle-eyed royal viewers have been keen to point out the officer's major appearances in past. TV footage caught him to the side as the casket was brought in and he was seen speaking briefly to the Duke of Kent.He also escorted ex-PM Liz Truss to meet the King at Buckingham Palace and as always he wore a tartan kilt and large fur sporran.",
        "The equerry was also spotted standing behind Harry and Meghan at the Platinum Jubilee celebration National Service of Thanksgiving at St Paul’s Cathedral.  Mr Thompson joined the Army in 2006 and is a Platoon commander, according to his LinkedIn.He is thought to have been working as an equerry with Charles for the last two years.His profile also reveals how he attended Aberystwyth University where he graduated in 2004 with a degree in Economics and politics with international studies and he gave his hobbies and interests as rugby and mountaineering and he was also a member of the undergraduate officer training corps",
        "Wife Caroline was educated at Windsor Girls School and nearby Strodes College where she passed three A levels in media, psychology and photography before obtaining an HND at Southampton Institute in Design Communications.She has worked for Packard Bell, BMW and is also a gym instructor and keen horse rider, and last year with her marketing and design skills helped set up the website for the charity Horses4Health.Major Thompson’s parents Ian and Elizabeth, were once neighbours of Scottish comedian Billy Connolly, with their Grade A listed 300-year-old home in Deeside set next door to his but they have since moved on."
    ]
}