{
    "articleURL": "/tvshowbiz/article-12041063/Who-Ed-Sheerans-wife-Cherry-Seaborn.html",
    "content": [
        "Ed Sheeran's wife Cherry Seaborn features prominently in his Disney+ documentary, which premiered on May 3. ",
        "The series follows Ed after he learns of life-changing news and reveals his hardships and triumphs during the most challenging period of his life. Blending a never-seen-before personal archive, interviews with his wife and loved ones, and intimate performances, the series widens the lens to unearth what Sheeran thinks of the world, of himself and his music. Much of the programme is dedicated to his wife's health woes as well as how she helped Ed when he was struggling with his mental health issues.  Now, MailOnline tells you everything you need to know about Ed's wife Cherry.  ",
        "When did Ed Sheeran meet Cherry Seaborn? The pair first met at the age of 11 while attending Thomas Mills High School in rural Suffolk.Cherry, in the year below him, stood out for her natural ability at hockey and Ed for his obvious musical talent. While the pair parted ways after high school they reconnected in New York City in 2015 and started dating shortly after.The key to relationship's success seems to be their humble Suffolk roots. Cherry grew up in a charming period property in a village outside Framlingham with her mother Ann, father Matthew, an architect, and younger brother. Charlie is in the same business as his brother-in-law-to-be, writing film and theatre music. ",
        "Meanwhile, Ed lived with mum and dad, Imogen and John, and brother Matthew, in Framlingham, but dropped out of school at 16 to seek his fortune as a singer. At the outset he busked and slept rough under an arch near Buckingham Palace. When did Ed Sheeran and Cherry Seaborn get married? Two years after they started dating, Ed proposed to Cherry in 2017. He broke the happy news to his then 19 million followers on Instagram with a sweet, again low-key photo of them embracing. He wrote: 'Got myself a fiancé just before new year. We are very happy and in love, and our cats (Dorito and Calippo) are chuffed as well.' The following year the couple tied the knot in a low-key ceremony a few days before Christmas.A source said: It was very quiet – just Ed's oldest school pals, limited family and the priest.'There were only 40 people – so no Taylor Swift, record company executives or any royals or pop star pals. He wanted no fuss and he wanted it to be something entirely for them – just a tiny winter wedding.'Neither of them were that fussed about making a big deal about it. Cherry just wanted to get it out of the way without any problems or intrusions.'",
        "Do Ed Sheeran and Cherry Seaborn have any children? Ed and Cherry are the proud parents of two daughters. They welcomed their first child in August 2019, announcing the news with a sweet Instagram post that revealed they'd called her Lyra Antarctica Seaborn Sheeran.Alongside a picture of Lyra's booties and a colourful blanket, he wrote: 'Ello! A quick message from me as I have some personal news that I wanted to share with you...'Last week, with the help of an amazing delivery team, Cherry gave birth to our beautiful and healthy daughter - Lyra Antarctica Seaborn Sheeran.'We are completely in love with her. Both mum and baby are doing amazing and we are on cloud nine over here.'We hope that you can respect our privacy at this time. Lots of love and I’ll see you when it’s time to come back, Ed x.Speaking about the reason behind his daughter's name, the Shape Of You hitmaker later revealed: 'I realise some people think it's a strange and weird, but my wife is called Cherry and I think she's the only Cherry I've ever met and I think we wanted to give her a name that was unique.'And we went to Antartica when tour finished so that was always on our list. We went down there at the end of 2019 and it was just incredible the most amazing place on earth.'",
        "In May 2022, Ed revealed that he and Cherry had secretly welcomed another daughter, Jupiter Seaborn Sheeran, announcing he was 'over the moon to be a family of four.'    He shared a snap of white pair of baby booties, that he captioned: 'Want to let you all know we've had another beautiful baby girl. We are both so in love with her, and over the moon to be a family of 4 x' The couple reportedly only confided in their closest family members about the pregnancy.Ed's spokesperson confirmed: 'Ed and Cherry recently welcomed a beautiful baby girl and are on cloud nine.'They're so excited for Lyra to have a little sister and the four of them are currently enjoying some precious family time before Ed heads back on tour.'We are delighted for them, and we hope that you can respect their privacy at this special time.'",
        "Does Cherry Seaborn have cancer? In March 2023, Ed revealed Cherry was diagnosed with a tumour during her pregnancy with their second child. He admitted that the couple were plagued with 'fear, depression and anxiety' because Cherry couldn't receive any treatment until after she'd given birth. In Ed's docu-series, Cherry said: 'Long story short, I got diagnosed with cancer at the start of the year, which was a massive s**tter, but it made me massively reflect on our mortality.'",
        "On battling cancer, she added: 'I was saying to Eds, I'd never have agreed to do anything like this before — never, ever, ever — but it made me think this whole year, if I died, what's people's perception of me?'What am I going to leave behind? It genuinely wasn't until this year when I was just like, \"I might die\".'What is Cherry Seaborn's job? Cherry earned a degree in molecular biology and represented England in the Under-21 hockey team. After completing her science degree at Durham University, she travelled to America to take a qualification at the Master of Management Studies programme at Duke University in North Carolina. This allowed her to pursue her passion for hockey as part of the university’s prestigious Blue Devils hockey team. She works as a senior consultant in risk advisory at prestigious accounting firm Deloitte but is said to have taken an 'unlimited sabbatical' in order to concentrate on raising her children. ",
        "Where do Ed Sheeran and Cherry Seaborn live? Ed and Cherry mainly stay at his £3.7million Suffolk estate, dubbed Sheeranville, which he purchased in 2012.The award-winning artist has slowly accumulated five properties on the land as well as a football pitch, an orchard, an outdoor kitchen, entertainment area and a 'wildlife pond', which has been the subject of complaints in recent years.",
        "Yet his country pile isn't his only home as the singer boasts a whopping £57million property portfolio consisting of 27 flats, houses and mansions. It is in London that he owns the most properties, and back in 2020 it was reported he had splashed a further £10million on the London property marker.The global pop star now has enough properties to fill a Monopoly board.Five assets in the capital were incorporated into Ed's vast 'Edopoly' property empire, taking the number he owns in London up to 22.Alongside his sprawling Suffolk estate is a mansion in London along with two properties in Covent Garden and a pair of flats in Battersea. His latest additions include two properties on Floral Street in Covent Garden, and a pair of flats by the Battersea Dogs and Cats Home down Palmer Road. These four homes alone are thought to be among his most expensive, with conservative estimates putting them at a total value of £9million.Ed also owns five apartments in Wiverton Tower in Whitechapel worth £3.9million and a mansion in Holland Park valued at nearly £20million.The Shape of You singer has another four properties in Holland Park worth £11million, and a trendy Portobello Road restaurant called Bertie Blossoms which will soon be converted into a pub.MailOnline previously reported that Ed bought several Notting Hill properties to prevent complaints about 'loud music and parties'. ",
        "Has Ed Sheeran ever written any songs about Cherry Seaborn? Ed has revealed his wife has inspired much of his music, with her health woes last year sparking many of the songs on his album, subtract. Speaking about her cancer diagnosis, Cherry confessed: 'We had the diagnosis of the tumour and the next day Eds went down into the basement and wrote seven songs in four hours.'Some people write a diary and get their emotions out through the pen and, for Eds, if something really intense happens, he'll go and write a song.'Ed previously revealed: 'Writing songs is my therapy. It helps me make sense of my feelings. I wrote without thought of what the songs would be, I just wrote whatever tumbled out. 'And in just over a week I replaced a decade’s worth of work with my deepest darkest thoughts.'Subtract is the final in his decade-long mathematical series - which follows 2021's Equals, 2017's Divide, 2014's Multiply and 2011's Plus. Who are Ed Sheeran and Cherry Seaborn's celebrity friends?  Ed and Cherry's little black book rivals some of society’s most prolific networkers. Sir Elton John, former U.S. president Bill Clinton, Princess Beatrice and actress Jennifer Aniston are among those the pair count as friends. Unlikely pals, but Ed and Wayne Rooney have become firm friends thanks to a shared love of drunken crooning.First meeting at Coleen Rooney’s urging when the footballer went to one of Ed’s shows in Manchester in November 2015, the pair then took their respective entourages out for the night.Harry Styles has been best buds with Ed since he was hired as one of the band’s songwriters.In 2012, they each had tattoos relating to the children’s TV character Pingu. Tattoo artist Kevin Paul said: ‘When they were drunk, Harry and Ed discovered they both liked Pingu as kids, so one had the word and the other had the picture.’Of all his famous friends, perhaps the relationship that is the deepest is with Taylor Swift.Their connection was pretty much immediate, and Ed decided to buy a ranch near to her property in Nashville.He explained: ‘We were both the uncool kids… we’re outsiders who found solace in music.’"
    ]
}