{
    "articleURL": "/wires/aap/article-12047823/Adelaides-defence-worry-ahead-eliminator-Veart.html",
    "content": [
        "Adelaide United coach Carl Veart admits defence is a concern as his side prepares for an A-League Men elimination final against Wellington.",
        "The Reds have the worst defensive record, by goals conceded, of all six finalists.Adelaide leaked 46 goals during the regular season, and let in eight in their last two games before the playoffs which start on Friday night when Veart's troops host the Phoenix.\"It has been a concern over the course of the whole season,\" Veart said.\"It is something we have been working on collectively, it's just not the defence, it's the whole team.\"And that was the issue last week, we just gave them far too much time on the ball.\"Last week was a 4-1 loss to Central Coast; the week prior was a 4-4 draw with Perth.Those results came in a four-game stretch to the finals when Adelaide logged two defeats and two draws, following a 12-game unbeaten run.\"People will talk about last week but we finished third, the best finish we have had as a club for seven years,\" Veart said.\"We have had a fantastic season and (in the finals) we have to make sure we are playing the football we have all season.\"You don't need motivation for finals games.\"They're games that big players stand up and they're also games where players can make a name for themselves.\"I know the team wants to have success and it's important that we just carry on and have that belief that we have had all season.\"",
        "Adelaide took home-ground advantage after finishing third while sixth-placed Wellington also experienced their own defensive worries, conceding 45 goals this season.The ALM playoffs continue on Saturday night when Western Sydney - boasting the best defensive record of the top six by conceding just 27 goals - meet arch-foe Sydney FC in another elimination final.The winners of the eliminators will face table-toppers Melbourne City and Central Coast in a two-legged semi-final."
    ]
}