{
    "articleURL": "/tvshowbiz/article-12054477/Love-Islands-Mallorcan-villa-undergoes-facelift-including-new-look-firepit.html",
    "content": [
        "Love Island's Mallorcan villa is having a facelift ahead of the launch of the next series hosted by Maya Jama in a few weeks.",
        "The summer version of the dating show will be returning on June 5 according to the Sun, and in preparation for the arrival of more contestants, workers are giving the villa an overhaul.Updated features in the huge space will include a revamped fire-pit and new decking as well as a different kitchen. It is likely that the new firepit area will add extra drama to the upcoming series as the singletons enjoy parties and endure recouplings. The renovations come after the winter Love Island wrapped on March 13 after beginning on January 16.",
        "A source said of the new series: 'This series will be eight weeks long, meaning the couple who win the show will be in the villa for two months.'It comes after Love Island's Maxwell Samuda  finally spoke out on the real reason he split from girlfriend Olivia Hawkins.The pair coupled-up during this winter's series but left the season just days before the final.They decided to go their separate ways just a few weeks after arriving back in the UK, with some programme fans accusing them of having a showmance.However, Maxwell, 24, insisted they simply drifted apart once they returned from South Africa, where the show was filmed, insisting 'other things' took his attention away from their union.",
        "He told the Murad Merali Podcast: 'The main thing I would say with the whole situation, when you're in the villa and even just after the villa but you're still in South Africa together, it's a very different environment.'All that you have to focus on in that period of time is each other and kind of just being on holiday together and it's kind of easy to have a great time when you're on holiday.'But once you come back home and there are all these other things going on that then take your attention and take your focus.'",
        "Maxwell added that he wasn't sure he saw the pair together far in the future, explaining: 'It really gives you the opportunity to look at it and think is there really longevity in this situation or is it that we've connected and really got on but outside in the real world we're just not too sure if it has that same longevity to it.'It comes after Maxwell and Olivia, 27, became the second couple from this year's winter series to break up just weeks after leaving the villa in March.The ring girl and the finance student were said to have gone their separate ways after 'naturally drifting apart'.It came after Casey O'Gorman and Rosie Seabrook became the first couple from the 2023 winter series to split up.",
        "Olivia and Maxwell reportedly had a conversation about their relationship and decided to split up, but remain on 'good terms'."
    ]
}