{
    "articleURL": "/wires/ap/article-12060103/Ex-Neo-Nazi-guilty-2017-slayings-Florida-roommates.html",
    "content": [
        "A former member of a neo-Nazi group pleaded guilty Monday to fatally shooting his two Florida roommates in 2017, abruptly avoiding the start of a murder trial in which he had planned to use the insanity defense, according to court records.",
        "Devon Arthurs, 24, pleaded guilty to two counts of second-degree murder and will serve a 45-year prison sentence. The plea deal with prosecutors means Arthur will not face a possible life sentence.\"This defendant committed a cold and calculated crime and for that he will spend the majority of his life in prison,\" said State Attorney Suzy Lopez in a statement. \"The victims´ families are satisfied with this outcome which allows them to avoid a painful trial while knowing the defendant will have to dwell upon the pain he has caused for the next several decades behind bars.\"Arthurs admitted killing the roommates, Andrew Oneschuk, 18, and 22-year-old Jeremy Himmelman, nearly 6 years ago at the Tampa apartment they shared. Arthurs told police after his arrest that all three had been part of a small, mostly online neo-Nazi group called the Atomwaffen Division and that he shot the pair with an assault-style rifle because they ridiculed his conversion to Islam.Inside the apartment the men shared, authorities said they found guns, ammunition and bomb-making material, along with a framed picture of Oklahoma City bomber Timothy McVeigh on a bedroom dresser. Atomwaffen is German for \"nuclear weapons.\"A third roommate and Atomwaffen co-founder, Brandon Russell, was not home when the slayings happened but found the bodies when he returned from duties with the National Guard, investigators said. Russell pleaded guilty in September 2017 to federal charges of possessing illegal firearms and a destructive device, as well as storing explosives illegally.",
        "The bomb-making materials -- including the highly explosive substance HMTD, several pounds of ammonium nitrate and homemade fuses -- were discovered during the murder investigation. Arthurs told police the group planned terrorist attacks, possibly against nuclear plants.\"I prevented the deaths of a lot of people,\" Arthurs said in a rambling statement after his arrest. Asked why his roommates would plan such an attack, he responded, \"Because they want to build a Fourth Reich.\"Russell was sentenced to five years in prison on the weapons and bomb charges. After his release, he was charged in a new case earlier this year with plotting with a Maryland woman to attack Baltimore's power grid in an attempt to stir racial unrest. Prosecutors said that plan was to target five substations situated in a ring around the majority-Black city. No attack took place.Russell and his co-defendant, Sarah Beth Clendaniel, have both pleaded not guilty in Maryland federal court and are awaiting trial.As for Arthurs, his case was delayed several times while he received mental treatment after being declared incompetent to stand trial in 2018 and again in 2020. Finally, in June 2022, a Hillsborough County judge determined Arthurs had restored his mental capacity sufficiently to stand trial.\"I feel I can be an advocate against extremism,\" Arthurs said in court on Monday, according to the Tampa Bay Times. \"I´d like to take this moment to tell the world to stay away from extremist groups. ... I´m very sorry for everyone that was involved. I´m very sorry for everything that has happened.\"",
        "Arthurs was first arrested shortly after the shootings - which police did not yet know about - while holding several people at gunpoint and making rambling statements at a local smoke shop. Doctors diagnosed Arthurs with schizophrenia, autism and other mental illnesses."
    ]
}