{
    "articleURL": "/tvshowbiz/article-12054333/Tammy-Hembrows-ex-fianc-Matt-Poole-reveals-hes-new-relationship.html",
    "content": [
        "Matt Poole has revealed that he's in a new relationship. ",
        "The former fiancé of influencer Tammy Hembrow made the confession in a now-deleted Instagram comment obtained by the Influencer Updates account. Asked if his latest selfie was for his Tinder profile, the 34-year-old Ironman replied: 'I don't need Tinder. I'm happy with the new upgrade'. Matt appeared to think better of the brutal swipe, which was deleted from his account as of Saturday evening. It comes after Tammy revealed in March why she really split with Matt. ",
        "The 28-year-old replied to a fan who asked 'What happened with you and Matt?' in the comments underneath her recent TikTok video. 'Some people are just not meant to be together no matter how hard they try. We are much better as friends. Not that it's anyone's business' she wrote. Tammy had earlier let slip that she Matt broke up just seven months after the birth of their daughter Posy.Late last year, the fitness influencer shared the sad news during a photoshoot in Sydney.",
        "She confessed it was 'tough work being a single mother of three,' according to one of the makeup artists on set.The source told Daily Mail Australia: 'Tammy said she and Matt split a little while ago and that he was now doing his own thing - which is why she brought her baby Posy daughter to set'. ",
        "'Tammy said they were doing the best to keep a friendship while sharing their little one'. It comes after Tammy hit back at a fan when asked if she and ironman Matt have split.When asked why Matt hadn't featured in any of her recent YouTube videos, Tammy replied: 'That's just a part of my life I'm choosing not to share anymore.'",
        "'And out of respect for everyone and for my kids I just don't feel like I need to give an explanation.'Back in October, the fitness influencer unfollowed the former athlete despite them being seen together the weekend prior. Speculation of their breakup came after Matt had been notably absent from Tammy's recent outings and Instagram feed.It was first rumoured the couple had split in August, just three months after welcoming their daughter Posy in June.The pair began dating in 2020 and became engaged in November 2021.Just two weeks after revealing they were engaged, they announced they were also expecting their first child together.Tammy also shares son Wolf, six, and daughter Saskia, five, with her former fiancé Reece Hawkins."
    ]
}