{
    "articleURL": "/tvshowbiz/article-12048711/Im-Celebrity-South-Africa-Tensions-rise-Joe-Swash-Dean-Gaffney-risk-sending-home.html",
    "content": [
        "Tensions look set to rise in the I'm A Celebrity South Africa camp as Joe Swash and Dean Gaffney will put someone at risk of going home.",
        "In a preview of Friday's episode, the campmates were told that whoever team captains Joe and Dean nominated for the next challenge would be at risk of getting the boot from camp.The celebrities looked stress as hosts Ant McPartlin and Declan Donnelly broke the news, but who they will choose remains to be seen.Paul Burrell was heard saying: 'My time is coming,' before Joe said: 'I'm going to have to pick my strongest team.'Former EastEnders star Dean was also seen putting his face in his hands as he fretted over the results of his decision. ",
        "Elsewhere during the episode, Joe likened campmate Fatima Whitbread to his wife Stacey Solomon as they can both order him around without him realising.During Friday's episode, Fatima woke up Joe while the campmates were asleep and asked him to put logs on the fire.The former EastEnders actor obliged and got out of bed but admitted in the Bush Telegraph he didn't understand why Fatima couldn't just put the logs on herself if she was already awake.However, soap star Joe said he did as she asked as he has a 'soft spot' for the former Olympic athlete. He said: 'If you're awake, just chuck the wood on the fire? But it's Fatima, she gets away with it. I do feel love for Fatima.'",
        "Fatima later dished out which campmates would handle the daily chores and wrote them all out on a witeboard.The former javelin thrower went around to each campmate and explained why she had given them each task.In the Bush Telegraph, Joe said: 'Stacey's the only other woman who could boss me around in a really nice way and without me realising I'm being bossed around, which is really clever.'",
        "The actor first appeared on the ITV reality show in 2008 where he was crowned King of the Jungle.Joe, who shares Rex, three, and Rose, 17 months, with Stacey, 33, as well as Harry, 16, with his ex-partner Emma Sophocleous, is going back in for the sake of his children. Former X Factor finalist Stacey also won 2010's series, beating Shaun Ryder to the top spot, and went on to host the Extra Camp after show with Joe."
    ]
}