{
    "articleURL": "/news/royals/article-12052483/The-longest-serving-heir-history-crowned-King-Charles-embraces-day-destiny.html",
    "content": [
        "The ceremony will embrace and emphasise the diversity of modern-day BritainAfter a walkabout today, the couple retired to enjoy a private dinner at homeHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk He has been waiting more than 70 years for this moment.",
        "And King Charles III is now ready to finally embrace his day of destiny with the woman he loves by his side.The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.'There will be all the pomp and ceremony you could dream of, but as little of the 'them and us' as possible,' one senior royal aide said last night.Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.",
        "The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary's Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to 'pace herself' and also ensure 'the day was about her husband', sources said.'She loves him unconditionally and always wants him to shine,' a friend said.",
        "Last night the couple retired to enjoy a private dinner at their London home, Clarence House.'The calm before the storm – perhaps metaphorically as well as literally', a friend said with a nod to the dismal weather forecast, something the new King and Queen's celebrations have in common with the late Queen's Coronation in 1953.It came as:Prime Minister Rishi Sunak hailed the Coronation as a 'moment of extraordinary national pride';The Archbishop of Canterbury, who will anoint and crown the couple tomorrow, predicted that people will be 'struck by the majesty and sacred wonder of the service';The King, accompanied by his son and daughter-in-law the Prince and Princess of Wales, shocked and delighted well-wishers camping out along The Mall with an impromptu walkabout yesterday;A relaxed-looking Charles smiled broadly and threw his hands in the air when he was asked if he was feeling the strain, telling one fan: 'It's people like you that count';Kate said she and her children were 'excited but nervous' – and she even spoke on the phone to a fan's aunt in Tennessee who was unable to fly over after breaking her leg;The King and his family entertained dignitaries and world leaders at a series of events, including a glittering reception at Buckingham Palace last night for overseas VIP guests including King Felipe and Queen Letizia of Spain, the Sultan of Brunei, Crown Prince Frederik of Denmark, and the King and Queen of Jordan;Prince Harry arrived in the UK ahead of his 'blink and you'll miss it' appearance at the Coronation ceremony, but there are no plans for him to feature in any of the private family celebrations or official portraits;Forecasters warned the weather for today looks unsettled, with heavy rain predicted at times, which could threaten the planned 60-aircraft flypast over Buckingham Palace.",
        "Today's Coronation will see 7,000 servicemen and women accompanying Their Majesties, making it the country's biggest ceremonial event since 1953.",
        "Indeed, the Coronation procession back from the Abbey after the ceremony is so large that when the King and Queen arrive at Buckingham Palace, the rear will only have reached Downing Street, more than a mile away.The 2,300-strong congregation will include representatives of 39 Commonwealth nations and 100 heads of state, as well as many hundreds of ordinary citizens who have selflessly served their country and communities – in a stark divergence from Queen Elizabeth's Establishment-heavy Coronation of 1953. Peers have been replaced in key roles with people of a range of faiths and creeds to emphasise the country's diversity and religious tolerance, as well as women bishops and charity and military representatives.Inside the historic place of worship, the King will, for the first time, recite a specially written public prayer and pledge his allegiance to his people as he is invested with the glittering regalia of the Crown Jewels, which normally reside in the Tower of London.",
        "The moment of his anointing will take place behind a three-sided screen to preserve the moment of solemnity between him and God.Prince William, who was yesterday seen at rehearsals wearing his Order of the Garter robe, will kneel and pledge allegiance to his father, before Charles has the St Edward's Crown placed on his head by the Archbishop of Canterbury and the spine-tingling cry of 'God Save The King' rings out.",
        "The King and Camilla – who will arrive without their crowns as a sign of humility – will depart in the 261-year-old Gold State Coach, wearing the Imperial State Crown and Queen Mary's Crown.",
        "The Princess Royal will ride on horseback behind Charles and Camilla in her role as Gold Stick in Waiting and Colonel of the Blues and Royals.In the first carriage behind the Gold State Coach will be the Prince and Princess of Wales with George, nine, Charlotte, eight, and Louis, five. The next carriage will contain the King's youngest brother, the Duke of Edinburgh, with his wife the Duchess of Edinburgh and their two children.The late Queen's cousin the Duke of Gloucester and his wife the Duchess of Gloucester, and Anne's husband Vice Admiral Sir Tim Laurence will travel in the third carriage. Following by car will be the Duke of Kent and Princess Alexandra, also cousins of Elizabeth II. There is no place in the procession for the Duke of Sussex and the Duke of York – who play no formal part in the Coronation ceremony – nor for Andrew's daughters, Beatrice and Eugenie.",
        "Shortly before 2.30pm, the King and his family will make their first appearance on the balcony of Buckingham Palace to greet thousands of well-wishers before a six-minute fly-past involving 60 aircraft including the Battle of Britain Memorial Flight and the Red Arrows, weather permitting.While monarchs have historically held lavish state banquets, the family will then retire for a 'running buffet lunch' and nothing more exotic than a 'nice cup of tea' while they have their official portraits taken in the Throne Room and Green Drawing Room.It has been suggested that the family may make another appearance later. Tomorrow, members of the Royal Family will join 'Big Lunches' across the country as communities come together to celebrate the occasion, before the Coronation Concert at Windsor Castle in the evening, with headline acts including Lionel Richie and a spectacular lighting up of the nation using light displays, lasers and drones.",
        "The Coronation bank holiday weekend will conclude on Monday with The Big Help Out, when members of the Royal Family will join volunteers working with local community organisations as part of an initiative to create a lasting legacy from the celebrations. Charles and Camilla, however, will leave for their Sandringham estate in Norfolk for a well-earned break.The Duke of Norfolk, who is organising the ceremony, said: 'The Coronation is an opportunity to bring our great nation, the realms and the Commonwealth closer together, plugging into the power of the past and promoting our shared values to the wider world with all that we have to offer.'",
        "Mr Sunak said the weekend would be a chance to reflect on the 'enduring nature of monarchy' and urged the nation to celebrate its history and culture.The Prime Minister added: 'Let's celebrate this weekend with pride in who we are and what we stand for. Let's look to the future with hope and optimism. And let's make new memories, so we can tell our grandchildren of the day we came together to sing God Save The King.'"
    ]
}