{
    "articleURL": "/wires/pa/article-12051267/Jurgen-Klopp-expects-Liverpool-miss-Champions-League-season.html",
    "content": [
        "Liverpool manager Jurgen Klopp admits even extending their five-match winning run is unlikely to affect the top-four sides they are chasing and he expects to miss out on Champions League football next season.",
        "Wednesday’s victory over Fulham, combined with Manchester United’s late defeat to Brighton, meant the gap to fourth place in the Premier League is four points.However, United have a match in hand, from which they could overtake Newcastle two points ahead, while Liverpool also face pressure from below with Brighton four points behind with two games in hand.“Other teams are in much better positions. As long as they win games, we have no chance and we have to keep teams behind us, which (for) not all of them we can do that,” said Klopp“We have 59 (points), United has 63 so we can get 71 maximum. United needs for that eight points in five, (eight points) from 15. I think they will do that.“They win three games of the rest and that is it for us.”While their current run is the best for more than a year, the cracks are starting to appear in the squad again.Midfielder Thiago Alcantara is having surgery on a troublesome hip injury in order to ensure he is fit for pre-season, while captain Jordan Henderson could miss Saturday’s visit of Brentford.",
        "Thiago was absent for two months with his problem and although he made a brief comeback in April, he has missed the last two matches and the club have decided it is best for him to get it sorted now.",
        "“Thiago will have surgery and is out for the rest of the season. It’s the same issue he was recently out for a couple of months with,” said Klopp.Asked whether he would be ready for pre-season, the manager added: “Yeah. That is why we do it now.”Liverpool are awaiting the results of a scan on Henderson but he could miss the visit of Brentford with the minor problem.“Hendo I have to see; a scan yesterday will not be a big thing but maybe enough to rule him out tomorrow.”Liverpool have confirmed they will play the national anthem ahead of Saturday’s evening kick-off despite expected opposition from home fans.Supporters have regularly booed the anthem, such as before cup finals, in defiance at their long-standing resentment against the establishment due to the city’s political background and, more recently, in relation to the handling of the Hillsborough disaster and the fight for justice.Liverpool feel they have been put in an impossible position by the Premier League’s suggestion the anthem is played and although have they taken the “tough” decision to play the anthem, they believe in safe freedom of expression and are aware the response may not be favourable.During Wednesday’s win over Fulham the Kop sang “You can stick your coronation up your a***”.",
        "“The club’s position is my position. That is clear. Besides that, this is definitely a subject which I cannot really have a proper opinion about,” said Klopp.",
        "“I am from Germany, we don’t have a king or a queen, I am 55 years old and I have no experience of that.“Watching from the outside, it is a nice thing to watch when all the weddings are massive things in Germany but no one really knows what it is like. It is like watching a movie. We don’t feel that.“I am pretty sure a lot of people in this country will enjoy the coronation. Some will not be interested and some will not like it. That is it and that is over the whole country.”"
    ]
}