{
    "articleURL": "/wires/ap/article-12047709/Michigan-transfer-Dickinson-headed-Kansas-season.html",
    "content": [
        "LAWRENCE, Kan. (AP) - All-American forward Hunter Dickinson, arguably the top player in the transfer portal after deciding to leave Michigan, said in a social media post Thursday that he was headed to Kansas for the upcoming season.",
        "Dickinson chose the Jayhawks after visits to Villanova, Kentucky, Maryland and Georgetown.The 7-foot-1 center led the Wolverines to a No. 1 seed in the NCAA Tournament and a trip to the Elite Eight as a freshman during the 2020-21 season. Dickinson averaged 18.6 points in helping them reach the Sweet 16 two years ago and 18.5 points and a career-best 9.0 rebounds last season, when he was voted an honorable mention All-American.\"The initial decision for me to enter the portal was the hardest decision I´ve ever had to make,\" Dickinson said in confirming Wednesday night that he would not return to Michigan, which had been a possibility. \"The thought of potentially leaving the place I love and called home for three years was and is extraordinarily difficult to process. After conversations with my family and a lot of time in thought, I realized entering the portal was the best decision for myself and my future.\"Dickinson had been quiet throughout his closely watched recruitment, though he did say on the \"RoundBall\" podcast this week that deciding where he would play next season had been weighing heavily on him.\"If I knew where I was going, I would have happily made the decision sooner,\" he said. \"I really am struggling trying to pick a school. The good thing about all this is, all my options, I feel like if I went there, I would succeed. But it´s just trying to figure out which one out of them is the best and the one I´m most comfortable at, stuff like that.\"",
        "Turns out that answer was Kansas.With him in the fold, the Jayhawks suddenly become one of the national title favorites heading into next season. They return starting point guard Dajuan Harris Jr., versatile forward KJ Adams and have added former five-star guard Arterio Morris from Texas and Towson sharp-shooter Nick Timberlake to go with one of the nation's best freshman classes.Elmarko Jackson and Jamari McDowell are 6-foot-3 guards capable of running the point or playing off the ball, Chris Johnson is a touted 6-6 wing and Markus Adams Jr. is a 6-8 inside-outside forward. Jackson and Johnson are both top-10 prospects.___AP college basketball: https://apnews.com/hub/college-basketball and https://apnews.com/hub/ap-top-25-college-basketball-poll and https://twitter.com/AP_Top25"
    ]
}