{
    "articleURL": "/news/article-12047805/Billionaire-megadonor-Peter-Thiel-says-DESANTIS-2024-supporting-Trump.html",
    "content": [
        "Thiel said this week that he will 'strongly' support Ron DeSantis in 2024 after previously backing former President Donald Trump Warned the Florida governor against leaning in too much on anti-woke agenda'I do worry that focusing on the woke issue as ground zero is not quite enough'Peter Thiel said he would support Florida Gov. Ron DeSantis if he makes it to the general election in 2024.",
        "DeSantis has not yet announced a bid for the White House in 2024, but is expected to do so in the next few months as he continues to traverse the nation on his book tour sharing his 'Florida Blueprint' with America.Thiel warned DeSantis, however, not to lean too much into the fight against leftist 'woke-ism'.People close to Thiel told Reuters last month that the billionaire Republican megadonor was not planning to wade into the waters of the 2024 election.However, his comments this week are to the contrary of that. ",
        "The individuals also noted that Thiel is becoming increasingly dissatisfied by the shift in the party to focusing on attacking 'woke' ideology.'I think DeSantis would make a terrific president if he's the Republican nominee,' Thiel said on the Honesty with Bari Weiss podcast this week. 'I will strongly support him in 2024.'But I do worry that focusing on the woke issue as ground zero is not quite enough,' he added. 'The focus on identity politics, on the woke religion, is probably a distraction from stagnation. It's a distraction from economics.'The warning could be hard for the Florida governor to heed considering he has made the fight on woke a cornerstone of his agenda.DeSantis has repeatedly said since his second inauguration earlier this year that 'Florida is where woke goes to die.'",
        "He has also waged a war with Walt Disney Co. over what he calls the 'corporate kingdom' and its push for a woke agenda.Like many Republicans, DeSantis opposes corporations engaging in environmental, social and governance (ESG) investing. Rather, conservatives want companies and businesses not to be able to use their money, power and voice to influence what they feel should be governed by politicians.The Sunshine State has put forward one of the most conservative agendas in the nation with its supermajority Republican legislature.Just this week Florida passed a bill highly criticized by liberals. It expands the Parental Bill of Rights by now prohibiting classroom instruction on sexual orientation and gender identity through 8th grade. It also bans teachers from using transgender students' preferred pronouns and makes the process easier for people to get books removed from school shelves.",
        "Thiel financially backed Trump in his 2016 presidential run and was even a delegate during the first White House bid.DeSantis has so far emerged as the only candidate that could give Trump a battle in 2024. No other announced or potential candidates have been able to earn double-digit support in hypothetical primary election polls.Besides Trump, announced candidates so far are former South Carolina Gov. and ex-Ambassador to the UN Nikki Haley, former Arkansas Gov. Asa Hutchinson, biotech multi-millionaire Vivek Ramaswamy and conservative radio host Larry Elder.",
        "South Carolina Sen. Tim Scott launched a presidential exploratory committee last month and is set to 'make a major announcement' in Charleston on May 22."
    ]
}