{
    "articleURL": "/news/article-12057517/Megyn-Kelly-tells-Dems-theyve-LOST-gun-debate-blames-ruining-chance-change.html",
    "content": [
        "Kelly said that Democrats are preventing pragmatic solutions to gun violence 'You've failed to effect change. Please face it,' she added after eight died in TexasThe former Fox host demanded more serious mental health interventions SiriusXM radio host Megyn Kelly weighed in on the Texas mass shooting this weekend by claiming Democrats have lost the debate on gun control and are preventing more pragmatic solutions.",
        "Mauricio Garcia, 33, killed eight people - including children - before he was shot dead at Allen Premium Outlets on May 6. Kelly, a former Fox News host and NBC correspondent, admonished gun control advocates in a Twitter rant Sunday morning. 'You've failed to effect change,' Kelly wrote. 'Please face it. You can't do it, thanks to the 2A. We're all well aware you don't like that fact, but fact it is. What next? Must we just stay here sad, concerned, lamenting? Could we possibly talk OTHER SOLUTIONS?'She then suggested 'mental health interventions, greater willingness' to lock up those who are threats, 'fortification of soft targets' and a demand for media to not 'lionize shooters' as a solution. ",
        "When pushed further, she wrote: 'We need a mental health facility that is secure (guards/locked down) but still humane enough that a loving parent would send her kid there, for one. Right now parents who know they’re raising the next school shooter have next to no recourse.'People were divided on social media about Kelly's take, with gun control advocate Fred Guttenberg - who lost a child in the Parkland massacre - telling Kelly to 'F off.'  'I am sick and tired of people like you embracing an ideology that actually makes the idea of saving lives and reducing gun violence into a debate. I remember when your team reached out after my daughter was killed in Parkland. Don't bother again.'",
        "Branden Durst agreed with Kelly however, saying: 'The gun debate is over. Those seeking to curtail the second amendment lost. Can we all just accept that guns are an intrinsic part of American life and try to find other solutions?' The killer fired more than 100 times during his rampage, and he had more ammunition and weapons in his car - which he was seen coming out of before the bloodbath.Garcia, dressed in tactical gear and armed with an AR-15 and a handgun, opened fire outside a H&amp;M store on a busy Saturday afternoon in Allen, Texas.   He was eventually killed by a police officer - who was on the scene for an unrelated call but rushed over when he heard the gunshots outside the H&amp;M.Garcia was a security guard, but it is unclear if he worked at Allen Premium Outlets.",
        "It's also believed that Garcia was living at a motel at the time of the massacre. Police also searched that residence and found additional ammunition, WSJ reports.According to the Washington Post, a patch the gunman was wearing on his chest alluded to his extremist ideologies - although no formal motive has been released. The patch read 'RWDS' which is an acronym for 'Right Wing Death Squads.'  This comes after new audio revealed how the heroic officer made a frantic phone call begging for his colleagues to join him on the scene, radioing: 'I need everybody I got.' ",
        "The officer bravely ran towards the active shooter - who was armed with 60 rounds and had shot more than a dozen people by this point - and killed him.About two minutes after first calling for backup, the cop said: 'I got him down.'  Minutes later, another voice is heard on the radio saying: 'We got victims. I need an ambulance.' The FBI and police raided dead Garcia's Dallas home just one hour after the massacre and requested a translator to speak with his family. Neighbors say they often saw Garcia wearing a security guard-type uniform, but he was 'very quiet' and had 'very unusual behavior.'His gray Dodge Charger, which was seen at the scene, was often parked outside the home.",
        "Dashcam video showed gunman Mauricio Garcia getting out of a car and shooting at people on the sidewalk on Saturday afternoon. More than three dozen shots could be heard as the vehicle that was recording the video drove off.Garcia was using an AR-15-style gun during the mass shooting, and was dressed in full tactical SWAT gear. Allen Fire Chief Jonathan Boyd confirmed that seven people died at the scene, including the gunman, and then a further two victims died in hospital. Three of the wounded were in critical condition in the evening, and four were stable, Boyd said in an update on Saturday night. ",
        "A Dallas-area medical group said it was treating victims as young as five-years-old. Fontayne Payton, 35, was at H&amp;M when he heard the sound of gunshots through his headphones. He said: 'It was so loud, it sounded like it was right outside.'I pray it wasn't kids, but it looked like kids,' he said. The bodies were covered in white towels, slumped over bags on the ground. 'It broke me when I walked out to see that.'",
        "Payton then saw the body of the dead shooter - which was the only one not covered, he recalled. Another witness, Kimberly Blakey, said she and her daughter, 14, were among the crowd of people rushing to flee the parking lot after the gunfire started.She said the raining bullets were 'non-stop.' Her car got shot at during the ordeal as she tried to escape. Blakey told CNN: 'I told my daughter to get down. I could hear her start praying.' Another witness, Sheliza Ramlall, who was in the Nike store when the violence broke out, said: 'I had the most horrifying experience earlier. I was standing in line at the Nike store when all of a sudden people started to scream and run. 'The people in the doorway saw the man with the gun outside and raised the alarm. All of us in line dropped to the floor and started to crawl looking for a hiding place while falling over each other. ",
        "'I crawled behind the counter. At that moment, I realized that we were right in plain sight and and figured that I needed to get away from the front. ",
        "'As I looked to the back of the store, I heard someone saying 'get to the back, get to the back' and everyone started running at that point. An employee opened the back door and let us out. We are standing by the roadside shaken, crying, and hugging each other.'Not knowing where the gunman was or what was happening on the other side was terrifying but I wanted to get out of there so I left the crowd and started to flag the cars down to give me a lift. 'An elderly woman stopped and I hopped in a panic. She started to tell me about the gunshots she heard and drove me to my car. I raced out of there with an elevated heartbeat. 'I am grateful for our brave first responders who stopped the shooter and helped the people to safety.'"
    ]
}