{
    "articleURL": "/wires/reuters/article-12055511/Mage-roars-stretch-edge-Two-Phils-win-Kentucky-Derby.html",
    "content": [
        "It wasn't quite a Rich Strike-style upset but Mage pulled off a big surprise in the 149th running of the Kentucky Derby.",
        "Mage, going off at 15-1, rallied in the stretch to edge Two Phil's and win America's most prestigious horse race at Louisville's Churchill Downs on Saturday.Mage, who finished second in the Florida Derby in his last start, was ridden by Javier Castellano. Trained by Venezuelan native Gustavo Delgado, Mage was making just his fourth career start.Angel of Empire, who went off as the 4-1 favorite, finished third.Last year's running was won by Rich Strike, who went off at 80-1 odds. Rich Strike snuck up the rail in the late going but Mage took a different route to the winner's circle, coming wide to catch Two Phil's. The runner-up, trained by Larry Rivelli and ridden by Jareth Loveberry, grabbed the lead at the top of the stretch but couldn't hold off Mage, who won by one length.For Castellano, a Hall of Fame jockey also from Venezuela, the Derby winner was a long time coming. This was his 16th Derby mount, the most of any active jockey without a Derby win.\"I never give up,\" he said. \"I always try hard to do the right thing, It took a little while to get there but we finally got it.\"Mage had the bloodlines to win the race. He's a son of Good Magic, who finished third behind Triple Crown winner Justify in 2018. His dam, Puca, was produced by 2008 Derby winner Big Brown.",
        "Mage won a seven-furlong sprint in his career debut in January at Gulfstream Park. He finished fourth in the Fountain of Youth prior to the Florida Derby.\"When I came to this country, my big dream was to go to the Kentucky Derby,\" said Delgado, who had three previous starters in the Derby. \"This time I was sure the horse was very, very good.\"Castellano rode Mage once before in the Fountain of the Youth. He paid $32.42 to win.\"The way he ran the last (two times) in the Fountain of Youth and Florida Derby, the way he finished second showed he had the potential to win the Kentucky Derby,\" he said.Mage will now move on to the second leg of the Triple Crown, the Preakness in Baltimore on May 20.The exacta with Two Phil's paid $330.44 and the $50 trifecta paid $491.18. Disarm finished fourth and all the early frontrunners were burned off by an unexpectedly fast pace, with fractions of 45 3/5 after four furlongs and 1:10 for six furlongs. The final time was 2.01.57 on a fast track.The second choice in the wagering, Tapit Trice, finished seventh.Morning line favorite Forte was scratched on Saturday morning. Forte, who won the Florida Derby in his last race, was removed from the field by state veterinarians due to a bruised right foot.",
        "A handful of scratches since entries were taken on Monday afternoon reduced the field to 18. Santa Anita Derby winner Practical Move, Lord Miles, Continuar and Skinner were the other scratches.--Field Level Media"
    ]
}