{
    "articleURL": "/news/article-12041727/Troops-arrive-train-London-Waterloo-station-Coronation-rehearsals.html",
    "content": [
        "For all the latest Royal news, pictures and video click here Members of the Armed Forces arrive on trains from stations including AldershotObservers witnessed 6,000 soldiers marching through London Waterloo station Commuters heading home from London Waterloo last night were treated to an extraordinary sight as some 6,000 soldiers marched through the railway station.",
        "Members of the Armed Forces arrived on trains from stations including Aldershot, near the Hampshire town's garrison, ahead of the overnight Coronation rehearsal.Observers described the scenes as 'genuinely extraordinary' with one comparing them to Helen Mckie's famous 'Waterloo Station War and Peace' paintings in 1948.Commuters described the soldiers' arrival as an 'unexpected surprise on the way home' and said it was 'not every day you see this' at Britain's busiest station.And the Coldstream Guards official Instagram page tweeted a picture of soldiers sat on a South Western Railway train carriage, with the caption: 'Tickets please.'",
        "Toby Joyce, from the 1st Battalion Coldstream Guards, tweeted a picture of himself smiling on the train and joked: 'The commute was interesting.' ",
        "Railway historian Tim Dunn said: 'I'm at London Waterloo to observe genuinely extraordinary scenes tonight as 6,000 armed forces staff arrive for Coronation rehearsal.'Scenes not seen for a generation and EXACTLY reflect Helen Mckie's 1948 famous 'War &amp; Peace' paintings pair. Some kind of glorious coincidence?'He added: 'Don't ever tell me that railway history isn't interesting. It's the history of us all, and those twin strips of steel still guide the events of now.'The posters by McKie were commissioned by Southern Railway for Waterloo's 100th anniversary, and represent the station in a bustling form during wartime.",
        "Guildford-based train driver Mark Devonshire said: 'Lots of action yesterday regards security at Ash Vale and Aldershot so had a slight suspicion something military related was happening.'Not many people would have known and for a good reason too, crew would have been asked and kept quiet so well done and an amazing scene.'Others on Twitter expressed surprise that members of the Armed Forces were wearing uniform in public, amid fears of a copycat attack ten years after the brutal killing of soldier Lee Rigby outside his barracks at Woolwich in south-east London in May 2013.It comes as the first glimpses of the Coronation were revealed overnight as rehearsals took place in Central London in the early hours.",
        "Hundreds of soldiers, many on horseback, marched down from Buckingham Palace past Trafalgar Square and Downing Street to Westminster Abbey.The Diamond Jubilee State Coach and Gold State Coach went down the Mall as part of the preparations for the full event on Saturday.The Diamond Jubilee State Coach was accompanied by hundreds of soldiers on horseback, setting off shortly after 12.20am today.Royal fanatics waited for over three hours for the parade to make a return journey down the Mall.Crowds ran through St James' Park to find the best spots near the palace with many trying to spot their relatives in their military outfits.",
        "Hundreds of soldiers from the military, navy and RAF marched through central London before stopping along Whitehall and standing in silence.",
        "Railway historian Tim Dunn compared the scenes at London Waterloo last night to Helen Mckie's famous 'Waterloo Station War and Peace' paintings duo in 1948.The posters were commissioned by Southern Railway for Waterloo's 100th anniversary, and represent the station in a bustling form during wartime. They have the tagline: 'Waterloo Station - A Century of Uninterrupted Service During Peace And War'One of the posters depicting war shows Guardsmen wearing khaki and a group in military uniform marching through the station.The other shows peacetime when soldiers are in their red dress uniforms where the Guardsmen stood, and a group of girls dressed for school can be seen in the place of military figures. The blackout across the station's roof is also gone.In both pictures, the station can be seen bustling with trains at their platforms, providing the narrative that the railways continued their vital work during wartime.",
        "Many carried a wide range of instruments such as saxophones, trumpets, horns and cymbals but only the drums were played by marching soldiers until they returned down the Mall after 3am.The parade had began when soldiers dressed in bright yellow uniforms began the short journey and the brass band on horseback practised as they accompanied the stage coach as it passed through Westminster.",
        "Onlookers skipped along next to the stage coach and ran after the regiments of mounted soldiers that followed.Soldiers from a wide variety of regiments marched down the Mall after 1am.Buckingham Palace remained mostly silent with soldiers quietly maintaining protocol until a regiment playing the bagpipes brought the area to life shortly after 2.30am.At least 15 tents are already positioned along the Mall and royal fans got to test their viewpoint as they prepare to camp out until Saturday.",
        "Other soldiers were spotted parading in Parliament Square and practised changing position as Big Ben chimed.Artillery regiments rehearsed moving cannons on horseback and soldiers were seen pretending to fire the ceremonial weapons.The procession returned to Buckingham Palace shortly after 3am with bands in full swing.The Gold State Coach was spotted passing Buckingham Palace shortly after 3.20am.MailOnline has approached the Ministry of Defence for comment on whether special trains were provided for the troops, or if they were on normal passenger services."
    ]
}