{
    "articleURL": "/wires/pa/article-12043011/Astronomers-spot-star-swallowing-planet-possible-preview-Earth-s-fate.html",
    "content": [
        "Astronomers have spotted a star devouring a planet in a possible preview of the ultimate fate of Earth.",
        "As a star runs out of fuel, it will billow out to a million times its original size, engulfing any matter – and planets – in its wake.While scientists have observed hints of stars just before, and shortly after, the act of consuming entire planets, they have never seen one in the act until now.In the new study scientists at MIT, Harvard University, Caltech and elsewhere report that they have observed a star swallowing a planet, for the first time. We are seeing the future of the Earth  Kishalay De, MIT Kavli Institute  The event appears to have taken place in our own galaxy, some 12,000 light-years away, near the eagle-like constellation Aquila.Astronomers spotted an outburst from a star that became more than 100 times brighter over just 10 days, before quickly fading away.",
        "This white-hot flash was followed by a colder, longer-lasting signal, according to the research published in Nature.Only one event – a star engulfing a nearby planet – could have produced this combination, the scientists suggest.Lead author Kishalay De, a postdoc in MIT’s Kavli Institute for Astrophysics and Space Research, said: “We were seeing the end stage of the swallowing.”Experts suggest Earth will meet a similar end to this planet, but not for another five billion years, when the sun is expected to burn out, and burn up the solar system’s inner planets.",
        "Dr De said: “We are seeing the future of the Earth.“If some other civilisation was observing us from 10,000 light-years away while the sun was engulfing the Earth, they would see the sun suddenly brighten as it ejects some material, then form dust around it, before settling back to what it was.”The planet observed in the new research is estimated to have been a hot, Jupiter-sized world that spiralled close, then was pulled into the dying star’s atmosphere, and, finally, into its core.The outburst was discovered in May 2020, but it took another year for the astronomers to piece together an explanation for what the outburst could be.The initial signal showed up in a search of data taken by the Zwicky Transient Facility (ZTF), run at Caltech’s Palomar Observatory in California.The ZTF scans the sky for stars that rapidly change in brightness, the pattern of which could be signatures of supernovae, gamma-ray bursts and other stellar phenomena.Dr De said: “One night I noticed a star that brightened by a factor of 100 over the course of a week, out of nowhere.“It was unlike any stellar outburst I had seen in my life.”He added: “For decades we’ve been able to see the before and after – before, when the planets are still orbiting very close to their star, and after, when a planet has already been engulfed, and the star is giant.",
        "“What we were missing was catching the star in the act, where you have a planet undergoing this fate in real time. That’s what makes this discovery really exciting.”Astronomers observed the first direct evidence of a dying star expanding to engulf one of its planets using the power of the Gemini South Adaptive Optics Imager (GSAOI) on the Gemini South telescope in Chile, one half of the International Gemini Observatory, operated by the National Science Foundation’s NOIRLab.This research was supported, in part, by Nasa, the US National Science Foundation and the Heising-Simons Foundation."
    ]
}