{
    "articleURL": "/wires/ap/article-12048837/State-charges-tossed-university-town-hate-crime-attack.html",
    "content": [
        "BLOOMINGTON, Ind. (AP) - State charges including attempted murder have been dismissed against a woman accused of stabbing an Indiana University student of Chinese descent on a public bus, court records show.",
        "Billie R. Davis, 56, of Bloomington, who is white, still faces a federal hate crime charge in the stabbing of the 18-year-old woman with a folding knife on Jan. 11. The victim from Carmel, Indiana, was waiting to exit the bus in downtown Bloomington, about 50 miles (80 kilometers) south of Indianapolis.Online court records show state charges of attempted murder, aggravated battery and battery by means of a deadly weapon were dismissed April 25. Davis had pleaded not guilty to the charges.Court records show defense attorney Jeffrey Kehr argued the facts supporting the state charges were the same as those behind the federal charge.A telephone message seeking comment was left Thursday for an attorney representing Davis in the federal case.Court records show Davis told police she stabbed the woman multiple times in the head with a folding knife, because it \"would be one less person to blow up our country.\"",
        "Asian Americans have increasingly been the target of racially motivated harassment and assaults in recent years, particularly since the coronavirus pandemic began, with many worrying that anti-Asian rhetoric linked to fraught relations between the U.S. and China could lead to more violence.An affidavit from a detective who reviewed bus surveillance footage said Davis stabbed the victim about seven times in the top of the head.",
        "\"Davis then folds the knife, puts it back in her pocket and returns to her seated position on the bus,\" according to the affidavit.Surveillance footage showed no interaction between the two women prior to the attack.Kyle Dugger, an attorney who represented Davis in the state case, said in a court motion in January that he was seeking an insanity defense on her behalf and that she \"is incapable of assisting in the preparation of her defense because of mental illness.\""
    ]
}