{
    "articleURL": "/tvshowbiz/article-12057971/Rebel-Wilsons-trainer-Jono-Castano-says-Ozempic-lazy-dangerous.html",
    "content": [
        "A high-profile personal trainer whose clients include Rebel Wilson and Rita Ora says people should think twice before using diabetes drug Ozempic to lose weight.",
        "Celebrities including Chelsea Handler, Remi Bader and Elon Musk have used Ozempic, also known as Wegovy, off-label to assist with weight loss.The drug was originally formulated for the treatment of type 2 diabetes, but is also being prescribed by doctors to treat other health conditions such as obesity, which is a serious chronic disease that is challenging to manage.Ozempic's use as a weight-loss drug has resulted in a worldwide shortage, which is particularly worrying for diabetics who need it.Sydney-based PT Jono Castano told Yahoo Lifestyle the use of Ozempic to shed the kilos is a 'lazy' and 'dangerous' trend that should be avoided at all costs.",
        "Ozempic contains semaglutide, which reduces the appetite by increasing the feeling of fullness after eating. It also helps the pancreas produce insulin.Taking the drug essentially guarantees a calorie deficit because the user feels less hungry, but Castano believes it is better for dieters to 'create a calorie baseline' themselves and stick to it, because this encourages healthier habits.'I feel like if you're, for example, using Ozempic, you're basically not intaking enough calories, so you're losing weight by obviously doing that,' he said.'I think, for me personally, it's always going to be dangerous in terms of the long-term as well. It's super dangerous. I think we just need to focus on that calorie baseline and creating a deficit and do it that way.'",
        "Far from being a flash in the pan, Castano believes Ozempic is here to stay because celebrities who take it have seen such rapid results. ",
        "'People always want quick results, you know? And people are always searching for the thing that's going to get them [to their goal weight] as fast as possible,' he said.'People are lazy and they don't want to put in the work.'  It comes after Castano revealed his plans to take his Acero gym business to the U.S. ",
        "He will head over to America in September where he hopes to 'work with more influential people'. 'The U.S. has always been such a key goal of mine,' Castano said in April. 'That's what I want to strive towards.'His girlfriend Simone Holtznagel previously lived in LA while working as a model. 'Simone, my partner, is coming along with me. She used to live there before the [Covid] pandemic and having someone that's able to support me and know the system is amazing,' he added.Castano will continue to work with Rebel Wilson when he arrives in the U.S., and has other celebrity clients lined up, including Jennifer Lopez's hairstylist Chris Appleton. "
    ]
}