{
    "articleURL": "/news/article-12042893/Americas-death-row-disaster-Inside-Alabamas-botched-three-hour-execution.html",
    "content": [
        "Almost a year after the longest execution in history, a bombshell lawsuit has cast new light over America's death row scandals Amid a legal battle over the use of expired lethal injection drugs, Texas has executed five of the inmates who are suing them A disturbing series of death row scandals has cast doubt over the role of executions in America's legal system, amid concerns over the ability to safely and humanely carry out lethal injections. ",
        "In August, convicted killer Joe Nathan James endured the longest execution in history, when he was slowly put to death over an agonizing three-hour ordeal. And almost a year later, a bombshell lawsuit was filed on May 3 suing Alabama officials for the 'cruel and unusual punishment' inflicted on James - in what is just the latest chapter in a legal battle that has been brewing in several Southern states for years. The issue captured headlines already this year due to Texas' insistence in executing a slate of its prisoners, five of whom joined a lawsuit fighting the use of the drugs that would ultimately be used to kill them. ",
        "The botched execution of James in August marked the beginning of a tumultuous time for the death row system, as he earned the unenviable title of longest recorded lethal injection process in US history. The Alabama killer was convicted and sentenced to death for the fatal 1994 shooting of his girlfriend, Faith Hall. But his near-20 year stay behind bars ended in agony when officials unsuccessfully tried to insert an IV line for over three hours. The botched procedure reportedly led to an attempted cut-down procedure, which would have caused James to struggle and leave him with injuries to his hands and wrists. ",
        "The harrowing incident was slammed in a lawsuit filed Wednesday by James' family, who claim the Alabama Department of Corrections 'shrouds its execution protocol in secrecy and refuses to disclose critical details surrounding Mr. James's execution.' In a statement to DailyMail.com, Maya Foa, director of human rights organization Reprieve US, said: 'After enduring the unimaginable pain of a family member being subjected to the longest lethal injection in US history, the James family have still not received any basic answers or accountability.'She added that the lawsuit stemming from his death is 'vital', because it is 'challenging Alabama's blatant violations of the US Constitution at a time when the state has announced plans to send more people to the execution chamber.'Foa claimed the state is 'refusing to come clean about what happened during this and other catastrophically botched attempted executions.''Joe James' execution will go down in history as an illustration of the human consequences of the broken method of lethal injection. Alabama cannot continue to use the facade of medicine to pretend that lethal injection is in any way humane.'Reprieve added that the execution bore striking resemblance to the ordeal of Doyle Lee Hamm in 2018, when his death was postponed after Alabama prison officials again struggled to insert an IV line. The agonizing procedure saw Hamm left with twelve puncture marks, including six in his groin and others that punctured his bladder and penetrated his femoral artery.",
        "Ever since, several other Alabama death row inmates to survive their executions for the same reason, including Alan Miller in October and Kenneth Smith in November. 'Executing states recognize that if people knew what really happens in the death chamber, support for capital punishment would fall to unsustainable levels,' the organization told DailyMail.com. 'So states go to great lengths to hide the gruesome reality of the death penalty from view. This is most obvious when they're drawing the curtain on executions that go wrong or preventing witnesses from seeing the desperate struggle to insert IV lines, but it's actually much more pervasive and wide-reaching than that. 'Joe James' execution and other recent executions show how states like Alabama have effectively been executing people twice – firstly the torturous procedure behind closed doors, and secondly the performance in front of witnesses.' ",
        "Alabama officials are not alone in their mounting execution woes, with Texas' death row practices also fueling scrutiny into the prevalence of the practice.   Of the 10 death row inmates who have been executed so far in 2023, five were put to death in Texas - all of whom were killed with the lethal injection drug pentobarbital. Fueled by a lack of pharmacies willing to produce the execution drug, the Texas Department of Criminal Justice decided to extend their stockpile's use-by-dates. ",
        "Prison officials have been using the drugs since 2012 and deny that their extended use is more painful, but allegations have swirled around their safety - while a trail of those fighting their use are continuing to be executed with the drugs anyway.Six condemned Texas inmates made headlines after launching the lawsuit last year, arguing the use of the drugs violated the US Constitution's statutes against cruel and unusual punishment. But while the lawsuit made its way through the courts, inmates who signed onto the case, including convicted killers Wesley Ruiz, John Balentine, Gary Green, Arthur Brown Jr and Robert Fratta, have been executed by the same authority they are suing. None of the inmates were granted a final meal, after Texas banned the traditional rite in 2011. Their executions were ultimately allowed due to an appeals court decision in January that barred lower courts from issuing orders in the case. "
    ]
}