{
    "articleURL": "/sport/football/article-12055423/Hidden-clause-Sir-Jim-Ratcliffes-5bn-takeover-bid-push-Glazer-family-out.html",
    "content": [
        "Sir Jim Ratcliffe is looking to take full control of Manchester United Football ClubHis offer includes 'put-and-call options which will become exercisable in 2026' This could potentially force the Glazers to sell their remaining shares to RatcliffeSir Jim Ratcliffe is said to be proposing a full buyout of Manchester United Football Club after three years if his proposed takeover bid of £5bn is accepted. ",
        "The Glazer family announced they were considering selling United after 18 years of highly controversial ownership in November 2022.  The Ineos billionaire is one of two parties, alongside Qatari Sheikh Jassim bin Hamad Al Thani, who are thought to be leading the bidding war.However, Sky News are reporting that Ratcliffe's takeover bid includes 'put-and-call options which would become exercisable in 2026'.A source reportedly told Sky News that the 'put-and-call arrangements' would 'force the Glazers to sell their remaining shares to him or force him to acquire them'. ",
        "The clause could be triggered as little as three years into the deal and would ultimately push the Glazer family out of the picture. The news surrounding the clause in Ratcliffe's offer comes just over a week after the Glazers received a third round of offers for the club. Ratcliffe is said to have valued the club higher than Sheikh Jassim, who for much of the process had appeared the favourite in the running. The clause in Ratcliffe's offer will please the Manchester United's fanbase as they have been campaigning to get the 'Glazer's out'. Widespread protests were seen ahead of United's 1-0 victory over Aston Villa at Old Trafford earlier this month. Additionally, banners calling for the Glazers to sell the club have been prevalent at every game this season.",
        "Understandably, those signs have become more prevalent after the statement last November which said a sale of the club was being explored. Gary Neville, an outspoken former Manchester United player, described the process of selling the club as 'shoddy' last month.",
        "The Sky Sports pundit tweeted: 'They're making it up as they go along! Shoddy way to run a sale process.'They need to get out by end of May to allow the new owner a fighting chance to impact the next transfer window and get moving!'Neville continued: 'Taking it to a 3rd round (of bidding) is just classless. The market has obviously not given them the answer they want!'It's like they've made a pact to each other that they won't go for less than £1bn each family member. (5 of them). If they stay in after all this it will be toxic!'. Should Ratcliffe win the bidding war, he will invest heavily in the club and make the Red Devils 'the number one club in the world once again'. Speaking back in February, Ratcliffe said: 'We would see our role as the long-term custodians of Manchester United on behalf of the fans and the wider community.'We are ambitious and highly competitive and would want to invest in Manchester United to make them the number one club in the world once again. We also recognise that football governance in this country is at a crossroads.",
        "'We would want to help lead this next chapter, deepening the culture of English football by making the club a beacon for a modern, progressive, fan-centred approach to ownership. 'We want a Manchester United anchored in its proud history and roots in the North-West of England, putting the Manchester back into Manchester United and clearly focusing on winning the Champions League.'"
    ]
}