{
    "articleURL": "/sport/football/article-12054707/PLAYER-RATINGS-Ilkay-Gundogan-shines-despite-late-penalty-miss-Erling-Haaland-struggles.html",
    "content": [
        "Man City extended their lead at the top of the league with a win over Leeds Ilkay Gundogan netted a brace but missed a penalty to put result beyond doubtErling Haaland had a rare day off in front of goal hitting both the bar and the post Ilkay Gundogan scored twice for Manchester City but missed a late penalty as Pep Guardiola's side held on following a late surge to secure three points against relegation-threatened Leeds.",
        "Facing the defending champions on their turf was always going to be a monumental task for Sam Allardyce's first game in charge of a side that have conceded more goals than any other Premier League side this season.But the former England boss did not waste time putting his stamp on the side, replacing struggling goalkeeper Illan Meslier to hand Joel Robles his Premier League debut with the Yorkshire club.Though his future at the Etihad remains in doubt with his current deal due to expire at the end of the season, the Gundogan was in rare goalscoring form at the Etihad, netting twice in the first half with Riyad Mahrez providing the assist for both.After being dominated for much of the game, Leeds were offered a lifeline after Gundogan missed a late penalty and Rodrigo scored almost immediately after but the club were unable to fashion an equaliser as City extended their Premier League winning streak to 10 games.Richard Tanner provides the ratings and the analysis from Saturday's clash.",
        "Manchester City 3-2-4-1Ederson 7City were so dominant he didn't have much to do but pulled off an instinctive first half save from McKennie's header. No chance with Rodrigo's goal.Manuel Akanji 6Usual steady, unflappable game from the defender but will be frustrated by the late goal that ruined chance of a clean sheet.",
        "Aymeric Laporte 7Laporte kept City secure at the back until Rodrigo's strike gave City a few late and unnecessary jitters.Nathan Ake 7One surging first half run had the crowd applauding but he was replaced after 54 minutes with one eye on Real Madrid...Rico Lewis 7Received an early tactical lecture from his manager but produced an energetic display.",
        "Ilkay Gundogan 9Marred a superb all-round game by failing to complete his hat-trick when he smashed a penalty against the post after scoring a first half double.Riyad Mahrez 7 Subtle touches, laid on the passes for both Gundogan's goals and kept Leeds defence at full stretch. ",
        "Kevin De Bruyne 7Not at the top of his game but still classy with his shrewd passing and ability to pop up all over the pitch.Julian Alvarez 6Not the Argentina youngster's best day - sent an early chance high over the bar and struggled to make a real impact.Phil Foden 7Lively performance on the left flank - and he needed to be considering the form of the man he replaced Jack Grealish. Just off target with superb volley.",
        "Erling Haaland 6A rare off-day for the Norwegian, hit the bar and post, and was rebuked by his manager for handing over the penalty to Gundogan.",
        "Substitutes:Kyle Walker (for Ake 54, 6).Bernardo Silva (for Alvarez 88).Rodri (for Gundogan 90).Unused subs: Stefan Ortega, Ruben Dias, Kalvin Phillips, John Stones, Jack Grealish, Sergio Gomez.Goals: Gundogan 19 and 27.Leeds United (3-4-2-1):Joel Robles 7",
        "Busy afternoon on his first League start of the season. Could do little about the goals and wasted as much time as possible over his goal-kicks.Rasmus Kristensen 5Experienced some anxious moments but stuck to his task well like his fellow defenders.Max Wober 6Cleared a shot off line in the first half and was prepared to put his body on the line to keep City out.Junior Firpo 5Along with his team-mates he could take some pride at keeping City down to two goals.",
        "Luke Ayling 5Put in the hard yards to try and frustrate City and got forward when he could but found it hard to keep Foden quiet.Adam Forshaw 5Hard-working shift - before being replaced by Pascal Struijk - but it is so tough to stop City in this form.Weston McKennie 6",
        "Solid show and almost pulled one back for Leeds in first half when his powerful header was saved by Ederson.Mark Roca 5Struggled to contain City's dynamic midfield and was replaced by Sam Greenwood early in the second half.",
        "Jack Harrison 5Spent most of the game trying to stop City rather than going forward himself and was replaced by Crysenico Summerville.Wilfried Gnonto 4Booked for a clumsy challenge on Mahrez, had no chance to use his pace and hooked after 54 minutes.",
        "Patrick Bamford 5The most thankless task of anyone on the pitch .. ran around trying to get a touch without any real service.Substitutes:Pascal Struijk (for Forshaw 80, 5).Sam Greenwood (for Roca 58, 5).Brenden Aaronsen (for Bamford 80, 5).Crysencio Summerville (for Harrison 65, 5).Rodrigo (for Gnonto 58) 6.Unused subs: Illan Meslier, Robin Koch, Georgino Rutter, Archie Gray.Booked: Gnonto.Goal: Rodrigo 85Referee: Andrew Madley 7."
    ]
}