{
    "articleURL": "/wires/pa/article-12056789/Celtic-wrap-title-away-victory-Hearts.html",
    "content": [
        "Kyogo Furuhashi grabbed his 30th goal of the season as Celtic clinched the cinch Premiership title with a 2-0 victory over 10-man Hearts.",
        "Hearts caused Celtic problems until losing Alex Cochrane to a contentious VAR-assisted red card on the stroke of half-time after the defender was adjudged to have denied Daizen Maeda an obvious goalscoring opportunity.Furuhashi netted from close range with the game’s first shot on target midway through the second half and substitute Oh Hyeon-gyu rounded off the win.Celtic had gone into the weekend with a 13-point lead over Rangers, who kicked off against Aberdeen 45 minutes after the Tynecastle clash and the Hoops’ win ensured they retain the title with four games to spare.Ange Postecoglou’s men can now focus on going for a record points total of 107, which they will achieve if they win their remaining matches, and also winning the treble, which they will secure if they beat Inverness in the Scottish Cup final.They did not have it all their own way at Tynecastle though. Interim Hearts manager Steven Naismith had enjoyed a 6-1 win over Ross County in his first home match in charge and his team selection signified real attacking intent with attackers Barrie McKay, Yutaro Oda, Lawrence Shankland and Josh Ginnelly all retaining their places.",
        "Celtic had Anthony Ralston and Yuki Kobayashi in for the injured Alistair Johnston and Cameron Carter-Vickers and the Japanese centre-back had some uncomfortable early moments as the home side pressed them high up the park.",
        "The hosts enjoyed the territorial advantage in the opening 45 minutes with Kye Rowles coming closest with a volley that shaved the post and a header that landed on the roof of the net.Hearts were not allowing Celtic to get into any passing rhythm and the visitors’ only moment of note had been a Greg Taylor header over the bar before the game changed in the 45th minute.",
        "Ralston’s lofted pass down the right channel put Hearts on the back foot, Maeda ran across Cochrane and went down as his heels were clipped just outside the box.Rowles was offering some cover and referee Nick Walsh initially showed the yellow card but he changed it to a red after being called to his monitor by video assistant Willie Collum, although the original decision did not appear to be a clear and obvious error.Naismith brought on Stephen Kingsley for Oda before Carl Starfelt was denied by the offside flag from the resulting free-kick after knocking home Ralston’s header.Celtic still found it difficult to break through the 10 men but the key moment fittingly involved three players who have been highly influential in their success this season.",
        "Skipper Callum McGregor’s lofted pass found the run of Reo Hatate in behind the Hearts defence and he squared for Furuhashi to nudge home from close range at the near post.",
        "The Japanese striker injured his shoulder in the process of scoring and was soon replaced by Oh.The South Korean doubled Celtic’s advantage in the 80th minute with a neat finish following good work from fellow subs Sead Haksabanovic and Aaron Mooy.Some of the 1,303 Celtic fans unveiled a banner which read ‘F*** the King, crown the champions” and they were soon celebrating their 11th title in 12 seasons."
    ]
}