{
    "articleURL": "/wires/reuters/article-12050681/GRAPHIC-Global-equity-funds-biggest-weekly-outflow-five-weeks.html",
    "content": [
        "May 5 (Reuters) - Global equity funds suffered massive outflows in the week to May 3, hit by weak economic data and worries over a recession as investors were fretted about the likelihood of interest rates staying higher for an extended period.",
        "According to Refinitiv Lipper data, global equity funds recorded a net $16.9 billion worth of outflows in the week to May 3, marking the biggest weekly outflow since March. 29.The first quarter economic data painted a bleak outlook for the year, as U.S. economic growth slowed more than expected. At the same time, the German economy also stagnated due to declining consumption.In Asia, China's factory activity dipped in April, suggesting the manufacturing sector is losing momentum amid a bumpy post-COVID economic recovery.This week, the Fed raised interest rates by a quarter of a percentage point again, increasing consumer and company borrowing costs.The U.S. and European equity funds booked $15.6 billion and $600 million worth of outflows during the week, while Asian funds drew a small inflow of $160 million.Among sectors, investors pulled out money worth $563 million and $358 million from tech and financial sector funds, while they poured a net $463 million into consumer staples.Meanwhile, investors continued to favour money market funds, which lured inflows worth $44.3 billion, higher than $41.7 billion in the previous week.Global bond funds also secured $3.95 billion of inflows in a second week of net buying.Investors purchased government and short- and medium-term bond funds of about $2 billion each but drew $910 million out of high-yield funds.",
        "Among commodities, energy funds received $169 million in a second straight week of net buying, while precious metal funds drew a net $87 million worth of inflows.Data for 23,973 emerging market funds showed investors received a net $1.35 billion worth of equity funds in their biggest weekly net buying since March 1 but exited a net $183 million worth of bond funds.(Reporting by Gaurav Dogra and Patturaja Murugaboopathy in Bengaluru; Editing by Louise Heavens)"
    ]
}