{
    "articleURL": "/tvshowbiz/article-12042715/Tori-Spelling-reveals-THREW-getting-wasted-date-Eddie-Cibrian.html",
    "content": [
        "Tori Spelling recalled that she threw up when on a first date with fellow actor Eddie Cibrian almost 30 years ago.",
        "The star explained during a recent episode of the ReWives With Bethenny Frankel podcast that she had too much to drink.The Beverly Hills, 90210 star, 49, who recently revealed that she developed an ulcer on her eye, told the story of the memorable outing with the Third Watch vet, also 49, which occurred when she was in her 20s. As she joined The Real Housewives Of New York City alum for an episode that aired earlier Sunday, the TV personality explained that she had known Eddie because he had dated her friend in high school, and admitted that he was 'a catch' at the time. After years passed and she was appearing on the hit series, 90210, Tori crossed paths with the Sunset Beach star at a night club and claimed he was 'flirting' with her.The actress contacted her friend who had previously dated Cibrian to get the blessing to go on a date, which turned out to be more eventful than planned. ",
        "The mother of five expressed that the two had decided to go to a Hollywood hotspot at the time. 'We go to sit down and I'm looking at the menu, nervous, and then he says, \"I'm not really hungry. You're not hungry, are you?\"' she remembered. 'What do you say to that? A young girl, this hot young actor guy. I was like, \"Okay, sure.\" And he's like, \"Let's just get drinks.\" And I was like, \"Okay.\"",
        "'Of course, I haven't eaten, was so nervous, didn't order food, [he] just ordered me drinks, and ended up getting wasted,' the actress admitted. 'So wasted, that I went to go to the bathroom and walked into the kitchen by mistake and threw up in the back of the kitchen.' The Beverly Hills, 90210 alum continued, 'Long story short, threw up in the back, he took me home. I think he did kiss me and I was like, \"Oh, I hope I don't have puke breath.\"'Following the date, she told Bethenny, 'We weren't a match, which was fine,' and revealed that Eddie soon reached out afterwards and asked Spelling if she could possibly get him an audition on one of her father's shows. Aaron Spelling was notably a film and television producer, and worked on a number of projects, such as Beverly Hills, 90210, The Love Boat, Charmed, Charlie's Angels, 7th Heaven, and also Hart To Hart. However, Tori expressed that his questioning made her feel as though he 'wanted to go out' with her only to get a role on a production.",
        "She admitted, 'So, that always put a bad taste in my mouth,' but added that Eddie was a, 'super, seemingly nice guy. I have nothing against him aside from that. And we didn't hit it off anyway.' ",
        "Although the two stars never made it to a second date, the actor eventually tied the knot with Real Housewives Of Beverly Hills star, Brandi Glanville, in 2001. The couple welcomed two sons together, Mason, 19, and Jake, 16, but officially divorced in 2010 after his cheating scandal with singer, LeAnn Rimes. The Northern Lights star tied the knot with the songstress one year later in 2011, and the two lovebirds recently celebrated their 12th wedding anniversary last month in April. Tori married Charlie Shanian in 2004, but the former couple divorced in 2006 after the actress met Dean McDermott and had an alleged affair which began back in 2005. The two said 'I do' in 2006 and currently share five children: Liam, 16, Stella, 14, Hatti, 11, Finn, 10, and also six-year-old Beau Dean. McDermott is also father to son, Jack, 24, whom he shares with ex, Mary Jo Eustace. ",
        "In late 2013, it was revealed that Dean had an affair on Spelling, but the two chose to work through the infidelity to keep their marriage in tact. They also starred in the reality series titled, Tori &amp; Dean: Home Sweet Hollywood, which aired from 2007 until 2012. However, in 2021, the BH90210 actress admitted on SiriusXM's Jeff Lewis Live, that both she and her husband were sleeping in separate beds.  ",
        "She told Lewis during the interview, 'Right now, my kids and dogs sleep in my bed,' and added that Dean was, 'in a room.' A source told Entertainment Tonight at the time, 'Tori and Dean do things as a family for the sake of their kids and live in the same house but sleep in separate rooms. Tori is more vocal about what goes on between them, and Dean is just completely checked out.'The insider continued that the two stars were, 'very much struggling,' and explained, 'Dean has been caught in so many lies and infidelities over the years and Tori is just over it.' ",
        "'Dean does not want to get divorced because of financial reasons, and Tori doesn't want to for the sake of their family,' the source stated, and added. Earlier this year in March, a separate source gave an update on their relationship and told ET, 'they are still doing their best to make it work.''Marriage counselling has been a huge part of how they are trying to work things out, and so far, it's gone fairly well. Their kids are doing well. Everyone is doing their best to keep things afloat and live a life that's as normal as possible and trying to stay happy.'  The couple have appeared to have worked out a few problems, with the TV personality uploading an adorable family photo last month in celebration of Easter. ",
        "She flashed a cheerful smile as she posed with Dean and their five children while they soaked up the sun at the Omni Rancho Las Palmas Resort near Palm Springs. "
    ]
}