{
    "articleURL": "/wires/ap/article-12038787/Overhaul-Supreme-Court-ethics-runs-GOP-opposition.html",
    "content": [
        "WASHINGTON (AP) - Senate Democrats promised Tuesday to pursue stronger ethics rules for the Supreme Court in the wake of reports that Justice Clarence Thomas participated in luxury vacations and a real estate deal with a top GOP donor. Republicans made clear they strongly oppose the effort.",
        "Sen. Dick Durbin, the Democratic chairman of the Senate Judiciary Committee, said lax ethical standards have created a lack of public confidence in the nation's highest court.\"The Supreme Court could step up and fix this themselves,\" Durbin said as he opened the hearing. \"For years, they have refused, and because the court will not act, Congress must.\"Republicans, however, criticized the hearing as an effort to destroy the reputation of Thomas, one of the staunchest conservative voices on the court. Their comments showed how unlikely it is that Congress will pass legislation on the matter, with the parties worlds apart when it comes to the credibility of the Supreme Court, particularly after the seismic decision last June that overturned abortion rights.\"This assault on Justice Thomas is well beyond ethics. It is about trying to delegitimize a conservative court that was appointed through the traditional process,\" said Sen. Lindsey Graham, the committee's ranking Republican.Graham also asserted that casting aspersions on the court puts the safety of justices at risk.Democrats called the hearing after news reports detailed a close relationship between Thomas and a conservative donor from Texas.The donor, Dallas billionaire Harlan Crow, had purchased three properties belonging to Thomas and his family in a transaction worth more than $100,000 that Thomas never disclosed, according to the nonprofit investigative journalism organization ProPublica. The organization also revealed that Crow gifted Thomas and his wife Ginni with hundreds of thousands of dollars worth of annual vacations and trips over several decades.",
        "Durbin had invited Chief Justice John Roberts to testify at Tuesday's hearing, but he declined, saying that testimony by a chief justice is exceedingly rare because of the importance of preserving judicial independence. Roberts also provided a \"Statement on Ethics Principles and Practices\" signed by all nine justices that describes the ethical rules they follow about travel, gifts and outside income.While the rules are not new, the statement provided by Roberts said that the undersigned justices \"today reaffirm and restate foundational ethics principles and practices to which they subscribe in carrying out their responsibilities as Members of the Supreme Court of the United States.\"Instead of Roberts, senators heard testimony from five legal and ethics experts, including a former attorney general, Michael Mukasey, who served under President George W. Bush. He said recent criticism of high court justices is without merit.Jeremy Fogel, a federal judge for 20 years who is now retired, said he was not at the hearing to criticize any justice or participate in a political debate. But he expressed his fears about eroding public confidence in the Supreme Court, fueled in part by the increasingly contentious confirmation process for justices and the spread of disinformation on social media.A \"lack of clarity about the justices' ethical obligations,\" Fogel said, only feeds the perception that the justices are deciding cases based on political preferences rather than the law.",
        "Fogel said he agreed with Roberts' explanation for how the Supreme Court is different from other federal courts and why it would be inappropriate to simply adopt the code of conduct applicable to all other federal judges.\"But that doesn't mean the court should have no formal code at all, that it couldn't adopt a modified code that accounts for these differences,\" Fogel said.Kedric Payne, senior director of ethics at the Campaign Legal Center, argued in favor of a stronger ethics framework. He said the Supreme Court lacks a formal recusal process and a binding code of conduct, among other things. The center advocates for every American's right to participate in the democratic process.\"There is no room to debate that the Supreme Court has the weakest ethics rules in federal government,\" Payne said.Mukasey defended Thomas in his testimony. He noted that Thomas has said that he consulted others, including colleagues, about whether to include the trips on his financial disclosure form, but was told an exemption applied for hospitality from friends. And last month, when the federal judiciary bolstered disclosure requirements for all judges, Thomas said he will be guided by it and include such travel and vacation accommodations in future reports.Mukasey also said the purchase of Thomas' childhood home represented a loss to Thomas. He was obligated to report it, but did not do so because he mistakenly believed he didn't have to report a transaction in which he sustained a loss. He noted that Thomas has said he intends to amend his financial disclosure for the relevant period.",
        "\"If the public has a mistaken impression that the integrity of the court has been damaged, the fault for that lies with those who continue to level unfair criticism at the court and his justices,\" Mukasey said.In the wake of the reports about Thomas, Democrats in both chambers are pursuing legislation that would create a process for investigating misconduct at the Supreme Court and strengthen recusal standards and disclosure of travel and hospitality. They are also pursing changes through the spending bill process, calling on lawmakers to direct the Supreme Court to adopt binding and enforceable ethics rules.Sen. Sheldon Whitehouse, D-R.I., who is leading those legislative efforts, said \"the court has conclusively proven that it cannot police itself.\"\"Until there is an honest ethics process at the Supreme Court, these messes will continue,\" Whitehouse said.Republicans on the panel repeatedly came to the defense of Thomas, including the playing of Thomas' testimony during his 1991 confirmation hearing in which he said he was the victim of a \"high-tech lynching.\"\"It is sad to see 30 years later this committee is again engaged in the same despicable tactics,\" said Sen. Ted Cruz, R-Texas.On the Senate floor, Sen. Mitch McConnell, R-Ky., said he believes in the integrity and honesty of all the justices on the Supreme Court. \"All nine of them. They should pay the partisan grandstanding no mind at all,\" McConnell said."
    ]
}