{
    "articleURL": "/wires/afp/article-12057105/Israel-court-denies-bid-force-demolition-West-Bank-village.html",
    "content": [
        "Israel's top court denied on Sunday a petition by a pro-settlement organisation to force authorities to demolish a Bedouin village in the occupied West Bank, capping years of legal battles.",
        "The Khan al-Ahmar community, on a strategic highway east of Jerusalem, was slated for demolition in 2018 after a ruling that it was built without Israeli permits.Right-wing Israeli group Regavim had taken the government to court in order to force officials to raze the village, whose 200 residents have drawn international support.The Supreme Court on Sunday granted the state an indefinite delay to the demolition order, citing \"security and diplomatic reasons\" detailed in a classified government statement.Under pressure from the European Union and the International Criminal Court and amid years of political instability in Israel, successive administrations have delayed their decision on Khan al-Ahmar eight times.The Supreme Court on February 7 had approved the latest three-month delay after Prime Minister Benjamin Netanyahu's right-wing administration had requested more time before presenting a plan to demolish the village.In Sunday's ruling, the judges stressed Khan al-Ahmar was \"illegal\" but accepted that they should not interfere to force its demolition.",
        "The village is located in Area C of the West Bank, which covers about 60 percent of the territory and is under full Israeli control. It is almost impossible for Palestinians to obtain construction permits there.Israel has occupied the West Bank, home to around 2.9 million Palestinians, since the 1967 Six-Day War. Around 475,000 Jewish settlers also live there in state-approved settlements considered illegal under international law.",
        "Foreign states have told Israel that demolishing the Bedouin village would be a violation of international law.Regavim, whose stated mission includes \"the protection of Israel's national lands\", filed in 2019 a petition with the Supreme Court to force the demolition.The group accused Israel on Sunday of \"caving in to international pressure\", saying in a statement the court's ruling \"is leading the country to the brink of anarchy\".Earlier on Sunday, Israeli forces demolished a primary school in Jabbet al-Dhib, a Palestinian village near Bethlehem, further south in the West Bank, also following a petition filed by Regavim.Israeli authorities had determined that the school had been \"built illegally\" and posed a \"safety hazard\", but the demolition drew sharp criticism from the European Union which had funded the project."
    ]
}