{
    "articleURL": "/news/article-12042783/Record-11-500-police-guard-coronation-biggest-security-operation-British-history.html",
    "content": [
        "More police will be in London on Saturday than for the Queen's funeral last yearScotland Yard bosses have warned any protesters will face 'very swift action' A record 11,500 police will guard the Coronation of King Charles this weekend in what is set to be the biggest security operation in British history.",
        "Scotland Yard bosses have warned that protesters who try to disrupt the event can expect 'very swift action' from police who will have an 'extremely low' threshold when dealing with them.But they admitted that anti-monarchist activists will be permitted to peacefully protest against the Coronation unless they break the law.It comes as King Charles hosted the Prime Minister of New Zealand at Buckingham Palace today, hours after a 'knifeman' sparked a security scare. The man was arrested by police on Tuesday evening after allegedly throwing shotgun cartridges over the gates of the palace, and warned officers his rucksack should be 'handled carefully'.",
        "This sparked security forces to put a cordon outside the front gates and experts then carried out a controlled explosion which could be heard on a live broadcast of GB News.The man, understood to be 60-year-old David Huber, from Cumbria, was detained within seconds and the Metropolitan Police says it isn't treating the incident as terror-related. Although the King and Queen were not in residence at the time, Charles returned to the palace today to hold an audience with New Zealand PM Chris Hipkins.",
        "The pair were photographed shaking hands as His Majesty received Mr Hipkins, who only two days ago said he was in favour of his country ditching the monarchy to become a republic.",
        "It's expected 500 more officers will be deployed to the streets of London on Saturday than there were for the funeral of Queen Elizabeth II last September.Other details which emerged from the vast security operation, codenamed Operation Golden Orb, include: Facial recognition technology will be deployed to flag to police any individuals on watch lists or who have outstanding warrants;There will be more 'VVIPs' at the Coronation than at the late Queen's funeral, meaning more close protection officers will be required;The operation will be led by Karen Findlay, who was silver commander for last year's state funeral;Under the new Public Order Act, protesters who block roads at the event will face up to 12 months behind bars;A total of 29,000 officer shifts will be used during the days around the Coronation; In addition to the 11,500 officers deployed on Saturday, there will be 10,000 military personnel taking part in the ceremony;There will be a 'no-fly zone' over the capital for the weekend.Commander Findlay, who has spent more than three decades at the Metropolitan Police, said: 'It is an absolutely historic, unprecedented mobilisation for us in terms of scale, but most importantly the nature and specialness of this event to the public, to the service, and all our communities in London and actually the whole of the United Kingdom and globally. 'It's such an event of constitutional, spiritual importance for us all to be involved in.' ",
        "Metropolitan Police Deputy Assistant Commissioner Ade Adelekan said the force will not tolerate any criminal activity camouflaged as protest during the event. Specialist teams have begun scouring the area of central London where events will unfold and will continue monitoring crowds to spot signs of suspicious behaviour. The policing plan has been re-examined after a security incident outside Buckingham Palace on Tuesday evening when a man who allegedly had a knife threw shotgun cartridges over the palace gates. Mr Adelekan said: 'We've debriefed our plans after that incident just to make sure there are no gaps and we're absolutely confident that we've got a plan that will deliver the Coronation in such a manner that everyone will come to London and celebrate and there will be no issues whatsoever.' ",
        "Asked about how officers will deal with protesters, he said: 'Our priority is around safety and security for everyone that's going to come to this event, and we want to make sure that everyone enjoys it. 'We have an extremely low threshold for anybody or anything that will disrupt this event and what you will see is very swift action from us.' New laws to curb protests came into force on Wednesday ahead of Saturday's ceremony but security minister Tom Tugendhat said the celebrations will 'showcase our liberty and our democracy'.Under the new Public Order Act, protesters who block roads will face up to 12 months behind bars. An official letter warning of the new powers was sent to anti-monarchy group Republic, which said its campaign around the Coronation will proceed as planned. ",
        "Republic boss Graham Smith said it was 'very odd' the letter came from the Home Office and described it as 'intimidatory'. He added: 'We've been liaising closely with the police about the protest for weeks. We've had meetings with them. 'They've said very clearly that they have no problems with our plans. I just can't understand why the Home Office thinks it's appropriate to send a letter like that, which was anonymous in terms of [having] no person's name on it.' ",
        "He said there are plans for 1,700 people to protest in Trafalgar Square on Saturday. Hundreds of thousands of people are expected to travel to central London for the event, including scores of foreign VIPs who need close protection. Commander Findlay, a former rugby coach for Harlequins in Twickenham, said a total of 29,000 officer shifts will be used during the days around the Coronation, with specialist teams including armed police, sniffer dogs, mounted officers and marine officers on the Thames all taking part. There will be an airspace restriction across London on Friday and Saturday. In addition to the Coronation itself at Westminster Abbey, there are expected to be more than 1,800 other street parties and celebrations around Britain.Earlier today Mr Adelekan revealed more details about last night's security scare which saw the road roads around Buckingham Palace put into lockdown.He said the man had approached officers asking to see a soldier at around 7.15pm on Tuesday.When they said that was not possible, the man allegedly began throwing shotgun cartridges over the gates. He was searched and allegedly found to be in possession of a lock knife, and was arrested on suspicion of possession of a knife and ammunition.During the arrest, the man told officers they should handle his rucksack with care, which led to a controlled explosion being carried out on the bag that could be heard live on GB News.",
        "Though neither the King nor Queen were in residence, Camilla's grandchildren had been seen arriving at Buckingham Palace hours before - while Charles had held an audience with Australian Prime Minister Anthony Albanese earlier in the day.",
        "Mr Adelekan said the suspect was detained within seconds and arrested within five minutes. He said he had no knowledge of reports that the man had been shouting that he wanted to kill the King before he was arrested.The suspect has undergone a mental health assessment and has been deemed fit to be interviewed. Scotland Yard is not treating the incident as terror-related.Former head of Royal Protection Dai Davies warned the threat of an attack is 'as high now as it's ever been' and said 'you can never drop your guard' when working for the Royal Family.Mr Davies told MailOnline: 'As we saw the police's response was adequate - but if he's been there for days, I would have hoped someone would have noticed him. It is essential to watch the characteristics of people and to take action immediately. I would be very very angry to anyone who didn't do that.'He added: 'If a police officer heard him, he would have had a duty to catch him and detain him under the Mental Health Act.'",
        "The security expert also issued a warning that the risk for a potential attack is very high, saying not just the palace could be targeted but also railway and Tube stations. He said it is vital for police to 'know their history' and make sure they are aware of previous attacks and attempts.'Of course, for hundreds of years you might expect protesters at events such as this but never before have activists been able to organise on the scale of groups such as Just Stop Oil and Extinction Rebellion,' he added.'There are considerable groups that pose a threat. Often it is the lone wolf that wants publicity. This incident indicates that the police are on full alert.'"
    ]
}