{
    "articleURL": "/wires/reuters/article-12050483/Bayern-without-injured-Choupo-Moting-Stanisic-against-Werder.html",
    "content": [
        "MUNICH, Germany, May 5 (Reuters) - Bundesliga leaders Bayern Munich will be without injured striker Eric Maxim Choupo-Moting and defender Josip Stanisic when they travel with a \"decimated squad\" to Werder Bremen on Saturday, coach Thomas Tuchel said on the eve of the match.",
        "The Bavarians, a point ahead of second-placed Borussia Dortmund with four games left this season, are already without the injured Alphonso Davies, Dayot Upamecano and Lucas Hernandez as well as the suspended Leon Goretzka.\"He is feeling the knee and it causes discomfort,\" Tuchel said of Choupo-Moting's nagging injury.\"It feels like it is a matter of days (until he returns) and hopefully it will remain so but we cannot say that clearly. It's been dragging on longer than initially expected.\"Stanisic picked up a muscle injury in training this week.\"He will out for about two weeks but two weeks at this stage are a lot and the number of matches is not increasing. It's a pretty decimated squad,\" he told a press conference. \"We will probably need to add some reserve players in the squad.\"Bayern, who have won one of their last three league matches, cannot afford any more slip-ups, Tuchel said, if they are to win the only trophy left this season for a record-extending 11th straight league crown.\"We still have room for improvement, to bring the team to the limit and keep it there over a longer period of weeks or months,\" added Tuchel, who took over from the sacked Julian Nagelsmann in late March.",
        "They have since been eliminated from the German Cup and the Champions League while their rocky Bundesliga run in recent weeks has made it the closest title battle in years.\"We want to reduce mistakes, attack and score a lot of goals,\" said the former Chelsea and Paris St Germain coach.\"We must increase the pace but it makes no sense philosophising about it. Today we have to prepare and tomorrow we have to be ready. That's all that matters.\"Bayern reclaimed the lead last week with a win over Hertha Berlin as Dortmund slipped up against VfL Bochum with a draw. Dortmund host VfL Wolfsburg on Sunday\"It is tight title race. We have the chance to up the ante now but we cannot allow ourselves any more ups and downs,\" Tuchel said. (Reporting by Karolos Grohmann; Editing by Ken Ferris)"
    ]
}