{
    "articleURL": "/wires/aap/article-12044195/Record-17-5m-enrolled-Indigenous-voice-referendum.html",
    "content": [
        "Sport and politics are colliding in the lead up to the Indigenous voice referendum as politicians bicker about who should take part in the national debate.",
        "Opposition Indigenous Australians spokeswoman Jacinta Nampijinpa Price has criticised major sporting codes for supporting the 'yes' campaign, saying sports and politics needed to be separated.But First Peoples' Assembly of Victoria co-chair Marcus Stewart says sporting codes have a democratic right to participate in politics.\"Senator Price claims to be a voice for the people of Australia, yet her comments dismissing the views of sporting codes are anti-democratic and frankly un-Australian,\" he told AAP.The Nira illim bulluk man, who sat on the government's referendum working group, said Senator Price was looking to muddy the waters before the vote.\"This is just another attempt from the right to silence supporters of the voice and cast doubt in the minds of voters,\" he said.But Senator Price says sporting codes need to stay out of politics.\"... especially when they aren't across the detail,\" the Indigenous senator told 2GB radio on Thursday.\"It's not for them to promote something in this capacity. To me, it's like a huge virtue-signalling exercise.\"Senator Price, the former deputy mayor of Alice Springs, said the government had bungled the referendum by tying a constitutionally enshrined advisory body to reconciliation.\"What's that saying? The road to hell is paved with good intentions,\" she said.\"There's a lot of goodwill out there from Australians, but there's absolutely no guarantee, there's no way in which this proposal can demonstrate with any clarity that it is going to improve the lives of our most marginalised.\"",
        "The government is putting $1 million towards the Constitution Education Fund Australia and $475,000 into the Museum of Australian Democracy in a bid to educate the public about the referendum.The two bodies will jointly deliver neutral, easy-to-understand information about the constitution and voting process, with no Australian under the age of 42 having voted in a referendum.It will include digital learning resources and will boost the reach and visibility of public institutions and libraries to help reach more people.Indigenous Australians Minister Linda Burney said it was crucial Australians had the facts.\"Delivering this civics program will ensure all Australians can contribute respectfully and knowledgeably to the national conversation about the referendum before voting day,\" she said.The media watchdog is working to ensure only accurate information is advertised during the referendum campaign.Australian Communications and Media Authority manager Kelly Mudford said the organisation was monitoring misinformation and disinformation campaigns.Google, Apple, TikTok, Twitter and Facebook's parent company Meta have all signed up to a voluntary code that provides safeguards against the spread of false information.\"We are continuing to identify larger platforms that are not signatories to the code and encouraging them to sign up and also to find out about their preparations for the referendum as well,\" she told senators on Thursday.",
        "The Australian Electoral Commission is also working to quell misinformation during the referendum, with a record 17.5 million Australians set to vote.As of March 31, more than 97 per cent of eligible Australians were registered to vote, with 75,000 added to the electoral roll in the first three months of the year.The referendum to enshrine an Indigenous advisory body in the constitution is due between October and December."
    ]
}