{
    "articleURL": "/wires/reuters/article-12052147/Motor-racing-All-quiet-Red-Bull-home--now.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 5 (Reuters) - Formula One teams often have to deal with in-house divisions but Sergio Perez insists all is quiet on the Red Bull home front with the drivers championship shaping up as an epic tussle between the cool Mexican and fiery team mate Max Verstappen.The Red Bull drivers have been in a league of their own this season and that dominance is expected to continue this weekend at a steamy Miami Grand Prix with double world champion Verstappen (93) leading Perez by just six points in the drivers standings.Red Bull have won every grand prix this season, with three of the four races producing one-two finishes.Be it at the front of the grid or back, team dynamics can often be complicated when both drivers are not only trying to out-perform their rivals in other outfits but are also trying to beat their own team mate.Rivalries within teams are downplayed but often exposed when the smallest signs of preferential treatment can explode into controversy.Ayrton Senna and Alain Prost at McLaren in 1988 and 1989 is one of Formula One's most heated and bitter rivalries and more recently Mercedes' Lewis Hamilton and Nico Rosberg.While Verstappen and Perez have not reached that level of rancour yet, their relationship looks to be trending in that direction.",
        "Cracks in the partnership appeared last season after Perez won Monaco and Verstappen took revenge in Brazil by refusing to let him pass in a move that might have helped secure second place in the drivers standings.Since joining Red Bull in 2021 Perez has been the clear number two.He has played the part of consummate team mate dutifully following orders but there are signs this season things are different.\"It is not easy being Max's team mate because he is delivering all the time and he is winning all the time and we have seen it in the past it is not always easy for a team mate to survive,\" Perez told reporters outside the team's hospitality suite. \"But I believe in myself.\"Perez arrived in Miami brimming with confidence, coming off a victory in Baku that he said proved he could win on any circuit.The Mexican also excels on street courses like in Miami, where he could leave on Sunday sitting on top of the drivers championship.\"If I am able to do that in Baku I am able to do that anywhere,\" assured Perez.\"I do believe the team will give me as much support as they do with Max in that regard we have to appreciate that from Red Bull.\"",
        "Verstappen was only five points clear of Perez after four races last year but won in Miami with fastest lap and went on to finish the season 149 points ahead the Mexican and with 15 victories to his team mate's two.Perez went out of his way on Thursday to make clear he is not looking to disrupt team chemistry using the word \"respect\" to describe his relationship with Verstappen nearly a dozen times.\"As long as the respect is still there I don't see the reason why it would be any different between us,\" said Perez. \"We both want to win, we are very hungry but at the end of the day we have a lot of respect for the team.\" (Reporting by Steve Keating in Miami, editing by Pritha Sarkar)"
    ]
}