{
    "articleURL": "/news/article-12053517/Not-King-protesters-unfurl-flags-shout-anti-monarchy-slogans-Coronation-route.html",
    "content": [
        "Republic boss Graham Smith and five others have been arrested, group claims** Did you SEE today's arrests? Get in touch: Eleanor.blake@mailonline.co.uk CORONATION LIVEBLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Anti-monarchy activists have blasted police for arresting a number of protesters in the run up to the Coronation of King Charles III in central London. ",
        "Republic's megaphone-wielding chief executive Graham Smith was among those arrested, as police said they had seized multiple lock-on devices and hundreds of posters.New legislation passed this week means protesters who have an object with the intention of using it to 'lock on' are liable to a fine, with those who block roads facing 12 months in prison. However, group director Harry Stratton, who witnessed the arrest of his six colleagues, denied any megaphones or locking chains were being carried or seized, and that they hadn't broken any rules laid out by the force in a series of meetings - which included not mentioning Prince Andrew and the sex claims against him, which he denies.Mr Stratton accused police of 'intentionally picking them out', while another campaigner claimed straps holding their placards had been 'misconstrued' as something that could be used for locking on.",
        "Mr Stratton told MailOnline: 'We had meetings with the police where they outlined what would and wouldn't be accepted today.'They told us any mention of Prince Andrew or the sex abuse cases would mean arrests.'They said if anybody got in the way of the possession, they could be shot because the military around the streets might be a bit touchy and not understand what was going on.",
        "'We believe we had made our intentions, clear, to have a peaceful protest, and we did not bring any megaphones or any other equipment.'These arrests seem like the work of a police state. It's not acceptable. We are only saying that we don't believe in the monarchy and we're doing it peacefully. How can they arrest six people who are just on the way to a peaceful protest?'Another protester, Symon Hill, 46, who was previously arrested for shouting 'who elected him?' during a proclamation ceremony for the King, said he hoped he would not be arrested again.Mr Hill had charges against him of using threatening or abusive words or disorderly behaviour likely to cause harassment, alarm or distress dropped by the Crown Prosecution Service. He said: ''I very, very much hope I will not be arrested. I am joining peaceful, lawful protest and I am worried there will be more arrests on spurious grounds. 'I am nervous but determined to keep on protesting peacefully against monarchy and arbitrary policing. 'The arrests this morning are appalling but I am not surprised.' Footage on Twitter showed officers using their powers under the new Public Order Act, with a number of demonstrators in yellow 'Not My King' T-shirts having their details taken.",
        "In one video an officer said: 'I'm not going to get into a conversation about that, they are under arrest, end of.'In a statement, the Metropolitan Police said: 'A significant police operation is under way in central London. 'We have made a number of arrests in the area of Carlton House Terrace. The individuals have been held on suspicion of breaching the peace.'Earlier today we arrested four people in the area of St Martin's Lane. They were held on suspicion of conspiracy to cause public nuisance.'We seized lock-on devices. A further three people were arrested in the area of Wellington Arch.'They were held on suspicion of possessing articles to cause criminal damage. There will be further updates later today.'It comes as a number of Just Stop Oil activists were also arrested on The Mall, with protesters insisting they were only planning on waving flags and wearing T-shirts during the Coronation.Earlier this week, the Metropolitan Police said they would have an 'extremely low threshold' for protests during the celebrations, and that demonstrators could expect 'swift action'.",
        "But non-profit campaign group Human Rights Watch said the coronation arrests were 'something you would expect to see in Moscow not London'.Its UK director Yasmine Ahmed said in a statement: 'The reports of people being arrested for peacefully protesting the coronation are incredibly alarming. This is something you would expect to see in Moscow not London.",
        "'Peaceful protests allow individuals to hold those in power to account, something the UK government seems increasingly averse to.'And human rights campaigner Peter Tatchell, who was with the anti-monarchy protesters, said on Twitter: 'Police arrest peaceful anti-monarchy protesters &amp; have erected giant barriers to obscure pro-republic banners. Right to freely protest suppressed. Shame!'",
        "Each time Republican protesters broke out into chants of 'not my King', concerted boos and jeers went up from the rest of the crowd, before turning into cheers when the protesters were drowned out. Elaine Myatt, 63, from Stoke on Trent said: 'I'm not having it. It's an insult to to the King. The protesters have taken up a prime position and Charles is going to come past here and see them when he could see the thousands of us who are cheering and supporting him.'Her friend Jenny Gannon, 66, also from Stoke, agreed and said: 'Who would replace the King if we were to become a republic? I certainly wouldn't want a president Boris Johnson.'The Clay family from Ashford, Kent, were amongst some of the loudest people expressing their support for the monarchy and drowning out the protesters - and were showing no signs of fatigue despite their 5am start. Grandmother Maggie Clay, her daughters Georgina and Alex, and grandchildren Marnie, 11, Micky, 7 and Beau, 6, labelled the protesters 'fun sponges' and said they had only shown up to spoil the day for people who like the Royal family rather than out of any real conviction. They had even recruited an American tourist to join in with their cheers.",
        "Ms Clay said: 'We've been shouting back at them because they're party poopers. We're just here trying to have a good time.'They [the protestors] are all going to have the Monday Bank Holiday off aren't they. They're probably going to have a drink after this with their friends too. It's hypocrisy.'At its height, Republic expects 1,700 members to arrive at the scene at midday. Currently, the first military parades are filing past the square, in the shadow of Nelson's Column. Peter Tatchell, 71, a long time supporter of Republic said: 'It is an outrageous infraction on the right to protest, for the head of Republic and other protestors to be arrested for an entirely peaceful protest. 'The police have confiscated tall the Republic placards and they have erected a giant barrier in front of the protest so we cannot been seen by the King and Queen Consort. 'That is a violation of our right to freedom of expression. 'Even people who support the monarchy, I hope would respect our right to protest. Clearly, the police don't.' Republic supporters dressed in yellow and waving placards stood shoulder-to-shoulder with royal fans bedecked in Union flags as thousands of people lined the procession route.Later, police arrested a defiant royalist shouting 'He is My King' who is believed to have been detained for allegedly throwing an object and carted away by two officers in Trafalgar Square. ",
        "The Metropolitan Police said a number of arrests had been made and the individuals were being held 'on suspicion of breaching the peace'. Up to 2,000 people are expected to join peaceful 'Not My King' protests in Trafalgar Square amid fears eco-zealots could also target the historic occasion.But around 8am, six Republic members, including the group's chief executive Graham Smith, were detained as the peaceful demonstration got under way in central London, according to the group.Group spokesman Luke Whiting, 26, said: 'It is unclear why, potentially it is because one of them was carrying a megaphone.'It is unclear exactly whether the police are using these few powers and whether they are misusing them to stop protest happening.'",
        "One video showed members of the public quizzing police on why Republic members had been arrested, with an officer saying: 'I'm not going to get into a conversation about that - they are under arrest, end of.'Carol Lever of Republic told MailOnline: Graham has been arrested and we believe the police action to be heavy handed.'We had been in consultations with police in the lead up to today and we had also taken legal advice on the new rules about protests.'We don't understand why the police have done this. Our colleagues had stayed in a hotel near Trafalgar Square last night to be there early today, but they were stopped on the way and the placards were taken away by police.'Several people have been arrested on suspicion of offences including breaching the peace and conspiracy to cause public nuisance close to the coronation, Scotland Yard said.Under the controversial new Public Order Act, protesters who have an object with the intention of using it to 'lock on' are liable to a fine, with those who block roads facing 12 months in prison.Critics previously hit out at plans from the Met to use facial recognition software on crowds to assist their policing operations.An official letter warning of the new powers was sent to Republic, which said its campaign around the coronation would proceed as plannedPolice were seen arresting crying anti-monarchist protesters and scouring a van full of 'Not My King' banners amid attempts to foil a peaceful protest by thousands of Republic demonstrators at the King's Coronation.",
        "A ring of steel has been placed around the capital with 11,500 officers on duty and a further 10,000 military personnel taking part in the ceremony, in what is set to be the biggest security operation in British history.It comes amid fears eco-zealots are plotting a graffiti attack on a monument on The Mall during Charles' coronation, as police vow hardline action against such tactics.Royal fans drowned out Just Stop Oil protesters on The Mall this morning as rival chants broke out between well-wishers and eco activists on the coronation procession route.Just Stop Oil said 13 of their activists had been arrested but insisted they were only planning on waving flags and wearing T-shirts.They said a protester was arrested in Piccadilly on their way to The Mall, and a further five were arrested near Downing Street.As thousands of royal fans and well-wishers crammed onto The Mall to catch a glimpse of the King on his way to Westminster Abbey, they were joined by a group of Just Stop Oil activists.Onlookers sang the national anthem as the demonstrators shouted messages about climate change and their right to protest.Some people approached protesters who were wearing handcuffs and told them to 'shut up', while onlookers heckled the group.Fifteen demonstrators wearing Just Stop Oil T-shirts were seen in handcuffs surrounded by police and backed up against railings on The Mall.Officers from the Welsh Police force, part of the 11,000 on duty, formed a human shield in front of those in handcuffs.One of the protestors shouted out that he was arrested for wearing a Just Stop Oil T-shirt.Police did not attempt to stop him shouting out as he. Said he was exercising his freedom of speech.They were mostly ignored by the crowds who kept their focus on The Mall as marching bands paraded down the route from Buckingham Palace.",
        "Chants of 'Not My King' could be heard from the group of anti-monarchists, which were met by boos and opposing chants of 'God Save the King'.Republic supporters dressed in yellow and waving placards stood shoulder-to-shoulder with royal fans bedecked in Union flags as thousands of people lined the procession route.One royal fan, Chris Riley, 55, a contracts manager from Nottingham, told MailOnline: 'I love the King. I hope it's the most glorious day for him and the country. 'I'm a bit disappointed that there are people here with banners against the monarchy, which is a bit distasteful.' Mr Smith was arrested outside the Chandos pub, near Charing Cross rail station as he made his way to greet his colleagues in Trafalgar Square.Police also searched a van which had hundreds of placards, but did not confiscate them.   One woman in a Republic T-shirt who was arrested told PA: 'We had a delivery of placards ready for the protest and then the tactical support unit questioned us as to how we we had got through the road closures.'They questioned whether what we were doing was a delivery.'They then said they found evidence of means of locking on, of items that could be used to lock on, and they arrested us.'Officers carried her away from where she had been standing outside a Tesco store.Two men who appeared to have been part of the same demonstration were carried away by officers into a marked police van.The policing operation is set to see 11,500 police officers on duty on Saturday.",
        "Meanwhile the number of royal fans on the Mall outnumbered the anti-monarchst protesters.Coming to show his support for the King, royal fan Tim Constantinou, 54, from Stoke-on-Trent and a former Army corporal, said: 'This is a momentous occasion and one I had to be at.'I have always been impressed with Charles and I met him in 1991 when I came back from the Gulf war.'We had lost a few people from our regiment and he knew their names and was very knowledgeable about the regiment. He has time for people and a genuine interest.'I think he will be a wonderful King and unite the country for many, many years to come.'Susan Williams,19, from Castle Bromwich said: ' I think the King is great. But I'm more in love with William and Harry and Kate is just incredible with her style.'I hope Charles has a very long time as King, but I think William will be really cool when he takes over.'",
        "Earlier this week, Republic said 'it will not be deterred' after receiving a 'passive aggressive' letter from the Home Office warning them against plans to protest at the King's coronation.The group has slammed the Home Office for the official warning letter which they 'interpreted as a passive/aggressive intimidation of a legitimate protest group'. The letter, sent by the Home Office's Police Powers Unit, set out new offences under the Public Order Bill which was given Royal assent by the monarch yesterday.Under new legislation, protesters blocking key infrastructure such as roads, airports and railways can face 12 months behind bars.Anyone found 'locking on' or gluing themselves to buildings or objects could get six months in jail and face an unlimited fine. ",
        "Police can also stop and search anyone they suspect is planning to cause disruption under measures which came into force today - ahead of the coronation on May 6. The Home Office has contacted a number of protest groups to notify them of new offences which may affect them.But Graham Smith, the chief executive of Republic, said its campaign around the coronation will proceed as planned.Mr Smith said it is 'very odd' the letter came from the Home Office and described it as 'intimidatory'. ",
        "He said: 'We have had two meetings with the Met police, and numerous phone conversations.'They have repeatedly said they have no concerns about Republic's plans. It is a mystery why the Home Office thought it was necessary to send us an anonymous letter that could be interpreted as intimidation.''Republic will not be deterred and we will be protesting on Trafalgar Square and along the route of the coronation procession on Saturday.'It is telling that Charles, who has had no problem speaking up on various issues, has chosen not to defend democratic rights when they are being threatened in his name. Perhaps he might make it clear that he believes in the right to protest.'As a huge security operation got under way, protesters planning to disrupt the coronation were warned that they could be shot by police if they run out towards a carriage just in case they are carrying a bomb.",
        "Former royal protection officer Simon Morgan, now director of operations at security firm Trojan Consultancy, said: 'It's an armed policing operation because of the threat that the UK faces, the threat that the royal family faces, dignitaries that are attending. So we have to be very careful.'Somebody that's going to run out in front of the carriage, fiddling with something in their rucksack, who's to say that's not an IED rather than a banner that's just going to be unfolded.'These demonstrators have to be very careful as to the environment that they're going into, the police are acutely aware of it.' Facial recognition technology will also be deployed to flag to police any individuals on watch lists or who have outstanding warrants. While HMS Diamond, a Type 45 destroyer capable of tracking drones from 250 miles away, will also stand guard on the Thames over the King's Coronation weekend. "
    ]
}