{
    "articleURL": "/femail/article-12042759/Mystery-tiny-doll-family-moved-Michigan-mans-MAILBOX.html",
    "content": [
        "Don Powell, 72, from Michigan, found two dolls in his mailboxThe toys were left with a letter that read, 'We've decided to live here'Tiny furniture was also left inside his mailbox  A Michigan man has shared his bewilderment at discovering that a stranger had filled his mailbox with tiny dolls and micro furniture for the past year. ",
        "Don Powell, 72, was shocked when he found two small dolls alongside a note that read, 'We've decided to live here,' when opening his mailbox. The two wooden mini-dolls, Mary and Shelley, were sitting on a small sofa, making themselves comfortable in their new home. Speaking to DailyMail.com, Don revealed his 'shock and surprise' at discovering the toys - before explaining why he has allowed the toys to live in his mailbox rent-free for the past year, despite having no idea who they belong to.",
        "'My wife was with me when I opened our mail and noticed two dolls sitting on a loveseat in the mailbox. The dolls came with a sticky note that said, \"We decided to make this our home, signed Mary and Shelley,\"' Don explained. The 72-year-old said he was initially 'shocked' at the surprise, adding that he thought someone had mistakenly placed them in his mailbox - which he and his wife Nancy had custom-designed to replicate their old Detroit home.  'Our first reaction was one of shock and surprise and our immediate thoughts were that somebody had made a mistake in putting them in there,' he noted. And Don even did some of his own investigating to locate the culprit behind the 'cute prank.' He questioned if his neighbors received a similar surprise but had no luck.      ",
        "'We also thought that maybe someone was putting them in everyone's mailbox as we live on a cul-de-sac with five other homes. 'We then checked our neighbors’ mailboxes, but none of them had dolls inside,' Don told DailyMail.com After discussing the mysterious case of Mary and Shelley with his neighbors, Don was going to toss the dolls. ",
        "However, he reconsidered and decided to 'put them back in the mailbox' just in case the owner returned.    He said: 'I saw it as somebody being funny and I, also having a sense of humor, decided to play along with it and wanted to see what might happen next. ' Just a few days later, Don opened his mailbox to yet another surprise. This time, the stranger had left The stranger who left the tiny dolls decided to give the couple's new home a sweet touch and added an end table, a throw rug, and a pillow. Over the next several months, more and more items were added to the mailbox, including holiday decor and even pets. Don said he is always overjoyed when he sees a new addition to their home. 'This is why I have not tried to catch the person responsible. 'I actually like the fact that they continually added to the family with the addition of cousin Shirley and providing different furniture. ",
        "'I also liked the fact that during Halloween they replaced Mary and Shelley with two skeletons and during Christmas, a tree and holiday gifts were added,' he told DailyMail.com.",
        "The stranger behind Marry and Shelley added a 'service dog' to the mix, whom Don claims he likes even better than the two dolls. 'I do not really have a favorite doll when it comes to Mary or Shelley. My favorite, however, is the labradoodle service dog named Maggie,' he told DailyMail.com And, the spacious mailbox - which measures 26 inches long, 15 inches wide, and 10 inches high - is quite the treat for Marry and Shelley, who had previously resided in a 'Dutch-style dollhouse,' according to the Washington Post. And because there is so much room, their mail carrier said there is no problem with the dolls, and said he even enjoys seeing the new setup when he delivers the mail.  Don has even begun to partake in the fun himself. He told the outlet he added a doll-sized letterbox to the front of his mailbox to hold any mini letters and packages. Don has received many suggestions that will help amp up Mary and Shelley's living space, and he is even beginning construction on the mailbox. 'I have had many suggestions from people who have read the story about either adding an outside deck so Mary and Shelley can sit outside during the summertime, adding electricity so they don’t have to just rely on the wood burning stove for heat in the winter or an addition to the mailbox so that it can accommodate more of their furniture, as it is getting rather crowded in there. ",
        "'So far, the only new construction that is planned is a new roof for the mailbox as it occasionally leaks during a heavy rain. I plan to have the mailbox maker do this within the next month,' he explained to DailyMail.comAnd Don has his own message for the person behind this joy-filled joke. ",
        "The 72-year-old added: 'I would want the person who to did this to know they are responsible for bringing happiness, fun, and smiles to hundreds of thousands of people around the world. 'We live in an unsettling time where there is so much discord and negativity in the news. In a small way, the story of Mary and Shelley has provided a source of relief and comfort.'  Don said that many people have even reached out to him to thank him for lifting their spirits by sharing the story of Marry and Shelley. 'The comments on Facebook and to the previous articles that have been written have been so uniformly positive and heartwarming. 'I even received an email from a woman who said that reading this story enabled her to smile for the first time in over a month since her sister had passed away,' he continued. Don - who is a Psychologist - has dedicated his life to helping others and is grateful he gets to continue doing that through the dolls. ",
        "He told DailyMail.com: 'I am a Psychologist by training and am President and CEO of the American Institute for Preventive Medicine, which provides wellness programs to companies and hospitals. 'So, I have devoted my life to helping people. I think I am further accomplishing this by sharing the mailbox story, which has brought joy, fun, and laughter into so many people's lives.'"
    ]
}