{
    "articleURL": "/tvshowbiz/article-12045813/Timothy-Spall-continues-incredible-weight-loss.html",
    "content": [
        "Actor Timothy Spall continued to show off his weight loss when he attended an event to celebrate the 25th anniversary of the movie Sliding Doors on Wednesday. ",
        "The Harry Potter star, 66, cut a dapper figure in plaid trousers worn with a contrasting shirt, waistcoat and a tweed jacket at the screening at Notting Hill's Electric Cinema. Timothy embarked on a weight loss regime some years ago and in 2019, he spoke to the Radio Times about his transformation.He said: 'I wanted to change my lifestyle and lose weight and it’s done what I’d always hoped it might. 'As a character actor, it’s put me in a position where I’m not hobbled by being a certain shape. I’m no longer that avuncular round bloke. It does feel liberating on many levels,' he continued. ",
        "While inside the cinema, Timothy watched a panel discussion from John Hannah who plays Gwyneth Paltrow's love interest James in the movie. John took to the stage with writer and director Peter Howitt and film producer Philippa Braithwaite. They discussed the ups and downs of making the iconic film and how Peter had come up with the idea while taking the tube home one day. He admitted that some of the filming - it was his first time directing - had been fraught and at one point, Gwyneth, then aged just 24, had told him, 'Just let it go, Pete.' Timothy was in good company on the night as the likes of Cheryl Baker, Andrea McLean and Jane Horrocks also turned up to give the movie a watch. ",
        "Martin Clunes also came to show his support - he is married to the movie's producer Philippa and gave Timothy a big hug when he saw him. The event was hosted by Jennie Becker, founder and host of the Sliding Doors podcast which discusses life-changing moments. Recent guests have include Bradley Walsh, Martin Kemp, Dr Alex George, Dame Arlene Philips. ",
        "Last year, Timothy was pictured with a badly bruised face as he filmed scenes for the new BBC true crime drama The Sixth Commandment in Bristol. Filming took place on a quiet residential street for the new four part series which explores the 2015 death of Peter Farquhar (played by Timothy), along with Ann Moore-Martin (Anne Reid) in Buckinghamshire. Ben, now 31, killed 69-year-old Peter in order to inherit his house and money after driving him to think he was losing his mind following a period of gaslighting. He was ordered to serve at least 36 years behind bars in October 2019 after being found guilty of Mr Farquhar's murder following a trial at Oxford Crown Court. You can listen to the podcast onApple: https://podcasts.apple.com/gb/podcast/sliding-doors/id1546497838Spotify: https://open.spotify.com/show/1ulGR6xXrVXABE1kfbxtm4"
    ]
}