{
    "articleURL": "/wires/reuters/article-12048655/SNAPSHOT-Russias-war-Ukraine-latest-Russian-drones-attack-Kyiv-again.html",
    "content": [
        "May 5 (Reuters) - Russian drones attacked the Ukrainian capital Kyiv on Thursday evening, the fourth assault in as many days subjecting residents to spasms of gunfire and explosions, and at least one drone was shot down.",
        "FIGHTING* Russia said the United States was behind a purported drone attack on the Kremlin on Wednesday night aiming to kill President Putin.* The United States dismissed as lies Russia's allegation. Ukraine also denied involvement.* Nearly 50 Russian attacks were repelled along the main sectors of the front line in eastern and southern Ukraine, the General Staff of the Ukrainian Armed Forces said Thursday evening. The heaviest fighting is still in Bakhmut and in Maryinka, further south in Donetsk region, it said.* Reuters was not able to verify the battlefield accounts.DIPLOMACY/POLITICS* Technical personnel from Turkey, Russia, Ukraine, and the United Nations will meet on Friday to discuss a deal that allows the exports of Ukrainian grains on the Black Sea, the Turkish Defence Minister said.* The U.S. Ambassador to the United Nations said on a visit to Brazil that she encouraged the government to include Ukraine in any attempt to negotiate an end to the war. She was referring to President Lula da Silva's comments calling on the West to stop arming Ukraine to allow peace talks to start.* Putin must be brought to justice for his war in Ukraine, Ukrainian President Zelenskiy said in The Hague, calling for the creation of a war crimes tribunal separate to the International Criminal Court.",
        "QUOTES* \"I don't believe they got to the Kremlin ... Our Putin is super. Nothing ever threatens him\" - Moscow resident Zifa.* \"We all want to see a different Vladimir here in The Hague, the one who deserves to be sanctioned for his criminal actions here, in the capital of international law\" - ZelenskiyRECENT IN-DEPTH STORIES* ANALYSIS-Kremlin incident gives Putin cover to deepen war* COLUMN-Global ammunition race may decide Ukraine war* Liberated villages offer glimpse of precarious Ukrainian health system. (Compiled by Reuters editors)"
    ]
}