{
    "articleURL": "/wires/ap/article-12052769/At-8-fake-electors-immunity-Ga-election-probe.html",
    "content": [
        "ATLANTA (AP) - The prosecutor investigating possible illegal meddling in the 2020 election in Georgia has agreed to immunity deals with at least eight Republican fake electors who signed a certificate falsely stating that then-President Donald Trump had won the state.",
        "Defense attorney Kimberly Debrow revealed the existence of the immunity deals in a court filing Friday, saying her eight clients had accepted the agreements last month. The filing does not identify the people who were offered immunity deals.Last July, Fulton County District Attorney Fani Willis´ office revealed that each of the 16 people who signed the false elector certificate was a target of her investigation, which is examining whether Trump and his allies committed any crimes while trying to overturn his narrow election loss.The 16 fake electors met at the state Capitol on Dec. 14, 2020, and signed a certificate declaring falsely that Trump had won the presidential election and declaring themselves the state´s \"duly elected and qualified\" electors.The news of the immunity deals shows that Willis continues to work on her case as she prepares to make decisions on whether to seek charges this summer. In letters sent to law enforcement agencies late last month, she advised them to prepare adequate security as she intends to announce her charging decisions between mid-July and early September.Debrow´s filing Friday came in response to a motion filed last month by Willis seeking to bar the defense attorney from further participation in the proceedings stemming from the investigation. Debrow called Willis´ motion \"reckless, frivolous, offensive, and completely without merit.\"",
        "A spokesperson for Willis on Friday declined to comment on Debrow´s motion.At the time when Willis informed the 16 fake electors last summer that they could face charges in the investigation, 11 of them were represented by Debrow and another attorney, Holly Pierson, who were hired by the state Republican Party. Fulton County Superior Judge Robert McBurney, who oversaw the special grand jury that had been seated to aid the investigation, ruled in November that Georgia Republican Party Chairman David Shafer could not share an attorney with the other 10 fake electors represented by Debrow and Pierson. As a result, Pierson continued to represent Shafer and Debrow represented the other 10.Debrow said in the Friday filing that when the district attorney's office offered immunity deals to eight of her 10 clients, she consulted with her other two clients and they determined that the \"most conservative and practical course\" was for those two people to hire their own lawyers. She said they have since done that.In her motion last month, Willis said that in interviews with her team in April some of Debrow´s clients said another of the fake electors she represents \"committed acts that are violations of Georgia law.\" The motion also says some of Debrow´s clients said they were never told about possible immunity deals last summer despite Pierson having told the court that they had spoken to their clients and none were interested.",
        "Debrow´s representation of 10 of the fake electors represents a clear conflict and had become an \"impracticable and ethical mess,\" Willis wrote.Willis \"has falsely but publicly maligned the integrity of two well-respected and fellow members of the Bar based on fictional claims known to be untrue when made,\" Debrow wrote. \"Such reckless and unprofessional conduct is simply untenable and unacceptable.\"The only actual immunity offers made by Willis´ team came on April 4, and any prior discussions were \"highly generalized, non-individualized `offers to offer´ potential immunity to undisclosed recipients,\" Debrow wrote. Each of the 11 people she and Pierson represented last summer was provided with information in August on the existence and possible implications of potential immunity offers. All 11 of them declined the offer of potential immunity as presented at the time, Debrow wrote.Additionally, Debrow wrote, \"none of the interviewed electors said anything in any of their interviews that was incriminating to themselves or anyone else, and certainly not to any other elector represented by defense counsel.\"During the interviews with her clients last month, prosecutors never said they believed that any of Debrow's clients was incriminating another and never said they objected to her representation of all of her clients, Debrow wrote.There was no basis to disqualify her from the case before and that is even more true now that all of her clients have immunity, Debrow wrote.",
        "Meanwhile, Trump´s Georgia legal team in March filed a motion seeking to toss the special grand jury report and any evidence related to the panel´s investigation and to bar Willis from any further involvement in the case. Cathy Latham, who signed the bogus elector certificate, joined that motion on April 29. Latham had been one of the 10 represented by Debrow, but last week´s motion was filed by a different lawyer.McBurney has given Willis until May 15 to file a combined response to Trump and Latham´s motions."
    ]
}