{
    "articleURL": "/wires/ap/article-12043949/Illinois-city-backs-abortion-pills-ban-defying-legal-risks.html",
    "content": [
        "CHICAGO (AP) - An Illinois city on Tuesday banned the mailing or shipping of abortion pills, defying the state's Democratic attorney general and the American Civil Liberties Union, who have repeatedly warned that the move violates Illinois law's protection of abortion as a fundamental right.",
        "The ordinance passed the City Council in Danville, near Illinois' eastern border with Indiana, by one vote, a tiebreaker cast by Mayor Rickey Williams.This is not the first time since Roe v. Wade was overturned that local abortion restrictions have been adopted. Five local governments in Democrat-controlled New Mexico passed them, but the state´s supreme court in March blocked enforcement for now. And last year, a town in Ohio decided to rewrite its restrictions rather than defend them in court.It's not clear how Danville officials intend to enforce the ordinance. Illinois law has long shielded abortion rights. In 2019, Democratic lawmakers and Gov. J.B. Pritzker went further, specifying that decisions about contraception and abortion are a fundamental right in the state.The ordinance proposed in Danville followed public reports that an Indiana clinic planned to open a facility in the city, which is about 6 miles (10 kilometers) from the border. Indiana Republicans voted in August to ban abortion, but a legal challenge pending before the Indiana Supreme Court has kept the ban on hold since September.In a statement released after Tuesday's vote, Ameri Klafeta, director of the Women´s and Reproductive Rights Project at the ACLU of Illinois, said Danville officials had approved an \"unlawful and unenforceable ordinance.\"",
        "\"Illinois has explicitly protected the right to abortion in this state, free from governmental interference, and Danville´s vote today is in clear violation of that law,\" Klafeta said. \"We are evaluating next steps to challenge this unlawful ordinance.\"Illinois Attorney General Kwame Raoul separately warned Danville officials that state law clearly prevented the ordinance's passage and said its approval risked \"considerable legal liability and expenses.\"\"The Illinois Attorney General´s Office will continue to closely monitor the status of the proposed ordinance and stands ready to take appropriate action to ensure that Illinois law, including the Reproductive Health Act, is adhered to by Danville and its elected officials,\" Raoul, a Democrat, wrote in the letter dated Monday.Photos and video footage showed opponents and supporters gathered outside Danville's city hall building and filling the room where council members heard public comments during a four-hour meeting ahead of the tight vote.Mark Lee Dickson, who oversees the Texas-based Sanctuary Cities of the Unborn organization, was among the supporters inside the council chambers for the vote, according to the Chicago Tribune. The organization has focused on pushing cities nationwide to ban abortion and was previously tied to 2021 efforts to do so in four Ohio cities.Supportive members of the council amended the proposal Tuesday - adding that it would only take effect \"when the city of Danville obtains a declaratory judgment from a court that it may enact and enforce\" the ordinance, according to the Danville Commercial-News.",
        "The city's corporation counsel, though, warned that change would not shield the city from legal action."
    ]
}