{
    "articleURL": "/news/article-12051343/JANET-STREET-PORTER-Successions-Shiv-taught-new-way-grieve.html",
    "content": [
        "Is scheduling grief - booking a time to cry in private - tacky and tasteless, or mindful and self-aware? Most people live busy lives, so when the unexpected happens, like a sudden death, what's the best way to cope?",
        "In the latest episode of Succession, Logan Roy's only daughter Shiv rushes from a bust-up with her siblings about the sale of their business to another, more urgent 'appointment'. We soon discover her PA has reserved another room for a 20-minute private period of 'scheduled' grief.Shiv shuts the door and collapses, sobbing her heart out, only to be interrupted by her socially-inept husband Tom, who is incredulous.Once again, the writers of this brilliant show have completely wrong-footed the viewers. We knew Shiv was pregnant, and that she was conflicted about how to handle that unplanned event on top of the sudden death of her father who had controlled her life from the moment she was born. I thought this 'appointment' was a call with her gynaecologist - and perhaps even a discussion about whether to go ahead with the inconvenient birth - but it turned out to be a simple desire to make space to grieve.I carry a small paper diary everywhere and have done since I was 12.",
        "It contains appointments for hairdressers, doctors, the theatre, suppers, meetings and details of travel. In all the decades of diarising my life down to the last detail, I've never thought to book a slot to sob.I didn't cry at the funerals of my mum or dad, my sister or my best friends. Since the start of this year, people I really admired have died, but I have not stopped to mourn their passing. I rarely cry in public at all, and internalising the hurt and grief I've experienced throughout my life has become a way of coping, keeping calm and carrying on. Very British. Very stiff upper lip.",
        "Shiv showed me there could another (possibly better) way. That sorrow needs to be made space for and worked through, that it's not something you should be carrying around like a heavy suitcase which eventually causes physical damage. I schedule my physiotherapist and my favourite TV movies, so why not schedule time for mourning?In the fallout from Logan Roy's totally expected death, his children have not stopped wheeling and dealing. Even though he was an old man who had suffered serious health problems, viewers and his fictional family both imagined Roy was somehow immortal. His off-camera death was the television drama moment of the year, maybe the decade. We sat at home with our mouths hanging open, incredulous.No wonder then, that the subsequent behaviour of everyone who was connected to Logan Roy has been erratic and unstoppable. Board members making threats. Spur of the moment sackings. Threats and innuendo. Both sons - Roman and Kendall - have made impulsive decisions, acting on impulse as if movement and filling their time with actions will replace the huge loss of their father. Shiv too, has not known which way to turn - being sidelined by her brothers, without her father to offer guidance or just someone to rail against. Her husband is a useless f-wit who she can't decide whether to play with or dump.",
        "Shiv even considers a flirtation with the tech billionaire intent on buying the family business, probably because he's dangerous and exciting, and the relationship would really unhinge her siblings. If she wasn't trying and failing to grieve properly, she wouldn't even consider such a liaison. Or even casually bonk the husband she despises.",
        "Once again, she's trying to carve out a role for herself in a bearpit of competing male egos within and outside her family.By booking an appointment to grieve, Shiv has shown she's the only family member remotely capable of dealing with the huge change in their circumstances. The gaping hole at the centre of their daily existence. The person that manipulated her, directed her career, used and abused her in the corporate world in order to further his own ends, has gone. How can she have the strength to make her own life going forward?People who work in high pressure jobs - like I have done for much of my career - rarely make time for things which they haven't planned down to the last detail. We want to move onwards and upwards in our careers, and for women to do that it requires huge discipline and commitment. When something tumultuous happens, like the death of a close friend or family member, we need to take time out - but rarely do. Not dealing with grief, we are storing up trouble for our mental health in the future.",
        "On the day my sister died, from lung and brain cancer, I carried on and performed my one-women show in a theatre a long way from home, staying in a quiet country hotel. I knew her death was coming, but afterwards I just carried on working, making sure the diaries she wrote about her ghastly experiences on a mixed NHS ward were eventually published in the Daily Mail, and Ministers called to account on radio and television.",
        "When Jonathan, my friend and personal trainer of ten years, died without warning in his early forties, I had to stop walking the places where we had cycled because it brought back too many memories. When my stepson Bunny died of stomach cancer aged just 11, my husband Frank went to pieces - and I had to hold things together. I couldn't cry because his grief was so great. When Frank died - shortly after a hugely enjoyable dinner together with his next wife - I was distraught. But I was running a TV channel where everything that could go wrong was happening.I just carried on, not wanting to give the male executives who were making my life a total misery the pleasure of seeing me crack. How utterly ridiculous this seems in retrospect, this insane desire to be as macho as a bunch of middle aged, mediocre, over promoted men.",
        "Bereavement leave might sound like a good idea, but few of us ever take it, and anyway it's not always the right time. Who would have thought that the solution might turn up in a television drama- albeit one, of the highest calibre.Shiv has (unexpectedly) shown us a better way to grieve. Book it in advance - but don't duck out."
    ]
}