{
    "articleURL": "/femail/article-12060149/Worst-celebrity-performances-Lionel-Richie-blasted-disappointing-coronation-concert.html",
    "content": [
        "Lionel, 73, joins a long list of A-listers who have been panned over performancesBig stars like Mariah Carey and Fergie have completely butchered concertsTake a look back at the biggest train-wreck live shows of all timeEverybody makes mistakes - even some of the most well-polished performers on the globe. ",
        "From being caught lip-syncing to singing off-key, some of Hollywood's biggest stars have gone viral for completely butchering performances over the years.Most recently, Lionel Richie was blasted after he took the stage at the coronation concert on Sunday. While the singer, 73, didn't make any colossal mistakes, many branded the show as 'disappointing' and 'awful,' while others compared it to 'karaoke in the pub' and said his voice sounded like Kermit the Frog.",
        "Lionel joins a long list of A-listers who have been panned over woeful performances and disastrous stage mishaps over the years.Back in 2016, Mariah Carey had a painfully-awkward moment when she performed at Dick Clark's New Year's Rockin' Eve - and was exposed for not actually singing live after facing technical difficulties.And who could forget the time that Fergie actually peed herself during a Black Eyed Peas concert? The songstress later explained that they were running so late that she didn't have time to use the bathroom before the show, while branding it as the most 'unattractive moment of her life.'Yoko Ono once joined her husband, John Lennon, and musical icon Chuck Berry for a performance - but when she started screaming incoherently into the microphone, both the audience and Chuck were left completely mortified.",
        "Green Day singer Billie Joe Armstrong had an explosive meltdown midway through an appearance at the iHeartRadio festival in 2012, which saw him smash his guitar and scream obscenities for nearly a minute straight. From Mariah's now-infamous New Year's Eve performance to Billie's bizarre rant - take a look back at the biggest train-wreck performances of all time. Mariah Carey faced a lip-syncing disaster during her New Year's Eve performance in 2016, which ultimately led in her storming off stage",
        "Mariah had a painfully awkward moment when she took to the stage to perform at Dick Clark's New Year's Rockin' Eve in 2016 - but ultimately stormed off minutes later after suffering from a lip-syncing disaster.The All I Want For Christmas Is You songstress, now 54, was supposed to belt out her hit songs Emotions and We Belong Together, as well as a cover of the holiday classic Auld Lang Syne, during the live ABC show - but things quickly went amiss.",
        "When the second song kicked off, Mariah seemed to struggle to hear the vocal track in her ear piece.She suddenly stopped moving her mouth, while the sound of her voice continued to play - proving that she wasn't actually singing live.Furious over the disaster unfolding in front of millions, a flustered Mariah paced around the stage, without even attempting to make it look like she was singing - before she eventually left.",
        "'S*** happens,' she wrote on Twitter afterwards. 'Have a happy and healthy New Year everybody. Here's to making more headlines in 2017.'Mariah's reps were quick to blame Dick Clark Productions for the train-wreck performance, claiming that the company knew there was technical problems, but purposely didn't fix them because it wanted to 'get ratings.''I will never know the truth, but I do know that we told them three times that her mic pack was not working and it was a disastrous production,' her manager said.'I'm certainly not calling the FBI to investigate. It is what it is: New Year's Eve in Times Square. ",
        "'Mariah did them a favor. She was the biggest star there, and they did not have their act together.'Dick Clark Productions responded by calling her suggestion 'defamatory, outrageous and frankly absurd.''We had no involvement in the challenges associated with Ms. Carey's New Year's Eve performance,' the company added.'In very rare instances, there are of course technical errors that can occur with live television.'In an interview with Entertainment Weekly days later, Mariah admitted she was 'mortified' by the entire incident.'All I can say is Dick Clark was an incredible person and I was lucky enough to work with him when I first started in the music business,' she told the outlet.",
        "'I'm of the opinion that Dick Clark would not have let an artist go through that and he would have been as mortified as I was in real time.'Ashlee Simpson was also caught lip-syncing when the wrong song started playing during her appearance on Saturday Night Live in 2004 ",
        "Ashlee Simpson was also caught in a nightmare lip-syncing situation during an appearance on Saturday Night Live in 2004.",
        "The singer, now 38, was supposed to perform the tune Autobiography, but she was left humiliated when the vocal track to a completely different song started playing instead.Ashlee looked around confused for a couple seconds - before she tried to make the most of the tense moment by dancing. She ultimately walked off stage midway through the song.The botched performance quickly went viral at the time - especially because Ashlee had previously slammed the act of lip-syncing.'I'm totally against it and offended by it,' she told MTV. 'I'm going to let my real talent show, not just stand there and dance around. Personally, I'd never lip-sync. It's just not me.'When asked about the appearance by TRL months later, she said she was forced to fake the live performance after suffering from acid reflux and losing her voice. Green Day singer Billie Joe Armstrong had an explosive meltdown at the 2012 iHeartRadio festival - which resulted in him screaming obscenities and smashing his guitar",
        "Green Day singer Billie left some people raising their eyebrows when he had an explosive meltdown midway through the band's performance at the 2012 iHeartRadio festival.After discovering their set had been cut down due to a scheduling conflict, the musician, now 51, went on a bizarre rant, which resulted in him screaming obscenities and smashing his guitar.After noticing a clock counting down how much time they had left on stage, Billie yelled, 'You're going to give me one minute? One f***ing minute?'I've been around since f***kng 1988 and you're going to give me one f***ing minute? I'm not f***ing Justin Bieber, you motherf***ers.'",
        "He dropped the F-bomb more than 20 times in the single minute he had left before organizers turned his microphone off.Afterwards, the group issued an apology, stating: 'Green Day wants to apologize to those they offended at the iHeartRadio Festival in Las Vegas.'The band regretfully must postpone some of their upcoming promotional appearances.'It was reported that Billie had checked into rehab days later.Red Hot Chili Peppers guitarist John Frusciante purposely played at the wrong tempo during the band's performance on Saturday Night Live in 1992 - after he became unhappy with their level of fame",
        "The Red Hot Chili Peppers' Saturday Night Live performance of their song Under the Bridge in 1992 was disastrous. ",
        "It's been said that guitarist John Frusciante, now 53, was not happy with the band's sudden stardom and purposely sabotaged the appearance by playing at the wrong tempo. At one point, he even started screaming loudly over the music.In his autobiography, Scar Tissue, front man Anthony Kiedis spoke about the tense moment.'I had no idea what song he was playing or what key he was in. He looked like he was in a different world,' the now 60-year-old recalled.'We were on live TV in front of millions of people, and it was torture. I started to sing in what I thought was the key, even if it wasn't the key he was playing in. 'I felt like I was getting stabbed in the back and hung out to dry in front of all of America while this guy was off in a corner in the shadow, playing some dissonant out-of-tune experiment. I thought he was doing that on purpose, just to fuck with me.'Yoko Ono started screaming incoherently into the microphone when she joined Chuck Berry and husband John Lennon on stage in 1972",
        "When Yoko joined her husband, John, and musical legend Chuck on stage in 1972, she left the audience - and Chuck - stunned when she started screaming incoherently.Midway through their rendition of Memphis, Tennessee, Yoko, now 90, let out a loud, blood-curdling wail out of nowhere.Chuck appears to suddenly widened his eyes with surprise, before continuing on with the performance. Fergie peed her pants during a performance with Black Eyed Peas in 2005, and later called it the 'most unattractive moment of her life'",
        "In a shocking turn of events, Black Eyed Peas singer Fergie actually peed her pants during a performance with the R&amp;B group in 2005 - which she later branded as the 'most unattractive moment of her life.'The Big Girls Don't Cry songstress, now 48, was seen singing with a giant wet spot on her crotch area.",
        "While reflecting on the 'embarrassing' moment during an appearance on Hot 97 in 2014, she explained that she was rushing to get onstage and didn't have enough time to use the bathroom first.'We were late for stage, driving down the freeway, it's Friday traffic,' she recalled. 'We get to the stage, and we have to start the show [immediately].'I'm running on and do Let's Get It Started [first], and I get crazy. I jump and I run across the stage and my adrenaline was going and gosh...' she trailed off. 'I wish it didn't happen. It was so embarrassing.'Fergie also faced scrutiny over a performance when she sang the National Anthem at the NBA All-Star game in Los Angeles, California, in February 2018, and it was panned as the 'worst ever.'At the time, many people took to social media to blast her rendition of the classic tune, with one joking that it was so bad it made Colin Kaepernick stand and tell her not to 'disrespect the National Anthem like that.'A slew of mishaps plagued Led Zeppelin's performance at Live Aid in 1985 - including singer Robert Plant losing his voice, their guitar being out of tune, and Phil Collins stepping in as drummer",
        "When Led Zeppelin took to the stage at Live Aid in 1985 and reunited for the first time following drummer John Bonham's death five years prior, fans were excited to see the band back together again.",
        "But unfortunately, many were left disappointed when numerous things went terribly wrong.Not only did singer Robert Plant's voice sound scratchy and hoarse, but guitarist Jimmy Page's instrument was completely out of tune.In addition, Phil Collins decided to join them as a second drummer last minute - but it was clear that he didn't know the songs and kept messing up.'It was horrendous,' Robert, now 74, told Rolling Stone a few years after it went down. 'I was hoarse. I'd done three gigs on the trot before I got to Live Aid. ",
        "'We rehearsed in the afternoon, and by the time I got onstage, my voice was long gone.'In addition, he told the outlet that they faced technical problems which made it hard for them to hear themselves through the ear pieces.Jimmy, now 79, previously put the blame on Phil for the calamitous performance, stating, 'Robert told me Phil Collins wanted to play with us. 'I told him that was all right if he knows the numbers. But at the end of the day, he didn't know anything. 'We played Whole Lotta Love, and he was just there bashing away cluelessly and grinning. I thought that was really a joke.'Roseanne Barr belted out the National Anthem completely off-key at a baseball game in 1990, and it was so bad she even started covering her ears",
        "When actress, comedian, and writer Roseanne Barr sang the Star-Spangled Banner at a baseball game between the San Diego Padres and Cincinnati Reds in 1990, it went down in history as one of the most-panned performances ever.She belted out the tune completely off-key and as loud as possible, resulting in many boos from the audience.It was so bad that the Roseanne star, now 70, even covered her own ears during the song, however, some have speculated that she was being humorous with the painful performance. Rachel Platten was left mortified after she forgot the words to the National Anthem in 2018 and had to start over - before begging the audience to sing it for her",
        "Rachel Platten had an awkward moment when she took to the field to sing the National Anthem at a soccer game between the Utah Royals and the Chicago Red Stars in April 2018. The Fight Song songstress, now 41, forgot not one, but two lines of the well-known song, having to start over and then forcing the audience to sing it for her.",
        "'I feel really embarrassed, honestly. I'm having a hard time forgiving myself, but I'm working on it. It was incredibly, incredibly embarrassing,' she told People magazine afterwards. 'I've been trying to retrace steps of what happened … it has just been hanging over me.'I was so nervous going into it. The anthem is such a big deal, it's probably the most important song for our country. 'I always get nervous because it means so much because it is so powerful. I always want to do it justice, do a good job and give people the exact version they expect and they want.'I have done it a bunch of times, but I stepped in front of the people and I felt the expectation. I was ready to open up and do it, and my mind just went blank.'"
    ]
}