{
    "articleURL": "/wires/ap/article-12055467/Byron-Larson-Hendrick-Motorsports-row-Kansas.html",
    "content": [
        "KANSAS CITY, Kan. (AP) - William Byron scraped the wall in practice at Kansas Speedway, then proceed to set the fastest time in qualifying, and will be joined on the front row by Hendrick Motorsports teammate Kyle Larson for Sunday's NASCAR Cup Series race.",
        "Byron turned a lap of 179.206 mph on Saturday to earn his second pole of the season and the 10th of his career - all of them coming at different tracks. The trick now is to turn that first-row starting spot into a victory at Kansas, where he got his first win in the Truck Series but has never finished better than sixth in NASCAR's top series.\"Feels great. Feels really good to get a pole,\" Byron said. \"I think you're going to see a good race. I think this car races well on the mile-and-a-halfs and hopefully we'll be able to move around and find some clean air.\"As for the damage on his No. 24 Chevrolet?\"I think it's fine,\" Byron said. \"I kind of dragged the wall being a dummy the second lap of practice. It seems like the car is fine. We can kind of polish up the quarter panel just to make it look nice for Sunday.\"Larson was among the fastest in qualifying as Chevrolet power dominated the day. His lap of 179.170 was good enough for the second starting spot, while Ross Chastain qualified third in the Chevy-powered No. 1 car for Trackhouse Racing.\"Cool to be on the front row there with William,\" Larson said. \"Wish I could have went a little bit better. I have to look at the data to see where I gave up a little bit of time to him. Still feel like we have to work on our car quite a bit in race trim.\"",
        "The forecast is for temperatures in the 90s on Sunday, which could make the race even more unpredictable.\"I think it lends itself to moving up (to the wall),\" Larson said. \"Maybe with it being so hot it slows the pace down, where the other lanes develop. It didn't seem like that in practice but we didn't run that long, either.\"After winning Monday's rain-delayed race at Dover, Martin Truex Jr. led the Toyota contingent - who swept Kansas last year with 23XI Racing - with a fourth-place qualifying run. Truex also made the list this week of NASCAR's 75 greatest drivers.\"Honestly, this sport is so difficult to manage emotionally,\" Truex said. \"You're always just trying to look at the positives and look at everything that's good. And you know, you go through your questions about not winning for 50-some races and it's like, all of a sudden you win a race and you're on the list of the 75, you know, best drivers in history.\"It's just very humbling,\" Truex said, \"and you know, just honored to be on that list. Honored to be back in victory lane.\"Tyler Reddick rounded out the top five in the No. 45 car for 23XI - the same car that won the race twice last year, Kurt Busch driving it in the spring and Bubba Wallace in the fall. No car has won at a track three straight times with different drivers.",
        "\"Had to race against 23XI last year and it was really cool to see all the speed they had, knowing I would be going there at some point,\" said Reddick, whose car needed three trips through inspection to pass and had his car chief ejected.Brennan Poole's car also failed inspection twice and the team was penalized a crew member.___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}