{
    "articleURL": "/news/article-12057751/warwick-tollermarche-quantum-seas-family-break-silence.html",
    "content": [
        "Family reveal health struggles of man lost in PacificWarwick Tollemache fell overboard from cruise shipHe suffered crippling migraines for years before tragedyPain led to mental illness but unable to get medical help Do you know more? Contact tips@mailonline.com The heartbroken family of the Australian lost overboard from an Hawaiian cruise ship have blasted doctors who allegedly abandoned him when crippling migraines shattered his mental health.",
        "Warwick Tollemache, 35, from Brisbane, was lost at sea after vanishing late at night from the Quantum of the Seas, 1400km south of Hawaii, on April 25.His devastated relatives have told Daily Mail Australia of the 'playful, cheeky, good-humoured, and extremely kind-hearted person' they knew and loved.'He always had a radiant smile,' his family told Daily Mail Australia in a loving tribute published in full below. 'He had an incredible gift for spreading kindness, love, and compassion wherever he went. He touched the lives of countless people with his generosity and deep empathy.'But they blasted Queensland Health for allegedly failing him in his lengthy battle to get help for the blinding headaches which plagued the 'brilliant' academic.",
        "He already had two degrees, in business and then exercise science, and had won several prestigious awards for academic excellence during his studies.But his dreams of becoming a doctor or a physiotherapist were dashed by the onset of the migraines and he was unable to get the treatment he needed, say his family.Tortured by intense pain, Mr Tollemache would often try to self-medicate with alcohol, until the agonising misery began to test his sanity, they revealed.'His life took a devastating turn, developing severe, chronic, and debilitating migraines that affected him daily,' said his family, through his sister Sarah.",
        "'Warwick sought help from both public and private healthcare systems but was repeatedly turned away and refused treatment or dignity. 'This lack of care led to self-medication with alcohol at times and eventually to mental illness.'",
        "April 12: The Quantum of the Seas cruise ship departs Brisbane bound for Honolulu, Hawaii with a stopover at Tahiti.April 25, 11pm (local time): An Australian man falls overboard from the cruise ship into the Pacific Ocean, 1400km south of the Hawaii. The ship comes to an abrupt halt as a desperate late night search is launchApril 26, 1.30am (local time): The Quantum of the Seas continues on its voyage as the US Coast Guard launches an extensive air and sea search.April 26 (local time): The US Coast Guard spends the day scouring the ocean. Massive swells overnight  made the search 'almost impossible'.  An C-130 Hercules aircraft completed five searches over the course of six hours as a radio call-out was issued to all vessels in the Pacific Ocean south of Hawaii to keep a lookout for the missing man.April 27 local time/April 28 AM AEST:  The US Coast Guard suspends the search for the missing man overboard following discussions with the man's family, the Australian consulate and other authorities.The man is later identified as Brisbane man Warwick Tollemache, 35, in a heartbreaking statement from his family.",
        "They say medics refused to help when he pleaded with them for relief from his agony.'On countless occasions, Warwick was made to wait for 12-plus hours in the waiting room of the Princess Alexandra Hospital, only to never be seen by a doctor,' said his family.'The rare times he was seen by a doctor, despite Warwick and his family begging for help, he was turned away.'Warwick, who found joy and purpose in helping others, was treated with a complete lack of humanity, respect, care, and compassion. 'This culture of neglect and disregard for patients' dignity within Metro South Health is dehumanising, and it is shameful that Warwick was a victim of such systemic failure.'His family said Mr Tollemache tried to remain positive, even trying to help others where he could, despite the pain he was suffering himself.And his relatives did what they could to ease his agony outside of the support of the health system.'His family spent countless days and months trying to provide an inpatient level of care at home, which should have been provided by the public and private hospitals that failed him,' they added.'The family is seeking answers from Metro South Health.'Mr Tollemache had boarded his cruise ship at Brisbane on April 12 for the voyage to Honolulu, with a stopover in Tahiti, before the tragedy unfolded.",
        "The alert that he had fallen overboard was sounded at 11pm on April 25 and the ship circled in the dark for two and half hours searching in vain for him.The ship resumed its voyage at 1.30am on April 26 before an air-sea search was launched at dawn by the US Coast Guard, but massive sea swells hampered the hunt.On April 27, the decision was finally made to call off the search after no trace of him was spotted in the sea.",
        "'Warwick's ultimate goal was to make the world a better place and to spread love and kindness, and this is his greatest legacy,' said his family. 'One of the fondest memories that Warwick and his sister Sarah share together is one of the days they spent doing random acts of kindness; one of Warwick's favourite pastimes. 'They bought flowers for strangers, paid for groceries for others, and spent the day giving compliments and generous tips to strangers. It was a testament to Warwick's character that he was happiest when spreading love and positivity. 'The Tollemache family is working to ensure that his legacy continues, and his friends and community are already supporting this effort.'A spokesman for Metro South Health said the service 'offers condolences to the family for the loss of their loved one.'",
        "They added: 'Mental health conditions are complex and crises can stem from a number of triggers.'Help is available for anyone having suicidal thoughts by calling Lifeline on 13 11 14 or patients of our service within the Metro South Health catchment have access to 1300 MH CALL.'",
        "The Tollemache family is devastated by the tragic loss of our beloved son and brother, Warwick.Warwick was a playful, cheeky, good-humoured, and extremely kind-hearted person, who always had a radiant smile. He had an incredible gift for spreading kindness, love, and compassion wherever he went, and he touched the lives of countless people with his generosity and deep empathy. His father, John, describes him as the kindest, gentlest, most loving person who got his joy out of other people's happiness; that he spent his life making other people happy. Warwick was a beacon of love; he was literally love personified.John remembers the many times when his sons, Dylan and Warwick, had a rule that whoever called 'shotgun' first, would get to sit in the front seat of the car. Despite often being the first to call it, Warwick would let Dylan sit there instead, finding more joy in his brother's happiness than he found in sitting in the front himself.",
        "'You're one of the good guys of this world, Woz', is what his father, John Tollemache, often told him.Warwick is his mother, Mandy's, pride and joy. One message that she will always cherish was Warwick's heartfelt expression of gratitude: 'I've grown into a man who knows he always has been and always will be loved unconditionally by his mom… and the world isn't a scary place anymore… coz you got me… We got this'.Warwick was a natural leader who inspired everyone around him to be their best selves, which was one of the reasons he was made captain of his school's first fifteen rugby team. One of his friends recently summarised this well, stating: 'You were a leader to us all, my friend. You were braver, you knew so much when we were all just kids figuring out who we were... 'You guided us through being teenagers, and I will miss you for the rest of my life. Thank you for being such a beautiful person; your light was cut short, and we needed more like you in this world...' Warwick was a reliable friend who you could always count on to lift you up and help you through your toughest times.Warwick's impact on those around him cannot be overstated, and nowhere was this impact more evident than in his unbreakable bond with his brother, his 'brozzie dog', Dylan. They were more than just brothers; they were best friends who shared the deepest bond that two brothers could ever share. They were always there for each other, through all of life's ups and downs, and their unwavering love and support for one another knew no bounds. Whether it was hitting the gym together, going out fishing, or playing World of Warcraft late into the night, Warwick and Dylan loved spending time together and never took their bond for granted. Warwick's love and strength will live on in Dylan's heart forever, and their bond will never be broken.He had a talent for making people laugh and was always quick with a joke or a kind word. Warwick also loved writing and drawing, writing in his journal every day, writing stories, and letters. He had a gift with words, and when Warwick spoke, everyone listened and were very often brought to tears with his beautiful and profound way with words and view of the world.",
        "Warwick was also brilliant, earning two university degrees - first in Business and then in Exercise Science. He received multiple prestigious awards for academic excellence during his second degree. He had ambitions to become a physiotherapist or a doctor and was studying hard for the GAMSAT when his life took a devastating turn, developing severe, chronic, and debilitating migraines that affected him daily.Warwick sought help from both public and private healthcare systems but was repeatedly turned away and refused treatment or dignity. This lack of care led to self-medication with alcohol at times and eventually to mental illness.On countless occasions, Warwick was made to wait for 12+ hours in the waiting room of the Princess Alexandra Hospital, only to never be seen by a doctor. The rare times he was seen by a doctor, despite Warwick and his family begging for help, he was turned away. Warwick, who found joy and purpose in helping others, was treated with a complete lack of humanity, respect, care, and compassion. This culture of neglect and disregard for patients' dignity within Metro South Health is dehumanising, and it is shameful that Warwick was a victim of such systemic failure.Despite the challenges he faced, Warwick remained incredibly positive, strong, and brave throughout his recovery, including always making himself available to anyone in need. His family did everything they could to support him and spent countless days and months trying to provide an inpatient level of care at home, which should have been provided by the public and private hospitals that failed him. The family is seeking answers from Metro South Health.One of the fondest memories that Warwick and his sister Sarah share together is one of the days they spent doing random acts of kindness; one of Warwick's favourite pastimes. They bought flowers for strangers, paid for groceries for others, and spent the day giving compliments and generous tips to strangers. It was a testament to Warwick's character that he was happiest when spreading love and positivity.Warwick's ultimate goal was to make the world a better place and to spread love and kindness, and this is his greatest legacy. The Tollemache family is working to ensure that his legacy continues, and his friends and community are already supporting this effort."
    ]
}