{
    "articleURL": "/tvshowbiz/article-12061481/Channel-Seven-confirm-new-season-Farmer-Wants-Wife.html",
    "content": [
        "Channel Seven has confirmed a new season of Farmer Wants A Wife is in the works as this year's series comes to an end.",
        "The dating show's official Instagram page posted a casting call on Monday for single farmers looking for a partner.'Single Farmers. It's your turn to fall in love!' it read.'If you're ready to find your soulmate, apply now.'In the caption, they wrote: 'CALLING ALL SINGLE FARMERS. It’s your turn to fall in love on the most successful dating show in Australia. Apply now for #FarmerAU 2024 (link in bio).'",
        "Farmer Wants a Wife has been a major ratings blockbuster for Seven.The long-running dating show scored a massive national average audience of 1.01million viewers, according to new TV ratings system VOZ.It comes as the farmers of this year's season chose their final two ladies following several romantic 24-hour dates on Sunday night's episode.At the last farewell dinner, Farmer Brad chose Clare and Morgan, Farmer Brenton selected Rachel and Sophie, Farmer David chose Emily and Lorelei, and Farmer Matt picked Annabelle and Olivia.",
        "Samantha Armytage took over as host for this season of FWAW, replacing Natalie Gruzlewski - who still appears on the show in a diminished role.Within the first 15 minutes of the show, Natalie, 46, was only featured in several frames, where she interviewed past couples, while Samantha was heavily featured as she introduced the new contestants.Sam joined the dating show as a 'guest host' last year, but her minor role has now been expanded while Natalie is 'scaling back' her duties.",
        "Natalie will present her own segment called 'Nat's Getaway' during the 2023 season, with Sam 'front and centre' as the face of the franchise.An insider told New Idea recently that Sam had successfully won over network executives by transferring her presenting skills to the reality TV realm.'She is now in a place to get just about anything she wants from hereon in,' they said.They added Sam was an ambitious woman who was already considering further opportunities with Seven after switching from breakfast show Sunrise to FWAW.'Sam has plans afoot. She's cleverly stayed on the network's radar knowing if she landed and nailed a lead role like in FWAW then doors would open.'Farmer Wants A Wife continues 7.30pm Tuesday on Channel 7 and 7plus "
    ]
}