{
    "articleURL": "/news/article-12061061/Woke-issues-dont-matter-public-claims-Keir-Starmer.html",
    "content": [
        "Keir Starmer thinks Tories have made 'major strategic blunder' on woke issuesBut critics claimed he was 'out of step' with British public opinion on wokerySir Keir Starmer will today tell his top team that 'woke' issues do not matter to the public as he tries to build on Labour's success in last week's local elections.",
        "The opposition leader believes the Tories have made a 'major strategic blunder' in thinking that voters care more about such matters than the cost of living crisis and the NHS.But critics yesterday rounded on his apparent dismissal of 'woke' concerns weeks after he provoked a row by again struggling to define what a woman is.In his most recent intervention in the gender debate, the Labour leader said the majority of women – '99.9 per cent' – do not have a penis, meaning around one in 1,000 women do.Former minister Sir John Hayes said yesterday: 'It comes as no surprise that Keir Starmer does not want to talk about these issues because he knows his party is out of step with the British public on them.",
        "'This is a man who is so in hock to the bizarre views of his bourgeois activists that he is unable even to state that being a woman is a matter of biological fact, not fashion.'It is the Left that started this culture war on British values and history, and now it is telling us we shouldn't be fighting it.' Sir John, chairman of the Common Sense Group of Tory MPs, noted that Sir Keir had tried to silence the debate after a Coronation weekend in which 'people have been taking great pride in the customs, traditions and history which some in his party would have us apologise for'.",
        "He added: 'Of course the NHS and the cost of living are vitally important – they are about how we live. But these other issues are about who we are.'The reason Starmer doesn't want to talk about them is because he knows the British public want a party that will stand up for traditional values and he cannot do that.'Sir Keir will tell his top team that last week's local election results, in which the Conservatives lost more than 1,000 seats, showed the public is not interested in waging a war on woke.'The NHS trumps woke every day of the week,' he will say.A Labour source said: 'Keir believes that the Tories have made a big strategic blunder in believing that woke issues are more salient to voters than the cost of living and the NHS.' One minister said woke issues could not be divorced from the delivery of services such as health and education.'We face a constant battle dealing with this nonsense, whether it's hospitals talking about pregnant people or schools letting boys into girls' toilets,' the source said. 'You cannot just ignore it or it will get worse, which is exactly what would happen under Labour.'Sir Keir faced criticism from some Labour figures at the weekend after boasting he was 'on course' to become prime minister in the wake of the party's local election success.",
        "But he will strike a more cautious tone when he addresses the Shadow Cabinet today, saying 'the hardest part lies ahead'.He will say: 'The local elections showed that the country was desperate for change. The fact that Labour won in all parts of the country was a sign of the strides we have made.'But there is understandably a lot of scepticism about politics out there and now we need to go from reassurance to hope.'We need to show that we will be a big reforming government bringing hope of a better life for working people.'Sir Keir has been involved in repeated rows over what he considers a woman to be since becoming leader in 2020.In an attempt to clarify his position last month, he told The Sunday Times: 'For 99.9 per cent of women, it is completely biological... and of course they haven't got a penis.'His comments suggested he believes one woman in 1,000 has male genitalia, or more than 34,000 people in the UK."
    ]
}