{
    "articleURL": "/tvshowbiz/article-12057421/Georgia-Kousoulou-pulls-stops-son-Brodys-2nd-birthday-party.html",
    "content": [
        "Georgia Kousoulou pulled out all the stops for her son Brody's 2nd birthday party on Sunday. ",
        "The TOWIE star, 31, took to Instagram to share a gallery of snaps from the lavish turtle-themed party.The entrance of the party was kitted out with a blue and green balloon board which had, 'Brody is turtley two, written across it. The TV personality gifted her only child, who she shares with beau Tommy Mallet, a large two tier oceanic cake with a number two on top and also purchased several sea animal helium balloons. In another photo, Georgia showed off a huge charcuterie spread which included breads, olives, meats and cheese. ",
        "The reality stars had a blue themed indoor play area set up inside their home which had several rubber ramps, a slide and two rocking motorcycles. The couple placed a large blackboard in front of the soft play area that read: 'Brody turns 2' as Georgia captioned the post: 'The kids loved this soft play area'.A table was set up with turtle plates and wooden cutlery with several cushions laid out for the children to sit on. The couple also hired a huge bouncy castle with a clear dome around it for the celebrations which had a number of blue balloons inside. Georgia and Tommy hired several entertainers for the party including two characters from the hit kids TV show Paw Patrol as well as a mermaid. ",
        "Georgia looked incredible for the occasion in a blue patterned dress as she posed for a photo with her son. If all the elaborate decorations weren't enough, Brody and his friends were also treated to meeting real life turtles.  It comes after the couple gave fans an update after revealing the devastating news last month that they suffered a miscarriage.",
        "Georgia took to her Instagram with a heartfelt post in April as she prepared to undergo surgery.The heartbroken star revealed the couple had been told of their loss at their 12 week scan.Giving fans an update, Tommy, 30, explained that he is 'so proud' of Georgia, who is on the mend after surgery.He penned: '&amp; just like that life changes, it’s been a rough few days for my family but as always we keep it moving, Georgia is on the mend and it’s mine and Brodys mission to build her back up..'We was documenting the pregnancy for our show and found out the bad news whilst filming, and as a family we’ve always said we need to keep it real no matter what, so we are going to finish the show off and hopefully help some people along the way! (sic)He added: 'I’m so proud of Georgia, thank you for the messages we really appreciate it'",
        "Georgia posted a black and white photo of herself in her hospital bed as she told followers the miscarriage shock had left her 'without words'.Writing: 'Our 12 week scan to be told our baby had not survived &amp; I needed an op…'",
        "'12 weeks of feeling every emotion, hoping &amp; praying but in the end, nothing else we could of done''We don’t really have the words to say right now except we are lucky to have amazing family &amp; friends around us .. &amp; most importantly we are blessed to have our beautiful Brody who we couldn’t of got through this without him'.Before adding: 'We will have the words soon but right now we are taking time for us as a family'."
    ]
}