{
    "articleURL": "/wires/ap/article-12055851/AP-News-Brief-12-04-m-EDT.html",
    "content": [
        "Suspect in Texas mall shooting identified as 33-year-old man",
        "ALLEN, Texas (AP) - The gunman who killed eight people at a Texas outlet mall was identified as a person who had been staying at a nearby motel, but his motive was a mystery Sunday, a day after the attack turned an afternoon of shopping into a massacre.Three law enforcement officials who spoke to The Associated Press named the gunman as Mauricio Garcia, 33, who was fatally shot Saturday by a police officer who happened to be near the suburban Dallas mall. The officials spoke on condition of anonymity in order to discuss details of an ongoing investigation.One of the officials said investigators have been searching the motel and a home in the Dallas area connected to the suspect. The official said police also found multiple weapons at the scene after Garcia was killed, including an AR-15-style rifle and a handgun.Authorities released few details in the aftermath of the assault. They offered no clues about why Garcia would open fire on strangers or any details about those who were killed, including their names.The shooting was the latest attack to contribute to the unprecedented pace of mass killings this year in the U.S. Barely a week before, five people were fatally shot in Cleveland, Texas, after a neighbor asked a man to stop firing his weapon while a baby slept, authorities said.",
        "___SUV driver hits crowd at Texas bus stop near border; 7 deadBROWNSVILLE, Texas (AP) - An SUV slammed into a crowd Sunday, killing at least seven people and injuring at least 10 who were waiting at a bus stop outside a migrant shelter in the border city of Brownsville, Texas, police said.Shelter director Victor Maldonado of the Bishop Enrique San Pedro Ozanam Center said he reviewed the shelter´s surveillance video on Sunday morning after receiving a call about the crash.\"What we see in the video is that this SUV, a Range Rover, just ran the light that was about a 100 feet away and just went through the people who were sitting there in the bus stop,\" Maldonado said.The city bus stop is across the street from the shelter and is not marked. There was no bench, and people waiting there were sitting along the curb, Maldonado said. He said most of the victims were Venezuelan men.He said the SUV flipped after running up on the curb and continued moving for about 200 feet (about 60 meters). Some people walking on the sidewalk about 30 feet from the main group were also hit, Maldonado said. Witnesses detained the driver as he tried to run away and held him until police arrived, he said.",
        "___Yellen: 'No good options' if Congress fails to act on debtWASHINGTON (AP) - Treasury Secretary Janet Yellen said Sunday that there are \"no good options\" for the United States to avoid an economic \"calamity\" if Congress fails to raise the nation's borrowing limit of $31.381 trillion in the coming weeks. She did not rule out President Joe Biden bypassing lawmakers and acting on his own to try to avert a first-ever federal default.Her comments added even more urgency to a high-stakes meeting Tuesday between Biden and congressional leaders from both parties.Democrats and Republicans are at loggerheads over whether the debt limit should even be the subject of negotiation. GOP lawmakers, led by House Speaker Kevin McCarthy of California, are demanding spending cuts in return for raising the borrowing limit, while Biden has said the threat of default shouldn't be used as leverage in budget talks.Yellen, interviewed on ABC's \"This Week,\" painted a dire picture of what might happen if the borrowing limit is not increased before the Treasury Department runs out of what it calls \"extraordinary measures\" to operate under the current cap. That time, she said, is expected to come in early June, perhaps as soon as June 1.\"Whether it´s defaulting on interest payments that are due on the debt or payments due for Social Security recipients or to Medicare providers, we would simply not have enough cash to meet all of our obligations,\" she said. \"And it´s widely agreed that financial and economic chaos would ensue.\"",
        "___Michigan faces pushback with gun red flag law set to passLANSING, Mich. (AP) - Karen Kobylik knew her daughter should not have a gun. She had repeatedly called the police since her daughter turned 21, pleading with them to take her firearms because of the risk she posed to herself and others.\"They said we can´t take any guns away from her because we cannot step on her Second Amendment right,\" Kobylik told The Associated Press. \"I was like, `I´m a mother telling you that this kid´s got a mental issue that is not currently being addressed.´\"Kobylik´s daughter, Ruby Taverner, shot and killed her brother and boyfriend before taking her own life in the early morning of May 8 last year. Kobylik believes all three lives could have been saved had red flag laws, also known as extreme risk protection orders, existed in Michigan that would have allowed police to remove her daughter´s guns and prevented her from purchasing more.Now Michigan is poised to become the 20th state - and the first in nearly three years - to pass a red flag law. It would allow family members, police, mental health professionals, roommates and former dating partners to petition a judge to remove firearms from those they believe pose an imminent threat to themselves or others.",
        "Kobylik said her daughter had been treated for mental health problems including depression since the age of 7 but had stopped taking her medication at 18. Just days before the killings, Taverner purchased the Glock 43X used in the shooting after she had been released from a psychiatric hospital for threatening to take her own life, Kobylik said.___Black voters backing Biden, but not with 2020 enthusiasmCOLUMBIA, S.C. (AP) - LaJoia Broughton, a 41-year-old small-business owner, considers herself a fan of President Joe Biden.He´s provided opportunities for Black-owned business while bringing integrity to the White House, she said. Her decision for 2024 is not in doubt.\"Biden has proven himself in the last few years, and I´ll be voting for him in the next election,\" said Broughton, who owns a lobbying and public affairs firm in Columbia, South Carolina´s capital city.Destiny Humphreys is less enthusiastic. The 22-year-old senior at South Carolina State University, the state´s only public historically Black college or university, or HBCU, said she´s disappointed in the president, feeling his accomplishments have so far not lived up to his promises.\"Honestly, I feel like right now America is in a state of emergency. We need some real change,\" said Humphreys, who remains unsure about her vote in next year´s election.",
        "___To improve kids' mental health, some schools start laterDREXEL HILL, Pa. (AP) - In the hours before he's due at Upper Darby High School, senior Khalid Doulat has time to say prayers, help his mother or prepare for track practice.It's a welcome shift from last year for him and thousands of students at the school, which pushed its start time back by more than two hours - from a 7:30 a.m. start time to 9:45 a.m. One goal for the change: to ease strains on students that were more visible than ever coming out of the COVID-19 pandemic.\"I´ll be honest, I´ve been much happier in the mornings,\" Doulat said. \"I´ve been more positive, and I´ve come to school smiling more rather than, you know, grudging out of bed and stuff like that at 7:30.\"The idea of later school start times, pushed by many over the years as a way to help adolescents get more sleep, is getting a new look as a way to address the mental health crisis affecting teens across the U.S.For some schools, the pandemic allowed experimentation to try new schedules. Upper Darby, for one, initially considered later start times in 2019. Ultimately, it found a way to do it this year by using distance learning as a component of the school day.___Far-right activist Ammon Bundy's latest standoff is in courtEMMETT, Idaho (AP) - A far-right activist best known for his showdowns with federal and state law enforcement officials in Oregon and Nevada is waging a one-sided standoff of a different kind after refusing to comply with court orders in an Idaho defamation lawsuit.The lawsuit by St. Luke's Regional Health was filed more than a year ago, accusing Ammon Bundy and his close associate Diego Rodriguez of making defamatory statements against the hospital and its employees after Rodriguez's infant grandson was temporarily removed from his family and taken to St. Luke's amid concerns for his health.Since then, Bundy has ignored court orders related to the lawsuit, filed trespassing complaints against people hired to deliver legal paperwork, and called on scores of his followers to camp at his home for protection when he learned he might be arrested on a warrant for a misdemeanor charge of contempt of court.\"We can build a defense system from here. ... This is what is going to keep us safe from all the terrible things that are going to come upon us and throughout the world,\" Bundy told dozens of people gathered at his home in late April, according to a video of the speech posted to Facebook.Bundy´s rhetoric is similar to how he spoke during his armed standoffs with federal law enforcement in Nevada and Oregon several years ago. But this time - despite frequent YouTube videos, far-right media interviews and a \"call to action\" text sent to People´s Rights network members - Bundy hasn´t gained the same traction. The initial gathering of dozens appears to have shrunk to a handful.___Vida Blue, led Oakland to 3 World Series titles, dies at 73Vida Blue, a hard-throwing left-hander who became one of baseball´s biggest draws in the early 1970s and helped lead the brash A´s to three straight World Series titles before his career was derailed by drug problems, died Saturday, according to the team. He was 73.Oakland did not announce a cause of death. Blue had used a walking stick to assist his movement at a 50th anniversary of the 1973 Oakland Athletics´ championship team on April 16.\"He was engaging. He was personable. He was caring,\" ex-teammate Reggie Jackson said during an interview with The Associated Press on Sunday. \"He was uncomfortable with the crowd.\"Blue was voted the 1971 American League Cy Young Award and Most Valuable Player after going 24-8 with a 1.82 ERA and 301 strikeouts with 24 complete games, eight of them shutouts. He was 22 at when he won MVP, the youngest to win the award. He remains among just 11 pitchers to win MVP and Cy Young in the same year.Blue finished 209-161 with a 3.27 ERA, 2,175 strikeouts, 143 complete games and 37 shutouts over 17 seasons with Oakland (1969-77), San Francisco (1978-81, 85-86) and Kansas City (1982-83). He appeared on the Hall of Fame ballot four times, receiving his most support at 8.7% in 1993, far short of the 75% needed.___'Waste of time': Community college transfers derail studentsFirst came the good news. After taking classes at a community college, Ricki Korba was admitted to California State University, Bakersfield, as a transfer student. But when she logged on to her student account, she got a gut punch: Most of her previous classes wouldn´t count.The university rejected most of her science classes, she was told, because they were deemed less rigorous than those at Bakersfield - even though some used the same textbooks. Several other courses were rejected because Korba exceeded a cap on how many credits can be transferred.Now Korba, a chemistry and music major, is retaking classes she already passed once. It will add a year to her studies, plus at least $20,000 in tuition and fees.\"It just feels like a waste of time,\" said Korba, 23, of Sonora, California. \"I thought I was supposed to be going to a CSU and starting hard classes and doing a bunch of cool labs.\"Every year, hundreds of thousands of students start at community colleges hoping to transfer to a university later. It´s advertised as a cheaper path to a bachelor´s degree, an education hack in a world of ever-rising tuition costs.___`Guardians of the Galaxy Vol. 3´ opens to $114 millionThere is nothing like the promise of a chapter closing to draw people to the movie theater, especially when tied to the Marvel Cinematic Universe. This weekend, \" Guardians of the Galaxy Vol. 3,\" which says goodbye to this iteration of the space misfits and its driving creative voice, director James Gunn, earned $114 million in ticket sales from 4,450 locations in North America, according to studio estimates Sunday.Internationally, where the film opened in 52 territories including China, \"Vol. 3\" earned $168 million, giving it a $282 million global debut.Domestically, it´s both an impressive sum for any movie and slightly less than what we´ve come to expect from a Marvel opening. Last year on the same weekend, \"Doctor Strange in the Multiverse of Madness,\" riding on the success of \"Spider-Man: No Way Home,\" raked in $187.4 million in its first three days in North America. And in November, \"Black Panther: Wakanda Forever\" also opened over $181.3 million.But things have come back to earth this year, at least by high-flying superhero standards. \"Ant-Man and the Wasp: Quantumania\" debuted just over $106 million on its way to $474 million worldwide. At rival studio DC/Warner Bros., \"Shazam! Fury of the Gods\" only made $133.4 million total. The question on some analysts' minds this weekend is whether it´s because of the specific character or a bigger issue of \"superhero fatigue.\"\"Guardians Vol. 3\" bumped \" The Super Mario Bros. Movie \" out of first place after four weekends atop the charts and kicked off the summer movie season, a vital and usually profitable corridor for Hollywood that runs through Labor Day and often accounts for 40% of a year´s box office."
    ]
}