{
    "articleURL": "/wires/pa/article-12047645/Thomas-Frank-Managers-aware-behaviour-s-not-easy.html",
    "content": [
        "Brentford head coach Thomas Frank has acknowledged managers like himself and Liverpool’s Jurgen Klopp must be aware of their touchline behaviour, but conceded sometimes emotions do get the better of them.",
        "Klopp was charged with improper conduct by the Football Association on Tuesday over his post-match comments about Paul Tierney after he insisted the referee “had history” with the club, having raced down the touchline to celebrate wildly in front of fourth official John Brooks following Liverpool’s stoppage-time winner in the 4-3 victory over Tottenham.The German has until Friday to respond and this weekend’s visit of Brentford may end up being his last on the touchline if the FA decides to ban the 55-year-old, with Klopp having already served a one-match suspension in November for confronting assistant referee Gary Beswick in their win over Manchester City.Frank said: “I think we all as managers need to think about how we present ourselves on the touchline and of course we need to be aware of that.“I try my best but I am not perfect. I have also done things that afterwards I am thinking I should have done a little better there.“We’re only humans and there is a lot of emotion and pressure in those situations.",
        "“This situation, I don’t know. I don’t know what exactly happened. I guess it is up to Jurgen to explain.“I think in general Jurgen is coming across very well and then there are some times where we are very emotional and we maybe make a mistake.",
        "“As I said, I try my best but sometimes the emotions and the pressure over time just gets you.”Bees boss Frank was otherwise full of praise for his opposite number ahead of Saturday’s trip to Anfield, where the visitors will eye an unlikely first ever double over Liverpool.Last season Brentford suffered a 3-0 loss on Merseyside and their manager reflected on the strangeness of football that Klopp’s side were so close to an unprecedented quadruple in the 2022-23 campaign while now they are set to miss out on the top-four.“Sometimes I try to get my head around that Liverpool last year were so close to the perfect season,” Frank said.“They played every possible game they could and just missed out by a point in the league. And they played a Champions League final they should have won, they were unlucky. Now this year they are, in their terminology, struggling a little bit and that is only losing (Sadio) Mane.“Football is so strange.“I think the job they have done there over the last four or five seasons should have brought even more titles for them. I think they have been quite unlucky.”Brentford beat Liverpool at home in January with Yoane Wissa on target, and the forward agreed a new deal with the west London club on Thursday to keep him there until 2026.",
        "Frank said: “He’s a very important player. It is a privilege to have a player that we know can always provide goals.“I think that is a very important skillset to have in the squad and then it is up to me to find and put the best players on the pitch.“He is very, very good to work with and fantastic for the group, so I’m very pleased we managed to extend his contract.”"
    ]
}