{
    "articleURL": "/news/article-12057323/Social-media-reacts-Coronation-concert-Queen-reaching-bag-Ed-Balls-lookalike.html",
    "content": [
        "More than 20,000 royal fans have joined King Charles for Coronation concertLIVE: Follow all the latest royal news and updates on Coronation events here TV viewers watching King Charles' Coronation concert have blasted the 'awful' sound system and quality of music on social media tonight at they tuned in from home.",
        "The King and Queen were joined by 20,000 royal fans in the grounds of Windsor Castle as they watched the likes of Lionel Richie, Katy Perry and Olly Murs as part of the magnificent display.   The newly crowned monarchs, joined with other senior members of the royal family, were seen beaming as the watched the performances from the celebrated musicians. But those watching the much-anticipated pop show in their homes quickly flocked to social media to give scathing reviews of the concert's sound quality.'This is a cruise ship concert. It's absolutely shocking', one wrote.Another added: 'The sound of the main microphone is awful for all those who used it.' ",
        "The King and Queen, crowned at Westminster Abbey yesterday, were sat next to Prince George, Princess Charlotte and the Prince and Princess of Wales in the royal box, however, it was past the bedtime of Prince Louis, five, who stayed at home.The royals donned their glowstick wristbands and got on their feet to dance as Lionel performed All Night Long.Charles and Camilla were seen laughing and chatting as they bopped along to the music, including Katy Perry's performance of Roar and Firework, while the Duke and Duchess of Edinburgh were also seen getting in the party mood. While those in the audience did not seem to be affected by any sound issues, those on social media blamed a faulty microphone for making some of the performances sound 'awful'.",
        "Some questioned whether there was a 'problem' with the sound systems that was affecting the quality for at-home viewers. Other eagle-eyed viewers, however, took to social media to joke around about what they had seen throughout the concert. As newly crowned Queen Camilla dived into her bag after DJ Pete Tong got proceedings underway, it didn't take long for the internet to come up with the best theories for what she was looking for.'Genuinely thought Camilla was knitting,' one person quipped.While another user, who also noticed the Queen rifling through her bag, added: 'Camilla loves a free goodie bag just as much as the rest of us!'",
        "A third joked: 'What's Camilla pulling out of her Mary Poppins bag' and a fourth urgently tweeted: 'THIS IS NOT A DRILL. CAMILLA HAS BROUGHT HER KNITTING.' As viewers at home tried to guess what was in Her Majesty's bag, another joked: 'Nice to see Camilla get the Minstrels out her bag.' Others at home noted more standout moments from the concert, with some convinced they had seen another Ed Balls lookalike - just a day after royal fans likened the former shadow chancellor to Welsh opera singer Sir Bryn Terfel who sang at the King's Coronation.Tonight, royal fans were convinced that Mr Balls was part of the 300-strong choir that were brought together to perform for the King tonight.",
        "During their performance of Brighter Days by Emeli Sande, one user, posting a photo of the choir member, joked: 'There are a lot of Ed Balls lookalikes at this Coronation!'Those who could not attend in person have been keeping social media users entertained at home with their verdicts.One user joked: 'These dancing beefeater outfits are hideous'.",
        "Social media has also been dominated by Prince Louis - who once again warmed the nation's hearts at the Coronation - after it emerged he was not in attendance with his two older siblings.One person said: 'Where's Prince Louis!?! He's the most entertaining out of the lot of them!'Another joked: 'Louis isn't here cancel the concert'. A third added: 'Where is Prince Louis?! I wanted the entertainment ffs.'A fourth came up with his own conclusion, tweeting: 'Prince Louis ain't there because he's a little devil and not because its past his bedtime. I mean it's a one off I'm sure he could stay up...' "
    ]
}