{
    "articleURL": "/wires/ap/article-12052751/Bears-rookie-OT-Wright-ready-settle-protect-Fields.html",
    "content": [
        "LAKE FOREST, Ill. (AP) - Darnell Wright was ready to slip into a more normal routine after a wild week and settle into his new job.",
        "The offensive tackle from Tennessee has an important task for the Chicago Bears in helping to protect quarterback Justin Fields after being drafted with the No. 10 overall pick last week. And the first rookie minicamp practice Friday was another step as he tries to settle into his new role.\"Today has been a better day just mentally, just because I can just play football and do football,\" Wright said.The Bears are banking on the 6-foot-5, 333-pound Wright to do quite a bit for them after the feisty blocker helped Tennessee re-establish itself as a national power. He was first-team, All-SEC as a right tackle last season after playing left tackle in 2021, and helped the Vols go 11-2 while finishing sixth in the final AP poll.Wright delivered a memorable performance when he helped contain Will Anderson in a win over Alabama. And the Bears are looking for more of that after making him the second offensive lineman taken in the draft.Coach Matt Eberflus said Wright is just about where the Bears need him to be when it comes to understanding their expectations.",
        "\"I think he´s in a good spot,\" he said. \"He retains information very well. Obviously his movement skills and athleticism are gonna be on point. But we´re gonna have to really harness him in there and how he uses his body. And understanding that it´s gonna be a little different every week, because you´re gonna be blocking different types of pass rushers. He´s got to learn the scheme. Learn what works for him. And that´s a process. It takes time to be able to do that.\"",
        "The Bears are counting on Wright to help give Fields the protection he sorely lacked last season. The quarterback was sacked 55 times, tying Denver's Russell Wilson for most in the NFL.General manager Ryan Poles made some moves in the offseason to help Fields develop into the passer the Bears hope he becomes. Topping the list was trading the No. 1 pick to Carolina for star receiver DJ Moore and a haul of draft selections.They signed former Tennessee Titans veteran guard Nate Davis to a three-year, $30 million contract. And they gave their quarterback a few more assets on the final day of the draft, taking Texas running back Roschon Johnson and Cincinnati wide receiver Tyler Scott in the fourth round.Poles has been noncommittal when asked whether Wright will line up at right tackle or left tackle.Braxton Jones is coming off a solid season at left tackle as a rookie. The Bears could opt to keep him there and have him and Wright at the positions they played last season.Whether he's on the right or left side, Wright will have to get used to more huddles after playing in an up-tempo offense in college.\"I´d say the only challenge is that the plays are a lot longer just because we want it to be fast,\" Wright said. \"That´s kind of a challenge, but then you have a few extra seconds to actually think.\"",
        "As for the playbook, Wright said it's pretty similar.\"There´s not much of a difference. It´s more so the terminology of it's different just because we ran an up-tempo offense,\" he said. \"Other than that, like, I mean, a lot of the stuff is the same. It´s O-line play.\"___AP NFL: https://apnews.com/tag/NFL and https://twitter.com/AP_NFL"
    ]
}