{
    "articleURL": "/tvshowbiz/article-12053033/Janice-Dickinson-quits-Im-Celeb-rushed-hospital-following-air-horror-fall.html",
    "content": [
        "Janice Dickinson has reportedly been forced to quit I'm A Celebrity South Africa following a horror fall while left her 'whole chin gashed open'.",
        "It was previously reported that the former model 68, had to make an early exit from the ITV show after sustaining an injury, with the incident occurring when the pre-recorded programme was shot last year.And now, Janice has opened up about her terrifying ordeal which saw her rushed to hospital after the accident which will not air on TV.Viewers will see the campmates told of Janice's exit during Monday's episode. In a new interview, the TV personality revealed that she tripped and fell flat on her face while trying to find the toilet in the middle of the night.",
        "She told The Sun's TV Mag: 'I was feeling very insecure because the campfire had gone out and it was as dark as it could be. So I thought: Right, I'll make it to the dunny from memory.''I walked a couple of steps and tripped, flying flat on my face – hair all over my forehead, my nose was bloody and my whole chin was gashed open. 'Blood was gushing from all these areas, and there was dirt and stones embedded in my face from the fall.'She added: 'All I could feel was an intense head pain – from one to ten it was about a nine – and I was just lying there, moaning. It was a freak accident that happened so quickly.'",
        "Luckily, Janice was found by Fatima Whitbread and Phil Tuffnell, who quickly picked her up off the floor and helped her back to the campsite.The US star, who was 'moaning and crying' with pain, was then helped to her bed before a medic came into camp to assess her. Janice recalled that she was taken to the medical hut where she was cleaned up and given pain relief.She was then transported via ambulance, in which she was given a compress for her head and chin, to a 'tiny hospital in the middle of nowhere', while her husband Robert Gerner - who was already in South Africa - was called. In the interview, Janice told how she was in 'agony' as medics cleaned her wounds and was given a morphine shot to help ease her pain. ",
        "MailOnline have contacted I'm A Celebrity representatives for comment. Janice's exit news comes after she and Carol Vorderman, 62, were slammed by viewers on Friday after they both refused to take part in the gold-mine Bushtucker trial.In the latest episode of the show, the camp had to split up into two teams consisting of the yellow team and the green team and were pitted against each other.Both the team captains - Joe Swash and Dean Gaffney - were forced to choose two contestants to take part in the trial.",
        "However, before the trial, hosts Ant McPartlin and Declan Donnolly revealed a cruel twist to the campmates by announcing that whichever two lost would be sent home.The green team captain Joe Swash, 41, first decided to ask his team for volunteers and tried to ask Janice.",
        "However, Janice refused to take part, while Carol, who also didn't volunteer, said she was 'not happy' with the end choice as it could mean the exit of two strong team members.After asking the camp members who wanted to volunteer Joe then proceeded to pick Andy, 42, and Toff, 28, who appeared enthusiastic, while the yellow team captain picked Jordan, 33, and Myleene, 45.As the scenes played out on screen, fans were quick to take to Twitter to share their rage by criticising Janice and Carol for their behaviour ahead of the Bushtucker trial. I'm A Celebrity...South Africa continues Monday at 9pm on ITV1 and ITVX. "
    ]
}