{
    "articleURL": "/news/article-12060681/Menendez-brothers-NEW-trial-gunning-parents.html",
    "content": [
        "The Menendez brothers, Erik and Lyle, may get a new trialThey were convicted in 1996 of murdering their parents Jose and Kitty at their Beverly Hills mansion seven years earlier and were sentenced to lifeBut a letter Erik wrote to his cousin as well as former boy band member Roy Rossello's claims that he was raped by their dad provide new evidenceTwo brothers serving a life sentence without the possibility of parole for murdering their parents in 1989 may now get a new trial.",
        "The Menendez brothers, Erik and Lyle, were convicted in 1996 of murdering their parents Jose and Kitty at their Beverly Hills home seven years earlier.Their attorneys filed a petition in Los Angeles Superior Court on Wednesday, arguing that the brothers deserve a new trial based on the new evidence.Los Angeles District Attorney George Gascon is now considering that request, according to Los Angeles Magazine. 'We have received the habeas petition in the Menendez matter, and it's currently under review,' a spokesperson said in a statement.During the trial, the brothers admitted to the shooting, but claimed the killings followed years of sexual and physical abuse — and sought a lesser charge of manslaughter, which the trial judge did not allow the jury to consider.But their high-end defense attorneys say a recently-unearthed letter Erik wrote to his cousin less than a year before the August 20, 1989 killings, as well as former boy band member Roy Rossello's claims that Jose Menendez raped him when he was just a teenager, may support the brother's assertion that they were abused. ",
        "In their request for a new trial, the Menendez brothers' attorneys, Mark Geragos and Cliff Gardner said 'newly-discovered evidence directly supports the defense presented at trial, and just as directly undercuts the state's case against petitioner.'",
        "The attorneys cite a hand-scrawled letter Erik wrote to his cousin, Andy Cano, eight months before the fatal shooting.In the letter, Erik writes: 'I’ve been trying to avoid dad. It’s still happening Andy but it’s worse for me now. I can’t explain it. He so overweight that I can’t stand to see him.'I never know when when it’s going to happen and it’s driving me crazy. Every night, I stay up thinking he might to come in. I need to put it out of my mind. 'I know what you said before but I’m afraid. You just don’t know dad like I do. He’s crazy! he’s warned me a hundred times about telling anyone especially Lyle.''Am I a serious whimpus?' he continues. 'I don't know I'll make it through this.'I can't handle it, Andy. I need to stop thinking about it.'The petition for a new trial also cites new evidence that emerged in a new documentary on the case, titled Menendez + Menudo: Boys Betrayed, airing on Peacock.In the documentary, former boy band member Roy Rossello describes an incident of sexual abuse at the hands of Jose Menendez, who was the president of RCA Records when the label signed the band, Menudo.He said the band's founder, Edgardo Diaz, brought him to the Menendez home in New Jersey to broker a deal between the band and RCA when Jose allegedly drugged him and raped the then-teenager. ",
        "And in a declaration attached to the petition, Rossello said that Jose anally raped him twice, and orally copulated with him, when he was 13 or 14. ",
        "The petition filed last Wednesday argues that, had the jury been presented with this evidence in 1996, Erik and Lyle may not have been sentenced to life in prison without the possibility of parole.'The theory of defense at both trials was straightforward. Neither Erik nor Lyle denied the shooting. Instead, the crime was manslaughter, not murder. The killings occurred in imperfect self-defense, after a lifetime of physical and sexual abuse from their parents,' the petition states.'The state’s theory in both trials was also straightforward. Erik and Lyle were lying about the sexual abuse. It never happened. They had killed their parents not in imperfect self-defense, but to inherit their parents’ money,' the filing continues.'Had jurors seen the letter Erik Menendez wrote to Andy Cano, and learned that Jose Menendez anally raped and orally copulated a 13 or 14 year-old boy in 1984, the prosecutor would not have been able to argue that “the abuse never happened,”' the attorneys argued. 'In short the new evidence not only shows that Jose Menendez was very much a violent and brutal man who would sexually abuse children, but it strongly suggests that -- in fact -- he was still abusing Erik Menendez as late as December 1988. Just as the defense had argued all along,' the petition states.",
        "The brother's murder trial captured the nation in the early 1990s, because they appeared to be a family of great affluence and wealth.Lyle, who was 22 at the time, had been attending Princeton, while Erik was a professional tennis player, and was 19 when his parents were killed. Prosecutors had argued that the brothers were greedy, spoiled children who killed their parents in cold blood at their $5 million Beverly Hills mansion, then went on a spending spree with their parents' multi-million dollar fortune.The brothers had shot Jose point blank in the back of the head, then shot Kitty in the leg as she tried to run out of the room.  Jose was shot five times, and Kitty nine. But the Menendezes argued at trial that they were driven to kill their father and mother after a lifetime of physical, emotional, and sexual abuse, saying their father had threatened to kill them if they did not keep the abuse a secret.Erik even testified that he was sodomized by his father for the first time when he was just six-years-old, and Lyle testified that Jose also made him molest his own brother when they were children.During their first trial the brothers claimed that when they confronted their father about the alleged crimes, he became enraged – forcing them to kill him out of concern for their safety.",
        "The trials were some of the first to be aired on television, with some jurors in the first trial believing their testimony of abuse. The juries in the first trial deadlocked after the votes split on conviction for manslaughter or murder.However in the trial in which the brothers were convicted, the judge banned cameras, restricted witnesses testimony relating to the abuse, and restricted the jury to deciding on a verdict of first-degree murder.Both brothers were unable to name any other witnesses or victims of their father during the trial, with Judge Stanley Weisberg ruling that it was not admissible.",
        "A criminal defense lawyer told the Peacock documentary that the allegations made by Rossello have given the brothers a 'glimmer of hope' that it could make a difference in their case.Both Erik and Lyle are heard on the documentary discussing how the new evidence found could have made an 'enormous difference' at their trials.Erik said: 'Frankly I feel horrible. It's sad to know that there was another victim of my father.'I always hoped and believed that one day the truth about my dad would come out but I never wished for it to come out like this, the result of trauma that another child has suffered and it makes me very sad. '"
    ]
}