{
    "articleURL": "/wires/afp/article-12044087/USAID-WFP-halt-food-aid-Ethiopias-Tigray-diverted-shipments.html",
    "content": [
        "USAID and the World Food Programme announced on Wednesday they were freezing food aid to Ethiopia's war-scarred Tigray region after finding shipments were diverted to local markets.",
        "\"We have made the difficult decision to pause all USAID-supported food assistance in the Tigray region until further notice,\" said Samantha Power, head of USAID, the US government's main international aid agency.The agency recently \"uncovered that food aid, intended for the people of Tigray suffering under famine-like conditions, was being diverted and sold on the local market,\" Power said in a statement.The WFP also said it had \"paused\" food distributions in Tigray after learning of food diversion problems.The distribution \"will not resume until WFP can ensure that vital aid will reach its intended recipients,\" it said in a statement.Neither body identified who was taking the food aid and reselling it.But they said they had raised the issue with Ethiopian federal and Tigray regional officials.The WFP said it had reminded regional officials that they need to monitor and report illicit activities and enforce food distribution agreements.Power said authorities had pledged to help identify the people behind the diverted supplies and hold them accountable.\"USAID stands ready to restart paused food assistance only when strong oversight measures are in place and we are confident that assistance will reach the intended vulnerable populations,\" she said.WFP said it \"takes this issue extremely seriously and will not tolerate any interference in its distribution of critical food aid to the most vulnerable women, men and children.\"",
        "Millions of people in Tigray suffer from food shortages after a devastating two-year war between pro-government forces and the Tigray People's Liberation Front.WFP said 84 percent of the Tigray region faces a food crisis.\"WFP is resolutely committed to ensure life-saving food assistance reaches those most in need efficiently and effectively,\" it said.A peace deal signed on November 2 just passed the six-month mark and implementation of the accord has progressed slowly without a major return to fighting.Power said USAID continues to distribute nutritional supplements, drinking water and support for farming and development."
    ]
}