{
    "articleURL": "/tvshowbiz/article-12038451/Donna-DErrico-55-shows-stunning-figure-boy-shorts.html",
    "content": [
        "Baywatch veteran Donna D'Errico posted two new photos to her Instagram page this week.",
        "The Playboy model was seen in a tiny white string bikini top as well as little micro boy shorts in army green with white piping.The former Baywatch actress was in a back yard by a swimming pool as she posed by lawn furniture.The social media favorite flaunted her very impressive curves while her light blonde hair was down.The star was displaying her golden Malibu tan as she stood out in the sunshine in Los Angeles.",
        "'Boyshorts FTW. Have a gorgeous Monday my lovely friends! ❤️ #linkinbio,' she wrote in her caption.Fans raved over her look.'Happy May, Donna, you are amazing,' said one as another added, 'Still gorgeous.'Another fan then shared: 'Hot and beautiful Donna.'Last week the beauty - who recently turned 55-years-old - was seen sucking on an ocean blue popsicle.'Partly sunny with a chance of popsicles ☀️,' wrote the blonde bombshell to her 1.7 million Instagram followers.The comments were very positive as one follower said, 'You are still beautiful' and another shared, 'Lovely lady.'In late March she turned 55 and celebrated by sharing a photo where she was pulling off a red one piece swimsuit.It looked similar to the suit she wore to star in the TV series Baywatch.",
        "She also had on a small white top which she pulled up to show off her underboob.",
        "Also in March the actress shared her frustration over haters who called her sexy posts 'raunchy.'The nude model again expressed her fury over the trolls who depict her as trashy. Donna took to Instagram to share a sexy photo of herself in a light pink lacy lingerie set while at her Los Angeles home. She was in profile as she flashed a coy look.And in her caption she again lashed out at those who criticized her looks as she said if she is raunchy, so is Victoria's Secret.",
        "Victoria's Secret is a lingerie company that is known for posing very sexy images of models like Bella Hadid and Hailey Baldwin in skimpy lingerie.The full caption read, 'If this is raunchy then so is @victoriassecret.'She added, 'I think this is pretty. My very first post on tiktok and everyone goes nuts are you serious. With all the smut that’s out there? People kill me. I’m laughing.'Soon after she posted another racy image.In this one, she had on a plunging one piece undergarment.In her caption she said, 'Here’s me squatting again in a bathing suit. It’s so fun doing this thing called whatever I want.'",
        "She then praised her fans: 'I love you guys so much. Thank you all for being so kind. Have a gorgeous day.'A week ago the blonde beauty took to her Insta Stories to slam critics who said her most recent bikini post on social media was 'raunchy.'A publication had called the star - who modeled a pink suit earlier this month - that word in their headline as they shared an image of her in a red string bikini.They were basing their article on a Sunday post where Donna was showing off her very slender and toned figure as she was dancing in her Los Angeles bedroom while in a tiny two piece.The suit covered her body with no wardrobe malfunctions and her dancing was normal with no twerking or rude moves but she was still she was pegged as a 'raunchy' woman.",
        "In her first post that sparked the new controversy, D'Errico was seen moving her body around for the camera while her face was partially covered.'Here’s me modeling my new line of bathing suits for women over 50. Follow me for more AARP tips,' she joked to her followers.Over the photo she wrote, 'Beach time, Are you in? Dad Bod and Thirst Trap.'Most of the comments were positive with one writing, 'Wow! You are an inspirational woman, Donna, what a body!!!' and another saying, 'Genetic lottery winner.'",
        "'Good Lord. Hey, can I get a 60th birthday shout out please?' added one fan and another added, 'Donna, you still look fantastic....Would you ever go back if they did a Bay Watch reunion?'She also let fans know she is now on TikTok, a short-form video hosting service owned by the Chinese company ByteDance which has come under scrutiny lately from the White House."
    ]
}