{
    "articleURL": "/tvshowbiz/article-12061239/Big-Little-Lies-reunion-Reese-Witherspoon-Nicole-Kidman-walk-Nashville.html",
    "content": [
        "It was a Big Little Lies reunion in Nashville, Tennessee on Monday when Reese Witherspoon and Nicole Kidman went for a power walk.",
        "The A-list pals were seen strolling along a beautiful network of manicured trails near their exclusive Southern neighborhoods. Witherspoon, 47, walked without her wedding ring as she is currently divorcing her soon-to-be ex-husband Jim Toth.The Legally Blonde star, who played Madeline Martha Mackenzie,  appeared to be driving the conversation, talking expressively throughout her walk with the statuesque Nicole.Kidman, 55, who played Celeste Wright, towered over the petite Hollywood powerhouse and listened attentively.",
        "Witherspoon was dressed in an oversized white T-shirt and baggy teal running shorts that showed off her sculpted legs. Kidman looked chic in black leggings and a snug gray jacket that showcased her athletic physique. A pink ball cap with the words 'Disco Cowgirl' crowned Reese's head while Nicole wore a simple beige cap over her long frizzy locks.The Oscar winners seemed to be enjoying the fresh air and sunshine as they caught up on their busy lives. Nicole just learned that she will unfortunately not be receiving her AFI Lifetime Achievement Award next month as planned, since the honor has been 'postponed indefinitely' due to the writer's strike, according to Deadline. But Witherspoon appeared to be doing most of the venting, as she and Toth announced their divorce just last month. The split has reportedly been very stressful for the Hello Sunshine mogul, but a source recently told People that she has 'no regrets' about deciding to end her 12-year marriage.",
        "'The divorce decision was not an easy one for her. It was rough to reach the decision and to announce it,' the source shared. 'Reese is doing much better now though. She has no regrets and is just focused on her kids and work.' ",
        "The former couple are parents to their son Tennessee James, 10, and the Sweet Home Alabama actress also shares daughter Ava, 23, and son Deacon, 19, with her first husband Ryan Phillippe.'She has a big group of loyal friends that she leans on,' the source added. 'There is no drama with Jim. They co-parent and this is the focus.' 'Reese is obviously disappointed and upset. She never saw herself getting another divorce,' an Insider told People at the time of their announcement. The source added, 'It's been very difficult for Reese to get to this point. They both concluded this was right for them.' "
    ]
}