{
    "articleURL": "/wires/afp/article-12053115/Don-vs-Ron-Why-Trump-trouncing-DeSantis-2024-race.html",
    "content": [
        "He is young, scandal-free, and a darling of conservatives for his embrace of an \"anti-woke\" agenda that has fueled his meteoric rise within the Republican Party.",
        "Yet Florida governor Ron DeSantis has failed to lay a glove on Donald Trump in the race to challenge Democratic incumbent Joe Biden for the White House in 2024 -- baffling observers who see the former president as more vulnerable than ever.On paper, the nomination ought to be a stretch for Trump, who was impeached twice during a single term, lost ground for the Republicans in three election cycles and is mired in criminal and civil probes over alleged misconduct.But the 76-year-old Republican primary frontrunner has confounded his critics, opening a double-digit lead over his former protege as DeSantis has failed to capitalize on doubts over Trump's electability.Expected to launch his campaign officially any day now, DeSantis has sold himself to the Republican establishment as a less chaotic avatar of Trumpism than Trump himself.The governor won a landslide re-election last year in what was until recently seen as a swing state, and has won plaudits from the right for taking on Florida's liberals on immigration, gun rights and education.But a number of missteps have raised red flags over the 44-year-old former military officer's readiness for national office.A bitter and avoidable feud with Florida's biggest employer Disney over its politics has bewildered champions of free market capitalism, while a six-week abortion ban he signed into law has moderates worried that he is out of touch with public opinion.",
        "- 'Low-wattage' -DeSantis has also been accused of appearing lightweight on foreign policy, taking hits for downplaying Russia's invasion of Ukraine and delivering \"low-wattage\" speeches during a recent trip to Britain.CNN political analyst Harry Enten suggested that DeSantis would be pinning his hopes on his official launch rebooting a campaign that is floundering before it has even got out of the blocks.",
        "\"If it doesn't, this may end up being one of the most boring presidential primary seasons in the modern era, given Biden's and Trump's significant advantages,\" Enten said in a recent commentary.Yet the momentum is going decidedly against DeSantis, who has seen Trump's 15-point lead at the end of March double in the most recent RealClearPolitics average of major polls.It's not just that DeSantis is backsliding: Trump's numbers have soared from the low 40s to more than 50 percent since his indictment on felony financial charges in New York.Despite that distraction -- plus the threats of a civil rape case and criminal probes into alleged election interference and mishandling of government documents -- Trump has shown focus and discipline over weeks of relentless attacks on DeSantis.- Effective leader? -The pro-Trump Make America Great Again political action committee spent millions in the spring on ads trashing DeSantis as a zealous cutter of welfare entitlements.",
        "In one particularly spectacular coup, Trump scooped endorsements from most of Florida's congressional delegation as DeSantis was out of state, on a visit to Washington.\"On the campaign trail, as scrutiny increased, DeSantis was less impressive than advertised,\" said University of Virginia professor and political analyst Larry Sabato.\"He doesn't connect well with many people, his speeches are sometimes unimpressive, and he's made some odd choices that have hurt him such as bearing down so hard on Disney -- an American icon.\"DeSantis's biggest plus is perhaps his fundraising. He is said to have a campaign war chest of up to $110 million, giving him deeper pockets than Trump's campaign or any other potential rival.But name recognition is worth more at the ballot box than cold, hard cash and Trump -- one of the world's most famous faces -- does not have to spend a fortune introducing himself to Americans.Analysts are warning against counting DeSantis out just yet, pointing to his popularity among the suburban voters Republicans desperately need in the next election.And his supporters are making a broader electability argument -- that the governor can beat Biden whereas there may be no path back to the White House for Trump.\"Governor DeSantis is a proven effective leader,\" New Hampshire House Majority Leader Jason Osborne said in a recent endorsement being touted by the Florida governor's aides.",
        "\"He has shown that he has the determination to change broken systems and fight against radical agendas trying to undermine our society.\""
    ]
}