{
    "articleURL": "/wires/pa/article-12045917/Brian-McDermott-appointed-Hibernian-s-director-football.html",
    "content": [
        "Former Reading and Leeds manager Brian McDermott has been appointed as Hibernian’s director of football.",
        "The Easter Road club announced in January that they intended to recruit someone to a position which had essentially been redundant since former sporting director Graeme Mathie left in September 2021.The search for the new figurehead was interrupted slightly following the death of owner Ron Gordon in February, but Hibs announced on Thursday morning that 62-year-old McDermott, who has had scouting roles with Reading and Arsenal in recent years since his last managerial post with the Royals ended in 2016, will take on the role with immediate effect.McDermott will be heavily involved in recruitment alongside manager Lee Johnson and will oversee football operations such as scouting, analysis, sports science and medicine. He will also work closely with academy director Steve Kean on the development of young players.“I’m delighted to join such a great, community-orientated club like Hibernian FC,” McDermott told Hibs’ website. “I scouted Hibs games many times in the past and have always been taken by the fantastic atmosphere at Easter Road.“I am very grateful for this opportunity. Having met the chairman, the board of directors, executives, Lee Johnson, all the staff, and understanding more around the culture of the football club and the objectives, I’m really excited about the challenge.”",
        "Chief executive Ben Kensell is confident Hibs have appointed the right man following a “long and extensive process”.",
        "“We are conscious that this appointment has taken some time, which is partly due to the sad passing of our late chairman Ronald J Gordon, but we also wanted to make sure that we had the right steps in place and a thorough process, to make sure we’ve got the right person in the door,” said Kensell.“Brian joins us with substantial experience in the game and has worked across numerous different roles across a football club on the sporting side, which sets him up perfectly for this role.“We also wanted someone that has a strong recruitment bias, and he has that in abundance having scouted across the world for some high-level clubs.“Brian’s background, contacts and experience will be vital as we continue to move the club forwards.”McDermott is best known for his first spell in charge of Reading when he led them from the Championship to the Premier League in 2012, while he also managed Leeds for just over a year in between his two stints as Royals boss."
    ]
}