{
    "articleURL": "/wires/afp/article-12047635/PacWest-latest-target-US-regional-bank-shares-dive-again.html",
    "content": [
        "Shares of PacWest Bancorp were in free fall Thursday after the lender's attempt to reassure investors fell flat amid another pummeling of US regional bank stocks.",
        "On an ugly day for financial stocks, two other midsized banks also suffered especially brutal trading days: First Horizon, which said its deal to be acquired by TD Bank had fallen apart; and Western Alliance Bancorporation, which denied a published report that it was considering selling itself.Shares of PacWest dropped 50.6 percent, while First Horizon plunged 33.6 percent and Western Alliance Bancorporation tumbled 38.5 percent.The rout comes one day after the Federal Reserve again lifted interest rates, a move that adds pressure to the sector.It also comes on the heels of Monday's sale of the embattled First Republic Bank to JPMorgan Chase under a process orchestrated by the Federal Deposit Insurance Corporation.\"We did not have an extended period of calm following the deal for First Republic,\" said Oanda's Edward Moya. \"The bullseye moved from one bank to another and this space is in trouble.\"Other regional banks also fell significantly, including Cleveland-based KeyCorp (-6.4 percent), Dallas-based Comerica (-12.2 percent) and Zions Bancorporation (-12.1 percent) of Utah.CFRA Research analyst Alexander Yokum described the dynamic as a \"vicious feedback loop,\" where \"fear has completely taken over.\" The tendency is exacerbated by short sellers, who make bets on falling stocks.\"There's a little bit of a self-fulfilling prophecy,\" Yokum said. \"When the stock's down, shorts get emboldened, and depositors may take their deposits out.\"",
        "- Struggling to reassure -Investors are on edge for a repeat of earlier episodes in which deposit runs precipitated or played a significant role in the spate of bank failures in the last two months.Attempting to allay worries about a similar episode, California-based PacWest said it \"has not experienced out-of-the-ordinary deposit flows following the sale of First Republic Bank and other news.\"The company \"has been approached by several potential partners and investors -- discussions are ongoing,\" PacWest said. \"The company will continue to evaluate all options to maximize shareholder value.\"Western Alliance also released a statement late Wednesday \"reaffirming its financial strength\" that said deposits had risen since the end of the first quarter. It also reported improvement in a key benchmark of bank capital closely watched by regulators.But the bank came under heavy selling following a Financial Times report that it was exploring a potential sale of all or part of its business.Western Alliance called the report \"categorically false in all respects.\"Meanwhile, First Horizon faced questions after releasing a joint statement with TD Bank saying its proposed takeover by TD was canceled because of uncertainty on the timetable for regulatory approvals.\"While today's announcement is unfortunate and unexpected, First Horizon will continue on its growth path operating from a position of strength and stability,\" said First Horizon Chief Executive Bryan Jordan.",
        "- Bigger banks advantaged -The banking industry as a whole has faced pressure from the Fed's pivot away from a long period of low and near-zero interest rates.Higher rates have forced banks to pay out higher interest for deposits. While this affects all banks, regional banks are viewed as more vulnerable to deposit flight after the recent spate of failures, analysts say.These midsized banks are also expected to face more scrutiny from regulators to show they have adequate liquidity, crimping their growth prospects.Another pressure stems from holdings of long-term Treasury-related assets that have fallen in value because of the Fed pivot.These are only \"paper\" losses for banks that have sufficient liquidity. But Silicon Valley Bank was forced to take a large loss to raise cash when it suffered a deposit run, precipitating its downfall.On Wednesday, as the Fed raised its benchmark lending rate for a tenth time, the central bank's head offered a hopeful outlook.Fed Chair Jerome Powell described the US banking system as \"sound and resilient,\" alluding to the size of SVB, First Republic and Signature, which were bigger than the banks currently in the market's crosshairs.\"I think that the resolution and sale of First Republic kind of draws a line under that period of -- is an important step toward drawing a line under that period of severe stress,\" Powell said.",
        "But the selloff in regional bank shares shows the market's skepticism of Powell's view, \"which seems to overlook the plodding but clearly apparent momentum of the problem,\" said a note from DataTrek.Analysts say a shift by the Fed could provide relief to the sector. On Wednesday, Powell signaled that the Fed could pause on further interest rate increases, but that a decision at future meetings will depend on economic data."
    ]
}