{
    "articleURL": "/femail/article-12057481/Prince-William-looked-nervous-speech-Coronation-concert-claims-body-language-expert.html",
    "content": [
        "The Prince of Wales addressed the crowds during the concert in Windsor tonightCORONATION LIVEBLOG: Click here to follow live updates throughout todayPrince William appeared 'nervous' and 'impatient' during his speech at the Coronation concert, a body language expert has claimed.",
        "Carole Railton told FEMAIL how the Prince of Wales, 40, switching 'from side to side and initially moving his feet' showed a 'nerve symptom or possibly impatience'.She added that the 'swaying slightly' is 'also used to try and look bigger, a tactic used to consciously calm yourself down'.In his speech, William told King Charles: 'Pa, we are all so proud of you,' and said that he had no doubt the late Queen Elizabeth, the monarch's 'very proud mother', would be 'fondly' looking down from heaven. William delivered his emotional address from Windsor Castle as the nation celebrated the crowning of King Charles and Queen Camilla with the official Coronation Concert, a glorious mix of music, dance and the spoken word.",
        "Commenting on William's body language, Carole said: '[The Prince] grew stronger and more balanced as the talk went on. A couple of times he raised himself up, this indicates trying to expand.' Set on a spectacular stage shaped like a multi-tier Union flag, the concert was an unashamedly patriotic highlight of a long weekend of celebrations.Events to mark Saturday's Coronation will culminate with a 'day of service' dubbed the Big Help Out as senior royals join volunteers around the country.",
        "The Prince of Wales has paid tribute to the King on stage at the coronation concert.Here is the full text of William's speech: 'Good evening Your Majesties. Good evening Windsor!'A huge thank you to everyone for making this such a special evening.'I want to say a few words about my father, and why I believe this weekend is so important.'But don't worry, unlike Lionel, I won't go on all night long.'As my grandmother said when she was crowned, coronations are a declaration of our hopes for the future.'And I know she's up there, fondly keeping an eye on us. And she would be a very proud mother.'For all that celebrations are magnificent, at the heart of the pageantry is a simple message: Service.'My father's first words on entering Westminster Abbey yesterday were a pledge of service.'It was a pledge to continue to serve.'Because for over 50 years, in every corner of the UK, across the Commonwealth and around the world, he has dedicated himself to serve others, both current and future generations, and those whose memory must not be neglected.'Take the natural world. He warned us of the risks to our planet's health long before it was an everyday issue.'Or the Prince's Trust. It has supported over a million young people, many from disadvantaged backgrounds, to realise their ambitions.'And, perhaps most importantly of all, my father has always understood that people of all faiths, all backgrounds, and all communities, deserve to be celebrated and supported.'Pa, we are all so proud of you.'I also want to express my pride and gratitude for the millions of people who serve, in the forces, in classrooms, hospital wards and local communities.'I wish I could mention you all. Your service inspires us. And tonight we celebrate you too.'I commit myself to serve you all. King, country and Commonwealth.'God save the King!'",
        "Their Majesties arrived to huge cheers and flag-waving from the 20,000-strong crowd last night, with Camilla looking elegant in a royal blue Anna Valentine jumpsuit.The Prince of Wales, who has become an increasingly assured public speaker in recent years, opened his speech with: 'Good evening, Your Majesties. Good evening, Windsor!'After thanking everyone who had helped make the evening so special, William said he wanted 'to say a few words about my father, and why I believe this weekend is so important'.The father-of-three could not resist shoehorning in a joke about one of concert star Lionel Richie's best-loved songs, saying: 'Don't worry, unlike Lionel, I won't go on all night long.'Turning serious, William left barely a dry eye in the crowd – let alone the millions watching around the world – as he told them: 'As my grandmother said when she was crowned, coronations are a declaration of our hopes for the future.'And I know she's up there, fondly keeping an eye on us. She would be a very proud mother.'For all that celebrations are magnificent, at the heart of the pageantry is a simple message: service. My father's first words on entering Westminster Abbey yesterday were a pledge of service. It was a pledge to continue to serve.'",
        "In a heartfelt homage to his father, with whom he has not always seen eye to eye, William praised the King's legacy on everything from charities such as the Prince's Trust to his pioneering work on the environment and attempts to promote interfaith and cultural harmony.He added: 'Pa, we are all so proud of you.'The prince also said he wanted to express his 'pride and gratitude for the millions of people who serve, in the forces, in classrooms, hospital wards and local communities', some of whom were in the audience. William said: 'I wish I could mention you all. Your service inspires us. And tonight we celebrate you too.'He concluded with his own stirring pledge to the nation as his father's son and heir, saying: 'I commit myself to serve you all – King, country and Commonwealth. God Save The King!'Windsor, Queen Elizabeth's favourite residence and a seat of royal power for more than 1,000 years, was an inspired venue for the concert.Stars including Richie, Katy Perry, Take That and Andrea Bocelli brought the audience to its feet.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art also came together for the first time to create a one-off performance with actor Ncuti Gatwa, who takes over the title role in Doctor Who later this year.",
        "Downton Abbey actor Hugh Bonneville, the evening's host, warmed up the crowd with some light-hearted jokes, including referring to the watercolour-painting King as 'the artist formerly known as Prince'.The concert, organised by the BBC, also featured video sketches from Tom Cruise, Dame Joan Collins and Sir Tom Jones, who recited little-known facts about the new monarch.The stage resembled the Union Flag, with catwalks jutting out from the centre and multiple levels for the 70-piece orchestra and band.",
        "As darkness fell behind the castle, its ancient facade came alive with projection and light, at one point linking up with nine other locations around the country for a dazzling 'Lighting up of the Nation'.Among the audience were dozens of winners of the Queen's Coronation Champions Awards, supported by the Daily Mail.Earlier in the day, William and Kate joined well-wishers on the Long Walk at Windsor for a surprise appearance at a Big Lunch event, one of thousands of community street parties taking place across the country, including in Downing Street.The Princess of Wales told guests that her daughter, Charlotte, eight, was 'tired' after making sure her little brother, Louis, five, behaved himself during the Coronation service.But she and George, nine, did join their parents in the Royal Box at Windsor later. Sadly, it was well after Louis's bedtime.",
        "It emerged yesterday that the King made a private toast to Prince Archie at Buckingham Palace on Saturday to mark his grandson's fourth birthday.Prince Harry's son was at home in California with his mother Meghan and sister Lilibet.Charles's estranged younger son did fly to the UK to briefly see his father being crowned but left straight afterwards to fly back to his family, without taking part in any of the other official or family celebrations.Today, Charles and Camilla thanked the organisers of the Coronation and the spectators who filled The Mall on Saturday.A Buckingham Palace spokesman said: 'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion – and to the very many who turned out to show their support in such numbers in London and further afield.'"
    ]
}