{
    "articleURL": "/tvshowbiz/article-12042755/Olivia-Bowen-slips-tiny-orange-bikini-parties-St-Tropez-hen-party.html",
    "content": [
        "Olivia Bowen flaunted her amazing figure on Instagram in a tiny cut-out orange bikini as she partied at a friend's hen party in St Tropez on Wednesday.",
        "The former Love Island star, 29, exhibited her enviable curves in the skimpy two-piece while dancing around the villa with her pals. The mother-of-one rocked a pair of chunky black sunglasses and styled her short blonde locks loose in a centre parting.Olivia seemed in high spirits as she posed for a selfie and accessorised with a simple gold chain necklace.She posed up a storm with her close friends as they kicked off the lavish celebrations with some drinks by the pool.",
        "Her latest sun-soaked getaway comes after Olivia looked sensational in an array of snaps during her recent family holiday to Barbados last month. She showed off her figure in a skimpy green bikini as she strolled along the sand hand-in-hand with son Abel, 10 months. Olivia, who shares her son with partner Alex, 31, wore a pair of Valentino shades and scraped back her short blonde locks into a ponytail.   Abel was kept out of the sun in a large bucket hat, along with a grey top and shorts.She captioned the snap:  'My favourite tiny hand to hold.'The duo, who became parents for the first time in June, had jetted off to the Caribbean island for their first holiday of the year.Sharing some pictures from the nine-hour flight to Instagram, Olivia explained to her followers how she and Alex found flying with Abel.",
        "Snapping a moment between her beau and son as they both slept during the flight, Olivia wrote on her Stories: 'I cannot believe this little boy on our flight to Barbados.",
        "'He was just amazing. Smiling laughing walking around &amp; playing with the cabin crew. He slept for two hours then was full of life again. 'He had one little moan up for 20 minutes were due to land in an hour which was his usual bedtime but then fell asleep! Cannot fault him'. Continuing to share how they kept him busy, Olivia wrote: 'Alex and I proper tag teamed! Lots of walking up and down the plane, snacks &amp; new toys he's never seen before.'Also utilise all the interesting menus &amp; seatbelts before pulling out the big games. I must say @virginatlantic cabin crew were absolutely amazing. I was just so impressed at how attentive &amp; helpful &amp; friendly every single person was.'Thank you for making our journey how it was,' she gushed while praising the in-flight staff.Adding that the family were taking the trip to enjoy quality time together, Olivia shared that she would be 'pretty quiet' on social media during the getaway.",
        "She said at the time: 'I am looking forward to just enjoying our days and being present.'",
        "Olivia and Alex, formerly a sales executive and scaffolder respectively, soared to fame in 2016 when they appeared on ITV2's Love Island, where she was an original star and he was a late but popular entrant.After leaving the villa, their romance soon when from strength to strength and Alex popped the question in New York in 2016.The couple then tied the knot in a luxurious Essex ceremony two years after meeting on Love Island during the show's second series."
    ]
}