{
    "articleURL": "/wires/reuters/article-12055789/Athletics-defeat-Royals-clinch-series-win.html",
    "content": [
        "JJ Bleday homered and doubled, leading the Oakland Athletics to a 5-4 win over the host Kansas City Royals.",
        "With wins in consecutive games for the first time this year, the Athletics also captured their first series victory.Bleday doubled and scored in the second, then lifted a one-out solo shot to right in the third, his second of the year, for a 3-1 Oakland advantage.The A's padded their lead to 5-1 in the fourth on Ryan Noda's RBI triple followed by Brent Rooker's double.Despite walking six, Ken Waldichuk (1-2) earned the win, allowing four runs on six hits and fanning six while throwing a career-high 114 pitches over five frames.Brady Singer (2-4) never retired more than two consecutive batters of the 23 he faced while going four innings, surrendering five runs on six hits and three walks.Singer has lost 4 of 5 and has allowed at least five runs in five of his last six starts, posting a 10.05 ERA.The game was delayed twice at the start, first by a retirement ceremony for former Royals star Lorenzo Cain, and later during Esteury Ruiz's leadoff at-bat when he initially appeared to be hit by Singer's 3-2 pitch. Following lengthy discussion among umpires and managers, it was ruled a foul ball and Ruiz struck out looking on the next pitch.Ruiz struck back in the second with a two-run, ground-ball single that barely snuck through the right side, then promptly stole second, his major league-leading 16th. Ruiz is hitting .441 (15-for-34) with runners in scoring position.",
        "Maikel Garcia's two-out RBI double got Kansas City on the board early as they forced Waldichuk to hurl 30 first-inning pitches.Freddy Fermin led off the bottom of the fourth with a solo shot, his second, and Bobby Witt Jr. followed with a two-run homer, his sixth, cutting Oakland's lead to 5-4.Five Athletics' relievers worked around seven baserunners over four shutout innings, with Zach Jackson earning his first save. The Royals were 2-for-13 overall with runners in scoring position.Kansas City fell into a tie with Oakland for baseball's worst record at 8-26.--Field Level Media"
    ]
}