{
    "articleURL": "/news/article-12053717/Police-snipers-stand-guard-roof-Buckingham-Palace-crowds-flock-Coronation.html",
    "content": [
        "Around 11,000 police officers will patrol the streets of London for today's eventRead more: Not on our watch! Police arrest crying 'Not My King' protesters How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Police snipers on rooftops along with armed officers patrolling the streets near Westminster Abbey are among some of the security measures in place for King Charles III's Coronation.",
        "It estimated that some 11,000 police officers are in place to form a ring of steel around today's proceedings. The ceremonial route has been lined by 45 half companies from the Royal Navy, Royal Marines, British Army and Royal Airforce. Ahead of the King setting off from Buckingham Palace, the Foot Guards of the Household Division lined the Mall, the Royal Navy lined the Admiralty Arch, the Royal Marines lined Trafalgar Square and the Royal Air Force were stationed on Whitehall and Parliament Square. The street liners were placed at five pace intervals along the procession route - with each half company comprising of one officer and 20 other ranks. ",
        "The security effort's codename is Operation Golden Orb, and police snipers have already been spotted on the rooftop of Buckingham Palace.",
        "As well as that, tactical firearms units with Koch MP5 machine guns and Glock 17 pistols will be on patrol. Armed response vehicles are also said to be on standby.It is even expected that senior police officers will use facial recognition technology for the first time ever to identify potential suspects in the crowds. Much of the security work leading up to today's major event - which is the biggest ceremony staged in the British capital for 70 years - has been done in the prior weeks. ",
        "Air cover will be provided by the Metropolitan Police Air Support Unit based at Lippitts Hill in Essex alongside other forces. Vehicle barriers have also been moved into place to stop terrorists from driving into crowds. A double layer of crowd control barriers will make it extremely difficult for anyone to get near the King during the event.  Sniffer dogs will be used throughout London to check for explosives as the public arrive at Tube stations.",
        "Earlier this week David Huber, 59, sparked a huge Buckingham Palace security scare by throwing shotgun cartridges over the gates.It was later revealed by Scotland Yard that he was allegedly armed with a knife and he warned officers his rucksack should be 'handled carefully'.The Sun claims Huber travelled to London from his remote Cumbrian cottage, where he breeds Hungarian Vizslas, for Charles's crowning on Saturday. It is reported that on the day Queen Elizabeth II died, he wrote on Facebook: 'It's a massive loss to all.'Deputy Assistant Commissioner Ade Adelekan said the man had approached officers asking to see a soldier at around 7.15pm on Tuesday.When they said that was not possible, the man allegedly began throwing shotgun cartridges over the gates. He was searched and allegedly found to be in possession of a lock knife, and was arrested on suspicion of possession of a knife and ammunition.",
        "During the arrest, the man told officers they should handle his rucksack with care, which led to a controlled explosion being carried out on the bag that could be heard live on GB News.Though neither the King nor Queen were in residence, Camilla's grandchildren had been seen arriving at Buckingham Palace hours before - while Charles had held an audience with Australian Prime Minister Anthony Albanese there earlier in the day."
    ]
}