{
    "articleURL": "/wires/reuters/article-12046445/Enbridge-reaches-toll-agreement-shippers-Mainline-system.html",
    "content": [
        "By Rod Nickel and Sourasis Bose",
        "May 4 (Reuters) - Canada's Enbridge Inc said on Thursday it has reached a toll agreement with oil shippers for its Mainline crude pipeline system, one of North America's biggest, after scrapping earlier plans for long-term contracts.The agreement, which will last through 2028 and requires Canadian regulatory approval, covers tolls charged on both the U.S. and Canadian portions of Enbridge's Mainline, which moves 3 million barrels a day from Western Canada to refineries in Eastern Canada and the U.S. Midwest. If approved, Enbridge would continue to ration space on an open-access, monthly basis.The new toll is lower than the previous one, making Canadian oil more competitive, said Colin Gruending, president of Enbridge's liquids pipelines segment.Scotiabank analyst Robert Hope said the settlement removes uncertainty that has weighed on Enbridge shares. The stock edged higher on the Toronto Stock Exchange on Thursday.Enbridge spent years trying to convince shippers and then the Canada Energy Regulator (CER) to allow it to sell space on the Mainline under long-term contracts. Some oil producers, like Canadian Natural Resources Ltd (CNRL), objected and the CER rejected the plan in 2021.\"It's positive,\" said CNRL President Tim McKay of the new deal. \"The parties got together and agreed on a fair tolling agreement.\"The Calgary-based company's rival, Canadian government-owned Trans Mountain, expects to complete expansion of its pipeline late this year and has sold 80% of that space under contract, giving it security during periods of spare capacity.",
        "As a result, the Mainline's utilization rate may drop to 95% from full, but expanding oil production and the Mainline's lower toll compared to Trans Mountain's will soon refill it, Gruending said.Enbridge expects to apply for approval to the CER in early fall, with the expectation that the settlement could be approved and implemented this year. The agreement covers 70% of Mainline deliveries, with the remaining 30% covered by a pre-existing agreement. (Reporting by Rod Nickel in Winnipeg, Manitoba and Sourasis Bose in Bengaluru; additional reporting by Nia Williams in British Columbia; Editing by Dhanya Ann Thoppil, Shounak Dasgupta and Paul Simao)"
    ]
}