{
    "articleURL": "/wires/ap/article-12057521/Goldschmidt-3-HRs-Cards-end-8-game-skid-beat-Tigers-12-6.html",
    "content": [
        "ST. LOUIS (AP) - Paul Goldschmidt homered three times, Brendan Donovan hit a three-run drive and the St. Louis Cardinals stopped an eight-game losing streak with a 12-6 win over the Detroit Tigers on Sunday.",
        "Goldschmidt, had four hits and four RBIs in his third three-homer game, the first since March 29, 2019, against Milwaukee. He hit solo homers in the first and third innings off Alex Faedo and a two-run drive in the eighth against Tyler Holton.Lars Nootbaar added a two-run single to cap off a seven-run sixth inning for the Cardinals, who had been on their longest skid in 16 years.Jake Rogers hit a grand slam for the Tigers, whose five-game winning steak was stopped. Spencer Torkelson also homered for Detroit.St. Louis sent 12 batters to the plate in the sixth to take control 10-6. The Tigers committed three errors in the frame.All three of Goldschmidt's home runs came with two strikes.",
        "\"I'm always trying to hit it hard, but there's a little adjustment with two strikes,\" Goldschmidt said. \"You can't just be up there free swinging. Sometimes, it works out like today and other times they strike you out three times.\"\"St. Louis manager Oliver Marmol says Goldschmidt displays plate discipline no matter the count.\"The guy has a really good game plan and he sticks with it,\" Marmol said. \"Pretty remarkable, very productive.\"St. Louis has won only two of 12 series' this season and is 11-24. The Cardinals got their first home win since April 19.",
        "\"Obviously, we're not happy with how this season has started,\" Donovan said. \"We could have rolled over today. This team does not quit. We're not where we want to be as far as wins and losses or how we've played to this point. Today shows you that we still have fight.\"Drew VerHagen (2-0) pitched two perfect innings.\"We're going to need a lot of wins to be able to come back from this hole that we've got ourselves into,\" Goldschmidt said. \"You can't get too far ahead of yourself. Take it game-by-game, pitch-by-pitch and see what happens.\"Donovan homered off Mason Englert (1-2) for an 8-6 lead in a seven-run sixth. Dylan Carlson and Andrew Knizner followed with hits around an error. and Nootbaar added a double.Detroit took a 6-3 lead with five runs in the sixth, all after shortstop Tommy Edman's two-out error.Miguel Cabrera followed with with a run-scoring single. Pinch-hitter Zach McKinstry drew a walk before Rogers homered off JoJo Romero.Torkelson hit his third homer of the season in the fourth inning.\"It's frustrating because we worked hard to get back in the game,\" Hinch said.Faedo allowed three runs and three hits in 4 2/3 innings. He retired his last seven hitters in his first appearance of the season.",
        "St. Louis starter Steve Matz have up one run and five hits over 5 1/3 innings. The 31-year-old left-hander has not won as a starter since last July 23.\"I thought it went well, a lot of soft contact,\" Matz said. \"Ultimately, the results were good.\"TRAINER´S ROOMTigers: RHP Spencer Turnbull was optioned to Triple-A Toledo to make room for Faedo, who was recalled.Cardinals: OF Tyler O´Neill is on the 10-day injury list with lower back tightness. He says the ailment has been bothering him for the last week.UP NEXTTigers: LHP Joey Wentz (0-3, 6.67) will RHP Tanner Bibee (1-0, 2.45) on Monday in the first of a three-game series in Cleveland.Cardinals: RHP Miles Mikolas (1-1, 5.79) takes on Cubs RHP Marcus Stroman (2-2, 2.18) in the first of a three-game set in Chicago on Monday.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}