{
    "articleURL": "/femail/food/article-12058141/MasterChef-Australia-frugal-foodie-Steph-Sousa-shares-money-saving-supermarket-meat-shopping-tip.html",
    "content": [
        "Steph De Sousa buys whole chickens and dissects them herself The hack saves her over $2000 a year Former MasterChef contestant and self-described 'frugal foodie' Steph De Sousa has revealed how she saves thousands on her food bill each year.",
        "The talented cook says she saves over 50 per cent on the price of chicken by shopping at ALDI and cutting the meat up herself.While chicken breast fillets is typically $10.99/kg, a whole chicken is only $4.49/kg.Steph dissects the chicken by herself and uses its various parts for different meals.She claims this basic culinary skill has saved her more than any other before breaking down the process for her fans.",
        "1. The Maryland For the thigh and the leg, you need to cut down the skin between the thigh and breast.'Once you've done that, pull the leg and the thigh away from the breast and expose that thigh bone.''Now, you can cut straight through past that thigh bone and remove the Maryland.' ",
        "2. The wing'It is a very similar process to the Maryland,' Steph revealed. You first pull the wing bone away from the breast bone to expose the wing joint until you can see or feel the wing bone.Then, you simply cut straight through and remove the wing bone.3. The breast In order to remove the breast, you need to run your knife down one side of the breast bone a little bit at a time.'Slowly work your knife down all the way to the bottom of the breast bone until you have exposed the entire breast,' the chef advised.",
        "After, you simply need to cut through it and disconnect it from the body.",
        "You can save over 50 per cent if you bought a whole chicken and cut it up yourselfSave 70c/kilo by buying brushed potatoes and washing them yourselfFrozen vegetables are 50 per cent cheaper than fresh vegetables and do not go sad and soggy in the fridge if you don't use them up straight awayFrozen fish is also a lot cheaper per kilo and doesn't go bad if you change your mind and want to use it later You can keep grated cheese in the freezer to prevent it from going bad Source: Steph De Sousa ",
        "'Just remember that this is a new skill, and with every new skill - you need to practice,' Steph said.'You're not going to get it perfect the first time, but don't give up.'Many were thankful for the money saving hack.'Awesome tips, I'm going to buy a whole chicken tomorrow and cut it myself,' a woman said.'I do this too, I also debone it, roast the bones, and cook them in water with vegetable scraps to make chicken stock!' another revealed. 'It saves so much.''I buy two whole chickens each fortnight which gives me eight serves of chicken nuggets, four main meals, chicken stock (first and second run) and bone meal,' a third added.",
        "But others weren't convinced.'I don't know if the $5 is worth all this extra effort,' a woman wrote.'When you buy a whole chicken you're also paying for the bones and so much that you won't eat - that's why it's cheaper,' said another.A third added: 'I respect this but raw chicken is just too gross for me to handle.' "
    ]
}