{
    "articleURL": "/wires/ap/article-12060287/Virginia-teen-dies-sand-hole-collapse-North-Carolina.html",
    "content": [
        "NORFOLK, Va. (AP) - Authorities in coastal North Carolina are investigating the death of a teenager who became trapped in a hole that was dug in the sand, the latest fatality from the scourge of sand holes that continues to claim young people's lives.",
        "The 17-year-old male died Saturday afternoon in the small resort town of Frisco, which sits along the Cape Hatteras National Seashore on the Outer Banks, the National Park Service said in a statement.Park rangers responded to a 911 call regarding a teenager trapped in a hole that was dug in a back-dune area behind the beach's primary dune along the Atlantic Ocean, the park service said. The teenager was buried under several feet of sand after an adjacent dune apparently collapsed into the hole.Rangers and other emergency responders worked with family members to rescue the teen while simultaneously performing CPR, the park service said. Efforts to revive the teen, who lived in Chesapeake, Virginia, failed.\"We urge visitors not to dig deep holes on the beach due to the danger they present to beachgoers and emergency response staff,\" the park service said in a statement on Saturday.Mike Barber, a park service spokesman, told The Associated Press Monday that the incident remained under investigation and that no new information was available.",
        "Collapsing sand holes have claimed dozens of lives over the decades. The weight of the sand makes it difficult for people to breathe, while the sand can enter people's lungs. The brain and other organs are often deprived of oxygen.",
        "In late March, a 14-year-old boy died after being buried in a sand hole in a rural area of Minnesota. Wabasha County Sheriff Rodney Bartsh said Hunter Flaxbeard´s death has been ruled an accidental suffocation.In May 2022, a 13-year-old Utah boy died after a sand dune he was digging a tunnel into collapsed and buried him at southern Utah´s Coral Pink Sand Dunes State Park.During that same month, an 18-year-old man died while playing with his sister at a beach in Toms River, New Jersey, when a large hole they were digging in the sand collapsed. His sister was also trapped but was rescued. The family was visiting from Maine.In 2014, a Fredericksburg, Virginia, man died at Salvo, on North Carolina's Outer Banks, when sand collapsed on top of him after authorities said he was tunneling between two holes.Those are just some of the examples. In 2007, Dr. Bradley Maron and his father, Dr. Barry Maron, co-authored a letter to the New England Journal of Medicine that cited 31 recreational sand hole deaths since 1985 in the United States, United Kingdom, Australia and New Zealand.They counted another 21 incidents in which a person was rescued from a collapse, in several cases by bystanders who performed CPR.",
        "Bradley Maron told The Associated Press in 2007 that he thought the sand-related deaths were less well-documented than shark attacks.The Marons´ research found there were 16 sand hole or tunnel deaths in the U.S. from 1990 to 2006 compared with 12 fatal shark attacks for the same period, according to University of Florida statistics.The father and son based their report largely on news media accounts and internet searches. Most of the incidents were from the last 10 years, when Internet reports were available.The victims, mostly boys, ranged in age from 3 to 21 years, with the average age being about 12.Maron and others advise the public not to let young kids play in sand unattended, and not to get in a hole deeper than your knees.David Elder, ocean rescue director for the town of Kill Devil Hills on North Carolina´s Outer Banks, said he finds large holes that have been dug in the sand multiple times a month.Sometimes he´ll encounter people on the beach while they´re digging them. Their reactions to his explanations of the dangers range from, \"We understand and we´ll take care of it\" to \"I didn´t even think about that.\"Those conversations about sand holes aren't much different than the ones he has with beachgoers about rip currents and excessive heat conditions.",
        "\"It's sadly one of the jobs I have to do,\" he said."
    ]
}