{
    "articleURL": "/wires/pa/article-12053913/Duke-Sussex-seated-row-coronation-father-King.html",
    "content": [
        "The Duke of Sussex took his seat in the third row for the coronation of his father the King, two rows behind his brother the Prince of Wales.",
        "Harry, wearing medals pinned to his suit jacket, chatted to his cousin Princess Beatrice and her husband Edoardo Mapelli Mozzi as he entered Westminster Abbey on Saturday in the drizzling rain.He also nodded and smiled to guests as he walked down the nave of the abbey.",
        "It is understood the prince wore what he was asked to wear, which consisted of a dark morning suit and tie.However, Harry is a Knight Commander of the Royal Victorian Order after being made so by the late Queen in 2015.This means he would be entitled to wear the order’s vivid blue mantle.",
        "Buckingham Palace had earlier confirmed that Harry and his uncle, the Duke of York, would not have any formal role at the event. They are no longer working royals.For the late Queen’s funeral last September, Harry sat in the second row at Westminster Abbey, behind Charles.All eyes were on Harry on Saturday as he sat with his relatives in public for the first time since he criticised Charles, the Queen, William and the Princess of Wales in his memoir, Spare.The Duchess of Sussex has stayed at home in Montecito, California, with their children, Archie and Lili.Archie’s fourth birthday is on Saturday, the same day as the coronation.",
        "The duke, 38, was seated in the third row at Westminster Abbey with his cousin Princess Eugenie’s husband, Jack Brooksbank, together with Eugenie, Beatrice and Mr Mapelli Mozzi.During the service, as the congregation paid homage to the new King, Harry was seen, along with the other royals around him, speaking the words: “God save King Charles. Long live King Charles. May the King live forever.”Also in the third row, at the other end from Harry, was the Duke of York, who stopped using the title His Royal Highness in an official capacity in January 2022. He wore his Order of the Garter robe which holds special significance for the royals.The Order of the Garter is the oldest and most senior Order of Chivalry in Britain.Last June, Andrew did not appear alongside senior members of the royal family at the annual Order of the Garter ceremony at Windsor Castle.",
        "William and Kate sat in the front row at the abbey for the historic ceremony, with their children Prince George and Princess Charlotte.Their youngest child, Prince Louis, who recently turned five, took his seat next to his mother after processing through the abbey and did not retire as the service began, as had been expected.Also in the front row to see Charles and Camilla crowned was the Duke and Duchess of Edinburgh.",
        "In the second row were the Duke and Duchess of Kent and the Duke and Duchess of Gloucester, alongside the Princess Royal.Harry and Andrew will be absent from the procession behind the Gold State Coach carrying the newly crowned King and Queen from Westminster Abbey back to Buckingham Palace after the ceremony.Harry is expected to attend only the abbey ceremony before returning to the US.Andrew stepped away from public life after a controversial Newsnight interview in November 2019 and the furore over his friendship with paedophile financier Jeffrey Epstein.Virginia Giuffre sued Andrew for allegedly sexually assaulting her when she was 17 after she was trafficked by Epstein.Andrew denied the claims but paid millions in an out-of-court settlement in the US civil case."
    ]
}