{
    "articleURL": "/wires/pa/article-12047627/Alleged-victim-leaves-courtroom-officer-says-tasered-fear-attack.html",
    "content": [
        "A man left paralysed from the waist down after being tasered by a police constable exited the courtroom after the officer told a jury he discharged the Taser believing the alleged victim was going to attack him.",
        "Pc Imran Mahmood, 36, is accused of unlawfully inflicting grievous bodily harm on Jordan Walker-Brown during a patrol in the early months of the first lockdown on May 4 2020.His alleged victim, who was 23 at the time, was left with “catastrophic” injuries after hitting his head on the pavement and breaking his back.He had not pulled out a weapon and presented no “physical threat” to anyone at the time he was tasered, prosecutors told Southwark Crown Court.Jurors heard Mahmood – attached to the Met’s territorial support group (TSG) which deals with outbreaks of public disorder – chased Mr Walker-Brown on foot after noticing him walking along the pavement on Burgoyne Road, Haringey, north London. I have been living like this for three years and it has been really hard for me. It has affected me massively, not only myself - my family. I was just trying to do my job  Pc Imran Mahmood  Mahmood was said to have drawn his Taser when Mr Walker-Brown jumped onto a wheelie bin to climb over a fence in the front garden of a house, creating such an electric shock that it caused the latter man to tumble backwards over the fence, land head-first on the footpath below and break his back.",
        "Giving evidence on Thursday on the anniversary of the incident, Mahmood told jurors he discharged his Taser after Mr Walker-Brown “turned around” on top of the bins, “honestly” believing the younger man was in possession of a weapon and going to “attack” him.Mr Walker-Brown left the courtroom in his wheelchair, returning later.The court heard it was the “first time” Mahmood had discharged his Taser on duty.The officer teared up and wiped his eyes while telling jurors that the incident has affected him “massively”.“I have been living like this for three years and it has been really hard for me,” he said. “It has affected me massively, not only myself – my family. I was just trying to do my job.”Mahmood added that he “absolutely” did not intend the result and tried to direct his comments to the alleged victim and his family in the back of the courtroom.He told the jury he and his TSG colleagues were in the Haringey area after learning the borough was experiencing “significant problems” with knife crime, knifepoint robberies and drug dealing as well as recent murders and stabbings.The officer went through factors that “heightened” his “suspicion” of Mr Walker-Brown, including his clothing which showed no obvious “purpose” for being out during lockdown, him wearing a bum bag – which Mahmood claimed was “often” used to conceal weapons or drugs – and displaying an “oh shit expression” when he saw the police van.",
        "Mahmood also said Mr Walker-Brown took off when he and his colleagues stepped out the carrier and reached for his waistband while running, increasing the officer’s suspicion.Jurors went on to hear that when Mr Walker-Brown jumped into the front courtyard of a property, all the factors arousing suspicion made Mahmood think “he has got a knife” and needs to be “contained”.“It makes me think he could turn around and attack at any point,” Mahmood added.Mr Walker-Brown ignored warnings from Mahmood that he had a taser, the court heard.The officer said the “final prompt” to discharge the taser was when Mr Walker-Brown was “moving towards” him.In a prepared statement to the police watchdog, Mahmood said: “I distinctly remember Mr Walker-Brown looking at me as he was jumping up onto the bins, his facial expression wasn’t one of giving up but that of aggressive determination.”Giving evidence, he said: “I saw that imminent threat. I thought Mr Walker-Brown was in possession of a weapon.”Mahmood told jurors he believed Mr Walker-Brown would have fallen onto the bins, denied anticipating serious injury and denied anticipating the end result.The officer, from Plaistow in east London, does not dispute inflicting grievous bodily harm but denies that it was unlawful.The trial continues on Thursday with cross-examination of Mahmood."
    ]
}