{
    "articleURL": "/money/markets/article-12043839/Powell-signals-latest-hike-Fed-raises-rates.html",
    "content": [
        "The US Federal Reserve last night hinted it was ready to pause its aggressive path of interest rate hikes, amid a string of bank failures and a budget stand-off in Washington.",
        "Sterling rose to an 11-month high as the world’s most powerful central bank announced another 0.25 percentage point rate rise – but softened its language on further increases.Pushed on whether rates have risen enough already, Fed chairman Jerome Powell said: ‘We feel like we may not be far off, we may be even at that level.’All eyes were on the Fed as it came under intense pressure to ease its aggressive rate hiking cycle in the face of turbulence in the financial sector.At the same time the White House and Congress are at odds over raising the US government’s debt ceiling, a stand-off that could ultimately see the administration run out of money. ",
        "But the Fed is still battling to bring down inflation, which has fallen since its peak last year but, at 5 per cent, remains well above its 2 per cent target.It has lifted rates by five full percentage points since March last year in an attempt to curb the price spiral.Yet last night it dropped language seen in previous statements, in which the Fed said it ‘anticipates’ further increases being appropriate, replacing it with more qualified language about what it would do next.That softer tone is partly because the banking crisis will have a cooling effect on the economy as lending conditions tighten. Fed economists have predicted the crisis will contribute to a ‘mild recession’ later this year.",
        "Powell  insisted a decision has not been made about whether to pause – and that inflation is still too high – but his comments seemed to lack the previous insistence that there was further to go. ‘We are prepared to do more if greater monetary restraint is warranted,’ he said.But he appeared to pour cold water on the prospect that rates may soon start to be cut, citing the Fed’s view that inflation will not come down quickly.‘In that world it would not be appropriate to cut rates,’ the chairman added.The pound climbed to just under $1.26, its highest level since June last year. ",
        "It comes after turmoil that started in March – spurred by the Fed’s sharp rate hikes – when three American banks collapsed, and seemed to have culminated with the demise of 167-year-old Credit Suisse.But the emergency takeover of US regional lender First Republic by JP Morgan this week prompted fears the crisis was not yet over.Powell said that the Fed would continue to monitor the banking system.But he said the takeover of First Republic was ‘an important step toward drawing a line under that period severe stress’.Andrew Hunter, deputy chief US economist at Capital Economics, said: ‘The Fed’s new policy statement provides the clearest hint yet that the 25bp rate hike today is likely to be the last. ",
        "'We expect economic weakness and a sharper-than-expected drop back in core inflation to convince officials to start cutting rates again later this year.’The Fed’s decision comes ahead of rates announcements by the European Central Bank today and the Bank of England next week.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}