{
    "articleURL": "/sport/football/article-12043093/Saudi-Arabian-government-preparing-biggest-offer-football-history-sign-Lionel-Messi.html",
    "content": [
        "Messi is set to leave PSG after being suspended for two weeks by the clubHe won't be short of offers and the Saudi Pro League are looking to sign himMessi could earn £320million annually, nearly double Ronaldo's £165million rate The Saudi Arabian government is preparing a mega bid to lure Lionel Messi to the Saudi Pro League this summer. ",
        "The forward is set to leave PSG at the end of the season, with his father, Jorge, reportedly informing French club of the decision a month ago.It is unclear what his next destination will be, but the seven-time Ballon d'Or winner won't be short of suitors as he decides his next move - and Al-Hilal are ready to make him the highest paid athlete in history.It comes after Messi was suspended for two weeks by the club after making an unauthorised trip to Saudi Arabia.Saudi Arabia are hoping to persuade Messi to follow Cristiano Ronaldo to the Middle East after he joined Al-Nassr last year.",
        "Messi has been offered £320million a year, almost double the £165million salary Ronaldo is paid yearly at Al-Nassr, with the World Cup winner linked with Al-Hilal.The offer has been on the table for the last few weeks as Messi prepares to make a huge decision on his future after he becomes a free agent.It is believed that Garry Cook, former Manchester City chief executive, will be involved in any potential deal. He was appointed as the Saudi Pro League's CEO at the start of the year.Messi recently posed with his wife, Antonella, and children for photos in Saudi Arabia, where he had pre-arranged a visit for one of his commercial commitments as an ambassador for tourism.",
        "The World Cup winner signed a £25m-a-year deal with Saudi Arabia last year to become a tourism ambassador. While PSG players were scheduled to have a day off on Monday following their 3-1 loss to Lorient, Christophe Galtier called the squad in for training.Messi was already on his way to Saudi Arabia, however, on the unauthorised trip, and could not turn back to attend and missed training.PSG have been trying to extend his contract, but it is understood that now won't happen and the race is on to secure his signature. "
    ]
}