{
    "articleURL": "/wires/reuters/article-12052251/UN-continue-keeping-Afghan-staff-home-Taliban-ban-women.html",
    "content": [
        "By Michelle Nichols",
        "UNITED NATIONS, May 5 (Reuters) - The United Nations said on Friday it will continue to keep Afghan staff working from home after the Taliban administration began enforcing a ban on Afghan women working for the world body a month ago.The United Nations has some 3,300 Afghan staff, of whom about 400 are female, while about 600 international staff in the country are not affected by the ban. The UN had said it would review its operations and keep Afghan staff home until May 5.Deputy U.N. spokesperson Farhan Haq said on Friday there had been no change to \"our posture on the ground.\"\"We're working to come to decisions on appropriate working modalities,\" Haq told reporters in New York. \"Obviously, we have a challenge because the needs of the Afghan people are immense, and we intend to fulfill those needs, but at the same time, our operations are clearly impeded.\"The Afghan people are in for a \"very difficult year ahead,\" the top U.S. aid official warned this week, as donors grapple with challenging a Taliban administration crackdown on women and girls, more crises around the world, and less funding overall.Haq said aid work continued in areas like health and education where the U.N. had been able to get some limited exemptions to the ban on Afghan women. He indicated, however, that some U.N. agencies may be taking a different approach.",
        "\"I believe that different agencies have different mandates about the provision of aid and so they have had different ways of handling the situation as I characterized it,\" Haq said.The Taliban seized power in August 2021 as U.S.-led forces withdrew following 20 years of war. It has since also tightened controls on women's access to public life, including barring women from university and closing girls' high schools.The Taliban says it respects women's rights in accordance with its strict interpretation of Islamic law. Taliban officials said decisions on female aid workers are an \"internal issue.\"The U.N. Special Rapporteur on human rights in Afghanistan and the chair of the Working Group on discrimination against women and girls - both mandated by the U.N. Human Rights Council - visited Afghanistan between April 27 and May 4.\"We are deeply concerned about the apparent perpetration in Afghanistan of gender persecution - a systematic and grave human rights violation and a crime against humanity,\" they said in a joint statement on Friday.(Reporting by Michelle Nichols; Editing by Leslie Adler)"
    ]
}