{
    "articleURL": "/wires/reuters/article-12049789/Chinese-troops-hold-rare-joint-military-exercise-Laos.html",
    "content": [
        "BEIJING, May 5 (Reuters) - China will hold a rare joint military exercise with its landlocked neighbor Laos this month as Beijing tries to bolster security ties with regional allies to counter an expanding U.S. presence in Southeast Asia.",
        "Southern Theater Command, one of the five theater commands of the People's Liberation Army, will send troops to Laos in May for the \"Friendship Shield 2023\" joint exercise, the Chinese defense ministry said on Friday in a brief statement.The military drill will mark a step up from previous \"Peace Train\" joint humanitarian medical rescue exercises between Chinese and Laotian militaries in Laos.This year, China and Cambodia held drills in Cambodian waters for the first time, also involving Southern Theater Command, whose operational area includes the South China Sea, most of it is claimed by Beijing. Other countries in the region, and international law, say those waters do not belong to China.China also just concluded joint drills with Singapore in the southern reaches of the South China Sea, in international waters, according to Singapore's defense ministry on Friday.In February, China's defense ministry sent a working group to Laos, Vietnam and Brunei for talks on regional security issues, with a focus on \"bilateral defense cooperation mechanisms.\"China's stronger military ties with its Southeast Asian allies coincide with Beijing's diplomatic push to deepen engagement with its southerly neighbors.In November, Chinese President Xi Jinping told Laotian President Thongloun Sisoulith on a visit to Beijing that the two countries must ensure that efforts to \"build a shared future between China and Laos.\"",
        "The exercise in Laos also comes as the United States increases military exercises in the region with annual war games in Indonesia and Thailand and the largest-ever annual drill last month with ally the Philippines involving more than 17,000 personnel.Philippine President Ferdinand Marcos Jr said on Thursday that granting U.S. access to Philippine military bases is a defensive step that would be \"useful\" if China attacked democratically governed Taiwan, claimed by China as part of its territory. (Reporting by Ryan Woo. Editing by Gerry Doyle)"
    ]
}