{
    "articleURL": "/tvshowbiz/article-12058811/Stars-attend-Eurovision-welcome-event-Liverpool.html",
    "content": [
        "The stars were out in force on Sunday evening to attend the National Lottery's Big Eurovision Welcome event outside St George's Hall in Liverpool.",
        "Taking to the stage at the event were a slew of performers - some affiliated with past competitions and others adding to the roster - including Alexandra Burke, Zara Larsson and the return of Conchita. Pregnant Alexandra took to the stage in a flowing white dress which masked her bump. Zara meanwhile was sizzling in a tiny flesh flashing ensemble alongside Conchita, real name Thomas Neuwirth, who opted for trademark glamour. Among the artists who performed for the crowd of 30,000 on Sunday were Alexandra, Zara, Conchita alongside Atomic Kitten and Frankie Goes to Hollywood, who will reunite after their split in 1987. Other acts with a Liverpool connection on the line-up included funk band The Real Thing, and The Lightning Seeds - singers of the football anthem Three Lions.",
        "Zara was turning up the heat in the scanty ensemble comprising a glittery top and tiny skort - skirt and shorts hybrid - as she joined a team of dancers. She wore sparkly boots which complemented her cowl neck top. Her blonde locks were styled into loose curls and she was sporting over the top stage make-up comprising shimmering eyes and a glossy lip. Zara shot to fame when she won the 2008 season of Talang, the Swedish adaptation of the Got Talent franchise, at the age of 10, winning 500,000 kronor.",
        "Former X factor winner Alexandra's garment whipped around as she moved about the stage. The star boosted her height by wearing a pair of open-toed heels and accessorised with gold hoop earrings to match the straps of her footwear.Conchita made her big return to the Eurovision stage after winning in 2014. The dramatic performer - the work of Thomas - became an icon following her win on the show. Thomas has previously stated that he is not a trans woman. He is gay, and has also described himself as a drag queen. He uses she/her pronouns to describe his Conchita Wurst character, but he/him pronouns when referring to himself.",
        "Natasha Hamilton and Liz McClarnon were representing Atomic Kitten as they hit the stage belting out the Nineties band's. Pregnant Natasha looked chic in a green suit as she performed at the event in her native city. The duo rose to fame in pop band Atomic Kitten alongside Kerry Katona (left) pictured in 2000. Holly Johnson from Frankie goes to Hollywood was seen performing onstage during the National Lottery's Big Eurovision Welcome event. Also in attendance with the Liverpool spectacular were Dave Smith and Chris Amoo from The Real Thing were seen performing together on stage. ",
        "Ahead of next weekend's big competition, a host of famous faces convened in the city - including Alexandra, AJ Odudu, Joel Dommett, Shirley Ballas, Natasha Hamilton, Sonia and Jennifer Ellison at the helm. ",
        "Also in attendance was Britain's offering for this year's competition - Mae Muller - who looked sensational in an edgy lilac creation. Hosted by Olympian Sam Quek and Ukrainian presenter Timur Miroshnychenko, the party saw the 37 acts of the 2023 intake hit the red carpet for a welcome to the city.Highlights of the concert will be shown on BBC One on Monday. The Eurovision shows at Liverpool Arena will start this week, with semi-finals on Tuesday and Thursday and the final taking place on Saturday. ",
        "Alexandra was joined at the event by television presenter AJ, 35, who hosted the event with fellow broadcaster Joel, 37.AJ dazzled as she walked the red carpet at the event, wearing a gold metallic jumpsuit for the evening.She wore the item partially unzipped at the front to create a plunging neckline. The screen star wore a pair of gold heels to match the rest of her outfit and accessorised with some gold jewellery.",
        "She went for a glamorous look with her make-up and confidently posed with her hands on her hips on arrival.Taking to the stage, she stood alongside Joel who looked dapper in a black and white jacket and a pair of black trousers.AJ was later joined on stage by Strictly Come Dancing host Shirley Ballas, 62, who ensured she caught the eye in a canary yellow suit.",
        "She wore a bright jacket and a pair of matching flared trousers as she appeared in front of the crowd.Pregnant Natasha, 40, joined her Atomic Kitten bandmate Liz at the welcome event. She cut a chic figure in an oversized pale green suit which she teamed with a skimpy blue lace bralette. ",
        "Lovingly cradling her bump, Natasha who is expecting her first child with husband Charles Gay, slipped her feet into a pair of comfy white trainers for the event.Accentuating her features with make-up she swept her auburn locks into a high ponytail and completed the look with a pair of statement making earrings. She is already a mother-of-four and shares son Josh, 20, with celebrity bodyguard Fran Cosgrave; Harry, 18, with actor Gavin Hatcher; Alfie, 12, with ex husband Riad Erraji, and daughter Ella, eight, with boyband star Ritchie Neville.Meanwhile Liz, 42, commanded attention in a gold and blue sequinned coat which she layered over a cream ensemble. The songstress donned a sparkly sweater with matching high-waisted trousers as she posed up a storm on the red carpet.",
        "Sporting a radiant complexion she styled her blonde locks poker straight as they fell down past her shoulders. The duo took to the stage to belt out a series of Atomic Kitten hits.  ",
        "Eurovision's UK host Rylan was looking glam in a plunging black blazer.Jennifer Ellison put on a glamorous display at the bash. The former glamour model, 39, caught the eye in a busty cut-out jumpsuit while posing for photos. She looked incredible in the figure-hugging number that featured satin panels and flared trousers. Jennifer styled her bright blonde hair into a sleek a sleek long bob and opted for a bronzed makeup look. To complete her ensemble, she slipped into a pair of heels and carried a small handbag on her shoulder.  ",
        "The Eurovision Village, at the city's Pier Head, opened on Friday with a performance from last year's winners Kalush Orchestra and Scissor Sisters' Jake Shears performed there on Saturday after a screening of the coronation.The first Eurovision semi-final will take place on Tuesday. Mae has spoken of her nerves ahead of the Eurovision Song Contest at a 'magical' opening ceremony.The singer, 25, met fans as she walked the Turquoise Carpet in Liverpool earlier in the day on Sunday.She told PA: 'I feel like it's getting real now, but the closer it gets the more excited I am. I just feel really honoured to be able to be a part of it and I feel like being able to see everyone that has come out, it just makes it even more magical. ",
        "'The nerves are there. They're there, they're having a little party inside but I'm just trying to stay focused, focus on the positives and try and enjoy it.'Wearing a powder blue body-con hooded dress, Muller said there was a 'bit of pressure' in deciding what to wear for the occasion.But I find it fun. I feel like women, we've got enough pressure put on us so I'm like, we might as well have fun with the outfits. If I like it, that's all that matters.'The Eurovision Village, at the city's Pier Head, opened on Friday with a performance from last year's winners Kalush Orchestra and Scissor Sisters' Jake Shears performed there on Saturday after a screening of the coronation.The first Eurovision semi-final will take place on Tuesday.Former Eurovision winners Conchita Wurst, who represented Austria in 2014, and Ukraine's Jamala, who competed in 2016, were also on the line-up for the gig.She added: 'It's no longer, \"My song is on the radio. I've made it.\" There are a lot of boxes to tick.This year's Eurovision is one of the biggest produced by the BBC.This year's Eurovision Song Contest will see 1,000 litres of hairspray, 150m of costume rails and more than 3,000 make-up brushes used.The shows at Liverpool Arena will start this week, with semi-finals on Tuesday and Thursday and the final taking place on Saturday.",
        "According to the broadcaster, the hair and make-up teams will use more than 100 wigs and hairpieces, 1,000 litres of hairspray, more than 3,000 make-up brushes, and 5,000 hairpins to create looks for every performer.Rails measuring 150m - equivalent to three Olympic-sized swimming pools - will hold the 482 costumes which have been made for the shows using 20,000m of thread.The manufacturing of the costumes was done in the UK and Ukraine, which was unable to host the competition due to the Russian invasion.The show will be watched by 160 million viewers worldwide, with over eight hours of live TV and 50 live feeds.",
        "To stage the show, there are more than 600 rigging points, 140 tons of steel ground support structure, and 1km of additional steel truss work being added to the arena.The event will feature eight miles of cabling for lighting, sound, video and special effects, more than 2,000 specialist lighting fixtures and 200 custom staging decks.A total of 950 square metres of staging for the main stage and 500 square metres of staging for the green room will also be used.The lighting design includes 23,700 individual light sources and 2,500 automated colour-changing robotic lights, while sound will be captured by 150 microphones.",
        "BBC director of unscripted Kate Phillips said: 'As these statistics show this is one of the biggest events the BBC has ever produced.'Coming straight after such a significant and spectacular moment in history, we aim to produce an unforgettable and utterly joyful Eurovision, on behalf of Ukraine.'Like the coronation, Eurovision has so many skilled and talented people from across the BBC working on it.'Our brilliant team in Liverpool are making sure that all three live shows are simply must-see TV, for audiences across the UK, Europe and beyond.'"
    ]
}