{
    "articleURL": "/news/article-12054297/Harry-lookalike-trade-unionist-reveals-insult-received-appearing-TV-Mall.html",
    "content": [
        "Paul Embery was working for GB News when he was approached by a royal fanHe has previously acknowledged his likeness to the unpopular Duke of Sussex A redhead trade union activist has revealed how he was told to 'f*** off back to California' in the run-up to the King's Coronation.",
        "Paul Embery, a writer, broadcaster and former official of the Fire Brigades Union has been working with GB News during its coverage of the glitzy ceremony.Mr Embery, who a tribunal recently found was unfairly dismissed from his FBU job after speaking at a pro-Brexit rally in Westminster, was outside Buckingham Palace to take part in filming for the channel.However, he took to social media last night to reveal how a royal fan recognised his similarity to the Duke of Sussex and quipped: 'F*** off back to California'.Prince Harry's public popularity has plummeted following a series of barbs at the Royal Family, including in his autobiography spare and Netflix series with wife Meghan Markle. ",
        "Former Northern Ireland First Minister and fellow GB News broadcaster Arlene Foster was among those to reply to Mr Embery's tweet.She said: 'Now that is funny! Enjoy the fame my friend!'Mr Embery has previously acknowledged his likeness to the Duke, tweeting a picture of him and his partner in 2018 with the caption: 'Me and the wife just off to Windsor to confuse a few people.'On Friday, Mr Embery was taking part in a debate on prison labour on GB News, in which he said: 'I think broadly it's a good idea, with the right safeguards, of course. ",
        "'I think they should be paid the going rate for the job, I don't think it's acceptable that any employer would be able to get labour on the cheap.'Whether that is someone who's a prisoner or someone who's just walked in off the street it strikes me as absolutely wrong that an employer can benefit from that cheap labour.'I would pay an 18-year-old the same as a 50-year-old if they were doing the same job and putting in the same effort and producing the same thing.'If you are a prisoner going out eight, nine, ten hours a day for an employer, I don't see any convincing reason why you should not get the going rate for the job.'Whether or not you're able to spend it when you're in prison is a different thing, it could go into your account and you could spend it when you're released.'The other danger is if you have thousands of prisoners suddenly entering the labour market on a cheap rate of pay, and you just have this huge instant reserve army of labour available to employers, which will have the effect of driving down wages for people who are out there living an honest life, and that needs to be addressed.'",
        "Mr Embery made headlines last year when he won an £8,300 payout after his bosses launched a 'witch hunt' to get rid of him for backing Leave in the Brexit debate.The activist spoke out at a rally in 2019 calling for Brexit to be fully implemented, even if it meant leaving the EU without a deal. He was then branded a 'disgrace to the traditions of the labour movement' by the general secretary of the Fire Brigade Union, Matt Wrack.   Mr Embery was suspended for allegedly criticising the Remain-supporting union's position on the issue and fired from his post following what an employment tribunal has now concluded was a 'witch hunt'.The panel found that there was an 'agenda' to have Mr Embery removed and ordered the FBU to pay him £8,308 in compensation for unfair dismissal. "
    ]
}