{
    "articleURL": "/wires/reuters/article-12051573/Recession-not-U-S-economy-losing-momentum-Kemp.html",
    "content": [
        "By John Kemp",
        "LONDON, May 5 (Reuters) - Like U.S. Supreme Court Justice Potter Stewart´s famously flexible definition of obscenity (\"I know it when I see it\") recessions have proved notoriously difficult to define with precision.Observers often disagree at the time whether the economy is already in recession, and sometimes afterwards whether a recession has occurred or just a \"soft patch\" in an otherwise uninterrupted business cycle expansion.In most countries, recessions are informally defined as two consecutive quarters of negative growth in real gross domestic product, though using GDP data this way has drawbacks because it can be subject to substantial revisions.In the United States, the National Bureau of Economic Research (NBER) defines a recession more flexibly as \"a significant decline in economic activity that is spread across the economy and lasts more than a few months.\"The definition emphasises three characteristics - depth, diffusion and duration - to distinguish between recessions and milder slowdowns in the whole economy or cyclical downturns confined to one or a few sectors.In practice, NBER´s Business Cycle Dating Committee, which has become the accepted arbiter of recessions, employs a variety of indicators to determine when a recession has occurred.\"Because a recession must influence the economy broadly and not be confined to one sector, the committee emphasizes economy-wide measures of economic activity,\" NBER explains on its website.",
        "These measures include personal income less transfer payments (PILT), nonfarm payroll employment, household employment, real personal consumption expenditures and industrial production, among others.Even with this suite of indicators, NBER often makes a determination the economy has experienced a recession months after it started, and some downturns come close to being a recession without one being declared.ON THE THRESHOLDBased on recent data, the U.S. economy is currently paused on the threshold between a significant mid-cycle soft patch and a formal cycle-ending recession.The industrial side of the economy, which includes the manufacturing and freight transportation sectors, is already in a significant and prolonged downturn that likely meets the threshold for a recession.Monthly business surveys show manufacturing has been contracting since November 2022, and the downturn is confirmed by falls in container freight, diesel consumption and industrial electricity sales.But the same surveys show the much larger service sector still reporting marginal growth, keeping the economy as a whole out of recession so far.Chartbook: U.S. economic indicatorsThe Institute for Supply Management's (ISM) service sector index stood at 51.9 in April (with more businesses reporting expanding activity than contraction) compared with a manufacturing sector index of just 47.1.The contrast between the sectors is smaller than it appears: the services index is generally higher than its manufacturing counterpart throughout the economic cycle, but both move in broadly the same direction.",
        "In April, the ISM services index was in only the 15th percentile for all months since 1997 compared with the manufacturing index in only the 9th percentile.If the manufacturing sector has already fallen into recession, the services sector is only just avoiding it at the moment.INCOME AND EMPLOYMENTSo far, growth in consumer spending has helped offset a sharp deceleration in business investment and efforts to reduce excess inventories by pausing or reducing new orders.Households have been able to keep spending as a result of income gains from rising employment, cost-of-living adjustments to wages and salaries, and tax cuts.Real personal incomes less transfer payments increased by 1.7% in the first three months of 2023 compared with the same period a year earlier, a significant acceleration from 0.3% in the second quarter of 2022.Real PILT gains coupled with the rotation of spending from merchandise back to services following the end of the pandemic and mobility restrictions has given a boost to parts of the services sector despite inflation.Reduced prices for gasoline have eased some of the pressure on household budgets, and employment in both manufacturing and the services sector is still increasing, supporting incomes, though the rate of growth is slowing.At the same time, interest rates are still increasing and credit conditions are set to tighten for households and firms following the regional banking crisis.",
        "RECESSIONS AS NARRATIVESMore informally but fundamentally, economist Robert Shiller has likened recessions to \"narratives\" that spread similar to an epidemic through the economy (\"Narrative economics\", Shiller, 2017).\"A recession is a time when many people have decided to spend less, to make do for now with that old furniture instead of buying new, or to postpone starting a new business, to postpone hiring new help in an existing business.\"Some of the narratives associated with recessions have become more common in the last nine months, likely presaging a further slowdown in the business cycle.Many prominent corporations have switched to focusing on efficiency, cost control and margins rather than growth. Investment is slowing and layoffs are becoming more common in at least some sectors of the economy.The one strong area of the economy is the increase in nonfarm employment. But even here the gains are slowing and there are signs the labour market is starting to cool.The number of people claiming unemployment benefits for the first time each week has begun to edge up from a multi-decade low in the third quarter of 2022.While a more cautious approach to spending for an individual household or firm is rational, in aggregate it is recessionary.In recent decades, recessions and mid-cycle soft patches have normally prompted the central bank to cut interest rates to spur more spending.",
        "But with unemployment at multi-decade lows, employment costs rising, and limited spare capacity in the economy, central bank policymakers are likely to prioritise inflation control over supporting growth.Related columns:- U.S. industrial recession cuts diesel and electricity use (May 4, 2023)- Hard-ish landing has already arrived for U.S. manufacturers (April 4, 2023)- Persistent inflation sharpens Fed´s interest rate dilemma (March 14, 2023)- Recession now or later? Unenviable alternatives for 2023 (January 26, 2023)John Kemp is a Reuters market analyst. The views expressed are his own (Writing by John Kemp; Editing by Susan Fenton)"
    ]
}