{
    "articleURL": "/tvshowbiz/georgia-harrison/article-12056813/Georgia-Harrison-stuns-white-cherry-print-bikini-dances-racy-Instagram-clip.html",
    "content": [
        "Georgia Harrison flaunted her jaw-dropping figure as she danced for an Instagram clip on Sunday while enjoying her time in Ibiza.",
        "The Celebrity Hunted star, 28, looked nothing short of sensational in a white cherry-print bikini on Friday. The stunner oozed confidence as she showed off her dancing moves in the video.She confirmed that as she penned the post: 'POV - your besties going through a breakup and she’s needs this energy.'Georgia appeared in very high spirits and donned dainty jewellery including golden necklaces and a watch.",
        "The TV personality slicked her hair back into a bun, achieving a clean look.Georgia sported a bronze make up palette and pouted her lips with an eye-catching pink lipstick, highlighting her features.Earlier this week the reality star posed up a storm in the two piece while enjoying the Shein summer pool party at Ocean Beach.Georgia was one of stars to attend the celebrity-studded fashion show, as the brand announced their first sponsorship of weekly pool parties at the iconic beach club.The bombshell wowed as she perched on her knees while showing off the swimwear which she wore with coordinating red and white trainers. She further accessorised her holiday look with a glamorous cherry body chain.Her blonde locks were swept into a high ponytail complete with a red bow, while her features were highlighted with a sleek palette of make-up.",
        "It comes after Georgia once again sent temperatures soaring as she shared a slew of sizzling bikini snaps to her Instagram grid on Thursday.",
        "The beauty looked incredible in the tiny pink two piece as she flaunted her jaw-dropping figure in sunny Ibiza.Her skimpy ensemble boasted a plunging top and high-cut bottoms that were both adorned with a sweet lace trim.Georgia completed the look with a colour coordinating baseball cap as she flashed her gorgeous smile for the camera.Cheekily captioning the snaps: 'We're all on a 90 year holiday, get out there and smile whilst you still have teeth'.Last week, Georgia apologised to fans for over editing her photos in the past in a heartfelt Instagram post.While she appeared confident in her bikini photos, she admitted that it wasn't always the case and had previously edited her snaps.In an attempt to 'take accountability' for her past actions, Georgia issued an apology to her followers in which she said sorry for 'being part of the problem' at one point.She penned in her caption: 'I'm currently reading power vs force and I feel this is something I need to address after finishing it.'I haven't been over editing my photos for a long time now and although I learnt my lesson I never really took accountability for the fact that I done it. So here it is…",
        "'I'm sorry to you if I made my insecurities your insecurities. I'm sorry to myself for not loving my imperfections the way I encourage others too'And I'm sorry to society for once being part of the problem.'I promise to continue to embrace my authentic self going forward and I acknowledge that authenticity is the highest form of love for oneself and others.'Her post was met with several positive messages from her followers praising her for being so honest and open."
    ]
}