{
    "articleURL": "/wires/reuters/article-12058697/Russians-language-test-avoid-expulsion-Latvia.html",
    "content": [
        "By Andrius Sytas",
        "RIGA, May 8 (Reuters) - In a Stalinist skyscraper which dominates the skyline of Latvia's capital, dozens of elderly Russians wait to take a basic Latvian language test as a proof of loyalty to a country where they have lived for decades.Clutching red Russian passports, the participants, mostly women, read their notes for last minute revision, fearing they may be expelled from the Baltic country if they fail.Speaking Russian instead of Latvian has not been a problem until now, but the war in Ukraine changed the picture. Last year's election campaign was dominated by questions of national identity and security concerns.The government now demands a language test from the 20,000 people in the country holding Russian passports, mostly elderly and female, as the loyalty of Russian citizens is a worry, said Dimitrijs Trofimovs, state secretary at the Interior Ministry.\"(If I am deported), I would have nowhere to go, I have lived here for 40 years,\" said Valentina Sevastjanova, 70, a former English teacher and Riga guide after her final Latvian lesson in a private school in central Riga, ready for when she takes her own exam.\"I took the Russian passport in 2011 to easily visit my sick parents in Belarus. They are gone now.\"Sevastjanova was in class of 11 women, aged 62 to 74, taking the three month crash course. Each applied for Russian passports after independent Latvia re-emerged in 1991 from the ashes of the Soviet Union.",
        "It made them eligible for retirement at 55, a pension from Russia, and visa-free travel to Russia and Belarus.But after Russia invaded Ukraine last February, Latvia switched off Russian TV channels, crushed a Soviet World War Two monument and is now working towards eliminating education in Russian.This has left many of Latvia's ethnic Russians, who make up about a quarter of its population of 1.9 million, feeling they may be losing their place in society, where speaking solely Russian has been acceptable for decades.Russian citizens under 75 who do not pass the test by the end of the year will be given reasonable time to leave, Trofimovs said. If they do not leave, they could face a \"forced expulsion\".\"They voluntary decided to take the citizenship not of Latvia but of another state,\" he said. He said the test was needed because Russian authorities justified their invasion of Ukraine by the need to protect Russian nationals abroad.\"I think that learning Latvian is right, but this pressure is wrong,\" Sevastjanova said.\"People live in a Russian environment. They speak with (only) Russians. Why not? It's a large diaspora\", she said. \"There are Russian-speaking workplaces. There are Russian newspapers, television, radio. You can converse in Russian in shops and markets - Latvians easily switch to Russian.\"",
        "To pass, they need to understand basic Latvian phrases and speak in simple sentences, such as \"I would like to have a dinner and I would like to choose fish, not meat\", said Liene Voronenko, head of Latvia's National Centre of Education, which conducts the exams.\"I love learning languages, and I expected to be learning French in retirement. But now I end up learning Latvian instead. Oh well - why not?\" Sevastjanova said. (Reporting by Andrius Sytas and Janis Laizans, Editing by Krisztina Than and Alison Williams)"
    ]
}