{
    "articleURL": "/wires/ap/article-12048595/Brighton-scores-stoppage-time-penalty-beats-Man-United-1-0.html",
    "content": [
        "BRIGHTON, England (AP) - When it comes to Alexis Mac Allister's career highlights, nothing will ever quite compare to winning a World Cup.",
        "Converting a 99th-minute penalty to beat Manchester United in the Premier League won't be too far down the Argentina midfielder's list of feats, though.Mac Allister demonstrated the composure of a world champion by dispatching a penalty into the top corner with virtually the last kick of the game to earn Brighton a 1-0 win over United on Thursday.In the last of the allotted five minutes of stoppage time, United defender Luke Shaw patted the ball away with his raised hand after a corner was swung in from the right.The referee awarded the spot kick after being told to look at the incident on the pitchside monitor, and Mac Allister kept his cool.\"Of course, I was a little bit nervous, as always,\" said Mac Allister, who was one of Argentina's unlikely stars in its run to a third World Cup title late last year in Qatar. \"It was the last minute, everyone is going to talk about it.",
        "\"But I´m happy every time I have the opportunity to score a goal, so really happy for the team.\"Brighton earned partial revenge for its loss to United in a penalty shootout in the FA Cup semifinals 12 days earlier and moved into sixth place, eight points behind fourth-place United having played one game less in the race for Champions League qualification.",
        "United stayed two points behind third-place Newcastle and four points ahead of Liverpool, which has played one more game.\"There is now a real chase,\" Shaw said. \"People around us are picking up points. But it's in our hands.\"Shaw said he got a \"little nudge\" as he jumped to attempt to head away the ball, but accepted \"the hand shouldn't be there.\"\"I own up to it, it cost us the game,\" the England left back said.The dramatic end of the match brought back memories of a meeting between Brighton and United at the Amex Stadium in 2020, which was decided by a converted penalty from United's Bruno Fernandes in the 10th minute of stoppage time.This time, Brighton was on the right side of a late penalty, scoring its latest-ever goal in the Premier League and the latest ever against United in the competition.Brighton manager Roberto De Zerbi felt a sense of justice after his team's impressive display at Wembley Stadium last month.\"Both games I think we played better than United,\" De Zerbi said.Just like in their FA Cup meeting, both teams created plenty of chances at the Amex but found the goalkeepers in top form.United´s David De Gea made the standout save even if he knew little about it, with Kaoru Mitoma´s early effort striking the face of the Spain goalkeeper to shake him up for a few minutes.",
        "At the other end, Brighton´s Jason Steele produced almost identical saves to deny first Marcus Rashford and then Anthony Martial in the first half before a second half that the hosts edged without ever looking like scoring before Mac Allister's clinching penalty.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}