{
    "articleURL": "/sport/afl/article-12041539/Tasmania-AFL-team-know-stadium-players-logo.html",
    "content": [
        "Tasmania was officially awarded the AFL's 19th licence on Wednesday The team will play in a brand new 23,000-capacity stadium in Hobart The Tasmanian team is set to enter the AFL in 2028 Tasmania has officially been granted its own AFL team, after outgoing CEO Gillon McLachlan officially awarded the state the league's 19th licence on Wednesday.",
        "One of the code's traditional heartlands, the Apple Isle had long pushed to be included in the national competition.Its efforts were eventually rewarded as plans for a new stadium in Hobart, one of the AFL's conditions for granting Tasmania a licence, were confirmed last week. 'Today is about recognising that Tasmania belongs in our AFL and AFLW competitions, belongs in the national football conversation and belongs in the national fixture,' McLachlan said.Tasmanian Premier Jeremy Rockliff hailed a 'ground-breaking moment' for the state after the licence was unanimously backed by the 18 existing AFL club presidents.",
        "'This is a proud and ground-breaking moment in our history,' he said. 'After more than a century, the AFL will finally be complete and recognised as a truly national competition.'We have fought hard to deliver this and I couldn’t be prouder to deliver our own team, that will take the field in our own colours, and sing our own song.The team is slated to enter the AFL in 2028, but the final configuration of the stadium and the name of the team still have to be finalised. The same also applies to the colours and the playing list. Here, Daily Mail Australia gives you the rundown on everything you need to know on the AFL's newcomers.",
        "When will the Tasmania team enter the AFL?When the AFL last expanded, Great Western Sydney were granted a licence in 2010 and entered the competition two years later. There will, however, be no such short turnaround for Tasmania, with the AFL slated to welcome its 19th team only in 2028. Several key details - namely the stadium, the players and the name of the team - still need to be ironed out before Tasmanians can finally witness their home team in action.McLachlan, however, noted Tasmania was likely to enter the VFL in 2025 ahead of its AFL debut.",
        "What will the Tasmania AFL team be called?The Tassie Devils, right? Well, not so fast. Back in 2019, when Tasmania formally began the application to join the AFL, it planned to call the team the 'Tasmanian Devils'.The name is used by the state's Under-18 side, after registered it as a trademark through the Australian government and McLachlan said he was a fan of it.But there is a major hurdle in the way in the shape of US entertainment giant Warner Bros, which owns the commercial trademark for the popular cartoon character 'Tas, the Tasmanian Devil'.'I know they’ll be broad-minded people at Warner Brothers, but that’ll be for others to decide,' McLachlan said.",
        "'When I look over there, that’s a Tasmanian team to me and I imagine there’ll be a big push for that type of look.'Foreign Affairs Minister Penny Wong pledged to see whether Australia can reclaim the national icon. 'I have to say like most Australians I was pretty shocked to realise that Tassie devils was not a name that we had the rights over,' she told 2GB Radio on Wednesday.'I think most Australians would think that Tasmanian devils was something that we could use.' What will the guernsey look like?At the time of writing, details on the guernsey are as scant as details on the name. Tasmania's Under-18 teams play in a dark green uniform, with a yellow outline of the Apple Isle featuring a maroon T on the front.The junior players who attended the ceremony on Wednesday donned the uniform, but it remains to be seen whether it will be adopted by the AFL team.",
        "Where will the Tasmania AFL team play?The Tasmanian team will play at 23,000-seat stadium at Macquarie Point in Hobart, which has arguably been the most controversial aspect of the Apple Isle's long journey into the AFL.The league had long maintained that Tasmania's entry into the competition was contingent on the construction of a $715million stadium at Hobart's waterfront.",
        "The project required $240million in federal government funding, which Prime Minister Albanese announced over the weekend.",
        "Will the stadium have a roof?Yes, it will.The design of the stadium and whether it would have a roof was also a major sticking point, but McLachlan confirmed on Wednesday that the venue at Macquarie Point will have a roof as part of the agreement signed with the Tasmanian government.Aside from the roof, the outgoing AFL boss admitted the design was yet to be finalised.'It will be an amazing venue for our supporters to come and watch the greatest sport in the world,' he said. 'Whatever the final configuration of the venue is, it will be a huge asset for our competition.'Will Tasmania have an AFLW team?Yes, although details so far are rather thin on  the ground. McLachlan has made clear the Apple Isle will have an AFLW team, but the AFL noted the timeline for the women's entry in the NAB AFLW competition will be worked through in the coming period.",
        "Which players will play for Tasmania?Tasmania has its licence, now it needs the players. And this is where things get complicated. The AFL has publicly acknowledged the need for Tasmania to be 'competitive almost immediately' and that it has learn its lesson following the arrival of the Gold Coast Suns and GWS a decade ago. ",
        "In the 2010 and 2011 AFL drafts, the Suns and the Giants were handed access to nine of the first 15 selections and had the first pick in each of the following rounds.The Suns secured the likes of David Swallow, Dion Prestia and Tom Lynch, while the Giants claimed Jon Patton, Stephen Coniglio and Toby Greene. Speaking on Wednesday, McLachlan said the AFL could follow a similar process for Tasmania, but suggested certain draft picks could be protected.'We’ve learnt a lot,' he said.'The drafts will be a lot less compromised than they've been in the past, free agency has given us leverage to do that, and we've seen there are actually a lot of mature players who are ready to play that aren't getting games across the board.",
        "'There's more mechanisms now, and there's more liquidity in the player market, and we believe we can use that to have a very competitive team from day one with much less impact on the competition.'Tasmania will, of course, also be allowed to sign established players. When the Suns and Giants entered the competition back in 2011, they were each allowed to sign up to 16 uncontracted players.Gold Coast landed Gary Ablett and other eight players, while the Suns snapped up five signings including Phil Davis and Tom Scully.",
        "The AFL is yet to confirm details of how Tasmania will be allowed to stock up their list, but a number of high-profile players could be free agents by the time the AFL's newcomers join the party.These include Fremantle duo Caleb Serong and Hayden Young, Melbourne star Kysaiah Pickett and Hawthorn gun Will Day."
    ]
}