{
    "articleURL": "/wires/ap/article-12038663/Ohio-gambling-regulator-halts-betting-Alabama-baseball.html",
    "content": [
        "Ohio's top gambling regulator has barred licensed sportsbooks in the state from accepting bets on Alabama baseball games after a report warned of suspicious gambling activity.",
        "Matthew Schuler, executive director of the Ohio Casino Control Commission, issued an emergency order on Monday \"prohibiting the acceptance of any wagers on University of Alabama Baseball effective immediately.\" The order was first reported by ESPN.Sports betting is legal in 33 states, and it wasn´t immediately clear whether any other states had issued similar orders.\"We are continuing to look into the matter,\" Ohio´s commission spokesperson Jessica Franks said Tuesday.The order, obtained Tuesday by The Associated Press, said that one of the state's \"certified independent integrity monitors\" notified the state about the wagers.According to ESPN, Las-Vegas based U.S. Integrity warned sportsbooks of \"suspicious wagering activity\" involving Friday night's Alabama-LSU game. Alabama scored five runs in the ninth inning of an 8-6 loss to LSU, which was ranked No. 1 in the major college baseball polls while Alabama was unranked.U.S. Integrity declined to comment.NCAA rules bar athletes and athletic employees from betting on games \"and from providing information to individuals involved in or associated with any type of sports wagering activities concerning intercollegiate, amateur or professional athletics competition.\"The NCAA said it was aware of the situation and gathering additional information., Alabama deputy athletic director Jessica Paré issued a similar statement, noting athletics officials became aware of this situation Monday evening.",
        "Ronnie Johns, chairman of the Louisiana Gaming Control Board, said in an emailed statement that state officials \"did not see any irregular activity in betting on the LSU/Alabama baseball series.\"\"The operators of all the national sports book platforms did not report any suspicious activity in Louisiana,\" he wrote Wednesday. \"The issue at hand originated in Ohio alone and the Ohio Gaming Commission took action to shut down any bets involving Alabama. LSU baseball has absolutely not been implicated in any suspicious betting activity and therefore there is no investigation of any sort involving LSU.\"U.S. Integrity monitors \"data to see if discrepancies coincide with notable player or coaching events, reveal officiating abnormalities, or are indicative of the misuse of insider information,\" according to its website.Flagging wagers like this often occur when there are huge moves in the odds at the last minute, particularly in a game where one team is much more highly ranked than the other, said Baird Fogel, a California attorney who has experience working with the sports betting industry.\"In this instance, the line, I think, moved very dramatically and the game took a very odd turn where the inferior team started to make a huge run,\" said Fogel, co-head of the global sports practice for Eversheds Sutherland. \"This could all be conjecture, it could all be a coincidence. That´s the wonder of sports betting. Sometimes weird things happen.\"",
        "Fanduel Sportsbook did not have upcoming Alabama baseball games listed for wagering on Tuesday.\"U.S. Integrity is one of the best in the game, and so if they flagged an anomaly and detected a discrepancy or some unusual activity, it´s a good idea to listen to them,\" Fogel said.___More AP college sports: https://apnews.com/hub/college-sports and https://twitter.com/AP_Top25"
    ]
}