{
    "articleURL": "/sport/nhl/article-12051683/Florida-Panthers-defenseman-Josh-Mahura-takes-puck-face-leaving-trail-blood-ice.html",
    "content": [
        "The 24-year-old was hit around his left temple after a shot went wide of goal Mahura joined the Panthers at the start of the season from the Anaheim Ducks DailyMail.com provides all the latest international sports news Florida Panthers' Josh Mahura took a shot off the visor that left a trail of blood on the ice in his side's 3-2 win against the Toronto Maple Leafs in the second round of the NHL playoffs. ",
        "The 24-year-old defenseman had to temporarily exit Thursday night's game to seek treatment in the locker room before eventually returning for the third period.He was seen bleeding extensively with about 5:47 remaining in the second period after Toronto wing William Nylander set a long-range shot just to the left of the goal, accidentally hitting Mahura in the face around his left temple. Mahura went straight to ground after taking the hit, as he immediately removed his helmet while his knees were on the ice. He then got up to skate to his team's bench as fast as he could before being given a towel by a trainer. ",
        "Most fans at Scotiabank Arena - home of the Maple Leafs - thought Mahura's night was done after he sustained the facial injury. However, the Canadian returned to the ice rink with about 15 minutes left in the third period. He missed 10 to 11 minutes of game action in total.",
        "What's more is that the Panthers are now in good position to make it to the Eastern Conference Finals, leading the series two games to none. Florida will either face the New Jersey Devils or the Carolina Hurricanes.The best-of-seven series shifts to Sunrise, Florida, for Game 3 on Sunday. Game 4 is scheduled for Wednesday. ",
        "Mahura joined the Panthers at the start of the season and has made a total of 82 regular season games for the team.Before moving out east, the defenseman was with the Anaheim Ducks for four seasons."
    ]
}