{
    "articleURL": "/wires/reuters/article-12041731/Estee-Lauder-sees-bigger-drop-annual-sales-profit-slow-China-recovery.html",
    "content": [
        "Co expects annual net sales to fall 10% to 12%",
        "Expects annual adj. profit per share to fall 50% to 51%Shares fall as much as 22%(Updates shares to markets close)By Ananya Mariam Rajesh and Katherine MastersMay 3 (Reuters) - Estee Lauder Cos Inc's shares plunged on Wednesday after the cosmetics maker forecast weaker sales and profit for the year than previously estimated, blaming slow recovery at duty-free and travel destinations, especially in Asia.Global retailers have banked on improved demand out of Asia after China eased COVID restrictions last year, but Estee's travel retail division, one of its highest-growth sectors, did not rebound as expected.Shares of the company hit a six-month low of $190.30 during trading hours after Estee Lauder slashed its fiscal-year forecasts for a third time. They closed down 17% at $202.70.Estee expects full-year 2023 net sales to fall between 10% and 12%, compared with its prior forecast of a 5% to 7% decrease.It said while major shopping districts such as Hainan, an island in the southernmost province of China, and Korea saw more traffic, the conversion of travelers to consumers in luxury beauty lagged.Even though China relaxed pandemic-related restrictions, the company saw January 2023 pressured by retailers destocking due to an increase in COVID-19 cases.Meanwhile, European luxury companies LVMH and L'Oreal saw a rise in first-quarter sales, boosted by a rebound in Asia as China eased COVID restrictions last year.",
        "Barclays analyst Lauren Lieberman said in a note that Estee's forecast was the \"last thing\" expected even by the Street and the company's comments on its travel retail division in Asia raise doubt on how much \"control or visibility\" Estee has in sales through this channel.CFO Tracey Travis said in a post-earnings call Estee has seen improvement in travel retail, which includes duty-free sales at airports and shopping districts in China and Korea, through the third quarter, and the company also expects sales from the segment to rise in double digits.However, Travis said it's \"difficult to know\" when travel in China and Korea will normalize.Estee's sales also remain challenged in the U.S., another major market. The company's organic sales in the Americas grew in double digits last fiscal year, but began to decline in the first quarter of 2023.Bernstein analyst Callum Elliott said the company's brands skew toward older customers even as millennials and Gen-Z increase their share of beauty spending.Estee has also been challenged by the growth of smaller competitors in the beauty space, according to Travis.\"We're seeing an awful lot of indie activity in the U.S. that has taken share gains away from the largest companies,\" she said.Estee reported mid-single-digit growth in North America in the third quarter, while prestige beauty as a category grew more than 16%, according to data from Circana.",
        "LVMH said its U.S. spending declined in the April earnings call, though the company noted its performance there was strengthened by brisk business at its Sephora beauty chain.A stronger dollar has also hurt Estee, which has sprawling global operations and convert foreign currencies into the greenback.Estee forecast adjusted per-share profit to fall by 50% to 51%, compared with a 27% to 29% decrease it expected earlier.The company beat third-quarter sales expectations, but missed profit estimates. (Reporting by Ananya Mariam Rajesh in Bengaluru and Kate Masters in New York; Editing by Shinjini Ganguli and David Gaffen)"
    ]
}