{
    "articleURL": "/wires/reuters/article-12041047/Marlins-attempt-achieve-rare-success-vs-Braves.html",
    "content": [
        "The Miami Marlins will try to reverse a trend when they play host to the Atlanta Braves on Wednesday night.",
        "Miami is just 3-9 against the Braves and New York Mets. Against all other teams, the Marlins are 13-5. In fact, the Marlins have won all six series against teams not named the Braves or Mets.The Braves pounded the Marlins yet again on Tuesday, winning 6-0 to open a three-game series. Atlanta beat reigning National League Cy Young Award winner Sandy Alcantara, knocking him out after five innings.\"Anytime you can get him out of the game, like we did, that's huge,\" Braves manager Brian Snitker said.On Wednesday, the Braves -- who are 4-1 against Miami this year -- will start right-hander Kyle Wright (0-1, 4.86 ERA). The Marlins will go with left-hander Braxton Garrett (1-0, 2.45).Wright went 21-5 last year, leading the major leagues in wins.Atlanta's first-round pick out of Vanderbilt in 2017, taken fifth overall, Wright entered last year with an unimpressive 2-8 major league record. However, his breakthrough came after he became a curveball-sinkerball pitcher.Wright was pretty much perfect in two starts against the Marlins last year, going 2-0 with a 0.00 ERA.However, while he finished April 2022 with a 3-0 record and a 1.13 ERA, he didn't have much luck in April 2023.His most recent start was Thursday in Atlanta against the Marlins. Wright, 27, pitched the best he has all season, but his effort was limited to just three scoreless innings due to a three-hour rain delay. He struck out six in that contest while allowing just two hits and one walk.",
        "The Marlins, who will look to scratch out a run against Wright for the first time since 2020, are hoping Garrett can reverse another trend.In four starts against Atlanta, Garrett is 0-2, although he has a stellar 2.70 ERA.Garrett matched zeros against Wright on Thursday, also pitching three scoreless innings. Garrett allowed just one hit, walked none and fanned three.The really good news for Garrett is that the Marlins have won four straight games with him on the mound.Miami is 10-0 in one-run games this season, including a 5-4 victory over Atlanta last week in that Garrett-Wright matchup.Marlins manager Skip Schumaker, in his first year with the club, said Tuesday that he, too, is surprised at how quickly the team has come together.\"We have a lot of guys playing different positions in the infield and outfield,\" Schumaker said. \"We also have a new coaching staff. Building that trust has been faster than I thought. We've faced some pretty good teams, too.\"Miami, which had its four-game winning streak snapped on Tuesday, is powered by second baseman Luis Arraez, who leads the majors with a .435 batting average.Atlanta, which has won six of its past eight games, is powered by leadoff batter Ronald Acuna Jr. He leads the Braves in batting average (.362) and on-base percentage (.449).",
        "Catcher Sean Murphy leads Atlanta in slugging percentage (.632).--Field Level Media"
    ]
}