{
    "articleURL": "/news/article-12046603/Tourists-follow-GPS-directions-straight-sea-Hawaii-rescued.html",
    "content": [
        "The two women drove their Chrysler Town &amp; Country straight into Honokohau Harbor, in Kailua-Kona, HawaiiChristie Hutchinson captured the dramatic moment on video showing crewmembers from the Nanea sailboat diving in to helpThe tourists had been trying to find a Manta Ray Snorkel tour company and reportedly took a wrong turn while following their GPS directions A sailboat crew had to spring into action to rescue two tourists from their sinking van after they drove straight into Honokohau Harbor, in Kailua-Kona, Hawaii.",
        "Christie Hutchinson captured the dramatic moment on video which showed the crew swimming up to the driver and passenger and helping them escape unharmed.Two men tied a rope to the back of the silver Chrysler Town &amp; Country and attempted to save the van but their efforts were ultimately in vain as it quickly sank into the harbor.Christie can be heard saying: 'Pretty sure that wasn't supposed to happen' before explaining how the tourists were following GPS directions and took a wrong turn.",
        "In a Storyful report, she explained that the crew of the Nanea sailboat had recently returned from a day of sailing when they saw the car drive head-on into the harbor. 'The passengers were tourists trying to find a Manta Ray Snorkel tour company in the harbor and had been following their GPS directions when they took a wrong turn into the water,' she said.'I think they just must've taken their eyes off the road for a second,' she told Hawaii News Now.Christie said she was about to haul her boat in from the harbor after a morning on the water with her husband and their friends, when she saw the car suddenly slip down the boat ramp and right into the water.'I was just sitting there trying to seek shelter from the rain, and then the next thing, I saw a car drive directly past our boat straight into the harbor at a pretty decent speed,' she said. ",
        "In the footage, crew members of the sailboat dive into the harbor and help the female driver of the van escape through the window before carrying her to shallower waters. The other passenger, also a woman, and reportedly the sister of the driver, escaped out the window on the other side of the car. Though the passengers were making active attempts to escape the car, neither looked especially alarmed about what was going on.",
        "Online viewers of the footage pointed to an episode of the The Office in which Steve Carell's Michael Scott and Rainn Wilson's Dwight Schrute find themselves in a similar situation. 'I just watched this episode of 'The Office,'' wrote one online viewer.'Michael Scott already did this episode,' wrote another.Others wondered how the motorists could end up what occurred to happen to actually get the car into the harbor.'It's as easy as looking out the windshield ... What am I missing?' one user asked.Another wrote, mockingly, 'So when you see water you still drive into it?''One expensive vacation,' wrote one viewer. 'Hope they got the extra coverage on their rental car.' "
    ]
}