{
    "articleURL": "/news/article-12047151/Heavily-pregnant-woman-lover-accused-murdering-mummified-pensioner-appear-court.html",
    "content": [
        "Susan Hawkey, 71, was found ‘heavily decomposed’ and ‘mummified’ in home Chelsea Grant, 27, and Xyaire Howard, 23, are charged with murder, two counts of robbery and three counts of fraud by false representation for using bank cardsA couple accused of tying up and murdering a pensioner for her PIN number before going on a £14,000 spending spree with her bank cards have appeared in court.",
        "Susan Hawkey, 71, was found ‘heavily decomposed’ and ‘mummified’ in the foetal position under a duvet in her flat in Neasden, northwest London, on 26 September 2022.Detectives found brown parcel tape on her face and around her wrists, with her hands together behind her back with black shoelaces, the Old Bailey heard.Ms Hawkey, described as a ‘vulnerable elderly lady’ is thought to have died between September 2 and 7.Chelsea Grant, 27, and Xyaire Howard, 23, originally from Saint Vincent and the Grenadines in the Caribbean, are charged with murder, two counts of robbery and three counts of fraud by false representation for using Ms Hawkey’s bank cards.",
        "Howard appeared at the Old Bailey in person while Grant appeared via video link from HMP Bronzefield wearing a bright pink shirt.Grant is heavily pregnant and due to give birth next week.It is claimed the couple were responsible for 143 transactions between 7 and 27 September, totalling £14,000.They are said to have targeted Ms Hawkey in a street robbery on 22 August taking her handbag with her bank card and house keys.After using the bank card to make contactless payments they are then said to have used the house keys in a robbery at her home.They are then said to have returned in September to try and get the PIN from Ms Hawkey by tying her up.",
        "They have not yet entered pleas and today applied to dismiss the charges against them, which was rejected by Judge Mark Lucraft.Prosecutor Ben Holt earlier said: ‘On 26 September police were called to 56A Aylesbury Street by a neighbour of Ms Hawkey.",
        "‘The neighbour was concerned that she had not seen Ms Hawkey for a number of weeks.‘On 17 September she noticed that Ms Hawkey’s recycling bin was still on the road.‘Having still not seen her by 26 September she called the police. Police forced entry.‘Concealed under a duvet they found the heavily decomposed body of Ms Hawkey.‘On examination the deceased’s hands were noted to have been tied behind her back with fabric and brown parcel tape.‘Parcel tape may have been wrapped around the deceased’s head to gag her.’Mr Holt added: ‘The body of Ms Hawkey was badly decomposed.‘As things stand the cause of death has not been ascertained.’The body was found lying on its left hand side with the hips and knees flexed, with the head and neck covered by a jumper.The eyes were covered with brown tape and a piece of black fabric was found around the neck.The hands were tied with black shoelaces with brown parcel tape on top.",
        "Grant and Howard, of Press Road, Neasden, are charged murder, two counts of robbery and three counts of fraud by false representation.They were remanded in custody until 16 June, with their trial date set for 4 September."
    ]
}