{
    "articleURL": "/news/article-12048669/King-Charles-Coronation-guest-Nick-Cave-handpicked-Anthony-Albanese-disappears-group-photo.html",
    "content": [
        "Coronation guest disappears from group photoOver a dozen Australians invited to coronationKing Charles III to be crowned on Saturday One of Anthony Albanese's handpicked Coronation guests has disappeared from a group photo taken ahead of the big day, leaving guests perplexed. ",
        "Veteran rocker Nick Cave, who songs include Red Right Hand and Into Your Arms, was somehow absent from the group shot despite one reporter spotting him at the  pre-Coronation event.'I can't explain why Nick Cave filmed entering and leaving this event chose not to be filmed or captured during these moments,' political reporter Jonathan Lea tweeted. The photo, which appears to have been taken in a stately sitting room, shows the Prime Minister standing proudly among the majority of his guests. Australia's Governor General David Hurley and his wife Linda were pictured in the front row while soccer superstar Sam Kerr is to the prime minister's left. 'I'm proud to have this incredible group of Australians representing our country at the Coronation of King Charles III,' Mr Albanese captioned the group photo. However, eagled-eyed Twitter users were quick to notice Cave's absence. 'Where's Nick?' several people asked. ",
        "In 2017, Cave was named an Officer of the Order of Australia for distinguished service to the performing arts, both nationally and internationally.The Australian musician explained his decision to attend the Coronation was less about his political leanings and more about his love of pageantry. 'I am not a monarchist, nor am I a royalist, nor am I an ardent republican for that matter,' he wrote on his personal blog The Red Hand. ",
        "'What I am also not is so spectacularly incurious about the world and the way it works, so ideologically captured, so damn grouchy, as to refuse an invitation to what will more than likely be the most important historical event in the UK of our age.'Not just the most important, but the strangest, the weirdest.' In response to a fan asking why the f*** he would attend, he shared the story of his one and only meeting with the late Queen - revealing he had been surprised to find himself weeping while watching her funeral on TV. Cave said the Royal had seemed almost 'extraterrestrial' and was one of the most charismatic women he had ever met. 'Maybe it was the lighting, but she actually glowed,' he wrote of the Queen.Cave is one of over a dozen Australians invited to attend the King's coronation. ",
        "The likes of former foreign minister Julie Bishop will be joined by 18-year-old Tayla Green-Aldridge, who is a graduate of the Prince's Trust Australia Get Into Maritime course.Ms Green-Aldridge, a Wiradjuri and Yuin woman who will fly to the UK with her mother will experience her first time out of Australia, and her first time on a plane. Mr Albanese has urged Australians to put aside debates on constitutional arrangements ahead of the Coronation of King Charles.",
        "He met the King's oldest son, Prince William, at Kensington Palace on Thursday before addressing a contingent of Australians invited to the event. 'You are representing Australia at what is an incredible event of historic significance,' the prime minister told the handpicked delegation. Governor-General David Hurley and state governors are also attendees.'Regardless of what Australians think of constitutional arrangements - and we'll have different views on that - as a nation, what we need to do is to celebrate who we are, and to respect our institutions,' Mr Albanese said in his speech.'And there's such enormous respect for the royal family.'While he is a republican, the prime minister has said he is looking forward to being at the Coronation ceremony.'One of the things that I certainly admire about King Charles and the Prince of Wales who is continuing that tradition, is their concern about the future,' Mr Albanese said.",
        "'Their concern and outspoken views about climate change, about the need to protect our planet, about the urban environment, about a whole range of issues, including respect for Indigenous Australians, which is why the Palace's request - which was well received by a government such as mine - was so heartwarming.'Mr Albanese told Prince William that he and other members of the royal family were welcome to visit Australia at a time of their choosing.",
        "The Prince and his wife Kate had earlier on Thursday taken their first trip on the Elizabeth Line of London's Underground, named after William's late grandmother Queen Elizabeth.Mr Albanese said the Queen had been 'a constant, reassuring presence in our lives... and when she passed away, there was a great deal of mourning for someone who we had affection for, but also incredible respect'.'Some of us have chosen public life as something I think is a very honourable profession. But for the royal family, they're born into it. And they serve as their duty but also due to their commitment to their nation, but also to the Commonwealth, of which Australia is an important part.'Jasmine Coe, a Wiradjuri-British artist, will travel to Westminster Abbey and is known for her work as the creator and curator of Coe Gallery - the first and only Aboriginal owned art gallery in the UK. Dr Daniel Nour, who founded Street Side Medics, a not-for-profit, GP led mobile medical service for people experiencing homelessness, and youth advocate and Rhodes Scholar Yasmin Poole are also on the list of attendees. ",
        "London-based nurse Emily Reegan will also be at the event. She worked for the NHS in the emergency department during the peak of the Covid pandemic.",
        "Other attendees include Minette Salmon, who is studying a PhD in genomic medicine and statistics at Oxford, and Claire Spencer who is recognised for her contribution to the performing arts.Professor Merryn Voysey, who helped develop the Oxford-AstraZeneca vaccine and was named Australian of the Year in the UK in 2022, and distinguished soprano Yvonne Kenny will attend as well.Corporal Daniel Keighran, who was awarded the Victoria Cross for Australia for his efforts in Afghanistan in 2010, and Richard Joyes CV who was given the Cross of Valour in 2003 for rescuing victims of the 2002 Bali bombing have also been invited.The Coronation will start at 11am in the UK, which is 8pm AEST, on Saturday. ",
        "Ms Sam Kerr OAMMs Leanne Benjamin AM OBEMr Nick Cave AOMs Jasmine CoeMr Adam Hills MBEDr Daniel NourMiss Yasmin PooleMs Emily ReganMs Minette SalmonMs Claire Spencer AMProfessor Merryn VoyseyCorporal Daniel Keighran VCMr Richard Joyes CVMs Yvonne Kenny AMJulie BishopTayla Green-AldridgeAnthony Albanese and Jodie HaydonDavid Hurley and Linda Hurley "
    ]
}