{
    "articleURL": "/tvshowbiz/article-12061125/Im-Celeb-Fans-rage-Georgia-Toffolo-Andy-Whyment-fail-return-Janice-Dickinson-exit.html",
    "content": [
        "I'm A Celebrity... South Africa viewers were left fuming after Georgia Toffolo and Andy Whyment were not brought back to camp following Janice Dickinson's departure.",
        "During Monday night's episode, viewers saw former Made In Chelsea star Georgia, 28, and Coronation Street actor Andy, 42, sent home after losing out in the head-to-head battle with Myleene Klass and Jordan Banjo.Elsewhere in the instalment of the ITV reality show, it was announced supermodel Janice, 68, had left the camp after sustaining a nasty injury when she fell as she got up in the middle of the night to go to the loo.And fans of the series were left unimpressed with the decision not to bring back Georgia or Andy after Janice's exit which occurred while the programme was being pre-recorded in September last year.Taking to Twitter, many insisted one of the pair should have returned, while others questioned whether Janice chose to leave for other reasons after her fall was not shown on television.",
        "One person wrote: 'Since Janice went out early, Toff should’ve been brought back in.'  While someone else commented: 'One should come back to replace Janice. Toff is pure golden.''Feel like cause two were meant to leave because Janice is away they should have brought Toff or Andy back,' wrote another person.Someone else posted: 'Janice should have just done the trial Toff has gone for no reason.'While another viewer wrote: 'Gutted that @andywhyment81 and Toff went home. They had already done a Survival Trial, it wasn't fair they had to do another one! It should've been Paul and Janice that left! Andy and Toff should still be in! Gonna miss them both @imacelebrity @antanddec.'",
        "'Should have been Janice and Paul. Andy and Toff come back,' posted someone else.Janice Dickinson was forced to quit I'm A Celebrity ... South Africa after falling over on her way to the dunny.She left camp to seek medical attention and it was decided she would not return.",
        "During Monday's episode, former Coronation Street actress Helen Flanagan was seen reading out a note to let the campmates know of Janice's departure.However, footage of Janice's fall was not shown, leading some fans of the show to take to social media to question if Janice had actually left simply because she did not want to continue with the show. One person tweeted: 'Hummm could this have been intentional??! She did not look like she was loving it!', while someone else exclaimed: 'Fall my foot!'Someone else wrote: 'She probably did it on purpose,' while another person posted: 'She couldn't be bothered anymore is the truth of it.''She didn't fall, just an excuse to leave,' wrote someone else.Someone else remarked: '\"Fall\" yeah okay. Because we ARE that stupid to believe that.'MailOnline has contacted ITV for comment. Janice Dickinson was forced to quit 'I'm A Celebrity ... South Africa' after falling over on her way to the dunny.",
        "The former model has since opened up about the 'freak accident' in the middle of the night which forced her off the ITV reality show - which was recorded last year - revealing she tripped over in the dark and landed face-first. ",
        "She was stretchered off and taken by ambulance to hospital to treat her injuries and she wasn't allowed to return to camp.Janice told The Sun newspaper's TV Mag: 'In the middle of one night I woke up because I had to go to the dunny [toilet] ... The campfire had gone out and it was as dark as it could be. So I thought: \"Right, I’ll make it to the dunny from memory.\"'I walked a couple of steps and tripped, flying flat on my face – hair all over my forehead, my nose was bloody and my whole chin was gashed open. Blood was gushing from all these areas, and there was dirt and stones embedded in my face from the fall.'She was rescued by campmates Fatima Whitbread and Phil Tufnell who got her back to the main camp and called for a medic.Janice went on: '[The doctor] said: \"Oh my! We have to take her to the medical hut\" so they could wash away the blood, stones and dirt in case infection set in.",
        "'They gave me pain relief, put me on a stretcher and four men galloped me out along the road in the middle of the night in the cold air, two feet above the ground.",
        "'We reached an ambulance and the paramedics put a compress on my forehead and my chin. It was bad. I was in this tiny hospital in the middle of nowhere and they called my husband [Robert Gerner], who was in South Africa, to bring him to the hospital.'At the hospital, the doctors cleaned up her cuts and scrapes and gave her more painkillers.However, Janice was unable to rejoin the rest of her campmates and her time in the show came to an end.Georgia and Andy were eliminated from I'm A Celebrity... South Africa during Monday night's episode.The Corrie star, 42, and the former Made in Chelsea cast member, 28, from the green pride lost out to yellow pride's Jordan Banjo and Myleene Klass.",
        "The group went head-to-head in the gold mine trial, with the winners earning a luxury picnic, while the losing pair were sent home.As she left Toff said: 'It's been glorious! It has just been amazing. Doing it twice has been really immense.'Andy added: 'Thanks for having me back!', before the pair boarded their boats back to civilisation.'I'm A Celebrity... South Africa continues on ITV1 and ITVX at 9pm on Tuesday. "
    ]
}