{
    "articleURL": "/news/article-12046763/Bizarre-tale-Natalia-Grace-adopted-Ukrainian-dwarf-terrorized-family.html",
    "content": [
        "Michael and Kristine Barnett adopted Natalia Grace in 2010, believing they were taking home a six-year-old childTwo years later, they filed a petition in a probate court to have her birth year legally pushed back 14 years - which was granted - before abandoning herIn a new documentary, Michael claims the family was 'abused' and that Natalia terrorized and tried to kill them   A father, whose family adopted a Ukrainian dwarf who they claim is an 'adult sociopath masquerading as a child,' sobs and punches the floor in a new documentary trailer, while screaming that they were 'all abused.' ",
        "Michael Barnett, who was recently acquitted of neglect charges, grows emotional in a new trailer for The Curious Case of Natalia Grace, which will be released in three parts on Investigation Discovery (ID) starting on May 29. He can be seen tearing up, shaking with anger, and throwing violent fists into the floor as he recounts a terrifying experience with his adoptive daughter Natalia Grace Barnett. 'We were all abused,' Michael cries. 'I hate this.' Michael and his wife Kristine Barnett adopted Natalia on April 26, 2010, believing they were taking home a six-year-old child. But things quickly took a turn for the worse when they said she became violent and they suspected she was an adult posing as a child. They petitioned a probate court to change her birth year back 14 years, which was granted in 2012, legally changing the Ukrainian-born dwarf's age from nine to 23.The family claimed Natalia was 'told her new birthdate at the orphanage in Ukraine' before moving to the US and 'threatened to stab' their children while living with them in Layfette, Indiana. 'She tried to poison and kill my wife,' Michael claimed. '[And] one night, I opened my eyes and Natalia is standing at the foot of the bed with a knife in her hand.' ",
        "'I definitely didn't feel safe around Natalia,' their son Jake said in the documentary. ",
        "Michael warned viewers in the trailer that they would be getting the 'truth,' but they 'might not like the truth.' After the couple was granted their petition, they took off to Canada with their three biological sons, where their eldest, Jake, was meant to start college. The Barnetts left Natalia in Layfette, Indiana, after getting her an apartment. They were later charged with neglect for abandoning a child, but the Barnett family claimed they were victims of fraud. Police said at the time that Natalia was left to fend for herself for three years despite having a rare form of dwarfism that means she is three feet tall and has problems walking. In an exclusive interview with DailyMailTV in 2019, Kristine insisted there was a major flaw in the case: Natalia was not a nine-year-old - as charging documents claimed. She was actually 22.",
        "In a 2019 episode of Dr. Phil, Natalia denied being an adult and her new parents even defended her, stating she was a 'genuine loving girl' and not an 'adult sociopath masquerading as a child.' Despite her age being legally changed, the couple was still charged because authorities said she was dependent on the Barnetts because of her dwarfism. They originally also faced charges for neglecting a child, but those were dropped due to the legal age change and statute of limitations. ",
        "Barnett told DailyMailTV that she and her family were the true victims, after they were terrorized for years by the mysterious impostor who threatened to stab them in their sleep, pushed her towards an electric fence and poured bleach in her coffee.‘She would make statements and draw pictures saying she wanted to kill family members, roll them up in a blanket and put them in the backyard,’ she told DailyMailTV. ‘She was standing over people in the middle of the night. You couldn't go to sleep. We had to hide all the sharp objects.‘I saw her putting chemicals, bleach, Windex something like that, in my coffee and I asked her, \"What are you doing?\" She said, \"I am trying to poison you.\"‘The media is painting me to be a child abuser but there is no child here,’ said Barnett.",
        "'Natalia was a woman. She had periods. She had adult teeth. She never grew a single inch, which would happen even with a child with dwarfism.'The doctors all confirmed she was suffering a severe psychological illness only diagnosed in adults.'She was jumping out of moving cars. She was smearing blood on mirrors. She was doing things you could never imagine a little child doing.' However, their son Jake said in the trailer his mother wasn't fully innocent. ",
        "'My mom isn't 100 percent innocent,' their now-adult son told Investigation Discovery. In the past, Michael accused his now-ex-wife of beating Natalia. In October. Michael was acquitted of his charges. Nearly six months later, Kristine's case would be dismissed three weeks before trial. The first part of The Curious Case of Natalia Grace will air on ID from 9-11pm on May 29. "
    ]
}