{
    "articleURL": "/wires/reuters/article-12061019/Tesla-plans-produce-lithium-1-mln-vehicles-Texas-refinery-Elon-Musk.html",
    "content": [
        "By Hyunjoo Jin and Ernest Scheyder",
        "May 8 (Reuters) - Tesla Inc on Monday broke ground on a Texas lithium refinery that CEO Elon Musk said should produce enough of the battery metal to build about 1 million electric vehicles (EVs) by 2025, making it the largest North American processor of the material.The facility will push Tesla outside its core focus of building automobiles and into the complex area of lithium refining and processing, a step Musk said was necessary if the auto giant was to meet its ambitious EV sales targets.\"As we look ahead a few years, a fundamental choke point in the advancement of electric vehicles is the availability of battery grade lithium,\" Musk said at the ground-breaking ceremony on Monday, with dozers and other earth-moving equipment operating in the background.Musk said Tesla aimed to finish construction of the factory next year and then reach full production about a year later.The move will make Tesla the only major automaker in North America that will refine its own lithium. Currently, China dominates the processing of many critical minerals, including lithium.\"Texas wants to be able to be self-reliant, not dependent upon any foreign hostile nation for what we need. We need lithium,\" Texas Governor Greg Abbott said at the ceremony.Musk did not specify the volume of lithium the facility would process each year, although he said the automaker would continue to buy the metal from its vendors, which include Albemarle Corp and Livent Corp.",
        "\"We intend to continue to use suppliers of lithium, so it's not that Tesla will do all of it,\" Musk said.Albemarle plans to build a lithium processing facility in South Carolina that will refine 100,000 tonnes of the metal each year, with construction slated to begin next year and the facility coming online sometime later this decade.Musk did not say where Tesla will source the rough form of lithium known as spodumene concentrate that will be processed at the facility, although Tesla has supply deals with Piedmont Lithium Inc and others.'CLEAN OPERATIONS'Tesla said it would eschew the lithium industry's conventional refining process, which relies on sulfuric acid and other strong chemicals, in favor of materials that were less harsh on the environment, such as soda ash.\"You could live right in the middle of the refinery and not suffer any ill effect. So they're very clean operations,\" Musk said, although local media reports said some environmental advocates had raised concerns over the facility.Monday's announcement was not the first time that Tesla has attempted to venture into lithium production. Musk in 2020 told shareholders that Tesla had secured rights to 10,000 acres in Nevada where it aimed to produce lithium from clay deposits, which had never been done before at commercial scale.",
        "While Musk boasted that the company had developed a proprietary process to sustainably produce lithium from those Nevada clay deposits, Tesla has not yet deployed the process.Musk has urged entrepreneurs to enter the lithium refining business, saying it is like \"minting money.\"\"We're begging you. We don't want to do it. Can someone please?,\" he said during a conference call last month.Tesla said last month a recent plunge in prices of lithium and other commodities would aid Tesla's bruised margins in the second half of the year.The refinery is the latest expansion by Tesla into Texas after the company moved its headquarters there from California in 2021. Musk's other companies, including like SpaceX and The Boring Company, also have operations in Texas.\"We are proud that he calls Texas home,\" Abbott said, saying Tesla and Musk are \"Texas's economic juggernauts.\" (Reporting by Hyunjoo Jin and Ernest Scheyder; Editing by Chris Reese, Sandra Maler and Jamie Freed)"
    ]
}