{
    "articleURL": "/news/article-12041245/MoD-launches-probe-grandmother-52-claims-military-aircraft-tore-hole-roof.html",
    "content": [
        "Lesley Wager, 52, said roof tiles were torn from her Lea Hall home on April 22MoD says it is investigating but there were no planned military flying in that areaA woman has claimed a 'military aircraft' tore a hole in her roof after it flew overhead - forcing the MoD to launch an investigation.",
        "Lesley Wager, 52, said roof tiles were torn from her Lea Hall home in east Birmingham at around 3.20pm on April 22.Pictures showed tiles and a wooden plank sticking out, with the inside of the loft visible. The MoD confirmed it is investigating the case but said there was no planned military flying in the area and the military do not routinely fly on a Saturday. Flight radar also shows no military aircraft were in the area at that time, according to an analysis by MailOnline. ",
        "The MoD added that should claims for injury, loss or damage be made, the MoD will pay fair and reasonable compensation subject to the provision of supporting evidence.Ms Wager has said she has been experiencing panic attacks since the military aircraft supposedly flew past.'You could hear it before it came, a military aircraft flew past and dust fell through the air,' the grandmother told Birmingham Live. 'I ran outside and shouted for my husband, you could see tiles on the ground and there was a big hole in our roof. I want someone to inspect the roof for structural safety. I was told they would email an investigation team and get back to me but it has been ten days. ",
        "'My mental health has gone down and I feel like my head will explode, I have had panic attacks and been in tears.'",
        "The 52-year-old also added that her husband has since repaired the damage. An MoD spokesperson said: 'The MOD is looking into a claim that a military aircraft caused damage to a roof in the Birmingham area, the MOD has contacted the complainant and will advise her of the outcome of the investigation once complete."
    ]
}