{
    "articleURL": "/wires/ap/article-12047719/Jury-finds-Ed-Sheeran-didnt-copy-Marvin-Gaye-classic.html",
    "content": [
        "NEW YORK (AP) - British singer Ed Sheeran didn't steal key components of Marvin Gaye´s classic 1970s tune \"Let´s Get It On\" to create his hit song \"Thinking Out Loud,\" a jury said with a trial verdict Thursday, prompting Sheeran to joke later that he won't have to follow through on his threat to quit music.",
        "The emotions of an epic copyright fight that stretched across most of the last decade spilled out as soon as the seven-person jury revealed its verdict after over two hours of deliberations.Sheeran, 32, briefly dropped his face into his hands in relief before standing to hug his attorney, Ilene Farkas. As jurors left the courtroom in front of him, Sheeran smiled, nodded his head at several of them, and mouthed the words: \"Thank you.\" Later, he posed for a hallway photograph with a juror who lingered behind.He also approached plaintiff Kathryn Townsend Griffin, the daughter of Ed Townsend, who co-created the 1973 soul classic with Gaye and had testified. They spoke about 10 minutes, hugging and smiling and, at one point, clasping their hands together.Sheeran later addressed reporters outside the courthouse, revisiting his claim made during the trial that he would consider quitting songwriting if he lost the case.\"I am obviously very happy with the outcome of this case, and it looks like I'm not going to have to retire from my day job, after all. But at the same time, I am unbelievably frustrated that baseless claims like this are allowed to go to court at all,\" the singer said, reading from a prepared statement.",
        "He also said he missed his grandmother's funeral in Ireland because of the trial, and that he \"will never get that time back.\"",
        "Inside the courthouse after the verdict, Griffin said she was relieved.\"I'm just glad it's over,\" she said of the trial. \"We can be friends.\"She said she was pleased Sheeran approached her.\"It showed me who he was,\" Griffin said.She said her copyright lawsuit wasn't personal but she wanted to follow through on a promise to her father to protect his intellectual property.A juror, Sophia Neis, told reporters afterward that there was not immediate consensus when deliberations began.\"Everyone had opinions going in. Both sides had advocates, said Neis, 23. \"There was a lot of back and forth.\"The verdict capped a two-week trial that featured a courtroom performance by Sheeran as the singer insisted, sometimes angrily, that the trial was a threat to all musicians who create their own music.Sheeran sat with his legal team throughout the trial, defending himself against the lawsuit by Townsend's heirs, who had said \"Thinking Out Loud\" had so many similarities to \"Let's Get It On\" that it violated the song's copyright protection.It was not the first court victory for a singer whose musical style draws from classic soul, pop and R&amp;B, making him a target for copyright lawsuits. A year ago, Sheeran won a U.K. copyright battle over his 2017 hit \"Shape of You\" and then decried what he labeled a \"culture\" of baseless lawsuits that force settlements from artists eager to avoid a trial's expense.",
        "Outside court, Sheeran said he doesn't want to be taken advantage of.\"I am just a guy with a guitar who loves writing music for people to enjoy,\" he said. \"I am not and will never allow myself to be a piggy bank for anyone to shake.\"At the trial's start, attorney Ben Crump told jurors on behalf of the Townsend heirs that Sheeran himself sometimes performed the two songs together. The jury saw video of a concert in Switzerland in which Sheeran can be heard segueing on stage between \"Let's Get It On\" and \"Thinking Out Loud.\" Crump said it was \"smoking gun\" proof Sheeran stole from the famous tune.In her closing argument on Wednesday, Farkas said Crump's \"smoking gun was shooting blanks.\"She said the only common elements between the two songs were \"basic to the tool kit of all songwriters\" and \"the scaffolding on which all songwriting is built.\"\"They did not copy it. Not consciously. Not unconsciously. Not at all,\" Farkas said.When Sheeran testified over two days for the defense, he repeatedly picked up a guitar resting behind him on the witness stand to demonstrate how he seamlessly creates \"mashups\" of two or three songs during concerts to \"spice it up a bit\" for his sizeable crowds.",
        "The English pop star's cheerful attitude on display under questioning from his attorney all but vanished under cross examination.\"When you write songs, somebody comes after you,\" Sheeran testified, saying the case was being closely watched by others in the industry.He insisted that he and the song's co-writer - Amy Wadge - stole nothing from \"Let's Get it On.\"Townsend's heirs said in their lawsuit that \"Thinking Out Loud\" had \"striking similarities\" and \"overt common elements\" that made it obvious that it had copied \"Let's Get It On,\" a song that has been featured in numerous films and commercials and scored hundreds of millions of streams spins and radio plays in the past half century.Sheeran's song, which came out in 2014, was a hit, winning a Grammy for song of the year.Sheeran´s label, Atlantic Records, and Sony/ATV Music Publishing were also named as defendants in the \"Thinking Out Loud\" lawsuit, but the focus of the trial was Sheeran.Wadge, who was not a defendant, testified on his behalf and hugged Sheeran after the verdict.Gaye was killed in 1984 at age 44, shot by his father as he tried to intervene in a fight between his parents. He had been a Motown superstar since the 1960s, although his songs released in the 1970s made him a generational musical giant.",
        "Townsend, who also wrote the 1958 R&amp;B doo-wop hit \"For Your Love,\" was a singer, songwriter and lawyer who died in 2003. Griffin, his daughter, testified during the trial that she thought Sheeran was \"a great artist with a great future.\"___Associated Press Writer Andrew Dalton in Los Angeles contributed to this report. Find more AP stories about Ed Sheeran: https://apnews.com/hub/ed-sheeran"
    ]
}