{
    "articleURL": "/tvshowbiz/article-12044673/Alicia-Keys-models-floral-romper-poolside-Rio-Janeiro-performing-Jeunesse-Arena.html",
    "content": [
        "15-time Grammy winner Alicia Keys took part in a photo shoot by the rooftop pool at the five-star Hotel Fasano in Rio De Janeiro on Wednesday.",
        "The 42-year-old R&amp;B songstress modeled a long-sleeve, belted floral romper with sandals and covered her braids with a purple head scarf.Alicia - the self-described leader of the 'No Makeup Movement' - let her natural beauty shine through and wore plenty of jewelry for her shoot.Keys (born Aguello-Cook) arrived at the Brazilian seaside city on Sunday in order to kick off the Latin American leg of her 59-date Alicia + Keys World Tour.'Rio, the energy from you is unreal!' the native New Yorker - who boasts 113.9M social media followers - wrote Tuesday via Instastory.",
        "'Taking the stage tomorrow night and singing with you will be everything!'Alicia hit the stage at Jeunesse Arena, which seats 18,768 fans, wearing a glamorous pink caped pantsuit selected by stylist Jason Bolden.For the last few weeks, Keys has been practicing the Spanish language so she can more authentically connect with fans in Brazil, Argentina, Chile, Colombia, and Mexico.The Stay songstress used her three-octave contralto pipes to sing her 2003 hit If I Ain't Got You completely in Spanish, and she also performed her 2021 track Nat King Cole (Unlocked).On Monday, TMZ reported that Roc Nation and Alicia personally invited Ralph Yarl, the teenager who was shot twice in the head after ringing the wrong door bell on April 13, to attend her St. Louis concert on July 21.",
        "The 16-year-old Staley High School student has amassed over $3.4M of a $2.5M goal on his GoFundMe organized by Faith Spoonmore.As for the Fox News-obsessed 84-year-old who shot Ralph, Andrew Lester is out on bail after pleading not guilty on April 19 to charges of first-degree assault and armed criminal action.On the personal front, Keys has two sons - Egypt Daoud Dean, 12; and Genesis Ali Dean, 8 - from her 12-year marriage to Grammy winner Swizz Beatz (born Kasseem Dean).The Athleta collaborator is step 'mammy' to the 44-year-old rapper's three older children - son Prince Nasir aka Note Marcado, 22; son Kasseem, Jr., 16; and Nicole Dean, nearly 15 - with ex-wife Mashonda Tifrere, Nichole Levy, and Jahna Sebastian.Alicia and Swizz originally met as teenagers, but they didn't start their romance until the fall of 2008 nearly a year after he legally separated from his 45-year-old first wife."
    ]
}