{
    "articleURL": "/wires/ap/article-12050079/UK-Conservatives-battering-key-local-elections.html",
    "content": [
        "LONDON (AP) - Britain´s Conservative Party endured a drubbing from voters Friday in local elections that delivered a warning to Prime Minister Rishi Sunak ´s government, and a boost to the opposition, as a national election approaches.",
        "The left-of-center main opposition Labour Party made gains that raised its hopes of winning a nationwide parliamentary vote that is due by the end of 2024. Labour leader Keir Starmer said \"we are on course for a Labour majority at the next general election.\"The Conservatives acknowledged it had been \"disappointing\" election for the party.With almost all the results from Thursday's voting in, the Conservatives had lost more than 1,000 seats in elections for more than 8,000 seats on 230 local councils across England. Before the vote, the party had used the 1,000 figure as a reasonable worst-case scenario.The right-of-center party lost control of more than 40 councils, including Medway in southeast England, which it had run for a quarter-century, and the naval city of Plymouth in the southwest.Labour gained more than 500 seats and won control of several new councils, while the centrist Liberal Democrats also made gains and grabbed control from the Conservatives in Windsor, an affluent town west of London that is the location of royal residence Windsor Castle. There were also surprise wins for the environmentalist Greens.The BBC projected that if the results were replicated nationally, Labour would have a nine-point lead, likely enough to form a government, and possibly win an outright majority of seats in Parliament.",
        "While many contests turned on local issues such as potholes and garbage collection, voters appeared to punish the Conservatives for the turmoil that engulfed the party under former Prime Minister Boris Johnson. He resigned amid multiple scandals and was replaced by Liz Truss, whose rash tax-cutting plans spooked financial markets, hammered the value of the pound and roiled the wider U.K. economy.Truss was forced to resign after six weeks in office, becoming Britain's shortest-serving prime minister. The party chose Sunak, a former banker, to try to restore stability to the economy and the government.Worryingly for Sunak´s party, the Conservatives lost ground both in working-class northern areas that they previously won from Labour - largely by championing Britain's exit from the European Union - and in more affluent southern districts where anti-Brexit voters have turned to the Lib Dems or Labour.Sunak said Friday that \"it´s always disappointing to lose hard-working Conservative councilors.\" But he insisted he was \"not detecting any massive groundswell of movement towards the Labour Party or excitement for its agenda.\"The Conservatives have been in power nationally since 2010, years that saw austerity following the world global banking crisis, Britain´s divisive decision to leave the European Union, a global pandemic and a European war that has triggered the worst cost-of-living crisis in decades.",
        "Labour said the results showed many voters are eager for change. But University of Strathclyde polling expert John Curtice said that Labour so far didn't have the scale of lead achieved before its landslide 1997 election victory under Tony Blair, the peak of the party's popularity.\"Labour are going to have their biggest lead over the Conservatives in terms of votes than at any point since 2010, but it´s going to be as much to do with the Conservatives being down as much as it is Labour being up,\" he said.The results aren't a complete snapshot of the U.K. There were no elections in London, Scotland or Wales, while Northern Ireland will vote on May 18.The election was the first to be held since the government changed the law to require voters to show photo identification at all U.K. polling stations.The government says ID is required to vote in many democracies, and the move will help prevent voter fraud. Critics say there is little evidence electoral fraud is a problem in Britain.Acceptable forms of ID include passports, driver´s licenses and senior citizens´ travelcards - but not transit passes for young people. The government says getting an older person´s travelcard requires proof of age, unlike other transit passes. But the discrepancy has brought allegations that the change will disproportionately prevent young people - the group least likely to support the Conservatives - from voting. Poor people are also less likely to have photo ID than the more affluent.",
        "Official elections watchdog the Electoral Commission said after polls closed Thursday night that \"overall, the elections were well-run,\" but \"some people were regrettably unable to vote today as a result\" of the new rules.\"It will be essential to understand the extent of this impact, and the reasons behind it, before a final view can be taken on how the policy has worked in practice and what can be learnt for future elections,\" the commission said in a statement."
    ]
}