{
    "articleURL": "/wires/reuters/article-12058071/MLB-roundup-Down-6-Rays-stun-Gerrit-Cole-Yanks.html",
    "content": [
        "Isaac Paredes hit an RBI single with one out in the 10th inning to lift the Tampa Bay Rays to an 8-7 comeback win against the New York Yankees in the rubber game of their three-game series on Sunday in St. Petersburg, Fla.",
        "Paredes hit an opposite-field line drive to right off Albert Abreu (1-1) to score Brandon Lowe from second base.Jose Siri and Christian Bethancourt homered for Tampa Bay, which came back from a 6-0 deficit against Yankees ace Gerrit Cole, who breezed through four innings before giving up two runs in the fifth and four in the sixth. Cole gave up six runs (five earned) and eight hits, striking out six and walking two in his five-plus innings.Harrison Bader homered, tripled, singled and scored three runs for New York and Anthony Rizzo also went deep.Marlins 5, Cubs 4 (14 innings)Miami scored the tiebreaking run on a 14th-inning balk -- overcoming Sandy Alcantara blowing a two-run lead in the ninth -- to snap a five-game losing streak with a road win over Chicago.Each team scored a run in the 10th and 13th innings. Then, with Garrett Hampson on third base in the 14th, Chicago's Adbert Alzolay (1-2) was called for a balk by home-plate umpire Alan Porter to bring the eventual winning run home. Andrew Nardi kept the Cubs scoreless in the bottom of the 14th, and Miami won its first game in May to improve to 11-0 in one-run contests.Chicago was down 2-0 entering the ninth against reigning NL Cy Young Award winner Alcantara, who was looking for his second complete game of the season. However, Ian Happ (two hits) singled with one out and scored on Cody Bellinger's double into the left-field gap. Bellinger (two hits) then scored on Eric Hosmer's RBI single off Alcantara, who exited after allowing nine hits while striking out nine without a walk on 113 pitches.",
        "Braves 3, Orioles 2 (12 innings)Michael Harris II lined a double to center field to drive in Ozzie Albies with the winning run in extra innings, lifting Atlanta to a win over visiting Baltimore.Baltimore reliever Cionel Perez (1-1) struck out Kevin Pillar to open the 11th inning but intentionally walked Marcell Ozuna to set up a force play. Harris, who barely missed a three-run homer earlier in the game, jumped on the first pitch he saw and bounced it off the wall, allowing Albies to easily score from second base.The winning pitcher was Michael Tonkin (3-1), who did not allow a hit over two scoreless innings. Matt Olson belted his 10th homer in the first for Atlanta. Atlanta's Ronald Acuna Jr. went 0-for-5, which ended his 25-game streak of reaching base. Baltimore's Ryan Mountcastle went 0-for-5 and saw his streak of reaching base end at 15 games.Cardinals 12, Tigers 5Paul Goldschmidt hit three homers and drove in four runs as St. Louis snapped its eight-game losing streak with a victory over visiting Detroit.Brendan Donovan hit a three-run homer for the Cardinals and Lars Nootbaar drove in two runs. Cardinals starting pitcher Steven Matz allowed one run on five hits in 5 1/3 innings. He struck out two without a walk. Reliever JoJo Romero (1-0) earned his first career victory.",
        "Jake Rogers hit a grand slam and Spencer Torkelson also hit a home run for the Tigers, whose five-game winning streak came to a halt. Tigers reliever Mason Englert (1-2) took the loss, allowing five runs -- though only one was earned -- on three hits while recording just one out.Guardians 2, Twins 0Cal Quantrill shook off unusual home struggles this season and returned to form, flirting with a no-hitter and pitching Cleveland to a victory over visiting Minnesota.The right-hander had a no-hitter into the seventh inning by inducing 11 ground-ball outs during that stretch, before Alex Kirilloff broke up the gem with two out in the seventh by rifling a single through the infield into right field. Quantrill walked the next hitter, Joey Gallo, but then struck out Jose Miranda to end his outing.Cleveland opened this game with three straight singles off Minnesota right-hander Joe Ryan, who was leading the major leagues with a 0.77 WHIP entering the game. Jose Ramirez delivered the third of those hits, with his single to right scoring Steven Kwan, then Ramirez later came across to score for a 2-0 lead on Josh Bell's RBI single.Nationals 9, Diamondbacks 8Joey Meneses hit a three-run home run in the top of the ninth to rally Washington to a victory over Arizona in Phoenix.",
        "Luis Garcia doubled and had three hits, Stone Garrett had two hits and two runs and CJ Abrams also had two hits for Washington, which ended a two-game losing streak. Erasmo Ramirez (2-1) picked up the win in relief and Hunter Harvey pitched around a one-out walk to secure a scoreless ninth and pick up his first career save.The Nationals trailed 8-6 entering the ninth but needed just four pitches by reliever Miguel Castro (1-1) to take the lead. Garcia hit the first pitch for a double and then went to third on a single by Keibert Ruiz. Meneses followed with his second homer of the season. Lourdes Gurriel Jr. homered twice, scored four runs and had four RBIs and Christian Walker also homered for Arizona, which had its win streak snapped at three.Phillies 6, Red Sox 1Kyle Schwarber broke out of a slump by collecting two hits to help Philadelphia end a six-game losing streak by beating visiting Boston.Schwarber had a two-run home run and an RBI single for the Phillies, who ended Boston's winning streak at eight games. His fourth-inning single ended an 0-for-21 drought and was Schwarber's first hit since he homered against the Dodgers last Monday. Taijuan Walker (3-2) went six innings to earn the win.",
        "Triston Casas hit his fourth home run of the season for the Red Sox, who scored at least five runs in each game during their eight-game winning streak. Boston's Masataka Yoshida extended his hitting streak to 16 games with a single in the first, before getting picked off. He had two of Boston's five hits.Mariners 3, Astros 1Rookie right-hander Bryce Miller pitched six scoreless innings for his first major league victory and Julio Rodiguez hit a mammoth homer as host Seattle defeated Houston.Miller (1-0), who retired the first 16 batters he faced in his big-league debut last week in Oakland, gave up two hits to the Astros, walked one and struck out five. Justin Topa pitched the ninth, converting his first career save opportunity as Seattle won for the sixth time in its past seven games.Astros right-hander Brandon Bielak (0-1), making his first start since 2021, allowed three runs -- two earned -- on 10 hits in 4 2/3 innings. Bielak walked two and didn't strike out a batter but limited the damage by getting the Mariners to hit into three double plays. Kyle Tucker hit an RBI single for Houston, which has lost four of its last five.Rangers 16, Angels 8Adolis Garcia went 3-for-4 with a home run, Leody Taveras went 4-for-5 and drove in four runs and Texas closed out a road series win with a rout of Los Angeles in Anaheim, Calif.",
        "Texas fell behind early when Anthony Rendon sent Mike Trout and Shohei Ohtani home with a three-run homer in the first inning off Rangers starter Martin Perez. Perez surrendered seven earned runs and eight hits in just 3 2/3 innings.Starter Jose Suarez (1-2), who took the loss, lasted just 2 2/3 innings for Los Angeles. He gave up seven earned runs on six hits and walked three batters. Relievers Chase Silseth and Chris Devenski pitched 3 1/3 and two innings, allowing three earned runs each.Rockies 13, Mets 6Kris Bryant and Brenton Doyle each homered and finished with three RBIs for Colorado, which beat host New York in the rubber game of a three-game series. The Rockies have won six of seven, while the Mets have dropped 11 of 14.Jeff McNeil had three hits and two RBIs while Brett Baty hit a two-run single in the opening inning for the Mets. Luis Guillorme (2-for-4) had a fifth-inning RBI single while Daniel Vogelbach hit a solo homer in the seventh.Brent Suter (1-0), the second of six pitchers for the Rockies, earned the win after giving up one run on three hits and no walks with three strikeouts over 1 2/3 innings. Jimmy Yacabonis (2-1) took the loss after giving up five runs on three hits and two walks in just one-third of an inning in the fifth.Blue Jays 10, Pirates 1In a game delayed by 90 minutes because of rain, Whit Merrifield homered and drove in four runs as visiting Toronto completed a three-game series sweep with a blowout win over Pittsburgh.Daulton Varsho and Kevin Kiermaier also had home runs, and Danny Jansen drove in two runs for the Blue Jays. Brandon Belt went 3-for-4 with two runs. Toronto starter Yusei Kikuchi (5-0) pitched 6 1/3 scoreless innings, allowing four hits and two walks with three strikeouts.Carlos Santana had an RBI single for the Pirates, whose losing streak reached seven games. Pittsburgh starter Roansy Contreras (3-3) allowed five runs and nine hits in five innings, with four strikeouts and three walks.Royals 5, Athletics 1Salvador Perez homered and Ryan Yarbrough won a start for the first time since August 2021 as host Kansas City beat Oakland, salvaging the final game of the weekend series.It was a painful victory for Yarbrough (1-4), who was struck on the left cheek by Ryan Noda's line drive in the sixth inning on a ball with an exit velocity measured at 106 mph. Yarbrough was helped off the field and the Royals said he was \"alert\" and undergoing further testing.Yarbrough allowed one run on three hits over 5 2/3 innings, his longest start since July last year with the Tampa Bay Rays. Kansas City snapped a three-game slide, winning for just the third time in 19 home games. Perez had three of Kansas City's nine hits and scored three runs.White Sox 17, Reds 4Chicago scored 11 runs in the second inning and bludgeoned host Cincinnati.Hanser Alberto homered for the second straight game, Gavin Sheets hit a three-run shot and Andrew Vaughn doubled, tripled and drove in four runs as the White Sox claimed the rubber match of the three-game series. Chicago has won five of its last seven games.The Reds got solo home runs from Jonathan India, Spencer Steer, Tyler Stephenson and Wil Myers, but lost for the fifth time in seven games.Brewers 7, Giants 3William Contreras and Willy Adames belted two-run home runs as Milwaukee salvaged one win on its six-game Western swing with a victory over San Francisco.Adames added a sacrifice fly and run-scoring single to complete a four-RBI day for the Brewers, who snapped a six-game losing streak. Adrian Houser came within one out of a potential win in his season debut, but the right-hander was lifted two outs into the fifth inning with a 5-2 lead.Thairo Estrada homered, his sixth of the season, as part of a three-hit day for the Giants, who had won four in a row. Blake Sabol also had three hits for San Francisco, while LaMonte Wade Jr., Mitch Haniger and Wilmer Flores collected two apiece.--Field Level Media"
    ]
}