{
    "articleURL": "/news/article-12054845/The-celebs-King-Charles-surprisingly-snubbed.html",
    "content": [
        "Numerous celebrity A-listers such as Katy Perry were able to secure a front-row seat to the special occasionBut, many missed out on attending a once-in-a-lifetime royal event celebrating the Kings CoronationREAD MORE: The King and Queen, behind the scenes: Buckingham Palace releases pictures of the royals Given the last Coronation was nearly 70 years ago, receiving an invitation to the King's big day is arguably a once-in-a-lifetime opportunity. ",
        "Numerous celebrity A-listers such as Katy Perry were able to secure a front-row seat to the special occasion but many appeared to be snubbed off the list. While there was an attempt to 'slim down' the occasion, its guestlist was believed to be around 2,000-people strong.It's no secret that the final list was already a hot topic for the palace given the recent media storm surrounding Harry's behaviour and whether he and his wife would make the event. For months, he had kept the British public - not to mention his own family - on tenterhooks with a cat-and-mouse guessing game over his attendance.",
        "While the prince made a quick appearance at the event, Meghan Markle and their children were nowhere to be seen. Despite marrying into the family and birthing two of Charles' grandchildren Archie and Lilibet, the actress did not accompany her husband to the royal event. After the event, Prince Harry slipped out of Westminster Abbey - accompanied by a Metropolitan police escort and four outriders - with only the briefest of goodbyes and headed straight for Heathrow Airport.After 28 hours and 42 minutes in the UK, he happily hopped back on the plane to California before his father and stepmother had even finished having their official portraits taken. ",
        "It is reported that the King's son hurried back to his home to Montecito, California, for his son, Archie, to celebrate his fourth birthday. Even without broadcasting intimate details about the family to the world, you can still not make the cut for one of the most historic events in our lifetime. Despite David Beckham's admirable behaviour around Queen Elizabeth's funeral, the football star appeared to have not been first pick for the Coronation. There was no sign of the Beckhams at the royal event despite him joining thousands of mourners to pay their respects to Queen Elizabeth II. Beckham, a father-of-four, was emotional as he waited his turn to pay his respects alongside the crowd of thousands, seen wiping the corner of his eye and covering his mouth with his hand as he approached the front of the procession. ",
        "The former Manchester United striker finally reached the Queen's coffin at about 3.30pm after lining up for 13 hours, and took just a few seconds to bow his head before moving on to make way for the people behind him His lack of attendance came as a shock to many royal viewers as the famous family were previously spotted at many other major royal events such as Harry and Meghan's wedding. ",
        "Arriving hand-in-hand, the Beckhams looked like royalty themselves as they walked into Windsor Castle to celebrate the marriage of the Sussexes.  The two internationally famous families have been spotted together many times over the past two decades with one of the first being in 2002 during a reception for the Football Association held a Buckingham Palace. The ex-England football captain was pictured on November, 19, 2002, shaking hands with the Queen who looked very pleased to be meeting the talented sportsman. Despite the long history between the Windsor's and the Beckham's, the ex-footballer and his family were nowhere to be seen, which begs the question- were they invited to begin with? Who doesn't RSVP yes to one of the biggest celebrations in the world. If you 'wannabe' invited to this royal event you would have had to have made more of an impression on the King than just pinching his bottom as even Geri Horner (née Halliwell) didn't seem to make the list. Despite the iconic Spice Girl being notoriously known for getting too a little too comfortable with the prince in 1997, the Royal Family have been spotted many times with the famous singer. One of the latest being in 2019 when the then-Prince of Wales was meeting ambassadors of his charity, The Prince's Trust, at a glitzy soirée for a star-studded fundraiser event. ",
        "The King met with the talent performer and her husband  Christian Horner where the three were pictured smiling at one another during a conversation. The Spice Girl - best known as Ginger Spice - was also one of many famous faces who sent a video tribute to mark the Queen's 70 years on the throne.The 50-year-old started her short speech with: 'Our Queen, kind, loving, strong, serving our country, the Commonwealth, uniting us all together. ",
        "Despite her clear support and admiration for the Queen and her family, fans were quick to share their negative opinions on Twitter, as one wrote: 'Geri Horner has gone from ginger spice to cringer spice.'Geri Halliwell denies ever pinching the King's bottom and claims she merely 'patted it'. Flattery will seemingly not get you an invite to the special occasion and apparently hard work won't suffice either. Amanda Holden, 52, was also one of many who missed out on celebrating the King's Coronation at Westminster Abbey despite all her efforts working as a coach for the choir that will perform at Sunday's Coronation Concert. ",
        "The TV presenter's mentoring was documented in the BBC programme Sing For The King: The Search For The Coronation Choir.Instead, the Britain's Got Talent judge spent her weekend celebrating with her two beautiful children. ",
        "The family posted a picture together at The Ivy Cafe in Richmond on Instagram. The post was captioned: 'Celebrating the #kingcharles #Coronation #longlivetheking'.In just three hours the post, which was shared to her two million followers, was liked more than 18,000 times. So what celebrities did get the invite of the century? Among many popular celebrities, comedy duo Ant and Dec joined the Royal family at Westminster Abbey yesterday and while they were there to celebrate the King's Coronation the pair joked how they were going to recruit for the next 'I'm a Celeb' series. Joking aside they recognised the importance of the historical event and spoke of how 'proud and privileged' they felt to be among those invited to the Coronation of King Charles. The comedians burst out laughing at the fact they would be in the Abbey with dignitaries and world leaders ahead of the service this morning.",
        "Speaking in an ITV interview as they excitedly arrived, they were asked: 'How does it feel for you guys to not be the most important people in the room?''It feels wonderful to be honest,' Ant said. 'You know, I was watching all the coverage last night, I have been, leading up to it people have been getting coronated at Westminster Abbey for thousands of years.",
        "'You're part of history! It's fantastic. So we're just happy to be invited.'While Ant and Dec recognised the privilege of attending such an event with some of the most important people in the world, other celebrities were a little caught up in their own personal antics. Katy Perry, who is scheduled to sing tomorrow evening at the Coronation concert, was spotted taking a picture of herself on Westminster Abbey's memorial to Winston Churchill - just hours after being mocked for failing to find her seat - and later tripping in her heels outside.Fans were amused by Perry looking like a lost lamb searching far and wide for her seat in Westminster Abbey.Unable to see thanks to a fascinator, she was seen cocking her head and spinning around in circles in desperate search for her place. ",
        "In further antics, the singer was spotted taking selfies with guests in the historic abbey and stumbling in her tall white heels as she left the ceremony with fellow guests. She will stay at Windsor Castle tonight before performing tomorrow alongside music legend Lionel Richie, as well as Take That, Italian opera singer Andrea Bocelli and Welsh bass-baritone Sir Bryn Terfel.The event, which will take place on the grounds of Windsor Castle, will be in front of a crowd of 20,000 members of the public and invited guests and broadcast across BBC television and radio stations.As a special honour in return for her performance, Katy is being allowed an exclusive stay in the royal residence of the 1,000-year-old castle.Other celebrities who attended the King's Coronation include Lionel Richie, Emma Thompson, Judi Dench and Maggie Smith."
    ]
}