{
    "articleURL": "/news/article-12047351/Student-died-accidental-MDMA-overdose-Thai-party-island-gap-year.html",
    "content": [
        "Eleanor Yates, 18, was found dead in her hostel on Thai island of Koh PhanganHer parents were critical of Thai Police investigation, saying it was 'inadequate' A globe-trotting student died from an accidental MDMA overdose on a party island in Thailand while on her gap year, an inquest heard today.",
        "Solo traveller Eleanor Yates, 18, was found dead in her hostel bed last year after taking the Class A drug while on Thai island Koh Phangan - which is famed for its popular Full Moon Parties.The talented teenager - the daughter of a publishing executive - had visited around 50 countries, despite her young age, and was described by her devastated parents as 'adventurous and free-spirited'.At an inquest today at Portsmouth Coroner's Court, a coroner concluded it remains a mystery over when Eleanor took the fatal dose of MDMA, which is also known as ecstasy. It was also heard that she was found to have had 0.54mg of MDMA in her system at the time of her death.",
        "Eleanor, from Winchester, Hampshire, is known to have taken a pill at a Full Moon Party on Koh Phangan some 29 hours before her eventual demise.The day after the Full Moon Party, on February 17 last year, she had a 'quiet, normal, hungover day' with friends - who did not witness her take another pill.Then, at 9am on February 19, her lifeless body was discovered in bed at Phangan Arena hostel - known as a party hostel - when she did not wake for her alarm.At the Coroner's Court, experts could not determine whether the tablet she took on February 17 was the fatal dose, or whether she took another tablet.",
        "Eleanor was a responsible drug-user who methodically filed notes on her phone every time she took drugs to monitor doses, it was heard.The daughter to publishers John and Catherine Yates was just weeks into her five month trip of Asia, having spent months in Europe and having landed a place at Bristol University to study film.An Instagram account under the name Eleanor Yates suggests she was trying to visit 195 countries.She saved £7,000 by working at Sainsbury's to go to Thailand, having achieved 'incredible grades' at A levels.Her father continued to state: 'What we didn't know was she started to experiment with drugs, as teenagers do, but we have an understanding she maintained a level of risk aversion; she was very cautious about what she ate.'She always had a record on her phone of what she took.'The drug revelation since her death was a bit of a shock to us.'Mrs Yates stressed that her daughter was responsible with drug-taking, saying: 'She wasn't a druggie.'",
        "He said that they 'we were very nervous about letting her go so far', adding: 'The one thing I kept saying was \"don't take any drugs and be very careful about spiking.\"'A statement by Mr Yates was also read outside court, where he said: 'Our beloved daughter Eleanor - vibrant, intelligent, creative and independent - doing what many adventurous, free-spirited souls do before they start university, back-packing through South East Asia.",
        "'She had worked tirelessly throughout the pandemic to save money to realise her dream and was tragically just three weeks into a five-month long trip when she died.'Thailand was planned as a first stop to gain her diving qualification, before continuing on to Cambodia, Vietnam and Indonesia.'She had everything to look forward to and was so excited about taking up her place to study film at Bristol University in September. We fully expected her degree to lead to a successful career in film, an industry that will never benefit from her energy, vision and love of the medium.'Eleanor's other true passion was travel.'Despite being just 18, she had collected over 50 stamps in her passport, living in India for three years and solo backpacking around Europe for two and a half months after her A Levels.'Eleanor was doing what she loved most when she died, travelling the world on her own, building stories, experiences and adventures. That's how we want her friends and family to remember our darling girl - forever travelling.'She is so, so loved and deeply missed by her brothers Thom and Felix, by us, her Mum and Dad, her Grandparents, and by all of her family and friends.'Mr and Mrs Yates quizzed toxicologist Peter Streete - an MDMA expert - over whether it was possible the pill she took 29 hours before her death could have been responsible for her death.",
        "Mrs Yates told the hearing she was 'very, very puzzled and shocked' after learning her daughter died from MDMA toxicity as the only-known time she had consumed the drug was 29 hours before.However, Mr Streete said ultimately he cannot say if it would have caused her death, nor could he say whether her behaviour in the hours before her death suggested she took a second pill.Mr Yates said evidence the couple heard at the inquest 'leads us to the conclusion that MDMA was ingested shortly before death'.She had 0.54mg of MDMA in her system, it was heard.Danish backpacker Melisa Damscot met Eleanor in Thailand and the pair became friends, travelling together and partying together at the Full Moon Party.They got separated during the party and Miss Damscot said when Eleanor returned home in the early hours of the morning on February 18, where the Brit told her she ‘around 10pm she had taken a quantity of a hard drug which she bought from a woman’.The pair woke up around 11am on February 18, and Eleanor later took an afternoon nap as she was 'exhausted'. The pair then went to get food at 6.30pm.Eleanor spent the evening chatting to friends at the resort following dinner and went to bed around 2am, using her phone then listening to music on Spotify.",
        "Miss Damscot said: 'I heard an alarm from the phone of Emily, the alarm kept sounding... To my astonishment [another friend in the room] said her hand was very cold.'Eleanor had passed away.'It was heard Eleanor's friends said 'it was normal for her to do drugs now and again, but she always went alone', and that when she recalled her reaction to the MDMA at the Full Moon Party she said it was 'normal'.Mr Yates said he had suspected his daughter could have been spiked, saying: 'MDMA is called the love drug...'Eleanor was a very attractive young woman, so one of our suspicions was that this was a young man who wanted her to come to a party... but there is no evidence of that.'Mr and Mrs Yates were critical of the Thai Police investigation, saying it was 'inadequate' as people who spent time with her at dinner the evening before were not interviewed, only the people in her room.Area Coroner Jason Pegg concluded a verdict of misadventure, ruling that it is still unclear when she took the fatal dose.He said: 'Exactly when [she took it] cannot be ascertained, it could have been on the 17th, it could have been a second pill.'He concluded death by cardiac arrest caused by MDMA toxicity."
    ]
}