{
    "articleURL": "/wires/ap/article-12058641/War-shadows-Victory-Day-Russias-integral-holiday.html",
    "content": [
        "Victory Day, Russia´s most important secular holiday, lauds two tenets that are central to its identity: military might and moral rectitude. But the war in Ukraine undermines both this year.",
        "The holiday falling on Tuesday marks the 78th anniversary of Germany's capitulation in World War II after a relentless Red Army offensive pushed German forces from Stalingrad, deep inside Russia, all the way to Berlin, about 2,200 kilometers (1,300 miles).The Soviet Union lost at least 20 million people in the war; the suffering and valor that went into the German defeat have been touchstones ever since.However, many regions have canceled their May 9 observances because of concerns the events could be targets for Ukrainian attacks.The famed parade in Moscow´s Red Square will go ahead following Russia's claim of an attempted Ukrainian drone attack on the Kremlin, whose spires loom next to the parade venue, but amid ramped-up security measures. The use of drones has been once again banned in the Russian capital, and car sharing services have been temporarily barred from the city center, with users unable to start or finish rides there.In St. Petersburg, Russia's second-largest city, the authorities also banned the use of drones ahead of a parade. In some parts of the city's extensive network of rivers and canals, the use of jet skis has also been forbidden.",
        "For all the fearsome armaments that will growl through Moscow's most famous square, Russia´s failure to make gains in Ukraine spoils the image of its army´s indomitability.",
        "After seizing sizable parts of the neighboring country in the opening weeks of the invasion, the Russians abandoned an attempt to enter Kyiv, retreated in parts of northern and southern Ukraine, and failed to take Bakhmut, a small city of questionable value, despite months of exceptionally gruesome fighting.President Vladimir Putin, in his speech during the parade, is sure to praise the Red Army´s determination to wipe out Nazism and to repeat his assertion that Russia is taking the moral high ground by fighting an alleged Nazi regime in Ukraine, a country with a Jewish president.But the missiles that rain down on Ukrainian civilian targets have drawn worldwide condemnation of Russia, while the Western countries that made common cause with Moscow to defeat Nazi Germany send billions of dollars' worth of weapons to Ukraine.Analysts are divided on whether the May 3 drone incident at the Kremlin was a genuine attack or a \"false flag\" concocted to justify increasing the ferocity of Russia's missile barrages in Ukraine. Either explanation risks undermining the sense of security among Russians already rattled by attacks, likely committed by Ukraine or by domestic opponents, that have risen sharply in recent weeks.Two freight trains derailed this week in bomb explosions in the Bryansk region that borders Ukraine. Notably, the region´s authorities did not blame Ukraine, which could be an attempt to whitewash the Ukrainian capability to carry out sabotage.",
        "But Bryansk authorities claimed in March that two people were shot and killed when alleged Ukrainian saboteurs penetrated the region. The region has also come under sporadic cross-border shelling, including last month, when four people were killed.Three prominent supporters of the war in Ukraine were also killed or injured on their home turf elsewhere in Russia. A car-bombing last week in the Nizhny Novgorod region that officials blamed on Ukraine and the United States severely injured nationalist novelist Zakhar Prilepin and killed his driver.Last year, Darya Dugina, a commentator with a nationalist TV channel, died in a car bombing outside Moscow, and authorities alleged Ukrainian intelligence was behind the April death in St. Petersburg of prominent pro-war blogger Vladlen Tatarsky, who was killed when a bomb inside a statuette he was handed at a restaurant party exploded.Amid the heightened security worries, authorities also canceled one of Victory Day's most notable observances, the \"Immortal Regiment\" processions in which throngs of citizens take to the streets holding portraits of relatives who died or served in World War II.The processions carry an air of genuine emotion, in sharp contrast to the obedient stone-faced soldiers who march across Red Square during the tightly regimented military parades that change little from year to year.",
        "Although the processions are moving and impressively large, authorities \"thought that the risks were becoming prohibitive,\" said Russian analyst Dmitry Oreshkin, now at the Free University in Riga, Latvia. \"If some kind of drones fly there, penetrate through the impenetrable border ... then why can´t they drop something on this column?\""
    ]
}