{
    "articleURL": "/wires/aap/article-12054133/South-Sydney-outclass-Melbourne-assert-NRL-dominance.html",
    "content": [
        "South Sydney's lethal left edge has masterminded a comfortable 28-12 defeat of Melbourne that affirms the Rabbitohs' status as the form team of the NRL.",
        "From the outset, Souths had the better of what was billed as Magic Round's marquee match and could thank Cody Walker and Latrell Mitchell for both their early advantage and eventual margin of victory on Saturday night.South Sydney have knocked off reigning premiers Penrith, ladder-leading Brisbane and the Storm in the latest wins of their five-game streak to send a warning shot to the premiership and put a lukewarm start to the season behind them once-and-for-all.\"It's a great start but that's all it is,\" Rabbitohs coach Jason Demetriou said.\"It's a start to the season we wanted but there's a long, long way to go.\"If we keep having a defensive mindset, then we're a tough team to beat.\"Encouragingly for Demetriou, the Rabbitohs are still below full strength and are only going to become more fearsome when forwards Keaon Koloamatangi, Shaq Mitchell and Siliva Havili return to fitness.Melbourne, meanwhile, could be about to lose a big man of their own - Nelson Asofa-Solomona appeared to aggravate his knee injury in a second-half tackle and jogged from the field late.In his 200th NRL game, Souths fan favourite Alex Johnston crossed for a double, his first of a campaign that has so far been dominated by Campbell Graham and the Rabbitohs' right edge.",
        "But the night belonged to Mitchell and Walker, at least one of whom had a hand in the first three tries that opened up the Bunnies' lead and ultimately sealed the result.\"Our key players are playing well at the moment and that's what you want,\" Demetriou said.The NRL's leading tryscorer Graham was not required close to the line, such was the dominance of Souths' left edge.In their first opportunity inside the red zone, Mitchell put a grubber kick through the line from dummy-half to set Walker up for the first try. He found Johnston with a similar kick to the left corner early in the second half.When Walker tried his own hand at a grubber as the final ten minutes approached, Isaiah Tass had his name on the scoresheet and the Rabbitohs had built an insurmountable lead.Despite enjoying ample chances, playmakers Cameron Munster and Jahrome Hughes failed to inspire the Storm over the tryline early in the first half - something that came back to haunt them once Souths seized all momentum in the second.\"The first half there, we had a lot of good field position but it just looked like we didn't know each other,\" Storm coach Craig Bellamy said.\"(We were) a bit inconsistent, like we have been all year, really.",
        "\"They've been in really good form, Souths, and they were too good for us tonight.\"Good fortune played a significant role in Melbourne's first try; Munster's bomb ricocheted off Walker and straight into Reimis Smith's hands at point-blank range. Their second was from dummy-half when the game was unsalvageable.The win is just the Rabbitohs' seventh from 39 meetings against the Storm."
    ]
}