{
    "articleURL": "/wires/aap/article-12053497/Geelong-star-Dangerfield-injured-against-Crows.html",
    "content": [
        "Geelong captain Patrick Dangerfield is hopeful he has avoided a serious hamstring injury after being subbed out during the Cats' 26-point win over a gallant Adelaide.",
        "The 33-year-old star was taken out of Saturday's game at GMHBA Stadium early in the third quarter of the Cats' fifth-straight victory.Dangerfield was enjoying a blockbuster battle in the middle with opposing captain Jordan Dawson, with the pair the best players on the ground during Saturday's first half.The Brownlow medallist said the injury felt \"minor\" after sitting on the bench during the second half with ice on his left hamstring.\"Having done one before ... this doesn't feel like that but it is not worth the risk a minute into the second half,\" Dangerfield told Fox Footy.\"I am on the wrong side of 30, so (we will take) a conservative approach.The Cats were able to record a 14.14 (98) to 11.6 (72) victory despite Adelaide pushing hard to end their 12-game losing streak in Geelong dating back to 2004.Dangerfield, who was replaced in the match by sub Ollie Dempsey, suffered numerous calf setbacks last year before starring in Geelong's charge to the premiership.Geelong coach Chris Scott said the Cats wanted to be cautious with their matchwinner.\"Hopefully the damage can be mitigated there and he doesn't miss too much,\" Scott said.\"He was subbed off pretty quickly, but that wasn't an indication of the severity, it was more that there's something there and not something we should take a risk with.\"",
        "Geelong's class shown through as they broke the game open with a six-goal second quarter and they threatened to pull away for a trademark comfortable win at home.However, Adelaide refused to be blown away as so many teams are at Kardinia Park, pulling the deficit back to 12 points with five minutes remaining.The Crows had a golden opportunity to cut the margin to six points with three minutes remaining, but some desperate defending from the Cats saved a certain goal.Geelong then raced the ball down the other end, as Ollie Henry slotted the sealer.Superstar Geelong forward Jeremy Cameron reclaimed his lead in the Coleman Medal race, booting a game-high three goals to go two ahead of Carlton spearhead Charlie Curnow (31).Cats small forward Gryan Miers put through his first goal of the season after five behinds and 14 goals assists during the opening seven rounds.The Crows were also forced to use their sub, with defender Nick Murray (concussion) taken off for experienced midfielder Matt Crouch during the third term.After starting their flag defence 0-3, Geelong have recaptured their scintillating best and could finish round eight as high as fourth on the ladder.The Cats will head to the MCG on Friday night for a showdown with struggling Richmond.",
        "Adelaide, who have failed to play finals since 2017, are 4-4 ahead of a crucial home game against in-form St Kilda next Sunday.\"Although disappointed now I think that our guys showed some great resilience,\" Nick said.\"We didn't give up, I was really proud of the resilience our boys showed...we just hung in all day.\"Really pleased that we we brought it (intensity) but not quite to the level that's required to beat Geelong in Geelong.\""
    ]
}