{
    "articleURL": "/wires/reuters/article-12044461/Chicago-corn-futures-doppelganger-2013-Braun.html",
    "content": [
        "By Karen Braun",
        "NAPERVILLE, Illinois, May 3 (Reuters) - Chicago-traded December corn futures hit another calendar-year low on Wednesday, continuing the downward trajectory that has so far unfolded very similarly to 2013.The uncanny likeness has already been recognized by some market participants, but price is only one of several items that the 2023 U.S. corn market has in common with a decade ago, meaning the 2013 trend could offer a possible path for this year´s prices.CBOT December corn futures´ high so far in 2023 was printed Jan. 3, the first trading day of the year. That high, of $6.11 per bushel, has drifted down nearly a dollar, bottoming Wednesday at $5.12-1/2.The last time new-crop corn made its calendar-year high in the first session of the year was in 2013, but it has otherwise been rare for the highs to come early in the year. The annual high in January 2013 is the only one within the last two decades that came in the first three months of the year.Before 2013, new-crop corn last made January highs in 2001 and 1989, the latter somewhat fitting because 1988 and 2012 featured the two worst droughts in recent U.S. history. Some western areas in 2022 experienced drought as bad or worse than in 2012, but last year´s event was significantly less widespread.",
        "Like in 2013, the 2023 U.S. corn crop is expected to rebound from last year, driven by a return to normal yields and a larger area. The 2013 corn harvest turned out record-large, and the U.S. government is likely to predict a record 2023 crop in next week´s report.The most popular month within the last 20 years for December corn to notch its year-of-expiration high is June with five instances, while May, July and November each have three. New-crop corn made May highs in 2021 and 2022, and it made April highs twice, most recently in 2014.SAME SETUP?December corn´s yearly high in January 2013 was $6.05 per bushel. That dipped as low as $5.17 by late April 2013, nearly identical to 2023 prices on the same dates. The inflation-adjusted 2013 prices would be stronger, but the percentage moves are most comparable with 2023 thus far versus any other year.New-crop corn futures bounced in early May 2013 on slow U.S. corn planting, but a new low was eventually set later that month. Despite a few brief rallies, new lows were recorded in each of the following months until expiration, and the annual low of $4.10 per bushel was set Dec. 2, 2013.Speculators´ moderately bullish views in CBOT corn futures and options in late 2022 tracked very closely with their late 2012 ones, though funds this year broke the bull run earlier than in 2013.",
        "Money managers were net long CBOT corn from mid-2010 through mid-2013, similar to their recent bullish stretch that started in September 2020 and ended in mid-March 2023. Funds were nearly flat in corn by late April 2013, but they did not officially flip to bear territory until July.Speculators resumed bullish bets in CBOT corn in February 2014. That streak lasted just over a year, and it likely did not pan out for many investors.December corn futures in 2014 lost 38% between the April high and October low, more than the 32% decline in 2013. New-crop corn topped out at $5.17 per bushel in 2014, the lightest annual high in five years.FOOD FOR THOUGHTExceptionally bearish quarterly stock reports in March and September plagued corn futures in 2013, but while the market was likely misjudging U.S. corn demand, so was the Department of Agriculture.USDA in May 2013 set 2013-14 U.S. corn ending stocks at 2 billion bushels, more than two times the previous years´ levels, but the final ended up around 1.2 billion despite relatively small crop losses. Final corn exports that year were more than 600 million bushels (48%) larger than originally expected.Global corn consumption data suggests that sagging grain prices in 2013 heavily stimulated corn demand in the 2013-14 marketing year following a couple years of higher prices, unexpectedly bolstering U.S. exports.",
        "Brazil is expected to become the top corn exporter in 2022-23, doubling its volume from a decade ago. However, Brazil´s 26% share of global exports in 2012-13, when the U.S. corn crop failed, is not far off its projected 2022-23 share of 29%.It is possible USDA sets 2023-24 U.S. corn ending stocks above 2 billion bushels next week, up from this year´s 1.34 billion. Side note: March 1, 2023, quarterly corn stocks were mildly bullish. Karen Braun is a market analyst for Reuters. Views expressed above are her own.(Writing by Karen Braun Editing by Leslie Adler)"
    ]
}