{
    "articleURL": "/wires/ap/article-12044221/Feds-charge-45-people-takedown-2-Minneapolis-gangs.html",
    "content": [
        "MINNEAPOLIS (AP) - Federal authorities announced racketeering and other charges Wednesday against 45 members or associates of two major Minneapolis street gangs for crimes including seven homicides, plus numerous drug trafficking and firearms violations.",
        "U.S. Attorney Andy Luger said at a news conference that the takedown targeted the Highs, who are based in north Minneapolis, and the Bloods, who operate primarily on the south side. As for a third gang, the Lows, from a different part of north Minneapolis, he said charges against them are coming.\"Today´s announcement marks a fundamental change in how we address gang violence. Starting with these charges, we are prosecuting street gangs as the criminal organizations they are,\" Luger said. He contrasted that with what he called a traditional local approach to prosecuting gun violence of charging offenders \"crime by crime, shooting by shooting, case by case.\"All but two of the suspects are in custody, Luger said. Around two dozen of them were arrested in recent days, he said, while several were already in state or federal custody on other charges.The charges name 28 members and associates of the Highs and 17 members and associates of the Bloods, who Luger alleged \"engaged in a brutal and unrelenting trail of violence over the course of years,\" including revenge killings, assaults and murders of innocent bystanders. Altogether, the indictments cover seven homicides and over a dozen other shootings, as well as alleged trafficking in fentanyl and methamphetamine.The killings included a 2020 shootout that left one person dead at the 200 Club in north Minneapolis and a fatal shooing outside William´s Pub in the Uptown entertainment district of south Minneapolis last April.",
        "According to the indictments, the Highs have existed since around 2008 and have numerous \"subsets.\" New members are expected to \"put in work,\" which Luger said generally means shooting people. The Bloods have been around for decades and have two subsets, the Rolling 30s Bloods and the Outlaw Bloods, he added. Their new recruits are expected to fight, shoot or make money for the gang through drug sales, he said. He declined to give membership estimates or say how many more could face charges.The Racketeer Influenced and Corrupt Organizations Act, known as RICO, is at the heart of the case, Luger said. Prosecutors are required to prove that the gangs are criminal enterprises, and that members participate through a pattern of racketeering that can include everything from state crimes such as assaults, robberies and murders, to federal violent crimes. This lets authorities prosecute all members together instead of one at a time, he said.\"This is a powerful and effective tool for dismantling criminal organization, and it carries its own set of penalties, including life in prison for gang members who commit murder,\" Luger said. He said it's the first time his office has used the RICO law against Minneapolis gangs.Since becoming the top federal prosecutor for Minnesota for the second time, just over a year ago, Luger has directed his team to focus on violent crime, which spiked amid the turmoil that followed the murder of George Floyd by a Minneapolis police officer in 2020. Minneapolis gangs have become more organized and bigger since then, he said. His initiative has included a crackdown on carjackings, prosecuting them as federal offenses.",
        "Luger was joined at the news conference by Assistant Attorney General Kenneth Polite, head of the Justice Department´s Criminal Division, and Steven Dettelbach, director of the federal Bureau of Alcohol, Tobacco, Firearms and Explosives.Minneapolis Police Chief Brian O'Hara, who came to Minnesota to lead a struggling department last November from Newark, New Jersey, welcomed the federal help, saying shootings and other violence has become normalized for far too long - along with the harm suffered by vulnerable residents.\"There is absolutely nothing normal about the disgusting levels of violence and crime detailed in these complaints,\" O'Hara said. \"It is outrageous, it is entirely unacceptable, and it will not stand.\""
    ]
}