{
    "articleURL": "/tvshowbiz/article-12048973/Im-Celeb-South-Africa-fans-slam-yellow-team-LYING-green-picnic-food.html",
    "content": [
        "I'm A Celebrity viewers have slammed the yellow team for lying to the green team about their picnic food during Thursday's episode.",
        "This week the campmates have been split into two 'prides' in which they battle against each other to win food - which included a luxury picnic.The last two episodes have seen the yellow team come out on top, but they controversially decided to downplay the treats they won in order to deter their opponents from making mum effort in the next trial.The idea was the brain child of Helen Flanagan, who was branded an 'evil genius' by her team, with the yellows opting to share they only ate egg sandwiches and Biltong as opposed to lamb pittas and a fruit platter.However, viewers were opposed to this plan as they branded it 'cruel' and 'selfish', with one even remarking that the campmates have 'no respect' for others. ",
        "Taking to Twitter, one person said: 'Not a fan of the yellow team lying about what picnic they've received. Very cruel.'While another shared: 'Don't like how the yellow team have gone around the picnic fiasco. They shouldn't of lied personally and if they did it should be so they don't run it in the other teams faces rather than for them to do well in challenges.''Yellow team are actually a bit s**t, can't they be humble and honest rather than lying to the green team in order for them to make less of an effort. How horrible' fumed a third watcher.",
        "'A little bit selfish for the yellow team to lie about what they eaten' ranted a fourth angry viewer.A fifth said: 'The yellow team are so horrible and evil they may call themselves celebrities but they seriously have no respect for other people and especially Helen she is the worst for rubbing it in people's faces. They seriously are winding me up. Let the green team get a treat!'With another adding: 'I can't wait for the green team to win a trial to discover the out right lies the yellow team thanks to @helenflanagan1 and co have been telling them things gonna get real then.'Justifying her actions, Helen later told the camera: 'In a way it's a kindness, because you don't want the green team to feel... when they're just on rice and beans.'The deceit was especially awkward considering Coronation Street star Andy Whyment has seriously began to struggle with his diet of rice and beans, having not won any challenges.  ",
        "Meanwhile, during the episode, Helen was forced to apologise for swearing at hosts Ant and Dec as she took part in the latest Bushtucker trial.The former Coronation Street actress, 32, went head-to-head with ex Royal butler Paul Burrell, 64, in the escape room-style challenge in a bid to win a picnic for their respective tribes.",
        "However, as she faced a number of creepy crawlies, foul-smelling offal and crocodiles during the challenge, Helen couldn't help but turn the air blue, even telling Ant and Dec to 'f**k off' as they giggled on the sidelines.Meanwhile her competitor Paul, who screamed his way through the trial, picked up on the actress' 'potty mouth' leaving her embarrassed by her actions. As the trial came to an end, Helen said sorry to her mum watching at home as the presenters also remarked on her language.",
        "Ant told her: 'I mean it was a bit hairy for a few moments wasn't it? There were a lot of F-bombs.'To which a red-faced Helen replied: 'I'm sorry guys and I'm sorry mum!'I promise guys I'm not normally a swearer but it was worth everything.'Despite her bad language, Helen triumphed the trial and beat Paul, meaning the yellow team were treated to a picnic feast for a second day in a row.Watching her efforts at home, I'm A Celeb viewers were quick to praise Helen for smashing the trial, as they noted how different she was from her first stint a decade ago. I'm A Celebrity...South Africa continues tomorrow at 9pm on ITV1 and ITVX. "
    ]
}