{
    "articleURL": "/money/markets/article-12048443/Apple-posts-better-expected-quarter-driven-iPhone-sales.html",
    "content": [
        "Apple revenues fell for a second quarter in a row last night as the iPhone maker reported sales of £75.4billion for the three months to March – down 2.5 per cent on the same period last year.",
        "It followed a 5 per cent dip in the final three months of last year.But it was better than the £74billion analysts had predicted and shares climbed nearly 2 per cent in after-hours trading.The iPhone maker pulled in revenues of £75.4billion in the three months to March – beating the £74billion analysts had predicted.Profits hit £19billion, falling slightly below estimates of £22billion as the sale of Mac computers and iPads continue to drag the tech giant down.",
        "But sales of the iPhone, which accounted for 54 per cent of total revenue, rose 2 per cent to £41billion, ahead of estimates of £39billion.Tim Cook, chief executive of Apple, said the quarter was ‘better than we expected’ in the face of a challenging economic background.Apple will spend £71billion on share buybacks in the coming 12 months, which Wall Street was expecting. The company cashed in during the pandemic when consumers were kitting out their homes with devices and investing in work-from-home tech.But this started to fade last year as the dollar rallied and lockdowns continued to cause issues in factories in China. In its last quarter, overall sales dipped 5 per cent lower than the previous year, the first year-over-year sales decline for Christmas since 2019.Cook blamed the testing economic backdrop, which he said was hitting everybody, and predicted a similar pattern into 2023.",
        "Latest earnings from Silicon Valley have largely smashed Wall Street forecasts. Last week Amazon posted sales of £102billion for the first three months of the year, 9 per cent higher than 2022, and above the £100billion predicted by analysts. It made £2.6billion profit after a £3billion loss in the same period of 2022.Facebook owner Meta also posted better-than-expected first-quarter results as its founder Mark Zuckerberg drives towards a ‘year of efficiency’.The tech-laden Nasdaq was lifted by the upbeat performances of both Microsoft and Google owner Alphabet, who have both pinned their hopes on AI investment.But Amazon and Meta have cut thousands of jobs in recent months. By contrast, Apple has avoided any major lay-offs.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}