{
    "articleURL": "/tvshowbiz/article-12052621/Christina-Applegate-says-never-act-camera-MS-diagnosis.html",
    "content": [
        "Christina Applegate may never act in front of a camera again amid her battle with progressive disease, Multiple Sclerosis. ",
        "The 51-year-old actress, who excoriated Candace Owens after she criticized a Skims ad featuring a model in a wheelchair, has been thinking about what her future might look like - two years after her diagnosis.'I can’t even imagine going to set right now,' the Emmy winner told Vanity Fair.'This is a progressive disease. I don’t know if I’m going to get worse,' she explained.Adjusting to her new life as a person with multiple sclerosis has been difficult for the star who has been acting since she was five months old. ",
        "'With the disease of MS, it’s never a good day. You just have little sh**ty days.'Multiple sclerosis is an autoimmune disease that causes damage to the nerve sheaths in the brain and spinal cord. Symptoms can include numbness, speech impairment, difficulties with muscular coordination, blurred vision, and severe fatigue.'There are just certain things that people take for granted in their lives that I took for granted. Going down the stairs, carrying things—you can’t do that anymore. It f**king sucks.''I can still drive my car short distances. I can bring up food to my kid. Up, never down.'The Bad Moms actress has turned to a friend to help her care for her daughter, Sadie, 12, whom she shares with husband Martyn LeNoble, 54.",
        "A caretaker comes on the weekend to do what is needed. 'I actually don’t want to be around a lot of people because I'm immunocompromised,' she explained. 'I also don’t want a lot of stimulation of the nervous system because it can be a little bit too much for me. I like to keep it as quiet and as mellow as possible.'",
        "The actress received her diagnosis in August 2021, just before production on the third and final season of Dead to Me began. 'None of us knew I was going to be sick and gain 40 pounds from medication and have immobility.''I’m probably not going to work on-camera again, but I'm so glad that I went out with someone who is by far the greatest actress I’ve ever worked with in my entire life, if not the greatest human I’ve ever known,' she said of her co-star Linda Cardellini, 47.  Christina said she got good advice from her friends Jamie-Lynn Siegler and Selma Hayak, who were both diagnosed with MS several years before.Jamie-Lynn suggested she quickly set boundaries. 'She was like, “You need to tell them [what you need] now that you’ve let it out of the bag.”'The veteran actress said she wish she had received that same advise when she was recovering from breast cancer after her 2008 diagnosis while shooting Samantha Who.",
        "'I didn't speak up for my boundaries back then. I should have asked for some more time after one of my surgeries. I went back to work two weeks after my reconstruction. And that was really difficult for me to do.'",
        "Multiple sclerosis (known as MS) is a condition in which the immune system attacks the body and causes nerve damage to the brain and spinal cord.It is an incurable, lifelong condition. Symptoms can be mild in some, and in others more extreme causing severe disability.MS affects 2.3 million people worldwide - including around one million in the US, and 100,000 in the UK.It is more than twice as common in women as it is in men. A person is usually diagnosed in their 20s and 30s.The condition is more commonly diagnosed in people of European ancestry. The cause isn't clear. There may be genes associated with it, but it is not directly hereditary. Smoking and low vitamin D levels are also linked to MS. Symptoms include fatigue, difficulty walking, vision problems, bladder problems, numbness or tingling, muscle stiffness and spasms, problems with balance and co-ordination, and problems with thinking, learning and planning.The majority of sufferers will have episodes of symptoms which go away and come back, while some have ones which get gradually worse over time.Symptoms can be managed with medication and therapy.The condition shortens the average life expectancy by around five to 10 years.",
        "Christina said it has been difficult for her to watch the final season of Dead to Me.'I’ve only seen bits and pieces of the show because it’s a little difficult for me to watch.'But that doesn't mean she will give up acting altogether.  'I can do voiceover stuff because I have to support my family and keep my brain working.' The actress may lend her voice talents to an animated re-boot of Married with Children reuniting her with her on-screen family that included Ed O'Neill, 77,  and Katey Segal, 69, and David Faustino, 49.'I can’t really say much, but all I know is that all four of us are attached to it. It’s not in our hands now, so we’re just kind of waiting.' "
    ]
}