{
    "articleURL": "/wires/reuters/article-12043753/Eric-Haase-drives-five-Tigers-Mets-Game-1.html",
    "content": [
        "Eric Haase homered and drove in five runs, including a go-ahead two-run single in the eighth, as the Detroit Tigers edged the New York Mets 6-5 in the first game of a split doubleheader on Tuesday.",
        "Haase's long ball was his first of the season. Javier Baez also supplied his first homer this season and scored three runs for Detroit. Tyler Alexander (1-0) got the win in relief and Alex Lange notched his fourth save. Starter Joey Wentz gave up five runs and nine hits in six innings.Francisco Lindor hit a two-run homer, while Tommy Pham and Mark Canha added solo shots for the Mets. Starter Joey Lucchesi allowed four runs and five hits in four innings.The Tigers jumped to an early 3-0 lead. Javier Baez and Riley Greene had back-to-back singles in the first inning before Haase ripped a low, outside pitch over the right field wall.Pham put the Mets on the board in the next inning with his third homer of the season. One out later, Canha smashed a 1-1 offering from Wentz to the opposite field for his third homer.Baez made it 4-2 in the bottom of the third when he crushed a Lucchesi curveball over the left field wall.New York gained the lead in the fifth. Brett Baty led off with a single and moved up on an error by Greene. Tomas Nido followed with a single and Baty scored on a throwing error by left fielder Andy Ibanez.",
        "After Wentz set down the next two batters, Lindor smacked his two-run homer over the left field wall to put the Mets in front 5-4.Pham had a two-out double in the eighth but was left stranded.The Tigers regained the lead in the bottom of the inning. Matt Vierling hit a one-out single and stole second. Adam Ottavino (0-2) hit Baez with a pitch and both runners advanced on Greene's groundout. Haase then drilled a single to right-center to knock in both runners.Lange walked Baty with one out in the ninth but retired the next two batters to finish off Detroit's victory.--Field Level Media"
    ]
}