{
    "articleURL": "/wires/aap/article-12057903/What-know-far-federal-budget.html",
    "content": [
        "WHAT WE KNOW ABOUT THE 2023 FEDERAL BUDGET SO FAR",
        "Treasurer Jim Chalmers will deliver his second federal budget on Tuesday, focusing on cost-of-living relief while ensuring spending does not add to inflation.BUDGET POSITION* Potential for a slim surplus, given the underlying cash balance for the 12 months to March was $1.034 billion.* Treasury says persistent deficits of about two per cent of GDP are projected. The deficit for 2022/23 was $11.2 billion at the end of March, against the October budget prediction of $33.4 billion.* Government debt is just under $900 billion, with an expected interest bill of $110 billion over five years.* Treasury expects a 0.75 per cent increase in real wages in 2023/24, reflecting the combination of rising wages and falling inflation.* Growth to slow to 1.25 per cent in 2023/24 as cost-of-living pressures and rising interest rates increasingly weigh on consumption.* Net overseas migration numbers are being boosted by international students and working holiday makers.* Several payments are growing faster than the economy including interest on government debt and growing spending on the NDIS, health, aged care and defence.* Expecting to see initial work on improving the cost effectiveness and productivity of government services and government-funded services, to help the budget bottom line.SPENDING* $14.6 billion package of cost-of-living measures.",
        "* Extra defence spending following AUKUS submarines deal and strategic review.* $3 billion in energy bill relief, including deals with each of the states and territories. This will be helped by the gas market intervention which Treasury expects to ease price rises to 18 per cent and four per cent over two years (rather than 20 per cent in both years).* Expanded access to financial support by raising the age cut-off for the Parenting Payment (Single) from eight to 14, at a cost of $1.9 billion over four years.* Support for small businesses.* Aged care budget to rise from $24.8 billion to $29.6 billion, with the figure hitting $35.8 billion by 2025/26.* 15 per cent pay rise for aged care workers at a cost of $11.3 billion over four years.* Child Care Subsidy to cost $55.31 billion over four years.* $535.3 million towards the nine National Collecting Institutions - such as the National Library and National Gallery of Australia - over four years.* $163.4 million for the Australian Institute of Marine Science.* Medicines changes - from September 1, general patients will be able save up to $180 a year if their medicine is able to be prescribed for 60 days, concession card holders will save up to $43.80 a year per medicine.",
        "* $2.2 billion for Medicare reforms, including incentives for after-hours doctors.* $737 million for programs to deal with harm caused by tobacco and vaping products.* Extra $262.3 million for national parks, including Uluru.* $3.7 billion extra for the five-year National Skills Agreement, taking total spending to $12.8 billion.* $2 billion for more social and affordable housing via the National Housing Finance and Investment Corporation.* $400 million for defence force retention bonuses.* Funding for the new National Anti-Corruption Commission and a standalone privacy commissioner.* Review of $120 billion infrastructure project list.TAX* $3.3 billion increase in tobacco taxes over three years, to pay for health programs.* Offshore LNG industry to pay petroleum resources rent tax revenue sooner, increasing tax receipts by $2.4 billion over four years.* Multinational tax avoidance crackdown continues.* Commodity price estimates to be upgraded, having been set at a very conservative $55 a tonne for iron ore.* Income and company tax receipts to be higher than expected.CUTS* $17.8 billion in budget savings and shifted spending, including $7.8 billion in defence project re-prioritisation."
    ]
}