{
    "articleURL": "/tvshowbiz/article-12043381/Angel-City-trailer-Natalie-Portman-goes-tribulations-supporting-football-club.html",
    "content": [
        "Natalie Portman is doing for Angel City what Ryan Reynolds did for Wrexham AFC - by putting them on the world's map thanks to new a docuseries.",
        "The LA-based Angel City Football Club is a National Women's Soccer League expansion team that began playing in 2022, and are about to get a lot more attention thanks to the Oscar-winning Black Swan star.A trailer for the new HBO show was released Wednesday, and goes behind-the-scenes of the ground-breaking professional women’s soccer team.  The three-part HBO Original documentary series is directed by Arlene Nelson and executive produced by Portman, who says in the teaser: 'I never imagined that I'd be a co-owner, co-founder of a professional soccer team.'After a fly-over of the BMO Stadium in Exposition Park, LA is shown, Portman takes part in a photoshoot alongside the two other co-founders, Kara Nortman and Julie Uhrman.",
        "Portman later took to the stadium's pitch during an interview, and expressed: 'Once you sort of open yourself up to new adventures, they can lead you to a place like this.'Former professional soccer player Julie Foudy then commented on the team's ownership, which is comprised of 'big names, players, actresses. Can they pull it off?'As footage of the team's games was shown, co-owner and former forward Abby Wambach stated: 'In order to change systems, you have to start over. And you have to rebuild it with something different.'After the team embraced each other during a match, Uhrman said that the club's management 'wanted to give our players the safety and comfort that, no matter what, we're betting on each other.'",
        "Goalkeeping coach Daniel Ball then expressed that the team would have to build their resilience as a squad 'brick by brick' before head coach Freya Coombe addressed the club and stated that they 'earned the chance to make history.'After ownership group member Jennifer Garner brought the team oranges during a match, Coombe continued: 'We're going to win, we're going to lose, we're going to have difficult moments.'Uhrman then pledged that the team was 'going to elevate the sport and show how valuable it truly is.'Portman concluded the trailer by stating: 'There's no playbook. We have to write our own.' ",
        "Angel City Football Club was initially founded in 2020 and played its inaugural season in 2022.The team's ownership group is made up of numerous athletes, as well as various figures from the entertainment industry, including Uzo Aduba, Jessica Chastain and Eva Longoria.Angel City Football club ultimately finished eighth out of 12 teams during its first season.Angel City, which will consist of three episodes, is currently scheduled to be made available for streaming on the HBO Max streaming service on May 16."
    ]
}