{
    "articleURL": "/news/article-12051465/Storms-set-batter-Coronation-rain-sweeps-UK.html",
    "content": [
        "The Met Office has predicted consistent rain over today's proceedings CORONATION LIVEBLOG: Click here to follow live updates throughout today  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Keen-eyed royal fans were left smiling after a soldier had to pause and tip rainwater out of his tuba while marching back to Buckingham Palace after the King and Queen's Coronation ceremony at Westminster Abbey on Saturday. ",
        "The soldier, who was one of dozens playing an instrument as he processed down the Mall, had to take the unusual step of upturning the tuba after it became full - making it impossible to play.The moment happened as the royal family made their way back to the Palace after a two-hour service in front of global leaders, other royal families and hundreds of community figures, where they will later appear on the Palace balcony.It was captured on camera while broadcasters Sky, ITV and the BBC all competed for viewers as they streamed the parade live to be watched by millions of people around the world.It wouldn't be a classic British celebration without a spot of rain – and the King's big day followed a long tradition of rainy Coronation days in Britain in the last century.Will you be braving the rain to head out and watch the coronation? Email stewart.carr@mailonline.co.uk ",
        "Thousands of people who have camped overnight in the Mall are wearing rain ponchos and carrying umbrellas ready for King Charles' long-awaited coronation.Similar scenes were seen outside Westminster Abbey, as excited crowds waving union jacks flags remain undeterred by the likelihood of the heavens opening up. The crowds got a front row seat at the first Coronation in 70 years and were able to watch the soldier's quick-thinking tuba performance as they were one of 5,000 servicemen and women to take part in the processions to and from the abbey.",
        "The Met Office has warned of a 60 per cent chance of light rain from 9am until midday, then an 80 to 90 per cent chance of heavy rain until 2pm.This period covers the key events of today's coronation - with Charles and Camilla's procession setting off from Buckingham Palace at 10.20am today - before the service at Westminster Abbey at 11am. But the King himself didn't seem fazed by the prospect of wet weather. When a fan on the Mall asked him about the weather yesterday, he replied simply: 'Rain is a blessing... except for the cameras.'",
        "Met OfficeTemperatures will reach highs of 17C by the afternoon, which is around average for the time of year. The newly-crowned pair travelled back to the Palace between 1pm and 1.30pm, before a scheduled flypast at 2.15pm.The King and Queen Consort appeared on the palace balcony with other members of the royal family to watch the six-minute flypast - but it was downgraded to be two-and-a-half minutes due to poor weather conditions.Royal fans who in London to celebrate the occasion are advised to bring umbrellas, cagoules and waterproof jackets with dreary weather expected.",
        "WHILE the weather might not be on-side, at least the stars have put on a show for the Coronation.In what some may herald as a good omen, a meteor shower lit up the skies early this morning ahead of King Charles' big day.The Eta Aquariid meteor shower was forecast to peak - with up to 50 meteors per hour - from midnight until dawn.It occurred as the Earth passed through dust left over from Halley's Comet, which is only visible from Earth every 76 years.Appropriately, Halley's Comet is depicted in the Bayeux Tapestry, which tells the story of the Norman Conquest by William the Conqueror - Charles's ancestor who was crowned in Westminster Abbey on Christmas Day in 1066.Meteors are pieces of debris, sometimes as small as a grain of sand, that enter Earth's atmosphere at speeds of up to 70 kilometres per second, vaporising and causing the streaks of light that delight skygazers.The meteor show favoured the Southern Hemisphere and appeared low in the sky for northerly latitudes, such as the UK, in the early predawn hours.While it peaked early this morning, the Eta Aquariid shower will continue until May 28.According to the Greeks and Romans, the arrival of comets, meteors and meteor showers were signs that something good or bad had happened or was about to happen.In Ancient Greece, an astronomer named Ptolemy claimed that shooting stars would occur when the gods opened up the sky to watch the humans below.",
        "Linda Old came to look at Buckingham Palace after watching the coronation in Hyde Park.'We all stood up for 'God Save the King'. It's special, there's a lot of memories.'Royal Air Force (RAF) Air Chief Marshal Sir Michael Wigston has said 'it's 50/50' as to whether a flypast scheduled to fly over The Mall and Buckingham Palace after 2.15pm will take place if there is rain and low cloud.It will consist of more than 60 aircraft from the Royal Navy, British Army and Royal Air Force - including the Red Arrows, but a final decision will be made just one or two hours before it is due to start.After the service at Westminster Abbey ends, Charles and Camilla are expected to enter Buckingham Palace through the centre arch at 1.33pm.They received a salute from the military in the palace gardens at 1.45pm, and then at about 2.15pm they will be joined by members of the royal family on the palace balcony to watch the flypast.The RAF previously said low cloud and rain could mean it is cancelled.Sir Michael had said: 'The weather isn't looking brilliant, but there's nothing we can do about it. We have to be safe, we have to make sure that we aren't taking any unnecessary risks.",
        "'We'll make a weather call one or two hours before the actual moment, but if there's rain and low cloud then it will be almost impossible to get it through.'It's 50/50 at the moment, but we have lots of options, the decision will be made, at this stage we're hoping for the best.'A Ministry of Defence (MoD) spokesperson also said: 'The latest weather information will be obtained from both the Met Office and from our helicopters performing weather checks in advance of the main flypast on Saturday.'If suitable, the flypast will continue as planned. If not, then there are options available to reduce the numbers of aircraft, with cancellation being the last resort.'Elsewhere across the UK, there will be a 'north-south' split, with mostly grey and damp conditions across the Midlands, Wales and southern England, while northern England will be mostly dry until later in the day.Northern Ireland and Scotland are set to see a mixture of sunshine and heavy showers, with temperatures in parts of the Highlands up to 19C.Met Office Chief Meteorologist Matthew Lehnert said: 'An area of rain is expected to move into southwest England early on Saturday, moving northeast through the day with some heavy bursts at times. 'This is likely to bring some rain to London from mid-morning. Further north in Scotland, northern England and Northern Ireland it will be a day of sunshine and showers before the more persistent rain moves northwards overnight. ",
        "'Under the cloud and rain, temperatures will be subdued with 16 °C in London, whilst 20 °C is likely in sunnier northwest Scotland.' ",
        "According to Met Office analysis of coronations since Edward VII in 1902, the current warmest on record was that of George V on June 22, 1911, when temperatures reached 17C (63F).On the late Queen Elizabeth II's coronation, on June 2, 1953, the maximum temperature was just 11.8C (53.2F).Coronations during the 20th Century were also generally dull, with no sunshine recorded on George V or George VI's coronations and only 1.2 hours when Queen Elizabeth was crowned.The UK's warmest day of the year so far was April 17, when 21.2C (70.2F) was recorded at Kinlochewe in northern Scotland.However Thursday's weather ran close to this, with a UK high of 20.9C (69.6F) recorded at Charlwood in Surrey."
    ]
}