{
    "articleURL": "/tvshowbiz/article-12047855/Ed-Sheeran-opens-making-album-grief-depression.html",
    "content": [
        "Ed Sheeran has opened up about making an album on grief and depression, telling how his new record is his most 'uncomfortable' yet.",
        "The singer sat down with Zane Lowe on his Apple Music 1 show ahead of releasing his new record Subtract on Friday. And talking about the record, Ed told how he poured his feelings out into his tracks after what had been a 'horrible' period in his life which saw the death of his pal Jamal Edwards and his wife Cherry diagnosed with cancer among other things.The star also admitted that he cried 'every day' since Jamal's passing, saying he feels it's the most 'respectful' way to feel about someone he's lost. On making the album Subtract, he told Zane: 'I sent this record to the record label, and they were like, \"Is it a break-up album?\" And it's not. It's an album about grief and depression and stuff.",
        "'I feel that I don't want to give too much context and hammer it home, because I don't want people listening to Eyes Closed and be like, \"This is about Ed's friend that died.\" I want people to listen to it and relate it to their own life.'He continued: 'One of the things that I realised most in making this record and feeling the way I felt throughout Cherry's cancer diagnosis and Jamal dying, and the court case, and then Shane dying first day of the court case, just all of these things like that, those days were horrible days. ",
        "'And then it gets to midnight and then the next day begins. And that's either going to be another bad day or it might be a good day.'The Shape Of You hitmaker went on to say that throughout his grief, it was his children that would shake him out of his state of depression as their own needs had to be met.He said: 'The thing about grieving or even anxiety about Cherry's health or feeling depressed and stuff like that, none of that matters with your kids because they're just like... I would go to bed crying, I'd cry myself to sleep after spending hours and hours at Jamal's mural and I'd get in at two and I just remember just sobbing. And then waking up in the morning at six to your daughter being like, \"Hey, let's eat porridge.” Ed told how this album is the most 'human' he's ever been and his most 'uncomfortable' to make, with the pop star even breaking down in tears when discussing it. 'The reason I've cried during the interview is this is real life for me' he explained.'This is stuff that I'm still going through, I'm still processing. I feel like this record is definitely the most human that I've been. I hate it when artists go, \"It's my most personal record yet,\" because I feel like each record I put out is super-personal. ",
        "'This is just more uncomfortable. I think it's my most uncomfortable record. As I'm getting older, I'm getting less uncomfortable just being comfortable in my own skin, I guess, and not afraid what people think.'Ed has been very open about his grief following the death of music producer Jamal, who tragically died after a cardiac arrest brought on by cocaine and alcohol in February 2022 at the age of 31.Speaking about his pal and the tears he's shed since he's passing, Ed said: 'He's just the best. He's the best. That's the thing. That's what I was saying in the song, is everyone remembers him the way that the media are telling you to remember him. '\"He was a mogul, he set up SBTV, he was worth this, and he was worth that.\" But he was just a really great, lovely, funny bloke, and that's part of him, but who he was as a person was like... I'm going to get really f***ing upset man. I'm sorry. F***ing hell. 'I never cry, and all of the interviews, I seem to be crying. Ever since he's passed away, I cry every day. I like that I still feel this way. I think this is the most respectful way to feel about someone that you've lost, is actually allow yourself to feel rather than just bury it down. ",
        "'I hate it. I don't want this to turn into some Ed cries every time that he talks about this album or whatever, but it's real f***ing life.'Meanwhile during the interview, Ed admitted he hates the idea of being viewed as a 'sad pop star,' despite detailing his recent struggles on his new album. ",
        "Ed revealed he decided to undergo therapy after realising his vast wealth 'doesn't fix things.'Ed also admitted he got 'super low' when his close friend Jamal tragically died as he 'couldn't do anything about it.'The hitmaker lost his pal just weeks after his wife Cherry Seaborn was diagnosed with cancer, and was forced to delay treatment as she was six months pregnant with her second child.Explaining why he decided to open up about his struggles on his new album, Ed told Zane: 'I've always had ups and downs and struggles, and I've felt like, ever since I was a young kid, have had real, real, real lows. 'Whatever it is, it's chemical imbalance or something to do with genes. I have lots of family members that the same thing. 'But I've never spoken about it because I put it in…. You can listen across my albums, it's there. But I hate the idea of it being sad pop star because no one wants to hear that. ",
        "'No one wants to hear someone that has had success in their field who, from the outside looking in, everything's great. 'No one wants to hear someone go, 'Well, actually, it's not.' I think the reason why I was more open about it this time is it's not like people... This is why I started therapy, because I live a very, very privileged life. ",
        "'I've made money over the years, and I have all these things. Whenever I would say to my friends, last year, this was happening, they would always point out all the good things in my life. And that's great.'Alluding to Jamal's death, Ed continued: 'But money doesn't buy back your friend who's died. It just doesn't, and it doesn't make it better. Steve Jobs was the richest guy on earth, and he died from cancer. It doesn't just fix things. 'I hate talking about it because everyone goes, 'Well, it does, actually. It does this, this, and this.' But there's just certain things it doesn't. I got super low when my friend died, and you can't do anything about it, you know?'Hear the full interview today at 5pm BST on The Zane Lowe Show on Apple Music 1. Tune in to the show here apple.co/_Zane. "
    ]
}