{
    "articleURL": "/sport/football/article-12052595/MLS-commissioner-Don-Garber-calls-Open-Cup-POOR-reflection-soccer-highest-level.html",
    "content": [
        "The US Open Cup is open to MLS teams as well as lower level and amateur clubsIt was more accessible to watch last year as every game was streamed on ESPN+DailyMail.com provides all the latest international sports newsMLS commissioner Don Garber criticized the US Open Cup over its broadcasts and playing surfaces used on Friday, calling aspects of the 109-year-old tournament a 'poor reflection' of the sport.",
        "Garber was speaking during the open session of the US Soccer Federation board of directors meeting when he made the remarks about the competition, which features MLS teams alongside lower level and amateur sides akin to England's FA Cup.While every game in last year's tournament was available to watch on ESPN+, this year's edition has been more difficult to watch after US Soccer and Turner Sports reached a rights agreement last year. 'From our perspective, it is a very poor reflection on what it is that we're trying to do with soccer at the highest level,' Garber said of the tournament's current state. 'Some of the games that we've been playing in are on sub-par fields. 'I would say that they're not games that we would want our product to be shown to a large audience. So frankly, I'm not all that disappointed that the audience is small.'",
        "While Garber suggested that viewership of the tournament - which has been streamed on the Bleacher Report App, US Soccer YouTube channel and CBS Sports Golazo Network - is down, the federation actually released some positive news.The tournament has seen a 178% year-over-year increase in unique viewers during the first three rounds of the tournament, according to the federation.Nonetheless, Garber still sees problems with the tournament in its current format. ",
        "'The games are hard to find,' he said. 'I'm telling you as an actual viewer, the reaction from our ownership, from our team presidents and even our fans in terms of being able to find the games.'I appreciate the enthusiasm about it, but we need to get better with the US Open Cup. It's just not the proper reflection of what soccer in America at the professional level needs to be.'",
        "USSF chief commercial officer David Wright, who was presenting updates on the tournament to the board, didn't disagree with Garber's assessment.'I think we concur. We understand that the Open Cup is not where we all want it to be, and we're committed to getting there,' he said.'It also takes resources… it is a natural opportunity to take a step back now, particularly that we've got a renewed interest from media partners, which I think is a critical component to this.'Round of 32 games for the Open Cup will begin on May 9. "
    ]
}