{
    "articleURL": "/sport/formulaone/article-12060523/F1-Max-Verstappen-heads-Greek-eatery-Brazilian-model-girlfriend-Martin-Garrix.html",
    "content": [
        "The restaurant erupted into applause when Verstappen and his party arrivedThe Dutchman enjoyed his stay in South Florida, though other F1 drivers did not DailyMail.com provides all the latest international sports news Max Verstappen celebrated his second Miami Grand Prix victory at a trendy Greek restaurant with his girlfriend, A-list DJ Martin Garrix, and 11 friends and family at the weekend.   ",
        "The group enjoyed craft cocktails and a feast of Mediterranean shared plates at Doya - a Michelin Guide-approved spot in the Wynwood Arts District, where the Dutchman is a regular whenever he's in town.The restaurant erupted into applause when Verstappen, his girlfriend and Brazilian model, Kelly Piquet, and the rest of his party arrived, around 9:30 p.m. on Sunday. They were seated in a semi-private area of the restaurant where onlookers could catch glimpses of the two-time F1 champ'. The group closed the restaurant, staying well past 1 a.m.In great spirits, Verstappen spoke with the restaurant's owners, Executive Chef Erhan Kostepen, Jerry Böck and Rob van den Blink and cheerfully posed for photos with fans. ",
        "Verstappen may've liked his stay in Miami but several other F1 drivers expressed their unhappiness with the pomp, circumstances with the sport's latest Grand Prix race.George Russell, the director of the Grand Prix Drivers Association, was the first to take the issue public following Sunday's race. The Mercedes driver said drivers met two days before the race and voiced their displeasure with festivities and distractions around the racetrack, which exceeded the normal ride around a circuit while waving to the fans as the traditional pre-race activity.  Russell said it was hot as they waited for LL Cool J to call their name. And the drivers were were only moments away from a 57-lap race in which they'd prefer to use their time mentally preparing for twists and turns.",
        "'I guess it's the ''American way'' of doing things during sport,' the British driver said. 'I am here to race. I'm not here for the show, I'm here to win. I don't think there is any other sport in the world that 30 minutes before you go out to do your business, you are out there in the sun, all the cameras on you and making a bit of a show of it. I can appreciate that in the entertainment world.''We are open to changes, but I guess we wouldn´t want to see it every weekend.'",
        "As the list of grumbling drivers grew following Max Verstappen's third win of the season, F1 on Monday said the drivers had indeed expressed concern about the timing of the pre-race activities but agreed to give it a try. A spokesman said F1 would continue discussions with the drivers over special pre-race shows, which is anticipated at no more than seven events this season and all tailored to the specific race.F1 promised further discussions with the drivers' association, and stressed the only real complaint was 'the extra time' it took.Seven-time champion Lewis Hamilton of Mercedes was one of the few drivers who enjoyed the activities. He actually started to laugh before addressing the issue.",
        "'I think it's cool that the sport is continuously growing and evolving and not just doing the same stuff they've done in the past,' Hamilton said. 'They are trying new things. They are trying to improve the show, always, and I am in full support of it. I mean, geez, I grew up listening to LL Cool J and LL Cool J was there. That was cool.'",
        "Haas driver Nico Hulkenberg, back in F1 after sitting out three seasons, said he enjoyed the introductions: 'I had some goosebumps actually. I quite liked that part.'The reality is that this is how big events are in the United States, where the Super Bowl is nearly as much spectacle as it is the NFL's pinnacle game. The Indianapolis 500 is actually called 'The Greatest Spectacle in Racing' and includes an elaborate pre-race show that includes the Purdue marching band, the singing of '(Back Home Again in) Indiana,' and introductions that differ from every other race.With two more stops in the U.S. this year (Austin, Texas, and Las Vegas), the F1 drivers should probably expect the extravagant. The promoter at Circuit of the Americas in Texas has upped the game in the last three years with celebrities and Shaquille O'Neal delivering the winning trophy in a customized Cadillac Eldorado Convertible dubbed 'The Badillac.'",
        "The Las Vegas race, expected to be the most expensive for spectators on the 23-race schedule, is certain to be filled with the showgirls and superstars of Sin City. F1 will likely spare no expense to make it the biggest event seen in decades."
    ]
}