{
    "articleURL": "/wires/ap/article-12057351/Quantrill-takes-no-hitter-7th-Guardians-blank-Twins.html",
    "content": [
        "CLEVELAND (AP) - Cleveland´s Cal Quantrill had a no-hit bid broken up with two outs in the seventh and combined on a one-hitter, leading the Guardians over the Minnesota Twins 2-0 on Sunday.",
        "Alex Kirilloff got the lone hit with a two-out single in the seventh. Kirilloff hit a 1-0 changeup over second baseman Andrés Giménez, who attempted to make a leaping catch. The ball was picked up by right fielder Will Brennan.Quantrill (2-2) received a standing ovation from the crowd of 17,477 following the hit. He walked Joey Gallo, but struck out José Miranda on three pitches. As he did after working out of a bases-loaded jam in the second, Quantrill pumped his fist and let out a yell as he left the mound as his day ended with another big ovation.While they've had numerous close calls, the Guardians haven't had a no-hitter since Len Barker's perfect game in 1981 - the longest current drought in the majors.Quantrill admitted the no-hitter was on his mind, but he was also trying to hold a two-run lead against a team that had hit a home run in 18 consecutive games.\"I was probably aware of it in the sixth,\" he said. \"Yeah. I mean it was a tight game the whole game, so it wasn´t really an opportunity to revel in it. A walk and a homer would´ve tied it up. So I don´t think you really pitch for no- hitters. You pitch to win. If they happen, that´s great.\"",
        "Quantrill struck out four, walked three, hit a batter and threw 95 pitches. James Karinchak walked a batter in the eighth, but retired Max Kepler and Carlos Correa on fly balls with a runner at second to end the inning. Emmanuel Clase pitched the ninth for 12th save and second of the series. Kirilloff drew a two-out walk, but Joey Gallo grounded out to end the game.Twins manager Rocco Baldelli thought Quantrill kept Minnesota's hitters off balance.\"We didn't swing the bats real good today,\" Baldelli said. \"He pitched pretty well. It was funny. He was all around the zone. We offered at pitches that probably weren't good pitches to swing at. I try to keep it simple. We have to swing at strikes and try to swing at strikes that are more in the middle of the zone than on the edges of the zone. He threw everything today. He threw a lot pitches that were very hittable. He threw a lot of pitches that were on the edges.\"Cleveland took two of three in the series from AL Central-leading Minnesota.Joe Ryan (5-1) allowed two runs in six innings, both coming in the first. Ryan was 3-0 in five career starts against Cleveland and had won eight consecutive decisions overall.",
        "José Ramírez and Josh Bell had RBI singles in the first for Cleveland, an inning that saw Ryan throw 26 pitches. Quantrill worked out of a bases-loaded jam in the second. He hit Byron Buxton to start the inning and loaded the bases with walks to Kirilloff and Gallo.Miranda popped up to shortstop Gabriel Arias in shallow left field and Nick Gordon bounced into a double play. Giménez fielded the grounder near second and flipped to Arias, who made a strong throw to first.\"That was really good play all the way around,\" Guardians manager Terry Francona said. \"Arias has got about as good an arm as you´re going to see. They were quick also. That was really fun to watch and needed.\"THE TRIPMinnesota went 2-4 on its road trip to division foes Chicago and Cleveland. The Twins won the final game against the White Sox and the series opener at Progressive Field.\"Winning a couple more games would be nice,\" Ryan said. \"Pretty grindy, it felt like. That can be a good thing sometimes. It can create some motivation going forward.\"STREAK BUSTERCleveland won a series for the first time since taking two of three in Washington on April 14-16. The Guardians had lost five straight series for the first time since Francona became manager in 2013.",
        "TRAINER´S ROOMTwins: INF Kyle Farmer (facial laceration) is expected to rejoin the team during its upcoming homestand. He sustained damage to his lower lip and teeth when he was struck by a Lucas Giolito pitch on April 12 and underwent surgery.Guardians: RHP Aaron Civale (left oblique strain) will continue his rehab in Arizona. He will throw batting practice Tuesday and possibly a simulated game next weekend.UP NEXTTwins: RHP Louie Varland (0-0, 5.91 ERA) will start Tuesday night against San Diego at Target Field.Guardians: RHP Tanner Bibee (1-0, 2.45 ERA) will make his third major league start Monday night at Progressive Field against Detroit.___More AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}