{
    "articleURL": "/news/article-12059859/NYPD-seeking-Jordan-Neely-protesters-jumped-train-tracks.html",
    "content": [
        "Thirteen people were arrested Saturday for jumping onto the train tracks The NYPD is hunting another six who fled the scene before they could be arrested or spoken to  Neely died last Monday after being put on a fatal chokehold  The NYPD is seeking six people who jumped onto the subway tracks and blocked an incoming train on Saturday at a protest over Jordan Neely's chokehold death. ",
        "The protesters were part of a larger group at the Lexington Avenue and East 63 Street Q train subway stop on Saturday at 6.30pm. They jumped onto the track while a train was approaching the station, blocking the track and delaying service until they were cleared by the NYPD. Thirteen people were arrested at the scene. The six people now being sought by the NYPD fled the station. They are now wanted for criminal trespassing. ",
        "The group was protesting the death of Jordan Neely, a 30-year-old mentally ill Michael Jackson impersonator who died on Monday after being put in a chokehold by Daniel Penny, a 24-year-old Marine veteran. The New York Post cites police sources who say he was on a list of the top 50 most in need of help in the city.  Penny claims Neely was erratic, screaming and throwing garbage at passengers on the train. He and two other men subdued Neely on the ground. Penny put him in a chokehold for several minutes, even as bystanders warned that they could kill him. Neely was filmed going limp in Penny's arms. When EMTs got to the scene, he was unconscious. He was formally pronounced dead at the hospital. ",
        "Penny has not been charged or arrested but a grand jury is expected to be impaneled this week. ",
        "In a statement last week, his attorneys said he was trying to protect others from a mentally unstable and unpredictable stranger.  Neely's family say he belongs in prison. They have responded angrily to Penny's remarks about Neely's mental health. 'Daniel Penny's press release is not an apology nor an expression of regret.'It is a character assassination and a clear example of why he believes he was entitled to take Jordan's life.'He knew nothing about Jordan's history when he intentionally wrapped his arms around Jordan's neck, and squeezed and kept squeezing.'His actions on the train and now his words show why he needs to be in prison.'They also begged Mayor Eric Adams to make contact with them.'The family wants you to know that Jordan matters. 'You seem to think others are more important than him. You cannot \"assist\" someone with a chokehold.' Last week, Mayor Adams slammed other politicians who called Neely's death a 'murder', and urged them to wait for more of the facts of the case to come out before making a judgement."
    ]
}