{
    "articleURL": "/wires/reuters/article-12041569/US-STOCKS-Futures-rise-ahead-Fed-meeting-outcome.html",
    "content": [
        "Futures up: Dow 0.05%, S&amp;amp;P 0.07%, Nasdaq 0.11%",
        "May 3 (Reuters) - U.S. stock index futures edged higher on Wednesday after a Wall Street selloff in the previous session, with investors awaiting more economic data ahead of the outcome of a Federal Reserve policy meeting later in the day.Major U.S. stock indexes dropped more than 1% on Tuesday as regional bank shares tumbled and as investors tried to gauge how much longer the Fed may need to hike interest rates.Regional lenders such as PacWest Bancorp and Western Alliance Bank continued their weakness in premarket trading on Wednesday, with their shares down 10.5% and 6.7%, respectively.While the Fed is widely expected to deliver a 25-basis point interest rate hike, investor focus will be on cues if further hikes are on the cards if inflation remains high.Major global central banks have embarked on an aggressive interest rate hike campaign, with the Fed already having hiked its benchmark rates nine times by 475 basis points to a range of 4.75%-5.00% since March 2022.Amid concerns about the banking sector, inflation above the U.S. central bank's 2% target level and a still-strong labor market, Fed Chair Jerome Powell's press conference will be parsed for any signs of rate cuts later this year.Ahead of the Fed's policy decision, investors will monitor U.S. ADP National Employment report due before the opening bell. The data is expected to show private payrolls likely increased by 148,000 jobs in April, higher than the 145,000 additions in March.",
        "The Institute for Supply Management will also release its non-manufacturing PMI after markets open. It likely rose to 51.8 in April from 51.2 in March. S&amp;amp;P Global's final reading of Composite and Services PMI for April is also on deck.Meanwhile, top U.S. Senate Republicans on Tuesday called on President Joe Biden to accept their party's debt-ceiling package or make a counter-offer, while a top Democrat said the Senate might try to advance a \"clean\" debt-ceiling hike next week.CVS Health Corp, Phillips 66, Exelon Corp and Yum Brands Inc are among companies set to report quarterly results on Wednesday.Analysts expect quarterly earnings for S&amp;amp;P 500 companies to decline 1.4% from a year earlier, according to IBES data from Refinitiv, compared with a 5.1% drop expected at the start of April.At 5:41 a.m. ET, Dow e-minis were up 17 points, or 0.05%, S&amp;amp;P 500 e-minis were up 3 points, or 0.07%, and Nasdaq 100 e-minis were up 15 points, or 0.11%.Ford Motor Co slipped 0.8% as the automaker said it was cutting prices on its Mustang Mach-E electric vehicle and reopening orders.Advanced Micro Devices slumped 5.7% after the chipmaker forecast quarterly sales below estimates due to a weak PC market, pushing rival Intel Corp up 2.1%.(Reporting by Ankika Biswas in Bengaluru; Editing by Shounak Dasgupta)"
    ]
}