{
    "articleURL": "/tvshowbiz/article-12059065/Im-Celebritys-Dean-Gaffney-Joe-Swashs-bromance-heats-up.html",
    "content": [
        "Dean Gaffney and Joe Swash's bromance heated up a notch during new scenes in I'm A Celebrity South Africa, which is due to air on Monday night. ",
        "Former EastEnders star Joe, 41, offered to give Dean, 45, a shave because there are no mirrors in camp and it seems they both enjoyed the experience. Admitting they 'like the contact,' Dean couldn't help but notice that Joe is 'tender and soft with his hands.'  Getting to grips with the razor, Joe asked Dean: 'Are you down or up when you do yours?''Up that way,' he replied.   ",
        "Joe continued: 'That's coming off quite well when you do it slowly.'Dean who also used to star in EastEnders, said: ' The problem is in here, you don't have a mirror so you can't see yourself when you're having a shave.'Joe has come in and is helping a friend out. He's quite tender and quite soft with his hands.'Joe, who is married to Stacey Solomon, said: 'This is so weird isn't it, what has happened to us.'We were in Ocean Beach Club on my stag do a couple of months ago having it large and now look at us.' Talking to the camera, Joe said: 'I just like that contact and luckily Deb is the same as me.'Then looking at the results of the shave, Joe concluded: 'Ah you look better, look at me. That's knocked about five years off you Gaffney. '",
        "Joe recently said he had 'the worst' exit ever on EastEnders and would like the opportunity to return to the soap but he hasn't been asked.",
        "The actor portrayed fan favourite Mickey Miller from 2003 to 2008 before briefly returning in 2011 for his on-screen brother Darren's departure.Speaking with fellow EastEnders star Dean in Friday's episode of I'm A Celebrity South Africa, Joe admitted he wasn't happy with how he left the show.According to The Sun, Carol Vorderman asks Joe if he will return to Watford, to which he says: 'I wouldn't mind it.'You know exactly what you're doing, when you're doing it, how you're doing it.'But they've never asked me mate, not once.'The soap star then admitted he wished he had been given a more dramatic exit storyline as many characters get.He said: 'I had the worst outro ever! I didn't even leave at the end of the episode.'So usually you leave at the end of the episode and you get the 'doof doof'.'Mine, I went to Norwich to be a bell boy at a hotel and mid scene I just walked into the Vic and went, 'Right, see you later'.'They turned back to Phil, turned back to me and I'd gone. I was like, 'What, that's it?' I was there five years and not one doof doof!'",
        "Speaking in the Bush Telegraph, Joe reiterated EastEnders have not reached out to him to return.",
        "He said: 'People think I can phone up EastEnders and go, 'I'm ready to come back now guys'.'They have not phoned me. Let me make this clear… EastEnders have never phoned me to get me back on the show.'Just a few months after leaving EastEnders, Joe took part in I'm A Celebrity and was crowned King of the Jungle. He then went on to present I'm A Celebrity's spin-off series a year after being crowned 'King of the Jungle'.In 2010, he met his now wife Stacey Solomon, who had also just won the series, and the pair started dating. They have since gone on to have three children together and married  in 2022.I'm A Celebrity... South Africa airs tonight at 9pm on ITV1 and ITVX, catch up on the full series on ITVX. "
    ]
}