{
    "articleURL": "/wires/ap/article-12055799/Taylors-2-run-HR-lifts-May-Dodgers-2-1-win-Padres.html",
    "content": [
        "SAN DIEGO (AP) - Interim Los Angeles Dodgers manager Danny Lehmann improved to 1-0 in his career thanks to Chris Taylor and Dustin May.",
        "Taylor hit a two-run homer and May kept San Diego in check for six innings as the NL West-leading Dodgers held off the Padres 2-1 on Saturday night for their seventh win in eight games.Lehmann filled in for manager Dave Roberts, who attended the graduation of his son, Cole, from Loyola Marymount University in Los Angeles.Besides a spring training game, it was the first time Lehmann managed a game.\"Yeah, I'd love to do it again. I thought it was a lot of fun,\" Lehmann said. \"Obviously we had a lot of players ready to go today, as far as like workload and stuff, which is fun, and guys stepped up and pitched where they should have pitched and did really well. It made it easy on me, I guess, in a lot of ways.\"The Dodgers rebounded from a 5-2 loss Friday night in the teams' first meeting since the Padres eliminated them in four games in the NL Division Series.",
        "Padres lefty Blake Snell (1-5) had retired the first 11 batters before walking Will Smith and then allowing Taylor's homer to the balcony on the second level of the brick warehouse in the left field corner. It was Taylor's sixth and the Dodgers' 55th, trailing Atlanta by one for the NL lead.",
        "\"It was awesome,\" Lehmann said. \"Obviously it was the big hit of the night. The at-bat before, with Will getting on base and getting him out in the stretch, at that point, because of how things were going. He left a changeup up and he got it. It was good to get him out of his rhythm.\"That was Snell's only major mistake. He allowed only two more baserunners, both on walks, while striking out six in six innings.May (4-1) held the Padres to just three singles - two by Fernando Tatis Jr. - while striking out six and walking one.\"D-May threw the ball really well,\" Lehmann said. \"He did a great job of getting it deep into the game and starting to get ahead of hitters. Early he was falling behind and getting into deeper counts.\"May said he \"was throwing a lot of strikes, being able to get ahead of guys. If I wasn't getting ahead, I was being able to come back and not putting free bases on. That was very helpful.\"It was huge to go out and put up zeroes for the guys and be able to come out with the lead let the bullpen take over,\" May said. \"We played really good defense, hit the ball when we needed to and it was a really good game.\"",
        "Evan Phillips pitched the ninth for his fourth save.Taylor's homer was the Dodgers' only hit until the eighth, when Miguel Rojas and Freddie Freeman singled and Smith walked to load the bases with two outs. Taylor came up and flied out to center.The Padres finally broke through in the eighth when rookie Brett Sullivan hit a leadoff double to left and scored on Tatis' double to left, his third hit. Tatis took third on Manny Machado's groundout for the first out but was stranded.CRYING KERSHAW MEMEThe Padres caused a stir on social media after posting a meme of Clayton Kershaw with animated tears on the scoreboard at the end of Friday night's win. Some people thought it was classless but many Padres fans enjoyed it. Kershaw, who allowed two homers to Tatis, didn't seem bothered, telling reporters, \"You don´t like it, pitch better. I don´t think they do that if we win.\" Padres manager Bob Melvin said he didn't see it and then asked reporters, \"Explain a meme to me.\" Told what it was, Melvin said: \"I still don't think I know what it is.\"UP NEXTDodgers LHP Julio Urias (4-3, 3.86 ERA) is scheduled to start Sunday night's series finale against Padres RHP Joe Musgrove (1-0, 10.80), whose start was pushed back two days. Musgrove developed blisters on the bottom of his feet while running barefoot on the artificial turf of the stadium in Mexico City where the Padres played the San Francisco Giants last weekend.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}