{
    "articleURL": "/wires/pa/article-12055187/Lloyd-Webber-coronation-anthem-distributed-Sunday-services-country.html",
    "content": [
        "Lord Andrew Lloyd Webber’s coronation anthem will be heard in Sunday services across the country this weekend as the sheet music has been sent to thousands of churches.",
        "The theatre impresario’s song, Make A Joyful Noise, was performed publicly for the first time as the King was enthroned on Saturday.Following the ceremony, the music was distributed to 6,000 churches to allow them the chance to perform it during their own services on Sunday and over the coming weeks.",
        "During the coronation, the opening and closing fanfare of the piece was played by the fanfare trumpeters of the Royal Air Force – while the chorus was sung by The Choir of Westminster Abbey.The Coronation Orchestra, which includes musicians from eight of the world’s leading orchestras, provided accompaniment during the world premiere of the song.It also featured the abbey’s sub-organist Peter Holder and was conducted by organist and master of the choristers at Westminster Abbey, Andrew Nethsingha.Lord Lloyd-Webber, 75, who is known for hit musicals including The Phantom Of The Opera, Evita and Jesus Christ Superstar, drew on the words of Psalm 98 for the anthem.“It seems so appropriate to the moment in the Coronation service.”",
        "Reflecting on the piece of music, the composer said: “I played, and tried to sing, my early score for The King a few weeks ago.”He also recently told Channel 4 News that writing the music had been “a kind of antidote” for dealing with the death of his son earlier this year.",
        "Ahead of the ceremony, the anthem was “secretly recorded” in a studio and features the Royal Philharmonic Orchestra, Decca Records said.The tune was released as a single after the coronation to raise money for the Royal British Legion and Age UK charities.The anthem is one of 12 new works commissioned by Charles appearing in the coronation’s official album.In an unprecedented move, the complete album will be over four hours long and feature all the music and spoken word performances from the service.It will be the first time a recording of a coronation ceremony will be available globally to stream and download on the day of the service in music and British royal history."
    ]
}