{
    "articleURL": "/news/article-12038185/Animal-rights-activists-pledge-send-one-thousand-protesters-disrupt-Epsom-Derby.html",
    "content": [
        "Animal Rising has said it will aim to prevent the races from running on June 3Read more: More than 100 animal rights activists arrested after Grand NationalAnimal rights protesters have pledged to send ‘one thousand’ protesters to disrupt the Epsom Derby weeks after a foiled attempt to stop the Grand National.",
        "The Extinction Rebellion offshoot’s activity at Aintree – where members attempted to get onto the track and glue themselves to fences - led to 118 arrests and delayed the April 15 race by 14 minutes.Meanwhile, a week later, 25 members were arrested after storming the track at Ayr racecourse for the Scottish Grand National.Now Animal Rising said it has informed the Jockey Club and the British Horseracing Authority that it will aim to prevent races from running at The Derby on June 3The group, formerly known as Animal Rebellion, also attempted to disrupt the race last year, when six female protesters wearing sashes reading ‘animal justice’ were removed from the Surrey racetrack by police.",
        "Animal Rising has suggested it again intends to trespass onto the racetrack by ‘putting our bodies on the line so that the horses aren’t forced to do the same’.A spokeswoman said: ‘We will be doing everything non-violently possible to prevent the horses from coming to harm.‘It will involve putting our bodies on the line so that the horses aren’t forced to do the same. We will openly voice our concerns and intentions so that all animal lovers will have the opportunity to take part.’Campaigners have promised a 'summer of Animal Rising' during which the group will be 'disrupting high-profile racing events, occupying farms; openly rescuing animals; and taking action to shine a light on our animal, climate, and ecological emergencies'. ",
        "It has also been suggested the group could target Royal Ascot from June 20 to June 24.There are also fears Animal Rising could be among extremists planning to target the Coronation on Saturday after it claimed horses ‘shouldn’t be used for entertainment’ at the event.The Derby has a history as a focal point for protests. Suffragette Emily Davison died in hospital four days after she ran out in front of King George V’s horse, Anmer, at the 1913 event.The plot to wreck the National was exposed by an undercover Mail on Sunday investigation two weeks before the race.",
        "It meant police and security guards were able to prepare for and minimise the disruption.But the trainer of Hill Sixteen, who fell in the race and had to be put down, blamed the protesters for the horse’s loss.Sandy Thomson, who trained Hill Sixteen at his farm near Kelso, Berwickshire, said the horses were ‘very wound up’ by the disruption and that his horse had never fallen before in his 26-race career.He cited the delay and the rushed preparation caused by the protesters as being a major reason for the race’s total of three fallers, along with five unseated jockeys, over the first two fences.",
        "Last month, a racing insider said security was due to be ‘tight’ at The Derby - a favourite of the late Queen, who only missed it three times during her 70-year reign, including last year - and Royal Ascot.",
        "Animal Rising said it will target the entire Epsom Derby Festival on Friday June 2 as well as Saturday June 3, when the main race is held.A spokesperson for The Jockey Club, which runs Epsom Downs Racecourse and The Derby Festival, said: 'We never comment on the specifics of our security arrangements, but clearly part of planning for any event is to ensure that all eventualities are covered and illegal protests like the one we saw at the Grand National at Aintree will not be tolerated.'The safety and security of our racegoers and all our participants, whether equine or human, will always be our number one priority and any attempt to disrupt our events will be dealt with swiftly and decisively.'Our security teams will have a strong and visible presence, controlled centrally via extensive CCTV coverage of the site, and we will be working closely with Surrey Police who will be present on the day.'"
    ]
}