{
    "articleURL": "/sport/football/article-12058833/KIERAN-GILL-Declan-Rice-credit-West-Ham-club-signs-lucky.html",
    "content": [
        "Declan Rice is a credit to West Ham and the Premier League's most likeable star He showed his class in a video where he gives his short to a young West Ham fan The West Ham captain is expected to leave this summer and could cost £100mAt a time when footballers have not been helping themselves, Declan Rice is different. Away from the pitch, he is a thoroughly decent person, a credit to his club, and in my view, the Premier League’s most likeable player.",
        "You only needed to watch the video of Rice with a young fan after Sunday’s 1-0 win over Manchester United. He is crying. He doesn’t know why. But Rice treats like him like any captain should. He hugs him. He gifts him his shirt. He tells him he loves him.Cynics will say he knew he was on camera. But this is just Rice. As anyone at West Ham will tell you, the 24-year-old from Kingston is the same when there are no smart phones pointing in his direction.It’s the time he takes to speak to the young mascots before games because he knows they will be scared to walk out in front of 60,000 screaming supporters. It’s the greetings he’ll give you if you walk past him at West Ham’s training ground on press conference day. It’s the traffic jam he creates at the gates as he makes sure every autograph hunter gets their selfie before he driving out on to Rush Green Road. It’s the detour to the Chadwell Heath academy ground so he can speak to their blossoming starlets like Ollie Scarles and Lewis Orford.",
        "Credit must go to Rice how he has handled his first season as a club captain. Replacing Mark Noble was not an easy task, and word is he still needs to work on his rollickings, yet Rice has shown himself to be a total professional and all this is before we get to what he is doing on the pitch.",
        "Sunday’s win could be Rice’s penultimate home Premier League game for West Ham. He is expected to leave in the summer, most likely for Arsenal, most likely for £100million.West Ham think that is a fair asking price for the England midfielder whose contract expires in 2024 but with the option of an additional year.Manager David Moyes was asked about Rice being admired by bigger clubs such as Arsenal, Chelsea and United in his post-match press conference. He turned to his stock answer – yes, he is brilliant, and no, he will not be cheap.Rice’s statistics underline why West Ham feel he is worth £100m.",
        "He has won possession more times than any other player in Europe’s elite leagues this season.Only one player in England’s Premier League, Spain’s La Liga, Italy’s Serie A, Germany’s Bundesliga and France’s Ligue 1 has managed 30-plus in interceptions, clearances, take-ons, chances created and shots – and that man is Rice.Without him, West Ham would have been in bigger trouble this season. Sunday’s win all but secures Premier League safety and now they can concentrate on the Europa Conference League, with the first leg of their semi-final against AZ Alkmaar this Thursday.When Noble retired at the end of last season, the dream was to win the Europa League so the club captain could depart on a high. West Ham fell at the semi-final stage of that competition.",
        "If Rice is to leave – and any club that snatches him up will be lucky to do so – it would be fitting to see him lifting that Europa Conference League trophy in Prague on June 7."
    ]
}