{
    "articleURL": "/wires/reuters/article-12049609/UK-Conservatives-suffering-terrible-night-local-election-losses.html",
    "content": [
        "First major electoral test for Sunak as prime minister",
        "Results clear rebuff for Conservatives - pollsterLabour says it is on course to win next national election(Updates council seat figures, paragraph 4; pollster's view, paragraph 13)By Andrew MacAskill and Alistair SmoutLONDON, May 5 (Reuters) - British Prime Minister Rishi Sunak's Conservatives suffered steep losses in Friday's local election result, undermining his attempts to revive their fortunes and emboldening the opposition Labour Party before a national vote expected next year.Sunak came to power in October following a year of political scandals, surging inflation and stagnant economic growth. In office he has faced a cost-of-living crisis, mounting concern about healthcare and widespread industrial action.While governing parties often struggle at mid-term elections, the council results in England are the largest, and possibly last, test of voter sentiment before the next national election due by January 2025.With a majority of councils counting their votes, which do not affect the government's majority in parliament, the Conservatives had a net loss of 943 seats by 1802 GMT, while Labour added 486 seats and the Liberal Democrats gained 353.Labour said they were now on track for power at the next general election. A Sky News projection based on the vote share of the early results said Labour could garner 36-38% of the vote at the next national election, making them the biggest party, with the Conservatives at 28-30%.",
        "The projection said Labour might fall short of a majority, though that could depend on how it fares in Scotland, where it is competing to take seats from the Scottish National Party and which did not hold local elections.A similar BBC projection said Labour would get 35% at a national election and the Conservatives 26%, and some in Sunak's party voiced their disquiet over the results.Labour won control of Swindon borough council, a town in southwest England where Labour leader Keir Starmer launched his election campaign, and which has always voted for lawmakers for the governing party since 1983.\"No spin, no gloss. This is a dreadful set of results,\" said Justin Tomlinson, Conservative lawmaker in parliament for Swindon North. \"The party collectively needs to take this as a wake-up call to refresh and renew.\"'UNAMBIGUOUS' REBUFFThe votes were to elect around 8,000 councillors to local government authorities which have responsibility for the day-to-day provision of services such as bin collections and schools.Sunak's party suffered losses to Labour in seats in the north and southern England, while the Liberal Democrats advanced in wealthier parts of the south.Sunak told reporters the results so far showed that people wanted his ruling party to deliver on their priorities, but that it was still too early in the process of announcing results to draw firm conclusions as counts continue.",
        "John Curtice, Britain's best-known pollster, said that if Conservative losses approached 1,000 seats, it would spell deep electoral trouble, and the results were an \"unambiguous\" rebuff to the party as it tries to stay in government at the next parliamentary election.\"(Labour) might achieve winning an overall (parliamentary) majority, not because of any great enthusiasm of the electorate for Labour, but rather simply because the Conservatives are doing so badly,\" he told BBC radio.Sunak has tried to restore the Conservatives' credibility since he took over as prime minister and as his party's third leader in the past year following the scandal-ridden premiership of Boris Johnson and the chaotic economic policies that brought down Liz Truss within two months.Sunak's party lost control of dozens of councils in what Johnny Mercer, a member of parliament for Plymouth, said was a \"terrible\" night for the Conservatives.Labour made gains in some areas that backed leaving the European Union in the 2016 Brexit referendum which the party will need to win over if it wants to achieve a majority in the next parliament.\"Make no mistake, we are on course for a Labour majority at the next general election,\" Starmer said on a visit to Medway, one of the councils it picked up. (Reporting by Andrew MacAskill and Alistair Smout; Additional reporting by William James and Farouq Suleiman; Editing by Nick Macfie, Gareth Jones and Grant McCool)"
    ]
}