{
    "articleURL": "/sport/formulaone/article-12052841/Lando-Norris-says-Oscar-Piastri-pushing-harder-Daniel-Ricciardo-ahead-Miami-GP.html",
    "content": [
        "Piastri and Norris are preparing for Miami GP Drivers have similar times on the track Norris says Piastri is pushing him harder than Ricciardo McLaren's Lando Norris has fired a shot at former teammate Daniel Ricciardo by declaring his replacement and fellow Australian Oscar Piastri was pushing him harder.",
        "Ricciardo left McLaren in a messy divorce at the end of 2022 and is now a reserve driver for Red Bull, hoping to crack back into an F1 driving position again next year.Norris and Piastri will be looking for better results at the Miami GP starting at 5.30am Monday AEST after a sluggish start to the season.Piastri was poached by the team to replace his compatriot despite having spent a year on the sidelines as Alpine’s reserve driver, with his three junior championships making him an attractive proposition notwithstanding his lack of F1 experience. The Melburnian has so far enjoyed a commendable first few rounds, particularly in qualifying. Norris and Piastri are among the most closely matched teammates on the grid. ",
        "After four rounds and five qualifying sessions, the pair is split by an average of just 0.055 seconds. Only the Mercedes and Alfa Romeo drivers have been split by less. The margin arguably flatters Piastri given he’s outqualified Norris only once this year, at the Saudi Arabian Grand Prix. The Briton crashed out of Q1 that weekend, blowing out the gap to 1.2 seconds for that round. However Norris said the tight margins showed that the young Aussie was pushing him harder than Ricciardo did during his two-year stint at McLaren.    ",
        "'He's very fast,' Norris said of Piastri. 'Probably he has been pushing me a little bit more than the past couple years. So yeah, enjoyable.'He's a lovely guy — down to earth, normal guy, hard worker and so on. So it's good, fun.'It's different to Daniel — I feel like a bit of a contrast of Australian — but still good fun.'",
        "Piastri is looking to improve on his 10th place in qualifying at the Azerbaijan Grand Prix and 11th place overall, impressive results considering the shocking health issues the young Melbourne product had to overcome.Piastri had to live off four pieces of toast all weekend, shed three kilograms in weight with a stomach bug, and was utterly luckless on the track over several gruelling, empty-handed days in Baku.Now, fit and healthy, he is ready to make an impact in Miami.'It's another circuit on the calendar which has challenging features, but I've prepared well by working hard in the [simulator],' he said. 'In [Baku] it was disappointing to miss out on points by one position, but I'm determined to finish the double-header in Miami with another strong showing.'"
    ]
}