{
    "articleURL": "/femail/article-12048661/Al-Roker-reveals-pregnant-daughter-Courtney-expecting-BABY-GIRL.html",
    "content": [
        "Roker opened up about becoming a grandpa on the red carpet WednesdayThe Today anchor slipped and said he is expecting his 'first granddaughter'He explained that his daughter accidentally told him the baby's sex in a text Al Roker has opened up about how his pregnant daughter Courtney Roker Laga let it slip that she is having a baby girl, saying she accidentally spoiled the surprise in a text. ",
        "The Today weather anchor, 68, had trouble keeping the news to himself when he walked the red carpet at the Broadcasting and Cable Hall of Fame Awards gala in New York City on Wednesday. 'Courtney is expecting our first granddaughter,' he told Entertainment Tonight, before quickly correcting himself and using the word 'grandchild.'Roker eventually admitted that his daughter is having a baby girl, saying he didn't want to know the sex of the baby until she gave birth. ",
        "'She [texted] me a sonogram picture and I said, \"That baby looks just like you,\" and she said, \"Doesn't she?\" And then you see the bubbles,' he recalled. '[She goes] \"I'm so sorry!\" and I went, \"You had one [job]!\"''I wanted to be surprised,' he added with a laugh. The proud grandpa-to-be also shared that Courtney is due in June. Roker's latest revelation about his oldest daughter's pregnancy comes weeks after he shared how he accidentally learned he is going to be a grandfather. He already knew Courtney was pregnant when she announced on Instagram March 14 that she and her husband, Wesley Laga, are expecting a baby.'I’ve known for a while. They just decided to go ahead [and announce it],' Roker told his Today costars the next day. 'Wes’s goofy brother accidentally dropped it in a text. Thanks Cory!'",
        "'There's one in every family,' Guthrie said.'Two in mine,' the weatherman joked. ",
        "Roker added that he already knew what he wants his grandchild to call him. 'I think in honor of my dad I’m going to try to go for Pop-Pop,' he said. Courtney, 36, is Roker's only child with his ex-wife, Alice Bell. He also has a younger daughter, Leila, 24, and a son, Nicholas, 20, with his wife, Deborah Roberts. 'Deborah is still not quite sure about the grandma thing, but we’re very excited,' he told his costars. 'It still hasn’t quite sunken in.'Roker continued the celebrations with a champagne toast with Melvin, Sheinelle Jones, and Dylan Dreyer during the show's third hour. He was gifted some Today onesies for the baby as he shared what kind of grandfather he wants to be. 'It depends on what you consider the best grandfather,' he said. 'For this grandchild, I'm going to be the best grandpa ever because I'm going to do whatever I can to spoil this kid — and then hand her back.' 'Wait, you're saying her,' Dreyer pointed out. ",
        "'Uhh,' Roker stuttered, unsure how to respond. Melvin quickly jumped in to save him, saying, 'It could be a him.'Courtney's baby announcement featured photos of her with her husband, Wes, whom she married in 2021. The footage, which was set to Brent Morgan's cover of Mariah Carey's hit Always Be My Baby, then cut to her sonogram. ",
        "'A new adventure is about to begin,' the mom-to-be wrote in the caption. 'Here we go!!! So very very happy!!!!! You guys,' Courtney's father responded, while her stepmother, Deborah, added, 'This is so very exciting!!!'Courtney told Today that the baby was healthy and she was feeling great midway through her pregnancy. 'We are extremely excited to welcome a new member into our family and start this next chapter in our lives,' she said. 'We feel truly blessed and excited for our little miracle.' The news of Roker's growing family comes just months after he faced a life-threatening health scare. He suffered from blood clots and internal bleeding last year. During a nearly seven-hour emergency surgery, doctors had to resection his colon, remove his gallbladder, and fix a tear in his duodenum, the first part of the small intestine that connects to the stomach. Roker made his triumphant return to the Today show on January 6 following his two-month medical leave, which included a total of four weeks in the hospital. "
    ]
}