{
    "articleURL": "/wires/ap/article-12059439/Turkish-opposition-rally-cut-short-violence.html",
    "content": [
        "ISTANBUL (AP) - More than a dozen people have been detained over violence against an opposition election rally in Turkey´s eastern city of Erzurum over the weekend, the country´s justice minister said Monday. Istanbul Mayor Ekrem Imamoglu of the main opposition Republican People´s Party, CHP, was speaking atop a campaign bus Sunday afternoon when a large group of roughly 200 protesters began throwing rocks. Imamoglu was campaigning on behalf of CHP leader and presidential candidate Kemal Kilicdaroglu, the main opponent to President Recep Tayyip Erdogan, days before the May 14 presidential and parliamentary elections. He maintained that police and pro-Erdogan officials in Erzurum allowed the attack to go ahead. \"There are citizens here who are injured, and you police are just standing by,\" Imamoglu is heard saying in footage of the incident. \"Erzurum governor, Erzurum mayor, I will be filing a criminal complaint against you.\" The video later shows Imamoglu being taken inside by his entourage and the bus driving off, with police later dispersing the group with water cannons. Seven people were injured in the incident, according to Erzurum Governor Okay Memis. Speaking on local news channel A Haber Monday morning, Justice Minister Bekir Bozdag announced that the investigation was ongoing and 13 people had been detained so far.",
        "Kilicdaroglu posted a video on social media following Sunday´s incident where he accused the mob responsible of being a \"militarist coalition\" who seeks to \"scare people away from the ballot box.\" Speaking on a television program later in the evening, Interior Minister Suleyman Soylu claimed the incident was \"theater.\" \"They provoke such incidents, then they claim `they did this to us, they did that to us´ ... They had put forward a speech that was meant to agitate, to provoke the crowd.\" The contest is currently neck-and-neck. If Erdogan wins, it would be his third consecutive term as president. However, opinion polls give a slight lead to Kilicdaroglu."
    ]
}