{
    "articleURL": "/wires/ap/article-12039093/DeSantis-immigration-bill-approved-Florida-GOP-lawmakers.html",
    "content": [
        "TALLAHASSEE, Fla. (AP) - The Florida Legislature on Tuesday approved a sweeping immigration bill pushed by Gov. Ron DeSantis, bolstering the Republican's controversial migrant-relocation program as he prepares to announce a presidential run.",
        "The GOP-controlled House gave the proposal final passage on a party-line vote with Republicans in support. It passed the Senate last week and now moves to the governor's office to be signed into law.DeSantis, who is expected to launch his presidential candidacy in the coming weeks, has made immigration a top priority and has espoused hard-right positions on undocumented immigration geared toward winning support among Republican primary voters.The bill provides $12 million for DeSantis' migrant relocation initiative, which drew national attention last year when the governor flew a group of South American migrants from Texas to Martha´s Vineyard, Massachusetts, a move intended to protest federal immigration policy.The measure also expands requirements for businesses with more than 25 staffers to use E-Verify, a federal system that determines if employees can legally work in the U.S. It prohibits local governments from providing money to organizations that issue identification cards to people illegally in the country and invalidates out-of-state driver's licenses held by undocumented immigrants.Another provision would require hospitals that accept Medicaid to include a citizenship question on intake forms, which critics said was intended to dissuade undocumented immigrants from seeking medical care.",
        "\"This bill is politically driven, and it´s an anti-immigrant bill that will hurt and even kill undocumented immigrants,\" said Rep. Susan Valdes, a Democrat.",
        "DeSantis framed the legislative package as a counter to Democratic President Joe Biden's border policy, previously saying \"we won´t turn a blind eye to the dangers of Biden´s Border Crisis. We will continue to take steps to protect Floridians from reckless federal open-border policies.\"The governor's Republican allies in the statehouse largely mirrored his rhetoric.\"We can't solve the problem in Washington. But we can send a message that says in Florida, we've had enough,\" said Rep. Randy Fine, a Republican.Republicans control a supermajority in the Florida Legislature and have focused on DeSantis priorities this session as the governor moves to stack conservative policy wins ahead of his presidential campaign announcement."
    ]
}