{
    "articleURL": "/wires/pa/article-12050507/BBC-film-coronation-festivities-150-cameras.html",
    "content": [
        "The BBC will have 150 cameras covering the coronation festivities, including the procession to Westminster Abbey and the ceremony itself.",
        "Broadcasting from temporary studios in London and Windsor, the corporation will also be at the ten sites of its Lighting Up The Nation event.There will be choreographed lasers, projections and drone displays over historic bridges and buildings, including Blackpool seafront in Lancashire, as part of the Coronation Concert.In addition to its fixed operations, there will be 19 separate outside broadcasts from Windsor, London and across the rest of the UK.",
        "Kate Phillips, BBC director of unscripted, said: “We are incredibly proud to be bringing this moment of major historical significance and celebration to viewers at home and internationally.“Over the next nine days, with our coverage of the coronation and then Eurovision, we will be delivering the biggest week of live programming since 2012. Both events showcase the unique role that the BBC plays in the lives of millions.“Our highly talented and skilled teams will once again be delivering unforgettable shows of significant scale.“Making use of the multiple media platforms and invaluable expertise across the BBC, we will be bringing people together like never before throughout the UK.”The coronation ceremony at Westminster Abbey and the Coronation Concert, which will include performances from Take That, Katy Perry and Lionel Richie, will be broadcast to more than 125 countries around the world.",
        "Hannah Wyatt, managing director for factual entertainment and live events at BBC Studios Productions, said: “It’s a huge honour to be covering this once-in-a-lifetime occasion.“Our Live Events production team are world class and continually innovate to ensure the coverage provides viewers with the best possible experience, from ultra-high definition pictures to 5.1 surround sound, enabling the audience to really feel like they’re part of this historic event.”The BBC’s coverage will involve presenters such as Kirsty Young, Sophie Raworth, Clare Balding and Huw Edwards.The corporation said the coronation will be its most accessible live event ever on BBC iPlayer, with subtitles, sign language and an alternative commentary version for people with sight loss.– The Coronation Of HM The King will be on BBC One and BBC iPlayer from 7.30am on Saturday.– The Coronation Concert will be on BBC One and BBC iPlayer from 8pm on Sunday."
    ]
}