{
    "articleURL": "/wires/ap/article-12047943/DeSantis-stacks-conservative-agenda-presidential-run-looms.html",
    "content": [
        "TALLAHASSEE, Fla. (AP) - From the death penalty to gender identity to abortion, Florida Gov. Ron DeSantis has cemented himself as a conservative standard bearer as he prepares to launch a presidential campaign sometime after the legislative session ends this week.",
        "With the help of GOP supermajorities in the statehouse, the Republican has been able to push through an aggressive agenda during the legislative session that's expected to form the base of his White House run.Here's a look at some of the policies:ABORTIONDeSantis has signed a bill banning abortions after six weeks of pregnancy, but it won't take effect unless the state´s current 15-week ban is upheld in an ongoing legal challenge that is before the state Supreme Court, which is controlled by conservatives.A six-week ban in Florida would strike a devastating blow to abortion access in the South, since the nearby states of Alabama, Louisiana and Mississippi have banned the procedure at all stages of pregnancy. Georgia forbids it after cardiac activity can be detected, which is around six weeks.",
        "Critics, including some Republicans, have slammed the six week law as extreme, given that most women do not even realize they are pregnant in that timeframe.\"DON'T SAY GAY\"The DeSantis administration has expanded the controversial law critics call \"Don't Say Gay\" to cover all grades, banning classroom instruction on sexual orientation and gender identity in schools.The move came after DeSantis signed a bill last year that prohibited such lessons through the third grade, a policy he has championed as a means to protect children from sexualization.",
        "But this year the DeSantis administration quietly put forward a proposal before the state Board of Education to expand the policy to grades 4-12, unless required by existing state standards or as part of reproductive health instruction that students can choose not to take. The board, which is appointed by DeSantis, approved the proposal and its set to go into effect in the coming weeks.DeSantis' education officials have said the policy is intended to make clear that teachers should adhere to state education curriculum.PRONOUNSDeSantis is expected to soon sign a bill that prevents school staffers or students from being required to refer to people by pronouns that don´t correspond to the person´s sex.The bill, which passed this week, also bars school employees from asking students what pronoun they use and bans staffers from sharing their pronouns with students if the pronoun does not correspond with the staffer's sex.Additionally, the proposal would make it the policy of every public school that \"a person´s sex is an immutable biological trait and that it is false to ascribe to a person a pronoun that does not correspond to such person´s sex.\"DEATH PENALTYDeSantis has signed two major death penalty bills this year.The first ends a unanimous jury requirement in death penalty sentencing, allowing capital punishment with jury recommendation of at least 8-4 in favor of execution. Only three states out of the 27 that impose the death penalty do not require unanimity. Alabama allows a 10-2 decision, and Missouri and Indiana let a judge decide when there is a divided jury.",
        "The change came in response to a verdict that spared the life of the Marjory Stoneman Douglas High School shooter, who killed 17 people in 2018.The other death penalty bill DeSantis signed allows the death penalty in child rape convictions, despite a U.S. Supreme Court ruling that banned capital punishment in such cases.The law intended to get the conservative-controlled U.S. Supreme Court to reconsider a 2008 ruling that found it unconstitutional to use capital punishment in child sexual battery cases.Florida is among a handful of states with existing laws that allow for capital punishment on child rape convictions but has not used the punishment given the high court ruling. The Florida Supreme Court has also ruled against the use of capital punishment in sexual battery convictions.DeSantis said he believed the Supreme Court´s decision was \"wrong.\"GUNSFloridians will be able to carry concealed guns without a permit under a bill DeSantis signed this session.The new law will allow anyone who can legally own a gun in Florida to carry one without a permit. It means training and a background check will not be required to carry concealed guns in public. It takes effect July 1.Nearly 3 million Floridians have a concealed weapons permit. While a background check and three-day waiting period will still be required to purchase a gun from a licensed dealer, they are not required for private transactions or exchanges of weapons.",
        "DeSantis has said he thinks Florida should go even further and allow people to openly carry guns. While some lawmakers have pushed for open carry, it doesn´t appear the Legislature will pass such legislation this session.Still, the governor has boosted the law, releasing a statement that read \"Constitutional Carry is in the books\" after he signed it into law.DIVERSTIYAnother bill that awaits the governor's signature is one that bans colleges from using state or federal funding for diversity, equity and inclusion programs, a consistent target of DeSantis.Such initiatives, sometimes referred to as DEI, have come under increasing criticism from Republicans who argue the programs are racially divisive.The proposal comes a year after he signed legislation dubbed the Stop WOKE Act, which restricts certain race-based conversations and analysis in schools and businesses. The law bars instruction that says members of one race are inherently racist or should feel guilt for past actions committed by others of the same race, among other things.DISNEYDeSantis also continued his long-running feud with Disney this year.The company came into his crosshairs for criticizing the so-called \"Don't Say Gay\" law last year.As punishment, DeSantis dissolved Disney World´s self-governing district and appointed a new board of supervisors that would oversee municipal services in the sprawling theme parks. But before the new board came in, the company pushed though an 11th-hour agreement that stripped the new supervisors of much of their authority.",
        "Disney sued DeSantis in federal court in a case that said the governor waged a \"targeted campaign of government retaliation\" after the company opposed the sexual orientation and gender identity law.Now, DeSantis is poised to sign bills to enhance state oversight of the resort´s monorail as well as undo agreements made by the Disney board before the state took it over."
    ]
}