{
    "articleURL": "/wires/ap/article-12052421/States-add-laws-pronouns-sports-transgender-students.html",
    "content": [
        "Indiana Gov. Eric Holcomb this week signed into a law a requirement that schools notify a parent when their student asks to be called a different name or uses pronouns that correspond with their gender, not their sex.",
        "It's the latest law to emerge from a focus in Republican-controlled states on restricting transgender students in the name of parental rights or protecting other students.LTBTQ+ advocates say the measures are harmful to students, especially those who are trans.Some things to know:PRONOUNSAs the idea that people should be referred to by the pronouns they choose has taken root, there's been a strong conservative political backlash - part of a broader backlash against acceptance of transgender people.",
        "On Thursday, Florida's lawmakers gave final passage to a bill that would prevent students and teachers from being required to use pronouns that don't correspond to someone's sex. Gov. Ron DeSantis, who is expected to seek the Republican presidential nomination next year, has signaled he will sign the measure.Montana earlier this year passed a law that would block schools from punishing students who misgender or deadname peers - referring to them by the wrong gender or by names they previously used - so long as it doesn't rise to the level of bullying. An earlier version of the legislation would have blocked schools from punishing students for purposely using peers' wrong names or gender.Indiana's version, which takes effect July 1, goes a step further, requiring schools to tell parents when their students ask to be called by a different name or by a pronoun that corresponds with their gender.",
        "It's not the first state with a similar provision. Alabama adopted a law last year requiring schools to notify parents if a child discloses that they think they might be transgender and also blocking school staff from encouraging students to withhold that information from their parents.The pronoun restrictions aren't catching on in all Republican-controlled states. North Dakota Gov. Doug Burgum vetoed a bill that would have barred public school teachers and staff from using the pronouns a transgender student uses without a parent's permission. The veto narrowly survived an override attempt last month.BLOCKING LESSONS ON GENDER IDENTITYDeSantis has been leading the charge against pronouns and other causes he incorrectly refers to as \"woke.\" Last year, his state became the first to adopt what critics call a \"Don't Say Gay\" law barring schools from teaching about sexual orientation and gender identity in kindergarten through third grade.Last month, Florida's state school board expanded the ban on teaching about sexual orientation and gender identity to all grades, The bill passed this week that DeSantis is expected to sign would legally reinforce that, banning the instruction through eighth grade with exceptions for when it's required by existing state standards or are part of reproductive health instruction classes that parents can choose for their students not to take.",
        "Some of the pronoun provisions, including Indiana's, are included in broader prohibitions on teaching about gender identity similar to Florida's law.PARENTAL RIGHTSOther states, including Arizona and Idaho, have passed laws in the last two years intended to give parents more control over their children's education.They both require that information about their student's health and education be made available to parents.In Idaho's case, the law, which is to take effect July 1, requires parents be told of changes in students' mental, emotional or physical well-being.Critics say that while the laws do not specifically list gender identity, they will end up outing transgender students to families who might not be accepting.BATHROOMS, SPORTS AND HEALTHCAREOther state policies aimed at curtailing the rights of transgender young people have been centerpieces of legislative sessions in red states, especially the past two years.At least nine states have adopted laws to keep transgender students out of bathrooms and locker rooms that align with their gender identities.Laws adopted in at least 21 states would keep transgender girls and women from playing on girls and women's sports teams. Courts have blocked enforcement of some of those. President Joe Biden's administration last month proposed a rule that would find that broad bans on transgender sports participation would violate federal law.",
        "The U.S. House last month also approved a ban on transgender girls and women on girls and women's sports teams, but it's unlikely to be passed by the Democrat-controlled Senate.And at least 20 states have adopted laws or policies - including some blocked by courts - barring gender-affirming care, such as puberty blockers, hormone therapy and surgery for minors. At least 10 states have taken action to protect access to the care."
    ]
}