{
    "articleURL": "/news/article-12061373/NCA-bomber-Domenic-Perre-dies-prison-months-guilty-verdict-bombing-Adelaide.html",
    "content": [
        "NCA bomber died in jailDomenic Perre died on Monday A man who sent a parcel bomb to a law enforcement agency building that killed a police officer and injured a lawyer has died in prison. ",
        "Domenic Perre, 66, passed away at Royal Adelaide Hospital on Monday night less than a year after he was found guilty for carrying out the deadly blast that unfolded in March 1994.Perre had sent a parcel bomb to the National Crime Authority on Waymouth Street in Adelaide, South Australia.",
        "The explosion killed Detective Geoffrey Bowen and seriously injured lawyer Peter Wallis.Detective sergeant Bowen died from horrific injuries, including the loss of his left arm, while Mr Wallis lost an eye and suffered severe burns. Perre had sent the parcel to the office as he sought revenge for detective sergeant Bowen's investigation into the Perre family's drug business.Perre was first charged with murder soon after the bombing but the case against him was dropped six months later because of a lack of evidence.He was arrested again in 2018 after a joint investigation, lasting more than two years, by a number of state and federal authorities including the Australian Criminal Intelligence Commission.Prosecutors argued the bombing was a personal attack on Sgt Bowen.They said Perre's hostility towards him had grown because of their interactions following the seizure of a multi-million dollar cannabis crop in the Northern Territory in August 1993.Perre elected not to give evidence but his defence team said the investigation into the bombing was plagued by tunnel vision.",
        "Lead counsel Gilbert Aitken told the court that in the eyes of SA detectives only Perre had the motive to make and send the bomb.Perre pleaded not guilty to the murder of Sgt Bowen and the attempted murder of Mr Wallis but was found guilty by Justice Kevin Nicholson in June 2022.",
        "'Your conduct was brutish. That is totally devoid of any human sensibility,' the judge said.'Your conduct was motivated by matters that do you no credit.'It was not just premeditated but intricately devised and planned over a lengthy period of time and was executed in cold blood.'Justice Nicholson said Perre 'intended to kill anyone who happened to open' the parcel.'These matters, considered as a whole, establish beyond reasonable doubt that Domenic Perre constructed and posted the NCA bomb and caused the death of Mr Bowen and the injuries to Mr Wallis,' he said.'On my assessment of the circumstances, I am satisfied beyond reasonable doubt that Mr Perre must have intended to kill anyone who happened to open the postpak whether or not Mr Bowen, and anyone else who happened to be with that person at the time of the detonation.'Perre was handed a life sentence for the horrific attack and had been held at Yatala Prison.",
        "He was then transferred to Royal Adelaide Hospital in mid April before he suffered a heart attack on Monday. The NCA was a law enforcement agency set up in 1984 before it was closed in December 2002.",
        "THE INCIDENT:* On March 2, 1994, a parcel bomb exploded in the office of the National Crime Authority on the 12th floor of an office building in Waymouth Street, Adelaide.* The blast killed investigator Detective Sergeant Geoffrey Bowen and severely injured lawyer Peter Wallis.* The bombing has been one of South Australia's highest-profile cases, with a $1 million reward offered in 2008 for information leading to the conviction of the person or people responsible.THE BOMBER:* Domenic Perre was first charged with murder soon after the bombing but the case against him was dropped six months later because of a lack of evidence.* The 65-year-old was arrested again in 2018 after a joint investigation, lasting more than two years, by a number of state and federal authorities including the Australian Criminal Intelligence Commission.* He went on trial for murder and attempted murder in the Supreme Court in October 2020 after being jailed on drug trafficking charges unrelated to the bombing.* After a near year-long trial and more than six months of deliberations, Justice Kevin Nicholson found him guilty on both charges.* Perre will be sentenced at a later date.THE TRIAL:* The trial opened in October 2020 with the final evidence taken in June last year and the final defence submissions in August.* There was no jury after Perre elected to be tried by judge alone.* On the prosecution case the bombing was a personal attack on Sgt Bowen following the seizure of a multi-million-dollar drug crop in the Northern Territory in 1993.* Perre's defence said he had continually denied involvement in the bombing and accused detectives of having 'tunnel vision' during the entire 28-year investigation.* Some elements of the case have been kept secret with the court issuing more than 30 suppression orders."
    ]
}