{
    "articleURL": "/tvshowbiz/article-12048253/Emmerdale-fans-heartbroken-Chloe-baby-Reuben-fights-life.html",
    "content": [
        "Emmerdale fans have been left heartbroken for Chloe Harris as her baby son Reuben fought for his life in Thursday's episode.",
        "The new mother was set to flee to Aberdeen with the newborn tot, but was left full of worry when he began burning up and was refusing to take liquids.Her concerned pal Victoria Sudgen called Dr Manpreet, who got her colleague Dr Liam to visit, with the GP soon rushing the bay to hospital over concerns about his 40 degree temperate.At the hospital, tests were run on Reuben and Chloe (Jessie Elland) was devastated to learn that her child has bacterial meningitis, as she wept to Victoria: 'I can't lose him'.Meanwhile, Reuben's secret dad Mack Boyd was struggling with his turmoil after learning that his son was poorly, with the farmer battling to hide his emotions from his unaware wife Charity Dingle.",
        "With doctors warning Chloe that the next 72 would be crucial, she was beside herself at the thought of losing her little boy, even blaming herself for his illness.She sobbed to Victoria: 'He's all that I've got… I would have given everything for them to walk in and say it's nothing, and I've overreacted. 'I feel so powerless. I'm his mum and he needs me, and I can't do anything.'Watching the emotional scenes unfold, viewers were quick to share their sympathies for the character.",
        "'Poor Chloe, no new mum should be going through this alone' commented one viewer.While another remarked: 'omg poor Ruebon and a nightmare for chloe.''Poor Chloe hasn't had it easy' came the response from a third watcher.'Omg, poor Chloe. Surely her baby won't die that must be the worst thing to be told' shared a fourth.",
        "With another urging: 'Chloe, please stop blaming yourself.'Meanwhile, in the episode, a concerned Mack was seen sneaking onto the NICU to check on his son.But he was left crushed when a nurse told him it was family only and he had to leave.However, things are set to get worse for the character when Charity eventually learns that he is Reuben's father. For months Mack and Chloe have kept their secret one night stand and resulting child under wraps, with only Nate Robinson and Sarah Sugden knowing the truth.However, things are finally set to come to a head as Mack's wife Charity works out his shocking secret after he struggled to cope with baby Reuben's recent bacterial meningitis diagnosis.In upcoming scenes, Mack's pal Nate worries he's deluding himself as he contemplates balancing his marriage to the landlady with a secret life with his son.Meanwhile, Chloe reels when doctors inform her that Reuben may have a bleed on his brain. ",
        "Over at the Woolpack, Dan Spencer attempts to stay positive about Reuben's chances but Mack (Lawrence Robb), who's been drowning his sorrows amid his son's health woes, reaches his breaking point.And wife Charity (Emma Atkins) is left astonished when he then punches Dan before stalking off into the night.Later, a worried Mack sits outside the hospital, unable to bring himself to go in.He then ignores a call from Charity, who's become increasingly concerned about what's truly causing their rift. Inside the hospital, Chloe's desperately worried when the consultant tells her they'll need to do another scan on Reuben, who's condition doesn't appear to be improving. Elsewhere, Nate urges Mack to visit Reuben in hospital after realising the extent of his pal's concern for the tot. However, with Charity already suspicious over his unusual behaviour, Mack is soon risking his relationship as he heads to the hospital.Soon, both parents are utterly relieved when the consultant tells them Reuben is showing no signs of brain damage. And when Chloe asks if he wants to come and see Reuben with her, Mack jumps at the chance to spend time with his son. ",
        "Unbeknownst to him meanwhile, Charity and Chloe's half-sister Amy Wyatt arrive at the hospital for a surprise visit after learning that Reuben is on the mend.",
        "But Charity is in for a shock when she spots an unaware but emotional Mack doting over baby Reuben.She's soon hit with the shocking realisation that Mack is in fact Reuben's dad.But just how will she react to the shocking discovery?  Emmerdale airs weekdays at 7:30pm on ITV1 and ITVX. "
    ]
}