{
    "articleURL": "/wires/reuters/article-12047909/Russias-war-Ukraine-latest-Kremlin-says-US-drone-attack.html",
    "content": [
        "May 4 (Reuters) - Russia said on Thursday that the United States was behind an alleged drone attack on the Kremlin that aimed to kill President Vladimir Putin, while Moscow's forces fired more combat drones at Ukrainian cities including the capital Kyiv.",
        "FIGHTING* The United States dismissed as lies Russia's allegation that it was behind the Kremlin incident.* Russia fired two dozen combat drones at Ukraine, striking a university campus in the Black Sea city of Odesa and attacking the capital Kyiv for the third time in four days.* Russian shelling killed 23 people in and near the southern Ukrainian city of Kherson on Wednesday, hitting a hypermarket, a railway station and residential buildings, the regional governor said.* An Israeli-designed missile detection system that would give Ukrainians more time to take shelter from Russian missile attacks is being tested in Kyiv and may be activated within two months, Ukraine's ambassador to Israel said.DIPLOMACY/POLITICS* Putin must be brought to justice for his war in Ukraine, Zelenskiy said in The Hague, calling for the creation of a war crimes tribunal separate to the International Criminal Court.* The Kremlin said it was aware Pope Francis was thinking about ways to end the conflict in Ukraine.* Russia has complained to Finland about vandalism at a Russian consulate on the Aland islands in the Baltic Sea between Finland and Sweden, the Finnish foreign ministry said.ECONOMY* Ukraine said it had seized assets worth more than more than $280 million belonging to an exiled billionaire it accuses of aiding Russia.",
        "* Car sales in Russia leapt by 170.4% year-on-year in April, analytical agency Autostat said, with the country's bruised car market staging a partial recovery from the soaring prices and reduced deliveries of the same month last year.* A Russian-U.S. joint venture has said it has abandoned plans to build large-capacity gas turbines in Russia under licence from General Electric CoQUOTES* \"I don't believe they got to the Kremlin ... Our Putin is super. Nothing ever threatens him\" - Moscow resident Zifa.* \"We all want to see a different Vladimir here in The Hague, the one who deserves to be sanctioned for his criminal actions here, in the capital of international law\" - ZelenskiyRECENT IN-DEPTH STORIES* ANALYSIS-Kremlin incident gives Putin cover to deepen war* COLUMN-Global ammunition race may decide Ukraine war* INSIGHT-Russia digs in as Ukraine prepares to attack* ANALYSIS-Russia crosses new lines in crackdown on Putin's enemies* EXCLUSIVE-The Russian military commandant who oversaw reign of fear in Ukraine town* EXCLUSIVE-Kazakhstan has ramped up oil exports bypassing Russia -sources* Liberated villages offer glimpse of precarious Ukrainian health system. (Compiled by Reuters editors)"
    ]
}