{
    "articleURL": "/wires/reuters/article-12048969/Iga-Swiatek-Aryna-Sabalenka-win-set-two-Madrid-final.html",
    "content": [
        "The top two women's players in the world will engage in a showdown in the finals of the Mutua Madrid Open on Saturday.",
        "Second-seeded Aryna Sabalenka of Belarus rolled to a 6-4, 6-1 victory over No. 9 Maria Sakkari of Greece, while top-seeded Iga Swiatek of Poland trounced No. 12 Veronika Kudermetova of Russia 6-1, 6-1, in their respective semifinal matches on Thursday.The one-two matchup will be the second in two weeks. Swiatek defeated Sabalenka 6-3, 6-4 in the title match of the Porsche Tennis Grand Prix in Stuttgart, Germany on April 23.That victory gave Swiatek a 5-2 edge in the head-to-head meetings, including a 3-0 mark on clay.\"I really want this revenge,\" Sabalenka said. \"It would be really great to be able to defeat a player like Iga on clay.\"In Stuttgart, I was rushing on the short balls, I tried too hard for the winning shot.\"Sabalenka looked sharp in disposing of Sakkari in the semis. She converted 70.7 percent of her first-serve points and saved 5 of 6 break points.She was especially strong in the second set, winning the final five games to close out the match.\"I think it was actually my best match of the tournament,\" Sabalenka said. \"I started really well. Then Maria came back. But mentally I was staying really strong. I knew that she's going to fight for every point. It didn't, didn't destroy me that she came back. I was still playing, I was still fighting for every point.",
        "\"Yeah, I'm super happy with the level that I played, and especially with my mental game, I would say. I'm more happy with my mental game.\"Swiatek had little trouble with Kudermetova as she converted 70.8 percent of her first-serve points and saved all five break points.Swiatek finished in style by prevailing in the last six games.Both players will be looking for their third title of the year.--Field Level Media"
    ]
}