{
    "articleURL": "/news/article-12045111/Democrats-storm-Ron-DeSantis-Florida-office-state-passes-expansion-Dont-Say-Gay-law.html",
    "content": [
        "Protests were over the expansion of the state's so-called 'Don't Say Gay' lawThe 14 arrested were charged with misdemeanor trespass and booked into jail Many protesters were screaming 'Where is Ron!' and demanded a meeting Over a dozen liberal activists were arrested Wednesday night while protesting in Governor Ron DeSantis' Florida Capitol Office over the expansion of the state's so-called 'Don't Say Gay' law.",
        "The 14 people arrested were charged with misdemeanor trespass and were booked into the Leon County Jail, Florida Department of Law Enforcement spokeswoman Gretl Plessinger told the Tallahassee Democrat.'Once the building closes, unless you have an office in the Capitol, you're not allowed to be here,' Plessinger said, citing Department of Management Services policy.Many of the protesters were heard screaming 'Where is Ron!' over DeSantis' trip to London this past week as the legislature passes key pieces of his agenda. The demonstrators said they refused to leave until they had a meeting with the governor. The protest was organized by a human rights group called the Dream Defenders. ",
        "'Florida is on fire, and he's gallivanting around the country and around the world while the legislators under his boot are passing really harmful legislation,' said Nailah Summers-Polite, co-executive director of Dream Defenders. 'DeSantis likes to meet with his donors, the people who voted with him, his little pals, but he seems not to want to face the people who don't actually like him,' she added. 'If he won't face us, he shouldn't be the governor.' The arrests were made by the Florida Capitol Police and Florida Highway Patrol, Plessinger said. The protest from left-wingers is a reaction to a number of controversial bills have been passed and signed into law this legislative session, which ends Friday. ",
        "They include an abortion ban, illegal immigration restrictions and legislation targeting drags shows, the LGBTQ community and diversity, equity and inclusion initiatives.DeSantis scored another massive win for his conservative agenda Wednesday when the Florida Republican supermajority passed an expansion of his so-called 'don't say gay' law to cover all public school students Kindergarten through 8th grade.The newly expanded Parental Rights in Education bill was sent to DeSantis' desk Wednesday afternoon for his signature after it passed the legislature by a 27-21 vote.It follows the Florida State Board of Education voting last month to ban the topic of sexual orientation and sexual identity in all public schools for all grades up through graduating high school.",
        "The Florida governor is expected to make a bid for president in coming weeks and has made education and fighting leftist 'woke-ism' a cornerstone of his agenda.DeSantis' education-related law originally passed last year and restricted the instruction of sexual orientation and gender identity in grades Kindergarten through 3rd. But DeSantis and other hard-liner Republicans in the Florida legislature didn't think the law went far enough.Critics have dubbed the bill the 'don't say gay' law, claiming that it could hurt gay and transgender students by keeping the discussions off limits in public school classrooms. ",
        "Additionally, the new law also makes the process easier for parents to make sure books they feel are inappropriate are taken off their childrens' bookshelves.Any person can challenge a book for any reason within their county. Once a challenge is levied, the book in question must be pulled from the shelves during the review process, which could take weeks or months.Not only does the new law expand the current range of the ban from capping out at third graders to now including middle schoolers, it also restricts teachers from addressing students by the pronouns that don't align with the gender in which they were born.While there is more flexibility with high schoolers, teachers and instructors for these grade levels are restricted to only discussing these topics in a manner that is 'age appropriate or developmentally appropriate' for their students.'This bill promotes parental rights, transparency, and state standards in Florida schools. It requires that lessons for Florida's students are age-appropriate, focused on education, and free from sexualization and indoctrination,' Republican Florida State Rep. Adam Anderson previously stated regarding the impending law.",
        "The original version of the Parental Rights in Education law signed last March sparked DeSantis' war with Walt Disney Co. after the CEO-at-the-time spoke out against the measure.",
        "Since then, DeSantis has taken several moves to strip, what he calls, the 'corporate kingdom' of special privileges and tax-exemptions it was awarded with the development of the Reedy Creek Improvement District in 1967.Republicans said the bill is intended to shield children from sexualized content and reinforce that teachers should conform to existing state curriculums.'You see society coming at our children in a culture war that has an agenda to make them confused,' Republican Sen. Erin Grall said. 'We are depriving children of the ability to figure out who they are when we push an agenda, a sexualized agenda, down onto children.'Separately, Republicans in the House gave final passage to a DeSantis priority bill that bans colleges from using state or federal funding for diversity, equity and inclusion programs.",
        "Such initiatives, sometimes referred to as DEI, have come under increasing criticism from Republicans who argue the programs are racially divisive.Republican lawmakers in at least a dozen states have proposed more than 30 bills this year targeting diversity, equity and inclusion efforts in higher education, an Associated Press analysis found using the bill-tracking software Plural.'They want rote belief in the same thing. They say they want inclusion, but they don´t unless you believe what they believe,' said Rep. Randy Fine, a Republican. 'These programs are being used all over the country. Imagine how great our universities will be when we are the only ones who are not.'",
        "The House also approved a proposal to ban people from entering bathrooms that do not correspond to their sex, a bill aimed at transgender bathroom use.DeSantis is expected to formally announce his presidential candidacy after the end of the legislative session. He has spent significant time in recent months traveling to battleground states and elsewhere to promote his conservative agenda and trumpet his policies on race, gender and education.In the statehouse, Democrats, who have no power to stop the Republican legislation, have increasingly begun to vent over the rightward shift in policy emanating from the GOP.'The message that resonates from this chamber over the last few years is one of hate and exclusion and punishment,' said Democratic Sen. Jason Pizzo. 'There is very little grace and very little compassion.'"
    ]
}