{
    "articleURL": "/tvshowbiz/article-12050383/Jackie-O-Henderson-decided-crash-radio-star-Kyle-Sandilands-honeymoon.html",
    "content": [
        "Jackie 'O' Henderson has decided to crash Kyle Sandilands' and his new wife Tegan Kynaston's honeymoon to the South of France.",
        "The KIIS FM host appeared to get jealous on her radio show with Kyle that she won't be escaping to Europe soon, so she invited herself along for their post-wedding celebration. 'I'm coming on his honeymoon. Why not? I have never been to the south of France before,' Jackie O said on Friday morning's show.  Kyle then said that Jackie will be a 'third wheel' on their romantic honeymoon to France. The 51-year-old tied the knot with his wife Tegan, 37, last weekend in a $1million ceremony at the heritage-listed Swifts mansion in Sydney's Darling Point. ",
        "Aussie celebrities in attendance at the wedding included NSW Premier Chris Minns, Today host Karl Stefanovic, and 'King of the Cross' John Ibrahim, among others. Kyle moved his wedding guests to tears on Saturday as he shared a sweet tribute to his new wife. The radio star gave a touching speech in front of 130 guests at Swifts - a late-Victorian Gothic Revival property with a $60million price tag - during the reception.Photos of the private ceremony obtained exclusively by Daily Mail Australia show the shock jock proudly standing arm-in-arm with the blushing bride after the newlyweds took their vows. ",
        "As the guests sat down to a three-course dinner at the reception that followed, the 51-year-old took the microphone to tell his bride: 'Baby – we've done it.' ",
        "'I always thought that the love I was looking for and that I wanted was a delusion and wasn't achievable,' Sandilands said in his speech.'You've changed my life and made me a better man. I love you, baby.'Kyle added that watching Tegan become a mother to their son Otto 'made him fall in love with her all over again'."
    ]
}