{
    "articleURL": "/wires/aap/article-12045381/Appeal-launched-anti-protester-mining-lease.html",
    "content": [
        "An environmental group has launched fresh legal action over a mining lease in Tasmania it argues was granted to exclude protesters.",
        "The state's Supreme Court in April dismissed the Bob Brown Foundation's application for a review of the lease granted to Chinese-owned miner MMG in 2022.The lease, granted by the state government, covers an eight kilometre access road to the site of a proposed new waste dam at the company's mine near Rosebery in Tasmania's west.The foundation has campaigned against the waste dam, which the company argues is necessary for the mine's longevity.The foundation on Thursday said it would appeal the April decision to the full bench of the Supreme Court.\"We will take this appeal to ensure the right of the public to enter their land and hold mining corporations that seek to destroy that land to account,\" campaigner Scott Jordan said.He said the lease's approval was \"inconsistent with the allowable purposes\" in the Mineral Resources Development Act 1995.\"It opens the way for a minister to award public land to any miner who wants to hide their secrets and environmental destruction from public view and scrutiny,\" he said.Justice Alan Blow in April ruled it was open for then-state resources minister Guy Barnett to grant the lease, which gives MMG the power to upgrade the road and clear land.He said it was also open for Mr Barnett to conclude protest activity was likely to impact MMG's use of the road and to take that possibility into account when deciding whether to grant the lease.",
        "\"Members of the public have a right to protest. However the minister was not obliged to prefer the interests of protesters to those of MMG,\" Justice Blow wrote.The final call on whether to approve the tailings dam is in the hands of federal Environment Minister Tanya Plibersek.Preparatory work for the proposed dam was put on hold last year following a decision by the Federal Court."
    ]
}