{
    "articleURL": "/sport/nba/article-12061029/NBA-Bronny-James-right-choice-picking-USC-claims-Skip-Bayless.html",
    "content": [
        "Bronny James had interest from other colleges, such as Memphis and Ohio StateThe 18-year-old will be staying put in Los Angeles, where his father also hoops DailyMail.com provides all the latest international sports news Skip Bayless admitted that Bronny James has made the 'perfect decision' to commit to USC after taking a long-time to reflect where to play college basketball next year, despite interest from several universities across the U.S.",
        "On Monday's episode of 'Undisputed', the long-time sports columnist, commentator, and TV personality said: '[Bronny] made the right [decision],' before addressing his on-air co-host and three-time Super Bowl champion, Shannon Sharpe. 'I told you from moment one that we discussed this. This made all the sense in the world unless he wanted to do G-League Ignite, go to New Zealand or Australia or something. 'But this works, because obviously dad wants to watch him play as much as possible in person. Their arena is 10 minutes from dad's arena. Seriously, it's like 10 minutes away. He just gets on the edge of downtown Los Angeles. Okay? What's not to love about that?'And once they got Isaiah Collier and they got two returning stars... this team is now loaded. And it has national championship potential now that Bronny's part of it, so why would he... I know LeBron loves Ohio State because he grew up obviously in Akron loving Ohio State in both football and basketball. But why? ",
        "'Why would Bronny wanna go play in the cold weather for a year when you can stay in Los Angeles where your dad can actually drive five minutes to see you. I don't know how their schedule work ...but it just works. It's perfect, it's beautiful. ",
        "'So the only thing that just stuns me is a year ago, I wasn't sure he was a top college prospect because nobody rated very high... and this year he averaged 14 points a game. He didn't put up a lottery pick kind of high school numbers and now he's been projected as a lottery pick.'James, a six-foo-three combo guard, picked to stay near home over interest from several other top programs, including official offers from Memphis, Oregon State and Ohio State. His father revealed his pride of son being the first of his family to ever attend college after the Lakers took Game 3 against the Golden State Warriors in the second round of the Western Conference playoffs.",
        "A five-star prospect according to On3, James is also a composite five star per calculations from 247, though the later service ranks him a four star in their own evaluation. Regardless, he ranks among the top 30 players in the country in most every service.On3, which also ranks prospects according to NIL value, puts the Sierra Canyon School (Chatsworth, California) product as the most valuable high school athlete in the country with an estimated valuation of $7.4 million.His recent March performance in the McDonald's All-American game may have improved his stock even further, as he scored 15 points on a game-high five 3-pointers.",
        "Also in March, an NBA scout raved about James to On3, saying, 'Bronny won't get drafted because he's LeBron's kid. He'll get drafted because he's an NBA player.'"
    ]
}