{
    "articleURL": "/wires/ap/article-12042097/Brazil-police-search-Bolsonaros-home-seize-phone.html",
    "content": [
        "BRASILIA, Brazil (AP) - Brazil´s Federal Police searched former President Jair Bolsonaro´s home and seized his phone Wednesday in what they said was an investigation into alleged falsification of COVID-19 vaccine cards. Several other locations also were searched and a half dozen people faced arrest, police said.",
        "The former president confirmed the search of his residence while speaking with reporters, as did his wife, Michelle, on her Instagram account.A police official, who spoke on condition of anonymity because the person wasn´t authorized to speak publicly, said Bolsonaro would be questioned at Federal Police headquarters and confirmed that one of his closest allies, Mauro Cid, was arrested.Asked about the search of Bolsonaro´s home, the Federal Police´s press office provided a statement saying officers were carrying out 16 searches and six arrests in Rio de Janeiro related to the introduction of fraudulent data related to the COVID-19 vaccine into the nation's health system. The statement didn't name Bolsonaro or Cid.Local media reported that the vaccine cards of Bolsonaro, his advisers and his family members were altered. The police statement said the investigation focused on cards altered in order to comply with U.S. vaccine requirements to enter the country.\"There was no adulteration on my part, it didn´t happen,\" Bolsonaro told reporters after the search. \"I didn´t take the vaccine, period. I never denied that.\"",
        "In an interview for Jovem Pan television, Bolsonaro said his vaccination records were not required for any of his trips to the U.S.\"The way heads of state are treated is different than for the common citizen. Everything is arranged ahead of time, and in my travels to the United States, I was not at any time required to have a vaccination card,\" Bolsonaro said.",
        "Bolsonaro visited the U.S. at least three times after it began generally requiring in November 2021 that non-citizens be fully vaccinated to enter. He went in June 2022 for the Summit of the Americas, September 2022 for the U.N. General Assembly and last December after he left office for a stay in Florida.The investigation raises questions about whether falsified vaccine information might have been included in documentation for any members of the former president's entourage during those trips.During the pandemic, Bolsonaro spent months sowing doubt about the efficacy of the vaccine and defiantly refusing to get a shot. In September 2021, that had prompted doubt about whether he would be able to attend the U.N.´s General Assembly in New York, though he did attend.The search adds to Bolsonaro's mounting legal headaches. Federal Police have questioned him at their Brasilia headquarters twice in the past month related to separate investigations - first, about three sets of diamond jewlery he received from Saudi Arabia and, second, regarding his potential role in sparking the Jan. 8 uprising by his supporters in the capital.Bolsonaro is also the subject of several investigations by Brazil´s electoral court into his actions during the presidential election campaign, particularly his unsubstantiated claims that the nation's electronic voting system is susceptible to fraud. Those threaten to strip him of his political rights and render him unable to run for office in upcoming elections.",
        "Separately, Bolsonaro and his allies are also facing a sprawling Supreme Court-led investigation regarding the spread of alleged falsehoods and disinformation in Brazil, and a federal police investigation for the alleged genocide of the Indigenous Yanomami people in the Amazon rainforest by encouraging illegal miners to invade their territory and thereby endangering their lives.The former president has denied any wrongdoing in all of the various cases under investigation.The police statement said that the insertion of false COVID-19 data occurred between November 2021 and December 2022, and enabled the people whose vaccine cards were altered to comply with the U.S. vaccine requirement to enter the country.Bolsonaro´s former press adviser and lawyer Fabio Wajngarten confirmed to reporters at the Federal Police headquarters in Brasilia that military police officer and Bolsonaro´s adviser Max Guilherme was arrested and had already given his statement to investigators.Cid, an army lieutenant colonel who has been Bolsonaro's right-hand man, reportedly had not yet talked with investigators.Cid reportedly is a key figure in the scandal over jewels given to Bolsonaro. The former president is accused of either failing to declare the jewels as official gifts to the Brazilian presidency or trying to bring them into the country as private gifts without paying required taxes.One of the sets was seized at Sao Paulo airport, and reports have said Cid tried to intervene with authorities there in efforts to retrieve them on Bolsonaro´s behalf.",
        "The investigation into the coronavirus documents involves alterations related to \"ideological agendas\" and meant to \"sustain the discourse aimed at attacking the vaccine against COVID-19,\" the police statement said.For months, Bolsonaro insisted that the anti-malarial hydroxychloroquine was a treatment for COVID-19, despite a lack of robust medical evidence. At one point, he warned Brazilians that there would be no legal recourse against Pfizer for anyone suffering irreversiable side effects. He also linked the vaccine to AIDS - an assertion rejected by doctors and scientists - prompting a justice of Brazil´s top court to order his comments be investigated.Brazil's pandemic death toll was the second-highest in the world, though it ranks about 20th in per capita deaths. A congressional investigation determined Bolsonaro should be indicted for bungling the nation's COVID-19 response, including his support for unproven treatments.Bolsonaro recently returned to Brazil after several months outside Orlando, where he mostly kept a low profile aside from a few speaking engagements. Over the weekend, as he seeks to reclaim his position of influence in Brazil, he traveled to the interior of Sao Paulo state and appeared at a huge agriculture show.___Biller reported from Rio de Janeiro."
    ]
}