{
    "articleURL": "/tvshowbiz/article-12038965/Emmerdale-fans-baffled-Mary-refuses-call-police-ATTACKED-conwoman-Faye.html",
    "content": [
        "Emmerdale fans have questioned why Mary Goskirk refused to call the police after being attacked and scammed by conwoman Faye in Tuesday's episode.",
        "After initially refusing to listen to Suzy Merton's concerns about Faye, a lovestruck Mary was left devastated when she finally learned the shocking truth about her girlfriend.As she questioned Faye about the charity money and her insistence that the cash was transferred to her own account, the penny finally dropped for Mary while Faye then sinisterly revealed her true colours.A scuffle ensued between the two women, resulting in Mary (Louise Jameson) being knocked unconscious by Faye (Jane Gurnett), who then fled with her money and camera.But after being treated by a paramedic, Mary told that she didn't want the police involved, leaving viewers at home to question her actions as they called for the 'smile to be wiped off' Faye's face.",
        "Taking to Twitter to air their thoughts, several Emmerdale fans expressed their desire for Faye to be caught, with many urging Mary to get the law involved. 'Get the police as well!!! Get after miss dodgy before she gets too far away!!!!' commented one.While another tweeted: 'No police! Mary, you need to protect other vulnerable people from scammer Faye.''Why wouldn’t you call the police, I’d be raging and want her put in jail…' questioned a third watcher.'oh come on not even calling the police. I suppose it'll be Mary's gonna pay back everyone that donated money. Doesn't really work that way' fumed a fourth.",
        "A fifth person ranted: 'Call the bloody bank and the police and try and get the money back ffs!!!!!!'With another adding: 'Gonna be soooo grrrrrr!!!! If they don't tell the police and report miss dodgy con woman!!!! Need that smug looked wiped off her face asap!!!!! 'Don't let her just walk off all smug and get away with it just to later target another innocent victim!!!!!!!'",
        "Mary was found unconscious on the floor my Rhona's ex-husband Gus, who proceeded to call the ambulance.While being treated for her injuries by a paramedic, Mary recalled the horrifying incident to a concerned Suzy, who'd called in after spotting the ambulance, prompting the paramedic to ask if they should involve the police.To which Mary insisted: 'No police. It's my fault, it's all my fault!'",
        "Later as her daughter Rhona rushed home after getting a message from Suzy, a gutted Mary broke down as he lamented how silly she'd been.The former journalist sobbed that she feels like 'a joke' and 'vulnerable' as she struggled to comprehend how she fell for all of Faye's lies.It remains to be seen whether Mary will take action and call the police in order to bring Faye to justice.Emmerdale airs weekdays at 7:30pm on ITV1 and ITVX. "
    ]
}