{
    "articleURL": "/tvshowbiz/article-12048549/Pamela-Anderson-swimsuit-lays-shell-new-spin-Birth-Venus.html",
    "content": [
        "Pamela Anderson is continuing to stun fans with her sexy swimsuit photos shared on social media this week to promote her collaboration with Frankies Bikinis.",
        "On Thursday the 55-year-old Playboy cover girl was at it again as she was seen by a swimming pool in Malibu.The mother of two - who was last seen in a red string bikini - wore a white once-piece bathing suit that had a large cut out over her midsection. It nicely displayed her toned tummy as she lay on half of a shell.This comes after the California-based designer Francesca Aiello praised the actress turned model.'Pamela f***ing anderson x @frankiesbikinis - I truly can’t even find the words to express my gratitude to all that worked on this project. To know Pam is to love her,' said the beauty.",
        "She then explained she goes far back with Pamela.'We met when i was a kid in our little beach town (where i grew up with her sons), a real full circle moment for the two of us,' she said.'This collection is a reflection of all things Pamela, &amp; all things paradise cove. cannot wait to share more. Shot by the one &amp; only @briannalcapozzi. Styled by the one &amp; only @haleywollens♥️.'She was also seen in  a skimpy white string bikini, also from PXF.The Barb Wire actress was seen in the suit when on the beach at Paradise Cove in Malibu, where she lived for many years with her sons. The Stacked star looked at home as she posed on the sand, flashing her best Sports Illustrated Swimsuit model poses.",
        "'A dream come true,' she wrote in her caption about her collaboration with longtime friend Francesca who owns Frankies Bikinis.",
        "They took months to drum up the swimsuit designs. 'It’s about time - I have been so excited to share this with you - I’m horrible at keeping a secret - Time went so slowly… But today after a long year - I can tell you All my favorite ideas and tricks of the trade - All mixed into my swimwear collaboration with @frankiesbikinis,' she wrote in her caption.'A dream come true - And who better to do this with than the sweetest girl from Paradise Cove (@francescaaiello),' she added.'She grew up before my eyes, with my boys - our story is authentic and unique. Raw, fun &amp; timeless… Available May 4th Early access link in bio ✨,' added the star. She was also seen wearing a hat and veil while in the white suit.And there were several other images of her in a yellow floral print swimsuit as she bathed in a shallow pool with her hair in a braid. The siren made a comeback earlier this year with her memoir Love, Pamela and her tell-all Netflix documentary Pamela: A Love Story.  ",
        "Anderson shocked fans last week when she slipped back into a red one piece swimsuit that looked a lot like her Baywatch one piece.",
        "Turns out it was from her new Pamela X Frankies Bikinis collaboration. The red suit was just perfect for Pam's figure.The blonde bombshell made red swimsuits popular in the 1990s thanks to her hit TV show Baywatch. She played lifeguard CJ Parker on the 1990s action-drama show starring David Hasselhoff.In February she revealed that she has kept one of the famous red garments she wore over the course of five seasons.And the beauty - who has said she doesn't get good residuals from the show - said she likes to slip it on every so often.",
        "'I had a couple back then. Now I only have one and it fits,' shared the mother of two, who is promoting her new memoir and documentary.'I put it on every once in a while,' she told Entertainment Tonight.   The former Playboy model - who has used her celebrity status to front numerous animal rights campaigns over the years - left the series in 1997.",
        "But she returned to the role in 2017 for a cameo appearance in the movie spinoff.However, Anderson admitted she only agreed to take on the part once more after 'a lot of bullying.'The ex of Tommy Lee also shockingly claimed bosses had expected her to do it for free.",
        "She said: 'It was becoming really, really awful. They said they wanted me to do it as a favor. 'I said, \"I do favors for animals, not for Paramount.\" 'There was just so much bullying to do it. They wanted me to do it for free, as an homage or something. I said, \"Come on, guys. I mean, really?\"'Pam reminded fans of her red Baywatch suit when she attended the Los Angeles premiere of her tell-all Netflix documentary Pamela: A Love Story in January.The actress showed off her incredible form and toned arms in a red hot floor-length gown that clung to her famous figure.The beauty was also joined by her sons Brandon Thomas, 26, and Dylan Lee, 25, whom she shares with ex-husband Lee, 60.It was only fitting for the superstar to don red at the event, as she rose to fame playing lifeguard CJ Parker on Baywatch, where she wore an iconic red one-piece swimsuit. The Canadian star wore her blonde tresses in a voluminous updo, with a few strands framing her face.She accessorized the red carpet ensemble with dangling silver earrings."
    ]
}