{
    "articleURL": "/news/article-12048927/Chinese-buyers-return-Australian-real-estate-market-huge-numbers-driving-prices.html",
    "content": [
        "Influx of Chinese driving up property pricesEverything from land to turn-key homesForeign buyer market share highest in yearsA massive influx of cashed-up Chinese buyers have re-emerged to cause chaos in the Australian property market, driving up prices on everything from luxury homes and brand new units to large blocks of land.",
        "Prolonged Covid-19 lockdowns in China were finally lifted late last year, sparking an exodus of those seeking a better life in Australia, where they can buy a family home with four bedrooms or more for the same price as a unit back home in Shanghai.The foreign buyer market share in NSW recently soared to its highest level in eight years of 16.2 per cent during the first quarter of 2023, up from 6.7 per cent in the previous quarter, according to the latest NAB Residential Property Survey.Many more Chinese buyers are heading our way after Singapore last week doubled its property stamp duty surcharge for foreign investors from 30 per to 60 per cent.Suburbs on Sydney's upper north shore have become hot property with Chinese buyers willing to pay up to $400,000 above the price guide.Some are paying with cash they've saved in the three years holed up in lockdown, or only require small loans.",
        "'They've absolutely distorted the local market,' OH Property Group co-founder Henny Stier told Daily Mail Australia.'And it's not just turn-key properties and units off the plan. They're also very keen on large blocks of land where they can knock down and rebuild.'What used to go for $2.5m-$3million on the upper north shore is now selling $4m and over.'",
        "A four-bedroom brick home sitting on a prime location in St Ives recently went under the hammer for $3.67m, $1.43m more for than it last sold in 2017.The new Chinese owners are expected to knock down and rebuild on the sought-after block, described in the sales property description as 'brimming with potential'.'St Ives is a largely non-conservation, non-heritage suburb where the blocks are bigger and you can easily knock down and rebuild, unlike Roseville and Lindfield where a lot of houses can't be knocked down because they're heritage listed,' Ms Stier said.Another Chinese buyer is the proud owner of a newly built six bedroom which sold for $7million in the same suburb, double the price it sold for in 2021.",
        "Ms Stier says it's hard to tell how long the Chinese boom will last.'This influx has come without warning,' she said.'These buyers aren't just going to one area. Once prices go up, they'll move on towards suburbs such as Turramurra, West Pymble, North Turramurra and further afield.'Many new Chinese buyers have established ties in Australia through permanent residency or have family here.'The demand has always been there,' Ray White Upper North Shore agent Jessica Cao told Daily Mail Australia.'Many have lived in China and Hong Kong over the last few years and have decided to move back to Sydney after lockdown restrictions finally lifted.",
        "'Because supply is limited, it's pushed up prices on everything from lots of land to luxury homes.'A four-bedroom house in Roseville Chase was sold at auction for $2.84m in March, almost $400,000 above the price guide to a mature family from China who have spent the last year renting in Sydney. Another Chinese family successfully bid on a four-bedroom family home for $3.79m in Lindfield earlier this month.Less than 2km away in Killara on the same day, a six-bedroom home was sold at auction to $4.52m to an Indian family who recently emigrated from Singapore. It was last sold for $2.788m five years ago.",
        "Juwai IQI co-founder Daniel Ho said Australian real estate is now regarded a 'revenge purchase' for Chinese buyers. Households in China added a combined $US2.6trillion to their bank balances in 2022 alone.'The confidence many Chinese had in their own economy and housing market declined during the pandemic, so overseas markets like Australia look better by comparison,' Mr Ho told the Sydney Morning Herald.  'In China, they talk of 'revenge spending' as people who splurge on all the things they couldn't buy during the lockdowns.'Foreign buyers were bigger players in the Australian housing markets in the first quarter of 2023, accord to the latest NAB Residential Property Survey.",
        "The overall share of foreign buyers in new property markets rose to 7.9 per cent in the first three months to March, up from 5.2 per cent in the previous quarter. In established housing markets, the market share of foreign buyers rose to 3.8 per cent, a one per cent rise from the fourth quarter of 2022.Ms Stier offered some advice for potential buyers being priced out by Chinese buyers.'Steer clear of the markets which are heated and look at areas where they're currently not looking,' she said."
    ]
}