{
    "articleURL": "/wires/reuters/article-12041285/Russian-rouble-shrugs-oil-price-fall-rise-near-one-month-high.html",
    "content": [
        "MOSCOW, May 3 (Reuters) - The Russian rouble climbed near to a one-month high against a globally weaker U.S. dollar on Wednesday, brushing aside a slide in oil prices as traders awaited two government debt auctions.",
        "By 0846 GMT, the rouble was 0.5% stronger against the dollar at 79.20, earlier reaching 78.9025, its strongest point since April 4.The dollar fell ahead of an expected rise in U.S. interest rates and as gloomy jobs data, a standoff over the U.S. debt ceiling and nervousness following banking collapses clouded the investment outlook.The rouble also gained 0.3% to trade at 87.55 versus the euro. It firmed 0.5% against the yuan to 11.44 .Falling exports and recovering imports were among the factors that pushed the rouble to its lowest in around a year in early April.Oil prices rose after OPEC+ announced target production cuts a month ago, something Central Bank Governor Elvira Nabiullina said the rouble would benefit from with a lag.Brent crude oil, a global benchmark for Russia's main export, was down 2.2% at $73.67 a barrel on Wednesday, sliding to its weakest since late March, under pressure from the pessimistic global outlook and upcoming rate hikes.The rouble has strengthened since the central bank held interest rates on Friday, but retained the prospect of future hikes.Higher rates support the rouble by making investment into rouble-denominated assets more attractive.\"Fundamentally, the rouble's position is strengthened by high oil prices recently and the reduced Urals discount to Brent,\" said Alor Broker analyst Alexei Antonov.",
        "\"However, in the worst-case scenario, that is, oil falling below $70, the rouble will not hold.\"At the same time, he said a move to the next resistance level of 77.50 to the dollar was likely.Russian stock indexes were lower.The dollar-denominated RTS index was down 0.1% to 1,018.6 points. The rouble-based MOEX Russian index was 0.8% lower at 2,560.7 points.The finance ministry is due to hold two OFZ treasury bond auctions on Wednesday. (Reporting by Marina Bobrova and Alexander Marrow; editing by Barbara Lewis)"
    ]
}