{
    "articleURL": "/news/article-12038051/Apples-high-yield-savings-account-draws-nearly-1-billion-deposits-four-days.html",
    "content": [
        "Apple's new account drew in nearly $1 billion deposits in its first four daysAccount offers a 4.15 percent yield - more than ten times average savings rate It comes after consumers withdrew nearly $60 billion from three major banks amidst frustration with low rates and fears of a banking collapse Apple's new high-yield savings account drew in nearly $1 billion deposits in its first four days as fed-up savers shun pitiful interest rates offered by mainstream banks.",
        "The tech giant furthered its foray into banking last month when it announced it was launching a savings account with a competitive 4.15 percent annual yield. The deal is more than ten times the average US savings rate, which is currently a paltry 0.39 percent, according to data from the Federal Deposit Insurance Corporation. Two sources have now revealed that the offering drew in nearly $400 million deposits on its first day. And by the end of its launch week, around 240,000 accounts had been opened, one of the sources told Forbes.  ",
        "Apple partnered with Goldman Sachs to create the account which is only available to those who use the firm's credit card, Apple Card. Customers can open an account in less than one minute directly from their iPhone.In practice Apple's competitive rate means users can earn up to 10 times more over the course of a year. For example, if a customer put $1,000 into a savings account which offered the Fed's average yield of 0.39 percent and left it alone, they would earn just $3.90 interest in 12 months.However with the Apple account, they would make $41.50 on their savings - a difference of $37.60. The firm also does not require a minimum balance or deposit - meaning customers can sign up with as little as $1 - and can withdrawn the funds at any time.",
        "Comparatively some mainstream banks limit a saver to making six cash withdrawals a year. This was a rule outlined by the Fed on all savings accounts that was lifted in 2020 - though many firms continue to implement it.It comes after figures showed consumers withdrew $60 billion of deposits out of three major banks in the first three months of the year amidst frustration at low rates. Goldman's own savings account Marcus offers a less impressive 3.9 percent yield. Richard Crone, founder of payments firm Crone Consulting, told Forbes: 'Banks have quickly responded to the Fed's interest rate hikes with higher mortgage and car loan rates, but savers have seen little to no increase in traditional bank deposits or savings accounts.",
        "'There's an outflow to CDs, money market funds, and fintechs like Apple.The issue is compounded by increasing distrust in mainstream banks after First Republic became the third major bank to collapse so far this year. The bulk of First Republic's assets have been acquired by JP Morgan Chase which will protect its $92 billion deposits. Apple joins a host of online savings accounts offering better rates than their bricks-and-mortar alternatives.Analysis by Dailymail.com recently broke down the top ten savings accounts offering rates above 4 percent. It included accounts from UFB Direct, Salem Five Direct and TAB bank which pay interest rates of 4.81 percent, 4.61 percent and 4.4 percent respectively.",
        "These three accounts have no fees, while UFB and TAB have no minimum opening deposit required. Salem requires an opening deposit of $10. A further seven banks which offer APY rates above 4 percent include: Primis Bank, Bread Savings, CIT Bank, Bask Bank, Upgrade, MySavingsDirect and LendingClub.The majority do not demand a minimum opening deposit - though Bread Savings, CIT Bank and LendingClub require $100. Meanwhile Upgrade will only implement APY on savings over $1,000.",
        "To sign up you must have an active Apple Card on your iPhone- On your phone, open your Apple Card through the Wallet app - Click the icon with three dots on the upper right corner- Select Daily Cash- There may also be a promotional button to sign up for the account- Then follow the instructions. It will ask for your Social SecurityOnce signed up Apple will start putting your Daily Cash into the account by default"
    ]
}