{
    "articleURL": "/wires/reuters/article-12052755/Carlos-Alcaraz-face-lucky-loser-Jan-Lennard-Struff-Madrid-final.html",
    "content": [
        "Germany's Jan-Lennard Struff became the first lucky loser to advance to an ATP Masters 1000 final. His reward will be a match against the best young player in the world.",
        "Struff continued his memorable run at the Mutua Madrid Open by defeating Aslan Karatsev of Russia 4-6, 6-3, 6-4 in the semifinals Friday. Struff will face No. 1 seed Carlos Alcaraz of Spain in Sunday's final.Struff's semifinal meeting with Karatsev was an unlikely rematch of their qualifying match last week. Karatsev defeated Struff in the final qualifying round to secure his spot in the main draw, but Struff eventually made it in as a lucky loser.\"I played one final before in Munich (2021) but there was no crowd because of COVID,\" Struff said. \"Now I am here and (there is) an amazing crowd. I think on Sunday it will also be a very good crowd. I am very happy to reach a final and very happy with the win.\"Struff served 15 aces to Karatsev's three. The German also saved 5 of 7 break points and had 37 winners to 22 unforced errors in the two-hour, 19-minute match.Now the 33-year-old Struff will take on Alcaraz, the second-ranked player in the world, in hopes of winning his first ATP title.\"We played an amazing match at Wimbledon last year and I was very close to beating him but he pulled off unbelievable shots in the tiebreak,\" Struff said of Alcaraz. \"This is going to be different. This is in Spain, in Madrid. I think he is 20-0 on Spanish clay courts, so it is going to be very tough. I have to go for it, otherwise I will have no chance.\"",
        "Alcaraz celebrated his 20th birthday Friday by defeating 17th seed Borna Coric of Croatia 6-4, 6-3.Alcaraz played a sound match, scoring 30 winners against just 10 unforced errors. Coric had 22 winners with eight unforced errors, but Alcaraz wouldn't budge, winning eight of his nine service games while breaking Coric four times.Despite Struff's underdog story, Alcaraz is sure to be the crowd favorite Sunday in his homeland. The defending champion won the title in Barcelona two weeks ago and will try to pull off a Spanish double for the second straight year.\"It means a lot to me, playing a final again here in Madrid,\" Alcaraz said. \"It's such a special place for me and I have great memories since I came here to play (as an) under-12. Of course last year was amazing.\"Turning 20 like that is special, so I will enjoy the final here and of course I will try to make all of Spain happy.\"--Field Level Media"
    ]
}