{
    "articleURL": "/wires/ap/article-12040221/Knicks-Heat-111-105-Eastern-Conference-semi-series.html",
    "content": [
        "Jalen Brunson scored 30 points and keyed the run the New York Knicks needed just in time to get by a Miami Heat team playing without Jimmy Butler, evening the Eastern Conference semifinals at a game apiece with a 111-105 victory Tuesday night.",
        "Julius Randle returned from a sprained left ankle that sidelined him in Game 1 with 25 points, 12 rebounds and eight assists, and RJ Barrett scored 24 points for the No. 5-seeded Knicks. Josh Hart finished with 14 points, 11 rebounds and nine assists.But it was Brunson, who pointed the blame at himself and said he had to be better after going 0 for 7 from 3-point range in the opener, who made the biggest plays in a game the Knicks trailed much of the way.Caleb Martin scored 22 points in place of Butler for the Heat, who host Game 3 on Saturday afternoon. They will hope to have Butler, the leading scorer in the playoffs who sat out after spraining his right ankle late in their 108-101 victory in the opener.LAKERS 117, WARRIORS 112SAN FRANCISCO (AP) - Anthony Davis had 30 points, 23 rebounds, five assists and four blocked shots, LeBron James added 22 points and 11 rebounds dueling with Stephen Curry in their latest postseason showdown, and Los Angeles held off a late flurry by Golden State to win Game 1 in the Western Conference semifinals.",
        "Jordan Poole missed a 3-pointer to tie it with 9.7 seconds left as the Warriors´ rally in the closing minutes fell short. Curry´s 3 with 1:38 left tied the game, then D´Angelo Russell answered right back before Davis blocked a shot by Curry moments later. James missed the first of two free throws with 1:05 to go.",
        "Curry scored 27 points, Klay Thompson had 25, and Kevon Looney grabbed a career-high 23 rebounds for his fourth game of this postseason with 20 or more. He also had 10 points and five assists.The defending champion Warriors will try to even the series in Game 2 on Thursday night back on their home floor.___AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP_Sports"
    ]
}