{
    "articleURL": "/sport/boxing/article-12041329/John-Ryder-explains-beat-Canelo-Alvarez-plays-hostile-crowd.html",
    "content": [
        "John Ryder takes on pound-for-pound star Canelo Alvarez in Mexico on SaturdayThe Brit, 34, is looking to become the undisputed super-middleweight championSign up here to watch the fight exclusively on DAZN Some 16 years ago, John Ryder made a promise to his partner, Nancy, one he vows to finally honour on Saturday night in Guadalajara, Mexico. That promise? To become a world champion boxer.  ",
        "'I told her I was going to be world champion,' he told Mail Sport. 'Two kids later – we’re not married yet, that will come – I still need to achieve that dream... She’s stuck with me so far, so she needs to see I wasn’t full of s**t!' On Saturday - or the early hours of Sunday morning, depending on where you're watching from - we'll find out exactly what Ryder is made of, in what representes one of the toughest challenges in boxing: fighting Canelo Alvarez in Mexico on Cinco de Mayo weekend. Indeed, the Echo Arena in Liverpool can be an unforgiving battlefield, as Ryder found out when he was controversially beaten by Callum Smith in his sole world title bid to date. But the circa 50,000 fans set to cram inside the Estadio Akron as Canelo entertains a Mexican crowd for the first time in almost 12 years will create an entirely different atmosphere. Likewise, the prize on offer is worlds apart. Not a world title, but four. And not a win over a domestic rival, but a genuinely legacy-defining, all-time great British win on away soil. Pressure... or so you'd think.   ",
        "'All the pressure is on Canelo,' Ryder, who has a record of 32 wins and five defeats, continued. 'There’s no pressure on me. It’s his first time back home in 12 years. I feel like I’m coming off a career-best year, while he’s potentially coming off a career-worst. ",
        "'I know it’s against a different level of opposition, but he lost to Dmitry Bivol and then gave a lacklustre performance against Gennnady Golovkin. He didn’t look as he should have done. 'A lot of people were expecting him to get Golovkin out of there, but he couldn’t. He’s had surgery on his wrist after that, so we’ll just have to see what he’s got left.'It's true: Canelo was undoubtedly the face of boxing in November 2021 when he beat Caleb Plant to become undisputed super-middlweight champion - a title he still holds. Having reigned as the unified middleweight champion, and after a brief jump to light-heavyweight where he dethroned Sergey Kovalev, Canelo embarked on a year-long mission, defeating titleholders Callum Smith, Billy Joe Saunders and finally Plant to become the first-ever undisputed champion at 168lbs. History. But less than two years later, his reputation has been hit somewhat. Losing emphatically to Dmitry Bivol back up at light-heavyweight was not part of the plan. And, in truth, a points win over a 40-year-old Gennady Golovkin wasn't quite the statement he wanted to make. Oleksandr Usyk, Noaya Inoue and Terence Crawford now arguably sit higher in the pound-for-pound standings. At the same time, Ryder has continued to put together a stunning run of wins, claiming victories over Daniel Jacobs and Zach Parker and making plenty of noise while doing so. As mandatory challenger Ryder says: 'I deserve to be in this position and I’ve earned my shot over and over and over. I’m going to take what’s rightfully mine.'",
        "But this isn't Ryder looking to strike while the iron's hot. The 34-year-old has wanted a fight with Canelo for years - and he still wants to face the best version of Canelo. 'If Canelo knocked out Bivol and then Golovkin, I’d still want this fight,' he said. ",
        "'Whether people are thinking he’s on the decline or not, I want the biggest and best fights. I think we all expected Canelo to go in there and blast Golovkin out. 'We know Golovkin's getting on a bit now. He’s been a formidable force for years, and he’s still got that concussive punch power, but I think we all expected Canelo to put on a real show and put that one to bed. We didn’t get that, and then obviously it came out about the surgery on his wrist. 'I’m hoping that he’s had the surgery and he’s back to his best, because I want to fight the best version of Canelo. I’m going to be the best version of myself on May 6, so I hope he is. I want to beat Canelo at his best.'As the fight's strapline 'the King is coming home' alludes to, Canelo's return to Mexico is a big deal for his country. Their press conference on Wednesday was as much a celebration of the Mexican as an opportunity for the two fighters to come face-to-face. ",
        "Ryder was met with polite applause, Canelo a hero's welcome. The crowd won't be so friendly towards the challenger on Saturday night, though, but the Brit assures they won't be able to help Canelo in the ring.'It’s going to be huge,' Ryder explained. 'It will be intimidating at times, but I’ve just got to block that out, channel my energy into that ring. It’s just me and him in there.'They can be as loud as they want out in the stands, but ultimately it’s me and him hitting each other. They can’t help him that much.'",
        "If Ryder is to be successful, the immediate question is: what's next? The 34-year-old insists fame and fortune has not crossed his mind - but, as an Arsenal fan, he already knows where he wants the rematch.  'For me now, it’s fight by fight,' Ryder said. 'Beat Canelo, I’m sure we’ll get the rematch at the Emirates or Las Vegas and we’ll go from there.'I want to hold on to these titles for a while, and that starts on May 6.'Obviously Cassius Clay (Muhammad Ali) fought Henry Cooper at the old Arsenal stadium, so for me to be the first headline event at the new stadium would be a dream come true for sure.'",
        "WOW HYDRATE’s sugar-free, low calorie and great tasting hydration range of collagen protein and electrolyte waters have supported John Ryder to be the best. For more visit wowhydrate.com "
    ]
}