{
    "articleURL": "/sport/football/article-12061257/Jamie-Carragher-fears-Leicester-suffer-relegation-Premier-League.html",
    "content": [
        "Leicester and Leeds dropped into the relegation zone following a dramatic dayEverton and Nottingham Forest earned crucial wins to boost their survival hopesJamie Carragher believes Leicester lack fighting spirit in the relegation battle Jamie Carragher expects Leicester to be relegated from the Premier League with the pundit backing Everton and Nottingham Forest for survival if they earn another win from their final three matches.",
        "Leicester dropped into the relegation zone on Monday after suffering a heavy 5-3 defeat at Fulham, before Everton earned a stunning 5-1 win at European hopefuls Brighton.Nottingham Forest joined the Toffees in climbing out of the bottom three with a thrilling 4-3 win over rock bottom Southampton, who are on the brink of dropping into the Championship.Leeds and Leicester joined Southampton in the bottom three after a dramatic day, with the two strugglers now two points adrift of Everton, who lie 17th.Forest are a further point clear in 16th. ",
        "Speaking on Sky Sports' Monday Night Football, Carragher said the two wins placed huge pressure on Leicester and Leeds heading into their next matches against Liverpool and Newcastle respectively.The former Liverpool defender believes the challenging fixtures for the teams in the relegation battle should mean another victory will keep both Forest and Everton in the top flight. 'I think if Forest and Everton win another game they will be okay. Leicester and Leeds would have to get another five points from three games,' Carragher said.'We are talking about teams in really poor runs. 'Newcastle, Chelsea, Man City and Liverpool next week is a tough one for all of those teams, it really is. If anyone picks up a point there it would be a bonus for them. ",
        "'For Leicester and Leeds they might have to. I almost feel Leeds might have to win [against Newcastle].'Carragher added that he fears for Leicester's hopes of avoiding the drop, citing a lack of fight in their display at Fulham.Leicester, who won the Premier League in 2015-16 season, face daunting matches against Liverpool and Newcastle sides chasing the Champions League. The Foxes then end the season against West Ham.",
        "'Watching Leicester today, that was not a performance of a team fighting for their lives,' Carragher said. 'I really fear for them.'They have Liverpool next and that is a tough game, then Newcastle away and West Ham at home. It might be over by the time they get to West Ham at home.'I am not sure how they get out of that. 'I think Everton have the best fixtures left given where they are, I don’t really see them going down now and for Leicester I don’t really see how they get out of it.'Forest have won two of their last three which is huge for them. They had to win this game [against Southampton]. 'This game on paper was far easier than anything else to come. It gives them a great opportunity now as none of the teams down there are really picking up points.'",
        "Nottingham Forest will travel to Chelsea on Saturday, before ending the season with a home match against Arsenal and an away fixture against Crystal Palace.Everton’s final three matches include home titles against league leaders Man City and Bournemouth, either side of an away match at Wolves.Leeds, who appoint Sam Allardyce for their final four matches of the season, host Newcastle on Saturday.Allardyce’s side will then face West Ham away and Tottenham at home."
    ]
}