{
    "articleURL": "/wires/ap/article-12040003/McIlroy-needed-reset-missing-cut-Masters.html",
    "content": [
        "CHARLOTTE, N.C. (AP) - Rory McIlroy said he needed \"a reset\" after missing the cut at the Masters.",
        "That´s why the world´s third-ranked player didn´t touch his clubs for more than two weeks, went on vacation to Manhattan with his wife, Erica, to celebrate their anniversary, and withdrew from RBC Heritage - a move that may cost him $3 million.\"It was like, I need to reassess the place I am in my life and what is important to me and what I need to focus my energy on,\" McIlroy said Tuesday night in his first comments to reporters in nearly a month.McIlroy is playing this week in the Wells Fargo Championship at Quail Hollow, where he´s a three-time champion.While the Masters proved to be a tipping point, McIlroy said it wasn´t his play that prompted him to take a short break. Instead, he said it was the other stresses that engulfed the PGA Tour over the last year, which he has been highly involved in while serving as a player director for the tour´s policy board.He´s had to deal with a variety of complex and time-consuming issues, including how to best handle the defection of several top players to Saudi-funded LIV Golf.McIlroy, an outspoken opponent of LIV, said it has been a \"tumultuous time\" and, after stepping away, he came to realize that golf had \"totally consumed\" his life.",
        "\"I´ve always thought I´ve had a good handle on the perspective on things and sort of where golf fits within my life, and trying to find purpose outside of golf in some way,\" McIlroy said. \"But I think over the last 12 months, I sort of lost sight of that. I´d lost sight of the fact that there´s more to life than the golf world and this little silly squabble that´s going on between tours, and all sorts of stuff.\"So I think I just gained a little bit of perspective and once I sort of disconnected from it a little bit, I could see things a little clearer and sort of where everything fits within my life. It was a good reset.\"McIlroy arrived at Augusta National nearly a month ago hoping to complete the career Grand Slam by winning his first Masters. He felt supremely confident after shooting 5 under on the second nine during a practice round the day before the tournament.Maybe too confident.\"I honestly thought I was gonna have the best Masters I´ve ever had,\" said McIlroy, the runner-up at Augusta in 2022.Instead, McIlroy shot 72-77, missing the cut by three strokes. He didn't speak to reporters afterward because a rainstorm forced postponement of the second round and all interviews.",
        "\"It sucked,\" McIlroy said of missing the cut.He withdrew from the RBC Heritage the following week, a decision that may cost him $3 million of the $12 million he was to earn as part of the PGA Tour´s Player Impact Program bonus.McIlroy drew criticism for pulling out because he was one of those who helped establish the rule that top players could only miss one of the PGA Tour's new designated events. Hilton Head was his second absence.McIlroy said he hasn't heard if PGA Tour Commissioner Jay Monahan plans to withhold the final $3 million from his PIP bonus.\"Look, I have my reasons to not play Hilton Head and I´ve expressed those to Jay,\" McIlroy said. \"And whether he thinks that that´s enough to warrant ...\"I mean, I understood the consequences of that decision before I made it. So whatever happens, happens,\" he added.McIlroy made it clear he doesn´t regret the decision.The 33-year-old McIlroy is hoping to regain his form this week at Quail Hollow, where he was won three times, most recently in 2021. He's finished in the top 10 nine times in 11 Wells Fargo Championships - including last year at TPC Potomac in Maryland - and still holds the tournament's all-time scoring record, finishing at 21-under 267 in 2015, winning by seven strokes.",
        "Quail Hollow has special meaning for the Northern Irishman. It´s where got the first of his 23 career PGA Tour victories in 2010.\"Rory has been a great ambassador for our tournament, and he always brings another level of excitement to the competition when he plays,\" tournament director Gary Sobba said.McIlroy is the highest-ranked player in the field. Top-ranked Jon Rahm and No. 2 Scottie Scheffler are both skipping a designated event for the first time this year.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}