{
    "articleURL": "/travel/article-12042923/A-posh-Paris-hotel-experience-without-haughty-service-Inside-Royal-Monceau-Raffles-Paris.html",
    "content": [
        "Ted Thornhill checks into 'palace-rated' Le Royal Monceau Raffles Paris on Avenue Hoche Past guests include Walt Disney, King Farouk of Egypt, Madonna, Robert de Niro, Lou Reed and Sofia CoppolaREAD MORE: Inside the most remote hotel in mainland Britain - Scotland's enchanting Garvault House Philippe Starck is one of the most prolific designers in the world, creating everything from staplers to wind turbines and from furniture to superyachts, such as Steve Jobs' Venus and the jaw-dropping Motor Yacht A.",
        "Luckily for visitors to the French capital, the talented Frenchman also found time to squeeze in a few hotel restorations, including a two-year transformation of 'palace-rated' hotel Le Royal Monceau Raffles Paris, producing a veritable work of art.It's not just eye-opening to behold, I discover. This property, which has a most elegant facade, pampers and soothes with a stunning spa and opulent bedrooms - and offers top-level taste-bud tickling thanks to stellar restaurants.Throw in faultless service - no Parisian haughtiness here - and a winning location on Avenue Hoche near the Arc de Triomphe, and you have a hotel that can practically do no wrong.There's a fascinating history behind the property, too.",
        "After it opened in 1928 it became a rendezvous spot of choice for artists and intellectuals, with guests that included singer and actor Maurice Chevalier and American novelist Ernest Hemingway.After the Second World War, Ho Chi Minh spent seven weeks at the property during the Fontainebleau Conference, which was to determine the future of Franco-Vietnamese relations. Then, in May 1948, David Ben Gourion and Golda Meir signed the birth certificate of the State of Israel on its premises.Prestigious guests came, returned and met up: Novelist Joseph Kessel, Walt Disney, the Maharajahs of Indore and Kashmir, King Farouk of Egypt, the Aga Khan. In their footsteps would later come Madonna, Robert de Niro, Lou Reed and Sofia Coppola.",
        "One lure for Hollywood types is the hotel's swanky 99-seat cinema, described as 'the best private movie theatre in Europe' by Gilles Jacob, former chairman of the Cannes film festival.",
        "Following in the footsteps of the rich and famous in April 2023 is me, my partner and our excitable five-year-old daughter.We're housed in a £2,300-per-night, 64-square-metre (689-sq-ft) junior suite, which I find mildly mind-blowing. It positively oozes luxurious glamour.At this point, it would be traditional to point out the room's 'piece de resistance'. But the stand-out features are spinning around in my mind like items on a gameshow wheel – two giant 42-inch TVs hidden in mirrors... spin, spin... a magnificent king-sized bed with goose-down bedding and a wrap-around headboard studded with handy power sockets... spin, spin... the eclectic furniture including a modish chaise-longue and beautiful Art Deco lamp... the spins slow... and coming to a rest at the top is the like-no-other bathroom, accessed through huge sliding wooden doors in the living room area.It's a dazzling jewel-like space with two mirrored walls on which hang huge mirrors with reflective frames. The free-standing shelving units are entirely reflective, too. (The floor, fortunately, remains opaque.)A beautiful white standalone tub and twin rectangular white sinks dissipate the energy, while a rainfall shower at the end is pure joy. We love the Clarins toiletries, too.",
        "Honestly, I could live out the rest of my days in this suite. Or perhaps make that 'this hotel'.The ethereal dreamscape of a subterranean spa spellbinds in equal measure. Billed as a 'white paradise' (white is the unmistakable theme), the piece de resistance is easier to pinpoint here – the otherworldly 23-metre pool, bathed in natural light thanks to multiple skylights, bookended at either end by white curtains, and featuring a huge mirror wall (on the remote off-chance that you missed your reflection in the bedroom bathroom).There's also a 35C Turkish bath to loll in and luxurious (white) sofas to recline on landside.",
        "The hotel dazzles on the ground floor too.Here there's a very chic bar, the Michelin-starred Il Carpaccio Italian restaurant (closed during our visit), and Matsuhisa Paris, by world-renowned chef Nobu Matsuhisa, where we enjoy a seven-course sushi-themed extravaganza in a stunning setting – a pillared room with vast metallic lampshades hanging over the tables on the sides.Breakfast is served in the same room, and is highly impressive, with a buffet stuffed with exquisite croissants and pain au chocolat, and buoyant, on-point waiting staff delivering morning newspapers to the table, a choice of salted and unsalted butter, perfect eggs with soldiers and great coffee served in mirrored coffee cups by Philippe Starck and porcelain-maker Raynaud that are decorated with bright red lips.",
        "A pleasingly whimsical touch in a hotel that never fails to please. Time to find out what Philippe Starck has done to the humble stapler...",
        "Ted is hosted by Le Royal Monceau Raffles Paris, where rooms cost from £1,141 ($1,443/1,307 euros). PROS: Faultless service, glamorous rooms, top-end food offering, good location, fascinating history, eye-catching design touches.CONS: Hotels of this calibre don't really do them, though some might argue that there are other top-tier Parisian hotels in slightly better locations.Rating out of five: ***** Eurostar: The best way to reach Paris from London is via Eurostar's high-speed train services. Eurostar operates 14 trains a day from London St Pancras to Paris Gare Du Nord. One-way fares start from £39 (based on a return journey) and the fastest London to Paris journey time is 2hr 15 minutes. Travelling on Eurostar produces 90 per cent less CO2 than flying. Visit www.eurostar.com.Prices correct at time of writing. "
    ]
}