{
    "articleURL": "/wires/reuters/article-12046459/2023-Kentucky-Derby-One-mans-plan-playing-superfecta.html",
    "content": [
        "A majority of Kentucky Derby bettors, particularly the casual players, seek out the horse they believe will win.",
        "America's most famous horse race can be seen in a different light by regular and experienced bettors. They're shooting for a big score, often with big risk.There are plenty of exotic wagers offered on the race run on Saturday at Churchill Downs. One of the more popular multi-horse wagers is the superfecta, in which horseplayers must come up with the top four finishers.Naturally, the more horses included on the superfecta wager, the higher the cost. It's up to the individual bettor to determine how much of their bankroll they are willing to chance.Making the task more daunting is that this year's field doesn't have a standout. Yes, there's a favorite. But a reasonable case can be made for nearly half the entrants.The trifectas (top three horses) and superfectas should pay generously, even if there isn't another giant upset like last year, when Rich Strike won at 80-1 odds.The simplest approach would be to identify four horses and \"box\" them, which means a betting ticket includes -- and pays -- scenarios for any of the four horses to finish 1-2-3-4.In that scenario, the superfecta box would cost $2.40 for a dime; $24 for $1; and $48 for $2.We've whittled down a potential top four (with program number and morning line odds) to Verifying (No. 2, 15-1); Practical Move (No. 10, 10-1); Angel of Empire (No. 14, 8-1); and Derma Sotogake (No. 17, 10-1).",
        "Thus, the bettor would box the numbers 2, 10, 14 and 17.Of course, that leaves no margin for error and becomes a type of parlay bet. In single-game sports betting, this would be akin to betting on the Braves to win, Ronald Acuna to have at least two hits, Spencer Strider to have eight-plus strikeouts and the opposing team to score under 3.5 runs. If any of those portions of the parlay fail to hit, the bet is a loser.Another, more expensive, method for the Derby would be take a wider approach with the fourth slot. The horses added in the fourth position would include No. 3 Two Phils (12-1); No. 5 Tapit Trice (5-1); No. 8 Mage (15-1); No. 9 Skinner (20-1); No. 15 Forte (3-1); and No. 22 Mandarin Hero. The latter is an also-eligible who needs two scratches to draw into the field.In that instance, the ticket would look like this: 2-10-14-17/2-10-14-17/2-10-14-17/2-3-5-8-9-10-14-15-17-22. That 4 x 4 x 4 x 10 ticket would cost $16.80 for a dime; $168 for $1; and $336 for $2.A more focused approach is to identify one of the contenders to finish first or second. In our case, that would be Derma Sotogake.We could then put together two tickets that looks like this: 17/2-10-14/2-10-14/2-3-5-8-9-10-14-15-22 and 2-10-14/17/2-10-14/2-3-5-8-9-10-14-15-22. That 1 x 3 x 3 x 9 and 3 x 1 x 3 x 9 approach would each cost $4.20 for a dime; $42 for $1; and $84 for $2.",
        "Our hypothetical selections are mainly based on the pace being moderate, which would help the frontrunners and hinder the closers. What if the pace is unexpectedly fast? We could key Angel of Empire, the only closer in our top four, with longshots Mage and Skinner.We could construct two tickets that look like this: 14/8-9/2-10-8-9-17/2-3-5-8-9-10-15-17-22 and 8-9/14/2-10-8-9-17/2-3-5-8-9-10-15-17-22.Those 1 x 2 x 5 x 9 and 2 x 1 x 5 x 9 tickets would each cost $5.60 for a dime; $56 for $1; and $112 for $2.Once again, the amount wagered on the superfecta has to be determined by the individual. The more spreading you can do, the better your chances of having a memorable and potentially extremely profitable day.--Field Level Media"
    ]
}