{
    "articleURL": "/debate/article-12057439/DOMINIC-LAWSON-Starmers-unconvincing-adoration-King-Charles-exposes-double-standards.html",
    "content": [
        "According to Sir Keir Starmer, it is impossible for Rishi Sunak to understand the everyday problems of British families, and for one reason only: his great wealth.The phrase the Labour leader uses, week in, week out, at Prime Minister's Questions, is 'out of touch'. Invariably he links this to Rishi Sunak's extremely comfortable domestic arrangements.For example, last Wednesday, Starmer, declaring that 'each week he reinforces just how out of touch he is', cited an alleged extra £9,000 that an average family will need to save to finance a home loan as a result of recent mortgage rate increases, and then told the Commons: 'Or to put that in a way that the Prime Minister will understand, roughly the annual bill to heat his swimming pool.'This form of attack is cutting through for Labour.The Mail on Sunday's Dan Hodges tweeted, in the wake of the dreadful results for the Tories in the council elections: 'Labour shifted strategy to paint Rishi as \"out of touch\". And it worked. Came up again and again from people I spoke to this week. Perfectly nice. Might be a reasonably capable PM. But \"he just doesn't get what we are going through\".'",
        "Yet in the same week, Keir Starmer has been eulogising as someone completely in touch with the 'new Britain' a man far wealthier than Rishi Sunak. I speak, obviously, of King Charles III.In an article pegged to the stupendously gold-encrusted Coronation, Starmer declared: 'Throughout his life, he has used his position to drive forward progress … he has long been a voice for a fairer, more tolerant society … with him on the throne, Britain is not just in safe hands — but hands that will help to forge a forward-looking, confident country.'This is a long way from the former republican Keir Starmer, who told an interviewer: 'I got made a Queen's Counsel, which is odd, as I often used to propose the abolition of the monarchy.'In the 2020 Labour leadership election, Starmer, at a hustings of party members, showed he had moved on from that position. When asked if he would 'abolish the monarchy', he replied: 'No, I wouldn't.' But he added: 'I think I'd downsize it.' Quite how, he didn't specify.On Labour's Left there is distinct disenchantment with their leader's new-found uncritical adoration for the pinnacle of hereditary status.At the last Labour Party conference, Sir Keir insisted that the event opened with a singing of the National Anthem, as a great 'signifier of how the party has changed'. Members who were suspected of being prepared to disrupt this had their passes cancelled.",
        "This is all of a piece with Starmer's overall electoral strategy.The Labour leader is totally focused on winning back those seats formerly thought of as Labour's Red Wall: ones that could be described as imbued with old-fashioned, working-class values — values which embrace a fierce patriotism and respect for the institution of the monarchy. These were the voters who probably had little dispute with Jeremy Corbyn's economic agenda, but were repelled by his evident contempt for British traditions — for example by licensing the waving of Palestinian flags, rather than Union Jacks, at the party conference.As one of Starmer's critics in his own North London patch put it, witheringly, in the Camden New Journal, the Labour leader wants the party to become the 'royalist party of the working class'. And, at the same time, to paint Rishi Sunak as a man completely out of touch with that same section of the electorate.But you don't have to be a republican to note that the monarchy has unique fiscal privileges (for example on inheritance tax), as set out by the Guardian newspaper leading up to the Coronation.It produced an investigation which purported to show that King Charles was worth 'at least £1.8 billion'.Its author observed: 'The immediate political question flowing from the King's wealth is obvious. If the family is this rich, why are the multi-million-pound payments from the hereditary estates not taken into consideration when setting their annual stipend? Alternatively, if the estates are genuinely private assets, why don't they pay corporation tax?'",
        "Starmer will run a mile from this argument. But he will also, time after time in the Commons, refer to the 'non-dom' tax status claimed by Rishi Sunak's Indian wife, Akshata Murty. Even misleadingly.A fortnight ago, Starmer declared: 'He refuses to scrap the status that benefits him and his family.'It is true that Sunak isn't scrapping the non-dom tax status, but his wife no longer uses her right not to pay tax here on her overseas earnings (just as the monarch now pays income tax, even though not obliged to under law).Another fact is that Sunak was born to a modest family, his father being a GP and his mother a pharmacist. And while Akshata Murty is thought to be worth about £700 million through her shares in the technology company founded by her father, Narayana, he began that business with seed capital of just $250: she was brought up in what was a middle-class home.This inherent contradiction in Starmer's approach — King Charles's great tax-free inherited wealth and palaces, no problem; the Sunaks' wealth from sheer hard work and innovation, a real issue — can be accepted by many voters because they hold the Prime Minister responsible for their circumstances, while the Royal Family, to use Churchill's phrase, 'has the pomp without the power'.Above all, when 'ordinary' voters are suffering from a real loss in living standards, because of high inflation, it is an issue if the Prime Minister is perceived not to understand what that feels like.On the other hand, I suspect his wealth has only become an issue because of what has become known as 'the cost-of-living crisis'. A corollary might be that if the rate of inflation comes down significantly (as Sunak has pledged), then this will be less of a problem for the PM.I discussed this with someone who has for years been conducting political focus groups and polls. His analysis is worth quoting.'While people talk about Sunak's wealth, this is a by-product of general irritation with the Conservative Party — whose mistakes have made them poorer. Sunak's wealth isn't driving his polling numbers one way or the other, and people will mention it less as the economy improves.'As such, while it might be fun for Starmer to go all out on this, it's essentially irrelevant. But it's also risky for Starmer. To most voters, both Sunak and Starmer are rich and posh.'I don't see Starmer easing up on this form of attack on Sunak's personal circumstances, however. He can see that it makes the Conservative benches uncomfortable at Prime Minister's Questions, and raises the morale of his own side in the chamber.And, precisely because Starmer has been disowning his own previous 'Corbynite' positions across the board — last week's scrapping of his 'pledge' to ditch university tuition fees was just the latest such betrayal of his Labour leadership-winning manifesto — it is almost the only thing that he has left to pander to the wealth-hatred that animates Labour's Left wing.Not that they have much time for Sir Keir, now. And I suspect his near idolatrous paeans of praise for King Charles and the Royal Family will have been enough to make them reach for the bottle (to throw in his direction).The more interesting question is whether the 'working-class royalists' will now see Starmer as reflecting their values. Somehow I doubt it: his attempt to appear, for want of a better phrase, socially conservative is desperately unconvincing.Or, as that polling and focus group expert put it to me: 'However furious they are with the Tories, they think Starmer is basically useless, and emphatically not a serious person or a proper leader. They think he just criticises, and offers nothing meaningful.'Perhaps Sir Keir Starmer might want to turn to King Charles III for some advice on how to rectify this. After all, he thinks the monarch is a man in touch with the masses."
    ]
}