{
    "articleURL": "/sport/football/article-12045737/Gary-Neville-SLAMS-Todd-Boehly-creating-MESS-Chelsea-urges-stop-meddling.html",
    "content": [
        "Chelsea's season sank to new depths after Tuesday night's 3-1 loss to ArsenalFormer United defender Neville described Chelsea's performance as 'disgusting'The Sky Sports pundit was also deeply critical of the Blues' co-owner BoehlyGary Neville has slammed Todd Boehly for creating a 'mess' at Chelsea as he urged the American to 'stop meddling' with football matters.",
        "Chelsea's season sank to new depths in Tuesday's 3-1 loss to Arsenal - their sixth defeat in a row under Frank Lampard - and they are currently 12th in the Premier League table.Since taking over at Stamford Bridge, Boehly has overseen expenditure on players of more than £600million, which has been spent in just two transfer windows.Former Manchester United defender Neville described Chelsea's performance at the Emirates as 'disgusting' on the Gary Neville Podcast.The Sky Sports pundit was also deeply critical of how the Blues' co-owner Boehly has taken on major football decisions himself.",
        "'It was the best team on paper I've ever seen play as badly as that. It was a shambles in the first half,' Neville, said. 'Pathetic.'There were World Cup winners, internationals, so expensive - I can't believe it. Frank Lampard will be thinking the same. They were as bad as I've seen. 'When you interpret a manager's language on television you can times that by 100 on what they were saying in the dressing room.'With the quality and pride these players have you can't stoop to that level. They played really well against Liverpool and I thought there was promise. 'Yes, they haven't got a centre forward or can score goals but they played well. But what we've seen since is nothing short of a disgrace.'",
        "He continued: 'It all comes from the top. It's been chaotic, a mess since day one. Boehly has had a nightmare and misread this league. I'm sure he'll learn quickly. 'What has happened this season is purely down to him. He needed to keep the footballing department together. He's the non-footballing department. 'You're the owner. You're not a player or a coach. You've got no experience in this league so stay where you are and allow the people to run the football club [who have done so] successfully over the last 10 years.'Try and get a year out of them to learn the ropes and keep the stability and consistency of Chelsea. 'Petr Cech left, Marina Granovskaia left, Thomas Tuchel was gone after a few games and all of a sudden you're in complete turmoil. ",
        "'Then they flipped it to a model giving players eight-year contracts to 22-year-olds!'When you start sacking groundsmen, physios, sports scientists, directors, managers, then you are throwing everyone under a bus saying, \"it's their fault not mine\". 'Chelsea had a successful way of running the club. This is now what Boehly has created. 'He created this mess. Like playing football manager, it's been terrible.'Despite Chelsea's troubles this season, Neville also believes they have the potential to finish in the top three next year.",
        "'I do think someone will mould them into a decent team and challenge for top four and trophies,' said Neville. 'I think they are capable of challenging the top three.' "
    ]
}