{
    "articleURL": "/wires/reuters/article-12038231/U-S-temporarily-send-1-500-troops-Mexico-border-source.html",
    "content": [
        "By Idrees Ali and Ted Hesson",
        "WASHINGTON, May 2 (Reuters) - President Joe Biden's administration will temporarily send 1,500 additional troops to help secure the U.S.-Mexico border, the Pentagon said on Tuesday, in preparation for a possible rise in illegal immigration when COVID-19 border restrictions lift later this month.The 90-day deployment of active-duty troops will supplement the work of the U.S. Border Patrol but not carry out law enforcement duties, Pentagon spokesperson Brigadier General Pat Ryder said in a statement. They will conduct ground-based monitoring, data entry and warehouse support to free up border agents and \"fill critical capability gaps,\" Ryder said.The force will be in addition to an ongoing deployment of about 2,500 National Guard troops.The so-called Title 42 restrictions, set to end on May 11, allow U.S. authorities to rapidly expel non-Mexican migrants to Mexico without the chance to seek asylum.Biden, a Democrat running for reelection in 2024, has grappled with record numbers of migrants caught illegally crossing the U.S.-Mexico border since he took office in 2021.Republicans have criticized Biden for rolling back the hardline policies of Republican former President Donald Trump, the front-runner for his party's nomination. Some Democrats and immigration activists also have lambasted Biden for gradually toughening his approach to border security.Senator Bob Menendez, a Democrat and chair of the Senate Foreign Relations Committee, said Biden's decision to send troops was unacceptable.",
        "\"Trying to score political points or intimidate migrants by sending the military to the border caters to the Republican Party´s xenophobic attacks on our asylum system,\" Menendez said in a statement.The 1,500 troops could arrive at the U.S.-Mexico border by May 10, Ryder said during a briefing. The Pentagon is looking at ways to replace the active-duty personnel with those from the reserve force, he said.Mexican President Andres Manuel Lopez Obrador, when asked about the troop deployment in a news conference, said the U.S. is a sovereign nation and that Mexico respects its decisions.U.S. military troops have been used to help secure the border during previous presidential administrations, including Republican George W. Bush, Democrat Barack Obama and Trump, who deployed thousands of active-duty and National Guard troops.White House press secretary Karine Jean-Pierre called such deployments \"a common practice.\"Pentagon leaders have long been frustrated about military deployments to the border, privately arguing that the mundane tasks are better suited for law enforcement agencies and can affect military readiness.Immigration advocates have criticized previous efforts to send troops to the border.\"People seeking asylum should be met with humanitarian professionals, welcoming volunteers, and medical and mental health professionals. Not soldiers,\" tweeted Bilal Askaryar, interim campaign manager of the #WelcomeWithDignity Campaign. (Reporting by Idrees Ali and Ted Hesson; Additional by Phil Stewart, Jasper Ward and Andrea Shalal in Washington and the Mexico City Newsroom; Editing by Mark Porter, Richard Chang and Jonathan Oatis)"
    ]
}