{
    "articleURL": "/tvshowbiz/article-12052837/The-Block-Dylan-Jenny-sell-home-180-000-reserve.html",
    "content": [
        "The house renovated by the Block's Dylan and Jenny Adams has sold for $3.9million - $180,000 less than its reserve, reports the Sydney Morning Herald. ",
        "Purchased in February by an unknown buyer, the price was originally withheld on the five-bedroom, three-bathroom home.Located in Gisborne, in rural Victoria, the sprawling pad failed to find a buyer during The Block's auction day last November, when it was listed for $4.08million.Fans were left devastated for Dylan, 29, and Jenny, 25, when the gorgeous cottage was passed in on a final bid of $4,075,000.Channel Nine announced last February that the home had been bought through private treaty.",
        "A network spokesperson confirmed the house went to a family 'in what is a positive outcome for everyone', but did not disclose a sale price.Property highlights include a stunning light-filled open plan design, vaulted ceilings, and stunning views of the surrounding countryside.Other features include a double-sided gas fireplace, gourmet stone kitchen and a covered out door entertainment deck. There's also a heated in-ground pool, mud room, woodfired hot tub and fire pit.Dylan and jenny also installed a 50kw solar farm with battery storage and generator in their renovation. There's also geothermal climate control, and under floor heating in each of the bathrooms.Meanwhile, tanks provide 250,000 litres of water storage. It comes after Dylan and Jenny, who were engaged for two years before finally tying the knot in March.",
        "The couple exchanged vows at the InterContinental Sanctuary Cove Resort on the Gold Coast.The opulent ceremony was attended by 150 guests including their former co-stars Ankur Dogra and Sharon Johal, Rachel and Ryan Carr, and Tom Calleja and Sarah-Jane Wilson. 'The best day of our lives,' the couple wrote alongside their wedding photos on Instagram, along with the date of the ceremony. Photos shared to social media show the guests mingling at the lavish resort where they enjoyed a sit down dinner. "
    ]
}