{
    "articleURL": "/news/article-12055811/Harry-keeps-low-profile-lands-LA-blink-youll-miss-appearance.html",
    "content": [
        "Prince Harry returned to California after a flying visit to the United Kingdom to witness his father, King Charles' coronationImmediately after the ceremony at Westminster Abbey he departed accompanied by a police escort and four outriders and headed for the airportHarry boarded a BA flight bound for Los Angeles, landing just before 6:30pm local time with the intention to make it back in time for Archie's fourth birthdayPrince Harry is back in California after spending just 28 hours and 42 minutes in the United Kingdom to witness his father, King Charles' coronation on Saturday.",
        "Following the ceremony, he slipped out of Westminster Abbey - accompanied by a Metropolitan police escort and four outriders - with only the briefest of goodbyes and headed straight for Heathrow Airport.He was back on the plane to California before his father and stepmother, the newly crowned queen, had even finished having their official portraits taken. Harry's British Airways flight from Heathrow direct to Los Angeles landed just before 6:30pm local time. The idea was that he would be back in time for his four-year-old son Archie's fourth birthday party.",
        "But despite getting a chauffeured ride from the airport in a black Range Rover SUV, it is doubtful he would have been back with his wife and children much before the kids bedtime. Montecito, California, where the family live is almost 100 miles away from Los Angeles and a good two hour drive even at the best of times given the unpredictability of LA traffic.  For months, he had kept the British public - not to mention his own family - on tenterhooks with a cat and mouse guessing game over his attendance.And in the end, it was truly a blink or you’ll miss it moment.At the main event he was obscured by Princess Anne’s feathered plume from the cameras for most of the ceremony.",
        "After it was all over, he headed straight for the airport and was pictured smiling broadly as he arrived at Heathrow's Windsor suite before his flight, still in morning suit and sporting his medals.",
        "Harry, 38, had not been expected to play any part in the coronation celebrations apart from his brief appearance at Westminster Abbey.Sources tell the Daily Mail that there were no plans for him to join the procession, take part in the private family lunch or even appear in any of the official or unofficial photographs.The prince was not seen once after it was said he flew in on a scheduled American Airlines flight to Heathrow on Friday morning while the rest of the family were undertaking multiple 'Eve of Coronation' duties in London.On Saturday morning, he left Frogmore Cottage, the Windsor home he and Meghan once shared, almost certainly for the last time after his father’s decision to evict them, just before 9.30am in a BMW with blacked-out windows.He entered Westminster Abbey alongside his non-working royal cousins - Zara Tindall, Princess Beatrice and Princess Eugenie.Lurking at the back of the group, Harry could be seen chatting to Beatrice and her husband, Edo Mapelli Mozzi.",
        "Eugenie and her husband, Jack Brooksbank, probably now the closest family members to Harry, turned round with big smiles.",
        "Like the other non-working royals, Harry dressed in a morning suit with medals and the KCVO - Knight Commander of the Royal Victorian Order - given to him by Queen Elizabeth round his neck.But he was forced to make his way, somewhat awkwardly, down the Nave in the full view of the congregation on his own.The prince turned twice, once to his right and then to his left and smiled at someone he recognized.But he quietly took his seat three rows from the front in the South Lantern.The front row was reserved for the Prince of Wales - his brother, wife and their children, as well as the Duke and Duchess of Edinburgh. As the historic ceremony drew to a close, Harry left through the Great West Door and, with the same police outriders accompanying him, headed back straight to Heathrow.11 hours and 5,440 miles later, and a world away from the celebrations in London, he was back in the Golden State, ready to resume his 'California dreamin'' once more.  "
    ]
}