{
    "articleURL": "/wires/pa/article-12041919/Dissident-journalist-seized-plane-jailed-eight-years-Belarus.html",
    "content": [
        "A court in Belarus has convicted a dissident journalist who was removed from a commercial plane that was forced to land in the country.",
        "Raman Pratasevich stood trial on charges of organising unrest and plotting to seize power.The court sentenced him to eight years in prison on Wednesday.Pratasevich and his Russian girlfriend Sofia Sapega were arrested in May 2021 when their Ryanair flight from Greece to Lithuania was ordered to land in the capital of Belarus, Minsk.Belarusian authorities said there was a bomb threat but later said no explosives were found on board.The incident elicited outrage in Western countries, with officials condemning it as tantamount to hijacking.Pratasevich ran a Telegram messaging app channel that was widely used by participants in mass protests against the disputed August 2020 election that gave authoritarian Belarusian President Alexander Lukashenko a sixth term in office.The channel, Nexta, is one of the most well-known opposition outlets. Together with its sister channel, Nexta Live, it has 1.4 million followers.The founder of the Telegram channel, Stsiapan Putsila, and another editor of the channel, Yan Rudzik, were sentenced in absentia to 20 and 19 years in prison respectfully. Both remain in exile.After the arrest, Pratasevich went on Belarusian state television several times to confess, denounce the opposition and apologise to Mr Lukashenko – appearances that critics said were made under duress.Both Pratasevich and his girlfriend, Sapega, were later released from custody and put under house arrest.",
        "In May 2022, Sapega was convicted and sentenced to six years in prison. Three days later, a message on a Telegram channel billed as belonging to Pratasevich sought to distance him from Sapega – saying they had separated long before and that he was married to someone else.The Associated Press could not independently verify whether the post was freely written by Pratasevich or any of the claims it contained.Sapega, in the meantime, petitioned Belarusian authorities to extradite her to her home country, Russia, to serve out the remainder of her sentence. The Belarusian government agreed. It was not immediately clear when that might happen.Belarus’ opposition leader in exile, Sviatlana Tsikhanouskaya, called the sentences to Pratasevich, Putsila and Rudzik “disregard for justice” on the part of “the Belarus regime”, which conducted “a fake trial”.Ms Tsikhanouskaya said in a tweet that Pratasevich has “been the regime’s hostage since the Ryanair (plane) hijacking”."
    ]
}