{
    "articleURL": "/femail/article-12042025/Why-did-Meghan-Markle-Prince-Harry-son-Archie-Harrison-Mountbatten-Windsor.html",
    "content": [
        "Prince Archie was born on 6 May 2019 at the Portland Hospital in LondonRead more: The sweet reason Kate and Prince William chose the name Louis for their second son For all the latest Royal news, pictures and video click here This year, Prince Archie shared his fourth birthday with one of the most important royal events in living memory.",
        "As the world watched the Coronation of King Charles III at Westminster Abbey, the Duchess of Sussex remained at home in California to celebrate the young royal's birthday on May 6 with little sister, Lilibet.And it is thought that the Duke, his father, managed to catch a bit of Archie's big day after jetting back to California directly after the conclusion of his own father's Coronation. Harry and Meghan's first child had arrived at the Portland Hospital in London in 2019.",
        "But royal observers were surprised when, two days later, it was announced that his name would be a decidedly untraditional Archie Harrison Mountbatten-Windsor. Many had expected something more traditional: bookies favoured James, Arthur, and Edward. Archie sat at around 100/1. Archie is the shortened version of Archibald, a traditionally Scottish name which is said to mean 'true, bold and brave'.In their biography of the Sussexes, Finding Freedom, Omid Scobie and Carolyn Durand wrote that the pair wanted a name which was 'something traditional, a name that was powerful even without a title in front of it.''Archie, meaning strength and bravery, fit the bill,' they added.Meanwhile a friend of the couple revealed 'with a laugh': 'They thought about Archibald for all of one second. He was always going to be little Archie.'",
        "Unlike many senior royals, Archie only has one middle name, Harrison, a fitting tribute to the baby's father as it means 'son of Henry' or 'son of Harry'.He was given the hyphenated surname Mountbatten-Windsor, in keeping with a convention established shortly after the Queen's coronation.In 1960, the late Queen and Duke of Edinburgh sought to differentiate their direct descendants from the rest of the House of Windsor.Their Mountbatten name (his family surname) had been a thorny issue. Prince Philip had been keen that their children take Mountbatten and famously exclaimed: 'I am nothing but a bloody amoeba.'I am the only man in the country not allowed to give his name to his own children.'So it was decided the Queen's descendants, other than those with the style of Royal Highness and the title of Prince or Princess would carry the name of Mountbatten-Windsor.In 2020, Harry and Meghan announced their plans to launch charitable foundation Archewell, named in honour of their son.They revealed the Greek word in the project Arche – meaning source of action – was the inspiration behind Archie's name.After his birth, Archie was known as simply Master Archie, unlike Prince William's children, who were able to use the titles Prince and Princess.",
        "King George V limited titles within the family during the First World War. He decreed that only the children of the sons of the monarch - as well as the the eldest living son of the eldest son of the Prince of Wales - could use the title His Royal Highness as well as 'prince' or 'princess'.Under the rules, only Prince William and the Duchess of Cambridge's eldest son Prince George - as a great-grandson of the monarch down the direct line of succession to the throne - was originally entitled to be a prince.",
        "But the Queen stepped in ahead of George's birth in 2013 to issue Letters Patent ensuring all George's siblings - as the children of future monarch William - would have fitting titles.   Archie could not make use of the title during the Queen's lifetime (as he wasn't the grandson of a monarch), but after Charles took over as monarch, Archie and his sister Lilibet automatically became prince and princess (and King Charles chose not to revoke the privilege).The pair were officially recognised as Prince Archie and Princess Lilibet in March - something Harry and Meghan declared was their children's 'birthright'.A spokesman for the couple said: 'The children's titles have been a birthright since their grandfather became monarch. This matter has been settled for some time in alignment with Buckingham Palace.'",
        "Prince Archie is said to have enjoyed a ‘low-key’ fourth birthday party at home on Saturday.Sources close to the Sussexes confirmed Archie had a ‘private celebration’ on his birthday at the couple’s £11 million mansion in Montecito, California, and a lemon cake baked by the Duchess of Sussex using fruit from their garden.‘[Prince Harry] was always determined to get back in time to spend part of Archie’s birthday at home,’ a source said.The Duke of Sussex is believed to have boarded a 3.45pm flight which would have seen him land in Los Angeles at 6.55pm local time.The drive to Montecito from Los Angeles airport takes about 90 minutes. The source said: ‘Harry was determined to be back in time to tuck Archie into bed.’"
    ]
}