{
    "articleURL": "/wires/pa/article-12056725/We-club--Cambridge-boss-eyeing-bright-future-great-escape.html",
    "content": [
        "Cambridge boss Mark Bonner described his side’s remarkable escape from relegation as a “brilliant achievement” and believes the U’s could be looking at a much brighter future.",
        "United had looked destined for League Two as they sat seven points from safety with nine games remaining but they secured survival on a dramatic final day of the season.A 2-0 success over Forest Green for Bonner’s side saw them climb out of the bottom four for the first time since January, with club stalwart Harrison Dunk and leading scorer Sam Smith netting in the first half.News of MK Dons’ failure to win at Burton sparked wild celebrations at the Abbey Stadium, with Cambridge securing a third season in League One.“We’re a club on the up,” said Bonner. “You look at the number of people here; four sides of the stadium full of Cambridge fans. What a day. I was a bit emotional first half.“I said a few weeks back we’re going to need to finish as we started, or even maybe more to make sure that we got across the line. It seemed an improbable task at the time.",
        "“Firstly we had to take it to the last week, then we were trying to take it to the last day, then we needed the football gods to shine on us.“It’s a brilliant achievement for us to do it. Hopefully this gives us a chance of building and making sure that next year’s a stronger one.",
        "“What a way to do it, last day of the season. It’s incredible really. It will be one that sticks in everyone’s mind at the end of a really brutal season.“The season, the longer it went on, became one where we said we’re going to have to have a fight to stay in it. I’m absolutely thrilled that we have for everybody. I’d say it’s well deserved.”Forest Green boss Duncan Ferguson felt weaknesses shown in Sunday’s game summed up his side’s season as they ended the campaign bottom of the table.“We’ve had a problem with set-plays during the season, that did us for the first goal,” he said.“It was an end-of-season game for us, really. Of course they were chasing something, but we were always in the game.“We think we’ve had a genuine shout for a penalty at 2-0 down, so a couple of decisions never went for us, but we lacked a cutting edge.“The final third really has been a problem most of the season. We’ve not scored enough goals and we can’t even defend the set0plays, so that’s a problem.“I’m always gauging the players, always judging them every day in training to see if we’re going to be good enough for League Two, so we’re always assessing.",
        "“It’s been a tough season, probably even since the January before that we’ve struggled to win games. We’ve lacked that real goalscorer who’s going to stick the ball in the net.”"
    ]
}