{
    "articleURL": "/wires/pa/article-12057525/Max-Verstappen-overcomes-hostile-reception-storm-Miami-Grand-Prix-win.html",
    "content": [
        "Max Verstappen overcame the boo brigade and Sergio Perez to win the Miami Grand Prix and extend his world championship lead.",
        "Verstappen was subjected to a chorus of jeers by the 90,000-strong crowd at the Hard Rock Stadium as the sport’s drivers were introduced by rapper LL Cool J for Sunday’s 57-lap race.But the double world champion put his poor reception to one side by racing from ninth on the grid to pass Perez with nine laps remaining and take his third win from five rounds.Verstappen increased his championship lead from six points to 14.Fernando Alonso completed the podium places with George Russell fourth. Lewis Hamilton finished sixth after starting 13th.“I call that simply f****** lovely,” said Verstappen on the radio.“It was a good race, Verstappen added once out of the car. “I stayed out of trouble in the beginning. I had a good battle with Checo and we kept it clean and that was the most important thing. A great win today.“Yesterday was a setback in qualifying but today we kept it calm and clean and winning a race from ninth is always very satisfying.”Perez said: “I gave it my all. The first stint was poor and that compromised my race.“Max was particularly good today so a well-deserved win for him. We need to analyse what happened today because I didn’t have the pace.”",
        "Sunday’s race marked the first of three to be staged in the United States this season, with Austin’s grand prix at the Circuit of the Americas and a debut event on the Las Vegas strip to follow later in the year.And the event here in the Sunshine State was sprinkled with stardust for a show-stopping pre-race grid.Actor Vin Diesel, singer Shakira, influencer-boxer Jake Paul, Serena Williams, Venus Williams and Roger Federer – with 50 tennis Grand Slam titles between them – watched on as will.i.am conducted an orchestra and LL Cool J assumed his role as Master of Ceremonies. Only in America.On came the 20 drivers and the biggest cheers were reserved for Hamilton, Alonso and Perez, backed by a large contingent of Mexican fans. But Verstappen, last on to the stage, was booed.Verstappen, by now in the sanctuary of his flying Red Bull machine, had moved up to eighth at the end of lap one, as pole-sitter Perez held off Alonso on the charge to the opening corner.Verstappen then blasted his way past Charles Leclerc and Kevin Magnussen in his DRS-assisted Red Bull to take sixth at the start of lap four.Further behind, Hamilton appeared in trouble after making light contact with Nico Hulkenberg at the first corner.",
        "“I don’t know if we are going to last in this race,” he said, fearing his front wing was broken.Up front, Verstappen was still on the move.On lap eight he passed Russell under braking at Turn 17 for fifth place, which became fourth the next time round following a carbon-copy move on Pierre Gasly.Verstappen sped past Carlos Sainz on lap 14 at Turn 11 and then Alonso on lap 15 to take second place with team-mate Perez 3.7 sec up the road.In came Perez on lap 20 for fresh rubber with a 1.2 sec lead over Verstappen. The Dutchman, who started on the harder, more durable rubber stayed out.Despite his earlier worries, Hamilton was able to continue but he was failing to make headway and on lap 32 he was ushered aside for team-mate Russell.Hamilton, on a different strategy after starting seven places behind his team-mate, resisted at first before allowing his team-mate through.“Thank you very much,” said Russell over the radio. “Very much appreciated.” Hamilton made his sole tyre stop on lap 37, dropping back to 13th.Russell did not appear fazed in a machine team principal Toto Wolff described as “a nasty piece of work”, and on lap 39 he was up to fourth after fighting his way past Sainz.",
        "“That is how we roll,” said the celebrating Briton.Verstappen finally stopped for new tyres on lap 45 and he emerged from the pits just 1.2 sec behind Perez.Verstappen was soon all over Perez’s Red Bull gearbox and he made his first move at Turn 17 only for his team-mate to defend the left hander.But Perez’s defence made him vulnerable on the main straight with Verstappen jinking to his team-mate’s left and making the move stick at the first corner on lap 48.Verstappen crossed the line 5.3 sec clear of Perez.Hamilton, like Verstappen, started on the more durable hard rubber and the strategy also worked for the seven-time world champion as he made up a number of positions in the closing stages – including the scalp of Leclerc with two laps to run – to salvage sixth."
    ]
}