{
    "articleURL": "/wires/ap/article-12047849/Ex-NBA-star-Shawn-Kemp-pleads-not-guilty-shooting-charge.html",
    "content": [
        "TACOMA, Wash. (AP) - Former NBA star Shawn Kemp pleaded not guilty Thursday to an assault charge after prosecutors accused him of shooting at a man while attempting to retrieve a stolen cell phone.",
        "Kemp was released without bail following the arraignment in Pierce County Superior Court in Washington state.He was arrested after the shooting in a parking lot outside the Tacoma Mall on March 8 and released the following day pending further investigation. No one was injured, and Kemp´s lawyers insisted he returned fire in self defense after tracking and trying to retrieve a cellphone that had been stolen from him earlier that day.However, a probable cause statement by Tacoma police, filed along with first-degree assault charges last month, did not indicate Kemp was shot at. It said some of his statements were not corroborated by surveillance video, and that just 13 minutes before he arrived at the mall, he sent a text message saying, \"I´m about to shoot this (expletive).\"The document said Kemp told police that after being shot at he went back to his own vehicle, parked several spots away, to get his own gun. But the video showed that he was armed with the weapon when he approached the parked Toyota 4Runner where he had tracked his phone.The statement said he fired three times into the Toyota and then threw his gun into some bushes. The driver of the 4Runner appeared to duck one of the shots and eventually drove off, it said. Only about five minutes elapsed from the time Kemp arrived until the time the 4Runner left.",
        "Kemp, who has two licensed cannabis stores in Seattle, was a six-time NBA all-star and played for the Seattle SuperSonics from 1989 to 1997. He also played for Cleveland, Portland and Orlando.Kemp debuted in the NBA during the 1989-90 season as a 20-year-old who had never played college basketball. He became known for his high-flying dunks."
    ]
}