{
    "articleURL": "/wires/ap/article-12045213/Shipping-lobby-group-advises-caution-climate-targets.html",
    "content": [
        "An influential shipping industry group has quietly warned shippers to think carefully before they sign up for a new plan to reduce pollution and eventually eliminate their contribution to climate change.",
        "The International Chamber of Shipping represents four fifths of the world´s commercial fleet, and in 2021 committed to the Paris Agreement´s target to reduce greenhouse gases down to zero by 2050. \"Talk is cheap, action is difficult,\" chairman Esben Poulsson said at the time.But a confidential document obtained by The Associated Press shows the International Chamber of Shipping advised its national branches in March that member companies should \"give careful consideration to the possible implications\" before committing to a new plan to reduce maritime emissions.Under the plan, shipping companies will declare all their vessels with their emissions, inputting them into a new software tool. That includes pollution starting at the oil well all the way to the engines, said Jean-Marc Bonello, a naval architect at UMAS, a for-profit maritime consultancy launched by experts from University College London, who helped design the tool. Shippers will then have to improve efficiency or use cleaner fuel to reduce their emissions 60% by 2036.Shipping accounts for almost 3% of greenhouse gas emissions, according to the International Maritime Organization. A European Parliament report has warned that share could increase dramatically by 2050.The Science Based Targets initiative (SBTi) has drawn up plans tailored to numerous industries including chemicals, oil and gas and aviation. It's a partnership between several nonprofits and the United Nations Global Compact, an initiative launched by the U.N. Secretary General. The maritime SBTi, published last fall, says the shipping industry must cut its emissions 45% by 2030 to keep on track with Paris goals which try to limit total temperature rises to 1.5 degrees Celsius (2.7 degrees Fahrenheit).",
        "Stuart Neil, director of communications for the International Chamber of Shipping, said in a phone interview the group acted after some of its member companies asked how the system would affect their businesses. It wasn´t a case of warning the shipping companies off, he said, pointing to another line in the memo that says the targets are an important initiative. The group was simply concerned about shipping companies signing on without proper analysis. \"It has to be properly thought through,\" he said.One objection of the industry lobby group is that the target would force shippers to count their indirect emissions, including those produced while making marine fuels, and doesn´t take into account that more energy gets used navigating in bad weather.Responding to the claim the group was reluctant to act, Neil said it had put forward various decarbonization proposals of its own. It has suggested a $5 billion research and development fund to accelerate decarbonization, and calling on the International Maritime Organization to up its net-zero-by-2050 ambitions.But some marine climate advocates are incensed.John Maggs, shipping policy director at Seas At Risk and president of the Clean Shipping Coalition, said by email that the SBTi plan was the \"absolute minimum\" to keep warming below 1.5 degrees.\"Without immediate action and deep cuts before 2030, the task becomes almost impossible without significant industry disruption.\"",
        "The group has \"always been the least ambitious, lowest common denominator ship industry actor,\" Maggs said, \"and the thought that they might actually have to do something significant soon horrifies them.\"A target thirty years in the future is not sufficient, Maggs warned, something echoed by scientists and international agencies. Targets for 2030 and 2040 are necessary. He said more research and development is not needed, because technology and knowledge to clean up shipping already exists.For example, a 10% reduction in speed would lead to a 27% decline in emissions, he said. Hybrid ships that run on a combination of wind power and marine fuels could also dramatically cut emissions. Ships retrofitted with sails might save 10-30% in emissions, he said, and ships built to be cleaner from the start could save 50-70%. He listed eight vessels under design or in construction that claim such reductions.Michael Prehn is a diplomat for the Solomon Islands, which is urging the International Maritime Organisation to adopt the SBTi targets. The Pacific islands are among the worst affected nations from rising sea levels. Prehn agreed the SBTi targets were the bare minimum to keep global warming to 1.5 C.\"We often hear from various industries they want to do something that is `feasible,´\" he said. \"Usually not feasible just means very expensive.\"",
        "If nothing changes it will result in a climate catastrophe devastating to the lives of Pacific islanders, he warned. \"We´ve already had storms which are much more violent than they used to be. If there´s no transition, we are going to drown, or have to move the population somewhere else.\"Bonello of the maritime consultancy called the lobby group's action shortsighted. He said the evidence shows the plans are realistic and achievable.\"Watering it down is a dangerous strategy,\" he added.But Neil said the science-based targets will definitely have an effect on business operations.\"We do not want companies to sign up to an initiative on a PR basis.\"___Associated Press climate and environmental coverage receives support from several private foundations. See more about AP´s climate initiative here. The AP is solely responsible for all content."
    ]
}