{
    "articleURL": "/tvshowbiz/article-12058367/Pedro-Pascal-gives-emotional-tribute-Bella-Ramsey-gets-choked-praising-young-people.html",
    "content": [
        "Pedro Pascal was a triple threat on Sunday night at the MTV Movie &amp; TV Awards 2023 where his hit show The Last of Us won three major awards.",
        "The 48-year-old star, who plays Joel in the series, delivered a trio of speeches to collect his golden popcorn trophies, and the first award saw him win big for Best Hero. Getting emotional during his remarks, Pascal praised 'young people' as the 'real heroes' and told them that they 'deserve real heroes.''I want to say thank you, MTV Movie &amp; TV Awards,' he began. 'I am a child of MTV, I grew up on MTV. This means the absolute world to me.'I wish we could all be together so I could look into your eyes and tell you that all the young people in the world are my heroes and I wouldn't be here if it weren't for you.' ",
        "The Mandalorian star continiued: 'You deserve a world that serves your interests, you deserve to be healthy, you deserve to be safe, you deserve for your individual rights to be fought for and protected.'Concluding his remarks, Pascal said, 'You deserve real heroes in this world because you are real heroes to me.'The veteran actor's win for Best Hero saw him beat out fellow nominees Diego Luna (Andor), Jenna Ortega (Wednesday), Paul Rudd (Ant-Man &amp; The Wasp: Quantumania), and Tom Cruise (Top Gun: Maverick).Pedro soon returned to the telecast in another pre-recorded video message when The Last of Us won Best Show, beating out Stranger Things, The White Lotus, Wednesday, Wolf Pack, Yellowjackets, and Yellowstone.",
        "'Thank you MTV Movie &amp; TV Awards,' he began. 'I am accepting these golden popcorns on behalf of show creators Craig Mazin, and Neil Druckmann, and our entire amazing cast and crew from the U.S. and from Canada, who worked tirelessly and passionately to make this show. They made it a family experience, one of the best experiences of my life.'The Game of Thrones alum went on to reference the writers strike that has brought Hollywood to a standstill and nearly upended the MTV Awards.  He said: 'We are all thanking HBO and Naughty Dog, and standing in solitary with the WGA, that is fighting very hard for fair wages. We thank you, we love you. I'm going to take these [golden popcorns] to bed with me.'And third time was the charm for Pedro as he returned once more to accept the award for Best Duo, winning with his Last of Us co-star Bella Ramsey.",
        "BEST MOVIEScream VI (WINNER) BEST SHOWThe Last of Us (WINNER) BEST PERFORMANCE IN A MOVIETom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWJenna Ortega — Wednesday (WINNER)MOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER) BEST DUOPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)BEST SONGTaylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)",
        "Gushing about Ramsey in his speech, Pascal said: 'I miss you, I love you, you ARE the duo. We love MTV, and thank you MTV Movie &amp; TV Awards. Thank you to the fans. 'Gosh, it feels like there isn't anything we wouldn't do for you, because of how much you embraced the show. I wish Bella and I were together, but we will be soon, so stay tuned!'Ramsey popped up in their own video message from home, thanking fans for their support.  Bella said: 'Thank you for having us, and for the fans who voted for us, and who love the show and continue to support us and the show, it means the world.'Me and Pedro love each other deeply. I love him, and I can't imagine doing this without him.'Ramsey and Pascal bested fellow nominees Camila Mendes and Maya Hawke for Do Revenge, Jenna Ortega and Voctor Dorobantu for Wednesday, Simona Tabasco and Beatrice Granno for The White Lotus, and Tom Cruise and Miles Teller for Top Gun: Maverick.The pair's win sent social ablaze with widespread praise as fans were effusive in their love for the victorious duo.One viewer trumpeted: 'BELLA AND PEDRO WON BEST DUOOO AHHHHHHH.'",
        "The 2023 MTV Movie &amp; TV Awards was one of the first victims of the ongoing dispute between the Alliance of Motion Picture and Television Producers and the Writers Guild of America union.",
        "Writers are now on strike and picketing studios, leading the host Drew Barrymore to announce that she was dropping out as host last Sunday.But Barrymore was used in a pre-taped skit that parodied her hit film Never Been Kissed and showed her doing the Wednesday dance. The labor action also led the awards show to cancel its red carpet festivities, as many other stars also dropped out to support the strikers. ",
        "BEST MOVIEAvatar: The Way of WaterBlack Panther: Wakanda ForeverElvisNopeScream VI (WINNER)SmileTop Gun: MaverickBEST SHOWStranger ThingsThe Last of Us (WINNER)The White LotusWednesdayWolf PackYellowstoneYellowjacketsBEST PERFORMANCE IN A MOVIEAustin Butler — ElvisFlorence Pugh — Don’t Worry DarlingKeKe Palmer — NopeMichael B. Jordan — Creed IIITom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWAubrey Plaza — The White LotusChristina Ricci — YellowjacketsJenna Ortega — Wednesday (WINNER)Riley Keough — Daisy Jones &amp; The SixSadie Sink — Stranger ThingsSelena Gomez — Only Murders in the BuildingBEST HERODiego Luna — AndorJenna Ortega — WednesdayPaul Rudd — Ant-Man &amp; The Wasp: QuantumaniaPedro Pascal — The Last Of Us (WINNER)Tom Cruise — Top Gun: MaverickBEST VILLAINElizabeth Olsen — Doctor Strange in the Multiverse of Madness (WINNER)Harry Styles — Don’t Worry DarlingJamie Campbell Bower — Stranger ThingsM3GAN — M3GANThe Bear — Cocaine BearBEST KISS Anna Torv + Philip Prajoux — The Last Of UsHarry Styles + David Dawson — My PolicemanMadison Bailey + Rudy Pankow — Outer Banks (WINNER)Riley Keough + Sam Claflin — Daisy Jones &amp; The SixSelena Gomez + Cara Delevingne — Only Murders in the BuildingBEST COMEDIC PERFORMANCEAdam Sandler — Murder Mystery 2 (WINNER)Dylan O’Brien — Not OkayJennifer Coolidge — Shotgun WeddingKeKe Palmer — NopeQuinta Brunson — Abbott ElementaryBREAKTHROUGH PERFORMANCEBad Bunny — Bullet TrainBella Ramsey — The Last Of UsEmma D’Arcy — House of the DragonJoseph Quinn — Stranger Things (WINNER)Rachel Sennott — Bodies Bodies BodiesBEST FIGHTBrad Pitt (Ladybug) vs. Bad Bunny (The Wolf) — Bullet TrainCourteney Cox (Gale Weathers) vs. Ghostface — Scream VI (WINNER)Jamie Campbell Bower (Vecna) vs. Millie Bobby Brown (Eleven) — Stranger ThingsKeanu Reeves (John Wick) vs. Everyone — John Wick 4Escape from Narkina 5 — AndorMOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER)Jesse Tyler Ferguson — Cocaine BearJustin Long — BarbarianRachel Sennott — Bodies Bodies BodiesSosie Bacon — SmileBEST DUOCamila Mendes + Maya Hawke — Do RevengeJenna Ortega + Thing — WednesdayPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)Simona Tabasco + Beatrice Grannò — The White LotusTom Cruise + Miles Teller — Top Gun: MaverickBEST KICK-ASS CASTAnt-Man &amp; The Wasp: QuantumaniaBlack Panther: Wakanda ForeverOuter BanksStranger Things (WINNER)Teen Wolf: The MovieBEST SONGDemi Lovato — Still Alive (Scream VI)Doja Cat — Vegas (Elvis)Lady Gaga — Hold My Hand (Top Gun: Maverick)OneRepublic — I Ain’t Worried (Top Gun: Maverick)Rihanna — Lift Me Up (Black Panther: Wakanda Forever)Taylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST DOCU-REALITY SERIESJersey Shore Family VacationThe Real Housewives of Beverly HillsFamily Reunion: Love &amp; Hip Hop EditionThe Kardashians (WINNER)Vanderpump RulesBEST COMPETITION SERIESAll-Star ShoreBig BrotherRuPaul’s Drag Race: All-Stars (WINNER)The Challenge: USAThe TraitorsBEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)Joel Madden — Ink MasterNick Cannon — The Masked SingerRuPaul — RuPaul’s Drag RaceKelly Clarkson — The Kelly Clarkson ShowBEST REALITY ON-SCREEN TEAM (presented by SONIC®)Mike “The Situation” Sorrentino, Vinny Guadagnino, Pauly D (MVP) — Jersey Shore Family VacationTori Deal and Devin Walker — The Challenge: Ride or DiesRuPaul Charles and Michelle Visage — RuPaul’s Drag RaceAriana Madix, Katie Maloney, Scheana Shay, LaLa Kent — Vanderpump Rules (WINNER)Garcelle Beauvais and Sutton Stracke — The Real Housewives of Beverly HillsBEST MUSIC DOCUMENTARYHalftimeLove, LizzoSelena Gomez: My Mind &amp; Me (WINNER)SherylThe Day the Music Died: The Story of Don McLean’s American PieBEST MUSICAL MOMENT Sofia Carson's Come Back Home from the film Purple Hearts (WINNER) COMEDIC GENIUS AWARDJennifer Coolidge (WINNER)"
    ]
}