{
    "articleURL": "/wires/reuters/article-12055535/William-Byron-edges-teammate-Kyle-Larson-Kansas-pole.html",
    "content": [
        "KANSAS CITY, Kan. -- If William Byron maintains this pace, he's going to earn a nickname as \"Rocket Man\" Ryan Newman did for his qualifying prowess.",
        "With a lap at 179.206 mph (30.133 seconds) on Saturday afternoon at Kansas Speedway, Byron earned the pole position for Sunday's AdventHealth 400 NASCAR Cup Series race at the 1.5-mile intermediate track (3 p.m. ET on FS1, MRN and SiriusXM NASCAR Radio).In an extremely tight final round, Byron edged teammate Kyle Larson (179.134 mph) by .006 seconds to earn the 10th pole of his career in 192 events, which included a stretch during the pandemic when qualifying did not take place.Larson and teammate Chase Elliott (21st in qualifying) are the only Chevrolet drivers to win in the last 12 Cup races at Kansas.The pole was Byron's second of the season and his first at Kansas. Ross Chastain claimed the third starting spot with a lap at 179.134 mph, just .012 seconds behind Byron.\"I had to work on the balance (in practice) to get (the No. 24 Hendrick Motorsports Chevrolet) freer for qualifying, but it seemed like we did that there,\" Byron said. \"So really good through (Turns) 1 and 2 and got a little tight through 3 and 4, so I've got some data to probably study of how I can get through that end.\"But I'm just proud of the effort from the whole team.\"Martin Truex Jr., Monday's winner at Dover Motor Speedway, qualified fourth, followed by Tyler Reddick, who is attempting to extend the two-race Kansas winning streak of the No. 45 23XI Racing Toyota. Kurt Busch and Bubba Wallace won in the car last season at the track on the Kansas side of the Missouri River.",
        "Joey Logano, Ty Gibbs, Denny Hamlin, Daniel Suarez and Ryan Blaney completed the top 10 in qualifying, which included an eclectic mix of four Chevrolets, four Toyotas and two Fords.With hot weather predicted for Sunday, Byron spent the week preparing for the high temperatures on the track.\"Yeah, it's going to be a scorcher, so I'm just trying to stay hydrated,\" said Byron, who has never converted a Cup pole into a victory. \"I did a lot of work throughout the week for that. Yeah, it's going to be tough inside the car, so just got to stay mentally locked in and hopefully have a solid, smooth race, have good pit stops and good restarts.\"Byron said that, as part of his training for the heat, he stayed in the sauna until he couldn't stand it. But some of that heat apparently transferred to his car during Saturday's qualifying session.--By NASCAR NewsWire, Special to Field Level Media"
    ]
}