{
    "articleURL": "/wires/aap/article-12053501/Foran-gets-green-light-Titans-Meninga-pays-visit.html",
    "content": [
        "Gold Coast veteran five-eighth Kieran Foran has been given the all clear to play Parramatta on Sunday in a huge boost to coach Justin Holbrook's side.",
        "Foran was battling a toe injury sustained in last week's win over Manly but the Titans announced on Saturday that he had passed a fitness test and would take his place in the side for the last game of Magic Round at Suncorp Stadium.Holbrook has been forced to play without his first-choice spine for much of the season with No.9 Sam Verrills (collarbone) out of action long term.The Titans are also without fullback AJ Brimson who suffered another hamstring injury last week.Brimson's replacement Jayden Campbell slotted in seamlessly when he came off the bench in a superb 26-10 win over the Sea Eagles, bouncing back from a shocking 28-26 loss to the Dolphins the previous week after leading 26-0.\"The biggest challenge for us is to get up this weekend,\" Holbrook said.\"We were disappointed two weeks ago and got it right (against Manly). That's the team we have got to be again on Sunday. We want to see that consistency in our performance.\"Gold Coast received reinforcement of what high performance is all about when the club's senior advisor Mal Meninga spoke to the group last week.\"He is awesome Mal. It was great to have him in the other day,\" Holbrook said.\"He is such a humble guy but the things he says are so spot on with what he sees and what he expects from us.\"",
        "The Eels are starting to find their groove and put together their best game in attack in a 43-12 win over Newcastle last week.\"You've just got to be on your game all the time,\" Holbrook said.\"We saw what they are capable of last week against Newcastle. If you slacken off in any area they are going to hurt you.\"The Titans are on 10 competition points and the Eels eight, both just outside the top eight.The Parramatta clash is a big one for Titans back-rower David Fifita who has impressed Queensland coach Billy Slater in his quest for a Maroons recall.\"Dave is the one who has worked really hard on all parts of his game,\" Holbrook said.\"I am glad he is getting recognised and hopefully rewarded in a few weeks' time for his contribution to our team. He is doing things better than he has ever done before in the effort areas of the game and I would love to see him back in a Maroons jersey.\""
    ]
}