{
    "articleURL": "/sport/nhl/article-12053285/NHL-PLAYOFF-ROUNDUP-Hurricanes-jump-2-0-lead-Devils-6-1-win.html",
    "content": [
        "The Devils return home to host Game 3 on Sunday, facing another 0-2 holeKotkaniemi scored twice in three minutes as Carolina scored four in the secondDailyMail.com provides all the latest international sports news The New Jersey Devils are back in the familiar position of being down 2-0 in their playoff series with the Carolina Hurricanes after Friday’s 6-1 blowout in Raleigh.",
        "Jesperi Kotkaniemi scored twice in a roughly 2 1/2-minute span during Carolina's four-goal second period and Frederik Andersen stopped 28 shots as the Hurricanes took a commanding lead in their second-round series.Jordan Staal and Martin Necas also scored in that blow-it-open second, which turned a scoreless game between the top two regular-season teams still alive in the playoffs into a romping Hurricanes win with the backing of another rowdy home crowd.It also marked the second straight game the Hurricanes chased Devils netminder Akira Schmid. He lasted only a few minutes into the second period of the 5-1 loss in Game 1, then took a seat after the second with his team down 4-0.Jordan Martinook and Stefan Noesen added clinching goals in the third period to cap another dominant night for Carolina.",
        "Miles Wood scored for the Devils early in the third, but Andersen was strong in his third straight postseason start for Carolina going back to the Round 1 win against the New York Islanders.The Devils return home to host Game 3 on Sunday, facing an 0-2 hole for the second straight best-of-seven series. They lost the first two games at home by 5-1 scores in the first round against the New York Rangers before rallying to advance with Monday's Game 7 clincher.",
        "This time, they've been outscored 11-2 through two games.Kotkaniemi's first goal came when he took pass alone on the right side, then skated in to the dot before firing a shot that went under Schmid's right arm and grazed his ribs before finding the net at the 1:35 mark.Moments later, Martinook - whose activity had him in the mix all night - skated in to tangle up two Devils players in a possession chase near the boards. That helped jar the puck loose to skitter over to Kotkaniemi for the near-post putaway at 3:58.The Hurricanes kept the pressure on. There was Jack Drury chipping the puck in at the blue line for Staal, with the Hurricanes captain extending his 6-foot-4 frame to corral it before going with the forehand-to-backhand finish and the 3-0 lead.",
        "And finally, Martin Necas finished one from the slot after Jaccob Slavin caught the right post on a rush, pushing the margin to 4-0 and only increasing already roaring noise in PNC Arena shortly before the intermission.The Hurricanes dominated the opening period of Game 1, smothering the Devils to take away open ice while tallying more goals (two) than New Jersey had shots (one).The Devils knew they couldn't repeat that effort and said as much Thursday, noting they had to get pucks on the net and use their speed to force Carolina to expend energy defending in its own end instead of rolling with its aggressive forecheck.",
        "New Jersey carried play through the first 10-plus minutes. But by end of this one, Carolina was celebrating a blowout with Martinook's breakaway score against reliever Vitek Vanecek followed closely by Noesen's putaway on a perfect 2-on-1 feed from Sebastian Aho."
    ]
}