{
    "articleURL": "/wires/reuters/article-12054415/Fatigue-not-blame-final-loss-says-Al-Hilal-coach-Diaz.html",
    "content": [
        "By Michael Church",
        "SAITAMA, Japan, May 6 (Reuters) - Al-Hilal coach Ramon Diaz refused to blame his team's packed schedule for their failure to defend the Asian Champions League title as the Saudi Arabian side surrendered the crown to Urawa Red Diamonds on Saturday.The Riyadh-based club were aiming to become the first team to lift the trophy on five occasions but an own goal from Andre Carrillo handed Urawa a 1-0 win in the second leg at Saitama Stadium to seal a 2-1 aggregate victory for the Japanese side.\"This is the scheduling of the games, we can't do anything about it,\" Diaz said. \"The team played very well. They put on a very high level performance and they showed the personality of champions.\"We created chances but we couldn't score any goals. I want to thank the players for the huge effort they did until now.\"The loss came at the end of a hectic season in which Al-Hilal have competed in four competitions and 12 of their players were in Saudi Arabia's squad at last year's World Cup in Qatar.Al-Hilal are fourth in the Saudi Pro League having also reached the final of the Club World Cup in Morocco against Real Madrid in February in addition to playing in the Asian Champions League final.",
        "They are due to face Al Wehda in the King's Cup final next Saturday in Jeddah.\"This is normal when you play for Al Hilal club, this is the only club in Saudi Arabia that competes and plays in all the competitions,\" Diaz said.\"We know we have many players representing the national team and who played in the World Cup, but this is normal.\"We played in the semi-final of the King's Cup (against Al Ittihad) before playing in the final of the Asian Champions League.\"This was a tough game and we've played many tough games in a short time, but this is our destiny we can't do anything about it.\" (Reporting by Michael Church, Editing by Ed Osmond)"
    ]
}