{
    "articleURL": "/wires/afp/article-12055603/What-happens-US-fails-raise-debt-ceiling.html",
    "content": [
        "Time is running short as US policymakers remain at an impasse on lifting the debt ceiling, while the Treasury warns that the country could run out of cash to pay its bills as early as June 1.",
        "With President Joe Biden set to meet Republican House Speaker Kevin McCarthy and other leaders on Tuesday, here is what could happen if Congress does not raise or suspend the debt limit in time:- What happens after June 1? -The United States could run out of funds to meet all its financial obligations by June 1, or in the weeks after then, said Treasury Secretary Janet Yellen.If that happened, it is likely the Treasury would follow the contours of a contingency plan it had in 2011, when the country faced a similar situation, said Wendy Edelberg, senior fellow in economic studies at the Brookings Institution.Under this plan, there would be no default on Treasury securities, and the Treasury would continue to pay interest on those securities as they come due.\"As securities mature, Treasury would pay that principal by auctioning new securities for the same amount,\" thus not increasing the overall stock of debt held by the public, she added.But other payments -- such as to agencies, Social Security beneficiaries, or Medicare providers -- would likely be delayed unless Treasury could meet all such obligations due on a given day.A government shutdown is unlikely, although federal workers' paychecks could be delayed.- Are there further consequences? -",
        "Even without a debt default, such a situation \"would be very disruptive to markets and the economy,\" said economist Nancy Vanden Houten at Oxford Economics.Moody's Analytics economist Bernard Yaros drew parallels to the 2008 financial crisis, when Congress failed to pass a major bailout plan for banks -- the failure sparked a selloff in stock markets that pressured lawmakers.And interest rates would spike, especially Treasury yields and mortgage rates, Yaros told AFP.\"That would lead to higher borrowing costs for consumers, for corporations,\" he said.\"Long-term interest rates would just be permanently higher, especially Treasury yields, because investors would demand compensation for the risk of another future breach,\" he added. In the long haul, the value of the dollar could be lower too.Households or businesses who fail to receive federal payments owed would likely pull back on near-term spending due to their loss of income, while consumer confidence may worsen, hurting the economy, Yaros said.On Wednesday, the Council of Economic Advisers warned that if the US government stops meeting its financial obligations, resulting economic shocks could cause over eight million job losses this summer and around a six percent drop in GDP.- When does a debt default occur? -A country is considered in a payment default when it does not meet its financial obligations such as to another country, or to investors who bought its bonds.",
        "A default is considered partial when a country fails to repay just a portion of its debt, and a government can declare itself in default by announcing it will not repay its debt.A ratings agency can also announce a default, after the end of an automatic 30-day grace period following the payment due date. Or, a private borrower can say publicly that a country has not paid up.While foreign holdings of US federal debt draw the most attention, they only comprise about a quarter of the total.The path towards a potential default will be well-telegraphed, said Yaros of Moody's Analytics.\"They need to do that because if they don't provide any concrete guidance about when the X-date or the default date is, then lawmakers aren't going to feel the pressure to come to a compromise,\" he said.- What happens after a default? -An outright default on Treasury securities would \"very likely result in severe disruption to the Treasury securities market with acute spillovers to other financial markets,\" Edelberg said.It would also impact the cost and availability of credit to households and businesses.\"Those developments could undermine the reputation of the Treasury market as the safest and most liquid in the world,\" she added.For now, it is hard to see how both sides would compromise.",
        "It is possible that lawmakers come to a short-term agreement, connecting this to all the spending bills that have to be passed at the start of the new fiscal year in October, said Vanden Houten."
    ]
}