{
    "articleURL": "/wires/aap/article-12049301/Bennett-debuts-Val-Smith-Dolphins-renaming.html",
    "content": [
        "Wayne Bennett has confirmed 'Val Smith' will make his NRL debut for the Dolphins in the centres against Cronulla after he was \"renamed\" by the mentor.",
        "Bennett was in fine form ahead of what will be his 900th premiership match as coach on Saturday night and was happy to speak at length about Valynce Te Whare, nicknamed 'Val Meninga' by fans after stunning displays for Redcliffe in the Queensland Cup last year.\"I've had to rename him. There is no way you can get that surname out in one mouthful so he is known as Val Smith around here,\" Bennett grinned.That came as a surprise to the journalists interviewing Bennett, who thought he was known as 'Val Meninga'.\"Val Meninga. I like that line,\" Bennett continued.\"I saw that the other day and I thought, 'What are the similarities between him and Mal Meninga?'\"I coached Mal. He is a great player and a great guy. I thought the only similarity was his shorts. I reckon they are both the same size. He is no Mal Meninga, I can tell you that.\"Te Whare comes into the side for the injured Brenko Lee (hamstring). His achievement to play NRL one year after taking up the game is remarkable.\"It is a credit to him. There's been a few bumps along the road,\" Bennett said.Keeping his 108kg frame in check has been a challenge, but Bennett said the 22-year-old had worked hard before he \"lost his way\".",
        "\"He explained that to me pretty well. He said he stopped eating breakfast and put on weight,\" Bennett said.\"That is what I am dealing with. I just looked at him in amazement and said, 'You better go back to eating breakfast'.\"Bennett said Te Whare was \"a bit of a good story\".\"He is one of the first players we signed here. (Recruitment chief) Peter O'Sullivan saw him in New Zealand playing rugby in the schoolboys,\" he said.\"To his credit he has worked really hard and had to make a pretty big adaption from rugby to rugby league. We have invested quite a bit of time in him. It has worked out for both parties.\"Captain Jesse Bromwich sustained a hamstring injury at training so the Dolphins have brought forward Poasa Faamausili into the 17.Bennett, reluctant to talk much about his milestone game, has his \"cousin\" Dwayne Bennett in his sights.Dwayne Bennett is a social media character and an actor who has appeared in advertisements blowing out candles for Bennett's 900th.\"He's got some celebration going on and I am not happy with him. I am not sure if he is related to me or not but I want to meet him,\" Bennett grinned.\"I did meet his sister last week and she was very excited but she couldn't produce him. I said, 'Where is he?' He is blowing candles out now and carrying on. I am not happy.\""
    ]
}