{
    "articleURL": "/news/article-12054903/Ukraine-claims-shot-one-Putins-hypersonic-missiles-using-defence-systems.html",
    "content": [
        "Air Force Commander said missile had been downed earlier in the weekIt is the first known time Ukraine has intercepted one of these missiles Ukraine's air force claimed on Saturday to have downed a Russian hypersonic missile over Kyiv using newly acquired American Patriot defense systems.",
        "Air Force commander Mykola Oleshchuk said in a Telegram post that the Kinzhal-type ballistic missile had been intercepted in an overnight attack on the Ukrainian capital earlier in the week.The Russian military said the air-launched ballistic missile has a range of up to 2,000 kilometers (about 1,250 miles) and flies at 10 times the speed of sound, making it hard to shoot down.It is the first known time Ukraine has been able to intercept one of Russia's most modern missiles.'Yes, we shot down the 'unique' Kinzhal,' Oleshchuk wrote. 'It happened during the night-time attack on May 4 in the skies of the Kyiv region.'",
        "Oleshchuk said the Kh-47 missile was launched by a MiG-31K aircraft from Russian territory and was shot down with a Patriot missile.It is the first time the country is known to have used the Patriot defense systems.The Kinzhal is one of the latest and most advanced Russian weapons. A combination of hypersonic speed and a heavy warhead allows the Kinzhal to destroy heavily fortified targets, like underground bunkers or mountain tunnels.The Ukrainian military has previously admitted lacking assets to intercept the Kinzhals.'They were saying that the Patriot is an outdated American weapon, and Russian weapons are the best in the world,' Air Force spokesman Yurii Ihnat said on Ukraine's Channel 24 television. ",
        "'Well, there is confirmation that it effectively works against even a super-hypersonic missile,' Ihnat said.He said successfully intercepting the Kinzhal was 'a slap in the face for Russia'. ",
        "Ukraine took its first delivery of the Patriot missiles in late April. It has not specified how many of the systems it has or where they have been deployed, but they are known to have been provided by the United States, Germany and the Netherlands.Germany and the US have acknowledged each sending at least one battery and the Netherlands has said it has provided two launchers, although it is not clear how many are currently in operation.Ukrainian troops have received the extensive training needed to be able to effectively locate a target with the systems, lock on with radar, and fire. Each battery requires up to 90 personnel to operate and maintain.Defense Minister Oleksii Reznikov said he first asked for Patriot systems when visiting the US in August 2021, months before Russia's full-scale invasion but seven years after Russia illegally annexed Ukraine's Crimea peninsula.He has described possessing the system as 'a dream' but said he was told in the US at the time that it was impossible.The Patriot was first deployed by the US in the 1980s. The system costs approximately $4 million per missile, and the launchers cost about $10 million each, according to analysts.",
        "At such a cost, it was widely thought that Ukraine would only use the Patriots against Russian aircraft or hypersonic missiles.",
        "In a Telegram post on Saturday, Valerii Zaluzhnyi, the commander-in-chief of Ukraine's Armed Forces, said he had thanked US General Mark Milley, the chairman of the Joint Chiefs of Staff, for the ongoing American aid to Ukraine.Zaluzhnyi said he also briefed Milley 'about the situation at the front and preparations' for Ukraine's counteroffensive against Russia.Ukraine has not said when it might launch the counteroffensive, but it is widely anticipated this spring.In an interview this week with Foreign Affairs magazine, Milley said he would not speculate on if or when it might come, but that with NATO assistance to help train and equip nine brigades' worth of combined arms, armor and mechanised infantry, 'the Ukrainians right now have the capability to attack'. He also said that their capability to defend was 'significantly enhanced from what they were just a year ago'. 'I don't want to suggest that they may or may not conduct an offensive operation in the coming weeks,' he said. 'That'll be up to them. They've got a significant amount of planning and coordination and all of that to do, if they were to do an offensive operation. But they're prepared to do offense or defense.'",
        "In other developments, officials in both Russia and Ukraine said they had carried out another of their regular exchanges of prisoners of war.The Russian Defense Ministry said it brought three military pilots back to Russia, and Ukrainian President Volodymyr Zelensky's chief of staff, Andriy Yermak, said 45 fighters who defended the Azovstal steel mill in Mariupol had been returned to Ukraine.Also on Saturday, Ukraine's Special Operations Forces accused Russia of using phosphorus munitions in its attempt to wrest control of the eastern city of Bakhmut from Ukrainian forces.",
        "Russian troops have been trying to take the city for more than nine months, but Ukrainian forces are still clinging to positions on the western outskirts.On Saturday, the Ukrainska Pravda newspaper quoted military officials as saying that 'the enemy used phosphorus and incendiary ammunition in Bakhmut in an attempt to wipe the city off the face of the earth'. A photo accompanying the newspaper report showed an urban area lit up with fire in several places.The allegations could not be independently verified.Russian forces have not commented on the claim but have rejected previous accusations from Ukraine that they had used phosphorus.International law prohibits the use of white phosphorus or other incendiary weapons - munitions designed to set fire to objects or cause burn injuries - in areas where there could be concentrations of civilians.",
        "White phosphorous can also be used for illumination or to create smoke screens.The car of a prominent pro-Kremlin novelist exploded in Russia on Saturday, injuring him and killing his driver, Russia's state news agency Tass reported, citing emergency and law enforcement officials.",
        "The incident involving the car of Zakhar Prilepin, a well-known nationalist writer and an ardent supporter of what the Kremlin calls a 'special military operation' in Ukraine, took place in the region of Nizhny Novgorod, about 400 kilometers (250 miles) east of Moscow.It is the third explosion involving prominent pro-Kremlin figures since the start of the war in Ukraine.In August 2022, a car bombing on the outskirts of Moscow killed Daria Dugina, the daughter of an influential Russian political theorist often referred to as 'Putin's brain'. The authorities alleged that Ukraine was behind the blast.Last month, an explosion in a cafe in St. Petersburg killed a popular military blogger, Vladlen Tatarsky. Officials once again blamed Ukrainian intelligence agencies.The regional governor of Niznhy Novgorod, Gleb Nikitin, said Prilepin suffered minor bone fractures and was receiving medical help.",
        "Russian news outlet RBC reported, citing unnamed sources, that Prilepin was travelling back to Moscow on Saturday from Ukraine's partially occupied Donetsk and Luhansk regions and stopped in the Nizhny Novogorod region for a meal.",
        "Interior Ministry spokeswoman Irina Volk said a suspect had been detained. Russian news reports identified him as a native of Ukraine who earlier had been convicted of robbery.Prilepin became a supporter of Vladimir Putin in 2014, after the Russian President illegally annexed the Crimean peninsula.He was involved in the conflict in eastern Ukraine on the side of Russian-backed separatists. Last year, he was sanctioned by the European Union for his support of Russia's full-scale invasion of Ukraine.In 2020, he founded a political party, For the Truth, which Russian media reported was backed by the Kremlin. A year later, Prilepin's party merged with the nationalist A Just Russia party that has seats in the parliament.A co-chair of the newly formed party, Prilepin won a seat in the State Duma, Russia's lower house of parliament, in the 2021 election, but gave it up.Party leader Sergei Mironov called the incident on Saturday 'a terrorist act' and blamed Ukraine. Russian Foreign Ministry spokeswoman Maria Zakharova echoed Mironov's sentiment in a post on the messaging app Telegram, adding that responsibility also lay with the US and NATO.'Washington and NATO have nursed yet another international terrorist cell - the Kyiv regime,' Zakharova wrote. 'Direct responsibility of the US and Britain. We're praying for Zakhar.'The deputy chair of Russia's Security Council, former President Dmitry Medvedev, put the blame on 'Nazi extremists' in a telegram he sent to Prilepin.Ukrainian officials haven't commented directly on the allegations. However, Ukraine's presidential adviser, Mykhailo Podolyak, in a tweet on Saturday, appeared to point the finger at the Kremlin, saying that 'to prolong the agony of Putin's clan and maintain the illusionary total control, the Russian repression machine picks up the pace and catches up with everyone,' including supporters of the Ukraine war.The chief of the Russian paramilitary group Wagner on Saturday asked Moscow to let him hand over his positions in the flashpoint Ukraine city of Bakhmut to Chechen leader Ramzan Kadyrov.Wagner fighters are leading the battle for Bakhmut, during which rivalries between its leader, Yevgeny Prigozhin, and the Russian army have come to the surface.",
        "Wagner has spearheaded the grinding, months-long Russian assault on Bakhmut, almost capturing the city in the longest and bloodiest battle of the Russian campaign in Ukraine.'I ask you to issue a combat order before 00:00 on May 10 concerning the transfer of the positions of the Wagner paramilitary units in Bakhmut and its periphery, to the units of the Akhmat battalion' Prigozhin said in a letter to Defence Minister Sergei Shoigu.The Akhmat battalion refers to combat units under the command of strongman Kadyrov, who has ruled Russia's Muslim-majority republic Chechnya for the last decade and a half.In a series of scathing videos on Friday, Prigozhin blamed Shoigu and Chief of General Staff Valery Gerasimov for 'tens of thousands' of killed and wounded Russian fighters in Ukraine.'Their unprofessionalism is destroying tens of thousands of Russian guys and that is unforgivable,' he said.Prigozhin said his fighters would be forced to pull out because of an 'ammunition famine,' adding that the Russian defence ministry had only delivered 32 per cent of the required ammunition since October.Kadyrov later said on Telegram his forces were 'ready to move' towards Bakhmut.'The soldiers are on alert, we are just waiting for orders,' he said."
    ]
}