{
    "articleURL": "/news/article-12056493/Sienna-Weir-Models-boyfriend-shares-heartfelt-tribute-horse-riding-accident.html",
    "content": [
        "Sienna Weir was a model and double-degree Uni graduate She sadly died after her horse tumbled at polo grounds The shattered boyfriend of an Australian model who died in a freak horse riding accident has shared a moving poem dedicated to the English literature and psychology graduate. ",
        "Sienna Weir, 23, from Sydney sadly was killed last week following a month in hospital after she sustained critical injuries when the horse she was riding at Windsor Polo Grounds fell on April 2. Ms Weir was one of 27 finalists in the Miss Universe Australia competition for 2022.Mr Bull wrote this week alongside pictures of the pair: 'I love you my sunflower girl'.He then included the poem Annabel Lee by US author Edgar Allen Poe, which he said was 'his favourite poem, written by her favourite poet'.'We loved with a love that was more than love,' one of the opening lines of the poem reads.",
        "Equestrian Australia has also released a statement saying it was 'deeply saddened' by the tragic accident. 'EA expresses its sincere condolences to Sienna's family, our thoughts are with them at this time, we also extend our condolences to her friends and the equestrian community, including those who witnessed the event, we wish to respect their privacy at this difficult time,' EA said.'Support is available to those affected by the incident, further details will be provided on the EA website.'Ms Weir's last post to Instagram was a selfie in April, with many leaving their condolences to the bubbly character they affectionately knew as 'gremlin'.",
        "A friend wrote: 'Heaven has gained the most beautiful angel today. I'll miss everything about you Siena, I love you.'The same friend said Ms Weir's smile had 'lit up every room'. 'I'm so lucky to have known you. Thank you for everything,' she said.",
        "Ms Weir's agency, Scoop Management, shared several photos of the model, writing: 'Forever in our hearts'.  Photographer Chris Dwyer posted his own tribute to the budding model.'You were one of the kindest souls in the world, you lit up the room and the world is a lot darker now that you are gone.'Hope wherever you are, you're being the gremlin we all know and love.'Miss you so much already.'Ms Weir was planning to move to London in the coming years spend time with her family as well as expand her professional and social networks. ",
        "When asked what set her apart from the other Miss Universe contestants, she pointed to her wide range of interests.Ms Weir revealed she had been riding horses since she was just three-years-old. 'My family aren't quite sure where this passion came from, but I've been horse-riding since I was 3 years old and can't imagine my life without it,' she said. 'I travel to rural Sydney 2-3 times a week to train and compete around New South Wales or broader Australia every other weekend.'",
        "The model said she was also passionate about English literature, namely poetry, and said it was an incredible way to connect with others. 'I love to represent myself in the best way possible through writing my own poetry, but I also find it fascinating to find a commonality of experience with people from completely different walks of life,' she said. "
    ]
}