{
    "articleURL": "/wires/reuters/article-12048491/Expedia-Group-beats-Street-estimates-record-lodging-bookings.html",
    "content": [
        "By Doyinsola Oladipo",
        "NEW YORK, May 4 (Reuters) - Expedia Group Inc on Thursday beat Wall street estimates for first-quarter revenue on record lodging bookings as travel returns to urban markets and international travel demand approaches pre-pandemic levels.U.S. travel companies are benefiting from higher prices and record accommodation bookings as travel demand remains elevated despite concerns of an economic downturn and travel preferences shift back to traditional travel.Shares of the Vrbo and Hotel.com operator rose 4.3% in trading after the bell.\"The first quarter saw strong travel demand driven by increasing international travel, major city travel, and the reopening in Asia,\" Expedia Group CEO Peter Kern said in a statement.Total gross bookings rose 20% year-over-year to $29.4 billion.Due to hybrid work, travelers are returning to cities, shortening the length of their stays and shifting away from month-long COVID-era beach or mountain vacations, Kern told investors on the call.\"As we've seen big cities come back. That favors our hotel business,\" Kern told Reuters. \"What's good for the hotel business might be a little bit of pressure on Vrbo.\"Vrbo and a modest second quarter guidance will leave some uncertainty with investors and may mute any upside in the shares tomorrow, said Dan Kurnos, Research Analyst at The Benchmark Company.\"Everybody is also waiting for the other shoe to drop on a recession,\" he added.",
        "The company said first-quarter growth rates year-over-year were also impacted by FX headwinds, due to a stronger dollar.The company posted an adjusted first-quarter loss of 20 cents per share, missing analysts' expectations for a loss of 4 cent a share.The online booking company's revenue rose to $2.7 billion in the first quarter up 18% from a year ago, the highest first quarter revenue for the company, and beat analysts' average estimate of $2.6 billion.Competitor Booking Holdings Inc also reported on Thursday record first-quarter room night and gross bookings. (Reporting by Doyinsola Oladipo in New York; Editing by Chris Reese and Sandra Maler)"
    ]
}