{
    "articleURL": "/femail/article-12051779/The-biggest-diamond-world-starring-Coronation-King-Charles-Queen-Camilla.html",
    "content": [
        "The Royal Family's Cullinan diamond is the largest in the worldPieces of the gem were in the Sceptre, the King's Imperial State Crown and in Queen Camilla's crown For all the latest Royal news, pictures and video click here Among the many magnificent jewels on display at today's Coronation, there was one above all others that caught the eye. ",
        "Because no fewer than five pieces of the world’s biggest diamond, the Cullinan,  glittered among the Royal regalia on display at Westminster Abbey - including on Camilla's crown.The Cullinan diamond was 3,106 carats, and the size of half a house brick when it was first discovered - so implausibly huge that a South African mine worker threw it out of the window, thinking it was rubbish.But today, cut into nine separate gems, it adorned the Sovereign's sceptre, the Imperial State Crown, which was worn by King Charles as he left Westminster Abbey. Three further parts of the gem were mounted on Queen Mary's Crown, worn by  by Queen Camilla.",
        "Two of them are original settings: one piece sits the cross at the top, above the ‘monde’ diamond ball; another gem sits in the bottom band, or ‘brow’ of the crown. But a large gem known as 'Cullinan 5', placed centrally just above the brow, is new.This is because it is a replacement for the controversial Kohinoor diamond, which had originally adorned Queen Mary's crown, was been judged too sensitive for use in today's ceremony. The same doubts applied to the quartz replica of the Kohinoor, which has appeared on the crown in more recent times, and so the Cullinan was used instead.",
        "The huge Kohinoor gem orginally came from India and is said to have been given to Queen Victoria by the last Sikh emperor of India - who at the time was only 10 years old.But the circumstances are disputed and there are claims in at least three countries, including India, to have the jewel returned.Some in India claim the diamond is a painful reminder of the colonial era. This is the first time since the 18th century that a crown will have been reused for a consort's coronation. The Palace said the choice of Queen Mary's crown was in the 'interests of sustainability and efficiency'.Mystery of the 'vanished other half' of the giant gem The story of the Cullinan starts on a sticky summer’s evening at the Premier Mine near Pretoria when Surface Manager Frederick Wells was getting ready to go home. A worker raced into his makeshift office saying he’d spotted something protruding from the earthen wall of the mine.Using his pocket knife, Fred prodded at the object from where it protruded 18ft below the surface. At first, he thought that someone was playing a trick on him – that it was a large lump of glass – but brushing off the dirt and dust, he realised that he had unearthed an enormous diamond.",
        "Back in the mine office a worker laughed at Fred's claim, and threw it out of the window; but the gemstone was quickly retrieved then weighed and measured. It was more than half a kilo, and ten centimetres long!Senior manager William McHardy, telegrammed mine owner Thomas Cullinan who also suspected the discovery was a prank. 'I am sure it is just a crystal,' he said to his wife.",
        "Within hours, the story was swirling through the simple homes of the mining compound. And within days, it had reached the rest of world. Newspapers across Africa, Europe and America printed extra copies to satisfy the public demand for news.Almost a week after the find, on February 1, 1905, the diamond left the mine for Johannesburg where it was exhibited at The Standard Bank. Soon, though, the Premier Mine Company realised they now had a problem: the diamond was simply too valuable to keep in South Africa.What followed was an operation to smuggle it to London which could have come straight from the pages of a Wilbur Smith novel.The Cullinan was hidden in a hat box belonging to the wife of a senior employee of the South African postal service and transported by steam train from Johannesburg to Cape Town. Then it was put in the regular parcel post and secretly mailed back to London while on the same ship, a worthless rock was packed into a biscuit box, locked in the Captain’s safe, and placed under 24-hour armed guard.",
        "No one, instructed Thomas Cullinan, was to be trusted.The diamond arrived in the UK in early April 1905, but proved too big to sell. In 1907, General Louis Botha, the newly elected Prime Minister of the Transvaal, suggested buying it and gifting it to King Edward VII (still then the King of South Africa) as a token of their loyalty.It was a controversial offer, but the Cullinan was officially accepted by the King as a present for his 66th birthday. On November 9, 1907, it travelled to the royal railway station at Wolferton near Sandringham, in a First Class carriage with a huge police escort, to be presented to the Royal family.Finally, it would cross the North Sea to Amsterdam in the coat pocket of Abraham Asscher, scion of the world’s best diamond cutting family – as the Royal Navy ran a decoy operation with a sealed box on board a warship.It would take Abraham’s brother Joseph Asscher eight months to split and cut the diamond into the nine principal pieces, Cullinan I to Cullinan IX, which are now among the Royal family’s most valuable and much-prized jewels.The rest is history – as we shall see when the five largest ‘Cullinans’ play a starring role in the Coronation of King Charles III and Queen Camilla on Saturday 6th May.",
        "Or is it?One hot dusty January day, 104 years after the discovery of the diamond, I arrived in the picturesque town of Cullinan, with its main street lined by jacaranda trees and cute cottages.I had booked myself onto a tour of the mine and village and had a wonderful time listening to an elderly lady whose husband’s ancestors had been the Prinsloo family, the farmers from whom Thomas Cullinan had bought the koppie (hill) where he’d opened his mine.While having a cup of tea, the lady proudly told me, as if it were a secret, that even though their land had turned up the largest diamond in the world, the true Cullinan had once been bigger, much, much bigger.I assumed this was a myth. But a year later, when I started research for my debut novel - the first of a mystery series about jewels - I looked again at this extraordinary story.I began with the work of Gustaaf Molengraaff, the former State Geologist of South Africa who’d been tasked with examining the Cullinan and valuing it on behalf of Central Bank of South Africa. He was the first expert to suggest the diamond was only a fragment of a colossal crystal.Diamonds grow mostly into an octahedral shape – two square pyramids back to back. Since four of the eight sides of the Cullinan were smooth, as opposed to misshapen and rough, Dr Molengraaff deduced that it had been part of something bigger when it was catapulted from the earth’s upper mantle, where diamonds are formed, and upwards through what’s called a volcanic chimney, or diamond pipe, to the surface of the earth. ",
        "Queen Victoria’s favoured gemmologist Sir William Crookes, who examined the Cullinan when it arrived in London and agreed with the verdict from Johannesburg – that it had cleaved from a bigger crystal.Sir William, later president of the Royal Society, said the stone given to the King represented ‘probably less than one half of the original octahedral crystal’.I also found evidence from George Frederick Kunz, a mineralogist and vice president of Tiffany and Co, who concurred with Sir William but added that, in his expert opinion, the other half may have fragmented into several still-enormous diamonds. All of which suggests the original Cullinan had been a mighty 7,000 carats or more when it was expelled from deep within the earth by a volcanic eruption.But there my trail grew cold.In 2012, I tried to pick it up again. I wrote to Lord Balfour, then aged 88, asking if he knew of any other evidence which might help me substantiate the story.He wrote back saying South African historians Eric Rosenthal and Hedley Chilvers had both independently recorded versions of it – and, after much searching in the British Library, I located their work which I believe is the closest we have ever come to knowing the truth.",
        "It appears that in late 1907, a Premier Mine worker called Johannes Paulus let it be known he’d found a diamond even larger than the one that had just been given to the King. He wanted 2000 Rand in gold (£154,000 in today’s money) for it.A former farmer and reformed convict, Johannes Hendrikus Fourie, then working as an informer for the Pretoria police, heard of Paulus’s boast and began making enquiries within the corrupt and dangerous world of diamond smuggling and thieving.A Dr Van Wijk said that he knew Paulus, and it was arranged for the two men to meet at midnight, out on a lonely patch of veld near the Premier Mine, accompanied by a Detective Inspector Hill.When Paulus arrived, he was surprised to find three men awaiting him, rather than just Fourie. Suspicious, he asked to see the gold – but when he thrust his hand into the sovereigns, he realised it was a bag full of washers beneath a surface layer of gold. He had walked into a trap.To allay his fear, a document was quickly written out on the policeman’s notepaper guaranteeing that if Paulus was to hand over the stolen diamond, the mining company would offer him an amnesty. He would not be prosecuted and he would be paid the agreed amount.Paulus did not believe the offer was genuine and fled into the night – taking the diamond with him.The Detective Inspector later reported he had seen the stone and that one side was indeed ‘flat and smooth – ’in other words, a cleavage plain just like those on the Cullinan.Johannes Paulus was never heard of or seen again.Fourie was said to have become obsessed with the hunt, spending months sitting in the Premier Mine pub hoping for clues as to the whereabouts of Paulus.Of course, legend of the cursed diamond did not end the treasure hunt. A report from the New York Times on December 19, 1909 asked ‘Where is the Cullinan’s Other Half’, and captured the ongoing frenzy of press and public interest four years after the discovery of the original.‘South Africans still busy in search for famous diamond,’ ran the headline, adding: ‘It’s not impossible that the broken-off fragments of the Cullinan are scattered over a wide space and that they may one day be found on the surface of the earth… but it is just as possible that they are still reposing in the depths of the mine.’More than a century later, it’ll be a very lucky person indeed who finds them.Cullinan I",
        "The stone, known as the Great Star of Africa, is the largest colourless cut diamond in the world. Part of the Crown Jewels collection, it is usually on display in the Tower of London, but has a central role to play at next month’s Coronation.In 1911, it was mounted in the Sovereign’s Sceptre by Garrard, the then Crown Jeweller, and is so large that the Sceptre – which was made for Charles II’s coronation in 1661 – had to be reinforced to take its weight.Cullinan II",
        "Like the first Cullinan stone, this diamond is also a part of the Crown Jewels, and is often referred to the Second Star of Africa.The 317.4-carat cushion-cut stone is set below the Black Prince’s Ruby at the front of the Imperial State Crown. This will be exchanged with St Edward’s Crown during the Coronation ceremony, worn for the King’s departure from the Abbey for his Coronation Procession and then his appearance on the Buckingham Palace balcony.Cullinans III and IV",
        "Part of Queen Elizabeth II’s private collection, the Cullinan III – a 94.4-carat pear-shaped diamond – and the Cullinan IV, a 63.6-carat cushion-shaped diamond, are normally joined together in an impressive brooch. The late Queen jokingly called them ‘Granny’s Chips’, because she inherited them from her grandmother, Queen Mary.However, the two Lesser Stars of Africa are being reset for the Coronation, in Queen Mary’s Crown, with which Queen Camilla will be crowned. The gems will take the place of the Koh-i-Noor diamond.Cullinan V",
        "A triangular-pear cut diamond weighing 18.80 carats that was part of a ‘stomacher’ worn by Queen Mary – a ‘stomacher’ was an enormous brooch that covered the abdomen. Now usually set in a brooch, which was worn by Her late Majesty, it too will appear at the Coronation in the Queen Mary’s Crown.Cullinans VI and VIII",
        "An 11.50 carat, marquise-cut stone, Cullinan VI was purchased in 1908 by King Edward as a gift for his wife, Queen Alexandra. She generally wore it as the pendant to Cullinan VIII and latterly in a small circlet when she became a widow.When Queen Mary inherited it in 1925, she preferred to wear Cullinan VI in a brooch, either with Cullinan VII or VIII, an emerald-cut diamond of 6.8 carats, as a brooch.More than any other Cullinan gem, VI was the one worn most often by the young Queen Elizabeth II, though she later declared that, as a brooch, it ‘gets in the soup’.Cullinan VII",
        "This 8.8-carat marquise-cut diamond is set as a pendant hanging from the diamond and emerald-set Delhi Durbar necklace, once part of the late Queen Elizabeth’s personal collection. Created by Garrard for the coronation of George V and Mary as the Emperor and Empress of India in Delhi, the diamond is detachable and can be reset in a brooch.Cullinan IX",
        "The smallest of the nine principal stones cut from the Cullinan, this pear-shaped diamond was set in a ring with a prong setting for Queen Mary. The late Queen Elizabeth sometimes wore it, but it has rarely been seen on modern Royals.*Josie Goodbody’s novel The Cullinan Diamond Connection: A Jemima Fox Mystery will be available later this year "
    ]
}