{
    "articleURL": "/wires/ap/article-12058465/The-Frenchie-favorite--dog-contender.html",
    "content": [
        "NEW YORK (AP) - The United States' new favorite dog breed - the comical, controversial French bulldog - has never won the nation's pre-eminent dog show.",
        "Yet here, at an obliging trot, comes Winston. The Frenchie with NFL connections is a finalist at this week's Westminster Kennel Club dog show, less than two months after the release of rankings showing that his kind has become the country´s most prevalent dog breed.Frenchies' rise has been stunning: from 83rd most popular to No. 1 in three decades. It also has been dogged by concerns about their health, debate over the ethics of breeding, denunciations of a gold-rush-like market with ever more \"exotic\" variations, and a recent spate of high-profile and sometimes fatal robberies.If all that says something about these stumpy-snouted, pointy-eared, deep-chested, quizzical little bulldogs, what does it say about the culture that loves them?THEIR MEDIA IMAGE IMPACTS THEIR POPULARITY\"Just like humans, dogs get characterized for what they can do, but more importantly what they can symbolize,\" says Cameron Whitley, a Western Washington University sociology professor and the chair-elect of the American Sociological Association's Animals and Society section. Whitley argues that breeds' popularity depends less on their traits than on their portrayal in media and pop culture.",
        "Indeed, a 2013 study found no indication that longer lifespans, better behavior or other desirable characteristics make a dog breed more sought-after. One of the authors, Western Carolina University psychology professor Hal Herzog, also has observed that parabolic spikes in dog breeds resemble those in baby names, hit songs and other boom-and-bust commodities of pop culture. In short, they´re canine memes.",
        "\"The dogs have become a form of fashion,\" says Herzog, who wrote a book about human attitudes and conduct toward animals.French bulldogs have a colorful, centuries-long history involving English lacemakers, the Parisian demimonde and Gilded Age American tourists who brought the dogs home. (One even died in the 1912 sinking of the Titanic. ) But the breed's U.S. heyday soon ended.Then Americans got a fresh look at Frenchies in the current century. They turned up on domesticity maven Martha Stewart's TV show, then in narrative series and movies (such as \"Modern Family\" and \"Due Date\"), ads (including Super Bowl spots for Skechers in 2012 and Bud Light this year) and the social media accounts of celebrity owners (Lady Gaga, Dwayne \"The Rock\" Johnson and many more).French bulldog fans point to attributes beyond camera-readiness to explain the dogs' appeal. They boast easy-care coats, modest exercise needs, an apartment-friendly size and a demeanor memorably described as \"a clown in the cloak of a philosopher.\"Yet that hasn't translated into wins at Westminster, where each dog is judged against an ideal for its own breed, not against others.Still, longtime breeder and French Bull Dog Club of America spokesperson Patty Sosa posits that Frenchies \"might have been out-flashed\" by showier-looking breeds, such as poodles. (Labrador retriever partisans harbored similar theories during the 31 years their breed topped the popularity charts; it's still winless at Westminster.)",
        "Winston, however, came within a whisker of the trophy last year, taking runner-up to the first bloodhound ever to win. The Frenchie later won another prominent competition, the National Dog Show in Philadelphia in November. He headed into Westminster as one of the show world's most-winning dogs and on Monday bested dozens of other Frenchies and then a diverse group of other \"non-sporting\" dogs to get a shot at the top prize Tuesday night.The confident canine took the competition in stride, hopping into a box labeled \"non-sporting group\" by the podium as he wrapped up his final lap around the ring Monday night.If a pooch can get a competitive edge through osmosis, the cream-colored 4-year-old probably has. He lives with part-owner Morgan Fox, a Los Angeles Chargers defensive end, and fiancee Kailyn Provin when not on the show circuit with handler and part-owner Perry Payson.Besides Winston's physical attributes, \"his personality is to die for,\" says Sandy Fox, who bred him with Payson and is the NFL player's grandmother. \"He loves to show.\"To win Westminster on the heels of the popularity rankings \"would be awesome,\" she said. But like many other longtime breeders, Fox has mixed feelings about the nation's ardor for Frenchies.\"It's nice,\" she said, adding: \"A little scary. Everybody will want one.\"",
        "PEOPLE WORRY ABOUT THEIR HEALTHShow breeders who adhere to health testing and other guidelines feel that Frenchie fever already has attracted opportunistic, slapdash people producing anything-goes, possibly unhealthy pups. There's concern that \"we´re losing the battle with education and just promoting a well-bred dog,\" Sosa said.Some veterinarians also are worried for Frenchies - all of them.Partly because of their pushed-in, wrinkly faces, the animals are susceptible to breathing, eye, and other problems. While other breeds also have predispositions and mixed-breed dogs can be a question mark, recent research in Britain suggested Frenchies' health is \"largely much poorer\" than that of other canines.The British Veterinary Association has \"strongly\" recommended against buying any flat-faced dogs, and the Dutch government has prohibited breeding very short-snouted canines. In the U.S., the Humane Society Veterinary Medical Association - a professional group with a focus on animal welfare advocacy - wants \"to counter the dramatic increase in demand\" for push-faced dogs, partly by discouraging their use in advertising.\"Owners who really love these dogs don't understand how much the dogs are suffering,\" says the group's education director, Dr. Lorna Grande. (The broader American Veterinary Medical Association, meanwhile, has said it's exploring ways to improve flat-faced dogs´ well-being.)Dr. Carrie Stefaniak has seen French bulldogs with breathing difficulties in her practice in Glendale, Wisconsin. She urges would-be owners to understand the breed's health risks and the potential expense of treatment. She emphasizes researching breeders carefully.",
        "But she's quick to add that Frenchies can flourish.\"The general public talks about the unhealthy ones,\" Stefaniak says, \"but we don't often hear about the 13-year-olds that are still out there, doing great, or the ones that are doing agility or taking long hikes.\"Her own two French bulldogs do both those things.___New York-based Associated Press journalist Jennifer Peltz has covered the Westminster dog show since 2013."
    ]
}