{
    "articleURL": "/wires/reuters/article-12056003/Yankees-shoot-needed-series-win-vs-Rays.html",
    "content": [
        "After recording one of their best wins, the New York Yankees look to build some much-needed momentum when they face the Tampa Bay Rays in the rubber match of a three-game series on Sunday in St. Petersburg, Fla.",
        "Harrison Bader capped a three-run rally in the eighth inning on Saturday with a two-run single to give the Yankees a 3-2 victory. Tampa Bay had its four-game winning streak snapped and lost for just the third time in 21 home games.The injury-plagued Yankees are playing without several key players, including outfielder Aaron Judge (right hip), who is expected to return on Tuesday for the second game of a three-game set with the Athletics.\"I know we're in a tough spot right now and beat up or whatever, but I know those guys are competing,\" Yankees manager Aaron Boone said. \"It isn't easy right now and that's OK. There's going to be times like that, but we're competing our butts off right now.\"New York's bullpen shined in Saturday's victory with four relievers combining for four scoreless innings behind starter Domingo German. The Rays finished 1-for-12 with runners in scoring position.\"We probably had the right guys up at the right points, but weren't able to add on,\" Tampa Bay manager Kevin Cash said. \"We did have guys get on base, but that big hit just didn't come easy (Saturday).\"New York will turn to right-hander Gerrit Cole (5-0, 1.35 ERA) for the series finale. He allowed two runs over six innings in a no-decision against the Cleveland Guardians on Tuesday in his most recent outing.",
        "Cole, 32, was named American League Pitcher of the Month for April after allowing just five runs across 40 2/3 innings in his first six starts.Yandy Diaz is 12-for-35 with a home run against Cole, who is 2-7 with a 3.52 ERA in 15 career starts versus Tampa Bay. He posted a 1.07 ERA in four outings against the Rays last season.The Rays are expected to have left-hander Josh Fleming handle the bulk of the work behind opener Javy Guerra (0-0, 7.20) on Sunday. Fleming exited Tuesday's game against the Pittsburgh Pirates in the fifth inning due to a bruised left foot.Cash said Fleming should be available after throwing off the mound in the past two days.\"I don't think we'll have a final say, but I'm confident that we feel like it's really trending in the right direction,\" Cash said. \"Highly likely that he'll be available Sunday.\"Fleming, 26, has gone 0-1 with a 3.00 ERA across six innings in three career relief appearances against the Yankees, while Guerra, 27, has faced New York just once, throwing an inning of relief against it on Saturday.The Rays' offense has been led by Randy Arozarena, who is riding a 17-game on-base streak. He is batting .354 with six homers and 13 RBIs during that stretch.",
        "Tampa Bay holds a nine-game lead over New York in the AL East standings, but Bader said he isn't concerned about the gap.\"I don't even look at that stuff,\" Bader said. \"Every single day you come in, you've got something to do. You've got a task at hand. Tomorrow is no different than today in the way we approach everything. It's super early, and we're just finding our groove and still playing a lot of good baseball. There's no concern whatsoever.\"--Field Level Media"
    ]
}