{
    "articleURL": "/sport/football/article-12059205/Who-Liverpools-frontrunner-sporting-director-Jorg-Schmadtke.html",
    "content": [
        "Liverpool are set to replace Julian Ward after just 12 months as sporting directorThe German veteran has served similar stints at Aachen, Koln and VfL WolfsburgAs the Reds plot their summer rebuild, Schmadtke's nous could be invaluable The announcement on Saturday that Liverpool were set to make a move for former Wolfsburg executive Jorg Schmadtke to become their new sporting director was met with a collective response: who? ",
        "Even for studious fans of the German leagues, where Schmadtke has plied his trade since his first role in charge of Aachen in 2001, the director's career has gone largely under the radar. But look closer, and a portrait begins to emerge of a figure who could yet be extremely compatible with Jurgen Klopp. One who has frequently taken underperforming sides and transformed them with clever transfers and smart financial understanding. There's another side to Schmadtke too – one of passionate outbursts and boardroom conflict – that could hint that once the 59-year-old arrives at Anfield, fans will get to know more about him sooner, not later. Here, Mail Sport runs the rule over the German executive, tracking his first meeting with Klopp and as well as the lesser-known connections that may have made him a front-runner to take over at Liverpool. ",
        "A change of heart? Schmadkte was thought to be retiring when he announced his departure from VfL Wolfsburg in January and he too seemed convinced, saying that he thought he had been 'doing all this for so long' and that it was 'time to end this chapter'. Citing his wife and family and the sacrifices they had made for him throughout his managerial and executive career, he said that there were 'other things in life that [he] would like to do.'",
        "In an interview on the announcement in Wolfsburger Allgemeine Zeitung, Klopp heralded his 'great personality' and first revealed his desire to work with him. 'I would have liked to work with him, I'm sure it would have worked out well,''He's a top character, somebody who never changed in 38 years and stayed true to himself. He'll be missed by football.'  The journeyman goalkeeper Schmadtke only made it into the game after first trying his hand at gaining a mechanical engineering degree and one in business administration: he finished neither. Instead, he made it as a goalkeeper and featured for Fortuna Dusseldorf, where he played between 1985 and 1993, before spellls at SC Freiburg and Bayer Leverkusen. Dusseldorf, Schmadtke's hometown, is where the then-player – who made 244 appearances between the sticks for the club – would have first (if not memorably) crossed paths with his future manager. ",
        "'I was 19 and had a dream of making it as a pro,' Klopp reminisced in the same interview with Wolfsburger Allgemeine Zeitung. 'I went to a trial at Fortuna where Jorg was in goal and a very big name there. 'I put everything into it and ran like a devil but what can I say? I was a total flop. I guess Schmadtke remembered that. He never made me an offer [to coach] at any of his clubs. ",
        "'He must have thought: if Klopp can't play football, he can't be a decent manager either.' Whilst Klopp went on to see success as a defender at Mainz 05, both men hung up their boots in 2001 with greater aspirations in their sights. Whilst playing at Freiburg and Fortuna, as per the Athletic, Schmadtke coached their youth teams and upon retirement from playing, he served brief senior coaching stints at Borussia Mongchengladbech and Fortuna. Successes behind the scenes The first step taken by Schmadtke as a sporting director was through the doors at Alemannia Aachen. The club were almost forced to hire an inexperienced new director due to being over £3.5million (€4m) in debt, and after spoting an advert for the position in the backpages of Kicker magazine, Schmadtke prepared a persuasive PowerPoint presentation that won him the role. Success was by no means swift but alongside then-manager Jorg Berger, Schmadtke slowly rebuilt the club, which had been rocked in 1999 by the sudden death of coach Werner Fuchs. By 2004, the 2. Bundesliga outfit reached the DFB-Pokal final and despite losing to Werder Bremen, sensationally qualified for the UEFA Cup due to Bremen Champions League qualification.Briefly caretaker manager in 2007, during the club's season-long spell in the Bundesliga, Schmadtke decided not to renew his contract in 2008 and was released the next day. From 2009, he spent four years at the helm of Hannover 96, before a stint at FC Koln, his time in both roles marked by similar overachievements. ",
        "In 2017, he joined Wolfsburg, and continued his run of overseeing moves that were both well-considered and thoughtful, which will appeal heavily to Liverpool as they plot their summer rebuild. Most recognisably to a Premier League audience, Schmadtke oversaw the final discussions that brought in United striker Wout Weghorst from AZ Alkmaar in 2018. A personality on the sidelines But whilst Liverpool are no doubt convinced by his intellect and executive nous, the board might be wary of his somewhat-strained relationship with keeping the peace. Exits at Aachen, Hannover, and Cologne all came under a dark star, with the director's trademark gruff nature capable of getting him into hot water with authority figures in a range of different positions. Acrimonious partings haven't helped him to secure more high-profile jobs, which is why Schmadtke has been a constant and yet little-known presence in German football. But those who have been on the other end of his fierier encounters are unlikely to forget him. Should Julian Nagelsmann get the top job at Tottenham this summer, run-ins with Liverpool would no doubt remind him of an infamous encounter with Schmadtke which saw the sporting director lob a piece of chewing gum at the then-Hoffenheim coach after his side's controversial equaliser against Cologne during their 2015/16 campaign. ",
        "The chewing gum, spat into Schmadtke's palm straight from his mouth, missed the former Bayern Munich manager but the director apologised all the same, phoning up his opposite number at the club after the final whistle. He clashed with coach Mirko Slomka at Hannover and Peter Stoger at Cologne shortly before his exit, and deadpanned of his Wolfsburg manager Bruno Labbadia after his season-long spell in charge in 2018: 'I won't exchange cooking recipes and plan a holiday with him'. ",
        "In January 2016, he picked up a £5,200 (€6,000) fine from the German FA for calling match officials 'eierkoppe' – which loosely translates to 'eggheads' – after they awarded a controversial penalty against Cologne as they played Werder Bremen. Schmadtke was equally adept at straight-talking to the press, further burnishing his grouch-like reputation, but his latest coach at Wolfsburg, Niko Kovac, with great diplomacy, labelled his divisiveness an example of a particular sense of humour. Kovac told ESPN upon news of his looming appointment at the Merseyside club: 'I played with him in Leverkusen together. We were team-mates and worked together for half-a-year at Wolfsburg. He's a nice guy, a smart guy, a funny guy. 'He has a nice [sense of] humour, sometimes someone might not always understand exactly the humour but I understood it very well.' ",
        "... and THAT punk rock connection As news broke that Liverpool were set to move for Schmadtke, ties between Klopp and the sporting director were heavily hinted at – but as per Bundesliga journalist Archie Rhind-Tutt, their closeness has less to do with Gegenpressing and more to do with Schunkelpunk. ",
        "Both men are friends with Die Toten Hosen, a German punk rock band from Dusseldorf who are long-term supporters of Fortuna. Klopp has particularly strong ties to the group, inviting lead singer Campino into his box for Liverpool's victorius Champions League final against Tottenham in 2019. The band wished the manager happy birthday last year during a performance in Rostock, and the crowd sung along before Campino (given name: Andreas Frege) led them in a round of Klopp's Kop chant to the tune of the Beatles' 'I Feel Fine'. In a 2012 interview with Bild, Schmadtke shared that he frequently met up with the band for beers, intimating that he was a friend, rather than just a fan due to the Fortuna connection. Klopp's 'heavy metal' coaching style has been oft-discussed and the opportunity to have an ally in the boardroom – in more ways than one – might be too good for Liverpool to pass up. "
    ]
}