{
    "articleURL": "/sciencetech/article-12048441/This-feed-baby-dont-grow-fussy-eater.html",
    "content": [
        "A nutritionist reveals the best way to avoid a fussy eater is 'Veg Led Weaning'This means introducing vegetables as soon as solids are recommendedREAD MORE:  This is why you should NOT give your child a nicknameWhen it comes to your child's eating habits, there is a science to ensuring they do not become fussy eaters.",
        "Some children are susceptible to sensory properties of food, such as odor and texture, which could be off-putting and send them on a path to food refusal.UK parenting expert and child nutritionist Charlotte Stirling-Reed told DailyMail.com that the best way to avoid picky eating is 'Veg-Led Weaning', the idea of incrementally building up children's tolerance for bitter veggies as they move to solid foods.Babies are born with a love for sweetness but lack a taste for savory and bitter foods.",
        "'It is about starting the weaning journey with a variety of veggies to help your baby taste a variety of very new flavors,' said Stirling-Reed.'Once you have offered some single tastes of veggies,  it is about broadening out and gently and gradually offering more variety, including some proteins, fruits and carbohydrates, while still providing plenty of veggies too.' The American Academy of Pediatrics says children around six months can start changing from purees to solid foods.However, foods that are only blended, mashed or soft-cooked are recommended. And this includes cereals.When a child is seven or eight months old, they can eat various foods from different food groups.'Introducing solid foods is such an exciting time, but for many, it can also be a time of confusion and anxiety…which is exactly why I do the work that I do to try and offer families confidence when it comes to feeding their babies those very first foods,' Stirling-Reed, who is a Sunday Times best-selling author of 'How to Wean your baby' and 'How to Feed Your Toddler, said.",
        "'There is a new concept in weaning that I like to refer to as Veg Led Weaning. It's about starting your baby's weaning journey with veggies.'Vegetables are a great idea to offer a safe, cheap and convenient first food for baby which are easy to prepare and help to provide your baby more taste explorations.'Vegetables are also packed with complex carbs, fiber, vitamins, minerals, and antioxidants essential to your baby's development.Stirling-Reed explained that parents should focus on balanced meals when their baby reaches 10 months.She suggested offering a carbohydrate, protein, vegetable or fruit and some type of dairy as one meal.'You may need to adapt the meals for younger babies and toddlers, but you can still offer them balanced family options,' said Stirling-Reed.",
        "For example, spaghetti Bolognese includes beef (or lentils), tomatoes, pasta and often a little cheese. Curry usually includes rice, vegetables and chicken (or chickpeas), but you might need to mash, chop or cook food a little more for younger babies and toddlers.'",
        "Not only does holding your little one close keep them warm, but it curbs crying, regulates breathing and heart rate, helps with weight gain and improves growth. ",
        "However, she is not blind to the fact that food refusal is still on the table.",
        "'This is really common and most families go through periods of food refusal. However, they have weaned their child. That’s OK,' said Stirling-Reed.'Remember that children’s appetites are naturally up and down, so some days they eat more and others much less.'She provides ways to cope with food refusal, such as accepting their appetite cure.If your child does not want to eat a particular dish, accept it and do not push them. Research has shown that force-fed children usually have lower weights and increased picky eating.Another way to navigate refusal is to eat with your child. 'I am a big fan of trying to bring them into your family mealtimes and offer them similar foods and meals (albeit perhaps slightly adapted for baby) to what you’re eating as a family,' said Stirling-Reed.'This is why I love the Stokke Tripp Trapp as it allows that to happen and helps babies get familiar with the style of eating for your family. 'This means that as they get older and into toddlerhood, they are more likely to accept your family meals and family cooking if they have been offered it and are familiar with it from a young age.'She also encourages parents not to bring attention to their child's picky eating because that usually prolongs the behavior."
    ]
}