{
    "articleURL": "/wires/afp/article-12041357/Clashes-rock-Sudan-truce-UN-official-arrives.html",
    "content": [
        "The UN chief on Wednesday said \"we failed\" to stop war from erupting in Sudan, where persistent fighting between rival generals undermined efforts to firm up a truce.",
        "\"The UN was taken by surprise\" by the conflict, because the world body and others were hopeful that negotiations towards a civilian transition would be successful, Antonio Guterres told reporters in Nairobi.\"To the extent that we and many others were not expecting this to happen, we can say we failed to avoid it to happen,\" the secretary general said.\"A country like Sudan, that has suffered so much... cannot afford a struggle for power between two people.\"Deadly urban combat broke out on April 15 between Sudan's de facto leader Abdel Fattah al-Burhan, who commands the regular army, and his deputy turned rival Mohamed Hamdan Daglo, who heads the paramilitary Rapid Support Forces (RSF).",
        "At least 550 people have been killed and 4,926 wounded, according to the latest health ministry figures, which are likely incomplete.Since the fall of strongman Omar al-Bashir in 2019, international mediators have sought to bring civilians and the military to the negotiating table.But in the process, analysts believe, they gave too much credit to Burhan and Daglo, who worked together in a 2021 coup that derailed the post-Bashir democratic transition.The two generals later fell out in a power struggle.Sudan expert Ernst Jan Hogendoorn, writing for the Atlantic Council, said international and regional leaders must \"begin to strategically apply pressure\" by freezing bank accounts and blocking business activities of Sudanese leaders and their forces.",
        "- 'Heartbreaking' -Guterres spoke on the same day his top humanitarian official, Martin Griffiths, was in Sudan, after neighbouring South Sudan announced on Tuesday that the warring sides had agreed \"in principle\" to a seven-day ceasefire from May 4.",
        "In a statement early Thursday, the army said it had \"accepted\" this proposed ceasefire extension, while calling for \"an African solution to the problems of the continent\".But my midnight Wednesday, the RSF had not commented on the ceasefire and the army stressed in its statement that all its commitments were conditional on \"respect for the truce\" by the other side.Griffiths arrived in the Red Sea city of Port Sudan -- so far untouched by the fighting -- on an urgent mission to find ways to bring relief to the millions of Sudanese unable to escape.He called for security guarantees \"at the highest level\" to ensure desperately needed aid deliveries to war-ravaged parts of the country.The aid chief said he had been informed by the UN's World Food Programme that six trucks dispatched to the country's western Darfur region had been \"looted en route\" Wednesday, \"despite assurances of safety and security\".Both Griffiths and the UN's Sudan envoy, Volker Perthes, spoke to Burhan and Daglo over the phone about the necessity for aid to reach people, Griffiths tweeted.",
        "Sudan's warring sides have announced multiple truces but none has effectively taken hold, with the latest 72-hour ceasefire due to expire on Wednesday at 2200 GMT.UN rights commissioner Volker Turk described the situation as \"heartbreaking\" and \"catastrophic\".He pointed to a military airstrike in the vicinity of a hospital and the RSF using civilian buildings as bases.Multiple hospitals have been struck during the war, and the UN says only 16 percent of Khartoum's hospitals remain fully functional.Despite the truce efforts, witnesses reported warplanes over north Khartoum and fierce clashes near the state broadcaster's headquarters in the capital's twin city of Omdurman.\"We heard again loud gunfire and anti-aircraft firing at a fighter jet this morning,\" a resident of south Khartoum said.- 'Burned our houses' -Nearly 450,000 civilians have fled their homes, the International Organization for Migration (IOM) said, including more than 115,000 who have sought refuge in neighbouring countries.",
        "Mahamat Hassan Hamad, one of more than 30,000 Sudanese refugees who crossed into Chad on Sudan's western border, said fighters \"killed people and burned our houses\".Another refugee, Hawa Ahmat, said she had not eaten or drunk anything for five days before reaching Chad after \"soldiers came, they shot at us at home\".The failure of the warring generals to abide by commitments in efforts to end nearly three weeks of conflict has drawn mounting international criticism.",
        "Egyptian President Abdel Fattah al-Sisi warned on Tuesday that the fighting was affecting \"the entire region\".Griffiths also called for the lifting of \"bureaucratic impediments to delivering assistance\", noting that even he had had difficulty obtaining visas for his trip.In addition to the capital Khartoum, violence has engulfed the Darfur region, where at least 99 people have been killed, according to Sudan's doctors union.Of the more than 330,000 people displaced inside Sudan, most are from West and South Darfur states, the IOM said.Social media video from El Geneina, West Darfur, showed the ash-covered ground at a burned out camp beside buildings that appeared to be charred. It was unclear who had stayed at the camp.Toby Harward, who was a UN refugee agency official in Darfur, said that \"there was very widespread damage done to many of the major cities\" in Darfur, not only El Geneina.Darfur is still scarred by a war that erupted in 2003 when Bashir unleashed the Janjaweed militia, mainly recruited from Arab pastoralist tribes, against ethnic minority rebels.The Janjaweed -- whose actions led to war crimes charges against Bashir and others -- later evolved into the RSF."
    ]
}