{
    "articleURL": "/health/article-12059245/Inside-1billion-AstraZeneca-compensation-battle.html",
    "content": [
        "The vaccine injured could need 'multi-million pound' payouts due to disability READ MORE: Q&amp;A answers all you need to know about the AstraZeneca jab Britain's compensation bill for victims killed or maimed by AstraZeneca's Covid jab could theoretically exceed £1billion, MailOnline can reveal. ",
        "Around 90 families, who allege they were harmed by the jab, are currently pursuing legal action against the pharmaceutical titan, claiming the vaccine was essentially a defective product.Lawyers representing the claimants believe that some of the cases could be worth up to £20m in compensation, which is roughly 160 times more than the £120,000 Government support available. They hope to be able to prove that the vaccine was to blame in court.Yet, it will be the taxpayer who could foot the bill under the special deal ministers agreed to during the darkest days of the pandemic, amid a worldwide scramble to find a jab and release the country from a never-ending cycle of lockdowns. The claimants, who insist they are not anti-vaxxers and believe in the merits of jabs as a whole, feel abandoned by the Government and are taking action because they face financial ruin from losing loved ones or ongoing disability.Some have chosen to sell their homes because of their dire situation. ",
        "Experts also say more could be at stake than just one single legal battle and the UK needs to radically overhaul how it treats anyone damaged by vaccines, especially in wake of the huge sacrifices millions made during the pandemic.Under current rules, victims of certain vaccines — including ones dished out during Britain's historic inoculation drive — are entitled to a one-off sum of £120,000.",
        "Yet that state-funded support system, established in the 1970s, isn't compensation. That means, the Government acknowledges, that anyone awarded the tax-free pay-out can still take legal action, if they so choose. Campaigners have also described the UK's Vaccine Damage Payment scheme as having 'cruel' flaws.Firstly, they argue that the £120,000 sum is inadequate for some battling the most serious disabilities, which can force people to give up work and leave them needing round-the-clock care. In some instances, family members may have to become full-time carers. Eligibility criteria for the scheme is also strict. People need to be classed as at least 60 per cent disabled, as determined by a doctor, or die to be eligible. This means, in theory, if someone is only 59 per cent disabled, they won't get a penny.",
        "Bereaved families eligible for the sum have also hit out at how long it takes for them to be given the cash, despite having all the necessary paperwork. Some have faced 18-month waits for a decision.And, on top of that, the fee can affect benefits such as Universal Credit.AstraZeneca's jab was approved by UK regulators at the close of 2020, in a spark of hope as the nation endured a Christmas in lockdown.In the months that followed, millions rolled up their sleeves to get the vaccine.",
        "While credited with helping end the pandemic phase and, alongside other vaccines, saving 120,000 lives, dozens of Brits allege their loved ones were killed or severely injured by a rare side effect that flew under the radar during AstraZeneca's original trials involving tens of thousands of willing volunteers.Many were struck down by vaccine-induced thrombotic thrombocytopenia (VITT), which can cause deadly blood clots.Others developed Guillain-Barre syndrome, when the immune system mistakenly attacks the body's own nerves. This can, in extreme cases, cause paralysis.Around 90 individuals and families who claim to have been affected by the jab's rare side effects are taking action against AstraZeneca under the Consumer Protection Act, although more may join in the coming months as further cases come to light.Lawyers representing the group are arguing that the jab, given as two doses spread up to 12 weeks apart, was essentially 'defective', in the sense that it was not as safe as people taking it were entitled to expect.",
        "Peter Todd, of Scott-Moncrieff &amp; Associates, which is acting on behalf of dozens of claimants, told MailOnline that some victims would potentially be eligible for 'multi-million pound claims', if the action is successful. Mr Todd claimed the scale of the injuries represented varied drastically, with some Brits left having limbs amputated and battling heart failure. ",
        "'Some of the cases involve incredibly severe injury and huge loss of earnings and need huge [ongoing] care,' he said. 'There will be a number of claims that could be multi-million pound claims.'If you look at a personal injury or clinical negligence claims generally you'll see for a very catastrophic injury there are awards which are very significant.'Pay-outs close to the £20million mark are not unheard of, with similar sums awarded for people left with a life-long disability from a medical error in the NHS.",
        "Not all claimants may be able to establish they are entitled to any compensation.And even ones who do may not get the eight-figure sum. Yet, if a significant portion do, the total payout could easily eclipse the £1billion mark.Lawyers expect to be able to establish in court that the clots were likely caused by the vaccine. The VDPS has been described as a 'no-fault scheme' in Westminster. Tory MP Sir Jeremy Wright said 'it requires, not unreasonably, a causative link between vaccination and injury to be established'.The NHS alone already pays out billions each year in compensation, with the bill for 2021 hitting £2.2billion. Health chiefs have already ring-fenced over a billion to cover Covid pay-outs. Some of that fund is expected to be dished out as vaccine-related compensation. Others expect the bulk will consist of claims regarding treatment delays, cancellations and misdiagnoses. ",
        "In terms of comparison, the Government has paid out tens of millions to victims of thalidomide, who were left with defects and disabilities after their mothers took the drug to ease morning sickness in pregnancy.Mr Todd's group is representing 39 claimants, six of whom were fatal cases. Another firm involved in the action is representing 20 fatal cases and over 30 injuries. Yet it is expected to be the taxpayer who foots any eventual bill — thanks to an indemnity clause offered to British-Swedish firm AstraZeneca by the Government.When the nation was trapped in lockdown in 2020, Downing Street was desperate to get vaccines deployed as soon as possible, once they were approved on the official safety and efficacy grounds.But there was a chance that rare side effects from the jabs could be missed, or their risk miscalculated.This, in theory, meant the companies behind the jabs were vulnerable to legal action.",
        "So, indemnity was offered by ministers to get the vaccines off the production line as quickly as possible. An AstraZeneca official at the time the deal was agreed said the company 'cannot take the risk if in... four years the vaccine is showing side effects'.Some claimants involved in the ongoing legal action have already had the £120,000 sum, in recognition of their suffering via the UK's Vaccine Damage Payment Scheme.",
        "Mr Todd described the scheme, which takes months to process applications, as 'an anomaly', given people with similar injuries can get far larger payouts reflecting the level of harm they have suffered with no artificial cap. 'It's an anomaly that somebody with the same injury at the same severity could be awarded £20million,' he said.Other criticisms of the scheme, which campaigners are simultaneously demanding an urgent overhaul of, includes how long it can take for payments to come through.",
        "Kam Miller, whose husband Neil, her family's bread-winner, died in May 2021 after he suffered a blood clot from AstraZeneca's vaccine, chose to sell her family home on the outskirts of Leicester and downsize to get a 'buffer of cash'. She applied for the scheme in August and has yet to receive the fee.Mr Todd said the delays could leave victims not only dealing with the heartbreaking emotional toll of a death or coming to terms with a disability, but financial stress as well. 'If somebody like the main breadwinner in a family becomes disabled, or even a child becomes disabled, it creates a massive stress on the family,' he said. 'It can put strain on people's marriages and they can break up.'Another flaw of the system, campaigners say, is that people whose loved ones have died from the jabs can have their £120,000 payment classed as 'income' if they are on benefits.Mr Todd said this was a harsh penalty, given what the vaccine bereaved have gone through. 'It's pretty distasteful because that money is there because you have maybe lost your partner and are now having to cope on your own,' he said.'In that situation people deserve a bit more generosity.'Freedom of Information (FOI) requests show nearly 400 claimants have been waiting 18 months for a decision. NHS Business Services Authority, the body which manages the UK's Vaccine Damage Payment Scheme, has already paid out £3.7m to thirty-one Brits injured or bereaved from AstraZeneca's Covid jab.No-one has been paid out for injuries or deaths relating to Pfizer or Moderna's jab so far. Seventy-eight Brits injured or bereaved by Covid jabs specifically have already been told they are entitled to the fee. The successful claims cover those affected by VITT, as well as Guillain-Barre.In efforts to keep up with increasing demand for Covid vaccine injury payments, the Government has ramped up its workforce 20-fold. Eighty admin staff are now tasked with handling the claims.Despite their ordeal, none of the dozens seeking compensation are 'anti-vaxxers', Mr Todd insisted.He said they all recognise the importance of vaccination as an act of public good but that it is unfair for individuals and their families to be left coping with the bill if things go wrong.'Everyone should support vaccination,' he said.'It is unfair that the loss fall on an individual and their family. It should fall across the whole of society.'In the grand scheme of things, it is absolutely trivial, when you think of how much money was spent on Test and Trace.'Mr Todd added that how the UK treated the vaccine injured now could harm other vaccination campaigns in the future. Scientists warn it is a question of when, not if, in terms of the world being struck by another pandemic.  'It would be nice for everybody to know that they can be vaccinated in confidence that if they had a rare reaction that they would be supported and indemnified,' he said. ",
        "COVID-19diphtheriahaemophilus influenzae type b (Hib)human papillomavirusinfluenza, except for influenza caused by a pandemic influenza virusmeaslesmeningitis Bmeningitis Cmeningitis Wmumpspandemic influenza A (H1N1) 2009 (swine flu) - up to 31 August 2010pertussis (whooping cough)pneumococcal infectionpoliomyelitisrotavirusrubellasmallpox - up to 1 August 1971tetanustuberculosisYou may have had a combined vaccination against a number of the diseases listed. For example, you might have been vaccinated against DTP (diphtheria, tetanus and pertussis) or MMR (measles, mumps and rubella).You may also be able to get a payment if you’re severely disabled because either:your mother was vaccinated against one of the diseases in the list while she was pregnantyou’ve been in close physical contact with someone who’s had an oral vaccine against poliomyelitisSource: Gov.uk",
        "'I do worry that as a result of what happened, and if people aren't supported, that it will fuel vaccine hesitancy.'If people stopped being vaccinated, that is going to potentially burden the health service and injure a lot of people.' While the exact details of people claiming that they have been left injured or bereaved from the AstraZeneca jab and taking legal action are not known, 73 Brits are known to have died as a result of VITT.Some of the heartbreaking losses include an 18-year-old student paramedic, parents of young children, and many more with years of life ahead of them.Family members of those that died have often said their loved ones were motivated to get the vaccine not out of fear of the virus, but to protect other, more vulnerable, members of society. Risk of injury and death from the vaccine was vanishingly small, in comparison with the 50million doses of AstraZeneca's jab, technically called Vaxzevria, dished out over the course of the rollout in the UK. And the jab itself, while marred by some fatalities, was on the whole a success. Experts estimate it saved 6million lives across the world. Millions more were protected from falling seriously ill.While Covid may not be fading into the background, other pathogens with pandemic potential still exist.And some fear that if the UK fails to properly look after the few injured by Covid jabs, convincing Brits to roll up their sleeves in the future will be much harder. AstraZeneca said it is unable to comment on ongoing legal matters. A spokesperson said: 'Patient safety is our highest priority and regulatory authorities have clear and stringent standards to ensure the safe use of all medicines, including vaccines. 'Our sympathy goes out to those who have lost loved ones or who have reported health problems.'AstraZeneca and regulatory authorities, carefully record and assess all reports of potential adverse events associated with use of Vaxzevria. 'From the body of evidence in clinical trials and real-world data, Vaxzevria has continuously been shown to have an acceptable safety profile and regulators around the world consistently state that the benefits of vaccination outweigh the risks of extremely rare potential side effects. 'The Medicines and Healthcare products Regulatory Authority (MHRA) granted conditional marketing approval for Vaxzevria for the UK based on the safety profile and efficacy of the vaccine.'A government spokesperson said: 'The Vaccine Damage Payment Scheme (VDPS) provides a one-off tax free payment of £120,000 to individuals where, in extremely rare circumstances, vaccination has caused severe disablement.'We have scaled up and modernised the operations of the VDPS to allow cases to be processed more quickly.'There is a range of other support, including financial, available to disabled people in the UK, for example, free healthcare, social care support and disability benefits.'"
    ]
}