{
    "articleURL": "/wires/pa/article-12040355/Six-former-Yorkshire-players-set-sanctioned-using-racist-language.html",
    "content": [
        "Sanctions are set to be issued against six former Yorkshire players later today for using racist language.",
        "An independent Cricket Discipline Commission panel found five individuals – John Blain, Tim Bresnan, Andrew Gale, Matthew Hoggard and Richard Pyrah – had used the term “P***” about former Yorkshire team-mate Azeem Rafiq or other people of Asian ethnicity when it issued its decision in the case on March 31.A sixth individual – Gary Ballance – had already admitted using racist and/or discriminatory language and is expected to be sanctioned at the same hearing on Wednesday.",
        "The panel will consider any written submissions or verbal representations from or on behalf of the six before deciding on any sanctions, but the PA news agency understands a written submission had only been received on behalf of Ballance as of Tuesday afternoon.The other five individuals had withdrawn from the proceedings and did not appear at a liability hearing held in early March, with the charges against them heard in their absence.Among the panel’s sanctioning powers are the imposition of suspensions and fines, and ordering an education or training course be completed.The CDC panel cleared former England captain Michael Vaughan of using racist and/or discriminatory language.Yorkshire admitted four charges in the case, which stemmed primarily from allegations made by Rafiq and the club’s handling of the claims.",
        "A separate hearing will deal with the sanctions the club will face on June 27.",
        "Former England international Hoggard was found to have used the term “P***” towards Rafiq and other Asian players during the 2008 season, and the term “Rafa the Kaffir” towards Rafiq.It also found he had used the term “token black man” or “TBM” towards former Yorkshire team-mate Ismail Dawood, and dismissed Hoggard’s assertion that Dawood had created the nickname himself.Gale, a former Yorkshire captain and head coach, was also found to have used the term “Rafa the Kaffir” towards Rafiq and the term “P***” towards Rafiq and Yorkshire academy player Mosun Hussain.Blain was found to have used the term “P***” in 2010 and/or 2011 while at Yorkshire, while Bresnan and Pyrah were found to have used the term “fit P***” or “FP” about Asian women."
    ]
}