{
    "articleURL": "/sport/othersports/article-12039335/Oakland-lost-3-pro-sports-teams-just-5-years-Athletics-Las-Vegas.html",
    "content": [
        "A spike in crime, failure to invest in new stadiums, and lack of success could all be blamed for driving three of Oakland's major sports teams out in recent years Additionally, the rise of Las Vegas as a booming city was a magnet for franchisesDailyMail.com provides all the latest international sports news Since 1960, at least one of the 'Big Four' North American sports leagues has had a team in Oakland, California. By 2027, that streak will come to a sad, sudden end.",
        "'The Town' experienced its first heartbreak when the California Golden Seals of the NHL departed for Cleveland in 1976 and then ceased to exist within a matter of years.Just five years later, after a complicated legal process, Raiders owner Al Davis forcefully brought his team down to Los Angeles. But his team's move to the Los Angeles Memorial Coliseum quickly proved to be a poor one and by 1995, the team was back in Oakland.Twenty five years after their return, the Raiders were gone once again. In January 2020, they had moved to Las Vegas - becoming the first NFL team in 'Sin City'. A few months before, the Golden State Warriors had made their move across the bay to the Chase Center in the Mission Bay neighborhood of San Francisco.Just weeks ago, the Oakland Athletics - the team that had been in Oakland the longest, having stayed there consecutively since 1968 - announced they had bought land in Las Vegas on the southern part of the strip with plans to build a stadium there as well. The targeted move-in date is 2027.It's a sudden and tragic demise of one of America's greatest sports cities. Combined, the A's, Warriors, and Raiders won 10 titles including four World Series crowns, four NBA championships, and two Super Bowls in Oakland.",
        "But with the city pushing back against developing new stadiums over the decades, crime rising, and sporting success dwindling, the three teams have departed - leaving a hole in their wake.",
        "It's bad news for a city that has continued to struggle with its violent crime rate since the turn of the millennium. According to FBI statistics from the Oakland Police Department, the number of violent crimes has increased between 2000 and 2020 in year-to-year comparisons by over 600 reports.The city of Oakland suffered during the mid-2000s around the time of the housing crisis and again in 2012 and 2013 - where just under 8,000 violent crimes were reported in back-to-back years.Since 2013, the crime rate has dropped to around 5,600 reports in 2020 - but homicides have been on the rise. According to KQED, Oakland had a half-century low for murders in the late 2010s, but a 50 percent spike in 2021 saw the city hit more than 100 people killed for the first time in a decade.Today, Oakland's reputation as a troublesome place hasn't gone away - with the city ranked as the 12th most dangerous in the country and the most dangerous in all of California.Additionally, the Bay Area housing crisis has increased costs to the point where many are choosing to leave. ",
        "While these problems were present around the time all three teams moved to Oakland - and while they all tried to re-build stadiums there - it is surely a problem that would repel owners from investing long-term. But its a lack of investment in stadia from the city of Oakland that could be the major reason why the teams have decided to pack up and move on. ",
        "In the early-to-mid 1960s, Alameda County and the city of Oakland invested in building two venues to house three major sports teams. They were built right across the street from each other and were known as the Oakland Coliseum and the Oakland Arena.By the time they opened in 1966, the combined cost of construction for both venues was around $50million - equal to around $470m in today's money.At the time, both facilities were state-of-the-art with the Coliseum one of the prime examples of 'cookie cutter' stadiums - facilities that were circular in nature and big enough to house both football and baseball.The prevailing trend in American stadium design at the time was to build stadiums to house multiple teams. At the time, it seemed practical for cities looking to cut down on the costs of trying to keep multiple teams at once. Eventually, the stress of constant use and poor fan experience led to this design becoming obsolete. ",
        "But unlike other cities that had cookie cutter stadiums like Washington DC's RFK Stadium, Pittsburgh's Three Rivers Stadium, or Philadelphia's Veterans Stadium, Oakland never built a modern solution for their baseball and football teams later down the line.In total, throughout the 1960s and 1970s 11 cookie cutter stadiums were constructed - both open air examples like the ones above and domes like the Astrodome and Kingdome. Eight of them have since been demolished.",
        "Only three stadiums remain. RFK Stadium is set to be torn down this year after multiple delays in demolition. The Astrodome was designated on the National Register of Historic Places (preventing a demolition), but has been vacant since 2008.The only one that remains in active use is the Oakland Coliseum - and it has shown  serious signs of age. It underwent its last major renovation in 1996 by adding luxury boxes and tens of thousands of seats. But the core architecture has crumbled, rusted, and corroded.Last year, a letter sent by the A's to the coliseum authority lists the following complaints: seats in disrepair, plumbing leaks and backups in team offices, clubhouses, and concourses, a large population of cats on the property (with reports of cat feces), and a significant uptick in moths among other issues. ",
        "This season, a possum was spotted in the broadcast booth that has left the area 'unbearable' to work in. So, naturally, it makes sense for the Raiders and A's to want to move out of the Coliseum. But what about the Arena?",
        "At the time of the Warriors' departure, the venue was known as Oracle Arena and was enjoying great success from fans for the loud atmosphere in the building.But while the signs of erosion were not as obvious as in the Coliseum, the arena was getting outdated. An $121m renovation in the mid-1990s added luxuries seen in other newer arenas such as luxury boxes, a rebuilt seating bowl, and an updated scoreboard.While that worked for a time, the lure of a brand new building in downtown San Francisco became too much to overcome. After multiple negotiations on a new site fell through, the Warriors chose the Mission Bay neighborhood and built the Chase Center - with the team moving in at the start of the 2019-20 season.Fans in Oakland were conflicted. While many saw the building of a new arena in Oakland as a symbol of gentrification, those who supported the team felt betrayed. A ballot measure was included in the 2018 San Francisco elections to 'discourage the relocation of established sports teams.' Even though it was a non-binding measure, it was still defeated and the move went on. ",
        "Now, with the Warriors having won an NBA title in the new building, fans of Golden State can look back on Oracle Arena fondly.",
        "Golden State can also look back on their time there as the only team from Oakland that's seen some form of success in the past 20 years. Since 2000, Golden State was the only beacon of hope in the East Bay sports scene. After missing the playoffs in the first six seasons of the new millennium, they reached the Western Conference semifinals in the 2006-07 campaign.Five more years of futility followed, but the team began to grow around a new core of forward Draymond Green and guards Klay Thompson and Stephen Curry. Beginning in the 2012-13 season, the Warriors made seven straight playoff appearances - including trips to five straight NBA Finals, where they won three titles. They put up the best regular season mark of any team in the NBA history in that time as well.  Similar success could not be found in the teams that shared the venue across the road. ",
        "The Raiders showed signs of false hope to start the 2000s by making the playoffs in three straight seasons. It all capped off with a surprise trip to Super Bowl XXXVII in 2002, where they lost to the Tampa Bay Buccaneers.But any belief that this Super Bowl appearance would turn into something positive immediately vanished. Oakland wouldn't make a playoff appearance or find itself owning a winning record until 2016. The team went .500 in 2010 and 2011 but then went back to their losing ways. All told, between 2003 and their move to Vegas in 2019, the Raiders put up a record of 92-180. Since their 2002 Super Bowl trip, the Raiders have still not managed to win a playoff game and have made only two appearances in the NFL postseason. The team has gone through 13 head coaches since 2000 - including two separate tenures by Jon Gruden. To top it all off, the loss of longtime owner Al Davis in 2011 cast a shadow over the team. With his son Mark taking over, the process of relocating accelerated and was eventually finalized.Initially, there seemed to be an effort for the Raiders to want to stay in Oakland with a new stadium built on the same site. However, after the A's agreed to a new 10-year lease, Mark Davis began to look elsewhere and eventually found a new home.",
        "But no team in Oakland could be more poorly set up for success than the Athletics.Beginning with the dual ownership of Stephen Schott and Ken Hofmann and continuing when they sold the team to a consortium led by John Fisher in 2005, the Oakland A's have consistently had one of the most underfunded teams in baseball. Over the course of 24 seasons, the A's have finished in the bottom five in MLB Opening Day payroll 17 times - including two seasons where they had the worst payroll in the league.They have never been in the top half of the league's payroll in that time span and the team only began the season outside the bottom 20 in the 2004 and 2007 seasons - missing the playoffs both times.In 24 seasons, the Athletics have won exactly one non-Wild Card playoff series - when they advanced to the ALCS in 2006. There, they were promptly swept by the Detroit Tigers - who hadn't won an American League pennant in 23 seasons up until that point.It was a far cry from the success Oakland had experienced in the late 1980s and early 1990s, when the team reached the World Series in three consecutive seasons.They won the 1989 edition of the Fall Classic against the San Francisco Giants in a notable series that was postponed due to a magnitude 6.9 earthquake that rocked the Bay Area just before Game 3 of the World Series began.",
        "In the early 2000s, the team's efforts to construct a roster were highlighted in the book and eventual movie 'Moneyball' which shed light on general manager Billy Beane's efforts to build a championship team with such a small budget. Beane's reliance on advanced analytics, known as 'sabermetrics', inspired by statistician Bill James helped bring the team to consecutive postseason appearances.However, ownership's failure to properly fund the Athletics meant Beane never achieved the same success that James did while he was an advisor to the Red Sox alongside Boston's then general manager Theo Epstein. James and Epstein won the World Series with Boston in 2004, ending one of sports' most notorious curses as Beane missed the playoffs with a roster that just missed out on being paid in the top half of the majors.Throughout the 2000s and 2010s the A's kept poking around the East Bay - offering and being offered proposals to stay with new stadiums being developed. Proposed sites in Fremont and San Jose fell through. Multiple options to stay in Oakland - including in the Eastlake neighborhood near Peralta Community College or at the site of a former shipping port. But they all fell apart, were met with local opposition, or failed to gather steam.",
        "And that leads to one final factor in these moves, particularly for the baseball and football teams: the lure of a better market.Golden State didn't need to endear themselves to a new fanbase because they stayed in the same one - just moving across the Bay.But while the above factors - increasing safety issues, crumbling infrastructure, and lack of success - could keep a team away from Oakland, they wouldn't be sufficient to drive already established teams out.Both the Raiders and Athletics demonstrated at separate points that they would consider staying with new facilities. Oakland wasn't willing to put up the millions of dollars in public funding to help make that happen.Meanwhile, 550 miles to the east, the image of another city was being cleaned up.",
        "Las Vegas was seen for decades as an unfriendly town - especially to families. Being marketed as 'Sin City' - a place where gambling, prostitution, and excess was common - didn't exactly lead people to want to move their lives there.But over the years, the population in the city began to boom and the demographics began shifting towards younger people. In 1990, the population of the Las Vegas metropolitan area was just over 700,000. Within 10 years, that number was over 1.3 million.Per a 2022 estimate, the population of the Las Vegas metro area is currently over 2.3 million people - putting it within the 30 biggest metros in the nation. According to UN projections, by 2030, more than 3 million people could be living in Las Vegas. The US Census Bureau says that in the city of Las Vegas alone, almost a quarter of residents are under the age of 18.It's that shift in demographics and the boom in population that will drive teams to cities. An area with no major professional sports teams suddenly became a very lucrative and attractive market.First, the NHL granted an expansion team to the Vegas Golden Knights - who showed how successful the area could be as the team reached the Stanley Cup Final in its first season of existence. By the following year, the WNBA moved the Las Vegas Aces to the city - and this past season, they won Vegas its first ever sports championship.The Raiders saw this opportunity and after failing to secure a move back to Los Angeles - which got the Rams and Chargers back - they claimed Las Vegas all to themselves. Just three years later, the Athletics announced that they would be joining them."
    ]
}