{
    "articleURL": "/wires/ap/article-12041733/UN-denounces-Taliban-intimidation-attacks-Afghan-media.html",
    "content": [
        "ISLAMABAD (AP) - The Taliban´s intimidation, threats and attacks on Afghan journalists are unacceptable, the U.N. said Wednesday, as it expressed concern for the future of the country's media.",
        "Many journalists lost their jobs after the Taliban takeover in August 2021, with media outlets closing over a lack of funds or because staff left the country. Women journalists face additional hardships because of work bans and travel restrictions.During their previous rule in the late 1990s, the Taliban barred most television, radio and newspapers in the country.The U.N. mission in Afghanistan said that although journalists continue to work, they are forced to navigate \"unclear and often arbitrary boundaries of reporting against an ever-present threat of repression and closure.\"Its comments coincide with World Press Freedom Day, which is observed May 3.The UN secretary-general´s special representative for Afghanistan, Roza Otunbayeva, said the day was a moment to show solidarity with the Afghan journalists trying to maintain independent reporting.\"Journalists are being forced to make editorial decisions based on fear, not public interest,\" said Otunbayeva. \"The persistent intimidation, threats, and attacks on journalists are unacceptable. We urge the Taliban de facto authorities to guarantee the freedom and independence of the media, and the safety of journalists, women and men alike.\"Deputy Broadcasting Minister Mahajar Farahi denied that journalists face obstacles in Afghanistan, saying the media is carrying out its activities in a normal way.\"The Afghan press has improved compared to the past and we are still trying to work on solving the media's problems,\" Farahi told The Associated Press. \"We do not consider ourselves obliged to respond to every propaganda.\"",
        "Media watchdog Reporters without Borders ranks Afghanistan 152 out of 180 countries in its latest World Press Freedom Index, released Wednesday. It said the environment for reporters continues to worsen and women journalists have \"been literally erased from public life.\"It said 43% of Afghan media outlets disappeared after the Taliban takeover of August 2021. Of the 10,780 people working in Afghan newsrooms, 8,290 men and 2,490 women, at the beginning of that month, just 4,360 were still working in December, 3,950 men and 410 women."
    ]
}