{
    "articleURL": "/wires/reuters/article-12048177/Carlyle-shares-fall-Q1-earnings-miss-estimates.html",
    "content": [
        "By Chibuike Oguh",
        "NEW YORK, May 4 (Reuters) - Shares of Carlyle Group Inc sank on Thursday after it posted a first-quarter distributable earnings that missed most analyst estimates owing to a sharp drop in income from asset sales in its private-equity portfolio.Carlyle lowered its outlook on the closely watched fee-related earnings as it anticipates that the current economic environment would continue to limit how much buyers would pay for its assets. Carlyle's revenue from asset divestments fell 30% to $165.1 million during the quarter. \"We continue to navigate one of the most complex financial markets in recent memory, which is clouding the near-term outlook and impacting market sentiment,\" said Carlyle Chief Executive Harvey Schwartz during his first analyst earnings call since taking the top job in February. \"It's our expectation these effects will last throughout the remainder of the year and impact both FRE and distributable earnings,\" Schwartz added, referring to fee-related earnings. Carlyle's shares fell 14% in afternoon trading, declining far more than the broader market and most of its peers, which were trading lower.EARNINGS MISSCarlyle said its distributable earnings, which represent the cash used to pay dividends to shareholders, fell to $271.6 million, down from $302.8 million a year earlier. That resulted in after-tax distributable earnings per share of 63 cents, which underperformed the average analyst forecast of 69 cents, according to Refinitiv data.",
        "Last month, Blackstone Inc, the world's largest private-equity firm, reported a 36% drop in first-quarter distributable earnings due to slower asset disposals, primarily in its real estate portfolio.Carlyle's credit business recorded strong performance during the quarter, with segment distributable earnings nearly doubling to $69 million, helped by higher fund management fees from managing more assets, including from reinsurer Fortitude Re.Carlyle said its credit funds appreciated by 3%, while secondaries funds rose 5% and corporate private-equity funds gained 1%. Blackstone had said its corporate private-equity funds had appreciated by 2.8% while liquid credit funds gained 3%.Under generally accepted accounting principles, Carlyle's net income tumbled to $100.7 million, down 82% from $571.6 million a year earlier, driven by a slump in investment income.Carlyle generated fee-related earnings of $193.4 million, raised $6.8 billion of new capital, and spent $3.8 billion on new acquisitions. Its total assets under management reached a record $381 billion, up 2% from the prior quarter, driven by fund appreciation. The firm declared a dividend of 35 cents.(Reporting by Chibuike Oguh in New York; Editing by Sherry Jacob-Phillips and Lisa Shumaker)"
    ]
}