{
    "articleURL": "/news/article-12041717/Taiwan-rat-poison-victim-Alex-Shorey-flies-Toowoomba-investigations-continue.html",
    "content": [
        "Poison victim flown home from Taiwan Alex Shorey arrived on Wednesday Deliberate poisoning not ruled out Police in Taiwan are investigating whether the case of an Australian exchange student now fighting for life after consuming rat poison was an act of 'criminal intent'.",
        "Alex Shorey, 24, was flown from Taipei in a specially chartered medical aircraft to his home town of Toowoomba, 130km west of Brisbane, on Wednesday.Mr Shorey ingested superwarfarin - a highly toxic poison that stops blood from clotting - just before Easter.His family originally suspected the poison was in contaminated street food but they have revealed police are also looking into whether it was 'deliberately administered'. 'It's all speculative at the moment. All that's been confirmed is the poison,' Mr Shorey's uncle Ross Shorey-Kitson told 7News.",
        "Mr Shorey, who was on a year-long exchange program, was admitted to Taipei Medical University Hospital's intensive care on April 18 after several earlier visits over uncontrolled bleeding that saw him wake up in the morning covered in blood. He was 'bleeding heavily from the nose, bleeding into his muscles and into his joints and his lungs were filled with fluid,' his family said. After days of hemorrhaging Mr Shorey went into hypovolemic shock, meaning his organs were at risk of failing due to lack of blood. Unfortunately a severe allergic reaction to a vitamin K treatment in hospital saw him go into cardiorespiratory collapse six days later.As a result Mr Shorey has suffered organ damage, respiratory failure and anaemia. Mr Shorey's family were desperate to get him home to save his life but because he could not take a commercial flight they needed to raise the eye-watering sum of $172,000 for a specially chartered medical plane.",
        "Elizabeth Shorey-Kitson, who is Mr Shorey's aunt, launched a GoFundMe to raise the money last week.Close to 3,000 people donated raising a total of $208,682.'We are so overwhelmed and humbled by the amount of love, support and kindness we have received, and thanks to the generosity of you all, our journey to bring Alex home is now underway,' Ms Shorey-Kitson wrote.'It was huge 24/36 hours and now to have reached our goal and to have Alex booked on a plane has left us in tears of joy. We still can't quite believe it!'Alex's parents, Steve and Julie, and his brother Jean-Luc, said they were humbled by the messages of support from those who donated.Mr Shorey's charter touched down in Darwin on Wednesday afternoon before the final leg home.To support Mr Shorey's weak respiratory system the plane kept a low altitude until finally bringing him back to his much relieved family. "
    ]
}