{
    "articleURL": "/sport/football/article-12054751/Sam-Allardyces-game-offered-reasons-optimistic-Leeds-up.html",
    "content": [
        "Sam Allardyce lost his first game in charge of Leeds against Manchester CityLeeds looked to be heading for a heavy defeat but battled back after the breakAllardyce can take some confidence from the game that he can keep Leeds up Time is of the essence and that extends to the Thorp Arch car park. Sam Allardyce hastily ignored the conventions of actual spaces early on Friday morning. ",
        "There is a £3million bonus at stake here, the vehicle could straddle two. There was work to do, meetings to conduct.It was moved eventually, so the Leeds United kitman could actually enter the training ground and do his job, and Allardyce – everything about him just as big, bold and brash as we remember – now has three, rather than four, games to preserve the club’s top-flight status. A hell of a trick if he pulls that off.Despite the scoreline, and slight jeopardy at the end, the Etihad Stadium was a hiding to nothing. Not with Manchester City playing as they are, so fluidly and with the confidence of a team owning a realistic chance of finishing this season as legends.Allardyce, though, would not have you think that before this. His point about knowledge in the management sphere – ‘nobody is ahead of me’ – has merit in a longevity sense and cannot be disproved without him taking over a truly top team, with the moment for that long since passed, although it can be put down to mere bravado.",
        "The 68-year-old ought to be too long in the tooth to be falling into that trap. City eventually almost fell into a trap of complacency, not one set purposefully, and left Leeds mildly content, Allardyce gathering everyone for an impromptu debrief in front of the noisy travelling support.",
        "‘We need them,’ Allardyce said. ‘We’ve not given them a result but the players’ response in the second half shows how the players fought. I’m not upbeat because we’ve got no points but I’m pleased they haven’t embarrassed themselves. You would probably all think at half time, and rightly so: how many is it going to be?’He still believes there remains a spot for him at this level, a lengthy firm handshake with Pep Guardiola in the tunnel to welcome him back. So long, in fact, that it felt as if neither Proper Football Man – at different ends of the philosophical scale – wanted to let go first. Allardyce had attempted to sign Guardiola when replacing Fernando Hierro at Bolton Wanderers in 2005, travelling to the midfielder’s apartment in a bid to convince him. He couldn’t, Guardiola choosing to sign for Dorados de Sinaloa in Mexico instead.They were coached by Spaniard Juanma Lillo, who ultimately shaped Guardiola’s tactical understanding and had a profound effect on his future management style, later becoming his assistant at City.What might have been. In a parallel universe, Guardiola played 4-5-1 on Saturday, visibly agitated at an isolated Patrick Bamford despite the system not helping a lone striker and screaming at Weston McKennie to hurl long throws into the opposition’s box from 35 yards.",
        "Alas. Suited and with a stick of trusty Wrigley’s, Allardyce’s warpaint began to run midway through his first half as Javi Gracia’s replacement. The veteran was already nervously checking his watch 60 seconds before Ilkay Gundogan swept in the first after 19 minutes. Two of his midfielders had not completed a pass by that point.There is some mitigation with this Leeds team. A squad built for chaos and energy are not designed to sit in a low block and frustrate. Three afternoon training sessions were never going to alter that fact. This was basically another until City threatened to implode in unlikely fashion.",
        "They planned to do so without Robin Koch, dropped after missing just one league game all season, in a selection aimed at weeding out the perennial poor performers to have contributed in this long state at relegation back to the Championship. Illan Meslier, the error prone goalkeeper, sat on the bench with Joel Robles starting his first Premier League match for six years. ‘Illan wasn’t very happy,’ Allardyce said. ‘A massive call. One of the worst things you can do is take your goalkeeper out. 'It’s better for him, even though he won’t think that. It’s been pointed out to me by the staff that the midfield has been slightly weak [as well].’",
        "With only 43 minutes of competitive action under his belt this calendar year, Adam Forshaw anchored midfield, poleaxing Rico Lewis within seconds. Forthright calls to change the dynamic and there were spells where Leeds held their own, albeit with a nagging feeling that this would have become very ugly if Erling Haaland had fancied it against the city of his birth.Allardyce wants some fundamentals changing quickly. Neither of his centre halves, one in Rasmus Kristensen usually a full back, knew to split when Robles took an age to restart play, the manager fit to burst at their lack of awareness – or inability to listen to instructions.",
        "Leeds’ new boss barely moved from one patch of his technical area throughout, lamenting fourth official Thomas Bramall – encroaching onto the field at one point in rage – while later sharing a joke with Forshaw as he came off. Allardyce might not have ventured far but the supporting cast behind him certainly did. Karl Robinson, boasting the loudest whistle in football, bounded between bench and touchline, keen to be seen and dishing out much of the advice. A back seat driver constantly resting a chin on the headrest. Take a right here, mate, it’s quicker.Michael Skubala and Robbie Keane both regularly chipped in too. At one break in play, all four of them were delivering sermons to different clusters of the team.",
        "‘Even though my position is head coach, I’m a manager – I manage people,’ Allardyce said. ‘Without the coaches I can’t do my job. We’ve been together all night every night plotting. My biggest strength is making people feel better. Do better. Karl is an outstanding coach. I only got to know Robbie at Soccer Aid but the lads love him already.’"
    ]
}