{
    "articleURL": "/wires/ap/article-12060307/Law-passed-stop-doping-nets-1st-guilty-plea.html",
    "content": [
        "A man charged with providing banned substances to Nigerian sprinter Blessing Okagbare and another athlete pleaded guilty Monday, marking the first conviction under a landmark U.S. law designed to target wide-ranging doping schemes across the globe.",
        "Eric Lira pleaded guilty for his role in helping Olympic athletes obtain performance-enhancing substances before the Tokyo Olympics in 2021.The U.S. attorney in Manhattan, Damian Williams, called the plea \"a watershed moment for international sport.\"\"Craven efforts to undermine the integrity of sport subverts the purpose of the Olympic games: to showcase athletic excellence through a level playing field,\" he said in a news release. \"Lira's efforts to pervert that goal will not go unpunished.\"Williams' office did not provide any information about the terms of the plea by the 43-year-old kinesiologist and naturopathic doctor from El Paso, Texas. Violations of the law, called the Rodchenkov Act and named after the former Moscow lab director-turned-whistleblower in the Russian doping scandal, carry a maximum penalty of 10 years in prison.An indictment unsealed last year revealed texts between Lira and Okagbare, who is serving an 11-year ban for taking human-growth hormone and the blood booster erythropoietin (EPO) and also for failing to cooperate with the investigation.",
        "The news release said a second athlete receiving drugs from Lira competed for Switzerland and also has been banned for PEDs. Williams' office said Lira advised the athletes they should blame their positive tests on contaminated meat \"knowing full well that the drug tests had accurately detected the presence of banned, performance-enhancing drugs.\"",
        "The case stemmed from information whistleblowers provided to the U.S. Anti-Doping Agency, which worked with the FBI to investigate Lira's system of channeling drugs from Central and South America to the athletes and others.USADA CEO Travis Tygart said the law, passed in 2020, is especially important considering the U.S. will host the World Cup in 2026 and Summer Olympics in 2028. He thanked the FBI and Williams' office for pursuing the case.\"The leadership they have shown in this matter sends a powerful message that the rules of sport matter and that the U.S. is committed to rooting out and penalizing fraudulent activity that robs clean athletes and the public,\" Tygart said.International sports regulators, including the World Anti-Doping Agency and the IOC, have criticized key elements of the Rodchenkov Act. In a letter WADA sent to the Senate in 2020 to lobby for changes in the bill, it said that it supported the objectives of the legislation but argued the law would lead to a \"chaotic World Anti-Doping system with no legal predictability.\"Proponents of the bill said it brings another layer of accountability to a system that has failed over the years, including allowing the Russians to run roughshod over the rulebook in a scandal that has sullied the Olympic movement for longer than a decade.",
        "They also argue that because the bill is geared toward stopping widespread doping conspiracies, and not necessarily individual cheaters, athletes won't be singled out for criminal liability in the U.S. simply for taking performance enhancers.___More AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports"
    ]
}