{
    "articleURL": "/tvshowbiz/article-12051475/Aaron-Chalmers-ex-shares-photos-son-Oakley.html",
    "content": [
        "Aaron Chalmers' ex girlfriend, Talia Oatway, has shared the first photos of their son Oakley as she discussed his rare genetic syndrome and detailed the tot's strength. ",
        "The couple, who share two other children together, announced their split in December, four months after their youngest was born with serious health issues.After keeping his diagnosis private, Talia explained that Oakley, 7 months, was born with Apert Syndrome, in a heartbreaking update shared this week.Following his birth Aaron and Talia revealed their 'little soldier' would be 'in and out of surgery for 18-24 months', with his mother staying by his side. In a brave caption, the influencer detailed the 'toughest seven months of her life' and praised her son for his bravery and determination, after finally 'coming to terms with everything.'",
        "The NHS describes Apert Syndrome as 'a type of complex craniosynostosis that effects the skull, hands and feet,' with bones fusing together before birth. 'The facial bones are also affected, as the cheekbones and upper jaw do not grow in proportion to the rest of the skull. The bones around the eyes are wider spaced and shallower than usual, causing the eyes to bulge outwards.'Sharing a series of photos from the hospital, Talia cradled Oakley in her arms, another sweet snap showed him smiling widely with a stuffed toy monkey.  She penned: 'This is OAKLEY. It has been the toughest 7 months of my entire life. I have been thrown into a medical world, with no forewarning, no time to prepare. ",
        "'Only now I feel like I’m coming to terms everything, finally coping with how I’m feeling, embracing our new normal.'This is my beautiful son Oakley Bleu, he was born with a rare genetic syndrome called Apert Syndrome.'Apert Syndrome causes the premature fusion of sutures in the skull, causing a different head shape. Syndactyly - fusion of the bones in the hands &amp; feet). Cleft of the hard palate causing difficulties with feed and speech.'Choanal stenosis (narrowing of the airway) causing breathing difficulties. Apert Syndrome often causes a global developmental and learning delay. (Oakley sleeps on a vent mask) and uses oxygen.'",
        "Talia continued: 'Oakley has a long road ahead, this is a lifelong journey and it isn’t going to be easy. But my boy, you have shown me how strong you are! 'You are brave and determined and I love you more than you’ll ever know. I hope that by sharing our journey I can raise awareness and support other medical families.'I’m so proud of this boy, he has shown me nothing in this world matters but health and love. It has taken me a long time to get where I am but finally I’m starting to feel happy again. 'Son, you have two amazing brothers and an amazing big sister behind you. We have absolutely everything we need. Let’s do this,' she concluded. ",
        "Aaron and Talia share Romeo, two and Maddox, 22 months. While Talia is mum to daughter Siennah from a previous relationship. After a slew of rows between the pair, it was been reported that Talia has moved out of their family home following the break-up in December. A representative for Aaron confirmed to MailOnline that the pair have parted ways. Back in August, the pair opened up about going through a 'difficult time' as their son Oakley was born with health issues - meaning the tot will requires surgery for the next 18-24 months.Taking to his Instagram stories at the time, Aaron opened up on his son's condition and revealed that his partner Talia required Maternal–fetal medicine throughout the pregnancy.Aaron also noted that he and Talia were a 'whirlwind of emotions' following a difficult few days for the family. ",
        "Fetal medicine is described, also known as perinatology, is described as 'a branch of medicine that focuses on managing health concerns of the mother and fetus prior to, during, and shortly after pregnancy.'Talking to his followers, Aaron explained: 'Unfortunately there's been a few issues with the baby.'We're in fetal medicine for most of the pregnancy, then we got cleared, unfortunately it wasn't cleared, and it wasn't picked up on the scans, so the little bubba is probably going to be in and out of surgery for the next 18 months to 24 months, so just me and Talia are coming to terms with everything.'",
        "While Talia simply said: 'Been a long and hard few days couldn't of done it with out my man Aaron.'"
    ]
}