{
    "articleURL": "/femail/fashionfinder/article-12038043/Get-Met-Gala-look-high-street-best-dresses.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Fashion Finder article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information. ",
        "The first Monday in May is the biggest date in any fashionista’s diary.The opening of the Costume Institute’s annual fashion exhibition in New York is a chance for the biggest names in the business to get glammed up on another level than your regular red carpet events.This year, Met Gala attendees paid homage to the late Karl Lagerfeld, and as ever, there were some super bold moments (Jared Leto dressed as Choupette the cat, we’re looking at you).",
        "But there was plenty to take with us into our own everyday wardrobes too. You don’t have to ascend the iconic steps of the Met yourself to get the look!We weren’t surprised to see a lot of monochrome, but white dresses really did seem to be the way to go.Classic Karl icons such as pearls and camelias were incorporated by Kim Kardashian, Emily Blunt and Rihanna.",
        "Boucle will always be synonymous with Chanel, so Anne Hathaway has to be up there with our favourites too.With these leading ladies in mind, not only have we’ve tracked down 10 of the best head-turning dresses, including Chanel-esque high street finds to give your Bank Holiday Monday a bit of Met Gala glamour...Get the Met Gala look   Boohoo Sequin Split Cuff Power Shoulder Shirt Dress  Kendall Jenner was a vision in sequins at the Met Gala. And this affordable dress from Boohoo is made for hitting the dancefloor with its small disco-shaped discs that will make you sparkle from every angle.  £15 (save £35) Shop  Pretty Little Thing Red Acetate Slinky Cut Out One Shoulder Dress  Get inspired by Kylie Jenner's Met Gala Jean Paul Gaultier dress and strike a pose in this firey alternative from Pretty Little Thing.  £19 (save £3) Shop  Pretty Little Thing Black Pearl Strap Velvet Midaxi Dress   Like Lizzo, opt for pearls and shop this curve-accentuating velvet dress with elegant pearl straps.  £25 (save £5) Shop  Pretty Little Thing Black Cup Detail Faux Feather Bodycon Dress  Make a statement in this black faux feathered dress and pair it with pearl drop earrings inspired by Sienna Miller's 2023 Met Gala look.  £31.50 (save £13.50) Shop  Karen Millen Textured Satin Lace Trim Woven Maxi Slip Dress  This stunning slip dress nods to the 90s and Kate Moss's Fendi Met Gala Dress. Pair with heels and an oversized blazer for an effortlessly cool look.  £58 (save £57) Shop  Karen Millen Tweed Dress  There was always going to be a bit of boucle on Monday’s red carpet. We’re only surprised we didn’t see more!  £80 (save £79) Shop  Club London Aniyah Black Lace Bardot Fishtail Maxi Dress  If you loved Billie Eilish's sheer black gown at the Met Gala, this sultry fishtail maxi dress from Club London screams gothic glam with its bardot neckline and impossibly chic lace sleeves that could be mistaken for gloves.  £150  Shop  Club London Cosmo Hot Pink Bandeau Corset Maxi Dress with Feather Trim Like Viola Davis' Valentino Met Gala dress, this striking pink number is trimmed with faux feathers across the neckline.  £150 Shop  ASOS Edition Pearl Dress This ASOS dress will make you feel like a pearly queen in time for the Coronation next weekend.  £230  Shop  Ted Baker Rose Texture Dress Anything Rihanna is doing style-wise at the moment, we want in!  £325 Shop"
    ]
}