{
    "articleURL": "/wires/reuters/article-12053451/Joc-Pederson-tags-Corbin-Burnes-Giants-edge-Brewers.html",
    "content": [
        "Joc Pederson continued his mastery of Corbin Burnes with a two-run, go-ahead single in the fifth inning and the San Francisco Giants held off the visiting Milwaukee Brewers 6-4 in the opener of a three-game series Friday night.",
        "J.D. Davis had a two-run home run and Wilmer Flores a solo shot as a pinch hitter for the Giants, who fell behind by two runs on two occasions before immediately rallying with multiple runs en route to their third consecutive victory.The second comeback began after the Brewers had used a double steal, a throwing error by Giants catcher Joey Bart and an Owen Miller sacrifice fly to put up two runs in the top of the fifth for a 4-2 lead.San Francisco got within 4-3 on Thairo Estrada's two-out, run-scoring chopper off the glove of Burnes (3-2), before the Milwaukee ace walked Davis to load the bases for Pederson.In a battle pitting Pederson, a former San Francisco Bay Area high school star outfielder, against Burnes, a former standout pitcher at nearby Saint Mary's College, Pederson lashed a 2-2 pitch for a single up the middle to give the hosts a lead they never relinquished.The hit was the sixth of Pederson's career and the RBIs the fourth and fifth in 19 at-bats against Burnes in their head-to-head matchups.Burnes was pulled after six innings, charged with five runs, only two earned. He gave up four hits and three walks, while striking out five.Sean Manaea (1-1) also was the victim of unearned runs -- a pair -- in his five innings. He allowed four runs overall and six hits, with two walks and six strikeouts.",
        "Giants relievers John Brebbia, Tyler Rogers and Camilo Doval finished up with four innings of one-hit relief and six strikeouts. Doval earned his sixth save by working around a two-out walk in the ninth.Flores' homer, his sixth of the season, came as a pinch hitter for Pederson leading off the eighth against lefty reliever Hoby Milner to complete the scoring.Davis produced San Francisco's first two runs with his seventh homer of the season in the bottom of the first.Seeking to end a four-game losing streak, the Brewers had scored twice in the top of the first on a Willy Adames RBI single and Miller's dash to the plate from third base as Brian Anderson was being tagged out between first and second, ending the inning, after being picked off by Manaea.Adames was the only player in the game with two hits, helping the Brewers out-hit the Giants 7-5.--Field Level Media"
    ]
}