{
    "articleURL": "/tvshowbiz/article-12058373/The-Project-Waleed-Aly-launches-scathing-attack-against-social-media-vows-never-use-it.html",
    "content": [
        "Waleed Aly has set the record straight on why he refuses to use social media.",
        "The veteran TV presenter, 44, appeared on The Matty Johns Podcast on Sunday and said he has 'major problems' with social media and will never use it.'It's a disaster. I've never been on it, and I have no interest in being on it. I think it's one of the worst things humans have invented in the last 50 years,' he told Johns. Aly said he believed there were no 'meaningful' conversations on platforms such as Instagram and Twitter because users posted in a 'performative' manner.'Meaningful speech is where minds and ideas meet and contest. But social media turns all of that sort of interaction into performance. ",
        "'And when you are performing, you're in a very different mode than when you are discussing,' he added.He said he will always prefer in-person discussion over Twitter debates, where the desire to get likes and retweets sees people 'putting on a show'.Aly has found himself as the oldest surviving member of The Project cast after a slew of high profile departures last year. ",
        "And in March, the journalist admitted it has been something of an adjustment to no longer be working alongside his good friends on the embattled current affairs show. 'I feel their absence,' the 44-year-old told Stellar Magazine's podcast Something To Talk About. ",
        "'But when you've got a new group of people to work with, you almost don't have time for that, especially not when you're in the middle of it' he added. Waleed says he was genuinely good friends with his former co-stars, especially Peter Helliar and Carrie Bickmore. The TV star said that he shares 'quite deep relationships' with his co-stars, but 'busyness may get in the way' of them catching up. "
    ]
}