{
    "articleURL": "/tvshowbiz/article-12055677/MasterChefs-Andy-Allen-pay-tribute-Jock-Zonfrillo-TV-interview-death.html",
    "content": [
        "MasterChef judge Andy Allen will pay tribute to his co-star Jock Zonfrillo during a special episode of The Project on Sunday.",
        "The esteemed chef, 35, was left heartbroken after his beloved co-star Zonfrillo tragically died last week aged 46.It will be Allen's first interview since the shock news broke on Monday that Zonfrillo was found dead in Melbourne, just hours before MasterChef was set to premiere. Channel Ten said in a statement that Allen will be one of 'many of the world's most famous chefs' paying tribute to Zonfrillo on The Project.Zonfrillo's death on April 30 hit Andy particularly hard as it was supposed to be a day of celebration for him, as it was his 35th birthday.",
        "The interview will air at 6.30pm in the slot prior to the rescheduled MasterChef premiere on Sunday.Andy paid tribute to Jock on Instagram last week, writing: 'You've taught me so much about food, but it's the lessons I learnt about what it means to be a great father, husband and friend that I'll take away from our time together and will last forever.'Season 15 of the show had been due to launch on May 1 but it was pushed back after the Scottish chef was was found dead by police at a Melbourne hotel at 2am on Monday.'With the full support of Jock Zonfrillo's family, MasterChef Australia will air at 7.30pm on Sunday, 7 May,' read a Channel 10 statement shared to Instagram on Wednesday.",
        "'It is with Jock in our hearts that we cherish this season and remember the charismatic and big-hearted Judge and Chef who we knew and loved,' it went on. 'Jock will be remembered in the MasterChef Australia kitchen for years to come.'",
        "The network added that a special edition of The Sunday Project will pay tribute to Jock from 6.30pm on Sunday before the new series airs. 'With contributions from friends, he held closely, the show will honour Jock by reflecting on his personal and professional life in a celebration of his incredible achievements,' the statement continued.Production wrapped on the 62-episode season at MasterChef HQ in Flemington, Melbourne, last month.MasterChef Australia premieres Sunday, May 7 at 7:30pm on Channel 10 "
    ]
}