{
    "articleURL": "/wires/pa/article-12061553/Prince-Harry-s-ghostwriter-recalls-frenzied-response-Spare-s-publication.html",
    "content": [
        "The ghostwriter behind the Duke of Sussex’s controversial memoir Spare has recalled the “frenzied” response to the book’s publication.",
        "John Moehringer said that in the days and weeks after the release he had been harassed and “stalked” by members of the media, and that passages in the book had been “hyped into outrages”.In an article for The New Yorker, Moehringer recounted his experience with the duke, after having been approached to ghostwrite his memoir in the summer of 2020.He said the pair had argued over details of the book multiple times, including a heated row at 2am in 2022 over an anecdote about Harry’s military training.",
        "The duke had been involved in a “gruelling” terrorist capture simulation, during which he had been beaten, that had culminated in an insult being made about his mother Diana, Princess of Wales.Moehringer said Harry had requested he include his response to the “captors” but he had refused, telling the duke it would “dilute” the scene’s meaning.“Although this wasn’t the first time that Harry and I had argued, it felt different,” he said.“It felt as if we were hurtling toward some kind of decisive rupture, in part because Harry was no longer saying anything… he was just glaring.”Spare became the fastest-selling non fiction book in the UK of all time when it was published in January 2023.Moehringer said that following the publication, the response had been that of a “frenzied mob” and that he and his family had been targeted by the paparazzi.",
        "“The British press now converted the book into their native tongue, that jabberwocky of bonkers hot takes and classist snark,” he said.“Facts were wrenched out of context, complex emotions were reduced to cartoonish idiocy, innocent passages were hyped into outrages—and there were so many falsehoods.” The British press now converted the book into their native tongue, that jabberwocky of bonkers hot takes and classist snark.  John Moehringer  He recalled how while taking his son to preschool, he had been “stalked” by a paparazzo, who had stood in the middle of a road in order to take a picture.Moehringer added that a newspaper journalist had appeared at his window while he was working later that same day.In the first-person piece he said that the experience had helped him understand Harry better, after his name was leaked ahead of Spare’s publication.Moehringer has ghostwritten for other high-profile celebrities including former tennis champion Andre Agassi and Nike co-founder Phil Knight.The full article can be read online on The New Yorker’s website.It comes after Harry returned to his home in Montecito, California, after a brief visit to the UK for the King’s coronation on Saturday."
    ]
}