{
    "articleURL": "/news/article-12052709/TikTok-workers-tracked-users-watched-gay-content-blackmailed-report-says.html",
    "content": [
        "TikTok reportedly kept close watch on users who were watching LGBT content and put their names on a list The list was maintained in China but was accessible to the company charged with managing TikTok's data in the USEmployees made management aware of their concerns that the data could be used for blackmail in 2022 but nothing was done TikTok staff in China maintained a database on users who watched LGBT content, according to a bombshell new report. ",
        "Typically users do not have to disclose their sexual preference when signing up for TikTok but videos that are related to LGBT interests are categorized internally, reports the Wall Street Journal. A former employee told the newspaper that workers have been accessing the list for around a year. TikTok is owned by parent company ByteDance, which has offices in Beijing.Management in the US, United Kingdom and Australia were made aware about employee's concerns regarding the monitoring of LGBT users in 2022. Employees stressed that access to such data in countries where homosexuality is a crime could be dangerous to the app's users or could result in blackmail. Access to the list was restricted but it remained intact. ",
        "The platform has 150 million American users but it’s been dogged by persistent claims that it threatens national security and user privacy or could be used to promote pro-Beijing propaganda and misinformation. In March, CEO Show Zi Chew appeared before the House Committee on Energy and Commerce to answer to some of those claims. Chew attempted to persuade lawmakers not to pursue a ban on the app or force its sale to new owners. TikTok takes all videos produced by users and divides them into categories and then into sub-categories, the employee told WSJ. The sub-categories for the category 'alt female' include: 'tattoos, some lesbian content, and “Portland.”'",
        "Other employees told WSJ that the categorization was used to boost engagement and keep an eye on trending topics. Despite access to the list of categories being restricted in 2022, it remains accessible to the company that maintains TikTok's data in the US, reports the WSJ.In 2020, TikTok began a $1.5 billion program dubbed Project Texas, that places data from US users through servers controlled by Oracle, the Silicon Valley company it partnered with in an effort to avoid a nationwide ban.Older U.S. user data stored on non-Oracle servers will be deleted this year. Under this arrangement, there’s no way for Beijing to access the data, according to TikTok's CEO. Speaking to the newspaper, the company said that the monitoring of LGBT viewership numbers was no different to the monitoring of other content viewership. ",
        "On the same day that the Wall Street Journal report emerged, the British journalist who was spied on by TikTok spoke out about the surveillance, which was first reported in December. British journalist Cristina Criddle was spied on by TikTok in an attempt to identify the sources of her critical stories.Tech workers snooped on the location of Financial Times technology correspondent Criddle through an account she had set up in the name of her pet cat, Buffy.",
        "The hack of Criddle’s and another journalist’s phones were blamed on the ‘misconduct of a few individuals’ by Beijing-based parent company ByteDance.But experts say significant effort must have been put into tracing her via the cat account, which did not mention her real name and had only 170 followers.Hackers attempted to compare her IP address – the unique number for every device connected to the internet – with work colleagues suspected of briefing her, in order to prove they had been in proximity to each other.Speaking about it for the first time, Criddle told the BBC that the ‘really chilling’ episode was ‘quite violating’.She added: ‘I’m super-careful now. I have to make sure that there is no chance that my devices are being tracked. If my location was being monitored 24/7, that’s not just limited to my actions at work... this was in my personal life as well.’ByteDance has said it ‘deeply regrets’ the ‘significant violation’ of its rules and fired those involved.Asked about the incident in March at his US congressional committee hearing, TikTok's CEO claimed: ‘I don’t think that spying is the right way to describe it.’Both the FBI and officials at the Federal Communications Commission have warned that ByteDance could share TikTok user data — such as browsing history, location and biometric identifiers — with China’s authoritarian government. ",
        "Officials fear that TikTok, which like many other social media platforms collects vast amounts of data on its users, would be forced to give it to Beijing under a 2017 law that compels companies to turn over any personal data relevant to China’s national security.The White House ordered U.S. federal agencies to delete TikTok from all government-issued mobile devices. Congress, the U.S. armed forces and more than half of U.S. states had already banned the app. "
    ]
}