{
    "articleURL": "/wires/pa/article-12050623/Wagner-Group-boss-threatens-Bakhmut-pullout-Ukraine.html",
    "content": [
        "The owner of Russia’s Wagner Group military contractor has threatened to pull his troops out of the protracted battle for the eastern Ukrainian city of Bakhmut next week, accusing Russia’s military command of starving his forces of ammunition and causing them heavy losses.",
        "Yevgeny Prigozhin, a millionaire with long-standing links to Russian President Vladimir Putin, claimed that Wagner had planned to capture Bakhmut by May 9.That day is a major Russian holiday marking the defeat of Nazi Germany in the Second World War.However, Mr Prigozhin said his forces have not received enough artillery ammunition supplies from the Russian military since Monday.Known for his bluster, Mr Prigozhin has previously made unverifiable claims and made threats he has not carried out.Hours before releasing the statement, Mr Prigozhin’s spokespeople published a video of him angrily demanding ammunition from Russian defence minister Sergei Shoigu and general staff chief Valery Gerasimov.In the video, Mr Prigozhin stands in front of around 30 uniformed bodies lying on the ground. He says they are the bodies of Wagner fighters who died on Thursday alone.Mr Prigozhin speaks in a furious tone and uses numerous expletives in the video.“These are someone’s fathers and someone’s sons,” Mr Prigozhin says, pointing at the bodies. “The scum that doesn’t give us ammunition will eat their guts in hell.”He alleged that Russia’s regular army was supposed to protect the flanks as Wagner troops pushed forward but is “barely holding on to them”, deploying “tens and rarely hundreds” of troops.“Wagner ran out of resources to advance in early April, but we’re advancing despite the fact that the enemy’s resources outnumber ours fivefold,” Mr Prigozhin’s statement continued. “Because of the lack of ammunition, our losses are growing exponentially every day.”",
        "The Wagner Group has spearheaded the struggle for control of Bakhmut, which is the longest – and likely bloodiest – battle of the war. The more than eight months of fighting there is believed to have cost thousands of lives, though neither side is saying how many.Mr Prigozhin has toured Russian prisons to recruit fighters, promising inmates pardons if they survive a half-year tour of front-line duty with Wagner.Western countries and United Nations experts have accused Wagner mercenaries of committing numerous human rights abuses throughout Africa, including in the Central African Republic, Libya and Mali.Bakhmut, located about 34 miles north of the Russian-held regional capital of Donetsk, has tactical military value for Moscow, though analysts say it will not be decisive in the war’s outcome.The city had a pre-war population of 80,000 and was an important industrial centre. It is now a devastated ghost town, but it has become an important symbol of Ukrainian resistance to Russia’s invasion, with Ukrainian President Volodymyr Zelensky saying its capitulation could begin building international support for a deal that could require Ukraine to make unacceptable compromises.Mr Prigozhin’s statement said that Wagner will be forced to pull out of Bakhmut on May 10 and have Russia’s regular army take over, “because without ammunition, (Wagner fighters) are doomed to a senseless death”.",
        "He accused “jealous military bureaucrats” of denying him ammunition.Western officials and analysts believe Russia has run low on ammunition as the 14-month conflict became bogged down in a war of attrition over the winter, with both sides resorting to long-range bombardments.It is not the first time Mr Prigozhin has raged about ammunition shortages and blamed Russia’s military, with which he has long been in conflict. He has already threatened to withdraw from Bakhmut once, in an interview with a Russian military blogger last week, if the situation with ammunition does not improve.Asked by The Associated Press about Mr Prigozhin’s statement, Kremlin spokesman Dmitry Peskov said he had seen refences to it in the media but refused to comment further.The Russian military did not immediately comment on the statement either.Also Friday, an oil refinery in Russia’s southern Krasnodar region which borders the annexed Crimean Peninsula briefly caught fire after it was attacked by a drone, Russia’s state news agency Tass reported, citing emergency officials. The fire was small and was quickly put out, the report said.It marks the second straight day that the Ilyinsky refinery had came under a drone attack. Drone attacks on oil facilities in Russian regions on the border with Ukraine have been reported almost daily over the past week."
    ]
}