{
    "articleURL": "/news/article-12043299/Bidens-criminal-BRIBERY-scheme-foreigner-GOP-claims-VP-offered-cash-access.html",
    "content": [
        "FBI file allegedly has details involving a Biden scheme involving cash for accessRepublicans have now subpoenaed the FBI, asking them to hand it overThe foreign national involved is unnamed, but it is a significant update in the investigation into the Biden family probe 'The American people need to know if President Biden sold out the United States of America to make money for himself,' Rep. James Comer said The FBI has a document detailing an alleged cash for access 'criminal scheme' involving Joe Biden and an unnamed foreign national when he was vice president, Republicans said in a bombshell development in the investigation into the president's family. ",
        "A whistleblower has come forward with stunning claims that a file 'includes a precise description of how the alleged criminal scheme (involving Biden) was employed as well as its purpose', top GOP members of the House and Senate have said.Senator Chuck Grassley, R-Iowa and House Oversight Committee Chairman James Comer, R-Ky., have now issued a subpoena to the FBI demanding the internal document be handed over.It is a significant update in the Republican 'influence-peddling' probe into the Biden family and come just hours after a report said prosecutors were close to deciding whether to criminally charge Hunter Biden in his tax and gun probes. The House Oversight Committee has accused multiple members of the Biden family - including Hunter and Hallie - were involved in 'shady' business deals where they profited off of the family name.'We believe the FBI possesses an unclassified internal document that includes very serious and detailed allegations implicating the current President of the United States,' Grassley said.'What we don’t know is what, if anything, the FBI has done to verify these claims or investigate further. The FBI’s recent history of botching politically charged investigations demands close congressional oversight.'",
        "In a letter to Attorney General Merrick Garland and FBI Director Chris Wray Wednesday obtained by DailyMail.com, the top Republicans state that due to 'credible' whistleblower disclosures, they are seeking access to an internal 'FBI-generated FD-1023 form' through a subpoena. ",
        "The form allegedly details an 'arrangement' between Biden and an unnamed foreigner for an exchange of money for policy decisions, they say.'We have received legally protected and highly credible unclassified whistleblower disclosures. Based on those disclosures, it has come to our attention that the Department of Justice (DOJ) and the Federal Bureau of Investigation (FBI) possess an unclassified FD-1023 form that describes an alleged criminal scheme involving then-Vice President Biden and a foreign national relating to the exchange of money for policy decisions,' the senators write.'It has been alleged that the document includes a precise description of how the alleged criminal scheme was employed as well as its purpose.'The lawmakers say that it 'remains unclear what steps, if any, were taken to investigate the matter,' which is concerning due to the 'significant public interest' in the FBI's response. They also say that there is is concern among Americans due to the 'FBI's track record of allowing political bias to infect their decision-making process, necessitate exacting congressional oversight.'According to the subpoena, Wray has until May 10 to turn over the documents. The subpoena specifically instructs the FBI director to produce 'all FD-1023 forms, including within any open, closed, or restricted access case files, created or moderated in June 2020, containing the term 'Biden,' including all accompanying attachments and documents to those FD-1023 forms.'",
        "'The information provided by a whistleblower raises concerns that then-Vice President Biden allegedly engaged in a bribery scheme with a foreign national,' Comer added in a statement. 'The American people need to know if President Biden sold out the United States of America to make money for himself. Senator Grassley and I will seek the truth to ensure accountability for the American people,' the chairman continued.DailyMail.com reached out to the FBI for comment. A DOJ spokesperson said the department has received the letter, but declined to comment further.Iam Sams, White House spokesperson for oversight and investigations posted a response to Twitter calling the GOP action 'unfounded' and 'politically motivated.''For going on 5 years now, Republicans in Congress have been lobbing unfounded politically-motivated attacks against [President Biden] without offering evidence for their claims. Or evidence of decisions influenced by anything other than U.S. interests,' he claimed.'That’s because they prefer floating anonymous innuendo, amplified by the megaphone of their allies in rightwing media, to get attention and try to distract and deflect from their own unpopular ideas and lack of solutions to the issues the American people actually care about,' Sams added in a statement to DailyMail.com.'When it comes to President Biden’s personal finances, anybody can take a look: he has offered an unprecedented level of transparency, releasing a total of 25 years of tax returns to the American public.'",
        "The action by the Republicans signal they are stepping up the ongoing probe into the Biden family's business dealings.Sen. Ron Johnson, R-Wis., called the whistleblower's claim an 'unbelievably serious allegation.'The Republican added during an interview on Fox News Wednesday: 'we've got the onion in front of us and we're peeling off layers bit by bit,' he said of the larger Biden family corruption probe.Rep. Andy Biggs, R-Ariz, simply stated on Twitter: 'The walls are closing in on Biden.' As part of the ever-growing investigations against Hunter Biden, Republicans on the House Oversight Committee have also reviewed IRS documents and Suspicious Activity Reports (SARs) they claim prove that the Biden family corruption and influence peddling has benefitted at least 12 family members. Comer said last month that there won't be anyone 'left for a Christmas picture' because the 'entire Biden family' is entrapped in the financial enrichment scheme. According to the SARs reviewed by Comer's committee, he previously confirmed President Biden's brother Jim Biden and his son Beau's widow Hallie Biden benefited from the foreign business deals. Another whistleblower from the IRS recently came forward claiming that a senior Biden administration official interfered with the DOJ's special counsel probe into Hunter Biden led by U.S. Attorney David Weiss of Delaware.",
        "DailyMail.com previously confirmed that the 'senior official' in question is Garland. Garland has vouched for the independence Weiss, and testified in Congress that the probe is being conducted impartially.'He has been advised he is not to be denied anything he needs,' Garland told the Senate Judiciary Committee recently. 'I have not heard anything from that office to suggest that they are not able to do everything the U.S. attorney wants to do.'Weiss is reportedly close to wrapping up the four-year-long investigation into the president's son's alleged tax and gun crimes.The U.S. attorney met with officials at DOJ headquarters in Washington, D.C., last week - another signal that the probe may be wrapping up soon. "
    ]
}