{
    "articleURL": "/wires/reuters/article-12061541/Gambling-probe-investigating-athletes-Iowa-Iowa-State.html",
    "content": [
        "The Iowa Racing and Gaming Commission has launched an investigation into alleged sports wagering violations committed by athletes at Iowa and Iowa State.",
        "\"The commission takes the integrity of gaming in the state seriously and is continuing to monitor the situation and will provide any additional information when able,\" Brian Ohorilko, the director of gaming for the state's commission, told Action Network on Monday.The University of Iowa confirmed it was aware of the state panel's probe, saying that on May 2 school leadership was \"notified of potential criminal conduct related to sports wagering that also suggested possible NCAA violations.\"At least four Iowa baseball players were suspended for a weekend series against Ohio State. One of the players sidelined was Iowa slugger Keaton Anthony, who's hitting a team-best .389 with nine home runs on the season.At the time, Iowa athletics said it \"withheld some student-athletes from competition\" in the Hawkeyes' series over \"a potential violation.\" The university did not elaborate.But on Monday, the university said 26 current student-athletes from baseball, football, men's basketball, men's track and field and men's wrestling were suspected of betting on sports -- along with one full-time employee of Iowa athletics.Not long after that news broke, Iowa State revealed that \"approximately 15\" of its student-athletes were also facing allegations related to sports wagering.\"Iowa State University and its Department of Intercollegiate Athletics is aware of online sports wagering allegations involving approximately 15 of our active student-athletes from the sports of football, wrestling and track &amp;amp; field in violation of NCAA rules,\" Iowa State athletics said in a statement. \"The university has notified the NCAA and will take the appropriate actions to resolve these issues.\"",
        "Both are public institutions that fall under the same board of regents.\"The Board of Regents is aware of concerns related to online gambling involving individuals associated with the University of Iowa and Iowa State University,\" the board said in a statement. \"The Board of Regents and the universities will fully cooperate with any investigations related to these concerns. We are closely monitoring the situation and have confidence that University administrators at each institution will take all necessary steps to ensure ongoing compliance.\"The probe comes in the wake of a similar investigation into Alabama baseball that led to the dismissal of Crimson Tide coach Brad Bohannon.Iowa baseball is 34-12 (10-7 Big Ten) and figures to be headed to the NCAA Tournament.--Field Level Media"
    ]
}