{
    "articleURL": "/news/article-12043057/Drunk-man-underpants-punched-ground-DCI-Banks-star-no-memory-day-attack.html",
    "content": [
        "Actor Stephen Tompkinson, 57, denies charges of inflicting grievous bodily harmKarl Poole said injuries meant he could not remember attack and day leading upPoole dressed in just underpants after swimming in the North Sea in May 2021The drunken man in his under pants punched to the ground and left with 'traumatic brain injuries' by DCI Banks star Stephen Tompkinson claims he has no memory of the day leading up to the attack.",
        "Karl Poole was confronted for drunkenly making noise outside the actor's home, a court heard today.The 57-year-old is accused of inflicting grievous bodily harm on Poole - who jurors were told was dressed in just his underpants after swimming in the North Sea - on May 30, 2021.On the first day of his trial, prosecutor Michael Bunch told jurors Tompkinson - also famous for roles in Ballykissangel, Wild At Heart and Brassed Off - called police at about 5.30am to report two drunken men outside his house in Whitley Bay, North Tyneside. Poole gave evidence to say his injuries meant he could remember nothing of the attack and the entire day leading up to it had been wiped from his memory.",
        "He said: 'I can remember the Friday prior to it but I don't remember waking up the next day. I don't remember playing golf that day but I have been told I played golf.'I have no recollection at all of Saturday May 29.'My first memory I have was the following Wednesday was when I woke up in hospital and a nurse said: \"You have had a rough few days haven't you?\"'I thought I had been taken in the night before.'The court was told Mr Poole had given a signed statement about the events of the night in June 2021- events which he now says he cannot recall.",
        "He told the court the memory loss was a result of concussion he suffered in the alleged attack and that despite giving a statement he could no longer remember the events in it.Nicholas Lumley, KC, defending, read out a statement that Mr Poole gave to a police officer on the night he was injured.He allegedly told the police officer: 'I got bashed up by someone in the street. I can't remember a lot of it, I was in the street in the middle of the night, someone came out and said we were making noise and started on me, it was unnecessary really. I remember being pushed over and bashing my head.'",
        "Mr Poole said: 'I can see that you're trying to make it seem as though I was pushed, but I can't remember it.'Mr Tompkinson told officers he had taken a bottle of Jagermeister from them and wanted them 'moved on', the Newcastle Crown Court heard.About half an hour later, a neighbour called the emergency services to report that one of the men was lying unconscious in the street.The court heard Caroline Davidson, who watched the alleged clash from her bedroom window, later told officers she saw Tompkinson slap Mr Poole with his right hand before punching him to the head with his left fist.",
        "She said Mr Poole stumbled and then fell backwards, striking his head on the roadway.Mr Bunch told the court Mr Poole and his friend, Andrew Hall, had been guzzling booze since around midnight and had gone to the beach to watch the sunrise before walking back to Mr Hall's house, passing Tompkinson's home in Beech Grove on the way.They chose a well lit street to make their way back, which took them in front of the home Tompkinson shared with his actress partner Jessica Johnson on the seaside town's Beech Grove just after 5.30am.Mrs Davidson was woken by the noise of the two men 'laughing and carrying on' and looked out of her window to see them lying on a path near Tompkinson's address.",
        "'She could see that one, later found to be Mr Poole, had on only his underpants, with a towel lying on the path next to him.'Mr Bunch said Mrs Davidson went back to bed but looked out again when she heard another voice about five minutes later.Jurors were told she saw the defendant standing on his driveway speaking to the two men.Mr Bunch said: 'Although she could not hear what her neighbour was saying, Mrs Davidson formed the view, from his hand gestures, that (Tompkinson) was telling the two men to get on their way. ",
        "'It appeared that one of the men said something back and Mrs Davidson saw her neighbour draw back his fist, before apparently thinking better of it and lowering his hand.'The two men, who were obviously heavily drunk, tried to get to their feet, but Mr Poole could hardly stay upright, and Mr Hall had to help him keep his feet.'The two made their way a short distance before stopping, possibly because the defendant had said something further to them.'Mrs Davidson watched as the defendant approached the two men, who were wobbling from side to side.",
        "'The defendant first slapped Mr Poole with his right hand before punching him to the head with his left fist.'Mr Poole stumbled and then fell backwards striking his head on the roadway, where he lay unconscious.'Concerned for what she had seen, Mrs Davidson asked her husband to call the ambulance service.'The court heard that Tompkinson also called the police to report the men for making a noise but did not try to summon help for his alleged victim as he lay out cold by calling the ambulance himself.Mr Poole was rushed to hospital and was found to have suffered a brain injury.Mr Bunch said: 'Given the drunken condition of Mr Poole and the fact he had no obvious injury, it was not realised that an assault had taken place and so nothing was done at that stage, beyond taking Mr Poole, who was still unconscious, to hospital.",
        "'There, it was established that he had a fractured skull with resulting significant traumatic brain injuries.'It was only when Caroline Davidson's account became known that Tompkinson was arrested.",
        "Mr Bunch said: 'The prosecution says that this defendant, angry at the noise the two men were making, ended up punching one of them, knocking him to the floor so that he banged his head and sustained traumatic brain injuries.'The defendant claims he did no more than push away the man in self-defence after the two had come towards him.'When Tompkinson was interviewed he told police that he had gone out to ask the two men to move on, so they didn't disturb his partner and her child, who were asleep in the house. He told officers the two were obviously drunk with Mr Poole repeatedly collapsing on the floor, then became aggressive and moved towards him.The actor claimed he raised his hand to keep Mr Poole away then turned to face Mr Hall and then, when he looked back, Mr Poole had gone to the floor.Tompkinson denied that he had aggressively struck Mr Poole at any point.Mr Bunch said: 'The Crown say that this claim of aggressive behaviour by the two men is simply not supported by any of the evidence in the case.",
        "'Mrs Davidson, who has no axe to grind, does not describe any such behaviour on the part of the pair.",
        "'The truth is that the defendant's story is nothing more than a weak attempt by him to deflect blame onto others for what were his wholly unjustified aggressive actions towards Mr Poole.'The evidence here is clear as to his guilt for the offence which he faces.'Jurors were warned of Tompkinson's celebrity status before the trial got underway by Judge Paul Sloan, the Recorder of Newcastle.He told them: 'Mr Tompkinson is a well known actor, many, if not all of you, will have seen him or know of him.'That in itself would not be debar you from serving on this jury, however if you have any association with him, directly or indirectly, or have had any dealings with him or know someone who has had dealings with him, then could you raise your hand and alert us to your situation.'Mr Lumley said Tompkinson went out into the street wearing his pyjamas and a dressing gown and asked 'what on earth is going on?'He asked Mr Poole: 'Do you remember him holding up a phone and saying he was going to call the police?'Mr Poole said he could not remember.",
        "The court was told that he had made a claim for criminal injuries compensation, which he confirmed.The court was played a 999 call made by Tompkinson to the police at 5.36am.He told the operator: 'Hello mate I have two incapable drunks outside my house at Beech Grove. One is just in his underwear, they cannot stand.'They had a bottle of Jaeger which I have taken off them, I have asked them to move and they cannot move.'The call handler said an officer would be dispatched as soon as possible. Tompkinson denies a charge of unlawfully inflicting grievous bodily harm and the trial, expected to last a week, continues."
    ]
}