{
    "articleURL": "/wires/reuters/article-12053605/Brewers-Christian-Yelich-looks-going-vs-Alex-Cobb-Giants.html",
    "content": [
        "Christian Yelich is going to have to solve a life-long nemesis if he's going to snap a season-long slump when the Milwaukee Brewers attempt to even the score against the host San Francisco Giants in a rematch Saturday afternoon.",
        "Yelich went a painful 0-for-4 in the series opener Friday, a game in which the Giants rallied from 2-0 and 4-2 deficits to win 6-4 and extend their winning streak to three games.The Brewers lost their fifth straight in part because Yelich grounded into a double play in a two-run first inning, struck out in a two-run fifth and struck out again as the potential go-ahead run in the eighth.The hitless effort, his 14th of the young season, dropped the former National League Most Valuable Player's season average to .235.Brewers manager Craig Counsell insisted before Friday's game that Yelich is the least of his worries.\"Probably the thing that has stuck out for me with Christian is that all around, he's been a really good player,\" he observed. \"He's run the bases exceptionally. He's gotten on base at a good clip. He's just contributed in all facets of the game. Players that do that, they're going to help you win.\"If Yelich is going to head in a positive direction at the plate Saturday, it's going to have to come - at least at the start - against Giants right-hander Alex Cobb (1-1, 2.43), who has pitched brilliantly against the Brewers in his career, going 1-1 with an 0.84 ERA in three starts.",
        "The third of those starts occurred last July in San Francisco, a game in which he took a shutout into the eighth before allowing a game-tying unearned run. The Giants bounced back to win 2-1, but Cobb did not get a decision.Cobb has dominated his matchup with Yelich over the years. After walking Yelich the first time they met in 2014, Cobb recorded a strikeout and then seven straight groundouts over three games for an 0-for-8 career ledger.Cobb has pitched mostly in bad luck this season, having just one win to show for five consecutive starts in which he allowed two runs or fewer. In fact, it took a six-hit shutout on April 24 against the St. Louis Cardinals to secure his lone win.The veteran probably won't have one of the team's chief bullpen weapons - right-hander Tyler Rogers - as a safety net Saturday after the setup man threw 33 pitches in two shutout innings while preserving a late one-run lead in the series opener.\"When you have a guy like Tyler Rogers who can throw lefties and righties, six or seven batters, for you, you feel really fortunate,\" Giants manager Gabe Kapler gushed after the win, \"I feel good about the way the bullpen is going.\"",
        "The Brewers have scheduled righty Colin Rea (0-2, 4.79) for the second game of the series. The 32-year-old is winless in four starts this season, but is coming off his best outing of the season when he struck out nine in five innings in a 3-0 home loss to the Los Angeles Angels last Sunday.Rea wound up on the losing end of a 5-1 defeat for the Padres in his only previous start against the Giants in 2016, allowing three runs in five innings. The runs were the product of a three-run home run by Brandon Crawford in the second inning.--Field Level Media"
    ]
}