{
    "articleURL": "/wires/reuters/article-12044085/MORNING-BID-ASIA-Fed-eyes-pause-market-bets-pivot.html",
    "content": [
        "By Jamie McGeever",
        "May 4 (Reuters) - A look at the day ahead in Asian markets from Jamie McGeever.The Fed on Wednesday delivered what markets are convinced will be the last rate hike of the cycle, bond yields and the dollar fell, yet investors are rattled.Asian markets wake up on Thursday to the realization that although U.S. rates have probably peaked and could soon fall, sentiment is wary at best and gloomy at worst due to increasing fears over U.S. banks, credit conditions, and the debt limit.Australian trade figures for March and final reading of China's manufacturing PMI for April are the indicators most likely to give local markets a steer on Thursday, while the European Central Bank is expected to raise rates later.But the tone will be set by the fallout from the Fed.The performance of U.S. regional banks on Wednesday is telling. They rose as much as 3% in early trade, recouping some of the previous two days' heavy losses. Booming private sector U.S. jobs data also soothed hard landing or recession fears.They remained in positive territory after the Fed's policy statement strongly suggested a pause is imminent but quickly retreated as Fed Chair Jerome Powell struck a cautious tone in his press conference.They closed down for a third day, shedding 1%, while Wall Street's three main indices lost between 0.4% and 0.8%, short-dated Treasury yields plunged, and the dollar fell.",
        "Notably, the dollar's biggest loss amongst FX major currencies was against the yen, which surged around 1% for its best day in six weeks. The Japanese currency appears to be rediscovering some of its famed safe-haven status.Markets are simply not buying Powell's insistence that this time really might be different and the United States can avoid recession after the most aggressive tightening campaign in 40 years - they are pricing in 75 bps of Fed easing this year, the two-year U.S. yield is down 25 bps since Wednesday, oil is down 10% this week.Meanwhile, pressure in Hong Kong's financial system is building as the monetary authority's aggregate balance -- a gauge of cash levels in the banking system -- has slumped to a 14-1/2 year low of HK$49 billion ($6.2 billion).The Hong Kong Monetary Authority has been forced to intervene to defend the HK dollar's peg, and on Wednesday local interbank rates shot higher.With the ECB also set to raise rates on Thursday - will it be 25 or 50 bps? - it's shaping up to be a rocky start across Asian markets.Here are three key developments that could provide more direction to markets on Thursday:- China manufacturing PMI (April)- Australia trade (March)- ECB rate decision",
        "(By Jamie McGeever;)"
    ]
}