{
    "articleURL": "/wires/ap/article-12042219/Judge-Synagogue-massacre-suspect-face-death-penalty.html",
    "content": [
        "PITTSBURGH (AP) - The man charged in the deadliest attack on Jewish people in U.S. history has lost another bid to get the death penalty removed as a possible punishment.",
        "With jury selection underway at the federal trial of Robert Bowers, a judge ruled Tuesday against a defense motion that challenged the government's pursuit of the death penalty.U.S. District Judge Robert Colville said in his decision that Bowers' defense team \"fails entirely to establish a basis upon which the court could conclude that the government has arbitrarily sought the death penalty in this case.\"Bowers, of the Pittsburgh suburb of Baldwin, is charged with 63 criminal counts in the killings of 11 worshippers on Oct. 27, 2018, at the Tree of Life synagogue building where three congregations had gathered. The charges include 11 counts of obstruction of free exercise of religion resulting in death and 11 counts of hate crimes resulting in death.Prosecutors say Bowers made antisemitic comments at the scene of the attacks and in earlier online forums.More than 100 potential jurors have been questioned by prosecutors and the defense through the first seven days of jury selection, with a heavy focus on their views on a potential death sentence. The process resumed Wednesday.",
        "Bowers´ attorneys already offered a guilty plea in return for a life sentence without parole, but prosecutors refused and are seeking the death penalty, a move most of the victims´ families support. Most of the juror questioning by Bowers´ attorneys has focused on jurors´ views on the death penalty.",
        "In a legal filing last month, Bowers' lawyers argued the Justice Department lacks \"a discernible, principled basis\" for seeking death against Bowers but not for defendants in comparable cases. The defense also objected to the procedure by which the government considered Bowers' request to reconsider its pursuit of capital punishment.Colville agreed with the Justice Department's argument that Bowers failed to account for the differences between his case and the other cases for which the government did not seek the death penalty.The synagogue massacre case has already spanned two presidencies.Republican President Donald Trump, who was in office at the time, declared the killer should \"suffer the ultimate price\" and that the death penalty should be brought back \"into vogue.\" Federal executions resumed during Trump´s presidency after a 17-year hiatus, and 13 federal inmates were put to death during his last six months in office.Democrat Joe Biden indicated during the 2020 campaign he would work to end the federal death penalty, but critics say he has done nothing to make that happen. The Justice Department put in place a moratorium in order to study current policies and procedures. However, that has not prevented federal prosecutors from pursuing a death sentence for Bowers."
    ]
}