{
    "articleURL": "/wires/ap/article-12040167/3-imprisoned-Iranian-female-journalists-win-UN-prize.html",
    "content": [
        "UNITED NATIONS (AP) - The United Nations announced Tuesday night that its premier prize for press freedom has been awarded to three imprisoned Iranian female journalists \"for their commitment to truth and accountability.\"",
        "The winners are Niloufar Hamedi who broke the news that 22-year-old Mahsa Amini died last September while being held by the morality police for wearing her headscarf too loosely, and Elaheh Mohammadi who wrote about her funeral.Amini´s death touched off months-long protests in dozens of cities across Iran. The demonstrations posed one of the most serious challenges to the Islamic Republic since the 2009 Green Movement protests drew millions to the streets.The third winner is Narges Mohammadi, who has worked for many years as a journalist and is one of Iran´s most prominent activists.The U.N. Educational Scientific and Cultural Organization World Press Freedom Prize is named for Guillermo Cano, a Colombian journalism who was assassinated in front of the offices of his newspaper El Espectador in Bogota on Dec. 17, 1986. UNESCO has awarded the prize to coincide with World Press Freedom Day on May 3 since 1997.UNESCO Director General Audrey Azoulay announced the winners at a ceremony in New York, saying: \"Now more than ever, it is important to pay tribute to all women journalists who are prevented from doing their jobs and who face threats and attacks on their personal safety.\"",
        "Zainab Salbi, chair of the international jury of media professionals that chose the winners, said the brave work of the three winners \"led to a historical women-led revolution.\"",
        "\"They paid a hefty price for their commitment to report on and convey the truth,\" Salbi said. \"And for that, we are committed to honoring them and ensuring their voices will continue to echo worldwide until they are safe and free.\"In late April, Iran´s judiciary acknowledged that two reporters who broke news on Amini´s death, Hamedi and Elaheh Mohammadi, had been indicted on charges of collaborating with the United States, acting against national security, and creating \"propaganda against the system.\"While nearly 100 journalists have been arrested amid the demonstrations, Hamedi and Elaheh Mohammadi´s reporting was crucial in the days after Amini´s death to spread word about the anger that followed. Hamedi works for the reformist newspaper Shargh, while Mohammadi works for the reformist newspaper Ham-Mihan.Their detentions have sparked international criticism over the bloody security force crackdown that lasted months after Amini´s death. According to UNESCO, both Hamedi and Mohammadi have been in Iran´s Evin Prison since September, and Hamedi has been in solitary confinement.Since the protests began, at least 529 people have been killed in demonstrations, according to Human Rights activists in Iran. Over 19,700 others have been detained by authorities amid a violent crackdown trying to suppress the dissent. Iran for months has not offered any overall casualty figures, while acknowledging tens of thousands had been detained.",
        "Narges Mohammadi has been repeatedly detained and imprisoned by authorities, and UNESCO said she is currently serving a 16-year prison sentence in Evin Prison. She´s won recognition abroad for her work, including her activism against the death penalty in Iran, which remains one of the world´s top executioners.UNESCO said she is vice director of the Tehran-based civil society organization, Defenders of Human Rights Center. She also continues to report in print from prison and has interviewed other women prisoners which were included in her book \"White Torture,\" the U.N. agency said."
    ]
}