{
    "articleURL": "/money/markets/article-12038765/Shares-banks-plummet-crisis-fears-rock-markets.html",
    "content": [
        "Wall Street’s banking giants suffered a sell-off last night after the takeover of US regional lender First Republic failed to calm market nerves.",
        "The renewed turmoil intensified pressure on the Federal Reserve, the US’s central bank, ahead of a decision tonight on whether to hike interest rates again even as the crisis among lenders deepens.Regional banks such as PacWest Bancorp and Metropolitan Bank , down 28 per cent and 20 per cent, suffered the biggest declines.",
        "But the jitters also spread to Wall Street heavyweights, including Bank of America, which slid 3 per cent, Wells Fargo, off by 3.8 per cent, and Citigroup, down 2.7 per cent.In London, Barclays fell 3.1 per cent, Standard Chartered dipped by 2.8 per cent and smaller UK lender Metro Bank lost 4.5 per cent in value.The FTSE 100 Index fell 1.2 per cent, or 97.54 points, to 7773.03 in a grim start to May trading, while New York’s Dow Jones sunk 1.1 per cent.Fears that the US government could run out of money – due to a stand-off between the White House and Congress – as well as weaker-than-expected jobs data added to worries about the world’s biggest economy.That sent the dollar lower and pushed oil prices down by 5 per cent, with Brent crude trading at around $75 a barrel.But it was the rescue of San Francisco-based lender First Republic by JP Morgan, in a deal brokered by US regulators, that created the biggest waves.",
        "Instead of calming the waters, it seemed to intensify investor focus on who could be next. ‘Historically, once you see a resolution of one institution, the market tends to go after who they view as the next weakest link,’ said Goldman Sachs regional banks analyst Ryan Nash.",
        "Jake Dollarhide, boss of Longbow Asset Management, said: ‘If a confidence crisis can happen to First Republic, it can happen to any bank in this country.’The broader crisis began in March with the collapse of American lenders Silicon Valley Bank, Signature and Silvergate. And it spread to Europe when Credit Suisse had to be rescued by UBS.Fresh fears about the sector emerged when First Republic last week disclosed it had suffered an exodus of £80billion in customer deposits. A rescue deal patched together over the weekend left JP Morgan boss Jamie Dimon claiming: ‘This part of the crisis is over.’But the renewed turbulence suggested there was further trouble to come and put the spotlight on the Fed ahead of a rates decision tonight. It is widely expected to raise borrowing rates by a further quarter percentage point in spite of the turbulence, as it battles inflation. But investors will be watching keenly for signs of where the Fed goes next.Thomas Hayes, chairman of Great Hill Capital, said yesterday’s market turmoil showed that the central bank must signal a pause in rate hikes ‘otherwise you’re going to see continued turmoil in the banking system’.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}