{
    "articleURL": "/wires/aap/article-12060419/Farmers-bracing-bigger-biosecurity-bill-budget.html",
    "content": [
        "Farmers are concerned the federal government is about to hit them with extra biosecurity fees, and have called for importers to pick up the bill instead.",
        "Agriculture Minister Murray Watt has previously flagged a change to the way biosecurity is funded, with a commitment to a sustainable funding source.Ahead of Tuesday night's budget, Tony Mahar from the National Farmers' Federation said any move to charge producers more for biosecurity would be \"a kick in the guts\".\"Farmers are paying their fair share already,\" Mr Mahar told AAP.\"They pay hundreds of millions of dollars in terms of a whole range of levies and fees and charges that go towards maintaining a strong biosecurity regime.\"The minister's office gave no comment when asked by AAP whether the budget will include farmers being asked to pay more for biosecurity services.Farmers have been lobbying for the budget to deliver a sustainable funding model for biosecurity, but not if it means more costs for producers.Mr Mahar said it should be importers rather than farmers who pick up any tab.\"I don't care whether that's (importers of) cars or whether that's refrigerators or whether that's boxes of stainless steel screws,\" he told AAP.\"These people are the risk creators, so they should be identified and they should be helping pay for a strong biosecurity system.\"Farmers are only one of the beneficiaries of the biosecurity system, but we're its biggest financial backer by a country mile.\"",
        "In last year's budget, $134 million was committed to new biosecurity measures including extra frontline staff, 20 new detector dogs, and stronger defences against foot and mouth disease and other emerging threats.Senator Watt told a biosecurity conference in April that biosecurity is a shared responsibility.\"Everyone has a role to play in protecting and improving Australia's biosecurity system,\" he said at the conference held in Canberra."
    ]
}