{
    "articleURL": "/wires/reuters/article-12045221/Derma-Sotogake-look-Kentucky-Derby-winner.html",
    "content": [
        "The world's most famous thoroughbred race, the Kentucky Derby, will be contested at Churchill Downs in Louisville on Saturday. A full field of 20 3-year-old horses will enter the starting gate in the 1 1/4-mile dirt race. The morning-line favorites are both trained by Hall of Famer Todd Pletcher -- Forte (3-1) and Tapit Trice (5-1). Forte won the Breeders Cup Juvenile and Florida Derby. Tapit Trice prevailed in the Blue Grass Stakes.",
        "NBC will broadcast the greatest two minutes in sports with a post time of 6:57 p.m. Our horse racing expert breaks down his top four selections, which could provide a huge windfall in superfecta wagering.Kentucky Derby 2023 PicksWinner -- (17) Derma SotogakePlace -- (2) VerifyingShow -- (10) Practical MoveFourth -- (14) Angel of EmpireJapanese invader could KO opponentsIn sumo wrestling, sotogake is a sumo wrestling move in which the attacker pulls his opponent toward him, hooks his leg, and drives him over backward. Derma Sotogake could send the American-based horses reeling on Saturday.DERMA SOTOGAKE, based in Japan, earned a spot in the field with an overwhelming victory in Dubai's UAE Derby in late March. That in itself wasn't a major surprise -- in the last few years, Japanese horses have won major races all over the globe. It may inevitable that Japanese connections conquer a Triple Crown race. Mandarin Hero, who is on the also-eligible list, barely missed winning the Santa Anita Derby.Derma Sotogake showed a new element in Dubai, which makes him the top selection. Jockey Christophe Lemaire pushed the colt -- previously a closer -- to the front, and he won in wire-to-wire fashion. His outside draw in the Derby gives Lemaire options in a field that, for the most part, lacks early speed. He could push Derma Sotogake (10-1 in the morning line) to the front or sit just outside in a perfect stalking position.",
        "No horse from the UAE Derby has ever finished in the money in the Kentucky Derby, which gives some pause. But from a betting standpoint, that should provide better odds on a horse who might be the standout in an otherwise evenly-matched group.Derma's sire, Mind Your Biscuits, won a stakes race at Churchill Downs, which only adds to his appeal.Justifying his regal bloodlinesThe sire of VERIFYING needs no introduction. He's the son of Triple Crown winner Justify. Purchased for $775,000 as a yearling, Verifying was expected to have some of his sire's talent.He flashed that by finishing second in the Grade 1 Champagne Stakes in a second career start. Verifying has made three starts as a 3-year-old - a dominant allowance victory at Oaklawn Park, a fourth-place finish in the Rebel Stakes on a sloppy track, and a strong second to Tapit Trice in the Blue Grass.In the latter, Verifying stalked an early pacesetter and took the lead, then fought Tapit Trice throughout the stretch before losing by a neck.Verifying drew the No. 2 post, which could force jockey Tyler Gaffalione, who has won eight riding titles at Churchill Downs, to push his mount early in order to avoid a traffic jam. That could actually work in his favor -- he could wind up on the lead in a field lacking a clear front-runner. Or, he could save ground in the second tier, sitting just behind the pacesetters.",
        "Trained by the outstanding Brad Cox, Verifying (15-1) is an enticing prospect who will likely go off at even higher odds than his morning line.Positioning himself for a `Practical Move'PRACTICAL MOVE comes into the Derby off three consecutive stakes victories in California, including the state's ultimate prep, the Santa Anita Derby.Practical Move has benefited from some perfect trips in those races -- saving ground, and then taking the lead in the stretch. However, Practical Move's running style is conducive to putting himself in good position. He's always up close and in striking position.If the Derby field was loaded with speed, Practical Move might be a tough spot. That's not the case in this field mainly comprised of closers. He should be right where he usually is, stalking the early leaders and ready to pounce.The knock on Practical Move is that even with a great trip in the Santa Anita Derby, he barely held off Mandarin Hero and Skinner - another live longshot in Saturday's field. His tactical speed should at least allow him to hold on for a minor share.Possessing an `Angel'-ic turn of footUnlike last year's Derby, when 80-1 Rich Strike benefited from a hot pace, the closers appear to be at a disadvantage this Saturday.",
        "The best of that group might be ANGEL OF EMPIRE, the Arkansas Derby winner. Despite modest early fractions, Angel of Empire swooped around virtually the entire field entering the stretch and pulled away to a convincing triumph.His opponents in that race weren't a particularly noteworthy bunch -- the second-place finisher went off at 58-1 odds. But Angel of Empire showed the kind of acceleration that can win a Derby. Like Verifying, Angel of Empire is trained by Brad Cox. He has also trained very well at Churchill Downs, but his running style could compromise him, unless the pace is surprisingly quick, or at least honest.If you're looking for other closer options, No. 8 MAGE (15-1 on the morning line) and No. 9 SKINNER (20-1) will offer excellent value.--Field Level Media"
    ]
}