{
    "articleURL": "/wires/ap/article-12053255/Hurricanes-Devils-2-0-2nd-round-playoff-series.html",
    "content": [
        "RALEIGH, N.C. (AP) - The Carolina Hurricanes are pushing past their injury-hit group of forwards through grit, relentless effort and scoring throughout the lineup.",
        "It has allowed them to take early control of their second-round playoff series against the New Jersey Devils - convincingly, at that.Jesperi Kotkaniemi scored twice in a roughly 2 1/2-minute span during Carolina's four-goal second period, Frederik Andersen stopped 28 shots and the Hurricanes beat the Devils 6-1 on Friday night for a 2-0 lead in their second-round playoff series.Jordan Staal and Martin Necas also scored in that blow-it-open second, which turned a scoreless game between the top two regular-season teams still alive in the playoffs into a romping Hurricanes win with the backing of another rowdy home crowd.Throw in clinching goals by Jordan Martinook and Stefan Noesen in the third, and the Hurricanes have had nine different players find the net at least once through two games.\"No secret, we're missing some firepower, so where are you going to find it?\" Carolina coach Rod Brind'Amour said of injured scorers like Andrei Svechnikov, Teuvo Teravainen and trade acquisition Max Pacioretty. \"Right now we're getting it up and down the lineup.\"",
        "It also marked the second straight game the Hurricanes chased Devils netminder Akira Schmid. He lasted only a few minutes into the second period of the Game 1 loss, then took a seat after the second with his team down 4-0 in this one.",
        "\"That's been our style all year long,\" Staal said, \"which is first and foremost give them nothing, and then just be tencacious on the puck and create turnovers and send it to the net.\"Miles Wood scored for the Devils early in the third, but Andersen was strong in his third straight postseason start for Carolina going back to the first-round clincher against the New York Islanders.The Devils return home to host Game 3 on Sunday, facing an 0-2 hole for the second straight best-of-seven series. They lost the first two games at home by 5-1 scores in the first round against the New York Rangers before rallying to advance with Monday's Game 7 clincher.This time, they´ve been outscored 11-2 through two games.\"What bothers me the most is we got outbattled again today,\" Devils captain Nico Hischier said. \"It's the playoffs. Skill doesn't mean a thing. You've got to battle hard for your opportunities.\"Kotkaniemi's first goal came when he took pass alone on the right side, fittingly after Carolina had kept possession along the boards. He skated in to the dot before firing a shot that went under Schmid's right arm and grazed his ribs before finding the net at the 1:35 mark.Moments later, Martinook - whose activity had him in the mix all night on a line featuring Kotkaniemi and Jesper Fast - skated in to tangle up two Devils players in a possession chase near the boards. That helped jar the puck loose to skitter over to Kotkaniemi for the near-post putaway at 3:58.",
        "The Hurricanes kept the pressure on. There was Jack Drury chipping the puck in at the blue line for Staal, with the Hurricanes captain extending his 6-foot-4 frame to corral it behind him before going with the forehand-to-backhand finish and the 3-0 lead.And finally, Martin Necas finished from the slot after Jaccob Slavin caught the right post on a rush but Carolina again maintained possession.\"We're trying to grind them down,\" Martinook said. \" We know how skilled this team is. If you're one-and-done and they're getting out clean, you're chasing them on the way back.\"The Hurricanes dominated the opening period of Game 1, smothering the Devils to take away open ice while tallying more goals (two) than New Jersey had shots (one).The Devils knew they couldn't repeat that effort and said as much Thursday, noting they had to get pucks on the net and use their speed to force Carolina to expend energy defending in its own end instead of rolling with its aggressive forecheck.New Jersey carried play through the first 10-plus minutes, even with Dougie Hamilton ringing the post on an early power play that included 23 seconds of a 5-on-3 advantage.But by end of this one, Carolina was celebrating a blowout with Martinook's breakaway score against Vitek Vanecek followed closely by Noesen's putaway on a perfect 2-on-1 feed from Sebastian Aho.",
        "\"Right now, 5-on-5, they´re the better team,\" Devils coach Lindy Ruff said.NOTEWORTHYNew Jersey trade acquisition Timo Meier was back after missing Game 1 following a jarring hit from the Rangers' Jacob Trouba in Game 7. He saw 16:49 of ice time and had five shots, along with cuts and scabs on his nose along with bruising under his right eye. ... Carolina is 18 for 18 on the penalty kill against New Jersey going back to the regular season... Martinook, Drury, Kotkaniemi and Shayne Gostisbehere had two points for Carolina. ... Vanecek surrendered two goals on 11 shots in relief.___Follow Aaron Beard on Twitter at http://www.twitter.com/aaronbeardap___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}