{
    "articleURL": "/wires/pa/article-12053581/Steering-5-000-troops-Waterloo-lifetime-opportunity.html",
    "content": [
        "Rail bosses and military officers managing the arrival and departure of 5,000 armed forces personnel and members of the public at London’s Waterloo station for the coronation have described the huge logistical operation as “a once-in-a-lifetime opportunity”.",
        "Troops involved in the coronation arrived at the UK’s busiest station on Saturday morning before marching off to take part in the procession, in the biggest movement of military personnel on Britain’s railways since Sir Winston Churchill’s funeral in 1965.",
        "Members of the Royal Navy, Army, RAF and Commonwealth forces arrived on seven South Western Railway trains and two chartered West Coast Railways trains, before marching over Westminster Bridge to assemble ahead of the coronation.Royalists arriving in central London to see the ceremony waved flags as the soldiers marched into the station, which was draped with Union flag bunting and signs featuring coronation emblems.Sergeant Richard Flattery, of the Royal Logistics Corps, is working alongside police and railway security teams to manage the flow at Waterloo.",
        "He told the PA news agency: “It’s a once-in-a-lifetime opportunity in my career.“We’ve got the military police with us as well on standby and they’re lining the route as well to make sure nobody is encroaching on the parade.”South Western Railway managing director Claire Mann said: “It’s an amazing opportunity, the planning that’s gone into this. It’s been years in the making, and we’re hoping for a really successful delivery today.“It’s a real honour to be part of this. It's absolutely phenomenal. I’m just so proud of the trust that has been placed in us to move the personnel here today  Claire Mann  ",
        "As well as the delivery of troops into Waterloo, Ms Mann has also overseen the presentation of station staff and management of different teams across the station.She said: “There’s the security piece around ensuring personnel are trained, and in presentation, making sure they’re smart, the engineering, so it’s been lots of teams coming together to ensure it’s as smooth as it can be.”Asked how she felt about facilitating such a significant logistical event, Ms Mann said: “It’s absolutely phenomenal. I’m just so proud of the trust that has been placed in us to move the personnel here today, but also to be at the heart of what’s happening in London and the whole of the country and the world actually celebrating such an amazing event today.”",
        "Network Rail route manager Mark Killick said: “It’s fantastic for us as the rail industry to be involved in this great coordination celebration.“This is a huge thing for rail, so for colleagues across the industry and network around South Western Railway, it’s just a massive privilege to be involved to be able to support the great coronation today.“It’s been a huge amount of planning, we’ve had to reschedule big engineering work that was planned for this weekend to make sure that the railways open and the trains can run.",
        "“We’ve worked closely with South Western Railway, with the Ministry of Defence, with the British Transport Police, to make sure those arrangements run smoothly.“Key for me today is making sure that those trains depart on time and we get those armed services personnel into London bang on time so they can get off and do what they need to do.”"
    ]
}