{
    "articleURL": "/tvshowbiz/article-12055309/Abbie-Chatfield-says-wouldnt-date-publicly-unless-engaged-talks-romance.html",
    "content": [
        "Abbie Chatfield has revealed she wouldn't go public with another relationship unless she was engaged to the person.",
        "The reality TV star, 27, told Stellar Magazine on Sunday that her celebrity profile can cause tension in a relationship so she wants the romance to be serious before going public.'I wouldn't go public unless I was engaged. I don't think I have the capacity to be with someone publicly,' she said.'If they're in this industry, it causes so much s**t. If they're not in the industry, they're getting dragged into my life, which isn't really fair. 'If I'm sleeping with someone, I will never utter their name. I don't want people to have anything to go off,' she added.",
        "The brunette beauty then said anyone she dates will be photographed by paparazzi and subjected to media scrutiny.'If I have a first date with someone, and someone takes a photo of us, then we have to have the conversation of how we're going to address it in the media. It kind of sucks the fun out of everything,' she said.It comes after Abbie revealed she's in a new monogamous relationship after her disastrous polyamorous romance ended last year. The reality TV star broke up with The Bachelorette's Konrad Bień-Stephen last September, who she was in an open relationship with. She has appeared to be single since, but revealed on stage at her Trauma Dump tour in Adelaide this week that she is in a new relationship.",
        "She told the crowd at Thebarton Theatre: 'I don't get monogamous language. I didn't know what exclusive meant.' The podcast host said it's a very new relationship, and didn't reveal her new partner's name. Despite appearing single since she broke up with Konrad last year, Abbie did confirm that something romantic happened between her and US rapper Yung Gravy when he was in the country. Talking about rumours that they slept together, Abbie said in a sarcastic tone: 'I certainly didn't spend two nights at his hotel. 'Nothing happened, we just had Maccas.'"
    ]
}