{
    "articleURL": "/wires/reuters/article-12054431/Rohingya-say-not-home-Myanmar-stuck-camps.html",
    "content": [
        "By Ruma Paul",
        "DHAKA, May 6 (Reuters) - Rohingya refugees in Bangladesh said on Saturday they would not return to Myanmar to \"be confined in camps\" after making their first return visit as part of efforts to encourage their voluntary repatriation.Nearly a million Rohingya Muslims live in squalid camps in the Bangladeshi border district of Cox's Bazar.Most have been there since fleeing a military-led crackdown in Buddhist-majority Myanmar in 2017 and had not returned until now, although Bangladeshi officials have made several trips to Myanmar as they seek to repatriate the refugees.Twenty Rohingya Muslim refugees and seven Bangladeshi officials visited Maungdaw Township and nearby villages in Rakhine State on Friday to see the arrangements for resettlement.Rohingya have questioned the preparations for repatriation and said they will only go back on a permanent basis if their security is guaranteed and they will be granted citizenship.\"We don't want to be confined in camps. We want to get back our land and we will build our own houses there,\" Oli Hossain, who was among the refugees who visited Rakhine State, told Reuters by phone.\"We'll only return with citizenship and all our rights,\" said the 36-year-old Hossain, father of six children.Myanmar is offering Rohingya national verification cards (NVC), which Rohingya refugees regard as inadequate.",
        "\"Myanmar is our birthplace and we are citizens of Myanmar and will only go back with citizenship,\" said refugee Abu Sufian, 35, father of three children.\"We´ll never accept NVC. This will effectively identify Rohingya as foreigners,\" he told Reuters. The authorities had \"even changed the name of my village in Rakhine,\" he added.Mohammed Mizanur Rahman, Bangladesh's refugee relief and repatriation commissioner in Cox's Bazar, said repatriation was the only solution.\"We want nothing but a safe, voluntary, dignified and sustainable repatriation,\" he told Reuters.He also said a team from Myanmar would come to Bangladesh within a week as a follow-up to build confidence among Rohingya.A Myanmar junta spokesman did not answer calls seeking comment.Myanmar's military had until recently shown little inclination to take back any Rohingya, who have for years been regarded as foreign interlopers in Myanmar and denied citizenship and subjected to abuse.A Myanmar delegation, however, visited the camps in March to verify a few hundred returnees for a pilot repatriation project.A Bangladesh official said the project would involve about 1,100 refugees but no date had been set. Attempts to begin repatriation in 2018 and 2019 failed as the refugees, fearing violence, refused to go back.The U.N refugee agency (UNHCR) said every refugee had \"an inalienable right\" to return to their home country, but that returns also had to be voluntary.",
        "\"UNHCR maintains that dialogue with the Rohingya refugees is a must to make an informed decision,\" the agency said in a statement.\"Visits are an important part of voluntary refugee returns, providing a chance for people to observe conditions in their home country first-hand ahead of return and contributing to the making of an informed decision on return,\" it said further. (Reporting by Ruma Paul; Editing by Kim Coghill and Barbara Lewis)"
    ]
}