{
    "articleURL": "/money/markets/article-12052027/MARKET-REPORT-Pound-hits-year-high-traders-bet-rate-hikes.html",
    "content": [
        "The pound hit its highest level in nearly a year and global stock markets rallied at the end of a week that saw US banking stocks plunge and rate-setters usher in another round of hikes.",
        "After days of turmoil on markets, sterling rose as high as $1.2650 as investors bet this week's interest rate hike by the US Federal Reserve would be the last.By contrast, the Bank of England is expected to raise rates from 4.25 per cent to 4.5 per cent as it continues its battle against inflation.The dollar clawed back some losses later as upbeat jobs figures, showing employment rose by a better-than-expected 253,000 in April, underlined the resilience of the US economy.On the stock market, the FTSE 100 rose 0.8 per cent, or 64.09 points, to 7766.73 while the FTSE 250 gained 0.8 per cent, or 153.53 points, to 19,298.44.",
        "Such gains were echoed around the world with the Dax up 1.2 per cent in Frankfurt and the Cac 1.2 per cent better off in Paris. In the US, on Wall Street, the S&amp;P 500 gained 1.5 per cent, the Dow Jones rose 1.3 per cent and the technology-heavy Nasdaq inched up 1.7 per cent.There was also respite for US regional banking stocks, which clawed back some losses.Having crashed 50 per cent to a record low on Thursday, shares in California's PacWest rose more than 55 per cent in early trading. Arizona's Western Alliance and Memphis-based First Horizon also bounced back having shed more than 30 per cent in the previous session.",
        "London banks also rallied as NatWest rose 2.7 per cent, or 6.9p, to 259.3p, Barclays added 3 per cent, or 4.44p, to 152.68p and Lloyds was up 1.4 per cent, or 0.63p, to 45.98p. Oil prices bounced back to reach around $74 a barrel. That lifted BP 3.4 per cent, to 16.35p, to 493p while Shell, which on Thursday reported a record first-quarter profit of £7.7billion, added 2.2 per cent, or 51.5p, to 2397p.Ithaca Energy signed an agreement with Shell on how to sell the oil giant's 30 per cent stake in the Cambo field. Ithaca, which floated at 250p in London last year, inched up 0.9 per cent, or 1.4p, to 153.8p.",
        "Hilton Food Group, which sends meat and ready-to-eat meals to supermarkets, gained 3.8 per cent, or 27p, to 732p after HSBC reiterated its 'buy' rating and raised the target price to 1050p from 820p.As Hilton looks to improve the profitability in its UK seafood business, HSBC said it believes the 'worst is behind the company'.There was less to cheer for Numis after the City broker reported a slump in revenue and profit. Its revenue slid 14 per cent to £63.8m in the six months to the end of March alongside a 55 per cent drop in profits to £6m. Alex Ham and Ross Mitchinson, the co-chief executives at Numis, warned capital markets volumes are 'likely to remain relatively low over the near term'.",
        "The results came only a week after Deutsche Bank agreed to buy Numis for £410m. Numis was flat at 341p.Property website On The Market signed an agreement to let one of the UK's largest estate agents access its Teclet platform. The deal will see Arun Estates use its softwares across its lettings business. Shares gained 4.3 per cent, or 3 per cent, to 73.5p.Halma, the safety equipment maker, agreed to buy Sewertronics, which uses ultraviolet technology to fix sewage pipelines, for around £36m. Shares slid 0.1 per cent, or 2p, to 2390p.TPX Impact, the business consulting firm, hiked its annual forecasts on the back of two major deals. It expects its revenue to grow between 15 per cent and 20 per cent for the year up to next March. Shares rose 1.2 per cent, or 0.5p, to 42p.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}