{
    "articleURL": "/sport/football/article-12052999/Chelsea-plotting-summer-40m-rated-goalkeeper-Andre-Onana.html",
    "content": [
        "Chelsea have earmarked Onana as a potential replacement for Edouard MendyBut, Chelsea will have to fork out £40million to buy the 27-year-old goalkeeperThat being said, his salary will reportedly fit within the club's wage structureChelsea are looking to secure the services of Andre Onana this summer and are said to be close to confirming a deal with Mauricio Pochettino to become their permanent manager.",
        "The 27-year-old goalkeeper caught Chelsea's attention after excelling between the sticks for Inter Milan and helping the Serie A giants reach the semi-finals of the Champions League.Chelsea have earmarked Onana as a potential replacement for Edouard Mendy - who has refused to sign a new deal with the club after losing the No 1 spot to Kepa Arrizabalaga.Additionally, Chelsea are said to be open to offers for Kepa - according to The Telegraph. Therefore, they need to reinforce their goalkeeping options ahead of the 2023-24 campaign. Chelsea will have to fork out £40million for the 27-year-old, who is regarded as a dependable option at the back. But, The Telegraph are claiming his salary will fit within the club's wage structure. ",
        "The news of Chelsea's interest comes after Mauricio Pochettino reportedly reached a verbal agreement to become the next Blues manager.Mail Sport revealed the former Tottenham boss held further talks with the Stamford Bridge hierarchy last month while considering a Premier League return.Now the Telegraph are reporting that Pochettino's appointment has moved a step closer with Chelsea hoping to have a deal wrapped up soon.That being said, Frank Lampard's appointment as interim manager has reportedly taken the pressure off negotiations. The two parties have been able to discuss a deal without the 'pressure of a deadline' or the need to make an announcement - according to the report. ",
        "The 51-year-old Argentine has been out of managerial work since being sacked by Paris Saint-Germain at the end of last season. "
    ]
}