{
    "articleURL": "/sport/football/article-12057337/MICAHS-MOMENTS-Landing-Martin-Odegaard-masterstroke-Arsenal.html",
    "content": [
        "Our man Micah Richards looks back on another action-packed weekend Arsenal ensured they remained in the hunt for the title with victory at NewcastleSam Allardyce's confidence and self belief is no crime - what do fans want?It's a strange thing to have sympathy for someone after you have watched them light up your Sunday but that was my first feeling for Martin Odegaard.",
        "If it hadn't been for Erling Haaland, Arsenal's captain would be odds-on for Player of the Year.He reminds me of David Silva in so many ways, with his quiet authority and leadership. You wouldn't know David was in a room sometimes, but on the pitch he made you follow him through his brilliance and that is what Odegaard is doing — 15 goals from midfield (and not one penalty) is just exceptional.There was a time when, to be a captain, you needed to have the loudest voice and the biggest personality but that has all changed. Steven Gerrard at England didn't scream and shout but you watched him at close range and couldn't help but be inspired.Arsenal's business in getting Odegaard on loan, restoring his confidence and then buying him outright was a masterstroke. He's going to get even better.",
        "Big Sam's self belief is no crimePlenty of sniggering and criticism for Sam Allardyce after his comments comparing himself to Pep Guardiola and Jurgen Klopp. What is it we want? Managers who say a load of meaningless words or an individual who actually has something to say?Have you thought about it another way and considered that Allardyce could actually have been trying to set a positive tone for a squad short on confidence? ",
        "Perhaps he was trying to put the attention on him rather than on the players? They lost at City but left the pitch in a positive frame of mind.I wouldn't dream of saying I know him well but I've met Allardyce a couple of times and he is a lovely fellow with plenty of belief. He will back himself to get enough out of Leeds' players to save them — where is the crime in that?",
        "Salah won't be allowed to dwell on his latest achievementIn the dressing rooms of the top teams, there is never any sense of reflection or pausing to take stock of what individuals are achieving. The focus, always, is on what is next.So Mohamed Salah's latest achievement — 100 Anfield goals, 186 in total for Liverpool — won't have been dwelt on.Liverpool's players will be focused on trying to pinch a top-four place. The rest of us, however, can marvel at him.I explained two weeks ago here what made Mo special. I need to update things: he's actually astonishing me now. What a phenomenal player.",
        "I pondered after the World Cup final whether Messi might retireWatching the saga with Lionel Messi and Paris Saint-Germain unfold reminded me of a thought I had after the World Cup final. ",
        "Having watched Messi inspire Argentina in perhaps the greatest game of football I've ever seen, I wondered if he would give any consideration to retiring.What was possibly going to top that experience for him? Nothing. Yet if rumours are to be believed a move to Saudi Arabia or even back to Barcelona, is in the offing.It's a real shame to now see him serving a suspension at a club where he's never seemed totally happy.",
        "Haaland won't be giving up another penaltySpeaking of Messi a note for Erling Haaland: don't give up another penalty. It was a humble gesture and said a lot for his character that he let Ilkay Gundogan go for his hat-trick but he won't do it again. Messi and Cristiano Ronaldo ended up with goal tallies like telephone numbers as they took every free-kick and penalty. Remember that. ",
        "Toney's improvement has provided a huge thrillOne thing I've always loved seeing is how a player improves from one season to the next. Ivan Toney's progress, then, has given me a huge thrill. Twenty League goals for Brentford? Wow. I don't know why but nobody is talking about him as much as they should. Toney was superb at Liverpool, his touch and awareness outstanding. I'd love to see him in the PFA team of the year. "
    ]
}