{
    "articleURL": "/sport/football/article-12043933/Jurgen-Klopp-best-behaviour-Liverpools-victory-Fulham.html",
    "content": [
        "The German landed himself in hot water following victory over Tottenham Jurgen Klopp appeared to accuse Paul Tierney of bias against his Liverpool sideThe FA charged Klopp for his behaviour and he faces a touchline ban  Jurgen Klopp went on a charm offensive in response to an FA charge of improper conduct that could see him landed with a second touchline ban of the season.",
        "After the weekend anger against Spurs, it was calm Klopp by the side of the pitch as Liverpool racked up a fifth in a row, against Fulham.So sedate was the normally-boisterous boss, he didn’t even appeal for the winning penalty converted by Mo Salah in the first half.There was a friendly arm around the shoulder of fourth official Darren England in the closing stages of a 1-0 win and selfies afterwards with some lucky fans when Klopp was alerted to their requests by skipper Jordan Henderson.Klopp’s passion can boil over at times – as witnessed when he charged over the fourth official on Sunday and pulled a hamstring – and he’ll be probably be punished for comments made about referee Paul Tierney when the case is heard on Friday.",
        "But the German is also smart. He realised his behaviour was under the spotlight and he made a concerted effort at Anfield to stay in controlHis recent antics didn’t warrant a mention in his programme notes and he was beaming when he came out for the warm-up, though still moving with a slight limp as a reminder of his ill-advised charge towards the official on Sunday.Last night, Klopp stood in his regular position on the front line of the technical area but the usual histrionics were missing.",
        "Most of the time, arms were folded or hands kept in coat pocket. The occasional overhead handclap was aimed towards Trent Alexander-Arnold who broke forward with purpose.Klopp remained calm when Fulham threatened and Alisson had to save. Most notably, when Issa Diop fouled Darwin Nunez in the box, the German didn’t howl any protest, he stayed completely silent with arms behind back, and referee Stuart Attwell pointed to the spot anyway.",
        "When Salah emphatically converted into the roof of the net, the German responded with a polite series of gentle claps, as if applauding at the opera.Liverpool had to be patient against a decent Fulham side and Klopp captured that sense. The most animated he got was rubbing his face when Salah’s volley flew side.Hugs for Cody Gakpo and Andy Robertson when they were introduced were warm but understated compared to the bear grip the manager goes for when his adrenalin is in overdrive.This was a night Jurgen certainly didn’t want or need any more drama."
    ]
}