{
    "articleURL": "/sport/tennis/article-12051353/Emma-Raducanu-undergoes-SECOND-surgery-just-two-days.html",
    "content": [
        "The former US Open champion has struggled with fitness after explosive debutFriday's operation is the second of three scheduled procedures for 20-year-oldThe World No 85 was already due to fall out of the top 100 after patchy season Emma Raducanu successfully underwent ankle surgery just days after the former US Open champion had a minor operation on her hand. ",
        "The earlier procedure was the first of two that the player has planned for with the aim of shaving down the bone spurs that have caused her long-term problems. The 20-year-old was most recently forced to withdraw from the Madrid Open in April due to an injury on her right hand. Ahead of the withdrawal, Raducanu made an uncharacteristicly-terse press appearance, offering up only 58 words to journalists and giving a hint at the strain the player was suffering beneath the surface.  Raducanu will hope that the overhaul will sort out the issues that she has struggled with since her historic victory in Flushing Meadows, but recovery and working back to full fitness will see the former British No 1 miss out on both Wimbledon and the French Open this summer. ",
        "On Friday, Raducanu posted an update on her Instagram Stories captioned '2/3' that showed the player with a heavily bandaged left ankle in a wheelchair. She confirmed on Instagram Live that the surgery had taken place but that there was one last procedure yet to be completed. 'I just had my ankle done,' said Raducanu. 'So two out of three done and one to go, but not for two weeks time.'The world No 85 has had a checkered season, chasing a promising last-16 finish at Indian Wells in March with first-round exits at the Miami Open and the Porsche Tennis Grand Prix in Stuttgart.",
        "Her form is such that Raducanu was set to fall out of the top 100 rankings before it was announced that she would be taking time out for her surgeries. After the first operation on Wednesday, Raducanu shared a hand-written letter for her fans updating them on her condition via Instagram. Raducanu acknowledged the 'difficulty' that she had endured during the last 10 months as the condition on her hands worsened.  ",
        "'I tried my best to manage the pain and play through it for most of this year and end of last year by reducing practice load dramatically, missing weeks of training as well as cutting last season short to try heal it,' Raducanu added.''Unfortunately it's not enough. I'm having a minor procedure done on both hands to resolve the issues.'I'm disappointed to share that I will be out for the next few months and while I am at it will have another minor procedure that is due on my ankle.'It pains me that I will miss the summer events and I tried to downplay the issues so I thank all my fans who continued to support me when you did not know the facts. Look forward to seeing you all back out there.'"
    ]
}