{
    "articleURL": "/wires/ap/article-12050607/Liverpool-mark-coronation-notes-strong-views-fans.html",
    "content": [
        "LIVERPOOL, England (AP) - Liverpool will play the national anthem before the start of its Premier League game on Saturday to mark the coronation of King Charles III and acknowledged Friday that \"some supporters have strong views on it.\"",
        "The team said it would play \"God Save the King\" after the league had contacted clubs playing home games and \"strongly suggested\" they note the historic occasion.Liverpool supporters booed the national anthem - which was formerly \"God Save the Queen\" - when it was played ahead of the FA Cup final a year ago and the Community Shield in July because of what is perceived to be a long-held opposition toward the establishment.Queen Elizabeth II held the throne for seven decades until her death in September at the age of 96.Liverpool fans booed the national anthem in the 1980s and during what some refer to as the \"managed decline\" of the city during the tenure of the Conservative Party-led government. Deepening those feelings were the actions of the government following the Hillsborough Stadium disaster, and many from the left-leaning city continue to feel let down by the state.Liverpool hosts Brentford at Anfield on Saturday afternoon. The club tucked its plans into an announcement that also discussed charity initiatives and support of the city of Liverpool hosting the Eurovision Song Contest.",
        "\"Just over a week ago, the Premier League contacted all home clubs and strongly suggested to mark this historic occasion across home matches this weekend and provided a list of activity for clubs to get involved in,\" Liverpool said on its website.",
        "Before kickoff, \"players and officials will congregate around the center circle when the national anthem will be played,\" the club said. \"It is, of course, a personal choice how those at Anfield on Saturday mark this occasion and we know some supporters have strong views on it.\"During Wednesday's 1-0 win over Fulham at Anfield, fans in the Kop voiced their disapproval of the coronation using explicit song lyrics.\"The club´s position is my position,\" Liverpool manager Jurgen Klopp said Friday at his pre-match news conference. \"This is definitely a subject which I cannot really have a proper opinion about. I'm from Germany, we don't have a king or a queen. I'm 55 years old, have really no experience with that.\"Royal weddings are \"massive things in Germany,\" he added, likening it to watching a movie.\"I'm pretty sure a lot of people in this country will enjoy the coronation, some will maybe not really be interested and some will not like it,\" Klopp said.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}