{
    "articleURL": "/wires/ap/article-12051897/Why-Russias-Wagner-threatening-withdraw-Bakhmut.html",
    "content": [
        "The head of the Russian private military contractor Wagner returned to a familiar theme this week - bashing the country's military leadership for failures in the war in Ukraine. That 's something only a select few can do publicly without drawing retribution from the Kremlin.",
        "The comments by Yevgeny Prigozhin underscored his long-running feud with the Defense Ministry.This time, however, they came as Moscow could boast of a rare, badly needed victory in the 15-month war in Ukraine, when Prigozhin and his fighters raised a Russian flag in the eastern city of Bakhmut after a long and bloody battle.He turned that moment of triumph into an opportunity just days later to moan about Russian failures in Ukraine.A look at the 61-year-old Prigozhin and Wagner´s role in the war:WHAT DID PRIGOZHIN SAY?Using blunt and coarse language in an almost 80-minute video interview Tuesday to a pro-Kremlin political strategist, Prigozhin said that \"somehow nothing is working out for us\" in Ukraine.He returned to a Kremlin line at the start of the war in February 2022. At the start of the war, President Vladimir Putin tried to justify the invasion by falsely saying it was a campaign against \"Nazis,\" even though Ukraine has a Jewish president who lost relatives in the Holocaust and who heads a Western-backed, democratically elected government.\"We came rudely (into Ukraine), walked with our boots on all over Ukraine in search of Nazis. While looking for Nazis, we bumped off everyone we could,\" Prigozhin said, citing retreats from areas around Kyiv and the southern city of Kherson.",
        "Russia failed to \"demilitarize\" Ukraine, one of the goals stated by Putin on the first day of the invasion, but instead turned Kyiv's army into \"one of the strongest\" in the world with more quality equipment and training.Commenting on Bakhmut, Prigozhin said he lost about 20,000 men from his private army.WHAT'S PRIGOZHIN'S BACKGROUND?Prigozhin was convicted of robbery and assault in 1981, and sentenced to 12 years in prison. Following his release, he opened a restaurant business in St. Petersburg in the 1990s. It was in this capacity that he got to know Putin, then the city´s deputy mayor.Prigozhin used that connection to develop a catering business and won lucrative Russian government contracts that earned him the nickname \"Putin´s chef.\" He later expanded into other areas, including media and an infamous internet \"troll factory\" that led to his indictment in the U.S. for meddling in the 2016 presidential election.In January, Prigozhin acknowledged founding, leading and financing the shadowy Wagner company.WHERE HAS WAGNER OPERATED?Wagner was first seen in action in eastern Ukraine soon after a separatist conflict erupted there in April 2014, in the weeks following Russia´s annexation of Ukraine's Crimean Peninsula.While backing the separatist insurgency in the Donbas, Ukraine´s eastern industrial heartland, Russia denied sending its own weapons and troops there despite ample evidence to the contrary. Engaging private contractors in the fighting allowed Moscow to maintain a degree of deniability.",
        "Prigozhin´s company was called Wagner after the nickname of its first commander, Dmitry Utkin, a retired lieutenant colonel of the Russian military´s special forces. It soon established a reputation for brutality and ruthlessness.Wagner personnel also deployed to Syria, where Russia supported President Bashar Assad´s government in a civil war. In Libya, they fought alongside forces of commander Khalifa Hifter. The group has also operated in the Central African Republic and Mali.Prigozhin has reportedly used Wagner´s deployment to Syria and African countries to secure lucrative mining contracts. U.S. Undersecretary of State Victoria Nuland said in January the company was using its access to gold and other resources in Africa to fund operations in Ukraine.Some Russian media alleged that Wagner was involved in the 2018 killings of three Russian journalists in the Central African Republic who were investigating the group´s activities. The slayings remain unsolved.WHAT IS WAGNER´S REPUTATION?Western countries and U.N. experts have accused Wagner mercenaries of human rights abuses throughout Africa, including in the Central African Republic, Libya and Mali.In 2021, the European Union accused the group of \"serious human rights abuses, including torture and extrajudicial, summary or arbitrary executions and killings,\" and of carrying out \"destabilizing activities\" in the Central African Republic, Libya, Syria and Ukraine.",
        "Video has surfaced purporting to show some of the activities that have contributed to Wagner's fearsome reputation.A 2017 online video showed a group of armed people, reportedly Wagner contractors, torturing a Syrian and beating him to death with a sledgehammer before mutilating and burning his body. Russian authorities ignored requests by the media and rights activists to investigate.In 2022, another video showed a former Wagner contractor beaten to death with a sledgehammer after he allegedly fled to the Ukrainian side and was repatriated. Despite public outrage and demands for an investigation, the Kremlin turned a blind eye.WHAT'S WAGNER´S ROLE IN UKRAINE?Wagner has taken an increasingly visible role in the war as regular Russian troops have suffered heavy attrition and lost territory in humiliating setbacks.Prigozhin toured Russian prisons to recruit fighters, promising pardons if they survived a half-year tour of front-line duty with Wagner.In the interview this week, he said he had recruited 50,000 convicts, about 10,000 of whom where killed in Bakhmut; a similar number of his own fighters have died there.He said he had 50,000 men at his disposal \"in the best times,\" with about 35,000 on the front lines at all times. He didn´t say whether these numbers included convicts.The U.S. has estimated Wagner had about 50,000 personnel fighting in Ukraine, including 10,000 contractors and 40,000 convicts. A U.S. official says nearly half of the 20,000 Russian forces killed in Ukraine since December have been Wagner´s troops in Bakhmut.",
        "The U.S. assesses that Wagner is spending about $100 million a month in the fight. In December, Washington accused North Korea of supplying weapons, including rockets and missiles, to the Russian company in violation of U.N. Security Council resolutions. Both Wagner and North Korea denied the reports.HOW HAS PRIGOZHIN CRITICIZED RUSSIA´S MILITARY?If the U.S. accusation is true, Wagner´s reach for North Korean weapons may reflect its long-running dispute with the Russian military leadership, which dates to the company´s creation.Prigozhin claimed full credit in January for capturing the Donetsk region salt-mining town of Soledar and accused the Russian Defense Ministry of trying to steal Wagner´s glory. He has repeatedly complained the Russian military failed to supply Wagner with sufficient ammunition to capture Bakhmut and threatened to pull out his men.Troops purported to be Wagner contractors in Ukraine recorded a video in which they showered the chief of the Russian military´s General Staff, Gen. Valery Gerasimov, with curses and accusations of failing to provide ammunition.Prigozhin also has singled out Defense Minister Sergei Shoigu for withering criticism, accusing military leaders of incompetence. His frequent complaints are unprecedented for Russia´s tightly controlled political system, in which only Putin could air such criticism.White House National Security Council spokesman John Kirby said Wednesday that Prigozhin´s remarks critical of the war \"could be a sort of morbid way of him ... claiming credit for whatever they´ve been able to achieve in Bakhmut, but also trying to publicly embarrass the Ministry of Defense further that the cost was borne in blood and treasure by Wagner, and not by the Russian military.\"",
        "Once a shadowy figure, Prigozhin has increasingly raised his public profile, boasting almost daily about Wagner´s purported victories, sardonically mocking his enemies and complaining about the military brass.Asked recently about a media comparison of him with Grigory Rasputin, a mystic who gained fatal influence over Russia´s last czar by claiming to have the power to cure his son´s hemophilia, Prigozhin snapped: \"I don´t stop blood, but I spill blood of the enemies of our Motherland.\"___Follow AP's coverage of the war in Ukraine: https://apnews.com/hub/russia-ukraine-war"
    ]
}