{
    "articleURL": "/news/article-12047699/Ed-Sheeran-CLEARED-allegations-hit-Thinking-Loud-copied-Marvin-Gayes-Lets-On.html",
    "content": [
        "A court ruled that Ed Sheeran's 'Thinking Out Loud' did not copy Marvin Gaye's classic 'Let's Get It On'The Grammy award winning artist said he is 'unbelievably frustrated' by the 'baseless claims' which have now been thrown out He said artists need be able to engage 'independently in creation' without worrying it will be 'wrongly called into question'  Ed Sheeran broke down in tears after a jury found his hit song Thinking Out Loud did not copy Marvin Gaye's classic 'Let's Get It On'.",
        "As the jury at Manhattan federal court cleared Sheeran, 32, of infringing copyright, he briefly put his hands over his face in relief before standing and hugging his lawyer.His co-writer Amy Wadge said she and Sheeran 'had a few tears' of relief after winning the $100million case. Speaking outside the court, Sheeran said: 'I'm just a guy with a guitar who loves writing music for people to enjoy. I am not and will not allow myself to be a piggy bank.'Sheeran vehemently denied allegations that his song stole fundamental musical elements from Gaye's song. The singer had staked his whole career on the case, vowing that he would be 'done' with music if found guilty. ",
        "Sheeran added: 'I'm obviously very happy with the outcome of the case and it looks like I'm not having to retire from my day job after all. 'At the same time I'm unbelievably frustrated that baseless claims like this are allowed to go to court at all. 'We've spent the last eight years talking about two songs with dramatically different lyrics, melodies and four chords which are also different and used by songwriters every day all over the world.'These chords are common building blocks which were used to create music long before Let's Get It On was written and will be used to create music long after we are all gone. ",
        "'They are in a songwriter's alphabet, our toolkit, and should be there for all of us to use. 'No one owns them or the way they are played, in the same way that no one owns the color blue.' He added that if the verdict had gone the other way 'we might as well say goodbye to the creative freedom of songwriters' and that artists need to be able to create original music 'without worrying at every step on the way that said creativity will be wrongly called into question'.'It is devastating to be accused of stealing someone else's song when we put so much work into our livelihoods,' he added. The singer also said he missed his grandmother's funeral in Ireland because of the trial, and that he 'won't get that time back'. ",
        "Juror Sophia Neis, 23, said a key factor in swaying the verdict Sheeran's way was his performance of the song during the trial.'It's obviously cool to have anyone play music in front of you live,' Neis said. 'So that was an interesting surprise decision because you're comparing music to a sheet. But it was very cool to hear Sheeran play in court.'The lawsuit was brought by the heirs of Gaye's co-writer, Ed Townsend. His attorney, Ben Crump, told jurors at the start of the trial that Sheeran himself sometimes performed the two songs together. ",
        "The jury saw video of a concert in Switzerland in which Sheeran can be heard segueing on stage between 'Let's Get It On' and 'Thinking Out Loud.' Crump said that was 'smoking gun' proof he stole from the famous tune.When Sheeran testified, he repeatedly picked up a guitar resting behind him on the witness stand to demonstrate how he seamlessly creates 'mashups' of songs during concerts to 'spice it up a bit' for his sizeable crowds.In closing arguments, Sheeran's lawyer Ilene Farkas said similarities in the chord progressions and rhythms of Marvin Gaye's Let's Get it On and Sheeran's Thinking Out Loud were 'the letters of the alphabet of music'.She added: 'These are basic musical building blocks that songwriters now and forever must be free to use, or all of us who love music will be poorer for it.' Jurors were sent home shortly after closing arguments Wednesday and returned Thursday morning to deliberate. Keisha Rice, who represents Townsend's heirs, said her clients were not claiming to own basic musical elements but rather 'the way in which these common elements were uniquely combined'.'Mr Sheeran is counting on you to be very, very overwhelmed by his commercial success,' she said, urging jurors to use their 'common sense' to decide whether the songs are similar.",
        "Lawyers for Townsend's heirs have not responded to a request for comment after the verdict.Their defeat means they may have to pay Sheeran a 'reasonable sum' to cover his legal fees, which intellectual property lawyer Mike Gilbert said would likely be a seven-figure sum due to the length of the case. As jurors left the courtroom Thursday, Sheeran quietly mouthed 'thank you' in their direction. He then spoke for about 10 minutes with the plaintiffs, including the daughter of Ed Townsend, who co-created the 1973 soul classic with Gaye. They hugged and smiled with each other.Sheeran said before the verdict that if he had lost the $100million suit, it could be the end of his music career. 'If that happens, I'm done, I'm stopping,' Sheeran said when asked during the trial about the toll the case has taken. He added: 'I find it really insulting to devote my whole life to being a performer and a songwriter and have someone diminish it.'",
        "Townsend's heirs in 2017 sued Sheeran, his label Warner Music Group and his music publisher Sony Music Publishing, claiming infringement of their copyright interest in the Gaye song.Sheeran and Wadge both testified during the trial that they did not copy 'Let's Get It On'. Sheeran said he had only passing familiarity with the song and that 'Thinking Out Loud' was inspired by Irish musician Van Morrison.",
        "Wadge told CNN the verdict was 'the most unbelievable relief and like seven years of stress just leaving my body', adding that she and Sheeran 'had a few tears'.'I think it even goes beyond music and the idea that it just comes down to the building blocks of anything — if it was a painting or a film — and for a musician who has just relied upon very little musical knowledge for my whole career, it was terrifying to even contemplate that this could even happen,' she said. Gaye, who died in 1984, collaborated with Townsend, who died in 2003, to write 'Let's Get It On,' which topped the Billboard charts in 1973. 'Thinking Out Loud' peaked at No. 2 on the Billboard Hot 100 in 2015.Sheeran is also facing claims over Thinking Out Loud in the same court from a company owned by investment banker David Pullman that holds copyright interests in the Gaye song.Sheeran won a trial in London last year in a separate copyright case over his hit 'Shape of You'.Gaye's heirs in 2015 won a $5.3million judgment from a lawsuit claiming the Robin Thicke and Pharrell Williams song 'Blurred Lines' copied Gaye's 'Got to Give It Up.'After the verdict, leading music and copyright lawyer Nick Eziefula, a partner at specialist media and entertainment law firm Simkins, said it was 'another significant court win for Sheeran, which makes the line between inspiration and infringement a little less blurred'.",
        "He added: 'Although this decision doesn't set a direct legal precedent (as all such cases tend to turn on their particular factual circumstances), the outcome here will be reassuring to many within the music industry, as it helps to reinforce the principle that nobody can own the fundamental building-blocks of music.'This decision will ease concerns of floodgates being opened to ever more song infringement claims of this kind.'",
        "ED SHEERAN: SHAPE OF YOUSheeran's victory in Manhattan Thursday was his second such case in two years, after he also won a plagiarism battle over his 2017 hit Shape Of You.A judge in the UK High Court ruled that Sheeran had not copied the 2015 song Oh Why by Sami Chokri.The grime artist, who performs under the name Sami Switch, had claimed the 'Oh I' hook in Shape Of You was 'strikingly similar' to an 'Oh why' refrain on his track.Sheeran said after the ruling that such 'baseless' claims were 'way too common'.",
        "Judge Antony Zacaroli ruled that Sheeran had 'neither deliberately nor subconsciously copied' Chokri's song.He recognised 'similarities between the one-bar phrase' in Shape of You and Oh Why, but said 'such similarities are only a starting point for a possible infringement' of copyright.He added that there were 'differences between the relevant parts' of the songs, which 'provide compelling evidence that the 'Oh I' phrase' in Sheeran's song 'originated from sources other than Oh Why'.During the case, Sheeran appeared stung by the accusation that he had stolen another artist's work without giving them due credit.Chokri and his co-write Ross O'Donoghue were ordered to pay Sheeran $1.1million in legal fees after the case.ED SHEERAN: PHOTOGRAPH",
        "Sheeran also faced a copyright suit over his hit song Photograph after he was accused of 'note-for-note copying' the track 'Amazing', recorded by British X Factor winner Matt Cardle.The case was reportedly settled out of court after the song's writers had filed a lawsuit in 2016 seeking $20million.Martin Harrington and Thomas Leonard's complaint said Sheeran and his writing partner 'copied and exploited... the work of other active, professional songwriters, on a breathtaking scale, unabashedly taking credit for the work of these songwriters...'The lawsuit alleged that the chorus of “Photograph” and Cardle’s “Amazing” share 39 identical notes. ROBIN THICKE: BLURRED LINESRobin Thicke and Pharrell Williams were ordered to pay the family of Marvin Gaye $5million after they were found to have copied one of his hits.The duo were found to have copied Gaye's 1977 hit Got to Give It Up for their track Blurred Lines.Gaye's family initially won the case in 2015, which was upheld by a California court on appeal in 2018.The family were also awarded 50 percent of all future royalties earned by Blurred Lines.But the $5million payout was a fraction of the $16.6m Williams and Thicke were revealed to have made from the song during the initial trial.Some within the music industry slammed the initial verdict for punishing Thicke's song over copying the 'feel' of Gaye's classic - rather than directly plagiarizing musical phrases or lyrics.The appeal court also split on this, and one of the three judges dissented from the ruling.Circuit Judge Jacqueline Nguyen said the two songs 'differed in melody, harmony and rhythm' and wrote that the verdict 'strikes a devastating blow to future musicians and composers everywhere'.The verdict sparked a number of similar cases against artists including Sheeran, Bruno Mars, Mark Ronson, Madonna and Miley Cyrus.LED ZEPPELIN STAIRWAY: TO HEAVENRock legends Led Zeppelin won a six-year legal tussle to prove they had not copied a song by Randy California for their iconic track 'Stairway to Heaven'.The estate of the late California filed a lawsuit in 2014 alleging that the Zeppelin song had been nicked from the single 'Taurus' by the 1960s band Spirit, for whom California had been the lead guitarist.In 2020, the 9th Circuit Court of Appeals upheld a jury verdict that found the song had not been copied.Led Zeppelin frontman Robert Plant told the BBC in 2021: 'There are zillions and zillions of songs that are carrying the same chord progression, so it was very unfortunate, and it was unpleasant for everybody.'",
        "GEORGE HARRISON: MY SWEET LORD",
        "Former Beatle George Harrison was found guilty of 'subconsciously' plagiarizing the 1962 John Mack tune 'He's So Fine' for his 1970 hit 'My Sweet Lord'.The 1976 case saw Judge Richard Owen of the US District Court in Manhattan find Harrison guilty of copyright infringement but 'not deliberately'.Owen, himself a composer, said: 'It is clear that My Sweet Lord is the very same song as 'He's So Fine.' This is, under the law infringement of copyright and is no less so even though subconsciously accomplished.'Owen said it was apparent from the trial evidence that Harrison had not been conscious of the fact that he was plagiarizing the theme of 'He's So Fine'.But he added: 'In seeking musical materials to clothe his thought...there came to the surface of his mind a particular combination that pleased him as being one he felt would be appealing to a prospective listener...[Mr. Harrison's subconscious mind] knew this combination of sounds would work because it already had worked in a song his conscious mind did not remember.'"
    ]
}