{
    "articleURL": "/wires/pa/article-12051627/Frank-Lampard-praises-Chelsea-owner-urges-team-start-building-future.html",
    "content": [
        "Frank Lampard has praised the good intentions of Chelsea owner Todd Boehly and challenged his players to take the club’s first step into the future over the final weeks of the season.",
        "Defeat at Bournemouth on Saturday will see Chelsea slip below Gary O’Neil’s side, who have battled relegation for most of the season, and they could fall as low as 14th.Boehly, who has spent almost £600million on signings in the 12 months since buying the club, said this week that he and the hierarchy “very much believe we’re going to figure it out” after the team slumped to a sixth consecutive defeat – and possibly their most incoherent – against Arsenal.It leaves Chelsea yet to break the 40-point barrier with five games to play, and on course to record their lowest Premier League finish in 29 years.Lampard’s team need one more goal to avoid matching the club’s all-time lowest tally in a league season, 31, a record which has stood since 1924. The team are still 15 goals short of the club’s lowest return for a Premier League season.Despite the damning statistics, Lampard said he has seen signs of positivity from the owners since he took over as interim manager a month ago.",
        "“It’s a good thing to speak so positively,” he said of Boehly’s comments. “It’s what I’ve found since I’ve been here, good intentions on where the club is going to be taken.“That’s good, and then from my point of view I’m working with the squad to try and get some turnaround in terms of feeling, performance and then results. It’s up to the owners of the club to take those bigger decisions.",
        "“It’s not for me to talk about (a vision for the club). I’m here until the end of the season. I don’t think my vision at this point is for me to answer.”Chelsea still have to face three of the top four on the run-in as Lampard looks to mastermind the team’s first win in any competition since March 11. The club have had three managers since that 3-1 victory against Leicester, and scored only four goals in nine games.",
        "The 3-1 loss at the Emirates was as dismal as anything in what has been a hugely disappointing first season under Boehly, with the spirit amongst the squad seemingly at rock bottom as they sink down the table.Lampard said: “All we can say in this period – everybody from the outside wants to say there’s not much on it (the run-in)….but for myself and for the players we have to show an immense amount of pride in what we do in the games. It’s the first step into the future.“Will we need a reboot of some sense in the summer? Sure. That’s clear because we’re not where we want to be.“But at the moment we have to do what’s right in front of us, and the fans you can be sure from my point of view will be pushing for that. I hope they can see the rewards of that, whatever they are.”",
        "Chelsea have long since dropped out of the race for the Europa League and Conference League, meaning they are facing a first season without European competition since 2016/17 and for only the second time in 26 years.Lampard added: “It’s not for me to sit on and feel hurt by too much. It’s more what’s the action that’s going to get us out of it. The action this season is not going to get us in the Champions League or in the top eight.“Who knows where it might get, it’ll be like the first small step. You have to consider it in that period. Not all fans want to hear that, but it’s a reality which I’ve come back into.“Every situation is different. I’m the third manager, maybe fourth. You can see from that that it’s been a tough season all round.”"
    ]
}