{
    "articleURL": "/wires/pa/article-12054103/Peter-Haring-eager-Celtic-s-celebrations-ice.html",
    "content": [
        "Peter Haring is hoping Hearts can spoil Celtic’s cinch Premiership title party on Sunday.",
        "A victory at Tynecastle – or a Rangers slip-up at home to Aberdeen – will ensure the Hoops secure the trophy for the second year running, but the Jambos’ Austrian midfielder is determined to prevent that scenario.“As a player you don’t really think too much about that but obviously we want to try and stop that,” said Haring.“First and foremost, we want to win and get three points but no-one wants to have another club celebrating anything at Tynecastle. We hope we can avoid that.“It’s always a great game against Celtic, especially at home. At home we’ve got a chance against anybody in this league. We haven’t beaten them this season yet but it’s about time. We have to be confident and full of energy.”Haring has played in two victories over Celtic since joining Hearts in the summer of 2018 and has featured  in several close matches between the teams.",
        "“Every win is different and some taste sweeter than others but obviously beating Celtic, who have been by far the best team in Scotland since I got here, always feels really good,” he said.“You need to be defensively very solid and disciplined. That’s key. You need to try and play the game in the opposition half because when they dominate possession, the pressure increases and it gets harder.",
        "“They’re very good at moving the ball quickly so once they’ve pinned you back, it’s really hard to get control of the game again. We’ve worked on a gameplan and everyone needs to be ready. Energy and belief in yourself are the two main things.”Haring, who recently returned to action following almost six months out with concussion issues, is due to run out of contract this summer.“I hope so,” the 29-year-old said, when asked if he expects to be at Hearts next term. “The full focus is on the next five games and then we’ll see what’s going to happen.”"
    ]
}