{
    "articleURL": "/wires/afp/article-12061041/US-banks-expect-tighten-lending-standards-sector-worries.html",
    "content": [
        "US banks tightened lending standards in the first few months this year, and expect this to continue over the rest of 2023, said a Federal Reserve survey released on Monday.",
        "The report, which is closely watched on Wall Street, comes as the financial sector contends with deposit outflow worries on the back of turmoil after the high-profile collapse of Silicon Valley Bank and Signature Bank in March.In recent weeks, shares of midsized banks suffered brutal trading days while investors remained on edge for a repeat of earlier episodes in which deposit runs precipitated or played a significant role in bank failures.Asked about their outlook for lending standards over the rest of 2023, \"banks reported expecting to tighten standards across all loan categories,\" the Fed said on Monday.Among the most frequently cited reasons included an expected deterioration in credit quality of loan portfolios and in customers' collateral values, alongside reduced risk tolerance, found the senior loan officer opinion survey on bank lending practices.Other reasons included \"concerns about bank funding costs, bank liquidity position, and deposit outflows,\" the survey added.In the first quarter, respondents reported tighter standards and weaker demand for various types of loans to businesses and households, the report added.\"In general, the tightening in standards for business loans was more frequently reported across the mid-sized banks,\" the report said.On commercial and industrial lending, midsized and other banks more often cited their liquidity positions and issues such as heightened concerns about the impact of legislative changes.",
        "And among banks' worries were an uncertain economic outlook.- Risk of slowdown -In a separate financial stability report released Monday -- the first since four regional banks failed recently -- the central bank highlighted concerns over tighter credit.\"Concerns about the economic outlook, credit quality, and funding liquidity could lead banks and other financial institutions to further contract the supply of credit to the economy,\" said the Fed's report.\"A sharp contraction in the availability of credit would drive up the cost of funding for businesses and households, potentially resulting in a slowdown in economic activity,\" the report added.Analysts have recently warned that the full impact of March's banking shock is yet to materialize.It was \"hardly surprising\" that many banks tightened lending standards across a range of loans in the first three months this year, said Michael Pearce of Oxford Economics in a note.\"But the bigger concern is that a majority of banks plan to tighten standards further over the rest of the year,\" he added.\"That will starve firms and households of credit and help push the economy into recession in the second half of this year,\" he said."
    ]
}