{
    "articleURL": "/femail/parenting/article-12039775/Bluey-Stickbird-episode-praised-touching-scene-Bandits-mens-dads-mental-health.html",
    "content": [
        "Recent Bluey episode highlights struggling dadsThe characters help their dad through sadness Parents applauded the 'lovely' story-lineParents are applauding the most recent episode of kids' TV program Bluey many say made them 'well up' and put a spotlight on men's mental health. ",
        "In the episode titled, Stickbird, Bluey's dad Bandit was visibly upset about something not revealed to the viewer and had conversations about how to deal with sad feelings with his kids.Mums and dads said they were moved to tears by the way the show handled Bandit's sadness and shared their theories as to what could have made Bandit upset. Some dads said the story-line made them 'feel seen' after dealing with tough times themselves while others praised Bluey's creators for highlighting fathers' struggles. Stickbird centres around the animated family's trip to the beach and while mum Chili is enjoying the day with kids Blue and Bingo, Bandit is distant. ",
        "As Chilli is teaching the kids how to throw a stick, Bandit sits by himself and seems deep in thought, oblivious to what's happening around him.When Bingo asks her dad to help her find a stick to throw he's so distracted by his thoughts he doesn't realise he's talking to her. 'Let it go babe, you're missing all this,' Chilli says to him before Bandit snaps out of his sadness to play with Bingo. However, while helping Bingo collect sticks and build a bird in the sand, the dad still cannot put his troubles completely aside. After another child destroys Bingo's sand bird leaving her angry and upset, the dad and daughter have a conversation about dealing with sad feelings. ",
        "'When you put something beautiful out into the world, it's no longer yours really,' Bandit tells Bingo.  ",
        "Bluey then comforts both Bandit and Bingo in their sadness telling them to scoop up the 'upset and angry' in their hands and throw it as far as they can. Online, parents have been raving about the 'beautiful' episode with a dad of a seven-year-old daughter saying it 'spoke his language'. 'I was laid off and have decided, in the name of stability, not to tell her. I have no clue if that's what this episode is about but I've had more than my share of thousand yard stares this week,' he said.'My daughter enjoyed this episode, but for the zillionth time I'm here saying I've never felt more seen by an episode of Bluey. I sincerely appreciate it.'One mum thought it was the first time they had seen the Bandit character upset and another said their daughter had asked why he was feeling sad.'I just told her that sometimes dads get angry and upset too. She understood that, and I actually understood it too,' she said. 'Something I like about this episode is Bluey takes the role of teaching a lesson. The parents are learning a lesson from the kids, not the other way around,' another parent added. ",
        "'What a lovely episode, the ending made me well up (been worried about a few things lately),' someone commented. ",
        "Many were sharing their theories as to what was troubling Bandit from problems at work to the death of a loved one. 'My assumption for what's making Bandit down is probably the death of someone (hopefully not Grandpa Bob!),' someone guessed. 'I don't think it can be something as big as a death. Chilli said 'Let it go, you're missing all this'. I don't think she'd say something like that if Bandit was dealing with something that significant,' another replied. 'Seasonal depression or burnout is my guess, might be why they took the vacation in the first place,' a third thought. However lots of parents thought the reason behind Bandit's depression was irrelevant to the show's message. 'Bandit being sad isn't supposed to be something we know about because it doesn't matter, it's just to show kids that adults can be sad too,' one dad pointed out. 'I liked that you don't find out what Bandit was worried about, it seemed like a perfect viewer stand-in,' a second agreed.On ABC's Behind Bluey podcast, writer and creator Joe Brumm said he purposely kept Bandits down mood ambiguous so viewers could relate to his struggles.  "
    ]
}