{
    "articleURL": "/news/article-12041247/Married-head-teacher-admits-affair-pupils-mother-public-apology-spending-hours-absent.html",
    "content": [
        "Welsh head teacher Aled Rees apologises after admitting affair with pupil's mumREAD MORE: Children playing Love Island at school by 'rating each other's looks'A married head teacher admitted having a secret affair with a pupil's mother and has made a grovelling public apology after being absent for hours during the school day claiming he was 'popping to the Co-op'.",
        "Aled Rees — who wrote to parents warning about children watching the ITV2 reality show Love Island — was caught having long chats with the mother at the school gates, taking long absences from duty and having personal phone calls in his office.A disciplinary hearing was told Rees admitted five breaches of professional standards, including an 'extra-marital relationship' with a pupil's mother at rural school Ysgol Teilo Sant in Llandeilo, Carmarthenshire.Rees told the hearing: 'I recognise my fault and blame. I take the blame.'I have fallen short of the expectations I would have set for myself and would be expected of me by bodies in general. I regret the pain I caused to members of staff, pupils, parents and not to mention my own family.'",
        "An Education Workforce Council (EWC) hearing was told Rees was having a secret romance of his own with a  mother of one of the pupils in the school.He faces being struck off the teaching register for his behaviour after a string of complaints. The hearing was told he has since left the school and does not intend to carry on working in education.Ioan Jones, representing him from the education union UCAC said he 'accepts it is not appropriate to remain in the profession'.",
        "The EWC panel heard that Rees joined Ysgol Teilo Sant as head in January 2018 before quitting in February 2021.Between September 2018 and February 2020 it is alleged he 'spent an excessive amount of time' away from the site during the school day, often without telling colleagues or arranging cover.Assistant head Maureen Williams said this left the 180-pupil school without the safeguarding lead and without anyone taking overall responsibility.The hearing heard Rees would be absent for periods ranging from 45 minutes to several hours and once for a whole afternoon amid rumours that he was seeing the mother of a pupil identified only as Learner A.Mrs Williams said: 'Although there was no evidence of an affair, there was a rumour and people witnessed the head and a pupil's mother talking together for long periods at the school gates each morning.'She asked Rees to let her know when he was leaving the site. 'He didn't give any reason other than he was popping to the Co-op for food,' she said.Mrs Williams began keeping records of the head's departures and said she noticed he left his work phone in school.She said: 'He was not leading the school as he should. He did not offer advice or support to staff. Leadership was unclear.'",
        "Mrs Williams said: 'We did not have evidence of an affair but there was a rumour going around and there was the pattern of his frequent loitering and staying outside by the gate with Learner A's mother.'Staff talked about it. I would see him at the gate talking to the parent in question.'Rees made headlines when he sent letters to parents at the school complaining that pupils as young as eight were emulating behaviour seen on Love Island and were staying up late to watch it.",
        "In 2019, Rees said Year 4 pupils had been commenting on each other's appearance and 'pairing individuals together' to emulate Love Island.Pupils were getting upset in the playground after 'rating each other based on their looks to see who would be the best match' and and 'coupling up' together.Rees told parents the show's contestants were 'no role models for our children'.In his letter to parents he said: 'I am of the opinion that primary school pupils aren't mature enough to watch a programme of this nature where a person's appearance is more important than their personality.'The influence of the programme has led to pupils commenting on others' appearance and pairing individuals together as they are a good \"match\".'I am sure that there are better ways to spend time with your children and more appropriate programmes they could be watching.'",
        "Year five teacher Elen Davies told the panel that Rees sometimes spent half an hour chatting to the parent at the school gate in the mornings. She said: 'It was clear he gave this parent more attention that other parents.'Ms Davies, 25, later informed Rees she was pregnant. Shortly afterwards, when she complained that her class had been moved, she claimed Rees said words to the effect of: 'That's what you get for opening your legs.'Rees denies he said that, but admits five allegations, including that 'by virtue of his extra-marital relationship with the mother of a child at the school, he placed himself in a position where there was a conflict of interest'."
    ]
}