{
    "articleURL": "/sport/football/article-12055163/Callum-Wilson-wows-Eddie-Howe-striking-revival-Newcastle.html",
    "content": [
        "Callum Wilson was being written off as a Newcastle player six weeks ago But, the 31-year-old has scored eight goals in the last month for NewcastleEddie Howe says Wilson understands the fact scrutiny comes with the job Callum Wilson was being written off as a Newcastle player six weeks ago. He read those comments, too. Now, he has just outscored Erling Haaland in the Premier League through April and is England's most in-form striker.",
        "Eight goals in a month — remarkable, given he made just two starts — has moved the 31-year-old to the top of his club's scoring charts for the first time since the early part of the season.He did enough then to win a place at the World Cup but returned looking spent. Many suspected his best days could be behind him, and that was committed to print. Were we foolish?'I would never call you guys foolish!' said Newcastle boss Eddie Howe. 'I think it's natural at this elite level that players are under scrutiny.'Their performances are broken down to the nth degree, and not just by me as the manager. But also by you guys in the press. I think he will understand that comes with the territory at this level.'",
        "Wilson may have understood, but he certainly did not like it, referencing the critiques on more than one occasion.His feet have done the talking for him of late, however.'He is certainly in great form,' added Howe, who could pair Wilson and Alexander Isak for the first time against Arsenal today.'He is very focused. He knows he has to be because of the competition he has around him. The biggest compliment I can pay him is that he has always been himself — bubbly, bright, laughing, joking, a really positive character.",
        "'He is someone that the squad needs to be positive, because he is such a big personality within it.",
        "'That has helped him when he has come on the pitch and delivered for us. I'm delighted for him because he can react two ways to that challenge — and he has responded how I hoped he would.'Wilson was left out of the last England squad post World Cup but, on recent evidence, he looks guaranteed to return for the summer internationals.Arsenal manager Mikel Arteta believes this season is the best opportunity for the club to win their first league title since 2003/04.'It is the best time because this is the moment right now,' said Arteta, whose side are four points off top spot. 'The best time is when you have something and try to take it, especially in elite sports because you don't know when you are going to have another opportunity.'"
    ]
}