{
    "articleURL": "/tvshowbiz/article-12046801/Tearful-Craig-Revel-Horwood-discusses-shock-losing-two-friends-weeks-other.html",
    "content": [
        "Tearful Craig Revel Horwood has discussed the shock of loosing two of his friends, Len Goodman and Paul O'Grady, within weeks of each other. ",
        "Joining Phillip Schofied and Holly Willoughby on Thursday's This Morning, he recalled some sweet moments he had shared with them both and spoke of his grief. The Strictly Come Dancing star, 58, is currently starring as Miss Hannigan in the new stage production of Annie, a role that he previously shared with Paul. The TV personality passed away 'unexpectedly but peacefully' on March 28, aged 67, with his partner announcing the news just before 3am.Speaking about the death of Paul, Craig admitted that he found it 'hard to breathe' as he reflected on the last words he heard him say.  ",
        "Craig continued: 'It was after Edinburgh, he said his goodbyes and how much he was enjoying doing it.'He did two weeks of the run and then we were to share the role out and suddenly we had the news that he’d passed and no one could really believe it. He said in Edinburgh \"I’ll see you all in Southampton.\"''When I turned up for my week, we then of course dedicated all the performances that week to Paul. It was a shock for the company, it was a shock for all of us. 'We didn’t know what was going to happen, but we had to get on with the show… as they say the show must go on, but it was really emotional. It was really hard to breathe and to get through because we were all in that state of panic and shock.'",
        "Remembering some recent moments that they shared, Craig said: 'He said that my Miss Hannigan was very glamorous and that his was very downtrodden! He was just absolutely brilliant. So funny. He was much loved and is missed.Craig also spoke of his other friend and fellow Strictly judge Len, he said: 'It was a double whammy… it really hit me.'Len died at a hospice in Tunbridge Wells following a short battle with bone cancer on April 22, just one day short of his 79th birthday.He said: 'I didn’t even know he was ill, so it was a huge shock for me and I know he wanted to keep it quiet… but a brilliant brilliant man who brought ballroom back to the world. He was fantastic.'",
        "Craig explained: 'I’m performing in Dartford at the moment and that’s where Len and his lovely wife taught me ballroom and latin. 'When I joined Strictly, I was a classical dancer but not ballroom and latin and he said \"you need to get down my school\" and I learnt to dance there with him. I have fantastic memories of him.'He added: 'He never stopped complaining! We were quite the opposite - I was like that on television and he was the nice smiley one - and the role reversed completely when we did the tour! He was brilliant. ",
        "'I will miss him. But the thing is, like Brucie, he will live inside me… and every time I hear the words \"Seven\" you know, that will always ring in my head and in my heart. My love goes out to his wonderful wife Sue and his family who are absolutely wonderful.'This Morning airs weekdays from 10am on ITV1 &amp; ITVX "
    ]
}