{
    "articleURL": "/news/article-12042479/Bidens-closest-allies-tell-wealthy-donors-ready-campaign-80.html",
    "content": [
        "Biden announced his campaign last week and holds his first funder next weekFormer chief of staff Ron Klain spoke to donors about his vigor and scheduleBiden spoke to donors Friday but has yet to hold campaign event One of President Joe Biden's closest longtime advisors is vouching to donors about his ability to throw himself into this fourth presidential campaign at 80 – as Biden plans his first big fundraiser for next week in New York.",
        "The reassurance to wealthy backers came as the president's reelection campaign has gotten off to a slow start since announcement last week, at least as far as public events are concerned.Biden officially announced his reelection campaign last Tuesday with a video that featured footage from the January 6 Capitol riot, and set up a battle for freedom and for the 'soul of America.' One of his campaign co-chairs insists he won't be stuck in the basement and will run a robust campaign.Biden attended his first in-person donor meeting Friday, but has yet to hold a campaign event on the road – with a big money haul set for New York next week.At a weekend retreat for donors, White House officials faced restrictions on what they could say based on campaign finance laws.",
        "Campaign manager Julie Chávez Rodríguez has yet to start her job, even though she has been on the White House payroll. Former chief of staff Ron Klain made a pitch of his own,  Klain spoke to donors about Biden's vigor, Axios reported, mentioning early morning meetings with the president and late-night calls. That followed an earlier report from the publication that Biden had held just four fundraisers so far this year, 12 events after 6pm, while enjoying 12 full weekends. (The White House says Biden works wherever he travels.)",
        "It remains to be seen if Biden will be able to tap the same collection of bundlers who helped him haul in a record $1 billion in 2020. His campaign has yet to reveal information about how much it has raised since the long-anticipated announcement.Aiding his team is Hollywood mogul Jeffrey Katzenberg, who attended Friday's event at the Salamander hotel on D.C.'s wharf. ",
        "'Here’s the bottom line. It’s very simple: We need you. Our democracy needs you because this is about our freedoms,' Biden told donors.He has yet to hold a campaign even for the public, and this week kept a light schedule. (On Wednesday, his schedule said he would receive the daily brief, lunch with VP Kamala Harris, and host a dinner for Combatant Commanders. Biden will be wooing big dollar donors for the first time since announcing his campaign at an event in New York City on May 10, where tickets at the home of former Blackstone exec Hamilton 'Tony' James are going for $25,000. Transportation Secretary Pete Buttigieg is set to be there, CNBC reported.  The president has a second event planned at the Upper East Side home of Greek shipping magnate George Logothetis, who also helped raise money for President Barack Obama. The low key campaign launch could partly be by design. Campaign co-chair Sen. Chris Coons (D-Del.) told DailyMail.com last week: 'I expect him to do a lot of being President. That is also in my view, the best way to run for reelection was to show what you're getting done as president.' "
    ]
}