{
    "articleURL": "/wires/reuters/article-12046837/Pro-Trump-group-powers-surge-early-US-super-PAC-spending.html",
    "content": [
        "By Jason Lange and Nathan Layne",
        "WASHINGTON, May 4 (Reuters) - A group allied with Donald Trump's bid for the 2024 Republican nomination is setting records for outside political spending early in a U.S. presidential campaign as he looks to box out his nearest rival Ron DeSantis before the Florida governor even launches a campaign.The Trump-aligned Make America Great Again Inc group, known as MAGA Inc, spent more than $7 million in the first four months of 2023 on television ads attacking DeSantis, disclosures to the Federal Election Commission show.That is far more than the roughly $4 million that all outside political groups, known as super PACs, spent in support of presidential candidates at the same point in the 2020 election cycle and vastly higher than the less-than-$1 million spent at the same point of the 2016 cycle.The heavy spending shows the threat the former president's camp sees in DeSantis, who is expected to launch a run for the Republican nomination in the coming weeks. A Reuters/Ipsos poll last week showed Trump leading DeSantis 50%-24% among Republican registered voters.\"They're trying to crush anybody who gets some momentum,\" said Mike DuHaime, a Republican strategist.So far this year, super PACs have spent more than $12 million, about three times as much as four years earlier, according to public disclosures.",
        "The outlays suggest an aggressive cycle ahead for spending by super PACs, who helped drive about $1 billion in independent spending in the 2020 presidential contest. By comparison, the campaigns of Trump and Democratic President Joe Biden spent about $2 billion combined.TRANSFERS QUESTIONEDRegistered as a super PAC, MAGA Inc is allowed to raise and spend unlimited sums supporting candidates as long as it doesn't coordinate spending with their campaigns.Some campaign finance law experts accuse the former president of breaking laws by funding MAGA Inc's spending with at least $60 million he raised for a separate group called Save America that by law is barred from financing any Trump campaign.\"Trump's camp has a clear motivation to spend early and spend quite a bit,\" said Saurav Ghosh of the Campaign Legal Center, a nonpartisan watchdog. \"I don't think they would be able to do that without the illegal transfers.\"The watchdog in November filed a legal complaint with the Federal Election Commission (FEC) arguing that MAGA Inc was not independent of Trump's campaign after taking money from Save America, the fundraising group Trump created after losing the 2020 presidential election.The FEC has not yet acted on the case, and with its leadership split evenly between Republicans and Democrats, experts consider it unlikely to do so.",
        "Steven Cheung, a Trump campaign spokesman, dismissed the Campaign Legal Center's arguments, calling the organization \"a Democrat group.\"MAGA Inc spokesman Alex Pfeiffer declined to answer questions about the group's independence from Trump, saying it was not a party in the FEC complaint.Save America gave MAGA Inc $60 million ahead of the November midterm elections. But some $40 million of Save America's transfers were made after the super PAC had largely wrapped up its midterm spending, and MAGA Inc reported having $54 million in cash as of Dec. 31.It has not yet disclosed details on its income or cash balance this year.MAGA Inc's commercials hammer DeSantis for votes he cast a decade ago as a U.S. representative in favor of reducing spending on Social Security pensions and Medicare health insurance for the elderly, and poked fun at him over an unsubstantiated rumor he ate chocolate pudding with his fingers.\"Voters need to understand Ron DeSantis´ past support for cutting Social Security and Medicare benefits,\" Pfeiffer said.Asked about the commercial's latter attack, DeSantis said in a television interview, \"Is that really the best you've got? OK, bring it on!\"DeSantis has a roughly $85 million political war chest, currently held in a state account that federal law would block him from spending on a presidential run. Campaign finance law specialists say they fear DeSantis could emulate Trump by transferring some of those funds into a federally registered super PAC to support his expected presidential campaign.",
        "\"It's deeply concerning when we have these anti-coordination rules on the books and, election after election, people walk right up to that line and walk over that line,\" said Michael Beckel, research director at Issue One, a nonpartisan campaign finance reform advocacy group. (Reporting by Jason Lange in Washington and Nathan Layne in Wilton, Connecticut; Editing by Scott Malone and Mark Porter)"
    ]
}