{
    "articleURL": "/wires/ap/article-12038573/Yankees-CF-Harrison-Bader-reinstated-injured-list.html",
    "content": [
        "NEW YORK (AP) - Harrison Bader was activated from the injured list by the New York Yankees, and the speedy center fielder made his season debut Tuesday night against the Cleveland Guardians.",
        "Bader played center and batted fifth. He went 1 for 4 with an infield single and made a diving catch to help the Yankees win 4-2.\"I´m really excited to be back,\" he said before the game. \"I feel awesome.\"New York's pitching staff took another hit, though: Right-handed reliever Lou Trivino is scheduled for season-ending Tommy John surgery Wednesday in Los Angeles. Trivino has been out all year with an elbow strain.Meanwhile, starter Carlos Rodón remains in a holding pattern because of back trouble.\"I think he´s frustrated. Like, he wants to be here. He wants to be on the mound,\" manager Aaron Boone said.",
        "Diminished by a string of injuries, the slumping Yankees hope Bader can spark their offense a bit. He's been sidelined since March 10 in spring training with a strained left oblique muscle.\"He's kind of checked all the boxes that he needs to,\" Boone said. \"He feels absolutely ready to go.\"New York (15-15) had lost four straight and seven of nine, falling into last place in the AL East. The team totaled only 10 runs during those seven defeats.Yankees slugger Aaron Judge went on the 10-day injured list Monday, retroactive to April 28, because of a strained right hip.Designated hitter Giancarlo Stanton (left hamstring strain) and third baseman Josh Donaldson (right hamstring strain) also are on the IL.",
        "\"There was never any pressure from the Yankees on their side to push anything along. And the same on my side,\" Bader said. \"I know what I have to feel to be effective for this team to help them win, and that doesn´t involve pushing the timeline up in any way.\"To open a roster spot for Bader, the Yankees optioned corner outfielder Franchy Cordero back to Triple-A Scranton/Wilkes-Barre following Monday night's 3-2 loss to Cleveland.\"Hopefully that starts a slow drip of guys returning to the lineup or to the team at different points this month,\" Boone said.In the absence of Bader, the Yankees have mostly played Judge, Isiah Kiner-Falefa and Aaron Hicks in center.Bader went 0 for 4 with Scranton/Wilkes-Barre on Sunday and was 3 for 25 (.125) with one RBI during a seven-game minor league rehab assignment. He was acquired from the St. Louis Cardinals at the Aug. 2 trade deadline last year for left-hander Jordan Montgomery.\"By all accounts he's hit the ball hard, and having good at-bats,\" Boone said.Bader was out with a foot injury when the Cardinals traded him and he didn´t make his Yankees debut until Sept. 20, batting just .217 with nine RBIs in 14 regular-season games for New York.",
        "But he had a huge postseason, hitting .333 (10 for 30) with five home runs, six RBIs and four walks in nine playoff games against Cleveland and Houston.\"I know as long as I´m healthy I can obviously do a lot of things to help this team win, on all sides of the baseball, which is my main focus,\" Bader said.The 28-year-old Bader was born in Bronxville, about 10 miles north of Yankee Stadium. He won a Gold Glove in 2021 with St. Louis and can become a free agent after this season.\"He brings some power and some speed to the lineup as well as premium defense,\" Boone said. \"So yeah, I mean, with what we've gone through it is nice to get somebody back in the mix and somebody that we were counting on a lot, too.\"New York also was counting on Rodón after signing the two-time All-Star to a $162 million, six-year contract as a free agent in the offseason. But the left-hander has been sidelined with a strained forearm since his only spring training outing on March 5, and his recovery has been slowed by a mysterious back problem.Rodón had a CT scan on his back last month that came back clean, and Boone said more doctors are examining the pitcher as the Yankees attempt to figure out \"why he can´t get over that final hump.\"",
        "\"He´s not in any pain, it´s just getting to positions the way he needs to move. We´ve got to get him there,\" Boone explained, acknowledging the back issue could affect Rodón's mechanics.Rodón has been throwing, including a recent bullpen, but the Yankees are trying to determine if he requires treatment or time off.\"The good thing is like, shoulder, elbow-wise, he´s fine. He feels great. But it´s that last hurdle that makes him Carlos Rodón,\" Boone said. \"I want to get him right and get the Carlos Rodón we know we´re going to get, and I´m confident we´ll get there.\"___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}