{
    "articleURL": "/news/article-12049897/Is-Marks-Spencer-open-Coronation-bank-holiday-Opening-times-revealed.html",
    "content": [
        "Marks and Spencer operating hours for coronation and bank holiday confirmedShop opening hours across the UK are set to be affected by the Bank Holiday weekend, which is taking place to mark the coronation of King Charles III.",
        "Major brands including M&amp;S, Tesco, Aldi and Asda are primed to operate with altered operating times on the upcoming Bank Holiday, which will fall on Monday, 8 May, 2023. The extra Bank Holiday has been called by the government to allow Brits to celebrate King Charles' coronation. Ahead of the next Bank Holiday, which comes just a week after May Day, here are the opening times for Marks and Spencer supermarkets across the UK. ",
        "Is M&amp;S open on coronation day? You can find your nearest store and check its opening hours using the locator on the M&amp;S website or on the M&amp;S App.Check the opening hours of your nearest store on the M&amp;S website before travelling to ensure it is open.Marks &amp; Spencer will also be open as usual on Sunday, 8 May. However, like other shops in England, they will operate reduced hours on Sundays due to Sunday trading hours. Is M&amp;S open on bank holidays? Many stores in England, Scotland and Wales will also have shorter hours on the upcoming Bank Holiday Monday.The majority of their shops are expected to be open but many will close earlier than usual or follow Sunday trading hours. What is the advantage of a M&amp;S Sparks card? M&amp;S Sparks cards offer a range of benefits to customers who shop regularly at the chain. ",
        "The scheme offers perks such as personalised offers based on the products you buy most regularly, donations to a charity of your choice every time you shop at the store. ",
        "The loyalty programme even gives one lucky customer their shopping for free once a week.Because of changes to its system to offer the above benefits, an M&amp;S Sparks card does not allow customers to accrue points like a Tesco Clubcard or Nectar card from Sainsbury's.  The card is free to purchase and can be used in any store across the UK and when making purchases online.  "
    ]
}