{
    "articleURL": "/wires/pa/article-12061161/Todd-Cantwell-expects-Rangers-blast-season-fighting-trophies.html",
    "content": [
        "Todd Cantwell believes Rangers will come back next season ready to battle for honours.",
        "A trophyless campaign for the Govan club has four cinch Premiership games remaining following the 1-0 win over Aberdeen at Ibrox on Sunday where the former Norwich player, who joined Michael Beale’s squad in January, scored the only goal of the game.Rangers have been linked with several players including Cantwell’s former Carrow Road team-mate Kieran Dowell, but the 25-year-old midfielder knows what is expected next season, no matter who is at the club.He said: “Playing for Rangers – you’ve got a big responsibility.“This season hasn’t gone how we wanted to go so it’s important for us next season to be in a great position to change the outcome.“Pre-season is always important. I know the manager is looking at recruitment but it’s also important for us as individuals to get your body in the place where you are ready to start the season well.",
        "“In terms of recruitment, it’s kind of irrelevant because you’ve a group of players in pre-season all fighting to be in the starting 11.“We’ve got everything to play for next season and the hunger in the dressing room will be real.“Whoever comes in, whoever leaves, whoever is playing for Rangers, it’s important to know you’ll be fighting for your spot and to win every game.”",
        "On the link with Dowell, Cantwell said: “He’s a good player. He’s someone I enjoyed playing with, we had success at Norwich and he’s a top lad.“None of that is really to do with me. It’s the manager’s choice, the club’s choice and his choice.“If that is something that happens then I’m sure the Rangers fans will be happy.”Cantwell would recommend Scottish football to players from the English Championship but said: “It’s important you weigh up your opportunities.“I can only speak for myself but it was a massive decision but also one that I’m really proud of making.“It’s not something that is particularly common and I saw it as an opportunity to come up here and show what I’m about.”"
    ]
}