{
    "articleURL": "/wires/reuters/article-12058533/NHL-roundup-Panthers-win-OT-Leafs-brink.html",
    "content": [
        "Sam Reinhart scored 3:02 into overtime as the Florida Panthers defeated the Toronto Maple Leafs 3-2 on Sunday in Sunrise, Fla., and moved to the verge of sweeping their Eastern Conference semifinal series.",
        "The Panthers, who lead the best-of-seven set 3-0, would advance with a home win on Wednesday. Florida registered its sixth straight playoff victory, a franchise record.Florida also got goals from Anthony Duclair and Carter Verhaeghe, and Aaron Ekblad had two assists. Sergei Bobrovsky made 22 saves for the win.Maple Leafs goalie Ilya Samsonov, who stopped eight shots and allowed no goals, was injured 37 seconds into the second period. Joseph Woll replaced him and saved 18 of the 21 shots he faced. Toronto got goals from Erik Gustafsson and Sam Lafferty.Devils 8, Hurricanes 4Jack Hughes scored twice and collected two assists as New Jersey took control with a three-goal first period and cruised to a victory over Carolina in Game 3 of their semifinal series in Newark, N.J. The Hurricanes still lead the best-of-seven series 2-1.Nico Hischier scored a goal and collected an assist and Dawson Mercer collected three assists for the Devils. Luke Hughes, John Marino and Jesper Bratt contributed two assists apiece. New Jersey goalie Vitek Vanecek made 26 saves in his first start since April 20.Sebastian Aho scored for the Hurricanes and Jordan Martinook scored on a penalty shot with 7:42 left in the second when Carolina was short-handed. Jordan Staal and Seth Jarvis netted short-handed goals 50 seconds apart in the third. Frederik Andersen allowed four goals on 12 shots before being pulled.",
        "Kraken 7, Stars 2Matty Beniers, Alex Wennberg, Eeli Tolvanen and Justin Schultz each had a goal and an assist as Seattle defeated visiting Dallas in Game 3 of their Western Conference semifinal series.Five different players scored second-period goals for the Kraken, who took a 2-1 lead in the best-of-seven series. Jordan Eberle, Carson Soucy and Yanni Gourde also tallied for Seattle. Goaltender Philipp Grubauer made 24 saves.Mason Marchment and Jani Hakanpaa scored for the Stars. Jake Oettinger stopped 12 of 17 shots through two periods before being relieved by Scott Wedgewood, who made six saves on eight attempts on goal.--Field Level Media"
    ]
}