{
    "articleURL": "/news/article-12053903/ABC-slammed-Coronation-coverage-viewers-unhappy-discussion-colonialism-monarchy.html",
    "content": [
        "ABC viewers unhappy with Coronation coverageABC aired two-hour special discussing colonialism The ABC has been called out by viewers after airing a 'disrespectful' two-hour special on the monarchy and colonialism as part of their Coronation coverage. ",
        "Hosted by The Drum's Julia Baird and Jeremy Fernandez, the discussion panel consisted of Q&amp;A host Stan Grant, co-chair of the Australian Republic Movement Craig Foster, Liberal MP and monarchist Julian Leeser, and Wiradjuri and Wailwan woman Teela Reid.The two-hour program started at 5pm and focused heavily on the impact colonisation has had on Indigenous Australians and people of colour, taking aim at the monarchy.But some watching on at home took issue with the fact the panel were criticising the Royal Family on the day of Charles' Coronation and instead suggested the broadcaster just report on the event itself.'There is no Indigenous foundation, no Indigenous heritage to Australia, Australia sought to erase the Indigenous heritage,' Grant said.'We weren't at the Federation discussions, we weren't at the table, indeed we weren't counted when the Constitution was written.'He went on to say that 'we don't read history in a linear way'. ",
        "'It is scars, it is broken bones and it is too many damaged souls, and we need to heal and bring love to the hearing,' he continued.'This conversation is so important, I am so glad we can have this because it is necessary.'His comments were echoed by Mr Foster, who said the Coronation offered an opportunity to talk about accountability. ",
        "'I was taught that the Crown and the monarchy was a wonderful institution and they were above accountability,' he said.'The wonderful thing in 2023, everyone is accountable.",
        "'And what I find really interesting in this period in our history as we are going back in time to learn truths so that we can genuinely understand each other and walk forward together, and at the heart of those untruths is this monarchy.'At the heart of the wound in this nation is the Crown. And yet the Crown have been above reproach.'While some viewers praised the national broadcaster's approach, others decided to change channels altogether. 'Ok I'm about to change channels away from ABC. Who can tell me the best coverage of the actual coronation?' one viewer tweeted.'I had to turn off the boring ABC coverage of the coronation,' another said, comparing it to a 'history lecture'. 'I'm finding it quite inappropriate that we are talking negatively about the monarchy when it's coronation day,' a third said. ",
        "'Have a slight bit of respect ABC.''Tried to watch it on #ABCNews but they have on commentators that are just talking non-stop about the evils of the monarchy &amp; the wrongs they've done to Australia,' said another.'Can coverage get back to the Coronation please? We don't want your Voice/Republic propaganda,' said another.",
        "'This was one of the worst coverage ABC has done in a long time. This is about a coronation, not race. Unbelievable.' 'Totally disrespectful by the ABC.' But there were many Aussies who were pleased to see the panel discuss different ideas. 'ABC coverage of the Coronation has gotten off to an excellent start by putting First Nations perspectives on colonisation and empire front and centre,' one viewer said.'Watching pre-coronation coverage on ABC, with First Nations people saying it like it is: this coronation is political,' another wrote.'The real Australia is about invasion, theft, extermination.' ABC News has been contacted for comment.  "
    ]
}