{
    "articleURL": "/wires/reuters/article-12053809/Rohingya-say-wont-return-Myanmar-stuck-camps.html",
    "content": [
        "DHAKA, May 6 (Reuters) - Rohingya refugees in Bangladesh said on Saturday they would not return to Myanmar to \"be confined in camps\" after making a visit to the country as part of efforts to encourage their voluntary repatriation.",
        "Nearly one million Rohingya Muslims are living in camps in the Bangladeshi border district of Cox's Bazar, most after fleeing a military-led crackdown in Buddhist-majority Myanmar in 2017.Twenty Rohingya Muslim refugees and seven Bangladeshi officials visited Maungdaw Township and nearby villages in Rakhine State on Friday to see the arrangements for resettlement.Rohingya have expressed discontent with the preparations for repatriation and said they will not go back unless their security can be guaranteed and they can be sure of being granted citizenship.\"We don't want to be confined in camps. We want to get back our land and we will build our own houses there,\" Oli Hossain, who was among the refugees who visited Rakhine State, told Reuters by phone.\"We'll only return with citizenship and all our rights,\" said the 36-year-old Hossain, father of six children.Myanmar is offering Rohingya national verification cards (NVC), which Rohingya refugees regard as inadequate.\"Myanmar is our birthplace and we are citizens of Myanmar and will go back with citizenship,\" said refugee Abu Sufian, 35.\"We´ll never accept NVC. This will effectively identify Rohingya as `foreigners´,\" he told Reuters, adding that Myanmar authorities \"even changed the name of my village in Rakhine\".Bangladeshi officials have made several trips to Myanmar as part of efforts to get repatriation going, but this was the first by Rohingya refugees since 2017.",
        "A Myanmar junta spokesman did not answer calls seeking comment.Myanmar's military had until recently shown little inclination to take back any Rohingya, who have for years been regarded as foreign interlopers in Myanmar and denied citizenship and subjected to abuse.A Myanmar delegation, however, visited the camps in March to verify a few hundred returnees for a pilot repatriation project.A Bangladesh official said the project would involve about 1,100 refugees but no date had been set. Attempts to get repatriation going in 2018 and 2019 failed as the refugees, fearing violence, refused to go back.The U.N refugee agency (UNHCR) reiterated that \"every refugee has an inalienable right to return to their home country. Refugee returns must be voluntary, in safety and dignity - based on an informed choice, but no refugee should be forced to do so.\"\"UNHCR maintains that dialogue with the Rohingya refugees is a must to make an informed decision,\" it said in a statement.\"... visits are an important part of voluntary refugee returns, providing a chance for people to observe conditions in their home country first hand ahead of return and contributing to the making of an informed decision on return,\" it added. (Reporting by Ruma Paul; Editing by Kim Coghill)"
    ]
}