{
    "articleURL": "/femail/article-12042857/King-Charles-Queen-Camilla-host-Buckingham-Palace-garden-party-monarchs.html",
    "content": [
        "Charles and Camilla welcomed thousands of guests to their London residenceRead More: Royal works of art! The Queen and Princess Margaret's childhood drawings sell for over £11,000 at auctionHe entertained a billion people worldwide at the 1984 Olympics and has had more than 40 hit singles. ",
        "But singer Lionel Richie says playing at the King’s coronation concert this weekend will be ‘the best thing ever’. The 73-year-old ‘Hello’ star, who was accompanied by his his glamorous model girlfriend, Lisa Parigi, 40 years his junior, met the monarch and the Queen Consort at a special coronation garden party at Buckingham Palace today.He has been an ambassador for the king’s Prince’s Trust charity, which helps vulnerable young people, since the 1980s and said he didn’t hesitate when asked if he would headline Sunday’s event at Windsor Castle.‘This is going to be so much fun,’ he said. ‘Does this ever happen? No. This is a once in a lifetime opportunity, so to be a part of it is everything. ",
        "He said of Charles: ‘Believe or not he cares. He is hands on. My job is to do the things that he cannot do, interviews and things like that. His time is valuable. So when I am travelling on my tours, this is what I do. I spread the world.’He said the concert was, without a shadow of doubt, one of the most momentous events in his life.‘In your career, there are Oscars and then there are Grammys and then there's a Coronation... are you kidding me?! This doesn't happen every day, so am I excited about this? Absolutely! This is going to be the best thing ever!’ he said.",
        "‘Windsor Castle as the backdrop? Come on, let’s be serious! There is no [other] example of something like this. It’s not like any other time in life or occasion.’Told there would be 1,000 years of history behind him at Windsor, he laughed and said: ‘Listen, don’t even say that. Now you have me scared!King Charles and Queen Camilla welcomed thousands of royal fans to Buckingham Palace this afternoon for their first garden party since he became monarch.The royal couple invited guests into the grounds of their official London residence, just three days before their coronation. The Queen, 75, looked effortlessly elegant in a navy-and-white coat dress by Bruce Oldfield - the designer who is reported to be creating her coronation gown.",
        "The royal then paired this with a matching navy hat with a white ribbon, which was designed by Philip Treacy - the man who created her wedding headpieces in 2005. Meanwhile, the King, 74, was dapper in a black morning suit and top hat - which he removed to address their guests at the beginning of the engagement.As they arrived at the party, the King stood with a wooden umbrella to speak with his guests.The pair then proceeded to work their way through the crowds - who have been specially selected by Palace aides.",
        "The US star will be performing at the Coronation Concert this Sunday. Lionel looked suitably smart in a black morning suit while his long-term girlfriend Lisa wore a stunning Monique Lhuillier blue floral dress.As Camilla greeted Lionel and Lisa, she was heard telling the couple: 'It's very nice to see you.' During their friendly exchange, the singer was seen placing his hand on Camilla's shoulder as the group shared a laugh. ",
        "‘Once the lights get up and the music starts it is just going to be fabulous. Get ready! It’s going to be magical.’Richie said he had also received an invitation to the coronation itself too. ‘I’ll be there. I mean pinch me somebody. I am really trying to be calm. I’m a kid at Christmastime. And to have the relationship I have with King Charles is just wonderful,’ he said.The Duke and Duchess of Edinburgh, the Duke of Kent and the Duke and Duchess of Gloucester all joined Their Majesties.Among the crowds were dozens of the Queen Consort’s Coronation Champions Awards winners. The initiative, organised by the Royal Voluntary Service and backed by the Daily Mail, has rewarded 500 of the country’s most dedicated volunteers.Baroness Doreen Lawrence was also among the guests at the garden party this afternoon and the King took time to speak with her and her family. ",
        "Camilla was introduced to Niamh King, 28, from Northumberland who won an award for her volunteer work at Ponteland Library.Niamh was nominated by her mother Helen who explained that her daughter, who is autistic, is passionate about reading.‘It’s her big love in life, she could read before she even went to school. Her autism means she has had quite a difficult life but her volunteering has made such a difference to her. It’s been wonderful,’ she said.Niamh agreed, adding: ‘It’s my passion.’She said it had been a shock to learn that her mother had nominated her for a Coronation Champions Award but added: ‘I love the Daily Mail and kept on reading about the awards [in it] but couldn’t believe that I would be nominated. I was so shocked. I am really excited now. I can’t quite believe I am here.’She met Camilla after her mother wrote to the royal to say that she had won an award and would be invited to the coronation garden party as her prize.",
        "‘Hello, many congratulations. I’ve just read a letter from you mother. You must have been so excited to have won,’ she said.‘Unexpected was the word, I think,’ smiled Niamh.‘Reading is the best thing in the world. It’s one of my passions too,’ the Queen Consort said. ‘Many congratulations. You should be so proud.’",
        "Elsewhere, the conversation turned to the weather forecast for the Coronation.The Queen Consort met Jade Soer, 32, from Blackpool - a helpline manager at Silver Line, a phone line dedicated to helping the elderly which has the Queen Consort as its patron.Ms Soer said: ‘We talked about the Coronation. I wished her luck and the Queen said 'It's going to rain! I said well, we run a helpline for the elderly so we are quite good when it comes to talking about the weather!’",
        "For today's engagement, Sophie, 58, opted for a pink-and-white checked coat by Suzannah London. What's more, Prince Edward, 59, appeared to match his elder brother in a long-line black jacket, dark grey trousers and light grey waistcoat. Yeoman of the Guard were pictured practising on the lawns before standing to attention as Charles greeted his guests. On May 9, the royal couple will hold another garden party at Buckingham Palace.Another garden party will be hosted at the Palace of Holyroodhouse in Edinburgh on July 4 during Holyrood Week. The King has also given permission for two additional garden parties.The Duchess of Edinburgh will host The Not Forgotten Association annual garden party at Buckingham Palace on May 16.The tri-service charity provides entertainment, leisure and recreation for ex-service men and women with disabilities or illness and serving personnel who are wounded, injured or sick.",
        "Last year, Charles and Camilla stepped up to host the first Buckingham Palace summer garden party as the late Queen was struggling with mobility issues.",
        "After it was announced that Lionel will be performing at the Coronation concert, the singer said it was a 'surprise' and an 'honour' to be chosen.The star will perform alongside Katy Perry, Andrea Bocelli and Take That at the upcoming live music event.Richie noted that he has known Charles, 74, 'for a long time' and added: 'I really do celebrate his now stepping into the king role.'The All Night Long singer said he was looking forward to the full pageantry of the upcoming coronation.'I want to see the pomp and circumstance because I don't care what you thought Michael Jackson did. I don't care what you thought Prince did. I don't care what you thought Madonna did. Nothing's going to be like this. This is the grandiose of grandiose right here,' Richie said.Other performers scheduled to perform during the Coronation Concert on May 7 include Sir Bryn Terfel, Freya Ridings and Alexis Ffrench.Some 20,000 members of the public will attend the Coronation Concert, which will be aired on BBC1 and Radio 2 along with catch-up services.",
        "According to the BBC, the concert will 'celebrate a new chapter in the nation's history' and will have 'themes of love, respect and optimism' while celebrating the 'four nations' and the Commonwealth.Richie became The Prince's Trust's first global ambassador in 2019.The concert will be backed by a 70-piece orchestra and a 'house band' made up of the Massed Bands of the Household Division and the Countess of Wessex's string orchestra.There will also be the support of The Coronation Choir – a diverse group of performers including sea shanty singers, cab drivers, farmers and reggae choirs.Landmarks and locations around the UK will also be lit up with lasers, drone displays and illuminations, the BBC said last week while announcing the celebration line-up.Charlotte Moore, BBC chief content officer, said: 'We have a world-class line-up of performers to look forward to for what promises to be a very special night of celebration and entertainment.'The coronation of Charles III and his wife, Camilla, as king and queen of the United Kingdom will take place on May 6 at Westminster Abbey.It will be the 40th coronation to be held at Westminster Abbey since 1066 and the first coronation of a British monarch in the 21st century.Earlier today, King Charles, Queen Camilla, Prince William, Kate Middleton and their children were pictured arriving at Westminster Abbey for a rehearsal of Saturday's Coronation.With just days to go until the historic event, His Majesty was pictured beaming outside the church in central London as he arrived with the Prince and Princess of Wales and their children Prince George, nine, Charlotte, eight, and Louis, five.Princess Anne and Queen Consort Camilla were there to greet the Dean of Westminster and other church officials before they went inside. The royals were also joined by Prime Minister Rishi Sunak.It comes after thousands of personnel from the Army, Royal Navy and Royal Air Force marched from Buckingham Palace to the Abbey in the early hours of this morning as they practiced for the big day on Saturday, May 6.The Diamond Jubilee State Coach and Gold State Coach were also used in the full-scale rehearsal shortly after midnight.Royal fans waited for more than three hours for the parade to make a return journey down the Mall"
    ]
}