{
    "articleURL": "/sport/football/article-12054507/Man-City-2-1-Leeds-Ilkay-Gundogan-strikes-twice-misses-penalty-late-Rodrigo-goal.html",
    "content": [
        "Ilkay Gundogan was denied a first ever hat-trick after hitting the post from 12 yards with six minutes leftSam Allardyce's return to Premier League football ended with defeat despite Rodrigo's goal late in the matchRe-live the action as it happened as City hold off late Leeds fightback to secure all three points at the Etihad In common with large swathes of the population, Leeds United sought solace in tradition on Saturday. Sam Allardyce, the manager appointed to save their season in four games, has managed a dozen clubs in a long and colourful career that contains a rich history of rescuing teams from relegation. He has had coronations aplenty.",
        "Big Sam was king for a day once before an episode with a pint of wine and undercover reporters robbed him of the England job but he has usually been cast as a pretender, a tag that irks him still. ‘There’s nobody ahead of me in football,’ he said at his Leeds unveiling last week. ‘Not Pep. Not Klopp. Not Arteta.’The problem with pitching Allardyce’s re-emergence in the Premier League at the age of 68 as the return of the king is that Manchester City are probably the deadliest apostates in the history of English football.They have no truck with tradition or with the establishment. They have dethroned Manchester United and Liverpool and this week they will come for the royal house of Spanish football, too, when they run out at the Bernabeu to try to take down Real Madrid.But however enthusiastically we patronise him, Allardyce gave City a scare at the Etihad. Pep Guardiola’s team outplayed Leeds for 95% of the game but when they grew complacent for an instant and let Ilkay Gundogan try to complete his hat-trick with a penalty, Leeds hit back.",
        "City, who made seven changes from their last game, were leading 2-0 with six minutes to go when Erling Haaland passed up the chance of another goal and allowed Gundogan to try to complete the first hat-trick of his career. Gundogan missed. A minute later, Leeds substitute Rodrigo brought it back to 2-1 and suddenly Leeds, Big Sam and their fans smelled a miracle.",
        "It didn’t quite happen but the City players left the pitch shaking their heads, Guardiola made his displeasure with Gundogan, who had been the game’s outstanding player, obvious. Allardyce and the Leeds players walked over to their fans who were jumping and celebrating as if they had just won the league.City had dismantled Leeds until those last five minutes. Gundogan, whose contract is up at the end of the season, scored a brace but the champions, who have now won 10 league games in succession, should have scored many more.City’s dominance was such that it was mainly notable for the fact that Haaland did not score although he might easily have had a hat-trick.The result left City four points clear at the top of the table and Leeds even closer to the bottom three by dint of their dented goal difference. There was a sense though that some of their spirit has been restored.",
        "This was a free hit for them. No one expected them to get anything out of this game and that is precisely what happened. They offered very little going forward but very nearly pulled off the smash-and-grab to end them all. Their future will be decided in their last three games, at home to Newcastle, away to West Ham and at home to Spurs.",
        "Man City (3-2-4-1): Ederson 7; Akanji 7, Laporte 7, Ake 7 (Walker 54min, 6); Lewis 7, Gundogan 9 (Rodri 90); Mahrez 8, Alvarez 6 (Silva 88), De Bruyne 7, Foden 7; Haaland 6.Goals: Gundogan 19, 27.Booked: None.Subs (not used): Ortega, Dias, Phillips, Stones, Grealish, Gomez.Leeds (3-4-2-1): Robles 7; Kristensen 5, Wober 5, Firpo 5; Ayling 5, McKennie 5, Forshaw 5, Roca 5 (Greenwood 58, 5); Harrison 5 (Summerville 65, 5), Gnonto 4 (Rodrigo 58, 6); Bamford 5.Goal: Rodrigo 85. Booked: Gnonto, Rodrigo, McKennie.Subs (not used): Meslier, Koch, Rutter, Gray.Referee: A Madley (West Yorkshire) 7.",
        "Leeds have now gone six games without a win and only sit above the relegation zone on goal difference but when the final whistle went and the Leeds fans roared, it felt, in a modest way, as if this was a building block.Allardyce, who dropped goalkeeper Illan Meslier and replaced him with Joel Robles, was an animated presence on the touchline from the start. His first contribution, when the ball went out of play on the far side, was to gesture energetically to his team to ensure that Weston McKennie launched a long throw into the City box. The throw was headed clear. Allardyce spread his arms out wide in disappointment.",
        "City were dominating possession, of course, and even though there was a snap in Leeds’ tackles that has not existed in recent weeks, City played around them. Julian Alvarez skied a shot after a neat pull back from Kevin de Bruyne and Haaland, unusually, was thwarted when Robles blocked his shot after he was played through by a fine pass from Rico Lewis.The chances were starting to come and before 20 minutes had elapsed, City walked one of them in. De Bruyne spread the ball wide to the right to Riyad Mahrez, Mahrez cut inside and played a short pass to Gundogan and Gundogan stroked it past Robles into the corner of the net.Midway through the half, City nearly scored what would have been one of the goals of the season. Gundogan played a breath-taking pass forward to De Bruyne with the outside of his right foot, De Bruyne volleyed it back into the path of Haaland and Haaland drilled it towards goal. It went inches wide.A minute later, City went further ahead. Lewis ran at the Leeds defence and played the ball to Haaland. Haaland danced past a couple of challenges and laid the ball out to Mahrez, who was in space again on the right. Mahrez played the ball into Gundogan again. Gundogan swept it home.",
        "Leeds mustered a rare chance when McKennie headed down from a corner and Ederson beat the ball away and then the crowd was treated to a collector’s item: Haaland was played through on goal and as he shaped to shoot, he inadvertently touched the ball with his left foot, swung his right at it and missed and fell over in a heap.",
        "Haaland missed another golden opportunity 15 minutes after the break when he took a ball from Lewis with his back to goal, swivelled in an instant and hooked a shot past Robles. It seemed for an instant as if it was heading in but the ball kissed the outside of the post on the way into touch.Six minutes from the end, City won a penalty when Phil Foden was brought down by Pascal Struijk but Haaland, who Guardiola described afterwards as 'ruthless but generous', allowed Gundogan to take the kick. He hit the post and Robles clawed the ball clear.A minute later, Leeds dragged themselves back into the game. Junior Firpo won a towering header to nod the ball on towards Rodrigo and he skipped past Manuel Akanji’s flimsy challenge and slid the ball confidently past Ederson. The Etihad was stunned into silence.Now City were nervous. Suddenly, they were playing keep-ball in the corner and running the clock down. Guardiola paced his technical area. Allardyce sensed an opportunity but it was too late. At the final whistle, he and Guardiola embraced. Two kings. Almost equal for a day. But not quite."
    ]
}