{
    "articleURL": "/news/article-12059861/The-hardest-working-royal-youve-never-heard-Queen-Elizabeth-IIs-cousin-Lady-Ogilvy.html",
    "content": [
        "Princess Alexandra has quietly attended thousands of royal engagements for more than six decades She is the late Queen’s cousin, one of her closest friends and was dubbed the 'unsung heroine' of Royal FamilyThe late Queen Elizabeth's first cousin Lady Ogilvy, a bridesmaid at her wedding in 1947, has featured in a newly released portrait of working royals in celebration of the King's Coronation.",
        "Princess Alexandra, 86, is stood between the Duke and Duchess of Edinburgh as the working royals marked the end of the weekend's events and celebrations.Edward and Sophie were seen to be sweetly offering support to Lady Ogilvy, who was smiling broadly, with both assisting her by holding her arms.Forever chic, and quintessentially diplomatic, she has never put a foot wrong in a lifetime of public service. But the polished exterior conceals a history of turmoil and upset that would have caused a lesser woman to quit public duties long ago.She may be unrecognisable to many looking over the new portrait, but Lady Ogilvy was not only the late Queen’s cousin, but also one of her closest friends and was once referred to as the 'unsung heroine' of the Royal Family.",
        "One biographer also described her as 'the most efficient working princess in the world'.Her royal style is muted and unflashy, in stark contrast to some of the more lurid events that have surrounded her life.She was a bridesmaid at the 1943 wedding of Queen Elizabeth and Prince Philip, while her own wedding to businessman Sir Angus Ogilvy was broadcast to around 200million people 20 years later. Lady Ogilvy is 56th in line to the throne, but she has become an integral part of the Royal Family and a stalwart for six decades.",
        "Her father is the Duke of Kent, one of George VI's younger brothers, and the former King was one of her godparents. Her mother was Princess Marina of Greece and Denmark.Royal biographer Hugo Vickers told The Telegraph: 'If you were a royal-watcher standing in the street, there’s no one you’d like to see more than her. 'She’s a sort of national treasure. She’s the genuine article: the most royal of all of them.'Alexandra’s first years were scarred by the seemingly endless sales of treasured family possessions, humiliatingly stripped from their home and retrieved from various other royal houses. They were misleadingly priced up for disposal in the salerooms as ‘surplus to requirement’.The townhouse in London’s Belgrave Square, where Alexandra was born ‘to the sound of a lone carol singer in the street’ was sold — but her mother, Princess Marina, was still plunged into the red at the bank.",
        "The parsimonious king, George VI, bailed her out with a tiny allowance, but Marina ‘acquired a reputation for meanness’, according to her biographer Audrey Whiting. With no real income, what else could she possibly do?Against this background, her daughter Alexandra became the first royal princess to be sent away to school — Heathfield, in Sussex — rather than being taught at home.",
        "And when her cousin Elizabeth became Queen on her father’s premature death in an RAF crash in Scotland aged just 39, Alexandra was catapulted up the royal batting order to become sixth in line to the throne.Her mother was also only 61 when she died of a brain tumour.But throughout her adult life, Lady Ogilvy continued to be a hard-working and active royal, attending around 120 public engagements a year. This included missions to Japan in 1961, helping to restore diplomatic relations following the war.Mr Vickers added: 'She has never done anything except royal duties all her life – there were not so many members of the Royal family around when she started working,'",
        "Despite having hardly a penny to her name, she was the most eligible woman in Britain and the hot tip was she would marry an Old Etonian landowner three years her senior, Lord O’Neill, whose stepfather was the James Bond author Ian Fleming.Instead, she plumped for yet another Old Etonian, the Hon Angus Ogilvy, the son of the royal-connected Earls of Airlie.They married at Westminster Abbey with a full glass carriage procession and held a white-tie ball at Windsor Castle the night before.At the invitation of the Queen, the newlyweds spent their honeymoon at Birkhall (now the Scottish home of Prince Charles and Camilla).",
        "Her relationship with the late monarch would only continue to grow over the years and she was awarded the Garter in 2003, along with an 80th birthday party at Buckingham Palace in 2016.Princess Alexandra's eldest child, James Ogilvy, is understood to be a landscape gardener and is close with Prince Edward after having gone to school together.Her daughter Marina is also the goddaughter of King Charles.Her granddaughter Flora Ogilvy, an art curator, married Swedish financier Timothy Vesterberg in September 2020 - during Covid restrictions.They celebrated the wedding when restrictions were lifted in September 2021, with members of the Royal Family attending.Guests included the Duke and Duchess of Edinburgh, as well as Lord Frederick Windsor and his Peep Show actress wife Sophie Winkleman.Princess Alexandra also donned pink for the big day, wearing a tweed blazer and polka dot dress which she paired with cream accessories.Today she is as regal, as hard-working, as engaging and as everlastingly chic as she’s always been. The delight of royals in seeing her joining them for the official portrait is testament to her popularity. "
    ]
}