{
    "articleURL": "/femail/article-12056103/Queen-Camilla-secret-names-embroidered-Coronation-dress.html",
    "content": [
        "Queen Camilla had some secret names embroidered onto her Coronation dressCORONATION LIVEBLOG: Click here to follow live updates throughout todayQueen Camilla had some secret names embroidered onto her Coronation dress - including a heartwarming homage to her rescue dogs.",
        "The royal, 75, looked elegant in her Bruce Oldfield couture gown as she was presented with a ring which 'married' her as consort to King Charles in yesterday's Coronation ceremony at Westminster Abbey.However eagle-eyed royal fans noticed that Camilla had also paid a subtle tribute to her loved ones on her show-stopping gown.She had the names of her children and grandchildren discreetly embroidered near the bottom of her skirt. Sharing close up snaps of the gown on Twitter royal expert Victoria Howard spotted that the bespoke dress appeared to reveal the names of her two children, Tom and Laura, along with those of her grandchildren, Gus, Freddy, Louis, Eliza and Lola.  ",
        "People also noticed two gold terrier pups embroidered onto the gown to represent Charles and Camilla's rescue dogs Beth and Bluebell.The royals rescued the pooches from Battersea Dogs' and Cats' Home in 2017. The two adorable dogs have even made Buckingham Palace their new home.Meanwhile her grandsons were pages of honour during the ceremony and her granddaughter was present on the day.The son of food writer Tom Parker Bowles, Freddy, 13, was a page of honour during the ceremony. While Camilla's daughter Laura Lopes, children Louis Lopes, 12, and the twin brother of Gus also had a role to play and were seen on Buckingham Palace balcony after the coronation ceremony. ",
        "There was speculation over whether Gus would be able to act as a page of honour after he broke his arm in a bike accident while on holiday.While the Queen's great-nephew Arthur Elliot, who is the son of Ben Elliot and Mary-Clare Winwood, was also asked to be a page of honour. ",
        "Camilla's ivory dress which was designed by Couturier and close friend Bruce Oldfield, who also worked closely with Diana during her time as a working Royal, was made from Peau de Soie, a silk fabric.The gown was embellished with silver embroidery which was woven by Stephen Walters in Suffolk.With an ivory, silver and gold colour palette, bracelet length sleeves, a strong shoulder and a wide V-neck neckline, the gown was in Camilla’s signature silhouette, a modest neckline, and an elongated waist.The mother-of-two accessorised the gown with matching shoes made by British designer Elliot Zed, and the same necklace that Queen Elizabeth wore to her coronation back in 1953.",
        "Camilla also donned a Robe of State, decorated with the King's favourite flowers, delphiniums, and lily of the valley, a favourite bloom of the late Queen Elizabeth II. The robe boasted hand embroidery using gold thread and depict meaningful symbols of nature, notably specific insects and flowers which hold special meaning for the couple and the wider Royal Family as a whole.",
        "Among the flowers embroidered onto the garment were lily of the valley - which was Queen Elizabeth's favourite bloom, lady’s mantle, myrtle, maidenhair fern, cornflowers, delphiniums and national emblems - the rose, thistle and shamrock.Camilla’s new robe, expertly decorated by the Royal School of Needlework (of which Camilla is patron), have also been adorned with bees and beetles to reflect the Royal couple’s affection for the natural world.Fittingly, an earlier insight into Charles' vision of his Coronation - the event invitation - also boasted similar imagery, with depictions of flowers and insects.",
        "This natural theme nods to his love of nature, sustainability and climate conservation, as a monarch who has always held preservation of the environment close to his heart.As a champion of sustainable fashion, Charles donned the same Robe of State worn by his grandfather King George VI for his Coronation in 1937, which boasts a 15ft train.And his wife too recycled an old garment, donning a robe first made for Queen Elizabeth II in 1953 and resized for the ceremony.The velvet on both robes has been restored by the Royal School of Needlework and the lining and gold lace by Ede &amp; Ravenscroft.Charles and Camilla's next scheduled appearance is today's Coronation Concert at Windsor Castle, with headline acts including Lionel Richie and Katy Perry. ",
        "Other members of the Royal Family will join 'Big Lunches' across the country today. "
    ]
}