{
    "articleURL": "/wires/reuters/article-12056459/D-backs-aim-build-momentum-big-win-vs-Nationals.html",
    "content": [
        "Coming off a wild win on Saturday, the Arizona Diamondbacks will look for a sweep when they head into Sunday's series finale against the Washington Nationals in Phoenix.",
        "Arizona scored three runs in its half of the eighth inning on Saturday, building a 6-2 lead -- only to cough it up when the Nationals scored five in the ninth. But a two-run bottom of the ninth that began with Lourdes Gurriel Jr.'s third home run of the season, part of a 4-of-5 performance, powered the Diamondbacks to an 8-7 victory.Saturday marked the third multiple-hit game for Gurriel over his past six appearances. Another Arizona batter remained hot at the plate, with Corbin Carroll extending his hitting streak to 11 games with an eighth-inning, RBI single on Saturday.Arizona's five runs in the eighth and ninth innings all came against the Washington bullpen, including Kyle Finnegan, who took the loss.\"Still early in the season,\" outfielder Lane Thomas, who hit the Nationals' go-ahead homer in the top of the ninth, told The Washington Post. \" will have plenty of chances to go out there. I think everybody here has confidence in that guy every day.\"The Nationals came into this weekend series with Arizona, the first leg of a six-game western road swing, having taken three in a row from the Chicago Cubs. They will try to regain that kind of result on Sunday with a starting pitcher who contributed to the strong showing in their last series.",
        "Right-hander Trevor Williams (1-1, 3.41 ERA) starts for Washington. Williams has not earned a decision in any of his past four starts, but he pitched 5 1/3 shutout innings with four strikeouts in his most recent appearance on Tuesday against the Cubs.Williams will face Arizona for the first time since April 23, 2022, when, as a member of the New York Mets, he lasted just two innings after giving up seven hits and four earned runs in a loss.Williams is 2-4 in eight career appearances against the Diamondbacks with 26 strikeouts and a 3.50 ERA.After opening the series Friday with a 3-1 win, Arizona has won three straight and six of its past eight as it pursues its first series sweep of the season.The Diamondbacks are looking to build on a perfect start to a lengthy homestand. Sunday is the third game of 10 straight at Chase Field.\"It's great to send our fans home happy,\" said Pavin Smith, who drew the game-winning walk for Arizona on Saturday. \"They were great out there. They packed [the ballpark] and they gave us a lot of energy.\"Ryne Nelson (1-2, 6.39) is set to make the start for Arizona on Sunday. Nelson took the loss in each of his past two starts, the most recent of which came April 30 at Colorado.",
        "Nelson surrendered six earned runs on nine hits over just four innings against the Rockies. The right-hander has given up 20 combined base hits in his past two starts, allowing 11 in an April 25 loss to Kansas City.Sunday marks Nelson's first career appearance against Washington.--Field Level Media"
    ]
}