{
    "articleURL": "/wires/reuters/article-12054687/India-verifying-cause-deaths-tension-hit-northeast-state.html",
    "content": [
        "By Zarir Hussain",
        "GUWAHATI, India, May 6 (Reuters) - Authorities in India's northeastern state of Manipur are investigating if the death of 18-20 people in the last few days was due to recent clashes between tribal and non-tribal groups, a government official said.There have been incidents of looting and arson in parts of the remote state bordering Myanmar in recent days.\"We have reports of about 18 to 20 deaths in the last few days although we are still verifying whether these deaths took place due to the recent violence or related to some other incidents,\" Kuldeep Singh, security adviser to the Manipur government, told journalists in the state capital Imphal.Some media reports said the death toll of ethnic clashes among tribal groups in Manipur has reached 54.\"About 100 people were injured and were treated in various hospitals,\" Singh said, adding more than 500 houses were burnt down during the last few days and some vehicles were also set ablaze.Manipur Director General of Police P. Doungel said orders have been given to take strict action against anyone found involved in acts of violence.\"We have asked army to stage flag marches in violence hit areas and instructed the forces to take stringent action against anyone involved in violence,\" Doungel told journalists.",
        "The Meitei people, the largest single ethnic group in the state, have been agitating to be granted scheduled tribe status, but the other recognised tribes in Manipur oppose that move.India reserves some government jobs, college admissions and elected seats, from village councils to the parliament, for communities under the scheduled tribe category as a form of affirmative action to tackle historical structural inequality and discrimination.Last month, the Manipur High Court asked the government to consider the Meitei community's plea and decide on it. (Reporting by Nidhi Verma; Editing by Hugh Lawson)"
    ]
}