{
    "articleURL": "/sport/football/article-12057953/Wrexham-stars-continue-enjoy-four-day-Las-Vegas-bender.html",
    "content": [
        "Wrexham players have continued to party in Las Vegas after winning promotionThe stars are on a four-day trip to the US paid for by the club's Hollywood ownersPlayers were seen in deep in conversation while drinking beer by the pool  Wrexham players have continued to enjoy the celebrations in Las Vegas as they relaxed by the pool on day three of their holiday.",
        "Wrexham's owners, Hollywood actors Ryan Reynolds and Rob McElhenney, have put on a four-day all-expenses-paid trip to the USA as reward for their efforts this season. Stars have already hit the dancefloor at plush nightclub Hakkasan, swum in the giant pool at the MGM Grand Hotel and eaten dinner at the Bellagio.And on day three, the players were seen deep in conversation relaxing by the pool again while drinking beer.  The National League champions were told a 'monster' party lay in wait if they won the league, something they managed in style with a record 111 points to fire them back into League Two.  ",
        "Hollywood pair Reynolds and McElhenney, true to their word, sorted a luxury four-day trip to Las Vegas, with a packed itinerary also made for the footballers. 'It became a thing where if we won the league, we'd get a holiday. So we're off to Vegas,' star striker Paul Mullin, who bagged 47 goals this season, told GQ.'Ryan and Rob told us to leave our cards at home, they're sorting the lot. They sent us a full itinerary just now. Part of me doesn't want to go, I might be dead by the end of it! But I'd never go to Vegas by my own accord, so I'm buzzing for it.'",
        "Three days after celebrating the club's move up to the fourth tier with an open-top bus parade, the promotion winners got a first taste of the high life in Las Vegas.After jetting off to Sin City on Thursday, the festivities well and truly began with videos emerging of players on the dancefloor of a popular nightclub on the Vegas strip.The players have also been seen living it up at nightclub Hakkasan, the MGM Grand Hotel and the Bellagio. "
    ]
}