{
    "articleURL": "/sciencetech/article-12046711/White-House-lays-AI-damage-control-plan-KAMALA-HARRIS-programs-czar.html",
    "content": [
        "White House is launching  initiative to reduce the potential risks of the 'powerful' technologyUnpopular VP Kamala Harris is now AI czar under the new action plan READ MORE:  More than 1,000 tech leaders call for a pause on AIThe White House has unveiled its plan to crack down on the AI race amid growing concerns it could upend life as we know it.",
        "The Biden Administration said the technology was 'one of the most powerful' of our time, adding: 'But in order to seize the opportunities it presents, we must first mitigate its risks.'The plan is to launch 25 research institutes across the US that will seek assurance from four companies, including Google, Microsoft and ChatGPT's creator OpenAI, that they will 'participate in a public evaluation.'Many of the world's best minds have warned about the dangers of AI, specifically that it could destroy humanity if an assessment of risk is not done now.Tech giants like Elon Musk fear AI will soon surpass human intelligence and have independent thinking. This means it would no longer need or listen to humans, allowing it to steal nuclear codes, create pandemics and spark world wars.Vice President Kamala Harris - who has the lowest approval rating of any VP - will lead the containment effort as 'AI czar' with a budget of just $140 million. For comparison, Space Force has a budget of $30 billion.",
        "Harris met with executives from Google, Microsoft and OpenAI Thursday to discuss how such potential risks can be reduced. 'As I shared today with CEOs of companies at the forefront of American AI innovation, the private sector has an ethical, moral, and legal responsibility to ensure the safety and security of their products,' the White House shared in a statement.",
        "'And every company must comply with existing laws to protect the American people. I look forward to the follow through and follow up in the weeks to come.'Each company's AI will be tested at a hacker convention in Las Vegas this summer to see if the tech aligns with the administration's 'AI Bill of Rights.' The release of the ChatGPT chatbot in November has led to an increased debate about AI and the government's role in monitoring the technology. Because AI can generate human-like writing and fake images, there are ethical and societal concerns. These include distributing harmful content, data privacy violations, amplifying existing bias and - Elon Musk's favorite - the destruction of humanity.'President Biden has been clear that when it comes to AI, we must place people and communities at the center by supporting responsible innovation that serves the public good, while protecting our society, security, and economy,' reads the White House announcement.'Importantly, this means that companies have a fundamental responsibility to make sure their products are safe before they are deployed or made public.'The public assessment will be conducted by thousands of community partners and AI experts, according to the White House.",
        "VP Kamala Harris is now AI czar and will oversee an effort to ensure the technology is developed responsibly.Harris will work with Microsoft, OpenAI and Google about how they can mitigate risks and work with the government.The companies will 'participate in a public evaluation.'The public assessment will be conducted by thousands of community partners and AI experts, according to the White House.Testing by professionals in the industry will see how the models align with the principles and practices outlined in the AI Bill of Rights and AI Risk Management Framework.The White House is investing $140 million to open seven more AI research institutes, bringing the total to 25. ",
        "Testing by professionals in the industry will see how the models align with the principles and practices outlined in the AI Bill of Rights and AI Risk Management Framework.Biden's AI Bill of Rights, announced in October 2022, provides a framework for how government, technology companies and citizens can work together to ensure more accountable AI.The bill includes five principles: Safe and effective systems, algorithmic discrimination protections, data privacy, notice and explanation and human alternatives, considerations and fallback. 'This framework applies to (1) automated systems that (2) have the potential to meaningfully impact the American public’s rights, opportunities, or access to critical resources or services,' the White House shared in October.The White House's plan of action follows an open letter signed by Musk and 1,000 other technology leaders, including Apple co-founder Steve Wozniak in March.The tech tycoons called for a pause on the 'dangerous race' to advance AI, saying more risk assessment needs to be conducted before humans lose control and it becomes a sentient human-hating species.At this point, AI would have reached singularity, which means it has surpassed human intelligence and has independent thinking.AI would no longer need or listen to humans, allowing it to steal nuclear codes, create pandemics and spark world wars.They asked all AI labs to stop developing their products for at least six months while more risk assessment is done. ",
        "If any labs refuse, they want governments to 'step in.' Musk fears that the technology will become so advanced that it will no longer require - or listen to - human interference.It is a fear that is widely held and even acknowledged by the CEO of AI - the company that created ChatGPT - who said earlier this month that the tech could be developed and harnessed to commit 'widespread' cyberattacks.DeepAI founder Kevin Baragona, who was among those who signed it, explained why the rapidly advancing field of AI was so dangerous.",
        "British-Canadian pioneer Geoffrey Hinton, 75, further fanned the flames of a growing Silicon Valley civil war, as he issued a spine-chilling warning that 'scary' chatbots like the hugely popular ChatGPT could soon become smarter than humans.",
        "'It's almost akin to a war between chimps and humans,' he told DailyMail.com.'The humans obviously win since we're far smarter and can leverage more advanced technology to defeat them.'If we're like the chimps, then the AI will destroy us, or we'll become enslaved to it.'This month the 'godfather' of AI Geoffrey Hinton, 75, has tossed a grenade into the raging debate about the dangers of the technology — after sensationally quitting his job at Google and saying he regrets his life's work.",
        "Hinton said chatbots can already hold more general knowledge than a human brain. He added that it was only a matter of time before AI also eclipses us regarding reasoning.At this point, he said, 'bad actors' such as Russian President Vladimir Putin could use AI for 'bad things' by programming robots to 'get more power.'In 1970. co-founder of MIT's AI lab Marvin Minsky told Life Magazine, 'from three to eight years, we will have a machine with the general intelligence of an average human being.'And while the timing of the prediction was off, the idea of AI having human intelligence is not.ChatGPT is evidence of how fast the technology is growing.In just a few months, it has passed the bar exam with a higher score than 90 percent of humans who have taken it, and it achieved 60 percent accuracy on the US Medical Licensing Exam.'Large language models as they exist today are already a revolution enough to power ten years of monumental growth, even with no further technology advances. They're already incredibly disruptive, Baragona told DailyMail.com.'To state that we need more technological advances right now is irresponsible and could lead to devastating economic and quality of life consequences.' "
    ]
}