{
    "articleURL": "/news/article-12053101/My-son-wrong-Joe-Biden-DEFENDS-scandal-ridden-son-Hunter.html",
    "content": [
        "Joe Biden on Friday spoke to MSNBC in his first television interview since February, and his first since declaring last week he was seeking re-electionBiden was asked about his son Hunter, 53, who is being investigated for potential tax issues and lying on a permit application for a gunBiden told Stephanie Ruhle: 'My son has done nothing wrong. I trust him, I have faith in him,' and added he was 'proud'Joe Biden on Friday defended his scandal-hit son Hunter amid investigations for alleged tax violations and lying on a gun permit, insisting: 'My son has done nothing wrong.'",
        "The president spoke to MSNBC's Stephanie Ruhle in his first one-on-one with a television reporter since February, when he spoke to PBS Newshour.It is also the first since announcing his 2024 campaign.Biden was asked about his 53-year-old son, whose business and tax dealings are being investigated by prosecutors.Asked how the investigation impacts his presidency, Biden replied: 'First of all my son has done nothing wrong.'I trust him, I have faith in him,' he said.'And it impacts my presidency by making me feel proud of him.'",
        "Hunter Biden met with U.S. Attorney for Delaware David Weiss at Justice Department headquarters in Washington D.C. last week, in a sign that the federal investigation of him on tax matters and a gun charge are reaching a conclusion. Weiss and his federal prosecutors are weighing four charges against Hunter - three related to tax crimes, and the fourth a felony charge related to a gun purchase, according to the Washington Post. Meanwhile, Congressional Republicans are stepping up their probes of Hunter Biden's finances and what some of them call the 'Biden crime family.'This week, Senator Chuck Grassley of Iowa, 89, and House Oversight Committee Chairman James Comer said they had heard from a whistleblower.They described being told about a bribery scheme from when Biden was serving as vice president.",
        "'We believe the FBI possesses an unclassified internal document that includes very serious and detailed allegations implicating the current President of the United States,' said Grassley.Grassley later said in an interview that he did not know whether the whistleblower's claims were true.He told Newsmax: 'It is a very serious allegation. I wish I could say that I knew it was true or untrue.'",
        "The president, meanwhile, was asked by Ruhle why he was running for re-election. Biden, 80, made his reelection bid official last Tuesday by releasing a video. Since then, he has yet to hit the campaign trail - and spent most of this week out of the public eye. Ruhle pointed out that no Fortune 500 company is currently looking to hire a CEO in their 80s, and asked why he thought he was up to the task. 'Because I have acquired a hell of a lot of wisdom and know more than the vast majority of people,' said Biden.'And I'm more experienced than anybody that's ever run for the office.'And I think I've proved myself to be honorable as well as also effective.'He added that it would be catastrophic for the United States if Donald Trump returns to the White House. 'We cannot let this election be won and the same man who was president four years ago,' he said.",
        "Asked what the difference was between himself and Trump, Biden replied: 'Everything, everything. Everything.'Biden touted his success with infrastructure, telling Ruhle that voters were 'going to see movement.'He added: 'How can we be the most successful economy in the world without first rate infrastructure?'We used to be number one in the world; now we're 13.'Biden said he was changing that, investing in improved railroads and bridges, and replacing lead pipes.Asked why the polls were so against him, Biden blamed the media.'All they've heard is negative, for three years,' he said.'I'm not being critical of the press, but you turn on the tv and it's all negative.'Ruhle noted that his campaign launch video featured multiple clips showing his vice president, Kamala Harris.She asked whether Harris was so heavily featured because Biden was intending to hand over the presidency to her, without completing his term.He said no, adding: 'I just think Vice President Harris hasn't got the credit she deserves.'He referenced her resume, pointing out her career as a senator and attorney general of California.'She is really, really very good,' he said.'She hasn't got the credit she deserves.'The president was also asked about the debt ceiling and potential default.",
        "He said he had faith in Kevin McCarthy, the Republican Speaker of the House, but felt he was cornered by MAGA Republicans who wanted extreme cuts to the budget - slashing the number of teachers, FBI and DEA agents, and ending caps on drug pricing.",
        "'I think he's an honest man,' said Biden.'I think he's in a position tho that he - 15 votes, he just about sold away everything. There's the Republican party and the MAGA Republicans.'In order to be speaker, he agreed to things that maybe he believes, but it's extreme.'He added: 'I am prepared to negotiate in detail with their budget.'  Biden expressed frustration at the situation on the U.S.-Mexico border, saying he asked Congress to come up with help.Next week, Title 42 expires, which will potentially spark a surge in migrants coming across the border.Biden has frequently been criticized for failing to spend enough time answering questions. Two weeks ago, The New York Times called Biden's press shyness a 'deliberate strategy' noting that in the 100 years since President Calvin Coolidge took office only Republican presidents Richard Nixon and Ronald Reagan held as few news conferences as Biden. He's yet to do a sit-down interview with an American newspaper. Overall, before Friday's meet-up with Ruhle, he'll have done 54 interviews.",
        "By comparison, Donald Trump did 202 interviews during his first two years in office, while Barack Obama sat down for 275 interview, The Times said. On Friday, Biden cut short shouted questions, saying he was going to do a press conference later on.",
        "It was later clarified by aides that he meant the interview. Biden and Kamala Harris then went to a takeout spot in DC to buy tacos, to mark Cinco de Mayo. In the meantime, conservatives on Twitter mocked Biden for confusing an interview and a press conference.  'The White House is already scrambling to walk this back,' said Republican National Committee Chair Ronna Romney McDaniel. 'Biden's last solo press conference was 172 days ago.' "
    ]
}