{
    "articleURL": "/wires/reuters/article-12040005/COLUMN-Oil-prices-drift-renewed-economy-concerns-Kemp.html",
    "content": [
        "By John Kemp",
        "LONDON, May 3 (Reuters) - Oil prices have slipped back as the short-covering rally prompted by OPEC+'s surprise output target cut has been completed and given way to a wave of profit-taking and fresh short selling prompted by concerns about the economy.Hedge funds and other money managers sold the equivalent of 87 million barrels in the six most important petroleum futures and options contracts over the seven days ending on April 25.The selling was the first since the U.S. regional banking crisis erupted in March and came after funds had purchased a total of 245 million barrels over the previous four weeks.The most recent week saw sales across the board, including Brent (-35 million barrels), NYMEX and ICE WTI (-19 million), European gas oil (-14 million), U.S. gasoline (-13 million) and U.S. diesel (-6 million).The combined position fell to 447 million barrels (23rd percentile for all weeks since 2013) down from 534 million barrels (38th percentile) seven days earlier.The ratio of bullish long to bearish short positions fell to 3.52:1 (39th percentile) from 5.00:1 (64th percentile) a week before.Chartbook: Oil and gas positionsHeightened fears about a business cycle slowdown hitting petroleum consumption overwhelmed any residual bullishness stemming from the OPEC+ production cut announced on April 2.",
        "Investment managers have become especially bearish about the outlook for middle distillates, such as diesel and gas oil, which are the most exposed to the industrial cycle.Funds held a net position in middle distillates of just 7 million barrels (21st percentile) and bullish longs outnumbered bearish shorts by just 1.13:1 (21st percentile) on April 25.Persistent inflation, increasing corporate layoffs, and heightened caution around spending by businesses and households signal a further slowdown in the business cycle over the next few months.U.S. NATURAL GASInvestors also tempered their recent optimism about U.S. gas prices as inventories continued to swell faster than normal for the time of year despite very low prices.Funds sold the equivalent of 99 billion cubic feet over the seven days ending on April 25, after buying a net total of 1,287 billion cubic feet in the previous eight weeks.The position slipped to 12 billion cubic feet net short (31st percentile for all weeks since 2006) from 87 billion cubic feet net long (34th percentile) a week earlier.The ratio of bullish long to bearish short positions slipped to 1.00:1 (31st percentile) from 1.03:1 (34th percentile) the previous week.Inventories continue tracking much higher than normal despite ultra-low prices fostering more consumption and the re-starting of the Freeport LNG export terminal.",
        "Stocks were 280 billion cubic feet (+16% or +0.61 standard deviations) above the prior ten-year seasonal average on April 21, up from a deficit of 263 billion cubic feet (-8% or -0.98 standard deviations) on Jan. 1.Stocks have continued to swell even though inflation-adjusted prices are in the 3rd percentile for all days since 1990, a signal that there is a persistent production surplus that will necessitate a further slowdown in drilling.Related columns:- Oil market has absorbed surprise production cut by OPEC (April 26, 2023)- Oil buying slows amid renewed concerns about economy (April 24, 2023)- Oil prices stall as short-covering rally is completed (April 17, 2023) John Kemp is a Reuters market analyst. The views expressed are his own (Editing by Mark Potter)"
    ]
}