{
    "articleURL": "/news/article-12038537/House-Dem-leader-attempts-force-clean-debt-limit-vote-Senate-Republicans-insist-wont-work.html",
    "content": [
        "Democrats and Republicans are feeling a new sense of urgency after the Treasury said the nation could run out of money to pay its bills as early as June 1Jeffries would need the signature of five GOP moderates in the House to bring the bill forward, and would need 60 votes in the Senate to get it throughMcConnell confirms he will attend White House meeting with McCarthy next week but will sit on the sidelines  House Minority Leader Hakeem Jeffries signaled he would try to force a vote on a clean debt ceiling raise using a parliamentary tactic known as a discharge petition even as Republicans continue to insist the president must negotiate.",
        "With financial markets eyeing the potential blowback should Republicans and Democrats fail to make a deal, it offers a prospect for moving a solution – but one with low chances of working. The Republican bill, which would slash some of President Joe Biden's favorite programs, is dead on arrival in the Democrat-led Senate. Now Jeffries is using a rarely used procedural tactic where the minority can force a clean debt ceiling bill to the floor. The discharge petition allows a sizable group of members to go around leadership to get legislation directly to the floor.'We will be in direct contact next week upon our return to Washington in connection with the discharge effort,' Jeffries wrote in a Dear Colleague letter. But Jeffries, of New York, would need the signature of five GOP moderates in the House to bring the bill forward, in addition to all of his members, and he would need 60 votes in the Senate to get it through. ",
        "Only two discharge petitions have ever gotten through the House – in part because party leaders drill into their caucuses not to let the minority party seize control of the agenda and undermine their leverage.Both Democrats and Republicans are feeling a new sense of urgency after the Treasury announced Monday the nation could run out of money to pay its bills as early as June 1. ",
        "President Biden has convened a meeting with McCarthy for May 9, after three months of refusing to meet with the GOP leader – though he insists he still will not negotiate on the debt ceiling. He's also invited Jeffries, Sen. Majority Leader Chuck Schumer and Senate Minority Leader Mitch McConnell - who will all attend the meeting. Biden's insistence that he won't negotiate is proving unpopular with Americans - a majority in both parties and 74 percent of all respondents to an Echelon Insights poll  insist the president 'should agree to negotiations and try to find common ground around the debt ceiling, including some reductions in government spending.'Though McConnell said he would be witness to the negotiations, he stressed the Senate had no central role in striking a deal. 'The president and the speaker need to reach an agreement,' he said. 'There is no solution in the Senate.' Meanwhile Senate Majority Leader Chuck Schumer insisted the Senate pass a clean debt ceiling package -- throwing cold water on the idea floated by some Republicans of a short-term 30-day debt ceiling extension. He put a vote for a clean debt ceiling bill on the Senate floor calendar.'We should not kick the can down the road. We should go for a full two year [extension],' he said.",
        "He plans to bring a bill increasing the debt limit until December 21, 2024 and insists the time to talk about budget cuts is not until after the debt limit is increased. Schumer also tamped down the possibility of invoking the 14th Amendment - as one idea thrown around cites a little-used provision that states: 'The validity of the public debt of the United States, authorized by law, including debts incurred for payment of pensions and bounties for services in suppressing insurrection or rebellion, shall not be questioned.'It offers a potential workaround in case negotiations collapse completely leading to a potential default scenario, but the move would be full of uncertainty, both politically and for markets. 'The way to go is a clean debt ceiling,' Schumer said. ",
        "Senate Republicans backed up Speaker McCarthy in saying no debt ceiling bill would happen unless Democrats agreed to budget cuts.  'A clean debt ceiling is not going to happen,' said Senate GOP Whip John Thune of South Dakota. White House press secretary Karine Jean-Pierre said Tuesday that in the meeting Biden won't negotiate the GOP's demands for raising the debt limit, but 'will discuss initiating a separate process to address the budget and appropriations.' 'The only practical path is to suspend the debt limit without conditions,' Jean-Pierre said. ",
        "Last week House Republicans passed a party-line bill that would raise the debt ceiling by $1.5 trillion in exchange for $4.5 trillion in spending cuts. Biden had long insisted he would sit down with the speaker once Republicans had a plan in writing. "
    ]
}