{
    "articleURL": "/wires/reuters/article-12058813/Death-toll-Congo-floods-rises-401-governor.html",
    "content": [
        "By Crispin Kyala and Ange Kasongo",
        "BUSHUSHU, Democratic Republic of Congo, May 8 (Reuters) - D ead bodies were still being recovered on Monday from two villages in eastern Democratic Republic of Congo where floods killed more than 400 people last week in one of the country's deadliest disasters in recent history.Many dazed survivors were mourning multiple family members killed in the flash floods that swept away entire homes and buried the villages of Bushushu and Nyamukubi, both in South Kivu province, in muck and debris.\"Over there in the mud, that's where our house was. We lost six people in our family. In our house, five children died and our mother who is the sixth,\" said 22-year-old Alliance Mufanzara, pointing at an empty plot of churned earth.She, her younger brother, and father are the only survivors.\"We're scared because our whole family is finished,\" she said. \"We have nothing.\"Humanitarian workers have spent days recovering mud-caked bodies from the wrecked villages in Kalehe territory, where days of torrential rain triggered landslides and caused rivers to break their banks on Thursday.\"It is an unprecedented humanitarian disaster,\" said government spokesperson Patrick Muyaya.The large number of casualties has meant workers have had to bury victims in freshly dug mass graves, according to videos posted online, which Reuters was not immediately been able to verify.",
        "\"We left everything behind,\" said Bushushu resident Bahati Kabanga, 32, who managed to rescue his only child but lost his aunt, nephews and a sister.\"We felt a tremor while it was raining and decided to flee after seeing houses collapse in the distance,\" he told Reuters by telephone.Just over 400 people are now confirmed dead, South Kivu governor Theo Ngwabidje Kasi said earlier on Monday, more than doubling the toll since Friday.Civil society sources on the ground expect it to rise further as bodies were still floating in rivers and buried under wreckage. Hundreds of people remain unaccounted for, according to the United Nations.DAY OF NATIONAL MOURNINGThe Congolese Red Cross said that 274 people had been buried so far, including 98 women and 82 children.Over 8,800 others have been impacted by the floods, which swept away homes and schools and cut off roads, it said. Destroyed sewage systems and bodies lying in debris are raising concerns about sanitation, it said.Families have been separated and traumatised survivors are taking refuge in other people's homes, the Red Cross added.\"If I hadn't gone to the market maybe I could have saved my children,\" said mother of five Jolie Ambika Nathalie, 34, in Bushushu.The charcoal seller left her three youngest children at home to run an errand when the rain hit. By the time she returned, the house was destroyed and her 6, 8 and 10-year olds were nowhere to be seen.",
        "\"There was no trace of the house when I got back,\" she told Reuters.The central government has sent a delegation to the area and declared Monday a day of national mourning.Warming temperatures due to climate change are increasing the intensity and frequency of Africa's rains, according to U.N. climate experts.This can increase the destruction wrought by the floods and landslides that were already common in South Kivu. Poor urban planning and weak infrastructure also make it more vulnerable to such events.Heavy rains also triggered flooding and landslides in neighbouring Rwanda last week, killing 130 people and destroying more than 5,000 homes. (Additional reporting by Sonia Rolley, Paul Lorgerie and Beniut Nyemba in Kinshasa; Writing by Sofia Christensen and Alessandra Prentice; Editing by Alexander Winning, Angus MacSwan and Sandra Maler)"
    ]
}