{
    "articleURL": "/wires/reuters/article-12048485/Block-beats-expectations-revenue-boosting-shares.html",
    "content": [
        "By Hannah Lang",
        "May 4 (Reuters) - Block Inc posted a rise in first-quarter revenue on Thursday as its popular payments platform Cash App continued to drive growth, a metric investors will watch closely following U.S. short-seller Hindenburg Research's disclosure in March of short positions in the firm.Shares of Block, formerly called Square, were up more than 1% in extended trading on Thursday, paring gains after rising more than 4%. Prior to market close, its stock was down more than 10% from the beginning of this year.The company posted total net revenue of $4.99 billion in the quarter ended March 31, up 26% from the prior year and beating analysts' estimate of $4.59 billion, according to Refinitiv data.The San Francisco-based fintech, which offers merchant payment services and an app that facilitates peer-to-peer payments and lets people trade cryptocurrency, said gross profit in the first-quarter rose 32% to $1.71 billion.Hindenburg, whose report this year triggered a rout of more than $100 billion in shares of India's Adani Group companies, had accused Block of overstating its user numbers by allowing fake or duplicate accounts to exist on its Cash App platform. The allegations sent shares in the company down 22%.Reuters could not verify the claims raised in the report. Block has denied the allegations and has said it would explore legal action against the short seller. Short sellers like Hindenburg typically sell borrowed securities and aim to buy these back at a lower price.",
        "In a call with analysts, Block CEO Jack Dorsey said the firm stands by its response to the report.\"We will not be distracted from our strategy and from our prioritizations,\" he said. \"We have a pretty compelling roadmap ahead of us in every one of our ecosystems.\"Block´s revenue growth has moderated over the past few quarters as inflation prompted consumers to defer big-ticket purchases. In its previous earnings report, the payments firm said it was \"meaningfully slowing\" the pace of hiring this year to control costs. (Reporting by Hannah Lang in Washington; Editing by David Gregorio)"
    ]
}