{
    "articleURL": "/tvshowbiz/article-12060087/Rihanna-showcases-bare-pregnancy-belly-edgy-maternity-ensemble-AP-Rocky.html",
    "content": [
        "Rihanna is gifting the world with her edgy maternity style again. ",
        "On Sunday night, the We Found Love singer turned heads as she went for a late date night out in New York City with her partner A$AP Rocky. The pregnant star let her bare belly out for the world to see, as she wore a mesh bralet over a more traditional white maternity bra. Many fans and fashion critics have praised the star for 'redefining' maternity wear - having famously opted for scantily and stylish maternity looks during her first pregnancy. Rihanna, 35, revealed she was pregnant with her second child during her performance at the Super Bowl LVII halftime show on February 12 in Glendale, Arizona. It is the second child for the performer and her 34-year-old rapper beau - real name Rakim Athelaston Mayers - after welcoming their first child Noah Mayers, 11 months, last year. Earlier this month, the hitmaker revealed that is dealing with 'tons of nausea' but 'no cravings' during her second pregnancy.",
        "The Diamonds singer admitted this pregnancy is \"so different\" to her first time, telling Entertainment Tonight: 'It's so different from the first one. No cravings. Tons of nausea.''Everything's different, but I'm enjoying it... I feel good. I feel energetic.'RiRi and Rocky welcomed their baby boy into the world in May 2022, and the 35-year-old singer is 'obsessed' with her son.",
        "She said: 'I'm in love. I'm obsessed and I don't even feel guilty about it.'Her partner added: '[He's] growing big. Beautiful, happy baby.'The loved up couple were speaking at the Met Gala, and the proud mum paid tribute to the late Karl Lagerfeld with her outfit.She stepped out in a stunning white Valentino gown with a silk cape made from embroidered white flowers, and a 16-foot train.",
        "The cape took 30 seamstresses to make, and featured 30 Camellias, 500 petals and 25 leaves.She completed the look with a pair of white framed sunglasses completed with large fake eyelashes.Meanwhile, Rocky went with a black suit jacket and kilt worn over a pair of jeans, and he also honoured Lagerfeld with a single black leather glove and shades.Rihanna previously admitted she found choosing outfits during her first pregnancy to be a 'piece of cake', but the Work singer struggled with her style choices in the first weeks after her son was born.She said: 'Dressing for pregnancy was such a piece of cake. But dressing in postpartum, what the f*** do you do? The week that I came home from the hospital that was nothing but sweats and hoodies.'But the weeks after that, you don’t know what to put on. Everything is too small or too big.",
        "'You kind of just gotta wait it out otherwise you end up buying so many clothes you’re not going to use. Well, unless you get pregnant again.'"
    ]
}