{
    "articleURL": "/wires/pa/article-12061177/Trump-rape-case-Even-former-president-not-law-court-told.html",
    "content": [
        "Donald Trump should be held accountable for sexually attacking an advice columnist in 1996 because even a former president is not above the law, a lawyer for the columnist told a jury on Monday in closing arguments in the lawsuit that accuses Trump of rape.",
        "A lawyer for Trump responded by calling the accuser’s account “unbelievable” and “outrageous”.Once the final arguments were complete, the judge sent the jury home with instructions to return on Tuesday to hear about an hour of instructions before beginning deliberations.Jurors will be asked to decide whether Mr Trump committed battery and defamed writer E Jean Carroll and whether damages should be awarded.In recapping Carroll’s case, attorney Roberta Kaplan showed jurors video clips of Trump from his October deposition and replayed the Access Hollywood video from 2005 in which Trump said into a hot mic that celebrities can grab women’s genitals without asking.Ms Kaplan recalled Trump’s comment that “stars like him can get away with sexually assaulting women”.“That’s who Donald Trump is. That is how he thinks. And that’s what he does,” Ms Kaplan said. “He thinks he can get away with it here.”Ms Kaplan used Trump’s words to support Carroll’s claims that Trump raped her in early spring 1996 in the dressing room of Bergdorf Goodman, a luxury department store in Manhattan across the street from Trump Tower.Trump’s attorney, Joe Tacopina, attacked the allegations as absurd, saying they were an “affront to justice” and minimised “real rape victims”.He agreed with Ms Kaplan that no one is above the law, but he warned that “no one’s below it” either.",
        "Mr Tacopina told jurors they will not have to “let her profit to the tune of millions of dollars” because they will see that it is impossible to believe the “unbelievable”.“This is an absolutely outrageous case,” he said, arguing that Ms Carroll sued to raise her status and for political reasons.He said even Ms Carroll had testified that it was an “astonishing coincidence” that a Law and Order offshoot aired an episode in 2012 in which a woman is raped in the dressing room of a Bergdorf Goodman.“What is the likelihood of that?” Mr Tacopina asked. “One in 20 billion? One in 10 billion?”Tacopina said the claims were too absurd to call his client as a witness, noting that Carroll expected jurors to believe Trump would risk everything to attack a woman in a busy department store even though she could not remember exactly when the assault happened.“What could I have asked Donald Trump? Where were you on some unknown date, 27 or 28 years ago?” he said. Consider the evidence and pick a number you think is right. This lawsuit is not about the money. This lawsuit is about getting her name back  Roberta Kaplan, E Jean Carroll's attorney  In a rebuttal argument, Ms Carroll’s attorney, Mike Ferrara, mocked Trump’s decision to skip the trial, saying jurors could use his absence to conclude that Trump committed the attack because Trump “never looked you in the eye and denied it”.",
        "Mr Kaplan told jurors that it wasn’t a “he said, she said” case but rather one in which jurors should weigh what 11 witnesses, including Ms Carroll, said versus what they heard from Trump in his video deposition.“He didn’t even bother to show up here in person,” Ms Kaplan said, referring to Trump’s absence from the proceedings in federal court.She told jurors that much of what he said in his deposition and in public statements “actually supports our side of the case.”“In a very real sense, Donald Trump is a witness against himself,” she said. “He knows what he did. He knows that he sexually assaulted E Jean Carroll.”Trump has insisted in public statements and in the deposition that Ms arroll made up the claims to boost sales of a 2019 memoir. He has called Ms Carroll “mentally sick” and a “disgrace”.Carroll, 79, who is seeking unspecified compensatory and punitive damages, testified for more than two days. Ms Kaplan praised her testimony as “credible”.“It was consistent, and it was powerful,” the lawyer said.Trump’s public comments are the basis of Ms Carroll’s defamation claim. Ms Kaplan labelled the comments as lies and said they ruined her client’s reputation and forced an end to her 27-year employment as an Elle magazine advance columnist.",
        "Ms aplan urged jurors to find in favour of “my brave client, E Jean Carroll,” but she put no number on the damages being sought.“Consider the evidence and pick a number you think is right,” she said. “This lawsuit is not about the money. This lawsuit is about getting her name back.”"
    ]
}