{
    "articleURL": "/wires/ap/article-12060981/UN-chief-hopes-Syria-return-Arab-League-helps-end-war.html",
    "content": [
        "UNITED NATIONS (AP) - The U.N. chief expressed hope Monday that Syria´s return to the Arab League and its engagement with regional powers could spur progress in resolving the 13-year Syrian civil war, as Damascus faced pressure to be transparent about chemical weapons.",
        "Secretary-General Antonio Guterres said he believes the region \"has a vital role to play in the search for settlement of the conflict,\" which began with an uprising against President Bashar Assad´s rule in 2011 that was met with a violent crackdown. The civil war has killed nearly a half million people, and displaced half the country´s pre-war population of 23 million.Syria was reinstated in the 22-nation Arab League on Sunday after a 12-year suspension. It was a symbolic victory for Assad, who can join the group´s May 19 summit, though Western sanctions will continue to block reconstruction funds to the war-battered country.Guterres´ comments challenged regional players to take a leading role in trying to get the Syrian government and opposition to negotiate an end to the war - something that succeeding U.N. envoys have been unable to do. The secretary-general said current special envoy Geir Peterson will \"continue to work closely with all key actors,\" according to his spokesman.At the same time, Syria´s chemical weapons program remains a serious and contentious issue. A majority of the world´s nations and the global chemical weapons watchdog accuse Damascus of hiding activities, while its close ally Russia defends Assad´s actions.Syria joined the Organization for the Prohibition of Chemical Weapons, or OPCW, in 2013 after being threatened with U.S. airstrikes in response to a chemical attack on the outskirts of the country´s capital, Damascus.",
        "In an unprecedented vote in April 2021, members of the OPCW voted to suspend Syria´s voting rights as a punishment for the repeated use of toxic gas. Investigations by the OPCW twice blamed Syrian government forces for chemical attacks and found \"reasonable grounds to believe\" it was responsible for another attack.At Monday´s monthly U.N. Security Council meeting on Syrian chemical weapons, U.N. disarmament chief Izumi Nakamitsu said Syria has failed to address \"identified gaps, inconsistencies, and discrepancies\" in its original declaration on its chemical program.Russia´s deputy U.N. ambassador Dmitry Polyansky, whose country is a veto-wielding member of the Security Council, accused the OPCW of being an \"instrument\" of the West and manipulating its investigations to blame Syria.U.S. deputy ambassador Robert Wood criticized Damascus´ failures to answer the OPCW´s questions and \"Russia´s shameless shielding of Syria´s defiant behavior,\" which he said is leaving the Syrian people facing the prospect of further chemical weapons attacks.He said Russia supported the Security Council resolution adopted in 2013 strongly condemning any use of chemical weapons in Syria and ordering it not to use, develop, produce, acquire, stockpile or retain chemical weapons. But now, he said, instead of supporting it, \"Russia has chosen to attack the credibility and professionalism of the OPCW - undermining the U.N. Charter in the process.\""
    ]
}