{
    "articleURL": "/news/article-12044365/Voter-ID-chaos-alert-amid-training-fears-Red-tape-voting-rules-risks-local-election-chaos.html",
    "content": [
        "20 forms of ID will be accepted potentially creating confusion about what's validThere are heightened fears that some voters may be turned away unnecessarilyNew red tape around voting rules risks plunging today's local elections into chaos in places – as half of town halls have given polling station staff barely any training.",
        "Research found that one in two councils have given staff less than an hour's training on the rules, while only one in ten councils set aside more than two hours.The data, based on Freedom of Information requests, last night heightened fears that some voters may be turned away unnecessarily or that large queues could form.Some 20 forms of ID will be accepted, potentially creating confusion about what is valid. A new Voter Authority Certificate will also be accepted. Expired IDs are allowed, but only if the photo still has a likeness to the holder.Training for polling station staff can also include how to deal with voters who become angry over being turned away because they don't have ID. ",
        "From today, when local elections take place across England, all voters will have to show photo ID to vote. The rules will be extended to general elections from October.",
        "Tory MPs warn that it threatens to lead to bigger losses for the party because older people, who tend to vote Conservative, are more likely to not have a valid ID.Tom Brake, the director of Unlock Democracy, which commissioned the study, said: 'These figures show that large numbers of hard-working and dedicated polling station staff are being thrown under a bus by being placed in the vulnerable position of having to deal with potentially confrontational situations without proper training.'",
        "Councillor Kevin Bentley, of the Local Government Association which represents town halls, said: 'We would urge members of the public to remember their photo ID when they come to vote and to be patient with hard-working polling staff if there are queues, or the process takes a little longer than usual.'Rishi Sunak defended introducing voter ID at yesterday's Prime Minister's Questions when warned that it risked 'disenfranchising' people who don't have a valid form of documentation.He said: 'Ninety-eight per cent of people already possess a suitable form of voter ID and the Government made available free alternative ID for those who do not have it. 'The pilots have demonstrated it hasn't significantly impacted turnout and indeed this was a policy introduced by the Labour Party in Northern Ireland all those years ago [in 2003].'It's common in European countries, it's common in Canada and it's absolutely right that we introduce it here too.'",
        "What's changed?From today, all voters will be required to show photo ID to vote at polling stations. It will be extended to general elections from October.Why is it happening?Ministers say it will eradicate potential for voter fraud and create more confidence in the voting system. The Electoral Commission says that in Northern Ireland, where photo ID has been needed since 2003, voters' confidence that elections are well-run is higher than in mainland Britain.What's the problem?Critics argue ID is unnecessary as voter fraud – pretending to be someone else at polling stations – is at worst in 'single digits' in most areas. They also say it risks thousands being unable to cast their vote if they don't have a valid ID. A trial took place in Woking, with the evaluation report finding that 99.9 per cent of voters could successfully vote – suggesting one in a thousand weren't.What happens abroad?Britain is an outlier by not requiring photo ID.What do I need?The 20 forms of accepted ID include a passport, driving licence, Blue Badge, Freedom Pass, older person's bus pass or a Voter Authority Certificate."
    ]
}