{
    "articleURL": "/wires/reuters/article-12060259/Rightward-slant-UCP-candidate-slate-risks-upsetting-moderate-Alberta-voters.html",
    "content": [
        "By Nia Williams",
        "May 8 (Reuters) - As Canada's oil province Alberta gears up for a May 29 election, some political analysts say the candidates being put forward by right-wing premier Danielle Smith's ruling United Conservative Party (UCP) may deter voters more used to moderate conservative lawmakers.Polls show the election will be a tight two-horse race between the UCP and Rachel Notley's left-leaning New Democratic Party (NDP).The result in Canada's energy heartland, and highest-polluting province, will have a huge bearing on Prime Minister Justin Trudeau's ambitious climate agenda. Smith has opposed many of Trudeau's climate policies, saying they threaten Alberta's economy, while Notley is more supportive of federal emissions-cutting measures.The western province is traditionally a conservative stronghold, but Smith has spooked moderate voters in her party with some of her more populist policy ideas and a string of controversies since becoming UCP leader in October.The government's rightward shift is being reflected in the UCP's slate of candidates for the provincial Legislative Assembly, which looks very different to what the party fielded in the 2019 election, said Lisa Young, a political science professor at the University of Calgary.A number of candidates are backed by the controversial grassroots organization Take Back Alberta, while some of the UCP's high-profile moderates, including Environment Minister Sonya Savage and Finance Minister Travis Toews, have said they will not run again.",
        "\"The UCP lost a couple of what people would consider their star candidates from 2019,\" Young said. She estimated individual candidates can affect the outcome of a vote by 4 or 5 percentage points, which could be crucial in closely fought seats.The Take Back Alberta movement was founded by right-wing activist David Parker last year in protest against pandemic-era public health restrictions and aims to get more people involved in politics.\"For too long, Alberta's ruling elite have taken advantage of everyday people, thriving on political apathy, censoring those with the courage to speak out, and exploiting the power of big government to restrict our freedoms,\" the organization says on its website.Its chief financial officer is Marco van Huigenbos, one of the organizers of the Coutts border blockade during Canada's vaccine mandate protests last year.Take Back Alberta claims credit for toppling Alberta's previous premier Jason Kenney. It also helped Smith win the leadership race, holds at least half the seats on the UCP board of directors and controls a number of local constituency associations, political analysts said.Take Back Alberta did not immediately respond to a request for comment.Dave Cournoyer, an Alberta political commentator who runs the popular Daveberta website, said between at least eight and 12 UCP candidates out of 87 in total are backed by Take Back Alberta.",
        "\"The type of politics that group brings with it is creating a very different type of conservative party than many Albertans are used to,\" Cournoyer said. \"It could deter some moderate conservatives.\"Meanwhile, the NDP has tried to field candidates with expertise in business or local politics, particularly in competitive seats in Alberta's corporate oil capital Calgary, instead of more typical left-wing candidates like union shop stewards and environmental activists, according to political commentators.Lori Williams, a political science professor at Calgary's Mount Royal University, said \"the quality of candidates\" wouldn't matter for diehard UCP voters. But it will make a difference to \"folks that are already concerned about some of the things Smith has said and done.\" (Reporting by Nia Williams; Editing by Denny Thomas and Jonathan Oatis)"
    ]
}