{
    "articleURL": "/wires/afp/article-12051415/Wagner-threatens-Bakhmut-pullout-attack-Russian-army-brass.html",
    "content": [
        "Russian paramilitary leader Yevgeny Prigozhin on Friday threatened to pull frontline troops out of Bakhmut -- the epicentre of Ukraine's determined fight against Moscow's forces -- in an extraordinary attack on military chiefs ahead of an expected offensive by Kyiv.",
        "In a series of scathing videos, Prigozhin blamed Defence Minister Sergei Shoigu and Chief of General Staff Valery Gerasimov for \"tens of thousands\" of killed and wounded Russian fighters in Ukraine.He vowed to hold them to account over what he said was a failure to provide fighters from his mercenary group, Wagner, with sufficient ammunition.\"For the tens of thousands killed and wounded, they will bear responsibility in front of their mothers and children, I will achieve that,\" he said.\"Their unprofessionalism is destroying tens of thousands of Russian guys and that is unforgivable.\"Wagner has spearheaded the grinding, months-long Russian assault on Bakhmut, almost capturing the city in the longest and bloodiest battle of the campaign.While Prigozhin has made similar threats to pull out in the past, the emotive language and the scathing personal criticism of the leaders of Russia's campaign in Ukraine were unprecedented.- 'To lick our wounds' -",
        "\"On May 10, 2023 we will have to hand over our positions in Bakhmut to units of the defence ministry and withdraw Wagner units to rear camps to lick our wounds,\" Prigozhin said in a written statement on Telegram.\"I will pull out Wagner units from Bakhmut because, in the absence of ammunition, they are facing a senseless death,\" he said, adding that he was now expecting a plan from the military on how to implement the withdrawal.",
        "Ukraine said Friday that Russia was still \"doing their best to take control of Bakhmut\" in time for World War II Victory Day celebrations on May 9 -- Moscow's most important holiday and a central event under President Vladimir Putin's rule.Ukraine is preparing a major offensive against Russian forces and experts say a series of sabotage attacks and long-distance strikes behind Russian lines are in preparation for that.In the latest development, a fire broke out at an oil refinery in southern Russia on Friday -- a day after authorities confirmed a drone attack at the same facility.Russia on Friday also announced the evacuation of some 70,000 people from areas near the front line in southern Ukraine, blaming an intensification of Ukrainian shelling on residential areas.Earlier, Prigozhin posted a video on Telegram showing rows of what he said were dead Wagner fighters in which he blamed Shoigu and Gerasimov for their deaths.- 'Dying so you can get fat' -\"Shoigu! Gerasimov! Where is my fucking ammunition?\" Prigozhin said in the video.\"They came here as volunteers and they are dying so you can get fat in your wood-panelled offices,\" he said, standing by the bodies.\"These guys are from Wagner. They died today. Their blood is still fresh,\" he said, adding that army chiefs \"will go to hell\".",
        "\"We have an ammunition shortage of 70 percent,\" he said in his tirade, in which several expletives were bleeped out.",
        "\"You sit in your (bleeped) expensive clubs... You think you are the masters of life and you have the right to decide on their lives,\" he said, pointing at the bodies.Prigozhin is closely linked to Putin and the two started their careers in business and politics in their native Saint Petersburg following the fall of the Soviet Union in 1991.In his statement on Friday, Prigozhin said his fighters had mobilised soon after the start of the campaign in Ukraine and helped Russian troops advance after a series of reversals.\"We will lick our wounds and when the motherland will be in danger -- we will again come to its defence. The Russian people can count on us,\" he said.- 'Go there and sort it out' -",
        "In a daily update on the offensive, the Russian army did not point to anything unusual, saying \"assault units\" continued to fight for the western part of the city \"supported by paratroopers.\"Ramzan Kadyrov, the leader of Chechnya whose fighters played a key role at the start of Moscow's offensive, called on the army leaderhsip to \"go there and sort it out.\"",
        "The row within Russian ranks came as Foreign Minister Sergei Lavrov repeated Russian accusations of US involvement in an alleged Ukrainian drone attack on the Kremlin.Lavrov said the attack could not have happened without Washington's awareness.\"We will respond with concrete actions,\" he said.Ukraine has denied responsibility. The United States also rejected any accusation of involvement and accused the Kremlin of \"lying\" about its role in the drone attack."
    ]
}