{
    "articleURL": "/wires/reuters/article-12061519/Crop-Watch-Late-week-eyed-bean-planting-N-Dakota-start-Braun.html",
    "content": [
        "By Karen Braun",
        "NAPERVILLE, Illinois, May 8 (Reuters) - U.S. Crop Watch farmers last week continued planting their corn and soybeans at a faster-than-normal pace, mirroring national progress, though field work has barely started in North Dakota.As of Monday, 15 of the 22 Crop Watch fields had been planted, most recently the ones in eastern Iowa, finished Thursday and Friday. Unplanted soybean fields include those in Kansas, Minnesota, South Dakota, North Dakota and Ohio. Corn also remains for the latter two states.The North Dakota producer hopes to start planting next week, unchanged from his plans a week ago, though anxiety is slightly higher now as last week´s rainfall amounts were at least double what was expected. Only a handful of fields were worked in the area last week.The producer is much less worried than a year ago as North Dakota was significantly wetter last spring, but the state faces another rainy stretch this week. Dry weather is forecast for next week, possibly opening a good window for field work so long as this week´s rains are not excessive.The North Dakota producer needs a full two weeks to plant all his acres, but he will likely be planting around wet spots anyway due to recent moisture. May 25 is the final day for farmers to plant corn in most North Dakota counties and be fully eligible for federal crop insurance benefits.",
        "Wet weather has prevented the Ohio producer from getting started, though he notes that the subsoil is relatively dry. Many Crop Watch producers have said the same, especially in western locations, emphasizing the importance of summer rainfall. Most were grateful for any moisture they received over the last few days, even if it paused planting.The Kansas producer is waiting for much-needed moisture in the next couple of days before starting on beans, and the growers in Minnesota, South Dakota and Ohio may start their bean fields by the end of the week.Crop Watch planting is moving slower than in 2021, when 19 of the 22 fields had been planted by May 7. The final two fields, Ohio corn and North Dakota soybeans, wrapped up on May 18 that year.Those same two fields were the only June-planted ones in 2022. Just six fields were planted by May 7 last year, but the total reached 14 by May 11.U.S. PROGRESSData published on Monday afternoon by the U.S. Department of Agriculture showed corn was 49% planted as of Sunday, ahead of the recent five-year average of 42%. Soybean planting was 35% complete, the second-fastest on record behind 2021 and above the 21% average.North Dakota progress is slow. Corn was 1% planted on Sunday, the same as a year ago but below the recent average of 11%. No beans were planted in the state, also the same as last year and behind the 4% average.",
        "Planting in Illinois and Missouri is moving the fastest relative to normal paces. In Illinois, corn and soybeans were 73% and 66% planted, respectively. Those compare with five-year averages of 46% and 28%.Missouri corn is 92% planted versus an average of 56%, and the state´s soybeans are 50% finished versus 12% average.On the other hand, corn planting is 6 percentage points behind average in Ohio, 11 points behind in Wisconsin and 12 behind in Michigan. Most states are planting soybeans somewhat quickly, but Minnesota is moving the slowest compared with normal as its 13% completion is 8 points below average.Scattered rains and warmer temperatures will be prominent across most of the Corn Belt this week, though most areas are expected to be drier next week. Next week´s temperature outlook is mixed, though the current bias is for cooler in the eastern Belt and warmer in the west. Karen Braun is a market analyst for Reuters. Views expressed above are her own.(Writing by Karen Braun Editing by Matthew Lewis)"
    ]
}