{
    "articleURL": "/wires/ap/article-12047617/US-Best-Sellers-Books-PW.html",
    "content": [
        "HARDCOVER FICTION",
        "1. \"Happy Place\" by Emily Henry (Berkley)2. \"Simply Lies\" by David Baldacci (Grand Central Publishing)3. \"In the Lives of Puppets\" by T.J. Klune (Tor)4. \"Small Mercies\" by Dennis Lehane (Harper)5. \"Hello Beautiful\" by Ann Napolitano (Dial)6. \"Tomorrow, Tomorrow, and Tomorrow\" by Gabrielle Zevin (Knopf)7. \"You Shouldn't Have Come Here\" by Jeneva Rose (Blackstone)8. \"It Ends with Us\" by Colleen Hoover (Atria)9. \"The Way of the Bear\" by Anne Hillerman (Harper)10. \"Hang the Moon\" by Jeannette Walls (Scribner)11. \"Dark Angel\" by John Sandford (G.P. Putnam´s Sons)12. \"Romantic Comedy\" by Curtis Sittenfeld (Random House)13. \"Night Angel Nemesis\" by Brent Weeks (Orbit)14. \"Remarkable Bright Creatures\" by Shelby Van Pelt (Ecco)15. \"Where Are the Children Now?\" by Clark/Burke (Simon &amp; Schuster)HARDCOVER NONFICTION1. \"The Wager\" by David Grann (Doubleday)2. \"Y'all Eat Yet?\" by Miranda Lambert (Dey Street)3. \"Letters to Trump\" by Donald J. Trump (Winning Team)4. \"Outlive\" by Peter Attia (Harmony)5. \"The Light We Carry\" by Michelle Obama (Crown)6. \"Comedy Bang! Bang!\" by Scott Aukerman (Abrams)7. \"Soul Boom\" by Rainn Wilson (Hachette Go)8. \"Collecting Confidence\" by Kim Gravel (Thomas Nelson)9. \"Israel\" by Tara-Leigh Cobble (Bethany House)10. \"You Can´t Joke About That\" by Kat Timpf (Broadside)",
        "11. \"The Creative Act\" by Rick Rubin (Penguin Press)12. \"Love and Lemons Simple Feel Good Food\" by Jeanine Donofrio (Avery)13. \"The Wisdom of the Bullfrog\" by William H. McRaven (Grand Central Publishing)14. \"Tasting History\" by Max Miller (Simon Element)15. \"I´m Glad My Mom Died\" by Jennette McCurdy (Simon &amp; Schuster)MASS MARKET PAPERBACK1. \"Sparring Partners\" by John Grisham (Vintage)2. \"Scent of Truth\" by Valerie Hansen (Love Inspired Suspense)3. \"Their Amish Secret\" by Patricia Johns (Love Inspired)4. \"Tunnel Creek Ambush\" by Kerry Johnson (Love Inspired Suspense)5. \"The Quilter's Scandalous Past\" by Patrice Lewis (Love Inspired)6. \"Texas Ranch Target\" by Virginia Vaughan (Love Inspired Suspense)7. \"Crime Scene Witness\" by Dana R. Lynn (Love Inspired Suspense)8. \"Riding Shotgun\" by Barb Han (Harlequin Intrigue)9. \"Cold Case Chase\" by Maggie K. Black (Love Inspired Suspense)10. \"Alaskan Wilderness Murder\" by Kathleen Tailer (Love Inspired Suspense)11. \"Casing the Copycat\" by Nicole Helm (Harlequin Intrigue)12. \"The Rancher's Sanctuary\" by Linda Goodnight (Love Inspired)13. \"The Baby Inheritance\" by Tina Radcliffe (Love Inspired)14. \"Rising Tiger\" by Brad Thor (Pocket)15. \"Wyoming Mountain Hostage\" by Juno Rushdan (Harlequin Intrigue)TRADE PAPERBACKS1. \"The Last Thing He Told Me\" by Laura Dave (S&amp;S/Rucci)2. \"It Starts with Us\" by Colleen Hoover (Atria)",
        "3. \"Never Never\" by Hoover/Fisher (Canary Street)4. \"King of Wrath\" by Ana Huang (Bloom)5. \"Heart Bones\" by Colleen Hoover (Atria)6. \"The Housemaid\" by Freida McFadden (Grand Central Publishing)7. \"Icebreaker\" by Hannah Grace (Atria)8. \"Twisted Love\" by Ana Huang (Bloom)9. \"Things We Hide from the Light\" by Lucy Score (Bloom)10. \"Run, Rose, Run\" by Patterson/Parton (Grand Central Publishing)11. \"The Invisible Life of Addie LaRue\" by V.E. Schwab (Tor)12. \"Crying in H Mart\" by Michelle Zauner (Vintage)13. \"The Four Winds\" by Kristin Hannah (Griffin)14. \"The Stranger in the Lifeboat\" by Mitch Albom (Harper)15. \"The It Girl\" by Ruth Ware (Scout)"
    ]
}