{
    "articleURL": "/health/article-12043033/Confirmed-Changing-clocks-DOES-disrupt-sleep-goes-way.html",
    "content": [
        "Canadian experts reported that people struggle to sleep after gaining an hourRead more:  Want a better night's sleep? Try leaving your window OPENChanging the clocks could lead to trouble sleeping after middle age.",
        "But sleeping problems may happen, surprisingly, after the clocks go back and we gain an extra hour, rather than when the clocks go forward. Canadian researchers asked more than 30,000 people aged 45 to 85 about their sleeping habits at six different times, around when the clocks changed.They found no difference in sleeping problems after the move to Daylight Saving Time - which comes on the last Sunday of March in the UK.But people’s sleep appeared to suffer after the clocks went back, as they do on the last Sunday of October in this country.",
        "After gaining an hour, people were more likely to regularly struggle getting to sleep, and have problems staying asleep, affecting how they functioned during the day.They also felt more tired during their waking hours.The problem is that our internal body clocks greatly rely on daylight to signal when we should be awake.To ‘reset’ this body clock, and get it in sync with our new sleeping hours after the clocks change, sleep experts say we need lots of daylight.But during the autumn months there is less daylight available.",
        "The authors also say, however, there is also a possibility that people simply notice poor sleep more in the autumn because they feel more miserable generally about the darker nights and looming winter.",
        "Either way, the study reassuringly found people’s self-reported sleep disruption after the clocks went back was short-lived.Dr Ronald Postuma, senior author of the study, from McGill University in Canada, said: ‘The good news is that the sleep disruptions we observed following the change to standard time were brief and no longer evident two weeks after the shift.’The study, published in the journal Neurology, categorised people as having ‘sleep-onset insomnia’ if they took more than 30 minutes to fall asleep, on at least three nights a week, which at least moderately affected their daily functioning, such as their work or concentration, and if they were also dissatisfied with their sleep.Among 588 people surveyed in the week before the clocks went back, only 3.3 per cent had this problem.But it was more than twice as common in 573 people surveyed in the week after the clocks went back, affecting seven per cent of them.In the week after the clocks went back, compared to the week before, people were 64 per cent more likely to have ‘sleep maintenance insomnia’.This meant waking up in the middle of the night, or too early in the morning, and finding it difficult to get back to sleep, at least three times a week, where it affected their daily functioning and left them dissatisfied with their sleep.",
        "People were twice as likely to report difficulty staying awake during the day, at least three days a week, despite getting adequate sleep of at least seven hours, when the clocks had gone back.The problem may be even worse in the UK, where light levels vary between seasons even more than they do in Canada, where the study was conducted.The study authors caution that they only asked how well people slept, rather than measuring it directly.But, while there was no difference in any sleep problems after the clocks went forward, people were 34 per cent more likely to be dissatisfied with their current sleep pattern when asked in the week after the clocks went back, compared to the week before this.Previous studies have linked changing the clocks to a rise in accidents, including car crashes, and an increase in the rate of strokes and heart attacks.Dr Postuma said: ‘The interesting result, more than whether sleep is affected by clocks going forwards or backwards, is that the clocks changing is linked to sleep problems, at least once a year (SUBS - pls keep).‘However we now know that the impact is small and wears off quickly.‘After the clocks go forward, we also found people sleep for nine minutes longer on average.’"
    ]
}