{
    "articleURL": "/tvshowbiz/article-12049919/Rachel-Brosnahan-Julianne-Hough-look-stunning-gala-Sign-Sidney-Brusteins-Window.html",
    "content": [
        "Rachel Brosnahan and Julianne Hough attended the gala for The Sign in Sidney Brustein's Window in New York City on Thursday evening.",
        "The 32-year-old actress put on a stylish display in a hooded wraparound top and high-waisted trousers while the 34-year-old Dancing With The Stars vet dazzled in a strapless gold gown. The Marvelous Mrs. Maisel star — who went braless underneath a sheer mesh gown at the 2023 Met Gala — styled her dark brunette tresses in a polished updo underneath the hood of her long-sleeved top.The House Of Cards vet paired the chic ensemble with brown slingback, pointed-toe heels to match her outfit.  She accessorized with a black belt as well as gold and tortoiseshell chunky bangles worn over the sleeves of her top. ",
        "For makeup, she opted for a minimal makeup look featuring a shimmering taupe eyeshadow look and a mauve pink lip. Hough looked stunning in a gold gown with ruched details throughout the garment and a sweetheart neckline.The professional dancer teamed the eye-catching dress with gold, metallic sandal heels.The actress styled her blonde tresses in voluminous curls swept to one side.Hough accessorized with a gold, rectangular clutch and dangling earrings. Oscar Isaac, 44, looked dapper in a light blue T-shirt underneath a beige pantsuit.The Dune actor sported a pair of black, patent leather oxford shoes. He opted out of any accessories with the exception of his gold wedding band. ",
        "At one point, he was seen posing with his wife, Elvira Lind, 42, as well as Brosnahan — who watched the couple show PDA. The Danish film director put on an elegant display in a burgundy gown with a plunging neckline as well as a pleated and ruffled skirt. She teamed the look with a pair of black, pointed-toe heels with a delicate strap around her ankles.Her highlighted, blonde tresses and bangs were styled in a pin-straight look.She looked radiant in a light makeup look with an emphasis on full, fluttering lashes and a subtle pink lip.She accessorized with various diamond-encrusted, tennis rings and bracelets. At the gala, Isaac and Brosnahan also posed with Anne Kauffman as well as the entire cast of The Sign in Sidney Brustein's Window. The play is set in Greenwich Village and follows the story of Sidney Brustein (Isaac), a man who runs a small publishing house but is feeling lost in life. ",
        "Set in the 1960s, 'Hansberry paints a portrait of the couple's marriage, and their progressive circle of friends whose ideals do not always match reality,' according to the synopsis.As relationships are tested and tensions rise among the diverse characters, the play dives into important themes such as who we are, what's right and wrong, and finding meaning in a confusing world.",
        "The play was written by A Raisin in the Sun playwright Lorraine Hansberry and first premiered in 1964.The Sign in Sidney Brustein's Window began performances on April 25 and will play on Broadway until May 28."
    ]
}