{
    "articleURL": "/wires/reuters/article-12060347/Real-Boss-Ancelotti-hopes-mental-edge-Man-City-Bernabeu.html",
    "content": [
        "By Fernando Kallas",
        "MADRID, May 8 (Reuters) - Real Madrid boss Carlo Ancelotti believes that gaining a mental advantage over Manchester City will be as important as the result when the two teams meet at Santiago Bernabeu in their Champions League semi-final first leg on Tuesday.Ancelotti said that beating Osasuna 2-1 to clinch the Copa del Rey title on Saturday had given his side a much needed confidence boost after a run of poor results as they prepare to host Pep Guardiola's team who are in superb form.While the Italian knows his side will have to be at their best to beat City, he said that gaining an edge over your opponent can be in the mind as well as on the scoreboard.\"We need to play a complete game tomorrow and be aware that the decisive match will be the second leg. So our aim is to travel to Manchester with a small advantage,\" Ancelotti told a press conference on Monday.\"As for an advantage I mean it´s not only about the result, it´s attitude, the mental part of the game too.\"If you play well, give trouble to your rival, put them in an uncomfortable position, it´s a mental advantage.\"The game of football is made of several layers and the mental part is a big one. We need to play well to bring the pressure to their side in the second leg.\"",
        "Ancelotti said that his side are not preparing a special plan to stop City striker Erling Haaland, although he praised the Norwegian's stunning form and the spark he brings to City's attack.Haaland set a Premier League scoring record last week when he netted his 35th league goal of the campaign.\"We are not preparing a match to stop a player, we are preparing to stop an entire team who looks unstoppable,\" Ancelotti said.\"Manchester City didn't change their style to accommodate Haaland, they have more options vertically with him using long balls and a more direct approach,\" he said. \"But they are still a team that work the ball really well.\"Despite talking about the need for a balanced approach, when asked about his strategy for Tuesday's clash, Ancelotti let slip that defending must be their main priority: \"If you defend well the worst thing that can happen is a draw.\"However, last year we conceded five goals and scored six to beat them. I would take it right now to repeat that same scenario this year.\"Real's veteran midfielder Toni Kroos also stressed the importance of taking their chances if they are to beat a well-oiled machine like Man City.\"We must play well and score goals. As simple as that,\" Kroos told a news conference.",
        "\"To be solid on defence is also important when you face a rival who scores three goals every game. We need to score, but I trust in the experience we have in games like this.\" (Reporting by Fernando Kallas Editing by Toby Davis)"
    ]
}