{
    "articleURL": "/wires/pa/article-12039401/Voters-reminded-photo-ID-local-elections.html",
    "content": [
        "Anyone voting in Thursday’s local elections in England is being reminded to take their photo ID with them.",
        "It is the first time that voters in England will be required to present photographic identification before casting their ballot, but only certain types will be accepted.A passport, driving licence photocard, blue badge, Totum student discount card, and older person’s bus pass are all valid, as well as a voter authority certificate.All accepted forms of ID are listed on gov.uk/how-to-vote/photo-id-youll-need.Levelling Up Secretary Michael Gove said: “If you’re planning to vote in person at your local elections, you must remember to bring accepted photo identification with you to the polling station.“These changes will prevent electoral fraud and ensure elections remain free and fair.",
        "“You can use a wide range of photo identification such as a driving licence, but make sure you check eligibility before heading out to vote.”The requirement has been described as “expensive” and “unnecessary” by Labour and sparked concern among electoral reform campaigners, who say it could lead to people being unable to vote. The Electoral Commission has confirmed that we simply won’t know how many people will have been turned away in a queue outside a polling station because they do not have the requisite ID  Labour MP Clive Betts  The Electoral Commission has estimated that about 4% of Britain’s population are unlikely to have a valid form of photo ID to vote – the equivalent of just over two million people.",
        "A senior Labour MP on Tuesday said that the Government “simply won’t know” how many people have been turned away from polling stations on Thursday because they lack ID.Clive Betts, who chairs the Commons Levelling Up, Housing and Communities Committee, was speaking after receiving a letter from the Electoral Commission that said data from greeters standing outside polling stations would not allow it to “accurately quantify the wider impact of the policy”.He said: “It appears that the Government has designed a system which denies the prospect of sensible and co-ordinated information collection and makes it almost impossible to judge the true impact of the introduction of voter ID.”The Electoral Commission intends to record the number of people who are refused a ballot paper by polling station staff because they lack ID, but not if they are turned away after speaking to the greeters that will be deployed outside some polling stations.In a letter to Mr Betts, Electoral Commission chairman John Pullinger said using data from greeters would be “inherently unreliable” as some people may turn around before speaking to anyone and others may not be recognised if they later return with the correct ID.Instead, the Electoral Commission will carry out opinion polling to gain “evidence on the fullest impact of the ID requirement”.",
        "More than 8,000 council seats in England are up for grabs on May 4 across 230 local authorities, ranging from small rural areas to some of the largest towns and cities.Elections are also taking place to choose mayors in Bedford, Leicester, Mansfield and Middlesbrough."
    ]
}