{
    "articleURL": "/wires/ap/article-12059593/EU-cancels-Tel-Aviv-event-protest-radical-minister.html",
    "content": [
        "JERUSALEM (AP) - The European Union said Monday that it canceled a diplomatic reception to prevent a radical ultranationalist Israeli minister from attending.",
        "The act of protest by the EU's delegation to Israel against a member of Prime Minister Benjamin Netanyahu's government, the most religious and ultranationalist in the country's history, could cause a diplomatic spat between Israel and the EU.Relations already have been strained over Israeli policies in the occupied West Bank.Itamar Ben-Gvir, the leader of the Jewish Power faction, serves as the national security minister and was assigned to represent the Israeli government at the EU's Europe Day event on Tuesday.Foreign Minister Eli Cohen said Sunday in a Kan radio interview that Ben-Gvir had been assigned by the government secretary to attend \"not as a representative of the Jewish Power party ... but to represent the government of Israel.\"The EU said that it decided \"to cancel the diplomatic reception, as we do not want to offer a platform to someone whose views contradict the values the European Union stands for.\" The remainder of the public event would take place as scheduled.",
        "Ben-Gvir is a former far-right activist and hard-line West Bank settler who has been convicted of incitement and support for a Jewish terror group. As the government´s representative at the Europe Day event, Ben-Gvir would have addressed attendees.\"It´s a shame that the EU, which pretends to represent democratic values and multiculturalism, behaves with undiplomatic gagging,\" Ben-Gvir said.",
        "Netanyahu returned to office in December at the head of a coalition that includes ultra-Orthodox parties and religious ultranationalists, including Ben-Gvir's small Jewish Power faction. The government has put expansion of West Bank settlements as a top priority. The EU, along with most of the international community, considers Jewish settlements in the West Bank and east Jerusalem illegal under international law and obstacles to peace with the Palestinians.Israel captured the West Bank, east Jerusalem and Gaza Strip in the 1967 Mideast war. The Palestinians seek all three areas for a future independent state."
    ]
}