{
    "articleURL": "/news/article-12045077/Jessie-White-Shakuhachi-founders-glamorous-life-Bali-fashion-empire-went-bust.html",
    "content": [
        "Shakuhachi founder lives a glamorous life in BaliMingles in an exclusive celebrity clique Left a trail of debts behind in Australia Do you know more? Tips@dailymail.com The founder of the collapsed Shakuhachi fashion empire is living it up in Bali, new photos show - years after she left Australia and a trail of debts behind.",
        "Despite owing hundreds of thousands to around 80 creditors when she left Australia, mother-of-two Jessie White is living a glamorous life in the trendy resort village of Seminyak on the south coast of the Indonesian island of Bali.In recent months Ms White has reactivated her Instagram account, sharing pictures of herself dressed in designer clothing at beach clubs and bars on the holiday island.The mum-of-two counts fellow Australian expats, hotelier Cisco Tschurtschenthaler, former Real House Of Melbourne Sally Bloomfield and Lindy Klim as close friends.",
        "Ms White is understood to have sought refuge in Indonesia after her once popular fashion label was placed under voluntary administration, after which Andrew Spring of forensic accounting firm Jirsch Sutherland was appointed liquidator.The former fashion darling - who grew up in Melbourne’s well-heeled south-eastern suburbs, before making the move to Sydney - is no stranger to celebrity fashion circles.White is also step-siblings with The Cat Empire keyboard player and backing vocalist Ollie McGill. With a thriving social life in Bali, White even managed to attend artist Vicki Lee's star studded wedding in Italy in 2019. ",
        "At the time of the company's collapse, Mr Spring's report to the company's creditors said the total amount owed was more than $860,000. Creditors included manufacturers, modeling agencies and Woollahra Municipal Council. ",
        "Mr Spring told Daily Mail Australia: 'Our investigations identified potential claims against Ms White and a related entity, Emporium Clothing Pty Ltd. 'Ms White relocated to Bali and the related entity was Liquidated. Due to commercial considerations these claims were unable to be fully prosecuted. 'We reported the findings of our investigations to the relevant authorities to consider any applicable action to be taken against Ms White.'",
        "Daily Mail Australia understands the corporate watchdog ASIC declined to take further action.Shakuhachi is still operating as its assets and brand were bought from administrators by Loft HK Limited in 2015.The brand currently operates a bricks and mortar store in Seminyak in which Ms White appears involved with.In 2017, A Current Affair reporter Chris Allen tracked down a care-free Jessie seen relaxing at beach clubs and socializing with friends.However, things quickly turned sour when she refused to answer questions about her business failings when confronted in a Bali cafe.The designer, who initially smiled for the cameras, gets up and leaves the table, reportedly hiding in the toilets up the back. She didn't say a word. Daily Mail Australia approached Ms White for comment.  ",
        "Shakuhachi clothing launched in 2007.The whimsical boho brand was the toast of Rosemount Australian Fashion Week in 2008.Adored by celebrities, Shakuhachi was worn by Kylie Jenner, Rita Ora and Rihanna.Shakuhachi Limited is placed under voluntary administration in May 2015. The brand received multiple consumer complaints, with nearly 200 inquiries related to a failure to supply products, the quality of goods and refunds not being provided.Founder Jessie White flees Australia for Bali and disables her Instagram account.Jessie White is confronted by A Current Affair reporter Chris Allen in a Bali cafe in 2017.The company, Emporium Clothing Pty Ltd, went into liquidation in 2021New photos surfaced of Ms White this week "
    ]
}