{
    "articleURL": "/sport/football/article-12050237/Graeme-Souness-reveals-ATHEIST.html",
    "content": [
        "Epidermolysis Bullosa (EB) is a painful and incurable life-limiting skin condition Graeme Souness couldn't believe the horrifying impacts the disease can cause He explained how learning about it made him stop believing there was a God Graeme Souness has opened up the 'most evil and cruellest of all diseases' that made him become an atheist.",
        "The Liverpool and Scotland legend revealed earlier this year how he couldn't believe what those suffering with Epidermolysis Bullosa (EB) have to go through after being told about it at a dinner five years ago.EB - also known as 'butterfly skin' - is a painful life-limiting skin condition that is incurable and causes painful blisters and tears from any trauma or friction to the skin.Souness, who is now vice-president of the charity DEBRA - which supports people living with the condition - has raised more than £500,000 since he first heard about it and insisted he gets emotional talking about the disease.The 69-year-old also explained how finding out about the horrors of the disease - which sufferers are born with - stopped him believing in God.",
        "'It's the most evil and cruellest of all diseases,' he told the podcast Up Front With Simon Jordan.'And it just robs these young people of any quality of life. It's life-limiting for these poor children and it's not just the sufferers but also the families that have to deal with it which is traumatic to say the least. 'And it's changed me as a human being. I am now an atheist because I cannot believe there is an almighty that would allow this to happen to one person.'",
        "Epidermolysis bullosa (EB) is a general term used to describe a group of rare inherited skin disorders that cause the skin to become very fragile.The skin is missing type VII collagen - a protein that usually binds the top layer of skin to the bottom layers. Any trauma or friction to the skin can cause painful blisters.In most cases, the symptoms of EB are obvious from birth.It is caused by faulty genes inherited from one or both parents.There are many cases when both parents are carriers of the faulty gene without realising it. ",
        "Souness also revealed how he had become particularly close to one sufferer Isla Grist.Earlier this year, he told the Daily Record: 'Isla is 14 now and she inspires me every time I am in her company.'She has courage and bravery on a completely different level to anything I have ever witnessed. She is in constant pain but always smiling.'Isla is such an impressive young woman. She is smart, funny and so courageous and strong that she makes you feel pretty average about yourself.'You take a look at her and think, \"I’m not such a strong character after all\".'And speaking to Jordan, he further explained the pain that sufferers like Isla have to deal with.",
        "He added: 'In the worst case. My little girl, she's not my little girl but I've become very close to her, Isla, and it's like someone has taken a torch to their skin.'It's continually raw in their mouths and inside her tracks as well and there's not a moment of the day when she's not in pain. 'Imagine your whole body being covered in a burning sensation. Shes red raw and they (sufferers) lose their skin. 'These kids have to take the strongest of drugs to get through their lives like Ketamine, Diamorphine and it's the most painful, cruellest, worst thing you could experience.'"
    ]
}