{
    "articleURL": "/wires/ap/article-12050863/Rebels-kill-5-Indian-soldiers-Indian-controlled-Kashmir.html",
    "content": [
        "SRINAGAR, India (AP) - Rebels fighting against Indian rule in disputed Kashmir triggered an explosive device during an encounter with the Indian army on Friday, killing five soldiers who were trying to flush them out of a forested area, the army said.",
        "The rebels were hiding in a cave in an area with steep cliffs in southern Rajouri sector near the highly militarized Line of Control that divides Kashmir between India and Pakistan, the army said in a statement. Two Indian soldiers died immediately after being hit by the explosion and three succumbed later in a hospital, it said. An army officer was also injured. The rebel losses in the clash were not immediately known.It was the second major attack by rebels in the past two weeks at a time when Indian authorities are increasing security as they prepare to host a meeting of officials from the Group of 20 leading industrialized and developing nations on promoting tourism in the region later this month.India accuses Pakistan of arming and training insurgents to fight its forces for control of Kashmir, a charge Islamabad denies.Pakistan Foreign Minister Bilal Bhutto Zardari is in India on Friday attending a meeting of the Shanghai Cooperation Organization, a group that includes Russia, China and several other Asian countries.The military statement said Friday's fighting erupted after soldiers tracked a group of militants involved in an ambush of an army vehicle on April 20 that killed five Indian soldiers in the Tota Gali area of southern Jammu region.",
        "Separately, four suspected militants were killed in two gunbattles with government forces on Wednesday and Thursday, police said.Rebel groups have been fighting since 1989 for Kashmir´s independence from India or its merger with neighboring Pakistan.Most Muslim Kashmiris support the rebel goal of uniting the territory, either under Pakistani rule or as an independent country.New Delhi insists the Kashmir militancy is Pakistan-sponsored terrorism. Most Kashmiris consider it a legitimate freedom struggle.Tens of thousands of civilians, rebels and government forces have been killed in the conflict."
    ]
}