{
    "articleURL": "/wires/pa/article-12056849/Liverpool-ceremony-welcomes-Eurovision-competitors.html",
    "content": [
        "This year’s Eurovision acts are being welcomed to Liverpool with an opening ceremony.",
        "The Turquoise Carpet ceremony opened on Sunday afternoon in the city, which is preparing to host the song contest final next Saturday on behalf of last year’s winners Ukraine.Hosted by Olympian Sam Quek and Ukrainian presenter Timur Miroshnychenko, the ceremony will see all 37 acts take to the carpet for a welcome to the city.Eurovision fans lined one side of the carpet, waving flags and scarves to support their countries.",
        "Norwegian act Alessandra was first to arrive on the carpet, where entrants had their photos taken and were interviewed.She said: “I feel so blessed. I feel so nice here. I’m the first one out and that’s an honour.”Conor O’Donohoe, from Irish band Wild Youth, said: “It’s all starting to feel very real. Everyone’s getting here now, all the press are here and family are starting to fly in, so it’s all starting to kind of really settle in.”",
        "The contestants wore their finest for the occasion, with Croatian group Let 3 taking to the carpet in bustled gowns accessorised with military-style peaked hats and facial hair.In scenes reminiscent of 1981 UK Eurovision entry Bucks Fizz, the group whipped off their gowns while having their photos taken to reveal white petticoats and vests.Latvian group Sudden Lights paid homage to Liverpool’s most famous music act the Beatles by recreating the outfits worn on the Abbey Road album cover.",
        "The ceremony will be followed by The National Lottery’s Big Eurovision Welcome outside St George’s Hall.Among the artists set to perform for a crowd of almost 30,000 is band Frankie Goes to Hollywood, who will reunite after their split in 1987.Other acts with a Liverpool connection on the line-up include girl group Atomic Kitten, funk band The Real Thing, and The Lightning Seeds – singers of the football anthem Three Lions.",
        "Former Eurovision winners Conchita Wurst, who represented Austria in 2014, and Ukraine’s Jamala, who competed in 2016, are also on the line-up for the gig, presented by AJ Odudu and Joel Dommett.Highlights of the concert will be shown on BBC One on Monday.Eurovision preparations are in full swing in Liverpool, which is hosting the contest instead of Ukraine because of the Russian invasion.The Eurovision Village, at the city’s Pier Head, opened on Friday with a performance from last year’s winners Kalush Orchestra and Scissor Sisters’ Jake Shears performed there on Saturday after a screening of the coronation.The first Eurovision semi-final will take place on Tuesday."
    ]
}