{
    "articleURL": "/wires/aap/article-12055085/Dockers-star-Nat-Fyfes-role-remain-mystery.html",
    "content": [
        "Fremantle coach Justin Longmuir is eager to have Nat Fyfe's week-to-week role shrouded in mystery in order to keep rival teams guessing for the remainder of the AFL season.",
        "Fyfe made a successful return from a plantar fasciitis injury on Saturday night, tallying 10 disposals, two clearances and a goal in the 69-point win over Hawthorn after coming on as the sub late in the third quarter.The two-time Brownlow medallist mixed his time between the midfield and forward line, and he did some extra running after the match to ensure he got enough work into his legs.Fyfe was initially slated to play as a full-time forward this year.But with Fremantle struggling in the clearance battle this year, especially the centre clearances, Longmuir has opened the door for Fyfe to return to his customary on-ball duties.Fyfe's role could change from week to week, and Longmuir has become increasingly testy when discussing what plans he has for the 31-year-old.\"I like to keep a few of those things under wraps, because it keeps the opposition guessing a little bit,\" Longmuir said.Fremantle take on Sydney at the SCG next Saturday, and Longmuir said Fyfe will be assessed on Monday before determining whether he will play the sub role again or be in the 22.\"We'll look at the best way to prepare him to see out the season,\" Longmuir said.\"Whether that's another game as the sub, or we play him and sub him out, or we play him and manage him through minutes - there's a lot of different options.\"",
        "Fremantle won the contested possessions battle by 20 against the Hawks, marking the first time this year they had come up trumps in that stat.But the most pleasing thing to come out of the match was the form of prized recruit Luke Jackson, who starred with 24 disposals, six marks, seven tackles, four clearances and two goals in a best-afield display.\"He had influence around the ball, whether he was in the ruck or midfield, and I thought he was one of our best pressure players and ground ball players across the ground,\" Longmuir said.\"He took more opportunities. Giving him a go on ball sometimes gets those types of players going around the ball, which allows him to take that confidence elsewhere.\"And sometimes it just takes time for players to feel comfortable in their role, finding their feet at a new club.\"I thought it was Jaeger (O'Meara's) best game for the club as well, and he's in a similar boat.\"Longmuir is optimistic the injuries to Lachie Schultz (shoulder), Sam Switkowski (heel) and Alex Pearce (ankle) weren't anything to worry about, with the trio expected to face Sydney."
    ]
}