{
    "articleURL": "/sport/football/article-12056097/Man-United-hold-David-Gea-summer-says-former-goalkeeping-coach-Eric-Steele.html",
    "content": [
        "David de Gea will make his 540th appearance for Man United on SundayThe Spaniard will overtake Alex Stepney's historic appearance recordFormer United goalkeeping coach Eric Steele believes De Gea is still in his primeDavid de Gea will get his hands on another Manchester United record at the London Stadium tonight when he makes his 540th appearance in goal for the club against West Ham.",
        "The Spaniard will overtake Alex Stepney whose record of 539 games as United goalkeeper has stood for 45 years.In February, De Gea beat Peter Schmeichel’s mark of 180 clean sheets for United when he shut out Newcastle in the Carabao Cup final at Wembley.De Gea’s personal achievements come at a time of uncertainty over his future at Old Trafford. The 32-year-old’s contract runs out at the end of next month, and he has yet to agree terms over a new deal that would see a reduction on his £375,000-a-week wages.It’s understood that United are hopeful of reaching a compromise before De Gea becomes a free agent, although the club have an option to extend his current contract by 12 months.",
        "A key consideration for United is how much it would cost to replace De Gea when other areas of the team need strengthening this summer.Eric Steele, the goalkeeping coach who recommended De Gea to Sir Alex Ferguson and chief executive David Gill before he moved to Old Trafford for £18.9million from Atletico Madrid in July 2011, is convinced the player can remain as United’s No.1 for a number of years yet.‘He’s still in his prime,’ Steele told Mail Sport. ‘He’s still young as a goalkeeper but look at the experience. He’s not going to be far off 550 games by the end of the season, and that’s at 32 years of age.",
        "‘I wouldn’t want him to be lost to Manchester United and the Premier League. Hopefully they will get this deal sorted and he stays part of the Ten Hag era.‘It’s down to David and the club. I think it’s about time it was sorted. We keep hearing it’s going to be resolved but we’re in May now. His contract runs out at the end of June. It would be nice to have an announcement to say which way it’s going.‘All I can say is that I would be very saddened to lose David after the 12 years he’s given.’De Gea has been voted United’s player of the year on four occasions – a record he shares with Cristiano Ronaldo – during his Old Trafford career, winning one Premier League, one Europa League, the FA Cup and two League Cups.United goalkeeping greats Peter Schmeichel and Edwin van der Sar were 39 and 41 respectively when they hung up their gloves, and Steele believes that De Gea can do the same.",
        "‘Why not? He looks after himself. Why can’t he do what Edwin and Peter did? He’s been a great servant to the club and contributed to some really great times.‘In terms of every record he seems to be breaking, he’s been phenomenal and no-one is more proud then me. When he beats Alex Stepney’s record that is something that will put him in the history books at Man United forever.’",
        "Steele’s recommendation led to Ferguson missing a League Cup tie against Scunthorpe in September 2010 to watch De Gea in Spain.The 20-year-old had a rocky start in the Premier League as he adapted to the physicality of English football, but Steele insists the club never wavered in their support of him.‘No, never a doubt,’ he said. ‘The great thing about Sir Alex was that he always invested in young players. But he had never signed a young goalkeeper.",
        "‘We knew we were buying potential and there was a lot more to come. We knew it would take time and Sir Alex gave him that time.‘The greatest thing about David is his character. He’s cool, he’s calm and composed. It just goes straight over his head. If you make a mistake, brush it aside and start again. You’ve got to have that strength of character to play for United.‘He’s had his ups and downs and come through it. He’s had to deal with a lot of managers since Sir Alex brought him in 2011 and many different coaches.‘I actually said to the gaffer and David Gill, “if you sign this guy you’re probably looking at somebody who could be with us for 10 years”. I might to have to re-assess what I said and make it 15 years.’"
    ]
}