{
    "articleURL": "/sciencetech/article-12045657/Scientists-reveal-lab-grown-fish-fillet-say-tastes-like-real-deal.html",
    "content": [
        "Grouper has been served by Steakholder Foods after growing cells in a labExperts say the fish 'melts in your mouth' and is ready to cook after printingIn future, scientists hope this can be used to produce a variety of fish dishes Scientists have dished up the world's first 3D-printed lab-grown fish, claiming it flakes and 'melts in your mouth' just like the real deal.",
        "Cells were grown in a lab to create the futuristic grouper fillets, without the need to put further pressure on dwindling fish populations. In a matter of months, Israel-based Steakholder Foods hopes to bring its food to the market, allowing others to try the 'world-class' fish for themselves.'We are delighted to have produced the world's first whole fillet cultivated fish in partnership with Steakholder Foods,' said Mihir Pershad, CEO of Umami Meats which supplied the fish cells.'In this first tasting, we showcased a cultivated product that flakes, tastes, and melts in your mouth exactly like excellent fish should. In the coming months, we intend to announce our plans for bringing this world-class cultivated fish to the market.'",
        "Umami Meats extracts cells - for now from grouper - and grows them into muscle and fat. Steakholder Foods then adds them to a 'bio-ink' suited for special 3D printers. The outcome: a narrow fillet that mimics the properties of sea-caught fish. ",
        "Scientists customised bio-inks - materials used in 3D printing to form artificial tissue - to produce their fish product. These inks are usually made up of cells but can also incorporate gel-like and plant-based materials.In this case, Singapore-based Umami Meats extracted cells from a grouper before growing them into muscles and fat.When put inside the 3D printer, this flesh gained mass as a glass dish swiped back and fourth. A flaky fish prototype was formed as a result of this, mimicking the texture of cooked fish.This fish can be cooked as soon as it's printed, unlike cultivated meats which still require incubation and maturation after printing. ",
        "In the future, Steakholder Foods hopes to use its printer to create various different species of fish while working with numerous industry players.Scientists have now established the process for eel and hope to add three more endangered species in the coming months.  ",
        "The team also hope to bring their first products to Singapore's market next year before moving on to countries such as the US and Japan.However, this is all dependent on food regulation rules.  Arik Kaufman, CEO of Steakholder Foods said: 'We're excited to be working with Umami Meats to develop 3D-printed structured fish products that have the same great taste and texture as traditionally caught fish, without harming the environment. 'With an estimated size of $110 billion and projected growth of 3-4 per cent annually in the near future, the seafood and fish market is a long-time part of our vision for introducing sustainable solutions that increase food security.'Alongside regulation, one of the major challenges for lab-grown fish is offering a competitive price against traditionally caught seafood. For now, Steakholder Foods has diluted its fish cells with plant-based ingredients to lower the cost of its product. When asked about the exact selling price of its fish, a spokesman did not confirm an exact figure but reiterated that cell-based products will be 'very expensive' at first.",
        "'As time goes by, the complexity and level of these products will be higher, and the prices linked to producing them will decrease,'  Mr Kaufman added. ",
        "Last year the WWF called for 'urgent' efforts to strengthen regulation of the seafood sector following concerns that it is killing off dozens of species.Kate Norgrove, Executive Director of Advocacy and Campaigns at WWF, said: 'The ocean is the blue heart of our planet and we ignore its health at our peril. 'Protecting this precious resource should be the top priority of every single fishery around the world, yet for too long unsustainable practices have gone unchecked, draining the ocean of life.' The grouper fish product also comes in the midst of numerous other initiatives advocating for lab-grown meat to be sold in supermarkets.In 2021, German firm Bluu Biosciences announced plans to put lab-grown fish balls, fish fingers and fish tartar on shop shelves.A year later, scientists from Caviar Biotec and University College London grew 'clean' caviar in a biochemical liquid, using cells from a fish's egg sac that were then replicated in the lab.Umami's Mr Pershad added that fish cells have been studied far less than cow stem cells in the field of lab-grown meat, also adding further challenges. 'We have to figure out what the cells like to eat, how they like to grow, and there's just not so much literature to start from,' he said.",
        "'The number of scientists, you can imagine, working on fish stem cell biology is a small fraction of those working on animal cells and human cells.'",
        "In news that will come as music to pigs' ears, British scientists have successfully grown a complete pork steak in the laboratory from just a few animal cells.The Newcastle-based researchers were not afraid to try their 1.2oz (33g) fillet, and claim it tastes, feels and smells just like real pork.When raw, the steak has the same consistency and elasticity as traditional meat, but becomes crispy and chars when pan fried.So far, only one steak has been created, although the team believes it won't be long before their creation is available to buy. "
    ]
}