{
    "articleURL": "/femail/article-12054453/Lip-reader-reveals-funny-exchange-Princess-Wales-Duchess-Edinburgh.html",
    "content": [
        "Lip reader Jacqui Press revealed what the royals said during the coronationREAD MORE: Louis' at it again! Royal fans delighted as Prince is VERY animated on coronation balcony and gives incredibly cute double hand wave All eyes were on the Royal Family today as they came out in force to support King Charles on the day of his coronation. ",
        "The monarch and his wife Queen Camilla were crowned at Westminster Abbey in front of some 2,000 guests in a lavish and historic ceremony.  Lip reader Jacqui Press has caught sweet interactions between the royals during today's pivotal moments, including what was said in the royal carriage as the King and Queen made their way to the Abbey ahead of the service. She also spotted a fun moment between the Duchess of Edinburgh and the Princess of Wales as the royals gathered to mark the day with a flypast on the balcony of Buckingham Palace. Here, FEMAIL reveals the other interactions you may have missed today.  ",
        "According to Press, the King and Queen shared a conversation about the weather when they travelled in the Jubilee State Coach on the way to Westminster Abbey.The King supposedly turned to Camilla and said: 'Oh look at that,' remarking about the rainy weather.He then pointed to the crowd and simply said: 'Wonderful,' followed by 'marvellous,' as he waved to the eager fans hoping to catch a glimpse of the monarch. Queen Camilla then said: 'oh look see that, see that… flags.' It is then unclear what Camilla was referring to, but she said: 'I can, yes it's super, amazing.'Press revealed how the King pointed his finger up by Trafalgar Square and said: 'It looks wonderful, see that.' Queen Camilla replied and said: 'So beautiful.'",
        "Inside the carriage when Charles was waiting, Press then claims that the King said: 'I’m worried about time, I mean it’s been longer this time and, well, erm, I mean look! I know.'",
        "It is not known what the King was referring to when he said 'look!' but Press noted the King said it with much enthusiasm. A while later when the pair were walking into Westminster Abbey, Press said that Camilla asked for help with her cloak.According to Press, she asked: 'Can you help?' to the man on the right, who was tugging at her cloak. She replied 'Thank you.'King Charles then askked: 'Wait here? Now?' to which the Bishop responded: 'Yes.' Meanwhile, Prince Louis, five, was sat in a car with his eight-year-old sister, Charlotte, while travelling to Westminster Abbey when the two exchanged a few words. The lip reading expert said the little royal told his sister: 'Yes,' before saying, 'Look waving.'According to the professional, the young prince also said, 'Yes of course'  while smiling, as he waved from the window of the car to onlookers. ",
        "Prince Louis always manages to steal the show at royal engagements, from sticking his tongue out at his mother or dramatically covering his ears on the Buckingham Palace balcony - and he didn't let his fans down today. ",
        "Louis was given a break from the event to relax behind the scenes. He was reunited with his family at 1pm to leave Westminster Abbey.The cheeky royal, known for his hilarious funny faces at royal events, also took part in the Coronation procession. The expert has claimed Louis said: 'Lots of people waving,' referring to the cheering crowds when travelling past. A short while after, Press says the sweet royal also said: 'Yaaay King.' The youngest Wales sibling looked on with excitement at the flypast of the Red Arrows as he stood next to his older sister Charlotte, eight. He was also spotted waving to the crowds in a funny routine and pulling funny faces. At one point, Jacqui reveals he said: 'What's those ‘copters?' His father William then told his youngest son: 'Wave.' ",
        "As the Prince and Princess of Wales arrived at Westminster Abbey this morning, they seem to have had a conversation about the gowns they were wearing outside Westminster Abbey. According to Press, Kate said to William: 'Are you ok? Look at the bottom of your...' and then she gestured towards his gown.To which William said: 'Yes it's caught.' Prince William then smiled at Kate as they walked in, before she said: 'Just mind your gown.' The Prince of Wales responded: 'Don’t worry I caught it.'",
        "They then smiled at each other and entered the Abbey, ready to participate in the first coronation in 70 years. ",
        "Kate and William then watched as Charles and Camilla were crowned King and Queen of our country.Meanwhile, Press revealed what she thinks Prince Harry said to Princess Eugenie's husband, Jack Brooksbank, during an exchange at Westminster Abbey.Press said the conversation appeared light-hearted as they waited for the historic occasion to begin, with Harry possibly discussing an event happening on Sunday.She claimed the Prince, who is alone at the service without the Duchess of Sussex or their two children Archie and Lilibet, smiled at Mr Brooksbank and said: 'That’s funny, mmm interesting'.To an unknown question from Mr Brooksbank, Prince Harry said: 'About quarter to 4?'Mr Brooksbank then replied: 'Oh really, when?' to which the Duke responded: 'I think tomorrow...'",
        "Earlier, Prince Harry, who chatted with both Prince Edward and Edoardo Mapelli Mozzi on his way in, addressed the well-wishers and congregation, saying: 'Morning, morning, how are you doing?'One person in the crowd told him, 'You look smart', Press said - referring to the moment the suited and booted prince walked into the Abbey for his father's Coronation. The Duke of Sussex was seated between Princess Eugenie's husband Jack Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for ten years. ",
        "They were joined by Prince Andrew's daughters Eugenie, 33, and Beatrice, 34, and her husband Edoardo Mapelli Mozzi.As the ceremony got underway, the Bishop said to the children holding King Charles's gown: 'Stop! Wait there,' before holding his hands up.During the service, William shared a wholesome exchange with his newly crowned father.",
        "The Prince of Wales bent down to give his father a kiss on the cheek, with a touched King Charles then simply said: 'Thank you William.' Many viewers around the world watched not only a heartwarming moment between and father and son, but a touching moment between the newly crowned King of the United Kingdom and our future monarch. Later on after the service, Charles said: 'thank you' to the faith leaders on his way out of the Abbey.As he reflected on the service, the King turned to the Bishop and said: 'It was wonderful.' The royal family left Westminster Abbey to head to Buckingham Palace, where King Charles and Queen Camilla appeared on the balcony.But it seems King Charles was concerned about going too close to the edge of the balcony, as it is thought he said: 'I don’t want to get too close... I might give myself a fright!'He then said: 'Be careful, come close,' to his wife, Camilla.",
        "The King and Queen remarked about how lovely it was to see everyone, with the Camilla saying: 'Oh look how wonderful this is. Remarkable.'Charles then asked: 'Is everyone here?' before the Prince and Princess of Wales walked onto the balcony with their three children. George, Charlotte and Louis.Queen Camilla then smiled and said: 'This is so lovely,' before looking up and holding her hand out.According to Press, Camilla added: 'Ohhh, rain,' before pausing and trying to tilt her head upwards, but she could not, as her head was weighed down by the crown. When on the balcony to watch the flypast, Kate said to William: 'It's raining,' and the royal responded with a disappointed sigh. Sophie, Duchess of Edinburgh also jokingly said to Kate 'Where’s George?' as they usher the children on to the platform.Kate laughed and then responded: 'Oh yes!' At this time, George is not in front of them, but stood beside William.  Prince William smiled and then said: 'Oh yes!' ",
        "When the Red Arrows flew past, William said to his children, according to Press: 'Look guys please.'A boy then said: 'It's loud!' to which Prince George then smiled and agreed: 'Yes!'When they walked off the balcony into Buckingham Palace, Press claims William said to Prince Louis, 'Yes, wave!'King Charles then waved at the crowd below and said: 'Thank you everybody, thank you very much.'He then exclaimed: 'Look at everyone here.' Upon the arrival of the Red Arrows, Camilla said: 'Oh look here they come.' When the helicopters fly past, King Charles said: 'It feels wonderfully wobbly and almost makes it shake around,' although it is not clear what the King is referring to.When they bid the public farewell, Charles said: 'Thank you everyone thank you for coming,' while waving.Queen Camilla said: 'Bye! So lovely,' before going inside. "
    ]
}