{
    "articleURL": "/wires/aap/article-12038603/Scientists-call-NT-fracking-ban-basin-looms.html",
    "content": [
        "Onshore fracking in the Northern Territory's Beetaloo Basin could be underway as early as 2024 after the government lifted a five-year moratorium.",
        "Chief Minister Natasha Fyles says the way has been cleared with all 135 recommendations from the 2018 Pepper inquiry implemented.\"We have strengthened government agencies, we have strengthened legislation to rigorously assess environmental management plans,\" she told reporters on Wednesday.A new petroleum operations unit will monitor compliance, with an annual investment of $2 million.About 500km southeast of Darwin, the Beetaloo Basin contains an estimated 500 trillion cubic feet of gas, making it one of Australia's most energy resource-rich areas.The region has been subjected to extensive environmental scrutiny for the past five years, following concerns the NT didn't have robust legislation or environmental data that could safely regulate the gas industry.One of the recommendations of the Pepper inquiry was all greenhouse gas emissions, known as scope one, two and three emissions, must be offset whether from production or consumption.Ms Fyles said her government had no jurisdiction to offset greenhouse gas produced via consumption in other states or by offshore sales.Instead it will require companies applying for production licences to submit plans on reaching net zero emissions by 2050, fulfilling an earlier government promise.Mining Minister Nicole Manison acknowledged that with regards to scope two and three emissions, there was work to be done with the Commonwealth.",
        "\"The government will support projects that meet the necessary environmental and regulatory approvals - noting there are currently no projects in front of us,\" a spokesman for federal Climate Change and Energy Minister Chris Bowen said.\"We have a strong plan to reduce emissions by 43 per cent and we will deliver that.\"The federal government's safeguard mechanism reforms includes all industrial facilities with more than 100,000 tonnes of direct emissions.It includes requirements for any shale gas facility in the Beetaloo Basin to offset direct emissions with Australian carbon credit units or safeguard mechanism credits.Ms Manison said following five years of legislative reform, including new chain of responsibility legislation and a promise to have net zero emissions by 2050, the NT had the most highly regulated petroleum industry in Australia.Onshore fracking in the region hinges on the $15 million Strategic Regional Environmental and Baseline Assessment report released in April.It is deemed to be one of the most extensive environmental baseline assessments done in the industry but also flagged significant concerns about consent from First Nations' Traditional Owners.Ms Fyles maintained Traditional Owners would be able to veto any project.Nurrdalinji Native Title Aboriginal Corporation represents members with native title interests across the Beetaloo Basin.\"The chief minister is incorrect to claim Traditional Owners have the power to veto production on our country,\" jungai (law man) Johnny Wilson said.",
        "\"Justice Pepper made it clear in her report this is not true, there is no veto right at production stage under native title or land rights laws.\"He said prior consent many years ago was rescinded now that Traditional Owners understood \"the many thousands of wells we are looking at now\".The Environmental Defenders Office said the government's decision to go ahead with fracking was a violation of public trust.\"We will do everything we can to ensure the plans of every company applying for a gas production licence is thoroughly scrutinised,\" EDO chief executive David Morris said."
    ]
}