{
    "articleURL": "/news/article-12043171/Man-sparked-Buckingham-Palace-security-scare-snapped-eviction-notice-neighbours-say.html",
    "content": [
        "David Huber was reportedly stressed after being told to leave his dog businessHe is believed to have travelled from Cumbria to target Buckingham Palace The dog breeder who sparked a Buckingham Palace security scare may snapped and travelled to London because he was being kicked out of the kennels, neighbours say.",
        "David Huber - who described himself as an 'avid hunter' - was anxious and stressed after being told by his boss that he that he had to leave the dog business he ran in Cumbria, it is claimed.Mr Huber, 60, is understood to be the man arrested by armed police after allegedly approaching the gates and throwing items including suspected shotgun cartridges close to the Palace.He is believed to have travelled to London from his remote Cumbrian cottage, where he breeds Hungarian Vizslas, for Charles's coronation on Saturday.Today a farmer neighbour suggested that Huber had recently been told he could be evicted from his business premises.And another neighbour said of Huber: 'Daft lad, going down to London.'",
        "Farmer Roy Ashley, 72, said Huber had recently been told to leave Banks Gate Farm which he rents from a landlord.Mr Ashley, who keeps his horses on fields belonging to Banks Gate Farm, said:'The owner had given him notice to quit the kennels. Maybe that has set him off.'He had a woman with him for a while when he first moved in about two and a half years ago, but not now,' said Mr Ashley.'There was nowt wrong with him. And he was always alright with me. 'He had fanciful big plans for the kennels, building new buildings and such like.",
        "'He would have the odd girl working for him, looking after the dogs. 'But he didn't like anybody else near his dogs. If I was going down to get my horses I would have to ring him and he would open the gate, but I wasn't to go near the dogs.'Sheep farmer Frank Milburn, 51, said Huber moved into Banks Gate Farm, near Kirkby Stephen, Cumbria, about three years ago.Mr Milburn said: 'He has about 50 or 60 acres, but doesn't farm the land. He just breeds dogs, he gets most of his income from selling the dogs. It is a very successful business I believe.",
        "'He lives there alone, but he does have staff working for him, looking after the dogs and so on. I'm not sure whether one or two might board there. 'He has a huge amount of dogs. They'll need looking after,' said Mr Milburn. 'Daft lad, going down to London.'Mr Milburn went on: 'We are very remote around here and we don't see much of each other.'I don't know why he's gone down to London and done what he had done. There has been no suggestion he was planning anything from what I've seen of his recent activities.'Mr Milburn said Banks Gate Farm was a stables for horses before Huber bought it, and it was a working farm prior to that.",
        "Another farmer John Lord, 64, said:'We had the police here this morning. They had got lost looking for David's farm, because it is hard to find.'He lives alone, and just has his dogs.",
        "'I cannot believe what he's done.'I thought he was a quiet fella. I know him to say hello to, but no more really.'The farm has a heavy wooden gate, with an intercom, and the entrance is covered by CCTV.But the frequent barking of dogs from inside the modern indoor kennels on his could be heard."
    ]
}