{
    "articleURL": "/news/article-12059241/Four-masked-thugs-hunted-police-boy-17-stabbed-death-near-car-park.html",
    "content": [
        "The stabbing occurred near the main car parks of Easton Street, High WycombeA second 17-year-old boy was also injured, but his wounds aren't life-threateningFour masked thugs suspected of stabbing a teenage boy to death in a 'targeted attack' are at the centre of a police hunt. ",
        "The victim, 17, is believed to have been stabbed in a narrow alleyway in Kings Court near the main car parks of Easton Street in High Wycombe between 7pm and 7.30pm on Sunday.A second 17-year-old boy was also injured and taken to hospital but his wounds were not believed to be life-threatening.Detectives from the Thames Valley Police Major Crime Team are now hunting four suspects who all had their faces covered and were seen running away from the scene. The murdered teenager has not yet been formally identified and no one has been arrested in connection with the death.",
        "Police and paramedics were called to Easton Street shortly before 7.30pm on Sunday evening but they were unable to save the knifed victim as he was declared dead at the scene.A spokesman for Thames Valley Police said: 'We have launched a murder investigation after a 17-year-old boy was killed in High Wycombe.'No arrests have yet been made and there are currently believed to be up to four offenders. Descriptions are limited but all were wearing face coverings.'Senior investigating officer, Detective Superintendent Kevin Brown, said the stabbing 'appears to be a targeted attack'.'We are in the very early stages of this investigation and details as to what has happened are currently very limited.",
        "'The incident occurred between around 7pm and 7.30 pm close to the main car parks of Easton Street at a time when members of the public would have been using the car parks, attending the theatre or preparing for a night out in the town.'It is therefore very important that anyone who was close to Easton Street at this time and saw something unusual or out of the ordinary or indeed knows anything about this incident gets in touch as soon as possible.'Anyone who has any information or footage from dash-cams, doorbells or CCTV close to Easton Street is urged to make contact. ",
        "'This is a tragic incident in which a teenage boy has been killed and I know that it will cause a great deal of concern in the community.'However, I would like to reassure everyone that we are carrying out a thorough investigation into what appears to be a targeted attack.' On Monday, Wycombe MP Steve Baker, who is also a Northern Ireland Office minister, said: 'This is a tragic incident and it's vital we leave space for the police to conduct their inquiries and, for that reason, I don't want to say much about this continuing inquiry.'But my heart goes out to the young man's family and friends who I do not doubt will feel devastated.",
        "'For the people of Wycombe, they should know that the police are closely investigating this and they have my complete confidence as they follow things up.'Detective Superintendent Brown urged anyone with concerns or questions surrounding the large police presence in the area to approach our officers.He also said anyone with information should call the police on 101. Alternatively, you can make a report online or contact the independent charity Crimestoppers on 0800 555 111.This comes after three people were stabbed to death in separate incidents in east London over a period of less than eight hours on the eve of the coronation. A 16-year-old was ambushed as he left school and stabbed to death, while murder investigations were also started after the killings of an 18-year-old and a man in his late 20s, the Metropolitan Police said.In another incident, an 18-year-old man who has been named by police as Ben Moncrieff was killed in Bath, in Somerset, on Saturday. Officers were called to the Southgate Street area of the city at around 3.30am on Saturday where the victim was found critically injured and died at the scene.  Avon and Somerset Police said three people were arrested the same day, with two released without charge, while a 15-year-old suspect remained in custody after police were granted more time to question him over the incident. "
    ]
}