{
    "articleURL": "/tvshowbiz/article-12042247/Ferne-McCanns-shows-glow-Danielle-Armstrong.html",
    "content": [
        "Ferne McCann took her followers on a trip down memory lane on Wednesday as she shared a series of throwback snaps with Danielle Armstrong. ",
        "Penning a sweet 35th birthday tribute to her best friend, the 32-year-old reality star joked that she'd be taking their fans on a 'glow up journey' with pictures from their time in TOWIE and recent snaps. The first picture shared was from 2016 and saw Ferne pen: 'Throwback... happy birthday to my darling friend and there's plenty more throwbacks to come post-school run.' A second snap taken the same year showed the pair supporting co-star Jessica Wright's shoe launch, with Ferne revealing she'd stepped straight off the plane from Marbella to attend the London event. She wrote: 'To my celebrate my girl's 35th birthday I thought I'd take you on a little glow up journey.'",
        "Ferne added: 'I think here we had literally just stepped off a plane from Marbs &amp; headed straight to an event... (I'm still holding my beach bag). The days where we could stay out later than 9pm.'Up next came a shot from their time on TOWIE, which the pals joined in 2013. She mused: 'Two opinionated Essex girls who were so similar that they had to become the best of friends.'Ferne then opted for a recent snap of the pair on holiday as she wrote: 'And now the glow up.'  A final snap of the pair was taken last year and captioned: 'I am eternally grateful to you. For our friendship, introducing me to our nutrition business and the laughter and love we have. ",
        "'Both pregnant here believe it or not with our seconds. Here's to the next chapter...'Ferne and Danielle have been friends for years, with Ferne acting as bridesmaid at her pal's wedding, while Danielle has made regular appearances on Ferne's First Time Mum series. The pair are also business partners, promoting weight loss products together on social media.  ",
        "Ferne's sweet post for Danielle comes after the pals enjoyed a workout together on Monday. She shared snaps of her bump while the pair worked up a sweat but she was quick to remind her fans that while she has had a lovely week, things are never as perfect as they might look on social media.And she said that at points, life has felt 'fractious' due to a series of mishaps including her daughter Sunday falling out of a tree.She was also left in tears at the school gates.Ferne wrote: 'The best of the week. And I say the best because in between the loveliness of having friends over for a dinner party, having a wonderful hypno birthing session, Sunday returning back to school in her gorgeous summer uniform &amp; snuggles with my puppy LIFE has happened!'Remember Instagram is just people’s highlights. We share what we want people to see.'She continued: 'I’ve had moments this week where life has felt fractious and all over the place (defo putting it down to the mercury retrograde).",
        "'Sunday fell out of a tree (she’s fine btw) , I stupidly ran out of petrol &amp; my sister had to come and rescue me.'I got my foot stuck under the front door and kicked off the metal thing which prevented us from closing it and Lorri had to call out an emergency locksmith who literally just slid this metal thing back on.'I forgot Sunday had forest school and had a little cry at the school gates. The ebs and flows of life.'",
        "Concluding, she wrote: 'I think we can quickly get sucked into someone’s weekly ‘dump’ on Instagram and think f*ck me their lives are perfect. The perfect husband, kids, house, life, jobs, face.'They look like they have their s**t together and are thriving! It leaves you feeling depleated, [sic] worthless and like your not going anywhere in life. We all feel this right ?'But I don’t believe that anyone fully has everything together. I believe that life comes with the ups and downs and the highs and the lows. 'Remember you are only seeing peoples HIGHLIGHTS.'"
    ]
}