{
    "articleURL": "/wires/reuters/article-12040599/Swiss-OC-Oerlikons-orders-fall-postponements-polymer-unit.html",
    "content": [
        "By Paolo Laudani and Johannes Toft Thyssen",
        "May 3 (Reuters) - Swiss industrial group OC Oerlikon said on Wednesday its orders fell nearly 14% in the first quarter, as weak filament demand in China led to postponements at its polymer business.Oerlikon shares were up more than 2% in early trading, however as despite the drop in order intake, the company still managed to beat market forecasts on sales and operating income.Its first quarter revenue rose 5.4% to 735 million francs, driven by a 12.5% increase in its surface solutions division, while its operational core earnings (EBITDA) fell 3.8% to 116 million Swiss francs ($131 million).Analysts had forecast revenue of 694 million Swiss francs and an operational EBITDA of 111 million Swiss francs, according to a company provided poll.\"Sales comfortably beat market expectations and EBITDA too, but to a lesser extent,\" Baader Helvea analyst Michael Roost said in a note.The margin development was \"a touch underwhelming\" and polymer processing orders well below expectations, Roost added.Oerlikon said in February it planned to cut 800 jobs from the polymer processing division after the unit's earnings dropped by more than a fourth in the final quarter of 2022.Finance chief Philipp Mueller told reporters the layoffs would start in September, but whether they would reach 800 depended on order intake. Mueller added he was confident the situation in China would improve soon.",
        "The polymer processing business, which supplies the textile, automotive and chemicals industries, saw a 28% drop in first-quarter orders to 298 million Swiss francs.This took Oerlikon's total order intake to 681 million francs in the quarter, down from 790 million last year. ($1 = 0.8883 Swiss francs) (Reporting by Paolo Laudani and Johannes Toft Thyssen in Gdansk; Editing by Milla Nissi and Alexander Smith)"
    ]
}