{
    "articleURL": "/wires/pa/article-12043715/Donald-Trump-says-Ireland-good-job-luring-US-companies.html",
    "content": [
        "Former US president Donald Trump has said Ireland has done a good job “luring” US companies to the country.",
        "He was speaking to reporters after his arrival at his golf course outside the town of Doonbeg in Co Clare.He was greeted by a line of staff at the hotel and a display of Irish music and dance.Speaking to reporters, he said the staff had “done a great job” and the course had “become a big success”.",
        "Asked by reporters if he would prefer to see the corporation tax being paid by US companies in Ireland, instead being paid in the US, he said: “I won’t answer that question in your country, a lot of people would say yes.“But Ireland has done a good job, you’ve lured a lot of companies in.“They love it here, they really love it here.“They’ve been treated well just like I’ve been treated well.“This has been a great success.”Mr Trump downplayed the significance of difficulties the Doonbeg development has encountered with planning authorities in Ireland.“What we’ve wanted to do I think they’ve pretty much let us to do, the important things,” he said.He also said the impasse over post-Brexit trading arrangements in Northern Ireland was a “tough one”.Asked for his view on the issue, he said: “Well we’re going to see, they’re negotiating and we’re going to see, there are a lot of negotiations going on in Ireland and other other places right now, but it’s going be a tough one,” he said.",
        "“It’s not an easy one. We have to work it out.”Among those applauding Mr Trump’s arrival, was supporter Tadhg O’Shaughnessy.Wearing a MAGA hat and carrying a fan-made portrait of the former president riding a horse, Mr O’Shaughnessy said being a Trump supporter was like “being a fan of Elvis”.“He’s a truly good person and people keep putting him down.“He’s a business person, not a politician. He has in his heart the love for his country and he wants the very best of it.”Mr Trump landed at Shannon Airport in the west of Ireland after flying on a Boeing 757 with Trump livery.Garda members from the Armed Support Unit were on standby ahead of his arrival, while what appeared to be members of the Secret Service were seen arriving in black cars near the entrance to the airport’s apron.Mr Trump, accompanied by his son Eric, had been in Scotland since Monday, breaking ground on a new golf course at his Menie Estate near Aberdeen before playing a round at his Turnberry resort in South Ayrshire.",
        "He continued his visit by inspecting his resort at Trump International Golf Links and Hotel just outside the town of Doonbeg in Co Clare.Mr Trump last visited the 400-acre resort, which he bought in 2014, while president in 2019.",
        "A heightened garda presence was visible around the resort and neighbouring towns and villages, including armed patrol units.The trip is Mr Trump’s first abroad since he became the first former US president to face criminal charges.No travel conditions were placed on him after he pleaded not guilty to 34 counts of falsifying business records in New York in April.The visit coincides with the second week of a civil trial in Manhattan over accusations, denied by Mr Trump, he raped former magazine columnist E Jean Carroll in a department store dressing room in 1996.Mr Trump will stay overnight at the hotel and said he expects to play golf at the course on Thursday.He is expected to return to the US later that day.Representatives from the business community in Doonbeg were also present to greet the former president.They have broadly welcomed what they see as a positive economic boost to the town, generated by the Trump organisation’s golf course.Other supporters have travelled to the village in the hopes of meeting Mr Trump.Among them, the self-proclaimed biggest Irish supporter of the former president.David Grange, from Raheny in Dublin, said he would like to shake Mr Trump’s hand but expected it would not be possible with the increased security.",
        "“I love the guy,” he said.Carrying a US flag and a Trump Make America Great Again election flag, he said he drove down to west Clare especially for the former president.Asked why he supported Mr Trump, he said: “All his policies, promises made, promises kept.“The witch hunt against him, the attack against him.“Everything he’s done has ticked all the boxes, everywhere he goes there’s a mass following.“I think the media give him an unfair deal.”He described legal proceedings against Mr Trump as a “witch hunt”."
    ]
}