{
    "articleURL": "/femail/article-12053559/Princess-Eugenie-shows-baby-bump-joins-Princess-Beatrice-Coronation.html",
    "content": [
        "Princess Eugenie, 32, showed off her baby as she joined her elder sister Princess Beatrice for Coronation CORONATION LIVEBLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Princess Beatrice wore ornate £37,000 earrings to her uncle's Coronation at Westminster Abbey in London today as she made a glamorous entrance with her sister.",
        "The royal, 34, lit up the room in a hot pink gown from Beulah, worth £695. The belted ensemble accentuated King Charles III's niece's figure for an elegant and stylish display. Garrard's pricey Blaze Pink Sapphire, Rubellite and Pink Opal Hoop Earrings made the perfect complement to her look, as did the subtly peachy smokey eye of her make-up.Beatrice wore her auburn tresses down in elegant waves and toned the magenta tones down with a chunky bronze headband and beige-hued clutch.Meanwhile Princess Eugenie showed off her baby bump in an all-navy ensemble as she joined her family in London for the historic festivities.",
        "The mother-of-one, 32, who is expecting her second baby in the next few months, looked elegant in a deep blue smock dress - topped with a matching overcoat and headpiece.And her accessories were no less opulent than her sister's. The daughter of Prince Andrew and Sarah Ferguson sported the Albemarle White Gold and Diamond Collar Necklace - which costs £130,000 and White Gold and Diamond Drop Earrings - worth £26,000 from Garrard.She wore a FENDI by Kim Jones custom-made navy silk and satin mid-length dress, finished with a plisse side-panel.The ensemble was topped off with a cashmere FENDI coat featuring a matching obi belt and wore heels from the designer, as well as FENDI Swarovski embroidered navy silk and satin gloves.",
        "The younger of the sisters was also snapped holding onto a FENDI ISeeU Peekaboo bag with 3D leather roses as she sat in a car with her father for the arrival. The duo walked in with their husbands, father Prince Andrew, and their cousin Prince Harry - who is attending his father's coronation while his wife Meghan Markle is staying back in California.The Duke of York's children were among the Family members who kicked off the celebrations for the weekend last night, as Eugenie and Zara Tindall enjoyed a rare night out together.The royal revellers sported glamorous velvet ensembles for the occasion exclusive Mayfair private members' club Oswald's.",
        "Zara, 41, who arrived at alongside her husband Mike Tindall, 44, opted for a striking navy blazer and trouser combo, paired with a light blue shirt. Meanwhile her cousin Eugenie - who is expecting her second child with husband Jack Brooksbank, who was also in attendance at the family occasion - seemingly took inspiration from Zara and donned an Asceno Velvet Athens Robe, costing £575. ",
        "Beatrice looked glam in a Louis Vuitton's £2,900 chain print asymmetrical long-sleeved frock, which she teamed with a chic blazer for a perfect Spring night look.Other royals, including the Duke and Duchess of Edinburgh, Prince Andrew and Princess Anne, were pictured celebrating the eve away ahead of today's big festivities.",
        "And this morning King Charles III's day of destiny has arrived as the world prepares to watch the historic first coronation of a UK monarch in 70 years at Westminster Abbey where Britain and the Commonwealth will hail its new monarch today.The royal had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the Abbey from 6am to get one of the prime 2,300 seats inside.On the the streets of London today - including on a packed Mall - there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations. Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning.",
        "She chose not to attend any of the other public engagements by his side, preferring to 'pace herself' and also ensure 'the day was about her husband', sources said.'She loves him unconditionally and always wants him to shine,' a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.'The calm before the storm – perhaps metaphorically as well as literally', a friend said with a nod to the dismal weather forecast, something the new King and Queen's celebrations have in common with the late Queen's Coronation in 1953.The Coronation bank holiday weekend will conclude on Monday with The Big Help Out, when members of the Royal Family will join volunteers working with local community organisations as part of an initiative to create a lasting legacy from the celebrations. Charles and Camilla, however, will leave for their Sandringham estate in Norfolk for a well-earned break.The Duke of Norfolk, who is organising the ceremony, said: 'The Coronation is an opportunity to bring our great nation, the realms and the Commonwealth closer together, plugging into the power of the past and promoting our shared values to the wider world with all that we have to offer.'Mr Sunak said the weekend would be a chance to reflect on the 'enduring nature of monarchy' and urged the nation to celebrate its history and culture.",
        "The Prime Minister added: 'Let's celebrate this weekend with pride in who we are and what we stand for. Let's look to the future with hope and optimism. And let's make new memories, so we can tell our grandchildren of the day we came together to sing God Save The King.'"
    ]
}