{
    "articleURL": "/sport/football/article-12056901/Manchester-City-submitted-NO-formal-offer-Jude-Bellingham.html",
    "content": [
        "England international Jude Bellingham is seemingly bound for Real Madrid Manchester City have not submitted an offer for Bellingham it has been reportedThe midfielder has been the subject of extensive interest from across Europe Manchester City have not submitted a formal offer for Jude Bellingham, it has been reported.",
        "Bellingham, 19, is seemingly bound for Real Madrid after it emerged this week that the Spanish club were on the verge of agreeing personal terms with the Borussia Dortmund midfielder and were setting aside significant funds to finance his move this summer.His future has long been the subject of extensive speculation, with the Birmingham City academy graduate widely considered to be among the best young prospects in the game.However, according to The Athletic, it appears City are resigned to the fact Bellingham is bound for Madrid, with no offer having been submitted to either club or player.It has been reported that the Premier League leaders have not submitted an offer for Bellingham.",
        "Bellingham is believed to be valued at northwards of £100m by Dortmund, a fee Real Madrid are expected to meet this summer with the midfielder their main summer target.The reports surrounding Bellingham's future adds another subplot to the already intriguing forthcoming Champions League semi-final tie between City and Real Madrid.It is said that figures at the English club believe the extensive speculation that has emerged this week stems from the Madrid-centric press being mischievous.Speculation linking with Raheem Sterling with a move to the Spanish capital in 2020, ahead of the sides' meeting in the quarter finals of the Champions League that year, suggests there is precedent for such reports.",
        "Should City formally pull out of any race to sign Bellingham, they will join Liverpool in having been interested but deciding an agreement was not forthcoming.Liverpool had looked for a long time the frontrunners to sign Bellingham but pulled out of the hunt in March.It is believed the reported £130m price tag that has been put on his back by Borussia Dortmund, in addition to their need to sign a number of players as they embark on a significant rebuild, were among the reasons for such a decision.As reported by Mail Sport, Real Madrid's mission to land him has taken place over many months. Identifying him as the crown prince to Luka Modric's midfield throne, the 14-time European champion's chief scout Juni Calafat met with Bellingham's father, Mark, earlier this year and communication has continued between the respective parties.The German club, meanwhile, are resigned to the fate of losing Bellingham. Having won the race to sign the then-17-year-old in 2020, they have nurtured him into becoming one of European football's premier midfielders.Speaking regarding Bellingham's future this week, manager Edin Terzic remained coy, insisting he had not heard from the player regarding his supposed summer transfer. 'I haven't even heard from him that he's involved with another club,' he told reporters all understandably queuing up to question him regarding the England international.",
        "However, in March he offered more detail on his future, claiming Borussia Dortmund was the 'perfect step' for him to develop.'Before he chose to join us, he had opportunities to join the Premier League. There was loads of interest from top-flight clubs,' he said.'But he chose to join us because he knows it can be the perfect step for him. I think we’ve proven it both ways. He’s helping us a lot. But we as a club are helping him and his career as well.'We are really happy that he’s part of our team, he’s one of our leaders at 19. He stepped into the England team as one of our players. It’ll be a topic for his future.'"
    ]
}