{
    "articleURL": "/news/article-12055907/Keith-Self-slams-gun-critics-say-payers-arent-God-absolutely-control.html",
    "content": [
        "Rep. Keith Self, a Texas Republican expressed his belief in the power of prayer, stating that those who doubt its effectiveness do not believe in an almighty godDuring an interview with CNN, Rep. Self, who identifies as a Christian emphasized the need for prayer in the aftermath of the tragedyWhen asked about people who question the efficacy of prayers, he attributed their skepticism to a lack of belief in a higher powerA Republican Congressman from Texas questioned the faith of critics who say prayer is not enough after the latest mass shooting in his state took eight lives, including children. ",
        "Rep. Keith Self suggested that God has complete control over our lives, and people who don't believe in the power of prayer following a mass shooting aren't true believers.Self's comments came hours after a gunman opened fire at a crowded outdoor mall Saturday, killing at least eight people including children as young as five.The shooter was killed by a hero police officer at the Allen Premium Outlets in Allen, a small suburb north of Dallas.The shooting led to the usual call for 'thoughts and prayers' for those affected but during an interview on CNN it was put to Rep. Self, who represents Texas' 3rd Congressional District that includes Allen, that such sentiments are no longer enough.'You know congressman, that is a common refrain after mass shootings, but many people argue that prayers are not cutting it. Prayers are not preventing the next mass shooting. What is your response to that criticism?' the anchor on CNN asked. But the Congressman appeared to have a prepared response.",
        " 'Those are people that don't believe in an almighty god who is absolutely in control of our lives.''I'm a Christian. I believe that he is,' Self said assuredly. 'We have people with mental health that we are not taking care of.'Self suggested that prayers did indeed have their place following violence and continued to offer up his own.",
        "'Today we should be focused on the families. Prayers are important. Prayer is powerful in lives of those people who are devastated right now,' he said.Self said that he did not want to turn the tragedy into a political point but noted how there was violence in  'big [Democrat] cities' after being asked if he was concerned about the rise of violent incidents across the US.   Congressman Self gave the example of the city of Chicago that saw crime spike in 2022, while Allen, Texas, where the shooting occurred was by his definition a 'very safe area.''Any time there is violence, whether it be in one of the big cities — riots or trashing of stores in Chicago — or shootings like this. This is a very safe area. This is not usual. I know that we hear about the numbers of deaths in Chicago. This is not usual in this area. So I'm certainly concerned about this,' Self said.According to Census data, Allen, 25 miles north of Dallas, has a population of 106,874 and had one reported homicide in 2020. ",
        "Dashcam footage shows the moment the gunman, dressed in full SWAT garb, pulls up to the outdoor outlet before opening fire on unsuspecting civilians, using an AR-15 to mow down a crowd that included children.",
        "Cops for the most part had kept quiet as to the exact extent of the tragedy prior to specifying the number casualties - releasing sparse statements confirming several were killed, without specifying how many and whether a shooter was still at large.However, disturbing footage captured at the scene - as well as multiple witness accounts - laid bare some of what had transpired, showing at least four bloodied bodies lying outside the H&amp;M where the gunman was seen beginning his assault.",
        "'One of our officers was on an unrelated call at the outlet mall,' said Brian E. Harvey, the chief of police in the suburb roughly 20 miles from Downtown Dallas. 'He heard gunshots, went to the gunshots, engaged the suspect, and neutralized the suspect.' Another distressing clip, filmed a few stores away, showed the deceased gunman shortly after he was gunned down himself by the unnamed Allen officer who instantly ran toward the sound of then ongoing gunfire.At first, reports from local police sources indicated that there may have been two gunmen - the one killed and another at-large - though cops during the late night presser revealed they are confident he acted alone.'We believe at this point that the shooter acted alone,' Harvey said late Saturday. Harvey, however, did not provide a name for the deceased gunman - whose motive for carrying out the killings remains unknown.",
        "Other footage and snaps taken at the scene, meanwhile, help piece together what exactly transpired at the outdoor mall, with some showing at least four people, including children, slumped dead after the gunman's rampage.One video shows the moment the first shots rang out, in which the still unidentified gunman is seen pulling up in a car to the store where the dead bodies were later spotted.In the short clip, the gunman is seen arming himself with what appears to be an AR-15 before firing indiscriminately at a small crowd of shoppers.In a statement four and half hours after cops were first called to the mall, the Allen Police Department revealed that one of its officers subdued the shooter while responding to an unrelated call, when they heard gunshots just after 3:30 pm.That officer, a rep for the department said, 'engaged the suspect and neutralized the threat.'Police Chief Brian Harvey did not identify the officer who took down the shooter Saturday, but confirmed there were several fatalities. Prior to the 8pm update, police said they still considered the scene 'active,' with local law enforcement sources telling CNN that one of the suspects was still at large.Cops, however, were quick to dismiss that theory in their 8pm presser, indicating the shooter acted alone and was no longer a threat. ",
        "Hours before, police and ATF agents were seen sweeping stores for several hours during the site's mass evacuation, more than two hours after police first descended on the complex after receiving reports of gunfire. In terms of the number of victims, cops also kept mum - though a spokesperson for Medical City Healthcare a few miles away said eight victims are being treated at their facilities.Some of the victims, as much of the disturbing video being seen online had suggested, were children, with the rep telling Fox 4 they ranged in age from 5 to 61.Aerial video shows citizens being escorted off the premises, many with their hands on their heads looking visibly distraught - while more shocking clips laid bare the incident's fatalities, including the dead gunman.Footage captured by a Fox helicopter showed at least four dead bodies outside the H&amp;M store seen in newly surfaced video of the first gunman, which showed him opening fire on several unsuspecting victims after pulling up to the shop in a grey Dodge Charger.Distressing video footage of the same site hours later showed bloodied corpses surrounded by items including backpacks suggesting some of those slain were children.In another disturbing snippet, the deceased gunman is seen lying dead outside another Allen store only a few dozen feet from the H&amp;M. He is seen dressed in tactile gear with a semi-automatic rifle at his side.",
        "Other accounts posted to social media from 5pm to 8pm offered a glimpse of the events that led to the shooter's death - and the mass evacuation of the entire shopping center rocked by the sudden storm of gunfire.One such account, posted a little after the first of dozens of shots reportedly rang out, provided an idea of the horror shoppers faced, and came from a mom whose car was pierced by two bullets as she fled the scene with her young daughter.'Do not go to the Allen outlet!!!' Van Alstyne resident Kimberly Blakey wrote in a post to Facebook at 5:13pm. Attached to the post were multiple photos showing the damage to the door of her car by the two bullets.  'Peyton and I were just there and someone starting shooting,' she recalled after escaping the scene with her eighth grade daughter.'People were running and we were just trying to leave.''The shooting,' she added, 'was nonstop.''My car got hit by two bullets. We are so grateful to be OK.'Few other details regarding the shooting, and it is still unclear if there have been any fatalities. Multiple shots, however, were fired, according to both cops and those who survived the tragedy.Earlier in the day, a rep for Collin County Sheriff's Office - which is aiding in local cops' probe - confirmed Saturday there were 'some' victims, though their status, as of 10pm ET, still remains unknown. ",
        "As officers said they were 'investigating' the shooting, video from a Fox 4 helicopter showed at least four bodies covered in blood in white sheets.In his evening update, Chief Harvey said a police officer, who was on an unrelated assignment at the time, gunned down the shooter after hearing the first hail of gunfire, which is heard and seen in the dashcam footage.Aside from those slain in that clip, officials could only account for at a further nine victims who were transported to hospitals. However, as Allen fire chief Jonathan Boyd said, several more victims may have been taken in private vehicles.Elaine Penicaro, another local mother, also described hearing a nonstop hail of gunfire while shopping with her own daughter.'We were outside the Converse store and we just heard all this popping,' Penicaro told Fox 4 after also fleeing the scene, ducking for cover when they heard the shots reportedly around 3:45pm.'We kind of all just stopped, and then a second later, just 'Pop, pop, pop, pop, pop,' and there were sparks flying like it was right in front of us.'Brayson Jones, a 17-year-old who was working the PM shift at the outlets' Champs Sports store, told the New York Times that he heard 'probably 20-plus shots' and saw people running out of stores.'As soon as I heard the shots and people yelling, I didn't wait to see what was going on, I backed out and got out of there,' the teen recalled of the hectic scene.He added that in the frenzy he rescued a random stranger, who he said ran toward his car when the shots were fired and motioned to let him inside.Other aerial shooting shows the mass evacuation that transpired as cops reportedly swept each store to assess their safety, with hundreds of shoppers filed away from the H&amp;M location where the bodies were seen.The same store was seen in the background of the footage that showed people running through a parking lot in front of the shopping center - all while the loud popping sound of gunfire emanates in the background. ",
        "A woman named Colleen, who did not wish to provide her surname, told CBS Texas she was with her son at the mall at the time of the shooting.They described the shooter as wearing all black in and wearing 'like a SWAT uniform without the letters SWAT on it'. She said the shooter was a 'big guy' and was carrying a rifle before he opened fire and people began to run screaming in different directions.  Colleen and her 22-year-old son said they saw the killer dead on the ground when they were evacuated by the police with other bodies on the floor too.Her son initially thought the gunshots were construction noises before he saw the killer in front of the store.  He said: 'Out of nowhere I heard about like 10 pops go off and I look at the customer next to me and I was like 'was that gunshots?'.'And he said it was probably just construction and more shots go off, heard like 10-15 more shots go off and so I ran to the front of the store and we're like no that's shooting.'We saw the guy dressed in all black wearing a vest, has an assault rifle and he's just shooting at people.'A witness told CNN he saw the gunman exiting his vehicle before 'shooting his gun everywhere for the most part' on the sidewalk outside.He said: 'The door opened and I was letting the customers come inside the store.'He was pretty much walking down the sidewalk and blazing for the most part and shooting his gun outside the store.'He was walking down the sidewalk towards Fat Burger and he was just shooting his gun everywhere for the most part.'Another man, who was shopping with his wife and six-year-old son, said his family ran into a changing room and stacked cardboard boxes against the door to protect themselves.He said: 'We hid ourselves in the try-on room and there were spare boxes so we tried to lock it with the boxes and a couple of other ladies were there.'We hid for around two minutes and heard the noise. We didn't realize [what was happening] because the noise was coming from outside.'To be frank, for 10 minutes I was completely scared, I couldn't imagine what could be because we just parked the car and it was hardly five minutes.",
        "'When the police started the evacuation we saw the dead body and I didn't want my son to see but he also saw.'Another witness named Jamil said: 'We were inside the store and all of a sudden we heard a gunshots and everybody was panicking but the store we were in they were very helpful. They took everybody in the back and then police came, a SWAT team came, they brought us outside and they escorted us out.'When we were walking outside across from Michael Kors we saw the dead body, the guy had all the gear, he looks like a police officer but when you look at this shoes he was wearing converse.'So that makes you think he was just trying to trick people and he was shot right in his forehead.'One man rushed to the scene after his daughter who was at the mall texted him saying 'daddy I love you, there's a shooting'.He said: 'My daughter just texted her mom and me and said 'daddy I love you, there's a shooting and I am surrounded by the police just pray for me'.'We rushed here and we saw the police outside her door and they told us to let go and that they were still looking for the person.'This is America, people are dying in the hospitals, waiting rooms and on college campuses. There's no more safe places.'Other witnesses said they were taken into the back of stores by employees before exiting from that side once police said it was safe to leave.The shooting has left the city of Allen looking for answers, and comes at least 199 mass shootings this year in the US.It also comes just short of the year anniversary of the mass shooting across the state in Uvalde, which saw nineteen children and two adults fatally shot by an 18-year-old gunman with an assault weapon.This incident, at the time, sparked national outcry due to local cops' hapless handling of the attack - a response that comes in stark to the Allen officer's still of the Saturday event, which was praised by brass at the Allen outlet Saturday.'We are horrified by today's senseless tragedy and outraged by the violence that continues to plague our country,' Allen Premium Outlets said in a statement Saturday night,'Our thoughts and prayers are with the victims, their families and others affected by this heinous act. We are thankful for the police officer's heroic actions and for the support of all the first responders.'The shooting, while still shrouded, also prompted a response from Texas Governor Greg Abbott, who touted how his office has sent state officials from multiple agencies to aid Allen police with their investigation, including the Texas Department of Public Safety (DPS) and Texas Rangers.'Our hearts are with the people of Allen, Texas tonight during this unspeakable tragedy,' said Abbott in his written statement.'I have been in contact with Mayor Fulk and DPS Director McCraw as well as other state and local leaders and offered the full support of the State of Texas to local officials to ensure all needed assistance and resources are swiftly deployed.'The Governor's response, however, was soon met with criticism by some on social media, due to his and others' insistence that the US shooting epidemic does not stem from lax state and federal laws involving gun control. Mayor Kevin Fulk, a lifelong resident of Allen, added: 'Today is a tragic day for the city of Allen ... We know the days ahead will be difficult and somber.'Texas Senator Cruz also issued a statement that said he and his wife Heidi ' are praying for the families of the victims of the horrific mall shooting in Allen, Texas. 'We pray also for the broader Collin County community that's in shock from this tragedy,' the Republican, an outspoken opponent of harsher gun laws, said."
    ]
}