{
    "articleURL": "/sport/football/article-12053493/Unai-Emery-wants-sign-Kieran-Tierney-reunite-player-brought-Emirates.html",
    "content": [
        "The former Celtic star has been limited to just five starts for Arsenal this seasonMikel Arteta has repeatedly selected Oleksandr Zinchenko over the ScotsmanAnd Aston Villa have now entered the race to land the 25-year-old's signatureAston Villa boss Unai Emery reportedly wants to sign left-back Kieran Tierney from Arsenal and reunite with the player he brought to the Emirates.",
        "The former Celtic star has been limited to just five Premier League starts so far this season as Arsenal have mounted their most credible title challenge in more than a decade.However, after a serious knee injury brought a premature end to Tierney's season last campaign, Arsenal signed Oleksandr Zinchenko from Manchester City.Mikel Arteta has repeatedly selected Ukrainian Zinchenko over the Scotsman since the start of the season.And Villa have now entered the race for the 25-year-old's signature, according to The Telegraph.",
        "Tierney has also attracted interest from title rivals Manchester City and Newcastle United.The Sun reported Newcastle are set to make a £30million bid to sign Tierney and sources close to the player believe a move up north is increasingly likely.Villa go to Wolves on Saturday having dropped to eighth after the midweek results but remain in the hunt for a surprise European place. Emery recognises failing to qualify for Europe could impact the calibre of players the club could sign this summer but it will not change his ultimate goal.'Maybe, yes, but it's not changing the mind I have, the idea we spoke about,' he said.'We want to create a strong structure here, a strong mentality. You have to build a team like a family. ",
        "'If we are in Europe - we will add some possibility to take away trophies, playing more matches, for me it will be fantastic.'If it's not this year, my idea and objective is the same - try to play in Europe with Aston Villa. 'Not only just to play in Europe but I want to play in the Champions League with Aston Villa. '"
    ]
}