{
    "articleURL": "/wires/reuters/article-12058547/Nuggets-C-Nikola-Jokic-dust-Suns-owner.html",
    "content": [
        "Nuggets star center Nikola Jokic was assessed a technical foul in the second quarter of Denver's Western Conference semifinal Game 4 at Phoenix on Sunday night after a brief altercation with Suns owner Mat Ishbia.",
        "The incident occurred with 2:36 left in the first half after Jokic blocked Deandre Ayton's layup attempt. Suns guard Josh Okogie and Nuggets guard Jamal Murray scrambled for the loose ball, with Okogie -- and the ball -- flying into the first row of the seats, close to where Ishbia was sitting.Ishbia ended up with the ball, and Jokic came over to try and strip it from him. Jokic was somewhat successful in his attempt, but as he was prying the ball loose, the Suns owner seemed to swat it, prompting Jokic to push Ishbia aside.The gesture sent Ishbia back into his seat, where he flailed his arms up into the air as fans in the surrounding area reacted with shock.Referee crew chief Tony Brothers told a pool reporter that Jokic was issued an unsportsmanlike technical foul for grabbing the ball away from \"the fan\" and deliberately shoving and pushing him down. Brothers elected not to eject Jokic because he \"didn't just run over and hit a fan.\"Ishbia, who played for coach Tom Izzo as a walk-on at Michigan State, said that he was OK and was more focused on the result of the game, which the Suns ended up winning 129-124 to level the series at 2-2.",
        "Jokic, however, didn't believe that he was in the wrong.\"The fan put the hand on me first,\" Jokic said. \"I thought the league was supposed to protect us. Maybe I am wrong. I know who he is, but he is a fan. Isn't he?\"Nuggets coach Michael Malone stood behind the two-time MVP.\"Going to get the ball, and some fan is holding onto the ball who wants be a part of the game,\" Malone said. \"Just give the ball up, man.\"Jokic finished with a career-high 53 points plus 11 assists and four rebounds.Game 5 is set for Tuesday night in Denver.--Field Level Media"
    ]
}