{
    "articleURL": "/news/article-12039907/Juryless-rape-trials-Controversial-shake-repugnant-Lord-Uist-says.html",
    "content": [
        "A new Bill proposes a pilot scheme that aims to drive up the conviction rateLord Uist called the plans a 'serious attack upon independence of the judiciary’Plans for juryless rape trials and moves to allow judges to be summarily sacked are ‘repugnant’ and potentially unlawful, a former judge has said.",
        "Lord Uist warned that the proposals – published by Justice Secretary Angela Constance last week – were a ‘serious attack upon the independence of the judiciary’.A new Bill proposes a pilot scheme of juryless rape trials as part of changes aimed at driving up the conviction rate, including abolishing the not proven verdict.Writing in Scottish Legal News, Lord Uist said: ‘The work of the pilot courts is to be subject to review by the executive [Government] and a report of that review is to be submitted to the legislature. This amounts to politicians treating the courts as forensic laboratories in which to experiment with their policies.’Lord Uist said the SNP Government had said the ‘main purpose of the review is to consider whether the work of the court has been acceptable to the executive in the percentage of convictions returned by it’. He added: ‘A court with a limited lifespan working under such constraints could not be considered an independent tribunal within the meaning of Article 6 of the European Convention on Human Rights.’",
        "The former judge attacked the power the Bill provides for the Lord President to dismiss judges from the proposed Sexual Offences Court – without giving a reason. Referring to both proposals, Lord Uist wrote: ‘It is shocking that they were ever included in the Bill. Consideration should be given to removing them from the Bill.’",
        "Scottish Tory justice spokesman Jamie Greene said: ‘Lord Uist has delivered the latest damning verdict on the SNP’s plans for juryless trials from within the legal sector. Any reforms must have the buy-in of the sector.’Ms Constance said: ‘The Bill will be debated in detail and of course scrutinised – I hope – to the very highest of standards.’The Scottish Government said: ‘The evidence that jurors are subject to preconceptions about rape is overwhelming.’"
    ]
}