{
    "articleURL": "/sport/afl/article-12044925/AFL-WAG-Emma-Hawkins-reveals-Geelong-star-husband-Toms-secret-fear-viral-video.html",
    "content": [
        " Wife reveals Tom Hawkins' biggest fear She's clearly not a fan of them Many people  share his phobiaThe glamorous footballing wife of Geelong star Tom Hawkins has exposed his greatest fear in a TikTok video.",
        "In the clip, Emma Hawkins showed the pair seated way, way out the back at a comedy show because of Tom's fear of public gatherings.'This is where my husband chooses to sit at comedy shows because he gets so nervous with crowd interactions,' a computer-generated voice said over the vision, which was captioned, 'We could not be further away. Genuine fear of crowd interactions at shows.'It seems at odds with the persona Hawkins shows week in, week out as he seems unfazed by massive numbers of fans when he plays for the reigning premiers.",
        "As the video caught fire on TikTok, fans reacted.'I agree with him,' said one commenter.'He is so tall he'd stand out,' claimed another, while a few more pointed out that if Hawkins sat closer to the front at a comedy show, he'd be noticed by the comedian and most likely become fodder for the crowd's amusement due to his high profile.Over 12,000 people had liked Emma's video on TikTok just an hour after she posted it. Not that ridicule of any kind could be leveled at the veteran Cat after his astonishing display last week as he eight goals for Geelong in their big 132-104 win over Essendon.",
        "Less than a thousand people turned up for the comedy show featured in the video, which was a far cry from the 100,024 spectators who packed into the MCG last September to watch Hawkins play sublimely and help lead the Cats to a stunning 133-52 win over the Sydney Swans.",
        "And he certainly wasn't afraid of mixing it with the ecstatic Cats fans when the team did a celebratory lap of the MCG after the presentation ceremony - or a day later when he was captured on video being chaired around a room on a fan's shoulders during a wild party at the Geelong social club."
    ]
}