{
    "articleURL": "/sport/football/article-12059943/Blackpool-interview-former-Huddersfield-assistant-Narcis-Pelach-vacant-head-coach-position.html",
    "content": [
        "Blackpool have interviewed former Huddersfield assistant Narcis Pelach  They are seriously considering the coach for their vacant managerial positionThe Tangerines are also considering Neil Critchley and Leam Richardson  Blackpool have interviewed Narcis Pelach for the vacant head coach position at the club.",
        "The 34-year old Spanish coach has worked with Carlos Corberan at Huddersfield Town and also served there as interim boss.Pelach is highly respected within the industry as a top up-and-coming coach. Blackpool executives were highly impressed with his methodology and ideas and are understood to be seriously considering him for the role.They are also interested in Neil Critchley, Leam Richardson and Barrow's Pete Wild for the vacant position with the process ongoing.The Tangerines were relegated from the Championship last week after they suffered a 3-2 loss to Millwall, having lost 24 games this season, the most of any team in the league. ",
        "The club sacked former manager Micheal Appleton back in January after the Englishman had spent less than a year in charge at Bloomfield Road. The 47-year-old took charge of 27 matches at the club, losing 13 while winning six, seeing the Tangerines sink into the relegation zone, with the club failing to win in ten matches before his sacking, which came just ten years after he walked away from the club following his first stint in charge. They would go on to appoint former Ireland boss Mick McCarthy, who had been out of work since he left Cardiff in October 2021. The 64-year-old would subsequently walk away from the club after just 14 games in charge while failing to turn around their fortunes.",
        "McCarthy would manage just two wins in 13 league games with the club, with former Blackpool player Stephen Dobbie taking the reigns in his wake. The Tangerines are now looking to bring in a new permanent manager and Pelach could be the man to help guide them back up to the Championship next season. ",
        "During his time at Huddersfield, the 34-year-old took charge of the Terriers for one game in a caretaker position securing the clubs third win of the season against Cardiff, after the club sacked Danny Schofield.He would take charge once again after his successor Mark Fotheringham was sacked in February, but failed to guide his team to victory, succumbing to a 1-0 loss to Wigan. Before joining up with the Terriers, he worked as the assistant manager at Girona, where he also spent 15 years as a player.  He has also previously held head coach positions at Spanish lower third-tier sides CF Peralada UE Figueres and worked as part of Huddersfield's U23 coaching team. "
    ]
}