{
    "articleURL": "/wires/ap/article-12048525/Man-charged-setting-fire-Minneapolis-mosque.html",
    "content": [
        "MINNEAPOLIS (AP) - A man suspected of setting fires to Minneapolis mosques was indicted Thursday on federal charges of arson and damage to religious property while investigators look into a series of crimes targeting Muslims and Somali Americans.",
        "Jackie Rahm Little, 36, was indicted by a federal grand jury for an April 24 fire at the Masjid Al-Rahma mosque. Authorities are also investigating him as a suspect in a fire that damaged the Masjid Omar Islamic Center inside a Somali shopping mall on April 23, as well as in the January vandalism of U.S. Rep. Ilhan Omar's Minneapolis office and of a Somali American police officer´s vehicle, among other crimes, U.S. Attorney Andy Luger said at a news conference.\"The freedom to worship is sacrosanct. We will respond to any attack on any house of worship with urgency and determination,\" said Luger, who noted that the charge accusing Little of damaging religious property is a civil rights violation.Little pleaded not guilty at a brief hearing Thursday, where his attorney said he may seek an evaluation of his client´s mental competency. Hennepin County court records show that Little had been committed as mentally ill three times in 2021 and 2022 but had been free recently on a provisional discharge that was formally revoked last Friday.Little was arrested Saturday on a state charge of second-degree arson in the April 24 fire, which had prompted the evacuation of about 40 children from a day care at the Masjid Al-Rahma mosque.",
        "Little´s mother told investigators she recognized her son in video surveillance photos from the arsons and vandalism, according to an affidavit filed in support of the federal criminal complaint. She also said she strongly suspected that Little was involved in several unreported arsons.",
        "According to the affidavit, surveillance video captured Little entering the Masjid Al-Rahma mosque minutes before the fire.Investigators later found cardboard, metal canisters designed to hold olive oil, and an odor consistent with gasoline in the third-floor hallway of the mosque, the affidavit said. The hallway and stairwells on both ends were damaged.Jaylani Hussein, executive director of the Minnesota chapter of the Council on American-Islamic Relations, said in an interview with The Associated Press that he was at Masjid Al-Rahma at the time, discussing the previous day's fire with an imam.\"We were literally talking about the other incident\" when someone told them the mosque they were in was on fire, Hussein said. \"I could not believe it. Then I went up there and saw the smoke and fire.\"The affidavit alleges that a day earlier, Little lit a cardboard box on fire in a bathroom of the Masjid Omar Islamic Center. An employee interrupted Little and chased him out of the building.Little´s mother also told law enforcement officials that her son \"extensively harassed a Muslim female,\" including by sending her a photo of the Quran in a toilet, according to the affidavit.",
        "State Sen. Zaynab Mohamed, of Minneapolis, a Muslim and Somali American, said in an interview with the AP that people in the community have been frightened that the person who lit the fires would come back or try to attack other mosques.\"It's alarming. It's scary for the community,\" she said.She is pursuing legislation to expand data collection on hate crimes that she hopes will address the issue. Instead of leaving it solely to law enforcement to report data on bias crimes, the legislation would direct the state Department of Human Rights to also collect data from community organizations, school districts and individuals who might not report such incidents to law enforcement. The provision is part of a broad public safety budget proposal being considered by the Legislature.___Trisha Ahmed is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Trisha Ahmed on Twitter: @TrishaAhmed15"
    ]
}