{
    "articleURL": "/sciencetech/article-12059813/Why-NEVER-charge-phone-case-according-repair-experts.html",
    "content": [
        "Soft rubber, leather and even vegan leather among the worst for overheating Experts say 'sweet spot' temperatures are 62°–72°F (16°–22°C) for battery life  READ MORE:  iPhone users say new iOS 16.4 update is RUINING their battery lifeSometimes what's protecting the outside of your phone can harm what's inside your device.",
        "While plastic-, rubber- and silicone-based smartphone cases are great for absorbing shock from drops and keeping liquids out, these materials can act like insulation, retaining heat around your device like a warm sweater.Fancy leather, and even vegan leather, phone cases can have the same effect.This might be a good thing in frosty weather, but according to Apple's guidelines on maximizing battery performance, 'Charging your device when it's inside certain styles of cases may generate excess heat, which can affect battery capacity.'",
        "So, if you notice that your phone is getting hot while charging it, you might want to take it out of its case going forward. According to Apple, the iPhone and other iOS and iPadOS devices, including the Apple Watch, all work best at ambient temperature, between 32° to 95°F (0° to 35°C).When simply in storage, that range of 'comfort zone' temperatures is a little more generous, -4° to 113°F (-20° to 45°C).But according to experts, Apple's engineers have designed their devices for peak performance at room temperature. The true sweet spot is between 62° to 72°F (16° to 22°C) whenever possible.So, while even some of the thickest phone cases are not going to cause severe overheating all by themselves, they will contribute to overall heating alongside factors like the battery's age, the internal wear inside the battery, or just the weather that day.",
        "Adrian Kingsley-Hughes, author of the The PC Doctor's Fix It Yourself Guide, conducted an experiment charging his iPhone 13 Pro Max in a variety of cases while inside a room with an ambient temperature of 62° F.Kingsley-Hughes found that lower-power 5W charges managed to keep his iPhone in its 'comfort zone' no matter what phone case was used.High-power USB-C chargers, however, showed signs of heating the iPhone a little too close for comfort, especially if he attempted to use the phone while it was still charging.In general, he says that silicone cases kept the phone cooler than rubber cases.His conclusion: downgrading to a slower 5W charger could help, whether in hotter climates or if someone doesn't feel like removing and reinserting their smartphone into its case constantly.Overcharging or undercharging can also impact your phone's battery life.Chinese manufacturer Huawei recommends users keep their device charged to between 30 and 70% for the best battery life. And Apple, in fact, has a special setting that will keep your phone from ever going about 80% to help prolong its battery life.But when it comes to your phone's battery life and temperatures, the rule of thumb is simply to avoid extreme temperatures as much as possible.As Apple's support site warns, 'Using an iOS or iPadOS device in very hot conditions can permanently shorten battery life.' For example 'Don't leave your device in your car because temperatures in parked cars can exceed this range.'"
    ]
}