{
    "articleURL": "/wires/ap/article-12059035/Risk-Migrant-surge-US-prepares-Title-42-end.html",
    "content": [
        "BROWNSVILLE, Texas (AP) - Under a set of white tents at the U.S.-Mexico border in Brownsville, Texas, dozens of Venezuelan men waited. Some sat on curbs and others leaned on metal barricades. When the gates eventually opened, the long line of men filed slowly up the pedestrian pathway to the bridge and across the Rio Grande River to Mexico.",
        "In the past few weeks, U.S. Customs and Border Protection officials have been facilitating these expulsions three times a day as roughly 30,000 migrants, mostly from Venezuela, have entered the U.S. in this region since mid-April. That's compared with 1,700 migrants Border Patrol agents encountered in the first two weeks of April.In the other end of the state, in El Paso, officials are dealing with another increase of migrants and worry that thousands more are waiting to cross.All this comes as the U.S. is preparing for the end of a policy linked to the coronavirus pandemic that allowed it to quickly expel many migrants, and it spotlights concerns about whether the end of the immigration limits under Title 42 of a 1944 public health law will mean even more migrants trying to cross the southern border.\"We´ve been preparing for quite some time and we are ready. What we are expecting is indeed a surge. And what we are doing is planning for different levels of a surge,\" Homeland Security Secretary Alejandro Mayorkas said last week during a visit to southern Texas. But he also stressed that the situation at the border is \"extremely challenging.\"He spoke from a location in Brownsville where U.S. officials had set up a tent and facilities like portable bathrooms for migrants. He said it's difficult to identify the cause of the recent increase in Venezuelan migration, but said the U.S. is working with Mexico to address it and predicted change \"very shortly.\"",
        "Many of those crossing the border are entering through Brownsville just north of the Mexican border town of Matamoros. The city was rocked by another crisis Sunday when an SUV plowed into people waiting at a bus stop across from the city's migrant shelter. Eight people, mostly men from Venezuela, died.Ricardo Marquez, a 30-year-old Venezuelan man, arrived at a shelter in McAllen after crossing the border with his wife and 5-month-old child in Brownsville. They left Venezuela because his daughter needs surgery.\"I was confronted with the decision to either stay there or risk it all for my daughter,\" he said. They had crossed the Rio Grande after spending a month in Matamoros trying to get an appointment through an app the U.S. uses to schedule appointments for people without documents to come to the border and seek entry.Officials in President Joe Biden's administration say they have been preparing for well over a year for the end of Title 42. The strategy has hinged on providing more legal pathways for migrants to get to the U.S. without risking the perilous journey to the border. That includes things like setting up centers in foreign countries where migrants can apply to emigrate as well as a humanitarian parole process already in place with 30,000 slots a month for people from four countries to come to the U.S.",
        "Starting May 12 they're expanding appointments available through the CBP One app Marquez tried to use. When it was launched many migrants and advocates criticized the app, saying it had technological problems and there simply weren't enough appointments.The strategy is also heavy on consequences. The U.S. is proposing a rule that would severely limit asylum to migrants who first travel through another country, quickly screening migrants seeking asylum at the border and deporting those deemed not qualified, and a five-year ban on reentry for those deported.A lot of these consequences have been met with harsh criticism by immigrants' rights groups who have gone so far as to compare the policies to then-President Donald Trump's and say the right to apply for asylum on U.S. soil is sacrosanct. Much of the Biden administration strategy is also facing legal peril in the coming weeks. The proposed rule limiting asylum is almost certain to be the subject of lawsuits. And Republican-leaning states want to stop the Democratic administration's use of humanitarian parole on such a large scale.The administration has also been increasing Immigration and Customs Enforcement flights to remove people from the country - flights like one that took off recently from an airport in Harlingen, Texas. Shortly after dawn three buses pulled up next to a plane. One by one migrants got out of the bus. They were wearing handcuffs and leg restraints and surgical masks. First they were patted down for contraband and then slowly walked up the stairs to the plane. Altogether 133 migrants were sent back to their home country of Guatemala.",
        "But those flights only work if countries accept them. Venezuela does not. And Colombia says it's suspending deportation flights due to \"cruel and degrading\" treatment of migrants.Administration officials say they're using technology to speed up the processing of migrants who cross the border without documentation and using mobile processing, so they can process migrants while they're being transported by bus or van, for example. They've pushed to digitize documents that at one time were filled out by hand by Border Patrol. And they've beefed up the hiring of contractors so agents can remain in the field.But critics have slammed the administration, saying it's not doing enough. Kyrsten Sinema, an independent U.S. senator from Arizona, said on CBS' \"Face the Nation\" on Sunday that the administration wasn't communicating with local officials about things like what type of increase to expect or whether buses would be available to transport migrants. And she said a decision to send 1,500 military troops to the border came too late.In Texas, Republican Gov. Greg Abbott said Monday he was deploying \"tactical\" National Guard teams this week to the busiest crossing spots. Abbott, who for years has accused the Biden administration of not doing enough on the border, also said \"many thousands more\" migrants in the coming days will be bused by the state to Democratic-led cities elsewhere in the U.S.",
        "\"It did not have to be this way,\" said Abbott, speaking in Austin as Guard members boarded four C-130 cargo planes behind him.In communities that border Mexico, officials and community groups that care for newly arrived migrants are anxious about what the end of Title 42 means. Sister Norma Pimentel runs Catholic Charities' Humanitarian Respite Center, the largest shelter in South Texas.The shelter functions mainly as a resource center where migrants can purchase tickets, make calls, eat and rest before traveling to their next destination, where they often have family or other contacts. But, Pimentel said, many of the Venezuelans in this latest migration increase don´t have connections in the U.S., making it harder for them to move to the next destination. \"That becomes a problem for us,\" she said.The federal government gives money to communities to help them deal with the increases in migrants. On Friday the administration announced that $332 million had been disbursed to 35 local governments and service organizations. Most goes to communities close to the border \"due to the urgencies they are confronting,\" but cities far from the border also get funds.In the Texas border city of El Paso, about 2,200 migrants are currently camped or living on the streets a few blocks from major ports of entry that connect El Paso with the Mexican city of Juárez. The city is prepared to open up shelters next week if needed at two vacant school buildings and a civic center.",
        "El Paso Mayor Oscar Leeser estimated that roughly 10,000 to 12,000 migrants are in Juárez waiting to cross, as local officials prepare for the \"unknown.\" Leeser said migrants are flocking to the border under false assumptions that it will be easier to gain entry to the U.S. when Title 42 goes away, but for many there could be tougher consequences.It's a message federal officials have been repeating. But they're competing against a powerful human smuggling network that facilitates northern migration and the desperation of migrants who feel they have no other option.At the Brownsville port of entry, U.S. Customs and Border Protection officials say they've run drills to prepare in case there´s a large increase of migrants trying to cross and they need to close the bridge. Pedestrians cross from Matamoros using a covered walkway that can only accommodate a few people across. Worried about the impact of long lines of migrants coming to the port after May 11 without an appointment and impacting port operations, they're calling on people to schedule appointments through CBP One.___Gonzalez reported from McAllen, Texas. Associated Press writers Morgan Lee in Santa Fe, N.M., and Paul J. Weber in Austin, Texas, contributed to this report.___This story has been corrected to show the senator's first name is Kyrsten, not Kristen."
    ]
}