{
    "articleURL": "/news/article-12038761/FBI-called-stabbing-week-small-California-university-town.html",
    "content": [
        "In the latest attack on Monday, a 64-year-old woman was attacked and stabbed through her tent at 2nd Street and L Street. She is in critical conditionOn Saturday, UC Davis student Karim Abou Najm,20, was killed in Sycamore ParkOn Thursday, David Breaux, 50, a beloved homeless man known as the 'Compassion guy' was stabbed to death in Central Park near UC Davis campusResidents of a small California university town are on edge after three stabbings in less than a week killed a college student, a beloved homeless man known as 'Compassion Guy' and left a local woman in critical condition. ",
        "The FBI has been called in to help Davis police who say they are still investigating whether the three 'brazen' stabbings are related, but noted that the description of the suspect in both Monday and Saturday night's attacks, are 'substantially similar.'In the the most recent attack, a 64-year-old woman was stabbed through a tent at a homeless encampment in the area of 2nd Street and L Street around 11:46 p.m. on Monday. She is in critical condition, police said.The assailant, who has not yet been caught, is described as a man with a light complexion and curly hair, who is 5 feet and 6 inches to 5 feet and 9 inches tall, with a thin build. He was believed to be wearing a black or blue sweatshirt, black Adidas pants with stripes and carrying a brown backpack. Police said the description closely resembles the suspect who fatally stabbed UC Davis student Karim Abou Najm in Sycamore Park on Saturday night. A few nights earlier, 50-year-old David Breaux, who was a fixture in the community, was found stabbed to death on a bench in another park near campus.",
        "Davis Police Chief Darren Pytel said in a press conference on Tuesday that even though they have combed through hundreds of tips, they have 'not been able yet to positively link the three crimes' that are 'particularly violent and brazen' and that they are 'still waiting for evidence to come back.'",
        "Pytel spoke about the similarities between the attacks. He said the two 'particularly brutal' homicides occurred in city parks, while the suspect or suspects in the second homicide and Monday night's attack both interacted with witnesses. That suggests bold behavior that causes police 'significant concern,' Pytel said.A 'detailed search' overnight of the downtown area did not result in finding a suspect, the department said in a statement. The shelter-in-place order was being lifted, but the suspect or suspects remain on the loose and police urged residents to 'continue to be aware of your surroundings.'The FBI has been called in to help with the investigation after Monday night's stabbing brought the total to three in less than a week. ",
        "Pytel said police were called to the scene late Monday night where a 64-year-old woman, whose name has not been released, 'was able to provide a description of the assailant and she was able to tell us what happened.'Isaac Chessman and Christine Berrios, a couple in a neighboring tent told KCRA they heard the woman screaming for help. Chessman added that he believed he encountered the suspect earlier that day.'So we're sitting in front of the tent, and I said, 'Babe, this isn't feeling right,' and I seen a dude run across the way and started running, but he would stop along every tree to blend in with the tree because it's dark. I noticed that because that's something you would do if you're scoping something out,' he said.",
        "'I said, 'Hey bro,' and he starts walking normal, and then I said, 'You look like the dude they've been describing that's been stabbing people.' He takes off and I started to take off after him and my wife is like, 'Don't leave me here,' Cheessman said.On Saturday, another stabbing took the life of UC Davis senior Karim Abou Najm. The 20-year-old computer science major was on his way home when he was killed at Davis' Sycamore Park around 9:15 p.m., according to police. A resident heard the disturbance and went outside to try and help, even having a brief interaction with the suspect who then fled. He found Abou Najm with multiple stab wounds. The suspect of that attack was described as being 'a light-skinned male, possibly Hispanic, 5'-7' to 5'-8' tall, 19-23 years of age, with long curly loose hair.' He was last seen wearing a white hat, a light-colored T-shirt, and a button-up shirt over it, and riding a men's bike with straight handlebars, police said. ",
        "Abou Najm was set to graduate in just six weeks, his father, Majdi Abou Najm told Sacramento ABC affiliate KXTV. 'Karim was a wonder of energy, a free spirit, someone who just wants to see goodness around him,' he said. Abou Najm already had two jobs lined up for after graduation.",
        "'We moved from Lebanon in 2018 when the situation in Lebanon was a little bit starting to go in not the right direction,' Abou Najm said. 'We came here hoping for safety.''I want this to be his memory: a bundle of energy, a bundle of positivity,' Majdi Abou Najm said of his son. 'Someone who was full of ambition, proud of his roots, who just wanted to make this world a better place.' The wave of attacks began on Thursday with the fatal stabbing of 50-year-old David Breaux, known as the 'Compassion Guy' who was killed in Central Park on the park bench where he often slept.",
        "Breaux, who was a fixture in the community for over the past decade, was 'instrumental' in the addition of a 'Compassion Bench' at the corner of 3rd and C Streets in 2013.'The death of David Breaux is utterly and completely devastating,' Davis Mayor Will Arnold said. 'Many of us knew David. We talked with him. We shared in his vision for a kinder world. We connected on what it means to be human and humane.' The bench is where he would ask people their definition of the word 'compassion.' He later published his notes as a collection of anonymous writings.'Like so many of you, I am grieving the death of David Henry Breaux, known as the 'Compassion Guy.' ... David led a life with real purpose, to connecting humanity for the greater good, something we should all aspire to do,' the UC Davis chancellor said in a statement. ",
        "The school has expanded the hours available for safe rides from campus to off-campus locations as the investigation continues. The chief of UC Davis police said that security efforts are being doubled on campus and that the school has hired private security and brought in officers from UC San Francisco and UC Berkeley."
    ]
}