{
    "articleURL": "/wires/aap/article-12045219/Reds-Waratahs-settled-teams-Super-Rugby-derby.html",
    "content": [
        "Coach Darren Coleman has named an unchanged starting XV for the first time all season as the Waratahs bid for elusive back-to-back Super Rugby Pacific wins.",
        "The Waratahs take on the Queensland Reds in Townsville on Saturday having not won successive games since round 11 and 12 last year - some 15 matches ago.As well as Wallabies spots going on the line at Queensland Country Bank Stadium, the sixth-placed Reds and seventh-placed Waratahs are locked in a tight six-team battle for the remaining three quarter-finals berths.The Reds are precariously placed just two competition points above the Waratahs but nine shy of the fifth-placed Crusaders.Having lost their last four derbies against the Reds, Coleman is delighted to have made only one change, bringing Harry Wilson back to the bench after missing last week through HIA protocols.The Waratahs escaped with a last-minute 21-20 victory over the Highlanders last start to revive their flagging season.But they've still won only three from nine so far this campaign.\"We're happy with the result last week but are still searching for an 80-minute performance which we'll need against a dangerous Reds outfit away in Queensland,\" Coleman said.\"Our rivalry with the Reds is one of the oldest and fiercest in Australian sports and we can't wait to get up to Townsville.\"They've had the wood on us for the past couple of years and with the ladder as congested as it is, this match is almost worth double points so we're definitely cognisant of the importance of this match.\"",
        "Like the Tahs, the Reds are relatively settled with the only change from the starting side that beat the Western Force last week being Ryan Smith replacing Seru Uru in the second row.Reds coach Brad Thorn expects both sides to be fired up, noting individual tussles across the park as the Test hopefuls look to impress Wallabies coach Eddie Jones.\"The two nines are sharp, the forward battle and both teams have a bit of strike in their backs,\" Thorn said.\"We've done our homework on the Waratahs, they've done it on us. It's just an important game for both sides and traditional rivals.\"I'm sure this is one of those games the people above will be looking at - there's match-ups there isn't there?\""
    ]
}