{
    "articleURL": "/wires/ap/article-12060439/Forensic-genealogy-leads-arrest-2007-Kansas-rape-case.html",
    "content": [
        "WICHITA, Kan. (AP) - Police in Kansas have arrested and charged a man in a 2007 sexual assault by matching a DNA sample to data submitted to genealogy websites.",
        "Ted Foy, 52, of Augusta, is jailed on $500,000 bond after he was charged last week with rape, aggravated sexual battery and aggravated criminal sodomy. His attorney, public defender Sonya Strickland, didn't respond to an Associated Press email seeking comment Monday.The Wichita Eagle reports that it was the Wichita police department´s first arrest using investigative genetic genealogy. The process received widespread attention after it was used in 2018 to track down a California serial killer who was responsible for at least 13 killings and dozens of rapes in the 1970s and 1980s. Since then, the method has led to the identification of dozens of suspects in cold cases, though some critics have voiced privacy concerns.\"With these sorts of dragnets, you are using probable cause against one person to invade the privacy of millions,\" said Albert Fox Cahn, the executive director of Surveillance Technology Oversight Project, a privacy and civil rights organization.Investigators reopened the Nov. 13, 2007, case in 2020 and spent well over 100 hours on it, said Capt. Christian Cory.The assault happened less than 5 miles (8 kilometers) from McConnell Air Force Base and the Air Force Office of Special Investigations Cold Case Team was involved. Cory declined to explain how the the base was involved, saying only that the team had a special interest in the case.",
        "More details could emerge if a judge releases the probable cause affidavit.Cory said, in general, that connection to a distant relative is only the start of the investigation, which would often require getting DNA from closer family members, and hopefully the suspect, and creating a case that shows the person could have committed the crime.The police department is using genealogy to investigate five other cold cases, all murders and sexual assaults, he said. Cory expects some of the other cold cases will be solved.\"I´m very happy that there´s another tool that we can use to bring justice to the victims in these cold cases,\" he said."
    ]
}