{
    "articleURL": "/sport/football/article-12057555/MATT-BARLOW-Tottenham-without-Kane-Spurs-soon-enough.html",
    "content": [
        "Harry Kane scored the only goal in Tottenham's 1-0 win against Crystal PalaceThe effort saw Kane moved into second in the Premier League scoring chartsKane now has over 40 per cent of Tottenham's goals during a difficult campaign For Harry Kane another season is ending as it began. Scoring goals to win games, knocking down records and dutifully preserving Tottenham’s flame of hope.",
        "He just keeps doing what he does. Refusing to be distracted as Spurs lurch from one crisis to another. Or as Erling Haaland rolls into English football, firing in his goals at a rate not seen in this country for decades.Carry on Harry, reliable as ever. He has scored 26 of Tottenham’s 64 Premier League goals this season, a shade over 40 per cent and a greater share of his club’s total than ever before, including his best return of 30 goals of 74 in 2017-18.Where would they be without him? The answer may be near and yet Kane continues with the same supreme focus.‘On to the next one,’ he replied with a knowing smile, aware how predictably dull it must all sound while enjoying the list of assorted milestones passed with Saturday’s winner against Crystal Palace.",
        "The goal eased him clear of Wayne Rooney into second place in the Premier League’s all-time scoring charts, although he remains 51 behind Alan Shearer. There were others, too, including a new record set for 10 headers scored in one season in the competition.‘Of course, these are great as we always say, special achievements,’ Kane told the club’s in-house channel. ‘It’s hard to think about them during the season but to go second in the all-time list above Wayne is something I’m extremely proud of.’",
        "His steely focus is quite ominous for Daniel Levy. When Kane fixes his eyes on something, he holds his gaze, does not blink, and he appears determined not to extend the contract that will run out next year.Available on a free, Kane could select his next club from any in the world. Tottenham, meanwhile, must keep working to change his mind.With such an uncertain future, it seemed vital in the short term to end a rotten sequence of results.This they did with the help of Ryan Mason’s tactical tweak, enabled by Emerson Royal’s return to fitness, which released Pedro Porro from his defensive responsibilities.It was Porro who crossed for Kane’s goal, a header at the back post in first-half stoppage time.‘It was a perfect ball and I timed my header well,’ said Kane. ‘It was important to bounce back, show some desire and determination. A 1-0 win always feels good, builds momentum.’TOTTENHAM (4-4-2): Forster 6; Royal 7, Romero 7.5, Lenglet 7 (Dier 88min), Davies 7; Porro 7.5, Skipp 6, Hojbjerg 6, Son 6.5 (Danjuma 89); Richarlison 6.5 (Kulusevski 79), KANE 8. Scorer: Kane 45+1. Booked: Davies, Lenglet, Forster. Manager: Ryan Mason 7CRYSTAL PALACE (4-3-3): Johnstone 6.5; Ward 6, Andersen 7, Guehi 7, Mitchell 6.5; Eze 6, Doucoure 6, Schlupp 6 (Hughes 74, 6); Olise 6.5, Ayew 6 (Edouard 84), Zaha 6.5. Booked: Schlupp, Ward, Ayew, Zaha, Andersen. Manager: Roy Hodgson 6.",
        "Referee: Darren England 6. Attendance: 61,093."
    ]
}