{
    "articleURL": "/tvshowbiz/article-12044239/The-Flash-production-designer-insists-movie-good-fans-forget-Ezra-Millers-crimes.html",
    "content": [
        "Just weeks after the first public screening of The Flash - where critics called it one of the best superhero movies ever - the film's production designer is making another bold claim.",
        "Production designer Paul Austerberry - who won an Oscar for his work on Best Picture winner The Shape of Water - opened up on the film in a new interview with CBC News.While the movie has been earning rave reviews, others are still troubled by Warner Bros. sticking with Miller after a slew of legal troubles including charges of assault and burglary and faced accusations of grooming children. Still, Austerberry revealed in this new interview that once fans see the movie in theaters starting June 16, that, 'People will forget that,' referring to Miller's controversial behavior.He added that Miller played two different versions of Barry Allen/The Flash, from two different universes, adding he had to shoot the film in, 'two different chunks,' which required him to switch roles every few days.",
        "Austerberry revealed Miller had, 'a lot of pressure,' adding he filmed for six days a week, and on Saturdays he spent in stunt rehearsals, claiming Miller only had three days off during the entire shoot.'So, a lot of pressure,' Austerberry said of Miller, who has been in more than his fair share of legal troubles over the past few years.The 30-year-old actor was arrested several times earlier this year for assault and burglary, faced accusations of grooming children, and reportedly provided housing for a mother and three young children at an unlicensed cannabis farm in Vermont despite opposition from their father.",
        "The actor issued a statement in August apologizing for his behavior while revealing that he was seeking treatment for 'complex mental health issues.'His reps told Variety in a statement: 'Having recently gone through a time of intense crisis, I now understand that I am suffering complex mental health issues and have begun ongoing treatment.'The statement continued: 'I want to apologize to everyone that I have alarmed and upset with my past behavior. I am committed to doing the necessary work to get back to a healthy, safe and productive stage in my life.'Miller was arrested and charged earlier in August with felony burglary after police claim the actor broke into an area home and stole bottles of liquor in May.The future of The Flash franchise was uncertain after the actor was arrested for the third time this year in August, following earlier arrests in April in Hawaii.",
        "Miller has been accused of disturbing and violent behavior going back to at least 2020.That year, a video circulated that allegedly showed the actor choking a woman while at a bar in Reykjavik, Iceland.A source told Variety the incident took place after 'pushy fans' approached Miller and the actor lost their temper.The Flash director Andy Muschietti also offered an update on Miller, which began, 'We’re all hoping that they get better. ",
        "'[They're] taking the steps to recovery, [they're] dealing with mental health issues, but [they're] well. We talked to them not too long ago, and [they're] very committed to get better,' Muschietti concluded."
    ]
}