{
    "articleURL": "/wires/ap/article-12061065/Mexico-plans-expedition-endangered-porpoises.html",
    "content": [
        "MEXICO CITY (AP) - Mexican officials and the conservation group Sea Shepherd said Monday that experts will set out in two ships in a bid to locate the few remaining vaquita marina, the world´s most endangered marine mammal.",
        "Mexico environment secretary said experts from the United States, Canada and Mexico will use binoculars, sighting devices and acoustic monitors to try to pinpoint the location of the tiny, elusive porpoises. The species cannot be captured, held or bred in captivity.The trip will run from May 10 to May 27 in the Gulf of California, also known as the Sea of Cortez, the only place the vaquita lives. The group will travel in a Sea Shepherd vessel and a Mexican boat to try and sight vaquitas; as few as eight of the creatures are believed to remain.Illegal gillnet fishing traps and kills the vaquita. Fishermen set the nets to catch totoaba, a fish whose swim bladder is considered a delicacy in China and can fetch thousands of dollars per pound (kilogram).Sea Shepherd has been working in the Gulf alongside the Mexican Navy to discourage illegal fishing in the one area where vaquitas were last seen. The area is known as the `zero tolerance´ zone, and no fishing is supposedly allowed there. However, illegal fishing boats are regularly seen there, and so Mexico has been unable to completely stop them.Pritam Singh, Sea Shepherd´s chairman, said that a combination of patrols and the Mexican Navy's plan to sink concrete blocks with hooks to snare illegal nets has reduced the number of hours that fishing boats spend in the restricted zone by 79% in 2022, compared to the previous year.",
        "Singh said \"the last 18 months have been incredibly impactful and encouraging,\" while noting that \"the road ahead for saving this species is long.\"The last such sighting expedition in 2021 yielded probable sightings of between 5 and 13 vaquitas, a decline from the previous survey in 2019. The porpoises are so small and so elusive, and are usually seen from so far away, that it is hard to be sure if observers are seeing a vaquita, how many they saw or if they saw the same animal twice.But the illegal fishing itself has impeded population calculations in the past.According to a report by experts published in 2022, both the 2019 and 2021 surveys \"were hindered by the presence of many illegal fishing boats with gillnets in the water. Some areas could not be surveyed at all on some days due to the density of illegal fishing.\"The government´s protection efforts have been uneven, at best, and also often face violent opposition from local fishermen.President Andrés Manuel López Obrador´s administration has largely declined to spend money to compensate fishermen for staying out of the vaquita refuge and stop using gillnets, or monitor their presence or the areas they launch from."
    ]
}