{
    "articleURL": "/news/article-12041581/Piranha-attack-leaves-eight-people-injured-Brazil.html",
    "content": [
        "Piranhas attacked people playing in a stream at a beach resort in Taruma-AcuImages at the scene showed people with bites on their legs and feet At least eight people have been left injured in a piranha attack in Brazil with the victims suffering bloody wounds, according to local media.",
        "The fish are said to have torn in to their legs at a beach resort in Taruma-Acu, a region that lies to the north of Manaus - a city that sits on the Amazon River.Shocked victims are understood to have been playing in a stream on May 1 during the Labour Day holiday when they suddenly felt sharp pains on their feet and legs.One victim said they only realised what they had been attacked by upon getting out of the water and finding others nursing their wounds.Images taken at the scene show how several people had to have their bloodied feet bandaged up after receiving nasty bites from the vicious fish.",
        "'I felt a 'shock' on my heel, I even thought it was the poraque [a fish that emits electrical charges],' University student Adaiany Monteiro told G1 news.But 'when I left, I saw that some people were talking about piranhas and bites. I noticed my foot and saw the bite mark', she told the Brazilian news outlet.The dangers posed by piranhas have often been mythologised in books, films, television and video games (including the 1978 horror flick 'Piranha' or more recently Netflix's 'Wednesday').Some stories suggest a school of the carnivorous fish can skeletonize a human body or cattle in seconds.",
        "While such stories are often exaggerated, they still pack a nasty bite, and while a person is unlikely to be stripped to the bone - attacks can be fatal.The fish - which inhabit South American rivers, floodplains, lakes and reservoirs - have one of the strongest bites found in bony fishes. Relative to its body mass, the black piranha produces one of the most powerful bites measures in vertebrates.There have been several documented attacks similar to the latest in Taruma-Acu. In one incident in 2011, a series of attacks resulted in 100 people being injured.That same year, a drunk 18-year-old died when he jumped out of his canoe before being attacked in Rosario del Yata, Bolivia. He bled to death from the bites.A year later, a five-year-old Brazilian girl was killed when she was attacked by a shoal of red-bellied piranhas.And in January last year, the bodies of four swimmers were found mauled by piranhas, in a spate of attacks that sent shockwaves throughout South America.The attacks happened in Paraguay, where people had visited local rivers in large numbers in a heatwave in order to cool down.",
        "Extreme stories of deadly piranhas can be traced back a century earlier.On a visit in 1913, former US President Theodore Roosevelt went on a hunting exhibition through the Amazon. He later told of how local fisherman lowered a cow into water filled with piranhas that had not eaten for days.",
        "After a minute or two of watching the water 'boiling' with piranhas and blood, he said a skeleton floated to the suddenly calm surface.He later recounted the tale in his 1914 book 'Through the Brazilian Wilderness', in which he wrote: 'They are the most ferocious fish in the world.'Experts, however, say while piranhas can be vicious, they are actually omnivorous foragers and feed on insects, worms, crustaceans, and fish.As opposed to hunters, they are more akin to vultures, and are more like to bite and eat something that they think is already dead.G1 also spoke to Dr Romes Proenca of the Mobile Emergency Care Service about what to do if bitten by a piranha.He said: 'The first thing to do when attacked is to get out of the water and try to signal the accident as quickly as possible so that other people do not get hurt.'Do not use detergent, Merthiolate, toothpaste, or any other product.'You can compress the area with gauze, a towel, or a clean cloth to prevent bleeding and take the person to a healthcare facility as soon as possible.'Not seeking assistance increases the risk of tetanus and infection.'According to fisheries engineer Daniel Bevilaqua, the waterway in Taruma-Acu has several floating restaurants that serve food.",
        "He believes visitors may be throwing food into the water, attracting animals. ",
        "He told local media: 'Often, in this environment where food is being discarded close to the floating restaurants, bathers occupy this space during the day, when the incidence of sunlight is when the piranha is most active in feeding.'As the piranha is feeding in that environment, it ends up having to protect that area.'Often, someone is bathing and ends up being attacked, not because he is food for the piranha, but because he is invading the space it uses to feed.'Attacks are also more common during the summer when the fish reproduce and come close to the coast when water levels are low."
    ]
}