{
    "articleURL": "/tvshowbiz/article-12056077/Pedro-Pescal-reveals-reason-places-hand-stomach-red-carpet-events.html",
    "content": [
        "Pedro Pascal has revealed the touching reason why he always places his hand on his stomach while posing for pictures on the red carpet. ",
        "The Chilean/American actor, 48, has been a familiar face at the star-studded events for years due to his roles in Game Of Thrones, The Mandalorian and most recently, The Last Of Us. Fans have long been left wondering about the reason behind his go-to pose for the cameras. At the Met Gala on May 1 - where he rocked the red carpet with his bold red look - Pedro once again brought out his signature pose. And appearing next to his co-star Bella Ramsey, 19, at the Los Angeles FYC Event for HBO's The Last Of Us at the Directors Guild Of America on April 28, Pedro also held his hand to his stomach. ",
        "Bella looked quizzical at his stance and asked him about the reason behind it. He responded: 'You know why? Because my anxiety is right here.'The two then shared a comforting smile between them and Bella nodded in understanding. Fans then rushed to Twitter to praise Pedro for his openness and honesty about mental health. One said: 'I love how pedro pascal breaks down the barrier for men who go through things that are so invalidated by a certain group of society. 'He’s so open about everything he supports and believes in, he’s so open about anxiety and bereavement and i love that about him!'",
        "Another added: 'I so deeply adore Pedro Pascal and his willingness to be funny and silly and emotional and strong and sensitive.' A third tweeter said: 'Just when I think I can’t love him more.' ",
        "The duo, who have a father/daughter dynamic on the critically-acclaimed zombie apocalypse show, seemed as cheerful as ever in each other's company.Pedro opted for a white smoking jacket with striped silk detail around the lapel, cuffs, and belt.He wore the jacket over a dark brown untucked shirt with white geometric flowers and baggy metallic grey trousers.Bella, who defines as non-binary, went for an androgynous look, donning a dark navy blue single breasted suit.The star wore the suit over a striped blue shirt with white cuffs. They accessorised the outfit with white patent leather platform shoes and a single gold magnet style ring.They kept their make-up very light, sporting a touch of foundation and pink lipstick. They left their cropped brunette hair down, styled in waves. The pair, who Pedro has adorably named 'Beldro', seemed to enjoy the event, grinning as they goofed around on the black carpet. It comes after the star's bold look at the Met Gala last week. ",
        "Pascal's look has already been the talk of the red carpet, rocking an ensemble from Maison Valentino's autumn/winter 2023 ready-to-wear line.",
        "He stepped out with a bright red trench coat under a matching red dress shirt and a black tie, while showing off his muscular legs with a pair of black shorts.He completed his look with black socks and shiny black combat boots, while rocking a scruffy beard, slicked-back hair and gold rings. "
    ]
}