{
    "articleURL": "/tvshowbiz/article-12055505/Kylie-Jenner-shows-glossy-glam-sultry-new-selfie.html",
    "content": [
        "Kylie Jenner showed off her 'glossy glam' in a sultry new selfie on Saturday to promote Kylie Cosmetics.",
        "The makeup mogul, 25 – who looked nearly unrecognizable in a new ad campaign for Jean Paul Gaultier – looked gorgeous with her plump pout glossed with blush color. Gazing into her camera, Jenner's eyes exuded sex appeal with their glossed lids and dark full lashes.The bombshell's raven hair flowed down in lustrous waves and her radiant features glowed with flawless warmth.Captioning the post, Jenner's team wrote: '@kyliejenner's glossy glam.'",
        "Kylie's latest post comes on the heels of her show-stopping Met Gala appearance on Monday, which was heavily influenced by her new flame Timothee Chalamet, 27.The siren's red gown was from Jean Paul Gaultier, and the head designer Haider Ackermann just so happens to be an extremely close friend of Chalamet.Not only did Jenner wear a custom creation from Ackerman for fashion's biggest night, but the 52-year-old designer also chose her to front the campaign for Jean Paul Gaultier's new Flowers Collection.   'Haider is one of my closest friends and a creative from a lost era,' Timothee gushed to System Magazine last fall.The Dune star went on to declare: 'His is the rare passion that cares about the purity of design, shapes, colors, textures, and the feelings they evoke. 'He couldn't possibly pretend to care about a fashion cycle or algorithm-influenced trends - his talent and creativity are set to last because he is following his own drum beat, no one else's.'",
        "And Haider returned the praise, saying of Timothée: 'Sometimes you meet someone, and you just know you can build a story together and have a moment together that may really last.'",
        "Jenner has also become very close with Ackermann as they both showcased their behind-the-scenes moments from the Met Gala on social media. Kylie's solo appearance at the Met Gala followed rampant speculation that she is currently in the middle of a whirlwind romance with Timothee. The Kardashians star's new dalliance with Chalamet took the world by complete surprise, especially since the pair have reportedly been dating for months. Kylie and Timothee met up for a secret date night in Los Angeles at Tito’s Taco stand two weeks ago, just days after she was seen parking in the driveway of his Beverly Hills home."
    ]
}