{
    "articleURL": "/wires/reuters/article-12047649/Norway-oil-fund-climate-resolution-refiner-Valeros-AGM.html",
    "content": [
        "OSLO, May 4 (Reuters) - Norway's $1.4 trillion sovereign wealth fund, the world's largest stock market investor, said on Thursday it will vote in favour of a shareholder resolution calling on U.S. refiner Valero Energy to issue a report on climate goals.",
        "The vote on a plan for Valero to release short-, medium- and long-term reduction targets for greenhouse gas emissions was called by a shareholder asking the company to align with the Paris climate agreement's goal of limiting global warming.Valero's board has recommended that the motion should be rejected, saying that the requested targets could only be met by refinery closures and that the company will instead run a \"resilient\" operation pursuing low-carbon fuel production.Norges Bank Investment Management (NBIM), which operates the Norwegian fund, said last year that it plans to take a tougher line on companies in its portfolio that do not adopt sufficiently credible climate plans.Valero's board should account for material sustainability risks facing the company as well as the broader environmental and social consequences of its operations and products, NBIM said on its website.\"Sustainability disclosures should be aligned with applicable global reporting standards and frameworks to support investors in their analysis of risks and opportunities,\" it added.NBIM will also vote against the reappointment of Valero CEO and Chair Joe Gorder to the company's board, in line with the fund's long-held view that the two key positions should be held by separate individuals.Valero did not immediately respond to a request for comment when contacted by Reuters.",
        "The Norwegian fund, built on cash from Norway's oil and gas industry, held a 1.07% stake in Valero at the end of 2022 with a value of $523 million, the last available data. (Reporting by Terje Solsvik; Editing by Chizu Nomiyama)"
    ]
}