{
    "articleURL": "/wires/reuters/article-12050431/Chiles-voters-set-big-step-constitution-redraft-2-0.html",
    "content": [
        "By Natalia A. Ramos Miranda",
        "SANTIAGO, May 5 (Reuters) - Chileans will vote to elect 50 constitutional advisers on Sunday, a major step towards rewriting the constitution, after voters overwhelmingly rejected a first attempt in a plebiscite last September to replace the dictatorship-era charter.The so-called Constitutional Council that voters are set to elect will work as of June on the new constitution, based on a preliminary draft prepared by a commission of 24 experts that Congress appointed in March.But some of the 15 million eligible voters shrug when asked about the do-over after the failed push last year to rewrite the constitution, which dates back decades to the era of right-wing military dictator Augusto Pinochet.\"I'm a little tired of the polarization,\" said 31-year-old Paz Villafana, who runs a small publishing firm. \"I voted to approve (in September), I wanted a new constitution and to get rid of the dictatorship's constitution, but now I'm not really interested.\"Following Sunday's election, voters will then head to the polls in December to approve or reject the proposed document, widely expected to be more moderate than the first proposal which would have been one of the world's most progressive constitutions.\"If the first process was highly uncertain, this is much more certain ... It is a more supervised process, with monitoring bodies, experts, lawyers, elected representatives,\" said political analyst Kenneth Bunker. He stressed that traditional political forces are now more in control of the process, unlike the failed first attempt.",
        "The new attempt has a shorter time frame. It also includes the expert commission, a technical body acting as arbitrator, and fewer assembly members, equivalent to a third of the dissolved constitutional assembly whose project voters rejected in the plebiscite.The first process was dominated by leftists and independents, while this one is guided by 12 institutional principles that lawmakers agreed to.Public support for the reworked process has waned, after mass protests that started in late 2019 and went on for months provided the political impetus to initiate the push for a constitutional rewrite.The coronavirus pandemic, rising crime, a slowing economy and stubbornly high inflation are more top of mind for most Chileans.President Gabriel Boric, 37, promised ambitious social reforms and rose to power last year on a wave of optimism fueled by hopes over a new progressive constitution.But the former student protest leader has not been as involved in the push for a new overhaul.Nicholas Watson of consultancy Teneo said that three blocs are competing, each one representing different party alliances for the Constitutional Council, in addition to two parties competing under their own banners for votes this Sunday.It seems \"likely that no single bloc or party will win enough seats to independently steer the process without compromise,\" Watson said. (Reporting by Natalia Ramos; Writing by Anthony Esposito; editing by Grant McCool)"
    ]
}