{
    "articleURL": "/wires/pa/article-12057485/Erik-ten-Hag-backs-David-De-Gea-costly-mistake-West-Ham.html",
    "content": [
        "Erik ten Hag threw his backing behind David De Gea despite the slip which loosened Manchester United’s grip on the final Champions League place.",
        "Goalkeeper De Gea is in talks over a new contract at Old Trafford, but he did not exactly enhance his negotiating position after letting let Said Benrahma’s hopeful shot from 20 yards bounce over his glove to condemn United to a 1-0 defeat at West Ham.They now lie just one point ahead of a rapidly advancing Liverpool, albeit with a game in hand, after an eighth defeat on the road this season and a second in four days following the last-gasp loss at Brighton.“Frustrating? Yes, I’ve seen it in the same way. I think we started well, dictated the game, created chances, didn’t take them and then one mistake,” said United boss Ten Hag.",
        "“Twice individual mistakes and you lose games. But it is what it is. Now we have a full week, we have to reset, reload and keep going.“(De Gea) has the most clean sheets in the Premier League, we would not be in this position without him. No concerns. It happens but as a team you have to deal with it, show character and resilience.",
        "“We want him to stay and to extend his contract.”Lukasz Fabianski made late saves from Marcus Rashford and Anthony Martial but Ten Hag’s side offered little in their 57th match of a gruelling season which, as well as Liverpool, might just be catching up with them.",
        " (De Gea) has the most clean sheets in the Premier League, we would not be in this position without him. No concerns  Erik ten Hag  But Ten Hag insisted: “Nothing changed. We could have made it easier with a win. We need three wins from four games, everything is in our hands.“Tiredness is in your head. If you have the willingness you can take it. It’s up to the players and staff to be together, to get the willingness in that we can take it.United’s defeat could prove as costly for the visitors as it was priceless for West Ham, who climbed seven points above the relegation zone and are surely now safe.It was a first victory over his former club for Hammers manager David Moyes since he was in charge at Everton, in August 2012, and a huge boost ahead of this weeks Europa Conference League semi-final against AZ Alkmaar.“It’s a huge step, getting three points is huge against whoever but against Manchester United was massive for us,” said Moyes.“It’s a great result going into a European semi-final and we’ll take a lot of confidence from it. We have another big challenge and we are looking forward to it.”Hammers skipper Declan Rice put in another terrific display, showing just why the likes of United, Arsenal and Chelsea are constantly being linked with him this summer.",
        "“He was outstanding tonight. He’s great across the ground, very quick. I’m pleased, but not surprised,” added Moyes.“That’s why he’s probably the best England midfield player around – and he’s going to be extremely expensive if anyone comes in for him.”"
    ]
}