{
    "articleURL": "/news/article-12059335/British-teenager-16-murdered-dumped-forest-police-search-missing-girlfriend.html",
    "content": [
        "British teenager was found dead after going out with a girl on a motorbikeThai police have said Ben may have been the victim of a phone robbery A British teenager has been found dead with head wounds in a forest in Thailand - and police are now searching for his missing girlfriend. ",
        "Woramet Ben Taota, 16, went for a motorcycle ride with Yam, also 16, in his hometown of Lampang on Saturday but did not return home.Local police said they received a report on Sunday morning that Ben had been found dead in a grove in the Ban Than district, with injuries resembling blunt force.Officers reported that the teenager's phone and cash were missing from his shoulder bag, and suggested he might have been robbed.They believe he was killed elsewhere and left in the woods as there were no signs of struggle. His partner has not been found as of today. ",
        "Thai media reported that Ben's body was found by a garbage collector who was at work on Sunday morning.Police Colonel Sittisak Singtongla, superintendent of the Mae Tha Police, said: 'The station received a notification at 10.15am that a deceased person was found in the undergrowth.'Investigative teams from Mae Tha Police Station and Lampang provincial investigation team, along with forensics officers, forensic medicine doctors and staff from Tanna Krua Forest Rescue attended the scene.Thai media reported that the teenager was found with his back against a tree wearing a black long sleeve T-shirt and jeans.Police said that the body has been taken to hospital for an autopsy.",
        "'We are currently tracking down individuals close to the victim, including his female companion. She is a key figure in this case since she is the last person to see him alive.'Ben's mother, Ooy Taota, told police that her son had said goodbye to her on Saturday evening and said he was 'going to work with friends' but he did not give any more details to her.With the news of his death, friends took to Facebook to leave tributes for Taota. The parents of the missing girl were said to have 'pleaded' with the media to help find their daughter. ",
        "The police said they are not ruling out any motives, attributing the killing to a possible love affair, a personal conflict, or a work dispute.Police Colonel Sittisak added: 'We have not yet finalised the issue. 'It is still unclear whether it was a robbery, because the phone and cash of the deceased were not found, but we still cannot rule out other issues.'"
    ]
}