{
    "articleURL": "/news/article-12054347/Watch-highlights-historic-coronation-viewed-millions-world.html",
    "content": [
        "Watch the highlights from the King and Queen's coronation from earlier today CORONATION LIVEBLOG: Click here to follow live updates throughout today King Charles and Queen Camilla were crowned today, as millions of people watched the two-hour ceremony from all corners of the world.",
        "Taking place at Westminster Abbey, the monarch was surrounded by 2,300 guests, including other members of the firm, celebrities and hard-working Britons from bus drivers to NHS nurses.Two million people took to the streets of a grey and rainy London to witness the first coronation in Britain since 1953.A further 100 million people watched the ceremony on televisions in their homes and pubs across the globe, from London to New York and Sydney.For those who missed the ceremony, MailOnline has compiled a highlights video of all the key moments.",
        "The Christian ceremony, that dates back 1,000 years, earlier today revealed a glorious display of pageantry.Throughout the ceremony, which marked the 62nd coronation in history, several poignant moments took place including Prince William kissing his father, as his estranged brother Prince Harry sat at a distance on the third row.The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father.He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So, help me God.'He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son and said 'amen' and 'thank you William'.",
        "Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head.King Charles had been heir apparent for just over 70 years, fulfilling his destiny to rule as monarch following the death of his mother, Queen Elizabeth II, last September after a 70-year reign.Minutes later his wife of 18 years, Camilla, was crowned.",
        "The Queen was then officially enthroned while Andrew Lloyd-Webber's coronation anthem was sung.The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.Following the service, the newly crowned King and Queen appeared on the balcony of Buckingham Palace looking down on hundreds of adoring royal fans.A select group of senior royals, including the Prince and Princess of Wales as well as their children, joined them at their side.The royals waved to the huge crowds before an RAF fly-past took place.The public started chanting 'God Save The King' and gave three cheers as the royals emerged before a resounding cheer when the King and Queen waved to members of the public gathered in the showers. They also sang the national anthem with gusto."
    ]
}