{
    "articleURL": "/tvshowbiz/article-12058667/Delta-Goodrem-smiles-Sydney-Airport.html",
    "content": [
        "Delta Goodrem looked to be in good spirits when she was spotted for the first time after gave her the greenlight to resume touring.",
        "The singer, 38, looked effortlessly stylish as she walked alongside her beau Matt Copley at Sydney Airport on Monday.She donned a turquoise coloured suit for the occasion along with a plain white T-shirt.The award winning singer accessorised her look wearing a black trench coat and oversized round sunglasses.Matt meanwhile showed off his casual rocker style in a white crew neck T-shirt which he teamed up with navy coloured skinny leg jeans and black boots.",
        "The couple appeared loved-up and were seen pushing Delta's Louis Vuitton suitcase and duffle bag as they were seen boarding a flight.Goodrem's recent Instagram post shared her excitement about resuming her tour and her gratitude for her fans' support during her recovery period.In the same Instagram post, Goodrem announced that her Uluru and Maldives concerts are still scheduled for this month, while her UK &amp; Europe tour remains on track for later this year.",
        "'I got the green light to sing!' she said with excitement.'I know you all have been waiting for an update and I am so appreciative of all your posts checking in.'My voice is feeling so much better and is finally coming back to me!' Delta told fans that the Innocent Eyes tour is '100% going ahead,' with the singer promising fans an unforgettable anniversary celebration.",
        "It comes after Delta was forced to postpone the UK and European dates of her Hearts on the Run tour because she needed to rest her voice.Delta announced her 'difficult' decision in March, after she 'overused' her vocal cords and found herself with 'no voice for extended periods of time'.Delta said she was devastated to let down her British and European fans, but promised she would see them again soon when the concerts are rescheduled.",
        "'It hurts my heart to move the shows back, but please know I love you all and your support means the world to me,' she said in a statement on Instagram.She went on to explain she 'overextended' herself in recent months by taking on 'a number of projects', and doctors have now insisted she needs proper vocal rest.The rescheduled dates will be announced as soon as possible, and all tickets will remain valid. "
    ]
}