{
    "articleURL": "/sport/rugbyunion/article-12045545/Israel-Folau-set-feature-star-World-XV-against-Barbarians-Twickenham.html",
    "content": [
        "The two sides will be coached by Eddie Jones and Steve Hansen respectivelyAfter winning 73 caps for Australia, Folau's Wallabies contract was terminatedThe ex-rugby league star was born in Australia but also qualifies for Tonga Controversial former Australia star and now Tonga back Israel Folau is the latest international poised to play in the Barbarians-World XV match at Twickenham on May 28.",
        "The clash between the two sides - who will be coached by Eddie Jones and Steve Hansen respectively - has already attracted some of rugby's biggest names.Folau's likely inclusion in double World Cup winner Hansen's World XV side will see him add to a mouth-watering back-line which already includes his Tonga team-mate Charles Piutau, Fiji's Semi Radradra, All Black Ngani Laumape and Australia's Marika Koroibete.After winning 73 caps for Australia, Folau's Wallabies contract was terminated in 2019 after he posted on social media that homosexuals should go to hell unless they repent for their sins.The ex-rugby league star, now 34, was born in Australia but also qualifies for Tonga and in 2022 represented the Pacific Island nation for the first time after benefitting from World Rugby's change in eligibility rules which allow a player to switch nation after a three-year standdown period.",
        "Folau, who is currently playing his club rugby in Japan after a brief switch back to league, remains a hugely dangerous player. He is set to feature for Tonga at the World Cup later this year.Nick Phipps, Joe Launchbury, Danilo Fischetti, Simone Ferrari, Lorenzo Cannone, Rhys Patchell, Adam Hastings, Elliot Dee and Bill Mata will be his World XV team-mates later this month.Former England head coach Jones, now in charge of Australia, will make his first return to Twickenham since being sacked by the RFU in December.",
        "He is ready to include England caps Danny Care, Dan Cole, Joe Marler, Jonny May, Jack Nowell and Sam Simmonds in his side along with South African giant Andre Esterhuizen, Wales trio Alun Wyn Jones, Rhys Webb and Taulupe Faletau, and former All Blacks Aaron Cruden and Steven Luatua.The only thing precluding prop Cole's involvement would be his Leicester side possibly making the Premiership final which takes place at Twickenham the day before the Barbarians-World XV tie. Leicester will face a trip to Sale in the Premiership semi-finals next Sunday.'These sorts of games are always great occasions to be a part of. It's about the chance to take to the field with other players you never would get the chance to normally,' said Piutau, formerly of New Zealand who like Folau has switched allegiance to Tonga.'It's nice to get to know guys in that aspect. To line up in a match between the World XV and the Barbarians means it should be a cracking game. I'm looking forward to it.'Hopefully it will be about expressing ourselves. There will be a lot of talent involved by the looks of it. I've played for the Barbarians twice. ",
        "'I had the opportunity to choose one or the other this time but I think it's quite rare to be able to play for a World XV so it will be nice to experience that.",
        "'I had the option of either one. I've never played for a World XV before so I went with that one.'This time for my name to be considered and to get an invite for a World XV is definitely special.'I think it's one of those things I'll look back on when my career is over and think it was awesome I got to do that.'"
    ]
}