{
    "articleURL": "/sport/football/article-12043495/Manchester-City-3-0-West-Ham-Pep-Guardiolas-table.html",
    "content": [
        "Manchester City returned to the top of the Premier League table after a confident 3-0 win over West Ham Nathan Ake headed City in front at start of the second half to help them go a point clear of ArsenalErling Haaland scored a record 35th Premier League goal of the season before Phil Foden also struck Erling Haaland's team-mates formed a guard of honour as the Etihad celebrated to the sound of No Limit. There really isn’t where this striker is concerned.",
        "The Norwegian rubbed his hands together, then set off down the tunnel of love. What do you give the man who has everything? A good slap, that’s what.Manchester City players took it in turns to take aim at Haaland as he ran through them and then lapped up the adulation.A 35th Premier League goal of the season puts Haaland out on his own, ahead of Alan Shearer and Andrew Cole, whose joint record of 34 has stood since the mid-1990s.It is an incredible feat with five league games of the season to go. The next target is the 37 top-flight goals scored by Ron Davies for Southampton in 1967 and who would bet against Haaland?",
        "His 51st in all competitions also sealed City’s ninth straight league win as they moved back to the top of the table last night. Both felt equally inevitable.It arrived in the 70th minute after West Ham had lost the ball in the centre circle. It was played to Jack Grealish who slipped a pass into open space and history beckoned for Haaland.He still had a difficult finish, but did we doubt him? Of course not.Haaland waited for the right moment and dinked the ball over Lukasz Fabianski with his left foot as the West Ham goalkeeper raced to the edge of his box. The Pole got a hand to the ball but could not stop it dropping into the net as the Hammers went 2-0 down.",
        "MANCHESTER CITY (3-2-4-1): Ortega 6.5; Walker 6.5, Dias 7, Ake 7.5 (Akanji 77min); Stones 7, Rodri 6.5 (Phillips 90); Mahrez 7, Alvarez 6 (Foden 77), Silva 6.5, Grealish 8; Haaland 7.Scorers: Ake 50, Haaland 70, Foden 85.Manager: Pep Guardiola 7.5.WEST HAM UNITED (4-2-3-1): Fabianski 6; Coufal 5.5 (Johnson 62, 6), Kehrer 7, Ogbonna 6, Cresswell 6.5; Downes 6, Paqueta 6; Bowen 7 (Benrahma 79), Fornals 7, Emerson 6.5; Antonio 6.5 (Ings 67, 6).Booked: Downes.Manager: David Moyes 6.Referee: John Brooks 7.Attendance: 53,305.",
        "Until that point, neither City nor Haaland had played particularly well. Average at Fulham on Sunday, Pep Guardiola’s side were little better for long periods here.But they don’t have to be. On the 25th anniversary of the club’s relegation to the third tier, City moved ominously within sight of a fifth Premier League title in the last six years.Nathan Ake’s header early in the second half put them ahead before Phil Foden’s late volley brought up the 1,000th goal under Guardiola.Arsenal have given it their best, but the depressing truth for the Gunners is that City have course and distance in these title races. Of Guardiola’s four successes in the last five years, two have come over Manchester United with games to spare and two over Liverpool on the final day, including that incredible comeback against Aston Villa here a year ago.",
        "City find ways to win whatever the circumstances and the scenario now could hardly look more favourable.They face Leeds at the Etihad on Saturday, when Guardiola will have a chance to put Sam Allardyce’s brash claims about him at his unveiling to the test.City should be four points clear at the top by the time Arsenal face a precarious trip to Newcastle on Sunday.Any hope that West Ham could do Arsenal a favour receded before kick-off when it emerged a sickness bug had forced manager David Moyes to send Declan Rice, Tomas Soucek and Nayef Aguerd home. Still, Arsenal could have no complaints about the way Moyes’s side acquitted themselves here. In the first half, they frustrated City with a high press.Fabianski only had to make one save of note, from Riyad Mahrez, and Haaland’s only threat was a far-post header that flew wide.The champions lacked any real fluency. A slip here, a misplaced pass there. ‘Come on, City,’ urged the Etihad impatiently.",
        "Guardiola, dressed all in black, wandered across his technical area, arms outstretched, muttering to himself.It took West Ham’s best chance of the half to rouse City from their slumber. Jarrod Bowen got the wrong side of Ake at a throw-in but could not beat goalkeeper Stefan Ortega, chosen ahead of Ederson, from a tight angle.",
        "City countered immediately. Grealish drilled a shot against Fabianski’s near post and, two minutes later, Rodri hit the other upright, sending the ball spinning across the goalline.Guardiola’s nerves, and those of an increasingly restless Etihad, were settled within five minutes of the restart as City took the lead.",
        "It began with yet another foul on Grealish, this one earning Flynn Downes a booking. Mahrez glided a free kick towards the back post and West Ham were found wanting for the first time. Angelo Ogbonna got under the ball, leaving Ake with a free header at the back post which he rammed past Fabianski.Guardiola was still sufficiently worried to turn to the fans in the main stand at one point and demand more support.Haaland made sure he would get the headlines again with his record-breaking effort and Foden came on to score the third when his deflected volley flew in off the unfortunate Emerson.It is hard to see City relinquishing their advantage now. Moyes, meanwhile, will hope his team have enough in the tank to stay up. They played very well here in the circumstances.All that was left was for the City players to line up and honour Haaland’s achievement. More records will surely follow and so too, you suspect, will another Premier League title for Guardiola and his men."
    ]
}