{
    "articleURL": "/news/article-12058277/Items-Gettys-Greco-Roman-California-mansion-sale.html",
    "content": [
        "More than 400 pieces of art from a house owned by the Gettys will go on saleThe Temple of Wings was bought in 1994 and filled items the turn of the 20th CIt's the family's second major auction in less than a year - the last raised $150M Art and furniture filling a California estate owned by the Gettys will be sold off in the family's second major auction in less than a year. ",
        "Over 400 pieces from a property in San Francisco, owned by Ann and Gordon Getty, will be auctioned off by auction house Christies this June.The home in Berkeley Hills, known as the Temple of Wings, was built in a Greco-Roman style and filled with items collected by Ann Getty, who died in 2020 at 79.Author, interior designer and philanthropist Ann was married to Gordon Getty, 89, a classical music composer and the son of oil tycoon J. Paul Getty. The pair bought the Temple of Wings in 1994, and over the next decades Ann filled it with various types of art from the late 19th and early 20th centuries.The upcoming auction comes after $150 million was raised in the sale of some of Ann's other decorative objects in October.",
        "Before the first auction Gordon told ABC7 News: 'There's no reason to me having all that stuff.'About everything sellable is going to be sold. I don't think I reserved a darn thing for sentimental reasons.' Including among the items for sale in the upcoming auction is an oil painting from 1895, which according to Christies expected to fetch between $2.5million and $3.5million.A Coign of Vantage, by Dutch painter Sir Lawrence Alma-Tadema, depicts three aristocratic women peering over a balcony of a Roman villa as ships come and go from a harbor below.",
        "Maria Santangelo, the couple's chief curator, told the San Francisco Chronicle it was one of the first pieces purchased for the home and it set the theme for everything that followed.'It echoes the architect's conception of the house as a Roman villa,' said Santangelo.'You've got this vertiginous drop into the Berkeley Hills overlooking the bay, (and the figures in the painting) are overlooking the bay. You've got these beautiful, toga-clad models in the picture, which also reference some of the earlier history of this house,' whose original owners taught modern dance there.'The house was built in 1914 as the house and dance studio of Florence Treadwell Boynton.",
        "A pair of paintings also due to go up for sale are by a friend of Alma-Tadema, British Victorian painter Frederic Leighton.His oil painting, The Bath of Psyche, was first exhibited in 1890 and is estimated to go for between $300,000 and $500,000.",
        "Also due to go on sale are two other paintings by the artist, A Dancing Girl with Cymbals in a Green Robe and A Dancing Girl with Cymbals in a White Robe, are oil on canvas with the gold leaf background. The two pieces are expected to sell for between $100,000 and $200,000 each. They appear in a study at the Temple of Wings, directly in front of a ornate wooden desk adorned with various stained glass lamps.",
        "One especially striking lamp to go on sale is a 'Wisteria' table lamp from 1903. It is comprised of thousands of hand-selected pieces of purple, green and blue glass, and reminiscent of actual wisteria on the outside of Temple of Wings.It is just one of many stained glass lamps, each of which has an estimated sale price starting at more than $300,000. 'The house is a fantasy of a specific moment in time, with many different artistic movements all united in one space,' said Jonathan Rendell, Deputy Chairman at Christie's Americas, in a web page advertising the upcoming auction.'It's taking us to a world in which art and music and literature and painting are elevated as a way of life.' He told the San Francisco Chronicle that it was a blend of American and European art. '[Ann Getty] filled it with her reflections on late 19th-century culture, and did an unusual thing in that she fused European culture of the latter half of the 19th century with American culture,' Rendell told the newspaper.He spoke of the house in poetic terms, describing Temple of Wings not as a home but as a piece of music.",
        "'It's an extraordinary piece of music that you wander through. You don't run through Temple of Wings, you meander, you experience it, you look out, you smell the gardens of the Berkeley Hills and appreciate its unique beauty,' he said.",
        "Other works to feature in the auction include those designed by A.W.N. Pugin, the figurehead of design reform and the revival of the Gothic in Great Britain.A set of nine 'jewel' stained glass roundels created by the English architect and designer William Burges are anticipated to sell for around $30,000.Works by other Victorian architect-designers like Bruce Talbert and Charles Robert Ashbee also make up some of the lots.Santangelo told the Chronicle there are currently no plans to sell the Temple of Wings house itself."
    ]
}