{
    "articleURL": "/property/article-12051119/Four-luxury-houses-sale-near-Windsor-Castle.html",
    "content": [
        "We take a look at four luxury £1m-plus properties for sale near Windsor CastleWindsor Castle is an official residence of the monarch, now King Charles IIIWindsor's appeal has easy access to the capital, Heathrow airport and the riverWindsor Castle is the longest-occupied palace in Europe and has been used by the reigning monarch since Henry I (who reigned 1100 to 1135).",
        "Having been Queen Elizabeth II's favourite weekend home, it is now an official residence of King Charles III - with his eldest son having recently moved nearby into Adelaide Cottage.With these royal connections in mind, we take a look inside four properties up for grabs near the castle.",
        "Windsor's appeal is not only its royal history as it has easy access to the capital - less than an hour by public transport to London - and Heathrow Airport.It also has good schools, both private and state. Some overseas parents with children at nearby Eton College often buy property in Windsor for when they visit.",
        "Daniel Copley, of Zoopla, said: 'If you fancy having some regal neighbours, there are currently some beautiful properties for sale in Windsor, including a Grade II listed apartment and a spacious townhouse with a garden which provides direct access to the Long Walk. 'Windsor itself also has a lot to offer residents including a buzzing town centre with plenty of shops and restaurants, great transport links to London and excellent schools.' Four homes for sale near Windsor Castle…1. Five-bed house, Windsor, £1.15m",
        "This semi-detached Victorian house is in Windsor town centre and has a self-contained one-bedroom apartment in the basement and permit parking.It has an asking price of £1.15million and the sale is being handled by Lawsons Residential estate agents.",
        "2. Three-bed house, Windsor, £1.2m",
        "This three-bedroom townhouse is spread across three floors and has an abundance of period features.It is on the market for £1.2million and is being sold by Hardings estate agents.3. Five-bed maisonette, Eton, £1,195,000",
        "This five-bedroom leasehold property is in Eton, a town that is on the opposite bank of the River Thames from Windsor.The Grade II listed building is on the market for £1,195,000 and is being sold by Romans estate agents.4. Six-bed house, Old Windsor, £1.45m",
        "This detached house is in a private development in Old Windsor, just a short walk to the river and has a one-bedroom annexe.Old Windsor is part of the area where singer Sir Elton John has lived for more than 40 years.The six-bedroom property is being sold by Hardings estate agent and has an asking price of £1.45million."
    ]
}