{
    "articleURL": "/wires/reuters/article-12039453/Cineworld-gets-US-court-approval-raise-2-26-bln-bankruptcy.html",
    "content": [
        "By Dietrich Knauth",
        "May 2 (Reuters) - Bankrupt movie theater chain Cineworld received U.S. court approval on Tuesday to raise $2.26 billion as part of its exit from bankruptcy, after reaching a settlement with a minority faction of lenders that had opposed parts of the exit financing.Cineworld is aiming to emerge from Chapter 11 bankruptcy in the first half of 2023, with a proposal to cut $4.53 billion in debt, wipe out existing shareholders and transfer ownership of the company to its lenders.U.S. Bankruptcy Judge Marvin Isgur at a hearing in Houston approved Cineworld's plan to fund its post-bankruptcy operations with a new $1.46 billion loan and the sale of $800 million in new equity shares. Cineworld is scheduled to seek final court approval of its bankruptcy restructuring on June 12.Isgur approved the financing after Cineworld announced a last-minute settlement that resolved objections raised by minority lenders including Jefferies Leveraged Credit, Glendon Capital Management and Greywolf Capital.\"I came out here not knowing whether we were going to have a fight or a deal,\" Isgur said.The settlement resolved a dispute over the amount of new stock that Cineworld's lenders would receive for backstopping the exit financing.Under Cineworld's earlier proposal, a majority faction of lenders, which includes Blackstone Alternative Credit Advisors, Carlyle Investment Management and Sixth Street Partners, would have received 27% of the company's new equity shares simply for agreeing to support the exit financing package that they themselves engineered, according to the objecting lenders.",
        "The settlement reduces the backstop premium to 11% of the new equity shares, providing the minority lenders with about $38.5 million in additional value, Cineworld attorney Joshua Sussberg said in court. The new agreement is now supported by over 99% of Cineworld's lenders, Sussberg added.Cineworld filed for U.S. bankruptcy protection in September to try to restructure its debt. It attributed its financial troubles to the lingering impacts of the COVID-19 pandemic, which halted production of major blockbusters, forced theaters to temporarily close, and shifted consumer habits toward watching movies via online streaming platforms. It initially sought to sell some or all of its business, but pivoted to a debt restructuring plan after failing to find a buyer. (Reporting by Dietrich Knauth, Editing by Alexia Garamfalvi and David Gregorio)"
    ]
}