{
    "articleURL": "/news/article-12061475/DAILY-MAIL-COMMENT-Save-pharmacies-help-save-NHS.html",
    "content": [
        "The announcement of an unprecedented expansion in healthcare services provided by high street pharmacies represents the kind of fresh, radical thinking the NHS needs to secure its long-term survival.",
        "For the first time, local chemists will be allowed to write prescriptions for seven common conditions – including earache, sore throats and urinary tract infections – without reference to a GP.Almost half a million women will be able to access oral contraception without having to speak to a practice nurse and blood pressure checks will also be provided.In all, the changes are expected to free up 15 million GP appointments for those with more serious conditions.As well as cutting waiting times at GP surgeries, this should also relieve pressure on hospital A&amp;E departments, where many patients go by default because they are unable to see their family doctor.",
        "As the son of a community pharmacist and a GP, Rishi Sunak knows exactly how crucial this reform can be to fulfilling his pledge to cut NHS waiting lists.But there is a massive hitch. Owing to soaring wholesale medicine prices, the spike in energy and staffing costs, chronic government underfunding and late repayments, community pharmacies are engaged in a desperate fight for survival.Nearly 700 closed between 2015 and 2022. And with nine out of ten making a loss on dispensing medicines to NHS patients, the toll will only rise.The Mail has campaigned passionately for government action to save our pharmacies before it's too late. Contracts, unchanged since 2015, must be updated to reflect rocketing costs and reimbursement urgently speeded up.",
        "Real-terms funding levels have fallen by a staggering 30 per cent in those eight years. It is an unsustainable situation. Local chemists provide a community lifeline – somewhere the elderly and unwell can go without an appointment and confide their problems to a sympathetic ear.They are only too willing to shoulder more of the burden placed on the NHS but they simply can't do it without the necessary resources. Mr Sunak should know that better than anyone.If he wants these vital reforms to succeed, he must pay pharmacists a fair price for their efforts.Labour's woke gambleHaving struggled to define what a woman is, Sir Keir Starmer now claims voters don't much care about the creeping normalisation of 'woke' attitudes to such things as gender, race and British history.He says the Tories have made a big strategic blunder in believing that 'culture wars' are more salient to voters than the cost of living crisis and the NHS.It's true, of course, that with inflation still above 10 per cent and the NHS dogged by strikes, record waiting lists and generally poor performance, these are the things that need fixing most urgently.",
        "But the Mail believes Sir Keir is wrong to think voters are indifferent to the ascendancy of wokery. Assaults on free speech, trans-extremism, cancel culture and the trashing of our heritage matter.",
        "Sir Keir may not know what defines a woman but the vast majority of people do. And for all its faults, most of us regard Britain's remarkable island story with pride, not shame.Taking this silent majority for granted may be the Labour leader's biggest mistake.After so many years living in the shadow of his extraordinary mother, this was the weekend King Charles III came into his own. Following a triumphant Coronation, he and Queen Camilla enjoyed waves of public affection on The Mall, at the Windsor Castle concert and beyond. The world's longest-serving apprentice has at last become the master."
    ]
}