{
    "articleURL": "/wires/pa/article-12060195/Luton-prepare-play-offs-draw-against-Hull.html",
    "content": [
        "Luton and Hull played out a goalless draw in their final game of the Sky Bet Championship season at Kenilworth Road.",
        "With the Hatters having already qualified for the play-offs in third place, and the Tigers safe in mid-table, Luton boss Rob Edwards made eight changes.It was the visitors who had the first openings, as after completely dominating possession in the early stages, Adama Traore’s two efforts were deflected behind for corners.Hull then had a glorious opportunity when Sonny Bradley’s weak back header was picked up by Allahyar Sayyadmanesh, whose effort was deflected onto the post by the recovering Luton captain after he got back in the nick of time.Town had their first opportunity of note on 20 minutes, Luke Freeman’s attempt taking a deflection off a defender and bouncing up for ex-Hatters loanee Matt Ingram to gather comfortably.With half-time looming, Luton had their best chance of the half when Jordan Clark and Alfie Doughty combined for the latter to send in a terrific cross that was met by Joe Taylor, his header repelled by a terrific save from Ingram.",
        "Play quickly transferred up the other end, as Traore had a crack from a 25-yard free-kick which was excellently palmed away by the recalled James Shea.After the break, Tigers captain Lewis Coyle tried his luck for City, his ambitious half-volley flying well wide from the edge of the box.",
        "Luton substitute Henri Lansbury fired over the top from range, before City had a chance to break the deadlock, Sayyadmanesh slicing off target after the ball dropped to him invitingly in the box.With Town changing five of their players during the second period, one of the substitutes, Luke Berry, then almost scored the goal of the season.The midfielder burst away to latch on to a clearance, trying to beat Ingram from just inside the City half, his effort only narrowly failing to come down in time.Freeman tried to earn his side a winner with five minutes to go, shanking over the top from 25 yards.Most of the excitement came from elsewhere though, with Millwall throwing away a 3-1 lead to lose 4-3 to Blackburn and Sunderland triumphing 3-0 at Preston to ensure it was the Black Cats who Luton will take on in the play-offs starting at the weekend."
    ]
}