{
    "articleURL": "/wires/ap/article-12051983/Commanders-releasing-oft-injured-center-Roullier.html",
    "content": [
        "Chase Roullier's time in Washington is over after a six-year stretch that included him becoming the team's starting center and signing a lucrative extension before injuries derailed his career.",
        "The Commanders announced Friday they released Roullier with a post-June 1 designation.Releasing Roullier after June 1 for salary cap reasons allows the team to save $8.37 million next season, with $4 million of dead money, according to the site Over The Cap, which tracks NFL salaries.Even though coach Ron Rivera last week said it was \"too early\" to discuss the future of Roullier and other veteran players given draft picks and free agent signings, those additions foreshadowed the end for the 29-year-old in burgundy and gold.The Commanders signed Nick Gates away from the New York Giants to be Roullier's replacement and drafted Arkansas' Ricky Stromberg in the third round to be a potential long-term solution in the middle of the offensive line.Roullier looked like an impressive draft find before being sidelined by injuries. After getting picked in the sixth round in 2017, the Wyoming product quickly became Washington's starting center.",
        "He signed a four-year extension worth just over $40 million in January 2021 and has played 10 games since, first because of a broken left fibula and then a right knee injury. Roullier opened training camp last year on the physically unable to perform list and came back to start the first two games of the regular season before going down again and making the Commanders turn to a rotating cast of characters at center.",
        "After a draft in which Washington bolstered depth on the offensive line and in the secondary, the next question is the status of 28-year-old cornerback Kendall Fuller. If Fuller is released in the same fashion as Roullier, it would save the team $8.5 million against the cap but also at the cost of losing a Super Bowl champion who has been durable and played all 17 games last season.___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}