{
    "articleURL": "/femail/article-12056237/Body-language-expert-reveals-royals-feeling-Coronation.html",
    "content": [
        "Body language experts Carole Railton and Judi James have given their verdictsREAD MORE: King Charles Coronation LIVE - follow the latest updatesAll eyes were on the members of the British Royal Family yesterday as they came together in celebration to support King Charles on the day of his coronation.",
        "The monarch became the 40th reigning sovereign to be crowned at Westminster Abbey, in a lavish ceremony in front of some 2,000 guests.The historic crowning, watched around the globe, was a fulfilment of the King's destiny as it followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.Minutes later, the Queen was also officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.As the royals geared up for one of the biggest days of their lives, body language experts picked up on some of the telling gestures which may have given a glimpse into how they were really feeling as the eyes of the world were upon them.",
        "Body language expert Carole Railton told FEMAIL how the movements of the royals indicated their true feelings throughout the day, particularly in relation to each other.Meanwhile another expert, Judi James, took a look at the Duke of Sussex in particular and picked up on how he may have been feeling as he attended the King's coronation in a whistlestop tour of the UK that lasted just 28 hours before he flew back to California to celebrate Prince Archie's fourth birthday. Here, FEMAIL takes a look at how the royals fared under pressure on the historic day of King Charles's coronation - and how their deepening rifts may have been on show. ",
        "King Charles Carole claimed that, during the King's entrance into the Abbey, he appeared to take a deep breath and readjusted his body and position halfway through his walk, which shows he has good composure and was contemplative during the momentous day.As the King and Queen took their place on their thrones, they seemed to be structured and aware of the 'seriousness of their position', which suggested that they intend to do a good job in their roles as Heads of State, according to Carole.",
        "While sat in the throne, the King began leaning slightly forward, which could have meant that he was thinking a great deal to himself as he stepped into his role.She added that, at one point during the ceremony, Charles appeared overwhelmed and was experiencing 'lots' of emotions.Carole explained: 'When William was in front of him he looked emotional to me.'She added: 'He is blinking a lot, showing a bit of stress for sure... He also appears tired and the previous deep breath gives notice that he is refreshing his self getting back in step.'",
        "She added: 'He sat on the edge of his seat, showing that he is exciting about what is going on even thrilled.'The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father.",
        "He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen'.Queen Camilla In leading the procession, Carole said the Queen appeared calm and in control, presenting herself as a strong figure as the ceremony proceeded.While Queen Camilla was 'initially nervous' as she was crowned during the Coronation at Westminster Abbey, the body language expert told FEMAIL Camilla was 'comfortable'.She also appeared to be 'without airs and graces', saying: 'Camilla obviously had trouble with the crown balancing and being in place and tried to adjust it herself. ",
        "'She appears comfortable and in control - relaxed and sure of herself. Smiling and with her hand and arms relaxed, she became graceful and in control following some initial nervousness,' Carole claimed.During the historic ceremony, the Queen looked as though she was taking in her surroundings as she looked around, which according to the expert, showed she was relaxed and posed - ready to take on the day.She continued: 'It struck me how in control she was - she was ready for what was happening and in a subtle way there were no airs and graces.",
        "'She appeared engaged and strong. Obviously excited and engaged in what was happening and there were a couple of times she looked anticipatingly at her partner to comfort him, rather than seek for herself.'",
        "Prince HarryIn comparison to the working royals, Prince Harry was 'out of step with the others around him' as he twisted and bent his body while arriving at the service and his walk into the ceremony was a 'sure sign he was on his own', Carole claimed.The expert added that his hand holding the edge of his jacket might have signalled the need for a 'small hug' to make himself feel better in what was likely to be a tense reunion with his family. ",
        "Carole also remarked that the twisting and turning of Harry’s body would indicate discomfort, which is an 'unusual pose' which we 'do not normally see this with the royals'.Meanwhile, body language expert Judi James told The Sun that Harry levelled his brother William with a 'severe side-eye glance'. She said: 'William is clearly not about to look back here and Harry’s severe side-eye glance suggests he’s sneaking this thunderous look almost unintentionally.'When we tell ourselves not to do something the brain only tends to hear the suggestion without processing the 'don’t' command, suggesting the more Harry was telling himself not to look across at his brother the more he couldn’t stop.'",
        "He was seated between Princess Eugenie's husband Jack Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for ten years.William and Kate were in the front row at the abbey for the historic ceremony, with their children Prince George and Princess Charlotte.Eagle-eyed royal fans also speculated that Prince Harry may have stopped singing the National Anthem as his father passed him following his Coronation.Television footage of the Duke of Sussex, whose face was partially obscured by the Princess Royal's military hat, appeared to show him break off from the National Anthem as his father's Coronation procession exited Westminster Abbey.Kate Middleton While the Princess of Wales was the picture of composure during yesterday's historic event, she appeared 'stressed and concerned' at times during her Buckingham Palace walkabout on Friday.However, she 'took control' of her last-minute nerves with one gesture, the body language expert claimed.While she appeared in high spirits as she shook hands and exchanged pleasantries with fans, expert Carole Railton said Kate showed some key signs which hinted at her underlying nerves.",
        "As Kate approached the crowds with Prince William, she appeared 'relaxed in her moves' at the very beginning. But as time went on, Carole said there were some subtle shifts in the Princess' demeanor.",
        "She explained: 'Kate's shoulders are slightly raised [as she spoke with members of the public]. This is an indicator of stress or tension.'What's more, Carole also highlighted the 'slight stiffness' to Kate's posture.The expert said: 'This indicates there is some concern about what she is doing.'Her head is still slightly tilted forward even when she is at the same level as the people she is interacting with.'Again, this situation shows she is still not as comfortable as she would like to be as she does not have a completely straight back.'",
        "Highlighting another sign of tension, the expert said: 'Her smile is held very tightly. 'When you smile naturally, your teeth aren't touching in this way.'As Kate tried to shake hands and make eye contact with each person in the group, Carole noted that Princess' decision to 'move quickly' suggests she was in a 'stressful situation'.She said: 'Her voice was a little higher pitched than normal which indicates nerves and stress in a body.'That said, the expert said Kate did settle into the overwhelming task and used one move in particular to regain 'control'.By stretching out her arm and putting her hands on the shoulders of fans - which is rather untypical for a royal - Kate guided those around her and took control of the encounters.Carole added: 'Although it is seen by most people as a comfort pose, you are in fact controlling how the other person moves and where to, or getting them to stay in the position they are in. 'As such, Carole says Kate appeared calmer as she worked her way through the crowds.Carole said: 'Kate got more relaxed as the day went on. The posed smile went and she became more relaxed and genuine with her contact with the public.'"
    ]
}