{
    "articleURL": "/wires/ap/article-12038015/Column-Once-No-12-Berger-starting-issues.html",
    "content": [
        "Daniel Berger spent the afternoon on his boat in calm Florida waters, an ideal location for anyone except a guy who misses green turf under his feet and a golf club in his hand.",
        "Tuesday marked the 319th day since Berger shot 75 in the second round of the U.S. Open at Brookline in June to miss the cut by two shots. That was his last tournament. He's still not sure when the next one will be.Pain in his lower back, which first surfaced after a long post-Ryder Cup break in 2021, reached a point where he needed ice baths before he could play. It hurt just to sit in the car on the way to the course.Relief, finally, is on the way, thanks in part to a tip from Luke Donald.\"That was the worst six months of my life,\" Berger said Monday evening. \"I've had a pretty easy life. I play golf for a living - it's not that stressful. But there was a point that I would have given up golf for the rest of my life not to feel like that.\"Berger turned 30 a month ago with little fanfare because he has become a forgotten figure. Golf can be a lonely sport when the game is not going well. It's even lonelier when you're not playing at all. His only real contact with the PGA Tour was Commissioner Jay Monahan calling a few times to check on him.",
        "Berger, full of energy and self-belief, won the last hole of the last singles match at Whistling Straits to beat Matt Fitzpatrick and make the Americans the first team to register 19 points against Europe.Emotionally and physically drained, he took off the rest of 2021 except for an appearance in the Bahamas in December. When he showed up for the Sentry Tournament of Champions, something didn't feel right with his back.\"I didn't do as much as I should have in terms of conditioning and working out, and when I showed up in Hawaii my back was bothering me,\" Berger said. \"I've never had a back problem in my life.\"He shot 25-under par to tie for fifth at Kapalua, then took two weeks off. That didn't help. His back felt just as bad at Torrey Pines. It reached a point where he withdrew from his title defense at Pebble Beach and skipped the rest of the West Coast.And then at the Honda Classic, he lost a five-shot lead in the final round.\"In retrospect, that was the wrong decision. I kept playing through it,\" Berger said. \"It got to the point right around Augusta where I couldn't sit down, I couldn't do normal activities, I couldn't play tennis. I need to see someone about it.\"",
        "The MRI came back clean. The pain stayed. He could swing, so he played. Such is stubborn side of Berger, the son of Davis Cup player and renowned tennis coach Jay Berger. When he got to the Memorial in early June, he said it hurt just sitting in the car.\"I played that tournament (he tied for fifth) and told myself, `This is it.´ And then I tried to play the U.S. Open,\" Berger said. \"I was taking two ice baths a day to get on the course.\"When he finally stepped away from golf, it only got worse - not so much increased pain but the uncertainty. No one could figure out what was wrong.\"That (stuff) is scary,\" he said. \"You start to wonder if this will last forever when no one is telling you what's going on.\"After more than four months of rest and rehabilitation led nowhere, Donald offered him a book by Stuart McGill of Canada, a University of Waterloo professor who specializes in biomechanics of the spine. Berger reached out to McGill and was so eager for a solution that he flew to Canada on Christmas Eve to meet with him.There was a slight bulge in a lower disc, but Berger said that's a minor issue. Also detected was deep bone sensitivity. He said McGill gave him a two-hour evaluation and then set up a program for him to follow.",
        "Over the last couple of months, Berger has seen progress. He is working with performance trainer Ben Shear - Donald used him during his own back injury - and has been hitting balls for the last month, making sure there are no setbacks.\"It doesn't feel perfect, but I know it's not career-ending,\" he said.Maybe not, but it came at a pivotal time in his career. Fresh off his Ryder Cup debut, Berger had reached as high as No. 12 in the world and was still at No. 25 when he hobbled away from the U.S. Open. He was eligible for all the majors.He is No. 117 in the world. Next season offers at least eight $20 million tournaments, and only the top 50 in the FedEx Cup are guaranteed those.Berger, when he returns, effectively will be starting from scratch.\"That's the tough part,\" he said. \"When I took time off, I was a top-20 player. I'll be coming back with nothing. I get it - it's part of the game. You've got to earn everything. When I come back, I'll come back with fire in my belly.\"I'll enjoy the challenge of getting back to where I was.\"___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}