{
    "articleURL": "/wires/ap/article-12051795/Sterling-looks-respect-against-veteran-Cejudo-UFC-288.html",
    "content": [
        "MORRISTOWN, N.J. (AP) - Henry Cejudo marched to the stage for a faceoff with his opponent and punted a pillow printed with an image of Aljamain Sterling into the crowd.",
        "As the days moved closer to their bantamweight title bout, hostilities finally started to flare much more than their awkward docile exchange earlier in the week inside a New Jersey hotel.The two UFC fighters were filmed making small talk when they bumped into each other ahead of Saturday´s main event fight at UFC 288. Sterling - who once made a rather suggestive comment where Cejudo could stick his Olympic gold medal - told his challenger he appreciated him taking the fight.Cejudo simply replied he´d been training hard and wished the champ luck.Maybe the fighters need a trash talk boot camp.Sterling, the 135-pound champion since 2021, caught Cejudo (16-2) by surprise when members of his crew filmed the meeting.",
        "\"I don´t like it. This is personal, You can´t do that,\" Cejudo said later, laughing. \"I just think he wants to make it fun. That stuff doesn´t work for me. But he did butter me up.\"The friendly chat hasn´t softened Cejudo´s feelings toward Sterling.\"In reality, I want to tear his damn face off,\" Cejudo said.OK, now they´re warming up.Sterling (22-3) can´t be blamed for trying to catch some of the spotlight that comes with Cejudo´s return to fighting after a three-year retirement. The 33-year-old Sterling made his debut for the promotion at UFC 170 in 2014 and only now - after three straight title fights and 19 overall - has headlined his first main card. It´s not necessarily lost on him that a big piece of that is because of who he´s facing - Cejudo, after all, is the only person to win an Olympic gold medal and a UFC title. Cejudo, 36, didn´t need a tune-up to go straight to the main event.",
        "\"Sometimes you can tell who is the A side and who is the B side,\" Sterling said.Sterling, a Long Island, New York native, is trying to successfully defend the bantamweight championship for a record third time pretty much in his backyard at the Prudential Center.\"Seeing that billboard outside the Prudential Center, it was like, dreams come true,\" Sterling said. \"I never really cared about the main event spot until I´ve seen it like this. Well that is actually pretty damn cool.\"Sterling has arguably fought as UFC´s most underappreciated champion even as he defeated former weight class champions Petr Yan twice, Renan Barao and T.J. Dillashaw to rise to the top spot in the division.Knocking out Cejudo would take Sterling to an elite level.Cejudo calls himself \"Triple C\" in a nod to his Olympic gold and championships in UFC´s flyweight and bantamweight championship. Cejudo has openly boasted in his return about not only winning Saturday night, but then taking on fellow 135-pound fighter Sean O´Malley or moving up to 145 pounds for a fight against champion Alexander Volkanovski.Sterling says, not so fast.\"This would be a great opportunity for me to solidify myself as one of the best to ever do it,\" Sterling said.Maybe after the fight, Cejudo and Sterling can finally enjoy a more cordial get together.",
        "\"He can buy me a beer after I beat him,\" Cejudo said.Sterling and Cejduo take the top spot on a pay-per-view card that also includes Gilbert Burns vs. Belal Muhammad in a welterweight showdown and Yan Xiaonan vs. Jessica Andrade.MR. METSomeone call Timmy Trumpet!It´s time to fire up his signature \"Narco,\" for New York native Matt Frevola - and diehard Mets fans - for his walkout song ahead of his fight against Drew Dober in a 155-pound fight.The theme song belonged to Mets reliever Edwin Diaz but he suffered a season-ending injury in the spring.Frevola wants to adopt the song for a lightweight fight in front of a crowd that was expected to include several Mets, along with team owner Steve Cohen and members of his family.\"That´s my song now,\" Frevola said.The Long Island native known as \"Steamrolla,\" Frevola threw the first pitch at a Mets game in April. He said he \"nailed the windup\" and labeled his throw \" HIGH HEAT \" when he tweeted video of the pitch. Frevola made it a family affair with his brother acting as an umpire and their father catching the pitch.Frevola ranked his favorite teams as Mets, Jets, Islanders and Knicks. He even played baseball until he got to high school and switched to lacrosse because \"I like to hit people.\"",
        "YOU AGAIN?Yes, that is Gilbert Burns fighting on the card and if that sounds familiar, it´s because it is - the Brazilian already won a fight at UFC 283 in January and he retired Jorge Masvidal in a win at UFC 287 on April 8.\"It's good that it's quick. I don't need to think about it too much, to be honest,\" Burns said.One reason for the quick return, Burns and Muhammad are each in line with a win for a welterweight title shot against Leon Edwards. The fight was rushed onto the card after problems with the original co-main event between Charles Oliveira and Beneil Dariush pushed the fight to next month.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}