{
    "articleURL": "/sport/afl/article-12039651/AFL-icon-Nick-Riewoldt-reveals-MasterChefs-Jock-Zonfrillo-came-aid-number-times.html",
    "content": [
        " Nick Riewoldt pays tribute to Jock Zonfrillo AFL legend met Zonfrillo on MasterChef Riewoldt hailed chef's kindness and generosityAFL icon Nick Riewoldt has paid tribute to MasterChef judge Jock Zonfrillo following his sudden death, revealing that the TV star came to his aid 'a number of times'.",
        "The Scottish-born chef, 46, was found dead by police at a hotel in Melbourne's inner-north at about 2am on Monday - the same day he was due to make promotional appearances for the upcoming fifteenth season of MasterChef.Riewoldt was crowned winner of the second season of Celebrity MasterChef Australia in 2021 and donated his $100,000 prize to charity in honour of his late sister Madeleine who died at 26 from Bone Marrow Failure Syndrome.The former St Kilda captain was emotional about the news of Zonfrillo's tragic death.'Devastating news to wake up to this morning,' he said on Footy Talk.",
        "'First thoughts go out to Jock and his family, what they must me going through.'Great family man, you know, beautiful wife, children, young children. Their worlds are going to be rocked and changed forever.'Just the most kind, generous, charismatic man who, in the world of showbiz, was just a real person and happy to have real conversations and reach out and help people in times of need.'Riewoldt explained that the MasterChef judge supported him more than once.'I was the beneficiary of Jock's generosity and compassion a number of times,' Riewoldt said.'Just a beautiful man that will be sorely, sorely missed. Just such an incredible guy. Thoughts are with the Zonfrillo family today.'",
        "Meanwhile, the TV chef's family have released a statement imploring fans to let them grieve privately.'With completely shattered hearts and without knowing how we can possibly move through life without him, we are devastated to share that Jock passed away yesterday,' the statement read.",
        "'So many words can describe him, so many stories can be told, but at this time we're too overwhelmed to put them into words.'For those who crossed his path, became his mate, or were lucky enough to be his family, keep this proud Scot in your hearts when you have your next whisky.'We implore you to please let us grieve privately as we find a way to navigate through this and find space on the other side to celebrate our irreplaceable husband, father, brother, son and friend.'For confidential support call the Lifeline 24-hour crisis support on 13 11 14 "
    ]
}