{
    "articleURL": "/wires/reuters/article-12043563/Egypt-launches-national-dialogue-amid-ongoing-security-crackdown.html",
    "content": [
        "By Farah Saafan",
        "CAIRO, May 3 (Reuters) - Egypt launched a national political dialogue on Wednesday that authorities said was meant to generate debate around the country's future, though the chair of the event said several areas of discussion would be off limits.The dialogue, announced by President Abdel Fattah al-Sisi in April 2022, aims to produce political, economic and social reform recommendations that could be presented for Sisi's consideration.It is one of several steps aimed at countering criticism of Egypt's human rights record. Other measures include a five-year human rights strategy and a presidential amnesty committee that is considering thousands of requests to free some of those jailed under Sisi's rule.\"I urge you to do the effort to make the national dialogue experience a success,\" Sisi said in a recorded message to the dialogue's opening session, adding that he had followed preparations closely and that \"differences in opinion do not damage the cause of a nation\".The dialogue's chairperson, Diaa Rashwan, said all sessions would be open to the media but discussions around the constitution, foreign policy and \"strategic national security\" would be off limits.Critics say recent steps on human rights are cosmetic, pointing to continuing detentions and arrests of dissidents, and say they doubt the dialogue signals real change.",
        "The dialogue \"had nothing to do with actual security practices on the ground,\" said Wesam Ata, researcher at the Egyptian rights group Association for Freedom of Thought and Expression (AFTE). \"Anyone who does anything that security decides they should be arrested for will be arrested.\"Khaled Dawoud, spokesman for the Civil Democratic Movement, a coalition of secular and leftist opposition groups that are participating in the dialogue, said continuing arrests create \"serious doubts\" about the government's commitment to political reform.The Interior Ministry did not respond to requests for comment.Rights groups estimate tens of thousands of people including liberal activists as well as Islamists have been jailed since Sisi led the ouster of Muslim Brotherhood President Mohamed Mursi in 2013.Sisi and his supporters say the crackdown was needed to stabilise the country.(Reporting by Farah Saafan; Editing by Aidan Lewis and Cynthia Osterman)"
    ]
}