{
    "articleURL": "/tvshowbiz/article-12049005/Im-Celebrity-South-Africa-Joe-Swash-reveals-like-return-EastEnders.html",
    "content": [
        "Joe Swash has said he had 'the worst' exit ever on EastEnders and would like the opportunity to return to the soap but he hasn't been asked.",
        "The actor, 41, portrayed fan favourite Mickey Miller from 2003 to 2008 before briefly returning in 2011 for his on-screen brother Darren's departure.Speaking with fellow EastEnders star Dean Gaffney in Friday's episode of I'm A Celebrity South Africa, Joe admitted he wasn't happy with how he left the show.According to The Sun, Carol Vorderman asks Joe if he will return to Watford, to which he says: 'I wouldn't mind it.'You know exactly what you're doing, when you're doing it, how you're doing it.",
        "'But they've never asked me mate, not once.'The soap star then admitted he wished he had been given a more dramatic exit storyline as many characters get.He said: 'I had the worst outro ever! I didn't even leave at the end of the episode.'So usually you leave at the end of the episode and you get the 'doof doof'.'Mine, I went to Norwich to be a bell boy at a hotel and mid scene I just walked into the Vic and went, 'Right, see you later'.'They turned back to Phil, turned back to me and I'd gone. I was like, 'What, that's it?' I was there five years and not one doof doof!'Speaking in the Bush Telegraph, Joe reiterated EastEnders have not reached out to him to return.",
        "He said: 'People think I can phone up EastEnders and go, 'I'm ready to come back now guys'.",
        "'They have not phoned me. Let me make this clear… EastEnders have never phoned me to get me back on the show.'Just a few months after leaving EastEnders, Joe took part in I'm A Celebrity and was crowned King of the Jungle. He then went on to present I'm A Celebrity's spin-off series a year after being crowned 'King of the Jungle'.In 2010, he met his now wife Stacey Solomon, who had also just won the series, and the pair started dating. They have since gone on to have three children together and married  in 2022.",
        "'I'm A Celebrity holds a big place in my heart,' Joe said.'I won it and I was lucky enough to go on to present the spin-off series on ITV2 for ten years.'I met Stacey whilst I was out in Australia and me and Stacey have now married and we have had kids. Doing the all-stars series is closure. It finishes off the circle.'Stacey is over the moon about me doing it. The jungle holds a big part in both our hearts. Without the jungle, we wouldn't have each other. In a way, we owe it to the jungle to say goodbye.'"
    ]
}