{
    "articleURL": "/tvshowbiz/article-12058869/Adele-puts-cosy-display-fianc-Rich-Paul-enjoy-date-night.html",
    "content": [
        "Adele enjoyed a rare date night with her fiancé Rich Paul at the Crypto Arena in Los Angeles for the 2023 NBA playoffs on Saturday. ",
        "The singer, 35, was spotted sitting courtside to watch the LA Lakers vs. Golden State Warriors compete during round two, game three of the semi-finals. She put on a trendy display wearing a pair of tan-coloured, loose-fitting trousers along with a matching button up that was left partially unfastened at the collar. The Grammy winner slipped into a pair of black, open-toed heels for a bit of colour contrast to her monochromatic ensemble. Sharing whispers with her partner, Adele's locks were parted in the middle and effortlessly flowed down naturally past her shoulders.",
        "The British-born singer accessorised her look with gold-hooped earrings along with an assortment of bracelets on each of her wrists and silver and gold-chained necklaces.She was seen sharing a laugh while enjoying date night with her partner and sports agent, Rich, whom she has been dating since 2021.Sports agent Rich opted for casual comfort wearing a black tracksuit that contained a green outline. He also added a plain white shirt underneath the outfit.He slipped into a pair of colorful sneakers and added a blue watch on his left wrist to complete his look for the game.The couple posed for a cute photo at the event and were also seen cheering during the festivities.The songstress was previously married to Simon Konecki, and shares son, Angelo, 10, with her ex-husband.",
        "Sitting next to the Set Fire To The Rain singer was actress, Nia Long, who is known for roles in projects such as Big Momma's House and most recently, You People.",
        "She opted for a pair of comfy, white trousers and tucked in a white shirt into the waist of the pants. The NBA playoff game resulted in the Los Angeles Lakers beating the Golden State Warriors with a winning score of 127 to 91.The star layered the outfit with a denim jacket and slipped into pair of fuzzy, open-toed heels.The trio were spotted conversing together and having a blast as they sat front row at the big game.The happy couple have long sparked engagement rumours since the BRIT Awards last year, and reports emerged that Rich had popped the question in February.The happy news was revealed by online gossip site Deux Moi, who said that the claims had come from a 'very reliable source'.Fuelling the reports, Adele had been seen wearing a huge diamond ring on a number of occasions in recent months. "
    ]
}