{
    "articleURL": "/tvshowbiz/article-12055037/Victoria-David-Beckham-lead-stars-sending-wishes-King-Charles-Queen-Camilla.html",
    "content": [
        "David and Victoria Beckham led the stars sending their well wishes to King Charles and Queen Camilla following their their historic Coronation on Saturday.",
        "The former Spice Girl, 49, took to her Instagram following the London ceremony to share a throwback snap of herself meeting his Royal Highness.Posing in pictures from her pop star days, Victoria penned: 'From then to now! I have so many fond memories of meeting His Majesty throughout my career, and he is always so supportive and kind'. She continued: 'Today is a truly historic day and I’m incredibly humbled to celebrate King Charles III and Queen Camilla as they embark on their new roles. Meanwhile husband David, 48, posted his own tribute to the Royal declaring the coronation a day out 'country comes together'.",
        "Writing: 'Today our country comes together to celebrate the coronation of Their Majesties King Charles III and Queen Camilla'.Later taking to his Instagram Stories, the former footballer shared a slew of snaps from the big day and said 'London is looking incredible'. Elsewhere Holly Willoughby, 42, took to her Wylde Moon account to write: 'A moment in history, happy Coronation day'.Following in his famous parents' footsteps, Brooklyn Beckham also took to social media all the way from LA.He wrote: 'A historic day celebrating the coronation service of King Charles III and Queen Camilla, sending my best wishes xx'.His younger brother Romeo, 20, also took to his Instagram Stories to write 'God Save the King' and share his father David's post. ",
        "Spice Girl Emma Bunton, 47, said: 'Honoured to have met His Majesty many times over the years and he’s always been so kind, funny, loyal and supportive and I have such amazing memories!' She added: 'Being an ambassador for the Prince’s Trust is something I am most proud of. It’s Coronation Day -  Congratulations King Charles III'And fellow Spice Girl Geri Horner, 50, also shared a snap from her previous meeting with the King in his role as the Prince of Wales. ",
        "She commented: 'Congratulations to King Charles III and Queen Camilla on this truly historic day. Thank you for your continued service and for your kind friendship over the years. God Save the King.'Shortly after the stunning Coronation at Westminster Abbey, Martine McCutcheon joked the new King and Queen would no doubt be looking forward to a cup of tea.She penned: 'Long live the king! Wow… That was a ceremony and a half wasn’t it?! And to think Charles is in his seventies and still has SO much more to do for the rest of the day! I thought he and Camilla looked resplendent and as always Kate looked so classically beautiful'. 'The children were so cute too! Am I right in thinking one of them was wearing his football kit underneath his outfit?! If so, I love that!'. ",
        "She continued: 'I’m so pleased Charles was met with such warmth from the public and guests… I felt he was thinking of his “Dear Mama” so often throughout. I think our late Queen would be so very proud of her son today'. 'With our world drastically changing all the time, I wondered how I would feel about the royals and the ceremony etc… I have to say, seeing all the history and heritage and reflecting on all the family have weathered and endured both publicly and personally brought me great comfort and pride actually, '.Going on to say: 'And with William and Kate on board too, I’m sure the family will continue to bring the credibility and tradition of the old mixed with the freshness and needs of the new for the country. Now… I bet he can’t wait to get all that regalia off, have a cup of tea and put his feet up!'.Before adding: \"God save the King!'While former TOWIE star Danielle Armstrong, who is currently enjoy a sun-soaked Marbella getaway wrote:  'Even though we are away and not celebrating the Coronation back home with family, I was still watching like I’m sure many around the world see Charles become “King Charles III” today''I know many people have their views and opinions of the Royal Family and many do have some valid reasons I’m sure … BUT I was always brought up in a royalist family especially my mum who I can’t even mention Harry’s name around her'. ",
        "She continued: 'I think that’s why I’ve just always been proud of our monarchy &amp; what they do'.'So whether your fan or not, let’s just remember this man was not asked to be King he was born into this and now about to take on one hell of a role. What an historic moment we have all got to witness today'.VIP guests queued for a mile from 6am to get one of the prime 2,300 seats inside Westminster Abbey on Saturday. The Abbey was full at just before 9am. Some 100 heads of state are in London, with representatives from 203 countries attending to watch Charles be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. Stunning flowers in reds, burgundies and yellow golds covered the top of the ornate golden High Altar.",
        "More than 100million people around the world watched the historic first coronation of a British monarch in 70 years - with an estimated 2million people on the streets of London to watch history unfold.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year.Myleene's quick dash to Westminster came following her usual stint on Smooth Radio Friday morning.",
        "Elsewhere, Amanda Holden was interviewing giddy Royal fanatics that were already lining the streets of London while Sharon Osbourne greeted campers on The Mall ahead of Coronation festivities on Friday - as the stars got ready for the big day."
    ]
}