{
    "articleURL": "/news/article-12041041/Crickets-worms-grasshoppers-dished-kids-prestigious-20-000-year-girls-school.html",
    "content": [
        "The North London Collegiate School (NLSC) has introduced the new menuFormer pupils at the school include the likes of Rachel Weisz and Anna WintourChinese crispy crickets, buffalo worm stir fry and grasshopper noodles may sound like a Bushtucker Trial on I'm a Celebrity... Get Me Out of Here!",
        "But these are the new environmentally-friendly dishes on offer on the menu of a £20,000-a-year independent girls school.The prestigious North London Collegiate School (NLSC) - which counts Rachel Weisz, Esther Rantzen and Anna Wintour as former pupils - is leading the way with meals that are kind to the planet.The new menu came about after pupils, who vote for what school dinners they have with green tickets for yes and red for no, called for the school to become more sustainable.The result is that two thirds of all meals now are vegetarian, with the kitchen even trialling edible insect dishes. ",
        "Guy Kaye, NLCS' general manager for catering, said: 'We're dedicated to driving sustainability, without compromising the satisfaction of the pupils we serve.'The girls have been a driving force behind the change, and are really open to trying new things that are better for the world, even if that includes trying edible insects that are very common in other parts of the word and a sustainable source of fibre.'The oldest girls school in the UK, whose former pupils also include Marie Stopes, Fennela Fielding and Susie Orbach, is one of the first in the world to work with the UN Climate Neutral Now Initiative to become a carbon-neutral organisation.",
        "Every form has an eco-rep who reports students' green ideas to the school environmental committee of teachers, staff and pupils.NLCS is also a founding member of the London School Eco Network where schools across the city meet to work on national green campaigns like the Youth Climate Summit.As GCSE and A level season approaches, the school has taken a further step by inserting healthier ingredients into old favourites on the lunch menu.This features the likes of chocolate brownies made with beetroot, courgette cake in lemon drizzle and energy balls made with oats and raisins.",
        "Mr Kaye added: 'We adopt a health by stealth strategy to add extra nutrients to some of our popular dishes, which is particularly important to fuel learning during exam season.'Crucially, the recipes stand up when it comes to the all-important taste test. When the girls try them, they're completely shocked to learn that beetroot was a core base for the brownie, but that doesn't stop them coming back for more.'Yesterday it was revealed that at least nine councils serve only plant-based meals at their events and actively promote vegan lifestyles within their communities.Parents shared photos of the vegan school dinners being served to their children. Meanwhile, Britain's furious farmers have begun the fightback against 'plant-based' options being forced onto kids and called for more support of their industry.",
        "The Countryside Alliance warned a new plant-based international treaty signed by several councils in the UK is a threat to British agriculture.Blasting the initiative, Sir Robert Goodwill, chairman of the environment, food and rural affairs select committee, called the measure a 'slap in the face for British farmers' who 'face the toughest time producing the best lamb and beef in the world'.The Tory MP told the Times: 'There's nothing wrong with vegetarian food but we need a balanced diet which does include meat and dairy.'Meat is high in iron; milk, dairy products are high in vitamins. And we don't want children, some of them from poorer backgrounds who don't get a decent meal at home, not getting a decent meal at school either.'"
    ]
}