{
    "articleURL": "/wires/aap/article-12058311/Missing-finals-wouldnt-make-Blues-failure-Cerra.html",
    "content": [
        "Midfielder Adam Cerra insists Carlton's season won't be a failure if the Blues go for a 10th consecutive campaign without making finals.",
        "Expectations were high after the Blues agonisingly missed the top eight on percentage in head coach Michael Voss' first campaign last year.After going unbeaten through the opening month of the 2023 season, Carlton sit eighth after Friday night's 26-point defeat to Brisbane.The defeat marked their third loss in four games, casting doubt over the Blues' finals credentials.\"Every day we're just trying to get better and progress,\" Cerra told reporters on Monday when asked whether missing finals would mean the season was a write-off for Carlton.\"If we're improving from last year as a team, not just ladder position but that connection within the group and what we're building towards, I don't see it as a failure.\"Every week, Vossy's big on not just looking at the big picture, but looking at the little things week by week, just trying to get better.\"So I definitely wouldn't call it a failure, even though it's our goal.\"It might be this year, it might be next year, but we want to get there as soon as possible.\"Every football club feels the pressure to make the finals. That's what the players want to play in, that's what the fans want to go and watch.\"I'd be lying if I said no one feels the pressure but it's something we embrace.\"",
        "Cerra said he had no issues with fans booing Carlton during Friday's Lions loss.\"We feel their frustration. We expect to be playing much better at the moment and we believe we will,\" he said.\"They were frustrated and we wear that as a football side and want to respond.\"Carlton are determined to prove they are not flat-track bullies when they face the Western Bulldogs at Marvel Stadium on Saturday.The Blues beat reigning premiers Geelong in round two, during the Cats' early season rut, but have since lost to Adelaide, St Kilda and Brisbane, with their only recent win coming against struggling West Coast.\"We've had big games earlier this year, and late last year, big games against a top-four opposition and we showed we can take it to them,\" Cerra said.The Blues' midfield are up for the challenge of taking on in-form Bulldogs skipper Marcus Bontempelli and have homed in on providing better delivery to their forwards.\"That's something we're going to work with - building that connection across the ground so we can get more bang for our buck with the ball in hand,\" Cerra said.\"It's just execution that's letting us down.\""
    ]
}