{
    "articleURL": "/tvshowbiz/article-12054377/Viewers-fume-mishap-means-words-not-appear-screen-pledge-allegiance.html",
    "content": [
        "Viewers fumed on Saturday morning after an ITV blunder meant the words of the pledge of allegiance did not appear on screen during King Charles' Coronation.",
        "The Archbishop of Canterbury had invited people to 'cry and swear allegiance' to King Charles during the ceremony.Before the oath, the presenter on ITV said: ‘The Archbishop invites all who so desire to pay homage. The words will be on the screen.’It was supposed to say on televisions: 'I swear that I will pay true allegiance to Your Majesty, and to your heirs and successors according to law. So help me God'.However, despite the broadcaster promising to help people at home by putting the words on screen, they never materialised. ",
        "Twitter users were angry after the blunder and took to the social media site to slam the channel. One person wrote: 'Haha #ITV failed to put \"pledge of allegiance\" words on screen despite saying they would.'Pledge allegiance to the King, the words will be on screen. Except they weren't! Epic fail.'Another said: '@'ITV turning over, missed out on reading the words of homage, didn't appear on screen.' Someone else penned: 'There was me, ready to pledge my allegiance to the King, and ITV failed to put the words up on the screen.'Thanks #ITV for ruining it for the millions of us who were watching and wanting to do that!!!' It comes after Good Morning Britain's Coronation Special descended into chaos on Saturday morning when a presenter appeared to swear live on air.",
        "The ITV show, which was presented by a range of hosts including Ben Shephard, Kate Garraway and Susanna Reid , focused on the build-up to the momentous occasion.",
        "Susanna was presenting a link in which she was preparing to cut to Kate at Buckingham Palace as she told viewers: 'Now many people would say she is and has been one of most vilified figures in Britain, today she will be crowned Queen.'The public mood towards Camilla, the Queen Consort , has definitely softened in recent years, she is now considered one of the most senior royals of course. Kate is at Buckingham Palace.'But as Kate began to speak when the camera cut to her, viewers heard a voice who they wrongly assumed was Susanna which said: 'B***h, it is not good' before Kate promptly carried on with her broadcast.The expletive was uttered by correspondent Petronella Wyatt, who later admitted she was responsible for the gaffe, but not before viewers blamed the long-serving host."
    ]
}