{
    "articleURL": "/news/article-12060083/Expert-reveals-valuable-rare-coins-sell-auction-including-12M-silver-dollar.html",
    "content": [
        "Ian Russell auctions 5,000 rare coins a week through his site GreatCollectionsIn January he oversaw the $7.7 million sale of a set of Lincoln penniesRussell told Dailymail.com the number of such mega-sales is on the rise A rare coin expert has revealed the most valuable pieces he has ever sold at auction - including a $12million silver dollar and a set of Lincoln pennies which fetched $7.7 million.",
        "Ian Russell, president of California-based auction site GreatCollections, developed an interest in rare currencies in his teens and now typically sells up to 5,000 coins a week.Yet even he says he was most astonished by the Lincoln set sale which was auctioned by the estate of coin enthusiast Stewart Blay after his death, aged 77.Prior to the bid, a single Lincoln Cent had never broken the million-dollar sale mark.But Blay's extensive collection included a 1958 Double Die - the finest of only three known in the world - which realized $1.136 million.",
        "'That sale blew every record out of the park,' Russell told Dailymail.com.'The owners had developed a unique interest in the Lincoln cent and became an expert in them. He spent his life hunting down the finest ones.'A double die - which became famous after the 1955 issue - refers to a coin that has a double image on part or all of its design.It occurs when a coin was not manufactured correctly, resulting in an accidental doubling of imagery.A further 13 Lincoln Cents from Blay's collection realized over $100,000 back in January.Blay, a sculptor from New York, travelled the world visiting coin shops during his hunt for the very best Lincoln cents.",
        "He never revealed the extent of his lucrative collection to his family - who were blindsided by the sale.Russell said: 'He made one hint to his sister just before he died. ",
        "'She mentioned a story she had heard selling for a lot of money and he just said 'that's not very much for a coin these days.'She didn't think anything of it until his collection sold.'Russell added that it was not rare for coins to sell for over $1 million now.Last year, his auction house sold what was thought to be the first ever silver dollar to be struck by the United States mint for $12 million.And in 2021 GreatCollections bought three coins for a record-breaking $13.35 million. The set included a 1913 Liberty Head Nickel. It received a PCGS grading of 66. PCGS is a certified coin grading scale which ranges from 1 to 70. It was also verified by Certified Acceptance Corporation (CAC) - a third-party grading service founded in 2007. The collection was completed by an 1894 S Proof Barber Dime - graded PCGS Proof-65+ and also CAC verified - and an 1804 Silver Dollar graded PCGS Proof-65.In general coins with missing aspects or extra detail fetch the biggest values.Russell said his auction house deals with a range of clients - from experienced coin collectors to novices who just found pieces in their house and assume they aren't worth very much.",
        "He adds that the number of women collectors shot up during the pandemic.'The coin collecting community was always 99.5 percent male.'But since Covid we've seen lots of husbands getting their wives involve. I think because they were spending more time at home together.'Now women make up about 5 to 6 percent of the community which still isn't very much but it's a lot more than we've seen previously.' "
    ]
}