{
    "articleURL": "/wires/reuters/article-12052381/Motor-racing-Mercedes-Russell-fastest-Miami-Grand-Prix-practice.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 5 (Reuters) - George Russell overcame steering issues that threatened to scuttle his first practice session of the Miami Grand Prix on Friday to put his Mercedes top of the timing sheets ahead of team mate and seven-times world champion Lewis Hamilton.Red Bull's double world champion Max Verstappen had spent much of the hot and steamy practice at the top of the charts but ended the session fourth fastest behind the two Mercedes and Ferrari's Charles Leclerc.Ferrari's Carlos Sainz was fifth fastest followed by Alpine's Pierre Gasly and the Aston Martins of Fernando Alonso and Lance Stroll.Russell got his weekend off to a rocky start, complaining of poor handling early on that brought the Briton into the pits where an experimental steering rack was replaced.When he returned to the track late in the session, he put down a marker with a time of one minute, 30.125 seconds on the 3.36 mile (5.41km) temporary street circuit around Hard Rock Stadium, the home of the NFL's Miami Dolphins.Hamilton was just 0.212 seconds back while Verstappen, the winner in the inaugural Miami Grand Prix, was nearly a half-second off the pace.Verstappen's team mate Sergio Perez, the winner last week in Baku, was well down the timing sheets in 11th.",
        "Just a little over half way through the one-hour session, Nico Hulkenberg spun and slammed his Haas into the wall bringing out the red flag.Until the spin Hulkenberg had been enjoying a lively practice for the U.S.-owned outfit, sitting second behind Verstappen when the session was paused. Hulkenberg would still finish with the ninth best effort. The only American on the starting grid, local boy Logan Sargeant, who grew up in nearby Fort Lauderdale, could not give the fans much to cheer, the Williams rookie finishing with the 19th best time. (Reporting by Steve Keating in Miami. Editing by Toby Davis)"
    ]
}