{
    "articleURL": "/sport/football/article-12046143/Ibrahima-Konate-backed-one-best-centre-backs-world-Jose-Enrique.html",
    "content": [
        "Injuries have restricted Ibrahima Konate to just 15 Premier League appearances The 23-year-old centre back was part of France's World Cup squad in Qatar Liverpool keep their slim top four hopes alive with 1-0 victory against Fulham Former Liverpool star Jose Enrique has tipped Ibrahima Konate to become one of the world's best, should he manage to stave off injury issues. ",
        "The Spanish full back heaped the praise on the Liverpool player, clearly impressed by what he had seen since the Frenchman's arrival in 2021. Konate has struggled with fitness this season, limited to just 15 games at the heart of defence for Liverpool in the Premier League.However when he is fit, the 23-year-old seems to have pushed Joel Matip down in the pecking order at the club, coming straight back into the side when he is able to. And Enrique clearly saw plenty to be impressed by, writing on Twitter: 'Konate, if he is able to stay fit, is going to be one of the best center backs in the world. What a player!'",
        "Since arriving at the club, Konate has played 50 games in all competitions, including the Reds' Champions League final run last season. While Enrique is clearly enamoured with the defender, Gary Neville was critical of his performance against Tottenham in April's five-goal thriller, saying: 'Konate on that right-hand side had a nightmare today 40 minutes in.'You have to connect the two [Konate's form and Alexander-Arnold playing centrally], you can't keep papering over the cracks. 'You have to deal with it properly. Every chance Tottenham had it felt like it came down that right-hand side.'I love Trent on the ball and playing centrally unless they were going to a back-three and Robertson as tucking on the left, but Robertson's flying forwards as well, and asking Konate to play right back and right centre back, that's too big an ask.'",
        "With Trent Alexander-Arnold operating more centrally in a changed role that brings out the best of his passing game, the onus fell on Konate to cover the gaps left on the right-hand side. The defender - who went to Qatar with the French squad - struggled to do so, with even his manager Klopp admitting that he found it difficult to adapt to new-found responsibilities. 'Trent Alexander-Arnold cannot be everywhere. He cannot be in midfield and the next situation he is directly in the right-back situation.",
        "'That has to be covered by Ibou [Konate]. There were a few situations where Ibou was a bit too far away. They could turn and could attack. We have things to improve, definitely, but in a lot of moments it looked really good.'Against Fulham on Wednesday evening he kept his seventh clean sheet of the season in all competitions for Liverpool.The Reds have been off the pace that they have often set in recent campaigns, and are currently sat in fifth, four points off rivals Manchester United but having played two games more. The French defender has failed to find the back of the net in 2022-23, although he did turn the ball past his own goalkeeper Alisson against Brentford in a 3-1 defeat in the league. "
    ]
}