{
    "articleURL": "/sport/mlb/article-12056819/Vida-Blue-dead-73-Tributes-pour-three-time-Oakland-World-Series-champion.html",
    "content": [
        "Vida Blue played for Oakland A's, Kansas City Royals and San Francisco GiantsHe won three World Series with the A's, and was a six-time All-Star pitcherDailyMail.com provides all the latest international sports news Vida Blue, the three-time Oakland A's World Series champion, has died at the age of 73, it was announced on Sunday.",
        "Blue was a six-time All-Star and won the American League MVP award in 1971, the year before his first World Series title.The news was released on Sunday morning, with Oakland A's legend Dave 'Smoke' Stewart tweeting: 'Vida Blue rest in peace, my mentor, hero, and friend. 'I remember watching a 19 year old phenom dominate baseball, and at the same time alter my life. There are no words for what you have meant to me and so many others. My heart goes out to the Blue family.'The A's said Blue, who was a pitcher, died Saturday but didn't give a cause of death.",
        "'There are few players with a more decorated career than Vida Blue,' the team said in a statement Sunday. 'Vida will always be a franchise legend and a friend.'Blue was voted the 1971 American League Cy Young Award and Most Valuable Player after going 24-8 with a 1.82 ERA and 301 strikeouts with 24 complete games, eight of them shutouts. He remains among just 11 pitchers to win both honors in the same year. Blue finished 209-161 with a 3.27 ERA, 2,175 strikeouts, 143 complete games and 37 shutouts over 17 seasons with Oakland (1969-77), San Francisco (1978-81, 85-86) and Kansas City (1982-83).  More memorably, he helped pitch the Swingin' A's, as Charley Finley's colorful, mustachioed team was known, to consecutive World Series titles from 1972-74. Since then, only the 1998-2000 New York Yankees have accomplished the feat. ",
        "After Blue clashed publicly with Finley, the A's owner traded the pitcher twice only to be blocked each time by baseball Commissioner Bowie Kuhn, first in June 1976 to the New York Yankees and then in December 1977 to the Cincinnati Reds. Kuhn vetoed the deals under the commissioner's authority to act in the 'best interests of baseball.' 'Vida Blue has been a Bay Area baseball icon for over 50 years,' Giants President Larry Baer said in a statement, 'His impact on the Bay Area transcends his 17 years on the diamond with the influence he's had on our community.'",
        "Blue was released by the Royals in August 1983 and ordered that December to serve three months in federal prison and fined $5,000 for misdemeanor possession of approximately a tenth of an ounce of cocaine. Blue was sentenced to one year in prison but U.S. Magistrate Judge J. Milton Sullivant suspended the majority of the term.Blue was among the players ordered by baseball Commissioner Peter Ueberroth in 1985 to be subject to random drug testing for the rest of their careers.After sitting out 1983 and 1984, Blue returned to baseball with the Giants for two seasons.After his 2005 arrest in Arizona on suspicion of DUI for the third time in less than six years, Blue was sentenced to six months in jail after failing to complete probation. ",
        "But he was told he could avoid incarceration by spending time in a residential alcohol treatment program."
    ]
}