{
    "articleURL": "/wires/reuters/article-12049321/Eight-killed-Serbian-village-shooting-police-launch-manhunt.html",
    "content": [
        "Serbia reels from second mass shooting in two days",
        "President Vucic announces tough new gun control measuresLatest incident took place in village south of BelgradeSuspect opened fire after altercation in schoolyard - media(Recasts, adds court appearance of father of first suspect)By Antonio Bronic and Aleksandar VasovicDUBONA, Serbia, May 5 (Reuters) -A young man wearing a T-shirt with neo-Nazi symbols killed eight people and wounded 14 in Serbia's second mass shooting in consecutive days, and he was caught later hiding at his grandfather's house, authorities said on Friday.The latest rampage took place in the village of Dubona, south of the capital, late on Thursday, as the Balkan country was already mourning nine people killed the previous day in an unprecedented shooting by a13-year old boyat a Belgrade school.\"This is terrible for our country, this is a huge defeat. In two days, so many ... killed,\" said a village resident named Ivan not far from where the shooting took place.State broadcaster RTS said the suspect had been involved in an altercation in a school yard. He left to fetch an assault rifle and a handgun, opened fire, then continued to shoot at people from a moving car.The man fired at people in two other nearby villages before fleeing, authorities said. Police found him eventually hiding in his grandfather's house, where they also discovered hand grenades, an automatic rifle and ammunition.",
        "\"The suspect U.B., born in 2002, has been apprehended in the vicinity of the city of Kragujevac, he is suspected of killing eight people and wounding 14 overnight,\" Serbia's Interior Ministry said in a statement.Police also arrested his grandfather and uncle.In a sombre national address, President Aleksandar Vucic called the incident a \"terrorist attack\" and said the gunman had been wearing a T-shirt with neo-Nazi symbols.\"There will be justice. These monsters will never see the light of the day,\" he said, referring to the suspects from both this week's shootings.Despite strong gun controls, Serbia and the rest of the Western Balkans are awash with military-grade weapons and ordnance that stayed in private hands after the 1990s wars.GUN MEASURESVucic proposed a moratorium on gun permits, in what he called a \"practical disarmament\" of Serbia that would also include more frequent, mandatory medical and psychological checks of gun owners.In Serbia, the president is largely a ceremonial figure but Vucic wields considerable power as he also heads the ruling party, and the government later approved his proposals.The government also plans to hire 1,200 new police officers for schools security and to offer an amnesty for people surrendering illegal weapons and explosive devices.Vucic said he had proposed reintroducing the death penalty but said the government was against such a step.",
        "Foreign heads of state including Pope Francis and Britain's King Charles sent condolences.Serbian Health Minister Danica Grujicic said many of the wounded from Thursday's incident had suffered multiple injuries and undergone surgery, but all were stable.Locals and RTS said an off-duty policeman and his sister were among those killed.\"This is sad, the young policeman is my daughter's age, born in 1998,\" said Danijela, a woman in Dubona. \"My daughter is taking sedatives, we could not sleep all night. They grew up together.\"Amid national soul-searching, the editor-in-chief of the Vreme weekly, Filip Svarm, said there was clearly a copycat element in the latest shooting and that media coverage too often ended up glamourising killers.However, tougher restrictions could prove counter-productive, he warned. \"I am afraid that now, precisely because of this panicked reaction from the Serbian president, citizens will start to arm themselves illegally.\"Serbia's gun culture is especially entrenched in rural areas.\"We don't even have an assessment of how many illegal weapons are out there and what kind,\" said Aleksandar Zivotic, a historian at Belgrade University.In the first shooting case, the detained father of the teen suspect denied any responsibility on Friday, the High Public Prosecutor's office said in a statement.The prosecution said the father, identified as Vladimir K., faced up to 12 years in jail on suspicion of training his son by taking him to target practice and failing to secure arms.",
        "(Additional reporting by Ivana Sekularac; Writing by Gareth Jones and Andrew Cawthorne; Editing by Nick Macfie and David Gregorio)"
    ]
}