{
    "articleURL": "/wires/pa/article-12047109/Dean-Smith-welcomes-Jamie-Vardy-s-return-form-Leicester-s-relegation-fight.html",
    "content": [
        "Leicester boss Dean Smith hopes Jamie Vardy can fire his side to Premier League safety after the veteran’s recent revival.",
        "Vardy has scored in the last two games to help move the Foxes out of the bottom three having previously gone 19 games without a goal.Smith, who is on a short-term SOS mission at the King Power Stadium to keep Leicester up, says the 36-year-old is “firing” ahead of the crunch run-in.“People will have seen in his last few performances the hunger and desire he has got, the work rate, the fact his legs are still there and his brains are definitely still there,” Smith said ahead of Monday’s trip to Fulham.“We are really pleased that he is back scoring goals for us. He has got his first away goal at Leeds and his first home one on Monday (against Everton), we are really pleased he is in a good place at the moment.“He knows as well as anyone as a striker with his record he will be judged on goals. He probably hasn’t had the pitch time to earn the goals or chances but he has created a penalty for us against Wolves. He has come on and scored against Leeds and scored a goal on Monday.",
        "“He is in a good vein of form at the moment, which is what we need with only four games to go.",
        "“I don’t think we have had to rebuild his confidence, we have had to play more to his strengths. We know he is an intelligent player with his runs, but he needs the ball to go into the right areas with his runs.“We have to have a supply line to him and he has to make the runs as well.”Leicester could have Ricardo Pereira back after a hamstring injury, while there is also good news over Kelechi Iheancho (groin) and Jonny Evans (virus).“Ricky Pereira has been training with us, he has only been doing part of the session,” Smith said.“He will be training with us on Saturday and Sunday so that will be a boost to the squad to have him.“Ricky is due to train with us on Saturday. He part trained yesterday and if he came through Saturday, I am sure he would put himself forward for selection on Monday.“Kels has responded to the treatment so won’t be back for Monday, but we may get him back for the last two games which we weren’t hopeful of when he first sustained the injury.“Jonny is back training. He has trained the last couple of days and trained really well, so it is nice to get that experienced head around.",
        "“Even just to have him on the training ground, there is so much the other lads can pick up from him with his knowledge and his experience. It’s great to have him back.”"
    ]
}