{
    "articleURL": "/wires/pa/article-12057355/Manchester-United-beaten-David-De-Gea-howler-West-Ham.html",
    "content": [
        "David De Gea’s slip loosened Manchester United’s grip on the final Champions League place as they were beaten 1-0 at West Ham.",
        "De Gea let Said Benrahma’s hopeful shot from 20 yards slip over his glove to condemn Erik Ten Hag’s side to back-to-back defeats.They now lie just one point ahead of a rapidly advancing Liverpool, albeit with a game in hand.But an eighth defeat on the road this season could prove as costly for the visitors as it was priceless for West Ham, who climbed seven points above the relegation zone and are surely now safe.De Gea’s evening began inauspiciously when his poor clearance flew to the feet of Declan Rice, whose run into the area was only curtailed by a last-ditch tackle from Wout Weghorst.Marcus Rashford curled over for the visitors while Bruno Fernandes and Antony fizzed low shots narrowly wide.Christian Eriksen’s effort also floated too high before Rashford cut inside Thilo Kehrer and crashed his shot against the outside of the near post.The goal arrived in the 29th minute and it is not one De Gea will want to see again.Benrahma had few options as he drove forward with Aaron Wan-Bissaka, Victor Lindelof and Luke Shaw for company.",
        "The Algerian tried his luck from 20 yards but his shot lacked any real menace and De Gea should have made a routine save.But the ball seemed to spin away from the Spaniard as he attempted to push it away, and instead it rolled almost apologetically into the net.",
        "Ten Hag’s men tried to hit straight back and Antony’s shot flicked the heel of Nayef Aguerd before clipping the far post.But the visitors had a lucky escape in first-half stoppage time when Benrahma broke through again.De Gea saved the winger’s initial shot and his attempt to turn the rebound back into the box clearly hit the hand of Lindelof.",
        "If anything the Swedish defender got a better hand to it than his goalkeeper did for the goal, but the penalty appeals were waved away with the VAR apparently seeing nothing untoward.United got away with another after the break when De Gea went down as he was challenged by Michail Antonio, the West Ham striker hooking the ball in only to be pulled up for a foul.Weghorst had United’s first shot on target as the hour mark approached, a tame effort from the edge of the box which was straight at Lukasz Fabianski.But West Ham, eager to put their relegation worries to bed with a Europa League Conference semi-final to look forward to, sensed something special and Tomas Soucek’s volley hit a post before the Czech midfielder’s header was ruled out for offside.Fabianski made late saves from Rashford and Anthony Martial but Ten Hag’s side offered little in their 57th match of a gruelling season which, along with Liverpool, might just be catching up with them."
    ]
}