{
    "articleURL": "/wires/pa/article-12056731/Derby-boss-Paul-Warne-heartbroken-beaten-Rams-miss-play-offs.html",
    "content": [
        "Derby boss Paul Warne admitted he felt “heartbroken” after his team were pipped to the final League One play-off spot following a 1-0 defeat at Sheffield Wednesday.",
        "The Rams were overtaken by Peterborough on the final day of the regular season after captain Curtis Davies’ 41st-minute red card led to the only goal of the game – a penalty converted by Michael Smith, who helped Warne win promotion with Rotherham last term.Davies’ dismissal could be his last act in a Derby shirt with the 38-year-old defender out of contract this summer, although Warne argued that the sending off was a mistake by referee Leigh Doughty.The County boss said: “The penalty was disappointing because we had an opportunity to clear the ball and didn’t, but I don’t think it should have been a red card because we had a defender covering on the line and our keeper was on the right side of the ball.“Curtis has had his head in his hands since the final whistle, but he’s been brilliant leading the troops on and off the pitch and has put his body on the line so many times and I feel for him.“I really feel for the lads too because, for large parts of the game, with 11 men and 10, I thought we were the better team and the lads left everything out there.",
        "“Then, at the end, you see Sheffield Wednesday v Peterborough on the scoreboard and, whilst I’m proud to be the lads’ manager, I’m heartbroken for them.",
        "“We made positive changes from the bench because we had to be aggressive and we had a few good chances, but it wasn’t to be.”Wednesday were already guaranteed to finish third in the table, having seen their automatic promotion bid scuppered by a six-game winless run from mid-March.But the Owls go into the play-offs having won their last four contests and on an unbeaten run of 23 home games, with manager Darren Moore saying: “To finish on 96 points and break all sorts of club records is testament to the work everyone has put in.“It could have been easy to rest a few players, but every game matters at Sheffield Wednesday and we want that winning culture.“We don’t want to rest on our laurels and we wanted to go full tilt before dusting ourselves down for the play-offs. When Hillsborough is in full voice like it was today, you have to go a long way to find another club like it and the supporters drove us on in this match.“For them to then stay behind after the game to show their appreciation to the team was a special moment.”On Smith netting his 20th goal of the season, Moore added: “To get your striker scoring 20 goals is huge and shows what a wonderful signing he was.",
        "“I also think if Josh (Windass) had stayed fit, he would have got 20 goals too.”"
    ]
}