{
    "articleURL": "/wires/reuters/article-12040059/North-Carolina-Republicans-reach-agreement-12-week-abortion-ban.html",
    "content": [
        "By Sharon Bernstein",
        "May 2 (Reuters) - Republican lawmakers in North Carolina said on Tuesday they had reached agreement on a plan to limit most abortions to the first trimester of pregnancy, a sharp drop from the state's current limit of 20 weeks gestation.If passed, the proposed legislation would reverberate beyond North Carolina, limiting options for women who have been traveling there to obtain abortions after the deeply conservative Southern states where they live banned or more severely limited the procedure.The proposal is the latest effort by lawmakers in Republican-dominated state legislatures to limit abortions after the U.S. Supreme Court overturned the constitutional right to end a pregnancy last year. \"The bill that has been developed is a commonsense, reasonable approach to restricting second and third trimester abortions,\" state senate leader Phil Berger said at a news conference. The legislation would limit elective abortions to 12 weeks' gestation, with exceptions for rape, incest, life-limiting fetal anomalies and the life of the mother.The measure also includes funding for contraception, foster care, paid parental leave and other measures that backers said were meant to support mothers and children.It drew immediate condemnation from Democrats.North Carolina Governor Roy Cooper, a Democrat, said on Tuesday he \"strongly opposed\" the measure.\"This proposal erodes even further the freedom of women and their doctors to make deeply personal health care decisions,\" Cooper said on Twitter.",
        "But Cooper's power to veto the bill if it passes is limited. Republicans now hold a large enough majority in both houses of the legislature to override his veto.The move by North Carolina Republicans comes days after a far more restrictive anti-abortion bill was successfully blocked in neighboring South Carolina by a group of five women lawmakers, three of them Republicans.(Reporting by Sharon Bernstein; Editing by Ross Colvin and Stephen Coates)"
    ]
}