{
    "articleURL": "/wires/pa/article-12049747/Mum-life-support-infected-finger-led-devastating-leukaemia-diagnosis-says-giving-wasn-t-option.html",
    "content": [
        "A mother-of-three who noticed her finger had become infected as it was “all swollen and green” and was put in an induced coma after a “devastating” leukaemia diagnosis which left her battling for life has said “it was never an option to give up”.",
        "Now celebrating being almost six years cancer-free, Peppie Scobbie, 53, who lives in Larkhall, South Lanarkshire, said she did not “feel right” while holidaying in Portugal in July 2017 – after which she returned home and noticed her finger had gone green and was “swollen” and “throbbing”.After antibiotics failed to treat the apparent infection, she was diagnosed with acute myeloid leukaemia (AML) – a type of blood cancer – aged 47, and underwent three “intense” rounds of chemotherapy, which made her hair “fall out in clumps”.",
        "During the first round of treatment, Peppie developed pneumonia and sepsis and was put in an induced coma and on life support, which made doctors question “whether she was going to make it”.Amazingly, Peppie “bounced back”, completed all three rounds of chemotherapy, and was told she was cancer-free just before Christmas in 2017.Peppie then received a stem cell transplant from her older brother Tom McClure in January 2018 – a form of treatment for certain types of cancer – as she knew that if she did not have this, she would “relapse and die”.",
        "Thanks to her treatment, she was able to marry Stevie, a 51-year-old foreman, in 2020, and her brother-turned-donor Tom walked her down the aisle.Now, despite being told she will be in “chronic pain for the rest of her life” and suffering with severe side effects as a result of her medication, she will soon celebrate being six years cancer-free and wishes to share the message that “there’s light at the end of the tunnel”.",
        "“I have days where I could cry,” Peppie said.“I could lie in my bed at night and cry because it upsets me, and I always say, ‘Why me? Why did this have to happen to me?’",
        "“But I want to be here and live a life as best I can, considering what’s against me.“It was never an option for me to give up; it never ever has been and never ever will be.”Peppie first noticed she “didn’t feel (herself)” during a holiday in Portugal in July 2017.After returning home and resuming work with her cleaning business, from which she has since retired, Peppie said a client’s dog jumped on her arm and it felt like “an electric shock”.",
        "Her arm went “black and blue” within a matter of hours, which she thought was “strange” but initially “didn’t think anything of it”, however, this soon changed.“I dragged myself out my bed every morning to go to work, but I was screaming inside because I just knew there was something not quite right with me,” Peppie said.Peppie then noticed the skin on the middle finger of her left hand had become infected.The finger was “throbbing” but three courses of antibiotics prescribed by her GP did nothing to alleviate the symptoms.",
        "On August 16 2017, Peppie underwent blood tests and the following day she received a phone call from her doctor saying she had a high white blood cell count and low haemoglobin levels.Just 30 minutes later, she received a second call and was told she had leukaemia.She said she was “devastated”.",
        "“I felt physically sick”, Peppie said.“You just read about things like that, and you hear it about other people, but you don’t expect to hear that about yourself.“It was a bit surreal.”On August 18, the day after receiving the news, it was confirmed Peppie had AML and she began her first round of chemotherapy.",
        "Peppie said she did not have time to process her thoughts as her “brain went numb”, but the only question she had in her mind at that time was ‘am I going to survive this?’”“I just kept thinking, am I going to die?” Peppie continued.“Then I thought, no, don’t put that in your head, because if I start thinking thoughts like that then it’s just going to consume me and it’s going to bring me down.“I tried not to think about the bad side of things, I tried to be positive.”",
        "However, after starting chemotherapy Peppie said she began to develop a temperature.",
        "She was taken to the high-dependency unit where she lost consciousness, before being moved to the intensive care unit (ICU) at University Hospital Monklands – where she was put in an induced coma and placed on life support for two weeks.It was later discovered she had developed pneumonia and sepsis.",
        "Peppie was visited by her family during this time, and doctors did not know “whether she was going to make it”, but thankfully, “the will and the fight was there”.“I was told about a week afterwards that not many people survive and come back up the stairs the way I did,” Peppie said.Peppie then started her second and third rounds of chemotherapy, and while she did not have any major complications, the medication she was taking made her “hallucinate” and she lost her hair.This led to her shaving her head, which was “a hard pill to take”.",
        "“I couldn’t even look in the mirror because all I could see was this person that had cancer, who was ill, and it took me a long time to see past that person,” she said.By Christmas, Peppie was told she was in remission, which was “the best outcome”, and she was able to spend time with her family and now-husband.",
        "She was also told that her older brother Tom McClure was the perfect match for a stem cell transplant, and she received this in January 2018.She had another transplant in June, but was then diagnosed with graft versus host disease – where white blood cells attack the patient’s own body – causing severe illness and damage to the skin on her feet and hands.",
        "After recovering from this, Peppie married Stevie on February 14 2020, and Tom walked her down the aisle, as their father, Thomas, had passed away from pulmonary fibrosis in 2015.She said she “couldn’t think of anyone better to stand in for her dad”.Although Peppie is now nearly six years cancer-free, she is still taking numerous medications, including immunosuppressive drugs and steroids.",
        "As a result of taking steroids, Peppie said her gut and mouth have been permanently affected and she develops ulcers; she has avascular necrosis, which affects blood supply to the bone; she has undergone two knee replacements; and she has been diagnosed with osteoporosis – a condition that weakens bones.She also has blood tests every fortnight and recently underwent two blood transfusions.Although she is in pain “every single day”, she still goes to aqua-fit classes three times a week, sees her friends, and walks her two dogs, Lily and Cooper.",
        "The grandmother-of-five said her family keep her strong because “they mean everything to me”, and she hopes that she can offer a “glimmer of hope” to those going through cancer treatment by sharing her story.",
        "“I’m five years post-transplant and I’m still here, I’m still living my life,” she said.“It’s maybe not the best quality life – most days it is – but you’ve just got to cling on to that hope and that positivity to get you there, and obviously have good family and friends to help you achieve that.“There’s light at the end of the tunnel.”Leukaemia UK is investing in life-changing research into more effective treatments for AML and other types of blood cancer. For more information, visit: leukaemiauk.org.uk"
    ]
}