{
    "articleURL": "/tvshowbiz/article-12044493/Alabama-Barker-17-claps-critics-shame-style-makeup.html",
    "content": [
        "Alabama Barker sent a message to critics of her makeup practices on social media.",
        "The 17-year-old daughter of Travis Barker and Shanna Moakler used TikTok to air her grievances toward her online haters.Alabama - who's an ambassador for Pretty Little Thing - wrote over a clip of herself laughing: 'When Kathryn with 3 kids, only waterline liner, 4 different colored blonde [hair] &amp; Toms shoes talks about my makeup or age.'The snippet also showed the influencer mouthing, 'I'll tell you what you look like, but you won't like it.'Barker is often criticized by trolls who think she dresses and acts too mature for her age. ",
        "Some of Alabama's followers used the comments section to show support for her.One fan wrote, 'This 44-year-old momma loves your hair, makeup, outfits, vibes and videos!'Someone else added, 'Let them know sis!' and another said, 'I'll never understand why young girls takin' care of themselves is frowned upon. You are gorgeous. I love it!'Someone else offered, 'I think people are just concerned about the over sexualization of youth in Hollywood/Los Angeles culture.'To that, the blonde makeup mogul replied, 'Well, I'm doing great thank u.'Barker has an older brother, Landon, who is 19. And she's also younger sister to Atiana De La Hoya, 24, who her mom Shanna shares with ex Oscar De La Hoya.",
        "The young woman regularly entertains 1.7 million followers on Instagram and she boasts 3.6 million fans on TikTok.In March 2021 Alabama showed off her makeup prowess as she applied foundation to her dad's face using KVD Beauty's Good Apple Skin-Perfecting Foundation Balm. ",
        "Barker's mom Shanna appeared to take a shot at Kourtney Kardashian last month as she blasted the reality star for posting 'more of my kids than her own' on social media.After Moakler, 48, shared a selfie asking 'Is it Friday yet,' a fan chimed in stating they hoped Shanna would one day receive a 'huge apology' from Kourtney, 44, and Travis Barker after their Hulu wedding special aired.'I hope that you get a huge apology some day for what was said on that exploitative, money grabbing, circus. 'He's been through Hell' 'Kourtney has filled a void for me.' #parentalalienationawareness,' the person commented.Moakler commented back: 'She [posts] more of my kids [than] her own lol.'Shanna has had a bumpy relationship with her two younger children, although things seem to be looking brighter these days.",
        "Alabama has expressed love for both her mom Shanna and stepmom Kourtney on social media.Sharing one of her mother's throwback glamour shots, she wrote, 'Happy birthday to this beautiful twin of mine, I love you momma. You have taught me how to be a woman in many aspects, from being miss USA to being the hottest 48-year-old on the planet.",
        "She added, 'I'm so happy to call you my mom and my friend, I love you more [than] words can describe. Live it up.'AAnd on Kourtney's birthday she gushed, 'I wouldn't want another stepmom.'"
    ]
}