{
    "articleURL": "/wires/ap/article-12046193/WHO-fires-scientist-led-COVID-search-sex-misconduct.html",
    "content": [
        "GENEVA (AP) - The World Health Organization says it has fired the scientist who led a high-profile delegation from the U.N. health agency to China two years ago to jointly look into the origins of the coronavirus pandemic, citing sexual misconduct.",
        "Peter Ben Embarek, who led the WHO side of a joint team with scientists in China, was dismissed last year, the health agency said. WHO says it has stepped up efforts to root out sexual abuse, exploitation and harassment in recent months after a string of cases and incidents were reported in the press.\"Peter Ben Embarek was dismissed following findings of sexual misconduct against him and corresponding disciplinary process,\" said spokeswoman Marcia Poole said in an email. \"The findings concern allegations relating to 2015 and 2017 that were first received by the WHO investigations team in 2018.\"She said other allegations could not be fully investigated as the \"victim(s) did not wish to engage with the investigation process.\"Ben Embarek did not immediately respond to a call or text message to his mobile phone on Thursday. The news was first reported by The Financial Times.Ben Embarek led an international team picked by WHO that traveled to China in early 2021, visited the Huanan market in Wuhan - the city where the first human cases appeared - and worked closely with Chinese scientists to try to identify how the virus first began sickening people.",
        "The team issued a report in March that year that said the most likely scenario was that COVID-19 jumped from bats to humans via another animal, dismissing a lab leak as \"extremely unlikely.\" WHO officials, including Director-General Tedros Adhanom Ghebreyesus, have since said that the origins remain unclear and the lab-leak theory cannot be ruled out.",
        "Ben Embarek, a Danish expert on disease transmission from animals to humans, told a TV program in Denmark later in 2021 that he had concerns about a Chinese lab near the market later in 2021.The impact of Ben Embarek's dismissal on efforts to solve that lingering enigma remains unclear. The joint WHO-China team has since been disbanded, and a separate panel of experts drafted by WHO has taken up the role of trying to find the origins of the coronavirus.Word of the dismissal comes as WHO is convening an expert group this week to decide if COVID-19 remains an international health emergency, after sharp declines in case counts and deaths from the pandemic in recent months - even if pockets of cases continue.WHO says it has been working to root out sexual abuse, exploitation and harassment in its ranks after press reports first arose in 2020 about systemic abuse of dozens of women during the agency's response to an Ebola outbreak in Congo.More than 80 staffers under the direction of WHO and partners were alleged to have raped women and young girls, demanded sex in return for jobs and forced some victims to have abortions, in the biggest known sex abuse scandal in the U.N. health agency´s history.",
        "Not a single senior manager connected to the Congo abuse has been dismissed, despite documents showing WHO leaders were aware as it was happening. An internal U.N. report submitted to WHO earlier this year found that despite senior managers being informed of the sexual abuse, no misconduct was committed.Last month, WHO said it fired Fijian doctor Temo Waqanivalu, who faced allegations first reported by the AP, that he had repeatedly engaged in sexual harassment."
    ]
}