{
    "articleURL": "/wires/reuters/article-12058805/Bringing-Ukraine-closer-Europe-Zelenskiy-marks-1945-Nazi-surrender.html",
    "content": [
        "By Elizabeth Piper",
        "KYIV, May 8 (Reuters) - President Volodymyr Zelenskiy marked the anniversary of the surrender of Nazi Germany in World War Two by saying on Monday he would formalise a day of remembrance in Ukraine on May 8 when other Western countries celebrate Europe's victory.Speaking to the nation on a hill overlooking Kyiv, Zelenskiy said \"the old evil\" had returned, this time waged by a \"modern Russia\" pursuing the same goal as the Nazis of \"enslavement and destruction\" - but that they would not succeed.Further cementing Ukraine's break with its Soviet past, Zelenskiy said he had submitted a bill to parliament officially making May 8 a day of remembrance and victory, while May 9 - when Russia marks victory day - would become Europe Day.\"We are returning to our state an honest history without ideological influences. It is on May 8 that most nations of the world remember the greatness of the victory over the Nazis,\" he said in a video posted on the president's Telegram channel.\"Today, I signed the relevant decree, and every year from tomorrow, May 9, we will commemorate our historic unity - the unity of all Europeans who destroyed Nazism and will defeat rashism,\" he said, using a word Ukrainians have coined to describe what they call Russian fascism.",
        "\"The unity that brings peace closer.\"For Russia, May 9 is one of its most important national events - a remembrance of the enormous sacrifices made by the Soviet Union in defeating Nazi Germany. Soviet Russia and Soviet Ukraine sustained appalling loss of life in the war.Nazi Germany's unconditional surrender came into force at 11:01 p.m. on May 8, 1945, which was already May 9 in Moscow. Russians call the war the Great Patriotic War of 1941-45.Moscow has stepped up attacks on the Ukrainian capital Kyiv and other cities across the country before May 9, and some commentators say Vladimir Putin wants to secure some kind of victory in the grinding war to coincide with the holiday.Zelenskiy said Europe could not let that happen and it was again time to defeat \"evil\" together \"to ensure that no one ever enslaves other peoples or destroys other countries again\".\"We do not yet know the date of our victory, but we know that it will be a holiday for the whole of Ukraine, for the whole of Europe, for the whole of the free world.\" (Reporting by Elizabeth Piper and Olena Harmash, editing by Mark Heinrich)"
    ]
}