{
    "articleURL": "/wires/reuters/article-12050521/US-regional-lenders-eke-gains-brutal-sell-off.html",
    "content": [
        "May 5 (Reuters) - Shares of U.S. regional lenders rose in premarket trading on Friday following a brutal sell-off during the week that saw First Republic Bank collapse and peer PacWest Bancorp explore strategic options. Western Alliance and PacWest Bancorp led gains, up 13.4% and 12.3%, respectively, while Zion Bancorp, Keycorp, First Horizon Corp, Comerica Inc and PNC Financial rose between 2.5% and 6.6%.",
        "Wall Street executives and bank analysts have urged regulators to provide greater protection for bank deposits and consider other backstops, arguing only a strong intervention could stop the banking crisis as First Republic Bank became the third major lender to have failed since March.The KBW Regional Banking Index has plunged about 31% this year as the sector grapples with deepening investor concerns with billions in market value wiped in recent weeks. The index has declined 12.1% so far this month.\"You clearly have a situation whereby the market is probing the weakest links after Silvergate, Silicon Valley Bank and First Republic,\" said Russ Mould, investment director at stockbroker AJ Bell.PacWest, whose shares have plummeted 86% this year, said late on Wednesday it was in talks with potential partners and investors as it weighs strategic options.Meanwhile, Canada's Toronto-Dominion Bank Group on Thursday called off its $13.4 billion takeover of First Horizon, citing uncertainty over when the deal would be approved by regulators. Shares of the bank plunged to close down 33%.Western Alliance shares pared losses after plummeting nearly 60% following a Financial Times report that the lender was exploring strategic options, including a potential sale of all or part of its business. The bank denied the FT report.",
        "(Reporting by Manya Saini in Bengaluru; additional reporting by Amruta Khandekar Editing by Vinay Dwivedi)"
    ]
}