{
    "articleURL": "/money/markets/article-12050393/Halma-acquires-pipeline-renovation-firm-Sewertronics.html",
    "content": [
        "Sewertronics has agreed to be bought by Halma for €41m (about £36m) upfrontThe company specialises in restoring sewer pipes without digging any trenchesBuckinghamshire-based Halma has acquired seven firms since the start of 2022 A Polish wastewater pipeline repair business has become the latest company to be snapped up by Halma.",
        "Sewertronics has agreed to be bought by the British safety equipment maker for €41million (about £36million) upfront, with up to €18million in additional payouts contingent on fulfilling certain closing conditions.Based in Rzeszów in southeastern Poland, the company specialises in restoring sewer pipes by fitting them with lining material that is subsequently cured with ultraviolet LED technology. ",
        "Aside from not having to dig trenches, Halma said the firm's technology is more efficient, environmentally friendly, less disruptive and safer than using hot water or steam. The Buckinghamshire-based group said the business would be integrated into its environmental and analysis segment and work in tandem with manufacturing subsidiaries Minicam and Dancutter.Completion of the deal is expected by the end of May.Sewertronics represents Halma's third takeover since the start of 2023, having bought fire extinguishing systems designer FirePro in March and water leak and heat detection equipment maker Thermocable three months ago.In the previous year, FTSE 100-listed Halma acquired four companies, including US-based IZI Medical Products for £138million, Weetech Holdings and underwater robots manufacturer Deep Trekker.Buying up more companies has been a central pillar behind the firm's expansion and helped increase its profits for the past 19 consecutive years. Marc Ronchetti, who became Halma's chief executive last month, said: 'Sewertronics is highly aligned to our purpose, helping to protect the environment by reducing blockages and leakage in wastewater pipes.",
        "He added that the company's growth would benefit from the rising importance of mending old wastewater infrastructure and investment in machinery that minimises the disruption caused to surrounding areas by repairs.In recent years, the UK water industry has been the target of escalating public anger over concerns that they have failed to stop vast quantities of sewage from being pumped into Britain's rivers and coastal areas. Sewage was discharged on over 301,000 occasions into English waterways and seas in 2022, with United Utilities and Yorkshire Water the worst offenders, according to the Environment Agency.Though this was a drop of almost a fifth on the prior year, the regulator attributed the fall to unusually dry weather rather than the actions of the water industry.Last week, the Government announced it would introduce legally binding targets with the intention of eliminating sewage spills into the UK's rivers by the middle of the century.Cesar Gomez, chief executive and founder of Sewertronics, said: 'Overcrowded cities, heavy downpours and climate change are all putting increasing pressure on wastewater infrastructure.''Our technology helps to prevent wastewater pollution while maximising efficiency and safety when repairing pipes and avoiding the need for disruptive and expensive excavation. 'Sewertronics is highly aligned with Halma's purpose of growing a safer, cleaner, healthier future for everyone, every day.'",
        "Halma shares were 0.1 per cent up at £23.90 on late Friday afternoon and have risen by approximately 17 per cent since the start of the year.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}