{
    "articleURL": "/news/article-12059365/Neo-Nazi-Texas-mall-shooter-Mauricio-Garcia-removed-Army-mental-health-concerns.html",
    "content": [
        "Mauricio Garcia killed eight people on Saturday at Allen Premium Outlets Investigators believe he may have been a white supremacist or neo-Nazi READ MORE: Missouri teenager, 19, with Nazi flag who crashed U-Haul into White House security gates is charged with threatening to murder President Biden Texas mall shooter Mauricio Garcia, 33, was a security guard who was removed from the Army in 2008 over mental health concerns, it has been revealed.",
        "Garcia, neo-Nazi who was living in a Budget Inn in Texas, killed eight people and injured five others outside the H&amp;M store at Allen Premium Outlets in Texas on Saturday afternoon. A police officer who was at the scene responding to another call shot Garcia dead when he heard the shots. While his motive remains unconfirmed, law enforcement sources say  social media pages show he had neo-Nazi interests. One profile on the site OK.RU that is believed to belong to the gunman contains posts about white nationalism and tattoos. ",
        "He also served in the military in 2008 but was removed over mental health concerns. Neighbors say they believe Garcia was working as a security guard but it's unclear if he held a job in the mall or at another store.CNN reports that he had a license to work as a security guard in Texas between 2016 and 2020, but that the license expired. According to the Washington Post, a patch the gunman was wearing on his chest alluded to his extremist ideologies - although no formal motive has been released. The patch read 'RWDS' which is an acronym for 'Right Wing Death Squads.' An Army spokesman tells DailyMail.com he was enlisted for three months in 2008, but was removed before he was ever deployed. ",
        "'Mauricio Garcia entered the regular Army in June 2008; he was terminated three months later without completing initial entry training. He was not awarded a military occupational specialty. He had no deployments or awards,' the spokesman said. This comes after new audio revealed how the heroic officer made a frantic phone call begging for his colleagues to join him on the scene, radioing: 'I need everybody I got.' Survivors have also recalled being saved by a hero shop worker who locked them in a bathroom closet before being killed themselves. She began her impromptu shopping trip by pulling up to the same H&amp;M store where Garcia would arrive in his own car moments later and open fire. Lee said it 'sounded like a warzone' as frantic shoppers started fleeing from the hail of bullets.In the chaos that ensued, the unnamed store associate gathered a frantic Lee and 12 others, including several children, and hid them inside the store's bathroom closet. The worker then left the group, and Lee hours later was escorted out by police.",
        "On her way out, Lee recalled realizing that among the mass of 'bullets and bodies' outside, was the same store worker that hid her barely an hour before. The officer bravely ran towards the active shooter - who was armed with 60 rounds and had shot more than a dozen people by this point - and killed him.",
        "About two minutes after first calling for backup, the cop said: 'I got him down.'  Minutes later, another voice is heard on the radio saying: 'We got victims. I need an ambulance.' The FBI and police raided dead Garcia's Dallas home just one hour after the massacre and requested a translator to speak with his family. Neighbors say they often saw Garcia wearing a security guard-type uniform, but he was 'very quiet' and had 'very unusual behavior.'His gray Dodge Charger, which was seen at the scene, was often parked outside the home.",
        "Dashcam video showed gunman Mauricio Garcia getting out of a car and shooting at people on the sidewalk on Saturday afternoon. More than three dozen shots could be heard as the vehicle that was recording the video drove off.Garcia was using an AR-15-style gun during the mass shooting, and was dressed in full tactical SWAT gear. Allen Fire Chief Jonathan Boyd confirmed that seven people died at the scene, including the gunman, and then a further two victims died in hospital. Three of the wounded were in critical condition in the evening, and four were stable, Boyd said in an update on Saturday night. A Dallas-area medical group said it was treating victims as young as five-years-old. Investigators confirmed they believe shooter Garcia was working alone, but they have not yet released any motive for the killings. ",
        "Fontayne Payton, 35, was at H&amp;M when he heard the sound of gunshots through his headphones. He said: 'It was so loud, it sounded like it was right outside.'I pray it wasn't kids, but it looked like kids,' he said. The bodies were covered in white towels, slumped over bags on the ground. 'It broke me when I walked out to see that.'",
        "Payton then saw the body of the dead shooter - which was the only one not covered, he recalled. Another witness, Kimberly Blakey, said she and her daughter, 14, were among the crowd of people rushing to flee the parking lot after the gunfire started.She said the raining bullets were 'non-stop.' Her car got shot at during the ordeal as she tried to escape. Blakey told CNN: 'I told my daughter to get down. I could hear her start praying.' Another witness, Sheliza Ramlall, who was in the Nike store when the violence broke out, said: 'I had the most horrifying experience earlier. I was standing in line at the Nike store when all of a sudden people started to scream and run. 'The people in the doorway saw the man with the gun outside and raised the alarm. All of us in line dropped to the floor and started to crawl looking for a hiding place while falling over each other. ",
        "'I crawled behind the counter. At that moment, I realized that we were right in plain sight and and figured that I needed to get away from the front. ",
        "'As I looked to the back of the store, I heard someone saying ‘get to the back, get to the back’ and everyone started running at that point. An employee opened the back door and let us out. We are standing by the roadside shaken, crying, and hugging each other.'Not knowing where the gunman was or what was happening on the other side was terrifying but I wanted to get out of there so I left the crowd and started to flag the cars down to give me a lift. 'An elderly woman stopped and I hopped in a panic. She started to tell me about the gunshots she heard and drove me to my car. I raced out of there with an elevated heartbeat. 'I am grateful for our brave first responders who stopped the shooter and helped the people to safety.'"
    ]
}