{
    "articleURL": "/sport/football/article-12043815/PETE-JENSON-Real-Madrid-convinced-Jude-Bellingham-heir-Luka-Modrics-throne.html",
    "content": [
        "Jude Bellingham set to join Real Madrid this summer after fierce speculationReal Madrid convinced the 19-year-old he is the heir to Luka Modric's throneSpanish giants beat off competition from almost all of Europe's true giants Replacing Luka Modric was never going to be easy, but Real Madrid believe Jude Bellingham is the player to do it. That’s also how they have sold the transfer to the 19-year-old — persuading him to turn down bigger offers from the Premier League to become the heir to Modric’s throne.",
        "Madrid have pursued Bellingham since the start of the season but there was a fear at the Spanish club that they would be eclipsed by the pull of a return to England and by the superior financial power of Manchester City.They knew they had to convince the player first, and there is now a sense that the courting has paid off and that structuring payments with Borussia Dortmund — with whom they have a good relationship — will be the easier part of the deal.It has been noticeable that Modric has still not signed a new deal, while Toni Kroos’ future has been sorted out. There has been suggestions that Modric, whose contract runs out at the end of this season, had an offer from a Saudi Arabian club and would move on in summer. Bellingham would take his place, and quite possibly his No 10 shirt and his £18million basic gross salary.Moving on the legends of the club’s greatest ever midfield is not easy. Casemiro was sold to Manchester United last year to make way for Aurelien Tchouameni. And if this deal goes through it will be the next phase in a revamp that suggests they can still dominate Spain and Europe for the next decade.",
        "Bellingham turns 20 next month. Tchouameni is 23 and Eduardo Camavinga 20. The prospect of that trio playing behind the Brazilians Vinicius Junior (22) and Rodrygo (22), and the Uruguayan Fede Valverde (24) gives Real the belief that they have negotiated a tricky changing of the old guard.",
        "As with the signings of the three South Americans — each before they turned 20 — Madrid’s chief scout Juni Calafat was key. He met with Bellingham’s father Mark earlier this year and that constant communication has helped persuade the player and his family that Madrid were serious about making him the marquee signing for the 2023-24 season when they will complete work on the 85,000 Santiago Bernabeu.Real were once the club who operated on the whim of their president throwing money at the latest Ballon d’Or winner and only buying a player once he had become the world’s best. Now they sign players long before they have matured and are trusted to nurture and not trash young careers.",
        "There is still work to do. Madrid are wary of not upsetting Dortmund, whose current valuation — rising to 140m euros with add-ons — is seen as accessible over a six-year deal. The German club need to be shown respect while they are still in the Bundesliga title race.The length of Bellingham’s contract (until 2025) also means Dortmund can step away if Madrid try to take advantage of the fact that they now seem to be the only seriously-interested party.La Liga will be hoping the transfer can happen. The talent drain to England has hurt the competition. Bellingham might not have quite the appeal of Kylian Mbappe who Madrid missed out on last summer.",
        "But he was set to be the big Premier League arrival and if they can sign him it will be seen as an important coup."
    ]
}