{
    "articleURL": "/sport/afl/article-12044975/Say-face-Under-fire-coach-hits-critics-amid-sides-bleak-record.html",
    "content": [
        " Angry coach challenges journalists to confront him Hardwick feeling the pressure after string of losses Claims 'we are going to be very hard to beat'Richmond coach Damien Hardwick has hit out at media 'narratives' critical of him and the club, adamant his players remain capable of salvaging the poor start to the season.",
        "The Tigers are languishing in 16th spot on the ladder, with rebuilding sides Hawthorn and West Coast - who the club faces on Saturday afternoon - the only clubs sitting below them.Hardwick said he was 'incredibly flat and frustrated' with where the club was but declared he still had the desire to coach the club long term.Richmond faces the nightmare scenario of giving up a prized first round selection (currently pick three) to Greater Western Sydney after the Jacob Hopper trade last year, but Hardwick said he would much prefer the proven player than 'magic beans'.The Tigers have been cruelled by injury this season and will get some relief this weekend, with premiership midfielders Dion Prestia and Jack Graham set to return against the Eagles.",
        "Responding to claims Hardwick had potentially lost the players, the coach was blunt.'It's their narratives. That's the reality, it's easy to sit there and say those comments when they're sitting behind a desk - come and say it to my face,' he said.Hardwick said it was an easy fix for the Tigers to return to their best, with the three-time premiership coach having full faith that his playing group can turn it around.'One of those ones you sit back and reflect and the overriding things 'why things how they are'. And it's a bit like everything - you're never quite as bad as you seem,' Hardwick said.",
        "'It's a relatively simple fix for us, our energy and intensity weren't anywhere near the level that we'd like and that's something we spoke about with our players.'Narratives are part of the AFL landscape and we understand that. And where we are on the ladder probably opens us up to that, but the fact of the matter is to change the narrative, we've got to win some games.'I think our list is well and truly capable. Many people would go 'you're kidding yourself', but the fact of the matter is I've got incredible belief in this group of players.",
        "'We are nowhere near where we need to be, but I certainly think we are capable when we get our game up and going, when we get some players back into the side, we are going to be hard to beat.'Spearhead Tom Lynch is out of a moon boot but is still sidelined for the medium term, while ruckman Toby Nankervis, who is back running, won't return for another fortnight.Hardwick, who is contracted until the end of 2024, insists he is still incredibly driven in his 14th year at the helm and said he'd had open conversations about his future with chief executive Brendon Gale.'Yeah, I do (have the passion to coach), it was just one of those games where you couldn't seem to get anything to go, or anything to work and our players felt that as well, and that's when you do feel flat,' Hardwick said.",
        "'Look, did it come across a little bit like that? Yeah it probably did, but the fact of the matter is I was probably feeling like any supporter in this organisation, incredibly flat and frustrated with where we are at.'But once I sit there in the cold hard light of day and review the tape and work through a few things, I feel a hell of a lot better.'",
        "Hardwick threw his support behind Gale to take up a role at AFL House or the Tasmanian team but wouldn't comment on concerns over the process in which Gale missed out on the AFL chief executive role.He said the Tigers would be willing to let him go for the greater good of the competition.'I think Brendon is a superstar at what he does. I think either way the AFL went, whether it was Andrew Dillon or Brendon Gale, they would get a superstar of the competition,' he said.'Don't get me wrong, I love our guy here, he has been outstanding for me and outstanding for our footy club, but once again if it is going to give the game a broader scope or offer it to improve, then that's what Richmond does, we provide the opportunity.'"
    ]
}