{
    "articleURL": "/wires/reuters/article-12057513/Royals-salvage-finale-vs-As-starter-Ryan-Yarbrough-injured-win.html",
    "content": [
        "Salvador Perez homered and Ryan Yarbrough won a start for the first time since August 2021 as the host Kansas City Royals beat the Oakland Athletics 5-1, salvaging the final game of the weekend series.",
        "It was a painful victory for Yarbrough (1-4), who was struck on the left cheek by Ryan Noda's line drive, with an exit velocity measured at 106 mph. Yarbrough was helped off the field and the Royals said he was \"alert\" and undergoing testing.Yarbrough allowed one run on three hits over 5 2/3 innings, his longest start since July last year with the Tampa Bay Rays. It was the longest start by a Royals pitcher since Brady Singer threw six innings against Arizona April 25.Kansas City snapped a three-game slide, winning for just the third time in 19 home games.Perez had three of Kansas City's nine hits and scored three runs. He has hit safely in 10 of 11 games, batting .429 (18-for-42) with five homers.Perez opened the scoring in first drilling a two-out solo blast 462 feet to left-center. He turned around a 100-mph fastball by rookie Mason Miller (0-2), who allowed his first career home run, snapping a 10 1/3-inning hitless streak.Miller finished six innings, surrendering two runs on five hits and one walk while fanning five.The A's tied the game in the fourth as Brent Rooker stole second -- the first of his career -- and scored on Ramon Laureano's infield hit. Royals second baseman Michael Massey knocked down the slicing liner, deflecting it to Bobby Witt Jr., whose short-hop throw to the plate escaped catcher Perez.",
        "The Royals retook the lead in the bottom half on Maikel Garcia's two-out RBI single, scoring Perez. Garcia has hit safely in all six games since his May 2 recall from Triple-A Omaha.Nick Pratto clubbed a two-run double as the Royals added three eighth-inning insurance runs.Three Kansas City relievers finished with 3 1/3 scoreless innings. Royals pitchers permitted just four singles, the fewest hits allowed since a 10-1 win April 12 against the Texas Rangers.--Field Level Media"
    ]
}