{
    "articleURL": "/wires/ap/article-12048101/Official-At-2-dead-killings-south-Georgia-town.html",
    "content": [
        "A man recorded by a security camera fatally shooting his manager Thursday at a fast food restaurant in rural south Georgia is also suspected of killing his mother and grandmother at their nearby homes before taking his own life, authorities said.",
        "Security video from a McDonald's in Moultrie showed 26-year-old Kentavious White shoot the store manager after getting her to come to the door Thursday morning, the Georgia Bureau of Investigation said. The footage then showed White step inside the restaurant and shoot himself.Police found the manager, identified as 41-year-old Amia Smith, and White both dead when they arrived, the GBI said in a news release Thursday evening. They also found two women related to White had been shot at neighboring homes less than 2 miles (3.2 kilometers) away. Both women died - one after being taken to a hospital, the GBI said.All three of the slain women appeared to have been shot multiple times, Colquitt County Coroner C. Verlyn Brock told The Associated Press.\"I can´t for the life of me figure out what provoked him in that way,\" Brock said in a phone interview.Brock said the slain women were the gunman's 50-year-old mother and 74-year-old grandmother, who lived next door to each other. Their names were not immediately released. Brock said his office was working to contact next of kin.",
        "Moultrie police called in the GBI take the lead in investigating the case, which often happens with major crimes in Georgia. The state law enforcement agency said its investigation is ongoing.",
        "Jerry Goodwin lived next door to the gunman and his mother and two doors down from the grandmother. He told The Associated Press on Thursday that his wife heard shots fired before 1 a.m. Thursday, while he was asleep. Goodwin said the young man who lives next door had come outside and fired a gun one day earlier in the week while shouting something, and that Moultrie police had responded.However, it appears police did not respond immediately on Thursday. Goodwin said police and an ambulance arrived just before 6 a.m., with the ambulance immediately taking one person away. He said the coroner later retrieved two more bodies.Goodwin said he didn't know his neighbors well, although the man had come to his house after moving in several years ago to seek advice on installing a fence.\"I had never seen him hurt anybody or try to hurt anybody before this,\" Goodwin said.Moultrie Police Chief Sean Ladson did not immediately return email messages seeking comment. A person answering the phone at police headquarters said Ladson was referring all calls to the GBI.Moultrie resident Tanner Strickland said he knew two of the slain women.\"Both them were two of the most amazing people I´ve had the pleasure of being around,\" Strickland told WALB-TV. \"They both light up any room that they walk into. Both of them really have hearts of gold.\"",
        "Sabrina Holweger, who works at an optometrist´s office next to the McDonald's, told the AP she and a coworker arrived at work before 8 a.m. to find a woman's body gunned down and lying in a doorway of the restaurant, with police swarming around.\"It was really just scary not knowing if they had shot themselves,\" Holweger said.She said police blocked off a main street that runs in front of the McDonald´s in the city of 15,000.Holweger said the woman who died at the restaurant was the early morning manager, and that the shooter had been an employee there. Holweger said it appeared that the man killed the woman when she unlocked the door to let him in for an early-morning shift.George Suarez, owner and operator of the McDonald's in Moultrie, said the restaurant will remain closed until further notice.\"We are devastated by the loss of our beloved restaurant manager, and our hearts go out to all the victims of this senseless act of violence,\" Suarez said in a statement provided by McDonald's corporate office in Chicago.The killings in Moultrie, in rural Colquitt County about 60 miles (95 kilometers) northeast of Tallahassee, Florida, came a day after a gunman in Atlanta killed one person and wounded four others at a medical office.",
        "Chas Cannon, Colquitt County´s government administrator, said he was driving his daughter to school on Thursday morning when he passed the McDonald´s blocked off by police tape and patrol cars.\"A killing is pretty rare in our neck of the woods,\" Cannon said. \"It´s surprising. But this day and time, our jail´s at capacity, our local prison´s at capacity. There´s a lot of folks breaking the law, unfortunately.\""
    ]
}