{
    "articleURL": "/wires/reuters/article-12059049/Gold-firms-traders-look-U-S-inflation-data-Fed-policy-path.html",
    "content": [
        "U.S. CPI due on Wednesday",
        "Dollar down 0.1%(Updates prices)By Arundhati SarkarMay 8 (Reuters) - Gold prices ticked up on Monday as the dollar eased and economic risks prevailed, while investors prepared for U.S. inflation data to gauge the Federal Reserve's policy path.Spot gold rose 0.3% to $2,022.01 per ounce by 1156 GMT. U.S. gold futures were up 0.3% to $2,030.40.The dollar index dipped 0.1%, making bullion more attractive to overseas buyers.\"Gold remains supported as markets are still wary of further U.S. financial instability, which would only amplify U.S. recession risks. If the woes among regional banks are thrust back into the spotlight, that could trigger another leg up for this safe-haven asset,\" said Han Tan, chief market analyst at Exinity.Investors and traders are still holding on to bets that the Fed will eventually cut rates later this year, supporting zero-yielding gold, Tan added.Concerns surround the banking sector since the collapse of U.S.-based Silicon Valley Bank accelerated a flight to the safe-haven asset, helping gold post a monthly gain in April.Apart from the U.S. consumer price index (CPI) data due on Wednesday, traders are also keeping a tab on developments surrounding the country's banking sector and debt ceiling.This week's inflation readings would also follow data showing U.S. job growth accelerated in April, which also supported bets that the Fed may be compelled to keep interest rates higher for longer and triggered sharp declines in gold on Friday.",
        "\"If U.S. inflation comes in higher, the Fed may have to re-evaluate its strategy, prompting a rebound in the dollar and in turn, driving a reversal in gold,\" said Jigar Trivedi, an analyst with Mumbai-based Reliance Securities.In other precious metals, spot silver fell 0.2% to $25.61 per ounce, while platinum rose 0.7% to $1,066.91.Palladium climbed 1.5% to $1,512.42. (Reporting by Arundhati Sarkar and Arpan Varghese in Bengaluru; Editing by Sonia Cheema and Louise Heavens)"
    ]
}