{
    "articleURL": "/wires/pa/article-12060409/Coronation-celebrations-held-Northern-Ireland-bank-holiday.html",
    "content": [
        "A number of street parties and events were held on bank holiday Monday in certain communities across Northern Ireland to mark the coronation of the King.",
        "Some neighbourhoods organised street parties with music, food and dancing.Streets were decorated with Union flags and bunting, while partygoers were seen wearing red, white and blue flower necklaces and hair ties.",
        "On Woodstock Road in Belfast, an entertainment stage was set up for a festival running from midday to 9pm.Organisers also arranged arcade rides and children’s games for attendees.",
        "The mood was not uniform across Northern Ireland, with large portions of the population not marking the occasion.At a roundabout in the Andersonstown area of west Belfast, handmade signs reading “Not our King” were hung from railings.The slogan echoed that of a number of protesters elsewhere in the UK who marched with banners and T-shirts with the phrase “Not My King” on Saturday.",
        "Elsewhere on Monday, some select few people invited to take part in the coronation were taking time to reflect fondly on the event.Gillian McEvoy, an Explorer scout leader from Bangor, said she had an “amazing weekend” as she brought three scouts to represent Northern Ireland at the coronation.She was selected to be part of a group of Explorer scouts and leaders that joined other youth groups at St Margaret’s Chapel beside Westminster Abbey to watch the coronation.On being invited, she said: “I didn’t have to think for a millisecond to say: yes please.”",
        "Three lucky scouts were chosen at random from a group of 60 “exceptional” nominees.Travis Morton, 17, from Hydra Explorers in Bangor in County Down, Lucas Carswell, 17, from 51st Belfast Explorers, and 14-year-old Heidi McKay from Comber Explorers were chosen.She said: “They were great representatives of Northern Ireland scouting, they certainly did us proud.”",
        "She said part of the scout’s promise is to serve the King.She added: “Its a really big deal for us.“When the Queen died, there was a number of scouts who went over to help with the Laying in State.“It was really good they were able to fulfil that promise to the Queen.“They played such a great role there that they were asked to come along [to the coronation].”Ms McEvoy said the scouts gathered on Friday for some last-minute patch sewing and uniform inspections.Those involved were given new name tape and a special coronation badge to mark the occasion.Ms McEvoy said other older scouts were involved in crowd control during the coronation.She said scouting gives children a chance to experience the outdoors and develop in many ways.They watched the coronation on screens in St Margaret’s Church.“We did really feel like we were part of it,” she added."
    ]
}