{
    "articleURL": "/femail/article-12043863/Woman-shares-three-step-process-sliding-famous-guys-DMs.html",
    "content": [
        "Fiona Shea went viral on TikTok after sharing her direct message strategy She explained that she and her friends came up with this process togetherThe video has been viewed 2.2 million times and some fans insisted it works  A Los Angeles woman has lifted the lid on her three-step process for successfully sliding into a famous guy's direct messages on Instagram.",
        "Fiona Shea, who is known as @baddgal_fifi, went viral on TikTok after sharing her tried-and-true strategy for getting the attention of a male celebrity on social media when you reach out. 'I would like to preface by saying this was not my original idea. I have some genius friends in my life, and this was a group think,' she said. 'We entered a think tank, and we came out with this three-step process. It has proven successful — it's all I'm gonna say.'",
        "The first step is to check out your famous guy's Instagram profile and do some recon to find the 'regular dudes that he's following.' 'Maybe he works with them or maybe they're like his childhood friends,' she said. Fiona couldn't help but laugh as remembered how she and her friends tried this out in their think tank, but she didn't go into any more detail.  'You follow some of these regular guys, and, hopefully, you get one to follow you back,' she continued. 'So then you have a mutual [connection] with your famous guy.'The second step after 'you land the mutual' is to start posting live Instagram Stories. 'In a perfect world, the Stories should be of you and your hot think tank friends, and you should be in the same city as the famous guy,' she said. This is in a perfect world, which I know we don't live in one. ",
        "'But like get on my wavelength. You're going to a concert, you're going to a sporting event, you should be in proximity [to musicians and athletes].'Fiona said that once you have the mutual connection and your Stories are posted, 'it's time to slide in.'  ",
        "'You DM something along the lines of, \"If you're looking for a good time, I'm here with my friends. We'd love to link' — and drop the number,' she advised. 'You can also do this whole process with someone who's close to your target famous guy, like a manager, a friend, a brother. You get what I'm saying,' she added. 'That's probably your best bet, actually. 'Process is the same.'Fiona's video has been viewed 2.2 million times and has received nearly 2,500 comments in just two days. Fans couldn't wait to try it out for themselves and named the celebrities they planned on DMing using this method. Others who have already tested it out for themselves agreed that it does work some of the time.  'This has a 100% success rate. I was in a similar think tank with my friends and we tested and can confirm,' one person wrote. 'I used to do this and it def works like 25% of the time lmao,' another shared.",
        "'I did this and he asked me why I'm friends with his long lost childhood bff,' someone else admitted. One viewer insisted that there was a 'huge jump' from step two to step three and asked for a '2.5 step' to try before going straight to the DM. Fiona filmed a follow-up video in which she suggested a commenter's genius tip.The TikTok user said to add the famous guy to your list of close friends on Instagram and then share the Stories with him so it will come up green. 'Maybe you do a regular public story and a close friends stories and then do the DM,' she concluded. 'Bang.' "
    ]
}