{
    "articleURL": "/wires/reuters/article-12054645/Soccer-Wolves-strike-early-secure-narrow-win-Villa.html",
    "content": [
        "WOLVERHAMPTON, England, May 6 (Reuters) - An early goal from defender Toti earned Wolverhampton Wanderers a gritty 1-0 win over Aston Villa on Saturday to all but ensure Julen Lopetegui's side stay in the Premier League next season.",
        "Toti shrugged off the attentions of Jacob Ramsey to head home Ruben Neves's corner in the ninth minute and give the home side a victory that moved them up to 13th in the table.The win was a welcome boost for Wolves, who were thrashed 6-0 by Brighton &amp;amp; Hove Albion last weekend.\"Massive result for us,\" Neves told the BBC. \"After the Brighton game, it's all we have talked about. We knew we were not that team. It was a tough one to come out from with six goals against us.\"It's good how the whole team has reacted. Villa have been one the best teams in the second half of the season but I think we deserved this.\"Villa nearly equalised four minutes after the Wolves goal when Emiliano Buendia drew a diving, one-handed save from Wolves goalkeeper Jose Sa with a beautifully-struck effort with the outside of his right boot.Craig Dawson made a crucial block to deny Buendia again towards the end of the first half before Matheus Cunha passed up a glorious chance to double Wolves's lead when he blazed over the bar.Ashley Young went close after a Villa corner and Tyrone Mings fired over from close range following a free kick, but chances were at a premium in the second half with Wolves content to pack the defence and soak up pressure.",
        "Wolves moved on to 40 points, 10 clear of the relegation zone, while Villa stayed eighth after their second defeat in a row, with their chances of qualifying for Europe taking a hit.\"We are a bit frustrated,\" Villa captain John McGinn said.\"It makes it extremely difficult (to qualify for Europe) now but we have three games left and we will try to win all three. We need to react positively.\"(Reporting by Simon Jennings in Bengaluru, editing by Ed Osmond and Toby Davis)"
    ]
}