{
    "articleURL": "/wires/reuters/article-12054501/Buffett-says-imagine-U-S-debt-default.html",
    "content": [
        "By Jonathan Stempel",
        "OMAHA, Nebraska, May 6 (Reuters) - Warren Buffett said on Saturday he could not imagine Washington allowing the U.S. to default on its debt by refusing to raise the country's debt ceiling, and risk disrupting the world's financial system by letting the world \"go into turmoil.\"Speaking at Berkshire Hathaway Inc's annual meeting in downtown Omaha, Buffett also said it would have been \"catastrophic\" for regulators not to protect depositors of the recently seized Silicon Valley Bank.Buffett, 92, who is Berkshire's chairman and chief executive, and Charlie Munger, 99, a vice chairman, are answering five hours of shareholder questions at the meeting.Vice Chairman Greg Abel, 60, who would become CEO if Buffett were no longer in charge, and Vice Chairman Ajit Jain, 71, are also taking some questions.MORE PEOPLEThe meeting is the centerpiece of a weekend Buffett calls \"Woodstock for Capitalists\" that draws tens of thousands of people to Omaha. It also includes shopping discounts and events around the city.Attendance is up significantly from last year, with Berkshire receiving ticket requests from 45 countries.Unlike in 2022, the downtown Omaha arena hosting the meeting was filled to capacity.Berkshire also issued first-quarter results on Saturday.Net income increased more than sixfold to $35.5 billion, largely reflecting gains from Berkshire's stock holdings including Apple Inc, as well as higher income from investments and a performance rebound at the Geico car insurer.",
        "Berkshire also said it bought back $4.4 billion of stock in the quarter and sold $13.3 billion of other company's stock, signaling greater confidence in its own shares.Buffett said Berkshire's insurance underwriting performance will likely improve in 2023, and Berkshire will generate more income now that interest rates have risen.He said it added $7 billion of Treasury bills in April, and recently bought another $3 billion yielding close to 6%.WAITING ON LINEPrior to the meeting, thousands of people lined up outside the arena before its 7 a.m. CDT (1200 GMT) opening, often to get seats close to the stage.Many recognized it could be one of their last chances to see Buffett and Munger, given their advanced ages.Vidhya Vivekananda, an investment associate from Vancouver, said she and her husband showed up 30 minutes earlier for their first meeting.\"It has been on our bucket list for a long time,\" she said. \"We don't know how long it will be with Warren and Charlie before they pass it on.\"Yongsheng Zhao, who lives in Shanghai and is a researcher for an asset management firm, said he showed up at midnight to attend his eighth Berkshire meeting. He brought his own chair.\"I am inspired by their passion and normalcy,\" he said, referring to Buffett and Munger. \"I would hope they can go another five years, or more.\"",
        "(Reporting by Jonathan Stempel in Omaha, Nebraska; additional reporting by Carolina Mandl and John McCrank in New York; Editing by Megan Davies, Ira Iosebashvili and Diane Craft)"
    ]
}