{
    "articleURL": "/tvshowbiz/article-12040507/Jock-Zonfrillo-dead-Channel-Ten-indecisive-airing-MasterChef.html",
    "content": [
        "Channel Ten is struggling to be decisive about season 15 of MasterChef after the tragic death of Jock Zonfrillo on Sunday. ",
        "The network announced they would push the premiere back by one week after the cooking show's Scottish judge was found dead in his Carlton hotel room aged 46.However, a look at the upcoming TV guide shows the 7:30pm slot for Monday and Sunday reads, 'To Be Advised,' showing the series is not yet scheduled to air. The channel also hasn't put a placeholder show into the prime time slot, likely due to the failure of their new series The Bridge which bombed in ratings.Reality series The Bridge was slotted in at the last minute on Monday night to cover for MasterChef's delayed premiere.",
        "However, it only served to drive viewers away as Ten lost a huge chunk of its anticipated prime-time audience, with The Bridge drawing just 173,000 viewers.The Bridge is a reality series in which 12 strangers are tasked with building a 330m bridge across a lake, using only their bare hands and basic tools, to win $250,000.Despite losing out in prime time, the earlier time slot occupied by current affairs show The Project saw a ratings spike with 447,000 viewers tuning in to see hosts Waleed Aly and Sarah Harris address Zonfrillo's death.",
        "Entertainment reporter Angela Bishop revealed on Monday's episode of The Project that filming had wrapped on MasterChef by the time of Zonfrillo's death.",
        "It is unclear when MasterChef will return to screens. Network Ten announced on Monday that it will not air this week out of respect for Zonfrillo's family.Police found Zonfrillo's body at about 2am on Monday after they were called to a hotel on Lygon Street in Carlton, Melbourne, for a welfare check.The Scottish-Australian chef and restaurateur became a host of the popular Channel 10 cooking show in 2019 alongside Andy Allen and Melissa Leong.For confidential support call the Lifeline 24-hour crisis support on 13 11 14. "
    ]
}