{
    "articleURL": "/tvshowbiz/article-12047335/Stacey-Solomon-puts-leggy-display-shows-new-floral-summer-mini-dresses.html",
    "content": [
        "Stacey Solomon looked incredible as she gave fans a glimpse into her summer wardrobe on Instagram on Thursday. ",
        "The Loose Women panellist, 33, joked she was 'freezing' while posing under a blossom tress in an outdoor mirror in a number of mini dresses. She stunned in one pink strappy floral skater dress from her latest In The Style collection which she teamed with crisp white trainers. Stacey gushed that the dress is her 'favourite print' as she walked towards the mirror to give her 5.6million followers a closer look. She said: 'This print is my favourite I look at it and I'm like summer even thought it's like three degrees out here. ",
        "'I am freezing right now but I don't look it do because I have a beautiful floral dress on.' After a quick change, Stacey looked sensational in a smock number and styled her long blonde tresses in loose waves as they cascaded past her shoulders. She said: 'Comfort is key and if I can't wear a tracksuit then I'm in something stretchy and comfy.' The former X Factor star swapped into a pretty pink midi dress which boasted buttons up the front and eye catching puff sleeves. In the clip the mum-of-five cinched in her waist with a matching material belt and revealed it is one of the numbers she wore on a recent trip to Paris. Moving on from dresses, Stacey said knitwear in the UK is her go to as she can wear a jumper over a swimming costume or in the evening if it gets cold. ",
        "She looked effortlessly stylish as she tucked a knitted white jumper into a pair of high waisted denim shorts.Stacey added: 'Summer knitwear is what I live in when I'm in England because even if it's hot in the day it gets chilly at night so I always put a jumper on. 'You could wear your swimming costume on under this I would wear mine and then chuck this over my swimming costume at night and absolutely live in it.' "
    ]
}