{
    "articleURL": "/sport/football/article-12052367/Sky-look-replace-Stelling-cheap-amid-cost-cuts.html",
    "content": [
        "Stelling announced last weekend that he would be stepping away from the showSeveral football reporters from Sky have faced redundancy amid the cost cutsChapman was in talks to replace Stelling when he was set to leave last year Sky Sports are planning on making an internal appointment to replace Jeff Stelling as host of Soccer Saturday next season after the veteran presenter announced his departure on last weekend’s programme.",
        "Sky are in the midst of a major cost-cutting exercise after losing nine per cent of their UK subscribers last year, with a number of their football reporters facing redundancy, and a big-money recruit from outside the organisation is viewed as inappropriate in the circumstances.Match of the Day 2 host Mark Chapman was approached by Sky to front Soccer Saturday when Stelling considered stepping down last year, but existing staff members Jules Warren and Adam Smith are now viewed as the front-runners.'I've been at Sky for more than 30 years and loved every moment of my time as part of the Soccer Saturday team,' Stelling told Sky Sports as he announced his departure.'It is now the right time to move on and give Sky Sports viewers a break from my relentless rants, bad gags and over the top celebrations of Hartlepool United goals. It's been a lot of fun - for me at least.'",
        "Stelling initially called time on his stint with Soccer Saturday in 2021 after insisting he would depart at the end of that campaign, but the veteran broadcaster ultimately returned for an additional season.It's unknown when the company will make an announcement on who will replace the 68-year-old but the appointment is unlikely to be external.",
        "Stelling's departure from the much-loved weekly broadcast follows that of his former co-presenters Phil Thompson, Charlie Nicholas and Matt Le Tissier.The former players were sacked in August of 2020, after Sky elected to undergo a revamp with the programme, in a decision that Stelling called 'one of my saddest days ever at Sky Sports', though he kept his job."
    ]
}