{
    "articleURL": "/wires/reuters/article-12041045/Nationals-turn-rookie-against-Cubs.html",
    "content": [
        "The Washington Nationals will go from one strong pitching performance to - if nothing else - a notable pitching development.",
        "Jake Irvin will make his major league debut when he starts against the visiting Chicago Cubs on Wednesday night.\"He's stretched out to about 90 pitches,\" Nationals manager Davey Martinez said. \"So we're going to give him an opportunity to come out here and start for us and see what he does and see where he goes.\"The Nationals had hedged on making an announcement regarding Wednesday's starter until after their 4-1 victory against the Cubs on Tuesday.The teams have split the first two games of the four-game series, with the losing team scoring one run in both cases.Washington has won just two of its last six games. Chicago had dropped four of its last five.Irvin, a 2018 fourth-round draftee, has been among the prospects in Washington's system. The 26-year-old left-hander is 2-2 with a 5.64 ERA with Triple-A Rochester this year. He holds an 11-14 career minor-league record and 3.80 ERA.Irvin hasn't pitched since last Wednesday, when he went 5 1/3 innings against the St. Paul Saints.The Nationals needed to adjust their rotation because Friday night's rainout caused Saturday's doubleheader. Cory Abbott was a potential starter for Wednesday, but he logged two innings in relief Monday and was optioned back to Rochester.The Nationals have felt good about their bullpen for much of the season.",
        "\"Those guys are going to come in pumping strikes and make it tough on their guys,\" Nationals outfielder Alex Call said. \"That's what we've been striving for is to get better every day and win some of these games.\"Right-hander Marcus Stroman (2-2, 2.29 ERA) will be the starting pitcher for the Cubs.Despite Stroman's good numbers, the Cubs have lost three of his last four starts. Other than when he gave up three home runs to the Los Angeles Dodgers - his only long balls allowed this season - he has lasted at least six innings in his other outings.The Cubs have been pretty much a .500 team, but there are encouraging signs.\"It's a good group and that is clear as day for me and our coaching staff,\" Cubs manager David Ross said. \"These guys haven't changed the way they work.\"The Nationals still haven't shown that they're capable of sustained offense. They had three runs during the seventh inning Tuesday.A three-hit night for CJ Abrams was an encouraging sign.\"He has to continue to lay off the breaking ball and get the ball in the zone,\" Martinez said.Call has been a recent mainstay atop the Nationals' batting order.\"Every day is a blessing. This has been a tremendous time,\" Call said. \"That's what you put the work in for your whole life. You've got to keep going, keep grinding, help the team win every day.\"",
        "On Tuesday, the Cubs called up catcher Miguel Amaya from Double-A Tennessee. Yan Gomes was under evaluation for a possible concussion after he was hit in the head by Jeimer Candelario's backswing Monday.It's a concerning trend regarding Gomes.\"There's a couple of backswings that have gotten him in Florida and then even going back to the Dodgers series,\" Ross said.--Field Level Media"
    ]
}