{
    "articleURL": "/sport/football/article-12037997/Englands-Lionesses-face-Netherlands-Belgium-Scotland-Womens-Nations-League.html",
    "content": [
        "The competition will start in September 2023 and streamline qualifying routes Sarina Wiegman's side have never faced her former team in a competitive matchAlso in League A, Wales will be tested by Germany, Denmark, and Iceland England will face the Netherlands, Belgium and Scotland in the first ever edition of the women’s Nations League.",
        "The Lionesses, who are in League A, Group 1, managed to avoid being drawn with Spain but face a tough test in Sarina Wiegman’s former side Holland. The Dutch boss has not faced her native country in a competitive match since leaving to join England, with a pre-Euro 2022 friendly the only meeting between the two sides.Elsewhere in League A, Wales face a tough test in Group 3. Gemma Grainger’s side will play Germany, Denmark and Iceland.The draw will also see the Republic of Ireland take on Northern Ireland in League B.France will play Norway, Austria and Portugal in League A, Group 2, while Group 4 sees Sweden play Spain, Italy and Switzerland.",
        "A women’s edition of the Nations League has partly been introduced to ensure there are more competitive matches and to improve the qualifying system for major tournaments.England, for example, qualified for the 2023 World Cup by winning every game with 80 goals scored and none conceded. This included a 20-0 victory over Latvia.How does the Nations League work?There are three leagues – A, B and C – based on world rankings, with four groups in each league.",
        "LEAGUE AGROUP 1: England, France, Netherlands, BelgiumGROUP 3: Germany, Denmark, Iceland, Wales GROUP 2: France, Norway, Austria, PortugalGROUP 4: Sweden, Spain, Italy, Switzerland LEAGUE BGROUP 1: Republic of Ireland, Northern Ireland, Hungary, AlbaniaGROUP 3: Poland, Serbia, Ukraine, Greece GROUP 2: Finland, Romania, Slovakia, CroatiaGROUP 4: Czech Republic, Slovenia, Bosnia and Herzegovina, BelarusLEAGUE CGROUP 1: Malta, Moldova, Latvia, AndorraGROUP 3: Azerbaijan, Montenegro, Cyprus, Faroe Islands GROUP 2: Turkey, Luxembourg, Lithuania, GeorgiaGROUP 4: Israel, Estonia, Kazakhstan, Armenia ",
        "England, ranked fourth in the world, are in League A.Like in the men’s competition, all matches in the league stage are played according to a league system, with each team playing one home match and one away match against each of the other teams in their group. Three points are awarded for a win, one for a draw and none for a defeat.The four League A group winners qualify for the knockout finals. There will then be one-leg semi-finals, with a draw determining which team is at home, a final and a third-fourth play-off. The two finalists will qualify for the 2024 Olympic Games alongside hosts France. If France make the final, the third place team will take the spot.The top two teams in each group remain in League A for the European Qualifiers for UEFA Women's EURO 2025.The four third-placed teams play off against the second-placed teams in each group of League B. The play-off is over two legs, home and away, with the ties determined by another draw. The winner of each match will play in League A for the European Qualifiers phase; the defeated teams will play in League B.The fourth-placed teams are relegated to League B. This then applies to the other groups – with the four group winners of League B promoted to League A and the bottom four teams relegated to League C, with the third placed teams facing a play-off.",
        "Euro 2025 qualifyingFollowing all this, another League stage will take place to determine the qualifying for Euro 2025. The four winners and four runners-up of League A will automatically qualify. Two rounds of two-legged play-offs will then determine the remaining qualifying ties.The teams that finish third and fourth in their League A groups will play the five League C winners and the three best second-placed teams. The eight winners of these ties will progress to round two.",
        "The second part of the play-offs will see the four winners of League B take on the two remaining runners-up and the four third-placed teams from the same group. The six winners of those ties progress to round two.In round two, 14 teams will be drawn into seven ties and the winners of each will qualify for Euro 2025 – which will be held in Switzerland.There will be no promotion or relegation matches after the second round but it will be automatically reflected in the next editions of the Nations League – which will take place across the 2025-2026 season.That competition will then decide who qualifies for the 2027 World Cup. The format will be the same but adjusted slightly to reflect the fewer number of qualifying spots."
    ]
}