{
    "articleURL": "/wires/pa/article-12040447/Donald-Trump-visit-golf-resort-Ireland.html",
    "content": [
        "Former US president Donald Trump is expected to follow President Joe Biden, his successor at the White House, by visiting Ireland on Wednesday.",
        "Preparations were under way with heightened security at Trump International Golf Links and Hotel just outside the town of Doonbeg in Co Clare.An increased garda presence was visible on the beaches and roads around the golf course on the west coast of Ireland ahead of the former president’s arrival.",
        "Armed units on quad bikes patrolled the nearby Doughmore Beach on the Atlantic coast as road policing units were seen driving on routes to and from nearby towns.Gardai on motorbikes and a dog unit were also seen waiting at Mr Trump’s resort.At the hotel, efforts were made to tidy up the exterior including the mowing of grass and the hanging of US flags.",
        "Improved roadside barriers were also being constructed on one of the roadways into the hotel.Mr Trump last visited the 400-acre resort, which he bought in 2014, while president in 2019.Mr Trump, accompanied by his son Eric, has spent the last two days in Scotland, breaking ground on a new golf course at his Menie Estate near Aberdeen before playing a round at his Turnberry resort in South Ayrshire.",
        "During his time in Scotland he gave an interview with Nigel Farage which will be broadcast on GB News at 7pm on Wednesday.Supporters of Mr Trump also arrived in Doonbeg for the visit, including his self-proclaimed biggest Irish fan.",
        "David Grange, from Raheny in Dublin, said he would like to shake the former president’s hand but expected it would not be possible with the increased security. I think the media give him an unfair deal.  Trump supporter David Grange  “I love the guy,” he said.Mr Grange said he has been supporting Mr Trump since 2016 after finding the former president’s message “resonated” with him.Carrying a US flag and a Trump 2024 “Take America Back” election flag, he said he drove to west Clare especially for the former president.",
        "Asked why he supports Mr Trump, he said: “All his policies, promises made, promises kept. The witch hunt against him, the attack against him.“Everything he’s done has ticked all the boxes, everywhere he goes there’s a mass following.“I think the media give him an unfair deal.”The trip is Mr Trump’s first abroad since he became the first former US president to face criminal charges.",
        "No travel conditions were placed on him after he pleaded not guilty to 34 counts of falsifying business record in New York in April.The visit coincides with the second week of a civil trial in Manhattan over accusations, denied by Mr Trump, he raped former magazine columnist E Jean Carroll in a department store dressing room in 1996.",
        "Mr Biden visited Ireland as part of the celebrations to mark 25 years of the Good Friday agreement before retracing his Irish roots in Co Louth and Co Mayo in March."
    ]
}