{
    "articleURL": "/wires/pa/article-12059113/King-Queen-Camilla-make-surprise-virtual-appearance-American-Idol.html",
    "content": [
        "The King and Queen have appeared on American Idol as surprise guests amid the coronation celebrations.",
        "American Idol judges Lionel Richie and Katy Perry appeared on a livestream from Windsor Castle to speak to the singing contest’s host Ryan Seacrest following their performance at the Coronation Concert.All Night Long singer Richie, 73, said: “What a party, it was unbelievable.“We’re trying to figure out what can we do to bring something different to the show, so I have a surprise.”Perry, wearing a green off-the-shoulder silk dress with matching pearl earrings and necklace, appeared shocked when Charles and Camilla strolled into the royal room.Charles, wearing a navy suit and a light blue tie, joked: “I just wanted to check how long you’ll be using this room for.”He later said: “Thank you so much for your brilliant performance, it’s a pleasure to have you both here. It’s a great treat to have you both here.”Camilla, wearing an electric blue jacket, said of their performance: “Fantastic, absolutely fantastic.”Perry, 38, asked Camilla if they were making “too much noise” and the pair joked quietly together.",
        "Meanwhile Richie said: “We understand there’s a party… you’re throwing the party right next door.”Charles replied: “Ah you’ve heard about that… we better take you to that, but you are busy with all these other things.”“As soon as we finish, we’re coming to the party,” Richie said.",
        "As Charles and Camilla walked off, Richie added: “We love you guys, and congratulations.”It is understood the appearance was not planned and was a genuinely spontaneous moment decided by Charles and Camilla during the evening, and a sign of the long-standing and warm relationship between the King and Queen and Richie and Perry.Richie has been involved with the Prince’s Trust since the 1980s and Perry is an ambassador for The British Asian Trust, a charity founded by the King when he was Prince of Wales.The episode of American Idol also saw British singer-songwriter Ed Sheeran perform the live TV debut of his song Eyes Closed from his latest album – (Subtract).During Sunday night’s Coronation Concert, held in the grounds of Windsor Castle, Perry performed her hits Roar and Firework, with Richie treating the royals and guests to his songs Easy and All Night Long (All Night)."
    ]
}