{
    "articleURL": "/wires/aap/article-12049353/Waratahs-tackle-inconsistencies-Super-Reds-showdown.html",
    "content": [
        "NSW Waratahs halfback Jake Gordon believes his side can maintain their late-season finals push if they can address minor inconsistencies ahead of an interstate clash with rivals Queensland.",
        "The Waratahs (17 points) currently sit seventh on the Super Rugby Pacific standings just two points behind the Reds, who they face at Queensland Country Bank Stadium, Townsville on Saturday.A win will see them gain valuable ground in the race for top-eight finals spots with the Highlanders (15 points) and Melbourne Rebels (14) in their rearview mirror.Fresh off a last-gasp victory over the Highlanders in round 10, the 'Tahs are hunting for back-to-back wins for the first time this season and looking to end Queensland's recent streak at two.The last time NSW strung consecutive victories was 15 matches ago in round 11 and 12 of 2022.Gordon says any hopes of a successful tilt from the quarter-finals onwards will be hampered significantly if they can't string together a complete performance now 11 rounds into the season.\"It's getting towards the end of the year and we need to start being more consistent,\" he told reporters on Friday.\"We spoke about that - we just really haven't put an 80 minute performance together yet. We've been a little bit inconsistent starting halves and finishing as well.\"Last week was a great result for us especially in a clutch moment like that to score in the 80th minute. It was good for the group.\"",
        "With Wallabies head coach Eddie Jones keeping a keen eye on performances ahead of this year's World Cup, Gordon believes he still has work to do to earn a national call up.When asked if he's done enough to warrant selection, Gordon replied \"not yet,\" but backed his form as of late.\"I probably didn't start the year the way I wanted to,\" he added.\"I think I've been playing better of late. It's a really short season.\"It's a really important year for rugby. I think they need to pick the best players and I need to make sure I'm playing my best.\""
    ]
}