{
    "articleURL": "/tvshowbiz/article-12038851/Mike-Situation-Sorrentino-shares-RARE-flashback-photo-wife-Lauren.html",
    "content": [
        "Mike 'The Situation' Sorrentino is married to Lauren Sorrentino.",
        "They are nicely settled family with two children.But before they tied the knot, they were college sweethearts. The Jersey Shore actor proved that when he shared a flashback photo on Monday of the two of them as students.'College sweethearts,' the reality TV star wrote in his Instagram caption.She was rocking a 90s look with a silky strapless top paired with blue jeans as she carried a Gucci purse. Mike was almost unrecognizable with darker hair and a rounder face.",
        "He held onto his cap as he wore his gray gown and beamed with pride during his graduation. After college they split up and he went wild on Jersey Shore.But they got back together in 2013 and wed in 2018. In January the couple welcomed their second child, a daughter named Mia Bella Elizabeth Sorrentino, a rep for the Jersey Star confirmed to People.Mia was born at 8:22AM on Tuesday, January 24, and weighed five pounds and 15 oz.Just days before she welcomes the baby, Mike revealed exclusively to DailyMail.com that Lauren was set to give birth 'any day' now.'It's happening like any minute, no joke. We are scheduled for the 24th, that would be full term. But the doctor said it could happen at any day, so we are on high alert to meet our baby girl and Situation party of four!' Mike told DailyMail.com.",
        "The couple, who already share son Romeo together, didn't plan on revealing the name of their daughter until she was born but Mike says it will 'definitely' be Italian.'We have a couple of names but we're going to probably announce it the day of. It's definitely going to be Italian!' he said.",
        "Unlike his early days shooting Jersey Shore, Mike is now juggling parenthood with filming.While Mike acknowledged it's 'not easy' doing both, he said he was currently living his 'dream' of having a family.'It's not easy but I'm sure like most parents, you make it up as you go along. And having a family for me is what I've always wanted. I feel like I'm living my dream and I have my baby boy whose 20 months now, Romeo.",
        "'So I really cherish those moments that I have with the family and also at the same time I'm so grateful to live out my dream and entertain millions on MTV and TV across the country and world!'The Situation announced Lauren's pregnancy back in November.'IT'S OFFICIAL, We have a Situation. It's a GIRL. Coming January 2023. Girl dad,' he announced on Instagram.The proud parents looked as happy as can be as Mike gently placed his hand upon Lauren's blossoming bump."
    ]
}