{
    "articleURL": "/sport/cricket/article-12048975/England-Ashes-cricket-star-Ollie-Robinson-Steve-Smiths-county-stint-help-beat-Australia.html",
    "content": [
        " World's best batsman set to play in England Team mate thinks pundits are wrong about his arrival Bowler claims 'it's a bit surreal' having Smith in his teamEngland fast bowler Ollie Robinson says having Ashes rival Steve Smith in his county team 'ups my game' and could actually hand the home team something extra ahead of the five-Test showdown.",
        "Smith didn't get to bat in his debut for Sussex but stood at second slip getting a good lock at Robinson, who took seven wickets after their captain, Indian star Cheteshwar Pujara, won the toss and put Worcestershire in.The presence of the Australian star has caused ructions among the locals, with some critics suggesting giving him a contract to play county cricket aided the cause of the tourists who are looking to win a first series in England for more than 20 years.But Robinson, who bowled to Smith in the nets and even sent his stumps flying, took the alternative view now he was regularly getting to bowl to someone who will be his opposition in the coming months.",
        "'I get a look at him, he gets a look at me,' Robinson said after snaring 7-59.'I don't think it makes a big difference in the grand scheme of things.'He's obviously a good player and he'll score runs regardless of whether he faces me or not.'It's bit surreal. To have the world's best batsman and Pujara in the same dressing room is quite cool. It's nice having him around. It ups my game in training bowling to him and Pujara.'Smith also acknowledged this week he would get a close-up look at Robinson, who struggled in the series in Australia in 2021/22, taking just 11 wickets in four Tests.",
        "But Robinson remains a key part of the England attack with veteran seamers Jimmy Anderson and Stuart Broad, and Smith knows that.'I was impressed with him actually when he was out in Australia. I thought he had some really good skills,' he said.'He's quite tall, he hit some good areas and looks like he's got better since then, so I'm looking forward to playing with him this week.'Smith is not the only member of the Australian squad playing county cricket.Opener Marcus Harris's Gloucestershire is not playing this week, but Test star Marnus Labuschagne made 65 for Glamorgan against Yorkshire."
    ]
}