{
    "articleURL": "/news/article-12060239/Tech-workers-having-budget-tumbling-share-prices-hurt-stock-awards.html",
    "content": [
        "Stocks awarded to tech workers as part of their pay packets have lost value as shares in companies across the sector have fallenWorkers at places like Google parent Alphabet and Meta have been affectedMany companies have also laid off staff as their valuations have fallenTech workers whose pay packages include stock awards have lost out as the valuations of their companies have fallen in recent months - and some complain they're now giving up luxuries like dog grooming.",
        "One Google worker saw his $175,000 stock grant fall to a value of $46,000 while another at Meta, which owns Facebook, was left with a fraction of his $80,000 stock grant. The workers are among thousands who have lost out as the valuations of their publicly-listed employers have declined. Many leading firms have also laid off thousands of workers.The tech sector laid off a combined total of 102,000 jobs in the first quarter of 2023, according to a recent report. The industry is on pace to exceed the annual record for tech layoffs set in 2001 with the collapse of the dot-com bubble.Google parent Alphabet has cut about 6 percent of its global workforce, equating to about 12,000 jobs. Meta announced plans to lose 10,000 jobs following other layoffs in November.",
        "Meanwhile Alphabet stock is worth $107 compared to a peak of $148 per share in December 2021. Meta stock hit around $380 in September 2021 and is worth $232 today. Both had fallen even lower than their current prices before recovering some of the losses at the beginning of the year.Tommy York, a former Google employee who was laid off in January, told the Wall Street Journal he ended up with $46,000 from a stock grant that was worth $175,000 when he joined in December 2021.",
        "'I just wanted to put a down payment on a home in San Francisco,' said York, 33.Samantha Voigt joined Square, which is now known as Block, as a software engineer in 2017 and benefited from the nine-fold increase in the company's stock price during her employment.She now works at a private startup and earns a higher salary but no longer benefits from stock awards in a publicly-listed company.",
        "'I used to be able to kind of spend whatever, and it would be fine,' she said. 'Now I'm having to think about it a lot more.'Voigt, 27, who was able to take a year off work after feeling burned out during the pandemic, now budgets by washing her dog herself rather than paying a groomer.She had been able to pay off her student loans, buy a car and put $500,000 in a brokerage account with help from the stock benefits.Ryan Stevens, 39, got a stock grant worth $80,000 from Meta when he joined in August 2021 - around the time shares peaked at about $380-a-piece. He cashed out some of the shares after he was laid off last November and his remaining stock is worth $10,000.'All of that was just supposed to come together magically down the road and set us up for homeownership and make us feel like we made it,' he told the WSJ.",
        "Stevens had hoped to put down a $300,000 payment on a $1.5 million home.Tech firms lost billions in value in 2022 during the worst year for the markets since 2008. The tech-heavy S&amp;P 500 lost almost 20 percent. Many firms have recovered some of their losses but their stock valuations remain well below the record highs enjoyed last summer. Meanwhile, the number of layoffs announced by US employers surged in the first quarter, as companies cut costs and fears of a recession rose, according to a new report.From January to March, companies announced 270,416 job cuts, a 396 percent increase from the same period last year, according to a report from outplacement firm Challenger, Gray &amp; Christmas.The technology sector accounted for more than a third of the cuts in the first quarter.",
        "It comes as many companies slash costs in response to slower economic growth, after the Federal Reserve rapidly hiked interest rates over the past year in a campaign to curb inflation.'With rate hikes continuing and companies' reigning in costs, the large-scale layoffs we are seeing will likely continue,' said Andrew Challenger, senior vice president of Challenger, Gray &amp; Christmas.On January 21, Google parent Alphabet said it planned to cut about 6 percent of its global workforce, equating to about 12,000 jobs.",
        "And in a recent company-wide memo, Aphabet CFO Ruth Porat announced a sweeping array of penny-pinching measures to slash costs. Google is cutting back on expenses such as fitness classes for its employees, office basics from staplers and tape, and reducing the frequency of laptop replacements for its workers. As well, Mark Zuckerberg famously declared 2023 would be the 'Year of Efficiency' at Facebook parent company Meta, saying last month that the company plans to cut 10,000 more jobs after a slightly larger round of layoffs in November."
    ]
}