{
    "articleURL": "/tvshowbiz/article-12061547/Jennifer-Lopez-reveals-person-showed-Mother-husband-Ben-Affleck.html",
    "content": [
        "She is married to an Oscar-winning filmmaker.",
        "So it only makes sense Jennifer Lopez would seek the opinion of her husband Ben Affleck when it comes to her own movies.Speaking with E! News, JLo, 53, revealed Ben was the first person she showed her action film The Mother to. Ben, 50, is a praised actor and director in his own right, with Oscar wins for Good Will Hunting and Argo.While Jennifer, 53, is also a critically-acclaimed actress, she described just how much she values what her spouse has to say. ",
        "'I show it to Ben, honestly because he's so good at it,' Jennifer said.'I'm like, \"What do you see? What do you think?\" Because the first cut of a movie is not the last cut of a movie. The first cut of the movie is the first cut of the movie and then it goes through a whole incarnation after that. 'So the first cut I'm always like, \"You wanna see this with me or you wanna wait?\" And he's like, \"No, let's watch it.\"'He always has amazing insight,' she continued, adding her husband 'sees things about characters and about story being a writer himself.'Jennifer will be playing an assassin determined to do anything to keep her young daughter safe in The Mother, set to drop on Netflix on May 12.  ",
        "The role required lots of combat scenes, and Jennifer stepped up to the challenge with plenty of training.'That was one of those ones where you really have to train a lot, where you really have to do the fight training and you have to do the sniper training... It was a lot of fun but it's a lot of work,' she recently said on The View. While Jennifer, who is now in her early 50s, wishes she would have gotten more of these kinds of roles when she was a little younger, she still says it was an 'empowering' experience.",
        "'And it's funny, you know I wish I would have gotten a lot of these types of roles that I'm getting now, funnily enough, when I was a little bit more, you know, spry.'A little bit younger, let's just say it. And it's exciting to be able to do it now, I think for me, it's really kind of empowering and makes me feel strong and good.'The Jenny From The Block singer described how her background in dance helped her pick up the fight routines.'It was regular fight training, but it was choreographed. You have to be efficient, I can't be fighting eight hours a day. After an hour, I'm like, OK!",
        "'So they had to be real efficient and we choreographed almost like a dance, which is good for me since I'm a dancer, so I can kind of do it step by step and I just learn it from there.'Jennifer and Ben tied the knot last year, after reconciling years following the end of their initial engagement. They are have a blended family, raising children they share with former partners. 'He's an amazing dad,' she gushed on The View. 'It brings tears to my eyes. He is honestly the best dad I've ever seen. He's so involved, he teaches me about how to interact with the kids sometimes.'Jennifer called Ben the type of father anybody would ask for - a 'present, loving dad who cares.'"
    ]
}