{
    "articleURL": "/tvshowbiz/article-12045595/Pregnant-Danielle-Armstrong-dons-blue-floral-kaftan-Marbella-birthday-getaway.html",
    "content": [
        "Pregnant Danielle Armstrong looked radiant as she celebrated her birthday in Marbella with her family on Wednesday.",
        "The former TOWIE star, 35, exhibited her growing baby bump in a blue floral kaftan while strolling across the beach with her her husband Tommy Edney and their daughter Orla, two.She framed her face with aviator sunglasses and accessorised with a necklace comprised of pebbles.Danielle posed for selfies with her childhood sweetheart while carrying a straw hat during their final getaway as a family of three.Her little one appeared to be in high spirits as she ran across the sand with her parents, before they headed to the beach club, Nosso.",
        "Taking to Instagram, the couple shared adorable photos of their time in the sunshine, including Orla cosying up to her mother and father.Other shots showed the three in swimwear grinning for a selfie as they enjoyed quality time together with Tom lovingly holding Danielle's bump.Danielle captioned her post: 'Our last trip away as a family of 3 spending as much quality time with this little beauty before big changes happen with the new bubba coming. I know Orla's going to make the most amazing big sister.'Tom wrote: 'Last Holiday Smudge As A Three' as he took time to relax and unwind with Danielle and Orla.The couple married in August 2022 and announced they were expecting their second child together in January",
        "It comes after Danielle admitted in March that she was desperate to get pregnant with her second baby. The reality star revealed sex got 'mechanical' with her husband because she was like a 'dog on heat'. They first started trying for their second child while on their honeymoon in the Maldives last September.",
        "She told OK! Magazine: 'As soon as the wedding was over, I was like, 'Get me pregnant now!' And jumped on him.'Turning to Tommy, she said: 'You probably really enjoyed it for those few months – I was like a dog on heat! Because we knew we wanted a baby and I'm a bit of a control freak, I just wanted to get pregnant as quickly as possible.'She that towards the end it got \"a bit mechanical\" when it came to \"ovulation dates and when to have sex.\"'It worked, but I can imagine it being quite stressful for couples who are trying for longer than a year because it does take the romance out of it.'Danielle took to Instagram in January to reveal she is expecting her second child with Tom.She later shared her relief about not having to keep the pregnancy a secret anymore, and admitted this time around she was quite 'anxious'.",
        "Danielle said: 'I just felt so much more anxious in this pregnancy and you just want the all clear with all the doctors and different scans and all the different tests they run.'I don't know what it is, but I just really found it hard this time round. So yeah anyone watching this, I just think anything to do with pregnancy.",
        "'I didn't make it a secret to anyone about after we got married, we're probably will try, I'd love to have a baby this year.'And as soon as I got married people were like 'Are you pregnant? Ooh baby number two!' And I'll go into detail another time, but even my experience of trying for a baby I found it really hard. I actually found it really emotional.'I think it's important that the whole trying for a baby, certain things we were doing, that's a whole other topic.She continued: 'The news is finally out. I'm so relieved to be able to just be myself, not wearing a baggy top.'I've had quite a lot of message over the last few weeks of people saying 'Are you pregnant?' I think women get a feeling.'But it's been so hard keeping it in, and keeping it from you friends and family. Even my mum!",
        "'Me and my mum are so close and just to keep that from her for a certain amount of time. It's just hard.'The TOWIE star officially announced her pregnancy posting a black and white video in January, where she held up three pregnancy tests, admitting: 'I wasn't sure!'Danielle, who announced her engagement in 2020 after falling in love with Tom in 2019, then shared a kiss with her husband before showing a glimpse of daughter Orla lovingly caressing her growing bump.The reality star exclaimed: 'High five big sister!' as the little one beamed for the camera.Danielle also gave her 1.3million followers a glimpse of her baby's first scan as well as a sweet snap of the family.'Baby Edney No2... Oh we can't wait to meet you', she penned alongside the post.She continued: 'We are absolutely over the moon, that we will be adding another bubba to our family summer 2023. I know Orla is going to be the most amazing Big Sister.'"
    ]
}