{
    "articleURL": "/wires/reuters/article-12054483/Ukraine-hails-return-45-Azov-fighters-Russia-says-3-pilots-released.html",
    "content": [
        "KYIV, May 6 (Reuters) - Ukraine on Saturday hailed the return of 45 Azov battalion fighters captured during the battle for Mariupol while Russia said three of its pilots had been released by Kyiv, but neither side gave a full account of the apparent prisoner swap.",
        "The freed Ukrainian prisoners included 42 men and three women from the Azov battalion, said Andriy Yermak, the head of President Volodymyr Zelenskiy's office.Azov battalion fighters, who did much of the fighting in the failed defence of the port city of Mariupol, have been lionized as heroes by many Ukrainians but are widely vilified in Russia.\"Excellent news on this sunny day. We are returning home 45 of our people. Thirty-five privates and sergeants, 10 officers,\" Yermak said on the telegram app in a post that did not mention the release of Russian prisoners.The Russian Defence Ministry said in a statement that three pilots had been returned and were being provided with medical and psychological assistance.\"As a result of a difficult negotiation process, three Russian pilots of the Russian Aerospace Forces, who had been in mortal danger while in captivity, were returned from Kyiv-controlled territory,\" said the statement, which did not mention the 45 Ukrainian prisoners. There were no reports on Russian state media of additional Russian prisoner releases.Ukraine's military intelligence agency, which coordinates prisoner exchanges with Russia, did not immediately respond to a request for more details.Moscow and Kyiv have agreed a number prisoner exchanges since Russia's full-scale invasion in February last year.Russia says it launched its \"special military operation\" to counter a threat from Kyiv's relations with the West, while Ukraine and its Western partners say it was an unprovoked land grab. (Reporting by Olena Harmash; Editing by Conor Humphries)"
    ]
}