{
    "articleURL": "/sport/nfl/article-12040053/Aaron-Rodgers-gushes-dream-start-Jets-Im-just-pinching-myself.html",
    "content": [
        "Aaron Rodgers made sure to point out that he was not taking shots at Green BayHe has been present for the voluntary portion of the Jets offseason programDailyMail.com provides all the latest international sports newsNewly-acquired Jets quarterback Aaron Rodgers recently called his long-awaited trade to New York a dream, during another appearance on the Pat McAfee Show.",
        "Rodgers was traded to the Jets from the Green Bay Packers days before last week's NFL Draft, after the two sides spent over a month locked in negotiations.'It's been great,' Rodgers said. 'Everything is new. It's like the first day of school every single day.'There's new people to meet, gotta figure out your routine, where the laundry goes, mail, cleats, weight room shoes and all the stuff. Everything's new, exciting and fun.''I'm just pinching myself a lot of days. I can't believe it's real sometimes. It's been a dream for sure just to be here. I definitely feel energized to be in the building.'",
        "Rodgers was traded to the New York Jets along with the Packers' No. 15 pick and a fifth-rounder in Thursday's NFL Draft.In exchange, Green Bay receive the Jets' 13th overall draft choice, a second-round pick that will be No. 42 overall, a sixth-round pick, and a conditional 2024 second-round pick, which will become a first if Rodgers plays 65 percent of snaps this season.New York turned that No. 15 pick into edge rusher Will Mcdonald IV out of Iowa State, while the Packers turned the 13th selection into edge rusher Luke Van Ness.The four-time MVP has already been making the most of his time in New York City, first attending the Rangers' playoff game against the New Jersey Devils. ",
        "He then returned to Madison Square Garden Sunday night for Game 1 of the New York Knicks' semifinal series against the Miami Heat before turning up for Game 2 Tuesday night too. The NFL veteran was given a warm New York welcome as the MSG crowd gave out a loud cheer when his face was shown on the big screen. Looking slightly humbled, the signal caller smiled for the camera and waved to his adoring fans. He was joined by his new teammate Allen Lazard on Sunday, who, like Rodgers, has joined the Jets from the Green Bay Packers.",
        "Lazard was repping yet another New York team with the wide receiver donning a Yankees cap, delivering the perfect crossover with the MLB franchise's logo emblazoned on the front in Jets green. Meanwhile, he had another new teammate by his side on Tuesday for the series-tying Game 2 as Sauce Garden sat courtside with his new quarterback.  However, on Tuesday Rodgers made sure that his comments weren't misinterpreted or twisted in a way that made them seemed like he was taking shots at the Packers.'That takes nothing away from the 18 beautiful years I spent in Green Bay,' the 39-year-old said.'How could you ask for anything better than that, and just such a special place to play.",
        "'But, 18 years in the same spot, you kind of get used to everything, and everything is the same-old-same-old in a lot of ways, which has its beauty for sure, but with everything new, and embracing the change, and things that aren't as comfortable as they used to be, it's been a lot of fun.'New York started Phase 2 of their offseason program this week and even though attendance is voluntary Rodgers was on the field throwing to receivers.This summer the Jets acquired two new weapons for him to throw to this year in former Packers wideout Allen Lazard and former Kansas City Chiefs pass catcher Mecole Hardman for Rodgers to throw to.Rodgers was well known for not showing up during the offseason until it was mandatory during his time in Green Bay.The 39-year-old QB also was said to have formed a close relationship with Lazard during their time with the Packers and the duo was seen together as Rodgers attended a Rangers playoff game and Game 1 of the Knicks vs Heat series.He was also spotted attending Game 2 with the Jets cornerback Ahmad 'Sauce' Gardner  "
    ]
}