{
    "articleURL": "/femail/article-12045995/How-two-stylish-mums-kitting-family-summer-fun.html",
    "content": [
        "After what seems like forever, summer is finally on its way.",
        "We're saying goodbye to cold, dreary days (we hope) and welcoming long days of sunny blue skies.And the arrival of summer means holidays are on the horizon, so whether you're jetting off to far flung beaches or planning a UK staycation, now is the time to get the whole family's holiday looks sorted.Think easy-to-pack, easy-to-style clothes you'll ALL love.And if you need inspiration, look no further than Very where you'll find incredible fashion for the whole family from in-house labels V by Very and Everyday, as well as big name brands like River Island, Mango, Levi’s, Crocs and Birkenstock.And they're all in one place, so shopping for everyone couldn't be easier. We asked two super stylish mums to create their perfect holiday wardrobes and asked them for their tips on kitting out the kids, what to pack and how to make a family holiday go with a swing.'These looks are all great for a UK staycation, so I’ll definitely be taking them to Cornwall!'Sharlene Fleary, 37, AKA @curlylittledreams, is mum to Hector, 6, Hugo, 3 and Neve, 8 months, and is looking forward to when they can all escape to Cornwall for a staycation this summer.",
        "'We went to Cornwall last year and that was really lovely,' Sharlene says. 'The boys are desperate to go back, it was really beautiful.'",
        "And this busy mum of three says a great family holiday is all in the planning, knowing what’s in the surrounding area, staying somewhere child-friendly and taking childcare into account. 'That’s really important for us - to get some couple time alongside family stuff.'And when it comes to packing for the whole family, organisation is key.'For Cornwall we need to bring rainwear, sun wear, beachwear,' Sharlene says. 'I have a little tick list so I can tick off what we need to bring, otherwise I just end up forgetting things. I’d like to say you should pack in advance but I never do… I’m always last minute.'",
        "Sharlene is also in charge of clothes shopping for the kids and likes to mix classic pieces with more fashionable items. 'There is always a budget and I’m thinking about longevity, especially for the boys,' she says. 'I like to buy some staple items they can wear over and over again for birthdays and special occasions. But every once in a while I do like to pick out trendy items that make them look a little bit extra cool. 'I always like to colour co-ordinate and match the children. I find it a lot easier and it makes cute photos!'For me I like dresses with pockets and I like to dress for my shape. That’s why I love wrap dresses as they’re flattering. They accentuate my waist.",
        "'So I love this pink wrap dress from Very which I chose for the colour. It’s lovely and bright and I like how the sleeves balloon. Plus, the length was perfect.'For Neve I'll be packing this denim dress and pink top. Denim is easy to wash and doesn’t crease as much, so one less thing to iron.'",
        "And for Hector and Hugo, Sharlene is a fan of these shorts and top sets from the Mini V by Very range. 'I love these matching yellow shirts with white shorts,' she says. 'They look cute and classic. I like them to be dressed quite smartly, but the shorts are casual so they can still run around. 'These looks are all great for a UK staycation, so I’ll definitely be taking them to Cornwall.' Now get the look...Love Sharlene's staycation style? Shop it all at very.co.uk now! Textured Puff Sleeve Midi Wrap Dress  £28.00  V by Very  Shop Button Through Broderie Shirt Dress  £40.00  V by Very  ShopFor a look that can take you straight from day to night, this hot pink dress by V by Very (above left) does the trick. We love the textured fabric, flattering wrap waist and billowing puffed sleeves; it's perfect for making a statement this summer. Style with trainers or flat sandals for day, slipping into heels for evening.And what could be more summery than broderie anglaise? Flaring out from the waist, this cute day dress (above right) will look wonderful whether you're hanging at the beach or taking the kids to the park.",
        " Boys Mini Me Family Lemon Oxford Shirt And Short  From £16.00  Mini V by Very  Shop Boys Dino Polo And Short Set - Multi  From £14.00  Mini V by Very  ShopHector and Hugo look fab in these versatile sets from Mini V by Very. The yellow shirt and shorts co-ord (above left) is smart enough for a family party or special occasion, but still comfy enough for them to run around in on warm days. And the Dino print polo shirt and shorts (above right) are ideal for the beach, the park or a day trip excursion.Plus, the great thing about sets like these is you can mix and match them with the rest of their clothes. Genius! Girls Flower Embroidered Denim Pinny and T-shirt Set  From £16.00  Mini V by Very  Shop Boys Cotton Rich Stripe Essentials Zip Thru  From £12.00  Mini V by Very  ShopNeve may only be eight months old but she's already a little style star in this adorable embroidered denim dress and pink tee (above left). And this striped hoodie (above right) is sure to keep the boys cosy on days when the UK weather isn't quite as reliable as they'd like.",
        "Ola and Darcy Pelovangu are parents to four gorgeous kids, Mayah, 7, Micah-Remi, 5, Dream, 3 and Nubia, 1 (@thepelofamily). They love all-inclusive getaways in the sun where they can be sure the whole family is catered for.",
        "Where will you be jetting off to this summer?'We're going abroad this year and we're trying to decide where. We like resorts with kids' clubs, where we can be confident they're looked after while we have our own time. 'Anyone with kids knows you need a holiday to get over a holiday. The number one thing is catering to everyone. I never used to be organised until we started travelling with kids, but now I have a key note presentation with every outfit planned for everyone!' ",
        "What are your tips for travelling with children?'Keep the kids busy on the plane! Colouring pencils, a game. Kids are more entertained when you get involved with them. 'Always look at the kids' club at the resort, if there is one, and always book activities before the holiday. We made a mistake once and when we got there, everything was booked up already. Also, understand you will have parenting issues while you're abroad. Just because you're away it doesn't mean it'll be serene, so don’t have too high expectations. It’s just important to make the memories.'",
        "What's important to you when you're shopping for clothes for the family?'Everything needs to embody practicality. The quality has to be amazing so I can use things from last year. I pride myself on being able to say it’s from last year.'I like certain colours – earthy tones, browns, greens, salmons and soft blues – so I can mix and match with different outfits. Just a bit of casual coordination.'How would you describe your style?'My style prioritises comfort over everything. I love to shop for timeless pieces and that's why I love earthy tones as they never go out of style.'Darcy likes fitted, round collared shirts. He wears linen, which is good for the skin. Darcy likes understated, glam, elegance. He's not into labels, but he's definitely into quality.'What are the holiday essentials you always pack?",
        "'We all have little 'change of clothes' bags I keep in our hand luggage in case of accidents, and I always travel with a first aid kit. 'I love those towels that kids put over their outfits. That’s saved us so much! They don’t get cold when they come out of the sea. I’d love an adult one! 'Sun hats and sun cream are essential. I love a floaty beach dress and a bit of white. On holiday everything seems fresher. For the kids I love linen two pieces. You can't go wrong with that for the boys. Linen is our go-to for everyone because it’s cooler.'Tell us about the clothes you'll be taking on holiday from Very...",
        "'I went for a Hawaiian hibiscus style for Darcy, Mayah, Micah-Remi and Dream, but I don’t want us all to be in the same things, so I pick out colours in the print. So, I picked a white dress as there’s white in the print. I like the wrap around waist on the broderie anglaise dress. A lot of mums are conscious of that area, so it makes me feel confident. The neckline is great too.'My favourite outfit was the yellow dress. It has a nice neckline and is roomy enough so there's still space to eat, which is a big decider for me as I love to eat when I go away. It's the same for the kids. They have room to play and move in their yellow and orange dresses. Comfort and practicality are key.'",
        "Why is Very your go-to for summer holiday clothing?'The selection of brands on very.co.uk is the main appeal for me. And I love the sets of five T-shirts. Then you buy two pairs of shorts, and you have almost a week of outfits in just two buys. V by Very is good value for money and great for children. 'We've got great choices now for our holiday. We have a bit of everything for day and night. Now all we need to do is book our holiday!'Click HERE to get your family holiday ready now. ",
        "Now get the look...Love Ola's holiday style? Shop it all at very.co.uk now! Broderie Frill Wrap Mini Dress  £28.00  V by Very  Shop Tassel Tie Beach Mini Dress  25.00  V by Very  ShopBroderie anglaise is a style classic so it's no wonder Ola opted for this pretty wrap dress by V by Very (above left). And this tassel detail beach dress (above right) is ideal for throwing on over swimwear, so you can head straight to the bar for a sundowner.  Broderie Midi Dress £40.00  V by Very  Shop Girls Tiered Bow Smock Dress £16.00  River Island at Very  ShopOla's yellow midi (above left) is a gorgeous look for both day and evening. In bright and bold yellow, you can take the sunshine with you, while Mayah and Nubia look cute as can be in this tiered sun dress by River Island (above right).  2 Piece Polo Shirt &amp; Shorts Set  From £20.00  V by Very  Shop Colourblock T-shirt &amp; Short Set  From £10.00  Mini V by Very  ShopLike Sharlene, Ola loves a shorts and top set for her boys, Micah-Remi and Dream. This orange polo shirt and shorts (above left) are smart enough for a holiday dinner, while the colour block tee and shorts (above right) are ideal for running around on the beach or at the park. Family Hibiscus Matching Looks  From £16.00  Mini V by Very  Shop Freya Stripe Floppy Hat £25.00  Accessorize at Very ShopIf you love to match the whole family, then this is the mini-me set for you (above left). In a lovely fresh blue hibiscus print, it's got summer holidays written all over it. Get shorts and a shirt for little boys, a shirt for dad and dresses for mum and the girls. Your holiday snaps have never looked so cute.",
        "And keep the sun off your face with this ultra-chic floppy hat by Accessorize (above right). It'll add a touch of Riviera glamour to any look.Whether you're jetting abroad or enjoying a staycation in the UK, Very has got everything you need for a stylish summer. Click HERE to shop now. "
    ]
}