{
    "articleURL": "/wires/pa/article-12039809/Man-held-police-shotgun-cartridges-thrown-Buckingham-Palace.html",
    "content": [
        "A man is being questioned by police after suspected shotgun cartridges were thrown into the grounds of Buckingham Palace, days before the King’s coronation.",
        "The suspect was detained at about 7pm on Tuesday after he approached the palace’s gates in central London and threw a number of items, the Metropolitan Police said.He is being held on suspicion of possession of an offensive weapon after a knife was found, the force said.",
        "Police carried out a precautionary controlled explosion which could be heard live on GB News, while cordons were put up in the area just hours before a major military rehearsal of the coronation procession overnight.Footage captured by Australia’s Channel 7 News showed four officers detaining the man, dressed in an olive green gilet and checked shirt, outside the gates to the palace near to a security hut where armed officers are stationed.The man is then seen being walked backwards while handcuffed to a police van.Scotland Yard say they are not treating the incident as terror-related.It is understood it is being treated as an isolated mental health incident.The arrest comes as a ring of steel is expected in the capital for Charles’s coronation at Westminster Abbey on Saturday.",
        "Neither the King nor the Queen Consort were at Buckingham Palace at the time of the incident, but Charles did host Australian Prime Minister Anthony Albanese during an audience at the palace earlier on Tuesday.",
        "The items thrown into the palace grounds “have been recovered and will be taken for specialist examination”, the Met Police said.The man was also found with a “suspicious bag”, the force added.Footage from the scene in the aftermath of the incident showed police cars parked outside the palace, with officers and sniffer dogs patrolling near the gates.Officers could also be seen examining a number of items strewn across the floor just outside the gates.",
        "Chief Superintendent Joseph McDonald said: “Officers worked immediately to detain the man and he has been taken into police custody.“There have been no reports of any shots fired, or any injuries to officers or members of the public.“Officers remain at the scene and further inquiries are ongoing.”Buckingham Palace declined to comment and said the incident was a matter for the Met Police.It comes after policing minister Chris Philp described the coronation as a “huge policing operation”, as heads of state and foreign royals from around the world are set to travel to the UK for the ceremony. There have been no reports of any shots fired, or any injuries to officers or members of the public  Chief Superintendent Joseph McDonald  In February, Jaswant Singh Chail, then 21, admitted a charge under the Treason Act of trying to harm the late Queen.",
        "He was caught in the grounds of Windsor Castle with a loaded crossbow on Christmas Day 2021, close to the late Queen’s private residence, where she and other members of the royal family were at the time."
    ]
}