{
    "articleURL": "/femail/article-12041813/Stephen-tWitch-Bosss-widow-Allison-Holker-breaks-tears-opens-suicide.html",
    "content": [
        "Allison, 35, spoke out about her 40-year-old husband's suicide on Today In her first TV interview since his death, she said she believes Ellen Show star tWitch 'wanted to be the strong one for everyone' so it was 'scary' to ask for helpSpeaking about their children - Weslie, 14, Maddox, six, and Zaia, three - she said they kept asking, 'When is Daddy coming home?'",
        "Stephen 'tWitch' Boss's widow Allison Hollker has opened up about the 'shock' she felt over her late husband's suicide in an emotional new interview, revealing how she and the couple's three children are coping with the loss of their 'Superman,' five months after he took his own life. ",
        "Sitting down with the Today show's Hoda Kotb for her first TV interview since the Ellen Show star's death, Allison, 35, shared insights into her husband's mental health struggles, breaking down as she recalled how tWitch always wanted to 'be the strong one for everyone' and how that left him 'a little scared' to ask for help. 'He wanted to be the strong one for everyone and I think it was a little scary for him to think that he might need to ask for help,' she shared.Allison, who wed tWitch in 2013, admitted that it 'breaks her heart' that she didn't 'see it coming,' adding that she 'feels sad' that her late husband was 'so there' for her and their kids - Weslie, 14, Maddox, six, and Zaia, three - while secretly battling his demons. 'I still feel like I'm like the rest of the world, where I'm still shocked,' she said. ",
        "'No one's ready for that moment and there's no one that saw this coming. No one. And that also breaks my heart too. But I feel so sad that he was so there and we weren't in the knowing.'He was so much love and light. He really wanted to be everyone's Superman, he said that a lot.",
        "'He could hold so much for people and I do think it was hard for him to process that at the end.'The So You Think You Can Dance alum and Ellen DeGeneres co-host died from a self-inflicted gunshot wound in December at the age of 40, and his loved ones have grieved in private ever since. Allison confessed that she initially asked herself whether she had missed any warning signs about her husband's struggles, saying: 'I did it a lot in the beginning. I eventually had to tell myself that I can't change anything that's happened.'When asked by Hoda how she has remained so 'strong,' the dancer admitted that she has no other choice - particularly when she is around the couple's three children. 'It's all for them, I don't really have any other choice but to be strong,' she said, before admitting: 'They still see me have my highs and lows because there's a lot of it.'While Allison is still grieving the loss of her husband, who she described as a 'magical' person, she said that she is trying to focus on the incredible memories that they made together during their 13-year relationship, explaining that she knows the pain she feels now is a sign of just how 'much love' they shared. ",
        "'Our love was magical and it was so real and I think that's the hardest part about all of this,' she explained.'The way we loved was so big and I got 13 years with one of the most magical humans. I learned so much about love and gratitude.tWtich, who was a longtime executive producer of the Ellen DeGeneres show, passed away on December 13 inside a hotel room at the Oak Tree Inn in Encino, California, having checked in at 10:30am that day. His body was discovered the following day after he failed to check out of his room.  It was reported by TMZ that he left a suicide note in the hotel room alluding to the challenges he faced in the past and turned his phone to airplane mode before shooting himself dead. tWtich's wife of nine years, contacted Los Angeles police on Tuesday to report him missing, saying he had left without a word a day earlier and wasn't returning her calls, TMZ reported, citing law enforcement sources.Allison insisted there had been no fight or dispute that precipitated his departure, just three days after their wedding anniversary, and said his lack of contact was extremely out of character.While chatting with Today, Allison said she still 'talks to him every night,' adding that she tells her kids to do the same because 'communication is key.'",
        "'I talk to him every night. And it's different every night, sometimes it's just like, \"I took the kids to school.\" Sometimes it's deeper, a little bit heavy,' she explained.'If I'm feeling this much pain it's because I've had so much love. It's honestly something I wouldn't wish for anybody. It's really hard. 'But if I've learned anything, it's that communication is key. To us, Daddy is in the stars, so we can go outside and talk to him whenever we want.'She recalled her young children asking her, 'When is daddy coming back?' and, 'Is daddy coming back when he's older?'",
        "But she tries to focus on the positive times they've had together, adding, 'We get to live in those great memories that we have. I do feel like he's with me. We know he's guiding us through every single day.'Allison noted that Ellen has been 'a huge support system' for her since her husband's death. She explained that she and the talk show host 'talk about the fun memories we have about him.'Following his passing last year, the TV personality paid tribute to him online, calling him her 'family' and a 'pure love and light.'The star said: 'I will miss him. Please send your love and support to Allison and his beautiful children - Weslie, Maddox, and Zaia.'",
        "Allison added that she hoped by being honest about what he went through could 'bring awareness to mental health and open up conversations.''[I hope it] helps people to feel comfortable asking for that help. I really do want to make an impact on behalf of someone I love so much,' she concluded.Just a month prior to his passing, the beloved DJ had told the Jennifer Hudson Show that he and Allison were considering adding to their family – saying: 'I love the little babies, I love them. It's a constant conversation.'The last video the dancer posted on social media showed him smiling and laughing with his family.Jennifer Lopez, Questlove, and Michelle Obama were among the other famous names who honored the DJ following his passing.Sharing a post on her Instagram page, Jennifer wrote: 'tWtich was such a light and a beautiful soul. Shocked and deeply saddened.'My heart breaks for @sir_twitch_alot, his wife and children. Sending you love and strength.'Following his death, Allison also released a statement to People gushing over his legacy. 'Stephen lit up every room he stepped into. He valued family, friends and community above all else and leading with love and light was everything to him,' the widow said. 'To say he left a legacy would be an understatement, and his positive impact will continue to be felt.' "
    ]
}