{
    "articleURL": "/wires/aap/article-12038601/Wallaroos-door-ajar-Reds-Kiwi-recruit-Dallinger.html",
    "content": [
        "It was Carys Dallinger's dream to wear a Black Ferns jersey but the Queensland Reds No.10 says it \"wouldn't feel wrong\" to wear a gold one instead now she's been embraced at Ballymore.",
        "Dallinger has been a revelation in the Reds' charge to Saturday's Super W grand final in Townsville.But ahead of the showpiece match against Fijiana Drua, New Zealand-born Dallinger revealed to AAP she should have been playing for the NSW Waratahs.She said the club \"backed out\" on a verbal agreement, forcing her to Brisbane at the 11th hour.She has flourished alongside fellow recruits Dianne Hiini, Cristo Tofa and Sam Curtis at Ballymore and, thanks to her Australia-born father, opened up a new door.\"I knew I was eligible (to play for Australia), but the black jersey's always been the goal,\" Dallinger told AAP.'Not making Black Ferns this year was another disappointment ... so I thought I'd come over and ride the wave.\"She said the NRLW have shown an interest in attracting her across codes but she is keen to commit to the Wallaroos, whose new centralised contracting system has made them more competitive.Dallinger played for the Hurricanes in New Zealand's semi-professional provincial league, where players train almost twice as often as their Australian counterparts.That well-honed skill has shone through. Dallinger's in-game kicking and playmaking has transformed the Reds, while she booted two late penalties in their 23-20 semi-final defeat of the Brumbies.A severe bout of COVID-19 ruled her out for more than three months to ruin her 2022 World Cup hopes and Dallinger was overlooked for this year's Black Ferns Test squad.",
        "New Zealand rugby's loss looks likely to be Australia's gain when coach Jay Tregonning announces his squad for a May 20 Test against Fiji next week.\"I've been in the system in NZ for so long and been told, 'You're a future player, you're not ready yet',\" Dallinger said.\"But they're signing girls younger than me in the same position. What more can I be doing?\"Here I've been accepted, allowed to play really free rugby and express myself.\"It's been cool they've let me do that and it's got the attention of the Wallaroos coaches.\"I'm grateful for them to even look at me as an option, so it wouldn't feel wrong to play for them.\"The 23-year-old admits she has not yet thought about the prospect of facing the country of her birth at a World Cup.\"I've got to be offered a contract first,\" she said.\"But that would be pretty weird; I'd say I'd be getting a few cheap shots.\""
    ]
}