{
    "articleURL": "/wires/reuters/article-12043869/Day-set-return-action-vertigo-derailed-Masters-plan.html",
    "content": [
        "May 3 (Reuters) - A well-rested Jason Day will return to competition this week for the first time since enduring a horror finish to last month's Masters that the Australian revealed on Wednesday was due to another bout of vertigo.",
        "Day had a chance at a top-12 finish at Augusta National that would have secured him an invite to the 2024 Masters but came apart in spectacular fashion with four double-bogeys across his last 10 holes to finish in a tie for 39th place.\"So last round of the Masters I had vertigo, so that was obviously not fun to play in that final round,\" world number 34 Day told reporters ahead of this week's Wells Fargo Championship in Charlotte, North Carolina.\"We had to finish our third round Sunday morning and then I was sitting in the caddie hut and that's when I got vertigo.\"Vertigo has been an issue for Day in the past, perhaps most notably at the 2015 U.S. Open at Chambers Bay when he collapsed on his final hole of the second round.Day said he has not had \"too many bouts\" of vertigo since 2015 and that when it would return it would typically last for about three holes and then gradually get better.In late March, the 35-year-old Australian sought medical attention during his quarter-final loss to Scottie Scheffler at the PGA Tour's Match Play event.\"I'm going to say it was vertigo, but I just didn't really want anyone to -- I didn't want to talk about it too much, especially the Match Play because it was just like a small bout of it,\" said Day.",
        "\"But it really kicked my butt at Augusta. That was like kind of the time where I had to take a step back.\"The former world number one, who won the most recent of his 12 PGA Tour titles in 2018, has made huge strides since he slid down the rankings due to a mix of back issues, swing changes, putting woes while also dealing with the death of his mother.The Australian was even considered a contender going into the Masters given a return to form that had produced five top-10 finishes in seven events going into the year's first major.\"I am under a lot more stress this year than what I was in previous years just because of where I am week in and week out,\" Day said.\"I've been playing a lot better so there's obviously more stress and when you have more stress, your immune system can get compromised and for me it was just unfortunate that happened in the last round.\"But I've had three weeks off and I feel like I'm getting a handle on it, which is good, so it will just take some time.\" (Reporting by Frank Pingue in Toronto Editing by Christian Radnedge)"
    ]
}