{
    "articleURL": "/wires/pa/article-12050173/Quite-legacy--Julian-Assange-asks-King-visit-prison.html",
    "content": [
        "Julian Assange has written to the King asking the monarch to visit him in prison.",
        "The WikiLeaks founder has spent more than four years in Belmarsh prison in London as he fights a lengthy legal challenge against an attempt to extradite him to the US.He has been behind bars since being dragged out of the Ecuadorian embassy in London where he had sought refuge from being sent to the States. It is here that 687 of your loyal subjects are held, supporting the United Kingdom's record as the nation with the largest prison population in western Europe  Letter from Julian Assange  He fears being jailed for the rest of his life if he is extradited for questioning over the activities of WikiLeaks.His letter to Charles reads: “It is here that 687 of your loyal subjects are held, supporting the United Kingdom’s record as the nation with the largest prison population in western Europe.“As your noble Government has recently declared, your kingdom is currently undergoing ‘the biggest expansion of prison places in over a century’, with its ambitious projections showing an increase of the prison population from 82,000 to 106,000 within the next four years. Quite the legacy, indeed.“As a political prisoner, held at Your Majesty’s pleasure on behalf of an embarrassed foreign sovereign, I am honoured to reside within the walls of this world class institution. Truly, your kingdom knows no bounds.",
        "“During your visit, you will have the opportunity to feast upon the culinary delights prepared for your loyal subjects on a generous budget of £2 per day.“Savour the blended tuna heads and the ubiquitous reconstituted forms that are purportedly made from chicken. And worry not, for unlike lesser institutions such as Alcatraz or San Quentin, there is no communal dining in a mess hall.“At Belmarsh, prisoners dine alone in their cells, ensuring the utmost intimacy with their meal.“You will also have the opportunity to pay your respects to my late friend Manoel Santos, a gay man facing deportation to Bolsonaro’s Brazil, who took his own life just eight yards from my cell using a crude rope fashioned from his bedsheets. His exquisite tenor voice now silenced forever.“Venture further into the depths of Belmarsh and you will find the most isolated place within its walls: Healthcare, or “Hellcare” as its inhabitants lovingly call it. Here, you will marvel at sensible rules designed for everyone’s safety, such as the prohibition of chess, whilst permitting the far less dangerous game of checkers.”",
        "Support for the release of Assange is growing across the world.Thousands of people attended events on Thursday highlighting his case, on World Press Freedom Day.They referred to a speech by US President Joe Biden at the White House Correspondents’ Dinner, where he said journalism was not a crime."
    ]
}