{
    "articleURL": "/wires/reuters/article-12041509/SpaceX-alternatives-lawsuit-upends-Musks-Texas-launch-plans.html",
    "content": [
        "By Joey Roulette and Clark Mindock",
        "WASHINGTON/NEW YORK, May 3 (Reuters) - Elon Musk-led SpaceX has few alternative options for test-launching its giant Starship spacecraft in the near term if a newly-filed lawsuit disrupts the breakneck speed of development at its remote Texas launch site, legal and industry experts say.Conservation groups sued the Federal Aviation Administration (FAA) on Monday for approving SpaceX's rocket operations without conducting a deeper review of its environmental impact on land surrounding the Boca Chica, Texas, launchpad.That lawsuit was filed 11 days after the debut Starship flight toward space showered sand and debris miles from the Texas launchpad, and hurled chunks of reinforced concrete and metal shrapnel thousands of feet from the site, adjacent to a national wildlife refuge.Starship is SpaceX's next-generation rocket crucial for the company's commercial launch business and Musk's aim to start human colonies on Mars. And NASA is banking on SpaceX's quick development timelines to use Starship for landing humans on the moon by around 2026.While the Texas site, named Starbase, is only intended for testing, and Starship will ultimately operate in Florida, a lengthy court battle or a ruling against the FAA could nix Musk's goal to try another test launch in as little as two months.Legal experts with experience in the kinds of claims brought on Monday said the lawsuit could cause massive delays if a court tells the FAA to conduct a full environmental impact statement review.",
        "\"You could be looking at anywhere from two to five years,\" Penn State Law professor Jamison Colburn said.Test sites suitable for massive prototype rockets like Starship require a narrow set of conditions.Launching far from populated areas and near a coast - so the rocket can arc toward space over water rather than cities - are the most challenging conditions to meet, said Caryn Schenewerk, a former senior attorney for SpaceX who worked on selecting Starship's site.The U.S. offers few such options and export controls would make building a foreign launch site difficult.\"We did a thorough survey of possible U.S. locations and Starbase ended up being the ideal site,\" said Schenewerk, now an independent consultant.SpaceX did not reply to requests for comment.FLORIDA ALTERNATIVEMusk in 2022 said SpaceX's flagship Launch Complex 39A at NASA's Kennedy Space Center in Florida was an alternative to Texas if a deeper environmental review of Starbase was triggered, adding the site would eventually become Starship's \"main operational launch site.\"But that site subject to its own environmental review. And NASA officials are concerned a Starship explosion on LC-39A, which SpaceX uses for Falcon 9 astronaut launches, could damage infrastructure used to send NASA astronauts to the International Space Station, Reuters reported last year.",
        "SpaceX is equipping a different launchpad on U.S. Space Force property for astronaut launches to quell NASA's concerns.SpaceX has eyed another Kennedy Space Center launch site for future Starship launches, LC-49, a few miles from LC-39A. But that location is in the midst of a lengthy environmental review that could take years. Kennedy Space Center did not reply to questions.The U.S. Space Force's Vandenberg spaceport in California, where SpaceX has two Falcon launchpads, is limited to a specific launch trajectory unsuitable for Starship test launches, analysts said. The Space Force unit managing Vandenberg launches did not immediately respond to a request for comment.And the Wallops Flight Facility in Virginia, likely too small for the Starship development program, would prompt additional environmental reviews if SpaceX opted to move there, analysts said, citing the surrounding protected lands.The Virginia Spaceport Authority was not immediately available for comment.\"Unless there's some very specific environmental changes, or there's some population that really, really wants a spaceport in their backyard, we will never have another operational new spaceport in this country,\" said Michael Mealling, a Georgia-based investor who was involved in a bid to setup a spaceport in his home state.Plans for that orbital launch site, Spaceport Camden, were nixed by a local referendum after a lawsuit raised concerns about its environmental impact.",
        "SpaceX in 2020 acquired two offshore oil rigs that it planned to convert into \"ocean spaceports\" for Starship, Musk has said. In February, however, SpaceX President Gwynne Shotwell said the company sold the rigs because \"they were not the right platform.\"Murray Feldman, an attorney at the law firm Holland &amp;amp; Hart, said it was possible Congress could throw out the need for the environmental review if the project delays were deemed a national concern, given NASA's plans for a moon landing by 2026 - a deadline the agency's chief Bill Nelson has cast to lawmakers as an urgent race with China.Feldman said Congress previously passed laws that override environmental review requirements, including last year when it mandated the Biden administration issue certain oil and gas leases in the Gulf of Mexico.\"If the SpaceX efforts were truly important enough to the nation that Congress felt they needed to go forward and this delay would be too significant, there's always the possibility for something to happen,\" he said.(Reporting by Joey Roulette in Washington and Clark Mindock in New York; Editing by Ben Klayman and Jamie Freed)"
    ]
}