{
    "articleURL": "/wires/ap/article-12038667/Shot-fired-Memphis-TV-station-suspect-nearby-business.html",
    "content": [
        "MEMPHIS, Tenn. (AP) - A shot was fired at a Memphis television station on Tuesday, but no one was wounded, the station said.",
        "The suspect then hid in a nearby business before he was arrested about two hours later, police said.WHBQ, the Fox affiliate in Tennessee´s second-largest city, reported that the shot was fired about 11:30 a.m. The bullet came down outside the front door of the lobby of the building, which is in a commercial area near the University of Memphis campus.Police said the armed suspect went into a nearby hamburger restaurant, and authorities advised the public to stay out of the area. The university and Memphis police said about two hours later that the suspect had been taken into custody. No injuries were reported, Memphis police said.The university issued an advisory telling students and faculty to shelter indoors. It later said that normal campus activity could resume.The station said employees were evacuated to a parking lot for about 30 minutes after the shot was fired, while police secured the area.",
        "\"We are all back inside the building now and are still safe,\" the station said in a news story posted on its website.The suspect first approached a station employee outside of the gate wanting to talk, the station said. The suspect then showed the employee that he had a gun.The employee then ended the conversation and left before the suspect went to the front of the building and fired a shot, the station said.",
        "Police did not release any immediate information about the suspect.Memphis Police Department Deputy Chief Stephen Chandler told reporters that it was not clear if the shot was fired intentionally or by accident. He said the shot was fired with an \"AR-style rifle\" and the bullet hit glass and a desk.An apartment complex and businesses near the station were evacuated. Chandler said crisis negotiators spoke with the suspect while he was inside the restaurant and helped take him into custody.\"He wanted to meet with media. He had a message to send out,\" said Chandler, without providing details about what the suspect wanted to say."
    ]
}