{
    "articleURL": "/wires/reuters/article-12057113/Soccer-Arsenal-beat-Newcastle-2-0-stay-title-hunt.html",
    "content": [
        "NEWCASTLE, England, May 7 (Reuters) - Arsenal showed no sign of raising the white flag in the Premier League title race with a 2-0 victory at Newcastle United on Sunday to close the gap on leaders Manchester City to one point.",
        "Defeat would have left Arsenal's hopes of a first title since 2004 hanging by a thread but Martin Odegaard's brilliant strike and a Fabian Schar own goal sealed a vital victory.Newcastle, bidding to cement third place and take a big step towards a top-four finish, dominated early on but Odegaard's sweet strike after 14 minutes gave the visitors the lead.Schar then inadvertently turned in Gabriel Martinelli's cross with 20 minutes remaining.City, who have won 10 straight games to catch and then overhaul Arsenal, have 82 points from 34 games with the Gunners on 81 having played a game more.Newcastle remain in third spot on 65, helped by fourth-placed Manchester United's surprise 1-0 defeat at lowly West Ham United later on Sunday.If ever there was a test of the resolve of Mikel Arteta's Arsenal team it was a trip to St James's Park to face a Newcastle side on a roll in their quest to return to the Champions League after an absence of two decades.They also had the bitter memory of a 2-0 defeat at Newcastle a year ago that scuppered their top-four hopes.But this Arsenal side, despite the recent wobbles that have cost them top spot, are made of much sterner stuff.\"The message (to City) is we'll go as hard as we can for three games and we will be pushing and if City slip up we will be there to pick up the pieces,\" keeper Aaron Ramsdale said.",
        "EARLY ONSLAUGHTArsenal were fortunate to survive an early onslaught with Newcastle's Jacob Murphy thumping a second-minute shot against the foot of the post and Alexander Isak forcing Ramsdale into the first of several important saves.Newcastle were then awarded a penalty after a Bruno Guimaraes shot was blocked by Jakub Kiwior and referee Chris Kavanagh pointed to the spot for apparent handball.But after a VAR check the decision was overturned to the obvious relief of the visitors.Arsenal then took the lead with their first shot as the inspirational Odegaard was allowed too much time and sent a skidding effort inside the post from outside the penalty area.The visitors were devastatingly effective on the counter-attack and Odegaard was at the heart of all their best work, releasing Martinelli who forced Nick Pope into a smart save.Pope came to Newcastle's rescue again in stoppage time at the end of a frenetic first half, keeping out Odegaard's shot with his legs after the Norwegian looked favourite to score.The second half began in almost identical fashion to the first with Murphy's cross headed against the post by Isak and Ramsdale somehow keeping out Schar's close-range header.Arsenal were a threat on the break though and Martinelli curled a shot against the crossbar.",
        "The Brazilian the wrapped it up as he carried the ball down the left before accelerating to the byline and fizzing in a low cross that deflected off the unfortunate Schar into the net.\"Fine margins for us today and we just came out on the wrong side of them,\" Newcastle boss Eddie Howe said. \"If Jacob's chance goes in early on it is a totally different game.\" (Reporting by Martyn Herman; Editing by Ken Ferris)"
    ]
}