{
    "articleURL": "/tvshowbiz/article-12051323/Arsema-Thomas-speaks-importance-intimacy-coordinator-Bridgerton-prequel.html",
    "content": [
        "Arsema Thomas has spoken about the importance of an intimacy coordinator in the Bridgerton prequel as she appeared on the digital cover of Cosmopolitan. ",
        "The star plays young Lady Agatha Danbury in Queen Charlotte: A Bridgerton Story, which focuses on young Queen Charlotte's rise to prominence and power.Arsema, 28, who uses she/they pronouns, described the raunchy scenes as a 'dance' and stressed the importance of an intimacy coordinator.The introduction of intimacy coaches have caused much debate after rising to prominence in Bridgerton, with Arsema weighing in on the issue.She said: 'The role of an intimacy coordinator was super important. It's important overall across the board, but it was super important for the work we were doing because the entire season is quite sensuous in that it engages all five senses. ",
        "'There's this tactile second language in Bridgerton and Queen Charlotte so to allow those moments to have their weight, rather than to just be sex.'The intimacy coordinator made it her priority to have all of our comforts in her mind, but also, she allowed us to see intimate scenes as different.She continued: 'There is a beauty in looking at it like a choreographed dance, which allowed it to be something that was less uncomfortable and more a partnership between both the actors there, it's extremely important.'Arsema also revealed that the intimacy coordinator is there to remind actors and actresses that their comfort is also their priority during filming.",
        "She said: 'There's so much grey line when it comes to the body and how we feel comfort and knowing that you're not going to bother the director or the producer…'That somebody is there to remind you that your comfort is also your priority – not just the lines, not just the acting. 'It's super crucial for any type of acting that you can do. Because then it's not acting. It's just a documentary.'Arsema, who had originally planned to go into global public health as a career, moved into acting after losing her father.She also believed in the importance of story-telling as there were not many people who looked like her on screen in the early 2000s. Arsema said: 'A lot of the self-hatred that I harboured was stemming from the fact that I felt as though I was not worthy of being heard or worthy of having a fully formed story.'I decided that my way of regaining that [sense of self-worth] was to engage in what I believe is the most powerful tool: storytelling.'She did short courses at the Cours Florent in Paris and RADA and then graduated with a Masters of Fine Arts in Professional Acting from LAMDA in 2022. ",
        "Arsema shared that early in their career they were in scenes without an intimacy coordinator and it left them feeling 'exposed' and their acting 'real'.",
        "They added: 'I've been in scenes before, very early on, where there was no intimacy coordinator, and I remember feeling extremely exposed in a not artistic way.'It made what we filmed [feel] real. And that means that somewhere on an SD card is my trauma, just archived. And it feels as an actor like you lack agency.'Arsema went on to reveal that they were working at a butcher's shop in Notting Hill when they found out they got the role of young Lady Danbury. The actress said that their phone was ringing in their pocket while they were cutting up meat at the very lavish shop.She said: 'We're not allowed to have [our phones] on the [shop] floor, but I knew that I was getting the word today. 'So, the moment I heard it ring, it was the worst moment because my hands were covered in blood and guts.'It was slipping out of my hand. I was like, 'I have to miss this call, let me go and wash my hands'. Then my agent called me [again]. It was a good day!'The star admitted that there were challenges involved in playing Lady Danbury in the show, as the character was at a different life stage to them.",
        "They revealed that they were tasked with being able to say words with organic confidence in order to make the audience believe the character's strength.  She said: 'I think for anybody who's insecure, it's difficult to force that when you don't feel it. I'm still growing that part of me.'",
        "Arsema worked with India Amarteifio, who plays Queen Charlotte and said that acting together was brilliant. Filming for the prequel took quite a turn at one point, as the classical tunes switched to the empowering Beyoncé tune Run The World during the ballroom scene. Suddenly, there was a huge dance battle and the energy changed in the room as everyone starting 'Voguing'.Elsewhere, the star has also received some helpful advice from the original Bridgerton cast ahead of the release of the prequel.However, they revealed that they are trying to be 'chill, cute and humble.'They said: 'I talked to Luke Newton, who plays Colin, and he gave me a couple of tips, and so did Regé-Jean Page.'But people can only give you so much advice – I'm trying to keep it chill, cute and humble, because you never really know how people are going to react.'",
        "Arsema also spoke about the possibility of overnight fame, revealing that she wants people to walk away 'feeling' after seeing Queen Charlotte.",
        "Opening up, she said: 'If the priority is to be relevant or to be the star, you will constantly be hungry. I want people to walk away feeling.'There are a lot of powerful moments in Queen Charlotte, and I think when people feel something, it means we've done our job.'Meanwhile, the star is conscious of the ageism that women experience in the media, as they are often deemed unsuitable for certain roles as they get older.But Arsema emphasised the importance of pushing the boundaries by focusing on Golda Rosheuvel and Adjoa Andoh's characters in the spin-off of Bridgerton.They added: 'This is something that's rarely done: older women being the instigators of change and then being able to have a spin-off show that's set solely about them. 'It's one of the most revolutionary things I've seen.'",
        "The actress is also a keen activist, choosing to involve themselves in difficult conversations as it fulfils them.Arsema said: 'It's the one thing you can fight for and know you're on the right side [of history]. 'The exact point of racism is to strip people of their humanness and uniqueness. When I recognised that, it became a necessity to make [activism] part of whatever I do for the rest of my life, because it fulfils me.'",
        "Arsema Thomas is the new digital cover star, as part of an interview available on the magazine’s website.Watch the full Arsema Thomas interview on the YouTube channel"
    ]
}