{
    "articleURL": "/femail/article-12058733/She-roars-Princess-Charlotte-sings-word-word-Katy-Perrys-Roar.html",
    "content": [
        "Princess Charlotte, 8, stole the show at her grandfather's Coronation concertREAD MORE: Prince George and Charlotte dance at the Coronation Concert Princess Charlotte put on the most adorable display while singing along to Katy Perry's 'Roar' at King Charles's star-studded Coronation concert.",
        "The singing princess, 8, who celebrated her birthday last week, had a front row seat at her grandfather's historic concert, alongside her mother Kate Middleton.She looked darling in a cream buttoned-up coat and black tiered chiffon dress from Self Portraits Kids, one of the Princess of Wales' favourite brands. The music extravaganza was put on in honour of the crowning of King Charles and Queen Camilla at the official Coronation on May 6, and featured music sensations Lionel Richie and Katy Perry.The princess and her mother were spotted having fun, with the junior royal showing her vocal prowess, as she adorably sang along to the US megastar's monster hit Roar.",
        "The sweet moment was shared on Twitter, as Charlotte sang along to the chorus and even joined mother Kate to wave their Coronation flags in unison to the beat.Royal fans went wild over the video - which has since been viewed almost 800,000 times - with one person tweeting: 'OK I'm no royal watcher and ran across this by coincidence, but that is freaking cute.'Another person agreed, adding: 'Looks like there's a new KatyCat', referring to the nickname given to the singer's most avid fans. A third joined in and said: 'This Princess knows her music, so nice to see she gets to stay up on the new songs. This little girl is as classy as her mother, she has the greatest teacher. They are such a beautiful family.' ",
        "It comes amidst a busy few days for the little royal and her siblings, who all played a starring role in the Coronation to watch their grandfather being crowned King. Prince George, nine, was selected as one of the monarch's Pages of Honour, while Charlotte took a protective and reassuring role with her younger brother Louis, five, at the event.Charlotte was seen sitting alongside her little brother in a royal car with their parents after leaving the palace in the morning, and in the front row of the Abbey a short time later.",
        "She wore an Alexander McQueen dress and cape in ivory silk crepe with ivory stitch embroidery featuring rose, thistle, daffodil and shamrock motifs, to signify the four nations.She also wore a Jess Collett x Alexander McQueen Headpiece silver bullion, crystal and silver thread work, similar to the headpiece the Princess of Wales wore for the occasion.Meanwhile, she held hands with her cheeky little brother during the opening moments of the historic service.",
        "They were immaculately behaved during the service, with Charlotte proving a reassuring presence to her younger brother, who couldn't help stifle a few yawns during the sacred service.George, Charlotte and Louis were reunited after the service when they rode away from Westminster Abbey to Buckingham Palace in a carriage with William and Kate.",
        "The trio later appeared on the balcony of Buckingham Palace with their parents, their newly crowned grandparents The King and Queen and the other working royals. During this appearance, Charlotte could be seen sharing a giggle with her youngest brother, Prince Louis.More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen's funeral in September."
    ]
}