{
    "articleURL": "/wires/reuters/article-12043899/Families-US-detainees-urge-Biden-to-deter-hostage-taking.html",
    "content": [
        "By Humeyra Pamuk",
        "WASHINGTON, May 3 (Reuters) - U.S. citizen Jose Pereira, who was \"wrongfully detained\" in Venezuela exactly one year ago, stood meters away from the White House on Wednesday and pleaded with U.S. President Joe Biden to step up efforts to bring home Americans detained abroad.Pereira was among the executives who worked for U.S. refiner Citgo in Venezuela who were jailed in 2017 on corruption charges. He was freed as part of a prisoner swap between Washington and Caracas last October.Speaking at an event organized by the \"Bring Our Families Home\" campaign, an advocacy group set up largely by the families of American citizens detained abroad, relatives called on Biden to do more to bring home their loved ones but also deter \"hostage-taking\" by foreign governments and groups.\"This has become a national security issue,\" Pereira said, adding that Americans were being targeted as hostages instead of being targeted on the battlefield. \"This practice is growing and growing and growing. And this practice must stop.\"Proponents of \"Bring Our Families Home\" are urging Biden to take steps including more swaps of prisoners and easing of sanctions against countries that are holding U.S. detainees.The plight of Americans being detained abroad gained prominence last year after Russia arrested U.S. basketball star Brittney Griner on drug charges. She was freed late last year in a prisoner swap in which Russian arms dealer Viktor Bout was released to Moscow.",
        "Most recently, Russia has detained U.S. citizen and Wall Street Journal reporter Evan Gershkovich on espionage charges, which he denies.Although the U.S. government does not provide figures, there are more than 60 Americans abroad held by foreign governments, including top adversaries like Russia, Iran and Venezuela, according to the James Foley Foundation, named after an American journalist abducted and killed in Syria.China also holds a number of American citizens on charges that Washington sees as politically motivated.The Biden administration has carried out two prisoner swaps with Russia and one with Venezuela. It also secured the release of another American, Jeff Woodke, who was captured by militants in Niger. Woodke met on Wednesday with U.S. Secretary of State Antony Blinken.Families also repeated a call to meet with Biden, a plea that went unanswered for many of them for over a year.\"He needs to meet with these families and at the very least call them,\" said Joey Reed, the father of Trevor Reed, a former U.S. marine who was detained in Russia and then freed in a prisoner swap in April 2022. The release of Reed's son came after the family had a face-to-face meeting with Biden.The prisoner swaps prompted some criticism on whether they encourage more hostage-taking, an argument the families have rejected squarely, saying there is no evidence supporting that.",
        "\"Politics is what keeps our presidents from bringing our people home,\" Reed said. \"They're afraid that there will be pushback from the other party.\"(Reporting by Humeyra Pamuk in Washington Editing by Matthew Lewis )"
    ]
}