{
    "articleURL": "/wires/reuters/article-12060577/NHL-Toronto-face-high-stakes-uphill-climb-Stanley-Cup-playoffs.html",
    "content": [
        "By Frank Pingue",
        "May 8 (Reuters) - The Toronto Maple Leafs have not won a game since being labelled Stanley Cup favourites ahead of the second round of the playoffs and, barring a stunning turnaround, are headed for what could be a turbulent offseason of major change.It is a far cry from nine days ago when the Maple Leafs finally exorcised their postseason demons to reach the second round for the first time since 2004 after having lost their opening playoff series in each of the last six years.Yet here they are after Sunday's overtime loss to the host Florida Panthers staring at a 3-0 deficit in their best-of-seven series, one round deeper into the playoffs than they are used to but staring at an all-too-familiar result.\"Obviously it feels a lot more like what we've been through in the past,\" Maple Leafs head coach Sheldon Keefe said on a video call with reporters on Monday.\"It's been challenging, it's been difficult to understand yet it's our reality and it's where we're at.\"The Maple Leafs' win over Tampa Bay in the first round had convinced many that the team, a talented but long-underachieving group, would finally deliver the franchise its first Stanley Cup since 1967.Those hopes were bolstered considerably when the underdog Panthers, who squeaked into the playoffs, stunned top-seeded Boston in the first round to set up what appeared to be a favourable matchup for Toronto.",
        "But now the Maple Leafs face an uphill battle just to reach the penultimate round of the postseason as only four teams in NHL history have come back from a 3-0 deficit to win a best-of-seven playoffs series. Game Four is on Wednesday in Florida.\"Our job is to win one hockey game and not get focused or bogged down by anything beyond that,\" said Keefe.\"We can't control the big picture, we can only control one game and give us an opportunity to bring the series back to Toronto (for Game Five).\"Much of the blame for the Maple Leafs' predicament is being directed at the lack of production from the team's core group of captain John Tavares, Auston Matthews, Mitch Marner and William Nylander who account for about half the team's payroll.\"Right now the focus has got to be doing what we can control and focus on these things that really truly matter in terms of the process and the details of the game,\" said Keefe.\"The moment you get distracted and lose focus of those things you're now really working uphill.\"Barring a turnaround, the team will be forced to re-evaluate their entire roster in the offseason along with deciding whether to stick with General Manager Kyle Dubas, who is nearing the end of an expiring contract, and Keefe. (Reporting by Frank Pingue in Toronto Editing by Toby Davis)"
    ]
}