{
    "articleURL": "/news/article-12044685/Real-Jenny-Craig-weight-loss-company.html",
    "content": [
        "Jenny Craig and her husband started their company in 1983They almost lost $17,000 due to Australian vitamin regulationsMrs Craig couldn't talk for five years after a jaw injuryThe collapse of Jenny Craig's American business is yet another extraordinary challenge faced by the global weight loss empire that was founded by a dazzling woman of the same name in Melbourne in 1983.",
        "Ms Craig, who has long since sold the business, faced remarkable personal challenges as she turned the enterprise into a household name in Australia, the US, Canada and New Zealand. The Australian government nearly smothered the business just days before its launch over an issue with 'vitamin packs' and for five years Ms Craig was mostly unable to speak because of a rare medical condition.Now, Ms Craig would no doubt be looking on with concern as the company announced it was shutting down its American operations on Thursday after amassing a rumoured $250million debt, in a move that will not affect its Australian operations. ",
        "Ms Craig, an American, started her business alongside her husband, Sidney, with nine centres based in Melbourne in the early 80s; a franchise that grew to include about 600 stores around the world. The couple had decided to settle in Melbourne after signing a non-compete order as part of the sale of their former weight loss business that banned them from the US diet market for two years.Ms Craig explained she and her husband invested everything they had in setting up Jenny Craig and that 'failure simply wasn't an option'.But a mistake over innovative 'vitamin packs' that were set to launch alongside the company's prepared meals saw Jenny Craig have a run-in with the Australian government just days before the business launched.",
        "Mrs Craig explained the vitamins included selenium, a nutrient often lacking in Australian soil. ",
        "The health department told the couple the vitamins had to be returned to America or officials would 'dump them in the ocean'.'It was going to cost us $17,000 to send the vitamins back to America. We thought \"Why spend the money to ship them back?\" so we said \"You know what, if you really feel that strongly about it, dump them in the ocean\",' Mrs Craig said.'We found out later that there was no reason why the selenium couldn't remain in the packet but all we wanted to do was get our centres open. 'When she called, it was Friday and we were having our grand opening on the following Monday.'Despite its rough start, Jenny Craig quickly grew into a household name with its easy frozen meals and backing by slimmed-down Hollywood stars.But the personal hardship only continued in the mid 90s when Jenny Craig fans noticed Mrs Craig herself disappear from ads.The now 90-year-old appeared back on television five years later in 2001 on Larry King Live where she told King she had 'stripped' the muscle from her jaw after jerking herself awake from a nap.",
        "'I was sitting on the couch in my living room and I fell asleep,' she said.",
        "'I woke up with a start, my lower jaw snapped shut over upper teeth, I had to pry it down. It felt like two rubber bands had snapped on the side of my face. 'After about a week, my teeth were knocking together when I'd talk and it would send shocks up my face.'Mrs Craig said she spent three years going from specialist to specialist to find what had happened to her, all while the effects of her injury worsened.'I had stripped all the muscles in my face, I was using my tongue to hold my jaw up, so I was trying to talk and do that at the same time and my speech became very garbled,' she said.'I kept going from doctor to doctor. I went to 18 doctors all over the country.'I could open (my mouth) and close it but I didn't have control.'Eventually she was able to find a doctor who realised she'd damaged her jaw muscles and could perform surgery to help, but it would take another two years of rehabilitation to recover. '(The doctor) did some facial manipulations and he could tell. He said, \"you have no muscle tone whatsoever in your face\",' she said 'He had to use dissolvable screws to attach them to my cheekbones and it was a lot of surgery.'",
        "The couple sold Jenny Craig to Nestle in 2006, but stayed on as consultants for some time after.Just two years later Mr Craig passed at age 76 of cancer.On Thursday, 40 years on from the company's founding, US-based employees were told Jenny Craig will be closing shop 'due to its inability to secure additional financing' with the company understood to be in $250million worth of debt.Jenny Craig will remain open in Australia and New Zealand with the company explaining its international branches act as separate businesses. 'You may have heard the news that Jenny Craig USA are intending to file for bankruptcy,' it said.'While this is unfortunate news for our colleagues in the USA, the Jenny Craig operations here in Australia and New Zealand do act independently.'Here in Australia and New Zealand we currently continue to operate and support our clients. 'As always, our priority is to continue providing the best possible service. We thank you for your continued patience and support during this time.'",
        "Mrs Craig said she attributes much of her company's early success to 'hard work'. 'We took our whole fortune, every dime we had, and invested in Australia,' she told Medium.'I can remember the woman who was in charge of nutrition — she looked at me and said \"What were you thinking?\" I'm sure there were a lot of people who would not be willing to take that risk, but we knew we would be successful. ",
        "'People would say \"Gee, you're so lucky with your success\", and I'd say \"Isn't it interesting that the harder I work, the luckier I get\".'Anything you want to achieve in life, whether it's in education, whether it's building a business, it takes hard work.'"
    ]
}