{
    "articleURL": "/wires/pa/article-12060621/Pep-Guardiola-Manchester-City-not-motivated-revenge-Real-Madrid-rematch.html",
    "content": [
        "Pep Guardiola insisted revenge was not his motivation as he prepares Manchester City for their Champions League semi-final rematch with Real Madrid.",
        "City were beaten in heartbreaking fashion by the Spanish giants in the last four a year ago and have a chance to make amends this term.The first leg of their latest encounter takes place at the Bernabeu on Tuesday and Guardiola is focusing on the game in hand rather than looking back 12 months.The City manager said: “It was tough but we made an exceptional first game in Manchester and played a really good game here.",
        "“In general it was a good performance but it was not enough. You congratulate them and accept it and now one year later we are here.“We are not here for revenge. It is another opportunity. One day we will get it. We will get to the final and win it.“It didn’t happen last season as we played Real Madrid and in this competition they know exactly what they have to do.”Guardiola admitted, however, last season’s loss was hard to stomach at the time.City controlled the tie in the second leg and looked on course for the final, leading 1-0 on the night and 5-3 on aggregate heading into injury time. We are not here for revenge. It is another opportunity. One day we will get it. We will get to the final and win it.  Pep Guardiola  ",
        "Yet they dramatically capitulated, conceding twice in quick succession and going on to lose in extra time.It added to the catalogue of near misses experienced by the club since Guardiola took charge in 2016, which includes defeat in the 2021 final.Guardiola said: “Seven years ago we wanted to win the Champions League. Last season it was (like) the end of the world but here we are again.“Being stable is the most important thing. The important thing is we are trying to get better every year.“We were prepared last year too. We are the same manager, mainly the same players but completely different games.",
        "“The difference is the second leg is at home and everything will be decided in Manchester.”Unlike Guardiola, midfielder Rodri admitted revenge was on his mind.The Spain midfielder said: “Football gives you the option to have revenge.“We have the philosophy you can always learn from past experiences. We did a great two games but football is like this and we didn’t go through.“We will fight again. We will try to learn from what we did bad in that moment.”City are without defender Nathan Ake after the Netherlands international suffered a calf injury in Saturday’s Premier League victory over Leeds."
    ]
}