{
    "articleURL": "/wires/ap/article-12052123/With-detailed-race-question-Census-end-ancestry-ask.html",
    "content": [
        "Is ancestry history? The U.S. Census Bureau is contemplating getting rid of a question about a person's ancestry on its most comprehensive survey, saying it may duplicate a newly-revised race question that allows respondents to write from where they or their antecedents came.",
        "The Census Bureau is conducting research to determine if they get fewer responses, if data quality is compromised and what similarities or differences there are between the race and ancestry questions on the American Community Survey. The ancestry question has been asked since the 1980s.Preliminary findings show that respondents are more likely to answer the race question than the ancestry query and that the data pulled from the race question covers 88% of the 126 ancestry groups the statistical agency lists, Census Bureau officials told an advisory committee on Friday.Some civil rights groups, though, are worried the changes are premature and want the bureau to wait until detailed race data from the 2020 census is released for comparison. They also say proposed changes to the federal government's race and ethnicity categories by the White House´s Office of Management and Budget could impact the way people respond.The OMB's proposed changes, currently under review, would combine the race and ethnic origin questions into a single query because some advocates say the current method of asking about race and separately about ethnic origin often confuses Hispanic respondents. It also would create a new category for people of Middle Eastern and North African descent, also known by the acronym MENA, who are now classified as white but say they have been routinely undercounted.",
        "\"It is possible, for example, that respondents view their `ancestry´ - and the ancestry of their household members, including children - differently than they view their race or ethnicity subgroup or national origin,\" The Leadership Conference on Civil and Human Rights said last month in a letter asking the Census Bureau to pause its research on the matter.",
        "The Census Bureau's decision on whether to eliminate the ancestry question likely won't come for another year or two, well after any changes to the federal government's race and ethnicity categories are decided next year.The American Community Survey is the bureau´s largest survey and asks about more than 40 topics ranging from income, internet access, rent, disabilities and language spoken at home. Along with the census, it helps determine how $1.5 trillion in federal spending is distributed each year, where schools are built and the location of new housing developments, among other things.Starting in 2020, the Census Bureau has allowed respondents to write detailed information about their background for the race question. For instance, the race question now allows a respondent to check a box for \"Black\" and then write in Haitian, Nigerian or other backgrounds in a blank box. The ancestry question asks \"What is this person's ancestry of ethnic origin?\" and allows respondents to fill in a blank box with answers like Brazilian or Lebanese.",
        "During the 2021 American Community Survey, estimates from the race question were larger or no different than estimates from the ancestry query in 87% of the 111 ancestry groups available from the race data, Census Bureau officials on Friday told members of the National Advisory Committee.However, it was lower for respondents with ancestry in several Caribbean nations as well as those with Azerbaijani, British, Celtic, French Canadian, Guyanese, Pennsylvania German, Romani and Scotch-Irish backgrounds. Census Bureau officials said Friday they want to study the reasons for that.Moving forward, the Census Bureau needs to consider how the questions are worded and what race and ancestry terms mean in people's everyday lives, said Iheoma Iruka, a committee member and research professor at the University of North Carolina at Chapel Hill.\"They are social and political, meaning they can change over time,\" Iruka said.___Follow Mike Schneider on Twitter at @MikeSchneiderAP"
    ]
}