{
    "articleURL": "/news/royals/article-12048619/TV-providers-accused-holding-news-publishers-ransom-access-live-footage-Coronation.html",
    "content": [
        "TV providers insisting on imposing high costs for publishers to access footageDespite outlets reaching agreement with the Royal Household to use imagesMajor broadcasters were last night accused of continuing to hold UK news publishers to ransom over access to live footage of the Coronation, even though publishing outlets have now reached an agreement with the Royal Household to use the livestream.",
        "Despite publishers being given the go-ahead by the monarchy to use images from tomorrow, TV providers, including the BBC, ITN and Sky, continue to insist on imposing high costs to access the footage. This has led to claims that they are trying to cash in on the historic event, rather than let it be seen as widely as possible. It is also at odds with the precedent set at the Queen’s funeral when British newspaper websites were given free access to the ‘pooled’ footage.A deal between the News Media Association, which represents UK national, regional and local news groups, and the Royal Household, says publishers would use the footage respectfully but there is frustration at the broadcasters’ high fees for it.",
        "Earlier this week one industry executive said: ‘We are being held to ransom.’Insiders have said it is ‘wrong’ for the BBC to be ‘seeking to profit’ from coverage it will already be making, when sharing it with others would not involve any extra cost.They added that news publishers wanted to ‘serve their existing readership’ given the ‘public interest of this historic occasion’.A joint statement by the BBC, Sky and ITN previously said: ‘UK broadcasters are investing heavily in the coverage of this complex and historic event and have asked for a fair and reasonable financial contribution from any third parties wishing to access the live coverage for their own use.’"
    ]
}