{
    "articleURL": "/sport/football/article-12057229/Rio-Ferdinand-Joe-Cole-left-BAFFLED-referee-VAR-deny-West-Ham-penalty.html",
    "content": [
        "West Ham were left furious after they appeared to be denied penalty in first halfThe ball struck the arm of Manchester United defender Victor Lindelof in the boxGary Lineker said that he was 'baffled' by the non-intervention of VAR Rio Ferdinand and Joe Cole were left baffled by West Ham appearing to be denied a penalty against Manchester United. ",
        "The ball appeared to strike the arm of Victor Lindelof inside the United box towards the end of the first half, with the West Ham players immediately pleading with referee Peter Bankes to award a penalty.Stuart Attwell, on VAR duty for the game, also came in for heavy criticism for his failure to intervene.  Speculatively putting the ball back into a dangerous area after it fell to him, Benrahma's volleyed cross hit the Sweden international's arm as he tried to stop it reaching Michail Antonio. Already one goal to the good and chasing a crucial three points which would all but confirm their Premier League status for next season, both Ferdinand and Cole, working for BT Sport, felt they should have been given the chance to double their advantage from the penalty spot.",
        "'Without a doubt, 100% (a handball). He’s moved his arm towards the ball I don’t understand for the life of me,' Cole said.'It killed West ham against Liverpool when they (VAR) didn’t have a look and it’s happened again. If you’re David Moyes you’ll be furious.'Moyes bemoaned refereeing errors following West Ham's defeat to Liverpool last week, accusing VAR of 'disrespect' against his side.'The hardest thing to take is the disrespect from VAR. Somebody on VAR didn’t have enough football knowledge to understand that this could be close,' he said.",
        "'The disrespect is to this football club. VAR should have said: ‘Check this out’. VAR for me showed no respect to us. I think they should apologise to the football club. We need to win points to be a Premier League team.'Ferdinand echoed his former team-mate's sentiment, adding that he 'didn't know' why the referee had not been encouraged by VAR to have a look at the incident again on the pitch-side monitor.'We all shouted handball immediately,' he said. 'His arm it moves towards the ball straightaway as soon as the ball comes within range of him. 'I don’t know how the referee hasnt been told to go over and have a look at it because it’s that much of a obvious handball when you see it in slow motion.'",
        "The incident marks yet another moment of controversy for a system that has found itself at the centre of furious debate this season.Brought in to aid referees, critics argue that the system has only sought to further fuel debate, with VAR commonly bemoaned by managers, players and supporters alike.Adding his voice to the debate, Match of the Day host Gary Lineker said it was 'remarkable' VAR didn't 'intervene'.'Clearly a handball by Lindelof,' he wrote on social media. 'Remarkable that VAR didn’t intervene.'"
    ]
}