{
    "articleURL": "/news/article-12040769/Qantas-chairman-Richard-Goyder-makes-embarrassing-mistake-announcing-new-CEO-Vanessa-Hudson.html",
    "content": [
        "Qantas chairman announces wrong CEOVanessa Hudson will take over from Alan Joyce The Qantas chairman has made an embarrassing mistake while announcing the new CEO of the major national airline.",
        "Chairman Richard Goyder was on Tuesday speaking at a press conference following the decision of current Qantas CEO Alan Joyce to step from the role in November. At the end of the press conference, Goyder was joined by Joyce and his successor Vanessa Hudson when he reportedly set out to offer a few words of encouragement which quickly backfired.'While it's never easy, the board firmly feels Olivia is the right person to take Qantas forward,' he said. Olivia is Olivia Wirth, the airline's loyalty scheme boss and runner-up in the CEO selection process. ",
        "It was the second announcement this week for Goyder, having anointed new AFL CEO Andrew Dillon on Tuesday Ms Hudson - who will be the Qantas' first female CEO -  is the airline's Chief Financial Officer and has been with company for 28 years. Along with Ms Wirth, Cameron Wallace, the CEO of Qantas International and Freight, had also been in the running to take over the airline. Ms Hudson, a mother-of-two, said it was an 'honour' to step into the esteemed role.'This is an exceptional company full of incredibly talented people and it's very well positioned for the future,' she said.'My focus will be delivering for those we rely on and who rely on us – our customers, our employees, our shareholders and the communities we serve.'",
        "She began her Qantas career in 1994 as an internal audit supervisor.",
        "Mr Joyce, who has held the top job since 2008, had said in February that he planned to stay on until at least the end of this year.He has been credited with helping to turn around the airline's fortunes, including the delivery of soaring profits after it emerged from the devastations of the COVID-19 pandemicHowever, he also attracted controversy over his battles with unions, including over a 2020 decision to outsource the jobs of about 1600 ground crew.The Federal Court found the pandemic-era move was illegal, a decision the airline has appealed to the High Court."
    ]
}