{
    "articleURL": "/tvshowbiz/article-12061179/EDEN-CONFIDENTIAL-Cut-Tom-Hanks-wife-Rita-Wilson-told-filming-ABBA-Voyage.html",
    "content": [
        "He's won six Academy Awards, his films have grossed almost $10 billion [£7.9 billion] around the world and he's been voted America's most trusted person. ",
        "Yet Tom Hanks has discovered that some Britons are no respecters of celebrity.I hear that the star's wife, the actress Rita Wilson, was ticked off at ABBA Voyage at London's O2 for filming the pop show on her mobile phone. Chat show host Alan Carr, who found himself sitting next to the couple, reveals: 'Tom Hanks was going, 'Oh, my God, this is amazing. I love it',' Carr says on his podcast, Life's A Beach.'His wife was filming it on her phone and was told off.' He adds: 'I'm sure she wasn't going to upload it or anything, but she wanted it for her own.'",
        "Jack ties himself up in knots over whether to wed Comedian Jack Whitehall's feeling the pressure to get married — and it's not coming from his girlfriend of four years, the model Roxy Horner, 31.'My mum is relentless,' he says of his mother Hilary's hopes that he will make it to the altar soon.",
        "The 34-year-old comedian's sister, Molly, 33, got married to Toby Wilkinson in 2020, with Princess Eugenie among the wedding guests. And his brother, Barnaby, 31, is due to exchange vows with Tatiana 'Tats' Reatchlous in August.'I'm still very awkward when asked about it,' Whitehall says about marriage. 'I'm unable to give an acceptable answer.",
        "'My brother and sister got in there first. My brother will be married in August and then the pressure will be back on me.'But I still haven't worked out a good answer for it.' 'What a horrible noise': Batt drubs Bryn duetSir Bryn Terfel's duet with Andrea Bocelli at the Coronation Concert struck a discordant note for one of the Royal Family's favourite composers.Mike Batt, who wrote the 1970s classic Bright Eyes and lyrics for Andrew Lloyd Webber's The Phantom Of The Opera, would have preferred Bocelli to have sung You'll Never Walk Alone alone.'Bryn Terfel, what a horrible noise,' Batt says. 'No feeling. Bocelli on his own would have been so much better. Bryn thinks if he sings louder than Bocelli he's won.'Batt, who wrote the track Royal Gold for Queen Elizabeth and Prince Philip's 50th wedding anniversary, tells me: 'A lot of top opera stars can't come to terms with an emotional contemporary song. Bocelli is one of very few who can.'A lot of opera singers go for volume. Sir Bryn's a lovely guy, but when it came on I was just, like, 'Oh, my God'.'You can't just start loud and stay loud. You've got to go somewhere.'Sentamu's place is set in stone ",
        "John Sentamu may have retired as Archbishop of York three years ago, but his presence will linger at York Minster.This grotesque of Sentamu was spotted lying in the cathedral's stone yard last week.And a spokesman tells me the sculpture was commissioned by the Chapter of York to mark the Archbishop's retirement. 'There is a centuries-old tradition of cathedral clergy and other notable people being honoured in this way,' the spokesman says.Aussie comic icon Barry Humphries once memorably gatecrashed the royal box at the Royal Variety Performance, as his alter ego Dame Edna Everage, to the delight of King Charles and Queen Camilla. And I hear that the comedian's widow, Lizzie Spender, accepted a personal invitation from the King to his Coronation after Humphries's death last month at the age of 89.His Majesty is said to have spoken with Humphries on the phone just hours before he died. Olivier Award-winning actress Tracie Bennett has revealed her worst experience in the theatre. 'I fell off the stage in Merrily We Roll Along,' she admits. 'I went to lean back on a table, and it wasn't there — and I ended up in a woman's lap. Luckily, I was playing Mary, who's drunk — so my body was relaxed.'"
    ]
}