{
    "articleURL": "/wires/reuters/article-12038155/Gold-advances-fresh-economic-jitters-Fed-verdict-looms.html",
    "content": [
        "FOMC starts two-day meeting on interest rates",
        "Fed widely seen raising rates by 25 bpsMarkets see no chance of another hike in June(Updates prices)By Deep Kaushik VakilMay 2 (Reuters) - Gold extended gains on Tuesday and was on track for its biggest daily rise in a month, as yields dropped on renewed fears of contagion in the U.S. banking sector, ahead of the Federal Reserve's widely anticipated decision to hike interest rates.Spot gold jumped 1.5% to $2,012.19 per ounce by 2:00 p.m. EDT (1800 GMT) after touching its highest since April 14 at $2,019.37 earlier.U.S. gold futures settled 1.6% higher at $2,023.30.\"The banking concerns are back... it's really removing that risk that the Fed was going to possibly be considering a June rate rise,\" said Edward Moya, senior market analyst at OANDA.Shares of U.S. regional lenders plunged, while Treasury yields fell as the collapse of First Republic Bank triggered investor concerns about the health of other mid-sized lenders.Regulators seized First Republic Bank and sold its assets to JPMorgan Chase &amp;amp; Co on Monday, in a deal to resolve the largest U.S. bank failure since the 2008 financial crisis.The Federal Open Market Committee kicked off its two-day meeting, where it is mostly expected to raise rates by 25 basis points.",
        "Markets priced in about 15% odds of a rate cut in June, seeing no chances of another hike.While gold is considered a hedge against economic uncertainties, rising rates hurt demand for the zero-yielding asset.Gold has also been supported by some safe-haven demand from resurgent worries over the banking sector's health and U.S. debt ceiling uncertainty, Bank of China International analyst Xiao Fu said.U.S. President Joe Biden on Monday summoned four top congressional leaders to the White House next week after Treasury Secretary Janet Yellen warned the government could run short of cash to pay its bills by June.Spot silver rose 1.1% to $25.25 per ounce, platinum gained 1.2% to $1,061.99, while palladium fell 1.5% to $1,429.47. (Reporting by Deep Vakil and Arundhati Sarkar in Bengaluru; Editing by Shinjini Ganguli, Shailesh Kuber and Maju Samuel)"
    ]
}