{
    "articleURL": "/wires/reuters/article-12059933/Giro-d-Italia-Summaries--Stage-3.html",
    "content": [
        "May 8 (Gracenote) - Results from Stage 3, Giro d Italia on Monday. Stage 3 Vasto to Melfi, 213 km. Men's elite road race. Wind direction: N. Wind speed: 2km/h. Route profile: flat. Finish profile: flat. Stage winners 1. Michael Matthews (AUS) Team Jayco - AlUla 5:01:41 2. Mads Pedersen (DEN) Trek - Segafredo \" 3. Kaden Groves (AUS) Alpecin - Deceuninck \" 4. Vincenzo Albanese (ITA) EOLO - Kometa Cycling Team \" 5. Stefano Oldani (ITA) Alpecin - Deceuninck \" 6. Sven Erik Bystrøm (NOR) Intermarché - Circus - \" Wanty 7. Primoz Roglic (SLO) Jumbo - Visma \" 8. Simone Velasco (ITA) Astana - Qazaqstan Team \" 9. Toms Skujins (LAT) Trek - Segafredo \" 10. Andrea Vendrame (ITA) AG2R - Citroën Team \" 11. Patrick Konrad (AUT) BORA - hansgrohe \" 12. Koen Bouwman (NED) Jumbo - Visma \" 13. Samuele Battistella (ITA) Astana - Qazaqstan Team \" 14. Michel Heßmann (GER) Jumbo - Visma \" 15. Remco Evenepoel (BEL) Soudal - Quick-Step \" 16. Aurélien Paret-Peintre AG2R - Citroën Team \" (FRA) 17. Bauke Mollema (NED) Trek - Segafredo \" 18. Aleksandr Vlasov () BORA - hansgrohe \" 19. Nicola Conci (ITA) Alpecin - Deceuninck \" 20. Ilan Van Wilder (BEL) Soudal - Quick-Step \" Overall leaders 1. Remco Evenepoel (BEL) Soudal - Quick-Step 10:18:07 2. João Almeida (POR) UAE Team Emirates +32 3. Primoz Roglic (SLO) Jumbo - Visma +44 4. Stefan Küng (SUI) Groupama - FDJ +46 5. Geraint Thomas (GBR) INEOS Grenadiers +58 6. Aleksandr Vlasov () BORA - hansgrohe \" 7. Tao Geoghegan Hart (GBR) INEOS Grenadiers +1:02 8. Michael Matthews (AUS) Team Jayco - AlUla \" 9. Jay Vine (AUS) UAE Team Emirates +1:08 10. Mads Pedersen (DEN) Trek - Segafredo +1:18 11. Bruno Armirail (FRA) Groupama - FDJ +1:19 12. Mattia Cattaneo (ITA) Soudal - Quick-Step +1:26 13. Lennard Kämna (GER) BORA - hansgrohe \" 14. Nico Denz (GER) BORA - hansgrohe \" 15. Damiano Caruso (ITA) Bahrain Victorious +1:31 16. William Barta (USA) Movistar Team +1:33 17. Ilan Van Wilder (BEL) Soudal - Quick-Step +1:34 18. Andreas Leknessund (NOR) Team DSM +1:40 19. Eddie Dunbar (IRL) Team Jayco - AlUla +1:47 20. Bauke Mollema (NED) Trek - Segafredo +1:49 King of the Mountains 1. Thibaut Pinot (FRA) Groupama - FDJ 12 2. Paul Lapeira (FRA) AG2R - Citroën Team 6 3. Santiago Buitrago (COL) Bahrain Victorious 4 4. Thomas Champion (FRA) Cofidis \" 5. Tao Geoghegan Hart (GBR) INEOS Grenadiers 3 6. João Almeida (POR) UAE Team Emirates 2 7. Laurens De Plus (BEL) INEOS Grenadiers \" 8. Callum Scotson (AUS) Team Jayco - AlUla \" 9. Mattia Bais (ITA) EOLO - Kometa Cycling Team \" 10. Eddie Dunbar (IRL) Team Jayco - AlUla 1 11. Pavel Sivakov (FRA) INEOS Grenadiers \" 12. Marius Mayrhofer (GER) Team DSM \" Points leaders 1. Jonathan Milan (ITA) Bahrain Victorious 53 2. Kaden Groves (AUS) Alpecin - Deceuninck 39 3. Michael Matthews (AUS) Team Jayco - AlUla 38 4. David Dekker (NED) Team Arkéa - Samsic 35 5. Mads Pedersen (DEN) Trek - Segafredo 26 6. Arne Marit (BEL) Intermarché - Circus - 23 Wanty 7. Remco Evenepoel (BEL) Soudal - Quick-Step 15 8. Marius Mayrhofer (GER) Team DSM 14 9. Fernando Gaviria (COL) Movistar Team \" 10. Alexander Konychev (ITA) Corratec - Selle Italia 12 11. Stefano Gandin (ITA) Corratec - Selle Italia \" 12. Pascal Ackermann (GER) UAE Team Emirates \" 13. Filippo Ganna (ITA) INEOS Grenadiers \" 14. João Almeida (POR) UAE Team Emirates 9 15. Primoz Roglic (SLO) Jumbo - Visma \" 16. Vincenzo Albanese (ITA) EOLO - Kometa Cycling Team 8 17. Mattia Bais (ITA) EOLO - Kometa Cycling Team \" 18. Niccolò Bonifazio (ITA) Intermarché - Circus - \" Wanty 19. Veljko Stojnic (SRB) Corratec - Selle Italia \" 20. Tao Geoghegan Hart (GBR) INEOS Grenadiers 7 Sprint classification 1. Stefano Gandin (ITA) Corratec - Selle Italia 20 2. Mattia Bais (ITA) EOLO - Kometa Cycling Team 12 3. Remco Evenepoel (BEL) Soudal - Quick-Step 10 4. Alexander Konychev (ITA) Corratec - Selle Italia \" 5. Primoz Roglic (SLO) Jumbo - Visma 6 6. Veljko Stojnic (SRB) Corratec - Selle Italia \" 7. Thomas Champion (FRA) Cofidis 5 8. Paul Lapeira (FRA) AG2R - Citroën Team \" 9. Mads Pedersen (DEN) Trek - Segafredo 4 10. Koen Bouwman (NED) Jumbo - Visma 3 11. Mattia Cattaneo (ITA) Soudal - Quick-Step 2 12. Arne Marit (BEL) Intermarché - Circus - \" Wanty 13. Michael Matthews (AUS) Team Jayco - AlUla 1 14. Carlos Verona (ESP) Movistar Team \" 15. Fernando Gaviria (COL) Movistar Team \" Team classification 1. UAE Team Emirates (UAE) 30:56:33 2. INEOS Grenadiers (GBR) +13 3. Soudal - Quick-Step (BEL) +32 4. Groupama - FDJ (FRA) +1:32 5. BORA - hansgrohe (GER) +1:38 6. Team Jayco - AlUla (AUS) +1:58 7. Jumbo - Visma (NED) +2:02 8. Bahrain Victorious (BRN) +2:28 9. Trek - Segafredo (USA) +2:40 10. EF Education - EasyPost (USA) +2:56 11. Israel - Premier Tech (ISR) +4:01 12. Alpecin - Deceuninck (BEL) +5:04 13. Team DSM (NED) +6:02 14. Intermarché - Circus - Wanty (BEL) +6:14 15. AG2R - Citroën Team (FRA) +6:44 16. Astana - Qazaqstan Team (KAZ) +7:15 17. EOLO - Kometa Cycling Team (ITA) +7:25 18. Team Arkéa - Samsic (FRA) +7:44 19. Green Project - Bardiani - CSF - Faizanè (ITA) +12:15 20. Movistar Team (ESP) +13:16 21. Cofidis (FRA) +19:01 22. Corratec - Selle Italia (ITA) +47:44 Youth classification 1. Remco Evenepoel (BEL) Soudal - Quick-Step 10:18:07 2. João Almeida (POR) UAE Team Emirates +32 3. Ilan Van Wilder (BEL) Soudal - Quick-Step +1:34 4. Andreas Leknessund (NOR) Team DSM +1:40 5. Stefano Oldani (ITA) Alpecin - Deceuninck +1:59 6. Michel Heßmann (GER) Jumbo - Visma \" 7. Thymen Arensman (NED) INEOS Grenadiers +2:05 8. Ben Healy (IRL) EF Education - EasyPost +2:07 9. Marco Frigo (ITA) Israel - Premier Tech +2:15 10. Santiago Buitrago (COL) Bahrain Victorious +2:24 11. Jefferson Alexander Cepeda EF Education - EasyPost +2:36 (ECU) 12. Alessandro Verre (ITA) Team Arkéa - Samsic +2:39 13. Samuele Battistella (ITA) Astana - Qazaqstan Team +2:56 14. Einer Rubio (COL) Movistar Team +3:07 15. Kaden Groves (AUS) Alpecin - Deceuninck +3:10 16. Matthew Riccitello (USA) Israel - Premier Tech +3:19 17. Lars van den Berg (NED) Groupama - FDJ +3:38 18. Laurens Huys (BEL) Intermarché - Circus - +3:47 Wanty 19. Filippo Zana (ITA) Team Jayco - AlUla +3:55 20. Vadim Pronskiy (KAZ) Astana - Qazaqstan Team +5:29"
    ]
}