{
    "articleURL": "/tvshowbiz/article-12060897/Im-Celebs-Janice-Dickinson-SLAMS-captain-Joe-Swash-following-green-teams-epic-losing-streak.html",
    "content": [
        "I'm A Celeb South Africa saw tensions in camp on Monday after the green team continued their epic losing streak. ",
        "After the yellow triumphed again in the latest trail, sending home Georgia Toffolo, 28, and Andy Whyment, 42, losing Janice Dickinson laid the blame in one place. The foul-mouthed Supermodel, 68, her blasted captain Joe Swash, 41, after he playfully described their losing team as 'S***'. She yelled: 'You really are a shit coach! how can you be like this?'Leading to tempers flaring, Joe replied 'I am allowed to be disappointed!' before going on to say: 'You know it's just my sense of humour'.",
        "Unimpressed Janice snapped back: 'I don't know you'. Taking to Twitter one fan wrote: '[Janice] shouldn’t even still be in it tbh, she doesn’t want to do none of the trials! Love Joe Swash even more now!! he should of proper shut her up!'.While another wrote: ' No way is Janice coming at Joe Swash , does she know this is broadcasted to the UK?!?'.Earlier in the episode Andy and Georgia Toffolo were eliminated after losing out to Jordan Banjo and Myleene Klass. The group went head-to-head in the gold mine trial, with the winners earning a luxury picnic, while the losing pair were sent home. As she left Toff said: 'It's been glorious! It has just been amazing. Doing it twice has been really immense.'Andy added: 'Thanks for having me back!', before the pair boarded their boats back to civilisation. ",
        "Viewers were sad to see the pair both leave as they complained that two entertaining and strong contestants were going home. One said: 'WHY YOU ANDY AND TOFF!', while another said: 'I’m sorry but why are all the best ones going home first Shaun and now Toff.'Another said: 'Not Toff and Andy going', while a fourth said: 'Kinda don’t wanna carry on watching Toff was my fave.'A fifth said: 'toff was carrying the show can’t wait for absolutely dead content now.' ",
        "Viewers kicked off on Friday night as the show ended on a dramatic cliffhanger ahead of the double elimination.Fans were far from impressed with the 'cruel' twist as they took to Twitter to vent their fury, with one even asking: 'What are you playing at?!''Making us wait till Monday?!' fumed one person, while another questioned: 'What you mean NEXT TIME ???!' ",
        "'Literally ending it on a cliffhanger like that and we won't even find out until Monday. Nah. Livid' ranted a third.'Leaving it there and making us wait till monday..cruel' fumed a fourth person.Another angry viewer asked: 'WHAT ARE YOU PLAYING AT?!'With an additional person adding: 'Tell us what's happening as cannot wait until Monday as it will do my head in.'",
        "The four had to take part in the Gold Rush trial, in which they had to find gold nuggets buried inside identical mine shafts. ",
        "The object of the game was to find the nuggets and place them on scales at entrance to the mine, with each team having to find enough nuggets to tip the scales and win a picnic for their team - with the losers going home. It was a closely fought race, with Georgia and Andy initially taking the lead while Myleene struggled to find any nuggets as Jordan ploughed ahead.But things evened up when Myleene began to find her nuggets, with the competition seriously heating up as the stars desperately fought to come out on top.I'm A Celebrity... South Africa continues on ITV1 and ITVX at 9pm on Tuesday. "
    ]
}