{
    "articleURL": "/wires/ap/article-12043069/Patrick-Mahomes-brother-charged-sexual-battery.html",
    "content": [
        "OVERLAND PARK, Kan. (AP) - Jackson Mahomes, the brother of Kansas City Chiefs quarterback Patrick Mahomes, was briefly jailed Wednesday on aggravated sexual battery charges over an alleged altercation at a Kansas restaurant in late February.",
        "Jackson Mahomes, 22, was charged Tuesday in Johnson County, Kansas, with three counts of aggravated sexual battery and one count of battery. He was released later Wednesday after posting $100,000 bond. During a brief virtual court appearance, the judge scheduled the next online hearing for May 11.Under conditions of his bond, Jackson Mahomes won't be allowed to discuss his case publicly.The probable cause affidavit in the case was not immediately available. But The Kansas City Star reported that police previously confirmed they were investigating a Feb. 25 incident involving Jackson Mahomes at a restaurant in the Kansas City suburb of Overland Park, Kansas.Jackson Mahomes´ attorney, Brandan Joseph Davies, said in a statement that the court prohibited him and his client from commenting. But he released a statement in March, when the allegations first surfaced, saying there was \"substantial evidence refuting the claims of Jackson´s accuser,\" The Star reported.Aspen Vaughn, the owner of Aspens Restaurant and Lounge, told the newspaper in early March that Jackson Mahomes was friends with her stepdaughter and had frequented the restaurant, where her stepdaughter works. She said he had been there earlier on the day of their encounter and had been pleasant.",
        "Vaughn said after he returned to Aspens that night, Jackson Mahomes grabbed her neck with enough force that it left a faint bruise while they were talking in her office about an incident in which he allegedly shoved a member of the wait staff.",
        "She provided The Star with a photo of a bruise on her neck and a video that she said showed Jackson Mahomes grabbing her by the throat and kissing her at least twice.\"He forcibly kissed me out of nowhere,\" she said, calling the advances unwelcome and shocking and noting that she thought he was intoxicated.Aspen Vaughn didn´t immediately reply to a Facebook message, and the restaurant didn't immediately respond to a phone message seeking comment about the charges.The Chiefs declined to comment, saying it was a personal matter involving the relative of a player but not a member of the organization. Patrick Mahomes doesn't have a spokesperson and he hasn't commented about the matter on Twitter.___Hollingsworth reported from Mission, Kansas. Jim Salter in O'Fallon, Missouri, contributed to this report."
    ]
}