{
    "articleURL": "/wires/aap/article-12053839/Firebirds-mow-Magpies-Super-Netball-battle.html",
    "content": [
        "The Queensland Firebirds have breathed life into their Super Netball campaign with a gritty 73-67 win against Collingwood at Nissan Arena.",
        "Without injured midcourt star Macy Gardner (fractured wrist), several Firebirds stepped up on Saturday, especially during the match-clinching 19-12 third quarter which effectively sealed the Magpies' fourth successive defeat.Lara Dunkley was magnificent at wing attack, Donnell Wallam and Emily Moore potent in the circle and 2016 championship winner Hueta Veve, plucked from obscurity as an injury replacement for Gardner, impressed in the second half when injected into the centre.\"We're really happy to get the win,\" Moore said.\"We knew we had to play a full 60 minutes against a side like the Magpies.\"It's always unfortunate circumstances when someone (Gardner) goes down with an injury.\"In those circumstances somebody gets an opportunity to step up and Hueta did that today.\"Wallam led the early assault for the Firebirds who skipped ahead 6-1 and was unstoppable after halftime as the home side wrestled control of the contest.Collingwood awoke from their early slumber, responding with a 5-0 burst and drawing level 15-15 at quarter time.Shimona Nelson buried all 18 of her shot attempts in a high-octane, goal-for-goal second stanza as the Pies looked to be slowly gaining the upper hand.Sophie Garbin's super shot in the dying moments of the half was followed by Nelson's goal on the buzzer to give Collingwood a 37-35 lead.",
        "Wallam went one better than Nelson, nailing 19 goals without a miss in the third, working in perfect unison with Moore, who had 12 assists from 12 feeds as the Firebirds got the match on their terms, pulling away 63-57 at three-quarter time.Wallam continued to dominate with another 18 goals without a blemish in the fourth as Queensland's surprise packet Veve got to work in the middle and Collingwood, who racked up penalties and turnovers at the wrong moments, ultimately had no answers."
    ]
}