{
    "articleURL": "/news/article-12047129/Arizona-esthetician-29-murdered-hiking-trail-close-lived.html",
    "content": [
        "Lauren Heike, 29, was hiking on the popular Reach 11 trail near her apartment on Friday morning when she was attacked sometime between 10 and 11amHer body was found the next day because police said she was in an area that isn't necessarily visible from the trail. Police have not yet said how she was killedSurveillance video of a person of interest in her murder was released TuesdayDistraught family and friends of the Arizona woman who was 'viciously' attacked from behind while she was hiking are pleading with the public to help track down the person who killed her. ",
        "Lauren Heike, 29, an esthetician who had recently moved to the Phoenix area from Washington, was believed to be alone Friday morning on the Reach 11 trail not far from her home when she murdered by the unknown assailant between 10 and 11am.'Please think if you had seen something, were in that area, if you know of somebody strange or acting weird,' her mother Lana Heike tearfully pleaded with the public on Wednesday. 'Somebody knows this person.' Earlier this week, Phoenix police released a short but chilling clip that shows a shadowy figure sprinting on the trail in the area where Heike's body was found. They have identified him as the suspect in her murder. Heike's body was discovered nearly 24 hours after she was killed, in area that isn't necessarily visible from the trail. Police added that Heike had 'trauma to her body' from the attack. They have not yet shared how she was murdered, but called the killer's behavior 'heinous.'Scroll for video ",
        "The suspect is described as thin man with a dark complexion, 5′8″ to 6′ tall, who was wearing a gray or lighter-colored shirt, dark pants, a dark backpack, and shoes, police said in an update on Wednesday.'Somebody wearing a backpack or a hoodie or whatever the video, it's hard to tell, in a sunny hot day that person will stand out. ",
        "'When you've done something, you're going to be unusual,' Lana said.Heike's father Jeff Heike added: 'She was my little girl. I'm really going to miss her,' her father, Jeff, said. 'I know someone knows something and they can help us.' Phoenix police responded to what was described as a 'desert area' near 6500 East Libby Street on April 29 after receiving a report of an injured person. The area is not far from Heike's apartment, which is located in an upscale area of North Phoenix with houses on the market for up to $1.3 million, according to Zillow. Heike's mother gave some insight into what her daughter's last day was like.'She got up, talked to her friends. It was her day off, she got her coffee, and she went walking and she was happy, happy… that helps us a lot,' Lana said. 'We need people's help to tell us what happened after that.'",
        "Phoenix Homicide Lt. James Hester said in a press conference on Wednesday said investigators believe someone might have seen the suspect before or after the attack and asked the community to come together to help find him.'We believe someone would have noticed this person either before the attack or after he fled from our scene,' Lt. Hester added.",
        "Further details about the murder, including how Heike was killed or if a weapon was used, have not been released as police don't want to harm the investigation.  'The behavior, in my opinion, was so heinous that I would imagine that the subject would be displaying symptoms that look out of place,' Lt. Hester added.Loved ones said Wednesday that they just want justice for Heike, who they described as a 'beautiful' person inside and out who loved exercising and being outdoors.Her mother described her daughter as a beautiful, kindhearted woman who was sweet to everyone she met.'As hard as this is for us, we're grateful because we had such a beautiful child,' she said. 'We will love her every minute that we are on this Earth.' ",
        "Police have not said whether this was a random attack or if it was potentially someone Heike knew.But the Arizona woman, who had moved there from Washington, was described as a kindhearted person who left a lasting impression with everyone she met. Heike's close friend River Hubbell told AZCentral that he spoke to her on Friday morning before her hike and they asked each other what they were thankful for - something he said they did every morning. 'I had asked what we were all thankful for that day and she had specifically just said that she was so thankful to just wake up another day so positive and to be able to go get a coffee and go on a walk,' Hubbell said, as he held back tears.",
        "Heike's boss, Brian Thorne of Troon North Golf Club, where she worked as a server, told local news outlets that their staff is shocked and saddened by her death. He described Heike as a lovely person and said this tragedy has been tough on everyone. Heike had previously worked as an esthetician for Admire Medical Aesthetics in Washington. The company posted a heartfelt tribute on their Facebook page. 'It is with a heavy heart that we learned of the passing of Lauren Heike, a former esthetician for Admire Medical Aesthetics. Lauren touched the hearts of many with her kind and sweet nature, and her beloved clients always looked forward to seeing her.'We will always remember the laughter and smiles that Lauren brought to each of us. Her warmth and compassion made her not just a great esthetician, but a wonderful human being. It is a true loss to everyone that she has touched.''Our condolences go out to Lauren's family during this difficult time. We hope that they find some comfort in the knowledge that Lauren's memory will always be cherished by those whose lives she touched.'",
        "Neighbors in the area and hikers who frequent the trail say they're now looking over their shoulders.'I just woke up to all the police coming in, and they could actually see all the vehicles in the back, driving around, all the police. I would say the neighborhood is just a little bit somber right now. They're probably a little sketched out, looking over their shoulder. Definitely not something that they saw coming,' one neighbor said.",
        "'It's heartbreaking,' hiker Tom Chamberlain told Fox13 Seattle.'I would not be comfortable if she were hiking alone on this trail now. Before, I thought it was North Scottsdale. It's totally fine.' Some have suggested that warning signs should be posted around the community.'It would be nice. I'm lucky we do this together. If I were to come out here in the morning for a run, it would change my opinion completely about doing this,' Naomi Kight said. ",
        "Police have offered advice for hikers and said the safety of the community is their top priority. 'The safety of our community is our top priority. We would like to remind everyone to be aware of your surroundings. If a hike or walk is in your plans, do so with a partner. If you see something suspicious call police and be a good witness,' police cautioned.Anyone with information is asked to call Phoenix police. To remain anonymous, you can call Silent Witness at 480-WITNESS (480-948-6377) or 480-TESTIGO (480-837-8446). You can also leave a tip at silentwitness.org. A reward of up to $2,000 is offered for any information related to the case."
    ]
}