{
    "articleURL": "/wires/pa/article-12053699/Everton-showed-character-needed-avoid-drop-Leicester-draw--Idrissa-Gueye.html",
    "content": [
        "Idrissa Gueye believes Everton showed the character they will need to avoid relegation in Monday’s Premier League draw at Leicester.",
        "In a match that some had billed as “loser goes down”, Everton took an early lead but then fell 2-1 down and needed Jordan Pickford to save a James Maddison penalty before Alex Iwobi’s equaliser earned a point.Manager Sean Dyche has been keen to talk up the performance after Everton had 23 shots at goal, their most in a Premier League match for three-and-a-half years, and Gueye said it was something to build on ahead of Monday’s trip to Brighton at a time when confidence has been fragile.“I think confidence is an important factor during this period of the season and it’s something we can continue to cultivate and work on,” he said on the club website. “Because we’re going to need plenty of confidence for the remaining games.“Looking back at the season, particularly away from home, there aren’t too many examples where we’ve gone behind in the scoreline and managed to come back to earn a result. You need character to do that and I think we showed a lot of that against Leicester.“We know it’s not easy, but we need to show that fight and that belief in ourselves. Confidence does breed better results.”",
        "Last week Dyche voiced concern that nerves and tension were inhibiting some of his players as they fight to save their Premier League status.",
        "Gueye said all players are used to performing under pressure, but it is clearly different at the bottom of the table.“It would be much more pleasant if we were further up the table and challenging for trophies at the end of the season,” he said. “As players, we love to challenge ourselves and put ourselves under pressure.“It is a great source of motivation, but it would be preferable to be higher up the league. Being footballers, we’ve become used to having to play under pressure and that’s something we’re going to have to deal with again.”Everton have averaged a point per game since Dyche arrived at the start of February, but are now winless in their last seven matches.But the former Burnley boss has been here before, and Gueye said he knew exactly how to handle the situation.“He’s a really cool guy. He’s a cool manager,” he said. “I think one of the reasons he was brought in was because he knows how to manage these situations. He’s been in similar situations before and I think that’s why the club decided to bring him in.“The smile he has and the confidence he has have managed to bring a renewed energy to the club. Not only is he instilling this joie de vivre, but he’s also giving us an intensity to go right to the end.",
        "“We have to fight until the end. There’s time for looking at the table at the end of the season, but not currently. The training sessions have been great and they’re filling us with hope and energy ahead of each game.“His mantra is, ‘the minimum requirement is maximum effort’, and that’s at all times. We must give it our all for the rest of the season.”"
    ]
}