{
    "articleURL": "/wires/reuters/article-12041115/Turkish-inflation-slows-44-ahead-landmark-election.html",
    "content": [
        "By Ali Kucukgocmen and Nevzat Devranoglu",
        "ISTANBUL, May 3 (Reuters) - Turkish annual inflation slowed to 43.68% in April, official data showed on Wednesday, easing ahead of elections that polls show President Tayyip Erdogan risks losing largely due to a cost-of-living crisis.Unorthodox rate cuts sought by Erdogan sparked a currency crisis in late 2021, sending inflation to a 24-year peak of 85.51% last year. It fell in December and touched 50.51% by March with a favourable base effect and relatively stable lira.The consumer price index (CPI) rose 2.39% in April from a month earlier, the Turkish Statistical Institute said. The official numbers were slightly less than predicted, with a median monthly estimate of 2.60% and an annual forecast of 44% in the latest Reuters poll.The cost of living crisis has eaten away at household savings and also at Erdogan's popularity ahead of the presidential and parliamentary votes on May 14, seen as the president's biggest test in his 20-year reign.Some polls show Erdogan trailing his main opponent Kemal Kilicdaroglu.The base effect that helped lower the annual reading so far this year is expected to wear off in coming months and economists say inflation could rise again. The year-end median estimate was 46.5% in the Reuters poll.Haluk Burumcekci, of Burumcekci Consulting, predicted that annual inflation could decline until June due to the base effects.",
        "\"Annual CPI could decrease to at most around 40% levels in the first half of the year and end up in the range of 50-55% for the year,\" he wrote in a note.Burumcekci also said \"there is uncertainty regarding the balance point of exchange rates and interest rates for the second half of the year due to the elections.\"Some economists expect a return to orthodox monetary policy after the election no matter the outcome but Erdogan has recently said interest rates will continue to decline as long as he is in power.Annually, the biggest increase was seen in the health sector with 66.62%, followed by restaurants and hotels with 66.41% and food and non-alcoholic beverages with 53.92%.On a monthly basis, communication prices rose 5.93%, restaurant and hotel prices rose 4.24% and food and non-alcoholic beverage prices rose 3.95%The domestic producer price index was up 0.81% month-on-month in April for an annual rise of 52.11%, the data showed.(Reporting by Ali Kucukgocmen; Editing by Gareth Jones, Jonathan Spicer, Alexandra Hudson)"
    ]
}