{
    "articleURL": "/femail/article-12047507/Very-quiet-weekend-happening-Prince-William-jokes-ahead-Coronation.html",
    "content": [
        "The Prince and Princess of Wales visited a pub in London's Soho on Thursday Read more:  For all the latest Royal news, pictures and video click herePrince William was in fine form today as he and Kate joked and chatted with the public during a visit to Soho today.",
        "The Prince and Princess of Wales travelled on the Elizabeth Line to a rendezvous at the Dog and Duck pub where they pulled pints and spoke with staff. And afterwards the first-in-line to the throne left the crowd smiling after joking about the couple's plans for the Coronation of his father, King Charles III, this weekend.When asked by a member of the public if he had anything planned in the  coming days, the Prince of Wales quipped: 'No, a very quiet weekend, nothing happening at all.'Earlier in the day Kate admitted the family were still getting 'all of the ducks' in a row before the big day, although they had already noticed a 'wonderful' atmosphere and that excitement was 'already starting to build'.",
        "The event will feature the Coronation ceremony on Saturday at Westminster Abbey, followed by a concert at Windsor Castle on Sunday.The Princess also revealed her three children were deeply immersed in the preparations, saying: 'The children are having their Coronation celebration at school today.'She added that their eldest child, Prince George, is 'excited' about the event and has been taking part in rehearsals as a page of honour at the Westminster Abbey service.And the royal added that their eldest child Prince George was 'excited' about the upcoming celebrations and had been taking part in rehearsals.",
        "She explained that George was a page of honour during the service at Westminster Abbey and, asked if he was looking forward to it, she replied: 'He is actually. Having done a few rehearsals, I think everyone is a bit more relaxed.'Outside the pub they met with cheering crowds of royal fans, who greeted them with shouts of 'We love you!' before the couple posed for selfies with the crowd.William appeared relaxed, telling one  group who were discussing the newly opened Shambles Bar in Windsor: 'I love a cocktail! Best not to do it before the Coronation but maybe afterwards!'Earlier in the day the Prince and Princess of Wales made their way into central London on the aptly-named Elizabeth Line - a far cry from the horse and carriage they will be in on Saturday.The pair hopped on at Acton Main Line station and travelled to Tottenham Court Road, the nearest stop to Soho, before making their way to the Dog and Duck. ",
        "The pub was originally built in 1734 on the Duke of Monmouth's home, but the current site was built in 1897 by the architect Francis Cannon.William and Kate are not the only famous faces to have stepped through the pub's historic doors. Novelist George Orwell celebrated with a glass of absinthe when his book, Animal Farm, was selected for the American Book of the Month Club.The pub has hosted well-known individuals throughout the ages - from historical figures such as painter John Constable, who lived nearby, and poet Dante Gabriel Rossetti to popstars of our day and age, such as Madonna, who popped in for a pint.The pub sits on the corner of Bateman Street and Firth Street, which are both rooted in royal connections.Bateman street was originally called Queen Street, but it was renamed after Viscount Bateman who owned the Monmouth estate.Frith Street was one of the original residential streets to be mapped out in Soho. The area was once a hunting ground for Henry VIII.",
        "The couple boarded the train at Acton Main Line station, to the astonishment of some members of the public, who watched them through the ticket barriers and walk along the platform. It wasn't the first time on the tube for either of the royals. In fact the Mail understands that the princess travelled incognito on it just this year. The prince and princess wanted to meet and thank Transport for London (TFL) workers who will be working throughout the coronation weekend.After being handed their Oyster cards by an aide and welcomed to Acton station by Andy Lord, TFL's commissioner, the couple met with Carinne Spinola, a train driver and Cameron Finch, a customer service assistant, and talked about their career aspirations.Once on board the train, they sat with a group of TFL workers, including David Pearce, a fleet manager, Liam Grindley, a service and infrastructure manager and Maria Serco, a maintenance engineer.Speaking about her conversation with Miss Spinola, Kate told the group: 'It's nice to meet a female train driver, obviously a profession women are keen on getting into.'She said the job was advertised on Mumsnet.'It was the couple's first trip on the Elizabeth Line, which the late Queen Elizabeth opened almost a year ago on May 17, 2022.",
        "Royal aides said the couple do 'occasionally' travel by tube in a private capacity.'What's the feedback you've been getting since it opened?' William asked.'Everyone loves it,' Mr Grindley told him, explaining how it had made many journeys across London shorter and easier.",
        "'And how green are we now,' asked William, laughing. 'You know I've got to ask that question!'William heard how the line's trains are electric, and how much of the earth that was dug up to build the line, was moved and re-used for a nature reserve. 'It's good, it clearly gets thought about now,' he said.Speaking to Miss Serco about the opening of the line last year, William said: 'I can't quite believe it has been nearly a year. It's quite nice to get the chance to see it all, after my grandmother opened it.'Asking the group which of them would be working this weekend, Kate asked: 'Do you think there's going to be extra pressure on the service during the coronation weekend? How do you manage that?'One of the group then asked how the royal family's preparations were going, and Kate replied: 'Yes, it's going to be a very busy time. We're getting there. I still feel like we're trying to get ducks in a row.'",
        "After the short journey from Acton, via Paddington to Tottenham Court Road, the couple were presented with gifts by Mr Lord – a plaque tile of a TFL Roundel, or 'Crowndle' as Mr Lord described it, inscribed with 'King Charles III,' and a TFL roundel lightbox for Prince George, Princess Charlotte and Prince Louis.Dozens of stunned onlookers then rushed towards the escalator with their phones, to film the couple as they made their way up the escalator.Speaking after the couple had left the station, Mr Lord said: 'It was amazing to welcome them on their first visit on the Elizabeth Line. It's coming up to the anniversary of the Queen opening it, and they were very impressed with it.'Miss Serco said of William: 'He was very interested in the technology, how we put the concrete in, the apprenticeships and training we offer. And I told him how much interest we've had from other countries around the world. It was really nice to thank them for all the royal family's endorsement of the Elizabeth Line. We always knew we had their support. We feel the link to the royal family.'Kensington Palace also invited tube and train enthusiast, Francis Bourgeois, whose real name is Luke, to ride on the train with William and Kate as an observer.",
        "He has more than a million followers on Instagram, and royal aides said it was hoped he might bring the experience to a 'younger audience'.William and Kate then walked through the streets of London to the Dog &amp; Duck Pub to hear how it's preparing for the coronation weekend from members of staff and to meet representatives from other hospitality and recreation businesses in the area.He and Kate talked to managers from local businesses expecting a boom in trade this weekend with extended opening hours for pubs and bars, music and other events. Among them were representatives from nearby Ronnie Scott's jazz club, the Prince Edward Theatre, Bar Italia, and the Randall and Aubin restaurant. 'I find you get the best conversations in pubs,' William said. 'People are more relaxed. Restaurants you don't get it. You get it with the food but not the conversation.'At one point he appeared to be talking about going out for a night out with former England footballer Wayne Rooney but he soon realised he was in danger of relaxing too much with the media in tow and said he would have to remember to keep his work head on. 'A couple of vodkas and we'll be all right,' he joked.The couple were served pints of cider - and Kate took a sip.",
        "They were then accompanied by pub managers Chris Watts and Maria Sojkova behind the bar, where William poured a 'perfect pint', according to waitress Bernie Kidson.It was the first pint of Kingmaker, a pale ale brewed to celebrate the coronation, ever poured.'Expertly done,' Mr Watts said, flatteringly. 'Not really,' William replied, pulling the pump repeatedly. 'I've not got too much experience or pulling pints. I'm not too bad at drinking pints but pulling pints…'Bernie Kidson, the shift supervisor behind the bar, professed to be impressed. 'Perfect,' she said.Chris Watts, area manager for Nicholson's, the pub chain that owns the Dog and Duck, said: 'We are going to be making use of the extended hours, some of our pubs will have special music events on.'Nicholson's is also marking its 150th anniversary. 'It's going to be a weekend of celebrations,' Mr Watts said.The royal couple then left the Grade II listed building where they were met by hundreds of fans who lined the streets with calls of 'we love you'.People in the crowd travelled from as far as Australia, China, Canada and Texas to meet the royals ahead of the coronation on Saturday.The princess was handed bunches of flowers, as was William, with one woman from Philadelphia saying: 'I brought these for Kate but you can have them.'Kate meanwhile said their eldest child Prince George was 'excited' about the upcoming coronation and had been taking part in rehearsals.She explained that George was a page of honour during the service at Westminster Abbey and, asked if he was excited, she replied: 'He is actually. Having done a few rehearsals, I think everyone is a bit more relaxed.' She said the atmosphere in the area was 'wonderful' and that excitement for the coronation was 'already starting to build'.They spent around 20 minutes on a walkabout meeting well-wishers and posing for selfies with them, many of them foreign tourists over here for the Coronation.",
        "William told some of the tourists about the family's involvement in Coronation rehearsals. 'We're enjoying the practice. It's keeping us busy,' he said. 'Fingers crossed for the weather.'They met the occasional Brit but most introduced themselves with the country they were from. 'We've got a very international crowd here,' William said. 'Enjoy the weekend.'Kate was elegant as she recycled her bespoke Eponine coat for the outing, which she paired with her white midi dress from Suzannah. The mother-of-three stepped out in a bespoke vibrant coat from Eponine, which is price on application only. The London boutique is a favourite of the mother-of-three's, who previously wore a £1,650 coat and a top and skirt costing £1,200 from the brand in 2016.The Princess appeared animated as she arrived today, cutting a striking figure in a vibrant coat from London boutique Eponine.The piece, which is from their Autumn/Winter 2018 collection, features a mandarin collar and pretty button detailing.The thrifty royal wore the coat to visit the National Portrait Gallery last year to meet photographers featured in her Hold Still book as it topped the bestseller list on its first day. Meanwhile she paired the bright coat with her white midi length tea dress by Suzannah.The Princess wore her long brunette locks down for the occasion, sweeping them behind her ear to reveal her Maria Black earrings.",
        "Meanwhile she kept her makeup muted for the outing, pairing a sweep of eyeliner with a nude lipstick.Yesterday, Prince William and Kate led the Royal Family in rehearsals for the Coronation at Westminster Abbey.With just days to go until the historic event, the King was pictured beaming outside the church in central London as he arrived with the Prince and Princess of Wales and their children Prince George, nine, Charlotte, eight, and Louis, five. Princess Anne and Queen Consort Camilla were there to greet the Dean of Westminster and other church officials before they went inside. The royals were also joined by Prime Minister Rishi Sunak.It comes after thousands of personnel from the Army, Royal Navy and Royal Air Force marched from Buckingham Palace to the Abbey in the early hours of this morning as they practiced for the big day on Saturday, May 6.The Diamond Jubilee State Coach and Gold State Coach were also used in the full-scale rehearsal shortly after midnight.Royal fans waited for more than three hours for the parade to make a return journey down the Mall. And commuters heading home from London Waterloo were treated to extraordinary scenes as they saw some 6,000 soldiers march through the station on their way to the rehearsals.After the rehearsals, King Charles gave a wave to throngs of fans as he travelled back to Buckingham Palace.",
        "Around 25 tents have been set up along the Mall by fans who are camping out for the Coronation. Among the first to take up position was careworker Lucy Edwards, 51, from Bristol, who will be joined by her 74-year-old mother Linda and teenage son Jacob tomorrow.She said: 'It has been very, very cold and the ground here is very hard to sleep on.'I have witnessed most of Charles's life, his marriage, his divorce, and when he got married again. Now I'm here for the Coronation.'All of these events that made him the man that he is and he appears happy in his life. He is going to be a great King and bring the country together.'Mother of five Sharon McEwan, 62, from Kilburn, said: 'Hail King Charles. He is going to make the nation wonderful throughout his reign.'I am a regular at royal events and enjoy meeting the same people who love the royal family and meeting new people from all over the world. This will be a fantastic day.'Faith Nicholson, 61, from Althorne, Essex, was draped in Union Jack colours and carried a Paddington Bear in honour of the Queen's sketch with the character at her Platinum Jubilee last year. She said: 'There is so much to celebrate about our Royal Family. They are loved the world over, and we will see that over the next few days.'They are the best advert for our country. You cannot fail to love them. And Charles will make a magnificent King with his sense of fair play, and he has been a pioneer in so many ways over things like environmental concerns.'I have been to all the major Royal occasions and they have provided such positive memories for me as Saturday will do too.'It is such an incredible thing to be among many thousands of people who have the same love for the Royal family. I can't wait for Saturday. But I'll be here until then. '"
    ]
}