{
    "articleURL": "/sport/football/article-12058927/Aston-Villa-plotting-stunning-swoop-Dusan-Vlahovic-Ferran-Torres-summer.html",
    "content": [
        "Villa are reportedly plotting moves for Vlahovic and Torres this summerEx-Barcelona director Alemany is in talks to join the club as sporting directorAston Villa are reportedly plotting moves for Juventus and Barcelona forwards Dusan Vlahovic and Ferran Torres this summer.",
        "Unai Emery has revolutionised the side since his arrival earlier in the season, guiding them from relegation candidates to European hopefuls and will now look to add to his squad to get them competing for a top six finish next season.As revealed by The Telegraph, Villa are considering an ambitious move to bring both Vlahovic and Torres to the club this summer. The report continues to state that it is unclear whether either player would be open to a move, but Villa are making the duo targets for this summer.",
        "It comes after the Villans entered talks to hire ex-Barcelona director Mateu Alemany, with the Spaniard set for a big first summer transfer window if he joins.Vlahovic has scored 13 goals in 38 matches for Juventus this season, with 10 coming in 25 Serie A games for the 23-year-old.Torres, on the other hand, has only scored seven times in 41 games and could find himself on the way out of Barcelona.The La Liga giants are in desperate need of funds this summer and will need to rake in £178m in order to comply with Financial Fair Play rules - meaning several stars could be departing the Nou Camp.Raphinha has been linked with a return to the Premier League as Newcastle United are believed to have opened talks over a move for the Brazilian.",
        "With Lionel Messi reportedly a target for a sensational Barcelona return, Torres could also depart and Aston Villa appear a likely destination for the former Manchester City forward. Vlahovic has been linked with a move to the Premier League in the past but opted to join Juventus from Fiorentina, despite Arsenal's interest.It is also believed that Villa could move for the Gunners' defender Kieran Tierney, who finds himself behind Oleksandr Zinchenko in the pecking order at the Emirates.A move for the Scotland international would see Emery re-united with the player he brought to Arsenal from Celtic in 2019. "
    ]
}