{
    "articleURL": "/wires/reuters/article-12038089/US-regional-bank-stocks-fall-second-day-First-Republic-failure-weighs.html",
    "content": [
        "May 2 (Reuters) - Shares of major U.S. regional banks fell further on Tuesday in the aftermath of the collapse of First Republic Bank, the largest U.S. bank failure since the 2008 financial crisis.",
        "Investors are still concerned that the crisis started by the closure of Silicon Valley Bank and Signature Bank in March could engulf other mid-sized lenders.However, analysts have said JPMorgan Chase &amp;amp; Co's acquisition of a majority of First Republic's assets has extinguished risks of a contagion.Shares of PacWest Bancorp tumbled nearly 30%, while Western Alliance Bank and KeyCorp fell 21% and 10%, respectively.The KBW Regional Banking Index was down 5.2%, hitting its lowest since December 2020.\"If a 'confidence crisis' can happen to First Republic, it can happen to any bank in this country,\" said Jake Dollarhide, chief executive officer of Longbow Asset Management.\"This is potentially a big deal, which hopefully won't materialize to anything significant.\"Some investors are also concerned about the long-term impact of the JPMorgan deal, which risks worsening the \"too-big-to-fail\" problem regulators have been trying to solve for years.\"While we think this deal underscores all of JPM's key strengths, we can't help but try to read into what it means if our biggest bank is the government's first line of defense,\" analysts at Evercore ISI wrote in a note.Meanwhile, shares of SL Green Realty Corp and Boston Properties Inc, both major commercial real estate investment trusts (REITs), were down 6% and 4%, respectively.",
        "Banks have warned of a slowdown in the commercial real estate industry amid uncertain demand for office space due to a surge in remote-working since the COVID-19 pandemic.Wall Street's main indexes fell on Tuesday after Treasury Secretary Janet Yellen said the U.S. government could run out of money within a month. (Reporting by Niket Nishant and Jaiveer Singh Shekhawat in Bengaluru; Editing by Subhranshu Sahu)"
    ]
}