{
    "articleURL": "/wires/reuters/article-12051091/How-countries-legislated-mass-shootings.html",
    "content": [
        "May 5 (Reuters) - Serbian President Aleksandar Vucic has proposed new gun control measures after two mass shootings in which 17 people were killed, including at least eight children.",
        "Here are some details on how Serbia and other countries have responded to such mass shootings.SERBIAVucic proposed a moratorium on gun permits regardless of weapon type and more frequent medical and psychological checks on gun owners. He also said Serbia would hire 1,200 new police officers to improve security in schools.Serbia has an entrenched gun culture, especially in rural areas, but its gun control laws were fairly strict even before the latest shootings. Automatic weapons are illegal and the authorities previously offered amnesties for surrendering them.UNITED STATESMass shootings have become commonplace in the United States, where repeated attempts to tighten gun laws have run into strong opposition in the U.S. Congress, especially from Republicans.The Second Amendment of the U.S. Constitution enshrines the right to bear arms and the Supreme Court has taken an increasingly broad view of that right in recent years, overruling laws meant to limit the carrying of guns in public.Last year, the United States passed the first major federal gun legislation in 30 years, putting limits on gun sales to those convicted of domestic violence.There have been nearly 200 verified mass shootings in the United States this year as of May 5, while 650 people were killed in U.S. mass shootings in 2022, according to the Gun Violence Archive, a nonprofit group. It defines a mass shooting as any in which four or more people are wounded or killed, excluding the shooter.",
        "FRANCEFrance has strict gun ownership laws but the arsenal of weapons used by Islamist militants in synchronised attacks on Paris venues in November 2015 demonstrated how difficult it is tackle the flow of illegal arms across Europe's porous borders.Ownership of military-grade guns is banned in France. Individuals who want to own a weapon with a removable magazine with a capacity larger than three rounds must undergo annual mental physical and health checks. Hunting weapons must be registered and owners must undertake a full day of theory exams.GERMANYGermany's government has faced pressure to tighten gun ownership rules following attacks in recent years and after the authorities uncovered an extremist network plotting an armed coup last year.Germany outlawed certain large magazines in 2020. It also introduced five-yearly checks on gun owners to ascertain whether their possession of a weapon is justified.About 1 million private citizens, in a population of about 83 million, own about 5 million guns, government data shows.NORWAYNorway in 2021 made it illegal to acquire high-powered semi-automatic rifles, responding to the 2011 massacre of 77 people by far-right extremist Anders Behring Breivik.From 2024 it will be illegal to possess any such rifles even if they were bought before the new legislation took effect.",
        "CANADAAfter 14 students were killed in their Montreal classroom in 1989, new legislation required safety courses, background checks and increased penalties for some gun crimes.In 2020, after a gunman killed 13 people in Nova Scotia, Canada banned more than 1,500 models of \"assault-style\" firearms and components, and set limits on how destructive bullets could be.Canada's rate of firearm homicides is 0.5 per 100,000 people versus a U.S. rate of 4.12, the University of Washington's Institute for Health Metrics and Evaluation (IHME) said in a 2021 analysis.UNITED KINGDOMAfter a gunman killed 16 children and their teacher in Scotland in 1996, a public campaign led to Britain adopting some of the strictest gun controls in the world. Within two years, new laws effectively banned civilians from owning handguns.The United Kingdom's rate of gun homicides is 0.04 per 100,000 people, the IHME calculates.AUSTRALIAAfter a gunman killed 35 people at a cafe and tourist site in 1996, Australia banned all semi-automatic rifles and all semi-automatic and pump-action shotguns. Thousands of unlicensed firearms were surrendered under a gun amnesty programme, and licensed gun owners required to take a safety course.The chances of being murdered by a gun in Australia fell 72% to 0.15 per 100,000 people in 2014 from 0.54 per 100,000 people in 1996, a Reuters analysis of Australian Bureau of Statistics figures showed.",
        "NEW ZEALANDAfter shootings at two Christchurch mosques that killed 50 people in March 2019, New Zealand banned the sale of assault weapons within days. Parliament voted to bar the circulation and use of most semi-automatic firearms, parts that convert firearms into semi-automatic firearms, magazines over a certain capacity, and some shotguns.Firearm-related murders were rare in New Zealand and remain so. The country had 11 in 2021.(Reporting by Reuters bureaux; Compiled by Gareth Jones; Editing by Edmund Blair)"
    ]
}