{
    "articleURL": "/news/article-12053623/The-BBC-calls-Charless-Coronation-strangest-town-sparking-backlash-Jonny-Dymond.html",
    "content": [
        "Royal correspondent Jonny Dymond called event 'the strangest show in town' Huw Edwards also criticised for spending 'five minutes' talking about spoonsHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk The BBC has branded Charles's Coronation 'the strangest show in town' - sparking backlash at royal correspondent Jonny Dymond. ",
        "It comes as the broadcasting big guns go head to head in a huge ratings war. In his BBC article, Dymond references Australian singer-songwriter Nick Cave, who will attend today's event 'for the bizarre, the uncanny, the stupefying spectacular, the awe inspiring'. Dymond then states that 'The Coronation will be all these things and more,' headlining his article 'the strangest show in town'. One person wrote on Twitter: 'This seems a somewhat 'strange' adjective to use by the #BBC Royal Correspondent.",
        "'Why pick on the Coronation?' Another wrote: 'What a waste of our licence money. This reporter helpfully tells people areas to avoid in London and other unnecessary advice as to how to avoid ‘the strangest show in town'.",
        "'People who don’t want to go, or even know about this historic day have already made their plans.' Dymond also wrote: 'Every big royal occasion, jubilee or wedding, birth or death, is an opportunity of sorts.'A chance to remind the nation and the world of the institution's role and relevance. And a moment to reinvent and rebrand.' He added: 'And this Coronation comes against a challenging backdrop.' Meanwhile BBC presenter Huw Edwards has been criticised on Twitter for spending 'five minutes' talking about spoons. One person wrote on Twitter: 'Huw Edwards has just spent five minutes talking about a gold spoon!!' ",
        "It comes as a battle of the box is taking place today, as BBC, ITV and Sky go toe to toe in a huge ratings war. On BBC1 and iPlayer, the coronation can be witnessed from your sofa from 7:30am to 3pm.   Kirsty Young anchored the early coverage from a studio at Buckingham Palace, joined by guests and experts including the Mail’s Robert Hardman. ",
        "Former Marine JJ Chalmers will also be on hand, speaking to members of the military as they prepare for the King and Queen’s processional return to the palace while Sophie Raworth will collar some of the famous faces among the 2,000 or so guests as they arrive at the abbey. From 1pm coverage will follow King Charles and Queen Camilla’s journey back to the palace.There will be a signed version of the event on BBC2 for deaf viewers. King Charles III: The Coronation will be on ITV1 AND ITVX from 8.30am to 3pm.On Sky News the coronation can be viewed between 6am and 5pm - as the TV platform reckons it can more than match its rival BBC for insight and expert analysis. MailOnline has contacted the BBC for comment.  "
    ]
}