{
    "articleURL": "/wires/ap/article-12044029/Walker-2-HRs-5-RBIs-Dbacks-win-12-7-split-Texas.html",
    "content": [
        "ARLINGTON, Texas (AP) - Christian Walker homered twice before he drew a bases-loaded walk that put the Arizona Diamondbacks ahead to stay in a 12-7 win Wednesday over the AL West-leading Texas Rangers, who had their four-game winning streak snapped.",
        "Walker put the Diamondbacks ahead 3-1 with his three-run homer in the third, added a solo shot in the fifth that chased Texas starter Andrew Heaney and walked on four pitches from Jose Leclerc in the seventh that drove in the run that snapped a 7-7 tie.\"Proud of myself there for some discipline,\" Walker said.\"I think young Christian Walker probably goes up there in swing mode. But mature, experienced Christian Walker says you got to throw him straight strikes,\" manager Torey Lovullo said. \"Leclerc has really good stuff. And the scouting report tells us that when it´s missing, it´ll be consistent, so make him throw strikes.\"Leclerc, a former closer, had just also walked Lourdes Gurriel Jr. on four pitches, before missing on four straight pitches to Walker.Each team hit four homers on the mostly sunny, 79-degee day with the roof open.",
        "Ketel Marte and Emmanuel Rivera also homered for Arizona, which matched its season high for runs. Walker, who has seven homers this season, matched his career-best with five RBIs in his sixth career multihomer game.Third baseman Josh Jung, after being named the American League's rookie of the month for April, hit two homers for the Rangers. Jonah Heim and Leody Taveras also went deep.Texas had a 7-6 lead after Jung's two-run homer with two outs to cap a five-run fifth. His second homer of the day, and eighth of the season, came an inning after his other homer.",
        "Joe Mantiply (1-0), the third Arizona pitcher, threw 1 1/3 scoreless innings. Josh Sborz (0-1), the second of five Texas pitchers, allowed three runs over 1 1/3 innings.Right-hander Brandon Pfaadt, a fifth-round pick three years ago that is Arizona's top pitching prospect, allowed seven runs and all four Texas homers over 4 2/3 innings in his big league debut. He struck out three and walked one.Heaney struck out five and walked four over 4 2/3 innings. Three of the four walks came in advance of homers.\"Just kind of unnecessary ... It's just frustrating because I feel like with the way our guys are swinging it, we feel like we're in any game,\" Heaney said. \"That's a situation, where just keep the game close and allow them to do what they do, and wasn't able to do that today.\"Of the seven walks to Arizona batters, six of them scored. That included the only walk by Sborz and the two by Leclerc, who threw only four of his 14 pitches for strikes.\"It really came down to just too many free passes,\" Rangers manager Bruce Bochy said. \"Both of those home runs (by Walker) had walks that preceded it. That did the damage, and then we ended up walking more.\"",
        "SHORT HOPSThe eight combined homers set a single-game high at Globe Life Field, which opened in 2020. ... Walker and Marte both also homered in the series opener Tuesday that the Rangers won 6-4. ... Pfaadt, a 24-year-old Kentucky native, had about 30 family and friends at the game.TRAINER´S ROOMDiamondbacks: Rookie OF Corbin Carroll, who had missed three games since he bruised his left knee running into a wall when trying to make a play Saturday, entered the game as a pinch-hitter in the seventh. He had a leadoff single and scored the first of Arizona's five runs in the inning.Rangers: SS Corey Seager, out since straining his left hamstring April 11, was more progressive while taking grounders, making backhanded stops and coming in for balls. Manager Bruce Bochy said Seager could be back in seven to 10 days, but said the Rangers would have a better target date once they get through the upcoming weekend.UP NEXTBoth teams have Thursday off. The Diamondbacks open a 10-game homestand Friday night against the Washington Nationals. Texas plays its next 10 games on the road, all against AL West foes, and starting at the Los Angeles Angels on Friday night.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}