{
    "articleURL": "/wires/pa/article-12060371/Gareth-Ainsworth-plans-big-changes-QPR-season-ends-defeat.html",
    "content": [
        "QPR boss Gareth Ainsworth plans “big changes” at the club following the end of a miserable season.",
        "Rangers’ 2-0 loss to Bristol City was their 12th home defeat of the campaign and highlighted their shortcomings at both ends of the pitch.“It just hits home and gives me more evidence of what I need to do in the summer,” said Ainsworth, who took over in February.“There are big changes that need to happen here. We’ve got to have real, big changes here in the summer. I’m realising that more and more.“You’ve got to be passionate. You’ve got to be crawling off that pitch at the end of the game. I was really expecting a bit more today.“But I don’t want to let it get to me too much. I’ve got to sort my squad out and sort the changes out.",
        "“I want a proper team that reflects the way I am, the way I manage, the way I want things done – and I aim to do that.“I’m sure there will be a lot of comings and goings throughout the summer. I want to be in here sorting it out and I’ll do my best to do that.“It’s going to be tough. But, given the chance and given the backing, I think I can bring the right characters in.”Bristol City boss Nigel Pearson believes his club can challenge for the play-offs next season if they are able to bring players in.",
        "Pearson said: “I think our fan base is quite excited about how this young team can move forward.“Now we’ve got to get the additions right and see if we can shape the squad in a way that we can be competitive in the top half, looking to push on for the play-off places.“There’s no point setting standards low or trying to be too safe with predictions. We’ve got to start delivering.“The players are capable, but we need to win games like today that potentially could go either way.“We’ve been involved in games this season where we really should pick points up and we’ve not. So I’m pleased today.“I think it’s important that the players and staff come back refreshed and ready to really push on. It’s not about being happy with small progressions – it’s about trying to be successful.“The future for the club will be bright for many years to come, which is good.”Goals from Mark Sykes and Sam Bell gave the Robins victory at Loftus Road, where the home side struggled to create clear-cut chances and always looked vulnerable at the back.City, who finished 14th, were fairly comfortable against Rangers, who were top in October but finished 20th, and would have finished below relegated Reading had the Berkshire club not been given a six-point deduction.",
        "Pearson said: “That performance was just what we were trying to achieve today.“They can be quite dangerous games when people might talk about there being not a lot on them.“I’m sure they wanted to end on a positive note at home, and we wanted to maintain our standards in terms of our application.“We did some really good things. The performance was good, with good energy, and it’s a good outcome.”"
    ]
}