{
    "articleURL": "/news/article-12056203/How-Penny-Mordaunt-rose-starring-role-King-Charless-Coronation.html",
    "content": [
        "Ms Mordaunt had starring role at Coronation as Lord President of the Council She has been a magician's assistant and a contestant on ITV reality diving show Splash! in the course of her colourful career.",
        "But nothing Penny Mordaunt has done has made waves quite like her starring role at the coronation yesterday.Lauded on all sides for her poise and striking outfit while carrying the Sword of State in Westminster Abbey, Ms Mordaunt has cemented herself in the public consciousness. Social media has been awash with images of her at the head of the King's procession, with even Labour counterparts commenting that she looked 'damn fine' and 'stole the show'. The bookies have taken notice, elevating the House of Commons Leader - and Lord President of the Privy Council - to second favourite to succeed Rishi Sunak as Tory leader.It is quite the turnaround for a politician who was seen as being sent to Siberia when Mr Sunak took over at No10.The 50-year-old made her second bid for the Conservative crown in September after the ousting of Liz Truss. But following a strong start she faded amid criticism of her liberal stance on gender rights, and then infuriated Mr Sunak's allies by refused to pull out of the race until the bitter end.That is thought to have contributed to the PM's refusal to hand her one of the Great Offices of State. Instead she was kept in the Commons Leader job, which has often been a staging post for ministers on the way out of government. ",
        "Ms Mordaunt has kept her personal life very private - having married and divorced in her 20s and apparently been single since the end of a serious relationship in 2016 - but never made any secret about her ambitions to get the top posts in British politics.Involved in Conservative circles since university, she worked for John Major and William Hague at CCHQ and in communications before getting elected in 2010 as MP for Portsmouth North - where she lived during a childhood beset by family tragedy and financial struggles.Towards the end of that Parliament Ms Mordaunt achieved a milestone when David Cameron appointed her as a communities minister. But she also faced a backlash after revealing that she repeatedly said 'c**k' in a Commons speech to settle a bet with colleagues she had been training with in the Royal Navy reserve.Labour accused her of trivialising Parliament with the address supposedly on poultry welfare, in which she used the word six times.Ms Mordaunt's profile received a major boost in 2014 when she featured on diving show Splash! and was named 'Britain's sexist MP' after a poll.Her stint on TV, alongside B-list celebrities including Gemma Collins from The Only Way Is Essex, saw her train under celebrity diver Tom Daley.",
        "She was the ninth celebrity eliminated after the likes of Paul Young and stand-up comedian Patrick Monahan.She was moved up to Armed Forces minister in 2015 - the first woman to hold the job.However, relations with Mr Cameron disintegrated the following year, when Ms Mordaunt became one of the most vocal campaigners for Brexit during the referendum campaign. She memorably took on the PM on the BBC Andrew Marr show, dismissing his insistence that there was no danger of Turkey joining the EU and driving immigration even higher.She backed Andrea Leadsom in her unsuccessful bid to succeed Mr Cameron in 2016 but managed to cling on to ministerial office under Theresa May, becoming minister for disabled people after Theresa May won the contest.Ms Mordaunt entered Cabinet for the first time the following year as Development Secretary, thanks to the sacking of Priti Patel in a bizarre row over unauthorised contacts with the Israeli government.And she hit a new high in 2019 when the resignation of Gavin Williamson over alleged national security leaks sparked her elevation to Defence Secretary.But the peak was not to last, as she was a strong backer of Jeremy Hunt over Boris Johnson in the Tory leadership contest a few months later.He sacked her when he became PM in July, and it was only after Mr Johnson's massive election victory that Christmas that she clawed her way back into favour. ",
        "Ms Mordaunt served on the lower ranks as a Cabinet Office minister and trade minister - but split opinions in both roles, with some claiming she was more interested in touring local Tory associations to further her future leadership hopes.She seized her opportunity when Mr Johnson was defenestrated last summer, but came under heavy fire for her supposed liberal views on trans rights. That has been regarded as a vital chink in her armour as a candidate for the Conservative right. Despite trying to neutralise the issue by stating that although trans people were legally female they were not biologically female like born women, Ms Mordaunt was knocked out. Having seen off Mr Sunak's challenge, Liz Truss installed Ms Mordaunt as Commons Leader. ",
        "That saw her lead the Accession Council after the death of Queen Elizabeth II last September. She was kept in the role by Mr Sunak, despite taking him on for the leadership and then trying to use wide support among MPs and activists to push for a major promotion. Rather than kicking off, she has loyally towed the PM's line, while still impressing many MPs with her debating skills in the notoriously awkward Business Questions sessions. But the admiration for her sword-bearing skills at the coronation might just reignite her fortunes.  ",
        "Ms Mordaunt has now been installed by bookies as second favourite to take over from Mr Sunak as Tory leader, behind only Kemi Badenoch. ",
        "One of twins, Ms Mordaunt was born in Torquay to a paratrooper father and teacher mother.Fittingly, she was named after a battleship - HMS Penelope - and moved with her family to Portsmouth when she was two, due to her father's job.When she was 15, both of Ms Mordaunt's parents were diagnosed with cancer, plunging her into the role of 'child carer'.She told DailyMail in 2014: 'All the women on my mother's side of family have died of breast cancer.'Shortly after her mother passed away, her twin brother dropped out of school and went to work in a factory.As he battled his own cancer, Ms Mordaunt's father worked round the clock to pay the bills.Ms Mordaunt's younger brother was aged just nine at the time and so she took up caring duties when still a teenager.She explained: 'We didn't get any help. It was very, very challenging and pretty tough trying to do everything.' Ms Mordaunt took up a role as an assistant to a Portsmouth magician called Will Ayling - once president of the prestigious Magic Circle - to pay her way through sixth-form college.",
        "She joined him in performances at Army barracks and golf clubs, where she was 'sawn in half and chopped to bits'.Ayling's signature trick - called 'Zigzag' - saw him push large steel blades through various 'body parts', giving illusion that the assistant's stomach was taken out.Ms Mordaunt said: 'I cut my leg a few times and got the odd nick under my chest, but no ambulances were required. It was fun and it relieved the pressures at home a bit.' By the time she had passed her A-levels and 'got the house back to normal', Ms Mordaunt's father had begun life with a new partner and she was able to 'really focus' on her life.She had a 'life-changing' year working in Romanian orphanages before studying philosophy at Reading University, where she forayed into student politics and rose to become president of the Students' Union. Whilst there, she helped to secure the acquittal of one of her university lecturers after he was wrongly accused of indecently assaulting two students. John Cottingham, now the emeritus Professor of Philosophy at Reading University, had been accused of trying to seduce the pair by discussing bondage and the work of the Marquis de Sade during a garden party.",
        "In 1997, he walked free from court after a trial in which Ms Mordaunt, then 24, said she had 'no hesitation' in coming forward to support him.After university, Ms Mordaunt worked under Prime Minister John Major as head of youth for the Conservative Party.She then briefly served as Head of Foreign Press for George W Bush's presidential campaign in 2000 and also worked as director of communications for Kensington and Chelsea Borough Council.Meanwhile, there was upheaval in Ms Mordaunt's private life as a year-long marriage to partner Paul Murray ended in 2000. She would go on to split from long-term partner Ian Lyon in 2016. The couple reportedly had eight cats but no children. She is believed to be single currently. Before entering Parliament in 2010, she also had communications roles at the National Lottery and Diabetes UK. Despite her true blue Tory allegiances, Ms Mordaunt's family ties were all to the Labour party.She is even related to first Labour chancellor Philip Snowden, as well as George Lansbury, who ran the party in the 1930s and whose granddaughter is the actress Angela Lansbury.",
        "Ms Mordaunt did admit that she went to 'check out' Labour at an education conference in Skegness in the late 1990s but returned home unimpressed.She explained: 'The people I met were very nice people. But no, I wanted to get things done.' In the year that she began her role as MP for Portsmouth North, Ms Mordaunt was commissioned into the Royal Naval Reserve, a post she remained in until 2019.Ms Mordaunt had entered Parliament after standing in Portsmouth North at the 2005 General Election, where she narrowly lost to Labour.She received a letter from former PM Margaret Thatcher telling her to 'get back on the horse'. After doing exactly that, she won her seat in 2010 with an 8.6 per cent swing, becoming one of 'Cameron's Cuties' - the women fast-tracked into Tory seats by then leader David Cameron as part of efforts to modernise the party's image.",
        "But she only served in the role for less than three months when Boris Johnson became PM and fired her after she backed rival Jeremy Hunt for the leadership.She went on to make waves in the Tory leadership contest after Mr Johnson was forced to resign last summer. Despite being hugely popular with Tory party members, Mrs Mordaunt missed out on the top job after being eliminated in the final round of voting among Tory MPs.She had however been criticised for her stance on trans issues. She had previously said that trans women are women, but changed her stance after coming under fire.  After Liz Truss's victory in the contest, Ms Mordaunt served in her short-lived cabinet as Leader of the House of Commons and Lord President of the Council when Liz Truss began her disastrous 50 days in Downing Street.Despite the fact that Ms Truss's premiership lasted for just 50 days, Ms Mordaunt did end up having a starring role on the nation's history when, after the death of Queen Elizabeth II, she led the Accession ceremony at St James's Palace in her role as Lord President.Ms Mordaunt did then run against Rishi Sunak to replace Ms Truss but eventually conceded after he became the clear favourite among MPs.  She kept her role as Commons Leader and Lord President under the new PM and it was in the latter post that she starred in the King's Coronation yesterday.Ms Mordaunt admitted that she had been 'doing some press-ups' in preparation for having to carry the Sword of State and present the jewelled Sword of Offering to the King.",
        "Dressed in a custom-made teal outfit with a matching cape and headband with gold feather embroidery, Mordaunt held the pieces for the majority of the service.Notable figures including a number of fellow MPs praised her, with Labour MP Emily Thornberry tweeting: 'Got to say it, @PennyMordaunt looks damn fine! The sword bearer steals the show.'Author and columnist Caitlin Moran also commented on the social media buzz around Ms Mordaunt's role, saying: 'Penny Mordaunt's sword is the 'Pippa Middleton's Bum' of the Coronation.'Labour MP Chris Bryant said in a tweet: 'The Penny is mightier than the sword.'"
    ]
}