{
    "articleURL": "/news/article-12051909/Joe-Kamala-make-surprise-taco-run.html",
    "content": [
        "President Joe Biden and Vice President Kamala Harris made a surprise taco run to the Northeast D.C. location of Taqueria Habanero on Friday They were marking Cinco de Mayo They ordered a chicken quesadilla, churros and an assortment of tacos to share with White House staff President Joe Biden and Vice President Kamala Harris snuck out of the White House Friday and made a surprise trip to a D.C. taco shop to mark Cinco de Mayo. ",
        "The president and vice president motorcaded to the Northeast D.C. location of Taqueria Habanero around lunchtime Friday and ordered some carry-out Mexican food. The liberal residents of Washington cheered Biden's arrival. 'We love you Biden!' an onlooker said. 'We love you Joe!' another shouted. They ordered a chicken quesadilla, churros and an assortment of tacos to share with White House staff.  ",
        "Unlike former President Donald Trump, who only ate at the restaurant at his D.C. hotel during his four years in office, both Biden and Harris have tried to occassionally be seen out on the town. Last Cinco de Mayo, Biden and Harris went to Taqueria Las Gemelas, a Mexican spot in D.C.'s Union Market district. The two have also both gone to Le Diplomate, restauranteur Stephen Starr's sceney French spot on 14th Street. Earlier this week, Harris bought records at the black-owned HR Records in D.C.'s Brightwood neighborhood. She purchased Ella Fitzgerald and Louis Armstrong's Porgy and Bess 1959 studio album, Charles Mingus’ 1972 Let My Children Hear Music and Roy Ayers' 1976 album Everybody Loves the Sunshine, Washingtonian reported. In February, several days after Valentine's Day, the president took the first lady to the Red Hen, an award-winning pasta spot. ",
        "That restaurant has made political headlines in the past, but by accident. When the owner of a similarly named Red Hen restaurant in Lexington, Virginia kicked then Trump press secretary Sarah Huckabee Sanders out in 2018, the D.C. one was bombarded with death threats and negative Yelp reviews. ",
        "In January, the president and vice president didn't leave the White House, but received a delivery order from Ghostburger, which after launching in a so-called 'ghost kitchen,' the kitchen another restaurant uses, has its own location now in Shaw.And in December, when French President Emmanuel Macron and his wife Brigitte were in town for a state dinner, the Bidens took them out to the classic Georgetown seafood spot Fiola Mare. Biden had previously dined at the Fiola Mare in October 2021 - and was criticized for walking through the restaurant sans face mask. Just days after his swearing-in, Biden's motorcade pulled up to Call Your Mother's Georgetown location after the president attended church. Son Hunter had called in for the first family's bagle order, with the Secret Service picking up the food. The fast-growing 'Jew-ish' deli chain has an administration connection then and now. One of the investors is White House Chief of Staff Jeff Zients, who previously was Biden's Coronavirus Response Coordinator.  "
    ]
}