{
    "articleURL": "/wires/reuters/article-12059269/Tyson-Foods-cuts-2023-sales-forecast-demand-slows.html",
    "content": [
        "By Tom Polansek and Granth Vanaik",
        "May 8 (Reuters) - Tyson Foods Inc shares plunged 16% to a three-year low on Monday as the U.S. meatpacker posted a surprise second-quarter loss and cut its full-year revenue forecast amid slowing consumer demand.The weaker-than-expected results indicate cash-strapped shoppers are cutting back on meat spending in a high-inflation environment while a shrinking cattle herd forces Tyson to pay more for livestock, eroding margins. Tyson also continues to struggle with increased expenses for staples like animal feed.CEO Donnie King, who is seeking to cut costs, said Tyson is in the unusual position of facing challenges in its beef, pork and chicken businesses simultaneously.The company lowered its forecast for full-year sales to $53 billion to $54 billion from $55 billion to $57 billion, after adjusted operating income for the first half of fiscal year 2023 sank 80% to $518 million.\"This quarter was definitely a tough one,\" King said on a conference call.Tyson hiked meat prices last year to offset inflation, but average sales prices for its beef and pork fell 5.4% and 10.3%, respectively, in the quarter ending April 1. Reduced demand for beef is making it difficult for Tyson to pass on higher costs to consumers, the company said.Sales volumes in Tyson's beef segment also fell, putting overall sales down 8.3% at $4.62 billion.",
        "Elevated feed costs and drought have driven cattle producers to send animals to slaughter instead of keeping them for breeding, forcing meatpackers to compete to buy fewer livestock.Tyson's costs to buy live cattle increased $305 million and its beef unit's operating margins fell to 0.2% from 12.7% a year earlier. The company pegged full-year beef margins at negative 1% to positive 1%, compared with its previous forecast of 2% to 4%.Beef margins were Tyson's worst since 2015, while pork margins were the worst in more than two decades at negative 2.2%, JPMorgan analyst Ken Goldman said.In Tyson's chicken business, margins were negative 3.7% as feed costs jumped by $145 million. The unit's adjusted operating income swung to a loss of $166 million from profits of $203 million a year earlier as Tyson recorded $92 million in charges related to the planned closure of two processing plants this month.Higher chicken feed costs were a \"particular disappointment,\" Goldman said, as grain prices have moderated.Tyson posted an overall adjusted loss of 4 cents per share, below analysts' expectations for an 80-cent profit. A year earlier, earnings were $2.29 per share.\"Many of the headwinds experienced are likely to persist for the remainder of the fiscal year,\" Chief Financial Officer John R. Tyson said.",
        "(Reporting by Granth Vanaik in Bengaluru and Tom Polansek in Chicago; Editing by Kirsten Donovan, Jonathan Oatis and Mark Potter)"
    ]
}