{
    "articleURL": "/tvshowbiz/article-12058091/Roxy-Jacenko-reveals-vile-death-threat-received.html",
    "content": [
        "Roxy Jacenko has shared the vile death threat she received from a troll after posting photos from her son Hunter's extravagant ninth birthday party.",
        "The PR queen, 43, posted the cruel message she received from a sadistic troll to her Instagram page.'You're a disgusting piece of trash Roxy Jacenko. With your vulgar displays of wealth on your young children while many are struggling highlights your total self centred narcissistic behaviour,' the nasty note read.'I pray your cancer comes back with a vengeance and your children get it as well or perhaps the boat can blow up next time and take your whole vapid and vile family with you.''Disgusting excuse for a human being please f**k off and die a horrible death,' the cruel message read.",
        "Roxy reposted the message and wrote: 'Another day, another freak slides into my emails.'Roxy received the nasty email after sharing photos from her son Hunter's rumoured $50,000 birthday party on a superyacht.The PR Queen threw a no-expense-spared Hawaiian-themed party aboard the 122ft charter yacht, Ghost II, which is rented out at $2800 per hour.The youngsters were treated to custom-made slippers, and danced away to a DJ on the cruise around Sydney Harbour.The three-hour event took a month to plan with Hunter even getting a personalised cake with a topper of himself on a surfboard and wearing Hawaiian shorts.",
        "Guests were also treated to hula girl dancers and a poi-ball dancer.",
        "Roxy told The Sunday Telegraph, her son chose the theme after looking at albums from a family trip.'Hunter was looking through old photos from when he was little and came across some images of a trip we went on to Hawaii,' she said. 'It was then he decided he wanted a Hawaiian-themed ninth birthday as he has missed out on celebrating with his friends due to Covid for the past three birthdays.'"
    ]
}