{
    "articleURL": "/news/article-12059229/Map-shows-traffic-lights-motorists-caught-jumping-red.html",
    "content": [
        "Survey reveals junctions that catch most drivers that go through red lights'Amber gamblers' could be racking up fines of almost £500,000 per yearA map of Britain’s ‘ambler gambler’ hotspots has been revealed - with a set of traffic lights in Sheffield taking the number one spot for motorists jumping the red light.",
        "And it has been found that offenders who are caught could be racking up fines of almost £500,00 per year. A survey, conducted by police forces, has revealed the worst junction in the county was the A61 Upper Hanover Street, in Sheffield, close to the city's university, a survey of police forces found. It was also found that the A322 at Bracknell -  which is a well known 'rat run' for drivers hoping to avoid part of the M25 by going cross-country between the M4 to the M3 - was the second most dangerous intersection in the UK.This comes after officers rigged cameras on dozens of sets of traffic lights up and down the country in a bid to stop people racing through after lights have changed.",
        "This camera system technology means that it is able to recognise a vehicle's registration plate if they go through after the lights have turned red.",
        "A61 Upper Hanover Street/Glossop Road, Sheffield - 4,623 finesA322 Bracknell Road/New Road, Bagshot, Surrey - 2,064 finesWandsworth roundabout, London - 1,836 finesA23 Brighton Road/Star Lane, Hooley, Surrey - 1,721 finesA446 Lichfield Road/Gorsey Lane, Coleshill, Warwickshire - 1,469 finesA4161 Newport Rd/Rover Way, Cardiff - 1,254 finesA4320 Easton Way/Stapleton Road, Bristol - 1,191 finesA6 St Margarets Way/Ravenbridge Drive Leicester - 1,013 finesA4061 Rotary International Way, Bridgend, S. Wales - 992 finesA127 Arterial Road/Bellhouse Lane, Southend, Essex - 915 fines",
        "Anybody caught can be slapped with a £100 fine and three penalty points on their licence. Although, first offenders may be offered the chance to avoid the points if they pay for a driver re-education course.It should be noted that getting 12 points or more within a three-year period usually results in a minimum driving ban of six months. The survey, which was conducted by police forces, has listed the junctions that catch the most drivers who dice death by speeding past the lights after they have turned red.  ",
        "The top ten sites are all around the country and include busy road junctions in London, Cardiff, Leicester, Liverpool and Bristol.Other sites that snared a high number of drivers were the Junction 2 off slip road from the M25, the A270 Old Shoreham Road, near Brighton and the Aigburth Road, in Merseyside.It has been estimated that in the last year, around 55,000 drivers were caught by red light cameras. Of these, around 35,000 opted for a course, 10,000 accepted a fine and the remainder ended up in court.Neil Greig, Director of Policy and Research at the Institute of Advanced Motorists (IAM) RoadSmart, said: 'These cameras are set to catch drivers who have passed the red light well after it illuminates. They are not amber gamblers but deliberate risk takers putting themselves and others in danger.'These systems are mainly installed at junctions with a history of red light running-related crashes, so they are not there to rake in fines but instead to save lives. 'It is incredibly selfish behaviour to ignore a stop light and cause a side impact crash which are among the least survivable, even in a modern car with airbags and other crash protection features.'"
    ]
}