{
    "articleURL": "/wires/reuters/article-12049417/Losing-streaks-Cubs-host-Marlins.html",
    "content": [
        "The Chicago Cubs are returning home from a dreadful road trip that began with a three-game sweep at the hands of the Miami Marlins.",
        "With prized first base prospect Matt Mervis expected to make his major league debut, the Cubs will hope to avoid a fourth straight defeat on Friday and begin some redemption against the visiting Marlins, who have also dropped three straight.On April 19, the Cubs were 11-6, batting .286, averaging 5.8 runs and riding a four-game winning streak. Since then, Chicago is 4-10, and during a recent 1-6 trip to Miami and Washington, it averaged three runs and lost five of those games by one run -- including all three against the Marlins last weekend.\"There could be a stretch where we win five, six close games in a row down the road,\" Chicago pitcher Marcus Stroman said. \"It's a long season. We just need to make sure we stay confident each and every day.\"Still, it would help to score more runs after totaling five while losing the final three of a four-game set this week against the Nationals, the last-place team in the NL East. The anticipated presence of Mervis could deliver an offensive boost.According to various reports, Mervis, the Cubs' 2022 minor league player of the year, is expected to be recalled from Triple-A Iowa and ready for this series. Since April 2022, the 25-year-old has slashed .305/.383/.599 with 42 homers and 146 RBIs in 161 minor league games.",
        "\"I found in my experience that players kind of hit you over the head with it over time,\" Cubs general manager Carter Hawkins said, according to the Chicago Sun-Times. \"And you start having a conversation every day. And, at some point, the answer becomes relatively obvious.\"Marlins starting pitchers held the Cubs to two runs in each contest last weekend. Friday's scheduled starter, starter Edward Cabrera (2-2, 4.67 ERA), yielded a two-run homer to Patrick Wisdom, two other hits and five walks while also striking out a career-high 12 in five innings of Saturday's 7-6 victory.Cabrera has made three starts in his career against the Cubs, going 2-0 with a 3.00 ERA.\"There's nothing physical. It's legit straight mental, and it's him,\" Marlins manager Skip Schumaker said of Cabrera. \"You can see the demeanor on the mound when he's feeling it.\"With that sweep, the Marlins took a four-game winning streak into this week's set with the visiting Atlanta Braves. Florida was then outscored 26-9 in losing all three games. Miami starters posted a 10.20 ERA in those contests.Meanwhile, Luis Arraez continues to hit, batting a major-league-best .424 for Miami.The Marlins got to scheduled Cubs starter Justin Steele (4-0, 1.49 ERA) like nobody did during the left-hander's first five 2023 starts. In six innings Sunday, Steele allowed season highs of three runs -- two earned -- and seven hits in Chicago's 4-3 loss. He finished the day with a no-decision.",
        "Steele, though, has allowed just three runs and struck out 44 over 34 innings in his last six home starts dating to last season. Steele made two starts in his career against the Marlins. He has no wins or losses and an ERA of 1.69 over 10 2/3 innings.Miami's Jon Berti and Garrett Hampson each had two hits versus Steele last weekend, while Arraez went 1-for-3 against him.Wisdom, meanwhile, is tied for second in the majors with 11 home runs, one behind the Dodgers' Max Muncy, but is 3-for-17 in the last five games. Teammate Nico Hoerner is batting .178 in the last 11 after hitting .367 in his first 20.However, Chicago's Trey Mancini is batting .344 (11-for-32) with four RBIs in his last 10 contests.--Field Level Media"
    ]
}