{
    "articleURL": "/health/article-12050575/Warning-hay-fever-sufferers-drugs-taken-pollen-misery-trigger-little-known-effect.html",
    "content": [
        "Dentists say relying on antihistamines could have consequences for your teethREAD MORE: Got hay fever? Here's your ultimate 2023 survival guideDrugs taken to relieve hay fever symptoms could put your smile at risk, experts have warned.",
        "Antihistamines are an essential part of a hay fever sufferer's treatment kit during the spring and summer months.But, as the high pollen season approaches, dentists have suggested relying on the once-a-day pills could have consequences for your pearly whites.Dr Sulaman Anwar, a specialist periodontist who works across private clinics in London, told MailOnline: 'If you suffer from allergies, you may not realise that they can also have an impact on your oral health.'If you're one of the many people who regularly take allergy medication such as antihistamines, you may be familiar with dry mouth as a side effect.'",
        "Dry mouth, or 'xerostomia', is when the salivary glands don't produce enough saliva, and can be caused by a number of underlying medical conditions, such as diabetes, or medications, especially heart, blood pressure and depression tablets.Dr Anwar said: 'When allergy medication decreases saliva production, it can leave your mouth more susceptible to harmful bacteria and tooth decay.'In fact, without proper saliva flow, the risk of both tooth decay and gum disease can increase.'Dr Anwar said decongestants, which relieve a blocked or stuffed nose, can have the same effect.NHS Inform says it is important to 'maintain good oral hygiene if you have a dry mouth to reduce the risk of dental problems'.",
        "What exactly is hay fever? Hay fever is an allergic reaction to pollen, a fine powder which comes from plants.There is more pollen in the air in the spring and summer when plants are flowering.The reaction usually happens when pollen comes into contact with someone's eyes, nose, mouth or throat.Symptoms include coughing and sneezing; a runny or blocked nose; itchy, red or watery eyes; an itchy throat, nose, mouth or ears; headaches and tiredness.Is it getting worse every year?The severity of hay fever depends on the weather.Wet and rainy conditions wash pollen away, reducing the number of people suffering from symptoms and their severity.However, dry weather blows pollen into the air, where it can easily get into the eyes and nose.The pollen season also seems to be getting longer, with a US study last year finding that it has been extended by 30 days between 1990 and 2018.When are symptoms worst?Hay fever symptoms tend to be worst around 11am and 6pm, and this is because pollen is at nose level.Pollen is on the ground at the start of the day and rises through as grass warms up. During the course of the day, the pollen then goes very high up into the atmosphere.As the temperature cools down during the course of the day, the pollen grains come down to earth again and at about 6pm they tend to be back at nose level.",
        "Saliva - essential for the smileOne study found an older brand of antihistamine, clemastine, which is sold over-the-counter, caused excessive dry mouth in six per cent of those who took it.But there is some indication dry mouth is less frequent with newer antihistamines, such as cetirizine, according to a paper published in Oral Diseases.Dr Graham Tinkler, one of the UK's top Invisalign dentists based in London, agreed that antihistamines can cause dry mouth, and there may be a correlation between extensive use and the severity of the side effect.Dr Tinkler said: 'Saliva helps to keep harmful germs in check. It helps to cancel out the acid that attacks your teeth, and is a very important part of your dental health.'Without saliva, acids from bacteria and plaque stay on the teeth and attack the enamel, causing tooth decay and potentially tooth loss.The soft tissues between the teeth are also affected, which can lead to gum disease. While very common, gum disease in itself causes tooth loss if left untreated.It is linked to a number of serious health problems such as rheumatoid arthritis and coronary heart disease.There are a number of other symptoms of dry mouth that cause general discomfort, such as dry lips, mouth sores or splits at the corner of the mouth.",
        "Dr Tinkler said: 'Some people find that they have problems with swallowing when their saliva flow is affected.'Having less saliva can also affect the taste of food and makes it harder to eat drier foods. Sometimes it can affect your speech and it makes people more likely to have bad breath.'Could you redress your hay fever treatment?Oral antihistamines are often seen as the first line treatment for hayfever - of which between 25 and 50 percent of Brits have, according to statistics collected by Allergy UK.However, 'the NICE guidelines recommend that self-management strategies for people with hayfever (pollen allergy) should be advised along any medicines', said London-based pharmacist Dr Rita Ghelani.Dr Ghelani said: 'When advising on hayfever to patients in the pharmacy I focus on the symptoms they are experiencing and get a good picture of their how it is affecting their day-to-day life.'Before recommending any oral antihistamines, I offer them the option of treating individual symptoms.'Patients are often surprised to hear that they can use eye drops to help with itchy eyes or a nasal spray that can help with a blocked nose as an alternative to antihistamines or in addition to.'Using a targeted medication that is administered directly to the nose or eyes for hayfever symptoms is much more effective and also reduces the risk of side effects on other areas of the body.'",
        "Other ways to manage hay fever without relying solely on antihistamines include wearing sunglasses, applying balm around the nostrils, keeping the windows shut and avoiding going outside during the early morning or early evening.Dr Tinkler said to talk to your doctor if you experience dry mouth.Instead of throwing out your antihistamines, you can manage dry mouth quite easily.Suck sugar-free sweets, chew sugar-free gum, sip cold water or get rinses, gels, pastes and lozenges from the pharmacist.",
        "Hay fever affects millions of people. It is an allergic reaction to pollen, typically when it comes into contact with your mouth, nose, eyes and throat. Hay fever symptoms are worse between March and September when the pollen count is at its highest. ",
        "What are the symptoms?Unlike a cold which only lasts for one to two weeks, hay fever lasts for monthsSneezing and coughingItch, red or watery eyesRunny or blocked noseItchy throat, mouth, nose and earsLoss of smellFeeling tiredHeadacheEarache  Source: NHS"
    ]
}