{
    "articleURL": "/wires/reuters/article-12045197/Rio-Tinto-immense-pressure-develop-US-copper-project.html",
    "content": [
        "MELBOURNE, May 4 (Reuters) - Rio Tinto Ltd is under \"immense pressure\" from the U.S. government to develop its Resolution copper project in the United States, given the copper it holds accounts for a quarter of all U.S. reserves, its chair Dominic Barton said on Thursday.",
        "Copper is vital for the transition to green energy but the project in Arizona is opposed by all of the state's tribal councils, including the San Carlos Apache because it would destroy a heritage site of religious significance.Rio Tinto has pledged to follow United Nations principles that require full consent from Indigenous groups for mining on traditional lands in the wake of its destruction of significant rock shelters in Western Australia for an iron ore mine in 2020.\"We are getting immense pressure to proceed because of the copper reserves that are there,\" Barton told shareholders at Rio Tinto's Australian shareholders meeting.Pressure was coming from \"parts of the U.S. government,\" Barton clarified on a media call following the meeting, as U.S. senators seek to get copper put on the U.S. critical mineral list which would allow copper projects access to tax breaks.\"We are engaging and we are not (making) any conclusions but we are going through a process right now,\" CEO Jakob Stausholm said.\"It's not just a matter of government approvals, but it's also a matter of us convincing ourselves it's the right thing.\"The U.S. Forest Service is set to approve a land swap between the U.S. government and Rio Tinto that would allow the mining giant to develop Resolution but Indigenous groups object to the transfer and contest ownership of the land.",
        "Rio Tinto has been under a \"deep engagement\" process with the groups for the past nine years. \"Ultimately it's societal choice,\" Stausholm added.The U.S. consumes around 2 million tonnes of copper a year but produces less than 1 million tonnes, Stausholm noted, and U.S. copper demand is only expected to grow sharply in coming years, he added.(Reporting by Melanie Burton; Editing by Himani Sarkar and Stephern Coates)"
    ]
}