{
    "articleURL": "/news/article-12044415/Stone-bridge-background-Mona-Lisa-uncovered-Tuscany-beauty-spot.html",
    "content": [
        "It is suspected that the structure in the painting is the Romito bridge in LaterinaThe stone bridge in the background of Leonardo da Vinci's Mona Lisa has been uncovered as a Tuscany beauty spot.",
        "Art historian Silvano Vinceti believes the overpass depicted in the 16th century painting is the Romito bridge that used to span over the Arno River in the small Italian village of Laterina, The Telegraph reported.He claimed to have 'no doubt' that he has correctly identified the four-arch bridge after analysing historical documents and drone images, and comparing da Vinci's artwork to photos of the area.It has previously been claimed that da Vinci modelled the bridge after structures in Bobbio and Buriano, both of which are in Tuscany. However, Mr Vinceti argued that neither of those bridges had four arches.While it may never be proven with certainty which bridge the Renaissance artist was intending to depict, Laterina mayor Simona Neri hopes the possible link to da Vinci will draw tourists to the village.",
        "Historians believe the Romito bridge, which now only has a single arch intact, used to feature four arches - like the bridge in da Vinci's painting.It is suspected that the arch was heavily damaged, likely in a flood, in the the 18th century. It is reported that the foundation of the alleged fourth arch can still be found in the undergrowth on the opposite side of the riverbank.Mr Vinceti also reportedly measured the width between the riverbanks and the size of the surviving arch to determine the space would fit four arches.",
        "The art historian added that the Romito was built between two steep cliffs, which corresponds with what is depicted in the Mona Lisa. The painting also shows a curve in the river with Mr Vinceti claims matches the curve of the Arno at the Romito bridge's location. 'We're convinced instead that it is the one at Laterina,' he said. 'We have all the elements that point to this being the bridge portrayed in the Mona Lisa.' As for the sheer-sided cliffs that appear on the left-hand-side of the masterpiece, just over the subject's right shoulder, Mr Vinceti suspects that these are a cluster of eroded, clay pinnacles that still exist today in Arno's upper valley.They can be found about 10 miles away from the ruins of the bridge at Laterina. The unusual rock formation can be found in Upper Valdarno, a valley that develops around the bed of the Arno river, halfway between Florence, Siena and Arezzo.",
        "The formation is known locally as le balze dell'acqua zolfina (the crags of the sulphurous water), and are understood to have been formed by erosion from a lake that drained some two million years ago. Meanwhile, Ms Neri hopes the discovery will bring tourists to Laterina. She expects the village to develop a 'friendly competition' with other villages that have claimed to be home to the Mona Lisa bridge.",
        "The mayor wants to make sure the 'remaining arch is protected' and told the Telegraph that 'there are plans for a hiking trail and bike path along the Arno River, so the bridge could be a key feature of that new route.'"
    ]
}