{
    "articleURL": "/wires/reuters/article-12059405/EU-takes-aim-Chinese-firms-proposed-new-Russia-sanctions--sources.html",
    "content": [
        "EU diplomats say 11th sanctions package may take time to agree",
        "Plan would cut trade with nations seen bypassing sanctionsChina warns against \"wrong path\"Scale and scope of EU sanctions expand as Ukraine war drags on(Adds another diplomat, EBRD analysis, other detail)By Gabriela BaczynskaBRUSSELS, May 8 (Reuters) - The European Union's executive has proposed blacklisting several Chinese companies and curbing exports to nations seen as involved in bypassing Russia trade restrictions under new sanctions against Moscow for the war against Ukraine.The 27 EU member countries - which must all agree for new sanctions to be enacted - will have a first discussion on Wednesday on the proposal by the European Commission's foreign policy unit, several diplomatic sources said on Monday.The proposal focuses on combating circumvention of existing trade restrictions through third countries, the sources said, after the EU identified China, Turkey, UAE, as well as countries in central Asia and the Caucasus as potential culprits.Seven companies in China would be subject to an asset freeze in the EU, said diplomats familiar with the proposal, in what would be a first for the bloc to punish China over accusations of Beijing's role in Russia's war in Ukraine.On Monday, Chinese foreign ministry spokesperson Wang Wenbin said China was urging the EU not to take the \"wrong path\", and that it was prepared to take action to safeguard its rights and interests.",
        "\"China opposes actions that use China-Russia cooperation as a pretext to impose illegal sanctions or long-arm jurisdiction against China,\" Wang said at a regular news conference.The Financial Times reported earlier on Monday the companies involved were 3HC Semiconductors and King-Pai Technology based in mainland China, as well as Sinno Electronics, Sigma Technology, Asia Pacific Links, Tordan Industry and Alpha Trading Investments in Hong Kong.A spokesman for the European Commission on Monday confirmed the proposal was sent out to member states and aimed at closing loopholes in Russia trade restrictions but declined to give detail.FLEXING ITS MUSCLEThe bloc might also expand its list of goods barred from road transit through Russia as it tries to starve Moscow of technology used in the battlefield against Ukraine, according to the sources.Among those added to the blacklist would also be individuals deemed involved in deporting Ukrainian children and moving cultural goods to Russia from the war zone in Ukraine, the sources said.In what would be the EU's 11th package of sanctions against Russia since it invaded Ukraine in February, 2022, the bloc would introduce a new mechanism to cut its exports to third countries seen as involved in bypassing Russia sanctions.\"It will be an empty vessels for now that can then be filled up as needed,\" said one EU diplomat. \"The whole point would be to never use it, to go for a diplomatic outreach first and offer technical assistance.\"",
        "\"Only as the last resort, we will have this threat hanging.\"Based on analysis of Germany exports data since Russia's invasion, the European Bank for Reconstruction and Development (EBRD) said last February that some banned EU trade was flowing to Russia via the Caucasus and Central Asia.\"The analysis... shows a sharp drop in direct exports from the EU to Russia following the introduction of sanctions in March 2022. At the same time, an increase in the EU exports to Armenia, Kazakhstan and the Kyrgyz Republic... is observed.\"\"Both patterns are particularly pronounced for product groups partially or fully subject to the EU sanctions as well as goods that are similar to the sanctioned ones,\" the EBRD said.Some of the sources suggested discussions between member countries could be long and fraught as the proposal risked upsetting economic and political ties.\"I would not expect a decision on Wednesday or next week either. Member states will have many ideas on whether this is a good avenue, how it would actually affect them,\" said a second diplomatic source.The proposal highlights the EU's increasing readiness to target third countries and foreign entities with its sanctions, even though the bloc has long insisted it does not do extraterritorial measures akin to the United States.",
        "\"Whether we like to admit it or not, it's clearly the way things are going,\" said a third EU diplomat, a person directly involved in drawing up the sanctions.Separately on Monday, Russia launched its biggest wave of drone strikes on Ukraine for months, escalating attacks in the run-up to its May 9 holiday celebrating the defeat of Nazi Germany in World War Two. (Reporting by Gabriela Baczynska, Editing by Christina Fincher)"
    ]
}