{
    "articleURL": "/wires/reuters/article-12060831/Chile-s-constitution-struggle-escape-Pinochet-s-shadow.html",
    "content": [
        "By Alexander Villegas and Natalia A. Ramos Miranda",
        "SANTIAGO, May 8 (Reuters) - Chile's new constitution may end up looking a lot like the current text, which dates back to the Augusto Pinochet dictatorship - but without his name on it - after the political right took charge of the redraft process in a harsh nationwide electoral defeat for leftist President Gabriel Boric.Chile's Republican Party, led by far-right firebrand Jose Antonio Kast, secured over a third of the national vote on Sunday to elect advisers to draw up the new constitution, a sharp shift from a progressive majority that led the failed first attempt.The win for the right will likely set the foundations for a far more conservative rewrite of the neoliberal original text, which was credited for propelling decades of strong growth in the copper mining nation, but criticized for causing wide economic inequalities that sparked months of social justice protests in 2019.\"This is the right's best chance for people to pick a Pinochet constitution without Pinochet's signature,\" said Patricio Navia a political scientist at New York University.\"If it includes some upgrades and demands from the left, we're going to have a constitution very similar to Pinochet's, but signed by Gabriel Boric and ministers of the Communist Party (part of the governing coalition).\"Boric, a former student protest leader, rose to power representing the Social Convergence Party on a hopeful mandate of reform, pledging to support a major progressive overhaul of the constitution. That process ended in failure last year when voters rejected the proposed new text.",
        "Boric and progressives had called for a new democratic drafting process led by citizens with a focus on Indigenous and minority rights, powers of collective bargaining, water and land rights, as well as healthcare, education and pension reforms.This time around, Boric's approval rating has fallen amid concerns about inflation and insecurity.\"The political climate in Chile isn't the same as in 2019 or 2020,\" said political analyst Cristobal Bellolio. \"After a pandemic, and amid an economic and security crisis, people are favoring options that reduce uncertainty.\"That's opened the door to far-right politicians like Kast, a lawyer who lost to Boric in the 2021 presidential elections and has defended the legacy of the brutal Pinochet dictatorship. An estimated 3,200 Chileans were murdered and another 28,000 tortured by the state during Pinochet's rule. Many of the victims were affiliated with the socialist government of Salvador Allende, who was deposed in a 1973 coup.Kast's party won 23 of 50 seats on the new constitutional council, while a separate coalition of conservative parties won 11 seats. With a three-fifths majority needed to pass new articles, the right could push things through on its own.Analysts said, however, that the right would likely agree to some changes to appease voters, including on areas like expanded social rights, consumer protections and Indigenous recognitions.",
        "\"The issue is that if it's more right then Pinochet's constitution, people are going to reject it,\" Navia added, who added the loss for Boric left the leader who once promised to bury Chile's market-led model sorely wounded.\"Boric said that if Chile was the cradle of neo-liberalism, it would also be its grave. But neo-liberalism is still healthy and now Boric is in the ICU,\" he said.The loss comes weeks after Boric presented his most-recent ambitious proposal to take control of the country's lithium industry and create a new national lithium company. The plan already faces technical and political challenges as a key part must pass through Congress.Rossana Castiglioni, a political science professor at Diego Portales University in Chile, said she was surprised by the low support for centrist parties and high number of null and blank votes, saying it was a message for progressives in the region.\"It's not enough to win an election, what happens in between is very important,\" Castiglioni said, adding that the economic landscape was very different than a previous leftist tide in Latin America during the economic boom of the early 2000s.\"The lesson is that there has to be a strategic adaption on the left if it wants to win elections in contexts were the economy is more adverse.\"",
        "(Reporting by Alexander Villegas and Natalia Ramos; Editing by Aurora Ellis)"
    ]
}