{
    "articleURL": "/wires/reuters/article-12040223/Knicks-race-past-Heat-4th-quarter-level-series-1-1.html",
    "content": [
        "Jalen Brunson scored 30 points to fuel the host New York Knicks to a 111-105 victory over the Miami Heat on Tuesday, leveling their Eastern Conference semifinal series at one win apiece.",
        "Brunson made 10 of 19 shots from the floor -- including 6 of 10 from 3-point range -- for the fifth-seeded Knicks. Game 3 in the best-of-seven series is Saturday in Miami.New York's Julius Randle collected 25 points, 12 rebounds and eight assists in his return after sitting out the series opener due to a sprained left ankle. RJ Barrett sank five 3-pointers to highlight his 24-point performance. Josh Hart added 14 points, 11 rebounds and nine assists.Miami leading scorer Jimmy Butler sat out Game 2 after sustaining a sprained right ankle during the fourth quarter of the series opener on Sunday afternoon.Caleb Martin recorded 22 points and eight rebounds and Gabe Vincent added 21 points for the eighth-seeded Heat. Max Strus finished with 17 points and Bam Adebayo collected 15 points, eight rebound and six assists.Miami built a 93-87 lead before New York scored 14 of the next 17 points to claim a five-point advantage with 2:48 remaining in the fourth quarter. Brunson sank two 3-pointers and a pair of jumpers during that sequence before Kyle Lowry and Adebayo each made a basket to trim the Knicks' lead to 101-100 with 1:58 to play.Hart halted that momentum by draining a 3-pointer, and New York added four free throws to extend its lead to 108-100 with 31.5 seconds left. Vincent made a driving layup and Duncan Robinson drained a 3-pointer to bring Miami within three points before Hart sank three of four free throws to seal the win.",
        "Vincent sank a pair of 3-pointers and added a driving layup to give Miami a 90-85 lead with 7:45 remaining in the fourth quarter. Isaiah Hartenstein countered with a short jumper, but Martin answered by draining an uncontested 3-pointer.Martin sank a 3-pointer to extend Miami's lead to 46-38 with 3:43 remaining in the second quarter. Randle answered by scoring the next eight points for his team to highlight a 13-5 run before Kevin Love sank a 3-pointer to give the Heat a 54-51 advantage entering halftime.--Field Level Media"
    ]
}