{
    "articleURL": "/femail/article-12054361/Can-spot-snow-leopard-Test-picture-challenge.html",
    "content": [
        "Pictures show the snow leopard in the Himalayas, but can you spot it?READ MORE: Can YOU tell what's wrong with this image that's leaving puzzle fans stumped?While these pictures may look like a normal surface of a mountain, there is a snow leopard hiding on the surface.",
        "But if you look long and hard enough, you'll be able to spot exactly where the furry creature is resting. This photographer captured some relatively close pictures of the snow leopard when travelling in the Himalayas, in Asia.The big cat has exhibited some top-notch camouflage skills as sharp-eyed spotters will have a challenging time finding it.Pictures show the animal walking around - but you wouldn't necessarily notice it straight away. Use this time wisely to scan the pictures from top to bottom.",
        "Are you able to spot the snow leopard hidden on the mountain? And if so, how long did it take you to find it?Once you have spotted the furry big cat, there truly is no going back.But many may struggle due to the taupe colour of the mountain rock, as the snow leopard is camouflaged.If you're struggling to find the snow leopard, then try looking towards the centre of the photograph.",
        "Another picture of the sneaky snow leopard shows it hidden among the rocks in the snowy weather.Snow leopards are sparsely located in 12 countries, in central Asia - including Mongolia, China, Afghanistan, Pakistan, India and Nepal.Scroll down right to the bottom for the answer, to check if you were right or if you've truly given up. ",
        "Another image shows the big cat again tricking even the most eagle-eyed viewers. The fuzzy creature is relaxing somewhere in this image - but can you spot it? If you need a clue, move your eyes to the rock in the middle of the image. The species is deemed vulnerable by the World Wildlife Fund (WWF), with around only 4,000 remaining. ",
        "This picture shows the snow leopard hiding in its natural habitat - but can you see it?Among the snow and rocks, there lies the predator, and if you cannot see it, here is a clue - look towards the centre of the picture.Snow leopards kill prey up to three times their own weight in their challenging terrain.",
        "The photographer also captured a snap of the snow leopard lurking around the mountain top.It's not unusual for these creatures to be this high up - as, their homes are rugged mountain landscapes at heights of over 3,000 metres.However, climate change may shrink their available habitat.If you need assistance spotting this animal, look at the centre of the image. If you're really stuck, the answers will be towards the bottom of the page.",
        "You may need to squint for this one, but the snow leopard is pictured hiding here.If you need a clue, look for spots towards the bottom centre of the image. ",
        "Snow leopards are the top predators in their environment and they prey on mountain sheeps and goats. Here are the answers for anyone who was struggling to find the snow leopard - prepare to have your mind blown. "
    ]
}