{
    "articleURL": "/wires/pa/article-12051191/Mikel-Arteta-hopes-William-Saliba-play-role-end-season.html",
    "content": [
        "Mikel Arteta has not ruled out William Saliba playing again this season despite his back injury once again sidelining him for Sunday’s trip to Newcastle.",
        "The France international has missed the last seven games as Arsenal’s title bid faltered, with the Gunners having handed the initiative over to Manchester City after a run of one win in five.Saliba’s absence has been felt hard, Arsenal conceding in each of the games he has missed having been involved in every Premier League game before being struck down by a niggling back issue.",
        "Arteta said last week that the recovery was taking longer than expected.“Not a lot of progress,” he said when asked for an update on the injury.“He’s feeling better every day but he’s not been able to have any activity around the first team so we don’t expect him to be with us (at Newcastle).“It’s about the healing process; pain-wise and the things he can do off the pitch he’s in a good place, but we have to build that capacity with the right load so that he’s able to contribute to the team.”",
        "Pushed on whether it was time to accept Saliba was out for the season, he added: “We are not there yet because we’re always hopeful and the players are pushing to play. If that’s the case we’ll announce it, but hopefully not.”Arsenal’s defensive injuries could have worsened further still as, with Saliba and Takehiro Tomiyasu sidelined, Gabriel Magalhaes was forced off during Tuesday’s win over Chelsea.",
        "“We will have to see tomorrow how he is,” Arteta said at his media conference on Friday.“But he could not finish the game so that was a big sign. We’ll have to see tomorrow.”Arsenal could be four points adrift of City by the time they kick off at Newcastle, themselves aiming to push on a secure a third-placed finish this season.The corresponding fixture last season came in the penultimate game of the campaign – a 2-0 win for Newcastle all-but ending Arsenal’s hopes of Champions League qualification.Arteta, shown in the Amazon “All or Nothing: Arsenal” documentary, tore into his players after the game at St James’ Park – but he is not planning to use the damaging defeat as fuel this time around.",
        "“It’s a very different game,” he said.“Different players, different game. We’re going to have to play better than last year that’s for sure because we know at home they’ve been really good.“I don’t think there’s too much to motivate from there. There’s a lot of things that we have to do better than that day. The group of players and the way they’re playing there is different.”"
    ]
}