{
    "articleURL": "/wires/afp/article-12040157/Where-football-politics-mix-Chiles-Palestino-football-club.html",
    "content": [
        "Thousands of miles away from conflict in the Middle East, the Palestinian flag flies on a cold autumn night at a football stadium in the Chilean capital, Santiago.",
        "Hundreds of fans have come out to support their team, the Palestinian Sports Club -- a professional football club which plays in the green, black, red and white colors of the Palestinian flag.The left sleeve of the team's jersey sports a Palestinian map -- as it appeared before the creation of Israel exactly 75 years ago.Politics is never far away at the club created by Palestinian expats in 1920.\"More than a team, an entire people,\" proclaims the club's logo.\"We even have songs: 'Gaza resists/Palestine exists',\" fan Rafael Milad, a 29-year-old businessman, told AFP.\"Palestino is 100 years old, older than the State of Israel,\" he added, using the team's nickname.- 'Palestino is Palestine' -At the beginning of the 20th century, Christian Arabs from the towns of Bethlehem, Beit Jala and Beit Sahur arrived in distant Chile and founded a South American community that today numbers around half a million people -- the largest outside the Arab world.They became successful textile merchants, and their descendants entered the political sphere: 35 have been ministers or congressmen.Three decades after it was formed in 1920, the club made its professional debut.\"Palestino is Palestine and Palestine is Palestino. We are always very concerned with the cause,\" said Roberto Bishara, a former club player.",
        "The team has won two national titles (1955 and 1978) and made it to a semifinal in the Copa Libertadores in 1979.In 2014, the team changed the number 1 on the back of their jersey to the elongated shape of the Palestinian territory before 1948, but were fined and banned from wearing it by the Chilean football association after a complaint.Once, the players also caused controversy when they wore the keffiyeh, a traditional headdress worn by Middle Eastern men, onto the pitch.In 2019, the club arranged giant screens for the fans in Ramallah to follow an international duel against Argentina's River Plate.Today the squad no longer has players of Palestinian origin. The last was Nicolas Zedan, who left the club in 2021.But the team continues to represent \"all those Palestinians who are there having a hard time. Each Palestino triumph... is a small joy among the suffering they have every day,\" Miguel Cordero, a 49-year-old lawyer of Palestinian origins, told AFP.- Women too -When not at the stadium, fans gather to watch matches at a clubhouse, also in Santiago, which boasts some 4,600 members.The venue flaunts a historic Palestinian map, a mural with the figure of leader Yasser Arafat and plays Arabic music in the background.",
        "Francisco Munoz, 48, is perhaps the team's most colorful fan.He frequently goes to the stadium dressed up as an Arab \"sheikh\" and his home is a shrine to the team.\"I was at a conference... where I saw the Israelis taking people out of their homes without warning and killing them. There I began to have sympathy\" for the cause, he said.In Chile generally, \"there is no confrontation (with the community)\", except with very extreme sectors\", said Sabas Chahuan, Palestino vice president.Contrary to the situation faced by women in the occupied Palestinian territories, where they can face pushback for activism against gender discrimination, according to the UN, the Palestino team works actively on promoting its female division.\"I´m here in football, which used to be for men only, and I think of Palestinian women. It would be nice if they had the freedom to express what they feel,\" says Isabel Barrios, coordinator of the women´s team created almost 25 years ago and winner of the league title in 2015.The Chilean club finances football schools for boys and girls in the Palestinian territories."
    ]
}