{
    "articleURL": "/news/royals/article-12053891/Claudia-Winkleman-faces-backlash-calling-Coronation-Tory-Christmas-chat-Jack-Whitehall.html",
    "content": [
        "TV presenter Claudia Winkleman was interviewing comedian Jack Whitehall Winkleman's sister, Sophie Winkleman, is married to Lord Frederick WindsorClaudia Winkleman is facing backlash after calling the Coronation weekend 'Tory Christmas' live on her BBC Radio 2 show today.",
        "In an interview with comedian Jack Whitehall, the presenter, 51, was heard making the remark and laughing after Whitehall let out a similar comment. 'The coronation is like Tory Glastonbury - it's a huge event,' he said.Winkleman, who has royal ties and featured on shows such as Strictly Come Dancing, replied: 'Tory Christmas.' The presenter's half-sister Sophie Winkleman is married to Lord Frederick Windsor, who is a member of the British royal family. ",
        "Speaking about his mother, the comedian told the host: 'My mum camped out on The Mall and is down there right now. She's been there for three days.'It's insane. She's there with a load of people I don't think she's ever met before.'He added: 'She is genuinely a royal enthusiast. I think it's because she made a promise to one of her friends, like, 40 years ago that they'd go to the Coronation, so there is one of her friends there.'It comes as huge crowds formed across the country today to celebrate the coronation of King Charles III. Royal fans who shook his hand after sleeping on the pavement and in tents outside Buckingham Palace yesterday were left emotional and in tears after meeting the royal. Today's remark by Winkleman also follows comments made by the presenter in February, when she revealed she isn't sure what makes a show a success. ",
        "On whether she had any indication to whether her new show The Piano would do well, she told Radio Times: 'I have absolutely no idea. Of course not.'",
        "After it was suggested that her latest show, The Traitors, was a hit due to its 'unpredictable format', Claudia mused: 'I hope so. I don't know. I hope people watch The Traitors because it's a good game.'I hope people will watch The Piano, but you can never take anything for granted.'MailOnline has contacted the BBC for comment.  "
    ]
}