{
    "articleURL": "/wires/reuters/article-12040137/US-stands-Philippines-against-Chinese-intimidation-S-China-Sea--official.html",
    "content": [
        "By Karen Lema",
        "May 2 (Reuters) - The United States stands with treaty ally the Philippines in the face of harassment by China's coast guard in the South China Sea and remains deeply concerned about \"intimidation\" by Beijing, a senior U.S. official said on Tuesday.A visit to the United States this week by Philippine President Ferdinand Marcos Jr highlights the strength and endurance of the alliance between the two countries, U.S. Assistant Secretary of State for East Asian and Pacific Affairs Daniel J. Kritenbrink said.The Philippines on Friday accused China's coast guard of \"dangerous manoeuvres\" and \"aggressive tactics\" in the South China Sea, in another maritime confrontation between the two countries. China said the Philippines vessels made \"deliberate provocative moves\".\"We remain deeply concerned by (China's) continued intimidation and harassment of Philippine vessels as they continue to undertake really routine patrols within the Philippine exclusive economic zone,\" he said in a teleconference from the United States.\"Such actions and behaviour on the part of Beijing are truly unacceptable.\"Kritenbrink also said the United States and its partners recognised the importance of maintaining peace across the Taiwan Strait.The Philippines and United States on Monday reaffirmed their decades-old security alliance in a trip that marks a dramatic turnaround in their relations, as both countries seek ways to push back China's assertiveness near Taiwan and in the South China Sea.",
        "U.S. President Joe Biden told Marcos on Monday said the U.S. commitment to defending its treaty ally was \"ironclad\". Marcos said the region had \"arguably the most complicated geopolitical situation in the world right now.\"Under Rodrigo Duterte, Marcos' anti-U.S. predecessor, relations soured as he sought to court China while openly rebuking Washington.Kritenbrink said he was \"exceptionally confident\" about bilateral ties. (Reporting by Karen Lema in Manila; Editing by Martin Petty)"
    ]
}