{
    "articleURL": "/tvshowbiz/article-12052799/Jonas-Brothers-intimate-concert-handful-fans-SiriusXMs-Miami-studios.html",
    "content": [
        "The Jonas Brothers appeared at Miami's brand new SiriusXM performance space on Friday.",
        "The trio performed an intimate concert for the few fans who were lucky enough to win passes to the event.Nick, 30, Joe, 33, and Kevin, 35, all dressed very casually for the event. Nick wore a maroon and white striped, collared shirt with khakis.Joe donned a white knit, short-sleeved, button-front shirt covered in a pattern of yellow Gucci logos and a pair of distressed, torn jeans.Meanwhile, Kevin wore a black and white print long-sleeved shirt open over a black t-shirt with jeans. ",
        "The band performed an 'exclusive and intimate set live from the SiriusXM Miami studios,' a press release from the outlet stated.'Hosted by Hits 1 Miami’s Mack &amp; Jen, the special event features a sit-down interview as well as the Jonas Brothers performing music from their new album, The Album which is scheduled to be released on Friday, May 12.'The performance comes three days after the brothers announced a massive summer tour they are calling, 'Five Albums. One Night.' 'It's official!' the Jonas Brothers wrote on Instagram alongside the tour announcement. 'Let's go!'The tour kicks off August 12 with two shows at Yankee Stadium in New York City, and the brothers will spend the next two months hitting up stadiums across the country including Chicago's Wrigley Field and Los Angeles' Dodgers Stadium.",
        "The tour wraps up in Miami on October 14 after 35 shows.Last month, the band said they will 'pretty much every song from all the albums' during the concert at Yankee Stadium - which was announced before the full tour - during an interview on SiriusXM's Radio Andy show.The Five Albums. One Night. tour comes after the brothers played a five night residency on Broadway. During the residency they played a full album each night starting with 2007's Jonas Brothers, 2008's A Little Bit Longer, 2009's Lines, Vines and Trying Times, 2019's Happiness Begins and 2023's The Album.The newest album drops on May 12.During the interview with Andy Cohen, Nick, 30, revealed that the Broadway residency was a test run for the upcoming tour.",
        "'For those that don't know, we basically played five nights and picked a different album that we spotlit for the first act of the show,' he said.'We played it in its entirety,' Nick continued. 'Which, for a lot of these songs, we've never even played them or we hadn't played them in 15-plus years.'A few days after their Broadway residency wrapped up, they got a call to talk about how they could adapt that format into a one night event and take it on the road.",
        "The Jonas Brothers plan to 'play the familiar songs from each album' and have a few ideas and surprises up their sleeves."
    ]
}