{
    "articleURL": "/wires/reuters/article-12040727/From-tea-ketchup-shelves-lie-retailers-struggle-predict-demand.html",
    "content": [
        "By Richa Naidu and Helen Reid",
        "LONDON/BARCELONA, May 3 (Reuters) - A \"salad crisis\" affecting British supermarkets hit headlines earlier this year but shoppers across Europe and the Middle East seeking some basic groceries - from pasta to beer to toothpaste - are also finding gaps on the shelves.Top industry executives, consultants and analysts told Reuters that supermarkets are struggling to predict demand as the receding experience of COVID-19, new ways to buy and a biting cost-of-living crisis change shopping habits.Supply chain issues and a reluctance to strike deals with suppliers while commodities prices are high are also contributing to erratic stocks of goods as diverse as chocolate, ketchup and shampoo, with war and weather playing a part too.\"The inflationary pressure that has happened of late ... means that people are switching out of certain products in a more unpredictable way, in a more brutal way than they have done historically,\" said Luke Jensen, executive director at British online supermarket Ocado.\"Because of higher prices, people are buying smaller amounts of groceries overall and may have become more careful not to waste food.\"Jensen is also CEO of Ocado Solutions, which provides grocery delivery technology to European supermarkets including Sweden's Ica, France's Casino Group, Alcampo in Spain and Auchan Retail in Poland.Like many supermarket operators, Majid Al Futtaim Retail uses artificial intelligence to monitor and order about 90% of food supplies for its Carrefour stores across the Middle East.",
        "CEO Hani Weiss said it had recently tweaked the parameters set for the technology to cushion supply, adding more warehouses and storage to ensure it can meet customer demand.\"Despite all of that, (there are) 8% to 12% missing items on shelves,\" he said. \"It used to be around 7% to 9% prior to 2020, and now we've seen it increase drastically.\"Changes to shopping habits as a result of COVID-19 lockdowns and the growth of online retail are also a factor, although with lifestyles still adjusting after the pandemic, it's hard to predict to what extent people will return to stores.Kevin O'Marah, a former Amazon executive and founder of Zero100, a community for supply chains and operations leaders, said multiple ways to shop had left retailers \"puzzling\" over what to order and where.But the \"massive disruptions have really forced chief supply chain officers to try to get a better handle on their planning technology,\" O'Marah added.Suppliers too are struggling to pin down what consumers will want, while rising commodities prices, shipping logjams and shortages of raw materials and labour have stopped them fulfilling some orders.\"Post-COVID growth dynamics combined with energy and political discontinuities mean that retailers and their suppliers are both finding it harder to accurately predict demand in a volatile marketplace,\" Ewan Andrew, president of global supply and procurement for Guinness maker Diageo, said.",
        "\"Often there is a perfect storm of events that contribute to shortages, such as the one in some food supplies in Europe that is currently being witnessed.\"WAR, WEATHER, PRICE WRANGLESWeiss at Majid Al Futtaim said the 14-month-old war in Ukraine, a major exporter of grains and oilseeds, had caused massive problems for food producers, who had been forced to adjust their supply chains to address shortages of ingredients.\"This has created a major, major issue around out-of-stock\" in most of the 16 Middle Eastern countries where the company operates, he said.Laurent Thoumine, Accenture's Europe lead for retail, said supermarkets in Britain, France, Germany, Italy and Spain have had the worst stock issues.Products that are scarce in some stores include ketchup, pasta, chocolate, tea, potato chips, toothpaste and pet food, according to Nielsen IQ's Data Impact.\"Certain ingredients are simply in short supply - like tomatoes for ketchup,\" said Bernstein analyst Bruno Monteyne, adding that problems at some factories had also hurt food production.Extreme weather conditions in Spain this year have hit tomato supplies in Europe, while higher costs for the fruit have prompted manufacturers like Kraft Heinz to raise prices.In turn, retailers like Tesco have temporarily pulled their products from shelves, risking driving shoppers to rival stores, as they tough out supply talks into which all these factors feed.",
        "\"When products finally make their way to supermarket shelves, we're seeing the end result of multiple different negotiations,\" said James Brown, senior partner at consultancy Simon-Kucher &amp;amp; Partners, which advises several major consumer goods makers on their pricing strategies.\"Those elements in the puzzle board have not been caused by tomatoes in Spain freezing accidentally.\" (Reporting by Richa Naidu in London and Helen Reid in Barcelona, Editing by Matt Scuffham and Catherine Evans)"
    ]
}