{
    "articleURL": "/news/article-12056049/Jobseeker-payments-increased-Labor-Federal-Budget.html",
    "content": [
        "Federal budget to be announced on TuesdayAll jobseeker recipients will get an increaseThe Greens say the amount isn't nearly enough Everyone collecting Jobseeker will soon see an increase in their payments as Labor prepares to hand down its federal budget this week.",
        "Treasurer Jim Chalmers confirmed on Sunday payments will be increased 'across the board' by up to $2.85 a day, or $40 per fortnight, for all recipients and not just for over 55s as was speculated.But Greens social services spokesperson Senator Janet Rice said the dollar amount was an insult as those who are on welfare are being hit hardest by the rising cost-of-living.'If reports today are true, Labor's planned increase to Jobseeker is less than even the Liberals did under Scott Morrison, and is a slap in the face to everyone in desperate need of a substantive increase to the rate of Centrelink payments,' Ms Rice said in a statement.'While in opposition, Labor slammed the Morrison Government for its paltry increase and now in government, Labor is doing even less to help welfare recipients than the conservative party.'",
        "Currently, payments for a single adult with no dependent children are $693.10 per fortnight, or $49.50 a day, slightly less for those in a live-in relationship.Those with a dependent child or who are over 60 receive $745.20 a fortnight, or $53.22 a day.Senator Rice said an increase of $2.85 a day 'is woefully inadequate and doesn't even keep up with the rising costs of food and rent'.'This is still $500 a fortnight below the Henderson Poverty Line, and more than $200 below the recommendations of the Government's own hand-picked Economic Inclusion Advisory Committee.",
        "Senator Rice also questioned whether other welfare payments such as Youth Allowance, the Disability Support Pension, Parenting Payment, or Age Pension would be increased.The Labor government has made no mention of these in the lead up to the Budget's release on Tuesday.'We need to build a strong social safety net for everyone who needs it. No one deserves poverty. Labor must raise all income support payments above the poverty line to $88 a day,' Senator Rice said.",
        "The Labor government is reportedly expecting to post a surplus in the federal Budget in an surprising financial turnaround. The small surplus would reportedly be possible due to higher iron ore, coal and gas prices which have boosted government revenue, while low unemployment has reduced the welfare bill.It would be the first Budget surplus since 2007, when the Coalition was in power before the GFC in 2008.But it would also mark the first federal Labor Budget in the black since 1989, when 18 per cent interest rates during an era of high inflation led to a recession two years later. "
    ]
}