{
    "articleURL": "/wires/reuters/article-12051269/Carvana-shares-soar-upbeat-forecast-short-squeeze.html",
    "content": [
        "By Kannaki Deka",
        "May 5 (Reuters) - Carvana Co's shares soared as much as 55% on Friday after the struggling online used-car retailer's surprise second-quarter profit forecast caught bearish investors on the wrong foot.Carvana endured a turbulent 2022 as the company struggled to offload used cars purchased at higher prices during the pandemic due to weak demand over affordability concerns.Short positions in Carvana were at $488 million, with short sellers estimated to have lost $142 million since the stock started trading higher in after-hours trading on Thursday, according to analytics firm Ortex.\"Some short sellers will add to the buying pressure as they try to close their positions and, therefore, causing a short squeeze,\" Ortex co-founder Peter Hillerberg said.Investors heaved a sigh of relief on Thursday after Carvana said its adjusted earnings before interest, taxes, depreciation, and amortization(EBITDA) were expected to be positive in the second quarter.Carvana, known for its car vending machines, has cut costs and is trying to restructure its debt, some of which was taken on to buy auction firm ADESA's U.S. physical auction business.Analysts, however, were still cautious.\"This stock isn't for the faint of heart, given ongoing solvency concerns and a very real risk of macro deterioration,\" Piper Sandler analysts said in a note on Friday, as they bumped up their price target on the stock by $1 to $21.",
        "\"For us to turn constructive... CVNA would need to return to sustained profitable growth. This is unchartered territory in our view given the company's history and particularly in what we believe is going to be challenging used car supply environment in the medium-term,\" J.P. Morgan analyst Rajat Gupta said.Carvana shares have risen 52% so far this year amid interest from retail investors after shedding 98% of their value last year.(Reporting by Kannaki Deka in Bengaluru; Editing by Subhranshu Sahu)"
    ]
}