{
    "articleURL": "/tvshowbiz/article-12049547/Neighbours-star-Madeleine-West-Byron-Bay-launching-appeal-against-AVO.html",
    "content": [
        "Madeleine West recently began her appeal against the AVO taken out against her to protect her ex father-in-law. ",
        "Now the former Neighbours star, 42, has been spotted out and about in Byron Bay for the first time with one of her six children, Xascha.The pair were seen leaving the grocery store Spar in Byron Bay on Thursday, with the House Husbands star garbed in tiny white jean shorts and a blue long-sleeved shirt. She finished her look with a pair of brown sandals, fit for the beachy tourist locale, which matched the over-sized bag hanging from her shoulder.The blonde beauty, with razor straight tresses flowing to her derriere, picked up some pears and other snacks from the store.  ",
        "West struggled to juggle all the produce she bought in her hands as she opened the car door, but eventually managed to slip inside. The lookalike mother and daughter shared a quick snack in the vehicle before pulling out of the parking lot. It comes after West launched a formal appeal on the AVO taken out against her following accusations she pushed her ex father-in-law.",
        "She was accused of assaulting her ex husband Shannon Bennett's father Benny Clifton Bennett, 75, in his son's home last year. West denied the allegation and fronted Byron Bay Local Court for two days last month in a bid to fight the apprehended violence order.Prosecutors alleged West pushed Mr Bennett on May 4, 2022, and forced her way into the home of her ex-husband with whom she shares six children - Phoenix, Hendrix, Xascha, Xanthe, Xahlia and Margaux, who are aged between eight and 16.",
        "The court was shown CCTV of West and Mr Bennett at her ex-partner's home while the MasterChef star was in the US. Magistrate Stafford then ruled the two-year domestic violence order against West be upheld.West appealed the decision with the matter briefly mentioned in Coffs Harbour District Court, on the NSW north coast, on Wednesday morning.The actress did not appear and was represented by her lawyer Farshad Amirbeaggi, with the matter adjourned to June 7.During last month's court proceedings, prosecutors allege the incident between West and Mr Bennett left the 75-year-old 'in fear' of his ex-daughter-in-law."
    ]
}