{
    "articleURL": "/wires/reuters/article-12047439/At-Musk-s-brain-chip-startup-animal-testing-panel-rife-potential-conflicts.html",
    "content": [
        "By Rachael Levy and Marisa Taylor",
        "May 4 (Reuters) - Elon Musk´s brain-implant venture has filled an animal-research oversight board with company insiders who may stand to benefit financially as the firm reaches development goals, according to company documents and interviews with six current and former employees.Such oversight boards are required by federal law for organizations experimenting on certain types of animals. The panels are charged with ensuring proper animal care, high research standards, and the reliability of data that helps regulators decide whether drugs or medical devices are safe for human testing.The membership of the panel at Musk´s company, Neuralink, raises questions about potential violations of conflict-of-interest regulations aimed at protecting research integrity, a dozen animal-research and bioethics experts told Reuters. Neuralink is conducting animal experiments as it seeks regulatory approval for human trials of a brain chip intended to help paralyzed people type with their minds, among other ambitious goals.Nineteen of the board´s 22 members were Neuralink employees as of late 2022, according to a company document reviewed by Reuters. The oversight board´s chair was the Neuralink executive who led the company´s animal-care program, and at least 11 other members were employees directly involved with animal care or research.Details of the panel´s membership and its potential conflicts have not been previously reported. Insight into its makeup comes in the wake of two federal investigations, first reported by Reuters, into potential animal-welfare violations by Neuralink and allegations that it improperly transported dangerous pathogens on implants removed from monkey brains. Reuters reported in December that some employees had grown concerned about the animal experiments being rushed under pressure from Musk to speed development, causing needless suffering and deaths of pigs, sheep and monkeys.",
        "It´s possible the board´s membership has changed since late last year. Musk and Neuralink didn´t respond to requests for comment for this story or previous Reuters articles about the investigations into its animal testing.The review boards are known as \"institutional animal care and use committees,\" or IACUCs. The animal-research and bioethics experts said it´s rare for IACUCs to include employees with such direct financial stakes in the research outcome. Putting employees on such panels poses a particular problem at startups such as Neuralink because they tend to focus on a single breakthrough product and commonly reward employees with volatile company shares.Neuralink staffers typically are compensated with salary and stock-based incentives, according to five current and former employees and Neuralink job advertisements reviewed by Reuters. Two of the staffers said some senior-level employees stand to make millions of dollars if the company secures critical regulatory approvals. Reuters couldn´t determine the compensation terms of the Neuralink IACUC members who are also company employees.Neuralink shareholders could see big gains if the private company´s valuation, currently more than $1 billion, continues to soar. Successful animal trials are critical for the company to gain federal approval for human trials and, ultimately, brain-implant commercialization. Reuters reported in March that the U.S. Food and Drug Administration rejected Neuralink´s first human-trial application, in part because the company had not proven the device´s safety in animal tests.",
        "Dr. Miguel Nicolelis, a neuroscientist and physician, has conducted brain-implant research at Duke University for nearly three decades. He said the IACUC members overseeing his animal experiments never had any role in the research, including animal tests of the same type Neuralink is conducting now. The independence of such boards, Nicolelis said, is critical to protecting the integrity of animal research that could impact humans in future clinical trials.\"It´s an obvious conflict of interest,\" he said of the Neuralink board´s composition.ROCKY PARTNERSHIPMany companies outsource animal testing and oversight to universities or research institutes with strict rules to prevent such conflicts of interest, the animal-research and bioethics experts said. These institutions generally prohibit people with direct financial interests from serving on IACUCs or voting on animal experiments.Neuralink originally partnered with the University of California, Davis, to help conduct and oversee its animal tests. But the company later ditched the university after a dispute, viewing the school´s processes as too slow and bureaucratic, one current and one former Neuralink staffer said. Neuralink then brought the research and oversight in-house.UC Davis declined to comment on Neuralink´s new oversight board but said in a statement that its conflict-of-interest rules prohibit \"interested\" parties from voting or \"influencing decisions\" on such panels.",
        "The U.S. National Institutes of Health is the world´s largest public funder of biomedical research. On projects it backs, the agency bars any IACUC member deriving income or stock from a research sponsor from reviewing or voting on that sponsor´s animal research, said Dr. Patricia Brown, the director of the NIH´s Office of Laboratory Animal Welfare.The NIH declined to comment on Neuralink´s board. The agency once reached out to Neuralink to offer funding and guidance under a program intended to boost brain-implant research, Reuters previously reported. Neuralink wasn´t interested in NIH funding because Musk wanted to avoid public oversight and perceived bureaucratic hurdles.The U.S. Department of Agriculture (USDA) is the lead agency enforcing animal-welfare regulations. The animal-research experts interviewed by Reuters, including two former top USDA officials, described the agency´s overall enforcement of conflict-of-interest rules as lax.USDA regulations forbid IACUC members from participating in the \"review or approval of an activity in which that member has a conflicting interest.\" But that rule doesn´t clearly define a conflict. It does offer, as one example, a situation in which a board member is \"personally involved in the activity.\"The USDA has interpreted the rule narrowly, the experts and former agency officials said. The agency, they said, rarely flags a conflict unless an IACUC member votes to approve a particular experiment the member is also directly running as a company employee. Beyond that, the USDA allows a range of potential conflicts that would never be permitted in human trials, which are overseen by other federal agencies that have similar conflict-of-interest regulations, the experts said. Conflicts such as the ones on Neuralink´s IACUC also are typically prohibited or avoided in animal trials by universities, research institutes and many companies.",
        "In response to an inquiry from Reuters, the USDA said it had found no conflicts of interest on Neuralink´s board when the department inspected its animal-research operations during 10 inspections since 2020. The company has passed all inspections with no citations, according to public records and a person with knowledge of the examinations.The agency declined to answer detailed questions about its legal interpretation or enforcement of conflict-of-interest rules for animal research and oversight.The USDA´s Office of Inspector General, the agency now probing potential animal-welfare violations by Neuralink, is also investigating allegedly slipshod Animal Welfare Act enforcement by the USDA itself, in a joint probe with the U.S. Department of Justice, Reuters has reported.The USDA and Justice Department declined to comment on the investigation. The USDA inspector general didn´t respond to requests for comment.The joint probe is examining the agency´s oversight of Neuralink and of animal welfare more broadly. The investigation follows a long history of USDA OIG reports, including three since 2014, blasting the agency´s animal-welfare enforcement as ineffective. One issue is a stretched staff: The USDA employs 122 inspectors to inspect 11,785 facilities, ranging from zoos and breeders to labs, according to a Congressional Research Service report last July.USDA enforcement of conflict-of-interest rules is rare. In more than 11,000 USDA inspections over the past decade, the agency issued eight citations for conflicts at research labs, none of which resulted in a penalty, according to a review of the records by Delcianna Winders, who oversees the Animal Law and Policy Institute at the Vermont Law and Graduate School. The lack of enforcement, she said, poses a serious risk that conflicted IACUC members will put their own interests before those of the animals.",
        "\"The USDA is really only inspecting paperwork and not looking under the hood,\" she said. The case of Neuralink´s board, she said, illustrates the problem with \"the overly narrow interpretation the USDA is giving to `conflicting interest.´\"ANIMAL WELFARE `INCIDENT´Between September 2017 and December 2020, Neuralink partnered with the University of California, Davis, relying on the school´s federally funded primate-research lab and its established IACUC. UC Davis received more than $1.9 million from Neuralink for experiments before the partnership ended, the university said. Neuralink surgeons and other staffers continued to work directly on the experiments, in consultation with the university.A UC Davis spokesperson told Reuters the university´s monitoring of Neuralink´s experiments detected an animal-welfare incident in 2019, prompting the university´s IACUC to mandate changes in Neuralink´s research protocols and training. The spokesperson said the incident didn't involve UC Davis staff but declined to comment further.Amid tensions, Neuralink canceled its partnership with UC Davis in 2020, then built its own animal-testing facilities and created its own IACUC.Neuralink´s IACUC is charged with limiting the number of animals tested to the minimum required for research. Tested animals are typically killed after experiments so researchers can examine them post-mortem.The company has rushed and at times botched experiments, especially after it brought animal experiments fully in-house, according to Neuralink staffers and company records seen by Reuters. The company´s IACUC allowed Neuralink to accelerate animal experiments, in line with Musk´s demands, three sources familiar with the panel´s decisions told Reuters.In 2021 and 2022, the company killed about 250 sheep, pigs and primates, the company records show. In one instance in 2021, the company implanted 25 out of 60 pigs with the wrong-sized devices, Reuters previously reported. Neuralink employees said the error could have been avoided with better preparation.Several animal-research experts called the role of board chair Autumn Sorrells - also the executive heading Neuralink´s animal-care program - a particularly troubling conflict.Sorrells didn´t respond to requests for comment.Several of the 22 IACUC members also report to Sorrells in their Neuralink jobs, separate from the board, according to internal documents and two Neuralink sources with knowledge of the committee´s operations. This dynamic discourages those members from dissenting in board matters, one of the sources said.Neuralink never disclosed other IACUC members´ close connections to Sorrells to USDA inspectors during an inspection in January that was prompted by the December Reuters report and related scrutiny from U.S. Congress members, according to a federal official with knowledge of the agency´s dealings with Neuralink. Inspectors likely would have examined the potential conflicts more closely if those connections were disclosed, the official said.(Reporting by Rachael Levy and Marisa Taylor; editing by Michele Gershberg and Brian Thevenot)"
    ]
}