{
    "articleURL": "/wires/pa/article-12048789/Local-elections-marked-dark-day-British-democracy-people-unable-vote.html",
    "content": [
        "The local elections have marked a “dark day for British democracy”, campaigners have said as the Electoral Commission acknowledged some people were “regrettably” unable to cast their ballot as a result of the voter ID requirement.",
        "On Thursday, voters across England took to the polls to have their say about who runs their local communities and for the first time, it has been compulsory to show photo identification when voting.The requirement has been controversial, with critics of the move arguing it would deter young people and ethnic minorities from voting.",
        "Shortly after the polls closed, a spokesperson for the Commission said “our initial assessment is that overall, the elections were well run”.However, the spokesperson added: “We already know from our research that the ID requirement posed a greater challenge for some groups in society, and that some people were regrettably unable to vote today as a result.”The Commission is the independent body which oversees elections and regulates political finance in the UK.Tom Brake of Unlock Democracy, who is leading a coalition of groups including the Electoral Reform Society, Fair Vote UK and open Britain against the imposition of Voter ID, said: “Today has been a dark day for British democracy. Reports from all over the country confirm our very worst fears of the impact of the disastrous policy which has been made worse by the shambolic way it has been introduced.“One voter turned away is one too many, but early estimates point to many thousands of people being turned away and denied their right to vote.”",
        "The change was piloted regionally before the national roll-out for Thursday’s elections and it will come into force for UK general elections from October. One voter turned away is one too many, but early estimates point to many thousands of people being turned away and denied their right to vote.  Tom Brake of Unlock Democracy  The policy is opposed by Labour, the Liberal Democrats and the Green Party whereas the Government argues the change is required to reduce electoral fraud.Voters in Northern Ireland are already required to present photo ID at elections.The spokesman for the Commission said: “These were the first set of polls to take place since the voter ID requirement came into force. Our initial assessment is that overall, the elections were well run.“Across the country, votes were cast throughout the day and in line with the law. This is in large part thanks to the dedication of electoral administrators, who have worked hard to prepare for today and for the implementation of this new measure.“Confidence in the overall picture, however, should not overlook other impacts which can only be revealed through detailed data collection and analysis over the coming weeks.“We already know from our research that the ID requirement posed a greater challenge for some groups in society, and that some people were regrettably unable to vote today as a result.",
        "“It will be essential to understand the extent of this impact, and the reasons behind it, before a final view can be taken on how the policy has worked in practice and what can be learnt for future elections.”The Commission expects to publish its initial analysis of the implementation of voter ID in June, subject to data being available.",
        "James Toft, 41, who was unable to vote in Chesterfield on Thursday morning as he had forgotten his photo ID, described the requirement as “silly”.Mr Toft believes the new rules could be detrimental to people voting, telling the PA news agency: “They’ll take a look at what you need to do and just not bother voting, especially the younger ones, what about the less well off who can’t afford a passport or other forms (of identification)?”Meanwhile, Gillian Long, 42, said ID requirements are “a load of rubbish” after she was stopped from voting by an administration error between her ID and the registration system in East Riding, Yorkshire.Ms Long told PA: “Luckily I was quite determined to vote, so I decided to question it. I called my other half to warn him before he goes to vote this evening that our address is wrong, and he said he’s not going to bother voting.”",
        "She added: “If you want people to vote, you should make it as easy as possible, and they’ve added a barrier.”"
    ]
}