{
    "articleURL": "/wires/reuters/article-12051571/US-FDA-staff-raises-concerns-OTC-use-Perrigos-birth-control-pill.html",
    "content": [
        "May 5 (Reuters) - The U.S. health regulator's reviewers on Friday raised concerns around allowing Perrigo Co's birth control drug over the counter, saying switching to non-prescription sale could lead to inappropriate usage by consumers.",
        "Perrigo's Opill, which is currently approved for prescription use, would be the first OTC non-estrogen contraceptive pill in the United States if approved.Contraceptives have been in focus since the U.S. Supreme Court last year overturned the constitutional right to terminate pregnancies as it scrapped a landmark ruling in the 1973 Roe vs. Wade case.The review by the U.S. Food and Drug Administration staff on Friday comes ahead of an advisers' meeting next week, where the panel members will decide on recommending Opill as a daily OTC birth control pill.While the FDA noted that availability of a non-prescription daily oral contraceptive may reduce barriers for women in obtaining effective methods of contraception, the reviewers added that safety and effectiveness of such pills would be contingent on how consumers can appropriately use them.It is vital for consumers to appropriately decide when not to use the drug because it has risks that are different from those associated with currently available non-prescription contraceptive methods, the FDA said in its briefing documents.The reviewers cited risks of breast cancer or other progestin-sensitive cancers and vaginal bleeding without any known causes, among others.They also raised concerns about the potentially diminished efficacy of the pill in individuals who are overweight or obese - a group that represents about 60% of the total U.S. reproductive-aged population.",
        "FDA even highlighted that one of the company's studies was not appropriately designed to assess whether delaying the intake of the pill could affect its contraceptive efficacy.Shares of the company were down nearly 2% after the briefing documents were released.(Reporting by Leroy Leo in Bengaluru; Editing by Shounak Dasgupta and Shinjini Ganguli)"
    ]
}