{
    "articleURL": "/tvshowbiz/article-12042621/Danielle-Fogarty-showcases-blossoming-baby-bump-gives-fans-update-32-weeks-pregnant.html",
    "content": [
        "Danielle Fogarty showcased her blossoming baby bump on Wednesday as she gave fans an update at 32 weeks pregnant.",
        "The television personality, 31, is currently expecting her second child with husband Ross Worswick.And taking to Instagram, Danielle posed in the mirror as she snapped a selfie with her bump on full show.The star - who revealed last week that she is having a baby boy - looked radiant in the snap as she relaxed at home in a white YSL t-shirt and black tracksuit trousers.Lifting her top up, Danielle revealed her growing bump.",
        "The daughter of Superbike racer Carl Fogarty, looked gorgeous for the day at home, rocking a variety of gold jewellery and a gold watch.She styled her blonde tresses straight and opted for a subtle palette of make up.Sharing the update with fans, she penned: 'WEEK 32... Felt so so tired this week'.Danielle recently returned from Dubai where she enjoyed a babymoon.She revealed only last week that the bump is barely visible from the front but can be spotted from the side.She complemented her look with a pair of dark sunglasses and wore her blonde locks in loose waves. The stunning star looked glowing as she posed for the sun-soaked photos. It comes after Danielle announced the gender of her second child in a sweet reveal on last week.",
        "The beauty dressed in a gorgeous blue dress to tell fans she was having a boy.",
        "Danielle, who posed for stunning snaps on the beach, penned on Instagram: 'The clue is the blue!'The sheer maxi number revealed her matching blue bikini underneath and was teamed with statement gold necklaces.She wore her blonde tresses in loose waves over her shoulder and opted for a glowing makeup look. The couple are already parents to 20-month-old son Mason who is soon to become a big brother.It comes after Danielle showed off her blossoming baby bump as she marked reaching the seventh month of her pregnancy. ",
        "The beauty looked radiant as she posed for a snap in a black bikini while enjoying her babymoon.Danielle announced the happy news that she was expecting her second baby with a sweet video shared on Instagram in February.Their announcement came after her younger sister Claudia, 28, arrived as a bombshell in the villa during the current series of Love Island.The couple, who are already parents to son Mason revealed they were set to become a family of four as they shared the news with fans.Danielle wrote on her page: '&amp; then there were 4 #halfway.'"
    ]
}