{
    "articleURL": "/wires/reuters/article-12038489/Famine-stalks-Somalia.html",
    "content": [
        "Official famine in Somalia averted in 2022, but still possible",
        "Rains expected to be below average in 2023Reduced aid from donors adds to pressureBy Ayenat MersieDOLLOW, Somalia May 2 (Reuters) - New patches of young, bright green growth dot the sandy terrain of Dollow but for the 150,000 Somalis who have left home to seek help in this southern town, the small recent rains are not enough.East Africa's worst drought in 40 years has forced millions of Somalis to leave their homes. Five consecutive failed rainy seasons pushed the fragile nation to the brink of famine, and this year is unlikely to be much different.\"We are malnourished, the land is dry, I can't afford to go back,\" said Khadijo Mohamed Omar from outside her dome-shaped home made of sticks and orange fabric.The 35-year-old farmer made the week-long trek late last year after two of her children died from malnutrition. She gave birth to a seventh child about two months after she arrived at the ever-growing U.N.-supported camp in Dollow.The tiny baby lived for just eight days.Somalia managed to avert an official famine declaration last year thanks to a massive influx of humanitarian aid, but tragedies like Omar's persist.Even without the famine declaration, there were 43,000 excess deaths in Somalia in 2022 linked to the drought, researchers found. Half were among children under five.",
        "'KEEP FAMINE AT BAY'\"We're not out of the woods with regards to famine. We were able to keep it at bay last year. But we need to apply more, do more here to help keep famine at bay,\" Cindy McCain said in her first humanitarian trip as executive director of the World Food Programme (WFP).Humanitarian organisations like the WFP were likely to have less funding generally this year as donor budgets get squeezed, McCain said over the cries of babies at a centre for malnourished children in Dollow.Despite the reduced funding, the challenges Somalis grapple with will be much the same.Forecasts from the Intergovernmental Authority on Development (IGAD) show that there is a 50% likelihood that rainfall this season will be below average.In Dollow, maize prices jumped about 23% year-on-year, according to April data from the World Bank.The U.N. has appealed for $2.6 billion to help 7.6 million Somalis in 2023 - but only $609 million has been raised so far.The global economic downturn, lingering impacts of the pandemic and the number of global crises, including the Russia-Ukraine war, are expected to reduce aid budgets. (Reporting by Ayenat Mersie; Editing by Andrew Cawthorne)"
    ]
}