{
    "articleURL": "/wires/aap/article-12058447/Fadden-election-big-test-Liberals.html",
    "content": [
        "The coalition is likely to avoid an Aston-style wipeout when Fadden voters go to the polls at the upcoming by-election, but important tests still loom for Peter Dutton's leadership.",
        "The impending resignation of coalition MP Stuart Robert will result in voters going back to the ballot box for the second time in the space of a year in the Gold Coast electorate.While the LNP won the seat comfortably at last year's federal election with a margin of 10.6 per cent, the coalition suffered a more than three per cent swing against it.Mr Robert has not formally resigned from federal parliament, but announced on Saturday he would soon step down from his role as an MP, which will trigger a by-election.Associate professor in politics at Griffith University Paul Williams said while Gold Coast seats were safe bets for the coalition, the opposition leader would face challenges.\"Peter Dutton's leadership is not travelling well in middle Australia, (but) the Gold Coast is different because it's LNP heartland,\" he told AAP.\"The important story is whether Labor gets a swing to them. Labor doesn't need to win to have a moral victory.\"Nominations have opened for LNP preselection, with Gold Coast businesswoman Fran Ward considered the frontrunner.Labor has yet to announce whether its candidate at the last election, Letitia Del Fabbro, will run again, or if the party will seek a new person.The Fadden poll will be the second by-election this year, after the government made history in the Melbourne seat of Aston.",
        "It was the first time in more than 100 years a government had won a seat off the opposition at a by-election, with Labor recording a more than six per cent swing.Prof Williams said the result was unlikely to be replicated in Fadden, but the prime minister's personal popularity would be a factor.\"The Albanese government is still in its honeymoon, it's an unusually long honeymoon, and we've seen that borne out in Aston,\" he said\"Anthony Albanese has improved his personal approval in Queensland ... his profile and approval has grown since (the federal election) and that's problematic for the LNP.\"Prof Williams said Mr Robert's decision to retire early in his term may work against the coalition.He said it was critical for the LNP to preselect a female candidate to boost the party's electoral appeal.\"The LNP needs to run a woman candidate to rebuild its relation with women across Australia, and a candidate who is conservative on fiscal policy but progressive on social policy,\" Prof Williams said.\"A Liberal candidate fighting a culture war will fall flat.\""
    ]
}