{
    "articleURL": "/femail/article-12056423/This-Kate-Middleton-wore-Big-Lunch-Windsor-Prince-William.html",
    "content": [
        "The Prince and Princess of Wales arrived in Windsor today to greet well-wishersThey were attending a Big Coronation Lunch gathering near to the royal castle Read more: William and Kate surprise fans queueing for Coronation concertThe Princess of Wales opted for an understated look in a powder blue linen blazer as she surprised royal fans at a Big Lunch gathering in Windsor today.",
        "Her casual ensemble was a world away from her appearance at the coronation of King Charles and Queen Camilla yesterday, when she turned heads in an ivory silk crepe gown by Alexander McQueen.Kate, 41, had matched her daughter Charlotte, eight, who wore a lookalike McQueen gown and a gorgeous, botanical Jess Collett x Alexander McQueen headpiece.Today, she toned down the glamour and was back to her typically chic self.The mother-of-three opted for a £298 linen blazer by Reiss and black trousers as she greeted well-wishers who had gathered outside Windsor Castle to celebrate the coronation.",
        "She completed her casual outfit with a plain white T-shirt and white and gold trainers.However, Kate did add a glimpse of sparkle to her toned-down look, wearing a pair of £425 pearl drop earrings by Annoushka Ducas.She was joined by Prince William for the outing, who dressed as he typically does in a dark suit - this time with a light blue shirt.The pair were attending a Big Lunch in Windsor - while similar events are being held across the country to celebrate the coronation of King Charles. In one sweet moment, Kate stopped to hug a young girl who was waiting in the crowd. ",
        "Kate's appearance at the coronation yesterday stole the show as she appeared with her lookalike daughter Princess Charlotte, who donned a matching McQueen gown.",
        "Both gowns were embellished with ivory stitch embroidery featuring rose, thistle, daffodil and shamrock motifs, to signify the four nations.The pair completed their ensembles with white shoes and swept their locks back into a chic up-do for the historical occasion.The Princess' has long chosen to wear Alexander McQueen for significant moments in her life.",
        "She has worn the fashion brand on numerous occasions, most notably choosing its creative director Sarah Burton to design her wedding dress.Kate donned pearl earrings that were gifted to Diana before her wedding to Prince Charles in 1981.The mother-of-three previously wore the jewellery, left to William and Harry, at the BAFTAs in 2019. They feature a double curve of various cuts of diamond, with a hanging pearl.",
        "During the ceremony Charlotte was seen sitting alongside her little brother Prince Louis in Westminster Abbey after they arrived alongside the Prince and Princess of Wales.The siblings arrived without their older brother Prince George, nine, who was a Page of Honour for his grandfather. The Prince and Princess of Wales' two youngest children were immaculately behaved during the service, with Charlotte proving a reassuring presence to her younger brother, who couldn't help stifle a few yawns during the two-hour proceedings."
    ]
}