{
    "articleURL": "/wires/ap/article-12056443/Black-voters-backing-Biden-not-2020-enthusiasm.html",
    "content": [
        "COLUMBIA, S.C. (AP) - LaJoia Broughton, a 41-year-old small-business owner, considers herself a fan of President Joe Biden.",
        "He´s provided opportunities for Black-owned business while bringing integrity to the White House, she said. Her decision for 2024 is not in doubt.\"Biden has proven himself in the last few years, and I´ll be voting for him in the next election,\" said Broughton, who owns a lobbying and public affairs firm in Columbia, South Carolina´s capital city.Destiny Humphreys is less enthusiastic. The 22-year-old senior at South Carolina State University, the state´s only public historically Black college or university, or HBCU, said she´s disappointed in the president, feeling his accomplishments have so far not lived up to his promises.\"Honestly, I feel like right now America is in a state of emergency. We need some real change,\" said Humphreys, who remains unsure about her vote in next year´s election.After a dismal start to his 2020 presidential campaign, Black voters in South Carolina rallied behind Biden, reviving his White House ambitions by driving his Democratic rivals from the race and ultimately putting him on a path to defeating then-President Donald Trump. But at the outset of Biden's reelection bid, the conflicting views among the same voters provide an early warning sign of the challenges he faces as he aims to revive the diverse coalition that proved so crucial to him before.",
        "Black voters formed the heart of Biden's base of support and any dip in support could prove consequential in some of the most fiercely competitive states, such as Georgia, Michigan and Wisconsin. Well aware of the challenge, the Biden campaign says it´s confident in its message and is planning to highlight how the president has prioritized issues that are important to Black Americans.\"The progress made in the first two years -- whether it´s the historically low black unemployment rate, unprecedented funding to HBCUs, or halving the black poverty rate in half -- is all at stake in 2024,\" campaign spokesman Kevin Munoz said in an emailed statement. \"The campaign will work hard to earn every vote, and expand on its winning 2020 coalition.\"Yet there are some early signs that Biden will have work to do to generate enthusiasm among Black voters for another run.Biden´s approval rating among Black adults has fluctuated over his two years in office. As with most demographic groups, the latest Associated Press-NORC Center for Public Affairs Research poll finds his 58% current approval rating among Black adults sitting well below where he began. Roughly 9 in 10 Black adults approved of Biden over his first months in office.While only about half of Democrats overall say they want Biden to run again in 2024, 81% say they would definitely or probably support him if he were the nominee. The groundswell isn´t as stark among Black adults: 41% say they want him to run and only 55% say they are likely to support him in the general election.",
        "APVoteCast, an extensive national survey of the electorate, also found that support for Republican candidates ticked up slightly among Black voters during last year´s elections, even though those voters overwhelmingly supported Democrats.South Carolina provides an early barometer on how Black voters are viewing Biden shortly after his quiet campaign launch, via a video message late last month.After his 2020 campaign was rescued, Biden rewarded the Black voters who are decisive in South Carolina Democratic politics by moving the state to the head of the party´s nominating schedule next year. He also followed through with his campaign pledge to appoint the first Black woman to the Supreme Court.But interviews two years into his presidency with more than a dozen Black voters representing a variety of ages and backgrounds reveal mixed views, especially between older and younger voters.Many younger voters said they aren´t convinced that Biden has delivered on their most important priorities.\"He wouldn´t have been president without us,\" said Courtney McClain, a 22-year-old recent graduate of the University of South Carolina, who voted for Biden in 2020, her first presidential election.Getting her loans forgiven, both for her bachelor´s degree and a planned master´s program, is a top priority for her. She applauds Biden´s attempt at a college loan forgiveness program, but is frustrated that the plan is now in doubt after it was challenged in the courts by Republicans.",
        "\"So, I definitely think moving forward, if he wants to promise something as large as that, I think he should put the steps in place to make sure that he´s able to go through with that before he just says it out loud,\" McClain said.Biden´s plan, announced last August, would have erased $10,000 in federal student loan debt for those with incomes below $125,000 a year, or households earning less than $250,000, and canceled an additional $10,000 for those who received federal Pell Grants. Its fate is uncertain after the Supreme Court last December said it would deliberate over the program´s future.Many younger voters also cited the economy, especially lowering inflation, as a top priority. Several noted a lack of enthusiasm among their peers for a second Biden run, even while acknowledging they didn´t see a realistic alternative. But they wondered how lackluster support might affect turnout next year.\"For people to vote, and to be eager to vote, you have to actually want to vote for the person,\" said Ace Conyers, a 22-year-old at South Carolina State.Bailey Scott, a junior at the school, said she´s not excited about voting in the 2024 presidential election because people she would like to see in office won´t be running.\"\"So I´m just going to have to pick the lesser evil,\" she said. \"And as of right now, that does seem like Joe Biden and Kamala Harris.\"",
        "Of course, many Black voters, especially those in the middle of their careers and beyond, said they already are looking forward to supporting Biden, who they say has a long history of advocating for the Black community. Laddie Howard, who owns a business making handcrafted leather goods in Sumter, just west of Columbia, said he would like to see other candidates enter the race but knows that´s not realistic.\"It´s going to be a battle of Biden against whoever emerges from the other side, and everything is so extreme on the other side that, you know, I can´t see many options besides Biden at this point,\" said Howard, 52.Tony Kinard, a Biden supporter, said the president has plenty of legislative wins to promote, including the Inflation Reduction Act, the roughly $740 billion program to promote clean energy, reduce prescription drug costs, shore up the health insurance marketplace and tax large corporations.He would like to see action on gun control, especially as it edges closer to his home about an hour´s drive south of Columbia in rural Bamberg, where he runs Dot´s Flower Shop.\"I don´t like the idea of everybody being able to carry a firearm because we´re having too many young people dying behind that,\" he said.With divided government in Washington, additional action on access to firearms is unlikely. Still, the 67-year-old said it´s clear which candidate will best support the needs of Black voters in 2024.",
        "\"I´m going to vote for Biden,\" he said. \"We need to remember that, you know, the same where we got him in there before, we have to do the same thing by voting.\" ___Associated Press writer Hannah Fingerhut in Washington contributed to this report.___Associated Press coverage of race and voting receives support from the Jonathan Logan Family Foundation. The AP is solely responsible for all content."
    ]
}