{
    "articleURL": "/news/article-12039329/Woman-ambushed-fatally-stabbed-walked-home-buying-birthday-gifts-mother.html",
    "content": [
        "Her grandmother heard her screaming down the phone during Monday’s attack The 31-year-old killed yards from police station near Brixton’s O2 venue, LondonA 33-year-old man not thought to have been known to her has been arrestedA woman was stabbed to death just yards from a police station while phoning her grandmother.",
        "The 31-year-old had been walking home from buying birthday gifts for her mother when she was ambushed.Her grandmother heard her screaming down the phone during Monday’s attack near Brixton’s O2 venue in south London.A 33-year-old man who is not thought to have been known to her was arrested yesterday and was last night being quizzed by detectives. Neighbours said the victim lived with her parents, brother and sister and worked from home. Jacqueline Demontague said she saw the woman’s distraught father rushing to the scene shortly after 4pm following a phone call from the grandmother.",
        "She said: ‘She was on the phone to her grandmother and suddenly she began shouting and screaming. 'I cannot imagine how awful it must have been for both her and her grandmother. The grandmother phoned the woman’s father, who came straight out to the scene.‘He was in a state of shock, of course. He couldn’t believe what had happened. Lots of other family members came out too – they were beside themselves.‘It had been her mother’s birthday and she went out to pick up some birthday things and was on her way back from the shop when she was attacked from behind.’Ms Demontague said a witness claimed the knifeman was all in black.",
        "‘I’m not sure what it was for, for a mobile phone, a mugging or what. But what a tragedy, a waste of a young life,’ she added.Another neighbour said residents had been desperately calling for more police because of anti-social behaviour and drug use. Despite Brixton police station being close by, he said there were few patrols.",
        "‘In one residents’ meeting with police someone stood up and said it would take a violent rape or murder to happen before they did something,’ he added.‘And look where we are now. A young girl has lost her life in broad daylight.’Scotland Yard confirmed the victim died at 4.42pm on Monday.Detective Chief Superintendent Seb Adjei-Addoh, policing commander for Lambeth, said: ‘This is a shocking attack and my thoughts are with the woman’s family and friends.’The latest tragedy has triggered fresh calls for police to ramp up efforts to do more to protect women from violence in the capital. Florence Eshalomi, Labour MP for Vauxhall, branded the killing a 'senseless' act of violence but urged people not to become 'desensitised to violence against women and girls'. 'It is a big issue and I think one of the things we need to look at is the vicious nature and randomness of this attack,' she told ITV. ",
        "'But equally, we do know that there is a history with knife attacks - especially knife attacks when fatal.'One of the things we need to do is make sure we have got good, local police who are visible, working with the community and that's something we are trying to do locally here.' "
    ]
}