{
    "articleURL": "/wires/ap/article-12049135/U-S-splits-China-1st-day-International-Crown.html",
    "content": [
        "SAN FRANCISCO (AP) - World No. 1 Nelly Korda and Lilia Vu rallied on the back nine to help the United States earn a split of its first two matches against China on Thursday at the International Crown team event.",
        "\"It was pretty much a grind, but then we kind of ran away with it toward the end,\" Korda said.Korda and Vu trailed Ruoning Yin and Xiyu Lin by one at the turn before winning three straight holes on the back nine thanks to birdies by Vu on the 13th and 15th holes. Korda and Vu won the match 2 and 1.Lexi Thompson and Danielle Kang lost the other match for the U.S. 1 up to Ruixin Liu and Yu Liu.Sweden won both matches against England in the other Pool A showdown as the golfers took advantage of a course softened by rain earlier in the week. In Pool B, Australia surprised defending-champion South Korea by winning both matches, and Thailand swept Japan.The International Crown is a match-play tournament featuring teams of four golfers from eight countries with the United States team seeded No. 1 overall and South Korea second.",
        "The teams are divided into two pools of four countries with the top two from each group after three days of round-robin play of four-ball competition advancing to the semifinals on Sunday. Teams get one point for each win and a half for a tied match.The 20-year-old Yin wore No. 30 in honor of Golden State Warriors star Stephen Curry and planned to go watch Curry in the NBA playoffs against the Los Angeles Lakers as soon as she finished on the course.",
        "She gave her team a 1-up lead at the turn with a birdie on the ninth hole before the American duo took over on the back nine.\"I felt like we were struggling off the tee a little bit, but we were still getting chances for birdies, they just weren´t falling,\" Vu said. \"Then once 13 came along we built a lot of momentum and just kept going.\"Thompson and Kang erased an early two-hole deficit with birdies by Kang on the eighth and 10th holes before Liu's birdie on the 12th gave China the lead. Thompson had a few chances to get that back but was unable to make key putt down the stretch.The surprise of the day came from Australia, which hadn't finished better than sixth in the first three editions of this event.Green followed up last week's tour win in Los Angeles by teaming with Sarah Kemp to beat Hyo Joo Kim and Jin Young Ko 2 and 1. Minjee Lee and Steph Kyriacou beat Hye-Jin Choi and In Gee Chun 2 up.\"I´m not surprised that this happened,\" Kemp said. \"We had a great time last night. We´ve had a great week. We´re just all having a good time and it´s just - it doesn´t surprise me that we did what we did today. ... But for my first day of my first International Crown to start like this is pretty awesome.\"",
        "Fifth-seeded Sweden got off to a fast start in Pool A with Anna Nordqvist and Caroline Hedwall beating Bronte Law and Jodi Ewart Shadoff 4 and 3, and Madeline Sagstrom and Maja Stark beating Liz Young and Alice Hewson 5 and 4.Hewson and Young were late replacements for England after Georgia Hall and Charley Hull pulled out late Sunday night.Sixth-seeded Thailand swept both matches from No. 3 seed Japan with sisters Moriya and Ariya Jutanugarn beating Nasa Hataoka and Hinako Shibuno 2 up, and Patty Tavatanakit and Atthaya Thitikul beating Yuka Saso and Ayaka Furue 1 up.This is the fourth time this tournament has been held after being canceled in 2020 because of the COVID pandemic. Spain won the inaugural tournament in 2014, followed by the United States in 2016 and South Korea in 2018.This is the first professional women´s event to be played at the storied Harding Park, which has hosted several major events for the men, including the 2009 Presidents Cup and the 2020 PGA Championship.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}