{
    "articleURL": "/news/article-12046969/Left-wing-MPs-rail-grotesque-costs-King-Charless-coronation.html",
    "content": [
        "Left-wingers have been making their feelings known about the coronation as the rest of the nation prepares to celebrate.",
        "Labour and SNP MPs have condemned the pomp and ceremony planned for Saturday as 'grotesque' and a 'pantomime' amid the cost-of-living crisis.Republicans are also promising to stage protests on the monarch's route, chanting 'not my King'.Ministers have insisted that the King and the Government are 'mindful of ensuring that there is value for the taxpayer' and there will not be 'lavishness or excess'.There are estimates that so-called 'Operation Golden Orb' – the crowning of Charles III and the Queen Consort – could cost between £50-100million. Labour backbencher Clive Lewis put out a slick video yesterday mocking the idea that the monarchy is 'social glue' and questioning why public money is being spent when three million children face 'abject poverty'.",
        "Delivering a monologue outside the gates to Buckingham Palace, interspersed with footage of impoverished families, the Norwich South MP said: 'Our monarchy isn't a social glue. Rather it is a gilded veneer that makes grotesque disparities of wealth and power seem normal.'Just like the story of the Emperor's New Clothes, when you watch the golden carriage, the pomp and the splendour, see it for what it is.'Or rather what it isn't. Ask yourself, can you really afford not to care.'Appearing on ITV's Peston programme last night, SNP MP Mhairi Black stressed that her party's 'formal position' was that the King would remain head of an independent Scotland.",
        "But she added: 'Me personally, no I am not a fan of the monarchy. I think in the middle of a cost of living crisis the money could be much better spent than on what looks like a pantomime.'Labour's Richard Burgon, MP for Leeds East, recently cited Guardian claims about the King's wealth - which are disputed - and demanded a Commons debate on the coronation costs.'The King has a reported personal fortune of £1.8billion, and given the monarch already benefits from not paying inheritance tax, it's easy to see why so many people are not happy with this,' he said.The late Elizabeth II's coronation cost £912,000 in 1953 – £20.5 million in today's money – while Charles's grandfather George VI was crowned at a cost of £454,000 in 1937 – worth £24.8 million in 2023 and the most expensive coronation of the last 300 years.As with Jubilees and other such events, it is understood the total cost and breakdown of funding will not be available until after the May 6 event.Chancellor of the Duchy of Lancaster Oliver Dowden said money would be spent wisely, but he dismissed the idea there should be 'dour scrimping and saving'.Ge told the Commons Public Administration and Constitutional Affairs Committee at the start of the year: 'It is a marvellous moment in our history and people would not want a dour scrimping and scraping.'",
        "George IV's coronation in 1821 was a great theatrical spectacle and the former Prince Regent, known for his extravagance, spent vast sums of money on it – £238,000 – or £20.9 million in today's money.His successor, William IV, had to be persuaded to have a coronation at all in 1831 and spent so little money that it became known as 'the Penny Coronation' – with the bill coming to around £43,000 – worth £3.6 million today.",
        "It did establish much of the format that remains for British coronations today with a procession in the Gold State Coach to the Abbey, but he refused to have a coronation banquet as he considered it too expensive.Queen Victoria's coronation festivities in 1838 were a much grander affair than her uncle's, with three state balls, two court receptions, a drawing room and state concert, and a public procession to the Abbey.Parliament spent around £69,000 – £6.2million in today's money – on the 19-year-old's celebrations.Socialist MP Keir Hardie – the first leader of the Labour Party in the UK parliament – condemned George V's 1911 coronation, which cost £185,000 or £17.4 million today, as 'an orgy for the display of wealth and senseless spending'."
    ]
}