{
    "articleURL": "/tvshowbiz/adam-collard/article-12040985/EXC-Adam-Collard-details-mental-health-struggles-takes-threesome-like-no-other.html",
    "content": [
        "The Love Island star, 27, will be racing a trio of IRONMAN triathlons to help raise funds for Marie CurieAdam Collard candidly opened up about his mental health struggles and the real reason why he's been a 'd**k' in a new interview with MailOnline.",
        "The Love Island star, 27, discussed 'not acknowledging' the death of his grandmother due to being 'too immature' after leaving the ITV2 show in 2018. He is now taking on a trio of IRONMAN triathlons to help raise funds for Marie Curie - a charity close to his heart. In an exclusive interview, Adam explained: 'When I was younger I didn't really understand mental health, but as I've got older and especially after the second Love Island I thought I'm definitely not as ok as I normally am. 'I started running to get some head space and alone time. Running turned into my sanctuary.'",
        "Adam continued: 'She passed away the year I came off Love Island the first time, I didn't have the time to process it.'This is the first time I've processed it as I kind of didn't acknowledge it. The first time I got upset about it was 2022 when I was on a run and opening up to myself and that's how this whole thing spiralled into my doing this crazy challenge.''It sounds really bad but because I was so busy and only 21 and probably a bit of a d**k to be honest and immature, I was distracted in the best way possible because I had to focus on myself. ",
        "'Now that I am older and have the chance to reflect more, getting older and maybe settling down, she's not going to see the things that you want her to.'Gushing over his late grandmother, he said: 'She was absolutely amazing, I was the closest with her. She was the glue that kept everyone together. 'If she was sick she would pretend she was fine and be the life and soul of the party. It's the only person I've lost close to me, I'm probably quite lucky in that way. I went in to Marie Curie last week and it is sentimental, as soon as I got their I remembered her room.'Adam is now embarking on the biggest challenge of his career, in a move that will see him give up on reality TV. The fitness enthusiast, who is currently single, previously appeared on Love Island not once, but twice, as he became the first former Islander to return as a bombshell during last year's series. ",
        "He admitted: 'I'm not going to lie, I think I've well and truly done my time on reality TV, not sure I would do it anymore.'The star is set to take on three gruelling IRONMAN events in five weeks over the summer, which he described as 'a threesome like no other'.",
        "An IRONMAN triathlon is often deemed as one of the toughest endurance events out there, and consists of a 3.8km swim, 180.2km bike and 42.2km. The IRONMAN 70.3 events follow the same format but half the distance in each discipline.Adam explained: 'I want to do it for something bigger than me, and that's to raise funds for Marie Curie's hospices who took exceptional care of my grandmother when she was in the final few months of her life.'I'll be using IRONMAN 70.3 Staffordshire as preparation for IRONMAN UK, to help practice my nutrition and get used to the race atmosphere. IRONMAN UK will be the ultimate test, and IRONMAN 70.3 Swansea just two weeks after will complete what will my toughest challenge yet.'Adam revealed he fell into his current career and was originally studying for something completely different.He said: 'I wanted to be an Architect believe it or not. The goal was always to get good grades but I ended up doing personal training by accident. That's why I love it and never feel like I'm at work.'Despite being in his best shape as he trains for his challenge, fitness expert Adam admitted he has received negative comments on his appearance. ",
        "Speaking about online hate, Adam said: 'The one thing that got to me was I got a few comments about being out of shape 6 months after appearing on Love Island compared to when I was on the show and it did bother me. ",
        "'I was doing night club appearances, of course that was going to happen, I was living out of service stations.'I'd say like 1 out of 100 bothers us and it will be really specific, like if someone says something about my family.'Adam also revealed he's opening a new gym in Ashington, Newcastle to help more people in his local community get into health and fitness.To find out more, and register to one of UK &amp; Ireland’s IRONMAN and IRONMAN 70.3 events, visit: https://www.ironman.com/races "
    ]
}