{
    "articleURL": "/sport/football/article-12060531/THE-NOTEBOOK-Roberto-Zerbi-rings-four-changes-half-time-stop-Everton-tide.html",
    "content": [
        "Boss Roberto De Zerbi made four changes at half-time to try and turn the tide The Toffees fans were loud - and rewarded with their earliest goal since 2017 Everton won 5-1 away at Brighton to step up their bid for Premier League safety Everton took a huge step towards Premier League safety with a 5-1 win over Brighton on Monday evening.",
        "The Toffees started off in a rampant style, with Abdoulaye Doucoure scoring twice before Jason Steele's own goal made it 3-0 at the break.Dwight McNeil got two more in the second half at the Amex, while Alexis Mac Allister's goal ten minutes before time was just a consolation for the Seagulls.The win lifts Sean Dyche's side out of the relegation places, and dents Brighton's ambitions of a European place.Here, Mail Sport's Kieran Gill talks about some of the more unusual talking points from Brighton's thumping defeat to Everton. ",
        "Roberto De Zerbi is not messing around No messing around from Roberto De Zerbi. Trailing 3-0 at half time, the Brighton boss made four – yes, four – substitutions as Evan Ferguson, Julio Enciso, Solly March and Levi Colwill were all introduced. The lethargy from Brighton in the first half was enough to make you wonder how much that midweek 1-0 win over Manchester United took out of them. They could not handle Everton’s energy and their passing was unusually poor. Brighton lost possession 74 times, making this their sloppiest first half of 2023 when you thought the slick surface from the South Coast downpour would suit their neat style of play. Whenever they lost the ball, Everton broke forward in numbers and were a constant threat, thanks to a game plan executed perfectly.",
        "Everton fans do their best to drown out 'God Save The King'Everton’s travelling support did their best to drown out ‘God Save The King' by singing their own anthem, the renowned terrace chant Spirit of the Blues. The dissent was to be expected after the shouting and whistling from Liverpool supporters at Anfield on Saturday.The Amex Stadium’s away end was in tremendous voice throughout, especially as the visiting team defended their lead for their lives in the second half before scoring twice from breakaways to make this a five-star win. ",
        "An unwanted new record for Brighton Abdoulaye Doucoure’s goal after 34 seconds was the earliest Premier League goal ever conceded by Brighton. It was also the quickest that Everton have scored since April 2017 (30 seconds against Leicester). Top four could hand Brighton owner Tony Bloom UEFA headache If you want to give yourself a headache, try wrapping your head around how the Belgian First Division works. Union Saint-Gilloise – the other club owned by Brighton’s Tony Bloom – finished second in the regular season. But USG are now in a mini-tournament with their fellow top-four teams. Each clubs’ points total is halved and they face each other to decide who enters the Champions League, Europa League and Europa Conference League. ",
        "It could be problematic, should Brighton and USG qualify for the same competition, as UEFA prohibit clubs owned by the same person from competing against each other. Yet there are ways to circumvent these rules – just look at the Red Bull outfits. ",
        "Tough day in the office for Kaoru Mitoma Kaoru Mitoma has been sensational this season, emerging from obscurity to dazzle us all with his degree in dribbling. Yet Brighton’s left winger had little joy here, with Everton’s right back Nathan Patterson and right winger Alex Iwobi often doubling up on him. James Maddison save from suspension blowThere was confusion here as the Everton contingent thought James Maddison’s 10th yellow card of the season meant he was now banned for Leicester's next two games, boosting their own survival chances. That is not the case, however. It only applies if players pick up 10 cautions in Premier League matches up to and including their team's 32nd fixture, which Leicester have already passed. Sorry, Everton, you won’t get any extra help from suspensions! "
    ]
}