{
    "articleURL": "/tvshowbiz/article-12038495/Jeremy-Renner-says-daughter-Ava-inspires-better-final-episode-Rennervations.html",
    "content": [
        "Jeremy Renner's family has always been the most important thing to him, especially his daughter Ava.",
        "The Avengers star, 52, who has shared some of the inspiring notes he has received from Ava as he recovers from a near-fatal accident, opened up about his love for her in the fourth and final episode of Rennervations which was filmed before his near-fatal snow plow accident.'The most important person in my life is my daughter,'  the proud dad shared in an exclusive clip provided to People. He shares Ava with his ex-wife, Sonni Pacheco, 32. 'She makes me the best version of me,' he continued. 'She inspires me to be better.'The two-time Oscar nominee and his crew had traveled to India for the segment that debuts Wednesday May 3.",
        "Their mission was to turn a delivery truck into a mobile water treatment facility for Uva Jagriti Sansthan, a nonprofit organization working to deliver clean, drinkable water to communities across the country.'My time in India was an experience I’ll never forget,' the handyman shared on Instagram next to a clip from the show. The actor's Mission: Impossible co-star, Anil Kapoor, 66, joined the project.  While there, the Hurt Locker star and his best friend, Rory Millikin, took time out to play some cricket and hopscotch with some of the local kids.In the first three episodes of Rennervations, Jeremy and his team turned a bus into a mobile music studio, and another bus into a mobile dance studio in Los Cabos, Mexico and built a mobile recreation center in Reno, Nevada. ",
        "His fans have been eagerly awaiting the next episode. 'Finally, we have been checking every day for new episodes! You're doing great things! Keep it up!' commented one viewer.'Dude I have loved watching all of these. So great that you are making a lasting impact on these young people. Amazing work by you and your team,' wrote another.'Finally, the wait is over for Ep 4 of @rennervations,' penned one viewer who seemed to speak for many of the Arrival star's fans.",
        "'I'm so excited to see what you did to help people! Thanks for all you've done. I still pray daily for you.' Jeremy had healed enough from the New Year's Day snowplow accident that nearly claimed his life to attend the shows premiere April 11, and Ava, 10, was right by his side, along with other members of his extended family.Speaking to CNN on the red carpet, The Town star explained, 'It feels weird, wonderful, weird.''I never thought I’d have dreams as a 52-year-old man still,' he continued. 'I feel like I kind of did them. But wow, it’s nice to have things come true for yourself. There’s more wonderment still to be had, and I feel very grateful to be here to continue finding that wonderment.'"
    ]
}