{
    "articleURL": "/sport/football/article-12041235/Ex-Blues-star-Emmanuel-Petit-reveals-shocking-details-close-Chelseas-dug-out.html",
    "content": [
        "Chelsea fell to 3-1 defeat at Premier League leaders Arsenal on Tuesday nightThe Blues have now lost all six games since Frank Lampard took interim chargeEmmanuel Petit claimed he was shocked by the lack of unity within the squad Emmanuel Petit has claimed he saw players arguing on the bench during the Chelsea's 3-1 defeat against Arsenal as the former Blues star criticised the 'attitude' and 'lack of unity' among the struggling squad. ",
        "Chelsea were 3-0 down before half-time, with Noni Madueke scoring a consolation goal in the second half at the Emirates.The Blues remain 12th in the Premier League following the latest defeat despite their over £600million spend on new players this season. The result marked Chelsea's sixth consecutive loss since Frank Lampard took interim charge.Petit told Premier League Productions he was shocked by the lack of unity in the squad, claiming he saw players arguing amongst themselves on the bench.",
        "Petit, who played 76 matches for Chelsea between 2001 and 2004, insisted the club's issues stem from having too many players.",
        "Edouard MendyBenoit BadiashileJoao FelixRueben Loftus-CheekTrevor Chalobah (Replaced Fofana, 86mins)Mykhailo Mudryk (Replaced Fernandez, 71 mins)Hakim Ziyech (Replaced Madueke, 79 mins)Conor Gallagher (Replaced Sterling, 71 mins)Kai Havertz (Replaced Aubameyang, 45 mins)",
        "The former French international claimed 20 managers would not be able to resolve the Chelsea's crisis due to the dressing room issues.'I was quite close to the Chelsea bench and I saw some of the players having arguments between them in the second half especially,' Petit said. 'I was very shocked in the first half the attitude of the players, the body language, no response, no pride, no unity, no friendship.'I was thinking you could put 20 managers on the bench and it won't change anything at all at the moment.",
        "'They need to clear something in the dressing room first and then think about the manager afterwards.'You can put the best manager on the bench now and he doesn't get the right answer, there are too many players. 'It's a mess and it was embarrassing to watch Chelsea in the first half and I feel sorry for the fans.'The Blues seem set to appoint former Tottenham manager Mauricio Pochettino to take over in the summer but an agreement is still yet to be reached.The Argentinian will have a huge task on his hands if he does take over, with Chelsea co-owner Todd Boehly having built a large squad at vast expense.Chelsea are nine points above the relegation zone with five games remaining.Lampard gave a scathing verdict of his side following the defeat against Arsenal as he appeared to make a dig at Boehly.'Chelsea has been a big success for 20 years but at the moment we aren't in that position,' the Blues' all-time top goal-scorer said.",
        "'In the time I've been here it's clear to see behind the scenes, on the training ground, the reasons why. If you're going to be a nice team to play against all the time it doesn't matter where you go.'",
        "Lampard's side could slip below Bournemouth should they lose to the Cherries on Saturday.The Blues then host Nottingham Forest at Stamford Bridge, before facing Premier League title chasing Man City and then Man United.Chelsea will end their turbulent season by hosting Newcastle on the final day."
    ]
}