{
    "articleURL": "/wires/reuters/article-12051233/Kenya-sets-inquiry-cult-deaths-leader-remain-prison.html",
    "content": [
        "NAIROBI, May 5 (Reuters) - Kenyan President William Ruto on Friday appointed a commission of inquiry into the deaths of more than 100 people believed to have starved themselves to death, while a court ordered that their alleged cult leader remain in prison.",
        "Kenyan authorities say the dead were members of the Good News International Church led by Paul Mackenzie, who they say predicted the world would end on April 15 and instructed his followers to kill themselves to be the first to go to heaven.The death toll stands at 111 but could rise further, in one of the worst cult-related disasters in recent history.Mackenzie has not commented publicly on the accusations against him nor has he been required to enter a plea to any criminal charge. Two lawyers acting for him have declined to comment to Reuters.He appeared in court in the port city of Mombasa on Friday, where prosecutors asked a judge to hold him for an additional 90 days as their investigation continues.The judge said he would deliver a ruling next Wednesday on the prosecution's request and ordered that Mackenzie remain in custody until then.Mackenzie, who was wearing a black and pink suit and holding his 2-year-old daughter during the hearing, told journalists at the courthouse that he and some of his supporters were being refused food in prison. Prosecutors denied this.Mackenzie was arrested earlier this year on suspicion of the murder of two children by starvation and suffocation, but was then released on bail.",
        "Relatives of his adherents say that after he was freed, he returned to the forest where they lived and brought forward his predicted world's end date - which had previously fallen in August - to April 15.This has led to criticism by some Kenyan lawmakers that security services missed opportunities to prevent the mass deaths.The commission of inquiry, announced on Friday by presidential spokesman Hussein Mohamed, will examine whether administrative or intelligence lapses contributed to the deaths.Mohamed said Ruto had also appointed a task force to review regulations governing religious organisations.(Writing by George Obulutsa and Bhargav Acharya; Editing by Alexander Winning, Frances Kerry, Aaron Ross and Jonathan Oatis)"
    ]
}