{
    "articleURL": "/health/article-12039027/Why-doctors-prescribing-sleeping-like-astronaut-cure-insomnia.html",
    "content": [
        " A NASA-developed sleep position may have several widespread health benefits Zero-gravity sleep can be achieved either with an adjustable bed or extra pillows The position carries little risk, though it might not be comfortable for everyoneSleeping like you are in outer space is a little-known secret to getting an amazing night's sleep here on Earth, doctors say.",
        "The 'zero gravity' - or 'zero g' - sleeping position includes sleeping with your head and legs raised above the heart, with your mid-section in a trough downwards.It's meant to create a feeling of weightlessness by elevating both the upper and lower body at once. The position was originally conceived by NASA to help astronauts to balance their weight and relieve stress on the body while in space. It mimics the body's natural position when in low-gravity settings, so astronauts don't have to put in extra effort to get comfortable. ",
        "The goal is to keep the body resting at 120 degrees, which eases pressure on the heart and allows blood to pump more freely through the body.Researchers were looking for ways to make astronaut suits more comfortable and nimble. NASA then took the data and applied it to living quarters, changing how astronauts sleep. But you don't have to go to space to sleep better. And this research comes at a time when millions of Americans are in need of a better night's rest. Figures from the Centers for Disease Control and Prevention estimate that almost a third of Americans are not getting enough rest - at least seven hours - each night. A lack of sleep has consistently been linked to chronic health problems such as heart disease, kidney disease, high blood pressure, diabetes, stroke, obesity, and depression, according to the National Heart, Lung, and Blood Institute.  ",
        "The CDC also says that 8.4 percent of US adults take pills to fall asleep, more than double the amount who took them 10 years prior. These medications rob the body of rapid eye movement (REM) sleep, and too little REM sleep could lead to forgetfulness. Relaxing the body could also lead to several other benefits.  ",
        "By inputting when you need to wake up, this sleep calculator will give you the perfect time to hit the sack.",
        "'Being in a zero-gravity position tends to be orthopedically better and easier on your hips and your shoulders rather than sleeping on the joints,' Dr Chris Winter, a neurologist and sleep expert, told DailyMail.com. For example, adjusting the body's position could lower the risk of acid reflux, which the National Institutes of Health estimates 60 million Americans suffer from at least once a month.'When you're lying flat or supine, the acid flows out of your stomach because the stomach and the esophagus are horizontal,' Dr Winter said. 'As you tilt your head upward, gravity keeps your stomach contents in your stomach.'It could also help you breathe better. A 2017 study from the journal Sleep Breathing Physiology and Disorders found that keeping the head above the stomach helps the airways stay open. This prevents snoring and symptoms of sleep apnea, both of which can impede a good night's rest. ",
        "According to the Arthritis Foundation, as many as 80 percent of people with the condition have trouble sleeping due to achy, stiff, and swollen joints. Easing pressure on the body could alleviate some of that discomfort.Additionally, lifting the lower body can improve circulation and reduce swelling in people who are overweight, as well as those with diabetes and high blood pressure.While some companies sell adjustable beds that can be used to achieve this position, you can also do it with some simple tricks. You can do this by lying on your back, raise your legs. For example, Dr Winter suggested propping up one or two pillows below the knees and shins, as well as one or two just behind the neck.  However, zero-gravity sleep might not be a position for those who tend to toss and turn.  'Sleeping in that position kind of limits you. After a while, maybe you want to switch and be on your side or something like that. That's kind of hard to do that,' Dr Winter said.Ultimately, Dr Winter said, the benefits depend 'on what you need for good sleep and what is good sleep for you."
    ]
}