{
    "articleURL": "/sport/football/article-12053829/Want-piece-history-600-Napoli-fans-look-cash-title-triumph.html",
    "content": [
        "Some Napoli supporters are trying to sell pieces of Udinese's pitch onlineNapoli won the Scudetto title for the first time in 33 years on Thursday eveningPieces of turf that Napoli won the title on are appearing online for over £600 Opportunistic Napoli supporters are trying to auction off turf from their historic Scudetto title win following Thursday's championship-clinching result.",
        "Napoli won their first Serie A title in 33 years by drawing 1-1 with Udinese in their midweek league clash as star striker Victor Osimhen scored his side's only goal.Supporters stormed the Udinese pitch to celebrate with their team while emphatic celebrations also got underway in Naples once the full-time whistle blew.Videos circulated showing fans tearing up pieces of the Dacia Arena pitch and carefully placing segments of the cut-out grass into plastic bags to take back to Naples.Some of those pieces of turf are now being sold online by Napoli fans hoping to cash in on their team's historic success, with ridiculously-high bids being made.",
        "One advertisement selling a small square piece of ground roughly the size of a dinner plate is welcoming bids starting at £88 and a buy now price of over £600.The seller has given a short description of the item, labelling the item as 'brand new'.Meanwhile, Napoli supporters that watched their team's title-triumph inside the Stadio Diego Armando Maradona were unable to snip off pieces of their home turf.",
        "Club staff had placed a giant blue cover over the pitch that stopped fans from gaining access to the hallowed grass underneath.However, there was also a darker side to celebrations in the city that saw more than 200 people injured as fans in Udine came to blows on the pitch.",
        "Belts were used by some to inflict harm and people were seen lying on the floor in an attempt to stop strikes from hitting them in the head.At least 203 people ended up in hospital overnight for injuries sustained during the celebrations - from knife wounds to burns from firecrackers and asthma attacks caused by inhaling smoke from flares. "
    ]
}