{
    "articleURL": "/health/article-12050313/Warning-BBQ-lovers-grilling-meat-lead-arthritis-scientists-fear.html",
    "content": [
        "People with the highest levels of certain chemicals the highest risk of arthritis Cigarette smoke and gas cookers also give off polycyclic aromatic hydrocarbonsFumes from cooking meat on barbecues, wood burning stoves and traffic may trigger rheumatoid arthritis, new research suggests.",
        "Researchers found that people with the highest levels of chemicals called polycyclic aromatic hydrocarbons — also given off by cigarette smoke and gas cookers — had the highest risk of the inflammatory disease.The research reported in BMJ Open said that the chemicals seem to account for most of smoking's impact on risk of the disease.The researchers said few studies have looked at their association with inflammatory conditions, such as rheumatoid arthritis.The disease is thought to arise from a complex interplay between genes, sex, and age, and environmental factors, including smoking, nutrition, and lifestyle.",
        "Rheumatoid arthritis is the most common inflammatory disease, affecting around 400,000 people in the UK according to the NHS. It can affect adults at any age, but most commonly starts between the ages of 40 and 50. About three times as many women as men are affected.Dr Christopher D'Adamo, of the University of Maryland School of Medicine and colleagues state: 'While PAH levels tend to be higher in adults who smoke…other sources of PAH exposure include indoor environments, motor vehicle exhaust, natural gas, smoke from wood or coal burning fires, fumes from asphalt roads, and consuming grilled or charred foods.'This is pertinent as households of lower socioeconomic status generally experience poorer indoor air quality and may reside in urban areas next to major roadways or in high traffic areas.' ",
        "These people may therefore be particularly vulnerable, they suggest.The research was based on data gathered by the US National Health and Nutrition Examination Survey between 2007 and 2016.",
        "Rheumatoid arthritis is a long-term condition that causes pain, swelling and stiffness in the joints. The condition usually affects the hands, feet and wrists.There may be periods where symptoms become worse, known as flare-ups or flares.A flare can be difficult to predict, but with treatment it's possible to decrease the number of flares and minimise or prevent long-term damage to the joints.Some people with rheumatoid arthritis also experience problems in other parts of the body, or more general symptoms such as tiredness and weight loss.Source: NHS ",
        "The survey evaluates a wide variety of toxicants, including PAH; chemicals used in the manufacture of plastics and various consumer products called PHTHTEs); and volatile organic compounds (VOCs), derived from paints, cleaning agents, and pesticides, among other things; along with data related to health, nutrition, behaviours and the environment.The study included 21,987 adults, 1,418 of whom had rheumatoid arthritis and 20,569 of whom didn't.Blood and urine samples were taken to measure the total amount of PAH (7090 participants), PHTHTEs (7024), and VOCs (7129) in the body.The odds of rheumatoid arthritis were highest among those who had they top 25 per cent of bodily PAH levels — whether or not they were former or current smokers. The levels of other chemicals did not have an effect.",
        "After accounting for potentially influential factors, including dietary fibre intake, physical activity, smoking, household income, educational attainment, age, sex, and weight (BMI), only one type of PAH, 1-hydroxynaphthalene, was strongly associated with higher odds of the disease – an 80 per cent increased risk.The authors point out that the study is observational, so cannot determine whether the PAH chemicals caused the arthritis, nor did they measure heavy metal levels which have previously been linked to rheumatoid arthritis risk. Cigarettes are a major source of the heavy metal cadmium.But the authors write: 'To our knowledge, this is the first study to demonstrate that PAH not only underlie the majority of the relationship between smoking and [rheumatoid arthritis], but also independently contribute to [it].'This is important as PAH are ubiquitous in the environment, derived from various sources'. The PAHs contribute to arthritis by triggering a receptor in tissues called the aryl pathway, the authors write."
    ]
}