{
    "articleURL": "/wires/afp/article-12043775/US-issues-worlds-approval-RSV-vaccine.html",
    "content": [
        "The United States on Wednesday approved the world's first vaccine for the Respiratory Syncytial Virus (RSV), the culmination of a decades-long hunt to protect vulnerable people from the common illness.",
        "Drugmaker GSK's Arexvy was green-lighted for adults aged 60 and older, with similar shots from other makers including Pfizer and Moderna expected to follow soon.\"Today's approval of the first RSV vaccine is an important public health achievement to prevent a disease which can be life-threatening,\" said senior US Food and Drug Administration (FDA) official Peter Marks in a statement.The decision \"marks a turning point in our effort to reduce the significant burden of RSV,\" added Tony Wood, GSK's chief scientific officer.RSV is a common virus that normally causes mild, cold-like symptoms, but can be serious for infants and the elderly, as well as those with weak immune systems and underlying conditions.In severe cases it can cause pneumonia and bronchiolitis, an inflammation of the small airways deep inside the lungs.According to the US Centers for Disease Control and Prevention, RSV leads to approximately 60,000 to 120,000 hospitalizations and 6,000 to 10,000 deaths among adults 65 years of age and older.Awareness of the disease has increased in recent years, in part because of the strain it has placed on hospital systems over the last two winters.Rates of RSV and flu fell during Covid-19 lockdowns, but surged when restrictions were lifted, with young children hit hard.Pharmaceutical companies have been chasing an RSV vaccine for years. Given recent successful breakthroughs in the sector, analysts predict the market could be worth over $10 billion in the next decade, according to reports.",
        "- More vaccines on way -GSK's vaccine contains a \"subunit\" or part of the virus to help train the immune system should it encounter the real thing.It was approved based on a study of 25,000 people aged 60 and older that showed a single dose was 83 percent effective against disease caused by RSV, and more than 94 percent effective against severe disease.Researchers will continue to follow volunteers in the study to assess the duration of protection as well as the safety and efficacy of more doses.The most common side effects included injection site pain, fatigue, muscle pain, headaches and joint stiffness.An irregular heartbeat was a less common side effect, occurring in 10 participants who received Arexvy and four participants who received placebo.Safety issues were also found in two other studies of the drug involving approximately 2,500 people aged 60 and up. In one of these studies, two volunteers developed a rare type of inflammation that affects the brain and spinal cord, and one of them died.In the other study, one participant developed Guillain-Barre syndrome, in which the immune system damages nerve cells, causing muscle weakness and sometimes paralysis.GSK's Arexvy was recommended for approval last week by the European Union's drug watchdog, the European Medicines Agency, whose positive opinions are normally formally followed by approval from the European Commission.",
        "Pfizer has said that it expects a decision from the FDA in May for its own RSV vaccine, also for those over 60 years old.In January, Moderna said it hopes its RSV vaccine will be approved and available in time for the Northern Hemisphere's winter later this year.Several other companies are also developing RSV vaccines.Last year, the EU approved a preventative antibody treatment against RSV, developed by British-Swedish pharmaceutical firm AstraZeneca and France's Sanofi, which confers temporary protection."
    ]
}