{
    "articleURL": "/news/article-12038631/Retired-stock-broker-81-testifies-Donald-Trump-groped-plane.html",
    "content": [
        "Jessica Leeds, 81, told the court Tuesday how Donald Trump groped her while sitting next to her in a first class seat on an airplane in 1979She said it felt like the former president had a 'zillion hands' when he put his hands on her breasts and up her skirt 'He grabbed my breast. It was like he had 40 zillion hands. It was a tussling match between the two of us,' she said on the stand A retired stockbroker told a court today how Donald Trump groped her and tried to kiss her on a plane in full view of another passenger.",
        "Jessica Leeds, 81, said that it felt like the former president had a 'zillion hands' when he put his hands on her breasts in the first class seat in 1979.Another passenger had 'eyes like saucers' as he watched Trump put his hand up her skirt before she fought him off and walked away to another seat.The testimony came in the second week of magazine writer E. Jean Carroll's civil lawsuit against Trump, who she accuses of rape in a department store dressing room in 1996.Trump's attorney confirmed today that he will not be attending his rape trial in New York and instead a video deposition will be shown. ",
        "Trump's attorney Joe Tacopina told the court that Trump would not be giving evidence in court. Judge Lewis Kaplan said: 'It's his call. You understand that. I understand that. He understands that.'Trump was in Ireland on Tuesday visiting his golf course. The previous day he visited his properties in Scotland.Back in court Leeds said she was working as a traveling sales rep for a newsprint company in 1979 when she took the flight from either Houston or Atlanta to New York.Trump was sitting in the window seat next to her and introduced himself and they shook hands. Leeds had no idea who he was as she lived outside New York at the time.",
        "They ate their meal and chatted for a bit and then 'suddenly Trump decided to kiss me and grope me,' Leeds told the jury.Nothing in their conversation suggested she wanted anything sexual, the court heard.Leeds said, 'It was like a tussle. His hands - he was trying to kiss me and trying to pull me towards him.'He grabbed my breast. It was like he had 40 zillion hands. It was a tussling match between the two of us.'When he started putting his hand up my skirt it gave me a jolt of strength and I managed to wiggle out of the seat.'She went back to her seat in coach before she had been unexpectedly upgraded to first class.Leeds told the jury she didn't scream but she said that the 'people behind us must have thought something was going on because the chair was wiggling.'She said, 'The guy sitting across the aisle from me, his eyes were like saucers. I remember thinking where at the stewardesses? Why doesn't somebody come?'Then I realized nobody was going to help me and I was going to have to do it myself.'Leeds said that while the attack lasted for just a few seconds it 'seemed like forever' and came 'out of the blue.'",
        "After the flight landed she stayed on board until everyone had left because she didn't want to risk running into Trump in the terminal.She kept quiet about it for decades as at the time 'men could get away with a lot' at work and Leeds felt this was along those lines.But when Trump ran for the presidency she wrote a letter to the New York Times, which ran a story about her.She said that Trump 'wasn't the kind (of) person I wanted as president.'Leeds said she was 'furious' after watching a presidential debate where Trump denied harassing womenShe told the jury, 'He was lying.'Asked how she knew, she said, 'The experience I had with him.'According to Leeds, Trump addressed her claims at a rally where he said something along the lines of 'he  would never make a pass at her' because she was so old.",
        "Leeds, whose grandmother was a suffragette, laughed as the court was played a video of Trump saying at a rally she would 'not be my first choice.'She said that it showed he 'couldn't imagine making a pass at a 78-year-old woman' which was her age at the time.Leeds said she was 37 at the time of the attack on the plane.",
        "Asked why she thought Trump did it, she said it was because he was 'bored.'There was an audible gasp in court as Leeds told the jury that she saw Trump two years after the incident when he called her a 'c***'.She said she was working for the Humane Society of New York at their gala at Saks Fifth Avenue when Trump and his heavily pregnant wife Ivana came up to her desk and asked for their table number.She remember him clearly and thought about saying something but held her tongue.Leeds said, 'As he took the (table) chip from my hands he looked at me and said I remember you, you're that c*** from the airplane.'Leeds said it felt like a 'bucket of water had been thrown over me.'",
        "Earlier in the day Trump accuser E. Jean Carroll kept repeating 'he pulled down my tights' during the call to Lisa Birnbach in the mid 1990s.Birnbach said that Carroll made her swear she would 'never speak of this again' and she stayed quiet until 2019 when Carroll went public and Trump was president.Carroll, 79, claims that Trump 76, pounced on her in the changing room of Bergdorf Goodman department store in Manhattan around 1996.She is seeking at least $75,000 in damages for battery and defamation after he tried to 'destroy' her on social media by calling her a liar.",
        "Trump denies the claims and has said that Carroll made the accusation to boost sales of her memoir where she publicly accused him for the first time.The trial, now in its second week, heard that Birnbach was a 'close, close, close friend' of Carroll and had known her for more than 20 years.Birnbach, a journalist, said that the attack must have happened in the early months of 1996 as she had just got back from Trump's Florida estate, Mar-a-Lago, and wrote about it for New York magazine in a piece that was published in February that year.She was at home with her children when Carroll called and said: 'You're not going to believe what happened to me.'",
        "Birnbach said Carroll was 'breathless, hyperventilating, emotional'. 'Her voice was doing all kinds of things', Birnbach said.Carroll told Birnbach how she'd met Trump outside Bergdorf Goodman and gone to the lingerie department to help him find a gift for a girl.Birnbach told the court she thought Carroll's decision to go with him was a bit 'nutty' but she 'didn't think he (Trump) was dangerous because I'd just spent a few days with him', referring to her trip to Florida for the article.Carroll told her that after some 'jokey banter,' Trump 'slammed her against the wall' in the dressing room, then did it again.",
        "Birnbach said that Carroll told him the former President pinned her down with one arm and shoulder and pulled her tights down with the other.'E. Jean said a couple of times: 'He pulled down my tights', almost like she couldn't believe it. She was still processing, it had just happened', Birnbach said.Then Carroll described how Trump 'penetrated her.'Birnbach said that she was feeding her young children in her kitchen and 'ducked out' of the room to tell Carroll: 'He raped you, you should go to the police.'Carroll replied: 'No, no, no, I don't want to go to the police.'According to Birnbach, they 'fought' and Carroll's description of the attack was like a 'physical fight.''She said promise me you will never speak of this again and promise me you will tell nobody. I promised her both those things,' Birnbach said.",
        "After that Birnbach 'buried' the story for decades until 2019 when Carroll went public with her memoir and she agreed to be named as the person who Carroll called right after it happened.When she did she was subjected to a torrent of anti-Semitic messages via email and social media, she told the court.Birnbach said that Carroll didn't speak out sooner as she's 'not a victim' and 'doesn't want anybody's pity.'She said: 'She's somebody who instead of wallowing she puts on lipstick, dusts herself off and moves on. That's how she's gotten through her life.'Asked why she was there, Birnbach said: 'I'm here because my friend who is a good person told me something terrible happened and as a result she lost her employment and her life became very, very difficult. I'm here because I'm her friend and I want the world to know because she was telling the truth'.Birnbach told the jury she was a registered Democrat who had voted for Hillary Clinton in the 2016 election and that in a podcast she used to host she called Trump a 'narcissistic sociopath.'She also called him 'Vladimir Putin's agent' and an 'infection like herpes you can't get rid of.'Trump is not expected to testify and is currently on a tour of Scotland where he is opening a new golf course with a later stop in Ireland.The jury is expected to see a video deposition that he gave for the case, which his own lawyers have described as 'snarly.'"
    ]
}