{
    "articleURL": "/femail/article-12053615/Princess-Charlene-Prince-Albert-Monaco-cut-stylish-figures.html",
    "content": [
        "Princess Charlene, 45, stuns in an elegant neutral suit at the CoronationREAD MORE: Princess Charlene joins Prince Albert at Palace reception  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Princess Charlene of Monaco and Prince Albert cut stylish figures as they both made their mark at Westminster Abbey for the historic Coronation of King Charles.",
        "King Charles will officially be crowned as the head of the British monarchy today in a historic ceremony which will be broadcast around the world. The royal, 45, turned heads in an incredible all-cream ensemble as she walked with her husband to the main event.The former Olympic swimmer wore a buttoned blazer and ankle-length skirt for the historic event. She teamed the elegant co-ord with a matching hat and pointed heels while holding what appeared to be a gold clutch bag.",
        "She also wore a natural makeup look with a nude base, pink lips and a smokey eye.Her husband, 65, wore a heavily embellished military uniform as the power couple stunned onlookers.Today's Coronation is the first since 1953 when the late Queen Elizabeth was crowned at Westminster Abbey. King Charles, 74, ascended the throne in September last year when his mother died at the age of 96.The Coronation is set to showcase up to 15 working members of the Royal Family, including the Prince and Princess of Wales, as they ascend to the Palace balcony for the day's events.Princess Charlene's appearance at the Coronation follows the news that her husband, Prince Albert of Monaco, was the first European royal to confirm his attendance at King Charles' Coronation, revealing the news at the end of January.",
        "Monaco's crown prince spoke fondly of the British King, whom he described as 'a very educated man and someone with a great sense of humour'.He also suggested he was looking forward to the event, telling People magazine he was 'certain that it's going to be an incredible ceremony and a very moving one'.Albert added: 'We've maintained contact since His Majesty became King, but I haven't talked to him personally since the Queen's funeral.'The prince added: 'I'm certain His Majesty will add his own personal touches to the ceremonies, but what those will be, I don't know.'Earlier this year, Charlene and Albert were recently rumoured to have split after the Princess was pictured without her wedding ring.",
        "During an appearance in Milan last month, Charlene's ring finger was noticeably bare, prompting speculation that the Monegasque royals may be separating.",
        "In May 2021, while on a trip to raise awareness about the issue of rhinoceros poaching in southern Africa, Charlene caught an ear, nose, and throat (ENT) infection.A series of other health problems ensued for the mother of two which saw her undergo multiple surgeries in South Africa.The princess spent ten months away from her husband and children, followed by a stint in a Swiss clinic for 'exhaustion'.However, after months of looking frail and pained, the royal is back to her glamorous best and is in the full swing of royal duties again, today attending King Charles lll's Coronation. ",
        "However, later that day, the couple made a joint appearance at the Monte Carlo Woman of the Year awards, where Charlene appeared to be wearing her wedding ring - pouring cold water on the rumours.Rumours about the couple's marriage first circulated after Charlene was absent from Monaco for most of 2021 while having medical treatment in her native South Africa, and was admitted to a Swiss clinic to be treated for exhaustion on her return.The pair have eight-year-old twins Jacques, Hereditary Prince of Monaco and Princess Gabriella, Countess of Carladès.Prince Albert - who competed in bobsledding at the Winter Olympics five times from 1988 to 2002 - ascended to the throne after the death of his father, Prince Rainier III in 2005."
    ]
}