{
    "articleURL": "/news/article-12046493/Poem-written-heartbroken-Queen-Caroline-estranged-husband-George-IV-unearthed.html",
    "content": [
        "Caroline may have written the verses as a plea to her husbandCouple were entangled in a dispute over allegations she was born out of wedlockFor all the latest Royal news, pictures and video click here An anguished poem that may have been written to King George IV by his estranged wife Queen Caroline has been unearthed.",
        "Experts say Caroline of Brunswick, who was known as the 'Injured Queen', may have written the verses, which date from 1806-7, as a plea to her husband, then the Prince of Wales.The couple were entangled in a bitter and very public dispute over later discredited allegations that Caroline had been borne out of wedlock.In 1821, just weeks before her death, the Queen was infamously turned away from Westminster Abbey at his coronation.Addressed to 'His Royal Highness, the poem includes the lines: 'An injured Princess, justice is my claim / A helpless woman, pity is my due.'",
        "The manuscript poem and other related papers are part of a collection donated to Cambridge University Library by the late Michael Massy-Beresford. Until now, it was almost exclusively unavailable to historians. Another line in the poem reads: 'Ah, good my Lord, what is the dire pretence / that draws your high displeasure on my head / witness this heart unconscious of offence / witness the blameless life I still have led!'The collection also includes dozens of handwritten letters that were exchanged between Princess Caroline, her father-in-law King George III and the Queen's loyal circle of friends and supporters. Little trace of the poem, which has been in private hands for the past 200 years, can be found in the public record and it appears unknown to modern-day historians and biographers of Caroline and the Regency monarchy. ",
        "The wider archive lays bare the Princess of Wales's dismay and anger over how she was banished from court and the wider Royal Family over claims about her birth and an even more serious charge of adultery.She sent letters to establishment figures including future Prime Minister Spencer Perceval, who was later assassinated. Caroline also wrote to Lady Anne Townshend, he Mistress of the Robes and Thomas Manby, the Royal Navy captain she was accused of having an affair with.  ",
        "Included is a copy of the final report into Princess Caroline's conduct, as well as copies of statements from the Prince of Wales's star witnesses – Sir John and Lady Douglas, one-time friends of Caroline who alleged that a baby boy adopted by the Princess had in fact been borne by her.The probe into Caroline's conduct and lineage was known as the Delicate Investigation. It was launched in 1806 at the behest of George to find or make up evidence of adultery and other crimes that could be used as a pretext for divorce from Caroline.Despite the best efforts of the Prince, Caroline was exonerated of the charges against her, although the final report did chastise the Princess of Wales for some of her alleged conduct with Captain Manby and others. ",
        "At the time of his marriage to Caroline, George was already secretly and illegally married to his Catholic lover, the twice-widowed commoner Maria Fitzherbert. The archive gives a remarkable insight into the tormented mind of a Princess of Wales beloved by the British public at a time when the wider monarchy, and her husband most notably, were largely detested. The Prince of Wales, who waited nearly 60 years to inherit the throne from his father George III, was seen as out of touch for his eye-wateringly lavish spending and the huge debts he accumulated via his notoriously extravagant and profligate lifestyle.The Delicate Investigation letters now held at Cambridge University Library also reveal how much pressure was brought to bear on friends, associates, staff and acquaintances of Caroline, with anonymous letters to her retinue promising lavish rewards for information that might discredit the Princess.Mr Massy-Beresford, who died last year, was the son of Brigadier Tristram Massy-Bereford, who the unorthodox 'Massy Force' military unit which fought against the Japanese in the Second World War. John Wells, Senior Archivist at Cambridge University Library, said: 'The poem To His Royal Highness is a fascinating mystery. Was it written by Princess Caroline? ",
        "'An anonymous printed version appeared in an obscure publication several years after the Delicate Investigation, and it might be assumed that a hack writer was simply voicing the supposed thoughts of the Princess as a literary device.",
        "'But the discovery of a handwritten copy in these files places the poem much closer to Caroline's inner circle. 'The handwritten text differs in several places from the printed version, so the manuscript can't just have been copied out from the book.'It's not in Caroline's handwriting, but we can see from an interpolated word that it has been copied from somewhere, and it was carefully preserved in the files of the Princess's confidante Lady Townshend. Was the original source Caroline herself?'Speaking of the letters, he added: 'These letters transport us to a febrile period of royal history. 'The outline of the story is well enough known to historians, but these personal letters – sent directly to and from the Princess and other leading participants – reveal more about the calculations and sensitivities of those most intimately involved. 'They give scholars insights that can't be gleaned from the official public record.'",
        "To His Royal Highness.A Royal lineage and of spotless fameit ill befits me humbly thus to sue;An injured Princess, justiceis my claim,a helpless woman, pity is my due.Ah, good my Lord, what is the dire pretence that draws your high displeasure on my headwitness this heart unconscious of offence.witness the blameless life I still have led !A mother's love, a father's sheltering home,my friends, my country I, for you resigned,in Albion hoped to find another home,nor miss those social joys I left behind.My fond heart whispered and I crossed the Main,'Go happy Princess whom the fatedapprove,go in thy Royal Consort's bosom reign;and taste the raptures of a nation's love 'Or is what much I fear'd I failed to pleaseI was the daughter of a Royal Line,Respect, attention, still I hoped for these, 'these from a generous Prince would still be mine.Since first we met I watch'd your every lookmy dearest hope your heart's fond love to share.such wish each motion from your eye I took,lived on your smiles and grieved on all your cares.I challenge all the spite of artful tongues,Why cast me off, what is the cruel plea?Ah God, forgive the cause of all my wrongs,tha artful Pair that steals your heart from me!If aught you heed the voice of future time,say will it shew the brave -the manly part,to wound that breast whose weakness is its crimeto urge your triumph o'er the broken heart.I, to a generous public leave my cause,be mine. the task to suffer and to die;Be yours the worthless minion's vain applausetoo dearly purchased by reflection sigh !Alas you heed me not, you shun my sight,vain are my plaints, no more this face can charm;Yet once my soft endearments caus'd delight, yet on my lips your vows of faith are warm.By that true faith you at the altar swore.By all the memory of endearments past; yet one appeal remains - one trial more - and trust me that appeals shall be the lastlook on that smiling babe, first pledge of love,her bosom has not learn't like mine to bleed,yet more her helpless innocence may move,her speechless eloquence may better plead.C "
    ]
}