{
    "articleURL": "/femail/article-12047291/Charles-greets-King-Ashantis-Lady-Julia-Osei-Tutu.html",
    "content": [
        "King Charles also greeted leader of the Achuar Nation of the Ecuadorian AmazonKing was given feathered crown for his 'commitment to protecting the rainforest'READ MORE: Kate and William hit the pub and pose for selfiesKing Charles beamed as he greeted the King of The Ashantis and Lady Julia Osei Tutu at Buckingham Palace today.",
        "The King of The Ashantis, Otumfuo Osei Tutu II (the Asantehene) and Lady Julia Osei Tutu are in the UK for the Coronation this weekend. Charles was pictured beaming with the Asantehene as the pair laughed with each other. A multi-coloured fringed parasol was held over the Ghanaian monarch's head as the encounter took place, with the cover denoting the visiting king's seniority. The King also met the Asantehene in November 2018 when the Asantehene and Lady Julia welcomed Charles and Camilla to Manhiya Palace in Kumasi, Ghana.",
        "During their visited, they witnessed the Akwasidae, a cultural festival that celebrates the Ashanti Kingdom.The Asantehene has a long-standing relationship with the British Monarchy, having met the Queen at Buckingham Palace in 2000; and Charles in Glasgow, where they both received honorary degrees.King Charles looked dapper in a navy blue suit with a blue patterned tie and black polished shoes. He also recieved leader of the Achuar Nation of the Ecuadorian Amazon, Uyunkar Domingo Peas, who was dressed in traditional costume. They greeted each other with handshake and then a warm hug.Charles was given a feathered crown in recognition of his 'commitment to protecting the rainforest and restoring harmony between humanity and nature', Buckingham Palace said.Uyunkar Domingo Peas met the King at an environmental reception at the Palace in February, when he presented Charles with a necklace made from seeds to symbolise an alliance between the monarch and indigenous people.",
        "The King also welcomed Governor General of Canada Mary Simon, who is Inuk, making her the first Indigenous person to hold the office.He also greeted Canadian indigenous leaders, Chief Roseanne Archibald, Natan Obed and Cassidy Caron. ",
        "The Palace said: 'His Majesty has had a long-standing relationship with Canada's indigenous people and this meeting is an example of the King continuing that journey of listening and deepening his understanding.'Some 100 heads of state are preparing to descend on London for the King and Queen Consort's historic coronation on Saturday, with international representatives from 203 countries due to attend.French president Emmanuel Macron, Germany and Italy's ceremonial presidents Frank-Walter Steinmeier and Sergio Mattarella and Pakistan's prime minister Shehbaz Sharif will be among those in Westminster Abbey."
    ]
}