{
    "articleURL": "/wires/reuters/article-12047157/Coveted-transfer-Hunter-Dickinson-picks-Kansas.html",
    "content": [
        "Bill Self began his post-mortem of the 2023 NCAA Tournament pointing to the greatest personnel need for Kansas: A big who can get 20 and 10.",
        "That Jayhawk just landed in Lawrence.Coveted Michigan transfer Hunter Dickinson is joining Kansas from a pool of finalists that included Villanova, Kentucky and Maryland.Kansas has a recruiting class of a quartet of four-star prospects to pair with Dickinson. The Jayhawks are subtracting conference player of the year Jalen Wilson and Kevin McCullar Jr., a versatile starter who transferred from Texas Tech.\"I'm just really glad it's over now,\" Dickinson said in a post to Twitter with a video of him walking through double doors to embrace Self. \"I just wanted to tell you that I'm going to come play for you at Kansas.\"The 7-foot-1 center was a consensus second-team All-American and the Big Ten Freshman of the Year in 2020-21. He is coming off an All-Big Ten first-team selection in 2022-23.Dickinson announced his plans to transfer on March 31. He thanked Michigan in a farewell post late Wednesday night.\"I've grown and learned so much in my 3 years at Michigan, and if I could do it all over again out of high school there is no doubt in my mind I would make the same choice. That being said, it's time for me to move on,\" Dickinson wrote. \"Before I announce tomorrow where I will be attending next year, I wanted to take the time to say thank you. Thank you to the coaching staff who believed in me and made me the player I am today. To all the players I've played with during my time at Michigan, I know without you guys I could've never become the player I am today and accomplish what we accomplished. And lastly to the fans, you guys showed me so much love in my 3 years. I really felt like a part of the community and like Ann Arbor was my second home. Thank you.\"",
        "Self's Jayhawks were his first official visit, following unofficial visits to Georgetown and Maryland the previous weekend.Dickinson averaged 18.5 points and career highs in rebounding (9.0 per game) and blocks (1.8 per game) across 34 starts last season. The big man also shot 42.1 percent from 3-point distance and according to Synergy Statistics, he was in the 78th percentile in post offense.In 94 career games (89 starts), Dickinson averaged 17.2 points, 8.4 rebounds, 1.6 assists and 1.6 blocks per game for the Wolverines. He ranks 12th in Michigan history in career points (1,617) and 10th in career rebounds (787).The Alexandria, Va. native is classified as a graduate transfer because he is on track to graduate from Michigan at end of the summer semester.--Field Level Media"
    ]
}