{
    "articleURL": "/sport/rugbyunion/article-12038763/London-Irish-players-staff-hopeful-paid-Wednesday-tense-club-meeting.html",
    "content": [
        "Insolvency expert has sounded alarm about the apparent predicament of IrishRFU and Premiership Rugby ready to intervene if payment does not go throughRugby Players’ Association are also thought to be on a state of alert over crisisLondon Irish players and staff are set to discover on Wednesday morning whether their delayed monthly wages have been paid – as promised at a tense meeting at the club on Tuesday.",
        "The Exiles squad were addressed by Howard Thomas on behalf of prospective buyers, the Redstrike Group, who insisted that payroll funds were being sent from financial backers in America. It is understood that the wages are expected to appear, belatedly, in accounts on Wednesday morning.Sources have indicated to Mail Sport that the RFU and Premiership Rugby are on stand-by to try to intervene if the payment does not go through, at a time of rising anxiety over the protracted take-over of the Brentford-based club. The Rugby Players’ Association are also thought to be on a state of alert, as they, the RFU and PRL are all fearful of another club collapse and more sudden redundancies, following the shattering demise of Worcester and Wasps.An insolvency expert has sounded the alarm about the apparent predicament of Irish, who have flourished on the field in recent times, despite the backdrop of financial turbulence. ",
        "Michael Lynch, partner at law firm DMH Stallard, said: ‘Reading between the lines, it appears that London Irish’s negotiations with the American consortium looking to take over the club may well have stagnated, creating a cash-flow problem.‘HMRC appears not to be pursuing repayment, as it did so with Worcester and Wasps, nor does it seem there is any other extant creditor pressure. However, that does not negate the circa £30million debt position London Irish find themselves in.",
        "‘Ultimately, it comes down to London Irish’s out-goings exceeding revenue, which is unsustainable without support. This may leave London Irish with little option but to consider more acute and damaging (to the club and community) formal insolvency options.’As English rugby continues to endure a period of upheaval, Worcester’s take-over by the Atlas Group was on a knife-edge as it reached the deadline for the buyers approved by the official administrators to either complete the transaction or withdraw.  Mail Sport understands that, in the event of Atlas being unable to proceed as intended, former director of rugby Steve Diamond is monitoring the situation and may consider resurrecting his consortium’s own take-over bid.Meanwhile, the RFU are expected to confirm in the coming days that former England defence guru and All Blacks head coach, John Mitchell, will succeed Simon Middleton in charge of the national women’s team. He worked with the men’s team under Eddie Jones from September 2018 until his abrupt departure in the summer of 2021.Bath have announced the summer arrival of Lee Blackett as their new attack coach. He was in charge at Wasps when the club went into administration last autumn and has subsequently revived his career with a productive spell in west Wales with the Scarlets."
    ]
}