{
    "articleURL": "/wires/reuters/article-12047553/Russia-unlikely-use-nuclear-weapons-US-intel-chief.html",
    "content": [
        "By Phil Stewart and Idrees Ali",
        "WASHINGTON, May 4 (Reuters) - Russia is very unlikely to use its nuclear weapons, the top U.S. intelligence official said on Thursday, despite past saber-rattling from the Kremlin and the heavy casualties that eMoscow is enduring in its invasion of Ukraine.\"It's very unlikely, is our current assessment,\" Director of National Intelligence Avril Haines told the Senate Armed Services Committee.Nuclear tensions between Russia and the United States have increased since the start of the conflict with Ukraine with Putin repeatedly warning that Russia is ready to use its nuclear arsenal if necessary to defend its \"territorial integrity.\"In February, Putin announced Russia was suspending its participation in the New START treaty, the last remaining nuclear arms pact with the United States, which limits the number of strategic warheads each side can deploy.Haines did not elaborate on the U.S. intelligence community assessment.U.S. officials for months have said they have not seen signs Russia was preparing to employ nuclear weapons but also cautioned that they were staying vigilant.Last month, a top U.S. diplomat publicly said the United States and its NATO allies needed to remain alert for signs Russian President Vladimir Putin could use a tactical nuclear weapon in a \"managed\" escalation of his war in Ukraine.Deputy U.S. Secretary of State Wendy Sherman pointed to Putin's March 25 announcement that Russia was preparing to station tactical nuclear weapons in neighboring Belarus \"is his effort to use this threat in a managed way.\"",
        "Still, there have also been assurances of nuclear restraint from Moscow.Last week the Kremlin played down the idea that Russia might be preparing to carry out a nuclear weapons test, saying all nuclear states were abiding by a moratorium on the testing of nuclear weapons. (Reporting by Phil Stewart and Idrees Ali; Editing by David Gregorio)"
    ]
}