{
    "articleURL": "/sport/football/article-12050603/Eddie-Howe-concedes-Newcastle-come-close-affording-Cristiano-Ronaldo-Neymar.html",
    "content": [
        "Eddie Howe's side have invested over £250m on transfers in previous windows The Magpies are on course to qualify for the Champions League this seasonEddie Howe says Newcastle have to identify and sign players before they become world superstars - and insists they won’t be in the market for Neymar and Cristiano Ronaldo this summer.",
        "That pair have again been linked with a move to St James’ Park in recent days, the assumption being that Saudi-backed owners want marquee arrivals.But that is not true and the club’s transfer model, so far, has proven the envy of Europe, sourcing players such as Bruno Guimaraes (£36million), Sven Botman (£32m) and Alexander Isak (£60m) for what, on reflection, could be bargain prices.Howe says that remains the strategy, especially as spending rules would not allow for anything other.‘It is best to discover players before they explode onto the world scene,’ he said. 'We could not be able to come close to affording those players (Neymar and Ronaldo) as they are the best players in the world.",
        "‘We are never going to be in a position, currently, to afford those transfer fees and wages. We need to go underneath and find them young and develop them into the players they can be.’Howe, it is said, would not want players of that profile anyway, at least not at this stage in the club’s journey.He added: ‘That kind of speculation has been there from day one since the takeover, really. Naturally, everyone has then assumed the biggest names in world football will be going to Newcastle.‘We've not recruited that way. Financially, we can't recruit that way at the moment. But also, we have to bring the right people and the right players into the group.",
        "‘The transfer market is such a complex decision, you can't just pick a name and bring them in. There's got to be a lot of thought going into what we're doing, both financially and looking at the players.‘I know what direction I want to take the team in, and what we can and can’t do in the transfer market. Those two players are unbelievable players. We are linked with many different names. A lot of the names will not be accurate.’Meanwhile, Howe says there is a strong chance defender Paul Dummett could win a new contract despite only featuring in one game this season. The 31-year-old qualifies as a club-trained player and, given four of them are needed for a Champions League squad, that is a consideration.Howe said: 'Paul has been really good. Fitness wise, it's the best I've seen him, he hasn't missed a day in a long while. I think any player benefits from that consistency.‘He's a very good player, Paul. The beauty of him is he can play a couple of positions for us, left-back or centre-half. It's great to have a player with that experience and ability. ",
        "‘Yes, he hasn't had that opportunity to get in the team because of the consistency of other players, but he's somebody we value very highly as a player, person and professional.’",
        "Dummett is out of contract in June – could he stay?‘Very much so,’ said Howe. ‘I see Paul as part of our future. When you build a squad, you are never going to be able to play everybody for the amount of time they want. So, you need players who are prepared to fight for their place, train well and have an effect on the group.‘Matt Ritchie, Paul Dummett, they are players who have not performed for the outside world, but internally they have been excellent for us.’"
    ]
}