{
    "articleURL": "/debate/article-12048553/BEL-MOONEY-new-drug-Alzheimers-late-brilliant-friend-hope.html",
    "content": [
        "My dear old friend and I walked arm in arm through Regent’s Park Zoo in sunlight. He was anxious, startled by the distant cries of monkeys.",
        "When we came to the cafe, he panicked at the sight of other people and ran away. Later, calmed by gentle persuasion, he spotted a giraffe in its enclosure and pointed and laughed like a small child: ‘Oh, look — long neck!’My companion was the late, great Bernard Levin, the best journalist of his generation — and once a columnist for the Mail. An indefatigable polemicist, traveller, TV star, satirist, wit, lover of opera and literature, and a terrifying intellectual foe of Communists, anti-Semites, charlatans, puritans and assorted enemies of the values he held dear.Once, he had been a man who could quote Shakespeare with as much ease as he could discuss the finest wine with a maitre d’hotel in any grand restaurant. But then, by 2003, he could not identify a giraffe.When I’d collected Bernard that morning from the carer employed by his faithful companion, Liz, he clearly hadn’t a clue who I was, though we’d been friends for over ten years. His long-term fears about ‘this thing that’s happening to me’ were well known to those who loved him. After I dropped him back home and continued to Paddington Station in my taxi, I wept all the way — grieving for the fine mind and outstanding personality struck down by Alzheimer’s disease.",
        "I felt less grief when my father was diagnosed with vascular dementia in his 90s. Dad was so old — and yet, not long before he died, could still remember everyone and almost everything. He could have fun: Bernard could not. Death spared Dad the worst deterioration, yet his mood swings could be terrible and he’d shout: ‘I’m not demented!’One evening I sat with my parents at their kitchen table as they ate the meal I’d prepared. He turned to Mum and mentioned ‘our daughter’. When I said cheerfully, ‘That’s me, Dad!’ his face registered utter despair.Those with personal experience of dementia — and there are millions — will understand why I feel something like a sense of awe this week. As the Mail reported yesterday, the U.S. pharmaceutical giant Eli Lilly has announced a new drug that, say experts, leaves the world on the ‘cusp of a first generation of treatments’ for the disease. This was unimaginable only a few short years ago.The drug, donanemab, slowed patients’ cognitive decline by up to 36 per cent. And in half of the trial group, it completely halted this decline for more than a year.Scientists have hailed the results as ‘remarkable’ and Dr Cath Mummery, consultant neurologist at University College London Hospitals NHS Foundation Trust, said the ‘historic’ news raised the hope that Alzheimer’s could be put ‘into remission’ for the first time.",
        "The new drug follows another compound, lecanemab, that also showed promising results in medical trials last year.It is hard to overstate this moment. At last there is a ray of hope (with all necessary checks and balances, of course) for those faced with the terrifying loss of their faculties in the future.Even those with no experience of dementia in family or friends will, I’m sure, admit to a deep fear that one day the sad, dark decline may happen to them.",
        "And therefore (please God) the latest breakthrough might conceivably change their lives. Friends of mine say that succumbing to dementia and Alzheimer’s would truly be a fate worse than death. They imagine not recognising loved ones — and shudder.Their anxiety is justified. As life expectancy increases, that blessing brings with it the ‘curse’ of vulnerable old age. Currently 944,000 people are living with dementia in Britain, with the majority suffering from Alzheimer’s. Over the next seven years, that number is predicted to rise to more than one million. This year, one in three people born in the UK will develop dementia — the leading cause of death in England.The medical and caring professions and services are in desperate need of more funding, as they struggle to assess, diagnose, treat and give adequate support to those patients and their families. Countless lives are being devastated by a cruel condition that costs the country £34.7 billion a year.",
        "The Alzheimer’s Society’s fundraising efforts are endless. I will never forget how, in 2020, a local representative of the charity gave my late mother kind support and advice on caring for my father.Now Dr Richard Oakley, associate director of research at the society, says: ‘After 20 years with no new Alzheimer’s drugs, we now have two potential new drugs in just 12 months and, for the first time, drugs that seem to slow progression of the disease. This could be the beginning of the end of Alzheimer’s disease.’ Of course, as with all medical breakthroughs, caution is necessary. Donanemab reduced cognitive decline in a trial of more than 1,000 people in the early stages of the disease.Of those who were given the drug, 47 per cent showed no deterioration after a year, compared with 29 per cent of those who hadn’t had the drug. There was also a reduced build-up of the toxic protein plaques — known as ‘amyloids’ — in the brain that are the hallmarks of Alzheimer’s.The results seem to show that those given the drug were more able to live normal lives.There’s still a long way to go. It would be heartless to pretend to those with a loved one recently diagnosed with Alzheimer’s that they will be given these new treatments soon.",
        "There are some worrying side-effects to be investigated including, in a small number of cases, serious and possibly fatal brain swelling. And the process of licensing a new drug takes time.Alzheimer’s remains incurable, despite many decades and billions of pounds of research investment. Yet that hard fact should not stop us all from cheering any news that it might be slowed and, one day, even cured or reversed.Imagine what that could mean to a family: a grandmother able to watch her grandchildren grow. It would be a gift of time beyond price. Furthermore, early-onset Alzheimer’s can develop in people in their 50s and early 60s, like my friend Bernard.Dr Susan Kolhass, from Alzheimer’s Research UK, adds that it’s likely that effective, second-generation drugs will now follow the latest findings and that this is ‘something many thought impossible only a decade ago’.Often, as we go about our lives and worry about things such as the cost of living, we forget that small, steady miracles of medical and scientific research continue. Life expectancy has almost doubled in a century through breakthroughs in medicine and now the focus should be on how we can make that extra time healthy, happy and useful.Covid was a bleak reminder of how vulnerable we all are, but especially the elderly, hence the excitement of the first vaccinations. Going further back in time, to the late 1980s, the outlook for people with HIV was grim until the development of antiretroviral drugs.",
        "Now, although Aids is still a terrible reality, especially in poorer parts of the world, it can be treated with drugs. Even 60 years ago, the bowel disease my daughter was born with would almost certainly have killed her. Instead — thanks to medical research — she can live a fulfilled life. And I owe two precious grandchildren to the development of IVF.Yes, we should never let go of hope. It’s vital to remember that things can and do get better — and that one small candle in a dark room can, in time, make a light that will dazzle the whole world."
    ]
}