{
    "articleURL": "/sport/football/article-12054117/Crowds-Premier-Leagues-3pm-fixtures-join-rendition-God-Save-King.html",
    "content": [
        "The Premier League 'strongly suggested' clubs played the national anthemMan City v Leeds LIVE: Sam Allardyce set for fight to keep Leeds in the leaguePremier League LIVE: Updates from around the grounds at the 3pm kick-offsFans across the country joined in with the national anthem as the playing of 'God Save the King' passed without incident ahead of the Premier League fixtures kicking off at 3pm.  ",
        "Bournemouth, Manchester City, Wolves, and Tottenham all kicked-off at 3pm in their home stadiums for their ties against Chelsea, Leeds, Aston Villa and Crystal Palace respectively, and had agreed ahead of time to play 'God Save the King' after the Premier League 'strongly suggested' teams do so to commemorate this morning's coronation of King Charles III. Clubs were also provided with a picture of the King and the Queen Consort and the coronation logo. Initially, there was doubt around whether Liverpool would take part in the gesture due to the club's checkered history around the anthem. At the side's FA Cup final at Wembley last year, the anthem was booed loudly by supporters present.",
        "Rather than a direct attack on the individual figures in the monarchy, the Reds' rejecting of the song says more about their frustration with the establishment.  Mail Sport's Dominic King suggested that the fans at Anfield might instead sing You'll Never Walk Alone after the club bowed to pressure to play the anthem after taking their time with decision. Manager Jurgen Klopp said ahead of his side's match against Brentford that 'the club's position is [his] position' and refused to be drawn into making a statement either in support or rejecting the song's inclusion in the afternoon's proceedings. ",
        "'I am pretty sure a lot of people in this country will enjoy the coronation, some will not be interested and some will not like it,' Klopp said diplomatically. 'That is it and that is over the whole country.'In the wake of the late Queen Elizabeth II's death in September 2022, fixtures were controversially cancelled in a joint decision by the Premier League and the Football Association. When the fixture list resumed, clubs paid homage to the monarch by playing the anthem and holding a minute's silence. There were scattered boos at Goodison Park ahead Everton's match against West Ham, and Tottenham's home fixture against Leicester. Chelsea, who will face Bournemouth at the Vitality Stadium, had the unique distinction of one of their players being directly involved in the Coronation. ",
        "Striker Sam Kerr led the Australian delegation into Westminster Abbey carrying her national flag after being chosen by premier Anthony Albanese. The Matildas captain said that in honour of the unique occasion, manager Emma Hayes had allowed her to miss practice, despire the women's side's Sunday fixture against Everton. While there were no football fixtures on the occasion of the late Queen's coronation 70 years ago, a scheduled Coronation Cup was played a month before, in May 1953. Four teams from England and four from Scotland took part to become the defacto champions of Britain, with Celtic beating Hibernian in the final played at Hampden Park.  "
    ]
}