{
    "articleURL": "/money/markets/article-12045497/Next-keeps-guidance-despite-smaller-feared-dip-sales.html",
    "content": [
        "Full price sales fell 0.7% in first quarter, better than the expected 2% decline This was mostly thanks to a rise of 7.4% in finance interest income2023 profit expected to be £795m, with full-price sales to fall 1.5% Clothing and homeware chain Next has held onto its profit guidance for the year after reporting a smaller-than-feared fall in sales.",
        "However, it expects shoppers to rein in spending in the coming months after splashing out before Easter. The FTSE 100 retail bellwether reported a 0.7 per cent drop in full-price sales for the three months to the end of April, better than the 2 per cent decline it had forecast. However, it downgraded its sales forecasts for the second quarter, with sales now expected to fall 5 per cent, compared to its previous estimate of 4 per cent.",
        "'This adjustment seems reasonable, as some of the first quarter's success, particularly in holiday clothing sales leading up to Easter, might have been pulled forward from the second quarter,' the group said.It also noted strong performance last year, when it benefited from unusually warm weather and pent-up demand for events such as weddings and proms.Next's trading update also shows that the better-than-expected performance in the first quarter was largely driven by a rise of 7.4 per cent in finance interest income - or income attached to customer credit accounts.'Next had to rely on more profitable consumer finance products to hold up weak sales data,' said Samuel Mather-Holgate of advisory firm Mather &amp; Murray Financial.'This isn't unexpected, but is yet more evidence that the economy is fragile.'Full-price online sales dipped 1.6 per cent and in-store sales fell 0.6 per cent, but overall sales increased by 1.2 per cent, as discounts and clearance sales attracted cash-strapped shoppers. ",
        "In line with its traditionally cautious outlook, Next told shareholders: 'Although our first quarter performance moderately exceeded our sales guidance, we believe it is too early in the year to alter our overall sales expectations for either the half or full year.'The group expects pre-tax profit of £795million for 2023, which would mark a decline of 8.7 per cent from the previous year.Full-price sales are forecast to fall by 1.5 per cent, which would still represent growth of 18.7 per cent compared to pre-pandemic levels. Next shares were up 2 per cent to £66.44 in late trade. They are up by around 10 per cent over the last year. The group, which has around 500 stores in the UK and Ireland and around 7million online customers, has shown more resilience than rival retailers to the cost of living crisis.In December, Next snapped up Joules in a £34million deal, just a month after buying collapsed furniture retailer Made.com out of administration for around £3.5million.In March, Next vowed to raise prices by less than expected this year amid weakening cost inflation, with 7 per cent hikes in the spring and summer and 3 per cent in the autumn and winter.At the time, chief executive Lord Wolfson said he expected the fierce cost pressures facing Next, such as shipping and what its suppliers charge at the factory gate, to have eased by the autumn. ",
        "What analysts say Richard Hunter, head of markets at Interactive Investor, said:' The guidance is in line with Next's traditionally cautious outlook, adding to its previous comments that while it sees some improvement to the overall drag of inflation given reduced factory gate prices and lower freight costs, wage inflation and utility bills remain a thorn in the side which will likely impact overall performance.'Charlie Huggins, manager of the 'Quality Shares Portfolio' at Wealth Club, said: 'Although Next hasn't increased its full year guidance, this seems to be borne more out of prudence than anything else.'And added: 'Overall, Next is doing everything investors could ask of it in a difficult retail environment. 'Economic pressures could yet worsen as higher interest rates really start to bite. But that won't worry Next too much. It looks to be in a much stronger position than rivals to weather any storm.'But Russ Mould of AJ Bell was less optimistic: 'While Next’s latest sales update was moderately ahead of its prior expectations, it is nothing to get excited about. 'Sales growth has stalled and the only area where it is making decent gains is from the income attached to customer credit accounts.'Next has a serious growth problem and while it may remain a profitable business, a company of its calibre is expected to show financial progression year after year.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}