{
    "articleURL": "/sport/racing/article-12057299/Oisin-Murphy-returns-big-time-Mawj-pips-favourite-Tahiyra-1-000-Guineas.html",
    "content": [
        "Oisin Murphy admitted the 1,000 Guineas win was 'beyond his wildest dreams'Murphy only returned in February after serving a 14-month ban from the sportThe triumph came a day after colleague Frankie Dettori won the 2,000 Guineas Oisin Murphy joined colleague Frankie Dettori in racing dreamland at Newmarket with his first win in the Qipco 1,000 Guineas on Mawj.",
        "Twenty-four hours after Dettori won the 2,000 Guineas on Chaldean in his final season, Murphy, 27, secured the prestige victory he was surely praying for after spending the 2022 season banned.The three-time champion jockey, whose only previous British Classic win was on Kameko in the 2020 2,000 Guineas, returned in February from a 14-month ban for misleading the BHA when he broke Covid rules in 2020 and failing two alcohol breath tests a year later.He has picked up seamlessly where he left off but that didn’t detract from the importance of Mawj’s victory for a rider who, despite his career bump in the road, many still see as the natural successor to Dettori.After 9-1 shot Mawj had beaten 6-4 favourite Tahiyra half a length after a fierce final-furlong battle with a yawning seven-and-a-half lengths back to third Matilda Picotte, Murphy (above) said: ‘This is beyond my wildest dreams. To win such a big race after not being long back is incredible.",
        "‘All the wins mean a lot, even my first winner back meant an awful lot. I just realise as I have got older that these top class horses are super-hard to find. You have to saviour the moments.’Murphy’s joy was shared by Mawj’s trainer Saeed Bin Suroor who these days is very much the junior partner behind Charlie Appleby in the Godolphin operation of Sheik Mohammed.",
        "Mawj’s win was Bin Suroor’s third in the 1,000 Guineas and a 13th British Classic. But he hadn’t won one of them since Mastery took the 2009 St Leger and his last British Group One win was Farhh in the 2013 Champion Stakes.Mawj could now go to the Irish 1,000 Guineas while Tahiyra’s trainer Dermot Weld was frustrated to be beaten but he reckoned the slow ground had blunted his filly’s pace."
    ]
}