{
    "articleURL": "/news/article-12041377/McDonalds-fined-500-000-health-inspectors-discovered-mouse-droppings-restaurant.html",
    "content": [
        "Waltham Forest Council took them to court after visiting restaurant in Oct 2021Have YOU had a similar experience? Email milo.pope.mol@mailonline.co.ukMcDonald's has been fined half a million pounds after health inspectors discovered a dead mouse and mouse droppings inside one of their rodent-infested restaurants in the UK.",
        "In October 2021 a disgusted drive-thru customer spotted what appeared to be a mouse dropping on the inside of his cheeseburger wrapper.This prompted an investigation by environmental health officers working for Waltham Forest Council who discovered an out-of-control rodent infestation at the restaurant which posed an 'imminent risk' to public health.",
        "Environmental health officers working for Waltham Forest Council found the 'decomposing remains' of a mouse as well as droppings 'throughout the premises' - including in food preparation areas, main cooking areas and hot food holding areas.The fast-food branch in Leytonstone, east London, was then forced to close its doors that same day. It remained shut for a period of ten days before re-opening after officers were satisfied all issues were resolved. Today, it boasts a 1.5-star rating on Trip Advisor.",
        "Waltham Forest Council, which is responsible for the restaurant's food hygiene rating, took legal action against the fast-food giant for the 'significant risk' the conditions of the restaurant posed to its customers. McDonald's pleaded guilty to three charges relating to hygiene breaches and this week were ordered to pay a £475,000 fine and £22,000 in costs by magistrates at the Thames Magistrates' Court.",
        "Councillor Khevyn Limbajee, Waltham Forest Council's Cabinet Member for Community Safety, said customers should be made to feel confident that their food has been cooked and prepared in a clean and safe environment.",
        "Cllr Limbajee said: 'We are grateful for the quick thinking of the customer in this case for reporting the matter to the Council for investigation.'There was a significant risk posed to the health of residents and visitors to Waltham Forest and as such the Council had no option but to take formal action in this case.'McDonald's is a large and well-experienced food business operator in the fast-food sector who serves thousands of meals per week to its customers, therefore the risk presented at the Leytonstone store was significant.'It was appreciated that McDonald's pleaded guilty and admitted wrongdoing at the first opportunity, however as a Council we take food hygiene seriously and won't hesitate to follow up complaints and take action where appropriate, irrespective of who operates the food business.'Residents and visitors should feel confident and assured that when they check a premises' food hygiene rating in Waltham Forest, they know their food has been cooked in a clean and safe environment and that we take a zero-tolerance approach to serious hygiene contraventions.'",
        "In October 2021 the customer was said to have been 'halfway through' eating their cheeseburger when they looked down at the inside of the food wrapper and spotted what they thought was a mouse dropping.",
        "After complaining to Waltham Forest Council health officers discovered conditions at the restaurant which presented 'a real and imminent risk' to the health of customers eating there and immediately ordered the restaurant to close - with those sat eating asked to leave halfway through their meals.Mouse droppings were even found on the floor of the food preparation and main cooking section; in the main cooking area next to a tray of cooking utensils; in the hot holding food preparation area on the main floor; in the staff room; in a storage area and cleaning store cupboard, and even in a box containing a bottle of caramel drizzle drink sauce. The horrific hygiene conditions were discovered despite staff having completed paperwork claiming that cleaning schedules had been completed."
    ]
}