{
    "articleURL": "/wires/aap/article-12061595/Knights-hit-NRL-mid-season-holiday-critics.html",
    "content": [
        "Newcastle players have hit out at critics of their mid-season break, claiming time off during the bye week was crucial for refreshing both their body and mind.",
        "The Knights were heavily criticised for taking holidays in the lead up to Magic Round, as the one club not featuring in the NRL's marquee weekend.Canterbury football boss Phil Gould was among the critics, claiming players should find another job if they did not want to train during the football season.The comments are known to have frustrated Newcastle, who were beaten 43-12 by Parramatta in their last game before the break to leave them 12th on the ladder.But players are adamant it was well deserved, given the timing of the bye was halfway through their rugby league year after returning for pre-season in November.\"If people want to have a crack at me for being away with my family, it's up to them,\" second-rower Tyson Frizell said.\"It's something that has been put in place by performance staff before the season started.\"People don't understand that we train through the next two byes. There has to be a period of time through the year where you get a few days off.\"Mentally it is refreshing. Some boys have been here since November 2, training their backside off.\"We got a few days off, and people can do whatever they want with that time.\"The Knights also rejected claims of a team trip to Bali, claiming centre Bradman Best was the only player to head to the holiday hotspot.",
        "\"They said the whole team went to Bali, it was one bloke. Bradman,\" prop Daniel Saifiti said.\"He has been here since November 2 training his butt off, so he deserves it. A lot of the boys stayed back and trained.\"I went down to Sydney with my partner and son.\"I feel refreshed ... It's a long competition. If you don't have that break, not just for the body but the mind. It helps with not burning out.\"Frizell also insisted that Newcastle did not need to move Kalyn Ponga back to fullback against Gold Coast on Sunday, confident Ponga could find his feet at No.6.Newcastle legend and consultant Andrew Johns has been among those to call for Ponga to return to No.1, after struggling defensively in his second game back from concussion against Parramatta.\"He had one tough game, he is his own worst critic. He knows that,\" Frizell said.\"It doesn't mean he can't perform at No.6. Everyone knows he is a quality player.\""
    ]
}