{
    "articleURL": "/sport/football/article-12056755/Vincent-Kompany-signs-new-five-year-deal-Burnley-guiding-Clarets-Premier-League.html",
    "content": [
        "Vincent Kompany has signed a new five-year contract to stay at Burnley It comes after the Belgian guided The Clarets back into the Premier League Following a dominant Championship season, Kompany will now stay until 2028 Vincent Kompany has penned a new five-year contract at Burnley after guiding the the Clarets back into the Premier League. ",
        "The Belgian, who signed with the club in 2022, masterminded their dominant season in the Championship, having lost only three games this season while racking up a whopping 98 points with one game still to play. Impressively, they secured promotion against Middlesbrough last month even with seven games still to play, having scored the most goals (84) and conceded the least (35) to book their promotion back to the top-flight after a year's absence. His side also secured the Championship title against Blackburn with three games to go, a testament to how dominant they've been this season, and now have the chance to become one of only a handful of teams to amass more than 100 points in a single Championship season. And despite rumours that several clubs, including Tottenham, were gearing up make a swoop for the 37-year-old, Kompany has now re-signed with Burnley until at least 2028. ",
        "A statement on the club's website today read: 'Burnley Football Club is delighted to announce that manager Vincent Kompany has signed a new contract to extend his commitment with the club.' Mail Sport previously reported that the Burnley boss was intending to stay at Turf Moor, despite speculation over his future. And the Belgian today expressed his delight on the confirmation that he would be re-signing for the club.  ",
        "'Burnley and Turf Moor felt right pretty much from the start - so it also feels right to sign for the next five years,' he said. 'Together with the fans we have made Turf Moor a fortress again and continue to look forward to the future and the job of making Burnley better with every step.'The news comes as Burnley had their transfer embargo lifted earlier this week, a ban that was placed on the club after they failed to submit their financial accounts to Companies House and the EFL on time. That means Kompany will now be free to strengthen his side in preparation for their return to the Premier League, with the Belgian, again expressing his joy at the news, saying: 'its now business as usual.'After Sean Dyche was sacked by the club following their relegation from the Premier League last season, Mike Jackson took over as the club's interim boss before Kompany took charge. Having spent time under the stewardship of Pep Guardiola at Manchester City, the Belgian international moved to his boyhood club, RSC Anderlecht, where he started his managerial career. Arriving at Turf Moor, Kompany overhauled the Burnley squad and playing style and has come to be regarded as one of the most exciting and promising managers in the game. ",
        "The Claret's boss was also recently named Championship manager of the season, beating Micheal Carrick to the award, which is no mean feat considering the excellent work the former Manchester United midfielder has done at Middlesbrough.But the news will come as a blow to Spurs who had reportedly added the former City defender to their shortlist of managers to take over from Antonio Conte. ",
        "Speaking on Kompany's contract renewal, Clarets chairman Alan Pace added: 'We are ecstatic Vincent has signed a new deal!'He is the perfect fit for how we all see Burnley Football Club moving forward.'An extraordinary leader, setting ever higher standards and driving our club to the levels we all want to achieve.'The Clarets will now wrap up their season, presenting the Championship trophy to a sell-out crowd at Turf Moor as their side take on Cardiff on Monday night. "
    ]
}