{
    "articleURL": "/sport/football/article-12047477/JONNY-OWEN-glorious-history-theres-no-running-away-crisis-adidas.html",
    "content": [
        "adidas has often been faced with moments of crisis - they're in another right nowWhile fans should let Wrexham be happy - though we're supporting Notts CountyMail Sport's guest columnist Jonny Owen looks at football's coronation parallelsMy love of adidas and the culture of terrace fashion is a lifelong one. I reckon I have owned a few hundred pairs. My latest favourites are the old classics, Gazelles and Jeans - although recently I've loved a pair of blue and yellow Zurros. ",
        "I have summer colour trainers (or 'daps' as we call them in South Wales) and wear the more robust leather Sambas in the winter months. It's different pairs for different days and I'll tell you now it's not just me. Thousands of us do it.There are my mates Tony and Robin and Dave. We've been doing it for over 35 years and we'll be doing it when we're on Zimmer frames. I mean, what's more comfortable as you get older than your favourite old trainers?Meanwhile, the global 'sneaker' market is predicted to reach $120billion by 2026 and Sotheby's have recently appointed Brahm Wachter as Head of Streetwear and Modern Collectables (AKA 'Head of Sneakers').This followed the sale of a game-worn pair of Michael Jordan's Nike Air Jordan 1s for $560,000 in an auction in 2020. One pair. Half a million quid!",
        "The days of the gloriously permed Kevin Keegan posing in ridiculously tight shorts and Patrick boots in Shoot! magazine have been replaced by super-brands launching limited edition releases associated with celebrities, fashion houses or hip-hop artists.Which brings us to the crisis that is engulfing adidas. And it's a fine mess indeed. If you don't know, the sportswear powerhouse entered into a collaboration with the designer and rapper Kanye West (now known as Ye).",
        "The contract was terminated following his discriminatory language, including praising Adolf Hitler. The fall-out left adidas with a mountain of unsold 'Yeezy' product while admitting they could suffer an operating loss of $750m this year. That's a lot of trainers. They also announced an investigation into claims he created a toxic environment, including showing explicit images of himself and his ex-wife Kim Kardashian to adidas staff.This week has seen investors file a lawsuit in Oregon, claiming adidas did not take the artist's outspoken past into account when employing him as a brand collaborator. adidas says it will 'vigorously defend itself'.I find it strange that a company with such an acute awareness of its own remarkable history didn't foresee trouble ahead. Founded by cobbler brothers in 1949, Adolf and Rudolph Dassler would later spectacularly fall out. To such an extent, they divided everything they had in half and staff were allowed to pick which brother they followed. What was to become a famous Bavarian German town was split between Adolf's (Adi's) adidas and Rudolph's new Puma franchise.The rest of Germany even had a saying for it. It roughly translated as: 'check the feet of the people in Herzogenaurach and you know by their shoes who they work for.' Families employed at one factory would rarely socialise or inter-marry with the other.",
        "When West Germany won the World Cup in 1954, they wore adidas screw-in studs and the impact it had on the German economy gave its people a pride (remember they were an international pariah) that cannot be understated. It's such a great shame the brothers never made up because, between them, by the time they died the world's largest sports brands had been created. Imagine what might have been working together?My favourite story remains of how, when they still were a partnership, they saved their factory as The Allies, led by the Americans, rolled into Herzogenaurach. Their sportswear factory was now producing German anti-tank guns for the Wehrmacht. We'd know them better as Bazookas.The order was given to American tanks to flatten it. Remarkably Adi's wife Kathe stood in front of them and shouted to one of the commanders that her husband was the man who had provided the running shoes for American athlete Jesse Owens, winner of four gold medals at The Berlin Olympics in 1936.Success that so enraged Hitler, as an African American beating all before him, he stormed from the stadium. As the tanks rolled on, more American soldiers gathered and asked if this was true? Yes, replied the usually shy Adi. 'I found Jesse and offered him my shoes because they were the best and so was he,' said the founder.",
        "It was enough to save his factory from destruction and the brave act created a platform, once The War was over, to grow into one of the greatest of all fashion brands. The three stripes (representing North America, Europe and Asia) are known throughout the world.So adidas, it seems, has often been faced with moments of existential crisis. It'll be interesting how this one works out. They've taken a few kicks before, this one might hurt for a bit longer.Stop sniping at Wrexham - it's heartwarming!I've enjoyed Wrexham being promoted back to the football league. They partied up in North Wales this week with it all culminating in an open-top bus parade with my daughter, Katie, as DJ.I've noticed (this is always the way in life when someone has some success) a fair bit of sniping from the sidelines, but I can tell you now that there isn't a fanbase on the planet that deserves it more than the Wrexham faithful.They have had the most wretched owners imaginable. They have marched to stop their club being wound out of existence and the ground sold. If you can't find it in your heart to see them being saved by two hugely likeable (and immensely successful) American actors then you have no heart. Or you're a Chester City fan.",
        "Football tots up Coronation parallelsWhen there was last a Coronation in 1953, football was very different… but in some ways just the same. The team of the era, Stan Cullis's Wolves, had won the title and were itching to begin the march towards testing the best in Europe with the first competition still a few years away. Stanley Matthews starred in probably the most famous FA Cup final of them all as he finally won a winner's medal with Blackpool. Alexander Matthew Busby was busy building his Babes and had just bought a young miner (remember them?), Tommy Taylor, for a record fee from Barnsley. Meanwhile Liverpool had fallen into the second division where it would take the then Grimsby Town manager, Wullie Shankly, as his family called him, to take them back to glory at the end of the decade.In the UK there was still rationing, there was no such thing as rock and roll or youth fashion, you dressed like your Father and went to work at 15, unless you were the tiny percentage who went to University.There was a huge surge in public pride with a new Queen, Edmund Hillary and Sherpa Tenzing Norgay climbing Everest and Ian Fleming releasing his first James Bond novel.Sadly at the end of the year this pride took a dent as England finally lost their 90-year unbeaten home record against teams outside the British Isles with a hammering from Hungary.",
        "In the crowd that day was a young John Stein plying his trade as a centre-half at Glasgow Celtic, who had sent their team down to watch the game. He looked on transfixed and determined to take what he'd seen and build his own history there one day. Fourteen years later he won the European Cup with a team all born within 30 miles of Parkhead. Becoming the first British manager to do so.",
        "We're all Notts County fans...It seems you can't mention Wrexham these days without a nod to Notts County. They have been neck and neck in an enthralling season.I must declare I had two dogs in the fight as my Mrs (actress Vicky McClure) is a lifelong County fan. It comes from her Grandad, Ralph McClure, and her Mum Carol.Vicky's Grandad is a D-Day veteran and still a ticket holder at the grand old age of 98! Remarkable. He even remembers the Scottish genius Hughie Gallacher playing for the Magpies of Nottingham in the 1936/37 season.Like lots in football I hope County, the oldest club in the football league, regain their treasured position.As with Wrexham they are an historical club; their kit is even the basis for the Old Lady of Italian football, Juventus's, world-famous design.Our house will be cheering them on in the play offs against Boreham Wood this Sunday for sure.",
        "Listen to Jonny Owen and Friends on talkSPORT every Sunday from 9-11 "
    ]
}