{
    "articleURL": "/wires/ap/article-12053345/Biden-hopes-strong-job-market-means-soft-landing-economy.html",
    "content": [
        "WASHINGTON (AP) - For President Joe Biden, the past few days have raised hopes that the U.S. economy can stick a soft landing-possibly avoiding a recession as the 2024 election nears.",
        "Most U.S. adults have downbeat feelings about Biden's economic leadership, as high inflation has overshadowed a strong jobs market. It's long been economic orthodoxy that efforts to beat back inflation by the Federal Reserve would result in unemployment rising and the country sinking into recession.But to the president and some economists, the April jobs report issued Friday challenged that theory with its 3.4% unemployment rate and 253,000 jobs gained.The strong jobs report came after a Wednesday Fed meeting that suggested the U.S. central bank might pause on its rate hikes, the primary tool for cutting inflation from its still high 5% to something closer to 2%. Talks are also starting over the need to raise the debt limit - with Biden inviting congressional leaders to the White House for a Tuesday meeting in hopes of ultimately getting a commitment to avoid a default.For a president seeking a second term, Biden struck a confident tone Friday when meeting with aides even as he pushed GOP lawmakers for a clean increase on the debt cap.\"We´re trending in the right direction and I think we´re making real progress,\" he said about the overall economy, telling Republican lawmakers to not \"undo all this progress\" with the debt limit standoff.",
        "The economy could still stumble. Several economists forecast a recession this year, considering the wild cards of the war in Ukraine, global tensions and the debt limit fight. But the steady job gains have suggested to some policymakers and economists that it's possible to curb inflation without layoffs.",
        "Fed Chair Jerome Powell told reporters Wednesday that the current trends are going against history.\"It wasn´t supposed to be possible for job openings to decline by as much as they´ve declined without unemployment going up,\" Powell said. \"Well, that´s what we´ve seen. There´s no promises in this, but it just seems that to me that it´s possible that we will continue to have a cooling in the labor market without having the big increases in unemployment.\"Heidi Shierholz, president of the Economic Policy Institute, a liberal think tank, said there are currently no signs of a recession and if one erupts it will be due to Fed overreach.\"We are in the middle of a soft landing right now - we have shown we can bring down wage growth, bring down inflation,\" she said.But that doesn't mean voters are pleased with the economy. Inflation remains a persistent irritant as Biden has begun the process of launching his reelection campaign. GOP lawmakers have used the high prices in the wake of the pandemic as a political cudgel, with House Speaker Kevin McCarthy, R-Calif., insisting on spending cuts as part of a debt limit deal in order to reduce inflation. The debt limit deals with spending obligations that the United States has already incurred and not future spending.",
        "Just as Biden trumpets the solid job market, Fed officials could interpret the hiring as evidence that they need to raise rates higher and that could cause more pain for the economy and the Democratic administration.\"The starting point is the fact that inflation remains stubbornly high and politically troublesome,\" said Douglas Holtz-Eakin, a former director of the Congressional Budget Office and president of the center-right American Action Forum. \"The Fed would like to get it down. The data don´t just seem to behave. The Fed could very well hike again in June - and that would cause the financial markets to lose their collective mind.\"There is also the possibility that lawmakers fail to avert a default. Or, there could be so much drama over getting to a debt limit deal that the economy gets weaker this summer. The Treasury Department has forecast that its accounting maneuvers to keep the government running could be exhausted by early June, at which point an agreement would need to be in place.The White House released estimates showing that brinkmanship over the debt limit - even if a deal comes together - could still cost the economy 200,000 jobs.Nor are all economists convinced the U.S. economy has escaped the gravitational pull of a recession.",
        "Many believe it could occur later this year, possibly shaping the 2024 campaign. The jobs report might only be a temporary reassurance for Biden, rather than a lasting win. The historical pattern could reassert itself right as the campaign season begins to intensify.\"The strong performance of the labor market dampens expectations of an immediate recession,\" said Kathy Bostjancic, chief economist at the insurance company Nationwide. \"Our view remains that a recession remains on the horizon, unfolding in the second half of the year, but the ongoing solid job gains and buoyancy in wage growth does suggest it could start later in the year.\""
    ]
}