{
    "articleURL": "/sport/football/article-12054579/Werder-Bremen-1-2-Bayern-Munich-Gnabry-Sane-net-send-Tuchels-four-points-clear.html",
    "content": [
        "Bayern went into Saturday's match with a one-point lead over DortmundSerge Gnabry and Leroy Sane scored second-half goals for the visitorsThomas Tuchel's side are now closing in on another Bundesliga title Bayern Munich survived a nervy finish to edge closer to the Bundesliga title with a 2-1 win over Werder Bremen that opened up a four-point lead over Borussia Dortmund on Saturday.",
        "Gnabry broke through in the 62nd minute, seizing on the loose ball and scoring after Jamal Musiala mishit a shot off Sadio Mané's pass. Leroy Sané doubled the Bayern lead 10 minutes later with a first-time shot from a narrow angle off Noussair Mazraoui's incisive throughball.Bremen brought the game back to life out of nowhere when Niklas Schmidt curled a long-range shot into the top corner in the 87th, shortly after coming off the bench.Bremen tried to level the score but Bayern held on with smart defending and some strategic timewasting.",
        "Bayern dominated most of the first half without generating any chances of note against the compact Bremen defense, besides a Benjamin Pavard header pushed away by goalkeeper Jirí Pavlenka.Bremen gave Bayern a scare first when Mitchell Weiser failed to make contact with a cross in front of goal, then again soon after when midfielder Christian Gross surged through the center of the field past two defenders but missed the target.Bayern will be assured of a record-extending 11th successive German title if it wins its last three games against Schalke, Leipzig and Cologne.Dortmund, which dropped the league lead after drawing with Bochum last week, hosts seventh-placed Wolfsburg on Sunday.",
        "Werder Bremen (3-5-2): Pavlenka; Pieper (Velkjovic 55), Stark, Friedl; Weiser, Bittencourt (Schmidt 82), Gross (Gruev 77), Stage, Jung (Buchanan 77); Schmid, Ducksch (Philipp 77)Goal: SchmidtBooked: Pieper, FriedlManager: Ole WernerBayern Munich (4-2-3-1): Sommer; Mazraoui, Pavard, De Ligt, Cancelo; Gravenberch (Muller 64), Kimmich; Coman (Sane 64), Musiala, Mane (Sarr 88); Gnabry Goals: Gnabry, SaneBooked: CanceloManager: Thomas Tuchel "
    ]
}