{
    "articleURL": "/news/article-12047105/Migrants-LINE-border-seven-days-Title-42-expires.html",
    "content": [
        "Migrants are waiting to cross ahead of Covid emergency laws being scrapped next week An ex-Trump official warned the U.S. is about to face 'an invasion' Republicans have vowed to pass tougher laws to stop migrant crossingsMigrants lined up at the U.S.-Mexico border on Thursday as hundreds of would-be asylum-seekers await their chance to sneak into the country illegally.",
        "Immigrants are camped out near the border town of San Ysidro in California ahead of the expiry on May 11 of a Trump-era Covid diktat that makes it easier to boot out illegals.The Biden administration will send an extra 1,500 troops to the southern frontier to join the 2,500 already battling to stem the flow of people crossing over. ",
        "But so far the president has ignored Republican pleas to extend the emergency powers that allow authorities to deport migrants without hearing their asylum case.   Ken Cuccinelli, who served as Deputy Secretary of Homeland Security in the Trump administration, told Fox News the US will face a surge in asylum claims he branded 'an invasion.' 'A good chunk of the southern hemisphere is lining up at the border,' he said. 'They are going to dash into the country.''This administration doesn't care,' the former lawyer added. A deal was struck with Mexico on Thursday for the country to take back Cubans, Haitians, Nicaraguans and Venezuelans who are rejected from the US border from next week.  'This is a hemispheric challenge that demands hemispheric solutions,' DHS Secretary Alejandro Mayorkas said.'Working with our neighbors in the region, we can and will reduce the number of migrants who reach our southern border,' he added. ",
        "But the Republican-led House of Representatives, the lower chamber of Congress, is planning to pass tougher immigration laws Thom Tillis, the Republican senator from North Carolina, said the end of Title 42 'sets the table' for Congress to craft new legislation amid predictions of a surge in arrivals.",
        "More than 2.3 million migrants tried to illegally sneak into the United States across the Mexican border last year, according to U.S. Customs and Border Protection.That is up from 1.7 million people in 2021 and just over 450,000 the previous year when much of the world was locked down during the coronavirus pandemic.Emergency powers to remove migrants, known as Title 42, come from a 79-year-old federal law that Trump used from the start of the coronavirus pandemic.Republicans are also angry that Joe Biden axed his predecessor's flagship anti-immigration policy: a $16.6-billion border barrier along the frontier with Mexico. Some border towns, including El Paso in Texas, have already declared a state of emergency.The administration says it will use different legal tools to try and stem the amount of people trying to cross.Those powers, known as Title 8, will mean undocumented migrants detained inside the United States will be punished in such a way that will render them ineligible to come to the country legally."
    ]
}