{
    "articleURL": "/wires/reuters/article-12060201/Germany-Austria-Italy-urge-EU-hydrogen-projects.html",
    "content": [
        "By Kate Abnett",
        "BRUSSELS, May 8 (Reuters) - Austria, Germany and Italy have pressed the European Union to support a cluster of infrastructure projects to transport green hydrogen imported from North Africa, as part of efforts to build a market in Europe for the low-carbon fuel.Europe is attempting to scale up its production and imports of renewable hydrogen - a fuel manufactured using renewable electricity, which countries are betting on to cut fossil fuel use in industrial processes like steel-making.Ministers from Austria, Germany and Italy wrote to the European Commission on Monday, giving their political backing to a handful of hydrogen projects seeking the EU's Project of Common Interest (PCI) status, which would give them access to certain EU funds and fast-tracked permits.The ministers' move puts pressure on Brussels to award the projects priority status.\"The development of the project candidates will contribute to security of supply and greater diversification of import sources, while at the same time reducing fossil dependencies,\" said the letter, seen by Reuters.The projects seeking support include Gas Connect Austria's planned hydrogen pipeline between Germany, Austria and Slovakia. Another proposal would convert a gas pipeline majority owned by Italian company Snam, running from Italy through Austria to Slovakia, to carry hydrogen instead.The proposed infrastructure would connect European hydrogen demand hubs - such as factories - to renewable hydrogen imports from North Africa, and contribute to building a European hydrogen network, the letter said.",
        "The push for the projects comes as Europe is racing to bolster renewable energy sources as an alternative to Russian gas supplies, following Moscow's invasion of Ukraine.With a range of sectors eyeing renewable hydrogen as a way to cut their carbon footprint, Europe's demand for the fuel is expected to outstrip local supply, meaning imports will be needed.The EU wants to produce 10 million tonnes of renewable hydrogen and import another 10 million by 2030.Other hydrogen projects are planned for southern Europe. A proposed \"BarMar\" pipeline would from 2030 transit low-carbon hydrogen between Spain and France, aiming to carry 2 million tonnes a year. (Reporting by Kate Abnett Additional reporting by Andreas Rinke, Sergio Goncalves, Belen Carreno and Pietro Lombardi Editing by Mark Potter)"
    ]
}