{
    "articleURL": "/wires/reuters/article-12049873/Australias-banks-look-diversify-mortgages-rates-peak.html",
    "content": [
        "By Praveen Menon and Byron Kaye",
        "SYDNEY, May 5 (Reuters) - Australia's top banks may be forced to look beyond their traditional residential mortgages business for growth as the windfall from high interest rates peaks and the risks from runaway inflation and competition rises.ANZ Banking Group Ltd, which reported a 23% jump in cash profit on Friday, signalled it will look to diversify beyond mortgages, which have become increasingly competitive.\"It (Australian home loans) is certainly not as attractive as it used to be,\" ANZ CEO Shayne Elliott said after the country's No. 4 lender reported earnings from its institutional arm overtook home lending.\"Margins have been declining for 30 years, there's been a few blips along the way, but we think the downward trend is going to resume,\" he added, referring to mortgages.Australia's \"big four\" - ANZ, Commonwealth Bank of Australia (CBA), National Australia Bank Ltd (NAB) and Westpac Banking Corp - control three-quarters of the mortgage market where the value of new loans fell 29% last year.The housing market is struggling as Australia's central bank raised rates by 375 basis points in the past year to tame inflation, limiting borrowing capacity. Competition in a stagnant mortgage market has become so fierce that some banks are offering cash payments to lure borrowers.Inflation still sits at 7.0%, well ahead of Reserve Bank of Australia's 2-3% target range, meaning more interest rate hikes are possible.",
        "\"It's difficult to see us going back to a low-inflation, low interest rate environment for some time,\" said Elliott told journalists on a call.Macquarie Group posted another record profit primarily driven by a strong performance from its commodities trading businesses.CEO Shemara Wikramanayake said the bank's capital surplus of A$12.6 billion ($8.5 billion), up from $A10.7 billion in the previous financial year, places it in a good position to tap other opportunities given global uncertainties.National Australia Bank Ltd, the country's No. 2 lender, which reported its earning on Thursday also said the company would focus on expanding business in areas more profitable than mortgages. ($1 = 1.4841 Australian dollars) (Reporting by Praveen Menon and Byron Kaye in Sydney; Editing by Lincoln Feast.)"
    ]
}