{
    "articleURL": "/wires/reuters/article-12040611/Signify-earnings-miss-estimates-lower-consumer-demand.html",
    "content": [
        "By Matteo Allievi and PierreJohn Felcenloben",
        "May 3 (Reuters) - Signify, the world's biggest lighting maker, missed first-quarter core profit expectations on Wednesday due to persistently weak demand notably in its second-biggest market China, sending its shares down 10%.Lower consumption, supply chain disruptions and China's extended COVID restrictions last year have taken a toll on Signify's earnings, though the company has been more upbeat about the current year's prospects.The Dutch group reported first-quarter earnings before interest, taxes and amortisation (EBITA) of 83 million euros ($91.5 million), well below analysts' forecast of 130 million euros in a company-provided consensus.\"The cost of (China's) zero-COVID policy has weighed a lot on the finances of municipalities, regions and provinces,\" CEO Eric Rondolat said on a press call about Signify's second largest market.\"They need to bring back some cash and reinvest. The projects are there,\" Rondolat added.Signify, which sells LED lighting systems and electronic components among others, said it had seen China's economic activity pick up in the first quarter.Rondolat said the current quarter would be challenging for the group, but there should be improvement in the second half of the year.The company confirmed its 2023 outlook for operating profitability in the range of 10.5% to 11.5% and free cash flow between 6% and 8% of sales.",
        "However, analysts at J.P.Morgan said the step up required in the second half to reach the 2023 margin guidance seemed \"ambitious\" given the risk of a cyclical slowdown.Signify's sales fell around 6% to 1.68 billion euros in the quarter, as most markets recorded year-on-year declines.Rondolat said the impact of China's COVID restrictions were an \"important negative contributor\", along with slower sales to original equipment makers. (Reporting by Matteo Allievi and Pierre John Felcenloben in Gdansk; Editing by Milla Nissi and Emelia Sithole-Matarise)"
    ]
}