{
    "articleURL": "/money/saving/article-12041739/Savings-rates-hit-5-Raisin-launches-SIX-market-leading-deals.html",
    "content": [
        "Işbank is offering a one-year fix paying 5% via savings platform, Raisin UKIt has also launched a two, three, four, five and seven year fix - all paying 5%Savers depositing with the bank via Raisin are FSCS protected up to £85kProducts featured in this article are independently selected by This is Money’s specialist journalists. If you open an account using links which have an asterisk, This is Money will earn an affiliate commission. We do not allow this to affect our editorial independence. ",
        "Savers can now get 5 per cent when putting their money in the bank, as long as they are prepared to fix for a year or more.Savings platform, Raisin, today announced a bank on its platform has launched six savings deals - all paying 5 per cent*, with deposits fully protected by the UK's deposit guarantee scheme, up to £85,000 per person.The bank at the heart of it all, Işbank, is offering a one-year fix paying 5 per cent - the highest one-year rate since January 2009, according to Moneyfacts.",
        "Someone stashing £10,000 in this account could expect to earn £500 in interest over the 12 month period.Işbank is also offering five other deals for savers who'd prefer to fix for longer - all paying 5 per cent.This means savers can fix for two, three, four, five or even seven years and secure a 5 per cent rate in the process.Someone fixing £10,000 at a rate of 5 per cent over a seven year term will earn £3,500 in interest during that time.Savers will require a minimum of £1,000 to open any of the deals with deposits protected with Işbank up to £85,000 per person under the Financial Services Compensation Scheme.With all the accounts, interest is calculated daily and paid annually into a customer's Raisin account. From there they can either transfer to another savings deal or back into their bank account.",
        "Experts are urging savers to seriously consider these rates as they may neither be bettered, nor be available for long.Anna Bowes, co-founder of the website, Savings Champion, says: 'As things stand the markets are anticipating that base rate will peak at 5 per cent, so this is a massively competitive rate.'Based on market predictions, I'm not sure whether many will compete and this bond is unlikely to be available for long – certainly for the shorter terms.'Given that the Bank of England, the OBR and even the Prime Minister are all forecasting inflation to fall dramatically later this year, savers are also being advised to consider longer term deals in case interest rates fall in the future.However, savers would be wise to remember that fixed rate deals do not permit withdrawals before the end date, except in exceptional circumstances such as if an account holder dies, becomes mentally incapacitated or bankrupt.Bowes added: 'With inflation predicted to fall in the next six months according to [former Bank of England chief economist] Andy Haldane, locking in for the longer term could be a very sensible move.'If inflation falls much closer to the 2 per cent target you could find yourself earning close to or even more than inflation for much of the term.",
        "'Of course nothing is certain, so a balanced approach could give greater peace of mind as of course once you have locked into a fixed rate bond, you can't access until maturity.'",
        "How can you apply?To open one of these accounts, savers must apply online through the platform Raisin UK.There is also a Raisin smartphone app for those who prefer to manage their finances through their mobile phone.Raisin operates as a savings marketplace. It allows savers to manage all their savings through a single online account. Users can open multiple savings accounts with numerous different banks as and when they require without the usual form filling and admin. What is Işbank?Founded in 1924, Işbank has continued to grow, becoming Turkey's largest private bank, according to Raisin UK.It provides commercial and retail banking services and, as of 2020, had approximately 9.2 million digital customers.",
        "The FSCS protects deposits made into savings accounts offered by Işbank through Raisin's marketplace, as Işbank Ltd is a fully authorised and regulated by the UK Prudential Regulation Authority and Financial Conduct Authority.Işbank Ltd is listed on the FSCS website under their official name in Turkish, Turkiye Is Bankasi AS.Watch your personal savings allowanceThe downside to rising savings rates is that increasing numbers of savers are becoming liable for tax.Although most Britons have a personal savings allowance that gives them an initial buffer, anyone with large amounts of savings is likely now surpassing this.",
        "PGRpdiBkYXRhLW1vZHVsZS12ZXJzaW9uPTEuNC4wIGRhdGEtbW9sLWZlLXhwbW9kdWxlLXNhdmluZ3MtbmV3c2xldHRlciBkYXRhLXBsYXRmb3JtPWlvcyBkYXRhLW5ld3NsZXR0ZXI9InNhdmluZ3MiIGRhdGEtY29sb3ItdGhlbWU9cHVycGxlIGRhdGEtZm9ybS1hY3Rpb24tdXJsPSJodHRwczovL2xpbmsubmV3cy50aGlzaXNtb25leS5jby51ay9zL1RoaXMrSXMrTW9uZXkrLStTYXZpbmdzK0FsZXJ0cyIgZGF0YS1wcml2YWN5LXBvbGljeS11cmw9Imh0dHBzOi8vd3d3LnRoaXNpc21vbmV5LmNvLnVrL2hvbWUvYXJ0aWNsZS03NzU5MjczL1ByaXZhY3ktQ29va2llcy1Qb2xpY3ktUG9saWN5Lmh0bWwiPjwvZGl2Pg==",
        "Basic rate taxpayers can earn interest up to £1,000 before paying tax while higher rate taxpayers can get up to £500 tax free.A higher rate taxpayer putting their spare cash in Işbank's one-year fix paying 5 per cent will only need to deposit more than £10,000 to begin exceeding their allowance. A basic rate taxpayer can deposit £20,000 before becoming liable for tax - of course this assumes they don't have savings held elsewhere.Anyone concerned about breaching their personal savings allowance should consider making use of their £20,000 annual Isa allowance.Although rates are slightly lower, a cash Isa will shield any interest earned from the taxman.- Check out the best cash Isa rates here.  ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}