{
    "articleURL": "/news/article-12050305/Mad-monarchist-eat-slice-Charles-Dianas-42-year-old-wedding-cake.html",
    "content": [
        "Gerry Layton, 63, will eat the cake it for breakfast to mark the King's coronationREAD MORE: Follow MailOnline's live blog ahead of the Coronation tomorrow Royal fanatic Gerry Layton will eat a slice of Charles and Diana's 42-year-old wedding cake to celebrate the Coronation.",
        "Gerry, 63, has decided that there is no bigger royal occasion to enjoy the mature fruit cake with marzipan and icing than the crowning of a new King.And he says he will start the big day by having it for breakfast to mark the coronation of King Charles.About 20 wedding cakes were made for the historic royal wedding in July 1981.It is believed the 8ins by 7ins section that Gerry owns was cut from the cake given to royal staff thanking them for their efforts after the wedding.",
        "It is thought the cake was given to Moya Smith, a member of the Queen Mother's staff. She kept it preserved in clingfilm before her family sold it in 2008.Gerry, a yacht skipper from London, paid almost £2,000 for it in 2021 and has resisted tucking into it.He said: 'You could call me a mad monarchist, I have the royal crest with the coronation flag flying outside my house at the moment.'This is going to be a very expensive breakfast, a slice from one of the most iconic cakes in the world.'There is plenty of cake attached to the icing marzipan base so I have tried a few nibbles.'It still had taste, although it was rather dry after 42 years.",
        "'I didn't have any after-effects from my nibbles so I will have a proper portion to celebrate on coronation day.'The rest of the cake I will save in its box and I will sell it with the rest of my collection for charity after my death.",
        "'I could not be more excited for the coronation, I think the whole country will get on board with the celebration.'I won't be swearing my allegiance because I have been doing that all my life with my love for the monarchy.'The monarchy is what makes Britain special, the pageantry and joy we can get from them gives us worldwide attention.'This will get Britain back on the world stage again, where we belong.'Gerry intends to spend the day in London watching the parade before captaining a luxury coronation party on one of his yachts on the River Thames."
    ]
}