{
    "articleURL": "/wires/afp/article-12050617/Hong-Kong-police-seize-dismantled-Tiananmen-protest-statue.html",
    "content": [
        "Hong Kong national security police seized an \"exhibit\" on Friday that has been identified by local media as a dismantled statue commemorating the deadly Tiananmen Square crackdown in 1989.",
        "The eight-metre-high (26-feet) \"Pillar of Shame\" by Danish artist Jens Galschiot -- featuring anguished faces in a twisted tower -- sat on the University of Hong Kong's (HKU) campus for more than two decades.It was dismantled in 2021 amid widespread outcry and the pieces have since been stored in a cargo container on an HKU property in Hong Kong's rural Yuen Long district.Police said in a statement the National Security Department conducted searches with a warrant on Friday and seized \"an exhibit related to an 'incitement to subversion' case\" in Yuen Long.\"Subversion\" is one category of offences introduced in Hong Kong in 2020 under a Beijing-imposed national security law. It can carry a maximum sentence of life in prison.The University of Hong Kong confirmed that police presented a search warrant and \"removed a piece of evidence\" from its Yuen Long site on Friday morning.The seizure comes just a month before June 4, which will be the 34th anniversary of the bloody crackdown by Chinese troops on peaceful pro-democracy protesters around Tiananmen Square in Beijing.An annual vigil commemorating the event in Victoria Park drew thousands every year and was a vivid illustration of Hong Kong's political freedoms.It was banned by police from 2020 following massive, and at times violent, pro-democracy protests.",
        "The three leaders of the Hong Kong Alliance, which organised the vigil, are awaiting trial for inciting subversion of state power.Galschiot told AFP he was surprised by the confiscation and was not notified by either the university or police.\"They can't use this sculpture as a kind of evidence against the democracy movement, because I'm the owner and it was my initiative to put it up in Hong Kong,\" he told AFP.The artist said he was considering legal action to assert his ownership of \"Pillar of Shame\".Galschiot said last year he had tried to move the statue out of Hong Kong but none of the logistics companies he approached agreed to help him because of fear of reprisal.Following the statue's removal from HKU in 2021, five other Hong Kong universities removed Tiananmen monuments that had stood on their campuses for years."
    ]
}