{
    "articleURL": "/wires/pa/article-12056709/John-Mousinho-looks-forward-optimism-final-game-home-draw.html",
    "content": [
        "Portsmouth boss John Mousinho is optimistic about next season after an entertaining 2-2 draw at home to Wycombe.",
        "Pompey equalised twice, through Marlon Pack and Paddy Lane, with Garath McCleary and Lewis Wing –  with a long-range screamer – on target for the visitors in the final match of the 2022-23 Sky Bet League One campaign.Mousinho said: “We could have scored more today. We had chance after chance after chance, but it just didn’t fall for us.“Of the two conceded, the first one was sloppy, but the second was a wonder goal. One of those one-offs from about 50 yards.“If today’s performance is anything to go by, then the future looks promising.“Obviously the fans want us to shoot all the time but I felt that we did turn down a few opportunities to shoot in the first half.",
        "“The way we build is excellent at times and I was absolutely thrilled with how we did that today.“I think Paddy Lane has been excellent the last couple of games after a torrid six months. He’s looking good.”Pompey were the dominant side in the first half, yet it was Wycombe who opened the scoring in the 31st minute.A dreadful pass out from goalkeeper Josh Oluwayemi went straight to the feet of McCleary, who swept forward to power the ball under the goalkeeper’s body.Pompey fought back and deservedly levelled in the 44th minute as a second corner in as many minutes saw a Michael Jacobs cross headed home by Pack at the back post.",
        "The second half continued to entertain and in the 54th minute Wing hammered home from far out. However, Lane levelled 18 minutes later to ensure a point apiece.Wycombe boss Matt Bloomfield is also looking forward to the next campaign.He said: “We needed a good response to last week’s defeat (3-0 at home to Cheltenham) and I don’t think the players needed telling that. I’ve sensed in training that this sort of performance was possible today.“There was anger in the team after last week, and with nearly a thousand supporters making the trip, they didn’t want to disappoint.“We wanted to set the stall for next season, and I thought we did that. Three points would have been nice, but I thought a draw was fair overall.“We could have had a winner at the end, and would question the offside decision, but that’s football.“I thought we showed as an attacking threat overall. We certainly didn’t want to come here and play out a boring 90 minutes and a 0-0 before people go on their holidays.“We’re excited about the future of this club. It’s a special place to be and I’m pleased to be here.”"
    ]
}