{
    "articleURL": "/sport/football/article-12053859/Raheem-Sterling-insists-not-hide-critics-amid-Chelseas-disastrous-season.html",
    "content": [
        "Raheem Sterling called his first year at Chelsea one of his worst career momentsThe Blues are currently on course for their worst ever Premier League finishSterling added the club's next boss must be allowed to implement a blueprintRaheem Sterling has called his debut season at Stamford Bridge one of the lowest points of his career with Chelsea on course for their worst-ever Premier League campaign.",
        "After seven glittering seasons at Manchester City, Thomas Tuchel signed the 28-year-old in July as the club invested heavily in new owner Todd Boehly's first full season at the helm.Since then Sterling has seen both Tuchel, and his successor Graham Potter sacked with interim boss Bruno taking charge for just one game before a returning Frank Lampard took over with the club languishing in mid-table.Speaking to Sky Sports, the England international lamented his maiden season in west London but insisted that he is taking positives from the newfound challenge.'Personally, this is one of the lowest points in my career. This might sound a bit weird, but it is also a great learning curve.",
        "'It's been pretty smooth sailing winning, winning and winning but sometimes in life stuff gets thrown at you and it is a challenge that I'm looking forward to, hitting it head on and not trying to hide from it.'It will only make me stronger and also the group stronger. These challenges, not in just football but life as well, it's crucial to how we deal with things and how we kick on after.'After hitting double figures for league goals in each of his last five campaigns in Manchester, Sterling has netted just four times in the Premier League this season, most recently in a draw with Nottingham Forest on New Year's Day.",
        "The club have yet to confirm who will take charge next season, but former Spurs boss Mauricio Pochettino is the overwhelming favourite after Julian Nagelsmann pulled out of the running last month.",
        "Sterling added that the club's next boss must be able to implement their blueprint to be able to steer the Blues back towards success. 'I'm not one to tell the club what to do but from what I can gauge from where I was previously, organisation is the most important thing. 'Having a manager that has the final say on everything and it being his way with everyone having to follow that.'Successful teams always have a manager that comes in, brings his blueprint and everyone follows. If there are people that don't follow, then they are not part of the team and that is how brutal it needs to be at a high level."
    ]
}