{
    "articleURL": "/news/article-12047215/Republicans-say-Biden-IMPEACHED-alleged-criminal-scheme-foreign-national.html",
    "content": [
        "'I think that's a very strong possibility,' Oversight member Rep. Russell Fry, R-S.C., said on Fox Business Thursday morning. 'I think it's certainly on the table'Rep. Nick Langworthy, R-N.Y., told DailyMail.com if the allegations are proven it is the 'textbook definition of a high crime that would demand impeachment' A whistleblower has claimed that DOJ and FBI have an unclassified document showing Biden was involved in bribery scheme with foreign nationalSome Republicans are now floating the idea of impeaching President Biden over a whistleblower claim that he accepted cash from a foreign national seeking favorable policies when he was vice president. ",
        "Even though the claims have not been substantiated, a number of Republicans said if the claims were found to be true they would try to remove Biden from office. 'I think that's a very strong possibility,' Oversight member Rep. Russell Fry, R-S.C., said on Fox Business Thursday morning. 'I think it's certainly on the table.' Sen. Ted Cruz, R-Texas, floated the idea of impeachment on Fox News on Wednesday night. 'It doesn't have to be a high crime and misdemeanor,' he said, noting impeachment for bribery is 'explicitly noted in the Constitution.' 'The evidence of Joe Biden being complicit and profiting from this corruption is growing and growing,'  he claimed. Rep. Nick Langworthy, R-N.Y., told DailyMail.com if the allegations are proven it is the 'textbook definition of a high crime that would demand impeachment.'A whistleblower has claimed to Senator Chuck Grassley, R-Iowa and House Oversight Committee Chairman James Comer, R-Ky., that the Justice Department and FBI are in possession of an unclassified document that shows Biden was involved in a bribery scheme with a foreign national. ",
        "The unverified allegation is the most explosive claim yet from Comer and Grassley, who have dedicated significant resources to investigating Biden family business dealings. But Democrats suggest the whistleblower could have made the scheme up.",
        "'If President Biden is in fact compromised ... I don't see how we could not look into impeachment,' Oversight member Tim Burchett, R-Tenn., told DailyMail.com.  The pair wrote a letter to FBI Director Christopher Wray and Attorney General Merrick Garland saying the whistleblower claimed their agencies possess a record  'that describes an alleged criminal scheme involving then-Vice President Biden and a foreign national relating to the exchange of money for policy decisions. It has been alleged that the document includes a precise description of how the alleged criminal scheme was employed as well as its purpose.''It is a very serious allegation,' Grassley said on NewsMax Thursday. I wish I could say that I knew it was true or untrue.'Comer fired off a subpoena for  'all FD-1023 forms, including within any open, closed, or restricted access case files, created or modified in June 2020, containing the term 'Biden,' including all accompanying attachments and documents to those FD-1023 forms.'An FD-1023 is where the FBI documents materials obtained from confidential sources. The document could obtain allegations from the source that have not been verified. Rep. Jamie Raskin of Maryland, ranking Democrat on the Oversight Committee, accused Republicans of 'recycling unsubstantiated claims' that could have come from Rudy Giuliani or Russian agents trying to sway the 2020 election. ",
        "'During this same time period, Rudy Giuliani and Russian agents, sanctioned by Trump's Treasury Department, were peddling disinformation aimed at interfering in the 2020 presidential election,' Raskin said. 'Given Chair Comer's commitment to 'dismantle' the FBI, it's no surprise that he would rely on these unverified tips to attack President Biden in one more baseless partisan stunt.'Rep. Marjorie Taylor Greene has long called for Biden's impeachment and said now is the time to move forward with it, and Rep. Andy Biggs told DailyMail.com he would 'totally be on board' if there's a move to impeach the president.  But leadership on the Oversight Committee is not ready to talk about impeachment. 'Chairman Comer and the Oversight Committee are focused on obtaining the FD 1023 document from the FBI to determine the truth and accuracy of the information contained within it,' an Oversight spokesperson said in a statement to DailyMail.com. 'We aren't going to speculate on the outcome of the investigation and have not spoken to anyone about impeachment.' Iam Sams, White House spokesperson for oversight and investigations posted a response to Twitter calling the GOP action 'unfounded' and 'politically motivated.''For going on 5 years now, Republicans in Congress have been lobbing unfounded politically-motivated attacks against [President Biden] without offering evidence for their claims. Or evidence of decisions influenced by anything other than U.S. interests,' he claimed.",
        "'That’s because they prefer floating anonymous innuendo, amplified by the megaphone of their allies in rightwing media, to get attention and try to distract and deflect from their own unpopular ideas and lack of solutions to the issues the American people actually care about,' Sams added in a statement to DailyMail.com"
    ]
}