{
    "articleURL": "/wires/reuters/article-12043521/EQT-sounds-banks-manage-LimaCorporate-IPO--sources.html",
    "content": [
        "By Pablo Mayo Cerqueiro and Andres Gonzalez",
        "LONDON, May 3 (Reuters) - Private equity house EQT is weighing options including a possible initial public offering (IPO) for LimaCorporate, the Italian medical devices group it acquired in 2016, people familiar with the matter told Reuters on Wednesday.The buyout firm has been discreetly sounding out investment banks for a potential transaction, said the people, speaking on condition of anonymity. It may explore a private sale alongside a stock market listing, they added.An IPO might not take place until next year, as market conditions remain challenging for new listings, one person said.Milan is deemed the more likely venue should EQT proceed with a listing, though a case could also be made for a Swiss IPO, the people said.EQT declined to comment. LimaCorporate did not immediately reply to a request for comment.LimaCorporate, which designs orthopedic implants, posted revenue of 248.6 million euros ($274.5 million) for 2022, and adjusted earnings before interest, tax, depreciation and amortisation (EBITDA) of 66.2 million euros.It also reported a yearly loss of 27.9 million euros after taxes.Switzerland-based Medacta is LimaCorporate's closest valuation comparable, the people said. Medacta trades at 5.6 times its sales for the last 12 months and 21.1 times EBITDA, according to Refinitiv data.Based on those multiples, LimaCorporate could be worth in the region of 1.4 billion euros, including debt.",
        "EQT was reported in 2020 to be working with advisers on a possible IPO or sale of the business, but a transaction never materialised.The latest explorations come after LimaCorporate appointed a new CEO last year.They also follow a drought in IPOs in Europe, after soaring interest rates and economic and geopolitical uncertainty all but ground the market to a halt last year.($1 = 0.9056 euros) (Reporting by Pablo Mayo Cerqueiro and Andres Gonzalez in London; Additional reporting by Elisa Anzolin in Milan; Editing by Elisa Martinuzzi and Jan Harvey)"
    ]
}