{
    "articleURL": "/tvshowbiz/article-12050259/Tik-Tok-star-Bobby-Moudy-died-suicide-suffering-financial-struggles.html",
    "content": [
        "TikTok star James 'Bobby' Moudy committed suicide due to 'financial pressures'The beloved performer is survived by his wife and three childrenThe National Suicide Prevention Lifeline is 1-800-273-8255. Crisis Text Line can be reached by texting HOME to 741741 A father-of-three who rose to prominence as a TikTok star has died by suicide aged 46, his family have confirmed.",
        "James Robert Moudy - known affectionately as Bobby - passed away in Mississippi on April 28 after struggling with 'financial pressures', according to a statement issued by his family.'Bobby was full of life and laughs,' the statement read. 'But also weighed down by financial pressures. His wife, Jennifer and their three children are in an emotional and financial crisis as he was their rock.'The social media star and 'loving father and husband' garnered 360,000 followers and over 18.6 million likes on TikTok, and shared his last video just two days before his death. ",
        "The performer leaves behind his wife Jennifer, and kids Kaytlin, Max and Charleigh, who were a regular fixture on his 'day-in-the-life' videos as they racked up millions of views. His last video was of his daughter Kaytlin, who featured heavily on his Tik Tok page over the years. The beloved father even said in his bio he was 'just here to embarrass my daughter'. In her own heartbreaking statement, Kaitlyn wrote: 'On April 28th my best friend was able to see our Heavenly Father. 'He was the most amazing dad, brother, uncle, and friend. He had such an impact on not only his family but those around him. 'He was and is still so loved by so many. He will forever be remembered. I hope you're hugging Louie tight for us. We're counting down the days until we see you again.'",
        "According to TMZ, Bobby died at his home in Mississippi, however the circumstances surrounding his suicide are currently unknown. Friends of the Moudy family have set up a GoFundMe to help the family through their loss and financial struggles in the wake of Bobby's death.'If Bobby touched your life in any way, personally or through his fun family TikTok page, please consider helping his family through this devastating time,' the fundraiser said. ",
        "Commenting on Bobby's final video, his wife Jenny asked their followers to 'pray' for the family in the wake of his sudden death.'Y'all please keep praying for us and @kaytlin moudy we will try to update y'all soon,' she said. 'He loved being goofy and making friends on this app. Pray for us.' An obituary for the late star described him as 'an avid outdoor enthusiast' who 'enjoyed fishing, hunting and camping.' The obituary said after meeting Jennifer in 1999, the couple married in 2004 and started their family, where he became 'a devoted husband, father and brother'. 'He was happiest showing his love and support for his kids,' it continued. 'He was often the loudest voice on the sidelines cheering on his children at their sporting and educational events. 'He approached life with a contagious enthusiasm and a smile.' ",
        "On her own page, Jenny posted a heartbreaking tribute to the TikTok dad, with a montage of images of her late husband alongside the music to Israel Kamakawiwo'ole's Somewhere Over The Rainbow.She wrote: 'My precious Bobby! Go fund me in bio for his 3 babies.' In response to a fan's message about his death, she added: 'I keep thinking he will walk in the door any minute'. Messages of support for the family from the performer's legion of fans have flooded in in the days following the tragedy. 'I don't believe this is real,' said one, with another follower adding: 'I'm sorry for your loss, and I'm sorry he was struggling so badly in silence.' "
    ]
}