{
    "articleURL": "/wires/reuters/article-12041823/After-Qatargate-EU-executive-proposes-stepping-fight-against-corruption.html",
    "content": [
        "By Gabriela Baczynska",
        "BRUSSELS, May 3 (Reuters) - The European Union executive proposed new laws on Wednesday to step up fighting corruption through aligning definitions and penalties for graft crimes across the bloc, as well as introducing sanctions for corrupt foreigners.The draft new EU laws would take effect if approved by all 27 member countries, as well as the European Parliament, which was rocked last year by a major corruption scandal involving World Cup host Qatar.A 2022 Eurobarometer survey showed 68% of citizens across the EU believed corruption was widespread. Only about a third of people had trust in anti-corruption efforts.\"There are two big factors that decrease people's trust in democracy - abuse of power and corruption. And no country in the EU is totally immune,\" said Vera Jourova, a deputy head of the European Commission responsible for democratic values.\"That's why we think it important to act.\"Under the proposal, all EU countries would need to adapt their criminal codes to harmonise definitions of graft crimes beyond bribery to include misappropriation, abuse of function and illicit enrichment.Standardising legal definitions and related jail terms would help cross-border investigations, the Commission said.Shared aggravating circumstances would cover cases of corruption among high-level officials and those in law enforcement, as well as acting for a foreign power, EU officials added.",
        "Stronger preventive measures include establishing effective rules for reporting and verifying assets and conflicts of interests in the public sector, as well as contacts with the private sector.Beyond the EU, the proposal would create a dedicated sanctions blacklist for foreigners deemed corrupt.Those targeted - a decision that would require unanimity of the 27 each time - would be barred from visiting the EU and would have their assets held in the bloc frozen in a policy similar to the U.S. Magnitsky Act.Jourova named public procurement as well as investor residence and citizenship schemes among areas particularly at risk.Commission officials hope the bloc can enact the new rules before EU-wide election due in a year. While covering EU officials as regular citizens, the plan is not specifically aimed at EU institutions.On that, Jourova said she would present her proposal this month for a new dedicated ethics body to cover nine EU institutions including the European Parliament to set standards on accepting gifts and trips, and declaring assets.After last year's scandal, Belgian authorities charged four people linked to the European Parliament over allegations Qatar lavished them with cash and gifts to influence decision-making. Qatar has denied any wrongdoing. (Reporting by Gabriela Baczynska; Editing by Alison Williams)"
    ]
}