{
    "articleURL": "/wires/afp/article-12047545/Leftist-US-senator-pushes-17-minimum-wage.html",
    "content": [
        "Leftist US senator Bernie Sanders introduced a bill Thursday to raise the minimum wage to $17 an hour, reigniting the battle for better federal pay standards as workers see pandemic-era gains erased by runaway inflation.",
        "The $7.25 federal floor has not increased since 2009, and the dollar has since lost almost a third of its purchasing power, according to the Economic Policy Institute.Sanders, a former presidential candidate, has been campaigning for years for a hike but has seen little success in Congress, amid opposition from conservatives who say mandated hikes hurt small business and worsen inflation.\"In the year 2023 in the richest country in the history of the world, nobody should be forced to work for starvation wages,\" said Sanders, who was joined by workers, trade union leaders and a leading economist.\"It's not a radical idea. If you work 40, 50 hours a week, you should not be living in poverty. It is time to raise the minimum wage to a living wage.\"Sanders, chairman of the Democratic-led Senate's powerful Health, Education, Labor and Pensions Committee, said his members would prepare legislation for a floor vote in June for a $17 minimum wage phased in over five years.\"Today in America, it is unacceptable that while the richest people become much richer, over 60 percent of our people are living paycheck to paycheck,\" the independent senator, who votes with the Democrats, told reporters.\"I grew up in a family that lived paycheck to paycheck. Everybody knows what that means: your car breaks down, your kid gets sick, you're suddenly in a financial disaster. That should not be happening in America.\"",
        "The widespread public support for increases in even the most conservative parts of the country has been demonstrated time and again over the last decade, as a dozen states have held successful votes to raise the wage floor.- 'Increased inequality' -Florida, where the governor and both US senators are Republicans, voted for a $15 minimum in 2020 while in last year's midterm election, two states that elected Republican governors, Nebraska and Nevada, also approved increases.The Covid-19 outbreak boosted US wages, with companies facing serious labor shortages. Walmart, Costco, Amazon, Target and Chipotle pushed their base hourly wage close to or beyond $15, while Apple and Bank of America went up to $22.",
        "The increases appeared significant, but economists warned they would slow as more people returned to work. A study published a year ago showed average US wages had risen by 4.4 percent in the first year of the pandemic, but declined by 1.7 percent in the second year.Some 35 million US workers still earn less than $17 an hour, Sanders said.And prices have soared -- hitting 40-year highs last year -- in part due to worldwide supply chain snags, creating shortages of key components like computer chips needed for cars and electronics.Data released in late April showed the Federal Reserve's favored measure of inflation at 4.2 percent, down from 5.1 percent a month earlier but still way off the long-term target of two percent.",
        "Heidi Shierholz, president of the Economic Policy Institute, said the effect of minimum wage increases was one of the most studied aspects of her discipline.They had been shown time and again to reduce inequality, poverty and gender and racial wage gaps, she said, while also reducing child abuse, teen pregnancy, suicides and reoffending rates -- all without causing substantial job losses.\"When you raise the minimum wage, it makes our economy stronger,\" she told reporters. \"The policies of the last four-plus decades that have increased inequality... have also slowed overall economic growth.\""
    ]
}