{
    "articleURL": "/wires/reuters/article-12043897/Garcia-Poulter-Westwood-ineligible-Ryder-Cup-resigning-Tour-membership.html",
    "content": [
        "May 3 (Reuters) - Sergio Garcia, Ian Poulter, Richard Bland and Lee Westwood will be ineligible for this year's Ryder Cup after the DP World Tour confirmed on Wednesday that they had resigned their Tour memberships.",
        "Their resignations come a month after the DP World Tour, which was formerly known as the European Tour, won its legal battle to be able to suspend and fine players who featured in conflicting LIV Golf events without permission.The DP World said in a statement they had been sanctioned for serious breaches of the Tour´s Conflicting Tournament Regulation committed last June, after playing in the first Saudi-backed LIV Golf event in England.The trio of Poulter, Garcia and Westwood have played in 28 Ryder Cups between them.\"The DP World Tour would like to thank the four players for the contribution they have made to the Tour and in particular to Sergio, Ian and Lee for the significant part they have played in Europe´s success in the Ryder Cup over many years,\" the Tour said in a statement.\"Their resignations, however, along with the sanctions imposed upon them, are a consequence of their own choices.\"The Tour has a responsibility to its entire membership to administer the member regulations which each player signs up to.\" The DP World Tour added it would provide further updates on other sanctioned members on Thursday.This year's Ryder Cup takes place at the Marco Simone Golf and Country Club near Rome from Sept. 29 to Oct. 1.",
        "Garcia is the Ryder Cup's record points scorer with 28.5, while Westwood has played a record 11 matches, being part of seven winning teams.Poulter, another Ryder Cup stalwart, has played a key role in some of Europe's biggest successes in the biennial contest against the United States. ($1 = 0.7966 pounds) (Reporting by Janina Nuno Rios in Mexico City Editing by Toby Davis)"
    ]
}