{
    "articleURL": "/wires/aap/article-12052943/Magpies-bracing-pressure-packed-Swans.html",
    "content": [
        "Collingwood coach Craig McRae has warned his players to be on guard for a high-pressure onslaught from Sydney in their AFL clash.",
        "The Swans are fighting to turn their season around, having lost four of their last five matches amid a horror run of injuries to key players.But McRae has been quick to point out the quality of Sydney's opposition during that stretch, which brought losses to Melbourne, Port Adelaide, Geelong and GWS.The second-year Magpies mentor is also wary of the threatening hallmarks of John Longmire's side - most notably pressure.The Swans have beaten Collingwood in their last three meetings, including last season's preliminary final thriller.\"It's our next step forward and we're under no illusions about what the Swans are going to bring,\" McRae said ahead of Sunday's clash at the MCG.\"If you look at the teams they've played in the last five rounds, they're (mostly) in the eight and right at the top of the ladder.\"We know what's coming and we've got to be ready.\"They're the No.1 pressure team in the competition.\"They've got a jump on us the last few times we've played them so we're going to have to bring our A-game.\"Mason Cox will make a welcome return from a spleen injury to lead Collingwood's ruck against Swans pair Peter Ladhams and Hayden McLean.The American-born 211cm target's comeback after five weeks on the sidelines will allow Billy Frampton to go back to defence, where Sydney superstar Lance Franklin lies in wait.",
        "Franklin kicked a season-best three goals in last week's single-point derby defeat to GWS after a fortnight out through injury.The tally meant he overtook Collingwood legend Gordon Coventry as the player who has kicked multiple goals in the most AFL/VFL games (257 times).\"You always prepare for players at their best and Buddy (Franklin) is one of the most-targeted players in their team,\" McRae said.\"If you're not on your game he's going to get a lot of opportunities to display the great strengths that he has.\"Classy veteran Scott Pendlebury is back for Collingwood after a week out with an eye injury, with Nathan Kreuger (ribs) and Jack Ginnivan (omitted) out.The Swans have recalled Robbie Fox and Justin McInerney, dropping Aaron Francis, Angus Sheldrick and Dylan Stephens.In a quirk of the fixture, Sunday's clash will be the first Collingwood-Sydney meeting in Melbourne since 2013.The Swans hold a 6-4 record in their Sydney contests over the last decade, while the Magpies won the 2020 battle on neutral turf at the Gabba."
    ]
}