{
    "articleURL": "/news/article-12043227/What-retail-apocalypse-Iconic-discount-store-reopen-New-York-store.html",
    "content": [
        "Century 21 is to reopen its New York store after shuttering in September 2020The retailer is famed for its heavily-discounted designer goodsIt bucks the trend of the 'retail apocalypse' which has seen Nordstrom Rack, Target and Walmart all announce store closures Popular discount store Century 21 is set to reopen its flagship Wall Street location - bucking the trend of mass retail closures.",
        "The brand - famed for its heavily-discounted designer goods - closed its doors after filing for bankruptcy during the pandemic in September 2020. However it has announced it will reprise its main store in Manhattan's Financial District, which has remained vacant in the last two years. It comes amidst a 'retail apocalypse' which has seen dozens of major retailers ax stores and forced Bed Bath and Beyond to file for Chapter 11 bankruptcy.The Century 21 New York store is set to reopen on May 16 after it has undergone an extensive renovation.",
        "According to a Women's Wear Daily Report, it will be half the size of its old model, making it around 100,000 square feet. On Instagram, Century 21 offered a sneak-peak into the renovation which showed one of its walls covered in a mural by New York artist Timothy Goodman.Century 21 operated 13 stores in New York, Pennsylvania, Florida and New Jersey.However, it was forced to shut down overnight after its insurance company would not cover it for losses incurred during lockdown.It was bought for $9million out of bankruptcy by the Gindi family in December 2020, who maintained they would bring back the retailer. The family - which has 75 years left on its lease on the premises - has now struck a deal with hospitality company Legends to relaunch the store. ",
        "Legends - which operates retail and food venues at sports stadiums - will take over the store's technology, operations and logistics and staffing, according to Women's Wear Daily.This week the brand uploaded a TikTok advert saying 'Your favorite red bag is coming back.'The statement was in reference to the store's famous red carrier bags. 'Century 21 is and always will be a New York City brand,' chief executive Raymond Gindi said in a statement. ",
        "'We could not be more excited to bring Century 21 back home, delivering the same products and value to customers in partnership with Legends.' The reopening bucks the trend of mass retail closures which were sparked by a perfect storm of financial losses during the pandemic, rising theft rates and a surge in online shopping.Today Nordstrom Rack announced it was closing all of its San Francisco stores amidst a spate of crime in the city.Nordstrom chief stores officer Jamie Nordstrom blamed the state of San Francisco in recent years for reducing foot traffic 'and our ability to operate successfully.'And Bed Bath and Beyond went a step further last month when it announced it was filing for Chapter 11 bankruptcy - affecting of all its stores.Meanwhile retail giants Foot Locker, Walmart and Target also plan to shut up dozens of their bricks-and-mortar stores."
    ]
}