{
    "articleURL": "/wires/reuters/article-12049679/India-regulator-tell-brokers-funds-limit-use-financial-influencers-sources.html",
    "content": [
        "By Jayshree P Upadhyay",
        "MUMBAI, May 5 (Reuters) - India's market regulator will direct brokers and mutual funds to limit the use of financial influencers in advertising and marketing campaigns, according to two people with direct knowledge of the matter.A surge in retail investors in equity markets during the COVID-19 pandemic led to a proliferation of influencers pushing financial advice on social media platforms.The Securities and Exchange Board of India (SEBI) fears they could mislead investors, according to the people, who spoke on condition of anonymity about a decision that has not been reported previously.SEBI did not respond immediately to a request for comment.The regulator will ask brokers, traders registered with it and mutual funds to stop associating with financial influencers who are seen to be giving misleading advise and inducing investors, said the first person, a senior regulatory official.SEBI will define what kind of advice is seen as misleading after issuing a consultation paper and seeking industry comments before finalising regulations, the person added, with rule violations attracting fines and directions including a ban from capital markets.The regulator see promises of assured or excessively high returns, misleading or biased information and testimonials with inadequate disclosure of risks as misleading, the second person said.Curbing the spread of financial advice via social media influencers has been a challenge across a number of advanced and developing global markets.",
        "In March 2022, the Australia Securities and Investment Commission said social media influencers required a licence to give financial advice, with violators facing a jail term and stiff fines.SEBI, however, believes that regulating financial influencers is beyond its jurisdiction and the focus should be on reducing the legitimacy they get from being backed by registered market intermediaries through advertisements, events and other associations, the first person said. \"Regulating financial influencers is not the correct approach...but we want regulated entities to stay away from them,\" the person added.SEBI's approach may not solve the problem entirely, said Sandeep Parekh, managing partner at FinSec Law Advisors, a law firm in India. \"There is heavy regulatory and compliance burden on registered entities, whereas the unregistered individuals are continuing to give out financial advise with impunity,\" he said. \"There is a need to have targeted regulations for so-called financial influencers.\" (Reporting by Jayshree P Upadhyay; Editing by Jamie Freed)"
    ]
}