{
    "articleURL": "/sport/football/article-12060791/Jamie-Carragher-hails-Martin-Odegaard-Arsenals-Kevin-Bruyne.html",
    "content": [
        "Martin Odegaard's 15th goal of the season helped Arsenal win 2-0 at Newcastle The result saw the Gunners close to within a point of leaders Manchester City Martin O'Neill praised Arsenal's response to setbacks during the campaign Jamie Carragher has praised the influence of Arsenal captain Martin Odegaard on his side, with the pundit drawing the comparison with Manchester City star Kevin De Bruyne.",
        "Odegaard scored his 15th goal in the Premier League this season to give the Gunners a 1-0 lead in their crucial match against Newcastle on Sunday.The Norwegian's strike provided the platform for Arsenal to earn a 2-0 win over their third placed hosts at St James' Park.Carragher admitted on Sky Sports' Monday Night Football that the trip to Newcastle had been viewed as a match where Arsenal's title challenge could come to an end.The former Liverpool defender praised the influence of Odegaard on the match, with with his composure and creativity in possession compared to De Bruyne.",
        "'They were hugely impressive, I think it was a game people felt that would end this title race and put Man City in even more of a pole position,' Carragher said.'This man Odegaard gets a goal in a captain’s performance. 'He is Arsenal’s Kevin De Bruyne if you like.'He is the guy that has to take the responsibility of getting on the ball for Arsenal.'Former Celtic and Leicester boss Martin O'Neill praised the Gunners for keeping the Premier League title race alive heading into the final matches of the season, despite facing Pep Guardiola's 'fantastic' Man City side.O'Neill hailed Mikel Arteta's team for their ability to respond to setbacks throughout the season.",
        "He highlighted their 4-2 away win over Aston Villa in February as an example, with the Gunners responding impressively to having lost at home to City.Arsenal also rebounded from their 4-1 defeat to the reigning champions at the Etihad last month by beating Chelsea 3-1 at home and Newcastle 2-0 away.",
        "O'Neill acknowledged Arsenal would have disappointment should they fall short in the title race, suggesting this season may be their 'best chance' of claiming the title in the near future. ‘Arsenal have been terrific at coming back from setbacks,' O'Neill said. 'They dropped a couple of points when they were games in front.‘They got beaten by Manchester City and came roaring back against Aston Villa, a big win. A couple of days later they went to Villa Park and I think they have shown resilience this season. 'Man City would be winning by a landslide if not for Arsenal.‘There is disappointment when you are ahead in the league and not far removed from the end of the season, but by the same token it has been a terrific effort.‘While it might be their best chance of winning it, who know what will happen next season, you have to say the improvement has been phenomenal.’Arsenal's win over Newcastle reduced the gap to leaders Man City to just one point, although the holders have a game in hand. "
    ]
}