{
    "articleURL": "/news/article-12044623/Alex-Murdaugh-face-charges-Gloria-Satterfield-Stephen-Smith-death-probes-remain-open.html",
    "content": [
        "There are two open investigations in connection with the Murdaugh family: Stephen Smith, a teen who was found dead on a rural Hampton County road in 2015, and Gloria Satterfield, the family's former housekeeper, who fell on the Moselle property in 2018 and died a few weeks later. ",
        "Satterfield was 57 when she supposedly tripped over the family dogs and toppled down brick stairs outside of the Murdaugh home, according to what Alex Murdaugh told police at the time. Her death was ruled a tragic accident and Alex would go on to admit to pocketing a multi-million dollar settlement which he hid from Satterfield's sons.On Wednesday, in a sensational development in the ongoing investigation into er death, Alex Murdaugh has claimed he lied when he told emergency responders that his dogs caused the fall. Murdaugh, 54, made his 'confession' in legal papers obtained by DailyMail.com in response to a fraud lawsuit being brought against him by insurance company Nautilus.In court documents filed May 1, Murdaugh states: 'No dogs were involved in the fall of Gloria Satterfield on February 2, 2018. After Ms Satterfield's death, [he] invented Ms Satterfield's purported statement that dogs caused her to fall to force his insurers to make a settlement payment.'As for Stephen Smith, his death was initially ruled a hit-and-run death but is now being investigated as a homicide by SLED 'based upon information gathered during the course of the double murder investigation' of Paul and Maggie Murdaugh.For years, Buster Murdaugh, the eldest son of Maggie and Alex has been rumored to have been involved in Smith's death, however, that has never been substantiated. Following his father's double murder conviction, Buster released a statement to 'unequivocally deny any involvement' in Stephen's death.",
        "Watch DailyMail.com's video unraveling the web of deaths:  "
    ]
}