{
    "articleURL": "/femail/article-12060539/Moms-open-realities-parent-ahead-Mothers-Day.html",
    "content": [
        "Mother's Day, taking place this year on Sunday, May 14, is fast approaching People across the country are set to shower their moms with gifts and praiseBut many are taking to TikTok ahead of the celebrations to share their realitiesMother's Day will soon be upon us with people across the country expected to shower their moms with gifts.",
        "But it seems that being a mother can be a thankless task with dozens taking to TikTok ahead of the celebrations on Sunday to expose the realities of being a parent.Some went as far as to say that, rather than Mother's Day, they would prefer a 'mother's society' which would allow for 'raising children in a world where mothers aren't expected to do more than fathers.' And others laid bare feelings of being overwhelmed as well as 'depressed, deranged, insane and anxious.' ",
        "One of the most popular content creators is Libby Ward, from Canada, who has garnered more than 1.1 million followers on TikTok where she prides herself on sharing the 'diary of an honest mom.'In one of her latest videos, posted earlier this week, she questioned the whole concept of Mother's Day.Speaking to camera, she candidly said: 'Sometimes I think that I don't want to celebrate things anymore. I don't want special days - Christmas, birthdays, Easter, Mother's Day.'Not because I don't like celebrating [but] because I don't like being thrown into an abyss of emotions that I can't get out of.'Instead of being like, \"Yeah I'm a mom, I'm doing great,\" special days just bring up a lot of feelings.'Libby adds: 'You know what would be better than Mother's Day? A mother's society - raising children in a world where mothers aren't expected to do more than fathers are expected to do or mothers are appreciated for the value they offer even if what they do is unpaid work at home.",
        "'For people to actually listen to what we say - not just a kid but like a healthcare practitioner. We say we're not okay, do something.'The social media star concludes that Mother's Day leaves her 'wondering what happened to my identity, overthinking everything I've ever done as a mom, questioning if I've got what it takes.'",
        "'Never mind the issues we may have or may not have with our own mother, or why society just forgets about us even though we've got a really important job that impacts everyone else,' she continued.She uploaded the post alongside a caption that read: 'I love being a mom but it's complicated and Mother's Day brings up a lot of feelings, so if you're feeling the same way, you are not alone.' And social media users flooded the comments to reveal that they too felt the same way.One user wrote: '100% this. I don't want flowers or chocolate on one day a year. I want regular me-time to not go insane.'Another added: 'I hate Mother's Day for a lot of personal reasons. People just forget that the mum being celebrated is a person with history too.'And a third began: 'I generally hate Mother's Day. I don't feel appreciated or overly loved. I have started planning a spa day with my besties now.'",
        "But Libby is not the only content creator to air her grievances about motherhood in recent weeks.",
        "Jade Johnson, from Pennsylvania, also took to TikTok to open up about the realities being a mother.The 33-year-old said: 'What's really annoying as a mom specifically and a wife is you often don't have the choice. You don't have choice.'She then lists a whole host of things she has to do including managing schedules, meal plans and even her own emotions.Jade continues: 'This is the stuff that they don't tell you about. And all of that parenting, and excitement of wedding, and excitement of marriage, and excitement of being a mom, this is the s*** that will drive you insane.'She said that often being a mother was 'overwhelming because there's no freaking handbook for this.''You can vent all you want, you can go and cry all you want but at the end of the day, all of that responsibility is still on you,' she added.'It makes you fell almost trapped - defeating in a sense - it's so hard.'The mother-of-one, whose son is three years old, concludes: 'Don't get me wrong, it's so beautiful but it is literally the most mind f*** experience of your entire life.' ",
        "New-York based mother Victoria Yavnyi also shared a video echoing the same sentiments.",
        "In her clip, which was overlaid by music track Just Pretend by Bad Omens, Victoria can be seen kneeling down to hug her daughter.The clip then cuts to a film scene in which one man smashes up his motel room.She added captions that read: 'What people don't tell you about motherhood... you'll feel depressed, deranged, insane, anxious, enraged, terrified, emotional, irrational, resentful, isolated, crazy, overwhelmed but you have to pretend you don't.'Uploading the clip to the platform, Victoria added: 'Another thing [you] should know, is that you aren't alone.'"
    ]
}