{
    "articleURL": "/wires/ap/article-12056325/NZ-wins-toss-elects-bat-1st-5th-ODI-against-Pakistan.html",
    "content": [
        "KARACHI, Pakistan (AP) - Under-strength New Zealand enjoyed a consolation 47-run win in the fifth and final one-day cricket international to deny Pakistan a clean sweep of the series on Sunday.",
        "Pakistan slipped to No. 3 in the ODI rankings behind Australia and India after it was bowled out for 252 in 46.1 overs - its lowest total in the series - as run-machine Babar Azam went for just one run in his 100th ODI in the final game.Pakistan rose to the top of the ODI rankings after it won the fourth game of the series on Friday, but needed a 5-0 sweep to retain its No. 1 spot.Half centuries by Will Young (87) and captain Tom Latham (59) formed the backbone of New Zealand´s total of 299 in 49.3 overs after Latham won his third successive toss in the Karachi-leg of the series, but decided to bat first for the first time.Middle-order batter Iftikhar Ahmed missed out on his first ODI century and made a fighting unbeaten 94 off 72 balls after Pakistan's top-order stuttered for the first time in the series.Fakhar Zaman (33) and Shan Masood (7) both struggled against Matt Henry and Adam Milne´s impeccable lengths with the new ball before Masood played Henry back onto his stumps after struggling for 20 balls.",
        "Babar had a dream series which saw him become the fastest player to complete 5,000 runs in ODI cricket - reaching the landmark in 97 innings - but on Sunday the Pakistan skipper was caught at backward point off Henry Shipley (3-34), one of the four changes New Zealand made for the final game.",
        "Iftikhar and Salman Ali Agha put Pakistan's chase back on track with a 97-run fifth-wicket stand before Shipley returned and broke the partnership by having Agha caught at mid-off in the 35th over.Iftikhar ran out of partners in the death overs with left-arm spinner Rachin Ravindra finishing with 3-65 as No. 11 Haris Rauf was run out at the non-striker´s end while attempting a second run.Earlier, Young missed out on the second opportunity in the series to score a hundred as Pakistan's ploy to go with two specialist leg-spinners worked well in the middle overs.Leg-spinners Usama Mir (2-53) and Shadab Khan (2-67) shared four of the five top-order wickets. Shadab got two key wickets when he found a thin outside edge of Young´s bat. Mark Chapman (43) looked to accelerate with Latham but Shadab had him caught well by Mohammad Rizwan down the leg side.Mir accounted for the wickets of Henry Nicholls, who replaced Daryl Mitchell at No. 3, and Latham holed out in the deep while going for a big shot before Pakistan's pacers took charge in the death overs.Rachin Ravindra (28) and Cole McConchie (26) played little cameos but Pakistan came back strong in the last five overs and claimed five wickets for 32 runs with Shaheen Shah Afridi (3-46) and Haris Rauf (1-45) drying up the runs.",
        "New Zealand's white-ball tour to Pakistan was without eight of its regular players because of their commitments in the Indian Premier League. New Zealand drew the T20 series 2-2 after trailing 2-0 in the series.___More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports"
    ]
}