{
    "articleURL": "/femail/article-12042351/Im-dating-coach-three-lies-men-tell-women-false-hope.html",
    "content": [
        "Jacob Lucas is a professional UK dating coach who also makes content on TikTokREAD MORE: I'm a dating expert and these are the 5 problems attractive women face when datingA dating coach has revealed three lies he says men tell women when they want to give false hope they will have a relationship.",
        "Jacob Lucas, who is based in the UK, says he has used his real-life methods to 'help millions of people get the love life they have always wanted'As well as working directly with clients, he shares dating content on TikTok, with his more than 750,000 followers. He is also the author of guidebook Her Dating Coach.In a recent video, which was captioned 'Remember that you deserve so much better than somebody who lies to you', he outlined disingenuous comments he says men sometimes use when dating.And advising viewers, Jacob said: 'If a man is doing any of these things of you leave him because you deserve better than that.'",
        "Speaking in the video, he says: ' I am a professional dating coach. And these are three lies a man will tell you to give you false hope about you getting into a relationship.'The first lie Jacob shares relates to when people are unwilling to put labels on a relationship, even after seeing each other for a while. He says: 'Number one, if you've been dating him for over three months, and he says to you [that he's not ready for a relationship yet], that's a lie.  'And this is why: if he was dating his celebrity crush for three months, and she said to him, \"do you want to be in a relationship with me?\", he wouldn't be saying no, absolutely not.  ",
        "He would jump at the opportunity. 'Remember, if the guy can't make his mind up whether he wants to be with you after three months, then he's a very low value man because it shows that he's very indecisive and you deserve somebody so much better.' His second tip relates to whether the words he says are consistent with his actions.Jacob explains: 'Let's get into number two - when he tells you that he loves you, but he still won't commit to you. ",
        "'If he loves you, he will commit to you, and that's a fact. 'The reason he said \"I love you\", is to give you false hope, and string you along. You deserve so much better.'Moving onto his third and final point, Jacob said: 'Number three. If you're giving somebody boyfriend privileges, without them actually being your boyfriend, but they want to string you along they will say that it's just not the right time in his life to be in a relationship with you.'Viewers took to the comments section of the video to share their own thoughts on what Jacob said.Some posters suggested that there could be situations in which these phrases may be used sincerely, and not as lies.",
        "One wrote: 'But sometimes people got out of a bad relationship and are scared to get into another one even if feelings are involved and u spend a lot of time.'",
        "Another agreed, adding: 'I was in a \"situationship\" with him for 1 year until we became official and in a relationship. He said all these things but I waited and now we are.' However, the vast majority agreed with the dating expert, with one saying: 'You brought back some memories. These are so right! Also, You forgot: you’re too good for me. I don’t deserve you!'A second added: 'I feel like sometimes they say I love you so that they can get away with bad behaviour.'And a third added their own suggestion, writing: 'my personal favourite \"I don't like to put a label on things\".' "
    ]
}