{
    "articleURL": "/wires/reuters/article-12038069/Senate-panel-seek-ethics-standards-US-Supreme-Court-questions-swirl.html",
    "content": [
        "By Andrew Chung and John Kruzel",
        "WASHINGTON, May 2 (Reuters) - A Democratic-led Senate panel on Tuesday explored the possibility of pursuing legislation to impose ethics standards on the U.S. Supreme Court amid revelations about luxury trips and real estate transactions by conservative justices, but the panel's Republican members voiced stern opposition.\"The highest court in the land should not have the lowest ethical standards,\" said Senate Judiciary Committee Chairman Dick Durbin, who asserted at a hearing that the court's failure to fix the problem on its own means Congress must do it instead. \"That reality is driving a crisis in public confidence in the Supreme Court. The status quo must change.\"None of the nine justices appeared at the hearing, with Chief Justice John Roberts on Friday declining Durbin's invitation for him to testify. Instead, the committee heard from lawyers and academics who differed over whether Congress possessed the authority to impose ethics guidelines on the government's judicial branch.The news outlet ProPublica has detailed ties between conservative Justice Clarence Thomas, the court's longest-tenured member, and wealthy Republican donor Harlan Crow, including real estate purchases and luxury travel paid for by the Dallas businessman.Separately, the news outlet Politico has reported that conservative Justice Neil Gorsuch failed to disclose the buyer of a Colorado property in which he had a stake - the chief executive of a major law firm whose attorneys have been involved in numerous Supreme Court cases.",
        "Some Republican committee members sought to portray these revelations as part of an effort by liberals and Democrats to smear the court, which has a 6-3 conservative majority. Liberals have decried some of the court's recent major rulings including expanding gun rights and ending its recognition of a constitutional right to abortion.Senator Lindsey Graham, the panel's top Republican, expressed reservations about Congress imposing regulations on the justices and said he would not support ethics legislation that has been proposed. But Graham urged the justices to act themselves to improve transparency and \"instill more public confidence\" in the court.Another Republican committee member, Senator John Kennedy said the hearing represented \"an excuse to sling more mud at an institution that some - not all - some Democrats don't like because they can't control it 100% of the time.\"Supreme Court justices are not bound like other federal judges by a code of conduct adopted by the policymaking body for the broader federal judiciary. Other federal judges under that code must avoid even the \"appearance of impropriety.\" Roberts has said Supreme Court justices consult that code in assessing their own ethical obligations.\"Justices read the ethics rules in unique and eccentric ways,\" Democratic Senator Sheldon Whitehouse said, \"and when they're caught out of bounds, they refuse to allow any investigation of the facts.\"",
        "Whitehouse has proposed legislation that would impose on the justices new requirements for disclosure and recusal from cases involving conflicts of interest.Other legislation has been introduced by Senators Angus King, an independent who caucuses with Democrats, and Lisa Murkowski, a moderate Republican, that would require the Supreme Court to create a code of conduct and appoint an official to review ethics complaints.With Republican opposition expected, any such bill faces an uphill battle in a divided Congress.Witnesses at the hearing included former federal judge Jeremy Fogel and judicial ethics expert Amanda Frost of the University of Virginia School of Law, who both said the justices need a code of conduct.Congress has the constitutional authority to regulate the ethical standards of the justices, Frost said, just as laws it passes already provide for the court's funding, size, quorum, staffing and other operations.Two other witnesses, former U.S. Attorney General Michael Mukasey and lawyer Thomas Dupree, argued that imposing such a code through legislation would infringe on the U.S. Constitution's separation of powers among the government's executive, legislative and judicial branches.(Reporting by Andrew Chung in New York and John Kruzel in Washington; Editing by Will Dunham and Scott Malone)"
    ]
}