{
    "articleURL": "/wires/pa/article-12060215/I-love-play-offs--Owen-Coyle-bids-lead-Queen-s-Park-promotion.html",
    "content": [
        "Owen Coyle has enough good memories of play-offs to keep him positive as Queen’s Park this week try another route to the cinch Premiership.",
        "The Spiders lost 5-3 to Dundee in the Championship title decider on Friday night to leave them facing a play-off quarter-final tie against Partick Thistle, with the first game at Firhill on Tuesday and the return match at Ochilview on Friday.As a striker, Coyle scored in the 1995 play-off final at Wembley to help Bolton beat Reading 4-3 after extra-time to reach the top flight before he returned to Scotland the following season, netting the winner for Dundee United in extra-time in the second leg of the play-off against Partick to take the Tannadice side to the Premiership.As Burnley manager, Coyle won promotion to the Premier League in 2009 by beating Sheffield United 1–0 in the Championship play-off final at Wembley and last season, he helped bring Queen’s Park through play-off ties against Dunfermline and Airdrieonians to reach the second tier.Coyle told the PA news agency: “I love the play-offs. I have been very lucky both as a player and a manager to have won the play-offs both north and south of the border.“As a player, I got promoted to the Premier League at the old Wembley. As a manager, I won it at the new Wembley to go to the Premier League.",
        "“And in Scotland I came back to score the winning goal to take Dundee United back to the Premiership, ironically, against Partick Thistle.",
        "“And, obviously, after just coming in last year at Queen’s Park and getting through to the level where we are and that shows improvement.“In terms of the excitement, I think the play-offs have been a terrific introduction all over the world but particularly north and south of the border.“If someone could guarantee you a way to get promoted, it is through the play-offs but there is no guarantee because there are three other teams to compete with and there is only a 25 per cent chance in that respect.“But it is fantastic way to go up if you are able to do it.“It takes you being at your best for sure. It takes you being focused and bringing your quality. It will certainly take us defending a lot better than we did last Friday, that’s for sure.“But if we do defend the way we can, then we have shown we can score against anybody.“We know we can cause good teams problems, we just need to close the back door.”Coyle admits there was disappointment to be overcome following the defeat by Dundee but he is now refocused on Thistle.He said: “You will be disappointed but that’s football. You can either feel sorry for yourself or pick yourself up and get ready to do something about it and I would hope this is what this group is ready to do.",
        "“Huge congratulations to Dundee but what we have to do is focus on those play-offs and look to take that other route into the Premiership.“It will be tough. Partick Thistle are a good side. They beat us last time out. Prior to that we beat them three times so we know we can hurt them and win games.”"
    ]
}