{
    "articleURL": "/wires/pa/article-12056733/Steven-Schumacher-pride-Plymouth-crowned-League-One-champions.html",
    "content": [
        "Plymouth manager Steven Schumacher made their League One title success about everyone but himself following a 3-1 victory over Port Vale on the final day.",
        "Argyle had to come from behind as Vale were determined to spoil the party by taking an early lead through James Plant.Goals from Adam Randell and Joe Edwards fired Plymouth in front before Finn Azaz put Vale out of sight.Schumacher said: “This means the world to us, we’ve fought so hard week in and week out since the last day last season when we just fell short in the play-offs.“The work has been going since then and we felt we could mount a challenge.“All the staff, all the players, everybody has just given everything they’ve got and we managed to become champions. We’ve deserved it.",
        "“The game was a good game, credit to Port Vale. I thought they had a great spirit and played the game the right way.“They took a great goal to score but our lads showed brilliant character to come from behind and win the game.“The bus journey back is going to be very lively. Everybody should be really proud and now it’s time to get the party started.”Interim Vale boss Andy Crosby felt his side had a good first half but that they have a lot of work to do in the summer ahead of next season.He said: “First of all I have to say congratulations to Plymouth.",
        "“To reach the points they have in a 46-game season is a massive credit to them – the whole football club, from the owner to the manager and the players.“I was delighted with how we started the game but then we couldn’t maintain possession for long enough periods of time.“It’s a really big two months for the football club to recruit to the level required at League One football.“There’s a massive difference between League Two and if you can’t do the basics of the game you’re going to really struggle.“We were a play-off winning team and had a great first half of the season.“We plateaued and the signs have been there, it’s a big summer ahead. Recruiting players to play the way we want to play is vital.“My future will become clearer over the next few days. I’ve been a player, an assistant manager and now I think I’m ready.“There’s no guarantee in any appointment for any football club, there’s always a risk and we will see what happens.”"
    ]
}