{
    "articleURL": "/wires/reuters/article-12057601/MORNING-BID-ASIA-Following-Fridays-feel-good-factor.html",
    "content": [
        "By Jamie McGeever",
        "May 8 (Reuters) - A look at the day ahead in Asian markets from Jamie McGeever.Asian markets are set for a positive start to the week on Monday after strong U.S. jobs data on Friday soothed recession and banking sector fears, and sparked the best day for world equities in five months.The regional economic data calendar on Monday is light, with the final reading of Japanese purchasing managers index and Taiwanese trade for April the main releases.Monday's market tone will probably be set by the U.S. feel-good factor, boosted by surprisingly strong corporate earnings, and whether investors think the U.S. really will defy the odds and head for a soft landing.Federal Reserve Chair Jerome Powell, for one, is very optimistic: \"It's possible that this time is really different. The case of avoiding a recession is, in my view, more likely than having a recession,\" he said on Wednesday after raising the benchmark overnight interest rate by a quarter of a percentage point to a 16-year high.Two reports on U.S. credit conditions and loan demand on Monday and Tuesday will be more closely watched than usual, in light of the cumulative effect of the Fed's rate hikes and recent stress in the regional banking system.Asian market sentiment later in the week could be molded by a batch of Chinese economic indicators: trade, lending and money supply figures for April on Tuesday, and CPI inflation on Thursday.",
        "These reports will give investors a clearer insight into how well the region's largest economy is doing after abandoning its COVID-19 lockdown restrictions.The signs are mixed at best. The heavily indebted property sector remains under severe stress, April's PMI reports were soft, and the economic surprises index - at a 17-year high a few weeks ago - has now declined 13 days in a row.Economic momentum is clearly slowing.Technology giant JD.com and China's largest chip foundry Semiconductor Manufacturing International Corp both release first-quarter earnings on Thursday.Figures on Sunday, meanwhile, showed that China FX reserves rose $21 billion in April to $3.205 trillion, higher than expected and the highest since February last year.Potentially market-moving events later in the week include: G7 finance ministers meeting in Niigata, Japan from Thursday through Saturday, Bank of Japan minutes of its April 27-28 policy meeting on Wednesday, and the Bank of England's policy meeting on Thursday.Here are three key developments that could provide more direction to markets on Monday:- Japan services, composite PMI (April, final)- Australia business conditions index (April)- Taiwan trade (April)(By Jamie McGeever; Editing by Diane Craft)"
    ]
}