{
    "articleURL": "/wires/aap/article-12040891/Pharma-giant-takes-new-step-quest-cancer-vaccine.html",
    "content": [
        "There are hopes the global population could one day roll up its sleeves for vaccines to prevent cancer, after a trial showed new technology can help treat deadly melanoma.",
        "Pharmaceutical giants Moderna and Merck will launch stage three trials of their first mRNA cancer treatment vaccine, after it was found to help reduce the risk of death or recurrence in serious skin cancer patients by 44 per cent.Moderna chief medical officer Paul Burton said vaccine treatments for lung cancer, colon cancer, rare diseases in children and cardiovascular diseases were on the agenda.He said preventative vaccines were also a possibility.\"First, we'll try and get approval here for (cancer) treatment and then prevention as well,\" Dr Burton told reporters in Melbourne on Wednesday.New mRNA technology teaches the body's immune system to target damaged cells like cancer or infections and is used in some COVID-19 jabs.\"We've made amazing advances in the diagnosis and treatment of cancer broadly,\" Dr Burton added.\"What mRNA gives us is this ability now to rapidly scale, to really personalise treatments for cancer.\"The future is very bright and I think the next decade is going to be a foundational shift in our management of cancer patients.\"Dr Burton spruiked the company's vaccine to dozens of clinicians and researchers at the Doherty Institute in Melbourne.Moderna hopes to roll out jabs for respiratory syncytial virus, known as RSV, by winter 2024.Melanoma oncologist Grant McArthur, who is executive director of Victoria's Comprehensive Cancer Centre Alliance, said medical science had never moved so fast.",
        "\"I've witnessed a small number of true breakthroughs in my career, the use of the mRNA vaccine technology ... is going to be another one of those moments,\" Professor McArthur said.Scientist and patent attorney Dr Karin Innes was diagnosed with stage three melanoma in August 2020 and suffered significant side effects during her immunotherapy treatment.Dr Innes follows cancer research closely through work and said she hopes mRNA treatments would lead to fewer complications for patients as it offered bespoke treatment.\"It's encouraging to see that there are treatments constantly evolving, that are improving outcomes for patients with cancer,\" she said."
    ]
}