{
    "articleURL": "/wires/aap/article-12054797/Nathan-Cleary-shrugs-dust-NRLs-Warriors.html",
    "content": [
        "Warriors rookie Demitric Sifakula has avoided sanction for striking Penrith co-captain Nathan Cleary, who declared physical confrontations a part of the spectacle of rugby league after the Magic Round fracas.",
        "Cleary laid a heavy tackle on Josh Curran during the last 15 minutes of Penrith's 18-6 win, leading the Warriors forward to grab at the halfback's shirt and spark a melee.Things escalated when Sifakula, playing only his second NRL game, entered the fray and appeared to strike Cleary's chin with an open palm.\"I don't even remember what happened,\" Cleary said when asked about Sifakula's involvement.Referee Todd Smith sent Sifakula to the sin-bin, putting a serious dent in the 12-man Warriors' hopes of recovering from 14-6 down.The match review committee opted not to charge Sifakula on Sunday morning and his Warriors teammate Jackson Ford has also escaped suspension for his hip-drop tackle on Spencer Leniu from earlier in the match.Ford found himself sin-binned for the shot, which did not injure Leniu and has since been categorised as grade-one dangerous contact. The second-rower can accept a $1000 fine.Cleary held no ill will towards Sifakula after physical encounter.\"Sometimes those things happen when two teams are wearing their hearts on their sleeve,\" he said.\"That's the way the game has gone. I think that's what makes footy so great and such a great spectacle for the fans, when two teams are going hard at it like that.\"They're the fun games to play in.\"",
        "Warriors coach Andrew Webster questioned whether Sifakula had struck Cleary - a sin bin offence under the NRL rules - or just pushed him.\"I felt like his hand was open. I felt like he was pushing him in the face,\" Webster said.\"You could see Nathan's face move but he was going to push him. And next thing he's in the bin.\"Panthers prop Moses Leota has escaped scrutiny from the match review committee for an apparent high tackle on Tohu Harris that went unpenalised on field.Harris claimed to have missed seeing a replay of the shot while Warriors trainers attended to him, but Webster made himself bite his tongue when asked about it.\"I'm going to take a hat around and get you guys (the media) to pay for my fine,\" Webster quipped.\"If you all want to chip in, I'll give you whatever you want.\"I saw that.\"For his hit on Panthers forward Scott Sorensen just after halftime, Marata Niukore has been hit with a grade-one careless high tackle charge and faces a hefty fine of $3000 given his record."
    ]
}