{
    "articleURL": "/wires/ap/article-12052613/Dallas-teen-rookie-Johnston-lives-learns-Pavelski.html",
    "content": [
        "DALLAS (AP) - Dallas Stars teenage rookie Wyatt Johnston is constantly asking questions and going over games with Joe Pavelski in all the time they spend together - which is most of the time.",
        "The 19-year-old Johnston has been living all season with the Pavelski family, soaking up all he can from the veteran center who is twice his age at the rink or at home.\"I try to just kind of listen to him and learn from all of his experience,\" Johnston said.They also watch game highlights together. And for the first time all season, after Game 2 of the second round of the NHL playoffs, those clips included a goal on which Pavelski and the rookie were both involved.Pavelski got his fifth goal in two games since returning from concussion protocol when he slammed in the rebound of a shot by Johnston for the third Stars goal in their 4-2 victory over Seattle on Thursday night. Johnston also had his second playoff goal as Dallas evened the series at 1-1.\"I don´t know what they´re eating in the Pavelski household right now, but it´s working,\" said veteran forward Tyler Seguin, who is the only Dallas player to win a Stanley Cup, and that was as a 19-year-old rookie with Boston in 2011. \"Mrs. Pavelski is making some good food or something because they´re buzzing.\"",
        "The Stars and Kraken play Game 3 on Sunday night and Game 4 on Tuesday night in Seattle. The series then shifts back to Texas for Game 5 next Thursday.",
        "Johnston stayed in a hotel room during training camp. But when the kid from Ontario made the roster, and team officials were trying to determine where he would live, Pavelski offered a room at home.Pavelski is in his fourth year with the Stars after playing his first 13 NHL seasons in San Jose, where as a youngster he got helped by Joe Thornton and Patrick Marleau. Pavelski was the Sharks captain over his last four seasons on the West Coast, when Peter DeBoer was his coach there.DeBoer, now in his first season with the Stars, called Pavelski and Johnston \"an interesting pair\" and said he is having fun watching their interactions.\"Wyatt is just starting his career and Joe has done everything but win a Cup,\" DeBoer said. \"Joe understands the importance of the messaging in what he´s teaching Wyatt. I think Wyatt is going to appreciate that down the road probably a lot more than he does now. He´s a pretty, pretty smart kid, but I think he´s going to really get it probably 10 years from now when he looks back and goes, wow, I was lucky to be in that situation with that guy.\"After Game 2, DeBoer took a moment for a tangent about Johnston not being included as one of the three finalists for NHL rookie of the year. Johnston played all 82 regular-season games and his 24 goals were tied for the rookie lead with 20-year-old Kraken center Matty Beniers, a finalist.",
        "\"He just keeps doing it every night and does it different ways,\" DeBoer said. \"He also is great defensively. He´s out there with the (opposing) goalie out in the last two minutes of the game, he kills penalties for us. Not much else to say, just a great young player. ... Excited to see what what he´s capable of turning into.\"Johnston will turn 20 on May 14, which is Mother's Day this year - and the day between Games 6 and 7, if the series against the Kraken goes that far.Right before the playoffs began, Johnston spoke about how amazing the Pavelskis have been and the impact they have had on the start of his career.\"I´ve learned so much about just being a pro and kind of day-in and day-out of being an NHL player,\" Johnston said. \"I can´t thank them enough for how much they´ve helped me throughout this year so far. Definitely made it a lot easier kind of adjusting to the NHL, adjusting to the lifestyle and just being in a new city.\"___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}