{
    "articleURL": "/wires/aap/article-12045541/Im-good-Fainus-Tigers-five-eighth-Wakeham.html",
    "content": [
        "Wests Tigers five-eighth Brandon Wakeham insists there is no bad blood between he and the Fainu family after his infamous clash with Manly prop Josh Aloiai.",
        "Wakeham and Aloiai have attempted to play down the incident this week, with the pair speaking for the first time since tensions boiled over at Campbelltown last month.The duo were separated close to an hour after full-time in the tunnel in round eight, after a yelling match over Wakeham's on-field treatment of Manly debutant Samuela Fainu.Wakeham ran straight to Fainu after he missed a tackle in the lead up to a crucial Tigers try in the match and subsequently told referee Todd Smith he had been spat at before opting not to make an official complaint.That had prompted the suggestion of an awkward scenario for Wakeham, given Samuela's brother Sione Fainu is a rising star in reserve grade at the Tigers.And while Wakeham said he had not made a point to contact Aloiai since the drama, he was adamant there was no issue between he and the Fainu family.\"There was not much in it. I am good with the Fainu family,\" Wakeham, who went to school with the oldest Fainu, jailed ex-Manly hooker Manase, said.\"Me and (Samuela) were fine straight after the game. I congratulated him on the debut and the win.\"I've forgotten about the whole situation. That was whatever happened on the day, there is nothing in that.\"",
        "Wakeham is more concerned with trying to gel his combination with Luke Brooks ahead of Sunday's date with St George Illawarra.Off-contract at the end of this year, the 24-year-old had expected a long run at the No.6 jersey last month before being dropped after two games in it.Adam Doueihi's season-ending knee injury has since handed it to him for an extended stint, giving him the chance to find his groove in the Tigers' halves.\"It's a bit of weight off the shoulders,\" Wakeham said.\"But you still have to play well. They're not going to pick a team of people not playing well.\"The Tigers admit they are a more relieved team this week, after ending a 273-day drought by claiming their first win of the year against Penrith last Saturday.After waiting six games for a win last season, they turned their first victory into two on the trot in 2022 and are hopeful the morale boost can give them the momentum do the same this year.\"It can have a domino effect,\" winger David Nofoaluma said.\"It comes down to confidence. Every win gives you confidence the following week.\"It's just making sure we are consistent with the detail at training and what helped us get the wins like we did on the weekend.\""
    ]
}