{
    "articleURL": "/news/article-12060361/Grandmother-British-boy-16-dead-Thai-forest-says-fears-lured-death.html",
    "content": [
        "Body of Woramet Ben Taota, 16, was found in a grove in Thailand on SundayDevastated grandmother Lilian Graham believes he was persuaded to go to forest where he was murdered, as a suspect is arrestedThe heartbroken grandmother of a British teenager found dead with head wounds in a forest in Thailand says she believes he was lured into the woods to his death.",
        "Her comments came as haunting CCTV emerged showing the last sighting of her grandson Woramet Ben Taota, 16, who went for a motorcycle ride with his girlfriend Yam, also 16, in his hometown of Lampang on Saturday.Dual national Taota borrowed his mother's blue scooter and was seen riding with a girl on the back before he was found dead the next day in Lampang province on May 7. His body was later found in a grove, with injuries resembling blunt force.His devastated British father Steven Graham, 60, a businessman who runs a thatched property insurance firm, is travelling to Thailand to speak to detectives there, who say they are now searching for a second girlfriend amid fears for her safety following the arrest of a 44-year-old male suspect.Meanwhile, Ben's grandmother Lilian Graham has told MailOnline she believes he was persuaded to go to the forest where he was murdered.",
        "The footage shows how Ben had a girl police said he was 'romantically involved with' Suraphltchaya Khamsa, 16, riding pillion with him at around 4.25pm as they visited her grandfather. They dropped off another girl, also seen on the bike, then rode away together at 7.18pm local time in darkness.Ben's first girlfriend, Yam, has now been found and she is safe. Police have ruled her out of the case. ",
        "However, there are fears for his second girlfriend Suraphltchaya following the arrest of suspect Chaiwat Boongarin, 44, who had known the pair 'for several years'. Police Major General Mongkol Sampawapol, commander of Lampang Provincial Police, said officers are still searching for Suraphltchaya as she was 'the last person to see Ben' before he was killed.   Speaking from the family home in Eastbourne, East Sussex, Mrs Graham said: 'Ben was with a girl and they went to the forest to meet a man. But something must have happened. And the man killed Ben. They don't know what has happened to the girl.' Mrs Graham added: 'It's been a real shock. We are all devastated. Ben's father Steve is going to Thailand tonight.'I wanted to go out there with him to support him. But he wouldn't let me. He said the flight was too long and it would be too upsetting.'Mrs Graham told how Ben was born following a long-distance romance between her son Steve and the boy's mother, who is known as Ooy.She said: 'Steve met Ben's mum Ooy when he was in Thailand on holiday with friends. She became pregnant and Steve went back many times.'I went out to visit them as well. I really love it out there. But they lived too far apart and sadly their relationship didn't work out. But Steve and me really loved Ben. He was really special. A real character.'",
        "Police Major General Sampawapol said : 'Suraphltchaya's nickname was Ping Pong. She also had a close romantic relationship with the deceased. She is still missing and we are actively searching for her. She was the last person to see Ben. 'A suspect has been apprehended who had known the victim for a long time. He denies having any involvement in the death. However, we believe he is involved and it is connected to drug dealing in the area.' Police said the suspect had been released from prison around eight months ago following previous convictions for sex crimes. They claimed that Chaiwat was seen riding his black Honda Wave motorcycle without a license plate on May 6 at around 9pm and parked it at his relative's house with a young woman they believe is Ben's girlfriend, Suraphltchaya. The motorcycle was found by officers this morning, May 9, behind a cow shed close to the home.Sampawapol added: 'The suspect told his relative that he wanted to leave his motorcycle at their house.'He told them that he was looking for a rental house for his mistress. He then left the house with another motorcycle and returned the next morning. 'After that, he rode the black Honda Wave and left it near the hut before officers found it on May 9. ",
        "'We are still searching for the young woman and believe that she is still safe.' ",
        "Officers had reported that the teenager's phone and cash were missing from his shoulder bag, and suggested he might have been robbed.They believe he was killed elsewhere and left in the woods as there were no signs of struggle. Thai media reported that Ben's body was found by a garbage collector who was at work on Sunday morning.Police Colonel Sittisak Singtongla, superintendent of the Mae Tha Police, said: 'The station received a notification at 10.15am that a deceased person was found in the undergrowth.'Investigative teams from Mae Tha Police Station and Lampang provincial investigation team, along with forensics officers, forensic medicine doctors and staff from Tanna Krua Forest Rescue attended the scene.Thai media reported that the teenager was found with his back against a tree wearing a black long sleeve T-shirt and jeans.Police said that the body has been taken to hospital for an autopsy.'We are currently tracking down individuals close to the victim, including his female companion. She is a key figure in this case since she is the last person to see him alive.'Ben's mother, Ooy Taota, told police that her son had said goodbye to her on Saturday evening and said he was 'going to work with friends' but he did not give any more details to her.",
        "With the news of his death, friends took to Facebook to leave tributes for Taota.The parents of the missing girl were said to have 'pleaded' with the media to help find their daughter.The police said they are not ruling out any motives, attributing the killing to a possible love affair, a personal conflict, or a work dispute.Police Colonel Sittisak added: 'We have not yet finalised the issue.'It is still unclear whether it was a robbery, because the phone and cash of the deceased were not found, but we still cannot rule out other issues.'"
    ]
}