{
    "articleURL": "/wires/ap/article-12041637/NZ-wins-toss-elects-field-3rd-ODI-against-Pakistan.html",
    "content": [
        "KARACHI, Pakistan (AP) - Pakistan top-order batters continued to prosper as they beat under-strength New Zealand by 26 runs in the third one-day international on Wednesday for an unassailable 3-0 lead in the five-match series.",
        "Opening batter Imam-ul-Haq made 90 off 107 balls and captain Babar Azam scored 54 as the home team raised a total of 287-6 after losing the toss and being asked to bat first.Cole McConchie´s (64 not out) late counter-attack saw the 31-year-old smash New Zealand´s fastest half-century on ODI debut off 36 balls before the Kiwis were bowled out for 261 in the final over to lose their first ODI series against Pakistan since 2011.\"We knew these wickets would not be the same as Rawalpindi wickets, so it was important to give respect,\" Imam said after being named player of the match. \"We knew it was a 280-290 track. We were thinking of 260 but my partnership with Babar helped to get to a good position.\"Pakistan chased down two big totals in the first two ODIs at Rawalpindi, including its second highest-ever successful chase in an ODI of 337 runs in the second game.New Zealand made a solid start in a bid to keep the series alive when Tom Blundell (65), playing his first game of the series, and Will Young (33) put on 83 runs for the opening-wicket stand. But Young´s run-out in the 16th over saw the middle-order stifled by Pakistan spinners Shadab Khan and Mohammad Nawaz before Blundell too got run out while going for a second run with captain Tom Latham.",
        "Daryl Mitchell, who scored centuries in the first two games, had two lucky escapes before he holed out in the deep after scoring 21 and Mark Chapman, who was the star for New Zealand in the preceding 2-2 drawn T20 series against Pakistan, was clean bowled by Naseem Shah for 13.Left-arm spinner Nawaz, who dried up runs in the middle overs, injured his left index finger when he tried to hold onto a return catch of Mitchell and was brought to the hospital.Part-time off-spinner Agha Salman made up for Nawaz´s absence, taking 1-42 off his nine overs as spinners got plenty of assistance off the wicket at the National Stadium.Fast bowler Mohammad Wasim (2-50), one of the three changes Pakistan made from the last game, had Latham clean bowled as the Black Caps skipper attempted a ramp shot while exposing his stumps.McConchie struggled against the spinners before taking charge in the final 10 overs against the pace as he smashed two sixes and six boundaries and brought up his half-century with a big six over mid-wicket against Shaheen Shah Afridi (2-53).\"At the halfway mark, we were happy and the bowlers certainly improved after the first two games,\" Latham said. \"From a batting point of view, we had a really good start. We just could not continue that momentum after we lost a couple of wickets. When you are chasing scores like that, you need back-to-back partnerships.\"",
        "Earlier, Imam and Babar combined in a 108-run second wicket stand after Fakhar Zaman fell to Matt Henry (3-54). Fakhar´s two back-to-back centuries had earned Pakistan convincing wins at Rawalpindi before he played across the line and skied a catch to wicketkeeper Blundell.Henry also broke the century-stand when Babar, who hit his eighth score of 50-plus in the last 11 ODIs, played the fast bowler back onto his stumps while going for an off drive. Imam showed plenty of patience but also fell in similar fashion when Adam Milne (2-56) struck in his return spell and Pakistan lost momentum in the death overs.Mohammad Rizwan made 32 off 34 balls before he got caught by McConchie off Milne´s full toss before Shadab Khan´s hit a little cameo of 21 off 10 balls and provided a perfect finish by hitting Henry for a six off the final ball.Karachi will host the remaining ODIs on Friday and Sunday as New Zealand wraps up its white-ball tour.___More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports"
    ]
}