{
    "articleURL": "/sport/othersports/article-12047495/The-UCI-review-transgender-guidelines-Austin-Killips-win.html",
    "content": [
        "Trans woman Austin Killips won the Tour of the Gila in New Mexico last weekend The UCI initially defended their decision to let Killips ride in female events The governing body have now said they will review their transgender guidelines Cycling's international governing body are to review their transgender guidelines in the wake of the row over American rider Austin Killips.",
        "The 27-year-old became the first trans woman to win an elite women's stage race when she rode to victory at the Tour of the Gila in New Mexico on Sunday.That sparked a fresh debate over the UCI's participation policy, which currently allows trans women to compete in female events as long as they have reduced their testosterone levels to 2.5 nanomoles per litre over a two-year period.The UCI have now announced they will be 'reopening consultation' with athletes and national federation regarding their rules, admitting they hear the 'concerns about an equal playing field for competitors'.A decision will be made on whether to change their policy – and possibly ban trans women from female events altogether – at a meeting in August.",
        "The UCI said in a statement: 'The subject of the participation of transgender athletes in international competitions was discussed at the UCI management committee meeting.'The management committee decided to analyse the current situation by reopening consultation with the athletes and national federations.'Members therefore agreed to debate and take an eventual decision at its next meeting, in Glasgow, in August.'The UCI's objective remains the same - to take into consideration, in the context of the evolution of our society, the desire of transgender athletes to practice cycling.",
        "'The UCI also hears the voices of female athletes and their concerns about an equal playing field for competitors, and will take into account all elements, including the evolution of scientific knowledge.'The UCI's comments come only days after they actually defended their policy following Killips' controversial win.British Cycling are also currently reviewing their rules.There is an announcement expected later this month which could see trans women blocked from racing against females."
    ]
}