{
    "articleURL": "/wires/reuters/article-12042763/Romanias-grain-crop-rebound-limit-Ukraines-room-Constanta-port.html",
    "content": [
        "By Luiza Ilie",
        "BUCHAREST, May 3 (Reuters) - A rebound in Romania's grain output this year may limit room for Ukrainian shipments through the Black Sea port of Constanta, a major transit hub for Kiev particularly since the Russian invasion, port operator Comvex said.Ukraine, one of the world's leading grain and oilseed exporters, saw its Black Sea ports blocked after Russia's February 2022 invasion and found alternative shipping routes through neighbouring European Union states.Even after a deal brokered by the United Nations and Turkey at the end of July gave Ukraine access to three of its Black Sea ports, Romania's Constanta remains its biggest alternative shipping route. The U.N. deal expires on May 18 and an extension has yet to be agreed.Constanta has handled nearly a third of Ukrainian grain exports since the Russian invasion, Comvex said, shipping 8.6 million tonnes in 2022 and 3.3 million in the first quarter of this year.\"New Romanian crops look set to be bigger than last year, which means there might be less room for Ukrainians,\" Comvex manager Viorel Panait told Reuters. \"Operators will not prejudice their traditional clients.\"Panait, who is also president of the Constanta Port Business Association, said better handling of truck traffic and port congestion could help in the absence of new capacity.",
        "Constanta port handled 24.01 million tonnes of grain exports overall last year.Romania, one of the EU's biggest grain producers, is expected to harvest 10.35 million tonnes of wheat this year in a sharp rebound from last year as farm belts recover from drought, consultancy Agritel said.Cezar Gheorghe of grain market consultancy AGRIColumn said he expected Romania's production of fall crops, including wheat, to top the five-year average, and that Constanta needed investment and a unified IT system to handle congestion.\"Constanta needs to focus on entries and exits,\" he said. \"You can't squeeze an elephant through a keyhole.\"Gheorghe added shipping through Constanta was cheaper than through Ukraine's own ports under the safe passage deal because long inspection queues in Istanbul added to costs. (Reporting by Luiza Ilie Editing by Mark Potter)"
    ]
}