{
    "articleURL": "/tvshowbiz/article-12045511/Megan-Barton-Hanson-puts-busty-display-racy-black-dress-House-Sims-launch.html",
    "content": [
        "Megan Barton Hanson sent temperatures soaring as she attended the House Of Sims launch at the Dorsett City Hotel's Jin Bo Law bar in London on Wednesday.",
        "The former Love Island contestant, 29, put on a busty display in a tight black dress with a transparent panel which exposed her midriff.It featured a slanted neckline and an asymmetrical hem, while she wore a black leather coat over the top.Completing the look, Megan opted for a pair of black heels and went for a glamorous look with her make-up, including a bold red lip.The new OnlyFans TV reality show gives an intimate insight into the lives of former The Only Way Is Essex star siblings Frankie, Demi, Chloe and Charlie Sims as they try to make it in Los Angeles, California.",
        "The Sims family moved to LA in January to film the series and have promised it will be 'the realest show you're ever going to see'.And the Sims sisters signed a deal last year worth £1million to become the new Kardashians on OnlyFans' growing new TV venture.The girls left ITVBe's reality show TOWIE to pursue their new show House Of Sims which came out on Wednesday.As part of the deal, the family will open OnlyFans accounts, but will feature Instagram-style pictures, with no explicit content.House Of Sims has already racked the family £500,000 before it has even aired.Chloe told MailOnline: 'I get people will want to compare this to TOWIE, but this is a different concept; this will be a fly-on-the-wall insight into our lives as a family, currently calling it House of Sims as a working title.",
        "'It will be completely real, and we're really excited to bring our viewers along on a big unfiltered adventure.'We're proud to be The Sims, but being compared to the Kardashians all the time is a big compliment to us as a family. We want to see where this new show can take us and plan to go global.",
        "Chloe, who is also a co-producer of the show, added: 'We want to become one of the best reality TV shows out there. OFTV is fully supporting us with this. We can't wait to get started.'I feel very strongly that we should show ourselves in a natural light, showing all aspects of everything we do.'The first official trailer for new reality show House Of Sims has promised an intimate insight into the lives of siblings Chloe, Frankie, Demi and Charlie as they try to make it in LA.The series, which premiered on Wednesday, May 3 on Only Fans TV will show the former The Only Way Is Essex stars in a Kardashian-esque light.The Sims family moved to LA in January to film the series and have promised it will be 'the realest show you're ever going to see'.In the trailer, released last month, fans were given an exclusive insight into the party-heavy lifestyle of the influencers.",
        "'Here's to us and to killing it in LA!' said Chloe at the start, adding: 'In the UK we don't really need to sell ourselves. Here we're completely unknown.'Meanwhile, Charlie, 30, and his fiancée Georgia Shults, 31, were shown having a serious discussion about the future of their relationship and the family gasps upon seeing their new luxury mansion.The Sims sisters signed a deal last year worth £1million to become the new Kardashians on OnlyFans' growing new TV venture.The girls left ITV's reality show, TOWIE, to pursue their new show House Of Sims which is set to come out in May.The family dressed in leather for promo shots of the show and is expected to be very similar to the iconic reality show, The Kardashians on Disney+."
    ]
}