{
    "articleURL": "/wires/pa/article-12050869/Coronation-flypast-cancelled-amid-70-chance-showers-London.html",
    "content": [
        "There is a 70% chance of showers at the same time a flypast to celebrate the King’s coronation is due to take place, forecasters say.",
        "Royal fans who will be in London to celebrate the occasion are advised to bring umbrellas, cagoules and waterproof jackets with dreary weather expected.Royal Air Force (RAF) Air Chief Marshal Sir Michael Wigston has said “it’s 50/50” as to whether a flypast scheduled to fly over The Mall and Buckingham Palace after 2.15pm will take place if there is rain and low cloud.It will consist of more than 60 aircraft from the Royal Navy, British Army and Royal Air Force – including the Red Arrows, but a final decision will be made just one or two hours before it is due to start.Met Office meteorologist Alex Deakin told the PA news agency: “There will be outbreaks of rain in London from 8am onwards, nothing too heavy, it’s just going to be a bit grey, damp and drizzly.“It won’t rain all morning, just a bit on-and-off with some drizzle, it may stop for half an hour or so and come back again, that kind of thing.“It will probably stay like that into the afternoon before it perhaps gets a little brighter but generally staying drab for most of the day.”The King and Queen Consort’s procession will set off from Buckingham Palace at around 10.20am, when there is likely to be light wind and rain.",
        "Temperatures will reach highs of 17C by the afternoon, which is around average for the time of year.",
        "After the service at Westminster Abbey ends, Charles and Camilla are expected to enter Buckingham Palace through the centre arch at 1.33pm.They will receive a salute from the military in the palace gardens at 1.45pm, and then at about 2.15pm they will be joined by members of the royal family on the palace balcony to watch the flypast.However, the RAF has said low cloud and rain could mean it is cancelled.Asked about this, Mr Deakin said: “All the different aircraft have different criteria based on the cloud so it’s obviously a call for the RAF to make, but it does look a little bit brighter come the afternoon compared to the morning.“The cloud will be a little higher and there is a better chance of a drier spell, but the chances of sunny weather is almost zero and the chances of showers at that time is around 70%.”Sir Michael had said: “The weather isn’t looking brilliant, but there’s nothing we can do about it.“We have to be safe, we have to make sure that we aren’t taking any unnecessary risks.“We’ll make a weather call one or two hours before the actual moment, but if there’s rain and low cloud then it will be almost impossible to get it through.",
        "“It’s 50/50 at the moment, but we have lots of options, the decision will be made, at this stage we’re hoping for the best.”A Ministry of Defence (MoD) spokesperson also said: “The latest weather information will be obtained from both the Met Office and from our helicopters performing weather checks in advance of the main flypast on Saturday.“If suitable, the flypast will continue as planned. If not, then there are options available to reduce the numbers of aircraft, with cancellation being the last resort.”Elsewhere across the UK, there will be a “north-south” split, with mostly grey and damp conditions across the Midlands, Wales and southern England, while northern England will be mostly dry until later in the day.Northern Ireland and Scotland are set to see a mixture of sunshine and heavy showers, with temperatures in parts of the Highlands up to 19C."
    ]
}