{
    "articleURL": "/news/article-12057793/Angry-vegan-loses-neighbours-Burns-Beach-Perth-cooking-meat.html",
    "content": [
        "Note asks resident to close window This is to stop the smell of meat cookingVegan family says odour is 'sickening' A letter from a vegan neighbour asking a resident to close their window when cooking meat to stop the 'sickening' smell from spreading has sparked fierce debate over whether the request was reasonable.",
        "The hand-written note, which was labelled 'Please take seriously' and 'Important message', was shared on social media by Sarah, who lives in Perth's northern coastal suburb of Burns Beach.'Hello, Neighbour,' the note begins.'Could you please shut your side window when cooking, please?'My family are vegan (we eat only plant-based food), and the smell of the meat you cook makes us feel sick and upset.'We would appreciate your understanding.'The letter drew sharply divided comments.'I'd understand if they were smoking cigarettes and the smoke and smell was spreading and affecting the family's health,' one person wrote.'But not liking the smell of meat, this isn't really a good reason to ask someone to close their windows.''What does she do when she takes the kids to the park, and people are cooking BBQs? Ask them to stop cooking. Audacity.'",
        "Another argued vegans were deluding themselves.'Disregard the letter, as there is no such thing as a real vegan,' they said.'All vegetable farming has massive impact on the land and kills thousands of small mammals and birds.'However, not all thought the request was unreasonable. 'I feel like this was a genuinely polite letter, and it’s true the smell of meat is overpowering,' one person wrote.'It would be nice to see some respect for your neighbours, and not publicly trying to shame them for holding strong ethical morals.' ",
        "'Yeah nah,' was one of the curt replies.'Most people are downright nasty to people who don't eat animals.' Another replied that: 'No one has the right to tell you how to live in your own home!!''Be vegan. Eat meat. Each to their own!' the reply stated.'No one has the right to push views on the other or expect to be able to control what they do.  If she doesn’t like it close her own window. Simple.'Another thought the letter was 'most definitely polite' and suggested the recipient 'could close their windows, don’t you think?'.",
        "However, this was met with the quick retort: 'Not polite, actually so self entitled and rude.'  Some of those commenting suggested Sarah take matters into her own hands.'I’d be cooking up bacon and steak everyday and putting a fan behind it and directing it out the window!' one wrote.'Write back and say you're offended and sad by what they said about your cooking and could they please move to a different room as you would appreciate their understanding,' another suggested. 'Pleaseeee get a smoker and slow cook meat all day,' was another suggestion. "
    ]
}