{
    "articleURL": "/wires/pa/article-12042249/Stephen-Tompkinson-punched-man-making-noise-outside-home-court-hears.html",
    "content": [
        "Actor Stephen Tompkinson punched a man to the ground and left him with traumatic brain injuries after confronting him for drunkenly making noise outside his home, prosecutors have told a jury.",
        "The 57-year-old DCI Banks star is on trial at Newcastle Crown Court accused of inflicting grievous bodily harm on Karl Poole on May 30 2021.Prosecutor Michael Bunch said Tompkinson called police at about 5.30am to report two drunken men outside his house in Whitley Bay, North Tyneside.He told officers he had taken a bottle of Jagermeister from them and wanted them “moved on”, jurors heard.",
        "About half an hour later, a neighbour called the emergency services to report that one of the men was lying unconscious in the street.Caroline Davidson, who watched the incident from her bedroom window, later told officers she saw Tompkinson slap Mr Poole with his right hand before punching him to the head with his left fist.She said Mr Poole stumbled and then fell backwards, striking his head on the roadway.Mr Bunch told the court Mr Poole and his friend, Andrew Hall, had been drinking since around midnight and had gone to the beach to watch the sunrise before walking back to Mr Hall’s house, passing Tompkinson’s home on Beech Grove on the way.",
        "Mrs Davidson was woken by the noise of the two men “laughing and carrying on” and looked out of her window to see them lying on a path near Tompkinson’s address.",
        "“She could see that one, later found to be Mr Poole, had on only his underpants, with a towel lying on the path next to him.”Mr Bunch said Mrs Davidson went back to bed but looked out again when she heard another voice about five minutes later.Jurors were told she saw the defendant standing on his driveway speaking to the two men. The defendant first slapped Mr Poole with his right hand before punching him to the head with his left fist. Mr Poole stumbled and then fell backwards striking his head on the roadway, where he lay unconscious  Michael Bunch, prosecutor  Mr Bunch said: “Although she could not hear what her neighbour was saying, Mrs Davidson formed the view, from his hand gestures, that (Tompkinson) was telling the two men to get on their way.“It appeared that one of the men said something back and Mrs Davidson saw her neighbour draw back his fist, before apparently thinking better of it and lowering his hand.“The two men, who were obviously heavily drunk, tried to get to their feet, but Mr Poole could hardly stay upright, and Mr Hall had to help him keep his feet.“The two made their way a short distance before stopping, possibly because the defendant had said something further to them.",
        "“Mrs Davidson watched as the defendant approached the two men, who were wobbling from side to side.“The defendant first slapped Mr Poole with his right hand before punching him to the head with his left fist.“Mr Poole stumbled and then fell backwards striking his head on the roadway, where he lay unconscious.“Concerned for what she had seen, Mrs Davidson asked her husband to call the ambulance service.”The court heard that after Mr Poole had gone to the floor, Tompkinson used his mobile phone to record two separate clips of the two men, but did not contact the ambulance service himself.Mr Poole, who was still unconscious, was taken to hospital and found to have a fractured skull with resulting significant traumatic brain injuries, jurors heard.After Tompkinson was arrested, he told police he had gone out to ask the two men to move on, so they did not disturb his partner and her child, who were asleep in the house, Mr Bunch said.In his interview, he told officers he acted in self-defence after the men had become “aggressive” and moved towards him.Mr Bunch said: “He said he had turned to face Mr Hall and then, when he looked back, Mr Poole had gone to the floor.",
        "“The Crown say that this claim of aggressive behaviour by the two men is simply not supported by any of the evidence in the case.“The truth is that the defendant’s story is nothing more than a weak attempt by him to deflect blame onto others for what were his wholly unjustified aggressive actions towards Mr Poole.”Giving evidence on Wednesday, Mr Poole said he had “absolutely zero” memory of that night, and that details in the statement he gave to police describing the incident was “from what I’ve been told”.Nicholas Lumley KC, defending Tompkinson, told him: “I’m going to suggest you fell as a result of a simple push and since that event you have exaggerated what happened that day.”Mr Poole confirmed he had made a compensation claim through the Criminal Injuries Compensation Authority.In the call made by Tompkinson to police, played in court, he said he had “two incapable drunks” outside his house and that one of them was “just in his underwear”.“I’ve asked them to move. They can’t move,” he told the call handler.Tompkinson denies the charge and the trial continues."
    ]
}