{
    "articleURL": "/sport/football/article-12050379/Jamie-Carragher-calls-Sam-Allardyce-DELUSIONAL-comparing-Guardiola-Klopp.html",
    "content": [
        "Pep Guardiola and Jurgen Klopp have shared the Premier League since 2016-17Jamie Carragher suggested Sam Allardyce's comments were tongue-in-cheek  Guardiola AGREES with Allardyce's claim to be his equal ahead of City vs Leeds Jamie Carragher has questioned Sam Allardyce's comments on being named Leeds manager earlier this week, suggesting that 'Big Sam' would not have had the success of Pep Guardiola working at Manchester City. ",
        "The 68-year-old was brought in to steady the ship at Leeds ahead of their final four games, with the Whites hovering precariously above the relegation zone on goal difference. In his first press conference, Allardyce claimed to be as good as Guardiola, Jurgen Klopp and Mikel Arteta, in a headline-grabbing speech. Carragher, however, rubbished the idea that the former Bolton, West Ham, Everton and Newcastle boss is in the same elite bracket.The ex-Liverpool star suggested that Allardyce's comments my have been made tongue-in-cheek, but insinuated the same claims would have been met with greater incredulity from a foreign coach.",
        "'Can you imagine the reaction if an overseas coach with no major honours to his name introduced himself to a Premier League club in such a way?' Carragher writes in his column for the Daily Telegraph. 'How would Brighton's manager, Roberto de Zerbi, have been received had he declared himself on the same level of two of the most successful managers of the modern era? At best ill-advised, and at worst deluded.'With respect, if Allardyce was in charge of the current Manchester City or Liverpool squad, there isn't a chance they would be playing the possession or 'gegenpressing' game that has brought their respective coaches every honour.' Allardyce has made a reputation as one of English football's 'fire-fighters', brought in to save clubs from relegation, as he has been appointed at Elland Road for that exact reason. ",
        "In the past, he has a positive record in doing so, rescuing the likes of Everton, Sunderland and Crystal Palace in the past, before succumbing to the drop at West Brom two seasons ago. But although Caragher credits Allardyce's forward-thinking approaching to data analysis in senior football, he insists that Premier League viewers should pay greater deference to foreign managers who have enhanced the division's quality.Allardyce sides traditionally tend to send the ball long in an attempt to put it in a dangerous area as soon as possible, rather than intricately build up from the back like a Guardiola or Arteta side.  Although the most successful Premier League manager - Sir Alex Ferguson - was Scottish, the division has never been won by an English coach. And Carragher cites the likes of Guardiola and Klopp - who have shared every title since 2016-17 - as having changed the English game. ",
        "'What I object to is the suggestion that these great managers are not truly worthy of their place above their peers, as if their success is more a consequence of opportunity than talent,' he continues. 'Guardiola and Klopp are genuine game-changers. 'The levels of coordination between all 11 players (including the goalkeeper) in Guardiola's Barcelona and Manchester City team are of another level. Nobody was playing like this 20 years ago, let alone in the Seventies and Eighties. Why pretend or argue otherwise?'",
        "Allardyce arrives at a Leeds side with four games to secure their Premier League status, but encounters Guardiola's Man City side first up in a testing start to the former England boss' tenure at Elland Road. Guardiola himself perhaps surprised many when he agreed with Allardyce's assertion, and praised his opponent's 'charisma' ahead of their clash on Saturday. "
    ]
}