{
    "articleURL": "/wires/ap/article-12061103/Tennessee-governor-schedules-special-session-address-guns.html",
    "content": [
        "NASHVILLE, Tenn. (AP) - Tennessee Gov. Bill Lee on Monday announced that he would call lawmakers back to the state's Capitol on Aug. 21 for a special session after the Republican-led Legislature adjourned earlier this year without taking on gun control.",
        "The announcement comes weeks after six people - including three young children - were killed in a Nashville school shooting. The tragedy sparked Lee, a Republican, to urge the General Assembly to pass legislation that would keep firearms away from people who could harm themselves or others. But instead, GOP leaders moved to quickly adjourn rather than take up the governor's request in the remaining days of an already chaotic session.Within hours of the Legislature adjourning, Lee announced he would call a special session to take up the topic. However, outside of a date being selected, Lee's Monday announcement didn't include information on what specific proposals lawmakers will take up.\"There is broad agreement that action is needed, and in the weeks ahead, we´ll continue to listen to Tennesseans and pursue thoughtful, practical measures that strengthen the safety of Tennesseans, preserve Second Amendment rights, prioritize due process protections, support law enforcement and address mental health,\" Lee said in a statement, which did not include any reference to the Covenant school shooting or mention of firearms.Lee has mounted a campaign for \"temporary mental health orders of protection\" and has maintained that it is not a so-called red flag law, which he has described as a \"toxic political label.\"To date, 19 states have red flag laws on the books - with many lawmakers enacting them after tragedies. Notably, Florida did so after the 2018 mass shooting at Marjory Stoneman Douglas High School in Parkland that killed 17 students. Law enforcement officials had received numerous complaints about the 19-year-old gunman´s threatening statements.",
        "In allowing courts to issue what are known as extreme risk protection orders, the laws are intended to temporarily remove guns - usually for up to a year - from people showing signs of potentially violent behavior. In many cases, family members or law enforcement must petition a court for an order.Under Lee's proposal, law enforcement would first determine if a person is a threat, then a hearing with the person in question would be held, generally within three to five days. A judge would rule whether they should indeed have their weapons taken away temporarily. If so, the person would have to surrender their guns and ammunition to a third party within two days and any handgun carry license would be suspended within three business days. The actions would last up to 180 days at a time.Enough Republicans joined gun lobby groups in opposition to keep Lee´s proposal from coming to a vote in the waning days of the recent legislative session. It's unclear if lawmakers will be asked to advance this same proposal during the upcoming special session.Without mentioning gun policy, a spokesperson for House Speaker Cameron Sexton said Monday that the Republican plans on meeting with people on a \"wide array of issues and policies\" and is awaiting word on what proposals the governor will include in the special session.",
        "Meanwhile, some advocates for gun control reforms have argued that Lee´s proposed measure doesn´t go far enough."
    ]
}