{
    "articleURL": "/sport/football/article-12050363/Tottenham-announce-Premier-League-WSL-double-header.html",
    "content": [
        "Both fixtures could play a large role in how both sides' next season shapes upThe men's tie will kick-off at 12.30pm with Spurs Women's clash due at 4.15pmVicky Jepson's team hover just three points off bottom-of-the-table Reading Tottenham have announced the first-ever Premier League and WSL double-header, to be played at the Tottenham Hotspur Stadium on May 20. ",
        "In a landmark day for the women's game, the bumper day of football in north London will start with Ryan Mason's side's 12.30pm kick-off against Brentford, with the WSL fixture seeing the home side face Reading from 4.15pm. All Premier League tickets sold will allow fans the opportunity to stay and watch the women's match, which has been moved forward from its scheduled Sunday time-slot to accomodate the history-making day out. A statement shared by the club shared that the inclusive ticket gives 'regular followers of our Men's team a fantastic opportunity to make a day of it at the stadium and show their support for Spurs Women in what is set to be a crucial match in the fight for top-flight survival.' Both of the clashes will have weighty consequences and could play a large role in how next season plays out. ",
        "The men's side currently sit seventh but have tricky ties to come against a resurgent Crystal Palace and Unai Emery's Aston Villa. Their penultimate league match against Thomas Frank's players could see the promise of European football next season hanging in the balance. Under interim manager Vicky Jepson, the women's team will face equally high stakes. Sitting ninth in the WSL table, Tottenham hover over the relegation place by a scant three points and Leicester and Brighton beneath the north London outfit have a game in hand. ",
        "Whilst bottom-of-the-table Reading may not prove the toughest challenge Jepson's players have faced, Spurs Women are on shaky ground having won only four matches this season. The team are set to face WSL-leaders Manchester United on the road on Sunday in a meeting likely to leave Spurs in desperate need of points as the season draws to a close. Tottenham's chairman Daniel Levy has been an outspoken advocate of scrapping promotion and relegation in the WSL, although it is thought not to be in light of his side's torrid season. Levy is understood to be one of a number of executives that believe that the threat of relegation is stopping clubs from investing heavily in the infrastructure necessary for success in the top flight.   "
    ]
}