{
    "articleURL": "/wires/ap/article-12053705/Indian-troops-kill-2-rebels-Kashmir-ongoing-operations.html",
    "content": [
        "SRINAGAR, India (AP) - Indian soldiers killed two suspected militants in ongoing counterinsurgency operations in Kashmir on Saturday, officials said, a day after rebels fighting against Indian rule killed five soldiers in the disputed Himalayan region.",
        "Joint army, paramilitary and police teams \"spotted and pinned down\" the militants before killing one of them in a forested area in the southern Rajouri sector, an Indian army statement said. It said soldiers recovered an automatic rifle and some ammunition and grenades and noted another militant was \"likely to be injured.\"There was no independent confirmation of the incident.Separately on Saturday, government forces killed another militant in a gun battle in western Kunzer area, police said.On Friday, rebels triggered an explosive device during an encounter with the Indian army, killing five soldiers, the military said. That fighting erupted after soldiers tracked a group of militants involved in an ambush of an army vehicle on April 20 that killed five Indian soldiers in the same region, according to the army.The violence comes as Indian authorities are on high alert in Kashmir and have stepped up security in the already highly militarized region ahead of a meeting of officials from the Group of 20 leading industrialized and developing nations on promoting tourism in the region later this month.",
        "It will be the first significant international event hosted in Kashmir after India stripped Kashmir of its semiautonomy and took direct control of the territory amid a monthslong security and communications lockdown in 2019. Kashmir has been on edge as authorities also put in place a slew of new laws that critics and many Kashmiris fear could change the region´s demographics.",
        "Rebel groups have been fighting since 1989 for Kashmir´s independence from India or its merger with neighboring Pakistan.Most Muslim Kashmiris support the rebel goal of uniting the territory, either under Pakistani rule or as an independent country.New Delhi insists the Kashmir militancy is Pakistan-sponsored terrorism. Pakistan denies the charge, and most Kashmiris consider it a legitimate freedom struggle.Tens of thousands of civilians, rebels and government forces have been killed in the conflict."
    ]
}