{
    "articleURL": "/wires/reuters/article-12051551/Eagles-sign-rounder-Jalen-Carter-add-TE-Dan-Arnold.html",
    "content": [
        "Defensive tackle Jalen Carter became the initial first-round pick in the 2023 NFL Draft to agree to a contract, signing a four-year deal with the Philadelphia Eagles.",
        "The NFL Collective Bargaining Agreement calls for Carter, the ninth overall pick last month, to receive a guaranteed deal worth $21.8 million.Carter and Georgia teammate Nolan Smith were chosen in the first round by the Eagles, who drafted another former Bulldog, Jordan Davis, in the first round in 2022.Philadelphia agreed to terms with two other draft picks: Stanford quarterback Tanner McKee and Texas defensive tackle Moro Ojomo.The Eagles also announced they've agreed to terms with tight end Dan Arnold, who caught nine passes for 135 yards with the Jacksonville Jaguars last season.Arnold, 28, also has played for the Panthers, Saints and Cardinals in six NFL seasons with 11 career starts. He has 95 catches for 1,258 yards and seven touchdowns.Carter was rated No. 1 overall on multiple draft boards entering the NFL Scouting Combine before character and accountability concerns surfaced. Carter left the combine to turn himself in to police in Georgia for drag-racing in an incident that police said caused a fatal crash. Devin Alex Willock and staff member Chandler Louise LeCroy were killed in a car crash after street racing against Carter, according to Athens police.\"We understand that all these players - they need to be developed,\" Eagles general manager Howie Roseman said. \"They're coming into the league at a very young age. They're not finished products. I think all of us, when we're 21 or 22, hopefully, have grown a lot from that time. And you just really want to get to know the person and what's in their heart. And I think when we got to know Jalen, we just felt like here's a kid that does love football.\"",
        "Roseman said the Eagles spent hours looking into all of their highest-ranked prospects and the team's security director looked into multiple players and incidents, according to the team.--Field Level Media"
    ]
}