{
    "articleURL": "/wires/ap/article-12043199/Negro-Leagues-Museum-starts-drive-new-25M-facility.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - The Negro Leagues Baseball Museum is embarking on a fundraising campaign to raise $25 million for a new building to house its education center and what has become one of the world's unique collections of baseball memorabilia.",
        "Museum president Bob Kendrick said the \"Pitch for the Future\" campaign is designed to lead to a new 30,000-square foot facility that would be adjacent to the Buck O´Neil Education and Research Center, which is named for the Negro Leagues great who helped to lead the fundraising effort to build the initial museum.\"Our growth from a one-room office to becoming America´s National Negro Leagues Baseball Museum has been an amazing journey,\" said Kendrick, who also announced that Bank of America had already donated $1 million to the project.\"Now,\" Kendrick said, \"we´re building an organization that will continue to preserve and celebrate the triumphant story of the Negro Leagues but also fortify our position as one of the nation´s most important civil rights and social justice institutions.\"Long before Jackie Robinson broke the color barrier, Black players were largely relegated to disparate leagues spread across the U.S., often embarking on long barnstorming tours. But the preeminent organization was the Negro National League, which was founded at the Paseo YMCA in the historic 18th &amp; Vine section of Kansas City, Missouri.The league was initially composed of eight clubs, including the Kansas City Monarchs of O'Neil, and featured some of the great players of any era - Satchel Paige, Josh Gibson and Cool Papa Bell - many of whom never got to play in the big leagues.",
        "Robinson also played for the Monarchs before the Dodgers signed him in 1945 and baseball's integration began. Hank Aaron, Willie Mays, Ernie Banks and many others also got their starts in the Negro Leagues. But over time, as more Black players signed major league contracts, the era of the Negro Leagues slowly came to an end.The museum is designed to keep that history alive. It features lockers set up for some of the game's best players, a \"Field of Legends\" where there are nearly life-sized bronze statues of players on the field, and a collection of memorabilia that includes nearly 200 autographed baseballs donated by Geddy Lee of the Canadian band Rush.\"We share NLBM´s mission to preserve and celebrate the rich history of African American baseball and its impact on the social advancement of America,\" Matt Linski, the president of Bank of America Kansas City, said in announcing its donation.\"Our commitment recognizes the importance - culturally and economically - of the 18th &amp; Vine District to Kansas City and we hope it will be an example for other funders to follow,\" Linski said. \"Additionally, this grant is paramount to ensuring greater understanding and better appreciation of the many contributions African Americans have made and continue to make, including Jackie Robinson breaking the major-league color barrier.\"",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}