{
    "articleURL": "/wires/reuters/article-12050667/Canadas-Enbridge-reports-upbeat-Q1-higher-transportation-volumes.html",
    "content": [
        "May 5 (Reuters) - Canadian pipeline operator Enbridge Inc on Friday reported a rise in first-quarter adjusted profit on higher delivery volumes of oil and gas amid sustained fuel demand.",
        "The company, which moves about 30% of the crude oil produced in North America and nearly a fifth of the natural gas consumed in the U.S., said earnings from its gas transmission and midstream business jumped about 19% in the quarter.While global oil prices have declined considerably from peaks hit last year after Russia launched a full-scale invasion of Ukraine, prices are still high enough for companies to produce profitably, boosting demand for pipelines.Enbridge's Mainline system, which ships the bulk of Canadian crude to the United States, transported 3.1 million barrels per day (bpd) in the first quarter, compared with 3.0 million bpd a year earlier.Credit Suisse analyst Andrew Kuske was positive on the results. He said the earnings were largely driven by the core pipeline business and highlight ENB's ability to expand its business in an attractive and de-risked fashion.However, the company saw a decline in net income in the quarter mainly due to a $638 million hedging loss. Oil companies use hedging to guard against sudden price downturns.First-quarter results were in line with expectations, despite extreme volatility in financial and commodity markets, partly benefiting from high utilization across our systems and record volumes on the Mainline, CEO Greg Ebel said.U.S.-listed shares of the company rise 1.5% to $39.85 in premarket trading.",
        "On an adjusted basis, Enbridge reported a profit of C$1.73 billion ($1.28 billion), or 85 Canadian cents per share, for the three months ended March 31, compared with C$1.71 billion, or 84 cents per share, last year.This was at par with analysts' average expectation, according to Refinitiv data. ($1 = 1.3491 Canadian dollars) (Reporting by Mrinalika Roy; Editing by Shinjini Ganguli)"
    ]
}