{
    "articleURL": "/wires/reuters/article-12039919/All-eyes-star-power-Knights-Oilers-clash-Game-1.html",
    "content": [
        "The top two picks of the 2015 NHL Draft will go head-to-head when the Connor McDavid-led Edmonton Oilers face Jack Eichel and the Vegas Golden Knights in Game 1 of a Western Conference semifinal series on Wednesday night in Las Vegas.",
        "It's the first-ever postseason meeting between the two teams that paced the Pacific Division during the regular season. Vegas finished with 111 points to finish as the top seed in the Western Conference, while fast-closing Edmonton, which went 14-0-1 in its last 15 games, took second with 109 points.The Golden Knights have been off since Thursday, when they defeated the Winnipeg Jets 4-1 in Game 5 at home, while the Oilers needed six games to polish off the Los Angeles Kings. Edmonton capped its first-round series with a 5-4 victory on Saturday night in Los Angeles.Edmonton, led by McDavid's league-leading 153 points (64 goals, 89 assists) and Leon Draisaitl's 52 goals and 76 assists, won the regular-season series with the Golden Knights, 3-0-1.\"Obviously a different animal, regular season and playoffs,\" McDavid said. \"I don't think that translates very well. (Vegas is) obviously a very good team. That core has been together a long time.\"McDavid, a two-time (soon to be three-time) Hart Trophy winner generally regarded as the world's best player, was the No. 1 pick of the 2015 draft by the Oilers. Eichel, who led Vegas with 66 points (27 goals, 39 assists), went second to the Buffalo. Eichel was a three-time All-Star for the Sabres but was eventually traded to the Golden Knights in a blockbuster deal in November of 2021 following a dispute with management over neck disk replacement surgery.",
        "Now Eichel is playing in the Stanley Cup playoffs for the first time.\"I think we're all past the 2015 draft,\" Eichel said Tuesday when asked about his matchup with McDavid. \"It's been a couple of years, right? He's gone on to do some incredible things. ... It's two teams going at it in this playoff series. That's the way I'm going to view it, and I'm sure that's the way everyone will.\"Vegas coach Bruce Cassidy knows the battle between McDavid and Eichel will take center stage but realizes that the Golden Knights have to play as a team if they want to strike first in the best-of-seven series.\"I think everyone will be talking about that matchup,\" Cassidy said. \"I look at it that our team has to outplay the Oilers, not Jack versus McDavid, because that's nearly an impossible ask.\"The microscope will also be on Edmonton's record-setting power-play, which scored on 32.4 percent of its chances in the regular season, the highest success rate since the NHL started keeping track of the stat in 1977-78. The Oilers converted an eye-popping 9 of 16 chances (56.3 percent) with the man advantage in the series with Los Angeles.Draisaitl led the NHL with 32 power-play goals while McDavid added 21. Their combined 53 power-play goals are more than Vegas had as a team (42). The Golden Knights ranked just 19th in penalty kill (77.4 percent) during the regular season but led the NHL by a wide margin in blocked shots with 1,494.",
        "\"We feel good about our game, we feel good about our health, we feel good about our mental mindset heading into the second series,\" Edmonton coach Jay Woodcroft said. \"I think it's going to be a big challenge, it's a different challenge, but we feel we have the people that are up for it.\"--Field Level Media"
    ]
}