{
    "articleURL": "/wires/ap/article-12039021/Mechanic-charged-homicide-fatal-NYC-elevator-plunge.html",
    "content": [
        "NEW YORK (AP) - An elevator mechanic's failure to execute basic safety procedures caused an elevator at a New York City building to plunge six stories and crush a co-worker to death, prosecutors said Tuesday.",
        "Mechanic Peter Milatz, 67, was charged with criminally negligent homicide for the Feb. 18, 2021 death of apprentice mechanic Joseph Rosa, 25, at a Bronx building where the men were working to modernize the elevator.According to prosecutors, Milatz and Rosa were working on replacing the steel ropes between the elevator cabin and the counterweight when Milatz told Rosa to go to the pit at the bottom of the shaft.At Milatz's instruction, prosecutors said, Rosa secured the counterweight, then used a small saw to cut through the ropes. The elevator cabin plunged down the shaft and crushed Rosa. Prosecutors said Milatz had failed to carry out a procedure called hanging the elevator cabin, which prevents the elevator from falling when the ropes are cut. Additionally, they said, he had earlier removed a safety feature called the governor, which triggers the elevator's braking system, in order to replace it with a new one. The replacement didn't fit, but instead of reinstalling the old governor, Milatz allegedly continued to work on the elevator without the safety feature, prosecutors said.\"The defendant allegedly failed to comply with multiple safety protocols, and because of those faults the elevator car plunged six stories, killing his co-worker,\" Bronx District Attorney Darcel Clark said in a news release. \"If safety measures had been followed, the victim would still be alive today.\"",
        "Milatz, a resident of upstate Orange County, was arraigned in state Supreme Court in the Bronx and given supervised release. He is due back in court on June 8.A phone message seeking comment was left with Milatz's attorney.Rosa had married a few months before his death and was looking forward to a bright future with his bride, Karina Stepanova-Rosa, the Daily News reported.\"He made my life as beautiful as possible,\" Stepanova-Rosa told the newspaper. \"He was a real big light in all of our lives. He is the most amazing person I ever met, and his friends, everyone is just shattered by this.\""
    ]
}