{
    "articleURL": "/wires/pa/article-12052231/Firefighter-tells-humbling-experience-delivering-equipment-Ukraine.html",
    "content": [
        "A firefighter who was part of a convoy of fire engines and lorries delivering life-saving equipment for Ukraine has described the experience as “very humbling” after reaching Poland.",
        "The timing of the shipment is meant to honour the Eurovision link between Ukraine and the UK, with the vehicles leaving Liverpool on Tuesday, the city which will host the competition later this month.Darren Cleaves, station manager for South Wales Fire and Rescue Service, was in Poland to help deliver fire engines as well as life-saving equipment for Ukrainian firefighters.“It’s been a very humbling experience because knowing that the small difference we can make to help (firefighters in Ukraine) is really rewarding for us,” the 48-year-old from Monmonth told the PA News agency.",
        "“It has been quite challenging – the logistics behind it in terms of keeping our team of over 80 people fed, watered, truck refuelled, and dealing with maintenance issues, but we’ve managed to overcome all of those.”Mr Cleaves is part of the biggest party of the convoy with 24 drivers from South Wales Fire and Rescue Service. They delivered fire vehicles and vital equipment for firefighters in Ukraine, arriving in Poland on Friday after making the three-day journey from Liverpool.The convoy of fire engines and large lorries carrying equipment has hardly stopped during the course of its mammoth journey to ensure that the equipment is delivered as quickly as possible.“We’ve got a high number of drivers with good rotation, so we’ve managed to keep the vehicles moving and stopping at the end of every evening, only for a couple of hours asleep,” Mr Cleaves explained.",
        "“On behalf of the convoy, everyone is very humbled and overwhelmed by the whole experience and I’m proud to be part of this small aid effort in helping Ukrainian firefighters.”Phil Garrigan, vice chair of the National Fire Chiefs Council (NFCC) and chief fire officer for Merseyside Fire and Rescue Service, said he is “very proud” of the 87 volunteers who made the lengthy trip to deliver thousands of items of equipment to Ukraine.Speaking from Poland, the 53-year-old said his team can feel “the pride of being able to contribute” and provide aid for the country.“When you’re in the throes of war or you’re struggling, it’s nice to know that you’ve got people outside your own country who support you and are here for you,” he told PA.“It’s very much about the fire and rescue service family looking after the (Ukrainian) fire and rescue service family, knowing that they’ve got a role to play serving their community.“We’re doing that to the best of our ability and we’ve got people who are so passionate, so I think they should all be applauded for that and I’m very proud of them.”",
        "The donations take contributions by England and Wales’ fire services to support Ukraine to 87 fire and rescue vehicles and more than 100,000 items of equipment.",
        "Mr Garrigan, who has been part of five convoys delivering fire equipment to Ukraine, spoke of the tragic losses of Ukrainian firefighters. He has liaised with Ukrainian ministers about future support that the UK fire and rescue services can offer.“As of today, 270 fire stations have been destroyed, about 1,500 fire engines have been destroyed, and 68 firefighters have been killed,” he said.“(A further) 250 firefighters have been injured and five could be in captivity, so you can understand why the UK Fire Rescue Service would want to support.”"
    ]
}