{
    "articleURL": "/news/article-12052035/Tucker-Carlson-makes-public-appearance-Fox-News-firing.html",
    "content": [
        "Tucker Carlson was fired from Fox News on April 23 after 14 years at the networkMaking his first public appearance since his shock firing, Tucker joked with the sold out audience about his dismissalIt comes as Fox News ratings fell behind MSNBC, one week after his departure Former TV presenter Tucker Carlson has made his first public appearance after being fired from Fox News last month. ",
        "Carlson, 53, had been speaking at the Oxford Performing Arts Center in Oxford, Alabama, for the annual fundraiser for Rainbow Omega on Thursday night. A sold-out crowd of 1,189, paying prices of between $50 to $125, gathered in the arts center to hear Carlson give a wide ranging commentary during an hour long speech.According to the Anniston Star, he immediately approached the subject of his recent firing from Fox News in his opening line. ",
        "Carlson, who earned $20 million a year at Fox, joked: 'I'm probably the first unemployed person you ever invited to speak.'It's funny. I never give speeches because I'm working. When I accepted this speech six months ago or something, I didn't realize how much free time I would have. 'One never knows, does one?'The newspaper reported that Carlson spoke at length of his love for the state of Alabama, as well as American politics. The event had been organized as a fundraiser for Rainbow Omega, a residential facility in Alabama that houses adults with developmental disabilities.Carlson left his Fox News show on April 23, with no official reason given for why the company let their most-watched anchor go.The decision was made six days after Fox settled with Dominion Voting Systems for $787.5 million.Since then, a slew of rumors pertaining to his dismissal have emerged. They span from claims over Carlson's texts that emerged in the wake of the lawsuit, which included him claiming he hated Trump.",
        "There were also rumors Carlson may have been fired over a gender discrimination suit filed by a former female booker on his show. ",
        "It has also since emerged that Carlson sent an incendiary text message the day after the January 6 storming of the Capitol - which the board of Fox News learnt about on the eve of their defamation trial.The pivotal role played by the January 7, 2021, text message was originally reported  by The New York Times.In the text to one of his producers, Carlson recalls seeing a mob of three white men attacking an 'Antifa kid' and wanting the victim to be killed. But, Carlson wrote, he realized wanting the 'Antifa kid' to die was wrong.Carlson, whose critics call a white supremacist, also asserted that white people in general do not act so dishonorably as to launch a three-against-one attack. ",
        "He did not specify the race of the 'Antifa kid'.'It was three against one, at least,' Carlson wrote. 'Jumping a guy like that is dishonorable obviously. It's not how white men fight.'Following his dismissal from Fox News, their ratings have slumped as fans of the firebrand presenter left the network in droves. On Monday, MSNBC scored a prime time win over Fox News in both the key age demographic and in total viewers. Fox News, however, still won the week in primetime in both categories, according to Nielsen.",
        "The network beat out its competitors with an average of 1.693million total viewers, and 176,000 in the critical 25-54 age demographic.Fox News brought in an average of 1.598million total viewers between 8pm and 11pm, and 164,000 viewers in the demographic."
    ]
}