{
    "articleURL": "/news/article-12046765/Watch-moment-creeping-burglar-crawls-cafe-digging-tunnel-Rolex-shop-door.html",
    "content": [
        "Footage of the moment was caught on CCTV at a café in Wilmslow, CheshireThe masked raider caused £10,000 worth of damage as he made the tunnelREAD MORE: Moment Marks &amp; Spencer security guard chased a homeless man This is the moment a burglar commando crawled through a café in a Bank Job style fashion, before digging a three-foot-long tunnel into a Rolex shop next door.",
        "The shocking moment, which appeared to be inspired by the non-stop-action film starring Jason Statham, saw the hooded man slide around commando-style in Rise Café, Wilmslow, Cheshire.The CCTV footage captured the exact moment the masked raider, who may have worked with accomplices, creeped through the eatery, before burrowing into Preston's luxury jewellers next door around 9pm on April 26.The individual fled without any pricey jewellery after the alarms went off and officers arrived to investigate, police have confirmed.   But pictures taken in Rise Café show how the burglar used heavy machinery to remove bricks from a wall in its kitchen to make the tunnel before being disturbed - but causing nearly £10,000 worth of damage.",
        "The owners of the café, who didn't want to be named, also revealed how the burglars had taken £1,200 from their till.They said: 'It was terrible. You can't imagine anyone doing this.'They came from the backyard and smashed the door to get in. They drilled through the wall and made a big hole. They left loads of tools behind.'The tunnel was about three feet long, if you bent over you could crawl to the other side.'They broke my plumbing, the fridge and my alarm and caused £10,000 worth of damage to my property. They took £1,200 from my till.'",
        "The break-in at the café - in the area where Manchester United legends Alex Ferguson and Rio Ferdinand have previously lived - happened over two hours.During this time, the burglar began digging the tunnel, using drills and other large digging tools to carve out a large passageway. Cheshire Constabulary said they were alerted to an alarm going off at Rolex dealer Prestons, on Water Lane at 11.35 pm.",
        "When they arrived, they discovered the large tunnel leading from the café into the jewellery shop.However, the person, or people, responsible were nowhere to be seen.The owner of the café, which has since reopened, said the shocking incident had been a 'nightmare'.She said: 'There was a lot of mess. They broke my security camera and my door. It's a nightmare.''My sister and brother work with me. It is very hard but we are happy here. All of this is very bad for my business.'Detective Sergeant Robert McCubbin from Cheshire Constabulary has now appealed to locals for CCTV footage from the time of the break-in.In urging those with information about the incident to come forward, he said: 'This investigation is in its early stages, and we are committed to doing all we can to identify the people responsible.'The jewellers are located in a busy part of Wilmslow town centre and as part of our investigation we're keen to hear from anyone who was in the area between 10.30pm and 11.30pm and believes they may have seen anything suspicious.",
        "'The same goes for anyone with any CCTV or dashcam footage which may aid our investigation.'"
    ]
}