{
    "articleURL": "/wires/reuters/article-12045357/Shell-makes-9-65-bln-profit-quarter-beating-forecasts.html",
    "content": [
        "Shell maintains dividend unchanged",
        "Announces $4 bln in share buybacksShell not looking to relocate HQ, CEO saysBy Ron Bousso and Shadia NasrallaLONDON, May 4 (Reuters) - Shell on Thursday posted first-quarter net profit of $9.65 billion as strong earnings from trading and higher liquefied natural gas (LNG) sales offset cooling energy prices, while extending its large share repurchase programme.The stronger-than-expected profits followed a string of forecast-beating results from rivals including BP and Exxon Mobil as the sector continues to benefit from strong demand and price volatility. Norwegian rival Equinor on Thursday also posted higher-than-expected quarterly profits.Shell kept its dividend unchanged at $0.2875 per share and also kept the rate of its share repurchase programme stable at $4 billion over the next three months, even as its cash generation fell in the quarter to $14.15 billion from $22.4 billion in the previous quarter.With buybacks and the dividend payout reaching $6 billion, or roughly 40% of cash flow, Shell exceeded its commitment to spend 20% to 30% of its cash flow on shareholder returns.BP saw its shares slump by over 8% on Tuesday after it slowed down its buyback programme.Shell shares were up 0.8% by 1242 GMT.\"In Q1, Shell delivered strong results and robust operational performance, against a backdrop of ongoing volatility,\" Chief Executive Officer Wael Sawan said in a statement.",
        "Sawan, who took the helm in January, told reporters he was focused on narrowing a wide gap in the share performance of Shell and its European peers against their U.S. rivals.PROFITS BEATShell reported adjusted earnings of $9.65 billion in the first quarter, exceeding a company-provided analyst forecast of $8 billion. The company's shares were up 0.8% in afternoon trade.That compared with earnings of $9.1 billion a year earlier and $9.8 billion in the fourth quarter of 2022, when Shell reported a record annual profit of $40 billion.Lower natural gas prices in the quarter weighed on Shell's giant integrated gas business, with profits slumping 18% to $4.9 billion. But this was broadly offset by a 139% jump in profits to $1.8 billion in its chemicals and refined products unit.Shell, the world's top LNG trader, said LNG production rose in the quarter thanks to higher uptime at its Prelude floating facility off the coast of Australia.Shell showed \"strong operational performance in the quarter across all divisions with oil and gas trading playing a key role,\" Jefferies analyst Giacomo Romeo said in a note.Benchmark Brent crude oil prices averaged $81 per barrel in the first three months of the year, down 16% from a year earlier, while Europe's benchmark TTF front-month wholesale gas contract has fallen 50% so far this year.",
        "The British company maintained its 2023 capital spending plans unchanged in a range between $23 and $27 billion.Sawan has introduced a new management structure since taking office in January, including placing its renewables and low-carbon operations under the downstream division.(Reporting by Ron Bousso and Shadia Nasralla; Editing by Sharon Singleton and Mark Potter)"
    ]
}