{
    "articleURL": "/wires/reuters/article-12058801/Thai-election-agency-criticised-snags-early-voting.html",
    "content": [
        "BANGKOK, May 8 (Reuters) - Thailand's election commission came under scrutiny on Monday after what a monitoring group said were widespread complaints in early voting, fuelling concern on social media about the competence of a body appointed under military rule.",
        "The People's Network to Monitor Elections, an alliance of non-governmental organisations, said it received about 300 complaints during Sunday's early voting, including missing names, votes cast by the wrong people, mistakes with mailed ballots and incomplete lists of candidates at polling stations.Thailand holds an election on May 14 that could see an end to nine years of government led or backed by the military since it overthrew an elected government in 2014, in what was its second coup in less than eight years.The Election Commission of Thailand (ECT) said it had received 92 complaints and investigations were going on. It promised that similar mistakes would not be repeated on election day.The contest broadly pits parties of the ruling coalition with ties to the army and royalist establishment against an opposition movement that has won every election in the past two decades and was removed from office three times.Opinion polls last week showed two opposition parties with significant leads.Yingcheep Atchanont, executive director of NGO iLaw, which is part of the monitoring group, said mistakes were not major but showed a lack of understanding or training by some election personnel on the ground.\"They don't understand the system so they only do what they understand,\" Yingcheep said, adding many complaints were over the same issues.",
        "\"I think in these cases they're making honest mistakes.\"The hashtag \"why do we have an election commission?\" was trending widely in Thailand on Monday, with hundreds of thousands of users questioning the commission's ability to deliver a fair and accurate result.The commissioners were chosen in 2018 by institutions appointed by the junta after a 2014 coup by former army chief Prayuth Chan-ocha, who has been in power ever since.The poll body endured intense criticism during the last election, in 2019, with widespread allegations of manipulation and negligence, after it delayed the official result by more than a month and it changed its formula for awarding party-list seats.The commission at the time denied wrongdoing and said it needed time to allow recounts, disqualifications and by-elections. (Reporting by Panu Wongcha-um and Panarat Thepgumpanat; Writing by Martin Petty; Editing by Robert Birsel)"
    ]
}