{
    "articleURL": "/sport/football/article-12061351/James-Maddison-defends-Leicester-teammates-saying-not-hungry-Fulham.html",
    "content": [
        "James Maddison has clarified comments claiming Leicester 'weren't hungry' The Foxes capitulated in the first half during a 5-3 defeat to Fulham on Monday The midfielder said his teammates were working daily to fight off relegation James Maddison has defended his teammates in clarification of post-match reaction he gave following Leicester City's heavy defeat at the hands of Fulham.",
        "The Foxes were undone by a strong first-half performance from the Cottagers, going in 3-0 down at half-time, and while the second half was brighter for Dean Smith's crew, they still fell victim to a 5-3 defeat.The loss hit Leicester's hopes of Premier League survival, especially after Everton and Nottingham Forest both won their games later in the day.In his post-match comments to the BBC, Maddison claimed that the team 'were not hungry enough to want to win the game' at Craven Cottage.The 26-year-old England midfielder clarified his comments later on Twitter, supporting his teammates and their daily work rate on the training field.  ",
        "Maddison tweeted: 'What is wrong with social media, say 1 thing in an interview straight after a game and it gets taken way out of context. 'When I say not hungry enough I mean aggressive and on the front foot in duels, not us wanting to win or realising the importance.'We were not good enough today and we’ve only got ourselves to blame and apologise for that. 'But as someone who sees the work we are doing every single day to try and put this right, it’s not down to attitude or application. We will keep going until the very end.' ",
        "Speaking to reporters post-match, Smith said he did not foresee Leicester's poor performance at Fulham. ",
        "Smith said: 'I expected a far better performance and a better start to the game than we got. At this level, if you give the kind of goals away that we gave away it's going to be an uphill battle.'Leicester's battle to survive sees them host Liverpool next Monday, before their final two Premier League fixtures away to Newcastle United and at home to West Ham on the final day.It remains to be seen whether those will be the final top-flight games for the Foxes for this season, or for the foreseeable future."
    ]
}