{
    "articleURL": "/wires/reuters/article-12042193/MosaicML-launches-new-service-bid-challenge-OpenAI-price.html",
    "content": [
        "By Stephen Nellis",
        "May 3 (Reuters) - MosaicML, an artificial intelligence startup founded by former Intel Corp executives and academic researchers, released on Wednesday two new products aimed at beating industry giants such as OpenAI on price.San Francisco-based MosaicML, which has raised $64 million to date, launched in 2021 with a suite of software tools designed to make it cheaper to carry out artificial intelligence work, which often involves training AI algorithms on huge troves of data using expensive computer chips. The company makes money selling the tools to firms that want to develop their own customized AI systems.But on Wednesday, MosaicML announced several new services that will compete more directly with companies like OpenAI or Anthropic, which build AI systems and then charge for access to them. MosaicML said it will offer what is known as an inference service to software developers who want to add features to their apps like the ability to read and respond to text or generate images from a prompt.MosaicML is offering those services at a cost it says is as much as 15 times lower than rival services.\"We understand how to make these things very optimized. So do they,\" Naveen Rao, MosaicML's chief executive, told Reuters. \"There's a lot of margin built into this stuff, and at 15x cheaper, we're still making money on it.\"",
        "Behind the new service, MosaicML has developed its own foundation models, which is the category of core technology behind services like chatbot-enabled products from Microsoft Corp and Alphabet Inc's Google.Like many of its competitors, MosaicML will rent the technology to customers, but unlike most of them, it will also hand its code over to customers to run on their own hardware, so that MosaicML never sees the data. Because so much of the value of an AI system comes from the data used to train, many corporate customers want to go that route, Rao said.\"People buy us because we can do things on their private data. They have assurances that the model that's built on the private data is owned by them,\" Rao said. (Reporting by Stephen Nellis in San Francisco; Editing by Jacqueline Wong)"
    ]
}