{
    "articleURL": "/wires/ap/article-12061063/Comedian-Hannah-Gadsby-returns-stand-love-letter.html",
    "content": [
        "NEW YORK (AP) - Hannah Gadsby's new Netflix special illustrates a different side of the comedian that fans may not expect - a happier one.",
        "\"It´s a lighter show,\" Gadsby tells The Associated Press ahead of \"Something Special\" airing on Tuesday. \"It´s more positive. It´s expressing a happiness I don´t think I had done in earlier Netflix specials.\"The comedian kicks it off with good news - \"I got married. I know! It´s nice\" - and then promises viewers a change of pace from previous sets: \"This is going to be a feel-good show because I believe I owe you one.\"Gadsby, who uses the pronoun they, is in many ways going back to the style of comedy they employed before exploding to fame with the special \"Nanette\" in 2018, which had deeply affecting stories of violence, homophobia, misogyny and shame.\"It´s much more difficult to do comedy around a positive theme. Nobody is really that pleased watching someone be happy,\" they said. \"It´s a real risky show. I´d say this is riskier than `Nanette.´\"The new hourlong stand-up special recorded at the Sydney Opera house in Australia explores marriage, sudden fame, parenting styles, cultural differences and life with autism.",
        "\"In every one of my shows, I´m always talking about where I am a particular moment in my life,\" they say in the interview. \"I really want people to not know what I will do next, because therefore I am not under the pressure of delivering something.\"",
        "Asked it they're a little like Adele albums, in that they preserve a moment in time, Gadsby laughs. \"Yeah, I´m much better at being happier than she is. That´s a little joke.\"It's still a typically Gadsby set, with personal observances and sudden quick-thrust political critiques, culminating in a climax at the end in which they draw together many of the jokes that have been talked about.If there is a motif this time, it is rabbits. The critters are part of two tent-pole stories, one involving an ex-girlfriend and another their wife. Paper bunnies decorate the stage.Gadsby calls it a \"love letter\" to their wife, Jenney Shamash, an American producer. Their relationship deepened during the pandemic, and Shamash now lives in Australia with Gadsby and their two dogs, Douglas and Jasper.\"Part of what I like to do on stage is I want other people to love what I love. For someone on the spectrum, it can be really lonely,\" Gadsby says. \"It´s only been in recent years that I´ve learned how to make lasting connections through the diagnosis and confidence and things like that. So I thought that was worth sharing.\"In one section, Gadsby admits they were ill-prepared for fame, illustrated by a story of giving a very non-diplomatic reaction to getting a birthday gift from Jodie Foster.",
        "Of fame onstage, Gadsby says: \"Don´t expect it, that´s gross. But just on the off chance you find yourself famous, you´d better be prepared. Because I wasn´t and I made a dog´s breakfast of it.\"Gadsby is one of those people who doesn't believe suffering is needed to make good art and notes they don't need to generate any more since there's plenty to mine from their past.\"If I need to suffer in order to be a world-class comic, I don´t care much to be a world-class comic. That seems like too high a price,\" they say.\"Something Special\" builds from \"Douglas,\" where Gadsby revealed their diagnosis of high-functioning autism. The new show gives viewers a glimpse of how Gadsby sometimes misunderstands social queues and intentions.Asked in the interview, they say the diagnosis has been freeing, in a way. It means Gadsby doesn't worry about understanding everything, conserves more energy and offers a bit more control.\"Understanding it has helped. It has given me the confidence to understand my framing of things, which I think has made writing easier,\" they say. \"Now I feel like I have a lot more control. I´m not scrambling to be normal anymore, whatever that means.\"Fans who adore Gadsby's revolutionary take on art history - a large portion of \"Nanette\" called out the inexcusable behavior of art's most towering figures like Pablo Picasso - will find more of that at an exhibition they organized at the Brooklyn Museum this summer.",
        "The show, coming as 2023 marks the 50th anniversary of the artist's death, is titled \"It´s Pablo-matic: Picasso According to Hannah Gadsby,\" it promises a new look at the Cubist's legacy \"through a critical, contemporary and feminist lens\" and an audio tour by Gadsby.\"I knew this year was just going to be an overload of people salivating over Picasso without really interrogating his problematic contribution to the idea of genius,\" Gadsby says. \"This is less about Picasso and more about how we talk about very, very fallible men who we refuse to see as that once they´re geniuses.\"If there's something that connects both the Netflix special and the Brooklyn exhibit, it's the nature of fame. Both Gadsby and Picasso have had brushes with it but reacted so very differently.\"I think what we´re really discovering, when fame and success meets a damaged soul, then they become this monster,\" they say. \"I just don´t think you have to be a monster to be an artist or to be great.\"___Mark Kennedy is at http://twitter.com/KennedyTwits"
    ]
}