{
    "articleURL": "/wires/reuters/article-12059915/US-wholesale-inventories-unchanged-second-straight-month-sales-drop.html",
    "content": [
        "WASHINGTON, May 8 (Reuters) - U.S. wholesale inventories were unchanged for the second straight month in March, while softening demand meant that it would now take wholesalers the longest time in nearly three years to clear the current stock of goods.",
        "The Commerce Department last month estimated wholesale inventories gained 0.1% in March. Economists polled by Reuters had expected that inventories would be unrevised.Inventories are a key part of gross domestic product. They increased 9.1% in March on a year-on-year basis.Private inventory investment declined in the first quarter for the first time in 1-1/2 years, restricting GDP growth to a 1.1% annualized pace in that three-month period. The inventory drawdown reflected a reduction of stock by businesses in anticipation of weaker demand later this year. Stronger consumer spending early in the first quarter also contributed to the inventory rundown.Leaner inventories are potentially good news in the calculation of GDP for the second quarter. There had been fears that a correction of the inventory bloat would result in a sharper economic downturn. But the first-quarter decline led some economists to believe that much of the inventory liquidation was probably over.Wholesale motor vehicle inventories increased 1.5% after rising 2.0% in February.There were decreases in inventories of farm products, petroleum, furniture and lumber as well as in the computer equipment, electrical and metals categories. Machinery inventories increased 1.1%.Excluding autos, wholesale inventories fell 0.2% in March. This component goes into the calculation of GDP.Sales at wholesalers dropped 2.1%, the biggest decrease since April 2020, after rising 0.4% in February. The decline in sales occurred almost across the board, with sharp drops in the electrical, machinery, metals, lumber, petroleum, farm products and miscellaneous durable goods categories.",
        "At March's sales pace it would take wholesalers 1.40 months to clear shelves, the highest since June 2020, from 1.37 months in February. (Reporting by Lucia Mutikani; Editing by Andrea Ricci and Paul Simao)"
    ]
}