{
    "articleURL": "/wires/reuters/article-12058679/Indonesia-president-condemns-attack-ASEAN-officials-delivering-aid-Myanmar.html",
    "content": [
        "JAKARTA, May 8 (Reuters) - Indonesia and Singapore condemned an attack on a convoy of their diplomats and an ASEAN humanitarian aid body in military-ruled Myanmar, and called for an end to violence and a commitment to dialogue between warring groups.",
        "Myanmar state media on Tuesday said \"terrorists\" with small arms attacked a convoy that was delivering supplies to displaced people in His Hseng township in Shan State in northern Myanmar on May 7.It said no one was harmed and showed pictures of a pickup truck with minor damage, including broken glass from bullets.It remained unclear who was behind the incident involving staff from the Indonesian and Singaporean embassies in Yangon and personnel from the humanitarian assistance centre of the Association of Southeast Asian Nations (ASEAN).No group claimed responsibility for the incident.Myanmar has been trapped in a spiral of violence and economic turmoil since the military overthrew an elected government in 2021 and launched a bloody crackdown on dissent.Intensifying military attacks and clashes with armed resistance movements have prompted calls, including from Myanmar's ASEAN neighbours, to end hostilities and allow access for humanitarian aid.It comes as Southeast Asian leaders meet in Indonesia to discuss the crisis in Myanmar among other issues. Myanmar's generals have been barred from the meeting over their lack of progress in implementing an ASEAN peace plan.An Indonesian diplomat involved in the incident was \"in good condition\", said foreign ministry spokesperson Teuku Faizasyah.Two staff of Singapore's embassy in Yangon were also safe and had returned to the city, its foreign ministry said.",
        "\"Only constructive dialogue among all key stakeholders in Myanmar can facilitate a peaceful solution in the interests of the people of Myanmar,\" the ministry said in a statement.The United States also condemned the attack and called on Myanmar's military to implement a peace consensus agreed between its generals and ASEAN.Indonesian President Joko Widodo on Monday said the \"shootout\" would not deter efforts by Indonesia and ASEAN to push for peace in Myanmar.\"Stop using force. Stop violence because it's the people who will be victims. This condition will not make anybody win,\" he said.Myanmar's shadow National Unity Government, which is allied with anti-junta militias, the People's Defence Forces (PDF), said it was not involved in the incident. The PDF in the region did not respond to a request for comment.Indonesia has for months been quietly engaging Myanmar's junta, shadow government and armed ethnic groups to try and kick-start a peace process, its foreign minister said last week. (Reporting by Ananda Teresia, Bernadette Christina and Stanley Widianto in Jakarta, Xinghui Kok in Singapore; Additional reporting by Reuters staff; Editing by Stephen Coates, Martin Petty)"
    ]
}