{
    "articleURL": "/wires/pa/article-12056425/Man-woman-shot-siege-Kent-home.html",
    "content": [
        "A woman is in hospital with gunshot wounds after being held hostage at her Kent home.",
        "Armed police were called to a terraced house in Priory Road, Dartford, on Saturday afternoon.Witnesses who lived nearby said a woman had been “held hostage” at the back of the property.Kent Police said a man and a woman suffered serious injuries consistent with gunshot wounds and were taken to a London hospital.Officers went into the house at 12.40pm with a trained negotiator following reports of a “disturbance” and attempted to “engage with a man” there.Witnesses described how police cordoned off the road and ordered people to stay inside their homes, before officers broke through the front door.After an hour-long stand-off, “pandemonium” broke out and neighbours heard what they described as sounding like two rounds of gunshots.",
        "The house remained cordoned off and forensics teams could be seen entering the property late on Saturday evening.A spokesperson for Kent Police said: “Kent Police was called to a report of a disturbance at a property in Priory Road, Dartford, at 12.40pm on Saturday May 6.“Officers, along with a trained police negotiator, attended and attempted to engage with a man inside the address.“Whilst they were at the scene, a man and a woman suffered serious injuries consistent with gunshot wounds and were taken to a London hospital where they remain in a serious condition.",
        "“Patrols remain in the area and enquiries are ongoing to determine the circumstances and how the injuries were sustained.”The force has made a mandatory referral to the Independent Office for Police Conduct due to police being at the scene at the time of the injuries. No police weapons were discharged.One woman, who wished not to be named, described the scene as “chilling”.She said: “I was in the house and my husband and two girls were out – they couldn’t get back home.“I went out and was told ‘get back – you must stay indoors’.“I went to the garden where I could see more.”About an hour after police entered the property, she said she heard gunshots before a person was carried out on a stretcher.“It was pandemonium,” she said. “I heard five gunshots – a pause and then another five.”The IOPC has been approached for comment."
    ]
}