{
    "articleURL": "/wires/aap/article-12040595/New-Tassie-club-great-dont-forget-NSW-Longmire.html",
    "content": [
        "Sydney coach John Longmire hopes the introduction of a new Tasmania club won't result in the AFL cutting corners in its commitment to NSW.",
        "The AFL confirmed on Wednesday that Tasmania had been awarded the league's 19th licence, with the men's team to enter the competition in 2028.The league has committed $360 million over a decade towards a team, including $90 million in game development and $33 million for player talent academies.Longmire is supportive of the introduction of a Tasmania team, but says more support also needs to be directed to NSW.Although Sydney have built up a steady fan base over the past 40 years, Greater Western Sydney have struggled to attract big crowds since their inception in 2012.\"Let's not take our eye off what's happening here in NSW in the most competitive sporting market in the world,\" Longmire told reporters on Wednesday.\"What we're mindful of is one third of Australia's population is in NSW, and yet only five per cent (of AFL players come from this state).\"We're all focused on Tasmania, which is terrific.\"But if you've got one third of the population sitting here in NSW and only five per cent playing AFL football, I think we need to do a bit of work in that space.\"Longmire has seen the game make important gains in NSW over the past decade, but says the investment needs to be \"long and ongoing\" for Aussie Rules to remain competitive.",
        "\"If we're truly a national competition ... it's great to have Tasmania in, but we need to make sure we do things right and do things fully invested in states like NSW and Queensland,\" Longmire said.\"The other sports are doing really well in this space, and it's a challenge for both us and GWS and the code in general to keep pushing ahead.\"I think we've made some great gains in NSW. Look at school level, the participation rates, all of that. But it's a real challenge to keep that up.\"Longmire says once Aussie Rules is thriving in NSW, it would benefit clubs from all around the country given the extra talent that would be available to draft.\"When we start getting NSW players being drafted by other AFL clubs and then coming back home, like what happens to all the other football states, what a great challenge that will be for the game,\" he said.\"That will be one of the great things for all clubs.\"We can't lose sight of the fact that there's so much potential here in NSW that still remains untapped.\""
    ]
}