{
    "articleURL": "/sport/college-basketball/article-12052093/March-Madness-LSUs-Angel-Reese-says-backlash-taunting-Caitlin-Clark-frustrating.html",
    "content": [
        "Reese slammed First Lady Jill Biden's proposal to invite both team to WashingtonClark previously defended the 20-year-old's antics in an ESPN interview in AprilDailyMail.com provides all the latest international sports news NCAA basketball champion Angel Reese has revealed that she's found it 'frustrating' that LSU's first-ever title win was overshadowed by the drama surrounding her and Iowa point guard Caitlin Clark. ",
        "Appearing on 'The Jennifer Hudson Show' on Wednesday, the 20-year-old, who was the subject of harsh criticism for taunting Clark with the John Cena 'you can't see me' celebration before showing off her ring finger during the championship game in April, opened up on the Lady Tigers' 102-85 win over the Hawkeyes last month, as well as the backlash that came after the result.'It was frustrating,' said Reese, accompanied by her teammates Alexis Morris, who was drafted by the WNBA's Connecticut Sun last month, and Flau'jae Johnson.'I mean, to see how we've grown women's basketball…9.9 million people watched the game. That's more than the men.'I know one day we're going down in the history books, so it's bigger than me. I'm so happy that we won the championship. I wish it was more talked about.",
        "'I know one day we're going down in the history books, so it's bigger than me. I'm so happy that we won the championship. I wish it was more talked about. 'As much as they talked about the Caitlin situation… because we worked just as hard. We put a lot of sweat and tears into that championship and people don't realize that. It's the best of both worlds.'I'm happy the situation happened, but at the same time I'm a national champion and I'm getting a ring.' ",
        "Reese, who slammed First Lady Jill Biden's proposal to invite both teams to the White House, also opened up on her friendship with Clark, who's much more shy than her rival. She said that they 'are cool' and there was never any 'beef' in between them despite the media building up hype around their interaction, which took place in the final minutes of the women's final of March Madness last month.'People don't realize that and how competitive we are,' Reese said. 'We're the top of our class, and to see how much we've grown women's basketball within a year, that's what it was for both of us.' ",
        "Johnson admitted that she didn't expect the Reese's taunting to Clark would blow up as both players were known for talking down on their opponents throughout most of the college basketball tournament. 'It's two strong personalities, two dominant players, but in that moment, I didn't know how big it was going to be,' Johnson said. 'But it was bigger for the game.'A lot of people were like ''Are y'all made at Angel?''''First of all, Angel is going to be her regardless and we support that,' later adding: 'It just grew the game, and I was happy to be a part of it and be a national champion at the same time. You can't complain about too much after that.' ",
        "Speaking her truth on the show, Morris said she initially thought the interaction was 'disrespectful' until it became evident to her that it was, in fact, not the case as time passed by. ",
        "'Even though we're looking at it like, the world made it a race thing — for a matchup like Angel and Caitlin Clark to have 9.9 million views, that's remarkable,' Morris said.'The goal is to grow women's basketball, so it's bigger than just that moment… Keep racism out of sports.'Two days after Iowa's March Madness run ended at the championship game, Clark was quick to defend Reese in an interview with ESPN, asking pundits, fans and others to stop criticizing her rival's taunting actions. 'We're all competitive. We all show our emotions in a different way,' the 21-year-old said back in April. 'Angel's a tremendous, tremendous player. I have nothing but respect for her. I love her game, the way she rebounds the ball, scores the ball is absolutely incredible. I'm a big fan of her. Even the whole LSU team, the way they played.''I don't think there should be any criticism for what she did. I honestly didn't see it when the game was going on and like I said I haven't been on social media at all.'"
    ]
}