{
    "articleURL": "/wires/reuters/article-12046683/Embraer-posts-loss-seasonally-weaker-Q1-reaffirms-year-outlook.html",
    "content": [
        "By Gabriel Araujo",
        "SAO PAULO, May 4 (Reuters) - Embraer SA widened its net loss in the first quarter from a year ago, driving its shares lower on Thursday despite saying results came in within management expectations for a seasonally weaker period and reaffirming full-year forecasts.Brazil-traded shares in the company, the world's No.3 planemaker after Boeing and Airbus, were down more than 7% in morning trading, making it the biggest faller on Brazil's Bovespa stock index, which was near flat.The planemaker reported a quarterly adjusted net loss of $88.9 million, larger than the $75.3 million loss seen a year ago, saying it also burnt more cash in the period as it prepares to increase deliveries in the next quarters.\"Seasonally weak Q1 was lighter than expected in gross margins and book-bill with larger cash use,\" analysts at TD Cowen said. \"Investors likely will be somewhat disappointed\".The Brazilian firm had already reported deliveries of 15 aircraft in the period, up 7% on the previous year but well below the 80 jets delivered in the fourth quarter, which tends to be busier for the company.\"We expect higher delivery and sale activities and improved results in coming quarters,\" Chief Executive Francisco Gomes Neto told reporters, saying the company has several active sales campaigns and good prospects especially for its commercial aviation and defense units.",
        "Gomes Neto recently participated in official government trips to China and Portugal, with the firm eyeing commercial jet sales to the Asian country and announcing defense partnerships with the latter as part of a broader internationalization bid.JPMorgan analysts said the quarterly results should not be entirely surprising to investors as operational data was released last week, but highlighted soft top line and margins.\"We are buyers on weakness,\" they added.Embraer earlier this year said it expects commercial aircraft deliveries to reach 65 to 70 jets this year, up from 57 in 2022, while executive jet deliveries were seen jumping as much as 27.5% to 120-130.It reaffirmed the forecast on Thursday, also keeping unchanged full-year financial outlooks that include net revenue growing as much as 27% to $5.2-5.7 billion and free cash flow of $150 million or more.The firm reported net revenue up 19% in the quarter to $717 million but below market consensus of $854.27 million, according to a Refinitiv poll of analysts.It also posted a cash consumption of $399 million, larger than the $65.9 million a year ago, due to seasonality and in preparation for higher deliveries ahead.\"We were building up inventory to fulfill our production and delivery commitments for the rest of the year,\" Chief Financial Officer Antonio Carlos Garcia said, projecting cash to be recovered as deliveries materialize.",
        "Embraer last year concentrated deliveries in the fourth quarter amid supply chain disruptions, which the company expects to improve in 2023 but only fully normalize next year. Its firm order backlog currently stands at $17.4 billion. (Reporting by Gabriel Araujo Editing by Mark Potter and Steven Grattan)"
    ]
}