{
    "articleURL": "/news/article-12046985/Donald-Trump-says-Nicola-Sturgeon-negative-force-hurt-Scotland.html",
    "content": [
        "The former US president played golf at his Turnberry course in South AyrshireHe said Sturgeon's resignation as first minister was a ‘good change for Scotland’Donald Trump has accused Nicola Sturgeon of being a ‘negative force’ who had ‘hurt’ Scotland.",
        "The former US president made the claims as he visited his golf resort Trump Turnberry in Ayrshire on the third day of his visit to Scotland.He said: ‘Nicola Sturgeon has not been very nice to me.‘She never liked what we did for Scotland. My mother was Scottish. The people of Scotland are very proud of what I did for Scotland.‘I think she (Sturgeon) was anti-business. She is a negative force.’Mr Trump said Ms Sturgeon ‘has been a very successful politician’ but her resignation as first minister was a ‘good change for Scotland’.",
        "He added: ‘She has hurt Scotland. She has hurt education and tourism. She should have embraced us.’He said he believed ‘you should embrace people like my friend Sean Connery’, and claimed the late James Bond star was ‘very proud of me and what I did for Scotland’.Questioned about Humza Yousaf, Mr Trump said: ‘I don’t know the gentleman but I hear he is a good man.’He also told the Scottish Sun he hopes Prime Minister Rishi Sunak will step in and help Trump Turnberry secure the prestigious Open tournament.His son Eric accompanied him yesterday as he took the wheel of a golf buggy for a second round on the course. Mr Trump is visiting his golf resorts in Scotland and Ireland this week as he faces legal trouble in the US.",
        "A civil trial at the Federal District Court in Manhattan is hearing allegations, denied by Mr Trump, that he raped former magazine columnist E Jean Carroll in a department store dressing room in 1996.In a separate case, he has pleaded not guilty to charges of falsifying business records to hide damaging information ahead of the 2016 presidential election.Mr Trump arrived in Scotland on his private jet on Monday to cut a ribbon at a ceremony to break ground for a second course at his Menie Estate golf resort near Aberdeen. It will be named the MacLeod course in honour of his late mother, Mary Anne MacLeod, who was born on Lewis in the Western Isles.",
        "The former president then travelled to Turnberry on Tuesday, where staff lined the steps and waved hats which said ‘we make Turnberry great again’.",
        "Mr Trump shook hands and chatted with some of those waiting to welcome him on his first trip to Scotland since leaving office. He spent two days at Turnberry on a visit in 2018, which was met with widespread protests, and during which he also met then PM Theresa May and the Queen.Ms Sturgeon’s spokesman was contacted for comment.In a separate interview with Nigel Farage for GB News, Mr Trump praised King Charles saying he and Camilla would ‘make a great team’ as he urged Scotland to remain part of the UK.",
        "Asked about Nicola Sturgeon leaving office he said: ‘I don’t know if I’ve ever met her. I’m not sure that I ever met her. I dealt with Alex Salmond. And I got along great with him, actually, until the windmills started coming all over Scotland.’Also, when pressed on comments made by First Minister Humza Yousaf that hinted at Mr Trump being anti-Muslim he said: ‘I am not anti-Muslim. I have friends that are Muslim and great friends and frankly, leaders of countries that are Muslim and I’ve had great relationships.’He added: ‘But I don’t know him. I hope he’s going to do a great job and I’m sure he’s going to be a lot better than Sturgeon. I just hope the new man is going to do a much better job than she did.’Asked if he felt Scotland should remain part of the UK he said: ‘I think they should. Yeah, I think they should. I think they should all work together. And you know, there’s a great love of the Queen. The Queen kept it together.’"
    ]
}