{
    "articleURL": "/sport/afl/article-12061497/Wayne-Carey-slams-AFL-Collingwood-booing-Buddy-Franklin-video-shows-Swans-fans-booed-too.html",
    "content": [
        "Compared Franklin to the Goodes booing scandal Said AFL did not act when other star players were booed Video shows Swans fans guilty of the same offenceCollingwood fans have been panned by the AFL for booing Sydney Swans champion Lance Franklin last weekend - but now footage has emerged showing Sydney fans doing the exact same thing.",
        "Before Franklin joined the Swans in 2014, he played 182 games and won two premierships with Hawthorn.Now footage has been posted of Swans fans booing Franklin during his time with the Hawks.'It's hilarious they come out and have a go at Collingwood for doing it when it's been happening for ages,' the Collingwood fan who posted the video said. ",
        "Meanwhile, AFL great Wayne Carey has slammed the AFL for cracking down on the booing of Franklin, believing the league is trying to avoid a repeat of the Adam Goodes racism firestorm.Goodes became the highest-profile star to be booed at the end of his playing career, ultimately retiring early because of the treatment he copped from AFL fans.His treatment came after he outed a young Collingwood fan who yelled a racial slur at him during a game in 2013. 'What an overreaction re buddy booing .. What about Jack [Ginnivan] and Jason [Horne-Francis] in the last 2 yrs for example .Gil [McLachlan, AFL CEO] on the front foot only because of Adam ?? Not the same thing !! Everyone calm down .. leading the news surprise surprise,' Carey posted. Crowds booing players has become a divisive issue in recent years.Collingwood star Jack Ginnivan was booed by the SCG crowd when he was injured in 2022 while Port Adelaide recruit Jason Horne-Francis has been booed at multiple games after leaving North Melbourne for his home team.",
        "The AFL did not intervene with either of those players. ",
        "The Adam Goodes booing scandal in the AFL occurred from 2013 to 2015 and was a result of persistent booing of Goodes, a prominent Indigenous Australian football player, by fans during matches. The booing was linked to his vocal opposition to racism and support of Indigenous rights. The booing was widely seen as racially motivated and became a national controversy, with Goodes taking time off from the game due to the toll it was taking on him. The AFL eventually took action to address the issue, including implementing an Indigenous Round and increasing education around cultural awareness and respect for Indigenous players.Collingwood Football Club earlier released a statement apologising to Franklin for the booing.'We apologise to the Sydney Swans and to Lance 'Buddy' Franklin,' the statement attributed to Collingwood captain Darcy Moore, CEO Craig Kelly and McRae said.'The Club does not support booing, particularly champions of the game.'Yesterday was the first time we played the Swans at the MCG in a decade – it provided an opportunity to respect a champion of the game and we fell short.'Buddy is a great of Australian Football – what he has achieved on the field over a long period of time demands a high level of respect.'"
    ]
}