{
    "articleURL": "/tvshowbiz/article-12056825/Travis-Scott-makes-rain-performing-adoring-fans-E11EVEN-Miami.html",
    "content": [
        "Travis Scott performed at E11EVEN Miami, which took place during Miami Race Week on Saturday night.",
        "The 32-year-old rapper appeared to be making the most of his time on stage and flashed a wide smile as he threw a sizable stack of dollar bills into the air as he played his hits.The musician, who let loose during a friend's birthday party in April, was previously in a long-term relationship with Kylie Jenner, who has recently been linked to Timothee Chalamet.Scott wore a graphic-printed black t-shirt and a pair of slightly oversized cargo pants during his show.The Sicko Mode songwriter also donned several pieces of jewelry and accessorized with a stylish pair of sunglasses.",
        "The rapper and Jenner, 25, were first linked when they were spotted in each other's company during the 2017 Coachella Festival.The former couple went on to start a family with the birth of their daughter Stormi, aged five, in 2018.Scott and his ex split up the following September, although they reconciled after quarantining together during the early stages of the COVID-19 pandemic.Jenner subsequently revealed that she was pregnant with the couple's second child in September of 2021, and she gave birth to a son named Aire, aged one, in February of last year. Although the couple's son was originally named Wolf, they revealed that his name had officially been changed to Aire this past January.",
        "The former couple were reported to have split up that same month, and a source told People that Jenner 'is not with Travis right now.' The insider went on to speak about the main differences between the rapper and the entrepreneur.They stated: 'Kylie is very focused on her kids and her business. She is not a big partier. Travis is the opposite. He likes to party. They definitely have different focuses. They always did.' ",
        "The source then expressed that Scott and Jenner had maintained a turbulent relationship over the past five years.'There is a reason that they never got married. It's always been very up and down. And they have never even lived together. They have always had separate homes,' they said.However, the source added that the pair were used to maintaining an on-off romance and could potentially reconcile in the near future. 'They have split several times in the past and this is probably not the end of their relationship,' they said.Jenner was originally linked to Chalamet, 27, last month. Her car was later seen arriving to his Beverly Hills home that same month, adding fuel to the fire. The pair were later spotted while eating tacos inside of her vehicle during a date that took place in Culver City. ",
        "A source subsequently spoke to Entertainment Tonight and expressed that the actor and the entrepreneur were taking their romance slowly. The insider stated: 'They are keeping things casual at this point. It's not serious, but Kylie is enjoying hanging out with Timothee and seeing where it goes.'",
        "The source went on to state that the social media personality was thoroughly enjoying her time with the Dune star.'It's been really fun for her because it feels a lot different than her past relationships. It's new and exciting for Kylie and she's having a lot of fun.' They added: 'Timothee is also friends with Kendall [Jenner] so it's been easy for Kylie to integrate him into her life.' Neither Jenner nor Chalamet have made any public comments about their relationship as of yet. "
    ]
}