{
    "articleURL": "/wires/reuters/article-12053463/Tiger-Woods-ex-girlfriend-alleges-sexual-harassment.html",
    "content": [
        "Erica Herman, Tiger Woods' ex-girlfriend who is suing the golf superstar for $30 million, alleges that Woods forced her to sign a non-disclosure agreement regarding their sexual relationship or risk losing her job at his restaurant.",
        "The non-disclosure agreement (NDA) was a previously known element of the lawsuit, but a state court filing on Friday in Florida spelled out Herman's position on the key piece of evidence.According to USA Today, Herman's attorney, Benjamin Hodas, wrote, \"Mr. Woods was Ms. Herman's boss. On Mr. Woods's own portrayal of events, he imposed an NDA on her as a condition to keep her job when she began having a sexual relationship with him. A boss imposing different work conditions on his employee because of their sexual relationship is sexual harassment.\"Hodas' document added, \"Tiger Woods, the internationally renowned athlete and one of the most powerful figures in global sports, decided to pursue a sexual relationship with his employee, then -- according to him -- forced her to sign an NDA about it or else be fired from her job,\" said the document filed by her attorney. \"And, when he became disgruntled with their sexual relationship, he tricked her into leaving her home, locked her out, took her cash, pets, and personal possessions, and tried to strong-arm her into signing a different NDA.\"The Friday filing also details Herman's version of events leading up to Woods allegedly kicking her out of the home they share.Per USA Today, the court document from Hodas stated, \"The landlord made the availability of her housing conditional on her having sexual relationship with a co-tenant. That conduct amounts to sexual harassment under federal and Florida fair housing laws.",
        "\"The short summary of events here and the Defendant's own linking of the purported agreement to his sexual motivations in both her employment and housing are sufficient to bring this case within the ambit of the Ending Forced Arbitration Act.\"USA Today reported that it was unable to reach Woods' attorney, J.B. Murray, for comment. Murray previously stated that Herman was \"not a victim of sexual assault or abuse.\"--Field Level Media"
    ]
}