{
    "articleURL": "/sport/football/article-12055513/Antoine-Griezmann-Koke-watch-MLS-NBA-playoffs-one-day-Miami.html",
    "content": [
        "Antoine Griezmann has long spoken of his fandom of life in the United States He has seen MLB, MLS and NBA live during a trip to Miami over the weekend DailyMail.com provides all the latest international sports news Atletico Madrid stars Antonine Griezmann and Koke made the most of their time in Miami on Saturday, cramming in an NBA playoff game and Major League Soccer.",
        "Griezmann and his teammate were courtside for the Miami Heat's 105-86 victory over the New York Knicks on Saturday afternoon at the FTX Arena, as the hosts took a 2-1 series lead.They were then swiftly spotted at the Drive Pink Stadium, a 31-mile, 40-minute drive to watch Inter Miami host Atlanta United in Saturday's MLS game.Miami snapped a six-game MLS losing streak last week against Columbus with a 2-1 victory but Atlanta were set to be a tricky task with World Cup winner Thiago Almada in the starting line-up.The duo were pictured being handed their own Miami jerseys before the start of the game on Saturday. ",
        "It came two days after Griezmann went to see the Miami Marlins host the Atlanta Braves. The Marlins were beaten 6-3.And a bumper couple of days of sport would, quite possibly, turn into a thrilling weekend with the next Formula One Grand Prix in Miami on Sunday. It would be no surprise to see the Atletico stars in attendance.Griezmann, 32, has made no secret of his desire to play in Major League Soccer and according to the man himself in 2021, he could head to the United States as soon as next year.He told French publication L'Equipe, when he was at Barcelona: 'My contract with Barcelona runs until June 2024 and after that I think it will be the right time to go to the United States.",
        "'I love that country, that culture, the NBA, and have a desire to discover it more, although I will also have to think about my family.' Griezmann also said he enjoys the lack of media attention in the US.'This is also why I love the United States and why I want to go there, because you go unnoticed, which is not the case in France or Spain,' he said in the same interview.",
        "Inter Miami have been pushing hard to bring Lionel Messi to the team when his PSG contract expires. But the Argentina star is currently being pursued in a lucrative deal by Saudi Arabia. Atletico, meanwhile, have a 10-day gap between games in Spain, meaning their two stars have made a quick break to Miami.The last game was a 5-1 win on May 3 against Cadiz - Griezmann scored twice - while the next game is May 14 against Elche.Ateltcio is second in the Spanish league standings but trail leader Barcelona by 13 points with five games left in the season."
    ]
}