{
    "articleURL": "/wires/pa/article-12053857/Ange-Postecoglou-knows-Celtic-need-earn-win-Hearts-secure-title.html",
    "content": [
        "Celtic manager Ange Postecoglou believes clinching the title will be even more beautiful if they seal it by overcoming a tough test at Tynecastle.",
        "The cinch Premiership champions are 13 points ahead of Rangers going into the final five fixtures and will retain the title if they beat Hearts on Sunday.Rangers kick off 45 minutes later at home to in-form Aberdeen and there are several scenarios where Celtic could be crowned champions when they are getting changed or on the bus back to Glasgow.So Postecoglou is keen to wrap up proceedings with a victory against a Hearts side who beat Ross County 6-1 in their previous home game, which was interim manager Steven Naismith’s first match in charge.Postecoglou expects his treble-chasers to handle the occasion as they bid to make it a memorable trip to Edinburgh for their supporters.“This group of players have experienced this kind of build-up to a big game over the last 20 months and were in this position last year and have had a couple of semi-finals and finals,” he said.",
        "“They know there is a bit of hype and excitement around these big games and they know there’s outcomes that can be pretty special at the end of it, but they have been pretty focused on just playing our football.“They are human beings, they know what’s at stake and they know what the potential of a positive result is.",
        "“They will take that into the game but they will still be clear on how we play our football and it’s a difficult place to play.“Hearts have still got a lot to play for so the beauty of it is if we do do it we will have to earn it and that’s the only way you want to do it.”Postecoglou’s first domestic match in charge resulted in a 2-1 defeat at Tynecastle but he has led Celtic to three victories there since, including a seven-goal thriller in their most recent league visit.“It’s a great atmosphere, it’s a great venue and it’s always a good game,” he said. “It always feels like it’s a big game.“Hearts have a new manager in Steven Naismith. I don’t know him well but everyone I have spoken to rates him really highly and I like the way he has gone about his business so far in terms of the way he speaks about what he wants to achieve.“It’s going to be a good game and if we want to get the outcome we want we are going to have to earn it and that’s the way it should be.”"
    ]
}