{
    "articleURL": "/wires/ap/article-12052565/Oilers-Knights-lone-NHL-playoff-game-Saturday-night.html",
    "content": [
        "\"Hockey Night in Canada\" will actually be hockey night on the Las Vegas Strip.",
        "Game 2 of the second-round series between Edmonton and Vegas is the only NHL playoff game on the schedule Saturday. Previously planned for Friday, it was moved back a day on a crowded sports weekend across North America.The Golden Knights lead the series 1-0 after winning the opener 6-4 Wednesday night despite four goals from Edmonton's Leon Draisaitl. Vegas coach Bruce Cassidy is a fan of the extended break before getting back at it in Game 2 (7 p.m. Eastern, TNT).\"For us, the extra day of rest in there at home is better than on the road, the way I feel,\" Cassidy said. \"You´re in your own beds and you´re in your sort of comfort zone, so I always prefer if there´s an extra day between (games) in a series not being on the road for it.\"Not in favor of the shift? Oilers fans who saw their travel plans disrupted.Late Sunday, the NHL released a schedule indicating Game 2 would be Friday night. By Tuesday afternoon, it was changed to Saturday afternoon (4 p.m. local star) with no explanation.",
        "Oilers season-ticket holders Rob and Lana Kinsey, who took their two children on the trip, told The Canadian Press the change cost them thousands.\"It sort of sours the whole thing now,\" Lana Kinsey told CP. \"Next time we won´t bring the kids, if we go at all, for any other series now that we realize they´re going to announce the dates and can decide to change the dates of games. I don´t think I´ve ever had that happen before.\"",
        "National television concerns in the U.S. and other factors beyond hockey played a role. Game 3 of the Toronto-Florida series is Sunday in South Florida, which is also hosting the Formua One Miami Grand Prix and the continuation of the Miami Heat-New York Knicks NBA series; same with Game 3 of Dallas-Seattle because of an arena conflict Saturday night at the Kraken's home rink.Oilers executive VP Tim Shipton told CP date changes are far more rare than moving the time of a game.\"We certainly understand that there´s a degree of frustration amongst fans who have had to make last-minute travel changes and the impact both on budget and schedule for families and others expecting to come down to see the game Friday only to have to shift to Saturday,\" Shipton said. \"We certainly understand that frustration.\"That frustration might fade if the Oilers even the series.Draisaitl has a playoff-high 11 goals and is tied for the scoring lead with 15 points. More is necessary from everyone else for Edmonton to avoid back-to-back losses for the first time since late February.\"There's things that we can improve in our game,\" coach Jay Woodcroft told reporters, declining to elaborate on what those are. \"We don´t run away from the things we have to correct or improve. ... There are things that we can do better, or that are within our control, that we can handle better.\"",
        "LOOKING AHEADThe scheduling quirk of one game each Friday and Saturday sets up a Game 3 tripleheader Sunday: Carolina at New Jersey, Toronto at Florida and Dallas at Seattle.The Maple Leafs, trailing the Panthers 2-0, likely won't have rookie Matthew Knies for the rest of the series after he was knocked out of Game 2. Knies was diagnosed with a concussion, according to coach Sheldon Keefe, who said the University of Minnesota product signed late in the season was ruled out for at least both games at Florida.\"Matt, he has proven to improve the depth of our team and believe we´re a better team when he´s in,\" Keefe said Friday. \"All that said, we were a very good team before he arrived on scene here. We´ll make some adjustments accordingly, but we´ve got full confidence in our group.\"Adjustments are also expected for the Kraken after losing Game 2 to the Stars 4-2 to knot the series at 1-1. They'll also take the extra rest.\"We saw a little bit of fatigue mentally and physically in our game, so hopefully this will be a good time for a travel day and the one extra day in between to try to recharge the batteries to get back to the level and the game that we know is going to be necessary for this series,\" coach Dave Hakstol said.",
        "___AP Sports Writer Mark Anderson in Las Vegas and the Canadian Press contributed.___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}