{
    "articleURL": "/femail/article-12044425/Do-live-MAMWAMT-Middle-aged-man-massive-telly.html",
    "content": [
        "Size is everything for the middle-aged man with a massive telly, who measures his success in (diagonal) screen inchesREAD MORE: Dating trend sees women write off men whose names begin with J Last month The Wall Street Journal reported that tech adoption among older adults (which, I’m duty bound to tell you, means 50 plus) is soaring. ",
        "And where America leads, we tend to follow. Apparently, the prime motivator is getting fit, with ‘health wearables’ leading the charge.At least that’s what these ‘older adults’ say when they’re surveyed by earnest pollsters about their reasons for tech adoption, but I wonder if they’re telling the truth.In my experience older men, at least, embrace gadgetry for a quite different reason – by which I mean a quest for control in familial home environments where they have little or no say on pretty much anything. ",
        "Even if it’s only a habit of hogging the Sky box remote or zapping the Vauxhall’s central locking with an Eastwood-esque gunslinging flourish, the latest tech offers a man a semblance of agency and wireless, fearless authority. His name on the high score.He’s mostly bone idle and schoolboy excitable, too. A combination of default-setting indolence, a predilection for lazy convenience and box-fresh shininess appeals to both the attention-deficit monotasker in him and the Bond baddie lurking under his mouse mat. Yes, world domination might be a bit of a stretch when you work as an estate agent and get your clothes at River Island but controlling the parental lock on the sitting-room telly and running the triple-monitor, super-HD media output in the den is a step in the right direction.",
        "Recognise any of these tech types?1. THE NEARLY ADOPTERAlmost, very nearly, an early adopter – but not quite committed enough to be queuing overnight outside the Apple store for the new iPhone with all the other hoodie-and-backpack geeks. Judicious, patient and cautious, the Nearly Adopter prefers to purchase version 2.0 of the latest tech, waits for the initial excitement to die down, the zig-zagging lines to recede and the technical glitches to be ironed out. Where does he sit on the Venn diagram/food triangle of tech buyers, where the early adopter is at the top and the others – innovators, early majority, late majority, and laggards – lurk at the back? He’s the smug, risk-averse sort who waited for the iPad with a camera (the original version didn’t have one) and bought the Apple watch only when it came preloaded with a built-in GPS for version 2. The Nearly Adopter is, let’s be honest, a bit of a bore.2. THE EVERYTHINGERTech everything. Everywhere. All at once. This guy puts his trust and his toothbrush – and everything else electrical that he owns – in the capable hands of his wi-fi router.Going all-in on the conquering capability of the so-called Internet of Things, his doorbell, heating, robot vacuum cleaner, lawn mower, music system, roller blinds, induction hob, water flosser, smart kettle and washer/drier are connected to the internet and run off voice commands via his Alexa unit. ",
        "Which is all great (and very Blade Runner 2049/Ex Machina, super-modern) until the wi-fi router goes on the blink and the full-fibre, ultrafast 900 megabits provider goes Awol. At this point the Everythinger is trapped inside his house, locked out of his car – a tricked-out, app-dependent Polestar 2 EV – and can’t brush his teeth or get the toaster to work. (NB: wives and girlfriends of Everythingers should be aware that each time their partner issues a command to ‘Alexa’, he is secretly fantasising that the gorgeous Alexa Chung is listening somewhere out there in cyberspace and personally attending to his every need.)3. THE GARDEN GATESThis is the boffin, the fixer-upper, mender and innovator. He’s the eccentric, semi-detached Steve Jobs, the Bill Gates of his own garden shed – a wooden-lean-to man cave full of wabi-sabi intent and Jay Blades intensity, but mostly bags of wires, chargers and connecting plugs, vintage amplifiers, obsolete printers, screens, desktop computers and defunct smart TV boxes. This is the place where old tech goes, not to die, but to be revived and thrive again. Maybe. Garden Gates connects old-school hi-fi to his TV streamer and hooks up the sound to floor-standing stereo woofers the size of wardrobes. He wires up an old Roberts radio so it becomes an Alexa-enabled smart speaker. Garden Gates rescues unwanted, outdated laptops from the council dump, scours the internet for obscure Chinese-made gizmos, TV boxes and strange leads and jacks. HDMI to Din cable anyone?",
        "VGA to USB? Mini phono to scart? Yes, Garden Gates is probably single.4. THE MAMWAMT ",
        "Size is everything for the middle-aged man with a massive telly, who measures his success in (diagonal) screen inches, and by the ever-growing battalion of remote-control devices next to his viewing chair. Which he operates with the dexterity of a concert pianist. Speaking in fluent cinematic, widescreen lingo, and of jumbotron dimensions – high definition, surround sound, UHD Smart TV.He is at 90 inches right now, but he’s heading for 100 before the year’s out.Oh, he knows all the rules – measuring the distance from the viewing seat to where the telly will be (in inches) and halving it to find the optimum screen size – but he ignores them. Just as you and I might ignore the indecipherable PIP PR+ or Q. View buttons on the remotes. Bigger and closer is always better for the Mamwamt. So his LG OLED (that’s organic light-emitting diode – do try to keep up) Gallery Edition TV is two feet from his Charles and Ray Eames lounge chair, which is angled at a perfect 90 degrees. The image on the screen fills his vision field. Talking heads are bigger than real heads. His eyes are bloodshot with pixel fatigue. ",
        "The sound is turned up to 11. The Mamwamt now has his eye on Samsung’s enormous QN90A Neo QLED 4K HDR Smart TV – that’s 98 inches of pleasure. At that kind of size, Homes Under the Hammer will look like a Spielberg production, he’ll tell you.5. THE MAGA LOUT",
        "Nothing to do with Trump or making America great again – the Maga Lout is a slobby, middle-aged gaming addict whose social life is dominated by a thing for Grand Theft Auto, Call of Duty, Fortnite, The Last of Us, EA Sports FC… He prefers to view the world through Meta Quest-tinted specs, toggling between machine-gunning terrorists and fretting about carpal tunnel syndrome, tendonitis and synovitis - gaming injuries all too rife in his ageing, itchy-joystick-finger demographic. Rooted to his vibrating, surround-sound gaming chair with a butt-kicking bass woofer at the rear, home décor themes come down to a singular detail; blackout blinds.6. THE WFH BOYThe Covid-enforced lockdowns of 2020 and 2021 were golden times for the Working From Home Boy. Zoom calls are so much more fun and less stressful than IRL conversations. With the pandemic now in the rear-view, and a general return to the office in motion, he’s keeping the faith and still operating out of a room at his flat, his laptop resting on piles of old copies of GQ and Men’s Health, Deliveroo on speed dial. ",
        "Now a pro Zoomer, he’s downloaded a portfolio of amusing backgrounds – The Simpsons lounge and sofa, an immaculately curated Ikea study, the rock formation of El Capitan in Yosemite. And in no way is he abusing his WFH privileges by drifting off during eight-handed conference calls, making a cup of tea, doing Wordle or napping on the sofa.But he has come up with this: film a clip of yourself, wearing a neutral but engaged expression, and making tiny movements with head and hands, as if listening attentively to someone speaking. After a few minutes – long enough for any repetition to be too obvious – stop recording. Copy/paste the recording to a new folder. Now press go and let the super-focused clip of you play out on a continuous loop while you tend to the cafetière and the Netflix menu."
    ]
}