{
    "articleURL": "/wires/ap/article-12056393/Kentucky-GOP-aims-strong-matchup-versus-Dem-Gov-Beshear.html",
    "content": [
        "LIBERTY, Ky. (AP) - As Kentucky's GOP primary campaign sprints toward the finish line, some Republicans are looking ahead to the November election with an eye toward who best can reclaim the governorship - a job that the state's dominant party has struggled to hold despite its strong showing in other races.",
        "With candidates dashing from the hills of Appalachia to the suburbs of Lexington and Louisville and rural communities out west, some of the voters they meet along the way say they are basing decisions in the May 16 primary mostly on which Republican would pose the toughest challenge to Democratic Gov. Andy Beshear, who is facing nominal party opposition.The contest, coming a year before national elections will determine control of the presidency and Congress, is expected to send loud signals about whether Democrats can remain competitive in what has become rock-solid Republican territory.Republican voters are handicapping a crowded pack of candidates vying for the gubernatorial nomination in hopes of confirming their party's dominant status. Leading contenders in the 12-candidate field include Attorney General Daniel Cameron, former U.N. Ambassador Kelly Craft and state Agriculture Commissioner Ryan Quarles.The top contenders often sound alike on core GOP issues. They support gun rights, oppose abortion and demand more parental input in school policies. Those similarities have further elevated the question of who would run the best race against Beshear.David Hines thinks Craft is the answer to that question.",
        "\"She´s the best chance we´ve got to get him out of there,\" the retired highway worker said while watching Craft shake hands and chat with supporters after a lunchtime speech this past week in Liberty, a small community in a rural GOP stronghold.",
        "Roger Monday, another retiree at the event, said Craft's tough talk on combating the spread of illegal drugs was a winning message in a state plagued by drug abuse problems.\"She doesn´t mince words,\" he said. \"I firmly believe that she will do what she says.\"At a Cameron appearance in Richmond that same day, retired factory worker Gary Robinson was won over by the candidate's emphasis on conservative values and his record as attorney general of going to court to challenge policies by Beshear and President Joe Biden's administration.\"He´s got backbone,\" Robinson said of Cameron. \"We´ve got so many people in government today that have no backbone to stand up against things that are wrong, like the `woke´ stuff that´s going on in our schools and in our government.\"Despite its victories in other statewide races and its dominance in controlling the legislature and all but one congressional seat, the Kentucky GOP has struggled to win the governorship, in part due to the staying power of the Beshear family name.The last two Republican governors - Ernie Fletcher and Matt Bevin - lost reelection bids, in 2007 and 2019, respectively. Each time, it was a Beshear who unseated them, forging a strong political brand that, so far, has endured Republican advances elsewhere.",
        "\"Fortunately our three top candidates are very electable and in far better personal image positions than we were in 2019,\" said Scott Jennings, a Kentucky-based Republican political commentator and former adviser to President George W. Bush.Steve Beshear defeated Fletcher to begin his eight-year tenure as governor. His son, the current governor, ousted Bevin four years ago and has received consistently high voter approval ratings. Andy Beshear has presided over record economic development growth and led the state through a series of tragedies - the pandemic, tornadoes, floods and a mass shooting that killed one of his closest friends.Democrats have delighted in the combativeness between the Craft and Cameron campaigns - and their surrogates - while accusing GOP hopefuls of tailoring messages to appeal to extremists.After leading GOP candidates engaged in a feisty debate this past week on Kentucky Educational Television, state Democratic Chair Colmon Elridge said: \"We have not seen throughout the entire GOP primary, and we did not see last night, any compelling reason to replace one of the most popular governors in the country.\"In the current GOP primary, each leading camp has trumpeted its candidate's qualities as a party standard-bearer against the Democratic incumbent.Cameron supporters portray him as a unifier, a point he played up in his speech in Richmond.",
        "\"Regardless of where you find yourself on the Republican ideological spectrum, I think this campaign has the ability to unify in ways that make sure that we win and retire Andy Beshear in November,\" he said.Cameron has ties to the party's Donald Trump and Mitch McConnell orbits that transcend recent friction between the two GOP leaders. Cameron won the former president's endorsement and is a protegee of the Senate Republican leader from Kentucky, having worked as McConnell's legal counsel. Cameron is the state's first Black attorney general ; defeating Beshear in November would make him the state's first Black governor.Quarles backers note his strong ties to rural Kentucky from his nearly two terms as agriculture commissioner and the steady flow of policy announcements from his campaign.\"I want this race to be based on who has the best ideas,\" he said in the recent KET debate. \"I think that we as Kentuckians deserve that in this primary.\"Craft supporters say her family's immense wealth - and her ability to self-finance her campaign - would free her from being beholden to anyone. She is married to coal magnate Joe Craft.\"I´m not looking for a job,\" she said in Liberty. \"I just see a job that needs to be done.\""
    ]
}