{
    "articleURL": "/sport/mma/article-12055973/Aljamain-Sterling-edges-Henry-Cejudo-split-decision-RETAIN-bantamweight-title-UFC-288.html",
    "content": [
        "Aljamain Sterling saw off Henry Cejudo in a back-and-forth main event, which lasted all 25 minutesCejudo finished well but it was not enough to sway the judges in his favour, with the champ taking a decisionHe hinted at retirement, while Sterling set up a fight against Sean O'Malley, who entered the cage Aljamain Sterling edged out a split decision (47-48, 48-47, 48-47) win over Henry Cejudo, shunting Triple C back towards retirement at UFC 288. ",
        "Cejudo's grand plan of a bold attempt to move up and challenge Alexander Volkanovski at featherweight have been scuppered at the first hurdle, and he suggested he'll call it a day again. 'Funk Master', fighting in front of a home crowd in New Jersey, was surprisingly booed, with most of the fans siding with Cejudo on his return to action. But as chants of 'Henry', echoed around, the octagon rust of three years out appeared to be there, although the former two-weight champion did show glimpses of the old power, fight IQ and wrestling pedigree that saw him previously dominate. In the early going, the 36-year-old looked a millisecond too slow when it mattered and struggled to close the distance to the wiry, long Sterling, who peppered him from range. ",
        "Cejudo secured an early takedown but Sterling worked his way back up and then landed one of his own, which must have shocked the challenger, who had mocked his opponent's wrestling pedigree in comparison to his own Olympic gold medal. Sterling even took the challenger's back at the end of the opener but couldn't quite get his hooks in, settling for landing some grim knees to the thigh. The veteran battled back in the second, which was a pick-em round. He struggled to effectively close the distance but landed one lovely right hand to stop Sterling in his tracks.  ",
        "Cejudo then stepped up a gear in the third, stuffing a number of takedown attempts, which made the champion look more desperate that he actually was, even landing one of his own before the buzzer. In the fourth, Sterling demonstrated his class, picking Cejudo - who was starting to flag - apart. He sliced him up with low kicks and ended with a takedown to take control of the fight. Triple C knew he needed a huge fifth round and it was his most convincing five minutes. He pushed the pace, won the exchanges and dominated but it proved to be too little, too late for two of the judges. Cejudo quoted Ricky Bobby from Talladega Nights, lamenting: 'If you're not first, you're last', before saying he will speak to his wife and Dana White about the next step. Sterling, meanwhile, had to deal with the post-fight chaos of being booed loudly by his home crowd and also an arranged confrontation with Sean O'Malley. ",
        "O'Malley will be his next challenger and 'Suga' was brought into the octagon to face off with the champion, before they had to be separated. 'You better hope you look better than tonight. You better hope you look better than that! You better be ready to cut weight, baby,' O'Malley said. ",
        "Sterling responded: 'You've had a whole year to work on your jiu-jitsu. Now Daddy Dana (White, UFC chief) ain't gonna babysit that a** no more. Before O'Malley added: 'You better be ready to go again. Soon, real soon. Get ready to cut weight real soon, baby. You'd better look better than that, b****. You better look better than that.'At the same time, the New Yorker continued: 'Get your a** in the big boy players, baby,' as the pair squared up, talked over each other and shouted in each other's faces before White stepped in to separate the duo.After O'Malley insisted 'You looked like s***', Sterling questioned why he 'ran' by turning down the title shot, continuing: 'That's what I thought. 'Because I'd drag your a** up and down this octagon. Get the f*** out my cage. Get this piece of s*** out of my cage.' ",
        "In the co-main event, Belal Muhammad put himself firmly in the welterweight title picture with a unanimous decision win over Gilbert Burns. The Brazilian appeared to be fighting without the use of his left arm after the first round, meaning he was seriously ineffective. That said, Muhammad picked him apart well and landed some devastating body kicks. He will surely be next in line for a shot at Leon Edwards after Colby Covington, if the UFC go ahead and give the controversial American the next shot as planned. ",
        "After the win, he said: 'You give me eight weeks, I'd beat Jon Jones, give me three and I'd beat anyone else. I put my trust in God. 'I was starting to see him shake his arm out but he's always a gamer, I didn't want to overcrowd him. My first thoughts are, New Jersey you suck, my second thought is that I'm coming for Leon Edwards and Colby Covington.' "
    ]
}