{
    "articleURL": "/wires/reuters/article-12048747/Twins-break-12th-inning-White-Sox.html",
    "content": [
        "Nick Gordon had an RBI double and Jorge Polanco added a two-run single to highlight a five-run 12th inning and lead the Minnesota Twins to a 7-3 victory over the host Chicago White Sox on Thursday afternoon.",
        "Byron Buxton and Carlos Correa each homered for Minnesota, which snapped a two-game losing streak. Emilio Pagan (2-0) struck out two during a hitless inning of relief to pick up the win.Eloy Jimenez went 3-for-5 with a home run and three RBIs and Luis Robert Jr. and Hanser Alberto each doubled for Chicago, which had a three-game winning streak snapped. Alex Colome (0-1) suffered the loss for the White Sox, who finished 1-for-16 with runners in scoring position.The game was tied 2-2 entering the 12th inning when Minnesota took its first lead of the contest. Jose Miranda led off with a high-hop grounder that bounced past the glove of shortstop Tim Anderson for an error, allowing designated runner Trevor Larnach to score from second.One out later, Gordon made it 4-2 with a line-drive double into the gap in left-center that drove in Joey Gallo, who had walked. Reliever Sammy Peralta, who was making his major league debut, then walked Max Kepler to load the bases and Correa to force in Ryan Jeffers, who had reached on a fielder's choice. After Buxton struck out, Polanco singled to drive in Kepler and Correa to make it 7-2.Jimenez had an RBI single in the bottom of the 12th to end the scoring.",
        "Chicago took a 2-0 lead in the third inning when catcher Seby Zavala led off with a walk and scored on Jimenez's fourth home run of the year, a 409-foot drive to left-center off starter Pablo Lopez.The Twins cut it to 2-1 in the sixth on Correa's fourth homer of the season, a 377-foot line drive into the bleachers in left. It snapped a streak of 13 batters in a row retired by starter Lucas Giolito.Buxton tied it with a two-out homer in the eighth off reliever Reynaldo Lopez, a 376-foot drive to left. It was his eighth home run of the season.The White Sox had a good chance to regain the lead in the eighth when Andrew Vaughn led off with a walk and pinch-runner Billy Hamilton stole second and later went to third on a wild pitch with nobody out. But the Twins brought the infield in and reliever Jhoan Duran got out of the jam with three groundouts.Giolito pitched seven innings of one-run ball with two hits, three walks and seven strikeouts. Pablo Lopez allowed two runs on six hits and one walk in seven innings, fanning eight.--Field Level Media"
    ]
}