{
    "articleURL": "/wires/ap/article-12051099/WHO-downgrades-COVID-pandemic-says-no-longer-emergency.html",
    "content": [
        "GENEVA (AP) - The World Health Organization said Friday that COVID-19 no longer qualifies as a global emergency, marking a symbolic end to the devastating coronavirus pandemic that triggered once-unthinkable lockdowns, upended economies and killed millions of people worldwide.",
        "The announcement, made more than three years after WHO declared the coronavirus an international crisis, offers some relief, if not an ending, to a pandemic that stirred fear and suspicion, hand-wringing and finger-pointing across the globe.The U.N. health agency's officials said that even though the emergency phase was over, the pandemic hasn't finished, noting recent spikes in cases in Southeast Asia and the Middle East.WHO says thousands of people are still dying from the virus every week, and millions of others are suffering from debilitating, long-term effects.\"It´s with great hope that I declare COVID-19 over as a global health emergency,\" WHO Director-General Tedros Adhanom Ghebreyesus said.\"That does not mean COVID-19 is over as a global health threat,\" he said, warning that new variants could yet emerge. Tedros noted that while the official COVID-19 death toll was 7 million, the real figure was estimated to be at least 20 million.",
        "Tedros said the pandemic had been on a downward trend for more than a year, acknowledging that most countries have already returned to life before COVID-19.He bemoaned the damage that COVID-19 had done to the global community, saying the pandemic had shattered businesses, exacerbated political divisions, led to the spread of misinformation and plunged millions into poverty.",
        "The political fallout in some countries was swift and unforgiving. Some pundits say missteps by President Donald Trump in his administration´s response to the pandemic had a role in his losing reelection bid in 2020. The United States saw the deadliest outbreak anywhere in the world - where more than 1 million people died across the country.Dr. Michael Ryan, WHO's emergencies chief, said it was incumbent on heads of states and other leaders to negotiate a wide-ranging pandemic treaty to decide how future health threats should be faced.Ryan said that some of the scenes witnessed during COVID-19, when people resorted to \"bartering for oxygen canisters,\" fought to get into emergency rooms and died in parking lots because they couldn't get treated, must never be repeated.When the U.N. health agency first declared the coronavirus to be an international crisis on Jan. 30, 2020, it hadn't yet been named COVID-19 and there were no major outbreaks beyond China.More than three years later, the virus has caused an estimated 764 million cases globally and about 5 billion people have received at least one dose of vaccine.In the U.S., the public health emergency declaration made regarding COVID-19 is set to expire on May 11, when wide-ranging measures to support the pandemic response, including vaccine mandates, will end. Many other countries, including Germany, France and Britain, dropped most of their provisions against the pandemic last year.",
        "When Tedros declared COVID-19 to be an emergency in 2020, he said his greatest fear was the virus´ potential to spread in countries with weak health systems.In fact, some of the countries that suffered the worst COVID-19 death tolls were previously judged to be the best-prepared for a pandemic, including the U.S. and Britain. According to WHO data, the number of deaths reported in Africa account for just 3% of the global total.WHO doesn't \"declare\" pandemics, but first used the term to describe the outbreak in March 2020, when the virus had spread to every continent except Antarctica, long after many other scientists had said a pandemic was already underway.WHO is the only agency mandated to coordinate the world´s response to acute health threats, but the organization faltered repeatedly as the coronavirus unfolded.In January 2020, WHO publicly applauded China for its supposed speedy and transparent response, even though recordings of private meetings obtained by The Associated Press showed top officials were frustrated at the country´s lack of cooperation.WHO also recommended against mask-wearing for the public for months, a mistake many health officials say cost lives.Numerous scientists also slammed WHO´s reluctance to acknowledge that COVID-19 was frequently spread in the air and by people without symptoms, criticizing the agency´s lack of strong guidance to prevent such exposure.",
        "Tedros was a vociferous critic of rich countries who hoarded the limited supplies of COVID-19 vaccines, warning that the world was on the brink of a \"catastrophic moral failure\" by failing to share shots with poor countries.Most recently, WHO has struggled to investigate the origins of the coronavirus, a challenging scientific endeavour that has also become politically fraught.After a weeks-long visit to China, WHO released a report in 2021 concluding that COVID-19 most likely jumped into humans from animals, dismissing the possibility that it originated in a lab as \"extremely unlikely.\"But the U.N. agency backtracked the following year, saying \"key pieces of data\" were still missing and that it was premature to rule out that COVID-19 might have ties to a lab.Mark Woolhouse, an infectious diseases professor at the University of Edinburgh, described COVID-19 as a \"once-in-a-lifetime disaster\" and said that broad immunity against the virus meant we were now in a new phase of the outbreak.Woolhouse noted there had also been significant criticism of WHO's pandemic response, in addition to those of its member countries and others.He lamented that the global community missed numerous chances to stop the coronavirus earlier, in addition to causing much \"self-inflicted harm\" by shutting down much of society.\"Given the ever-present threat of another pandemic, lessons need to be learned,\" he said.",
        "___Maria Cheng reported from London."
    ]
}