{
    "articleURL": "/femail/article-12050531/Adorable-moment-toddler-takes-pony-walk-using-motorbike.html",
    "content": [
        "Verity Seignot-Griffiths, five, in East Hampshire, took her pony for unusual rideREAD MORE: Adorable little girl giggles as she gets her SHEEP to leap over a poleAn adorable little girl has revealed how she is now too big to ride her Shetland Pony - so takes him for walks while riding her motorbike instead. ",
        "Verity Seignot-Griffiths, five, from East Hampshire, has had a special bond with her pony Noodles since she first sat on him at just two-days-old. But her mother Caroline Seignot, 35, said that a sudden growth spurt means she is now too big to ride her beloved horse.Despite this, Caroline said she has been delighted to see that Verity still incorporates Noodles into her games.Heartwarming footage shows her daughter riding her electric motorbike around the family farm, whilst wearing a colourful tutu and helmet.",
        "Noodles - full name Super Noodles - is attached to a lead she is holding and can be seen trotting alongside her.The pair then share a cuddle before she shows off more of her talents.Verity can be seen guiding the pony over some jumps.He hilariously rolls in the grass as Verity pets her best friend and takes him over more obstacles.Caroline, who runs The Pony Pals Family said: 'Verity laid across Noodles from the day she left hospital at two days of age.'She was held over him everyday until she could sit up and then eventually ride.'She has ridden Noodles nearly every day of her life, and at five-year-old she is now outgrowing the riding side, but still enjoys being his friend, carriage driving him and finding unique ways for him to join her adventures.",
        "'They have their own very special bond, enjoying each other's company and understanding each other in a beautiful and peaceful way.",
        "'Rather selfishly, I am very sad about it as I have worked with this beautiful pony for over a decade visiting residents in their bedrooms of care homes.'I'm sad that that chapter of watching Verity riding him has come to a close.'But we can still carriage drive him together and play in many other ways.'Verity is very lost as she found his back to be her Happy Place, somewhere she could sit and ponder her thoughts alongside the actual riding activities.",
        "'I love to watch their friendship flourish, the things they achieve together makes me so proud.'Adorable footage has also captured the moment she and her pony tried to tackle a mini jump when she was just 17 months old. She managed to leads him to an almost ground-level jump, for it to trot over. When the miniature animal partly knocked it down, Verity twice exclaimed 'Oh!' and copied the pony by removing her side of the pole with her little hand. Verity then walked over the obstacle and turned to beckon the pony with a squeaky cry of 'Noodle' and gave a chuckle. If that was not already cute enough, the tiny horse fan was wearing a pink-and-white riding hat which matched the pink and white colours of the jump obstacle."
    ]
}