{
    "articleURL": "/news/royals/article-12052725/The-King-finally-falls-castle-Charles-Windsor-week-writes-RICHARD-KAY.html",
    "content": [
        "Students of royal history have been paying particular attention to one of the wood-panelled receiving rooms at Windsor Castle.",
        "A silk-striped sofa has been moved by 90 degrees and on a once-empty sideboard, a large white houseplant sits in a ceramic pot. The effect has been to transform this official corner of the ancient castle into a cosy and welcoming snug.Elsewhere, there is a change to the art hanging on the walls and some unfamiliar pieces of furniture have appeared.Slowly and steadily, the King is making his aesthetic mark on the ancestral seat of the monarchy where his late mother spent most of the last three years of her life and where his father, Prince Philip, died in 2021.What makes this so intriguing is that for decades Charles spent as little time at Windsor as he possibly could, sweeping past the castle down the M4 from London to his beloved Highgrove in Gloucestershire without a backward glance.",
        "Such was his apparent disdain for the place that at the time of his accession to the throne, it was said he had no wish to spend a night there and that the castle, with all its history, was earmarked to become the new home of Prince William, the Princess of Wales and their children.But as today’s Coronation unfolds, such talk has evaporated. Most Fridays in recent times, rather than speeding past the castle, the King’s limousine or the royal helicopter makes a detour to Windsor, where he spends the night before heading on to his country home for the weekend.",
        "According to a member of staff who has worked for both the late Queen and the King, the castle is ‘coming to life again’.So what has brought about this apparent change in Charles’s attitude to Windsor, when he already has so many other places he can call home? And why did he previously dislike it?For years it was suggested that the noise of low-flying aircraft on their final approach to nearby Heathrow, and the stream of tourists, were behind his wish never to live there. But while the din of planes travelling low overhead as often as every 90 seconds infuriated him in his polo-playing days, when he was a regular on the Guards Club pitch at nearby Smith’s Lawn, his reason for avoiding the place was more complex. ‘He always felt it was his father’s domain and he associated bad memories with the place,’ says a courtier. ‘It was both real and imagined. He came to dread being there because of the prospect of being upbraided or criticised for something he’d said or not said.’The castle was also indelibly part of the background to his unhappy marriage to Princess Diana. One of his most uncomfortable encounters with the princess came at Windsor in the aftermath of the publication of Andrew Morton’s book Diana: Her True Story, when the Queen and Philip tried to broker a reconciliation between the two.",
        "After the royal couple separated, there were tussles over young William and Harry’s presence at Windsor for Easter, a key part of the Queen’s domestic calendar (intriguingly, Charles reinstated the tradition this year).Later the castle was the scene of a personal rebuff when he was not allowed to invite the then Camilla Parker Bowles to one of the great postwar parties seen at Windsor — the ‘Dance of the Decades’ in June 2000 to mark the centenary of the Queen Mother and significant birthdays of Princess Anne, Prince Andrew, Prince William and Princess Margaret.It was a year after the first steps had been taken in his long campaign to win public acceptance for Mrs Parker Bowles with a famous photocall on the steps of the Ritz Hotel in London.But despite growing public approval, he had yet to conquer his parents’ scepticism. In the absence of Camilla, Charles left the party early while family members danced into the early hours.At times he found the place oppressive and, to avoid confrontation with his parents, it became simpler to steer clear.It wasn’t always like that. His early years were filled with the joys of contemplating the historic artworks to be discovered all over the ancient castle. One painting that entranced him as a child was a study of his forebear and namesake Charles I by Van Dyck, which showed the King in profile as well as full-face.",
        "Other childhood memories included summer barbecues on the castle terrace, riding furiously alongside Princess Anne in the grounds and watching Sir Winston Churchill on Garter Day from a loft in St George’s Chapel.As a teenager, he became fascinated by the treasures of the royal archives and the library, where he found a collection of original drawings by Leonardo da Vinci particularly engrossing.But these happy times were tempered by the rebukes that he felt always came his way over the family dining table.As newlyweds, the Prince and Princess of Wales spent their first Christmas together at Windsor — the family switched to Sandringham later in the 1980s. In a letter, he wrote how the occasion was an ‘extraordinarily happy’ one for him and the pregnant Diana, adding: ‘Next year will, I feel sure, be even nicer with a small one to join in as well.’",
        "As William and Harry grew, there were family trips to be with Granny and Grandpa. At Easter there was always an egg-hunt in the grounds of St George’s, where the princes would be joined by their first cousins Peter and Zara Phillips — Princess Anne’s children — and, in time, Beatrice and Eugenie, the daughters of Prince Andrew.It wasn’t just Diana who avoided these gatherings after the separation. So, too, did Charles, who made a point of spending one Easter with his sons in Scotland.",
        "Over the years there were other reasons for him to avoid the family gatherings at Windsor. The presence of his brother the Duke of York and his estranged wife Fergie, whose proximity at Royal Lodge meant they were often at the castle at weekends, was just one.But as his parents aged and a calmer relationship with his father was established, Windsor began drawing Charles back. He had always been fascinated by the history of the oldest of all royal estates, and he succeeded Prince Philip as Ranger of Windsor Great Park.After Philip’s death and the Queen’s decline in health, Charles began spending more time with his mother — and that meant being at the castle. She never returned to Buckingham Palace after her husband’s passing, moving clothes and all her personal possessions to Windsor.Charles began spending the occasional night there, looking in on the Queen and checking on the running of her household. When he discovered that her personal assistant, Angela Kelly, had temporarily moved onto the same floor as the Queen, he complained about the volume of her television.Last week, it was revealed that Ms Kelly was leaving her grace-and-favour home in Windsor Home Park after the King purchased a house for her in Yorkshire.Ms Kelly was one of two key members of the Queen’s staff who had been promised a home for life. The other was Paul Whybrew, her page, who also has a cottage in the castle grounds.",
        "The King is a fan of Whybrew and has entrusted him with cataloguing the Queen’s personal correspondence. Says a friend of 6ft 4in Whybrew, the Queen’s longest-serving retainer: ‘Paul knows all the secrets and the King acknowledged that he is vital in making sure he has a complete understanding of all his mother’s wishes and where everything is.’",
        "With the Queen’s life drawing to its close at Balmoral last summer, Charles recognised that Windsor would require more of his attention.Since September, his visits have increased and he has switched some ceremonies from Buckingham Palace to the castle, notably investitures. In part, this is practical because of the renovations going on at the Palace. But also he has long told staff that he believes the public receiving honours would get more from their day immersed in the traditions of Windsor than from the rather more austere Buckingham Palace.But to spend time there, he wants it more homely. He has brought some of his favourite possessions from Highgrove, along with a framed picture of both his and Camilla’s grandchildren. Just as at Sandringham, where many horse racing-related paintings have been quietly discarded, he has chosen other works of art from the Royal Collection.At the moment he still uses his old rooms but work is going on in the late Queen’s suite in the Augusta tower, where it is thought he will eventually be based.In the parkland he has been planting saplings to ensure that, as trees have to be felled, there are more to replace them. He has introduced electric charging points, too, as part of his commitment to make the estate net zero within seven years. Renewable energy and biomass heating using woodchips and other organic material are also firm fixtures.Inside the castle he has big plans. Aides recall how he often used to shudder when describing his parents’ interior decorations. ‘There will a big upgrade but without changing the fabric of the place,’ says one familiar with Charles’s plans. ‘It is a magnificent castle but it also has to function as a home.’It is entirely possible that he may yet offer the castle to William and Kate, so it can echo to the sound of children as it did when he was growing up.One long-time castle employee wonders sardonically if Charles’s obsession with historical accuracy in this restoration dream may even lead to him re-installing a moat and drawbridge."
    ]
}