{
    "articleURL": "/wires/reuters/article-12058121/Motor-racing-Winning-Red-Bull-wondering-happened-rivals-says-Horner.html",
    "content": [
        "MIAMI, May 7 (Reuters) - Red Bull have never started a Formula One season so well and are wondering what happened to rivals like Ferrari and Mercedes, team boss Christian Horner said on Sunday after five wins in five races.",
        "Four so far have been one-two finishes, with double world champion Max Verstappen now on three wins for the season after a stellar drive in Miami, while Mexican team mate Sergio Perez has two.\"Five races, five wins plus the sprint (in Baku), four one-two finishes. We've never ever had a start like this. And we're kind of wondering where are the others?\" Horner told Sky Sports television.\"We've made a normal step...over the winter and it's more where did Ferrari and Mercedes go?\"They are working hard on I'm sure big upgrades for (coming races in) Europe and with the penalty we have to develop the car later in the year it's important for us to get as much fresh air as we can between ourselves and the opposition at this stage.\"Champions Red Bull were last October handed a 10% reduction in wind tunnel time as a result of a \"minor breach\" of the cost cap in 2021.Ferrari and Mercedes have yet to come close to winning a race this year, with Aston Martin now second overall albeit at a hefty distance.The extent of Red Bull's domination in Sunday's race at the Hard Rock Stadium was laid bare by the margins between them and previous strong rivals.",
        "Verstappen started ninth, two places behind Ferrari's Charles Leclerc. The double world champion and last year's Miami winner ended the race first and a whopping 52.988 seconds clear of the Monegasque.Aston Martin's third-placed Fernando Alonso was 26.305 seconds behind Verstappen.\"Definitely the race pace advantage, I think, is quite big at the moment,\" said the Dutch driver.Horner said Red Bull's rivals had big upgrades coming and he expected convergence later in the year, saying the team needed to put as much \"fresh air\" as possible between themselves and the opposition in a 23-round season. (Reporting by Alan Baldwin in London; Editing by Jamie Freed)"
    ]
}