{
    "articleURL": "/sport/othersports/article-12053877/Luca-Brecels-home-town-award-honorary-citizenship-historic-Crucible-win.html",
    "content": [
        "Luca Brecel will be awarded with 'honorary citizenship' by his home town The Belgian's home town Maasmechelen will also be throwing a party for himIt comes after he defeated Mark Selby to win the World Snooker Championship Luca Brecel's home town of Maasmechelen is gearing up to host a big party in honour of the Belgian, who made history last week becoming the first person from mainland Europe to win the World Snooker Championship. ",
        "The 28-year-old defeated Mark Selby 18-15 at the Crucible on Sunday, to lift his maiden World Championship, while also becoming the youngest player to do so since Shaun Murphy won back in 2005. It was a rip-roaring tournament for the Belgian, who battled his way past some icons of the game, defeating three-time winner Mark Williams to set up a quarter-final match against Ronnie O'Sullivan. The Belgian Bullet showed his resilience to beat the world No 1 by winning the last seven frames of the match, before mounting what has been dubbed one of the 'greatest ever comebacks' against Si Jiahui in the semi-finals. While Brecel will have certainly gained himself many new fans over the past two weeks, it's clear his home town of Maasmechelen are ready and waiting to welcome him home with a big celebration, saying 'we are so proud of this achievement'.",
        "'History has been made! Luca Brecel crowned himself the first non-English speaking World Snooker Champion on May 1,' an Instagram post from Maasmechelen's official account said. 'The Belgian Bullet defeated the Englishman Mark Selby in a blood strengthening final with a magnificent performance.'‘And that deserves a MaasMagnifiek party! The local government is organising a great folk’s party on Sunday afternoon 14 May to celebrate the new national hero together with all the residents.'",
        "The town, which is situated one hours drive of Brussels in the north-east region of Belgium, has a population of approximately just under 40,000 people, and will celebrate the historic achievements of their new world champion, by awarding him with honorary citizenship. ‘Honorary citizenship. A historic achievement also deserves a historic award. The Schepencollege will therefore also nominate Luca Brecel as an honorary citizen to the city council.’ ",
        "The celebration, which they called 'the great people's party for Luca Brecel' is set to take place on May 14, but the Belgian Bullet will not be able to get into the party mood just yet. That's because he is committed to playing in the Vienna Snooker Open this weekend where he has been drawn in a group with Austrians Philipp Koch and Arno Wild, Francisco Domingues from Portugal and Aref Hussaini from Afghanistan.  Plus there are several English players in action at the tournament including David Grace, Robert Milkins and Tom Ford, who shot a 147 at the tournament on Thursday. While Brecel picked up a whopping £500,000 from his win on Sunday, the winner in Vienna is set to take home a prize fund of approximately £2,150, with 80 players at the event competing for an overall prize pot of £8869.   "
    ]
}