{
    "articleURL": "/sport/nhl/article-12040369/NHL-ROUNDUP-Florida-Panthers-stun-Maple-Leafs-4-2-Kraken-edge-Stars-overtime.html",
    "content": [
        "The Panthers survived a squandered two-goal lead to defeat the Maple LeafsPavelski became the oldest player ever with a four-goal game in the NHL playoffsDailyMail.com provides all the latest international sports newsThe Florida Panthers continued their shock NHL run Tuesday night as they stunned the Toronto Maple Leafs 4-2 to draw first blood in their second-round playoff series",
        "Sergei Bobrovsky made 34 saves, Matthew Tkachuk had three assists and the Florida Panthers survived a squandered two-goal lead to defeat the Maple Leafs on Tuesday night in the opening game of the series.Sam Bennett had a goal and an assist and Carter Verhaeghe and Nick Cousins also scored for Florida. Aleksander Barkov had two assists.Matthew Knies had his first NHL goal and Michael Bunting also scored for Toronto. Ilya Samsonov stopped 24 shots.Game 2 of the best-of-seven series is Thursday.",
        "The Panthers had roared back from a 3-1 deficit to stun the record-setting Boston Bruins with three straight victories and take that first-round series in seven games.The Maple Leafs ended a generation of misery Saturday when John Tavares scored in overtime of Game 6 against the Tampa Bay Lightning as Toronto advance in the postseason for the first time since 2004.Tied at 2 late in the second period with the Maple Leafs pushing, the Panthers silenced the towel-waving crowd at Scotiabank Arena.Verhaeghe, who scored the dramatic winner in Game 7 against Boston on Sunday, took a pass from Anthony Duclair and gave Florida the lead for good when he beat Samsonov on a breakaway at 17:47 for his fourth goal of the playoffs.Toronto had a couple opportunities to tie it in the third, but never really threatened Bobrovsky before Montour blasted a one-timer on a delayed penalty at 12:24.",
        "Bobrovsky then denied William Nylander on a terrific toe stop with just over a minute left in regulation on Toronto´s best chance to close within one.The Maple Leafs are in the second round of the playoffs for the first time since Jeremy Roenick scored in overtime of Game 6 for the Philadelphia Flyers to eliminate Toronto on May 4, 2004 - a stretch of 18 years, 11 months and 28 days.After Toronto had a number of terrific looks on two power plays, the Panthers struck when Cousins scored his first on a rebound at 9:25 of the opening period.",
        "Helped when a shot clanged off the post earlier in the period, Samsonov made big stops on Anton Lundell and Barkov.Bobrovsky made a couple huge saves off Auston Matthews on a Maple Leafs power play in the second before Florida went up 2-0 at 7:58, when Bennett tipped a point shot past Samsonov that initially hit the stick of Knies.The Toronto rookie made amends 11 seconds later when he scored his first professional goal on a highlight-reel effort between his skates with his back to Florida´s goal after Bobrovsky made the initial save.Maple Leafs defenseman Luke Schenn then rocked Tkachuk with a big hit in the neutral zone before Bunting, who was suspended three games in the first round and made a healthy scratch for another, scored his first of the postseason at 14:51 following a perfect pass from Calle Jarnkrok.",
        "Duclair sprung Verhaeghe later in the shift and he put the Panthers up 3-2.KRAKEN 5-4 STARS Yanni Gourde scored 12:17 into overtime and the Seattle Kraken beat Dallas 5-4 in Game 1 of their second-round series Tuesday night, even as Joe Pavelski scored all four Stars goal in his return to their lineup.Pavelski, at 38 years and 295 days old, became the oldest player ever with a four-goal game in the NHL playoffs. It came in in his 170th postseason game - he is one of only five players with that many without winning a Stanley Cup.The second-year Kraken got goals from five different players after 15 different players scored in their seven-game series win over defending Stanley Cup champion Colorado.Pavelski scored twice in the first period, his first goal being a 25-foot wrister only 2 1/2 minutes into the game to put the Stars ahead 1-0. He scored on his first shot, on a pass from Mason Marchment. Max Domi got the secondary assist.",
        "About 10 minutes later, after Seattle had gotten even, Pavelski scored again from about the same distance with a redirect of Thomas Harley´s shot. The Kraken then scored three goals in a 68-second span to take a 4-2 lead.But Dallas goalie Jake Oettinger then stopped 33 consecutive shots before Gourde got the game-winner.",
        "Seattle has now won three consecutive road games in the playoffs. The Stars, just like in the first round against Minnesota, lost the series opener - they lost that one 3-2 in double overtime before going on to beat the Wild in six games.Game 2 of the best-of-seven series is Thursday night."
    ]
}