{
    "articleURL": "/sport/football/article-12056469/Barcelona-welcome-proposals-sell-Ansu-Fati-Wolves-exchange-Ruben-Neves.html",
    "content": [
        "Barcelona 'would welcome proposals' to sell Ansu Fati to Wolves in a swap dealThe Premier League side had offered £26m plus Ruben Neves for the wingerIt comes as the LaLiga club are looking to complete the sale by June 30   Barcelona would reportedly 'give the OK' to sell Ansu Fati to Wolves, in a fascinating  part-exchange deal that could see star midfielder Ruben Neves move to the Nou Camp. ",
        "The Spanish international signed a six-year deal at the club back in 2021, inserting an £846million (€1billion) release clause into his contract, while also giving him Lionel Messi's No 10 shirt. Billed as one of the brightest young stars in Europe, the 20-year-old has, in recent months, been linked with a move away from the club, with Tottenham, Arsenal and Manchester United keeping tabs on his availability. But according to SPORT, Julen Lopetegui's side have made an offer of '£26m (€30m) plus Ruben Neves' for the winger, and this has been 'highly regarded by the Blaugrana.'While the report also suggests that the winger would be 'very reluctant to leave' the LaLiga giants, having also recently admitted he wanted to 'stay and fight for a position in Xavi's starting XI', SPORT claims his sale could 'bring about £62m (€70m)' to the cash-strapped club. ",
        "The Spanish outlet also suggests that his agent, Jorge Mendes, 'is trying to convince Ansu and his entourage that Wolves is a good option.' Neves, meanwhile has been on Barcelona's radar for some time with Xavi looking to add more experience and depth to his midfield. Mail Sport understands that the club had 'held-back' on an attempt to sign him back in October, but could now finally get their man if Fati leaves for the Premier League. ",
        "Having risen through the ranks at La Masia, the Barcelona winger has gone on to return 26 goals and nine assists over 104 appearances for the men's senior side. That could have been more, had he not suffered from a hamstring injury that kept him sidelined for most of the 2021-22 campaign, managing a meagre 15 games for the club across all competitions. ",
        "This season he has had more of an impact in Xavi's squad, but has failed to cement himself as a regular starter, making 31 LaLiga appearances, starting in only 11 of those matches. Back in March, his father revealed that he was angry over his son's lack of game time, and he could join a group of several players set to depart Barcelona this summer. Those names include Raphinha, Ferran Torres and Franck Kessie. The fire-sale comes as the Catalan side are hoping to balance their books before June 30, after the club has been hamstrung by debts of £1.33bn (€1.5bn) and have been told by LaLiga boss Javier Tebas that they must raise funds of £177 million (€200m) in order to be able to make transfers this summer. The club triggered several economic levers to sign Raphinha, Robert Lewandowski and Jules Kounde last year, and will need to offload several stars in the coming months in order to sign new players in the summer window. "
    ]
}