{
    "articleURL": "/wires/ap/article-12054399/Queen-queen-consort-What-know-Camillas-title.html",
    "content": [
        "LONDON (AP) - Now that she has been crowned alongside her husband, King Charles III's wife is officially known as Queen Camilla.",
        "While it sounds more official than \"queen consort,\" the changing of titles does not signify any practical difference in the role of the 75-year-old royal.Queen consorts do not formally share the sovereign´s powers, and dropping the \"consort\" part of the title does not change that. Nonetheless, the change marks a milestone in Camilla´s decadeslong road to rehabilitating her image - from someone once reviled as the other woman in Charles' first marriage to Princess Diana, to a senior royal member largely accepted by the British public.The question of what title Camilla would hold when Charles became king has long been a subject of contention, due to sensitivity about her status as Charles' second wife.Camilla and her first husband, Andrew Parker-Bowles, divorced in 1995, shortly after Charles gave an explosive television interview admitting his relationship with Camilla. Charles and Diana divorced the following year. In 1997, there was a global outpouring of grief when Diana died in a car crash. Camilla and Charles waited until 2005 to marry in a low-key private civil ceremony.For many years it wasn't clear if Camilla would eventually be styled as queen.",
        "Queen Elizabeth II settled the matter last year, when she gave the blessing for Camilla to be known as queen consort. The endorsement was widely seen as a formal sign that the royal family had finally accepted Camilla as a respected senior member.",
        "Last month, Buckingham Palace´s official coronation invitations referred to Camilla as \"Queen Camilla\" for the first time. At the time, British media reported that palace officials believed it was an appropriate time to introduce the title, because several months had lapsed since Elizabeth's death in September.The most recent queen consort in British history was George VI´s wife, Queen Elizabeth, who was known as \"The Queen\" and later the Queen Mother.___Follow AP´s coverage of King Charles III at https://apnews.com/hub/king-charles-iii"
    ]
}