{
    "articleURL": "/news/article-12058479/Disability-Royal-Commission-Inside-bedroom-horror.html",
    "content": [
        "Disability Royal Commission hearing in BrisbaneViolence, abuse, and neglect under the microscope Case study of two teenagers was examined Government agencies were aware of risks to two brothers living with disabilities well before they were found malnourished and locked in a bedroom when their father died, a royal commission hearing has been told.",
        "Then aged 17 and 19, the boys given the pseudonyms Kaleb and Jonathon were found unclothed in a bare room with the door handles removed when emergency services arrived in May 2020, counsel assisting the Disability Royal Commission Kate Eastman told the Brisbane hearing.In her opening submission on Monday, Ms Eastman said it would be open for commissioners to find Kaleb and Jonathan experienced violence and the deprivation of their rights while in their father's care.",
        "'Secondly, we will submit that the violence, abuse, neglect and deprivation of human rights Kaleb and Jonathan experienced was preventable,' Ms Eastman said.'There is nothing about Kaleb or Jonathan's age, disability or their personal circumstances that made it inevitable that they should individually or together experience violence, abuse, neglect or a deprivation of their human rights.'A former neighbour told commissioners that despite having no experience with people with severe disability, she developed ways to communicate with the two teenagers.When they were locked in their room for the day, she would play relaxation music and sometimes whistle through the window.'They're just lovely ... I understood what trauma feels like and what it feels like to be abused,' she said.'I understood them.'She would sometimes help care for the boys, and described a general sense of squalor in their home that had no hot water and a bare bedroom aside from a blow-up mattress.",
        "'Kaleb would have red ... and swollen legs from curling up to be warm in winter,' she said.The neighbour agreed she tried to encourage the father to get outside support, and recalled her surprise when workers from the Department of Housing didn't go inside during two separate inspections.'He did tell me at one point that if Child Services came, all you had to do is fill up your fridge,' she said.At the time of their father's death, Kaleb was participating on the NDIS but Jonathon was not.Their father was worried he would lose a carer's pension if he accessed NDIS funding for Jonathon, commissioners were told.His financial records were examined as part of preparations for the Royal Commission hearing, showing he relied on government support.",
        "His spending included a high level of cash withdrawals which were spent on alcohol, cigarettes and gambling.Queensland government agencies were aware of potential risk factors in 2000 when Kaleb was born, Ms Eastman said.His parents accommodation was described as 'questionable and unstable' and he was identified as a child at risk of neglect, spending about two years in foster care.Kaleb was later returned before Jonathan was born in March 2003. By 2004 their father had sole care of both boys.",
        "Among the dozens of interactions between the family and Queensland government agencies between June 2000 and May 2020, there were 30 occasions when concerns about neglect were either raised or recorded.A total of 19 Child Protection notifications were made to the Department of Child Safety, and there were three occasions when a risk evaluation deemed the family's risk as 'very high'.Queensland government representatives are expected to respond on Wednesday."
    ]
}