{
    "articleURL": "/news/article-12048901/Government-mulls-letting-prisoners-employment-gaps.html",
    "content": [
        "Thousands of prisoners could be released on licence to help boost the economyA new report calls for ministers to offer better education and technology in jailsThousands of prisoners could be temporarily released from UK jails to fill employment gaps in new plans to be considered by government which aim to help the economy and slash reoffending rates.",
        "The Prisons Minister has said there has 'never been a better opportunity' for businesses to 'unlock the potential' in UK prisons in a report by the Centre for Social Justice thinktank. Efforts to get more of those leaving prison into work have increased since the Chancellor's budget in March, which labelled employee shortages as a major threat to economic growth.Only around one in four of the 50,000 people released from prison each year currently get into work within six months, data shows.The government will now consider recommendations including releasing more prisoners on licence to take up jobs and greater access to vocational qualifications, The Times reports. ",
        "It is understood figures within government believe uneasiness over employing prisoners has been 'overcome' and the 'chronic' shortages in some UK employment sectors mean the move could be of great benefit economically.A source told the paper: 'There are pretty chronic staff shortages in quite a few sectors and this is a workforce that has been largely untapped for quite a long time and that can quickly change, so it is a way of filling some of those gaps.'Prisons Minister Damian Hinds wrote in a foreword for the thinktank's report: 'There are over a million vacancies in the UK. So, there has never been a better opportunity for businesses to unlock the potential in our prisons.",
        "'Getting more prisoners into work really is a win-win — it will cut crime by reducing reoffending and grow our economy to the benefit of us all.'As well as wider releases for employment purposes, it goes on to call for better education in the UK's prison system, more digital technology, a wider range of vocational qualifications and earlier access to student loans.Director of Centre for Social Justice Joe Shalam argued there is evidence that allowing prisoners out on release for work cuts reoffending.He said: 'It wasn't that long ago that the numbers [freed on temporary licence] exceeded 11,000. There's no reason why with stringent safeguards it couldn't go beyond this level again given the huge demand from employers to fill roles.'According to The Times, last year the number of inmates released on licence was just more than 7,000 - and around half of this number were granted release to join the workforce.Reoffending amongst convicted criminals is thought to cost the UK £18 billion per year, and the report recommends that ministers go 'further and farther' in their efforts to increase the number of offenders in work.Prisoners who are granted temporary release are mostly from open prisons, the lowest-security jails in the UK which hold mostly non-violent convicts.",
        "No inmates from Category A prisons, the UK's highest security institutions, are considered for temporary work release and all inmates go through safeguarding checks before it is granted. "
    ]
}