{
    "articleURL": "/wires/ap/article-12058243/Conervatives-prevail-key-vote-new-Chile-constitution.html",
    "content": [
        "SANTIAGO, Chile (AP) - A far-right party led in the vote count Sunday night after Chileans cast ballots for a 50-member commission that is to draft a new coonstitution after voters overwhelmingly rejected a proposed charter last year that was considered one of the world´s most progressive.",
        "It was a major defeat for Chile´s center-left president, Gabriel Boric, with the vote also widely viewed as a referendum on his government, which currently has an approval rating of around 30%.With 91% of polling stations reporting, the Republican Party, led by far-right José Antonio Kast, who lost the presidential runoff to Boric in 2021, led with 35% of the vote. The Republican Party has long opposed changing the constitution that was imposed by the dictatorship of Gen. Augusto Pinochet.A coalition of left-leaning parties allied with Boric, Unity for Chile was in second place with 28% of the vote. A center-right alliance, Safe Chile, was in third with 21%. Null or blank votes made up 21% of the total.Preliminary calculations pointed to the Republican Party ending up with about 22 representatives on the constitutional council, compared to 17 for Unity for Chile and 11 for Safe Chile.If the the two right-of-center groups, the Republicans and Safe Chile, unite it could leave Boric´s allies with very little room to influence the final text. The preliminary count suggested left-leaning coalitions would not reach the 21 seats necessary to veto proposals or force consensus on certain issues.",
        "Sunday´s vote marked a key step in the effort to come up with a new proposal for a constitution after 62% of voters rejected the previous proposed charter in September. It had been the first in the world to be written by a convention split equally between male and female delegates.",
        "Critics said the document was too long, lacked clarity and went too far in some of its measures, which included characterizing Chile as a plurinational state, establishing autonomous Indigenous territories, and prioritizing the environment and gender parity.Once installed, the commission's 50 members will not start from scratch, but rather work from a preliminary document drafted by 24 experts who were approved by Congress. The body's proposal is to be put before plebiscite in December.The path to rewriting Chile´s constitution began after violent student-led protests in 2019 that were sparked by a hike in public transportation prices but quickly expanded into broader demands for greater equality and more social protections.Congress managed to get the protests under control by calling for a referendum on whether to draw up a new constitution, which almost 80% of voters agreed was needed.Much of that enthusiasm appears to have vanished, though. Before Sunday´s vote, polls said there was broad disinterest in the constitutional process.Luis Rodríguez, a 70-year-old retiree who cast a ballot Sunday, said: \"I decided to vote because it´s mandatory. ... I don´t care about the result.\"Another retiree, David Pino, 65, said he also voted out of obligation. Fines for those who do not vote can be as high as $230."
    ]
}