{
    "articleURL": "/femail/article-12054011/Camillas-children-watch-crowned.html",
    "content": [
        "Camilla's daughter Laura Lopes, 44, wears emerald green outfit to Coronation CORONATION LIVE BLOG: Click here to follow live updates throughout todayThe Queen's children Tom Parker Bowles and Laura Lopes took front row seats at Westminster Abbey as they watched their mother crowned Queen.",
        "Food critic Tom, 48, and mother-of-three Laura 44, arrived for the biggest day of their mother's life as she took her place alongside King Charles III.Tom watched intently throughout from the front row, looking smart in suit and waistcoat as he looked on just yards from his mother Camilla. Laura also watched from two seats down, dressed in a floaty emerald green dress with a high collar and matching hat, her blonde hair pinned back underneath it.The art critic, who also wore minimal make-up, is married to Harry Lopes, a scion of the super-wealthy Astor family. ",
        "The two siblings have long been supportive of their mother's relationship with the King and enjoy close relations with the royal family. Laura's daughter Eliza was a flower girl to William and Kate when they wed in 2011. Camilla was married to her two children's father, Andrew Parker Bowles from 1973 to 1995. Despite their mother's elevation to Queen Consort, her two children will now receive any new royal privileges, nor become part of the line of succession.  Tom recently defended his mother in public, hitting back at Prince Harry for suggesting Her Majesty was 'dangerous' and a 'villain' who 'played the long game' to get her hands on the crown.He lambasted the controversial Prince for the comments aimed at his mother.",
        "Although Harry's ghostwritten mudslinging memoir Spare has flown off the shelves, it has courted a number of scandals since publication.Parker Bowles told The News Agents podcast: 'I don't care what anyone says — this wasn't any sort of end game. She married the person she loved and this is what happened.'In a rare interview, he also said that it was understandable if his mother felt anxious in the run up to being crowned alongside King Charles on May 6.",
        "However the food writer added that Camilla had always been the 'uncomplaining' type.He said: 'I think anyone would be anxious on an occasion of this sort of importance in terms of the historical.'And yes, I think I'd be terrified if I had to sort of walk out wearing ancient robes... She's 75, but you know, it's tough to do it. But she's never complained. You just do it. Get on with it.'Tom, who writes a column for the Mail on Sunday newspaper, rarely speaks about his mother publicly.But he revealed that it wasn't 'weird' to think of his mother as the Queen, saying: 'She's still my mother... I think change happens, but I don't care what anyone says.'This wasn't any sort of end game, she married the person she loved, and this is what happened.'",
        "The writer, whose father is Camilla's first husband, Andrew Parker Bowles, added that it wouldn't change their lives at all and that it would be 'appalling' if he was to become a Duke.He said: 'You're not going to find us with great estates and being called the Duke of Whatever. No, that would be appalling.''I become nothing. There would be a revolution if they start handing them out to people like me. No. Why would I expect one?' He added of his mother and step-father: 'I think they're doing amazingly. I think King Charles is a good, kind, intelligent man who cares deeply about his roles wherever they may be, Prince of Wales, the King.'He's been way ahead of his time on issues like sustainability, food security, farming, pollution, all these things. But people were calling him sort of mad and eccentric 20 years ago.'Everything that he's talked about are now things that have hit the mainstream and now we're really worrying about. He uses his position, as far as I'm concerned, to do good.'",
        "He also said his son, Freddy, was unaware of quite how big his star role as a Page of Honour to the King and Queen will be.'I don't think he has a sense of the occasion. He's a 13-year-old boy who loves football, a Spurs supporter... So, his worries are about the Spurs manager and losing when we're up and that sort of stuff,' he said.",
        "'There's no reason for our children to be in the Press at all and so we've purposely kept them well away from anything to do with that...'I think there are a lot of rehearsals are going to happen before and he's doing it with his cousins, his two best mates, and my first cousin's son so they will know each other.'The couple's day of destiny today has arrived as the world prepares to watch the historic first coronation of a British monarch in 70 years at Westminster Abbey where Britain will hail its new King.The monarch had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the Abbey from 6am to get one of the prime 2,300 seats inside.Charles will be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. It will also shine a spotlight on Britain’s place on the world stage.And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations.Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.",
        "The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.‘There will be all the pomp and ceremony you could dream of, but as little of the “them and us” as possible,’ one senior royal aide said last night.Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary’s Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to ‘pace herself’ and also ensure ‘the day was about her husband’, sources said.",
        "‘She loves him unconditionally and always wants him to shine,’ a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.‘The calm before the storm – perhaps metaphorically as well as literally’, a friend said with a nod to the dismal weather forecast, something the new King and Queen’s celebrations have in common with the late Queen’s Coronation in 1953."
    ]
}