{
    "articleURL": "/news/article-12049033/Homeowner-shot-killed-20-year-old-Kaylin-Gillis-denied-bail.html",
    "content": [
        "Lawyers for Kevin Monahan hoped a State Supreme Court judge would reverse a lower court's ruling to deny him bailBut Judge Robert Muller ruled Monahan is inherently a flight risk because he is a 65-year-old man facing life in prison for the death of Kaylin GillisAuthorities have said Gillis was traveling in a car with her friends when they accidentally turned onto Monahan's driveway on April 15 The 'hot-tempered' New York homeowner accused of killing 20-year-old Kaylin Gillis when the car she was in accidentally turned onto his driveway was again denied bail Thursday.",
        "Lawyers for Kevin Monahan hoped a State Supreme Court judge would reverse a lower court's decision to have the 65-year-old arrested without bail, arguing that he is not a flight risk and there is no evidence to suggest that he is.Kurt Mausert, his attorney, claimed in court that Warren County Judge Adam Michelini only considered the harm caused and Monahan's history of gun use but noted that before April 15, Monahan had never been charged with any gun-related crimes, according to WNYT.Michelini had said he opted to hold Monahan without bail on charges of second-degree murder arguing that he was known in the community as being impulsive and that the media's scrutiny gave him reason to flee.And on Thursday, Judge Robert Muller ultimately agreed with this assessment, saying Monahan is inherently a flight risk because he is a 65-year-old man facing up to life in prison who has the financial means to take off.",
        "Authorities said Gillis was traveling in her boyfriend's SUV with two other friends through the town of Hebron just before 10pm when the group made a wrong turn onto Monahan's property.They were trying to turn the car around when Monahan came out onto his porch and fired two shots from a 12-gauge shotgun, according to Washington County Sheriff Jeffrey Murphy, who claimed Monahan showed no remorse.",
        "When officers arrived at Monahan’s house to investigate the shooting, he refused to come outside, Murphy said. Authorities spoke with him through a 911 dispatcher and in-person for about an hour before he was taken into custody, according to the sheriff. ",
        "Murphy noted in an interview with CNN that Monahan had already arranged legal representation before he emerged from his house and handed himself over to cops.Additional charges for Monahan may be forthcoming. Speaking in an interview with NBC News Gillis' boyfriend, Blake Walsh, 19, revealed he was the one driving on the fateful night. 'We thought we were at the right address. We didn’t have any cell service to figure it out. As soon as we figured it out that we were at the wrong location, we started to leave, and that’s when everything happened,' Walsh said. He said one of his friends in the car alerted him to Monahan shooting, prompting him to suddenly turn the car around and drive away.'I tried to step on the gas as fast as possible, and that's when the fatal shot came through.' After driving for around five miles, the group finally made it to an area where they had cell service. They immediately called 911, but sadly it was too late. 'I want to believe it was instant. I'm hoping it was. I'm praying it was,' Walsh said through tears. ",
        "He added the drive to get cell service felt like it lasted just 30 seconds, 'the adrenaline was rushing so bad.' ",
        "In an interview with CNN, Mausert said his client told him that multiple vehicles had descended onto his driveway that night, including a motorcycle, revving their engines and behaving in a menacing way.He also told News10 the incident was a 'series of tragic mistakes, made by more than one person.'The situation where we have an elderly gentleman and his elderly wife living out in the dark woods in Washington County with three vehicles that come roaring into his driveway at a high rated speed, shined their lights at his house and not leaving when he turns on the floodlights so certainly there was cause for an element of fear on Mr. Monahan’s part,' Mausert added.  Alcohol, drugs or mental illness are not thought to have played a role in the shooting, reported the Times-Herald. The newspaper stated there had not been any reports of increased robberies or any reason for homeowners to be extra vigilant recently.  But Town Supervisor Brian Campbell told the Times-Herald that Monahan previously attended local board meetings to discuss issues such as road repairs. Campbell described the suspect as being 'very reasonable.'",
        "Following Monahan's initial bail hearing on April 19, Andrew Gillis — Kaylin's father — said he hopes the accused gunman 'dies in jail.'",
        "He thanked Judge Michelini for his decision to deny Monahan bail, saying: 'Kaylin deserves justice.'I want to talk about Kaylin's boyfriend,' Gillis continued. 'He wanted to marry my daughter. I would have loved that.'Walsh met Kaylin when he was a sophomore at Schuylerville High School, where she graduated from in 2021.He said the pair would often joke about being the '2 percent,' a reference to the two percent of high school sweethearts who end up getting married. They had dated for four years. In his address to the press, Kaylin's father said Walsh now blames himself for Kaylin's death, but her father said, 'It's Kevin Monahan's fault.'"
    ]
}