{
    "articleURL": "/wires/pa/article-12050961/Police-officer-tasered-man-accused-liar.html",
    "content": [
        "A police officer who left a man paralysed from the waist down after tasering him has been accused of being a liar while undergoing cross-examination.",
        "Pc Imran Mahmood, 36, is charged with unlawfully inflicting grievous bodily harm on Jordan Walker-Brown during a patrol in the early months of the first lockdown on May 4 2020.Mr Walker-Brown, who was 23 at the time, was left with “catastrophic” injuries after hitting his head on the pavement and breaking his back.Southwark Crown Court heard that Mahmood – attached to the Metropolitan Police’s territorial support group (TSG) which deals with outbreaks of public disorder – chased Mr Walker-Brown on foot after noticing him walking along the pavement in Burgoyne Road, Haringey, north London. I’m not a liar. I was just trying to do my job  Imran Mahmood  Mahmood was said to have used his Taser when Mr Walker-Brown jumped on to a wheelie bin to climb over a fence in the front garden of a house, creating such an electric shock that it caused him to tumble backwards over the wall, land head-first on the footpath and break his back.The officer told jurors he discharged his Taser after Mr Walker-Brown “turned around” on top of the bins, adding that he “honestly” believed the younger man was in possession of a weapon and going to attack him.",
        "During cross-examination on Friday, prosecutor Ben FitzGerald KC said: “The truth is that he was about to get over the wall and you fired to stop him getting away.”",
        "Mahmood replied: “That is incorrect.”Mr FitzGerald went on: “I’m afraid you had to make up a false account afterwards to justify what you did.”“No, that is incorrect,” Mahmood replied. “I’m not a liar. I was just trying to do my job.”The prosecutor pressed: “I’m afraid you are a liar, Mr Mahmood.” it was my honest held belief that Mr Walker-Brown was in possession of a knife and he was a threat to me, my colleagues and anyone around  Imran Mahmood  Mahmood accepted he did not see Mr Walker-Brown take out a weapon and the alleged victim made no movement towards him with a weapon.But the officer said he was “adamant” at the time that Mr Walker-Brown had a knife and “honestly believed” he was going to attack him.Mr FitzGerald asked: “Was it the case that in that moment of anger and frustration that he would not follow your commands that you fired the Taser?”“Absolutely not,” Mahmood said.He insisted it was to protect himself and others and that it was a reasonable use of force.Mahmood agreed there was an “obvious risk of injury” from using a Taser in the situation.Taken through still images of his bodyworn video which captured the incident, Mahmood said it could “clearly” be seen from the footage that Mr Walker-Brown’s “whole body” was “turned towards” him, but later added that the images are “quite fuzzy” and make it “hard to tell”.",
        "He told the court: “You have got to appreciate that this is a fast-moving situation.“These stills are within the same time period and (with) the information I had at the start and during the chase, it was my honest-held belief that Mr Walker-Brown was in possession of a knife and he was a threat to me, my colleagues and anyone around – including the occupants of that address.”The officer, from Plaistow in east London, does not dispute inflicting grievous bodily harm but denies it was unlawful.Mahmood has finished giving evidence and the trial continues on Tuesday."
    ]
}