{
    "articleURL": "/tvshowbiz/article-12052265/Bond-Aaron-Taylor-Johnson-appears-bulking-James-Bond.html",
    "content": [
        "Aaron Taylor Johnson recently become one of the top choices for the next James Bond role.",
        "And the Kick-Ass actor, 32, appears to be bulking up to become the next James Bond as he has physically transformed from wiry youth to hench hunk.Footage from the forthcoming Marvel film Kraven The Hunter screened recently at Cinema Con in Las Vegas showed the British actor, who plays the title character, spending most of the movie topless.Indeed, so thorough is his physical transformation from wiry youth to hench hunk that he has been hired as the 'face' of Calvin Klein underwear; and shot a buff advertising campaign earlier this year. This was accompanied by a semi-clad video which rather set Instagram alight.One fan wrote: 'I got pregnant after watching this video, and I'm a man.'",
        "Taylor-Johnson's friend Jamie Dornan, who was the face of Calvin Klein pants himself back in 2014, wrote: 'You really should have got yourself in better shape for this. Did you forget about it or something?'Although it's been a year and a half since Daniel Craig's last appearance as Bond in No Time To Die - producers are taking their time when it comes to making their choice as this role will entail one of the biggest reboots the franchise has seen.The Bond speculation comes after Aaron reportedly had a secret audition and remains the most-voted star for the role.",
        "According to Puck New, Aaron sat down with producer Barbara Broccoli and sources claimed the meeting went 'very well'.In December, it was also reported that Aaron had shot scenes as the secret agent, filming the memorable 'gun barrel teaser footage' seen in the films over the years.A source told The Sun at the time: 'Aaron has impressed bosses so much that he has filmed one of the franchise's famous gun barrel teaser scenes, something all the actors do. That move takes him a step closer to signing a deal.'They added: 'Bosses at the brand were really impressed with his unique blend of acting intensity and his impressive back catalogue of action films.'",
        "However, the source went on to say that nothing was officially confirmed and it's unclear what any next steps might be.Meanwhile, other fans have been rooting for Henry, 40, to star as Bond - as he was previously considered and hope for a better outcome this time.According to the Mail On Sunday, Barbara has made it clear she wanted the next actor to portray the character for 15 years, meaning that the 30-year-old is the perfect age to step into the role.The two British heartthrobs have been contending for the win - but there's one new star that joined the odd race for the 007 franchise.",
        "Emmy nominee Paapa Essiedu, 32, is said to be the third most-voted choice for James Bond - as he threatens their lead.The I May Destroy You star is now 3-1 to be the next James Bond, in joint third with James Norton, according to William Hill.Meanwhile, Henry is in second on 5-2 and Aaron remains at the top on 11-8.",
        "It follows reports that Idris Elba walked away from 'years of talks' with movie bosses to become the next James Bond, paving the way for a new 007. This year marks the 70th anniversary of Ian Fleming's James Bond and fans are tingling as they wait for the next star to be revealed, with William Hill revealing the odds for the role and who is pipped against who. A spokesperson said: 'There's been more interesting movement in the betting for the Next James Bond actor, with Paapa Essiedu shaking up the market and emerging as one of the frontrunners for the role.'Essiedu wasn't even an option over the likes of Piers Morgan and David Beckham (both 1000/1) at the start of this week, but after entering the market at 8/1 on Wednesday, he is now the joint-third favourite at 3/1 to replace Daniel Craig...'That price puts him level with James Norton to be awarded the role, with Aaron Taylor-Johnson (11/8) and Henry Cavill (5/2) still leading the way.'"
    ]
}