{
    "articleURL": "/tvshowbiz/article-12049179/Jackie-O-Henderson-shops-Paddington-amidst-stalker-fears.html",
    "content": [
        "Jackie 'O' Henderson showed off her slimmed-down figure on Thursday as she went shopping in Paddington before talking about her 'stalkers' live on radio. ",
        "The radio queen, 48, positively glowed as she stepped out in a long knitted dress which clung to her frame and hung heavy about her ankles. Sporting a matching black and gold Fendi bag and earrings to elevate the look, she slipped on a white dress beneath her brown, see-through frock. Hiding her eyes behind a set of dark designer glasses, she slicked her golden tresses back into a tight pony which highlighted her genetically blessed features. The media personality was all smiles as she bought a $430 maxi dress from Maison Essentiele before heading a few more doors down to buy something else. ",
        "Jackie appeared at ease despite hopping on radio the next morning to reveal she has a stalker somewhere in Australia. Speaking with co-host Kyle Sandilands on their KIIS FM show Friday morning, they discussed Sophie Monk's recent run-in with an allegedly 'catfished' man who showed up to her house.The shock jock jokingly asked Jackie why she didn't have any stalkers, to which the radio host replied: 'Mine don't live here thankfully.'",
        "When Kyle, 51, pushed for more information, she added: 'They're in Australia but I'm not going to say [where]. No one has turned up to my house thank god.'He then joked Jackie moves around too much for any stalker to narrow in on her location. ",
        "It comes after the blonde beauty placed a winning bid on her dream home recently and moving on from her last luxury property in Woollahra. ",
        "The mother of one splashed out $13.25million on a three-storey oceanfront house in Clovelly at an open auction in March.She went up against two other keen bidders for the six-bedroom fixer upper as her 11-year-old daughter Kitty stood by her side.Jackie pocketed a tidy $2million in profit on the sale of her old home in Woollahra, after paying $1million over the $10million asking price for it in 2020."
    ]
}