{
    "articleURL": "/femail/article-12058837/Princess-Eugenie-shares-touching-tribute-King-Charles-III-Queen-Camila.html",
    "content": [
        "Princess Eugenie shared  a touching message following the Coronation READ MORE: Prince William pays moving tribute to his father King CharlesPrincess Eugenie has shared a touching tribute to her uncle King Charles III following his Coronation this weekend.",
        "Princess Eugenie, 32, who is expecting her second child with husband Jack Brooksbank, 37, took to Instagram to express her admiration and feelings about the special day.Posting a selection of images from the event, the 11th in line to the throne, wrote to her 1.7 million social media followers: ‘Yesterday meant so much to me, as I'm sure it did to so many watching.‘What a magical celebration for The King, The Queen, our country, and the Commonwealth.’The Princess’s image choice also didn’t go unnoticed by fans, who expressed their delight that she had included Prince Harry in the mix.",
        "One person wrote in the comments: ‘Thank you for showing Prince Harry in your photos. He’s been iced out for the most part, so it’s nice to see your support.’‘I’m pleased you included Harry in the photo’s you picked x, [sic]’ added  a fellow royal fan. And another follower penned: ‘Thank you for your support to Prince Harry and his family.’‘Your hubby is amazing, the world watched and saw his treatment of Harry. He’s a true friend,’ commented another royal fan.Royal experts had predicted that Prince Harry might have a lonely time at his father's coronation, with members of The Firm choosing not to speak with him.",
        "However, the Duke of Sussex, 38, who attended the event without his wife the Duchess of Sussex, 41, had at least one good friend on hand.Images from the proceedings show Harry beaming, as he appeared to share a joke with Jack as they stood outside the Abbey.A photo of Jack and Harry at their seats seems to show them enjoying a conversation.Lip reader Jacqui Press told MailOnline that the two men may have been discussing someone lighthearted as they waited for the historic ceremony to begin.She claimed the Prince smiled at Mr Brooksbank and said: 'That’s funny, mmm interesting'.To an unknown question from Mr Brooksbank, Prince Harry said: 'About quarter to 4?'Mr Brooksbank then replied: 'Oh really, when?' to which the Duke responded: 'I think tomorrow...'Today doesn't mark the first time Harry has been spotted joking with his cousin's husband.Images taken at the Queen 's Service of Thanksgiving at St Paul's Cathedral, during the late monarch's Platinum Jubilee, also show the men enjoying a joke.The Duke, wearing a black suit adorned with military medals and a silver tie, couldn't resist larking around in the pews of St Paul's, sharing a joke with Jack.",
        "Prince Harry and Jack were spotted giggling ahead of the historic service, with Princess Eugenie, dressed in a striking orange dress, appearing to also stifle a laugh.",
        "Harry's friendship with Jack could be a result of the bond he shares with Eugenie, which is said to be very close.Despite being born five years apart, Harry and Eugenie often spent time together as children thanks to the friendship between their mothers Princess Diana and Sarah Ferguson, who would pack up the children for joint family holidays.And Princess Eugenie became the first member of the Royal Family to make a public visit to Prince Harry in California, two years after he quit as a senior royal."
    ]
}