{
    "articleURL": "/news/article-12041193/Woman-told-junior-hilarious-breasts-hung-lower-wins-dismissal-claim.html",
    "content": [
        "Chrissie Lickfold was sacked via WhatsApp less than 48 hours after a meetingA beauty clinic manager who was sacked after she drunkenly mocked a junior staff member's breasts at a boozy Christmas work party has won a claim for unfair dismissal. ",
        "Chrissie Lickfold 'took the p***' out of the younger woman by brashly telling their co-workers she found it 'hilarious' her breasts hung lower than her own, an employment tribunal was told. The comments by 'churlish' practice manager Ms Lickfold - who also clashed with other colleagues - made the junior member of staff feel 'humiliated', the hearing was told.The employment tribunal heard Ms Lickfold initially went unpunished for the rude joke but soon after she was sacked from Firvale Clinic in Southampton, Hampshire for 'toxic' behaviour.Dr Carolyn Berry, director at the cosmetic clinic, had thought of Ms Lickfold as her 'superstar' but the pair's relationship suffered a bitter breakdown.Ms Lickfold is now in line to receive compensation after successfully suing Firvale for unfair dismissal.",
        "Dr Berry, director at the cosmetic clinic, had thought of Ms Lickfold as her 'superstar' but the pair's relationship suffered a bitter breakdown.A tribunal said Ms Lickfold was a 'difficult employee' and caused friction at work but ruled Dr Berry acted too hastily in firing her, concluding that it amounted to an unfair dismissal.The Southampton Employment Tribunal heard Ms Lickfold began working at Firvale from June 2015 until she was dismissed via WhatsApp in April 2022.Firvale, located on an upmarket street in the centre of Southampton, performs laser treatments, fat removals, wrinkle smoothing, and was founded by ex-NHS doctor Dr Berry in 2008.",
        "Dr Berry previously showered Ms Lickfold with compliments for her work, telling her 'I think of you as my work daughter', and would praise her as she would 'bleed for the clinic' because she was so loyal.However, the relationship started to sour in November 2021 when the clinic moved to its current address and Ms Lickfold became unhappy with Dr Berry.In text messages to a friend, Ms Lickfold said 'I literally did absolutely everything to move this clinic' and that Dr Berry went on holiday to Tenerife without saying thank you.She called Dr Berry an 'a**e', said she could 'take her to court over how she has been behaving', and even complained she 'shoved £500 in my bank account' as a bonus.",
        "The tribunal found Dr Berry subsequently 'tried to make things right' as she was concerned about Ms Lickfold's negative attitude and that the clinic director was 'gracious' towards her.One anaesthetic therapist at the clinic, Ana Oliveira, said Ms Lickfold 'shouted' at her and complained about her behaviour.Ms Oliveira claimed Ms Lickfold's behaviour was so poor 'waking up to come to work was like torture'.At the Christmas party in 2021, the tribunal heard Ms Lickfold insulted an unnamed colleague.The woman told the hearing: 'At one point myself, Ana, Lindsey White (an ex-colleague) and Chrissie were in the bathroom where I was being asked questions about my figure by them. Chrissie returned to the table, announced how it was ''hilarious how much my breasts hang low'' and that she had larger breasts than me but despite hers being larger '[the unnamed colleague's] hang lower'.",
        "'And 'she has such better breasts than me considering how much younger I am'.'(Another colleague) defended me and said the conversation wasn't appropriate. I was not at the table during this conversation which made me feel even worse.'The next day Ms Lickfold apologised, saying 'I was a drunk and giddy a**e', and at first did not face trouble at work.The tribunal concluded it was 'deeply unacceptable' conduct and said the clinic would have been within its rights to pursue sex harassment charges against Ms Lickfold.A negative environment continued at the clinic and in April 2022 Dr Berry caught Ms Lickfold looking for jobs on website Indeed using the work computer.",
        "The tribunal report said: 'One gains the unavoidable impression that finding Ms Lickfold using the computer to look for another job caused something of a dam to burst for Dr Berry and a large number of largely unexpressed frustrations flowed out.'She was called to a meeting by Dr Berry, which she thought was informal, but was told 'this is a disciplinary by the way' and informed there would be a review a month later.The tribunal heard that her behaviour at the Christmas party was among the issues raised at the meeting.The following day Dr Berry claimed Ms Lickfold's behaviour caused 'chaos' at the clinic and she told her to leave, however the tribunal found it wasn't as bad as she made out. The next day - less than 48 hours after the initial meeting - Dr Berry sacked her.",
        "Employment Judge James Dawson said Dr Berry should have waited.Judge Dawson said: 'I am satisfied that Dr Berry had a genuine and reasonable belief in a personality clash between Ms Lickfold and other members of staff. A complaint had been made by Ms Oliveira and by [the unnamed staff member] following the Christmas party.'Moreover, Dr Berry had a genuine and reasonable belief that there were interpersonal issues between herself and Ms Lickfold, caused by Ms Lickfold. Ms Lickfold was entitled to be given the opportunity to have her say on those issues, in the context of knowing that the clinic was unhappy with her and considering dismissing her for that reason.'In fact, at no time did she know that the clinic was considering dismissing her...'In my judgement, the circumstances of this case were such that she should have been told, in advance of the meeting, of the allegations against her and the evidence in support of those allegations.'She should have been warned that if relationships did not improve she may be dismissed. Time should have been allowed for the relationships to improve.'I accept that Dr Berry had a genuine and reasonable belief that she was behaving badly in the way she behaved towards her and other members of staff.",
        "'However.. she did not carry out a sufficient investigation and the process it carried out was not fair.'Whilst there might be an argument her behaviour at the Christmas party amounted to gross misconduct, the clinic was fully aware of that behaviour and chose not to dismiss her for it.'Compensation will be decided at a later date."
    ]
}