{
    "articleURL": "/news/article-12053647/Gun-salutes-church-bells-ring-street-partiers-celebrate-coronation-UK.html",
    "content": [
        "People across the country are set to gather and hail Charles III as their monarchCelebrators will gather for public screenings of the King and Queen's coronationHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk As Charles III is crowned King at Westminster Abbey, people right across the country have gathered to hail their new monarch and unite in the pomp and ceremony.",
        "In all corners of the United Kingdom, families huddled around their televisions, church bells rang out in celebration, and neighbours joined together for street parties for the historic first coronation of a UK monarch in 70 years.From Edinburgh and Belfast, to Cardiff, Birmingham and Manchester, royal fanatics will come together, hoping the expected rain doesn't dampen their celebrations.In Northern Ireland, the celebratory events include a gun salute at Hillsborough Castle, while the ceremony at Westminster Abbey was beamed into Cardiff Castle, Edinburgh's West Princes Street Gardens, and Glasgow Cathedral.",
        "In the Welsh capital, celebrators  gathered for a public screening of the King and Queen's coronation.Up to 2,000 people were expected to mark the occasion at Cardiff Castle, where visitors watched the coronation service and processions to and from Westminster Abbey.The event was free to enter but spaces will be offered on a first come first served basis when gates open at 9.30am.A royal gun salute is set to be carried out by the 104 Regiment Royal Artillery, while regimental mascots from the Royal Welsh and The 1st Queen's Dragoon Guards with a quarter guard, Welsh Guards and the Regimental Band and Corps of Drums of the Royal Welsh will be in attendance, along with representatives from the Royal Navy and the RAF.",
        "Lord Mayor of Cardiff Graham Hinchey said: 'The coronation of a new monarch is an event of great national significance, and one that will undoubtedly be remembered long into the future.'As the capital city of Wales, a country that is close to King Charles III's heart, Cardiff is proud to host this series of wonderful events to mark the occasion.'The Church in Wales called it a 'significant and happy' occasion.The bells at Llandaff Cathedral in Cardiff rang out for two hours before the ceremony at Westminster Abbey was set to begin at 11am.At St David's Cathedral, Pembrokeshire, the bells also rang for the ceremony.The Archbishop of Wales, Andrew John, and the bishops of Swansea and Brecon, St Asaph, Monmouth and Llandaff sent their 'warmest congratulations' to the royal couple.",
        "Mr John will present Charles with the Sceptre with Dove during the ceremony. The Cross of Wales will also be carried before the King at the head of the coronation procession.In a statement the bishops said: 'The coronation of their majesties the King and the Queen is a significant and happy occasion for our nation and for the Commonwealth, and we know people from across the world will be joining us in praying for our new King and Queen.'",
        "Organisers of street parties and town events will hope the rain, which is forecast for most of the day, does not make their events a washout.One event will be a beach party in Barmouth, Gwynedd, where a Big Lunch is due to be held on the seafront followed by DJs.Events are also being held across Scotland. The coronation ceremony was beamed from Westminster Abbey on to a big screen in Edinburgh's West Princes Street Gardens, and Glasgow Cathedral will also show proceedings live.Gun salutes will take place at Edinburgh and Stirling castles to mark the occasion, along with community events up and down the country.At Balmoral, where Queen Elizabeth II died last year, well-wishers will be able to watch the coronation live on screens across the royal estate, and the Ballater Pipe Band will play at periods throughout the day.The Royal Standard will fly over St Andrew's House, the Scottish Government's headquarters, throughout the coronation weekend.First Minister Humza Yousaf, Lord Advocate Dorothy Bain KC and Permanent Secretary John-Paul Marks will represent the Scottish Government at the ceremony in London.Mr Yousaf said: 'I will attend at the coronation ceremony as First Minister, on behalf of the Scottish people - and many people across the country will also take part in the celebrations by watching the ceremony on big screens, hosting street parties or taking part in charity or volunteering.",
        "'I look forward to participating in the ceremony when His Majesty is presented with the Honours of Scotland at a service at St Giles' Cathedral later this year.'I know many people in Scotland will want to send their best wishes to King Charles III and Queen Camilla on this historic occasion.'",
        "Back in England, royal fans have gathered in Manchester city centre to watch the Coronation on giant screens.Two giant screens have been erected in the city's Piccadilly Gardens for people to watch with benches and tables laid inPeople wore crowns and waved Union Jacks as police and ambulance workers looked on.Teaching assistant Jess Wayne, 34, was on a hen weekend with seven friends.Wearing a crown, Jess said: 'It's amazing to be here for a double celebration. We have the prosecco all ready 'Her friend Jodie Bament, 40, said they had travelled from Northampton for the day.The horse groom said: 'It's going to be a day we won't forget that's for the sure. But I guess you could say we've come the wrong way heading north but it's very exciting.'It's going to be a momentous day for both events.'Gandmother Eileen Murphy, 63, had travelled from her home in neighbouring Salford to watch.",
        "The cleaner said: 'I had to be here. I love Charles - he's going to be a great king. He will do the country proud.'Estate agent Shell Patrick, 49, was on a weekend away from Billingham, TeesideShe said: 'I had to be here to lap up the atmosphere and emotion. It's history in the making like the Jubilee. It's not often you see something as amazing as this 'Her friend Hayley Watts, 39, said: 'It just turned out we were away for the weekend but we had to watch it. It's an historic day.'A screen has also been put up at Manchester Cathedral after morning prayers.There were giant TV screens erected in nearby Oldham for a royal festival.The town centre event will feature children entertainers including Bouncing Busby Guards and King of the Dinosaurs Tyrone T-Rex.Later there will be a Best of British Music featuring The Beatles, Queen and Any Winehouse tribute acts.There will also be The Great British Garden Show Party show with comedians and theatre acts.Hundreds of roads have also been sealed off for street parties across Greater Manchester.The celebrations will continue in Birmingham where a massive two day event is taking place to mark the crowning of the monarch.",
        "Big screens have been set up in the Midlands city's Centenary Square, while street entertainers perform around funfairs and street parties.",
        "Thousands of people are also gathering at events across Northern Ireland this morning to celebrate the Coronation of King Charles III.The ‘Coronation Garden’ - designed by award-winning gardener Diarmuid Gavin - was opened to the public at 10am in Hazelbank Park in Newtownabbey, Co Antrim and has been influenced by the Monarch’s lifelong dedication to nature.Nestled by the banks of Belfast Lough, it’s a special preview dubbed the ‘Glorious Glimpse’ ahead of its official opening later this month and boasts a floral tapestry with classical architecture style, planted in a pollinator friendly and sustainable way in keeping with the environmentally friendly ethos of His Royal Highness.An ornate three floor pavilion topped by a crown, this magnificent Coronation Garden will treat visitors to a musical performance of dancing topiary and spinning conical trees every 15 minutes.Royal lovers will gather to watch the coronation in front of big screens erected in major cities and towns across the province, including at Belfast City Hall, Antrim Castle Gardens, Coleraine Town Hall and Jordanstown Loughshore Park, Market Square, Lisburn, People’s Park in Ballymena, Town Park in Larne and Marine Gardens in Carrickfergus.A picnic and party with live music from a brass band is being held in the 100-acre grounds of Hillsborough Castle, Co Down, the King’s official residence in Northern Ireland, where there will also be a big screen.Well-wishers will see a rare gun salute at midday by the 206 (Ulster) Battery, Royal Artillery and an Armed Forces salute takes place at 1.45pm followed by the Band, Bugles, Pipes and Drums of the Royal Irish Regiment performing the Beating Retreat, a spectacular military ceremony.Visitors can also pay to see inside the castle’s State Rooms still used for royal occasions and political discussions today, including the Throne Room.Among the hundreds of families flocking to the village of Royal Hillsborough, Co Down were Andrew and Rachel Wilson with their three-year-old daughter Ruby.The castle in the village is the official residence of His Majesty King Charles in Northern Ireland, something locals are very proud of.Rachel said: 'None of us have ever been to anything like this before and most people in living memory haven't. 'So it is a special occasion and we just wanted to come down and be part of it.' "
    ]
}