{
    "articleURL": "/femail/article-12049221/JANA-HOCKING-best-day-love-online-singles-feel-single.html",
    "content": [
        "Jana Hocking claims Sundays are the best time to use dating appsMost single people feel 'extra lonely' at the end of a weekendPicture this: it's a Sunday morning. I've woken up with a slight hangover and I'm in the mood to get a little frisky. ",
        "I roll over in bed to snuggle up to my man friend - but oh wait, I'm single. There is no one there.I make the mistake of going on Instagram for an aimless scroll to fill the void. But rather than pictures of cute puppies or hilarious memes, I'm instantly hit with pictures of my happy coupled up friends having brunch, or going for a morning swim, or setting off for a fun road trip together.Ergh, Sundays are the WORST! I call them the Sunday blues, because I never feel more single than I do on a Sunday.",
        "I used to fight this doom day with my best friend when we lived together. We would purposely lock in fun plans to stop ourselves feeling blue. It was like the cutest date day, but with each other. We would set our alarms late, wake up and go get a coffee at our local coastal cafe, then come back home get dressed up in gorgeous dresses and take ourselves off to an art gallery. We would peruse whatever exhibition was currently on and then stop at the closest wine bar for a glass (or two) of vino and a bowl of olives. Before heading home to binge watch rom-coms with a pizza. It was the best day ever.",
        "And then she met a man. Then she got married. And then had a child. And Sundays went back to being oh, so blue.It's for this very reason that dating apps report their busiest day for swiping is a Sunday. Yes, it is this very day that we freak out and decide it's time to get a partner. Queue a swiping frenzy.",
        "Bumble says they experience a 15 per cent spike in matches on Sunday, and Tinder experiences 10 per cent more sign ups and 35 per cent more swiping activity.We're all thirsty for it. Kind of makes you feel less alone, right?I spoke to a friend who has finally found her soul mate after a hectic 10 years of situationships with dud dudes. She said on particularly tough Sundays when she was feeling her most single, she would purposely take her dog for a walk to a park that is always full of screaming kids. She did this to remind herself that the grass is not always greener. The sight of parents looking stressed as they attempted to keep their kids under control instantly made her feel better. She would then treat herself to a manicure and remember that she had a whole Sunday to do whatever the heck she wanted.",
        "Another friend said that after one-too-many lonely Sundays, she decided she needed a plan of attack. She downloaded Tinder, Bumble and Hinge. Made a promise to herself that she would go on two dates a week and gave herself a 'glow up' in preparation. She dyed her brunette hair blonde, got a gym membership and started watching youtube makeup tutorials.She even got a life coach. Just knowing that she was actively working towards becoming her best self and, in her words, 'a bit of a catch' made her feel less lonely, and more determined.She said it's impossible to feel sorry for yourself when you have a plan and a purpose.",
        "Three months, and many dates later, she finally met her match. She met him on the dating app Hinge and said there was an instant connection. No games, no texts that were hard to decipher. She said she was simply open and upfront about what she was looking for, and so was he. Isn't that the dream?Three months after that they moved in together, and have been happily in the honeymoon period for two years now.So, she's inspired me to do the same. No more sooky Sundays, I'm going to make the most of them. I'm back on the apps, I'm doing hot laps in my gym gear around my local area and I'm focusing on becoming my most 'dateable' me. ",
        "And if all else works… well, I guess I'll go visit the closest park with screaming kids to remind myself, hey, it could be worse."
    ]
}