{
    "articleURL": "/wires/pa/article-12054661/Prince-George-stars-coronation-solo-role-major-ceremony.html",
    "content": [
        "Prince George’s first solo role at a major ceremony saw him star at his grandfather’s coronation as one of the King’s Pages of Honour.",
        "The nine-year-old, who is second in line to the throne after his father, the Prince of Wales, rose to the occasion on Saturday as Charles and the Queen were crowned at Westminster Abbey in central London.The schoolboy future king was immediately visible during the televised ceremony as he carried a corner of the long train of his grandfather’s regal robes as Charles entered the abbey.",
        "Later, George and the other pages were seen sitting behind Charles at the front of the Gothic church as the King swore the coronation Oath.George’s gaze could be seen flitting about the church from his seat behind his grandfather.The prince and his fellow pages then stood behind the kneeling Charles, again holding the corners of his train, as he prayed.",
        "It marked a step up for George, as he took on the important role independently from his parents William and the Princess of Wales.His younger siblings – Princess Charlotte, eight, and Prince Louis, five, – were wedged between William and Kate in the front row during the ceremony.George and his siblings will, eventually, be expected to carry out an array of official engagements as adult working members of the royal family.",
        "After leaving the abbey, George joined his immediate family in a carriage ride back to Buckingham Palace, riding behind Charles and Camilla’s Gold State Coach.",
        "George was seen smiling and peering curiously out of the window during the journey to get a better view of the procession and crowds along the route.Later on the Buckingham Palace balcony, a grinning George gazed up as the Red Arrows soared overhead during a military flypast that was scaled down due to the rainy, cloudy weather.",
        "And a father who watched the ceremony in Rochester, Kent, said his children “loved” seeing George play a key role.Screens had been mounted outside Rochester Castle, where families were encouraged to bring their picnics and watch the coronation service.Max Harrison, 29, who went to watch it with his children and said: “They loved seeing Prince George carrying the King’s robe, he’s just about my son’s age so they get excited to see him.”"
    ]
}