{
    "articleURL": "/news/article-12061339/Jacqui-Lambie-demands-stage-three-tax-cuts-scrapped-despite-voting-them.html",
    "content": [
        "Dire warnings over tax offset payment endingIt was available from 2018-19 to 2021-22 tax years Call to scrap proposed stage three tax cuts  Jacqui Lambie wants the stage three tax cuts to be axed, despite voting for them, saying that money should instead be spent on lifting people out of poverty. ",
        "The proposed stage three tax cuts will give $14bn in relief to the country's highest earners from July next year.The firebrand senator said circumstances had changed since she backed the cuts introduced by the Morrison government pre-Covid.She said that time had come because far too many people were now struggling under cost of living pressures thanks to high inflation and that money from the tax cuts should to be spent on them.",
        "'When people are living in poverty, there's no good giving a little bit here and a little bit here. You're giving out chicken feed and it will progress nowhere,' she told ABC's Q&amp;A on Monday night.'You go in hard and fast and stop a generation from being in a (poverty).'She said the Albanese government needed to respond to the circumstances now.'Please don't use Covid as an excuse when you've still got those bloody stage three tax cuts with rich people like you and I because we earn more than enough. We could pay more tax, not take tax (cuts),' she said.'That's how it should work. It's more about giving back. That's the patriotism that should be back in this country and it's gone missing.'The tax cuts, due to come into effect in July 2024, are part of changes to the tax regime implemented by the Morrison government and largely affect medium to high-income earners.",
        "Senator Lambie's demand to the stage three cuts prompted Q&amp;A host Stan Grant to point out she had initially supported them. 'But you did support the stage three tax cuts didn't you Jacquie?' he said.Senator Lambie fired back: 'Yes, that is before Covid and I can tell you know I made it very clear in my speech [at the time] if things went down the gurgler they had to go.'She called on the Albanese government to increase the Jobseeker payment by at least $150 a fortnight in the budget, which she said it promised while in opposition.'I'd expect that to be as they promised... so I expect [unemployed people] to get [an extra $150] and even that won't be as helpful in today's world.'It comes after 10 million Australians were left worse off after the low and middle income tax offset was ditched this year. ",
        "Australians earning less than $126,000 have felt the pinch after Prime Minister Anthony Albanese chose not to extend it.Leading economist Chris Richardson said residents would feel like they had been hit by an extra two interest rate rises.Treasurer Jim Chalmers will hand down the budget on Tuesday night and has revealed no intention to scrap the proposed stage three tax cuts.",
        "Australians face a difficult adjustment with the end of the LMITO, which gave ordinary Aussies between $675 and $1,500 for the 2021-22 tax year.Mr Richardson told Nine newspapers the difference would be drastically felt by everyday residents. 'We're talking a substantial amount of money. It's the equivalent of two interest rate rises,' he said.The stage three tax break will mostly benefit wealthy Australians.Workers earning between $120,000 and $200,000 will have their tax rates cut between seven and 15 per cent, while residents on smaller salaries will have lower cuts of around 2.5 per cent.   "
    ]
}