{
    "articleURL": "/wires/afp/article-12046389/Kenyan-pastor-dock-cult-massacre.html",
    "content": [
        "One of Kenya's highest profile pastors was released on bail Thursday after appearing in court in connection with the horrific discovery last month of dozens of bodies in mass graves.",
        "Ezekiel Odero, a wealthy televangelist who boasts a huge following, is being investigated on a raft of charges including murder, aiding suicide, abduction, radicalisation, crimes against humanity, child cruelty, fraud and money laundering.Prosecutors accuse Odero of links to cult leader Paul Nthenge Mackenzie, who is in custody facing terrorism charges over the deaths of more than 100 people, many of them children, in what has been dubbed the \"Shakahola forest massacre\".Mackenzie, the head of the Good News International Church, is alleged to have incited his followers to starve to death in order to \"meet Jesus\" in a case that has deeply shocked Kenyans.Police had sought to detain Odero, who is popularly known as Pastor Ezekiel, for another 30 days to complete their investigations.But magistrate Joe Omido ordered him released on bail of 1.5 million Kenyan shillings (about $11,000), saying he had to report to police once a week and not speak about the case.\"By failing to provide adequate information on the status of the investigation as ordered by the court, I'm persuaded that the state did not act in good faith in seeking to continue detaining the respondent,\" he said.\"The bail terms shall persist until the respondent is formally charged and or the investigation is concluded.\"",
        "Odero's supporters celebrated by singing, dancing and chanting: \"It's all prayers, it's not witchcraft.\"",
        "Kenyan police arrested Odero last Thursday over the \"mass killing of his followers\" and closed his New Life Prayer Centre and Church that lies south of the coastal town of Malindi.A total of 109 people have so far been confirmed dead in the Shakahola forest case, the majority of them children.Autopsies carried out so far on about 40 of the bodies unearthed in the forest inland from Malindi found that while starvation appeared to be the main cause of death, some of the victims were strangled, beaten or suffocated.- 'Innocent and vulnerable followers' -Prosecutors have said in court documents that they have credible information linking the corpses exhumed at Shakahola to the deaths of several of Odero's \"innocent and vulnerable followers\".Police are also investigating information that the bodies were kept in a privately-run morgue before being transported and buried in the forest, according to the documents.",
        "Prosecutors have also claimed that Odero and Mackenzie share a \"history of business investments\" including a television station used to pass \"radicalised messages\" to followers.In a court filing this week, Odero said he wanted to \"strongly disassociate\" himself from Mackenzie and disagreed with his teachings.",
        "Mackenzie himself is due back in court on Friday with another 17 co-accused in Mombasa, where prosecutors are expected to ask for him to be detained for 90 days.",
        "The deeply religious Christian-majority country has been stunned by the case and President William Ruto has pledged to take action against unscrupulous churches and cults that have dabbled in criminality.Odero, a fisherman who was born into poverty, draws huge crowds and he has shared the pulpit with prominent Kenyan figures.His church can seat 40,000 people and he is also building a helipad, restaurant and an international school on the expansive grounds.Odero claims \"holy\" scraps of cloth and water sold at his mega-rallies for 100 Kenyan shillings (75 US cents) can heal any disease, including HIV -- provided people have a strong faith."
    ]
}