{
    "articleURL": "/wires/ap/article-12061431/Mexican-high-court-overturns-reforms-rushed-Congress.html",
    "content": [
        "MEXICO CITY (AP) - Mexico´s Supreme Court voted Monday to overturn a pair of electoral law reforms favored by President Andrés Manuel López Obrador because Congress rushed them through to a vote without debate, or even time to read them.",
        "The 9-2 vote threatens López Obrador´s habit of demanding legislators approve bills they often received just a few hours or even minutes before, often late at night or in the early morning hours.Justice Jorge Pardo said of one of the laws approved last year, \"there were not even three hours between the time the bill was sent (to congress) and the time it was voted on.\"The Constitution requires congress to consider and debate any laws it passes. In one case, justices argued that changes were made to the text of one of the bills without telling the legislators before they voted on it.The laws struck down on Monday involved electoral rules limiting partisan activity by politicians who hold public offices. López Obrador had sought to loosen limits on what public servants can say about electoral races, or how they can use government advertising.The president´s office accused the country´s highest court of overstepping its powers. On Sunday - apparently anticipating the ruling - the office claimed the vote \"would violate the separation of powers\" by overring the legislative branch.",
        "The justice argued the legislative branch has to follow its own rules.López Obrador has high approval ratings, and his Morena party and its allies controls majorities in both house of congress. But because the president does not have the two-thirds majorities needed to change the Constitution, he has often resorted to ramming legal changes - some of which violate the Constitution - through the legislature.",
        "The Supreme Court ruling appears to raise the possibility that more recently approved laws could be struck down as well, because they were also rushed through congress.For example, in late April, Mexico´s Senate approved 18 laws, including major changes to mining laws, in a few hours with no debate. The opposition occupied the Senate´s normal headquarters to protest a lack of debate on the measures, so the Morena senators and allies met in an alternative chamber and passed law after law past midnight.The court has already struck down some of the president's favored laws.In April, the Supreme Court ruled that last year´s transfer of the newly created National Guard from civilian to military control was unconstitutional.The vast majority of the National Guard´s members and leadership came from Mexico´s military, but it was described in the Constitution as a force under civilian command and placed under the control of the civilian public security ministry."
    ]
}