{
    "articleURL": "/wires/ap/article-12055875/Mariners-rally-7-runs-8th-inning-Astros-7-5.html",
    "content": [
        "SEATTLE (AP) - What became a wild, memorable eighth-inning rally started innocently. A two-out walk on a 3-2 pitch didn't seem like the precursor to some Seattle Mariners chaos.",
        "Seven runs and 10 batters later, a bit of the chaos ball that helped fuel the Mariners playoff run a season ago had reappeared.J.P. Crawford's two-out, three-run double pulled Seattle even, Jose Caballero followed two batters later with a two-run double, and the Mariners scored seven times in the eighth inning for a 7-5 win over the Houston Astros on Saturday night.Stymied for the first seven innings by Houston starter J.P. France and two relievers, the Mariners erupted against Astros relievers Rafael Montero and Ryne Stanek, with all the damage coming with two outs.\"That eighth inning is us. Take our walks, little hits and then some clutch ones. That´s our baseball,\" Crawford said.Seattle´s rally started when Eugenio Suárez walked on a 3-2 pitch. Cal Raleigh reached on a check-swing dribbler that barely got past the mound and Teoscar Hernández's grounder deep in the hole at shortstop loaded the bases.",
        "\"It started with the walk. Two-out walk, couple of infield hits and it started just like a feeding frenzy,\" Houston manager Dusty Baker said. \"That was tough to take.\"Crawford got the count in his favor and lined a 3-1 fastball to the wall in right-center field clearing the bases.\"There´s certain players that just understand the moment and what the game calls for in that moment,\" Seattle manager Scott Servais said. \"And J.P. is one of those guys.\"",
        "Stanek replaced Montero (0-1) and walked pinch-hitter Taylor Trammell before Caballero lined a shot into the left-center field gap. Caballero had replaced Kolten Wong earlier in the game after he injured his wrist making a diving stop in the field.Julio Rodríguez and Jarred Kelenic also added RBI singles. All told, the Mariners sent 12 batters to the plate in the inning and had seven hits with two outs.\"I'm just trying to do the most I can and just have fun and be in the moment,\" Caballero said.Taylor Saucedo (1-0) pitched the eighth inning for the Mariners and got the unexpected victory. Houston's Jake Meyers had a two-run double off Paul Sewald in the ninth but Mauricio Dubón struck out to end it.The late rally ruined what appeared to be a storybook debut for France. The 28-year-old made his major league debut by throwing five shutout innings, allowing three hits and striking out five.France faced trouble with the bases loaded in the first inning but got consecutive strikeouts to escape the jam.\"By getting out of that first inning, it helped me relax a little bit more. Going through those five innings everything felt good,\" France said.Seattle starter Marco Gonzales threw six innings, allowing three runs on six hits and struck out four. Yordan Alvarez and Jeremy Peña had two-out RBI hits and Kyle Tucker added a sacrifice fly.",
        "FRANCE V. FRANCEWith Seattle batter Ty France and Houston pitcher J.P. France facing off, it was the first time since 1997 a batter and pitcher matched up and both shared the same last name as a country. Per the Mariners, the last time this happened was Sept. 10, 1997 when Ricardo Jordan pitched to Kevin Jordan in a game between the Mets and Phillies.Ty France had two hits off J.P. France.TRAINER´S ROOMAstros: 2B Jose Altuve hit on the field during batting practice for the first time since breaking his right thumb during the World Baseball Classic. ... RHP Ronel Blanco was optioned to Triple A Sugar Land to clear a roster spot for France. The Astros intend to have Blanco stretched out and work as a starter in the minors.Mariners: Wong rolled his wrist while making a diving stop. X-rays were negative. ... Seattle placed right-handed reliever Penn Murfee on the 15-day injured list with a sore right elbow with the hope a few days of rest is all that's needed. RHP Juan Then was recalled from Double-A Arkansas and pitched a perfect seventh inning in his major league debut.UP NEXT Astros: RHP Brandon Bielak (0-0, 4.50) will make his first start of the season after coming on in relief last Monday after Luis Garcia was injured. It will be his ninth career start and first since Sept. 24, 2021.",
        "Mariners: RHP Bryce Miller (0-0, 1.50) makes his second start after throwing six innings allowing one run and striking out 10 against Oakland in his debut. ___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}