{
    "articleURL": "/femail/article-12057013/Prince-Wales-reveals-looking-forward-seeing-Katy-Perry-Coronation-Concert.html",
    "content": [
        "Prince of Wales, 40, revealed who he is most exited to see perform in Windsor Follow all the latest royal news and updates on Coronation events hereThe Prince of Wales has revealed he is looking forward to seeing Katy Perry perform at tonight's Coronation Concert. ",
        "The royal, 40, made the admission during a surprise walkabout with his wife the Princess of Wales in Windsor this afternoon ahead of the event.As he was asked by a royal fan who he was most looking forward to see during the star-studded event, which will start at 8pm tonight, the father-of-three revealed he was excited to watch the California Gurls artist onstage. William was also handed a can of 'Return of the King', a specially brewed organic 'Coronation ale' during the walkabout. He looked absolutely thrilled, and Kate smiled as her husband told the well-wisher he'd save it for later. Millions will be watching at home tonight but tens of thousands have been in Windsor since early this morning to see Lionel Richie, Katy Perry and Take That perform in the historic bash.",
        "Speaking to a royal fan, Prince William revealed: 'I am looking forward to seeing Katy Perry. 'I think they'll be a few Lionel Richie fans in here, but I'm looking forward to Katy Perry,' he added, with a cheeky smile.  The Prince and Princess of Wales greeted people for around half an hour on the Long Walk at Windsor Castle earlier today. William - dressed in a navy suit - took selfies and hugged members of the public. The prince was seen making jokes and asking children how old they are.",
        "Kate, dressed in a light blue blazer, dark trousers and white Vega trainers, also greeted crowds and thanked members of the public who told her she looked amazing at the coronation.The couple told people to enjoy their picnics and told well-wishers they were so thankful the sun had come out for them.To the delight one little girl, the Princess of Wales crouched down to speak to her and admire her deely bopper headband.But it seemed like the excitement of meeting a real-life Princess was just too much for the young royal fan to bear - with the youngster bursting out into tears immediately.",
        "Catherine appeared to ask her if she would like a cuddle - to which she immediately replied: 'yes please.'The charming moment was all caught on camera by the little girl's mother, who also appeared to be overwhelmed with emotion.The Princess, wearing a powder-blue blazer, then bid the family goodbye and moved on to meet others in the crowd - including more lucky children who were overjoyed to also be offered a hug.Scores of people crowded around the Prince and Princess of Wales in Windsor, with William crouching down to chat to a boy and girl wearing golden crowns. The prince and princess looked relaxed, with William telling one group of well-wishers: 'Enjoy the concert tonight.'",
        "The couple's appearance came shortly after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were 'deeply touched' by the nation's celebration of their historic coronation.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he saidHeir to the throne William is to take to the stage to deliver a speech during the musical extravaganza in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.",
        "The King, Queen and royal family will join around 20,000 members of the public at the musical extravaganza to see performances by Take That, Katy Perry and Lionel Richie.Kate Middleton greeted fans dressed in a pale blue blazer, while Prince William opted for a darker shade as he shook hands with those gathered outside the castle. Alongside the thousands of smaller street parties expected to be held at the weekend, people are encouraged to come together across the country for the Coronation Big Lunch.",
        "In Cranleigh, the Duke and Duchess of Edinburgh will join residents and representatives from the Royal British Legion, the Scouts and the Guides - of which Sophie is president.Elsewhere, the Princess Royal and Vice Admiral Sir Tim Laurence will visit a community street party in Swindon, and Princess Beatrice and Princess Eugenie will join a big lunch in Windsor. Members of the public and organisers from a number of charities across the UK have expressed their enthusiasm ahead of the event. "
    ]
}