{
    "articleURL": "/wires/reuters/article-12050583/Howe-calls-Newcastle-ignore-four-rivals-league-run-in.html",
    "content": [
        "May 5 (Reuters) - Newcastle United must focus on themselves as they look to navigate a complicated run-in and seal a return to the Champions League for the first time in 20 years, manager Eddie Howe said ahead of Sunday's Premier League home game against Arsenal.",
        "Newcastle are third in the standings with 65 points, two ahead of fourth-placed Manchester United and six in front of Liverpool, who are fifth having played one more game.The Magpies are aiming to finish in the top four but face a tricky climax to the season, with in-form Brighton &amp;amp; Hove Albion and relegation-battling Leeds United and Leicester City plus Chelsea and second-placed Arsenal in their remaining fixtures.\"All season we haven't focused on where we are, who's around us, the form of teams - we've just focused on ourselves and that's all we can do,\" Howe told reporters ahead the Arsenal match.\"We have a tough run of fixtures but I think at the same time a great run of fixtures because every game is important. They're great occasions and we look to carry on our good form.\"We're competing against elite teams who will fight to the end and we have to do the same. In our five games we need to give our best preparation and focus because the fight we're in could go right to the end of the season.\"Newcastle last faced Arsenal in a fiery 0-0 draw in January, after which the Londoners were fined 40,000 pounds ($50,428.00) for failing to control their players and their manager Mikel Arteta attracted criticism for an angry exchange with Howe.",
        "Howe said the clash was a closed chapter, adding that he had a lot of respect for the \"incredible job\" Arteta had done at Arsenal.\"Within a game you will always have moments where you come up against opponents and there is a bit of confrontation. That is natural and part of the job. No issues from my side,\" Howe said.\"Whatever happens it will be a great spectacle between two really good teams.\"Howe added that winger Allan Saint-Maximin may be available after a hamstring injury, adding: \"Allan has trained. He trained yesterday and it was great to see him back on the grass.\"He trained very well too so I'm really pleased with that.\"Sean (Longstaff) is OK. He's improved but he hasn't trained yet. We're hoping either today or tomorrow he will but we'll wait and see,\" he said of the midfielder.($1 = 0.7932 pounds) (Reporting by Aadi Nair in Bengaluru; Editing by Ken Ferris)"
    ]
}