{
    "articleURL": "/wires/aap/article-12044755/Bird-flies-NSW-nest-Blues-reclaim-own.html",
    "content": [
        "NSW have taken the first step towards bringing their homegrown talent back to Sydney and rebuilding the Blues, landing Jackson Bird on a two-year deal.",
        "Winless in the Sheffield Shield last year and off the back of the worst season in the state's history, NSW are desperate to turn things around this summer.Cricket NSW are well aware they have produced more than one-third of male players with domestic or national contracts in Australian cricket.Hence senior NSW officials have labelled their results as unacceptable.The Blues did not win a game in the Sheffield Shield last summer and have tasted victory in only two of their seven 50-over matches.The results led to Phil Jaques being axed as coach last November, with Cricket NSW yet to appoint a full-time replacement.In Bird, they have brought their first elite player back to the state.The former Test seamer grew up in Sydney but had to move to Hobart to get a chance in domestic cricket.The 36-year-old is the Tigers' leading wicket-taker in Sheffield Shield, with 350 at an average of 21.99, and topped the charts for the state again last year.\"I played all my junior cricket in NSW and like any other aspiring professional in the state I wanted to pull on a Baggy Blue,\" Bird said.\"My career took a different path and I am very grateful to Cricket Tasmania and everyone that I have played with and worked with down there.",
        "\"Now it's a fresh start in a place I am familiar with, and I am looking forward to being able to contribute on the field and also around the playing group.\"The Blues have some very talented young bowlers and I hope I can offer them some guidance if they need it.\"Bird's signing comes after NSW announced earlier this week former women's international Sarah Coyte would return home to the Breakers from Tasmania.For so long the pinnacle of the women's game with 24 straight appearances in the final, NSW finished sixth last season and have not made the final since 2019-20.Coyte was the leading wicket-taker in the Women's National Cricket League last year and claimed 3-2 in the last over of the final to lead Tasmania to a one-run win over South Australia.Elsewhere, Ben McDermott will also leave Tasmania to return home to Queensland, while the Tigers have signed opening batter Jake Weatherald from South Australia."
    ]
}