{
    "articleURL": "/wires/reuters/article-12050525/Al-Hilal-coach-Diaz-ignoring-Messi-speculation-focus-Asian-final.html",
    "content": [
        "By Michael Church",
        "TOKYO, May 5 (Reuters) - Al Hilal coach Ramon Diaz refused to be drawn on claims the Saudi Arabian club are attempting to sign Lionel Messi as he focused on his side's clash with Urawa Red Diamonds in the second leg of the Asian Champions League final on Saturday.Messi has been linked with a lucrative move to the four-time Asian champions when his contract with Paris St Germain expires at the end of the season, with the proposed move coming after Cristiano Ronaldo's switch to Riyadh's Al Nassr in January.Diaz, however, stressed his sights are fixed on the meeting with Urawa at Saitama Stadium in the continental club final rather than the future of Argentina's World Cup-winning captain.\"Now we're focused on the game,\" said Diaz, whose side were held to a 1-1 draw in the first leg in Riyadh last week. \"We have the final and after the final we'll see what's going to happen.\"Al Hilal are chasing a record-extending fifth Asian Champions League success and are the holders after defeating Pohang Steelers in the 2021 final.Urawa hold a slim advantage through Shinzo Koroki's away goal and Al Hilal will go into the game without the suspended Salem Al Dawsari, who scored in the first leg before being sent off late in the game.",
        "Captain Salman Al Faraj is also expected to miss the game due to injury but Diaz is confident his team have the experience to overcome the loss of the influential duo.\"We have a big team and we are going to face a lot of fans here, but we're used to it,\" he said.\"This team won the Asian Champions League twice (in the last three editions). This is the third time, this is our target to bring this home.\"We're going to try to concentrate and not have any mistakes like the one that happened in Riyadh to cause the goal,\" he added after Al Hilal defender Ali Al Bulayhi's attempted interception hit the post and rebounded to Koroki who scored.\"We're an experienced team. The players have played in many situations like this and we're looking forward to winning this trophy.\" (Reporting by Michael Church, Editing by Ken Ferris)"
    ]
}