{
    "articleURL": "/wires/ap/article-12052245/Maryland-police-Attackers-tried-shoot-boy-school-bus.html",
    "content": [
        "OXON HILL, Md. (AP) - Three masked attackers boarded a school bus in Maryland earlier this week and tried multiple times to shoot a boy, but the attack was foiled by a malfunctioning gun, police said.",
        "The bus stopped in Oxon Hill, a suburb of the nation's capital, to drop off students just before 5 p.m. Monday, when three people believed to be juveniles got on and began to attack the boy, who had remained on the bus, Prince George´s County Police said in a news release.One attacker tried multiple times to shoot the boy, but detectives believe the gun malfunctioned, police said. The boy suffered minor injuries in the assault.A bus driver and bus aide were on the bus at the time and weren´t injured, police said. It's unknown if any other students were on the bus. Police found ammunition on the bus. Police said they're investigating the attackers' motives.No suspects were in custody Friday and a reward of up to $2,500 is being offered in the case, police spokesperson Lt. Shaniece Singh said by telephone.Images from the attack on the bus released by police show three people dressed in black hoodies with their faces covered attacking the boy, who is covering his head with his hands.Prince George´s County Public Schools spokesperson Meghan Gebreselassie said in a statement that officials are \"horrified by this incident and grateful that no lives were lost.\" Keeping people safe in classrooms and on school grounds and buses is their \"highest priority\" and they´ll continue working with law enforcement, she said.",
        "Martin Diggs, president of ACE-AFSCME Local 2250, a union representing school support staff, said the driver is \"totally terrified\" by what happened. Fights and incidents involving weapons at schools have left drivers alarmed, Diggs said.\"There was a small amount of people on this bus,\" he said. \"What if there was a busload of kids?\""
    ]
}