{
    "articleURL": "/wires/ap/article-12054895/Chris-Strachwitz-founded-Arhoolie-label-dies-age-91.html",
    "content": [
        "NEW YORK (AP) - Chris Strachwitz, a producer, musicologist and one-man preservation society whose Arhoolie Records released thousands of songs by regional performers and comprised an extraordinary American archive that became known and loved worldwide, has died. He was 91.",
        "Strachwitz, recipient in 2016 of a Grammy Trustee Award, passed away Friday from complications with congestive heart failure at an assisted living facility in the San Francisco Bay Area's Marin County, the Arhoolie Foundation said Saturday.Admired by Bob Dylan, Bonnie Raitt and many others, Strachwitz was an unlikely champion of the American vernacular - a native German born into privilege who fell deeply for his adopted country´s music and was among the most intrepid field recorders to emerge after Alan Lomax.He founded Arhoolie in 1960 and over the following decades traveled to Mississippi, Texas and Louisiana among other states on a mission that rarely relented: taping little-known artists in their home environments, be it a dance hall, a front porch, a beer joint, a backyard.\"My stuff isn't produced. I just catch it as it is,\" he explained in the 2014 documentary \"This Ain't No Mouse Music.\"The name Arhoolie, suggested by fellow musicologist Mack McCormick, is allegedly a regional expression for field holler.",
        "Ry Cooder would call him \"El Fanatico,\" the kind of true believer for whom just the rumor of a musician worth hearing would inspire him to get on a bus and ride hundreds of miles - like the time he sought out bluesman Lightnin' Hopkins in Houston. Strachwitz amassed a vast catalog of blues, Tejano, folk, jazz, gospel and Zydeco, with Grammy winners Flaco Jimenez and Clifton Chenier among those who later attracted wider followings. An Arhoolie 50-year anniversary box set featured Maria Muldaur, Taj Mahal, Savoy Family Band and Cooder, who would cite the Arhoolie release \"Mississippi´s Big Joe Williams and His Nine-String Guitar\" as an early inspiration.",
        "\"It just jumped out of the speaker on this little school record player,\" Cooder told NPR in 2013, adding that he decided \"once and for all\" to become a musician. \"I´m gonna do this, too. I´m gonna get good on guitar, and I´m gonna play it like that.\"Strachwitz despised most commercial music - \"mouse music,\" he called it - but he did have just enough success to keep Arhoolie going. In the mid-1960s, he recorded an album in his living room for no charge by Berkeley-based folk performer Joe McDonald, who in turn granted publishing rights to Arhoolie. By 1969, McDonald was leading Country Joe McDonald and the Fish and one song from the Arhoolie sessions, the anti-war anthem \"I-Feel-Like-I´m-Fixin´-to-Die Rag,\" was a highlight of the Woodstock festival and soundtrack.Arhoolie releases were cherished by blues fans in England, including Keith Richards of the Rolling Stones. Around the same time Strachwitz met with McDonald, he taped more than a dozen songs by bluesman \"Mississippi\" Fred McDowell, including McDowell's version of an old spiritual, \"You Gotta Move.\" The Stones sang a few lines from it during the 1970 documentary \"Gimme Shelter\" and recorded a cover that appeared on their acclaimed 1971 album \"Sticky Fingers.\" Strachwitz prevailed over the resistance of the band´s lawyers and ensured that royalties were given to McDowell, who was dying of cancer.",
        "\"I was able to give Fred McDowell the biggest check he´d ever seen in his life,\" Strachwitz later said.In 1993, Arhoolie was boosted again when country star Alan Jackson had a hit with \"Mercury Blues,\" a song co-written and first performed by K.C. Douglas for the label.Besides his Grammy, Strachwitz received a lifetime achievement award from the Blues Symposium and was inducted as a non-performing member of the Blues Hall of Fame. In 1995, Strachwitz established the Arhoolie Foundation to \"document, preserve, present and disseminate authentic traditional and regional vernacular music,\" with advisers including Dylan, Bonnie Raitt and Linda Ronstadt. In 2016, Strachwitz sold his majority interest in the record label to Smithsonian Folkways Recordings, part of the national museum in Washington.\"The ripple effect of Chris Strachwitz in the world of is immeasurable in preserving this music,\" Raitt, a longtime friend, told the podcast The Kitchen Sisters Present in 2019.The son of wealthy farm owners, he was born Count Christian Alexander Maria Strachwitz in the German region of Silesia, now part of Poland. His family, displaced at the end of World War II, moved to the United States in 1947, eventually settling in Santa Barbara, California. Strachwitz had already been exposed to swing overseas through Armed Forces Radio and became a jazz fan after seeing the movie \"New Orleans,\" a 1947 musical featuring Louis Armstrong and Billie Holiday. He also felt a strong kinship with country and other forms of \"hillbilly music.\"",
        "\"I felt it all had this kind of earthiness to it that I didn´t hear in any other kind of music. They sang about how lonesome you are, and how you miss your girlfriend and all this other thing,\" Strachwitz told NPR. \"Those songs really spoke to me.\"By his early 20s, he was taping local radio and live performances and he perfected his craft while attending the University of California at Berkeley. He served two years in the Army, completed his studies at Berkeley through the GI Bill and, starting in the late 1950s, taught high school for a few years in Los Gatos, California.Often short on money, Strachwitz sold pressings from his collection of old 78s to support his early recording efforts. Arhoolie's first release was Mance Lipscomb´s \"Texas Sharecropper and Songster,\" for which Strachwitz and friends personally assembled 250 copies.\"So much of pop music has all this slop added, with this mush background that I can´t even call music,\" he said in a 2013 interview with the online publication waytooindie.com. \"You can hardly hear the voices! They bury the voices. If somebody wants to sing, sing god damn it! You know? In the old days, you could hear them sing.\""
    ]
}