{
    "articleURL": "/wires/aap/article-12049909/Pub-Tabcorp-charged-16-year-olds-alleged-betting.html",
    "content": [
        "A Melbourne pub is facing fines of almost $222,000 after a teenager was allegedly allowed to gamble.",
        "The gambling watchdog on Friday alleged staff at the Preston Hotel allowed a 16-year-old to access electronic terminals and place bets on six occasions in May and September last year.The watchdog has slapped the pub in Melbourne's northeast with 15 charges, including six counts of allowing a minor to gamble and six counts of failing to reasonably supervise its electronic betting terminals.The venue also faces three counts of allowing a minor to enter a gambling machine area, with the offences attracting a total maximum fine of $221,904.The Victorian Gambling and Casino Control Commission has also charged Tabcorp, Australia's largest gambling company, as the holder of the statewide wagering and betting licence.The company faces eight charges, including four counts of allowing a minor to gamble and four counts of failing to reasonably supervise a gambling vending machine.Tabcorp could be hit with fines totalling a maximum of almost $104,000 over the 16-year-old's alleged gambling, the watchdog said.The Victorian Gambling and Casino Control Commission was tipped off about the minor allegedly being allowed to gamble.Other venues were also investigated.\"It is deeply concerning ... all gambling operators - including venues and the holder of the statewide Wagering and Betting licence - have an irrefutable legal requirement to do everything they can to stop children from gambling,\" commission gambling director Glorija Kuzman said.",
        "\"One of the most serious harms is minors gambling.\"A Tabcorp spokesman said the company was taking the matter very seriously.\"We're very focused on managing the unique challenges of cash betting and continue to invest in this area to protect minors by stopping our equipment from being used in this way,\" he said.The watchdog urged people who may be concerned they witnessed a minor gambling to contact them.The Preston Hotel has been contacted for comment."
    ]
}