{
    "articleURL": "/wires/reuters/article-12055023/Thousands-Albertans-evacuated-unprecedented-wildfire-situation.html",
    "content": [
        "By Maiya Keidan",
        "TORONTO, May 6 (Reuters) - Tens of thousands of Albertans have been forced to evacuate their homes as \"unprecedented\" wildfires rage on in Alberta, Premier Danielle Smith, head of the ruling United Conservative Party (UCP), said at a press conference on Saturday.As of Saturday at 9:30 a.m. Mountain Time (11:30 a.m. ET), 24,511 Albertans were evacuated from homes with 103 active wildfires across the province, burning 121,909 hectares.\"Much of Alberta has been experiencing a hot, dry spring and with so much kindling, all it takes is a few sparks to ignite some truly frightening wildfires,\" said Smith. \"These conditions have resulted in the unprecedented situation our province is facing today.\"There have been 45 new fires started since 11 a.m. Mountain Time on Friday, and 5,200 Albertans under an evacuation alert.Among the communities evacuated was Brazeau County, including all 7,000 people living in Drayton Valley, 140 km (87 miles) west of the province's capital Edmonton.The entire community of Fox Lake was also among the evacuees, where the 1,458-hectare (3609-acre) Fox Lake fire consumed 20 homes and the police station.\"I don't know that I ever recall seeing multiple communities evacuated all at once in fire season,\" said Smith.She said C$1.5 billion ($1.12 billion) is put aside as a contingency because they know a significant amount could need to be spent on emergency management,",
        "Smith said the province will make a decision later on Saturday regarding whether to declare a provincial state of emergency.Whitecap Resources, an oil producer operating in northwestern and central Alberta, said it has been busy ensuring staff are safe through the evacuation process and assets are unaffected.\"(We are) monitoring closely and praying for rain,\" Grant Fagerheim, Whitecap CEO, said on Saturday.Pembina Pipeline Corp, which runs oil-gathering pipelines in the region, on Friday said it had activated emergency response and incident management processes and is \"evaluating any current or anticipated operational impacts.\"Pembina did not respond to a request for an update on Saturday.So far this year, there have been 43,000 hectares burned from wildfires, Smith said.\"It is very unusual for us to see this much fire activity this early in the season,\" said Christie Tucker, an information unit manager for Alberta Wildfire.\"This is a much much busier than average wildfire season so far.\"Voters in Alberta will go to the polls on May 29 to elect a new government. Smith said people should expect election day will go ahead as planned.($1 = 1.3373 Canadian dollars) (Reporting by Maiya Keidan; Editing by Chizu Nomiyama)"
    ]
}