{
    "articleURL": "/wires/reuters/article-12045045/Royals-Orioles-square-rubber-match-series.html",
    "content": [
        "Kansas City aims for a home series win on Thursday in the finale of a three-game set against the visiting Baltimore Orioles.",
        "The Royals scored their first shutout since last September on Wednesday to even the series, getting four innings from the bullpen after a strong start for veteran Zack Greinke.Greinke, the six-time All-Star and 2009 Cy Young Award winner, threw 33 strikes in his 44-pitch workload en route to his first win since last August.With Greinke and a quartet of relievers shutting the Baltimore bats down, Kansas City capitalized at the plate off 13 hits -- six of which came from Nick Pratto and Vinnie Pasquantino, who both went 3-for-4.\"We've got a lot of tough luck the last couple weeks. It was just cool to see it all come together,\" Pratto told Bally Sports Kansas City in his postgame interview.\"It's not about tonight, it's about what we do going forward,\" Pasquantino told reporters in his postgame availability. Pasquantino hit his sixth home run of the season and had a pair of doubles on Wednesday. \"Same thing I said after losses, we play tomorrow. So we're on to tomorrow.\"Pasquantino has a hit in each of his last three games, and Wednesday marked his third game with three or more hits since April 24. He is batting .292 after the standout performance in Wednesday's win.Baltimore, meanwhile, opened the series on Tuesday deluging the Royals with 11 runs -- one shy of its season high. The shutout endured on Wednesday, however, marked the Orioles' first scoreless showing of the season.",
        "\"Greinke's really around the plate a lot. He's not going to walk people. I thought we saw some good pitches to hit, it just wasn't our night offensively,\" Orioles manager Brandon Hyde said in his postgame media availability.Baltimore mustered six hits on Wednesday, nine fewer than in Tuesday's win. Of the six in the loss, however, one came from Adley Rutschman. Rutschman went 4-for-5 on Tuesday, his third multiple-hit outing since April 27, and is on a four-game hitting streak going into Thursday.The Orioles aim to reignite their offense against Jordan Lyles (0-5, 6.11 ERA), who gets the start for the Royals in the series finale.The right-hander Lyles seeks his first win of 2023, returning to the mound from his worst start of the campaign.He lasted only four innings last Friday, walking four and giving up seven earned runs at Minnesota. Lyles' ERA jumped from 4.88 to 6.11 with the poor start.Thursday is Lyles' first appearance at home since he pitched a season-high eight innings in a 4-0 loss to Texas on April 17.Lyles last faced Baltimore as a member of the Rangers, going 6 2/3 innings with four strikeouts and three earned runs in September 2021.Grayson Rodriguez (1-0, 4.07) takes the mound for Baltimore, coming off scoring his first career win in a nine-strikeout, two-hit performance last Saturday at Detroit. Rodriguez has gone his last two starts, both against the Tigers, without giving up a run.",
        "The rookie right-hander has 34 strikeouts on the season, with at least six in each of his last four appearances. Thursday is his first career matchup with Kansas City.--Field Level Media"
    ]
}