{
    "articleURL": "/wires/ap/article-12046929/Sheriff-Last-4-escaped-Mississippi-prisoners-found.html",
    "content": [
        "CRYSTAL SPRINGS, Miss. (AP) - The last of four inmates who escaped from a Mississippi prison was found Thursday morning at a home not far from the detention center, the sheriff announced.",
        "Corey Harrison, 22, was taken into custody at a home in Crystal Springs, about 20 miles (32 kilometers) from the prison. A female acquaintance was also arrested and is facing charges in connection with the escape and investigation, Hinds County Sheriff Tyree Jones said on social media.Jones thanked the \"state, federal and local law enforcement agencies that assisted with the tense days long investigation and search regarding the escapees. All escapees are accounted for.\"Harrison and three other inmates escaped from the Raymond Detention Center near Jackson, Mississippi´s capital, on April 22, officials said.Casey Grayson was found dead at a New Orleans truck stop over the weekend, officials announced earlier this week. His cause of death will not be determined until results from an autopsy report are returned. Investigators have not found any signs of foul play, Jones said.Dylan Arrington died after barricading himself in a central Mississippi home and setting it on fire during an armed standoff with deputies on April 26. He is suspected of killing 61-year-old Anthony Watts and stealing his truck after the escape. Jerry Raynes was arrested on April 27 after allegedly stealing a public works vehicle and fleeing to Texas.",
        "In July, U.S. District Judge Carlton Reeves ordered a rare takeover of the Raymond jail after he said deficiencies in supervision and staffing led to \"a stunning array of assaults, as well as deaths.\" But before the appointed receiver was scheduled to assume control over the jail on Jan. 1, the U.S. 5th Circuit Court of Appeals stayed the lower court´s order until it ruled on the county´s motion for reconsideration."
    ]
}