{
    "articleURL": "/wires/reuters/article-12045583/Girl-wounded-Serbia-school-shooting-critical-doctor-says.html",
    "content": [
        "BELGRADE, May 4 (Reuters) - A schoolgirl wounded in the mass school shooting in Serbia's capital, Belgrade, was in critical condition on Thursday with a gunshot wound to the head, the director of a Belgrade paediatric hospital said.",
        "Police said the suspected shooter, a 13-year-old boy, surrendered on Wednesday after eight pupils and a security guard were killed in their school.\"The girl who underwent an urgent surgery yesterday due to head injuries ... remains in critical condition and in intensive care,\" Sinisa Ducic, the Tirsova hospital's acting director, told reporters.\"The doctors are doing everything possible to save her life but her general condition is severe,\" he said.Mass shootings in Serbia are rare and this was the first-ever school shooting in the Balkan country.A teacher and six pupils were wounded. They are being treated in the Tirsova hospital and the city's University Hospital.Two wounded boys in the Tirsova hospital were in stable condition and were expected to be discharged in coming days, Ducic said.\"Parents have visited the boys, a psychologist is involved, they are in touch with their parents over the phone,\" Ducic said.The suspected shooter used two pistols that belonged to his father, police said on Wednesday.The guard and three girls were shot in a hallway. A teacher and pupils in a history class were then shot, police said.Serbia will hold three days of national mourning from Friday.President Aleksandar Vucic announced on Wednesday a moratorium on new gun licenses other than for hunting, a revision of existing permits, enhanced surveillance of shooting ranges and of how members of the public store their weapons.",
        "The suspected shooter is under Serbia's age of criminal responsibility. He has been in a psychiatric institution for an evaluation, Vucic told reporters on Wednesday, adding the suspect's parents had been arrested. (Reporting by Aleksandar Vasovic; Editing by Robert Birsel)"
    ]
}