{
    "articleURL": "/wires/pa/article-12053849/Coronation-postbox-vandalised-republican-stickers-graffiti-eggs.html",
    "content": [
        "A postbox decorated in celebration of the King’s coronation has been covered with pro-republican stickers, graffiti and eggs.",
        "The Royal Mail box in Cardiff city centre was targeted earlier this week, hours after it was unveiled, although stickers placed on it were swiftly removed.",
        "But the red, white and blue box, adorned with the coronation emblem and Union flag, was vandalised again, with new pictures emerging on Saturday morning.The box was one of four across the UK to be repainted ahead of the King’s crowning.",
        "Its location outside the historic Owain Glyndwr pub in St John Street has attracted criticism from some members of the public and campaign groups.The pub is named after the Welsh hero who led a 15-year revolt against English rule in the late Middle Ages. Glyndwr is often referred to as “the last Prince of Wales” and is seen as a symbol of Welsh nationalism.Welsh independence stickers, including from campaign group Yes Cymru, and graffiti reading “Cymru” were on the box on Saturday morning.Other stickers reading “Ble mae’r Gymraeg?” – meaning “Where’s the Welsh?” – are from Cymdeithas Yr Iaeth Gymraeg (the Welsh Language Society) which is a direct action pressure group founded in the 1960s.",
        "It was among the groups that protested against Charles’s investiture as Prince of Wales at Caernarfon Castle in 1969.A number of eggs were thrown at the box, with shells and yolks left surrounding its base.",
        "The box is a short distance from Cardiff Castle where a public screening of the coronation ceremony and a military gun salute is taking place to mark the occasion.A “Not My King” protest held by Cymru Republic will take place in the Welsh capital from 12.30pm followed by a Big Republican Lunch in Bute Park.It will coincide with similar anti-monarchy protests expected to take place across the UK during the coronation."
    ]
}