{
    "articleURL": "/wires/reuters/article-12056271/Arab-League-set-readmit-Syria-relations-Assad-normalise.html",
    "content": [
        "Syria had been suspended from League since 2011",
        "Some states sought conditions for Syria's returnU.S. official says Syria does not merit readmissionQatar says no change in position on normalising ties(Adds Russian reaction, paragraphs 9-10)By Aidan Lewis and Sarah El SaftyCAIRO, May 7 (Reuters) - The Arab League readmitted Syria on Sunday after more than a decade of suspension, consolidating a regional push to normalise ties with President Bashar al-Assad in a move criticised by Washington.The decision said Syria could resume its participation in Arab League meetings immediately, while calling for a resolution of the crisis resulting from Syria's civil war, including the flight of refugees to neighbouring countries and drug smuggling across the region.While Arab states including the United Arab Emirates have pressed to end Assad's isolation, some have been opposed to full normalisation without a political solution to the Syrian conflict, seeking conditions for Syria's return.Qatar, which had previously opposed Syria's return to the League, said its position on normalisation had not changed and it hoped regional consensus on Syria could be \"a motive for the Syrian regime to address the roots of the crisis\", a foreign ministry spokesperson told state news agency QNA.\"The reinstatement of Syria does not mean normalisation of relations between Arab countries and Syria,\" Arab League Secretary-General Ahmed Aboul Gheit told reporters in Cairo. \"This is a sovereign decision for each country to make.\"",
        "Syria called on Arab states to show \"mutual respect\".A U.S. State Department spokesperson said Washington shared the goals of Arab partners in Syria, including building security and stability, but remained \"sceptical of Assad's willingness to take the steps necessary to resolve Syria's crisis\".\"We do not believe Syria merits readmission into the Arab League at this time,\" the spokesperson said, adding that U.S. sanctions would remain in full effect.But Russia, an Assad ally, hailed Syria's readmission.\"Moscow welcomes this long-awaited step, the logical result of the process, which has gained momentum, of returning Syria to the 'Arab family,'\" Maria Zakharova, spokesperson for Russia's Foreign Ministry, said in a statement.CAPTAGON TRAFFICKINGSunday's decision said Jordan, Saudi Arabia, Iraq, Lebanon, Egypt and the Arab League's Secretary General would form a ministerial group to liaise with the Syrian government and seek solutions to the crisis through reciprocal steps.Practical measures included continuing efforts to facilitate the delivery of aid in Syria, according to a copy of the decision seen by Reuters.Syria's readmission follows a Jordanian initiative laying out a roadmap for ending Syria's conflict that includes addressing the issues of refugees, missing detainees, drug smuggling and Iranian militias in Syria.Jordan is both a destination and a main transit route to the oil-rich Gulf countries for captagon, a highly addictive amphetamine produced in Syria, and has hinted it could take unilateral action to curb the multi-billion dollar trade.",
        "A Jordanian official said Syria would need to show it was serious about reaching a political solution, since this would be a pre-condition to lobbying for any lifting of Western sanctions, a crucial step for funding reconstruction in Syria.Syria's membership of the Arab League was suspended in 2011 after the crackdown on street protests against Assad that led to the civil war. Several Gulf states including Saudi Arabia began backing rebel groups fighting to oust Assad from power.Assad later regained control over much of Syria with the help of his main allies Iran and Russia, but the war cost hundreds of thousands of lives and led millions to flee the country. Syria remains splintered with its economy in ruins.Recently, Arab states have been trying to reach consensus on whether to invite Assad to an Arab League summit on May 19 in Riyadh to discuss the pace and conditions for normalising ties.Responding to a question over whether Assad could participate, Aboul Gheit told reporters: \"If he wishes, because Syria, starting from this evening, is a full member of the Arab League.\"Saudi Arabia had long resisted restoring relations with Assad but said after its recent rapprochement with Iran - Syria's key regional ally - that a new approach was needed with Damascus. (Additional reporting by Hatem Maher and Nayera Abdallah in Cairo, Suleiman al-Khalidi in Amman, Andrew Mills in Doha and Humeyra Pamuk in Washington, and Elaine Monaghan; Editing by Angus MacSwan, David Holmes and Lisa Shumaker)"
    ]
}