{
    "articleURL": "/news/article-12051725/Palace-releases-map-inside-Westminster-Abbey-revealing-Charles-crowned-tomorrow.html",
    "content": [
        "The graphic is mapped onto an image looking across Westminster AbbeyAnd it shows the Coronation Chair sitting ready for the big moment tomorrowFeatures Stone of Destiny, Throne Chairs, Chairs of Estate and Cosmati PavementBuckingham Palace has released a map of inside Westminster Abbey - showing where the King will be crowned tomorrow.",
        "The graphic is mapped onto an image looking across the royal church - with the Coronation Chair sitting ready for the big moment.Tomorrow, Charles III will be crowned as the UK's reigning monarch as huge crowds flock to London to witness the historic moment.With the Coronation Chair at its centrepiece, the scene will also feature the Stone of Destiny, the Throne Chairs, the Chairs of Estate and the Cosmati Pavement.The Coronation Chair - which has been at the heart of the ceremony for over 700 years - is where the King will sit to be anointed by the Archbishop of Canterbury.",
        "While seated, he will also recieve the regalia - the Crown Jewels - and be crowned. Normally kept safely in the Tower of London, they are sacred and secular objects symbolising the responsabilities the monarch must uphold.Made of oak and originally covered in gold leaf with elaborate decorations of coloured glass, the throne is considered an unparalleled surviving example of medieval art – although its back is scarred with graffiti from the 18th and 19th centuries.The Stone of Destiny sits beneath the chair - which was specially designed to hold the sacred rock.It was specially transported under tight security from Scotland last week.Also known as the Stone of Scone, it is an ancient symbol of Scotland's monarchy which has been used for centuries to inaugurate kings.",
        "Its earliest origins unknown, it was said to be used by the biblical Jacob as a pillow and later kept in King Solomon's temple.It was brought to England from Scotland on the orders of King Edward I in 1296.It has been stored in the Great Hall of Edinburgh Castle since 1996 - but back in 1296, King Edward I of England seized the stone from the Scots, and had it built into a new throne at Westminster.",
        "The stone is more fragile than it appears, thanks to the fact that it was dropped when it was stolen from Westminster Abbey on Christmas Day in 1950 and had to be repaired.It was taken in a daring raid by Scottish nationalists Ian Hamilton, Gavin Vernon, Kay Matheson and Alan Stuart.Unprepared for its hefty weight, the group dropped it during the theft and it split in two.Amid a huge manhunt that led to the closure of the England-Scotland border, the two parts were spirited back north separately before being repaired.The police tracked the gang down when they discovered that Mr Hamilton had taken out books about the Stone and Westminster Abbey from Glasgow Mitchell Library. In September, spoon bender Uri Geller urged Scotland to return the Coronation Chair - saying the relic would give his reign 'positive power'.",
        "The Chairs of Estate will be positioned to the south side of the High Altar, and will be the focus of most of the Coronation's action.",
        "They will also be where the Queen Consort, Camilla, is crowned.The King and Queen decided to use existing chairs held by the Royal Collection as the Chairs of Estate, which were made in 1953 by the London firm White, Allom and Company for the coronation of Queen Elizabeth II. One was used by the Queen during the ceremony, with a matching ‘companion’ chair later made for the late Duke of Edinburgh.Made from carved and gilded beechwood in 17th century style, they bore the cyphers of Elizabeth and Philip, as well as the national emblems of a rose, thistle and shamrock.Conservators have cleaned and restored the seats to the same pattern in which they were originally upholstered. However, the cyphers of the King and Queen Consort have replaced those of Elizabeth and Philip, which will be kept in the Royal Collection.The new cyphers have been hand-embroidered by the Royal School of Needlework using cloth of gold and matching metallic thread, but the original braid and trimmings have been reused.The King and Queen's Throne Chairs - which are also known as the Chairs of State - sit behind the Coronation Chair.",
        "Here, the King will recieve homage from the Archbishop of Canterbury and the Prince of Wales.",
        "They were first used by King George VI and his wife, Queen Elizabeth, in 1937. The King has recycled the original royal coats of arms that were on the front and back of the chair for King George VI in a touching nod to his grandfather. The Queen Consort has an identical chair, used by Queen Elizabeth, but her own coats of arms have replaced those of the Queen Mother.Caroline de Guitaut, of the King’s Works of Art at the Royal Collection Trust, praised the King’s ‘incredibly efficient and sustainable’ way of doing things.Alongside the famous seats, the King has commissioned 100 chairs using sustainable British oak for members of the Royal Family and VIP guests, as well as ‘ordinary’ members of the congregation. In a first, these chairs will be auctioned off later this year for several charities close to Their Majesties’ hearts including ones supporting the homeless and victims of domestic violence.And the ceremony will take place on the stunning Cosmati Pavement - which was laid in 1258 by order of Henry III - who is entombed in Westminster Abbey.The elaborate mosaic inspired elements of the design for the King's Anointing Screen.",
        "The specially commissioned an ornate, three-sided screen will offer more privacy for his moment of solemnity than any sovereign before him. Depicting a tree with 56 leaves representing the Commonwealth nations, the hand-sewn design on the front of the screen bears the King’s cypher at the base of the trunk showing the sovereign as a servant of the ‘family of nations’.King Charles III will be crowned in a silk garment called a Stole Royal in a ritual dating back to medieval times.As is tradition, the golden stole has been created for the occasion by an ancient fraternity of craftsmen known as The Worshipful Company of Girdlers who presented it as a gift.The ornately crafted stole, derived from an ancient Greek word meaning scarf, is traditionally decorated in jewels and pearls.The garment, which is also known as the Coronation Stole, is draped around the monarch’s shoulders during the investiture part of the coronation ceremony.The stole is a long narrow embroidered band of gold silk which, like other coronation robes, relates to priestly vestments.",
        "The link to priest-like robes is a reminder of the divine nature of kingship and was first introduced at the coronation of King Edgar in Bath Abbey on Whitsunday in 973 AD.The sovereign is invested with the stole following the anointing ceremony, the most sacred part of the service, which emphasises the spiritual role of the monarch.",
        "The new stole forms part of the glittering traditional regalia the monarch wears at coronations - most of which will be historic items from the Royal Collection.Girdlers were traditionally tasked with making ornate gold silk girdles or sword belts for monarchs at coronations.The King has chosen to wear the sword belt supplied by the Worshipful Company of Girdlers for the coronation of his grandfather, King George VI in 1937.During the coronation, Prince William will enter ‘the theatre’ to bring the stole to the King along with the Royal Robe and help to ‘clothe’ him.The garments represent what the sovereign has been ‘given by God’ and the Archbishop of Canterbury says: ‘Receive this Robe. May the Lord clothe you with the robe of righteousness, and with the garments of salvation.’It is followed by the Archbishop of Canterbury handing the king the orb, ring, glove, sceptre and the rod before the crowning.The Stole Royal is removed, with other garments, before the procession from Westminster Abbey for which the King will don the Imperial Robe.The new stole bears’ significant Christian iconography’, including the gridirons of St Lawrence - the patron saint of the Girdlers.It also includes palm branches. - a symbol of martyrdom and ‘a reminder of the humble entry of Jesus as a servant king into Jerusalem’.The girdlers - one of more than 100 livery companies of the City of London - joined together for religious observance and mutual assistance long before they received formal recognition he secrets, standards and conditions of their craft.It also enabled the craftsmen who made girdles or belts to closely guard the secrets, standards and conditions of their trade.Girdles were often ornate and worn outside the tunic or gown.They would simply gather in the garment or could be used to suspend a wallet, purse or side-arms.The craft was an important one from medieval times until the end of the sixteenth century when it rapidly declined.They were granted the right to regulate their trade in the City from 1327 and obtained a Royal Charter in 1449.The charter was granted to “The Master and Guardians of the Mystery of Girdlers in the City of London” in the reign of Henry VI.On its website the company tells how it received a grant of Arms in 1454, embodying three gridirons, or girdle-irons.It said: ‘The crest is a figure of St Lawrence the Martyr, who was literally grilled by being burned to death on a girdle-iron.‘Because of this punning allusion, St Lawrence is the patron saint of the Girdlers, and the Company has ancient connections with the church of St Lawrence Jewry-next-Guildhall.’Members of the Company used to wear a distinguishing livery - a gown and coloured hood, believed to have been of blue and gold.The company has ‘developed into a property-owning organisation concerned with the fellowship f its members and with charitable works’.While they are now not involved in the trade the company maintains the tradition which last saw them present the Stole Royal and sword belt for the coronation of the late Queen in 1953.Its website says: ‘The Company no longer practises its craft - though it has the honour of presenting the girdle and stole worn by the sovereign at his or her coronation.’"
    ]
}