{
    "articleURL": "/tvshowbiz/article-12048761/Jennifer-Lopez-reacts-Vanderpump-Rules-scandal-Ariana-Madix.html",
    "content": [
        "Jennifer Lopez has weighed in on the Vanderpump Rules cheating scandal.",
        "The On The Floor hitmaker, 53, appeared on The View on Thursday, where she was asked about her thoughts regarding the cheating scandal between Tom Sandoval, 39, and Raquel Leviss, 28, that ended his nine-year relationship to Ariana Madix, 37.Though the songstress admitted that she doesn't wasn't the Bravo show regularly, the hosts filled her in on the drama, to which she replied: 'Oh! Is that what's happening on Vanderpump Rules? Jesus Christ.''Would you be violent or would you be rational?' inquired Joy Behar, asking what Lopez would do if a friend 'was getting with' her man.'I think I'd just walk out. Just walk out,' Lopez replied. 'You know everything you need to know. What else do you need to know! That's all the info that you need.'",
        "Earlier in the day the singer looked stunning as she stopped by the ABC studios in New York City.The Shotgun Wedding star wore a monochromatic look in all grey featuring a long grey coat over a belted grey jumpsuit.Her long, caramel-colored hair was parted in the middle and fell in loose curls down her torso.Later she was seen stepping out in yet another look, showing off her fashion credentials in a fringed skirt with sky-high clear platform heels.Days before a scorned Ariana declared she 'regretted ever loving' cheating ex Tom as the pair screamed at one another in the explosive season 10 finale trailer. ",
        "The dramatic new clip sees former couple have an incendiary row over his affair, before Leviss and Sandoval joke about their tryst going 'horribly wrong.'The clip opens with Sandoval telling Scheana Shay: 'I was going to break up with Ariana regardless' with the star retorting: 'But you didn't, you f****d her best friend.'A sobbing Sandoval then says: 'I sacrificed everything and my world got turned upside down' as he hugs Leviss' former love interest Tom Schwartz.",
        "Sandoval says: 'I felt something I hadn't felt in a really really long time' as Schwartz responds: 'Jesus Christ.'Madix and Sandoval are then seen having a heart-to heart as the hunk says: 'Me and Raquel became like really good friends' before his ex cuts him off and screams: 'I don't give a f*** about f*****g Raquel!' screaming. Your friendship is f*****g bulls**t!An incensed Sandoval responds: 'No it's not! You know everything!'' as Madix shouts back: 'Yes, it is!'A tearful Madix then tells a despondent Sandoval: 'I regret ever loving you!'Sandoval and Leviss are also seen cozying up together as the beauty laughs about the swirling drama - saying: 'It turned out so horribly wrong.'LaLa Kent says to Madix: 'You think this is the first time he's been creeping around?' as Sandoval admits to another instance of infidelity, saying: 'There was one other time.'",
        "Leviss' voice is also heard on a phone call with ex-fiancé James Kennedy saying she and Sandoval are 'not an item.'Lisa Vanderpump is seen telling a tearful Madix 'You don’t deserve any of this'.",
        "The trailer also sees Schwartz reveal Sandoval told him about the affair a month before it was revealed.The infidelity had begun last year in August 2022, and lasted for seven months until Ariana discovered intimate FaceTime videos on Tom's phone between him and Raquel.Madix then split with the businessman, and has been moving on with the support of her fellow VPR castmates.She was spotted earlier this month sharing a romantic kiss with fitness coach, Daniel Wai, during Coachella.Raquel, on the other hand, has checked herself into a mental health facility following the affair."
    ]
}