{
    "articleURL": "/tvshowbiz/article-12061253/Nick-Kyrgios-girlfriend-Costeen-Hatzi-suffers-influencer-fail.html",
    "content": [
        "The girlfriend of tennis champion Nick Kyrgios was left red-faced on Monday when she accidentally included private correspondence in a sponsored Instagram post.",
        "Costeen Hatzi, 22, an influencer signed to Roxy Jacenko's talent agency, shared a paid promotional video for Chemist Warehouse but forgot to edit the caption, which contained instructions from the brand manager.Hatzi's video was promoting a facial cleanser, and while there was nothing wrong with the clip, the accompanying text raised eyebrows.The caption read: 'I did! Cos go live now. Tags: All content must include \"Compensated collaboration with Chemist Warehouse\".'Please tag #chemistwarehouseaus #MoveOnFromAcne.'",
        "Celebrity watchdog account InfluencerUpdatesAU quickly reposted screenshots of Hatzi's blunder, and their followers went wild over it.'Tell me you don't take your job seriously without telling me,' one fan sniped in the comments section, while another asked: 'How did she seriously forget?'Hatzi has been dating tennis bad boy Kyrgios for just over a year now. ",
        "In April, the WAG and influencer spoke about their romance on The Morning Show. She revealed she was a bit 'sceptical' of the athlete at first, after hearing about his 'on-court reputation' through the media, but said she was pleasantly surprised when they first met.Hatzi, who is now a Bondi Sands ambassador, was also asked about their wedding plans after Kyrgios, 28, said she was 'The One' during a recent Instagram Q&amp;A.   ",
        "The pair went Instagram official in December 2021. In February last year, Kyrgios called his girlfriend 'The One' and praised her for 'bringing out the best' in him in a series of heartfelt posts ahead of Valentine's Day.",
        "When asked by a follower whether he knew she was 'The One' the first time he saw her, Kyrgios simply replied 'Yes' with a lock emoji."
    ]
}