{
    "articleURL": "/wires/reuters/article-12049241/Panthers-rally-road-earn-2-0-series-lead-Maple-Leafs.html",
    "content": [
        "The visiting Florida Panthers scored twice 66 seconds into the second period to defeat the Toronto Maple Leafs 3-2 Thursday night in Game 2 of their Eastern Conference semifinal series.",
        "The Panthers, who upset the Boston Bruins in the first round, have won the first two games of the best-of-seven series and play the next two games at home, starting Sunday.Anton Lundell had a goal and an assist for the Panthers, who rallied from down 2-0 in the first period. Gustav Forsling notched the go-ahead goal and Aleksander Barkov also scored for Florida. Sergei Bobrovsky was strong again in goal and stopped 34 shots.Alexander Kerfoot and Ryan O'Reilly scored for the Maple Leafs. Ilya Samsonov made 26 saves.Kerfoot scored his second goal of the playoffs on the rebound from Luke Schenn's shot at 2:20 of the first period. Morgan Rielly also earned an assist.O'Reilly scored his third goal of the playoffs on a pass from Mitchell Marner during a power play at 5:10 of the first. Auston Matthews also picked up an assist. Zac Dalpe was off for tripping.Lundell got Florida on the board at 11:13 of the first, converting a nifty behind-the-back pass from below the goal line by Sam Reinhart.Toronto had both power plays in the first period and a 15-9 edge in shots on goal.Florida took advantage of Toronto turnovers to take a 3-2 lead early in the second.Barkov scored his second of the playoffs 19 seconds into the period on a shot from the left circle, assisted by Anthony Duclair.",
        "Forsling then tallied his second of the postseason at 1:06 on a shot from the left circle on a pass from Matthew Tkachuk. Lundell also earned an assist.Toronto led 25-18 in shots on goal after two periods and went on to finish the night with a 36-29 edge.The Maple Leafs withstood a Florida power play to open the third period after Matthews tripped Tkachuk at the end of the second.Toronto's William Nylander hit the crossbar with a shot at 6:53 of the third period.Samsonov was removed for an extra attacker with just under two minutes left in the third, but the Maple Leafs couldn't find the equalizer.Toronto forward Matthew Knies was injured in the first period and did not return.--Field Level Media"
    ]
}