{
    "articleURL": "/wires/pa/article-12052835/Tory-losses-clear-rejection-Sunak-says-Labour.html",
    "content": [
        "Labour said the Tories’ dire local election results marked a “clear rejection” of Rishi Sunak in his first electoral test as Prime Minister.",
        "Sir Keir Starmer was celebrating wins in key battlegrounds as an indication his party was on course to win the next general election.Mr Sunak was under pressure as Conservative losses neared the 1,000 worst-case prediction senior Tories had floated to manage expectations ahead of the poll.",
        "With almost all authorities having declared, Mr Sunak’s party shed 48 local authorities and 962 councillors.Labour gained 632 seats and seized 22 councils, including ones that would be hotly contested at a general election – such as Swindon, Medway, Stoke-on-Trent, Dover and East Staffordshire.The Liberal Democrats had what Sir Ed Davey hailed as the “best result in decades”, taking 12 local authorities and 417 seats.They particularly celebrated gains in Surrey Heath, where senior Cabinet minister Michael Gove is the MP, and in former prime minister Theresa May’s backyard of Windsor &amp; Maidenhead.“It’s little wonder Rishi Sunak is running scared of a general election, because he knows the Liberal Democrats are set to take swathes of seats across the Conservative Party’s former heartlands,” Sir Ed said.",
        "The Greens made a record 199 gains, the party’s best-ever result at a local election, and gained control of their first English local authority, in Mid-Suffolk.Sir Keir’s party was projected to have won a nine-point lead over the Conservatives if all of Britain had gone to the polls, as the Tories slid backwards.",
        "Vote share analysis by the BBC put Labour on 35%, the Tories on 26% and the Lib Dems on 20%. That was the same for Labour last year, but the Conservatives had sunk from 30%.The broadcaster said the projection would make Labour by far the largest party but it would fall 14 seats of an outright majority, though voters are likely to act differently in a general election.",
        "Jonathan Carr-West, chief executive of the Local Government Information Unit, warned against drawing conclusions about what this might mean for national politics.“These were local elections with substantive local outcomes,” he said. “Voters’ decisions in this context do not map neatly on to a general election more than a year away.”Sir Keir said the “fantastic” results combined with a hoped-for recovery in Scotland would give him a majority in Westminster after a national poll.“Make no mistake, we are on course for a Labour majority at the next general election,” the Labour leader told activists in Medway.His party will run the Kent authority for the first time since 1998, with the outgoing Conservative council leader telling No 10 to “get their act together” on several fronts.Both Swindon in Wiltshire and Erewash Council in Derbyshire had been controlled by the Conservatives for 20 years until the results of Thursday’s local elections. Dover had been controlled by the Tories since 2007.",
        "A Labour spokesperson said: “The British public has sent a clear rejection of a prime minister who never had a mandate to begin with.”Mr Sunak remained defiant despite heavy losses.He conceded the results were “disappointing”, but said he was “not detecting any massive groundswell of movement towards the Labour Party or excitement for its agenda”.",
        "But as the day went on, his party’s losses crept towards the 1,000 pre-election forecast used by Tory chairman Greg Hands in the hope of being able to portray a defeat below that scale as better than expected.Some broadcasters including the BBC said the Tory councillor losses surpassed that, but PA news agency data – which does not count those who defected or left the party since being elected as Conservatives – put it at 959.North Swindon Tory MP Justin Tomlinson said the Conservatives had to take the “dreadful” results as a “wake-up call”.The council elections will not finish until Tuesday, after Redcar &amp; Cleveland stopped counting with just two results to come.The elections were described as a “dark day for British democracy” by campaigners opposed to the introduction of photo ID, who claimed thousands of people were denied their right to vote.The contests were the first to be held under new rules requiring voters to carry photographic ID and the elections watchdog said some people were turned away from polling stations.",
        "An Electoral Commission spokesman said: “We already know from our research that the ID requirement posed a greater challenge for some groups in society and that some people were regrettably unable to vote as a result.“It will be essential to understand the extent of this impact, and the reasons behind it, before a final view can be taken on how the policy has worked in practice and what can be learned for future elections.”"
    ]
}