{
    "articleURL": "/wires/reuters/article-12047539/Credit-Agricole-no-plans-raise-stake-Italys-Banco-BPM.html",
    "content": [
        "MILANO, May 4 (Reuters) - Credit Agricole has not asked banking supervisors for clearance to increase its stake in Banco BPM above the 9.9% level it recently reached, the head of the French bank's Italian arm said on Thursday.",
        "Credit Agricole emerged as Banco BPM's single biggest investor a year ago, shortly after UniCredit ditched a buyout offer for the smaller rival.Credit Agricole recently increased its initial 9.2% stake, but it would need supervisory clearance to cross the 10% threshold.Milan-based Banco BPM, the third-largest bank in Italy, has long been seen as an attractive takeover target in a sector where further consolidation is expected, thanks to its roots in the country's wealthiest area.\"We've always been consistent with what we said from the start, namely that we bought a stake that would not exceed 10%, and that's how it has been,\" Credit Agricole Italia Chief Executive Giampiero Maioli said on the sidelines of an event in Milan.When asked whether Credit Agricole could help shield Banco BPM from potential takeovers, Maioli said: \"We don't play that part. The market will make its own evaluations ... it does not concern us.\"On Wednesday, UniCredit CEO Andrea Orcel said market prices were such that potential targets did not currently make any sense though there could be a strategic rationale for deals.Credit Agricole Italy two years ago spent 855 million euros ($941.36 million) to buy regional Italian bank Creval, after agreeing to rescue three small ailing lenders in 2017.But Maioli said the bank was currently focused on internal growth.",
        "Asked about a possible tax on bank profits in Italy, Maioli said the surge in banks' income driven by higher interest rates was temporary phenomenon while loan losses loomed.\"I think the priority of all the parties involved should be that of strengthening Italian banks,\" he said.($1 = 0.9083 euros) (Reporting by Andrea Mandala, writing by Gianluca Semeraro, editing by Valentina Za and Josie Kao)"
    ]
}