{
    "articleURL": "/sport/football/article-12057473/RIATH-AL-SAMARRAI-Mutiny-remains-air-Chelsea-fans-despite-3-1-win-Bournemouth.html",
    "content": [
        "Chelsea picked up their first win since mid-March as they beat Bournemouth 3-1The away fans were mutinous as they booed Raheem Sterling and Hakim Ziyech Thiago Silva's tackle on Dominic Solanke was a rare season highlight for ChelseaThey booed their own substitutes and sang about a sanctioned oligarch. Just when perspective is needed most among Chelsea fans, it seems it has never been more slippery in the fingers.",
        "These are strange and troubling times for a club who won the Champions League two years ago. But at least Saturday offered a first victory since March 11, if not the sort of performance that screams of corners turned.It was messy. On the ball they were unsure and unimaginative, off it they were vulnerable and too open when Bournemouth countered. They did all of that amid an occasional air of mutiny from those who made the trip. One chorus identified co-owner Todd Boehly as a four-letter word, others pined for the lost love whom he replaced, Roman Abramovich, and there was also audible disapproval for the introductions of Hakim Ziyech and Raheem Sterling.Ironically, they went on to supply assists for Benoit Badiashile and Joao Felix, turning a 1-1 draw at 82 minutes into a 3-1 victory and the more amusing chant of: 'We are staying up.'",
        "But a win is a win, especially on the back of six defeats. There is not enough paper for those cracks, which soon enough might be the burden for Mauricio Pochettino.For Lampard, it is not so much a case of keeping the seat warm as preventing fire before a summer that promises major surgery.It will not be lost on many that his defence is held together by a magnificent 38-year-old in Thiago Silva and the attack has scored 12 and 10 fewer goals than the teams in 16th and 17th respectively.",
        "BOURNEMOUTH (4-4-2): Neto 5; Smith 6, Senesi 6.5, Kelly 5.5, Vina 7.5; Ouattara 6, Lerma 7, Rothwell 6 (Cook 59min, 6), Christie 7.5 (Semenyo 83); Billing 7 (Anthony 83), Solanke 6.5 (Brooks 90). Booked: Senesi. Scorer: Vina 21.Manager: Gary O'Neil 6.5.CHELSEA (4-3-3): Arrizabalaga 7.5; Chalobah 6, Thiago Silva 7.5, Badiashile 7, Chilwell 6 (Azpilicueta 74, 6); Kante 6.5 (Loftus-Cheek 63, 6), Fernandez 5, GALLAGHER 7.5; Madueke 7 (Ziyech 74, 7), Havertz 5.5 (Joao Felix 83), Mudryk 5 (Sterling 63, 7). Scorers: Gallagher 9, Badiashile 82, Felix 86.Booked: Badiashile, Kante, Mudryk. Manager: Frank Lampard 7.Referee: John Brooks 7. Attendance: 10,357.",
        "On Silva, whose immense second-half challenge on Dominic Solanke might be among Chelsea's thin list of campaign highlights, Lampard said: 'Thiago is a credit in all aspects. 'He's a classy, brilliant player. His career says it. He is brilliant at looking after himself to play at this level. He is 38, I was in the MLS at that point.'He has a great mind and a winning mentality. 'He will have been suffering a bit recently because he feels it and he wears it. He is a great reference point for the young centre backs in the team around him.'Lampard also spoke of needing 'killers' up front, which stands as the most glaring deficiency. ",
        "He was helped on this occasion by Conor Gallagher, who headed the opening goal but whose own future is in some doubt.It is understood Chelsea are open to offers, though Lampard appeared to contradict that by saying: 'You saw individual performances in Badiashile, Gallagher, (Noni) Madueke and other players in the team that are big steps forward because they are individuals who will be a big part of Chelsea going forward.'Given the club's confused leadership, that would not be worth a wager, of course. For Gallagher, the talk was of stepping stones and seizing momentum, but that will be easier said than done with a four-game run-in that includes facing both Manchester clubs and Newcastle. 'It's important to take the things we did well into the next game,' he said. ",
        "'There are still things to improve on but we can take confidence from this.'Players are the most important people because we're the guys on the pitch. We have to look at ourselves, be better individually and as a team and here we showed we're a good team.'So did Bournemouth and Matias Vina's strike was the finest component of the game. Gary O'Neil has done a superb job in rescuing their season, even if he was irked by their set-piece defending.",
        "'The scoreline looks comfortable for them, but it never was,' he said, which was a fair perspective."
    ]
}