{
    "articleURL": "/tvshowbiz/article-12046657/Ed-Sheeran-admits-originally-thought-Shape-cookie-cutter-lazy.html",
    "content": [
        "Ed Sheeran has admitted he originally thought his hit song Shape Of You was 'cookie cutter' and 'lazy.'",
        "The hitmaker, who released the track in 2017 as part of his album Divide, admitted he thought it was just a 'throwaway pop song.'Speaking in an interview on The Zane Lowe Show on Apple Music 1, which will be released on Friday, Ed confessed that he originally wanted to release Castle On The Hill, and then his love song Perfect, as singles.But record bosses were keen to release Shape Of You, and after it soared to the top of the charts, Ed admitted he was 'wrong' about the song.He told Zane: 'I don't want to speak for artists or what they feel though, but I'm just, I've been sometimes not pressured, but sometimes a record label will listen to a batch of songs and be like ''This is the one''.",
        "'And it happened with Shape of You. And I will admit that I was wrong there.Zane asked Ed: 'So you didn't want to get behind that song?'The hitmaker then replied: 'No, because I kind of, Divide was a different album in my mind. I wanted to go Castle on the Hill first and then into Perfect. 'They were like, ''You have to go with this.'' And we reached a compromise…'Zane explained that both Shape Of You and Castle On The Hill were released at the same time.",
        "He then asked Ed: 'Are you any closer to figuring out at that moment in time, because I feel like that was absolute peak pop star launchpad into space moment what was holding you back? Was there a fear somewhere deep in there about that song?''No, I just kind of thought it was cookie cutter and lazy. It was so easy. I was just like, this is the type of music that people are listening to at the moment and I'm going to write this for this artist for them to sing,' Ed told Zane.'And in my mind I was like, I've worked so hard on making Divide what it is and crafting it, that putting on, we wrote five songs that day. ",
        "'We wrote 25 songs that week, me and Steve and Johnny just writing. And for me it was just a throwaway pop song that I'd written. And I now realize that I was wrong obviously.'Ed sat down with Zane for an in-depth chat ahead of the release of his new album, Subtract on Friday. Following its release, Shape Of You soared to number one in the charts, and for a period became the most-streamed song of all time, The track also won Ed a Grammy Award for Best Pop Solo performance.",
        "Ed's song was also the subject of a High Court case against a grime artist, with Sami Chokri and Ross O'Donoghue claimed he had ripped off their 2015 song Oh Why.The popstar lashed out at the 'baseless claims' being brought against singer-songwriters 'with the idea a settlement will be cheaper than taking it to court'.Sheeran also opened up about the 'pain and hurt suffered' in his own court case brought about by the grime artist and a producer, which he won.He said he was 'obviously happy with the result' but added: 'I'm not an entity, I'm not a corporation, I'm a human being, I'm a father, I'm a husband, I'm a son.'",
        "But in a ruling on Wednesday, Mr Justice Zacaroli concluded Sheeran 'neither deliberately nor subconsciously' copied a phrase.He said: 'While there are similarities between the OW Hook (Oh Why) and the OI Phrase (Shape of You), there are also significant differences. I am satisfied Mr Sheeran did not subconsciously copy Oh Why in creating Shape.'Sheeran was expected to be able to claim back £2.2million in royalties for the song that were frozen during the court fight. Hear the full interview today at 5pm BST on The Zane Lowe Show on Apple Music 1. Tune in to the show here apple.co/_Zane."
    ]
}