{
    "articleURL": "/wires/reuters/article-12039041/New-U-S-military-aid-Ukraine-include-air-launched-rockets-sources.html",
    "content": [
        "By Mike Stone and Patricia Zengerle",
        "WASHINGTON, May 2 (Reuters) -The United States plans to announce as soon as Wednesday a new $300 million military aid package for Ukraine that will for the first time include a short-range air-launched rocket, two U.S. officials said.The Hydra 70 is an air-launched unguided rocket made by General Dynamics. The rockets are typically launched from pods attached to aircraft.The rockets could help Ukraine weaken Russian ground positions and provide advancing Ukrainian ground forces with air support as Kyiv plans a spring offensive.The package includes 155-mm Howitzer cannons, according to the officials who spoke on condition of anonymity.In addition, HIMARS and Howitzer cannon ammunition, TOW anti-tank missiles and mortars will be sent, the officials said.Demolition equipment and trucks are another part of the package, they said. They warned the package was still being finalized and could change.The package would be funded using Presidential Drawdown Authority, or PDA, which authorizes the president to transfer articles and services from U.S. stocks without congressional approval during an emergency. The material will come from U.S. excess inventory.The security assistance package would be the 37th approved by the United States for Ukraine since the Russian invasion in February 2022, for a total of nearly $36 billion. It comes as Congress and the White House squabble over how best to avoid a catastrophic default on the nation's debt, with many Republicans demanding sharp cuts in domestic spending in exchange for lifting the debt limit.",
        "However, members of both parties insist they support continued aid for Ukraine including top Republicans House Speaker Kevin McCarthy and Mitch McConnell, the top Republican in the Senate. (Reporting by Mike Stone and Patricia Zengerle in Washington, additional reporting by Humeyra Pamuk and Steve Holland; Editing by Cynthia Osterman)"
    ]
}