{
    "articleURL": "/wires/pa/article-12047813/Fans-descend-oceanside-Trump-resort-Irish-visit.html",
    "content": [
        "The Trump Doonbeg resort or, as the former US president announced in Ireland it should be renamed, “Trump Doonbeg on the Ocean” is built right on the island’s Atlantic edge.",
        "The golf course and hotel stands in the face of the elements, with erosion edging the ocean ever closer to its links and buildings.But, in the first week of May, the resort had to stand steady against a different type of encroachment.The arrival of Donald Trump also brought dozens of supporters and the descent of the nation’s media on the small village of Doonbeg.",
        "Members of the media tried with varying success to get as close as they could to the action – with a stern secret service and tight-lipped hotel staff frustrating efforts and ensuring distance to the former head of state.The 45th US president, accompanied by his son Eric, was there to inspect his property directly following a similar journey to Scotland.Upon arrival at the resort on Wednesday, he was greeted by a display of Irish dancing on a stage constructed that morning.",
        "He then walked past members of staff at the hotel, which is one of the largest employers in the region, before briefly stopping to engage with reporters in one of several media opportunities across his 24-hour stay.He shared dinner with local business owners, many of whom separated his politics from the economic boost the golf course gave to the nearby village.",
        "Shop owner Rita McInerney said his association with the region brings both challenges and opportunities.“There’s a mixture of people who are both pro and anti-Trump, and then there’s just a few who have more of a focus on the golf.”",
        "Publican Tommy Tubridy said: “It’s all good news. I’m not really into the politics of America, all I’m looking for is people employed and staying in our parish.”Some of his supporters travelled long distances just for the chance of seeing him in the flesh while others said they had paid “a lot of money” to get a room at the resort for the day.Kellie and Mark Quinn travelled down on Thursday with their three-year-old daughter from Cookstown, Co Tyrone.Wearing “Trump Won” t-shirts, they were simply hoping to get a photo for their mantlepiece.Michael Leahy, identifying himself as the chairperson of the Irish Freedom Party, claimed to have shared a fist bump with the president.",
        "Tadhg O’Shaughnessy and his partner Indu wore Trump caps, carried an American flag and also brought a specially-made portrait of the president riding a horse which they hoped to give to him.“He’s a truly good person and people keep putting him down,” Mr O’Shaugnessy said.“He’s a business person, not a politician. He has in his heart the love for his country and he wants the very best of it.”",
        "His fans were also looking out for the press, asking journalists about the nature of the coverage they would be writing.",
        "One supporter told a reporter he was a “scumbag” for questioning Mr Trump “in his own property” about the civil rape case against him which is under way in New York.The visit coincided with the second week of a civil trial in Manhattan over accusations, denied by Mr Trump, that he raped former magazine columnist E Jean Carroll in a department store dressing room in 1996.The matter was on the former president’s mind, however, as he decided to raise the issue himself at a media opportunity.",
        "Teed off – after hitting his first drive at the golf course on Thursday – Mr Trump turned to gathered reporters to launch into a four-minute diatribe against the proceedings and his accuser.First noting what he said was a 275-yard drive, he mocked US President Joe Biden’s physical abilities and golf skills by saying he would not be capable of hitting a ball 50 yards.He went on to say the allegations in the civil rape case were a “political attack” and that he was going to cut his visit to Ireland short to return to New York and “confront” his accuser.",
        "Throughout, his comments were met by laughter, whoops and cheers by some of his supporters.He closed his engagement, again noting his drive – which he now said was 285 yards.At the end of that round of golf, Mr Trump announced the resort should add the “on the Ocean” moniker to its title.",
        "It came after a 10-minute conversation with staff and his son about different aspects of the course and where a marquee and ballroom should be located – given the threat of coastal erosion.Asked by reporters how he fared on the fairways – Mr Trump said he did not know but estimated he shot “maybe a 72”.“You’d have to ask my guys.”When asked, others present on the greens said Mr Trump shot a 71. One under par."
    ]
}