{
    "articleURL": "/sport/football/article-12038119/Cristiano-Ronaldo-mocked-former-Al-Nassr-player-goal-celebration-against-Al-Raed.html",
    "content": [
        "He celebrated a fourth-minute headed goal in trademark fashion against Al-RaedBut Adrian Mierzejewski, who used to play for Al Nassr, commented on his goalThe victory sees Al-Nassr, who are in second place, close the gap on Al-IttihadCristiano Ronaldo has been mocked by a former Al Nassr player for his wild goal celebration against Al Raed.   ",
        "The Portuguese superstar, 38, scored after just four minutes as Al-Nassr secured a 3-0 victory at home to Al-Raed on Friday.The victory sees Al-Nassr, who are in second place in the Saudi Pro League, close the gap on Al-Ittihad to three points, although the leaders have a game in hand.Ronaldo put Al-Nassr in the lead with a header as he connected with a cross from Sultan Al Ghannam.However Adrian Mierzejewski, who used to play for Al Nassr, took to Twitter to comment on Ronaldo's goal. ",
        "The Henan midfielder said: 'That moment when you lost the Supercup, you were eliminated in the semi-final of the King Cup of Champions, you lost the derby to Hilal which means no championship 99 per cent but you scored against Al Raed and your team won 4-0.'Ronaldo played the full game and has 12 goals in as many league games for Al Nassr so far this season. Ronaldo was left frustrated on Monday as Al Nassr were knocked out of the King Cup of Champions by Al Wehda. It marked the third time this season that Al-Nassr have come up short in a cup competition, having lost in both the Riyadh Super Cup and the Saudi Super Cup. Ronaldo, who joined Al-Nassr in January on a contract estimated by the media to be worth more than €200million ($220million), had looked disgruntled in recent weeks as Al-Nassr failed to score in three straight games. ",
        "Ronaldo's smile was back at Alawwal Park on Friday, however, as he celebrated a fourth-minute headed goal in trademark fashion.The forward also contributed to Abdul Rahman Gharib's second goal with another header but his frown returned when he was denied a penalty in the second half."
    ]
}