{
    "articleURL": "/news/article-12046015/Care-home-resident-90-dies-drinking-cleaning-fluid-unlabelled-bottle-court-hears.html",
    "content": [
        "David Fyfe, 90, died after drinking from the unlabelled in his care home roomThe company that runs Tigh-Na-Muirn care home admitted responsibility A care home resident died after drinking cleaning fluid from an unlabelled bottle left in his room, a court was told.",
        "The company that runs Tigh-Na-Muirn home in Monifieth, Angus, admitted being responsible for the death of 90-year-old David Fyfe.He died from ammonia poisoning after drinking a cup of Steri-Germ washroom cleaner, Dundee Sheriff Court heard. Mr Fyfe, who had a number of health issues including Alzheimer’s disease, had been confined to his room after contracting Covid. Principal fiscal depute Jane Hilditch said that Mr Fyfe was found seriously unwell in his room by staff at the height of the first pandemic lockdown in May 2020. ",
        "She said: ‘He had breathing difficulties and chest pain. An ambulance was requested by 999. Staff observed a cup with the residue of green liquid in it on the table. ‘It was the same colour as the sanitiser. He was unable to confirm if he had taken any of the liquid. He was transferred to Ninewells Hospital for monitoring.'He gradually deteriorated the following day and staff determined to move him to palliative care and he died on May 31.’ Ms Hilditch added: ‘Cleaning chemicals were never usually kept in rooms and were locked in the cupboard, but in the circumstances of the pandemic and infection control they were in the Covid positive rooms.'It is not known why the bottle in his room had not been labelled. They failed to adequately assess the risk posed to residents from the storage of Steri-Germ in rooms.’ ",
        "The company admitted failing to ensure residents were not exposed to risks to their health and safety. It failed to assess the risk of storing cleaning fluid in rooms and failed to ensure residents were not exposed to hazardous cleaning chemicals from March 20 to June 1, 2020. The company admitted leaving a bottle of ammonium-based liquid in the bathroom cabinet on May 6, 2020, leading to Mr Fyfe ingesting a quantity of it on May 27. As a result, he fatally developed severe inflammation of his airway and pneumonia. Barry Smith, KC, defending, said: ‘I am expressly instructed to convey the condolences of the company directors and all those associated with Tigh-Na-Muirn to the family of Mr Fyfe.’ Sheriff Jillian Martin-Brown deferred sentence. A spokesman for the home said: ‘We have learned from this tragedy and taken all necessary steps to ensure this never happens again.’ "
    ]
}