{
    "articleURL": "/tvshowbiz/article-12045577/Kaia-Gerber-looks-effortlessly-stylish-trench-coat-ahead-photo-shoot-New-York.html",
    "content": [
        "Kaia Gerber cut a stylish figure in a trench coat as she headed to a photo shoot in Midtown Manhattan on Thursday.  ",
        "The model, 21, looked effortlessly chic in a crisp white oversized shirt which she layered beneath a grey cropped sweater. She added a pair of black wide legged trousers to the look and kept comfy in a pair of dark trainers. Kaia opted for a pair of chunky black sunglasses for the outing and carried her belongings in a large beige tote bag. The daughter of Cindy Crawford styled her long locks in loose waves that cascaded past her shoulders from a centre parting. ",
        "The beauty was spotted speaking to an acquaintance in the street before heading to a car with her morning coffee.  It comes after Kaia and boyfriend Austin Butler skipped out the 2023 Met Gala on Monday evening.Kaia and her actor partner were initially pictured in each other's company during an outing that took place in New York City in December of 2021.The model was previously linked to Pete Davidson and Jacob Elordi, while the actor was in a relationship with Vanessa Hudgens that lasted from 2011 until 2020.The pair were then spotted in each other's company during several outings that took place during the early portion of 2022.The happy couple eventually made their public debut at W Magazine's annual Best Performances party, which took place last March.",
        "Kaia and Austin have since attended several major events in each other's company, including the Cannes Film Festival and the 2022 Met Gala.The model previously spoke about her love life during an interview with Vogue, where she spoke about routinely starting relationships with older individuals.",
        "'I was so young I had kissed, like, only one person. I had never had a high school sweetheart or anything,' she confessed.'And so I tended to date older people because those were the people I was around.'The fashion industry personality then expressed that she had matured significantly ever since her early years of dating.'I got put in situations where one day I'd wake up and be like, \"How did I get here?\" I have no idea what I'm doing, and I need help. And being able to ask for that help was amazing. That's what real growing up means, not being afraid to ask,' she said."
    ]
}