{
    "articleURL": "/sport/nrl/article-12056565/Footy-supremo-Peter-Vlandys-reveals-wants-FIVE-NRL-teams-Queensland-fight-AFLs-threat.html",
    "content": [
        "The NRL is aiming to grow the competition to 20 teams by 2032 Peter V'landys said Brisbane's Western Corridor is under considerationThe NRL is also considering setting up another team in VictoriaARL commission chairman Peter V'landys has revealed the NRL is exploring the option of adding a fifth team in Queensland amid concerns over the AFL's exponential growth in the Sunshine State.",
        "The Dolphins became the NRL's 17th club this season and V'landys has outlined a plan to grow the competition to 20 teams by 2032, when Brisbane will host the Olympic Games.And speaking to News Corp, V'landys said one of the expansion teams could be located in Brisbane’s western corridor, an area which has been aggressively targeted by the AFL.'The western corridor of Brisbane is a genuine consideration,' he said.  'We will look at the data and where the participation levels are. If there is a demand, we will supply it. There has to be a demand. The Western Corridor has not been forgotten.'",
        "The Brisbane Jets lost out to the Dolphins for the 17th licence but the bid's CEO, Nick Livermore, is hopeful the NRL will consider the Jets when it expands again. Livermore warned the very future of the game in the region is at stake, with rugby league 'under attack' by the AFL, which is 'decimating' the code in the Western Corridor.Speaking at the launch of the season, outgoing AFL chief executive Gillon McLachlan said the code will overtake rugby league in Queensland in terms of participation figures by 2025. 'If the NRL is serious about expansion, then the western corridor must get the next licence,' Livermore said.",
        "Brisbane's Western Corridor is expected to be Brisbane’s biggest growth area ahead of the 2032 Olympics and V'landys is well aware of its importance.'There is an argument for another team in Queensland, no doubt,' he said.'It’s important we keep investing in participation because Queensland is our second biggest market and an area of huge importance to the NRL.'The NRL's faith in the Dolphins has been handsomely repaid so far this season, with Wayne Bennett's team fifth on the ladder after Magic Round.  ",
        "The Dolphins have been an even bigger success from an audience standpoint, drawing a staggering 1.1million viewers in their first two rounds.Their debut game against the Roosters in March was watched by 567,000 viewers on Foxtel, contributing to the broadcaster recording its highest ever TV ratings for an NRL round with 4.1million fans tuning in - a 17 percent increase from Round  1 last season. The Dolphins clash against the Broncos in Round 4 drew 246,000 viewers in Brisbane, while the Lions' AFL clash against Melbourne on the same night was watched by a TV audience of 59,000 in Queensland's capital. But while the NRL is winning the ratings battle against the AFL in the Sunshine State, V'landys acknowledged the code was a growing threat to rugby league.",
        "'The AFL is doing a great job, no doubt, and I take my hat off to them,' he said.'But competition lifts all ships and their competition has lifted us.'",
        "Earlier this week, V'landys revealed the NRL was considering setting up another team in Victoria and plans to expand the competition are set to be discussed when the ARL Commission will meet next week.A Perth franchise, a second New Zealand team and a Pacific island team have all been mentioned as potential expansion destinations for the NRL.And Queensland Rugby League chairman Bruce Hatcher believes any expansion should come at the expense of one of the existing Sydney teams.'The best way to give Perth an identity in the NRL is to straddle two markets with a history starting out of Sydney,' he told the Daily Telegraph in March. "
    ]
}