{
    "articleURL": "/money/investing/article-12054071/We-reveal-investments-turned-pound-20.html",
    "content": [
        "The £1 coin is 40 years old. It was released in 1983, when David Bowie was top of the charts with the classic hit Let's Dance, and Margaret Thatcher was re-elected in a landslide victory. ",
        "The round pound replaced the £1 banknote after a fall in purchasing power meant that the £1 unit of currency was more suited to a coin than a note. The paper banknote could only stay in circulation for nine months on average before it degraded, so the Treasury approved its replacement with a coin which could be passed around for decades. More than 2.8 billion £1 coins were issued between 1983 and 2017, after which the 12-sided coin replaced the round coin, which had proved too easy to counterfeit.Yet this humble coin has lost more than two-thirds of its purchasing power since it was minted, with the buying power of just 30p if it was kept in a piggy bank, or down the back of a sofa, according to Laith Khalaf of stockbroker AJ Bell.That is despite annual retail price increases only breaching 10 per cent three times over the past 40 years: in 1990, 2022 and again this year – currently sitting at 10.1 per cent. It means that you would need £3.17 to purchase something today that cost £1 four decades ago, Bank of England figures show. Khalaf says: 'This demonstrates the damage inflation can wreak on your buying power. But it is possible to fight off inflation by investing your money and being patient.'",
        "Had that £1 coin been stored in a bank account, invested in the stock market or used to buy property, it would have kept pace with inflation and in many cases returned a healthy profit. But which asset would have delivered the highest pay off?Stock market winsThe UK stock market has proved to be the best home for your money over the past 40 years. The average fund that invests in UK shares has returned 3,185 per cent during that time, growing a £1 investment in 1983 to £32.85 today. When accounting for inflation, your investment would be worth £10.02, according to analysis from Khalaf.Inevitably the more risk you take, the higher the potential rewards. While the stock market is a far more volatile investment than gold or property, investors are paid handsomely for taking on that added layer of risk.It is crucial to invest for a long period as this allows you to smooth out any short-term bumps and downturns. For example, investors will have seen a 55 per cent plummet from peak to trough during the global financial crisis in 2008 and a 25 per cent freefall in the three months to the end of March 2020 when the pandemic sent markets reeling.However, those who left their money invested would have seen it recover its value and climb ever higher. An investment in the typical UK equity income fund, which invests in high dividend-paying companies, would be worth even more, at £12.99 to £42.60 in nominal terms.",
        "This reflects the long-term compounding power of rolling up dividends, Khalaf says.Early investors in the technology revolution are today's big winners, outperforming all investments. The average technology fund has returned a huge 6,431 per cent. Share prices in today's global tech superpowers have rocketed since they came to market. Your £1 invested 40 years ago would now be worth £19.92 – even after inflation.For example, shares in Microsoft have jumped from $0.1 when they were first issued in March 1986 to $304.40 today. Had you invested £1 in the company's shares in 1986, it would be worth £3,044 today, without accounting for inflation.Khalaf says: 'The more risk taken, the higher the rewards have been, albeit with bigger downdrafts along the way.'Indeed, many longstanding tech investors will still bear the scars of the dotcom crash in the early noughties. But even those more conservative investors can take some heart from the fact that more cautious investments such as a balanced managed fund have still beaten inflation, given a long enough time to compound returns.'Placing £1 in the global stock market, which offers more diversification for investors, would have still grown your money to £28.90 or £8.81 when accounting for inflation.Current persistent inflation is expected to drop off towards the end of the year, but Khalaf advises savers to plan to grow their nest egg ahead of the rate of inflation, and those who are willing to put their money away for the long term should be thinking about harnessing the power of the stock market.",
        "Power in propertyProperty has long been known as one of the most reliable investments. Every £1 invested in a UK residential home in 1983 would be worth £11.90 today, ranking it higher than gold, according to data from the Land Registry. In real terms, that is worth £3.63 as its value has risen three times faster than inflation. Gold holds strongGold is world renowned for being a safe haven for investment, and it has lived up to this reputation.The precious metal has returned 469 per cent in 40 years. This means your investment would have grown to £5.69 – far outpacing price rises. In real terms, your investment would be worth £1.73.Savings boostedThe good news is that even if you left your money in an instant access bank account, each £1 would still have beaten price rises. Its value would have more than trebled to £3.75 thanks to interest paid by the bank each year. When stripping out inflation over that time, your original £1 would be worth £1.14 today.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}