{
    "articleURL": "/wires/ap/article-12040165/Wongs-two-homers-lifts-Red-Sox-7-6-win-Blue-Jays.html",
    "content": [
        "BOSTON (AP) - Connor Wong hit two homers, including a tie-breaking solo shot in the eighth, to help the Boston Red Sox rally past the Toronto Blue Jays 7-6 on Tuesday night.",
        "Masataka Yoshida and Christian Arroyo also homered for Boston and the Red Sox tied a season-high for hits with 14, including four by Wong. The Boston catcher led off the eighth needing a triple to complete the cycle, drove a 2-1 fastball from Erik Swanson to the Green Monster seats for his second homer of the night and third in three days.\"It was great. Obviously, something you´re working towards and it´s nice to have success,\" Wong said after his first multi-homer game and setting a personal best with four hits.Wong, who had one career homer before going deep Sunday in a win over Cleveland, also had a double in the second that bounced just below the yellow line at the top of Fenway Park's iconic left-field wall.The Red Sox rallied after falling behind 6-3 during a six-run fifth by the Blue Jays and won four in a row for the first time this season, getting the final two outs when George Springer grounded into a double play. Boston (17-14) is three games over for the first time since beating the Yankees last July 17 for a 48-45 record.Reliever Richard Bleier (1-0) got the win and Josh Winckowski picked up his first career save. Swanson (1-1) took the loss.",
        "Boston manager Alex Cora said he was hoping to rest Winckowski on Tuesday, but didn't have much of a choice with a one-run lead against the Jays in the ninth.\"I honestly wanted to stay away from him, but obviously the game dictated something else so we took one shot with him,\" Cora said.Daulton Varsho hit a three-run homer for the Blue Jays in the sixth and Vladimir Guerrero Jr. finished with a pair of singles and two RBIs. Toronto has lost three straight.\"They´re a good hitting team. They´ve been doing that for the majority of the year,\" Toronto manager John Schneider said. \"I think when you make mistakes, you kind of pay the price a little bit, so tip your cap.\"Yoshida extended his hitting streak to 12 with a solo homer to right-center in the fourth, putting Boston up 3-0.Toronto didn't get a hit until Varsho's double in the fourth, then tagged Houck in the fifth for six runs on five hits and a walk. Varsho did the most damage with his homer that put the Jays up 6-3 after a bases-loaded single by Guerrero drove in two and Bichette scored on a passed ball.\"This is a good environment to play in. I think our guys like it. It´s a tough environment to play in. It seems like kind of no lead is safe and you´ve really got to value 27 outs,\" Schneider said.",
        "Boston got two back in the fifth on RBI singles by Refsnyder and Yoshida, then Wong added a solo homer to left to tie it again in the sixth, surviving a video challenge that showed a fan touching the ball after it had cleared the top of the wall.Arroyo´s first homer of the season was a blast all the way out of Fenway Park, driving a 1-1 changeup well over the Green Monster to give the Red Sox a 1-0 lead. Wong followed with a drive off the giant wall in left field that was just under the yellow line.Alex Verdugo led off the third with his second straight double and scored on a single by Rob Refsnyder, who was thrown out at second on a nice play by center-fielder Kevin Kiermaier.TRAINER´S ROOMBlue Jays: Springer was back in the lineup after getting scratched from the series opener Monday because of an illness. Springer was initially called for an error in the sixth after misplaying a Justin Turner's pop fly down the right field line that bounced out of play and was eventually ruled a ground-rule double.Red Sox: LHP James Paxton (strained right hamstring) will make another rehab start with Triple-A Worcester on Friday, manager Alex Cora said. Cora said Paxton is close to a return, but feels he has a few more things to improve before making a return. ... RHP Zack Kelly had surgery on Tuesday on his right elbow, the Red Sox said.",
        "UP NEXTBlue Jays RHP Alek Manoah (1-1, 4.88 ERA) starts the third of a four-game set Wednesday night against RHP Nick Pivetta (1-2, 5.11) for the Red Sox.___ AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}