{
    "articleURL": "/tvshowbiz/article-12039525/Nigella-Lawson-shares-grief-late-Jock-Zonfrillo-says-stop-thinking-family.html",
    "content": [
        "Nigella Lawson has expressed her grief for the late MasterChef judge Jock Zonfrillo.",
        "The Scottish-Australian chef was found dead by police at a hotel on Lygon Street in Carlton, Melbourne, at about 2am on Monday at the age of 46.Lawson, 63, posted a statement on Twitter on Tuesday afternoon, sharing her 'deepest' sympathies for Zonfrillo's family, including his four children.'I can't stop thinking about Jock Zonfrillo's children, his family,' tweeted the former My Kitchen Rules judge.'So many are plunged into deepest grief. My heart goes out to them. And I hope their wishes for privacy are respected.'",
        "The British food writer was set to work with Zonfrillo on Channel 10's MasterChef as a guest judge in 2020, but was forced to bow out due to the Covid pandemic.A year later, Lawson appeared on the show via a video link as the contestants battled it out in a pressure test.Police found Zonfrillo's body at the Zagame's House hotel at about 2am on Monday after they were called for a welfare check.No cause of death has been disclosed, but police say his death is not being treated as suspicious. A report will be prepared for the coroner.",
        "His death came as MasterChef's fifteenth season, featuring Jamie Oliver as a guest judge, was due to premiere on Ten on Monday night but has since been postponed out of respect for Zonfrillo's family.",
        "Zonfrillo is survived by his third wife, Lauren Fried, and his four children: teenage daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.'With completely shattered hearts and without knowing how we can possibly move through life without him, we are devastated to share that Jock passed away yesterday,' his family said in a statement on Monday.'So many words can describe him, so many stories can be told, but at this time we're too overwhelmed to put them into words.",
        "'For those who crossed his path, became his mate, or were lucky enough to be his family, keep this proud Scot in your hearts when you have your next whisky.'We implore you to please let us grieve privately as we find a way to navigate through this, and find space on the other side to celebrate our irreplaceable husband, father, brother, son and friend.'Zonfrillo became a host of the popular Channel 10 cooking show MasterChef Australia in 2019 alongside Andy Allen and Melissa Leong.Zonfrillo, who started his career working under Michelin-starred chef Marco Pierre White in the UK, famously overcame an addiction to heroin during his teenage years in Glasgow before becoming one of Australia's most celebrated chefs. If you or someone you know needs immediate support, contact Lifeline on 13 11 14 or via lifeline.org.au. In an emergency, call 000 "
    ]
}