{
    "articleURL": "/femail/article-12054345/Look-Excited-Prince-Louis-contain-balcony-gestures-crowd.html",
    "content": [
        "Prince Louis, five, couldn't contain excitement on Buckingham Palace balcony and lived up to his reputationCORONATION LIVEBLOG: Click here to follow live updates throughout todayPrince Louis may be known for his reputation of show stealing balcony antics at royal events - and today was no different for the little royal, who couldn't contain his excitement at Buckingham Palace as he gestured into the crowd. ",
        "The newly-crowned King and Queen appeared on the Buckingham Palace balcony with a select group of senior royals as The Mall was swamped by tens of thousands of cheering patriots.The Mall was a sea of people, many of whom sprinted to get close to the Palace and catch a glimpse of the King and Queen following their historic coronation watched by 100million people on TV worldwide.Among the royals on the balcony was Prince Louis, who often tends to steal the show at engagements - and this morning proved no exception.Today he  gestured wildly out into the crowd as he spoke to his parents, pointing and commenting: 'Look over there!'",
        "His father William appeared to tell the little boy: 'Wave.' Louis' first balcony appearance in 2019 saw the little royal wow royal fans, who were amazed by his behaviour at Trooping the Colour. Louis appeared a natural on the balcony in front of the crowds and when the national anthem was played the toddler prince joined the spectators in clapping.With his older brother and sister, Prince George and Princess Charlotte, stood nearby with Kate he waved at the well-wishers enthusiastically, as did his siblings, and carried on waving as his father carried him insideAnd last year, Prince Louis was hailed 'the real star' of the Queen's Jubilee after his scene-stealing performance on the Buckingham Palace balcony.",
        "Royal fans took to Twitter to praise the 'adorable' royal after he pulled faces and picked his nose while watching the flypast alongside the Queen, 96, and his siblings Prince George and Princess Charlotte.Photos of Louis on the balcony quickly went viral, with some saying he's 'a handful' and keeps his parents on his toes.One tweeted: 'Prince Louis looks like he might be a bit of a handful.' Another posted: 'What a cheeky little chap Prince Louis is, made me chuckle.'The young prince was photographed waving enthusiastically at bystanders as he took part in the carriage ride down the Mall to Horse Guards Parade earlier in the day, but his most attention-grabbing moments came courtesy of the obviously strong bond he shares with his great-grandmother, the Queen, who was seen chatting to the youngster during the flypast, seemingly in an effort to distract him from the loud noise of the aircraft.",
        "And Louis seemed entranced, looking up inquisitively at the monarch, and seeking out her attention. At one point, he even broke away from his mother Kate to barge past the Queen, much to the bemusement of the Princess. Today, Louis joined a number of other royals on the balcony - including Charles and Camilla as well as the Prince and Princess of Wales, the Duke and Duchess of Edinburgh and Princess Anne. ",
        "Elsewhere, he melted hearts again at Westminster Abbey during the King's Coronation ceremony. As the Wales children departed the Abbey after the ceremony, the youngster was spotted cheering for his grandfather from the royal carriage, exclaiming: 'Yaaaay Say king. Yaaaay king,' lip reading expert Jacqui Press told Femail. He was also seen excitedly pointing at royal fans and whispering to his sister Charlotte as they departed.  The fourth in line to the throne, who looked regal in a bespoke outfit by a Savile Row tailor, appeared more disinterested earlier in the day, as he yawned throughout the ceremony.The cheeky prince looked around the Abbey and pointed at items as he sat next to his older sister Princess Charlotte during the opening moments of the historic service.",
        "When his sister tried to hold up the order of service for him to have a look at, he looked the other way and was seen yawning as he entered the Abbey while holding hands with Charlotte. During the national broadcast, Louis was seen kicking his feet around, forcing his mother, Kate to whisper to him.The adorable prince later grumpily slumped back in his seat proving that the long service was possibly too much for a five-year-old. The prince was not initially supposed to attend the Coronation, however it appears that at the last minute the family decided to include him in the service.",
        "It is thought that Prince Louis won't attend tomorrow's concert in Windsor.",
        "Previously, Prince Louis stole the show at the Trooping the Colour celebrations in June last year, where he pulled a series of hilarious faces - including covering his ears in front of the Queen when the sound of the roaring plane engines became too much during the fly past.Today, the siblings arrived without their older brother Prince George, nine, who is a Page of Honour for his grandfather and following in the procession behind the King. Princess Charlotte is wearing an Alexander McQueen dress and cape in ivory silk crepe with ivory stitch embroidery featuring rose, thistle, daffodil and shamrock motifs, to signify the four nations.   Charlotte is also wearing a Jess Collett x Alexander McQueen Headpiece silver bullion, crystal and silver thread work, similar to the headpiece the Princess of Wales is wearing."
    ]
}