{
    "articleURL": "/tvshowbiz/article-12051847/Henry-Golding-announces-expecting-baby-number-two-wife-Liv-Lo.html",
    "content": [
        "Henry Golding proudly announced that he and his wife Liv Lo are expecting baby number two together in a new, adorable Instagram post shared on Friday. ",
        "The Crazy Rich Asians star, 36, and his wife of seven years, already share two-year-old daughter, Lyla, whom they welcomed to the world in March 2021. The Malaysian-born actor shared black and white photos as he sat on a wooden bench with his wife happily sitting next to him in Taiwan. She donned a sleeveless cropped top and a pair of comfy shorts to showcase her growing baby bump. He gently laid his hand on her stomach and flashed a big smile towards the camera as their daughter sat in between the two lovebirds. In the caption of the cute post, the Persuasion star penned to his 1.2 million followers, 'Inbound,' followed by a white heart emoji and a baby angel face emoji.  ",
        "In the second snap added into the post, the couple sent smiles towards the camera while little Lyla rested her face against her mother's baby bump. Social media users and celebrities jumped to the comment section to send their congratulations and excitement to the happy news. Henry's wife, Liv, sweetly typed out, 'Baby daddy!' followed by red heart emojis, while his Crazy Rich Asians co-star, Gemma Chan, typed out, 'Congrats you guys.' The Princess Bride actor, Cary Elwes, wrote, 'Yay! Congratulations to you all! So happy for you,' and actress Tan Kheng Hua humorously added, 'Yaaay!! More GOLD-ings!!' ",
        "The yoga instructor also shared the same pictures to her own Instagram page and also revealed their second child's due date. 'Oh hey! New baby otw, due Sept 1.' The gender of baby number two has yet to be revealed. Henry first crossed paths with Liv back in 2011 on New Year's Day. After four years of dating, the happy pair became engaged in 2015 and tied the knot during a ceremony in Sarawak the following year. The actor has previously opened up about fatherhood and revealed to People in May 2022 that his favorite part about being a parent to Lyla is, 'Seeing her grow and change.'  The Malaysian-British star further gushed that, 'She's changing so much, so every day is like a treat' ",
        "Back in 2021 and only a few months after becoming a father, Golding expressed how he felt to officially become a parent while appearing on Good Morning America. The star stated, 'It puts everything in perspective. It has allowed me to really kind of focus in on what really matters in life.' The Snake Eyes actor also revealed that both he and his wife had initial plans to keep their daughter out of the public eye and spotlight, but soon backtracked on the decision. 'We were like, \"Ah, we don't want to put her on social media too much,\"' he explained during the interview. ",
        "Henry then recalled having a conversation with his wife Liv: '\"I just want to share my joy of this tiny little person that's brought so much joy to our lives. There's nothing wrong with that.\"' The star gushed that he believed his wife, 'felt really comfortable, of course, sort of sharing her experience. It's so important for her to share her experience as a new mother, especially all the challenges that come with that.' Along with preparing to add another addition to his growing family, Golding has been filming his latest project titled, The Ministry Of Ungentlemanly Warfare. ",
        "The action film, which is slated to release in theaters next year in 2014, is both being directed and produced by Guy Ritchie.Other stars that have been cast in the anticipated movie include: Henry Cavill, Eiza Gonzalez, Alex Pettyfer, Alan Ritchson, as well as Cary Elwes and After star, Hero Fiennes Tiffin. The premise follows, 'The British military recruits a small group of highly-skilled soldiers to strike against Nazi forces behind enemy lines during World War II,' according to an IMDB synopsis. Henry recently uploaded an Instagram photo last month in April as he relaxed on set of the project in England with a few other castmates joining in for the picture. 'For King and country #ministryofungentlemanlywarfare,' he penned in the caption. "
    ]
}