{
    "articleURL": "/wires/ap/article-12048449/Spalletti-leads-Napoli-title-Totti-Icardi-battles.html",
    "content": [
        "ROME (AP) - When Napoli failed to win Serie A last year, a group of the squad´s hard-core \"ultra\" fans hung up a banner outside the Stadio Diego Armando Maradona that referred to coach Luciano Spalletti´s Fiat Panda car, which had been stolen months earlier.",
        "\"Spalletti: We´ll give you the Panda back. As long as you leave!\" the banner read.Well, Spalletti never left, and he deserves his Panda back now.That´s because Spalletti has just directed Napoli to its first Serie A title in more than three decades. And he did it with a team that was completely overhauled after last season and one that often overwhelmed opponents with attack-minded tactics rarely seen before in Italy.Napoli clinched the title with a 1-1 draw at Udinese on Thursday.It´s the crowning achievement for the Tuscan coach in a career that included two Russian league titles with Zenit St. Petersburg but nothing more than Italian Cup and Italian Super Cup trophies in Italy.\"I´ve never traveled in first class with a window seat, it´s always been by hitchhiking,\" Spalletti said. \"So finding myself in a position to win this title, it´s payback for all of the sacrifices made over the years.\"Reaching the pinnacle of Italian soccer certainly hasn´t come easy for Spalletti, who became known for butting heads with his team captains - first when he tried to ease Francesco Totti into retirement during his second stint at Roma, and then when he took the armband away from Mauro Icardi at Inter Milan following criticism by the player´s wife and agent, Wanda Nara.",
        "\"It´s been a tougher road than others who started from different levels, those who earned respect and admiration for their playing careers and got the opportunity to lead a top team from the start,\" Spalletti said.On the sidelines, Spalletti wears old-fashioned black-and-white soccer shoes.\"I´ve often been mocked for wearing football boots on the touchline, but I remember when I desperately wanted those boots and couldn´t afford to buy them,\" he said.Napoli midfielder Stanislav Lobotka said Spalletti's touchline attire sometimes makes it feel like \"he wants to come in to help us.\"Spalletti now owns a farm in Tuscany with animals such as horses, ostriches and peacocks, plus a pond with ducks.He told Serie A host broadcaster DAZN that the farm is his favorite place \"to focus and think about solutions\" for his teams, adding that \"when you ride a horse, you´ve got have a rapport with it.\"Adding to Spalletti's history of issues and bad luck with his captains, Lorenzo Insigne left Napoli after last season for Toronto in MLS - albeit not because of issues with the coach.With defensive stalwart Kalidou Koulibaly and Napoli record scorer Dries Mertens having also left, Spalletti was able to take full control and immediately installed Georgia dribbling wizard Khvicha Kvaratskhelia on the left wing of the attack for Insigne and Kim Min-jae at center back in place of Koulibaly.",
        "Spalletti´s 4-3-3 formation throws itself forward in attack relentlessly, as evidenced when eight Napoli players - everyone but the goalkeeper and the two center backs - line up at the halfway line at kickoffs at the start of games or the start of the second half.\"With Spalletti there´s no choice: the strikers are the first defenders,\" Serie A scoring leader Victor Osimhen told France Football. \"Our strength is the collective group and we don´t have a real weak point. Spalletti is unrivaled. He´s a genius. When we´re able to implement 99% of his ideas we destroy the opponent.\"Spalletti´s innovative style first showed promise at Udinese nearly two decades ago when he led the provincial club to a fourth-place finish and a spot in the Champions League. He won two Italian Cups with Roma in 2007 and 2008 and an Italian Super Cup before finding success in Russia.\"I´ve often been told that I haven´t won. Well, if all of that has led to experience the triumph at Napoli, it was worth it,\" Spalletti said.While he rarely writes anything down during matches, Spalletti is known to keep an extensive collection of notebooks in his office at Napoli´s training center in Castel Volturno. He can now add a new entry: \"Champion of Italy.\"",
        "The notebooks are surely organized neatly like his immaculately displayed collection of soccer shirts at his home in Tuscany.And for the record, he´s still bothered that his Panda was stolen, having once joked that he would want to make sure his CDs of Neapolitan singer-songwriter Pino Daniele were still inside if he ever gets it back.\"It´s not fair and whoever did it should be punished,\" Spalletti said. \"But I like the idea that some father now uses it to bring his kids to school. So it´s OK. I have another Panda.\"___Andrew Dampf is at https://twitter.com/AndrewDampf___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}