{
    "articleURL": "/news/article-12056653/Its-just-painful-Gordon-Ramsay-tells-devastating-loss-MasterChef-star-Jock-Zonfrillo.html",
    "content": [
        "Glaswegian chef Barry 'Jock' Zonfrillo was revealed to have died last MondayFriends and colleagues paid tribute to the MasterChef judge on Australian TVGordon Ramsay was brought to tears when speaking on the loss of MasterChef star Jock Zonfrillo, who it was revealed last Monday had died at the age of 46.",
        "'The ripples have been devastating. No one is going to get over this quickly,' he said on a special episode of The Project, a talk show in Australia.'If there is one thing we've done as chefs is we've united and have been talking about the good times,' he added. 'It's just so painful.'Jock Zonfrillo was found dead by Victoria Police at an address in the Melbourne suburb of Carlton on 30 April. The death is not being treated as suspicious.Ramsay paid tribute to the late Glaswegian MasterChef Australia judge with Jamie Oliver and Jock's former London mentor Marco Pierre White, who called him one of the great cooks of the century.",
        "The Sunday Project paid special tribute to the late Jock Zonfrillo ahead of the premiere of his final season of MasterChef Australia.Zonfrillo had already filmed the 15th season of the show, which was planned to premiere on 1 May.The release was postponed and fronted by The Project's special episode, reflecting on Zonfrillo's life.The hour-long tribute to Zonfrillo featured interviews with his friends and colleagues, as well as footage of him cooking and mentoring contestants. ",
        "Ramsay was brought to tears when he spoke about Zonfrillo, who he had worked with back in the 1990s in London.",
        "'It's just a shock, a massive shock. He was never done as a chef. He still had years to go,' he said.Ramsay said spending time with him on Masterchef was 'electrifying'.He added: 'Being in the environment together sort of took us back 20 years.'There is something quite amazing about two Scots coming together in Australia. It makes you happy at the end of the day.'There was always something quite of encouraging about the s**t we'd gone through to get to where we'd been.'Zonfrillo, the son of a barber and a hairdresser, was born in Glasgow and raised in Ayr, Scotland.He started working in kitchens at 12 and later took on an apprenticeship at The Turnberry Hotel in Ayrshire.The budding chef later moved to London and worked at the prestigious Restaurant Marco Pierre White.He had no place to stay and very little money to hand. He told AFR in 2019 that he arrived in London 'ever the optimist' and 'knocked on the door and thought \"It'll be fine. I'll get a job.\"'Speaking on The Project, Pierre White reflected: 'Jock came to me when he was 17 years old. His enthusiasm was greater than his knowledge, but it was that enthusiasm which drove him, maybe fuelled by his fears of failure, by his insecurities - which I could relate to.'",
        "'Very few chefs have an inquisitive mind, an intellectual mind and a creative mind. That's what makes him special, that's what makes him rare.'He added: 'He'll be greatly missed... he was a star in the true sense and that's why he has my vote to be one of the great cooks of the 21st century. He was special. He was rare.'",
        "Jamie Oliver said he remembers meeting Jock for the first time when he was 22 when he took his then girlfriend and now wife Jules to his restaurant.",
        "'It was me and Jules' first date weekend and we went there, and there he was, young Jock, 22 years old, head chef with a beautiful menu and beautiful food,' he said.'I remember it because it was the first time I remember being spoiled by another chef.'He came from really humble beginnings and he smashed it, just smashed it... we've lost a very, very bright star.'Nigella Lawson said her heart breaks for Zonfrillo's family.'My heart breaks - as I am sure everyone's does - for Jock's children and his family, and everyone who loved him,' Lawson said.'There's an old-fashioned phrase here but may his memory be a blessing.'Former neighbours also shared tributes and fond memories of Jock from his upbringing in Ayrshire, Scotland.",
        "Stories revealed details about the young boy, then known as Barry, who became the class clown because he hated going to school at Belmont Academy.His neighbours said they were proud someone from their community had gone on to international success as a chef. Jock's wife, Lauren Fried, called police when her husband failed to answer her calls.Officers found the chef in his bed, having died, and saw no signs of anything suspicious or unusual.Police formed the view the father-of-four had died of natural causes.Jock leaves behind his wife and their two young children, as well as his adult daughters from a past relationship."
    ]
}