{
    "articleURL": "/femail/article-12060001/Kate-Middletons-mum-chic-volunteering-day.html",
    "content": [
        "Kate Middleton put her best foot forward in a chic blue blouse in Slough today READ MORE: For all the latest Royal news, pictures and videos click herePrincess Kate looked incredible in a casual ensemble as she and the other Waleses enjoyed a day of volunteering for The Big Help Out.",
        "Kate looked ready to get stuck into the action in her baby blue ‘Liberty’ Frill Neck Silk Shirt from Really Wild Clothing, costing £129, which she paired with a practical yet chic pair of raven G-Shape Cargo skinny jeans from G-Star Raw.She previously wore the same style of jeans on a trip to Belize in 2022, and frequently opts for the casual trousers for more low key royal engagements.  She accessorised her outfit with a classic pair of brown 550 Chelsea boots from Blundstone and gold 'Mini Cupid' arrow-shaped earrings from Daniella Draper - a firm favourite of the Princess.The mother-of-three kept her long brown locks down naturally as she put her best foot forward to help out with the tasks at hand. ",
        "While Kate is known for her gorgeous looks when attending lavish occasions, today is just one prime example of how the Princess still looks amazing when dressed casually. ",
        "The Prince, 40, and Princess of Wales, 41, delighted volunteers this morning when they arrived at a local Scouts headquarters in Slough with their three children Prince George, nine, Princess Charlotte, eight, and Prince Louis, five.Following on from the Coronation concert last night, the family spent hours renovating some Scouts huts for local members to use. The Wales family were volunteering at the 3rd Upton Scouts Hut in Slough, Berkshire, as part of a nationwide day of volunteering to celebrate King Charles and Queen Camilla’s crowning.",
        "Their decision to bring their young family was kept secret until they arrived in order to minimise any fuss for the youngsters who are being slowly introduced to the idea of public engagements.The family were also insistent that the children get ‘properly stuck in’ and lend a hand - which they certainly did, The Prince and Princess and their children joined volunteers in renovating the Scout Hut, with works including resetting a path, digging a new soakaway, sanding and varnishing the front door, adding planters to the front of the building and adding a mural to create a lasting legacy of the Big Help Out’s work.The children set to work straight away with Charlotte and Louis helping to paint a planter and George joining his father with some drilling.The two youngest children knelt down, grabbing brushes dripping with white masonry paint, obvious to the fact that they were getting it on their hair and bare legs.",
        "The children worked away uncomplainingly while the Princess of Wales hovered over them, letting them do their worst. ‘Well done Louis!’ She said.When Kate tried to interject and advise Charlotte on what to do, her daughter said firmly but politely: ‘I don’t like this.’Charlotte told her brother: ‘You’ve got paint in your hair! Louis, look at me! Look at me! ’",
        "‘Yes Louis, look at Charlotte,’ the adult volunteer said.Louis seemed supremely unbothered.‘You’ve got to wipe it,’ Charlotte gently admonished him.‘It’s all going much quicker with you two helping out,’ the lady assisting them assured the children.‘Careful!’ Charlotte told Louis again as he got over-excited with his brush.",
        "Meanwhile, William and George both wielded drills on a wooden planter.‘So far it’s still holding together,’ joked the heir to the throne.George, dressed in chinos, trainers and a puffer coat, was the picture of concentration as he placed a screw carefully into a hole and drilled it in.Kate wandered over to her eldest son and asked him: ‘Have you ever used a drill before?’ It’s quite satisfying. How are you getting on George?’George pointed out to his mother what he was doing.The family then walked off, Kate holding Louis’ hand, to try their hand at another task.Charlotte rubbed at her legs to get the paint off.The 3rd Upton Scouts Hut was built in 1982 and is used by a variety of community groups in the area, including the local mosque, a senior citizens contact group for members of the Asian community and the Scout group themselves.",
        "The building is also used by ‘Slough All Nations,’ a group with heritage spanning across St. Kitts &amp; Nevis, and which provides recreation and leisure activities to improve health and well-being and promote community cohesion. The Princess of Wales has been Joint President of the Scouts since 2020.",
        "The Big Help Out has been created by some of Britain’s best-known charities from the Scouts to the Royal Voluntary Service, Rotary to the National Trust.In tribute to His Majesty The King's public service, The Big Help Out will encourage people to try volunteering for themselves and join the work being undertaken to support their local areas.The aim is to use volunteering to bring communities together and create a lasting volunteering legacy from the Coronation weekend."
    ]
}