{
    "articleURL": "/wires/reuters/article-12056413/As-seek-win-row-against-Royals.html",
    "content": [
        "After Oakland Athletics starters failed to record a win for a major league record 32 straight games to start the season, they've won the past two games.",
        "The back-to-back victories against the Royals have given the A's their first consecutive victories and their first series win of the season after losing their first 10 series. And they will try for three wins in a row on Sunday in Kansas City.\"I don't think the weight of not having won a series was impactful,\" Oakland manager Mark Kotsay said. \"But it definitely does feel good to get our first series win, especially the way we did it, a team effort.\"\"It tells us we can win,\" rookie Ryan Noda said. \"Hopefully, it sparks a fire for us and we keep it going to win every series.\"Noda has an on-base percentage of .427 and has walked 21 times this season. He reached safely nine times during the first two games against the Royals.\"That's my job, to get on base any way I can,\" Noda said. \"When I get on base, guys behind me tend to come up big for us.\"\"He's swinging the bat,\" Kotsay said. \"He's learned these big-league guys will attack you, they'll get ahead of you. So he's been a little more aggressive in the zone swinging at pitches. and that's created some results.\"The A's managed another one-run win Saturday, their sixth of the year. They are 6-7 in one-run games but 2-19 otherwise.",
        "Oakland's minus-120 run differential over their first 34 games is the worst to start a season by any major league team since 1901.Rookie right-hander Mason Miller (0-1, 3.52 ERA) will make his fourth career start Sunday. He has not pitched against Kansas City, who will send lefty Ryan Yarbrough (0-4, 7.40) to the mound.Yarbrough is 1-0 in four games against Oakland for a 5.63 ERA. The A's knocked him out of his lone start against them last year in the third inning. He collected a win against the Athletics with a six-inning relief appearance for the Tampa Bay Rays in 2019.Yarbrough will make his third start of 2023. He has lost three straight appearances and has struggled with long counts in his two starts, both losses, needing 157 pitches to complete a combined 7 2/3 innings.The Royals have dropped eight of their past 10 games as starters have a 13.02 ERA in the eight losses.But Kansas City's bats have come to life. They've scored 48 runs in the past eight games after averaging 3.19 runs per game over their first 26 games, including six shutouts.After drawing 73 walks over their first 31 games, Royals batters have shown more patience, getting 22 free passes in the past three games.",
        "\"That's a really good sign,\" manager Matt Quatraro said. \"The alternative is chase.\"Despite the offensive resurgence, the club has squandered several comeback attempts, stranding multiple late-inning runners. Kansas City left 22 on base while hitting .167 with runners in scoring position, dropping the first two games to Oakland.Salvador Perez leads the team with 18 RBI and shares the club lead with six homers. He is hitting .395 (15-for-38) with four homers over the past 10 games.Vinnie Pasquantino has reached safely in 50 of 53 games dating to Sept. 15, recording a .332 average and .420 OBP.--- Field Level Media"
    ]
}