{
    "articleURL": "/wires/reuters/article-12045819/UK-reviews-AI-models-rapid-growth-fuels-safety-concerns.html",
    "content": [
        "By Paul Sandle",
        "LONDON, May 4 (Reuters) - Britain's competition regulator said on Thursday it would start examining the impact of artificial intelligence on consumers, businesses and the economy and whether new controls were needed on technologies such as OpenAI's ChatGPT.While research on AI has been going on for years, the sudden popularity of generative AI applications such as ChatGPT and Midjourney has highlighted a technology that could upend the way businesses and society operate.Governments around the world are now trying to find a balance whereby they can assess and rein in some of the potential negative consequences of AI without stifling innovation.Britain in March opted to split regulatory responsibility for AI between those bodies that oversee human rights, health and safety, and competition, rather than creating a new body dedicated to the technology.The Competition and Markets Authority (CMA), which made headlines last week when it blocked Microsoft's $69 billion takeover of Activision Blizzard, said it would start work by seeking to understand how foundation models that use large amounts of unlabelled data were developing.CMA CEO Sarah Cardell said AI had burst into the public consciousness and was developing at speed.\"It's crucial that the potential benefits of this transformative technology are readily accessible to UK businesses and consumers while people remain protected from issues like false or misleading information,\" she said.",
        "The review in Britain echoes investigations taking place around the world, from Beijing to Brussels and Washington.Lawyer Alex Haffner at law firm Fladgate said the CMA would investigate under its general powers, and as such was likely to seek to better understand AI rather than take any enforcement action against individual companies.\"That said, viewed against a background in which the CMA is being given ever greater powers to investigate and hold Big Tech to account, this announcement only serves to reinforce the notion that CMA is determined to use those powers as broadly as it can,\" he said.The United States is looking at possible rules to regulate the technology and digital ministers from the Group of Seven leading economies agreed last month to adopt \"risk-based\" regulation on AI that would also preserve an open environment for the development of such technologies.Italy, a G7 member, took ChatGPT offline last month to investigate its potential breach of personal data rules. While Italy later lifted the ban, the move inspired fellow European privacy regulators to launch investigations.Lawyer Verity Egerton-Doyle at Linklaters said the review would give Britain's competition regulator the chance to join the debate.\"The EU's Digital Markets Act that came fully into force this week does not cover generative AI and the CMA no doubt sees this as an opportunity to be leading the global debate on these issues - along with the U.S. FTC which is already looking at the area,\" she said. (Reporting by Muvija M and Paul Sandle; Editing by Kate Holton, James Davey, Emelia Sithole-Matarise and Christina Fincher)"
    ]
}