{
    "articleURL": "/femail/article-12045667/I-dropped-school-aged-17-Im-RETIRED-millionaire-aged-22.html",
    "content": [
        "Hayden Bowles, from the US, said he retired at the age of 22 as a millionaireRead more:  'Nepo baby' mogul, 11, reveals the inside life of a millionaire childA high school drop out has revealed how he retired at the age of 22 after becoming a millionaire. ",
        "Hayden Bowles, from the US, has amassed 300,000 followers on YouTube and 100,000 on TikTok, where he often shares clips about how he built up a number of businesses in his late teens. He claims the businesses, which include a real estate portfolio and online courses about Performance Dropshipping and TikTok Ads Blueprint, have made him millions.In a recent TikTok video, he explained: 'I had started to make a pretty substantial income from my business when I was 17-years-old and that was in the E-commerce industry.'I still work, I love to work but I am technically retired because of the money I've set aside from real estate. The money that that pays me does support my lifestyle. ",
        "'[My businesses]  continued to grow and we added new branches to the company.'Wealth is a ratio between our income and our expenses. It's not a flat number.'After dropping out of school at 17, the TikToker claims he doesn't regret missing out on the 'crazy' experience of university.He founded Ecom Season, which is a platform which offers a number of different courses, which cost up to $575 and cover topics like 30 Day Ecom Academy and Ecom Remastered 2.0.In one video, he said: 'It's the same exact experience - all the stupidity of college but you take it up like 20 levels further because everyone has money'.",
        "Hayden has claimed he was making a 'substantial' income of £200k and by age 20 this had had quadrupled to £800k. He now claims he has raised over £16 million through his e-commerce focused businesses. In another video, he told his followers that the key to success is trying 'to have a singular focus'.",
        "He told fans to avoid splitting their attention between multiple ventures and focus on 'something scalable that you want to do long-term.'The influencer now regularly shares photographs from his luxurious holidays across the US, including trips to Hawaii and Vail.Meanwhile he also posts snaps alongside expensive cars and private jets.  He's not the first from the generation of Gen-Z to reveal the incredible wealth they've built up during their early adult life. Despite her young age, Mon Kumar, from Melbourne, is already financially savvy and has an impressive net worth of $219,000 - which is calculated by her total number of assets minus any liabilities.Over the past five years, Mon has been budgeting and working tirelessly but started learning how to invest when she was 20.'I realised that investing can allow you to be financially independent and give you the freedom to do whatever you want in life,' Mon told FEMAIL.",
        "'I started to invest seriously over the past year or so as I stumbled across the Financially Independent Retire Early (FIRE) community.'",
        "Mon said her strategy is to invest in a combination of high-growth Exchange Traded Funds (ETF's) and high yield ETF's to achieve high profit with minimal risk.While Mon studied a Bachelors degree in business at university, she learnt everything she knows about investing by listening to podcasts, reading books and watching YouTube videos.'I don't think you need a finance degree to understand how to invest,' she said.Since she was 20, Mon has also been working more than 40 hours a week on top of her university commitments, which she found challenging but beneficial.'Working long hours through university was extremely hard and if it weren't for my eagerness to save for a house deposit and achieving FIRE, I don't think that I would be able to do it,' she said.'Working more than 40 hours a week has allowed me to achieve my financial goals much faster that I would have expected and I have absolutely no regrets.'But her hard work and dedication paid off as she not only has a high net worth but in May 2020 Mon and her partner put down a $100,000 deposit for a Melbourne apartment worth $532,000.Mon's net worth includes her assets of superannuation, cash savings, home equity, investments and car minus her HECS debt and mortgage.",
        "Mon said investing will help allow her become financially independent and reach her goal of owning one million dollars by the age of 35."
    ]
}