{
    "articleURL": "/wires/reuters/article-12049385/Indonesia-Q1-GDP-beats-forecasts-consumer-govt-spending.html",
    "content": [
        "Q1 GDP +5.03% y/y, vs +4.95% in Reuters poll",
        "Govt says 2023 GDP on track for 5.3% growth targetExport growth slows to 11.68% y/y from nearly 15% in Q4(Adds minister, economists comments in paragraphs 8-10 and 14-15)By Stefanno Sulaiman and Gayatri SuroyoJAKARTA, May 5 (Reuters) - Indonesia's economy grew faster than expected in the first quarter, as consumer and government spending offset a slowdown in exports and investment in Southeast Asia's largest economy.Gross domestic product (GDP) expanded 5.03% in the January to March quarter from a year earlier, data from Statistics Indonesia showed on Friday. That was quicker than the 4.95% median forecast in a Reuters poll and the 5.01% growth in the fourth quarter.Indonesia's post-pandemic recovery has been helped by a commodities-led export boom, though analysts expect economic momentum to cool in the coming months as commodity prices ease and monetary tightening around the world hits global demand.\"We think the economy is set to struggle over the coming quarters,\" Capital Economics' analyst Gareth Leather said in a note, citing weakening exports and the impact of Bank Indonesia's (BI) tightening on demand. He forecasts the economy will expand 4.8% in 2023.BI's monetary tightening, including interest rate hikes totalling 225 basis points between August and January to fight inflation, could hit domestic demand.",
        "The central bank has paused tightening since and some economists expect it to keep interest rates unchanged for the rest of the year, although others argued concerns over growth may push BI to ease later this year.BI estimates Indonesia's economic growth to be at the upper end of a 4.5% to 5.3% range, down from 5.3% in 2022.Josua Pardede, Bank Permata's economist, expects growth of around 4.9% to 5% this year, with shipments of commodities moderating and foreign investment likely trailing off in the later quarters ahead of general elections due in February 2024.Chief Economics Minister Airlangga Hartarto described GDP expansion in the first quarter as solid, adding he remained optimistic the government's 2023 growth target of 5.3% could be achieved.\"Our economic prospect going forward remains quite strong,\" he said, noting high consumer confidence and purchasing managers' indexes, as well as easing inflation.CONDITIONS MET FOR RATE CUTIn January to March, growth in household consumption, which accounts for more than half of GDP, picked up slightly to 4.54%, compared with 4.48% in the previous three months, while government spending rose 4% against a contraction previously.Meanwhile, export growth softened to 11.68% from nearly 15% in the fourth quarter. The statistics bureau said shipments of coal, palm oil and metals had remained strong.",
        "Investment also slowed to 2.11% in the first quarter from 3.33% previously.Myrdal Gunarto, an economist with Maybank Indonesia, said BI should consider cutting interest rates with inflation already near its target range while the rupiah was strengthening.\"Prerequisites (for a rate cut) have been met: inflation is going down, rupiah is doing quite well and the economy needs a stimulant,\" he said.Inflation, which peaked at 5.95% in September last year, eased to just above BI's 2% to 4% target range in April. The rupiah, meanwhile, was emerging Asia's best performing currency, firming 6% against the U.S. dollar so far this year. (Reporting by Stefanno Sulaiman, Gayatri Suroyo and Fransiska Nangoy; Editing by Kanupriya Kapoor, Martin Petty and Jacqueline Wong)"
    ]
}