{
    "articleURL": "/news/article-12050369/Lib-Dem-leader-Ed-Davey-dodges-propping-Keir-Starmer-No10.html",
    "content": [
        "Lib Dem leader Ed Davey dodged questions over whether he would prop up Keir Starmer in power today after shocking the Tories in Windsor.",
        "Sir Ed hailed seizing control of the council as he visited the town, staging an awkward photo op with a large clock to show Rishi Sunak his 'time's up'.He said he was proud that Katy Perry and Lionel Richie would be performing in Lib Dem territory at the coronation concert this weekend. But he repeatedly ducked questions on what he will do if Labour falls just short of a majority at the next general election.The Lib Dems boasted about making inroads into the so-called 'Blue Wall' after a grim set of local elections for the PM.With results still flowing in, the Tories have lost control in Brentwood, Tamworth, North West Leicestershire, Hertsmere, East Lindsey, South Kesteven, East Hertfordshire and South Gloucestershire.The setback in Windsor was particularly striking as it is in the supposedly safe constituency of former leader Theresa May.  ",
        "Worryingly for Mr Sunak the pummelling has been coming in both 'Red Wall' areas and traditional heartlands.The premier tried to put a brave face on the 'disappointing' results this morning, insisting he would focus on the public's 'priorities' such as cutting inflation.  Labour celebrated victories in Plymouth, where the Tories had been running a minority administration, and Stoke-on-Trent - a key battleground ahead of next year's general election. They were also jubilant about a mayoral win in Middlesbrough.",
        "In Medway, where his party took charge to end 23 years of blue rule, Sir Keir hailed 'fantastic results across the country'. 'Make no mistake, we are on course for a Labour majority at the next general election,' he said. However, elections guru Professor Sir John Curtice said while the results were impressive for Sir Keir it remains unclear whether they are good enough to suggest he can win outright. That would require a massive swing owing to the scale of the Tory victory in 2019.Sir Ed was repeatedly challenged on Sky News over whether he would be willing to prop up Sir Keir in power if there was a hung Parliament.'I'm focused on beating those Conservative MPs and SNP MPs in Scotland, where I think the Liberal Democrats have a really good chance, and I'm increasingly confident about our ability to beat Conservative MPs at the next general election,' he said.'I don't think the Conservatives can be removed from Government if Liberal Democrats don't beat those Conservative MPs.'The Lib Dems were smashed at the 2015 election after five years in coalition with the Tories, meaning the party would be highly unlikely to agree to another formal alliance. However, there has been intense speculation about a tie-up to target the Conservatives at the next election, and support a minority Starmer administration.    ",
        "In Windsor, Sir Ed said: 'Voters across the country have sent a clear message in these local elections, a message so loud that even someone as out of touch as Rishi Sunak can't ignore it.'People are fed up with waiting hours for an ambulance, waiting in vain for the police to show up after a break-in, or for real action to bring down soaring energy bills and food prices."
    ]
}