{
    "articleURL": "/news/article-12056483/DeSantis-figure-distance-Trump-2018-debate-prep-footage-reveals.html",
    "content": [
        "Footage shows DeSantis being advised to write 'likable' at the top of his notepad at the debate podium because he has an 'aggressive' toneSources told ABC News that DeSantis' recent debate prep includes helping the Florida governor manage his facial reactionsDeSantis is preparing to enter the 2024 presidential race in coming weeks Florida Gov. Ron DeSantis will have to walk a fine-line after already juggling how to handle disagreements with highly divisive Donald Trump during the 2018 gubernatorial election, newly revealed debate prep footage shows.",
        "As DeSantis prepares to enter the 2024 presidential race in coming weeks, ABC News obtained two-and-a-half hours of debate prep with the candidate vying for his first term in the Florida State House.The footage includes two separate prep sessions, including one where an adviser told DeSantis he is 'aggressive' and should write 'LIKABLE' in all caps on the top of his notepad immediately after arriving at the debate podium.Sources say, according to ABC, that DeSantis' recent debate prep has included close attention on helping the governor manage his facial reactions.While DeSantis has not yet announced a run for president, he is already seen as the only one who can put up a good fight against Trump in the primary election.",
        "An off-camera adviser told DeSantis of his note-pad trick: 'I do the same thing, 'cause I have the same personality, we're both aggressive.''You want to have that likable, dismissive tone, and not condescending,' an adviser tells DeSantis at another point in the video.DeSantis responds: 'Yeah, definitely.'Advisers for DeSantis' 2018 debate prep included Rep. Matt Gaetz and then-State Rep. Byron Daniels role-playing as his opponent.'Is there any issue upon which you disagree with President Trump?' Gaetz asked DeSantis, according to ABC News' review of the mock-debate sessions.",
        "'I have to figure out how to do this,' then-Congressman DeSantis sighed. 'Obviously there is, because I mean I voted contrary to him in the Congress.'He added: 'I have to frame it in a way that's not going to piss off all his voters.'DeSantis said he would probably answer any questions related to his alignment with Trump by saying he would 'support his agenda' but always 'do what I think is right.''If I have a disagreement, I talk to him in private,' he said.In the 2018 Florida gubernatorial election, DeSantis beat Democratic nominee and then-Tallahassee mayor Andrew Gillum by just 0.4% in what was seen as largely a toss-up to take outgoing Gov. Rick Scott's seat.",
        "Trump credits his December 2017 endorsement in the primary election against Adam Putnam for DeSantis' win after trailing in the polls throughout the cycle. When asked during the campaign if he could name an issue with which he disagreed with Trump, DeSantis did not identify one.The former president said earlier this year it would be 'very disloyal' if DeSantis launched a primary bid in 2024.During one-point in the 2018 debate prep sessions, DeSantis said he would 'look like an a**' if he were to attack his opponent the way in which he was being advised.",
        "'Some of the ones that are digs, I don't think they work,' DeSantis, who is off camera at this point, is heard saying.'I think it makes me look like an a**,' he added."
    ]
}