{
    "articleURL": "/wires/ap/article-12060671/As-Trump-probes-intensify-foes-ex-president-opening.html",
    "content": [
        "WASHINGTON (AP) - An investigation into Donald Trump's handling of classified documents has intensified in recent weeks, with prosecutors summoning a broad range of witnesses before a federal grand jury and zeroing in on questions of whether the former president or others obstructed government efforts to recover the records.",
        "It remains unclear when the investigation led by Justice Department special counsel Jack Smith might end or whether Trump might face charges over documents found at Mar-a-Lago, his Florida estate. But as probes in Washington and Atlanta proceed, Republican critics of Trump see an opportunity for intensifying legal woes to take away his frontrunner mantle in the 2024 presidential race in a way that an earlier indictment in New York failed to do.The ongoing investigations \"are the ones that have the meat,\" said Bobbie Kilberg, a longtime Republican donor who has become a vocal Trump critic.\"It´s very, very serious,\" she said. \"It ought to have a real impact on the American people. And if it doesn´t, all I can do is shake my head in bewilderment.\"A grand jury in the Mar-a-Lago case has heard testimony over the last few months from numerous Trump associates. Prosecutors have put before the panel a lawyer who helped respond to Justice Department demands for the classified documents last year, and have also been interested in Mar-a-Lago surveillance footage. At least one witness was asked to testify a second time, suggesting prosecutors may be looking to lock in particular testimony they view as useful, according to a person familiar with the matter who spoke on condition of anonymity to discuss secret legal proceedings.",
        "In a message Friday on his Truth Social platform, Trump accused Smith of \"harassing and threatening my people\" over the documents investigation, which he called a \"hoax.\" His lawyers have similarly sought to pre-emptively attack any indictment, telling the House Intelligence Committee in a letter last month that the Justice Department \"should be ordered to stand down\" from the probe.",
        "Trump spokesman Steven Cheung said in a statement to The Associated Press on Monday that the investigations are \"nothing more than a targeted, politically motivated witch hunt against President Trump\" designed to prevent him from returning to the White House.Investigators over the last year have cast a wide net. They've interviewed witnesses about Trump´s handling of classified documents as president and about the response to a May 2022 subpoena that demanded the return of classified materials in his possession, people familiar with the matter have said. They've also sought to determine whether Trump took steps to hide any records taken to Mar-a-Lago or showed them to anyone, as part of a continued focus on possible obstruction.Among the witnesses who recently testified was Matthew Calamari Jr., the director of security at Trump Organization, Trump´s company, according to one of the people.His testimony could be relevant because of prosecutors' subpoena to the Trump Organization last year for surveillance footage from the Palm Beach property. Video reviewed by prosecutors showed a Trump associate moving boxes of documents out of a Mar-a-Lago storage room, prosecutors have said. Other media organizations reported that Calamari´s father, also named Matthew Calamari, a Trump organization executive vice president, testified last week too.",
        "A moment that underscored the gravity of the case came in March when Smith's team secured the testimony of Trump lawyer M. Evan Corcoran after convincing a judge in sealed proceedings that Corcoran's legal services had been used in furtherance of a crime.Corcoran helped draft a letter last June to the Justice Department attesting that Trump's team had conducted a \"diligent search\" for classified documents at Mar-a-Lago in response to the government's subpoena. At that time, the Trump team produced roughly three dozen classified documents, on top of 15 boxes of records returned in January 2022 to the National Archives and Records Administration.But prosecutors suspected even more classified records remained. They obtained a search warrant last August and seized more than 100 additional documents.In their letter, Trump's lawyers said that Corcoran expected investigators to return to Mar-a-Lago to go through any boxes of documents that remained, and that he and Trump \"understood this to be the beginning, not the end, of working cooperatively.\" Though the letter was addressed to lawmakers, it presumably includes arguments the lawyers would make to try to head off any potential indictment.Prosecutors on Smith's team have simultaneously pressed forward with a separate probe into efforts by Trump and allies to overturn the results of the 2020 election, winning court orders to question key advisers and aides before the grand jury. Among the witnesses to appear was former Vice President Mike Pence, who two weeks ago spent hours inside the Washington courthouse.",
        "In Georgia, prosecutors in Fulton County are investigating whether Trump or anyone else committed crimes in trying to undo his narrow loss in that state to Democrat Joe Biden.The investigations are in addition to the March indictment from the Manhattan district attorney arising from hush-money payments during Trump's 2016 presidential campaign to a porn actor who alleged an extramarital sexual encounter with him years earlier.Though a blow legally, the indictment seemed a boon for Trump in the Republican Party's evolving presidential primary contest ahead of the 2024 election. Trump's standing in the GOP had been slipping until he was charged, when suddenly, Republicans across the political spectrum rushed to defend him against what they framed as a questionable, politically motivated prosecution.Today, polling suggests that Trump is the dominant frontrunner in the GOP´s growing 2024 field.Florida Gov. Ron DeSantis, Trump´s chief primary rival, has struggled to maintain the same level of strength he wielded prior to Trump´s indictment. But as the governor prepares to launch his campaign officially, his allies are quietly confident that Trump´s baggage will eventually catch up to him.Former Georgia Lt. Gov. Geoff Duncan, a frequent Trump critic, described the New York indictment as \"somewhat of a swing and a miss.\"But any further indictments prosecutors might bring, Duncan said, \"are going to be a whole different amplitude that he´s gonna have to deal with.\"",
        "___Peoples reported from New York."
    ]
}