{
    "articleURL": "/wires/ap/article-12039277/Bye-bye-blue-flame-NY-require-gas-free-new-buildings.html",
    "content": [
        "ALBANY, N.Y. (AP) - New York state is banning natural gas stoves and furnaces in most new buildings, a policy that's part of a national movement aimed at reducing greenhouse gas emissions.",
        "The law negotiated by Gov. Kathy Hochul and her fellow Democrats in the Legislature is part of the state budget and puts New York in the forefront of states targeting emissions from buildings. When the phase-in starts in 2026, newly constructed buildings will have to forego fossil fuel equipment in favor of devices like induction ranges and heat pumps that run on electricity.The state mandate applies only to new construction and does not affect existing buildings.\"I want to be very clear. I know people love to misinterpret this, but people with existing gas stoves, you´re welcome to keep them,\" Hochul told reporters Tuesday, before lawmakers began voting on the budget.\"This is where our nation has to go eventually,\" she said \"But I want to make sure that it´s not a bumpy road to the transition.\"The budget bill with the ban was approved by lawmakers Tuesday night. Other budget bills still needed to be considered.Government efforts to wean society off of fossil fuel-burning equipment - especially gas stoves - have been slammed by Republican officials and other opponents as heavy-handed infringements on consumer choice. But environmentalists say climate goals can't be reached without addressing homes and businesses.The new construction mandate avoids - at least for now - the more politically fraught issue of replacing existing fossil fuel equipment. But critics say it will add costs to new construction and put more strain on the electrical grid, while still limiting options for buyers of newly constructed homes.",
        "\"Why shouldn´t people have a choice on how to heat their home?\" asked Republican Assemblyman Phil Palmesano.The measure will prohibit the installation of fossil-fuel equipment in new buildings, starting in 2026 for structures of seven stories or less. The ban for larger buildings starts in 2029.There are number of exemptions, such as for emergency backup power and for commercial food establishments, laboratories and car washes.Advocates say New York is the first state in the nation to adopt such a law. Though Washington state recently approved codes that will require the installation of heat pumps in most buildings.Also, more than 80 local governments in the United States have approved all-electric new construction requirements, with many of them municipalities in California, according to the Building Decarbonization Coalition.New York City begins phasing in its rules for all-electric new construction next year.The focus on new construction - instead of existing buildings - is seen as a logical first step to meet broader emissions reduction goals. New York´s long-term emissions goals include a 40% reduction by 2030 and an 85% reduction by 2050, compared to 1990 levels.\"In some ways, this is the technological low-hanging fruit,\" said Liz Moran of Earthjustice. \"One of the easy things for the state to do is to ensure that we aren´t locking ourselves into more dependance on fossil fuels.\"",
        "Heat pumps transfer heat from a source - such as outside air or geothermal energy stored in the ground - to warm up interior spaces or water. Though upfront costs can run well over $5,000, proponents say heat pumps can be less expensive to operate than fossil fuel in the long run.Critics question whether heats pumps can keep people warm in places with frigid winters, like upstate New York. Experts say models on the market today can perform when temperatures drop well below zero.In Syracuse, New York, Walter Putter said his unit has worked well through multiple winters, though he used an electric heater element built into the system for an added boost when the overnight low plunged to minus 12 this winter.Putter, who heats and cools his five-bedroom home with a heat pump. He has a separate heat pump for heating water, as well as roof-top solar panels.\"My wife was skeptical that the house would stay warm without some sort of fire burning in the basement,\" Putter said. \"But she´s convinced.\""
    ]
}