{
    "articleURL": "/news/article-12052259/Moment-Donald-Trump-mistakes-rape-accuser-E-Jean-Carroll-ex-wife-Marla-Maples.html",
    "content": [
        "Trump was shown a picture of Carroll and her husband speaking to him at an event in the 1980sHowever he claimed that she was actually his second wife, Marla Maples, before being corrected by his lawyerTrump has vehemently denied the allegations and has yet to attend the civil trial after two weeks of testimony in ManhattanDonald Trump mistook his rape accuser for his ex-wife Marla Maples in a deposition played for jurors in his civil case.",
        "Lawyers for E Jean Carroll released a portion of the former president's interview in which he wrongly points to an image of his rape accuser and claims it is his wife.In the footage Trump is shown a photo of himself speaking to a group at an event, and is asked who the others in the video are.He replies: 'I don't even know who the woman – it's Marla. That's Marla, yeah. That's my wife.'But he is then corrected by his lawyer who says 'it's Carrol' before he goes on to say the photo is 'very blurry'.",
        "The photo shows Trump in a late 1980's photo of him with his then-wife Ivana, Carroll and her husband John Johnson. Carroll, 79, has accused the former president, 76, of raping her inside a changing room at Bergdorf Goodman in Manhattan in the mid-1990s.Trump has vehemently denied the allegations and has yet to attend the civil trial after two weeks of testimony in Manhattan.Lawyers for the American journalist are claiming that Trump's confusion over the photo undermines his previous comments that Carroll is 'not his type' – something he has repeated since she made the claims in 2019.Jurors in the federal civil trial watched the deposition video which included Trump reiterating his claim about Carroll's appearance and insisted the allegations are made up.",
        "He said: 'I say with as much respect as I can but she is not my type. Not my type in any way, shape, or form.'Trump later told Carroll's attorney Roberta Kaplan that he would not 'have any interest' in her either.He said: 'You wouldn't be a choice of mine either, to be honest with you, I hope you're not insulted.'",
        "It also shows Trump calling her lawyer a 'political operative' and a 'disgrace.' Trump suggested that he would come back from a golf trip in Ireland to 'confront' Carroll in court, saying: 'I'll be going back early because a woman made a claim that is totally false, it's fake.'But his lawyer Joseph Tacopina told the judge that he would not testify in court, or call any witnesses on his behalf.The judge ruled that Trump would have until Sunday afternoon to decide, explaining that after that 'the ship has irrevocably sailed'.Nine members of the jury were shown the deposition footage, which was filmed last October,  showing the 2024 hopeful become combative during the interview.Speaking of the alleged incident he said:  'If it did happen, it would have been reported within minutes,', before suggesting that others at the 'very busy store' would have heard an ongoing attack.",
        "Carroll told jurors she was left 'unable to ever have a romantic life again' after the alleged attack.",
        "Her account was supported in court by her friend, Lisa Birnbach, who testified to receiving a call from Ms Carroll minutes after she says she was raped.Jessica Leeds and Natasha Stoynoff were also called by Carroll's team and described alleged sexual assaults committed by Trump - claims he has denied.Natasha Stoynoff cried as she told the court how Trump pushed her up against a wall and kissed her at Mar-a-Lago in 2005.Stoynoff said that after a butler walked in they went back to the photo shoot where Trump promised to take her for a steak meal and give her the 'best sex you'll ever have.'She cried as she told the Manhattan jury that the story was to celebrate the first anniversary of Trump and Melania's wedding.On a break between photoshoots as Melania got changed, Trump said he wanted to show her a 'really great room' and led her to a different part of the building.At the time Melania was pregnant with their son Barron, who is now 17.",
        "Stoynoff, who became emotional a second time, told the jury: 'I'm thinking wow, really nice room and I hear the door shut behind me.",
        "'By the time I turned around he had his hands on my shoulder and was pushing me against the wall and kissing me. I tried to push him away.'He came toward me again and I tried to shove him again. He was kissing me. He was against me, just holding my shoulder back.'I didn't say any words. I was in shock. No words came out of my mouth. I remember just sort of mumbling.'A butler came in and said that Melania had finished changing and was ready to resume the photoshoot and Trump left.Stoynoff said she gave the butler a 'get me out of here' look and felt he understood what she meant.But back at the pool area Trump told her: 'Oh you know we're going to have an affair. Don't forget what Marla said,' referring to his second wife, Marla Maples.",
        "'Best sex I ever had,' Trump added, referring to an infamous front page about Maples.She didn't tell her senior bosses as she felt 'ashamed and humiliated' and didn't want to cause trouble for the magazine, but she asked never to cover Trump again and her editors obliged. Jessica Leeds, 81, claims that Trump groped and kissed her on a flight from Texas to New York in 1979.",
        "She told the jury that it felt like he had a 'zillion hands' as he put his hand up her skirt until she fought him off.Given a copy of Carroll's 2019 memoir in which she accused him for the first time, Trump flicked through it dismissively and looked bored.He was read a number of statements he put out in 2019 denying Carroll's story and was asked if he stood by them today.Trump said he did because the story was 'the most ridiculous, disgusting story, just made up.'Carroll was able to bring the civil case against Mr Trump after New York passed the Adult Survivors Act in 2022, which allows victims to file sexual assault lawsuits over claims that would have normally exceeded statute limitations."
    ]
}