{
    "articleURL": "/wires/ap/article-12051853/Biden-taps-WH-aide-Neera-Tanden-domestic-policy-adviser.html",
    "content": [
        "WASHINGTON (AP) - President Joe Biden announced Friday that he has chosen Neera Tanden, a veteran Washington insider who currently serves as White House staff secretary and senior adviser, to be his new domestic policy adviser.",
        "Tanden will be the first Asian American to lead any of the three major White House policy operations, he said. She will succeed Susan Rice, a longtime foreign policy expert who surprised Washington by shifting to a domestic policy focus when she joined Biden's White House.In her current role, Tanden has overseen decision-making involving his domestic, economic and national security teams. He cited her 25 years of experience in public policy, her past work for Presidents Bill Clinton and Barack Obama and her tenure running the liberal-leaning Center for American Progress, one of the country's largest think tanks, for nearly a decade.She also helped write the Obama-era Affordable Care Act health care law.Biden initially had nominated Tanden, the daughter of immigrants from India, to become director of the White House budget office, a position that requires Senate confirmation.She eventually withdrew from consideration after encountering unexpected strong opposition from key Republican and Democratic senators over the tone and language she used in some of her tweets - including some that were directed at lawmakers.",
        "Biden on Friday noted that Tanden, while growing up, had relied on programs she will oversee in her new role running the Domestic Policy Council, such as food stamps and public housing assistance, after her parents divorced. He said her lived experience would inform her future work.",
        "\"I know those insights will serve my administration and the American people well,\" Biden said.Rice is stepping down after two years running the Domestic Policy Council. Her last day at the White House will be May 26."
    ]
}