{
    "articleURL": "/tvshowbiz/article-12042183/Ed-Sheeran-gives-fans-glimpse-3-7m-Suffolk-estate-Disney-documentary.html",
    "content": [
        "READ MORE: Ed Sheeran breaks down in tears as wife Cherry admits she feared she would die when doctors told her they couldn't treat cancerEd Sheeran has given fans a rare glimpse of his £3.7 million Suffolk estate, dubbed 'Sheeranville' in his new Disney+ documentary series.",
        "The four-part series was predominantly filmed at the singer's vast home where he resides with wife Cherry Seaborn, with viewers getting a chance to see the vast array of rooms in his home.Among the highlights in Ed's huge home are his own recording studio where he penned his most recent album Subtract, which is set to be released on May 5, and his own pub called The Lancaster Lock.The star's documentary series, titled Ed Sheeran: The Sum Of It All, offered insight into his recent struggles in the lead-up to his new album, including his wife Cherry being diagnosed with cancer while she was pregnant with their second child.He also broke down in tears during the series while reflecting on his close pal Jamal Edwards' death, admitting he had 'never experienced' grief until his shock passing.",
        "Ed is said to own 27 properties in London as part of his impressive £57million portfolio, but the highlight is his huge estate of land in Suffolk.The star, who is worth around £200million has slowly been accumulating the land around his home in Suffolk, turning it into what has become known as 'Sheeranville'. The documentary showed viewers the rustic yet modern kitchen, decorated with colourful artwork and sleek marble worktops.Given his vast list of celebrity pals, it was no surprise that Ed was joined by his pal Stormzy during the series, with the pair chatting together in his kitchen. ",
        "The star's living room includes a vast vintage piano, and Ed also showcased a particular canvas he'd made, joking it's 'what his head looks like inside.'Ed's home also boasts a private recording studio where he pens his of tracks, decorated with photographs of his family and friends.His estate boasts sprawling fields of land surrounding his home, with a rustic wooden treehouse in one area, and a vast swimming lake in another.The documentary showed Ed and Cherry plunging into the lake for a relaxing swim, and enjoying a stroll in the remote fields surrounding their home.",
        "One clip from the series showed Cherry in a private study, showing viewers a huge frame consisting of postcards Ed had sent his wife while he was travelling.The highlight of Ed's home is his own pub in the grounds, where he has previously conducted Zoom interviews during the Covid lockdown.The documentary showed the pub adorned with glasses, sports memorabilia, flags and working beer pumps, built in a log cabin style space.In the moving documentary, Ed tearfully reflected on his wife Cherry's cancer diagnosis in 2022, while she was pregnant with their second child.Doctors discovered Cherry, 30, had a tumour in her arm in February last year while she was six months pregnant with their second child, daughter Jupiter. ",
        "In his Disney+ documentary, The Sum Of It All, the couple recalled their 'horrible' start to 2022 which saw Cherry battle cancer, Ed's best friend Jamal Edwards die suddenly and a court case launched over his song Shape Of You, where Ed was accused of plagiarising and which he later won. 'I got diagnosed with cancer at the start of the year, which was a massive s*****r,' Cherry said of why she said yes to letting the cameras into their notoriously private life.  'But it made me massively reflect on our mortality. We're all human. I was saying to Ed I would have never agreed to do anything like this but it made me think, this whole year \"If I die, what's people's perception of me? What do you leave behind?\". 'For Ed he wants to say \"I'm not just this music machine, a robot trying to get number ones. I'm a father. I'm a son, husband, friend\". And I've massively reflected. It wasn't until this year where I thought \"I might die\". It was horrible.'When Cherry first sought medical help, she was initially told by a doctor 'this is really bad' and that she had cancer.The mother-of-two immediately rang Ed telling him to cancel all of his plans, while they waited an agonizing month long wait for the full report. ",
        "But Cherry, who was six months pregnant at the time, was told there were no treatment plans that would work with her pregnancy. After a sequencing test was done on the tumour, the couple found it was much less severe than what was thought originally and surgery could be done after she had given birth to Jupiter. Cherry said: 'It was the most incredible news. I nearly threw up when the surgeon told us we could wait to the end of the pregnancy to get the tumour out. 'We didn't have to worry about delivering the baby early.' But the couple faced the most devastating blow, when a day later, Ed's best friend Jamal died suddenly aged 31. ",
        "'I was hit by heavy stuff one after the other. They found a tumour in Cherry's arm. The diagnosis wasn't good,' Ed said. 'She was pregnant and they can't do anything. Then suddenly I'm in this three week court case. Then Jamal dies. 'The moment you find out that the worst thing in the world has happened to someone you truly love with all your heart, you feel like you're drowning and can't get out from under it. 'I remember being sat in this specialists waiting room thinking the worst was going to happen. I'm worried about Cherry. ",
        "'The unborn daughter, that's in her. You start writing a song and you vent a little bit and that's why songs get written.' His wife Cherry also admitted that Ed hadn't 'processed' Jamal's loss adding: 'The difficult thing about grief is everyone rallies around you at the start, six months down the line that wears off. 'Everything's been so busy and there's an attitude, especially in Brtian, of carrying on. I'm in a much better place from a processing perspective. I don't think Ed is there yet. 'There's no way he had time to process and be at peace with things. He's been too busy. He needs to stop. He needs to process, he hasn't processed at all.'Ed and Cherry went onto welcome Jupiter and announced her arrival in May with a sweet Instagram post. The couple are also proud parents to Lyra, two. Later in the documentary, Cherry gave an update on her health after going for a check-up appointment months after the initial surgery - and was thrilled when she was told the tumour hadn't come back. She said: 'Yesterday I had follow up scan in my arm to see if the tumour had come back. We were silent in the car as we were worried it would be bad. ",
        "'It was super triggering being in the same room when things weren't so positive at the start of the year. The surgeon looked at the scans and it all looks good. The Lymph nodes have all calmed down. That was amazing. it was massive for us.'Sheeranville is not without controversy with Ed clashing with his neighbours in the past.",
        "Ed Sheeran broke down in tears while reflecting on his close pal Jamal Edwards' tragic death in his new Disney+ documentary series.",
        "The star has been involved in several legal disputes over his rights and his neighbours' rights to expand their respective landmasses.Last year Ed's neighbour, Anthony Robinson, won a battle against the superstar who rejected Mr Robinson's plans to extend his back garden.Mr Robinson, who lives three houses along from the pop star's estate, was given permission to make his back garden 160 feet bigger despite Ed's objections.   Mr Robinson already owned the field behind his four bedroom home - which is worth £550,000 - and wanted to incorporate some of it into his private garden.But Ed, who had undertaken his own vast building project just a few hundred feet away, did not want the space to be domesticated.He claimed it would 'extend the village into the countryside in an unplanned and artificial way'.Although the council objected to Mr Robinson's proposal initially many neighbours wrote in to support him and his plans were eventually approved.    Last June the singer had to fight to be able to keep the 16ft pub sign he had hung outside a barn converted into a drinking den. Although he had been given planning permission for the pub in 2017 he had not been given permission for the sign which caused locals to question why it was there. Sheeran was also told he could not swim in his wildlife pond after he was granted permission to build it under the condition that it was used to provide a natural habitat for frogs, newts and dragonflies.The council visited his property and specifically forbade 'recreational leisure such as swimming'. He was also forced to remove his outside sauna, in a caravan next to the pond, after neighbours complained.   Ed bought his first home in the site, a new build, for around £900,000 back in 2012.   ",
        "Ed Sheeran has accumulated an unbelievable 27 properties since 2012, both within and outside of London:. To date, his portfolio includes:  'Sheeranville' country estate (£3.7m) A Holland Park mansion (£19.8m)Two Covent Garden flats (£7.36m)Three in Battersea (£1.72m) Five apartments in Wiverton Tower in Whitechapel (£3.9m)Three properties down Findon Road in Hammersmith (£1.76m)Four other assets in Holland Park, Kensington (£11.25m)Three on Portobello Road (£2.64m)Two in Chiswick (£3.68m)  "
    ]
}