{
    "articleURL": "/tvshowbiz/article-12044481/DJ-Tigerlily-divides-fans-PETA-ad-comparing-dairy-farming-stealing-children.html",
    "content": [
        "Tigerlily has divided fans after partnering with animal rights organisation PETA for a confronting campaign promoting a vegan lifestyle.",
        "The blue-haired DJ, 31, who is pregnant with her first child, poses for a photo shoot while cradling her baby bump as tears fall down her face, smudging her mascara.There is a toy cow in a baby's crib in the background, and the accompanying text warns of the supposed cruelty of dairy farming.'What if they took your baby away? The dairy industry steals calves from their mothers. Go vegan,' it states in bold letters.Many of Tigerlily's Instagram followers have criticised the campaign as 'problematic'.",
        "The accompanying caption states calves are 'stolen' from their mothers so dairy farmers can harvest their mothers' milk.Fans flocked to the comments section of Tigerlily's Instagram page to debate the ad.'This seems like an incredibly problematic campaign to me,' one said, before going on to explain how comparing farming to stealing children is insensitive in light of the Stolen Generations.'Saying \"imagine they stole your baby\" like it's some outrageous concept. Let's not forget the babies and children that were stolen from their families during colonisation, and the babies and children that are still removed at alarming rates within Aboriginal communities,' they added.",
        "Another slammed Tigerlily, who is vegan, for using her pregnancy to push PETA's agenda.'Such a joke and sad using your child as a way to push your own agenda,' they said, while another  simply wrote: 'Unfollowing.' ",
        "Others stuck up for the mother-to-be, with one echoing her sentiment by saying: 'Ditch dairy, people! It's cruel and unnecessary.'",
        "Another supporter wrote: 'Thank you for being an angel for animals.'Someone else commented: 'Well said, Tigerlily! Absolutely true. I grew up on a dairy farm, and the bellowing of the mothers as they searched for their newborns still haunts me.'It comes after the animal rights activist, who is expecting a child with husband Scott Lawson, revealed she would not be raising her child completely vegan. When quizzed during an Instagram Q&amp;A, Tigerlily said she would teach her child about veganism but ultimately wanted them to make their own choice."
    ]
}