{
    "articleURL": "/wires/reuters/article-12052983/Volleyball-Olympic-champion-surprised-five-year-ban-post-threatening-Brazilian-president.html",
    "content": [
        "May 5 (Reuters) - Olympic volleyball champion Wallace de Souza, who was banned for five years after writing a post on social media in which he appeared to endorse violence against President Luiz Inacio Lula da Silva, said on Friday his punishment was disproportionate.",
        "Wallace was originally suspended by the Brazilian Olympic Committee's Ethics Commission (CECOB) for a year from representing the Brazil national team and for 90 days from national competitions.Yet the sanction was increased on Tuesday after he played for his club Cruzeiro in last Sunday's Super League final.An Instagram follower of the athlete asked him on the social media platform in January if he would \"shoot Lula in the face with a 12 (caliber gun).\"Wallace, who won gold for Brazil at the Rio de Janeiro Olympics in 2016 and is a longtime supporter of former far-right President Jair Bolsonaro, responded with a poll asking his followers if they would go through with it.He later deleted the post and uploaded a video apologising, saying he would never suggest violence or hatred towards anyone and calling the post a mistake.\"I was quite surprised. Five years is a long time. Today I'm 35, this year I'll be 36. If it really happens, theoretically it's over for me,\" Wallace told local media outlet Globo on Friday.\"I deeply regret having done this. I made a mistake, like anyone else,\" he added.Wallace was set to miss the Super League final but the Brazilian Volleyball Confederation took his case to the Brazilian Centre for Mediation and Arbitration, which ruled in favour of the player, allowing him to play in the match.",
        "That decision was backed by an injunction granted by Brazil's Superior Court of Sports Justice for Volleyball.The CECOB, however, dismissed those decisions and increased the ban after Wallace took part in the match.It also sanctioned the Confederation for allowing Wallace to play, suspending its interim president, Radames Lattari, for one year and withdrawing public funds for the next six months.Wallace said he will not retire, and will appeal the sanction ultimately to the Court of Arbitration for Sport (CAS).\"I will not stop playing. I think I still have a chance of playing outside Brazil, so I won't stop.\" (Reporting by Angelica Medina in Mexico City Editing by Toby Davis)"
    ]
}