{
    "articleURL": "/wires/reuters/article-12038437/Chevron-export-earnings-boost-supply-US-dollars-Venezuela-sources.html",
    "content": [
        "By Mayela Armas",
        "CARACAS, May 2 (Reuters) - Some of U.S. oil major Chevron Corp's export earnings from its Venezuela operations are bolstering supplies of U.S. dollars in the South American country, three sources with knowledge of the matter told Reuters.Chevron operates in Venezuela, which is under U.S. sanctions, with special authorization from Washington. It received and exported about 148,000 barrels per day of Venezuelan heavy crude to the U.S. in April.Chevron brings back some of its export earnings to Venezuela, exchanging them for the hugely devalued bolivar currency so it can pay taxes and other local expenses, the three sources said, as the government keeps the exchange rate stable in a bid to control inflation.\"Chevron has to meet its commitments in bolivars ... it needs resources in Venezuela for the production at its fields to rise,\" said Asdrubal Oliveros, director of local analyst firm Ecoanalitica.Since February the company has offered between $20 million and $30 million each week at exchanges run by private local banks, two of the sources said.\"We continue to conduct our business in compliance with all laws and regulations, as well as the sanctions framework provided by the U.S. Office of Foreign Assets Control,\" Chevron said in response to a request for comment. \"Our focus is on supporting safe and reliable operations.\"",
        "The central bank also sells dollars, mostly the product of oil sales. Exchanges are largely made with companies.According to local consulting firm Sintesis Financiera, the central bank offers between $40 million and $50 million per week.Private banks do not typically share the total amount offered on their exchanges.The central bank did not respond to requests for comment.\"Chevron will remain a stabilizing factor if it continues covering 20% of the demand for foreign currency attended by banks and surely it will alleviate the burden of intervention of the central bank,\" Sintesis Financiera said in a report.In an effort to control rampant inflation, Venezuela's government has been injecting dollars into the economy to stabilize the exchange rate, along with public spending cuts and credit restrictions.The strategy kept inflation in the single digits for nine months in 2022, but there are not enough dollars on the market to meet demand and authorities are unwilling to modify the exchange rate, the sources said.The government releases inflation data sporadically, but the non-governmental Venezuelan Finance Observatory says annual inflation is 500%.The government's need for dollars to buoy up the exchange rate and enable government largesse ahead of 2024 elections is among the motives for a crackdown on alleged corruption at state oil company PDVSA, sources told Reuters in March.",
        "The loosening of sanctions is the United States' top bargaining chip in its efforts to motivate the government of Nicolas Maduro to return to talks with the country's opposition meant to lead to free elections. (Reporting by Mayela Armas, additional reporting by Sabrina Valle in Houston Writing by Julia Symmes Cobb Editing by Marguerita Choy)"
    ]
}