{
    "articleURL": "/wires/aap/article-12049247/Australia-stun-defending-champs-South-Korea-Crown.html",
    "content": [
        "Australia have caused one of the major upsets in women's golf by surprising defending champions South Korea on the opening day of the International Crown team event in San Francisco.",
        "Hannah Green and Sarah Kemp followed by Minjee Lee and Steph Kyriacou stunned the Koreans on Thursday, winning both their matches to lift Australia to joint first in Group B.Failing to make an impression in the three previous editions of the event where Australia's best finish was sixth, Thursday's surprise win is bound to make top-seeds the United States take notice.Green, fresh from her LPGA victory in Los Angeles, teamed up with Kemp for a 2 and 1 win over Hyo Joo Kim and Jin Young Ko.Lee and Kyriacou then consolidated the lead with a 2-up victory over Hye-Jin Choi and In Gee Chun.\"I'm not surprised that this happened,\" Kemp said. \"We had a great time last night. We've had a great week.\"We're just all having a good time and it's just - it doesn't surprise me that we did what we did today.\"But for my first day of my first International Crown to start like this is pretty awesome.\"Sixth-seeded Thailand swept both matches from No.3 seeds Japan to join Australia.Sisters Moriya and Ariya Jutanugarn beat Nasa Hataoka and Hinako Shibuno 2 up, while Patty Tavatanakit and Atthaya Thitikul overcame Yuka Saso and Ayaka Furue 1 up.Nelly Korda and Lilia Vu rallied on the back nine to help the United States earn a split point against China in Group A.",
        "\"It was pretty much a grind but then we kind of ran away with it toward the end,\" Korda said, after they trailed by one at the turn.Lexi Thompson and Danielle Kang lost the other match to Ruixin Liu and Yu Liu, who won 1 up.Sweden won both matches against England in the other Pool A showdown.The International Crown is a match-play tournament featuring teams of four golfers from eight countries.The teams are divided into two pools of four countries with the top two from each group after three days of round-robin play of four-ball competition advancing to the semi-finals on Sunday.Teams get one point for each win and a half for a tied match.This is the fourth time the tournament has been held after being cancelled in 2020 because of the COVID pandemic.Spain won the inaugural tournament in 2014, followed by the US (2016) and South Korea (2018).with AP"
    ]
}