{
    "articleURL": "/news/article-12061495/Reopening-two-immigration-detention-centres-delayed-six-months.html",
    "content": [
        "The reopening of two immigration detention centres has been delayed by at least six months in a fresh blow to Suella Braverman's borders crackdown.",
        "Mothballed facilities in Hampshire and Oxfordshire were due to be brought back into use by this summer.But they will not now be ready until early next year at the earliest, sources said.The delay casts doubt on the Government's plan to 'detain and swiftly remove' Channel migrants under new measures in the Illegal Migration Bill, which is currently before Parliament.There are just 2,500 existing beds in Britain's immigration detention centres, which means the system will not be able to keep pace with the number of small boat arrivals.",
        "Among last year's 45,700 total, 8,600 reached UK shores during August alone and the highest daily total was almost 1,300.Government tenders to run disused centres Campfield House, near Oxford, and Haslar, at Gosport, Hampshire, closed in January.Under the £450million, six-year contracts the centres were both due to be up and running by August. They will hold an extra 1,000 detainees in total.The Bill is due to face strong opposition in the House of Lords in the coming weeks but ministers still hope it will gain Royal Assent by the time Parliament's summer recess begins in July.Once its measures are in place, 'irregular' migrants such as small boat arrivals will be detained rather than placed in controversial and costly hotel accommodation.",
        "But the Home Office will need a major expansion of detention capacity if Prime Minister Rishi Sunak's pledge to remove Channel migrants is to be met.Prisons cannot be used because they are already full, with inmates being kept in police station cells under an emergency scheme.Sources said the reopening of the two additional detention centres is now delayed until early next year. Reasons for the hold-up are not known.However, ministers are hoping the threat of detention and removal – to Rwanda or another safe country – will deter migrants from crossing the Channel in the first place.So far this year, 6,549 small boat migrants have reached the UK, 15 per cent down on the 7,752 who had arrived by the same point last year.",
        "It is too early to say whether the Government's tough policies have already begun deterring migrants or whether the decline in numbers is down to the weather.A Home Office spokesman said: 'Immigration removal-centre capacity will not cause delays to the passage of the Illegal Migration Bill.'The Bill will enable us to remove people as quickly as possible, meaning they will be in detention for a shorter amount of time.'We are also working to build these new sites as a priority, while looking at finding alternative solutions to further increase detention capacity.'",
        "Meanwhile, new protections for free speech are in doubt as human rights reforms face the scrapheap.Former justice secretary Dominic Raab's Bill of Rights, published last year, would have ditched Labour's Human Rights Act and made free speech a 'trump card' over other competing rights.But his successor Alex Chalk is 'looking carefully' at the Bill, with scrapping it the most likely option, sources told The Times.The Bill was designed to block the creation of European-style privacy laws by unelected judges through the back door.However, in September Liz Truss' government shelved the legislation and said it was 'unlikely to progress in its current form'.It was resurrected when Mr Raab returned to Rishi Sunak's Cabinet, but is now in doubt again after he was forced to resign in the wake of a bullying inquiry.A Government source told the Times: 'Dom's departure sounded the death knell for the Bill of Rights. It won't be coming back, or at least not in any form that resembles the current Bill.'Another Government source described the legislation as a 'complete mess'."
    ]
}