{
    "articleURL": "/wires/reuters/article-12061381/UK-sales-growth-holds-steady-April-retailers-hope-better-summer.html",
    "content": [
        "By Suban Abdulla",
        "LONDON, May 9 (Reuters) - British retail sales growth held steady in April but high inflation meant shoppers were getting less for their money, and unsettled weather discouraged many from buying summer clothes, a British Retail Consortium survey showed on Tuesday.The BRC said spending at its members' stores increased 5.1% in annual terms last month, the same as in March and well above the 0.3% fall a year ago. The figures are not adjusted for inflation, so the rise in sales masked a large drop in volumes.\"While retail sales grew in April, overall inflation meant volumes were down for both food and non-food as customers continued to adjust spending habits,\" Helen Dickinson, the BRC's chief executive, said.\"Clothing sales underperformed as the poor weather left customers thinking twice before decking out their summer wardrobe,\" she added.Like-for-like retail sales - a measure favoured by equity analysts which adjusts for changes in retail space - were 5.2% higher on the year, similar to previous months.The Bank of England has forecast price rises will slow by the end of this year, but British households are currently contending with the highest inflation in western Europe, running at 10.1% in March, more than five times the Bank's 2% target.The BoE is expected to raise the key base rate to 4.5% next week and many economists think it is close to ending its run of rate hikes dating back to December 2021, although it remains concerned about inflationary pressure from the labour market. Financial markets are split 50-50 about whether British interest rates will peak at 4.75% or 5% later this year.",
        "However, Paul Martin, UK head of retail at accountants KPMG, who sponsor the figures, said consumer demand had so far been fairly resilient to high inflation and rising interest rates.\"Much hinges on whether soaring food inflation can be brought under control enough to allow consumers to comfortably start spending again on non-essential items,\" Martin said.Official figures showed food and non-alcoholic drink prices rose 19.1% in annual terms in March, the most since 1977.Separate data from Barclays, also published on Tuesday, showed consumer spending on payment cards rose by 4.3% year-on-year in April.Barclays said rising costs continued to put pressure on household finances, with two thirds of consumers saying they were looking for ways to cut weekly shopping costs by switching to lower-priced or discounted items.\"High inflation continues to squeeze real household disposable incomes and constrain consumption,\" Barclays economist Abbas Khan said. (Reporting by Suban Abdulla; editing by David Milliken)"
    ]
}