{
    "articleURL": "/wires/afp/article-12060207/Trump-civil-rape-trial-hears-closing-arguments.html",
    "content": [
        "A lawyer for Donald Trump's rape accuser urged a New York jury to find the ex-president liable for damages in closing arguments in a US civil trial Monday.",
        "\"No one, not even a former president, is above the law,\" E. Jean Carroll's attorney, Roberta Kaplan, told the Manhattan federal court.Carroll, 79, sued Trump last year alleging that he raped her in a New York department store in the mid-1990s.The former columnist for Elle magazine also claims that Trump defamed her when he accused her of lying after she went public with the allegation in 2019.Trump has not been criminally prosecuted and has repeatedly denied the allegations, often referring to Carroll as \"not my type.\"\"The truth is\" she \"was exactly his type,\" Kaplan said to the nine jurors who are due to begin deliberating on Tuesday.Trump's lawyers are due to make their closing arguments later Monday.Carroll's suit seeks unspecified damages for psychological trauma and other harm and asks that Trump retract his comments.Over two weeks of proceedings the court heard from Carroll and two other women who claimed they had been sexually assaulted by Trump decades ago.Trump denies all allegations of sexual misconduct and did not take the stand during the trial.No criminal prosecution can stem from the case but if the jury sides with Carroll then it will be the first time Trump has been held legally liable for an allegation of sexual assault.",
        "The case is one of several legal challenges facing the 76-year-old Republican as he seeks a return to the White House in next year's election.Last month, he pleaded not guilty in a criminal case related to a hush-money payment made to a porn star just before the 2016 vote.Trump is also being investigated over his efforts to overturn his 2020 election loss in the southern state of Georgia, his alleged mishandling of classified documents taken from the White House and his involvement in the storming of the US Capitol by his supporters on January 6, 2021."
    ]
}