{
    "articleURL": "/wires/pa/article-12055561/Head-anti-monarchy-protesters-released-16-hours-police-custody.html",
    "content": [
        "The chief executive of an anti-monarchy group who was among 52 people arrested on the day of the King’s coronation has been released after nearly 16 hours in police custody.",
        "Graham Smith was released by the Met Police around 11pm on Saturday, while the majority of his Republic colleagues continued to be held.Posting to Twitter, Mr Smith said there was “no longer a right to peaceful protest in the UK”.“I have been told many times the monarch is there to defend our freedoms. Now our freedoms are under attack in his name.”",
        "The Metropolitan Police has been heavily criticised over the detentions, with some campaign groups likening the “incredibly alarming” arrests to “something you would expect to see in Moscow, not London”.The force confirmed 52 people were arrested for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance around the coronation.Metropolitan Police Commander Karen Findlay acknowledged concerns about the arrest of protesters but defended Scotland Yard’s actions, saying: “Our duty is to do so in a proportionate manner in line with relevant legislation.”Also arrested on Saturday were members of Just Stop Oil and Labour for a Republic.",
        "The Met said it received information that protesters were “determined to disrupt” the coronation – including defacing public monuments with paint, breaching barriers and disrupting official movements.But campaigners said the protests were “peaceful”, describing the arrests as “a dangerous precedent for us as a democratic nation”.",
        "The force confirmed reports from Just Stop Oil that 13 demonstrators were detained on the Mall and six public nuisance arrests on St Martin’s Lane following protests from Republic.Three people were also apprehended in Soho, three at Wellington Arch and five on Whitehall on conspiracy to cause public nuisance, with another in Whitehall arrested for religiously aggravated behaviour likely to cause harassment.",
        "The Met said a further 14 people were detained in east London on suspicion of conspiracy to cause a public nuisance.Footage from the Mall showed the Just Stop Oil protesters being handcuffed and taken away by a heavy police presence.Animal Rising said a number of its supporters were apprehended on Saturday while at a training session “miles away from the coronation”.Nathan McGovern, spokesman for the campaign group, described the arrests as “nothing short of a totalitarian crackdown on free speech and all forms of dissent”.",
        "Human Rights Watch labelled the arrests “incredibly alarming”, adding: “This is something you would expect to see in Moscow, not London.”Amnesty International’s chief executive Sacha Deshmukh also raised concerns after police were reportedly given instructions to apprehend people with megaphones.Separately, Westminster Council cabinet member for communities and public protection Aicha Less said she was “deeply concerned” over reports of arrests of members of its Night Star volunteer team, who assist vulnerable people on the streets late at night.",
        "“We are working with the Metropolitan Police to establish exactly what happened, and in the meantime, we are in touch with our volunteers to ensure they are receiving the support they need,” she said."
    ]
}