{
    "articleURL": "/wires/reuters/article-12045373/Seouls-LGBT-festival-blocked-Christian-concert-outside-city-hall-organisers-say.html",
    "content": [
        "By Hyunsu Yim",
        "SEOUL, May 4 (Reuters) - Seoul's city government has effectively blocked South Korea´s largest annual LGBT festival from taking place outside city hall this year after granting a permit for a Christian youth concert instead, the LGBT event´s organisers said this week.Clashes over the Seoul Queer Culture Festival have become a yearly symbol of the battle for lesbian, gay, bisexual, transgender and queer rights in a country where same-sex marriage is not recognised and efforts to pass anti-discrimination laws face strong resistance from conservative religious groups and others.As in several past years, the festival's organisers jockeyed with religious groups in seeking permission to hold events in downtown Seoul on July 1. Since 2015, the event has been held in front of the city hall, except for 2020 and 2021 when pandemic rules prevented any gatherings.Yang Sun-woo, chief organiser of the Seoul Queer Culture Festival, said the city's move is an act of discrimination.\"Each year, we struggle to secure a venue to hold the event,\" she told Reuters.A concert for young people will take place outside the city hall on that day instead.That event is being hosted by the CTS Cultural Foundation, an organisation linked to local Christian broadcaster CTS, which has vocally opposed homosexuality and the festival.",
        "A representative for the CTS Cultural Foundation said that the timing was not aimed at blocking the LGBT festival.The Seoul city government did not immediately reply to a request for comment.The organising bodies for both events had requested to use the space on the same day. The decision was made by a citizen council, which includes some members of the city council. Since 2015, the LGBT festival has drawn thousands of attendees each summer to downtown Seoul, supported by human rights groups, university clubs, and foreign embassies. It routinely draws protests, and the police presence is often heavy. (Reporting by Hyunsu Yim; Editing by Sharon Singleton)"
    ]
}