{
    "articleURL": "/news/article-12057225/Prince-Edward-cracks-joke-Sophie-stun-choir-surprise-visit-Coronation-concert.html",
    "content": [
        " CORONATION LIVEBLOG: Click here to follow live updates throughout todayPrince Edward cracked a jokes as he and his wife Sophie made a surprise visit to a Coronation choir ahead of a special performance tonight at Windsor Castle.",
        "The Duke and Duchess of Edinburgh attended the final rehearsal of a choir specially assembled by celebrity choirmaster Gareth Malone to perform for the King in front of 20,000 people, while millions watch at home.Having watched the final rehearsal ahead of the concert, Prince Edward quipped: 'Brilliant, thank you very much. It sounds wonderful in here, I hope it sounds as good outside', which was met with laughter from the choir.He continued: 'It's just fantastic that you've come from so far and from such different singing backgrounds and you've all come together to sing this wonderful song.'It's just a wonderful, wonderful sound.'",
        "Earlier in the day the couple had visited a Coronation Big Lunch in Cranleigh, Surrey, with hundreds of people attending the commemorative event.Members of the 300-person choir only met each other yesterday and will sing tonight for King Charles and Queen Camilla in front of a packed crowd in the grounds of Windsor Castle.Coached by Gareth Malone, 47, who found fame on the Bafta award-winning series The Choir, it is made up of a band of amateur singers including refugee choirs, NHS choirs, LGBTQ+ singing groups and deaf signing choirs. Mr Malone said he hoped he can redeem himself during the Coronation Concert after he suffered a major technical issue when he performed in front of the King during a Royal Variety Performance.",
        "Speaking ahead of the event, Mr Malone said: 'I performed at the Royal Variety Performance in front of the then-Prince Charles and my backing track went completely wrong and so the whole thing fell apart and it was the worst ever performance I've ever had in my whole career.",
        "'For years I wouldn't use any technology and I'm hoping that I'm going to lay that ghost to rest this very night.'Mr Malone, along with radio presenter Amanda Holden, the deaf former EastEnder actor and 2021 Strictly winner Rose Ayling-Ellis and Strictly judge Motsi Mabuse, were part of a celebrity coaching line-up who mentored the choir.Ms Holden and Mr Malone revealed they drove around Croydon in London as they considered a number of options including classical songs and Disney tracks, before deciding on Emeli Sande's Brighter Days'It was a long, long list but it had to be a song that was about hope and about the future,' Mr Malone said.",
        "One choir member, Jake Bacon, from Somerset, said the chance to perform in front of the King as part of the Coronation Choir was 'in some ways a terrifying prospect.'He said: 'I'll be totally out of my comfort zone, but it’s also exciting and an honour.'Over 700 amateur singing groups applied to be a part of the Coronation Concert.",
        "Those chosen include Northern Ireland farmers, Hull NHS workers, London firefighters and cabbies, a Welsh male voice choir, Yorkshire’s only female South Asian choir and Gaelic singers from Scotland’s Western Isles. Katy PerryThe King and Queen and other members of the Royal Family including Prince William and his wife the Princess of Wales will join the public at the event to continue the celebrations after their crowning at Westminster Abbey on Saturday. Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls as well as classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video."
    ]
}