{
    "articleURL": "/news/article-12054467/Private-school-nagged-parents-sons-face-mask-didnt-mention-bullying-killed-him.html",
    "content": [
        "Robert and Rose Bronstein lost their son Nate, 15, to suicide in January 2022 after he was brutally bullied on social media The heartbroken parents claim they were never notified that their son had reported bullying to the schoolHowever, the Bronsteins claim the Dean of Student Bridget Hennessy notified them that Nate had been given a notice for not wearing his facial mask properly If you or someone you know is having suicidal thoughts or actions, please call the National Suicide Hotline at 988 A stricken mom and dad say a Chicago private school nagged them about their son not wearing a face mask properly - but failed to inform them of his torment at the hands of bullies who drove him to suicide.  ",
        "Robert and Rose Bronstein lost their son Nate, 15, to suicide in January 2022 after he was brutally bullied on social media by his classmates at the $43,000-a-year Latin School in Chicago. The couple - who are now suing the Latin School for $100 million - claim Dean of Students Bridget Hennessy was quick to inform them about Nate not wearing his mask properly during COVID.But they allege Hennessey made no such effort to tell them about the bullying they say Nate had disclosed to her. 'Their first instinct, their second instinct and third instinct was to protect themselves and their careers,' Robert said, according to Fox News. 'They could literally care less about the truth.' DailyMail.com has reached out to Hennessy for comment.  ",
        "They enrolled Nate at the school in 2021 after his institution was still opting for virtual learning and his parents wanted him to go back in-person. However, when he got to Latin School, he was immediately met with students who said he transfer for 'nefarious reasons,' questioned his vaccination status, and accused his parents of being anti-vaxxers, according to Rose.'They spread rumors that he was unvaccinated, which, of course, at the time was like The Scarlet Letter,' Rose said, adding that her son had in fact had the jab. ",
        "The 15-year-old boy eventually asked for a meeting with the dean at the Latin School to report that several students were bullying him via text messages and on Snapchat - one of which encouraged him to kill himself.The dean listened to Nate, a 10th-grader, but took no disciplinary action, according to a $100million lawsuit filed by his parents.His parents had already been planning to transferred Nate at the end of the year after hearing about his experience, but it had already been too late.  One month after his meeting, Nate was found hanged at his home. Prior to his death, his parents had encouraged him to join the junior varsity basketball team, hoping he'd make friends, but the bullying only got worse. When Latin played his old school, Nate posted a 'W' for win as his former school had taken the prize, which upset his teammates. ",
        "In a group chat of around 20 boys, messages like 'don’t show up tomorrow' and 'snake ass n****' floated his phone for hours. The family's lawsuit accuses the boy of even threatening to harm Nate. The day after Nate took his own life, other parents evidence of the bullying to Head of Students Randall Dunn, according to Fox News. However, according to the lawsuit, the school had not given this evidence to the Bronsteins until two weeks after their son's death. ",
        "'January 13th was the most horrific day of our lives. And to me, January 27, when we found out what had happened, it was like reliving that trauma all over again. It was absolutely shocking,' Rose said. 'Our son would still be alive today if Latin would have done their job and reported to us what had gone on within the school,' Rose Bronstein told CBS News last month. Nate hadn't been at the Latin School of Chicago, one of the most prestigious private schools in Chicago, for long, but he had a promising future.His parents described the 10th-grader as being a 'super-sharp, funny kid.''He definitely wanted to go to a college that had big time sports,' his father Robert Bronstein told CBS News. 'He loved to make people laugh, and laugh himself.'But the school was 'a toxic culture,' Rose said. 'So toxic that we lost our son from it.'According to the filing, Nate began experiencing and complaining about the bullying in September 2021.",
        "In one incident, Nate and a fellow student at Latin were talking about the upcoming Homecoming dance, but was told he was not allowed to join this student or the student's friends.Days later, Nate learned that the student had been spreading rumors around Latin that he was unvaccinated. The last time he was in the student's home, the student's mother told Nate, 'it must suck to have to take a Covid test every week' to which Nate replied, 'I'm vaccinated.",
        "'The student's mother sarcastically replied, 'yeah right.'Nate was, in fact, vaccinated, the suit claimed.The suit went on to expound on other incidents that stemmed from the rumors, like when Nate had been approached at school by students on two separate occasions with both students asking him if his parents were 'anti-vaxxers' following the incident with the student and student's mother.Nate's parents reached out to the student's parents and to the school to resolve the matter which only made matters worse because it led to continued harassment of Nate.Another incident detailed in the lawsuit alleges that around October or November, a Latin geometry teacher relentlessly accosted Nate in front of the entire class in response to the teen's comment about mathematical proofs and ultimately announced to the class that Nate was 'going nowhere in life.'The lawsuit also details text threats and Snapchat messages exchanged between Nate and school classmates, one of which encourages Nate to kill himself, and another was understood to be an indirect death threat.",
        "On December 13, 2021, Nate met with the dean of students to report the bullying, but the dean took no disciplinary action against any student. Nate's report was also kept from his parents, the suit claims.The Bronsteins told CBS News they were never told that Nate had asked for a meeting with his dean of students to report the harassment.",
        "'It had been kept from us, so that's why we were completely, completely taken off guard when this happened,' said Robert Bronstein.According to the Illinois General Assembly Public Act, every school in the state, including private schools, must have an anti-bullying policy.That policy must include information about how bullying should be reported and how it is to be investigated, and also that bullying incidents must be reported to the parents of those involved.The family stresses that they are not suing Latin for the money. Instead, they've pledged to donate any money gained through legal proceedings to anti-bullying and anti-suicide charities - with their goal of helping others in similar situations. If you or someone you know is having suicidal thoughts or actions, please call the National Suicide Hotline at 988. "
    ]
}