{
    "articleURL": "/wires/reuters/article-12044617/SK-Innovation-sees-solid-Q2-refining-margin-Chinas-reopening.html",
    "content": [
        "Unit's Q4 operating loss widens due to provisions for defects",
        "Plans to reflect U.S. tax credit into battery business(Adds details on results, SK Innovation comment)By Heekyong Yang and Joyce LeeSEOUL, May 4 (Reuters) - SK Innovation Co Ltd , owner of South Korea's top refiner SK Energy, said on Thursday it expects a \"solid\" refining margin in the second quarter, backed by China's reopening and the summer driving season.The company did not specify how much it expects its second-quarter refining margin, a key profit metric for refiners, to be.The company posted operating profit of 375 billion won ($281.6 million) for the first quarter ended March, versus 1.6 trillion won a year earlier. That compared with an average analyst forecast of 175 billion won compiled by Refinitiv SmartEstimate.Revenue rose 18% to 19.1 trillion won.SK Innovation, which has a total refining capacity of 1.115 million barrels per day (bpd) at its plants in Ulsan and Incheon, said it operated its facilities at 80% of capacity on average in the first quarter, compared with 77% for the whole of 2022.It said it planned to carry out routine maintenance scheduled for its No.5 crude distillation unit (CDU) and No. 1 residue fluid catalytic cracker (RFCC) in Ulsan in the second quarter.SK Innovation's battery unit SK On - which supplies electric vehicle (EV) batteries to Ford Motor Co, Volkswagen AG , and Hyundai Motor Co among others - accounted for about 17% of revenue in the first quarter.",
        "SK On said in a post-earnings conference call that it had revised down its operating loss for the fourth quarter by more than 30% to 338 billion won, reflecting provisions needed for defects in batteries supplied to Ford Motor.In March, Ford Motor, which uses batteries from SK On, recalled 18 electric trucks due to a battery cell manufacturing defect.Ford said it would replace the battery packs in the 18 vehicles but it was not aware of any fires or injuries related to the recall.SK On Chief Financial Officer Kim Kyunghun said the company had not yet decided when tax benefits from the U.S. Inflation Reduction Act would be reflected in the company's accounts.The company said it was discussing potential battery supply deals with clients in North America in light of the U.S. EV tax credits. SK On currently has battery joint ventures with Ford and Hyundai Motor Group in the United States.SK On's cross-town rival LG Energy Solution Ltd (LGES) last month offered an upbeat outlook for demand for EV batteries in North America due to the Inflation Reduction Act.Shares of SK Innovation were trading up 0.5% in morning trade, versus a 0.3% fall in the broader KOSPI index.($1 = 1,331.6200 won) (Reporting by Heekyong Yang and Joyce Lee; Editing by Muralikumar Anantharaman and Stephen Coates)"
    ]
}