{
    "articleURL": "/wires/reuters/article-12040099/Rays-Pirates-open-series-baseballs-best.html",
    "content": [
        "Harold Ramirez drove in two runs with a home run and a single as the Tampa Bay Rays downed the visiting Pittsburgh Pirates 4-1 in a clash of the top two teams in the major leagues Tuesday in St. Petersburg, Fla.",
        "Wander Franco added an RBI single and Jose Siri stole home for the Rays, who have won four of five.Tampa Bay's Javy Guerra, making his first appearance since being reacquired from Milwaukee Saturday, was used as an opener for his first career start. He pitched two-thirds of an inning, facing four batters and walking two.Josh Fleming entered and gave up one run and two hits before he left in the fifth after taking a comebacker off his left foot.Colin Poche (3-0) pitched one scoreless inning. Jason Adam pitched the ninth for his first save.Carlos Santana's sacrifice fly produced the only run for the Pirates, who had won 11 of 13 entering the series.Pittsburgh starter Roansy Contreras (3-2) gave up four runs and six hits in 5 1/3 innings, with three strikeouts and four walks.The Rays broke through in the fourth. Randy Arozarena doubled to left and went to third on Brandon Lowe's groundout. Ramirez drove in Arozarena with a base hit to right-center for a 1-0 lead.In the fifth, Ke'Bryan Hayes hit a comebacker clocked at 113 mph off the outside of Fleming's left foot for a single. Fleming tried a few practice pitches before leaving.Bryan Reynolds' double to left moved Hayes to third and, after Andrew McCutchen struck out, Hayes scored on Santana's sacrifice fly to center for a 1-1 tie.",
        "In the bottom of the fifth, Manuel Margot walked and moved to second on Siri's bloop single to center. An out later, Franco drove in Margot with a base hit to center for a 2-1 Tampa Bay lead. Siri and Franco pulled off a double steal, with Siri scoring to up it to 3-1.Ramirez led off the next inning with his sixth homer, to center, to make it 4-1.--Field Level Media"
    ]
}