{
    "articleURL": "/wires/ap/article-12059067/Ukraine-shoots-35-drones-Kyiv-attacks-kill-3.html",
    "content": [
        "KYIV, Ukraine (AP) - Russia enacted a major security clampdown before Tuesday´s annual commemorations marking the defeat of Nazi Germany in World War II, curbing the use of drones and ride-sharing services in its largest cities - even jet skis on the canals of St. Petersburg - amid its 14-month war with Ukraine.",
        "At least 21 Russian cities canceled May 9 military parades - the staple of Victory Day celebrations across Russia - for the first time in years, Russian media said.Regional officials blamed unspecified \"security concerns\" or vaguely referred to \"the current situation\" for the restrictions and cancellations. It wasn't clear whether their decisions were taken in coordination with the Kremlin.Last week, Russia - which hasn't witnessed the carnage endured by Ukraine during the invasion - was rattled by ambiguous official reports that two Ukrainian drones flew into the heart of Moscow under the cover of darkness and reached the Kremlin before being shot down.Media and local officials have blamed other sporadic drone attacks, especially targeting oil depots near the two countries´ border, on the Ukrainian military. Kyiv officials decline to comment on such claims.The fears of a possible Ukrainian attack appeared real, even though parades will go ahead in Russia´s largest cities, Moscow and St. Petersburg. But the use of drones has been banned in both cities before Victory Day.",
        "In St. Petersburg, often referred to as \"Venice of the north\" for its network of rivers and canals, using jet skis in certain parts of the city is prohibited through Wednesday. In the Russian capital, car-sharing services have been temporarily barred from the city center - drivers won't be able to start or finish rides there - amid preparations for the traditional Red Square parade.",
        "Initially, only one foreign leader was expected to attend this year´s Moscow parade - Kyrgyz President Sadyr Zhaparov, who arrived Monday and met with Putin for talks. That was one more foreign guest than last year, when no leaders went amid Putin´s broad diplomatic isolation over the war. The Kremlin at the time said it hadn't invited any because it wasn't a \"round-number anniversary.\"But on Monday officials announced that Uzbek President Shavkat Mirziyoyev and Tajik President Emomali Rakhmon would be joining Putin and Zhaparov at the festivities, along with Armenia´s prime minister, Nikol Pashinyan, and Kazakhstan´s leader, Kassym-Jomart Tokayev.Late Monday, Belarusian media said that country's president, Alexander Lukashenko, had arrived in Moscow to attend the parade. His presence is significant because Russia bases troops and arms being used in Ukraine in Belarus, and Putin said in March that tactical nuclear weapons would be placed there.Pashinyan and Tokayev were surprising choices for the guest list as they have in the past diverged from Putin's line. Kazakhstan and Armenia, though Russian allies, haven't publicly supported the war in Ukraine. In fact, Tokayev has spoken to Ukrainian President Volodymyr Zelenskyy on the phone several times throughout the invasion.Tokayev also told Putin last summer that Kazakhstan wouldn't recognize the Russian-occupied Ukrainian regions of Donetsk and Luhansk as independent states.",
        "Armenia is a member of the Russian-dominated Collective Security Treaty Organization, but Pashinyan snubbed Moscow earlier this year by refusing to host the alliance's military drills.May 9 is normally a bank holiday in Ukraine, too, but not this year, because of the war.Ukrainian President Volodymyr Zelenskyy said Monday he had sent a draft bill to parliament proposing a Day of Remembrance and Victory over Nazism in World War II on May 8, and a Day of Europe on May 9, further distancing Kyiv from Moscow.Zelenskyy equated Russia´s goals in Ukraine to those of the Nazis. \"Unfortunately, evil has returned,\" Zelenskyy said on Telegram. \"Although now it is another aggressor, the goal is the same - enslavement or destruction.\"European Commission President Ursula von der Leyen is due to travel to Kyiv on Tuesday to mark Europe Day together with Zelenskyy.Meanwhile, Ukrainian air defenses shot down 35 Iranian-made drones over Kyiv in Russia´s latest nighttime assault, as attacks across Ukraine by the Kremlin's forces killed four civilians, officials said Monday.Five people in the capital were injured by falling drone debris, according to Serhii Popko, head of the Kyiv City Military Administration. Air raid alarms sounded for more than three hours during the night.Drone wreckage struck a two-story apartment building in Kyiv´s western Svyatoshynskyi district, while other debris struck a car parked nearby, setting it on fire, Kyiv Mayor Vitali Klitschko said in a Telegram post.",
        "Russia has faced economic sanctions and limits on its supply chains because of its full-scale invasion of Ukraine in February 2022. Moscow has routinely turned to Iranian Shahed drones to bolster its firepower.Russian shelling of 127 targets across northern, southern and eastern parts of Ukraine killed three civilians, the Ukrainian defense ministry said. Russian long-range bombers launched up to eight cruise missiles at Ukraine´s southern Odesa region, authorities said. One person was killed and three others were wounded.Some of the Soviet-era cruise missiles fired against the Odesa region self-destructed or fell into the sea before reaching their targets, according to Ukrainian air force spokesman Yuri Ihnat.Meanwhile, Russian-installed authorities have begun evacuating residents of Tokmak, a town in the front-line southern Zaporizhzhia region, toward the Black Sea coast, Ukraine´s General Staff said.Those working for Kremlin-appointed local authorities, as well as children and educational workers, are being relocated to Berdyansk, a Russian-occupied seaside city about 100 kilometers (60 miles) to the southeast, it said.On Friday, the Russian-appointed governor of the partially-occupied Zaporizhzhia region ordered the evacuation of civilians from 18 settlements there, including Enerhodar, which neighbors the Zaporizhzhia nuclear power plant.Speculation has been mounting for months about the timing and focus of Ukraine´s expected spring offensive, with some analysts saying Kyiv might try to strike south into Zaporizhzhia in order to split Russian forces and cut Moscow´s land link to the occupied Crimean Peninsula.",
        "___Follow AP´s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
    ]
}