{
    "articleURL": "/tvshowbiz/article-12061447/Bindi-Irwin-gives-fans-health-update-endometriosis-surgery.html",
    "content": [
        "Bindi Irwin has offered fans an update on her decade-long battle with endometriosis, reassuring them she is doing well after undergoing surgery.",
        "The conservationist, 24, hosted a Q&amp;A on Instagram this week and was asked by her followers about her struggle with the debilitating condition.She was happy to report that after a long, hard road she was finally getting better.'It has been a very long journey and a lot of challenges to get to this point. I'm very thankful to be on the other side of the excision surgery. I can officially say I'm finally feeling better,' she said.Bindi went on to say she had been living in constant pain for years, and it wasn't until her daughter Grace Warrior was born in 2021 that she began looking for answers.",
        "'What was really hard was Grace not knowing what was wrong with her mum and not knowing what was wrong with me either,' she wrote. The Crikey! It's the Irwins star added that she was also diagnosed with irritable bowel syndrome, which meant she struggled to eat meals. Endometriosis is an often painful condition in which the tissue that lines the uterus also grows outside the uterus.",
        "There are a wide variety of symptoms: pain can affect areas ranging from the abdomen and lower back to the pelvis and vagina.Other symptoms include painful sexual intercourse, abnormal menstruation, nausea, bloating, and pain with bowel movements.",
        "Back in March, Bindi received an outpouring of support after she opened up about her horrific decade-long battle with the condition.",
        "Her family, friends, fans and fellow celebrities all sent their well-wishes as she recovered from surgery in New York City.Bindi posted a photo on Instagram of herself in hospital after the procedure, which was performed by endometriosis specialist Dr Tamer Seckin from the Seckin Endometriosis Center at Lenox Hill Hospital.Dr Seckin removed a total of thirty-seven lesions and a 'chocolate cyst' - a term for a cyst filled with menstrual blood. Bindi's brother Robert, 19, shared a heartfelt message to his older sister on Instagram, saying he was so proud of her. "
    ]
}