{
    "articleURL": "/wires/ap/article-12047145/Sandy-Le-n-recalls-harrowing-day-young-daughter-fell-pool.html",
    "content": [
        "HOUSTON (AP) - Sandy León has worn many jersey numbers during a long career in Major League Baseball.",
        "To understand the gravity of the No. 12 that adorns the catcher´s uniform this season with the Texas Rangers, he has to revisit the worst day of his life.That was Aug. 18, 2020. León, then playing for Cleveland, had just arrived by bus to the team hotel in Pittsburgh when he called his wife, Liliana, who was at home in Fort Myers, Florida, with their two small children.He was growing concerned after several unanswered calls. Then he began getting alerts from his home security system.\"That happens when somebody is making a lot of noise in the house, when the camera gets the sounds,\" León said.He logged onto an app where he can monitor the cameras in their home. He discovered a horrifying scene with Liliana and their then-15-month-old daughter, Nahomy.",
        "\"My wife was screaming, and she was praying,\" León recalled. \"She was saying words I didn´t understand. Then I saw (Nahomy) on the ground. She was purple. She was dead.\"Little Nahomy had wandered outside and slipped through an open gate to a backyard pool. She fell in the water trying to grab a rubber duck.When a frantic Liliana discovered her, she was motionless and floating face down in the pool. She jumped in, grabbed the girl and rushed her to the kitchen, where she called 911 while trying to revive her.",
        "Nahomy wasn´t breathing. The natural color had drained from her tiny body.\"She looked black, deeply black,\" Liliana said. \"I tried to open her eyes and it was blank. I don´t see her eyes. All the things that I looked on her, she was dying, she was dying, she was dying.\"Liliana hadn´t been trained in CPR, but she tried it anyway. She pressed on Nahomy´s chest again and again.\"I did CPR like five times, but nothing happened,\" Liliana said. \"She didn´t do anything.\"Getting no response, she abandoned her resuscitation efforts.Needing a miracle, she did the one thing she thought could help.\"The only one who could do something for her was God,\" Liliana said. \"So, I just prayed. Holy spirit help me. Holy spirit help me. Because I knew that my daughter was dying.\"She screamed that plea over and over while an ambulance raced to the house. Meanwhile, a terror-stricken Sandy desperately tried to comprehend what he was witnessing on that tiny screen.Liliana clutched her dying daughter´s tiny hand. It was then she noticed a small sign that gave her hope.\"I started to see in her fingers, at the bottom of her fingers, that it was a little bit pink,\" Liliana said. \"Then all of her body color started to change, and she began to look like a normal, live person.\"",
        "The mother wept as her daughter began showing signs of life.\"Then she started to breathe,\" she said. \"But it was really, really difficult and really, like, forced.\"Relief washed over Liliana.\"In that moment I was like, `Oh my God it happened,´\" she said. \"'She´s alive again.'\"Paramedics soon rushed in. As they worked on Nahomy, they peppered Liliana with questions about what happened.The big one: How long was she in the pool?Liliana didn´t know. But she told them there was a surveillance camera they could check.Nahomy was taken to a hospital, sedated and placed on a ventilator while the water was drained from her lungs.Still unable to reach Liliana, Sandy talked to a neighbor, who provided scant details.\"She told me (Liliana) brought her back and then the ambulance came,\" Sandy said.Sitting in that faraway room in Pittsburgh, Sandy was at a loss.\"I was having a hard time at the hotel,\" he said. \"I didn´t know what to do.\"Needing help, he called someone from the team. Officials chartered a private jet so he could get to his baby girl immediately.Liliana was sitting in the hospital room with Nahomy when authorities who saw the video - which the Leóns showed to The Associated Press - came in to talk to her about what they saw.",
        "\"They looked at me with that face that something really, really bad happened,\" she said. \"And they told me from the time she fell, until the time you picked her up was 12 minutes.\"Twelve minutes.\"When I heard them say that she was in the pool for that long, I broke down,\" Sandy said. \"I was like, `She´s not coming back.´\"Doctors warned the family that even if Nahomy awoke, she was almost certain to have brain damage because of how long she was in the water.They cautioned that she might not be able to walk, talk or do everyday things that people take for granted. The next 72 hours, they said, would be crucial in discovering what toll this had taken on Nahomy.Sandy arrived in Fort Meyers at about 8 p.m. that night. He was not prepared for what he saw.\"She was in the bed with all the tubes, and she still wasn´t breathing by herself,\" he said. \"It was tough. I didn´t know what to do. I went to my wife, and I just hugged her.\"The couple spent that night in the small room with their little girl as she fought for her life.A groggy Sandy woke up at 6:30 the next morning and couldn´t believe his eyes.",
        "\"I saw my daughter on her knees on the bed,\" he said. \"She´s awake. I don´t know what happened.\"By 10 that morning, she was breathing by herself. She started talking immediately when tubes were removed from her throat.\"She just said: `Papi you´re here,´\" Liliana recalled. \"He said: `Yes, I´m here baby, with you.´\"The Leóns were encouraged, but doctors still cautioned that Nahomy could have physical difficulties. But later that day, they removed the remainder of the tubes and put her on the floor.\"And she started running,\" Sandy said. \"The doctors couldn´t believe it.\"Nahomy spent a few days in the hospital recovering and undergoing tests to make sure she was OK. Everything came back clean, and the family got to go home. The medical team told the Leóns they couldn't explain Nahomy's recovery. A few called it a miracle.She´s perfectly healthy now and has no lingering effects from the harrowing experience. She´ll turn 4 later this month and revels in being a girly girl, loving anything that´s pink or sparkly.\"She really likes to think she is a princess,\" Liliana said. \"She really loves her dad. She´s a daddy´s girl. And she loves to sing, dance. She is a normal girl.\"The Leóns shared their story with the AP before news this weekend that the 2-year-old daughter of Tampa Bay Buccaneers linebacker Shaquil Barrett drowned in a swimming pool at the family's home.",
        "Last year, several family members were reminiscing about what happened to Nahomy and her remarkable recovery in a group text. Someone suggested to Sandy - a journeyman catcher who has now worn seven different numbers with six teams - that he change to No. 12 to mark that interminable time she spent in the pool.It wasn´t available last year in Minnesota. But when he joined the Rangers this season, he finally got the number that means so much to his family.And each time he buttons up that jersey and puts the No. 12 across his back, he says a little prayer to give thanks that the number didn´t take his beloved Nahomy away.\"I feel blessed and grateful every time I go onto the field knowing that she´s normal and nothing happened,\" he said. \"She has no idea, but it´s so special for me.\"___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}