{
    "articleURL": "/wires/afp/article-12059921/New-Indonesian-fund-promotes-Indigenous-role-climate-change-fight.html",
    "content": [
        "Indonesian civil groups launched on Monday a multimillion-dollar fund aimed at empowering Indigenous and local communities across the Southeast Asian country in the fight against climate change.",
        "The Nusantara Fund -- the first direct funding mechanism for indigenous and local communities in the country -- was launched by the environmental group Walhi, the Consortium for Agrarian Reform (KPA) and Indigenous people's NGO AMAN.It received $3 million in initial support from international philanthropic organisations such as the Ford Foundation and Packard Foundation.It is part of a $1.7 billion Forest Tenure Pledge that was first announced at COP26 in Glasgow, which recognised the important role of Indigenous and local communities in protecting tropical forests and their contribution to mitigate climate change.Indonesia, home to the world's third-largest rainforest area, claims to have made some progress by reducing the rate of primary forest loss for five straight years up to 2021, but total forest cover keeps receding.A study by Rainforest Foundation Norway found that Indigenous communities received about $2.7 billion of climate funds in forest management between 2011 and 2020 from donors and philanthropies, equivalent to less than 1 percent of official development assistance for climate change mitigation and adaptation over the same period.The Nusantara Fund was launched to help correct such an imbalance in climate fund distribution, said Ford Foundation president Darren Walker.\"This fund has been designed in part to respond to that imbalance and to demonstrate the efficacy of the idea that when you provide resources to local communities, you are more likely to have the impacts that we need to address the climate challenge,\" Walker told AFP Monday.",
        "The fund seeks to address the needs of the communities in a bottom-up approach, looking to them to identify challenges that they face and solutions, said WALHI director Zenzi Suhadi.\"We create the mechanism of the Nusantara Fund directly to the local community and indigenous people,\" said Suhadi.AMAN secretary-general Rukka Sombolinggi added that villagers \"know best\" the challenges they face and how they want to tackle them.The founders of the fund seek to attract up to $20 million in investment in the next 10 years to help map more than 20 million hectares of Indigenous territories, and increase the protection and registration of 7.8 million hectares on top of the recognised land, among other targets."
    ]
}