{
    "articleURL": "/wires/reuters/article-12054669/Soccer-Chelsea-stop-rot-win-Lampard.html",
    "content": [
        "BOURNEMOUTH, England, May 6 (Reuters) - Chelsea claimed their first win under interim manager Frank Lampard with a 3-1 victory at Bournemouth in the Premier League on Saturday to snap a nine-match winless run in all competitions.",
        "Late goals from Benoit Badiashile and Joao Felix helped Chelsea move up to 11th with 42 points while Bournemouth slipped to 14th, three points behind the London side having played a game more.It was a welcome win for Lampard who had lost his first five games in charge during his second stint while it was also Chelsea's first win since early March.\"It feels great, we just wanted to put in a performance today. We haven't been good enough recently so this was an important game for us. I think we performed well and deserved the win,\" Conor Gallagher told Premier League Productions.\"Hopefully we can move forward and take confidence from it. It felt much better, everyone seemed more confident and we controlled the game. It was a good team performance and we just need to carry it on now.\"Bournemouth had two opportunities to take the lead in the first five minutes but the Chelsea defence stood firm before Gallagher scored with a well-timed run and header to give the visitors the lead.But Chelsea were pegged back when Bournemouth played a delightful sequence of one-touch passes for Ryan Christie to set up Matias Vina, who curled his shot from the edge of the box past Kepa Arrizabalaga and into the top corner.",
        "With Chelsea dominating early in the second half, Bournemouth's Dominic Solanke went down in the box after a challenge from Thiago Silva but they were denied a penalty after VAR ruled the Brazilian got the ball first.The decision not to award a penalty seemed to galvanise the home side who forced Kepa into a save moments later from another flowing move while an unmarked Dango Ouattara saw his header from a corner go over the bar.But in the 82nd minute, Chelsea capitalised on Bournemouth's weakness on set-pieces this season when Hakim Ziyech delivered the ball from a free kick to the far post where Badiashile beat Neto to score his first goal for the club.That gave Chelsea a lift and they quickly made it 3-1 to seal the three points when Raheem Sterling went on a driving run into the box before poking the ball to fellow substitute Felix who finished with ease. (Reporting by Rohith Nair in Bengaluru, editing by Ed Osmond and Pritha Sarkar)"
    ]
}