{
    "articleURL": "/tvshowbiz/article-12042777/Jane-Fonda-says-happiest-Ive-85.html",
    "content": [
        "Jane Fonda expressed that she was 'the happiest I've ever been' at 85 years of age in an interview with People that was released on Wednesday.",
        "The performer spoke about various topics during the sit-down, including her experience of aging and working through hardship.The Academy Award-winning actress, who previously stated that exercise is vital to remaining able to make love, also discussed her time working on the upcoming comedy feature Book Club: The Next Chapter. During the interview, Fonda stated that, although she had faced much adversity over the years, she had remained steadfast in her ability to work through it all. 'There's been tragedy and hard things in my life. But I've never succumbed to them. I've been resilient all my life,' she said.",
        "The Grace and Frankie star then spoke about how she never expected to wind up as a performer during her younger years.'I'm not one of those who grew up wanting to perform, wanting to be an actor. I didn't think that I had talent,' she stated.Fonda also discussed her relationship with her father, Henry, which she admitted was difficult at times. She recalled: 'He never brought joy home. I never felt that he got joy... it never manifested when he came home, so it was not like \"oh my God, I want what he's got.\"' The actress subsequently spoke about what she wished she could have been told during her early years as a performer.",
        "'I wish that somebody had said to me, \"Don't give up, keep going, it'll get better,\" because I saw no future. I didn't think that I would live past 30. That's why...I don't take anything for granted,' she said.Fonda also opened up about how she had made health a priority in the later years of her life, and stated: 'That's what makes me seem younger than my numerical age is because I'm healthy. And I have good posture!'The Barbarella star went on to discuss Book Club: The Next Chapter, which serves as a sequel to its 2018 predecessor and also stars Diane Keaton, Candice Bergen and Mary Steenburgen.",
        "The performer stated that she was happy to have been able to reunite with her friends and found the experience to have been 'a dream come true.She stated: 'It's everything I imagined women's friendships can be...We're friends and we love working together and we help each other when we need to.'  Fonda added: 'When I was younger, there was this assumption that women were kind of catty and four stars working together wouldn't work because they'd be competing, and it's just not true.'The upcoming romantic comedy feature is currently scheduled to be released on May 12. "
    ]
}